{"url": "en.wikipedia.org/wiki/Lindsay_Lohan", "text": "American actress and pop singer\n\nLindsay Dee Lohan ( ; born July 2, 1986[4]) is an American actress, singer, songwriter, producer and entrepreneur.[5] Born and raised in New York, Lohan was signed to Ford Models as a child. Having appeared as a regular on the television soap opera Another World at age 10, her breakthrough came in the Walt Disney Pictures film The Parent Trap (1998). The film's success led to appearances in the television films Life-Size (2000) and Get a Clue (2002), and the big-screen productions Freaky Friday (2003) and Confessions of a Teenage Drama Queen (2004).\n\nLohan's early work won her childhood stardom, while the sleeper hit Mean Girls (2004) affirmed her status as a teen idol. After starring in Herbie: Fully Loaded (2005), Lohan quickly became the subject of intense media coverage due to a series of personal struggles and legal troubles, as well as a number of stints in rehabilitation facilities due to substance abuse. This period saw her lose several roles and had significantly impacted her career and public image negatively. Thereafter, she appeared in films, including A Prairie Home Companion (2006), Just My Luck (2006), Bobby (2006), and Chapter 27 (2007). In the 2010s, she appeared in few films, among the most notable being Machete (2010), Liz & Dick (2012), and The Canyons (2013). Lohan then appeared on a series of television shows including the docu-series Lindsay (2014), the British series Sick Note (2018), the MTV reality show Lindsay Lohan's Beach Club (2019), and The Masked Singer Australia (2019-present). She also made her stage debut in the London West End production of Speed-the-Plow (2014–15).\n\nLohan rose to prominence in the music industry under Casablanca Records, releasing two studio albums, the platinum-certified Speak (2004) and gold-certified A Little More Personal (Raw) (2005). Lohan dabbled in fashion, beginning a line of her own titled 6126 and briefly serving as artistic advisor for Emmanuel Ungaro in 2009. Since 2016, she has developed a series of nightclubs and resorts in Greece.\n\nEarly life\n\nLindsay Lohan was born on July 2, 1986, in The Bronx borough of New York City,[4][6] and grew up in Merrick and Cold Spring Harbor on Long Island, New York.[7] She is the eldest child of Dina,[8] and Michael Lohan.[9] Her father, a former Wall Street trader, has been in trouble with the law on several occasions,[10][11] while her mother is a former singer and dancer.[12] Lohan has three younger siblings, all of whom have been models or actors: Michael Jr., who appeared with Lohan in The Parent Trap, Aliana, known as \"Ali\", and Dakota \"Cody\" Lohan. Lohan is of Irish and Italian heritage, and she was raised as a Catholic.[13][dead link] Her maternal antecedents were \"well known Irish Catholic stalwarts\" and her great-grandfather, John L. Sullivan, was a co-founder of the Pro-life Party on Long Island.[14] Lohan attended Cold Spring Harbor High School and Sanford H. Calhoun High School, where she did well in science and mathematics, until grade 11, when she started homeschooling.[13][dead link][15] Lohan is a natural redhead.[16]\n\nLohan's parents married in 1985, separated when Lindsay was three, and later reunited.[10][17] They separated again in 2005 and finalized their divorce in 2007.[18][19]\n\nCareer\n\n1989–99: Career beginnings\n\nLohan in 2002\n\nLohan began her career as a child model with Ford Models at the age of three.[20][21] She modeled for Calvin Klein Kids and Abercrombie, and appeared in over 60 television commercials for brands like Pizza Hut and Wendy's, as well as a Jell-O spot with Bill Cosby.[20][21] By the age of 10, when Lohan played Alexandra \"Alli\" Fowler in the television soap opera Another World, Soap Opera Magazine said she was already considered a show-business veteran.[20][21][22]\n\nLohan remained in her role on Another World for a year, before leaving to star in Disney's 1998 family comedy The Parent Trap, a remake of the 1961 movie. She played dual roles of twins, separated in infancy, who try to reunite their long-divorced parents, played by Dennis Quaid and Natasha Richardson.[13][20] The film earned $92 million worldwide, and received largely positive reviews.[23][24] Lohan received unanimous acclaim for her debut performance. Critic Kenneth Turan called Lohan \"the soul of this film as much as Hayley Mills was of the original,\" going on to say that \"she is more adept than her predecessor at creating two distinct personalities.\"[25] The film won Lohan a Young Artist Award for best performance in a feature film as well as a three-film contract with Disney.[20][21][26] At the age of 14, Lohan played Bette Midler's daughter in the pilot episode of the short-lived series Bette, but she resigned her role when the production moved from New York to Los Angeles.[13][27]\n\n2000–03: Success with Disney films\n\nContinued work with Disney\n\nLohan starred in two made-for-TV movies: Life-Size alongside Tyra Banks in 2000, and Get a Clue in 2002.[20][21] In 2003, Lohan starred alongside Jamie Lee Curtis in the 2003 remake of Disney's family comedy Freaky Friday, playing a mother and daughter who switch bodies and have to take on each other's roles. At Lohan's initiative, her character was rewritten and changed from a Goth style to be more mainstream.[28] Her performance was once again met with significant praise. Critic Roger Ebert wrote that Lohan \"has that Jodie Foster sort of seriousness and intent focus beneath her teenage persona.\"[29] Freaky Friday earned Lohan the award for Breakthrough Performance at the 2004 MTV Movie Awards and, as of 2015 , it remained her most commercially successful film, earning $160 million worldwide as well as an 87 percent approval rating on Rotten Tomatoes.[30][31][32]\n\nMusic beginnings\n\nEmilio Estefan and his wife, Gloria Estefan, signed Lohan to a five-album production deal in September 2002.[33] Lohan landed the role as the daughter in Disney's remake, Freaky Friday, also that month, which required her to learn how to play the guitar and to sing. Lohan recorded a song for the film, \"Ultimate\", which was released to Radio Disney to help promote the film. The song peaked at number 18 on Radio Disney's Top 30. Lohan announced that the song was separate from her singing career since many teen idols such as Hilary Duff and Raven-Symoné were expanding their careers from acting to singing. In 2003, Lohan recorded four songs that were released for the soundtrack to Lohan's film, Confessions of a Teenage Drama Queen, including a Radio Disney hit, \"Drama Queen (That Girl)\".\n\nShe had begun working with Diane Warren and Randy Jackson, who were going to help write and produce her album. Diane Warren wrote the song \"I Decide\" for Lohan, which was originally going to be on her album.[34] When Lohan decided not to collaborate with Warren and Jackson, \"I Decide\" was instead released on the soundtrack to the film The Princess Diaries 2: Royal Engagement and on to Radio Disney.\n\n2004–06: Status as teen idol and music releases\n\nDebut album\n\nLohan began writing the tracks on her album in April 2004. \"I write a lot of lyrics and I'm involved in the producing process, because it's like, if I'm singing it, I want it to be something that I can relate to,\" Lohan said. \"I'm just trying to feel it out and see where it goes. I'm playing guitar and I also love to dance, so [the music will be] somewhere along the lines of hip-hop and rock.\"[35]\n\nLohan's debut album, Speak, was released in the United States on December 7, 2004. The album was the first high-seller from Casablanca Records in several years, selling 1,000,000 units in the United States. The album received mostly negative reviews, with critics commenting that Lohan \"isn't a bad singer, but not an extraordinary singer either.\"[36] In the United States, the album peaked at number four on the Billboard 200, selling 261,762 copies in its first week.[37] In Germany the album debuted at number 53 and took four weeks to complete its chart run. The first two singles from Speak, \"Rumors\" and \"Over\", were both successes, with \"Over\" topping the Bubbling Under Hot 100 Singles, where it stayed for three weeks. The song also did well internationally in countries such as Australia, Ireland, and the United Kingdom. \"Rumors\" peaked at number six on the Bubbling Under Hot 100 chart and also did well in Australia and Germany, where it reached number 14. The music video for \"Rumors\" was nominated for Best Pop Video at the 2005 MTV Video Music Awards. Both songs received heavy airplay on MTV's Total Request Live. The final single, \"First\", was released to help promote Lohan's film, Herbie: Fully Loaded. The song earned small success in Australia and Germany. Lohan promoted the album by performing the songs in a number of live appearances. A tour of Taiwan was planned, but later scrapped.[38]\n\nBox-office success\n\nLohan attending a fashion show in 2006.\n\nIn 2004, Lohan had lead roles in two major motion pictures. The first film, Disney's teen comedy Confessions of a Teenage Drama Queen, earned a domestic box office total of $29 million, with Brandon Gray of Box Office Mojo commenting that it was \"well above expectations as it was strictly for young girls\".[39] But the film did not meet with critical acclaim.[40] Robert K. Elder of the Chicago Tribune wrote that \"though still a promising star, Lohan will have to do a little penance before she's forgiven for Confessions.\"[41] Her second lead role that year, in the teen comedy Mean Girls, marked Lohan's first movie independent of Disney. Based in part on the non-fiction book Queen Bees and Wannabes, the film stars Lohan as a previously homeschooled 16-year-old learning to navigate the social cliques of a public high school. It was a critical and commercial success, grossing $129 million worldwide and, according to Brandon Gray, \"cementing her status as the new teen movie queen\".[39][42][43] Mick LaSalle from the San Francisco Chronicle wrote that \"Lohan is sensitive and appealing, a solid locus for audience sympathy.\"[44] David Rooney from Variety said that \"Lohan displays plenty of charm, verve and deft comic timing.\"[45] Lohan received four awards at the 2004 Teen Choice Awards for Freaky Friday and Mean Girls, including Breakout Movie Star.[46] Mean Girls also earned her two awards at the 2005 MTV Movie Awards.[47]\n\nWith Mean Girls, Lohan's public profile was raised significantly. Vanity Fair described how she became a household name. Paparazzi began following her and her love life and partying became frequent targets of gossip sites and the tabloid media.[48][49] Following the film, which was scripted by former \"Not Ready for Prime Time Actress\" Tina Fey and featured several other veterans of Saturday Night Live's \"Not Ready for Prime Time Company\", Lohan hosted the show three times between 2004 and 2006.[20] In 2004, when Lohan was 17, she became the youngest host of the MTV Movie Awards and in 2006 she hosted the 2006 World Music Awards.[50][51]\n\nLohan returned to Disney in 2005, starring in the comedy Herbie: Fully Loaded, the fifth film in the series with the anthropomorphic car Herbie. Fully Loaded earned $144 million worldwide, but it received mixed reviews.[52][53] Stephen Holden of The New York Times called Lohan \"a genuine star who ... seems completely at home on the screen\", while James Berardinelli wrote that \"as bright a starlet as she may be, Lohan ends up playing second fiddle to the car.\"[54][55] In 2005, Lohan became the first person to have a My Scene celebrity doll released by Mattel. She also voiced herself in the animated direct-to-DVD film My Scene Goes Hollywood: The Movie, based on the series of dolls.[56]\n\nSecond album\n\nLohan's second album, A Little More Personal (Raw), was released in December 2005. It peaked at number 20 on the Billboard 200 chart, and was eventually certified Gold.[57][58] Lohan co-wrote most of the songs on the album, which received a mixed critical response.[59][60] Slant Magazine called it \"contrived ... for all the so-called weighty subject matter, there's not much meat on these bones.\"[60] Lohan herself directed the music video for the album's only single, \"Confessions of a Broken Heart (Daughter to Father)\", which features her sister Aliana Lohan.[61] The video is a dramatization of the pain Lohan said her family suffered at the hands of her father.[61] It was her first song to chart on the Billboard Hot 100, peaking at number 57.[62]\n\n2006–08: Interruptions and mature film roles\n\nEarly troubles\n\nLohan's next widely released film, the romantic comedy Just My Luck, opened in May 2006 and, according to Variety, earned her over $7 million.[63] The opening weekend box office takings of $5.7 million \"broke lead actress Lindsay Lohan's winning streak\" according to Brandon Gray.[64] The film received poor reviews and earned Lohan her first Golden Raspberry nomination for Worst Actress.[65][66] Following Just My Luck, Lohan focused on smaller roles in more mature, independent movies.[67] Robert Altman's ensemble comedy A Prairie Home Companion, based on humorist Garrison Keillor's works, in which Lohan co-stars with Meryl Streep and Lily Tomlin, had a limited release in June 2006. Peter Travers wrote for Rolling Stone that \"Lohan rises to the occasion, delivering a rock-the-house version of 'Frankie and Johnny.'\"[68] Co-star Streep said of Lohan's acting: \"She's in command of the art form\" and \"completely, visibly living in front of the camera.\"[69] The Emilio Estevez ensemble drama Bobby, about the hours leading up to the Robert F. Kennedy assassination, was released in theaters in November 2006. Lohan received favorable comments for her performance, particularly a scene alongside Sharon Stone.[70][71] As part of the Bobby ensemble cast, Lohan was nominated for a Screen Actors Guild Award.[72]\n\nMature roles and legal problems\n\nLohan's next appearance was in Chapter 27 as a John Lennon fan who befriends Mark David Chapman, played by Jared Leto, on the day he murders Lennon. Filming finished in early 2006, but the film was not released until March 2008 due to difficulties in finding a distributor.[73][74][75] In May 2007, the drama Georgia Rule was released. In the film, Lohan portrays an out-of-control teenager whose mother (Felicity Huffman) brings her to the house of her own estranged mother (Jane Fonda). Owen Gleiberman of Entertainment Weekly wrote that \"Lohan hits a true note of spiteful princess narcissism.\"[76] During filming in 2006, Lohan was hospitalized, her representative saying \"she was overheated and dehydrated\".[77] In a letter that was made public, studio executive James G. Robinson called Lohan \"irresponsible and unprofessional\". He mentioned \"various late arrivals and absences from the set\" and said that \"we are well aware that your ongoing all night heavy partying is the real reason for your so-called 'exhaustion.'\"[78] In 2007, Lohan was cast in the film Poor Things,[79][80][81][82] which she ultimately lost.[83] In early January 2007, production on the film I Know Who Killed Me was put on hold when Lohan underwent appendix surgery.[84][85][86] While Lohan was in rehab, she continued shooting the film, returning to the facility at night.[87][88] Shortly thereafter, Lohan withdrew from a film adaptation of Oscar Wilde's A Woman of No Importance, her publicist stating that Lohan needed to \"focus on getting better\".[89][90] Lohan was replaced in The Edge of Love in April 2007, shortly before filming was to begin, with the director citing \"insurance reasons\" and Lohan later explaining that she \"was going through a really bad time then.\"[91][92][93]\n\nIn the wake of her second DUI arrest[clarification needed], Lohan withdrew from a scheduled appearance on The Tonight Show with Jay Leno in which she had been due to promote I Know Who Killed Me, a low-budget psychological horror-thriller in which she stars as a stripper with a dual personality.[94] The film premiered in July 2007 to what Entertainment Weekly called \"an abysmal $3.5 million.\"[95] It earned Lohan dual Golden Raspberry awards for Worst Actress, with Lohan coming first and second, tying with herself.[96] Hollywood executives and industry insiders commented that it would be difficult for Lohan to find employment until she could prove that she was sober and reliable, citing possible issues with securing insurance.[97][98][99]\n\n2008–11: Continued delays\n\nLohan (center) at the Cynthia Rowley fashion show in 2011\n\nIndependent films\n\nIn May 2008, Lohan made her first screen appearance since I Know Who Killed Me, on ABC's television series Ugly Betty.[100] She guest starred in four episodes as Kimmie Keegan, an old schoolmate of the protagonist Betty Suarez.[101] In the comedy Labor Pains, Lohan plays a woman who pretends to be pregnant. During the shoot, Lohan's manager worked with the paparazzi to encourage the media to show her work, as opposed to partying.[102] It was originally planned for a theatrical release, but instead appeared as a TV movie on the ABC Family cable channel in July 2009, \"a setback for the star\" according to Variety.[103] The premiere received 2.1 million viewers, \"better-than-average\" for the channel according to E! Online.[104] Alessandra Stanley of The New York Times wrote that \"this is not a triumphant return of a prodigal child star. ... [Labor Pains] never shakes free of the heavy baggage Ms. Lohan brings to the role.\"[105] Lohan was a guest judge on US TV style contest Project Runway sixth-season premiere episode, which aired in August 2009.[106]\n\nLohan narrated and presented the British television documentary Lindsay Lohan's Indian Journey, about human trafficking in India. It was filmed during a week in India in December 2009, and transmitted on BBC Three in April 2010.[107][108] The BBC was criticized for having hired Lohan, and while reviewers called the documentary compelling, they also found Lohan's presence to be odd and distracting.[109][110][111] Lohan said: \"I hope my presence in India will bring awareness to the really important issues raised in making this film.\"[112] In April 2010, Lohan was let go from the film The Other Side where she had been set to star, with the director saying she was \"not bankable\".[49][113][114]\n\nUnfinished third studio album\n\nFollowing a switch to Universal Motown, Lohan began working on a third album, tentatively titled Spirit in the Dark, in late 2007.[1][115][116] In May 2008, the single \"Bossy\" was released onto digital outlets, and reached number one on the US Billboard Hot Dance Club Play chart.[117][118] The song was meant to serve as the lead single from the album. Later that year, Lohan said that work on the album had stalled and that she wanted to avoid the stress of working on movies and music at the same time.[119]\n\nIn June 2010, Lohan was the subject of a fashion shoot in the photographer docu-series Double Exposure on Bravo.[120] Robert Rodriguez's action exploitation film Machete opened in September 2010. In the film, Lohan's character takes drugs, is naked in much of her appearance, and later dons a nun's habit while toting a machine gun. Its critical reviews were mixed. The Washington Post described her character as \"a campier, trampier version of herself – or at least her tabloid image.\"[121] Premiere.com said she was \"terrible\" while Variety called it \"her best work in some time\".[122][123] Because of her rehabilitation and legal engagements, Lohan did not participate in promotion of the movie.[124][125][126] Lohan filmed a sketch where she is dressed as Marilyn Monroe for Inappropriate Comedy in 2010. The film had issues finding a distributor and was not released until 2013, when it was met with poor box office and critical reception.[127][128][129] Lohan appeared on the October 2010 cover of Vanity Fair. She told the magazine: \"I want my career back\" and \"I know that I'm a damn good actress.\"[49][127][130]\n\n2012–14: Television work and stage debut\n\nAttempted comebacks\n\nLohan at will.i.am 's album release party in 2012.\n\nLohan had not appeared on Saturday Night Live since 2006, when she hosted the show for the fourth time in March 2012.[131] Her appearance received mixed to negative reviews. Critics appreciated the self-deprecating references to her personal troubles, but also commented that she largely played a supporting role.[132] The episode had the second highest ratings of the season with 7.4 million viewers.[133][134] In May 2012, Lohan appeared briefly, as a celebrity judge, on the television series Glee, in the episode \"Nationals\".[135] Lohan stars as a surfer in the art film First Point by artist Richard Phillips. It debuted at Art Basel in June 2012 and features a score by Thomas Bangalter from Daft Punk. Comments from critics on Lohan's work were mixed.[136][137]\n\nLow-budget films\n\nLohan starred as Elizabeth Taylor in the biographical made-for-TV movie Liz & Dick, which premiered on the Lifetime cable channel in November 2012. Reviews of Lohan's performance were largely, but not unanimously, negative. The Hollywood Reporter said she was \"woeful\" while Variety called her \"adequate\".[138][139] Entertainment Weekly described the premiere ratings of 3.5 millions as \"a little soft\".[140] During the production, paramedics were called to Lohan's hotel room, treating her for exhaustion and dehydration.[141][142][143] In April 2013, the horror comedy Scary Movie 5 was released, where Lohan appears as herself alongside Charlie Sheen in the opening sketch. While the movie itself was panned by critics, a few reviewers found Lohan's and Sheen's to be one of the better scenes.[144][145][146] Lohan also guest-starred as herself in an April 2013 episode of Sheen's comedy series Anger Management.[147]\n\nIn August 2013, just days after Lohan left rehab[clarification needed], The Canyons was released, an independent erotic thriller directed by Paul Schrader and written by Bret Easton Ellis.[148][149] It was made on a low budget, most of which was gathered through online fund raiser Kickstarter. Lohan received $100 a day and a share of the profits, and she was also credited as a co-producer.[141] The New York Times Magazine described Lohan as difficult to work with, and the shoot as fraught with conflict between Lohan and Schrader.[141] Lohan and her co-star, adult-film actor James Deen, portray an actress and a producer in a volatile relationship. Reviews for the film were generally poor, but several critics praised Lohan's performance. The New Yorker said she was \"overwrought and unfocused\" while Variety called her \"very affecting\" and Salon described her as \"almost incandescent\".[150][151][152] The same month Lohan filled in for Chelsea Handler as host of the cable talk show Chelsea Lately. She received mostly positive reviews for her appearance and the show garnered its best ratings of the year.[153][154][155]\n\nOprah shows and interview\n\nThe 8-part docu-series Lindsay was transmitted in March and April 2014 on Oprah Winfrey's OWN cable network. The series followed Lohan's life and work as she moved to New York City after leaving rehab. In the final episode, Lohan said that she had had a miscarriage which had interrupted filming of the series.[156] The premiere had 693,000 viewers, described as \"so-so\" by The Hollywood Reporter.[157] The ratings then slipped and the finale only had 406,000 viewers.[158][159] New York Daily News called the series \"surprisingly routine\", Variety described it as boring, while Liz Smith said it was \"compelling\" and \"usually painful to watch\".[160][161][162] In April 2014, Lohan guest-starred in an episode of the CBS sitcom 2 Broke Girls.[163][164] Around this time, Lohan had also announced and began promoting a film she was set to star in titled Inconceivable, which was never produced for unknown reasons.[165]\n\nLohan made her stage debut in October 2014, starring in the London West End production of David Mamet's Speed-the-Plow, a satire about the movie business. She portrayed Karen, the secretary of a Hollywood executive, in a role originally played by Madonna. Reviews of Lohan's performance were mixed, with the Associated Press describing critical reception overall as \"lukewarm\".[166] The Stage said she was \"out of her league\" while The Times wrote that she \"can act a bit\" and The Guardian said she \"holds the stage with ease\".[167][168] In December 2014, Lohan introduced Miley Cyrus before her set at Dick Clark's New Year's Rockin' Eve.[169]\n\nIn 2015, the English band Duran Duran announced that Lohan was featured on the song \"Danceophobia\" from their fourteenth studio album, Paper Gods.\n\n2018–present: Return to music and television\n\nBeach Club in 2019. Lohan during a confessional scene inin 2019.\n\nTelevision roles\n\nIn June 2015, Lohan filmed her the supernatural thriller, Among the Shadows.[170] The film saw a series of delays with its release and was eventually listed for sale at the European Film Market at the Berlin International Film Festival in February 2018.[171] It was released on March 5, 2019, by Momentum Pictures.[172] In October 2016, Lohan opened her first nightclub, in collaboration with her ex-business partner Dennis Papageorgiou, named \"Lohan Nightclub\", in Athens, Greece.[173]\n\nIn July 2018, the second season of Sick Note —in which Lohan has a recurring role— premiered on Sky One.[174] In May 2018, she opened a resort on the Greek island Mykonos called \"Lohan Beach House Mykonos\" and later her second resort in Ialisos Beach, Rhodes, called \"Lohan Beach House Rhodes\".[175][176] In July 2018, People magazine revealed that Lohan had signed on to star in an MTV reality series, Lindsay Lohan's Beach Club focusing on the Mykonos Beach House and her career and business ventures.[177] The series premiered on January 8, 2019 on MTV.[178] The show was cancelled after one season.[179] As of June 2019, the beach club is no longer open in Mykonos.[180][181]\n\nIn July 2019, it was announced that Lohan will be one of the guessers on the panel of the Australian edition of Masked Singer.[182] It was announced on October 10 that Lohan will return for season two of The Masked Singer.[183]\n\nReturn to music\n\nIn June 2019, Page Six reported that Lohan had re-signed with Casablanca Records to record and release her third studio album, along with \"a couple of soundtracks\".[184] In July, Lohan confirmed signing a joint deal with Casablanca and Republic Records. In August 2019, a snippet of a song titled \"Xanax\" was premiered by radio host Kris Fade on Virgin Radio Dubai.[185] Lohan then teased her song again in late-December, announcing in January that her first album in 15 years would be released at the end of February.[186][187] Though not released when anticipated, Lohan announced on April 1st that she was releasing the lead single titled \"Back to Me\" Friday 3rd.[188]\n\nUpcoming films\n\nLohan has announced several upcoming films including one titled Frame, which she is set to star in, as well an untitled film based off the book Honeymoon, which Lohan is writing the script for.[189] During her appearance on CNN's New Year's Eve special, Lohan announced she would be coming back to the United States for a Hollywood comeback.[190][191] Lohan also announced that she is managing her younger sister Ali's music career.[192]\n\nOther ventures\n\nFashion and modeling\n\nLohan attending a Calvin Klein Spring Show afterparty in 2007.\n\nLohan has been the face of Jill Stuart, Miu Miu, and, as well as the 2008 Visa Swap British fashion campaign.[193][194] She was also the face of Italian clothing company Fornarina for its Spring–Summer 2009 campaign.[193] Lohan has a long-lasting fascination with Marilyn Monroe going back to when she saw Niagara during The Parent Trap shoot.[195] In the 2008 Spring Fashion edition of New York magazine, Lohan re-created Monroe's final photo shoot, known as The Last Sitting, including nudity, saying that the photo shoot was \"an honor\".[195] The New York Times critic Ginia Bellafante found it disturbing, saying \"the pictures ask viewers to engage in a kind of mock necrophilia. ... [and] the photographs bear none of Monroe's fragility.\"[196]\n\nIn 2008, Lohan launched a clothes line, whose name 6126 was designed to represent Monroe's birth date (June 1, 1926). The line started with leggings, before expanding to a full collection, covering 280 pieces as of April 2010 .[197][198][199] In January 2009, Lohan appeared as a guest judge on Project Runway. In September 2009, Lohan became an artistic adviser for the French fashion house Emanuel Ungaro.[200] A collection by designer Estrella Archs with Lohan as adviser was presented in October, receiving a \"disastrous\" reception, according to Entertainment Weekly and New York.[201][202] Lohan left the company in March 2010.[203] Lohan appeared in the January–February 2012 issue of Playboy magazine, in a shoot inspired by a nude pictorial of Marilyn Monroe from the first issue of the magazine.[204][205] Editor Hugh Hefner said Lohan's issue was \"breaking sales records\".[206]\n\nIn early 2018, Lohan announced plans on developing a makeup brand separate from her fashion brand and stated that it was still in its early stages of development.[207]\n\nApps\n\nIn December 2014, the free-to-play video game app Lindsay Lohan's The Price of Fame was released for the iOS and Android operating systems.[208][209] Polygon said it was \"funny, trashy and surprisingly self-aware\" while Vulture called it \"a crappy knockoff of Kim Kardashian: Hollywood\".[209][210]\n\nIn June 2017, Lohan announced she was starting a lifestyle site called Preemium, which subscribers could access for $2.99 a month.[211]\n\nPersonal life\n\nLohan began dating actor Wilmer Valderrama in 2004, Hard Rock Cafe heir Harry Morton in 2006, and DJ Samantha Ronson in 2008 and 2009.[212][213] In April 2009, following her breakup with Ronson, Lohan appeared in a dating video spoof on the comedy website Funny or Die.[214] It was viewed 2.7 million times in the first week and received favorable comments from the media.[215][216] In 2016, her fiancé was London-based Russian millionaire Egor Tarabasov, owner of the real estate agency Home House Estates and son of Dmitry Tarabasov.[217][218][219] They reportedly split up in mid-2017, with Lohan accusing Egor of abuse and him accusing her of stealing £24,000 worth of his belongings.[220]\n\nLohan spoke about her turbulent childhood in 2007, the same year her parents finalized their divorce: \"I feel like a second parent in the sense that I helped raise my family ... I was put between my mother and father a lot.\"[19][221] Despite the conflicts, Lohan spoke very fondly of her family.[222][223] However, in 2007, 2008, and 2009 she admitted that she had cut off contact with her father, describing his behavior as unpredictable and hard to deal with.[224][225][226][227]\n\nDiscography\n\nFilmography\n\nAfter beginning her acting career as a child actor in the early 1990s, Lohan, at age 11, made her film debut in Disney's successful remake of The Parent Trap (1998). Freaky Friday (2003) remains her highest-grossing film, while Mean Girls (2004), both a critical and commercial success, became a cult classic. Her career faced many interruptions from legal and personal troubles during the late 2000s and early 2010s, but she has still appeared in 26 films (including 6 as a personality), 12 television appearances, 1 play and 5 music videos. Her films include:[228][229]\n\nSee also\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Lindsay_Lohan.jpg/220px-Lindsay_Lohan.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Marshmello_and_Lindsay_Lohan_at_EMA_2018_2.png/220px-Marshmello_and_Lindsay_Lohan_at_EMA_2018_2.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Lindsay_Lohan_2019.png/220px-Lindsay_Lohan_2019.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Actress_Lindsay_Lohan.jpg/200px-Actress_Lindsay_Lohan.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Lindsay_Lohan_2012.jpg/220px-Lindsay_Lohan_2012.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Lindsay_Lohan_2019_2.png/220px-Lindsay_Lohan_2019_2.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/7/7d/Lindsay_Lohan_in_strapless_white_gown.jpg/170px-Lindsay_Lohan_in_strapless_white_gown.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/e/eb/Lindsay_Lohan_2019_2.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Lindsay_Lohan_2.jpg/170px-Lindsay_Lohan_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Lindsay_Lohan_at_Cynthia_Rowley_2011.jpg/270px-Lindsay_Lohan_at_Cynthia_Rowley_2011.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Lindsay_Lohan_2019_2.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lindsay_Lohan", "title": "Lindsay Lohan", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Lindsay_Lohan_2019_2.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}