{"url": "https://web.archive.org/web/20171107225820/https://www.forbes.com/sites/maddieberg/2017/11/07/why-megyn-kelly-didnt-make-the-list-of-top-earning-tv-hosts/", "text": "Earlier this year, the buzz around Megyn Kelly’s move from Fox News to NBC--and the millions she was getting to switch--was so loud that the noise broke through the typically insular media world and captured the interest of her loyal Fox fans and NBC viewers, alike. But if NBC paid such a high price for the political commentator-turned-perky-morning-host, why is she nowhere to be found on this year’s list of top-paid TV hosts?\n\nWell it turns out Kelly’s salary, which is about $18 million per year, is not all that abnormal compared to her morning show counterparts, and without many side projects, her earnings did not make the $21 million cut.\n\nKelly’s Today earnings line up with those of other morning stars, most of whom also didn’t make the list. Matt Lauer earns $20 million for his longstanding role as a Today anchor, and Robin Roberts of Good Morning America makes $18 million annually, while her cohost George Stephanopoulos makes about $15 million. (Michael Strahan, who actually made the Top-Earning TV Host List, makes closer to $13 million for Good Morning America, but has a number of other revenue streams.) Kelly Ripa earned about $18 million last year from Live!, but will see her salary increase next year to over $20 million.\n\nNetworks are willing to pay top dollar to these morning show hosts, as the competitive time slot is one of the most lucrative on television.\n\n“The profits come from the morning shows,” says one industry insider. “It’s a simple equation of math; that’s where advertisers shell out.”\n\nThe A.M. hours attract one of the few remaining consistent and targetable audiences for advertisers, plus the promise of being surrounded by trusted content. This means high revenues at little cost, seeing that besides the hosts and crews, these shows have few production expenditures for the networks.\n\n“Because there is so much fragmentation, finding places where there is this sort of concentration is hugely efficient, effective and attractive to advertisers,” says Adam Klein, an adjunct professor at Columbia Journalism School, adding that morning show audiences are often quite homogeneous in terms of product interests.\n\nA popular morning show can also secure audiences for later hours. “It sets the dial for the rest of the day,” says Les Rose, a professor of practice in broadcast and digital journalism at Syracuse’s Newhouse school, explaining why popular hosts are worth their paychecks.\n\nThe World's Highest-Paid TV Hosts: Dr. Phil, Ellen DeGeneres And Ryan Seacrest Lead\n\nThus Kelly’s salary is not considerably higher than those of her peers. But she came close enough to the cut-off that she could have made the list had she had a few revenue streams beyond her television paycheck. While she was paid a hefty multi-million dollar advance for her book Settle For More in early 2016, she did not sell enough copies to earn more on top of that, meaning her earnings for Forbes' scoring period (the 12 months leading up to June 1, 2017) were not effected. Additionally, she had no product endorsements or licensing deals, as some non-news show hosts, such as Ryan Seacrest and Ellen DeGeneres, do.\n\nPerhaps the most noteworthy part of Kelly’s payday, then, is that she achieved her eight-figure salary without putting in the legwork to prove herself on morning television--something that took years for anchors like Lauer, Roberts and Stephanopoulos.\n\n“She was brought in knowing they’d have to invest some time on her,” explains Klein.\n\nIt’s true: The sharp commentator of Fox News is finding her footing as a bubbly morning host who actively avoids talking her former bread and butter--politics. The transition has not been an easy one. Her Sunday night newsmagazine, which aired over the summer, got off to a bumpy start both in terms of ratings and content, including a softball interview with Vladimir Putin and controversial one with Alex Jones.\n\nEven With The $32 Million Settlement, Bill O'Reilly Made Millions Last Year\n\nHer Today debut has been similarly off, though it has seen improvements more recently as she has discussed the various Hollywood sexual harassment and assault scandals--something which she allegedly experienced first-hand at Fox News. In her first week, NBC ratings were down over 12% from the year prior, and they declined by double digit percentages throughout October. The reviews were also rough: She upset guests Jane Fonda and Debra Messing, and reportedly is having a hard time booking celebrities.\n\nIt is likely too soon to tell, then, if the $18 million salary--one that may be reasonable for seasoned and beloved morning show anchors--is worth it for her.\n\n“It’s sort of like horse racing,” says Rose. “You’ve got to bet on the right pony, and NBC bet on her.”", "images": ["https://web.archive.org/web/20171107225820im_/https://blogs-images.forbes.com/files/2015/02/maddieberg_avatar_1425069302-136x136.jpg", "https://web.archive.org/web/20171107225820im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F7c9c8673c88e42b9a6248e716cd52066%2F960x0.jpg%3Ffit%3Dscale", "https://web.archive.org/web/20171107225820im_/https://specials-images.forbesimg.com/imageserve/7c9c8673c88e42b9a6248e716cd52066/960x0.jpg?fit=scale", "https://web.archive.org/web/20171107225820im_/https://specials-images.forbesimg.com/imageserve/168674866/400x400.jpg?fit=scale&background=000000"], "top_img": "https://web.archive.org/web/20171107225820im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F7c9c8673c88e42b9a6248e716cd52066%2F960x0.jpg%3Ffit%3Dscale", "keywords": [], "authors": ["Madeline Berg"], "canonical_link": "https://web.archive.org/web/20171107225820/https://www.forbes.com/sites/maddieberg/2017/11/07/why-megyn-kelly-didnt-make-the-list-of-top-earning-tv-hosts/", "title": "Why Megyn Kelly Didn't Make The List Of Highest-Paid TV Hosts", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Why Megyn Kelly Didn't Make The List Of Highest-Paid TV Hosts", "image": "https://web.archive.org/web/20171107225820im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F7c9c8673c88e42b9a6248e716cd52066%2F960x0.jpg%3Ffit%3Dscale", "updated_time": "2017-11-07T10:17:11-05:00", "url": "https://web.archive.org/web/20171107225820/https://www.forbes.com/sites/maddieberg/2017/11/07/why-megyn-kelly-didnt-make-the-list-of-top-earning-tv-hosts/", "description": "Despite the hype surrounding Megyn Kelly's 'Today' salary, she is not out-earning her morning show peers.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Why Megyn Kelly Didn't Make The List Of Highest-Paid TV Hosts", "description": "Despite the hype surrounding Megyn Kelly's 'Today' salary, she is not out-earning her morning show peers.", "image": "https://web.archive.org/web/20171107225820im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F7c9c8673c88e42b9a6248e716cd52066%2F960x0.jpg%3Ffit%3Dscale", "creator": "@maddieberg"}, "description": "Despite the hype surrounding Megyn Kelly's 'Today' salary, she is not out-earning her morning show peers.", "author": "Madeline Berg", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Madeline Berg", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/3609-4953", "published": "2017-11-07", "modified": "2017-11-07"}}, "movies": [], "publish_date": 1509984000.0, "source": "https://web.archive.org", "summary": ""}