{"url": "https://web.archive.org/web/20180728033751/https://www.newbeauty.com/blog/dailybeauty/12361-elle-macpherson-newbeauty/", "text": "by Maggie Bullock | Photographed by Gilles Bensimon | July 19, 2018\n\nTo the naked eye, it appears that remarkably little has changed about Elle Macpherson in the quarter-century since she was an 18-year-old Aussie surf junkie who started modeling to pay for law-school textbooks. Her legs are still infinite and impossibly lean, her hair still tosses like it’s in the gust of a perpetual wind machine, and her smile still radiates the just-try-to-keepup-with-me tomboy energy that made her the sex symbol of her generation. But Macpherson is in fact human, she swears, and around the time she turned 50 in 2014, she was experiencing symptoms that will sound familiar to even non supermodels.\n\n“What I noticed is that my skin got dry,” she says. “I started to put on weight around my waist and hips, which was never my thing before. My legs started to get heavy. I started to feel lethargic. I also didn’t feel inspired. I wasn’t sleeping. My whole energy felt heavy.”\n\nNothing in particular had changed about her lifestyle, but everything that used to work— the diet and exercise that had kept her fit for decades—just wasn’t working anymore. On the recommendation of a friend who had recently enlisted London uber-nutritionist Simone Laubscher to help her weather a course of chemotherapy, Macpherson headed to Laubscher’s clinic in London’s Harley Street. She walked out with a suggestion to switch to a plant-based alkaline diet, and a jar of the doctor’s custom-mixed powdered greens supplement. Within two weeks, her skin changed. “What I’d always thought were sunspots—actually, they were sugar spots— started to clear, and my skin looked tighter, dewier and plumper. I started to lose weight, probably because my sugar cravings had subsided. My digestion improved. I felt more emotionally balanced.” The change was so dramatic, “it was like a light bulb went off,” she says. “I realized, this isn’t a fixed state of being. I can change the way I feel.”\n\nLong before the term multi-hyphenate had become the standard famous-person job description cliché, Macpherson was seizing opportunities to become not just Elle, The Body, but Elle, The Business. As early as the mid-80s, it occurred to her that if Sports Illustrated could make good money selling calendars fronted by her own tawny, sun-dappled image, so could she. Macpherson hired a crew, set up her own shoots and sold them to a publisher. Then, recognizing that regular folks might enjoy watching a famous model make her own calendar, looped in a local TV station to document the project. Voilà, free PR. “It was the kind of thing where I spent $60,000 and made a million,” Macpherson says, then demurs, “well, not those numbers exactly,” but you get the idea. “It was one of those experiences where I realized that if I take initiative, apply what I’ve learned and take a risk, then it may pay off.” By the time Macpherson had her green-diet epiphany, she was already a practiced businesswoman: Elle Macpherson Body,a global lingerie empire of high-end lacy underthings— among them, incidentally, really good bras for women of most sizes—is sold everywhere from Net-a-Porter to Saks. True to form, her a-ha moment electrified not just a new lifestyle, but a new business plan. Enlisting Laubscher as a formulator for the brand, she souped up the nutritionist’s miracle powder and launched the Super Elixir Greens, a blend of 45 plant-based ingredients that dissolve in water for an all-in-one daily health boost. Other beauty-from-within products followed, including the Nourishing Plant Protein powder (she blends the chocolate flavor with avocado and eats it with a spoon). The mother of two called us from home in Miami to talk about life as a wellness guru.\n\nYOU’VE BECOME SUCH A VOCAL PROPONENT OF ALKALINITY. WHAT DO YOU DO BESIDES TAKING THE ELIXIR TO MAINTAIN YOUR PH LEVELS?\n\nIf I’m really in my groove, I love a raw, plant-based diet. That’s how I feel best. I eat grains, nuts, seeds, beans, vegetables, almond milk, hemp milk, chia seeds. I make my own granola in a dehydrator. Avocado, salads, juicing—you know, beautiful, whole, natural foods. As far as animal products are concerned, I’ll have a poached egg every now and then, some Parmesan cheese and goat cheese, but they’re not staples of my diet.\n\nActually, WelleCo sells sticks that can test the pH of urine or saliva. You can test your saliva morning and night and see how well you’re doing. If you haven’t had your greens, or you’re eating sugar, wheat or animal fats, you can tell a huge difference from one day to the next.\n\nWHAT IS YOUR DAY LIKE?\n\nI wake up around 5:00 or 5:30 and listen to a guided meditation or do some hands-on Reiki—I learned how to do it on myself. I make sure I’m not checking emails from the minute I wake up; I breathe and just prepare for the day for 10 or 20 minutes. Then I wake up my son Cy—he’s 14; my eldest, Flynn [age 20], is in college in Boston—and make us breakfast. I have hot water and lemon instead of espresso now, and I’ll put in a pinch of cayenne or some ginger, or a little bit of stevia if I want. Then I take two teaspoons of the Super Elixir in 500 milliliters of filtered water. I see that as almost like putting cream on my face. For breakfast, I’ll maybe have a soaked chia seed pudding that I make using almond milk with a little green stevia, some ginger, cardamom, nutmeg, and cinnamon.\n\nWHAT ABOUT EXERCISE?\n\nI’ve been through so many phases. I’ve spun, I’ve done boxing and I’ve even had a workout video. But less strenuous exercise is sometimes better for our bodies—at least that’s been my experience. I do Vinyasa yoga or power yoga, or go for a swim, go paddle boarding or waterskiing, or take the dogsfor a walk. If I’m lucky enough to be by the sea, I think walking in seawater is one of the best things I can do for my body. It tones the legs and the waist, it’s great for minerals, and if you have any water retention, it’s a great diuretic. I walk in about thigh-deep or knee-deep water for 40 minutes to an hour.\n\nWHAT’S THE REST OF YOUR DAILY SELF-CARE RITUAL?\n\nBefore or after I shower, I dry brush my body. You can watch how to do it on YouTube—basically, it’s circular movements toward your heart, from your fingertips and your toes. In the shower, I do about three cycles of switching hot and cold water. You can feel your body start tingling; it’s so good for your lymphatics and circulatory system, and such an easy thing to do. Sometimes I’ll use WelleCo’s limited-edition salt scrub, a formula that I found in Japan when I was there a couple of years ago. I’m a big scrub and moisturizer girl. It makes a huge difference in the texture of the skin, helps the circulatory system, sloughs off dry skin cells, and it’s a great stimulus and detox. Then I slather on moisturizer. For my face, I use WelleCo’s Organic Rose Geranium Créme; on my body, it’s a French pharmaceutical called Bioderma—it’s simple and soaks in really well.\n\nANY RECENT BEAUTY DISCOVERIES WE SHOULD KNOW ABOUT?\n\nA new little brand called The Lost Explorer by David de Rothschild. They have a moisturizer, scrub, mist and spray. It’s very consciously curated, natural and very considered. And I love the packaging. It’s small, and I can travel with it.\n\nHOW DO YOU SAFELY MAINTAIN THE LOOK OF BEING TAN?\n\nForget about the look of a tan—the immune system is very much boosted by sunshine. I try to lie outside for 20 minutes in the morning and 10 minutes in the afternoon. I close my eyes and raise my face to the sun so that the pineal gland in the front of my head is toward the sun. That just works wonders for your immune system.\n\nSUN?! DOES YOUR DERMATOLOGIST GIVE YOU A HARD TIME ABOUT IT?\n\nWell, we’re talking 20 minutes at 9:00 in the morning. People always ask me, “What do you regret?” I believe the past is a wonderful teacher—I regret nothing—but I do wish I’d worn more sunblock! Or looked after my skin when I was younger, because it really shows now. There’s one sunblock I love called Invisible Zinc, which is more of a barrier to the sun than a chemical shield.\n\nDO YOU DO ANY PROFESSIONAL TREATMENTS TO TRY TO REVERSE SUN DAMAGE?\n\nWell, I can’t do lasers because I live in the sun, which compounds the issue, so that’s out of the question. But, I’ve been using an infrared sauna at home for about a year and a half. I try to do it every day for an hour— I’ll watch TV in there or do a meditation or a phone call. That’s been phenomenal for the quality of my skin and the capacity of my body to detox and really function well. There’s a great company here called Therasage; they sell a portable version where your head stays out, which is nice because it gets up to 140 to 170 degrees in there.\n\nI FEEL LIKE YOU’RE GOING TO TELL ME YOU DON’T WEAR ANY MAKEUP.\n\nI wear a little bit of RMS’s organic concealer under my eyes or on any blemishes or freckles, and then a tiny little bit of translucent powder if I need it. I use Pat McGrath Skin Fetish 003 Illuminator—it’s just a sheer shine, so it brings out my bone structure—on my eyes and lips. If I need a little contouring or some glow, I’ll use the big Chanel bronzer.\n\nBUT NO COLOR?\n\nNo—I think less is more anyway, and particularly as you mature. I can’t wear foundation now without it really accentuating a whole bunch of stuff I don’t want it to accentuate.\n\nYOU’VE ALWAYS BEEN SO CONFIDENT IN FRONT OF THE CAMERA. HAS THAT CHANGED AS YOU’VE GOTTEN OLDER?\n\nActually, I’m much more confident now than I’ve ever been, but I was quite uncomfortable in front of the camera for many years. I can see it when I look at my younger pictures, that “I’m so self-conscious, I can’t even look in the camera because I’m afraid you’ll see me, and I’m afraid I’m not good enough” look. As time went on, I got more practiced and started to learn it as a skill—how to make clothes look good and make my body look good—from watching other people and studying photographers’ work, and listening very closely to what the editors would say.\n\nYOU CERTAINLY LOOKED AT EASE IN ALL THOSE BIKINI SHOTS!\n\nIronically, I was more comfortable outdoors and in bathing suits because I grew up like that; it was a natural environment for me. Fashion wasn’t a natural environment for me. I never thought modeling would be a lifelong career. It was a means to an end, but I started to see the value. I loved traveling, I picked up languages and I learned about art and music and literature—it was just a wonderful education.\n\nYOU WERE SO EMBLEMATIC OF THIS ACTIVE, ATHLETIC IDEAL THAT REALLY CHANGED THE GAME IN THE ‘80S. COULD YOU FEEL THAT SHIFT HAPPENING AT THE TIME?\n\nNo, what I learned from that period was that it was very important to be me. When I started modeling, my physiognomy, my body type—this sort of Amazonian, broad-shouldered, narrow-hipped, big-breasted, six-foot-tall Aussie girl—wasn’t in fashion. There was a huge movement toward girls being very androgynous and very slight. In the beginning, they used to bind my breasts with elastic so that the clothes wouldn’t show the shape of the breast. I realized early on that I couldn’t starve myself and shrink myself to try to be something I wasn’t. So, it was when I managed to embrace my uniqueness and stand in my own truth of what I was, that I became more confident. That confidence was attractive, and people started booking me for that.\n\nIS THAT WHEN YOU THOUGHT, “I’VE MADE IT”?\n\nI’ve never really thought that; that’s not my MO. Even when Time did the article that called me “The Body”—it was a cover in 1986—I didn’t even know it was out. It was on newsstands, and I was like, What? It didn’t occur to me the impact it would have on the rest of my life. I didn’t know they were doing the article; I didn’t participate in it at all. Now, creating a business focused on wellness, which I believe so profoundly in, I’m a cofounder, I work very closely with my CEO, I’m the figurehead, the face-of, and I sit in my board meetings like any other shareholder of any other company. So perhaps not my proudest moment, but my most fulfilling moment is now.\n\nYOU MADE A GREAT BUSINESS OUT OF BEING THE BODY, BUT HOW DID IT FEEL TO BE CALLED THAT?\n\nOh, it’s just a name [laughs]. I never saw it as demeaning; I don’t judge myself like that. It’s a bit like supermodel—what does it mean? And anyway, inside the body there’s a heart, and soul, so thank goodness for The Body.", "images": ["https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/85203-skinfreakoutpng.png.204x150_q80_crop-smart.png", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/7155-ellemcphersonnewbeautyjpg.jpg.660x0_q80_crop-scale_upscale.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/75339-sephorapng.png.204x150_q80_crop-smart.png", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/74325-TightArms.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20180728033751im_/http://b.scorecardresearch.com/p?c1=2&c2=21004701&cv=2.0&cj=1", "https://web.archive.org/web/20180728033751im_/https://www.newbeauty.com/static/newbeauty/images/noavatar.gif", "https://web.archive.org/web/20180728033751im_/https://www.facebook.com/tr?id=1572440699746061&ev=PageView&noscript=1", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/13703-SmootherBlowout.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/8668-ExpiredBeautyProductsWhatToThrowAway.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/26656-shutterstock_569215900jpg.jpg.204x150_q80_crop-smart.jpg", "https://web.archive.org/web/20180728033751im_/https://s3.amazonaws.com/static.newbeauty.com/tt-banner-left-v6.jpg", "https://web.archive.org/web/20180728033751im_/https://s3.amazonaws.com/static.newbeauty.com/tt-banner-right-v6.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/7155-ellemcphersonnewbeautyjpg.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/14407-birthcontrolherojpg.jpg.204x150_q80_crop-smart.jpg", "https://web.archive.org/web/20180728033751im_/https://s3.amazonaws.com/media.newbeauty.com/photos/64714-ellemcphersonnewbeautycoverjpg.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/49269-ProductsFineHair.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/59877-silktherapeutics-1png.png.300x300_q80_crop-smart_upscale.png", "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/8470-texturesprayjpg.jpg.204x150_q80_crop-smart.jpg"], "top_img": "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/7155-ellemcphersonnewbeautyjpg.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180728033751/https://www.newbeauty.com/blog/dailybeauty/12361-elle-macpherson-newbeauty/", "title": "Elle Macpherson Talks Entrepreneurial Instincts, Feel-Good Eating, and How to Live the Good Life", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Elle Macpherson shares her beauty secrets.", "og": {"title": "Elle Macpherson Talks Entrepreneurial Instincts, Feel-Good Eating, and How to Live the Good Life", "site_name": "NewBeauty", "image": "https://web.archive.org/web/20180728033751im_/https://d53l9d6fqlxs2.cloudfront.net/photos/7155-ellemcphersonnewbeautyjpg.jpg", "url": "https://web.archive.org/web/20180728033751/https://www.newbeauty.com/blog/dailybeauty/12361-elle-macpherson-newbeauty/", "description": "From swimsuit bombshell to wellness guru, Elle Macpherson has always been more than The Body.", "locale": "en_US", "type": "article"}, "fb": {"app_id": 957932114216881}, "twitter": {"card": "summary_large_image", "site": "@NewBeauty", "creator": "@NewBeauty", "title": "Elle Macpherson Talks Entrepreneurial Instincts, Feel-Good Eating, and How to Live the Good Life", "description": "<p>From swimsuit bombshell to wellness guru, Elle Macpherson has always been more than The Body.</p>", "image": {"src": "https://d53l9d6fqlxs2.cloudfront.net/photos/7155-ellemcphersonnewbeautyjpg.jpg"}}}, "movies": [], "publish_date": 1531929600.0, "source": "https://web.archive.org", "summary": ""}