{"url": "https://popculture.com/reality-tv/2018/03/02/mama-june-break-down-learning-if-blind/", "text": "In a clip from an upcoming episode of Mama June: From Not to Hot, Mama June breaks down after learning if she's blind.\n\nJune recently underwent eye surgery and we will finally see the results of that operation in Friday's episode.\n\nAs shown in the clip exclusively shared by E!, June and her boyfriend Geno head to the optometrist's office for a check-up and an evaluation on the aftermath of her surgery.\n\n\"This is it baby. The moment of truth,\" Geno says. \"This has been a long week, and she actually stayed in the chair longer than I thought she would. I mean, just get the patch off and see what the doctor's got to say. If she can't see and it's bad news, I don't know what the f— she's gonna say or do.\"\n\n\"It's hard for me to even think about me going completely blind,\" Mama June then says. \"Who's going to take care of my girls, my house? I'm not gonna be able to see Pumpkin's baby [or] Alana. It's gonna be awful.\"\n\nWe eventually see June sitting in the optometrist's chair as the doctor carefully and compassionately provides her with realistic expectations for the future.\n\n\"You know, we actually don't expect you to see a lot today because the eye has been through a lot,\" the doctor says. \"We expect things to be very blurry and we're not sure how good your vision's gonna get.\"\n\nAfter the eye-patch she has been wearing is removed, one of the shows producers asks June, \"What can you see, June? What is it like?\"\n\nJune breaks down in tears and Geno says to her, \"Can you see me? If you can't see, there's still things they can do.\"\n\nThe clip ends there, leaving fans needing to see the full episode in order to find out how it ends.\n\nMama June recently lost 300 pounds, and picked up a new man, Geno, who she says is her \"rock\" and \"best friend.\"\n\nIn an interview from January, Mama June (real name June Shannon), said, “He’s my rock and my best friend. We’re together 24 hours a day. I mean it’s kind of weird that we don’t really have to do anything.\"\n\n\"We can just chill at the house, or chill with the kids, or just go to the store. I’ve never been able to enjoy somebody as much as I have him,” she continued, as reported by Page Six.\n\nShannon also added that Geno “had no idea who I was” when they first met, but, coincidentally, his kids did. “And that’s what I like about it. We grew up in the same town but didn’t know one another. He doesn’t care about me being famous, or anything about it. He’s having fun with it,” Shannon said.", "images": ["https://media.popculture.com/2018/02/mama-june-eyepatch-20027093-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/02/mama-june-eyepatch-20027093-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2018/03/02/mama-june-break-down-learning-if-blind/", "title": "Watch Mama June Break Down After Learning If She's Blind", "meta_data": {"description": "In a clip from an upcoming episode of Mama June: From Not to Hot, Mama June breaks down after learning if she's blind.June recently underwent eye surgery and we will finally see the results of that operation in Friday's episode.As shown in the clip exclusively shared by E!, June and her boyfriend [...]", "keywords": "Mama June Shannon,Mama June: Family Crisis,Reality TV (genre)", "news_keywords": "Mama June Shannon,Mama June: Family Crisis,Reality TV (genre)", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Watch Mama June Break Down After Learning If She's Blind", "description": "In a clip from an upcoming episode of Mama June: From Not to Hot, Mama June breaks down after [...]", "image": "https://media.popculture.com/2018/02/mama-june-eyepatch-20027093-640x320.jpeg"}, "og": {"title": "Watch Mama June Break Down After Learning If She's Blind", "type": "article", "url": "https://popculture.com/reality-tv/2018/03/02/mama-june-break-down-learning-if-blind/", "image": {"identifier": "https://media.popculture.com/2018/02/mama-june-eyepatch-20027093-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "In a clip from an upcoming episode of Mama June: From Not to Hot, Mama June breaks down after [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1519920000.0, "source": "https://popculture.com", "summary": ""}