{"url": "genius.com/a/on-everything-is-love-jay-z-beyonce-have-perfected-the-art-of-controlling-the-narrative", "text": "Since the earliest stages of their respective careers, JAY-Z and Beyoncé have made a habit out of addressing rumors and controversies about their lives in their songs. Many artists use their life experiences as musical fodder, but THE CARTERS‘ situation is unique because they double as two of our greatest living musicians and one of the most famous power couples in the world. Jay and Bey’s names and faces are plastered all over gossip sites—yet they remain intensely private. When they went on stage this past weekend to announce their new album, Everything Is Love, was on TIDAL, they had successfully released one of the biggest albums of the year with virtually no rollout and no leaks.\n\nAlbum rollouts these days often consist of a media blitz. Most artists take to interviews or social media to give fans updates on their lives but also debunk rumors. Beyoncé maintains a carefully curated Instagram, but has basically stopped doing interviews. Jay still does a high profile interview here or there, but has no social media footprint other than the Twitter account he hasn’t touched in a year. The Carters tell their stories in their chosen format: music.\n\nOn their songs, they can reveal what they want and conceal what they want to keep hidden. Like everything else they do, it’s calculated. When the time comes to unleash a new provocative detail, it always seems to come at the perfect and most commercially viable moment. Rather than giving outlets and social media the details of their private lives, they give us updates through their songs. They’ve basically monetized their gossip.\n\nNowhere is that strategy more evident than on their new album. Everything Is Love completes The Carters’ trilogy of albums that began with Beyoncé’s 2016 project Lemonade and continued with Jay’s 2017 release 4:44. Each album has given us the plot twists, conflicts, and resolution we’ve become accustomed to consuming through every form of media besides music. Taken together, they’re the culmination of decades worth of perfecting the craft of controlling the narrative.\n\nThis is all seems to be part of a strategy that Beyonce addressed in her 2013 HBO documentary Life Is But A Dream, where she discussed Nina Simone’s career, and how her art was the entertainment, not her life:\n\nPeople are taking pictures of you and exploiting your personal life as entertainment. When Nina Simone put out a record, you fell in love with her voice. … But you didn’t get brainwashed by her day-to-day life, and what her child was wearing and who she is dating. All things that are really not your business. It shouldn’t influence the way you listen to the voice and the art, but it does.\"\n\nBeyoncé’s right, the personal and the day-to-day can influence how people listen to your voice. That’s probably why no stone is left unturned on Everything Is Love. Throughout the album they address rumors about alleged love children, secret second weddings, and even hilariously awkward memes.\n\nOn “Heard About Us,” Jay addresses the rumors that he secretly fathered a lovechild a decade ago—a story that’s plagued him for years but found new relevance after Pusha-T brought up Drake’s child on “The Story of Adidon.” Jay has never addressed the rumor in any interviews or taken a paternity test. Instead, he adds a twist to Michael Jackson’s “Billie Jean” to deny the “boy” in question is his child:\n\nBillie Jean in his prime\n\nFor the thousandth time, the kid ain’t mine\n\nOnline they call me “dad,” kiddingly\n\nYou’re not supposed to take this dad thing literally\n\nThis isn’t the first time Jay has denied such rumors. In fact, it’s not even the first time he referenced “Billie Jean” to do it. He had a similar line on 2008’s “American Gangster.” And on 2006’s “Trouble,” he was forced to denied the persistent rumor he had a baby by former BET host Free:\n\nSo I ain’t gon' make a move unless I got a Plan B\n\nThat’ll happen the day I have a baby by Free\n\nNot to say that anything is wrong with Free\n\nJust to say that ain’t nothing wrong with me\n\nAfter those lines, that particular rumor died down. A few years later, Jay was dogged by the conspiracy theory that he was apart of the Illuminati, an idea he thoroughly dismissed on Rick Ross “Free Mason.”\n\nRather than giving outlets and social media the details of their private lives, they give us updates through their songs.\n\nNot every story Jay addresses on the new album is as over the top as a secret baby or a secret society. On “Apeshit,” Jay confirms that he was offered the honor of performing at the Super Bowl halftime show by the NFL but turned it down. Although that story was widely reported at the time, many websites cited The Source which in turn cited the The Sun—the same tabloid newspaper that ran the story about Jay’s alleged love child. As Cardi B would say, that’s not a reliable source. On the track, Jay clears the air about exactly what happened:\n\nI said no to the Super Bowl\n\nYou need me\n\nI don’t need you\n\nEvery night we in the endzone\n\nTell the NFL we in stadiums too\n\nThese are the kinds of lines we’ve come to expect from The Carters. Using music to control the story truly kicked into high gear for them after the leak of camera footage from their infamous elevator ride after the Met Gala after party in 2014—Beyonce standing still and doing nothing as her sister Solange physically attacked Jay-Z. It was their most outrageous public moment as a couple. As tabloids went wild, The Carters went into radio silence, refusing to give credence to the drama. To date, Beyoncé has never addressed the incident in any sort of interview. But she did reference it with a few bars a few months later on the “***Flawless (Remix).” It’s essentially her only public acknowledgement that the incident even happened:\n\nOf course sometimes shit go down\n\nWhen it’s a billion dollars on an elevator\n\nStill, questions remained unanswered. Two years after that incident, they began the trilogy that has captivated audiences and seemingly sparked personal growth for all parties involved. Beyoncé released Lemonade in 2016 and on “SORRY,” Bey unleashed the couple’s most scandalous confession yet: Jay-Z cheated on her with Becky With The Good Hair.\n\nLooking at my watch, he shoulda been home\n\nToday I regret the night I put that ring on\n\nHe always got them fucking excuses\n\nI pray to the Lord you reveal what his truth is\n\nI left a note in the hallway\n\nBy the time you read it, I’ll be far away\n\nInstead of hearing about Jay’s infidelity on PageSix or TMZ, you heard it from Bey herself. Watching the visual film debut on HBO was a harrowing experience for fans. For the first half, on songs like “DON’T HURT YOURSELF,” it seemed like Bey and Jay’s marriage on still on the ropes. But before think pieces could pour out about whether Bey should forgive Jay or not, she did so herself towards the end of the album on “All Night.”\n\nFound the truth beneath your lies\n\nAnd true love never has to hide\n\nTrue love never has to hide\n\nI’ll trade your broken wings for mine\n\nTrade your broken wings for mine\n\nI’ve seen your scars and kissed your crime\n\nSeen your scars and kissed your crime\n\nWhen Lemonade dropped, fans and media speculated if this was even a true story or just a marketing ploy to sell her album. But on 4:44’s title track, Jay admitted to his infidelity, and apologized incessantly for his mistake.\n\nLook, I apologize, often womanize\n\nTook for my child to be born, see through a woman’s eyes\n\nTook for these natural twins to believe in miracles\n\nTook me too long for this song, I don’t deserve you\n\nThe trilogy seems to conclude on Love Is Everything, where they go into detail about their reconciliation and even divulge a few more details about just how rocky their marriage got. On the album’s closer, “LOVEHAPPY,” the couple trades bars, and eventually lets loose that not only did Jay replace Beyonce’s “tainted” wedding ring after his infidelity, but that she also came face to face with his mistress at some point:\n\nHe went to Jared, I went to JAR out in Paris\n\nYeah, you fucked up the first stone, we had to get remarried\n\nYo, chill man\n\nWe keepin' it real with these people, right?\n\nLucky I ain’t kill you when I met that b- (Nah, aight, aight)\n\nSoon after, it’s even intimated that the family’s move to a massive $88 million Bel Air home last year was sparked by the cheating:\n\nY'all know how I met her, we broke up and got back together\n\nTo get her back, I had to sweat her\n\nY'all could make up with a bag, I had to change the weather\n\nMove the whole family West, but it’s whatever\n\nIn a glass house still throwing stones\n\nHova, Beysus, watch the thrones\n\nThe usage of “watch the thrones” could be seen as a shot at Kanye West, whose relationship with Jay is another topic of much discussion. There are much more overt references to Kanye on the album. Again, The Carters are controlling the narrative without engaging with media, choosing what they deem worthy of a response or explanation. In April, Jay told David Letterman Kanye was still “like a brother” to him. But he had a more revealing take on his relationship with Kanye on the song “Friends.”\n\nIn a verse that seems full of jabs at Kanye, Jay ends with a response to one of the most widely discussed incidents in their relationship. In 2014, when Kanye married his wife Kim Kardashian in a lavish ceremony in Italy, Jay and Bey were absent. Kanye has admitted that it hurt him, and Jay took a few bars to explain exactly why his trouble at home kept him from attending the wedding. He even caps things off by saying if Kanye doesn’t understand that they aren’t meant to be friends.\n\nI ain’t goin' to nobody nothin' when me and my wife beefin'\n\nI don’t care if the house on fire\n\nI’m dyin', nigga, I ain’t leavin'\n\nTy-Ty take care of my kids, after he done grievin'\n\nIf y'all don’t understand that, we ain’t meant to be friends\n\nThe Carters have always sprinkled intimate moments into their lyrics, so while it may have become more apparent recently, it’s hardly new. Jay-Z once admitted he shot his own drug-addicted brother on the In My Lifetime, Vol. 1 cut “You Must Love Me.” Beyoncé pulled off similar, revealing confessionals as well, famously addressing the lineup shuffling in her group, Destiny’s Child, on the first single from the group’s self-titled third album, “Survivor.” And it’s easy to forget, but back in the early 2000s they both denied even being a couple while collaborating on songs like “'03 Bonnie & Clyde” and “Crazy In Love.” They’ve shared intimate details too, like when Jay admitted Bey had a miscarriage on his 2012 loosie “Glory” which celebrated Blue Ivy’s birth.\n\nAs they continue this process on Everything Is Love, The Carters have found a happy medium of both scintillating reveals and boastful proclamations of their against-all-odds successes. The result is the kind of chemistry you’d expect from a tested union as strong as theirs, and two musical geniuses who have cultivated a relationship nearly two decades strong. Jay-Z and Beyoncé don’t need tabloids, interviews or social media confessionals. They tell the world everything they want on their albums, and it may soon be the only way to ever hear them. Just like the good old days.", "images": ["https://images.genius.com/98731bf12ab035e708b66896e2c1b928.900x595x1.jpg", "https://www.facebook.com/tr?id=201983886890479&ev=PageView&noscript=1", "http://b.scorecardresearch.com/p?c1=2&c2=17151659&cv=2.0&cj=1", "http://pixel.quantserve.com/pixel/p-f3CPQ6vHckedE.gif", "https://loadus.exelator.com/load/?g=4&j=0&p=1183&page-album_ids=%5B150119%5D%2C%5B350958%5D%2C%5B438392%5D&page-albums=Lemonade%2C4%3A44%2CEVERYTHING+IS+LOVE&page-artist_ids=%5B2%5D%2C%5B498%5D%2C%5B8372%5D%2C%5B1408735%5D&page-artists=JAY-Z%2CBeyonc%C3%A9%2CNina+Simone%2CTHE+CARTERS&page-type=article&user_signed_in=false"], "top_img": "https://images.genius.com/98731bf12ab035e708b66896e2c1b928.900x595x1.jpg", "keywords": [], "authors": [], "canonical_link": "https://genius.com/a/on-everything-is-love-jay-z-beyonce-have-perfected-the-art-of-controlling-the-narrative", "title": "On ‘Everything Is Love,’ JAY-Z & Beyoncé Have Perfected The Art Of Controlling The Narrative", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=709482991", "y_key": "f63347d284f184b0", "og": {"site_name": "Genius", "url": "https://genius.com/a/on-everything-is-love-jay-z-beyonce-have-perfected-the-art-of-controlling-the-narrative", "title": "On ‘Everything Is Love,’ JAY-Z & Beyoncé Have Perfected The Art Of Controlling The Narrative", "description": "The Carters use their lyrics to monetize the gossip.", "image": "https://images.genius.com/98731bf12ab035e708b66896e2c1b928.900x595x1.jpg"}, "fb": {"app_id": 265539304824, "pages": 308252472676410}, "twitter": {"url": "https://genius.com/a/on-everything-is-love-jay-z-beyonce-have-perfected-the-art-of-controlling-the-narrative", "title": "On ‘Everything Is Love,’ JAY-Z & Beyoncé Have Perfected The Art Of Controlling The Narrative", "description": "The Carters use their lyrics to monetize the gossip.", "image": "https://images.genius.com/98731bf12ab035e708b66896e2c1b928.900x595x1.jpg", "site": "@Genius", "card": "summary_large_image", "app": {"name": {"iphone": "Genius"}, "id": {"iphone": 709482991}, "url": {"iphone": "genius://articles/5272"}}}}, "movies": ["https://www.youtube.com/embed/iniGJdFmy44?modestbranding=1&start=0&showinfo=0&enablejsapi=1&origin=genius.com"], "publish_date": null, "source": "http://genius.com", "summary": ""}