{"url": "https://www.theringer.com/nfl/2018/11/23/18108886/thanksgiving-day-football-winners-losers", "text": "Every week this NFL season, we will celebrate the electric plays, admonish the colossal blunders, and explain the inexplicable moments of the most recent slate. Welcome to Winners and Losers. Which one are you?\n\nWinner: Mr. Irrelevant and Guys Who Went Undrafted\n\nThe last player selected in each NFL draft is given the title “Mr. Irrelevant.” For all of the exposure created by this distinction, the name is generally fitting: This player tends to have a pro football career that is, well, rather irrelevant. Not counting this year’s selection, only two Misters Irrelevant (2009’s Ryan Succop and 2016’s Kalan Reed) are currently on NFL rosters, and neither is with the team that drafted them. Succop is only the second Mr. Irrelevant since 2000 to ever start an NFL game; the other is David Vobora, who played linebacker for the Rams from 2008 to 2010. Heading into Week 12, no Mr. Irrelevant had scored a touchdown since 2000, when 1999’s Mr. Irrelevant, fullback Jim Finn, caught the only touchdown pass of his career.\n\nNo Mr. Irrelevant until Thanksgiving, that is. On Thursday, Washington receiver Trey Quinn became relevant. Quinn not only had a big punt return, but also snagged a 10-yard touchdown catch, the first of his career:\n\n✅ 30-yard punt return\n\n✅ Touchdown grab\n\n\n\n\"The Trey Quinn Drive.\"pic.twitter.com/3HWBG3702g — Sporting News (@sportingnews) November 22, 2018\n\nHe chose to commemorate the moment with a celebration from The Office, the only time imitating Michael Scott in real life has been a good decision:\n\nQuinn was playing in just his third career game, as an ankle sprain kept him out for most of September and all of October. He finished the team’s 31-23 loss to the Cowboys with five catches on six targets. The 256th overall pick last April is suddenly a legitimate part of Washington’s passing offense.\n\nOf course, Mr. Irrelevant isn’t the only player who gets passed over in every draft. While there’s just one Mr. Irrelevant, there are hundreds of undrafted players who try to fight their way onto rosters every year—and like Quinn, some of those players also made an impact this Thanksgiving. Although the most prolific receiver in the Saints’ record-setting passing attack this season has been 2016 second-rounder Michael Thomas, all four passing touchdowns Drew Brees threw in New Orleans’s 31-17 win against the Falcons were caught by undrafted players. Here’s some guy named Dan Arnold, a tight end from Division III Wisconsin-Platteville, beating Atlanta’s defense over the top and laying out to catch a gorgeous pass:\n\nDan Arnold LAYS OUT for the TD grab! @DrewBrees' third score of the night. #GoSaints\n\n\n\n: #ATLvsNO on NBC pic.twitter.com/UTXJ1hEqc9 — NFL (@NFL) November 23, 2018\n\nAnd here’s a wideout named Tommylee Lewis getting loose downfield:\n\nBrees finds a wide-open Tommylee Lewis for a 28-yard touchdown! #ATLvsNO pic.twitter.com/qdTzvgZDIa — New Orleans Saints (@Saints) November 23, 2018\n\nKeith Kirkwood and Austin Carr also reeled in scores. The Saints made history by throwing so many touchdowns to so many undrafted players:\n\nFrom @ESPNStatsInfo: Saints are first team in Super Bowl era to have 4 different undrafted players with receiving TD in a game. FROM ELIAS: Saints are first team since 1984 Steelers to have 4 different players score their 1st-or-2nd career TD in the same game — Mike Triplett (@MikeTriplett) November 23, 2018\n\nAs the famous Saints cheer goes, “Who dat? Who dat? … No, seriously, who is that? I follow this team closely, and I haven’t heard that name in my life.”\n\nWhile this bevy of scores helped virtually nobody’s fantasy team, it highlighted the truly incredible season that New Orleans is having. The team has been forced into starting some of these unknowns: Tre’Quan Smith was a surprise scratch on Thursday with a foot injury, while new receiver acquisition Brandon Marshall isn’t yet ready to play. With Ted Ginn Jr., Cameron Meredith, and Dez Bryant already on injured reserve, the Saints are trotting out anybody with hands and gloves.\n\nWith almost any other team, this rash of injuries would be disastrous. For Brees, though, it hasn’t been a problem. The spectacular outings by players seemingly generated in Madden’s dynasty mode serves to bolster Brees’s MVP case: How can anybody be more valuable than the QB setting records with a cast of pass catchers comprised of players every team in the league once graded as completely valueless?\n\nLoser: Markelle Fultz\n\nOther than Super Bowl Sunday, Thanksgiving is probably the day each year when the highest percentage of Americans watch the same thing. Almost everyone is off from work, and only one game happens at a time, so the league’s Thanksgiving games are always among the highest-rated of the season. We all just sit around, eat, drink, and watch the parade turn into the dog show turn into football turn into more football turn into a Christmas movie turn into your dad snoring over, like, The Godfather.\n\nGiven all of this, imagine what it’d be like turning on the television to watch Thanksgiving football and realizing that you’re personally being made fun of by one of the players, and that your family and everybody else around the country is watching that player make fun of you? It’d probably be pretty bad. Luckily, most of us never have to worry about this situation—although I do look forward to a player scoring a touchdown and lifting up his jersey to reveal, “HEY, STEVE J. FROM OMAHA, YOU’RE UGLY” written on his undershirt. Then again, most of us are not Markelle Fultz, the player the Philadelphia 76ers took with the first overall pick in the 2017 NBA draft.\n\nAfter scoring the first of his two touchdowns Thursday, Cowboys receiver Amari Cooper took the ball and pretended to shoot a free throw.\n\nAmari Cooper scores the TD and the free throw is good! pic.twitter.com/4CfJ8AKn8z — DraftKings (@DraftKings) November 22, 2018\n\nAt first I was unimpressed: Players have celebrated touchdowns with fake free throws before. Yet as the celebration was replayed, I couldn’t stop looking at Cooper’s form. It felt so rushed and herky-jerky; in fact, Cooper barely pretended to care in which direction his fake shot went. Why would Cooper choose to perform a free throw–shooting celebration if he doesn’t know how to competently shoot a free throw?\n\nAs it turns out, Cooper probably does know how to shoot a free throw. He was making his form intentionally ridiculous-looking as an homage to Fultz, the basketball player who has forgotten how to shoot a basketball.\n\nAs if you needed another reason to hate the Cowboys... here’s Amari Cooper mocking Markelle Fultz’ FT motion in a TD celebration. pic.twitter.com/4KDeg0gRvP — Eagles Nation (4-6) (@PHLEaglesNation) November 23, 2018\n\nThanks to the magic of 2018, we now have video footage of Fultz reacting to the nightmare scenario described above: Fultz made an Instagram post in which he filmed Cooper’s celebration over the sounds of friends’ uproarious laughter, then turned the camera on himself and balled his hand into a fist with a smile on his face:\n\nlove markelle fultz's reaction to amari cooper's post-touchdown impression of his free-throw stroke pic.twitter.com/Rd0YiDYRhK — joon (@joonlee) November 23, 2018\n\nFultz was a genuinely good shooter in college and converted more than 40 percent of his 3-point attempts at Washington. Then he got to the NBA and began to suffer some of the most baffling yips in sports history. His shot has gotten so bad that nobody knows whether it’s caused by a physical injury or mental angst. He recently attempted a free throw so poorly that his former shooting coach felt compelled to instantly tell the press that they had stopped working together.\n\nAnd now things have gotten to the point that even Amari Cooper is like, “Wow, I can’t believe Fultz isn’t performing up to the level of production you’d expect from a clearly talented player drafted that highly.” Just brutal, sitting around to eat turkey and getting roasted more deeply than the most burnt bird in America. Somehow, this is 10,000 times worse than the harshest zings your aunt can muster about how you’re still unmarried.\n\nWinner: NFL Starting Quarterbacks\n\nThe NFL’s Thanksgiving games are supposed to serve as a showcase for the sport, a trio of matchups that display the best the league has to offer. Yet instead of featuring the league’s best talent, Thursday’s first two games shined a light on a pair of career backup QBs, as injuries forced Chicago and Washington to play passers who hadn’t previously started since 2014.\n\nAfter Alex Smith went down with a gruesome season-ending injury, Colt McCoy has taken the reins under center in Washington. McCoy has been on the team’s roster since 2014, backing up Robert Griffin III, Kirk Cousins, and then Smith, but hadn’t actually thrown a pass in a game since 2015. On Thursday, he had to start after just three days of prep. It didn’t go particularly well, as McCoy had three interceptions:\n\nWashington was in sole possession of first place in the NFC East when Smith went down. Two losses later, and it’s now tied atop the division.\n\nIn the early game, Chase Daniel stepped in for usual Bears starter Mitchell Trubisky, who was dealing with a more minor injury but wasn’t ready to go just four days after tweaking his shoulder in a victory against the Vikings on Sunday Night Football. Daniel, like McCoy, hadn’t thrown a pass in a game in years. Yet while McCoy has backed up a rotating cast of quarterbacks in Washington, Daniel has rotated franchises, going from the Chiefs to the Eagles to the Saints before landing with the Bears. When he finally got a chance to play, he held his own: Chicago beat the Lions 23-16, and Daniel threw two touchdowns and zero interceptions.\n\nBut Daniel’s 6.2 yards-per-attempt average reveals that he wasn’t doing a whole lot. He wasn’t able to contribute to the running game in the way Trubisky can, and missed some throws that good quarterbacks make:\n\nDaniel got the win, by which I mean that he played well enough for the Chicago defense to score a game-winning touchdown. Still, as somebody who’s often wondered how good Trubisky is, I came away with a reminder that he remains on the short list of humans capable of effectively playing quarterback in the NFL.\n\nDaniel and McCoy are on an even shorter list of humans: The men who have managed to stay in the NFL for a significant stretch of time without regularly playing. Both have been in the league since 2010, racking up tens of millions of dollars in career earnings despite rarely getting onto the field. There’s a great hustle in pro football for the guys who can pull that off: If you don’t play for long enough, never revealing how good you actually are, you can secure a reputation as a QB Who Knows the System. And if you become a QB Who Knows the System, you can be the focal point of an NFL Thanksgiving Day game.\n\nWhile neither quarterback was catastrophic on Thursday, they also showed themselves to be clear downgrades from their teams’ starters. Trubisky and Smith aren’t the cream of the crop, but this Thanksgiving was a reminder to be thankful for our mediocre QBs—they’re better than backups.\n\nLoser: Jon Gruden\n\nYou’re a good family member. Even if you got too drunk at Thanksgiving and insulted the vast majority of your cousins, that statement still holds true. After all, no matter what you might have said or done, you couldn’t have been as hurtful to a relative as Jon Gruden was to one of his, by trading Cooper to a team in his brother’s division:\n\nAmari Cooper would not be caught!\n\n\n\n(via @NFL)pic.twitter.com/jMRPz0YRnb — Pro Football Focus (@PFF) November 23, 2018\n\nCooper torched Jay Gruden’s Washington defense to the tune of 180 receiving yards and two touchdowns. If there was a Thanksgiving NFL MVP award, he and Brees would be the top candidates. When the Cooper trade was completed in late October, it was generally considered a bad deal for Dallas: Cooper had underwhelmed at the end of his Oakland tenure, and the Cowboys gave up a first-round pick to nab him. That seemed like a colossal overpay considering the Eagles got Golden Tate for a third-rounder and the Patriots got Josh Gordon for a fifth.\n\nBut Cooper won Dallas the game Thursday, giving the Cowboys a share of the division lead behind a pair of spectacular plays that few other receivers could make. Jon Gruden might have gotten a great return for Cooper; the cost was potentially helping knock his brother out of the playoffs.\n\nSpeaking of players who Gruden traded and are now thriving elsewhere, Khalil Mack played for the Bears on Thursday. For the first time in a while, he didn’t post huge statistics. Mack registered no sacks for just the third time all season, and no fumble recoveries for just the fourth. But if you watched the game closely, you know why: Because the Lions were triple-freakin’-teaming him.\n\n.@52Mack_ loves loves loves the attention; 3 guys in some cases, opening up the OPPS for other guys to eat. What a hungry group. 34 sacks, 20 INT’s, 9 fumble recoveries , 6 TD’s New Monsters of the Midway. #BaldysBreakdowns pic.twitter.com/0jvoi307Vz — Brian Baldinger (@BaldyNFL) November 23, 2018\n\nWe should all be thankful for Jon Gruden. The constant comedy provided by his 2-8 Raiders would have been enough, but he also went ahead and made other NFL teams more interesting by sending them his team’s best players. This holiday season, he’s the gift that keeps on giving.\n\nWinner: The Bears’ Shuffling Crew\n\nAfter Kyle Fuller sealed Chicago’s win with a red zone interception Thursday, Prince Amukamara and his teammates began to sing and dance:\n\nBears TD celebration was better than the halftime show pic.twitter.com/zNZ08dVVYz — CJ Fogler (@cjzer0) November 22, 2018\n\nWhen I saw this, I immediately thought: “Oh hell yeah, they’re doing the Super Bowl Shuffle!” You know the “Super Bowl Shuffle”: the song recorded by the 1985 Bears ahead of their Super Bowl championship. The key word there: ahead. It is painfully lo-fi, and painfully 1985. The team runs out of words to rhyme with “shuffle” by the sixth verse. (Backup Steve Fuller goes with the painfully agrammatical, “I’m not here to feathers ruffle,” which is certainly not a sentence.) The video features one guy on the microphone as everyone else snaps and shuffles behind him—like the Bears’ dance routine. This could’ve gone down as an all-time misguided moment in the history of athletes’ musical decisions. Since the Bears won that Super Bowl, though, it became a classic. It even got nominated for a Grammy, losing out to Prince.\n\nFollowing Thursday’s game, Amukamara explained that his celebration wasn’t a shout-out to the ’85 Bears—it was a nod to Motown acts like the Temptations, since the game was in Detroit. I should’ve known: No ’85 Bear attempted any moves as snazzy as the little spin Amukamara pulls.\n\nStill, it’s worth noting that so many of us thought this was an homage to the “Super Bowl Shuffle”—and felt that the dance was deserved. This Bears team is on a five-game win streak and appears to be a near-lock for the playoffs. It would’ve been lame if one of the 5-11 or 3-13 Chicago teams of the past four years attempted this tribute. While these Bears weren’t recreating the “Super Bowl Shuffle,” Sunday made me realize they’re good enough to do so without blaspheming their forebears.\n\nWinner: Turkey Day Beef\n\nThanksgiving isn’t just the NFL’s day. It’s one of a few days shared by pro games and significant college matchups, as Thursday is traditionally the beginning of college football’s rivalry week. That includes the Egg Bowl between Ole Miss and Mississippi State. These neighbors, like so many neighbors, hate virtually everything about each other, and got into a big brawl that resulted in one of the most beautiful penalty descriptions you’ll ever hear: “Unsportsmanlike conduct, on all players from both teams.”\n\nThey're handing out two pieces with a biscuit at the Egg Bowl pic.twitter.com/DQPOXYCZ3g — CJ Fogler (@cjzer0) November 23, 2018\n\n\"Unsportsmanlike conduct on all players from both teams.\"\n\n\n\nThe Egg Bowl got a little heated. pic.twitter.com/APHeah1QRw — ESPN (@espn) November 23, 2018\n\nGiving an unsportsmanlike penalty to every damn player in the stadium is a somewhat common way to handle a big college ruckus, and recently led to a quarterback who wasn’t even involved in a brawl getting ejected for his “second” unsportsmanlike penalty of a game. But I don’t think I’ve ever heard a ref describe it like this.\n\nRivalry week is just like Thanksgiving: It’s the one time each year that you are obligated to be in a room with that person you absolutely can’t stand, and you let months’ worth of petty remarks slip over the course of a couple of hours. Most of the time this doesn’t erupt into full-out conflict, as nobody wants to make a scene. But Thursday everything boiled over and the Rebels and Bulldogs started wrestling at the dinner table. That’s what great about rivalry week: Unlike most family debacles, this is nationally televised.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/inm7z-kGK7MYkdskZQ5a07J2PO0=/0x0:2831x1482/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13465199/amari_lead.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/thumbor/43ejQ6U-7SCAficV0WCb7naB4g0=/0x0:2831x2003/1200x800/filters:focal(1169x155:1621x607)/cdn.vox-cdn.com/uploads/chorus_image/image/62387361/amari_lead.0.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/inm7z-kGK7MYkdskZQ5a07J2PO0=/0x0:2831x1482/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13465199/amari_lead.jpg", "keywords": [], "authors": ["Rodger Sherman", "Liz Kelly", "Kate Halliwell", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "Nov"], "canonical_link": "https://www.theringer.com/nfl/2018/11/23/18108886/thanksgiving-day-football-winners-losers", "title": "The Winners and Losers From Thanksgiving Day Football", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2018-11-23T12:36:17-05:00", "modified_time": "2018-11-23T12:36:17-05:00"}, "author": "Rodger Sherman", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Turkey Day was good for undrafted NFL players and creative celebrations. It wasn’t so great for Markelle Fultz.", "og": {"description": "Turkey Day was good for undrafted NFL players and creative celebrations. It wasn’t so great for Markelle Fultz.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/inm7z-kGK7MYkdskZQ5a07J2PO0=/0x0:2831x1482/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13465199/amari_lead.jpg", "height": 630, "width": 1200}, "site_name": "The Ringer", "title": "The Winners and Losers From Thanksgiving Day Football", "type": "article", "url": "https://www.theringer.com/nfl/2018/11/23/18108886/thanksgiving-day-football-winners-losers"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/nfl/2018/11/23/18108886/thanksgiving-day-football-winners-losers", "title": "The Winners and Losers From Thanksgiving Day Football", "description": "Turkey Day was good for undrafted NFL players and creative celebrations. It wasn’t so great for Markelle Fultz.", "image": "https://cdn.vox-cdn.com/thumbor/gb5f3_L3foeH2ZDvqqVbEBKqE4Y=/0x0:2831x1416/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/13465199/amari_lead.jpg", "site": "ringer"}, "sailthru.title": "The Winners and Losers From Thanksgiving Day Football", "sailthru.tags": "general,the-ringer,front-page,nfl,sports", "sailthru.description": "Turkey Day was good for undrafted NFL players and creative celebrations. It wasn’t so great for Markelle Fultz.", "sailthru.date": "2018-11-23T12:36:17-05:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/-6RJnC0XG9nO6zj1VBTSQqYJ65Q=/0x0:2831x1592/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/62387360/amari_lead.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/KQIJZPlxML3E4_mAumrcYoNd9IY=/394x0:2397x2003/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/62387360/amari_lead.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1542902400.0, "source": "https://www.theringer.com", "summary": ""}