{"url": "https://www.essence.com/celebrity/black-celeb-couples/tamar-braxton-divorce-vincent-herbert-instagram-meltdown/", "text": "It’s been nearly four months since Tamar Braxton filed for divorce from her husband, Vincent Herbert and since the news broke, rumors of a secret love child and domestic abuse have bubbled over. There was even a social media meltdown. Though the singer is finally ready to clear the air.\n\nSitting down with the ladies of The View, the Grammy-nominated reality star shared the status of her relationship with Herbert and spilled the tea who fueled allegations that caused her Instagram hiatus.\n\n“I have a regular marriage and in regular marriages just like everyone else, things happen, you know. In my marriage, it was just to a point where I felt like divorce was the only option I had left,” she said. Herbert sat in the audience listening attentively as his former partner continued. “Although we’re in extensive counseling and that is much needed and it always will be, I think the bigger picture of everything is that we have a responsibility to my amazing 4-year-old son, just to raise him in the most comfortable, amazing, loving and secure household that we can—that’s why we don’t live together,” she said.\n\nBraxton filed for divorce in October just a month after she announced that her most recent album, Bluebird of Happiness, would be her last so that she could take time off to work on her marriage. The couple married in November of 2008 and welcomed their only child together, Logan, in June 2013.\n\nMany believed that the timing of the divorce announcement was strictly for ratings to promote the fifth season of the couple’s WEtv reality series, Tamar & Vince but the 40-year-old insists that that is far from the truth.\n\n“I wish I could say that a lot of times I could say it was made up just so I could hide behind the truth sometimes. But in this situation, I absolutely have no reason to lie about my marriage or the things that [are] happening in my marriage for ratings. I think that’s disgusting and I would never sell my soul to the devil like that. It’s not that serious. Marriage is a serious thing for me and for my family.”\n\nNasty allegations also ensued after news broke that Braxton filed for divorce and was only fueled more when the reality star took to Instagram to accuse Herbert of cheating and getting another woman pregnant.\n\nAfter learning that it was merely a rumor shared with her by someone she believed was her friend, the Maryland native took a hiatus from the ‘Gram. Although she’s since returned to the social media site, she said the incident taught her a very valuable lesson.\n\n“Here’s the thing about people being in your business. Keep people out your business,” she said before addressing her social media meltdown which prompted her to take a break from Instagram. “It was my fault where I put myself in a position where I opened up the floor for people to give their opinions on my marriage. I have to take responsibility for that. And you also have to take responsibility for telling too much of your business. Because people always feel like they can tell you this, they have a hand in this or ‘oh, girl, did you hear about what happened?’ but not everyone wants to see you happy…I do air my dirty laundry, however, I’ve never been that specific and I should’ve been specific enough to say, ‘well this is what my so-called friends were saying.’”\n\nHerbert joined his estranged wife and business partner on stage to set the record straight about the allegations and made a public vow about his devotion to their family.\n\n“Absolutely not,” he responded when asked if there was a bun in the oven of another woman. And all the other allegations are not true. I’m just not that kind of person. I love this lady with all my heart and I love my family with all my heart and I will never stop fighting for my family and trying to be great.”\n\nAs for the future, neither Braxton or Herbert know what it holds but they both make it clear that their main priority will always and forever be the wellbeing of their son.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.essence.com/wp-content/uploads/2020/02/rgb-TAG-Registered-80px.png", "https://www.essence.com/wp-content/uploads/2017/09/image/2017/09/main/tamar.jpg?width=1472&height=1472", "https://www.essence.com/wp-content/uploads/2017/09/image/2017/09/main/tamar-900x600.jpg"], "top_img": "https://www.essence.com/wp-content/uploads/2017/09/image/2017/09/main/tamar-900x600.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.essence.com/celebrity/black-celeb-couples/tamar-braxton-divorce-vincent-herbert-instagram-meltdown/", "title": "Tamar Braxton Talks Divorce From Husband Vincent Herbert And Instagram Meltdown", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The songstress kept it real about the lesson she learned following her Instagram meltdown and the music exec spoke on rumors of a secret love child.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "<p>Tamar Braxton And Vincent Herbert Discuss Their Marriage Rumors And Divorce Together For First Time Ever</p>", "description": "The songstress kept it real about the lesson she learned following her Instagram meltdown and the music exec spoke on rumors of a secret love child.", "url": "https://www.essence.com/celebrity/black-celeb-couples/tamar-braxton-divorce-vincent-herbert-instagram-meltdown/", "site_name": "Essence", "image": {"identifier": "https://www.essence.com/wp-content/uploads/2017/09/image/2017/09/main/tamar-900x600.jpg", "secure_url": "https://www.essence.com/wp-content/uploads/2017/09/image/2017/09/main/tamar-900x600.jpg"}}, "article": {"publisher": "https://www.facebook.com/essence"}, "fb": {"app_id": 2453509358209265}, "twitter": {"card": "summary_large_image", "description": "The songstress kept it real about the lesson she learned following her Instagram meltdown and the music exec spoke on rumors of a secret love child.", "title": "<p>Tamar Braxton And Vincent Herbert Discuss Their Marriage Rumors And Divorce Together For First Time Ever</p>", "site": "@essence", "creator": "@essence"}, "generator": "WordPress 5.3.2", "wp-parsely_version": "2.0", "msapplication-TileImage": "https://www.essence.com/wp-content/uploads/2018/04/cropped-essence-fav-icon-270x270.png"}, "movies": [], "publish_date": null, "source": "https://www.essence.com", "summary": ""}