{"url": "www.vividseats.com/concerts/blake-nation-blake-shelton-tribute-tickets.html", "text": "Blake Nation - Blake Shelton Tribute Ticket Information\n\nAn incredible evening of music is always in store when you experience Blake Nation - Blake Shelton Tribute live. Browse the tour schedule above for upcoming Blake Nation - Blake Shelton Tribute concerts at a venue near you. Pertinent event details will be populated on the page as they become available, including date, location, venue, co-headliners, and more. You also can get in touch with our customer support team at any time while shopping for Blake Nation - Blake Shelton Tribute tickets. Call 866.848.8499 or connect to Live Chat seven days a week for personalized help from a Vivid Seats team member. From one-off shows to major nationwide tours, music festival sets, and more, you won't want to miss out on seeing Blake Nation - Blake Shelton Tribute in concert.\n\nTo place an order today, just find the Blake Nation - Blake Shelton Tribute tickets for the show of your choice, and then press its respective \"Tickets\" button to advance to the next step in the buying process. Depending on the show, there will either be a venue-specific seating chart displaying the event's expected layout, or an indication of general admission. You'll be able to sort Blake Nation - Blake Shelton Tribute tickets according to various filters including price, to ensure you find just the right listing for you. Once you've made a selection, press the \"Buy\" link to begin the safe and secure online checkout process. If there isn't a Blake Nation - Blake Shelton Tribute tour to check out, you can browse our selection of concert tickets for seats to all the latest live events taking place from coast to coast. Under our 100% Buyer Guarantee, all confirmed ticket orders come with the assurance of on-time delivery and authenticity.", "images": ["http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1036714031/?label=5xFeCIPTyAIQr4Cs7gM&guid=ON&script=0", "https://a.vsstatic.com/layout/placeholder_pixel.png", "https://a.vsstatic.com/common/logo/logo-og-image.png", "https://a.vsstatic.com/common/shopper-approved.png", "https://a.vsstatic.com/common/newsweek-best-service-2020.png"], "top_img": "https://a.vsstatic.com/common/logo/logo-og-image.png", "keywords": [], "authors": [], "canonical_link": "https://www.vividseats.com/concerts/blake-nation-blake-shelton-tribute-tickets.html", "title": "Blake Nation - Blake Shelton Tribute Tickets", "meta_data": {"viewport": "width=device-width,initial-scale=1.0,maximum-scale=1.0,minimum-scale=1.0,user-scalable=no", "og": {"site_name": "Vivid Seats", "image": "https://a.vsstatic.com/common/logo/logo-og-image.png"}, "apple-mobile-web-app-capable": "yes", "format-detection": "telephone=yes", "apple-mobile-web-app-title": "Vivid Seats", "application-name": "Vivid Seats", "msapplication-TileColor": "#333333", "msapplication-config": "//a.vsstatic.com/common/favicon/browserconfig.xml", "theme-color": "#ffffff", "keywords": "Blake Nation - Blake Shelton Tribute tickets", "description": "Find Blake Nation - Blake Shelton Tribute tickets at Vivid Seats. Blake Nation - Blake Shelton Tribute tour schedule and Blake Nation - Blake Shelton Tribute ticket information.", "google-play-app": "app-id=com.vividseats.android", "itunes": "app-id=963355757"}, "movies": [], "publish_date": null, "source": "http://www.vividseats.com", "summary": ""}