{"url": "https://www.thedailybeast.com/miss-usa-2017-clarifies-controversial-stance-on-feminism-im-all-about-womens-rights", "text": "Not since Alicia Machado became the breakout star of the first presidential debate seven months ago—that’s half a century in Trump news cycle years—have the disparate worlds of pageantry and politics been so intertwined. Kára McCullough, our new reigning Miss USA, sparked controversy during Sunday night’s crowning due to her polarizing opinions on two separate issues: feminism and health care. Unlike so many of our elected politicians, McCullough’s soundbites were definitive, articulate, and to the point. But it was the content of McCullough’s politics, not her delivery, that left viewers sounding off on social media well into Monday morning. To recap, Miss District of Columbia became an unconventional alt-right darling by insisting that health care is a privilege, not a right. “I’m definitely going to say it is a privilege,” McCullough offered during the 30-second question and answer portion of the pageant. “As a government employee, I am granted health care and I see firsthand that to have health care, you need to have jobs.”\n\nMuch to the chagrin of Twitter eggs everywhere, the 25-year-old McCullough has since clarified her position on health care, explaining on Good Morning America that, “I am privileged to have health care and I do believe that it should be a right, and I hope and pray moving forward that health care is a right for all worldwide.” But McCullough is less likely to backtrack on her other controversial opinion of the night—the revelation that she self-identifies not as a feminist, but as an equalist. “I try not to consider myself this die-hard, like, I don’t really care about men,” she infamously insisted on Sunday night’s broadcast. During a victory tour interview at the top of New York’s Empire State Building, a wind-blown McCullough (complete with sash and crown) doubles down on her decision to identify as an equalist. “I’m just about being equal,” McCullough tells The Daily Beast, before insisting that, “I’m all about women’s rights.”\n\nAs a scientist at the U.S. Nuclear Regulatory Commission with a degree in radiochemistry, McCullough has experience succeeding in a traditionally male-dominated field. In fact, she’s consistently spoken out about the importance of supporting women and girls in STEM, a platform that, for many, made her reluctance to call herself a feminist even more surprising. Still, McCullough insists, “I do want to see women flourish in just every aspect of life, whether it is in the medical sciences, or whether it’s in the government agencies and in STEM. I’m just saying in total we have to look at ourselves as, ‘we are equal.’” McCullough pauses and smiles before reaching for a pageant conclusion: “Women have made so many strides, and I’m looking forward to this next generation of women coming up.”\n\nEqualism aside, McCullough has been heralded as an outstanding role model on multiple fronts: not just as a black female scientist, but as a pageant beauty who insists on wearing her natural curls. McCullough concedes that in a time when images of natural black hair are still under-represented in pop culture, her decision was, of course, a deliberate one. “When I came to the conclusion to wear my hair natural, I wanted to be authentic,” she explains. “And I feel the most liberated and happy with my natural curly hair. Typically, you don’t really see women on the pageant stage with their natural hair. You’re always told to straighten your hair, that it looks more professional, it looks more put together.” McCullough stops just short of explaining the racism intrinsic to this particular brand of pageant advice—we are at an Empire State Building press junket, after all—and chooses her next words carefully. “I wasn’t necessarily trying to challenge the status quo,” she continues. “I just wanted to be comfortable. And that’s the message that I want to send to so many young women: do what makes you comfortable.”\n\nTen years ago, Miss USA would most likely be answering questions about her exercise routine or her favorite home-cooked meal. But, perhaps given the pageant’s history as a part of Donald Trump’s extensive entertainment portfolio, politics appear to have become a part of the competition. McCullough seems up to the challenge of wearing the crown during one of the most turbulent political moments in recent memory. In fact, she’s excited that Sunday’s Miss USA amounted to more than just channel surfing fodder. “We’re starting a conversation!” She exclaims. “We’re pressing on issues that are prominent in our nation right now…Everyone has an opinion, and I’m glad.”\n\nMcCullough insists that while “I don’t have a political agenda, I’m not trying to be a politician,” she’s open to using her platform to discuss more political issues in the future. “If matters are pressing on my heart, and I feel as if I’m the one involved in that type of situation, then sure, I’ll speak out about it,” she offers, before concluding that, “I’m just trying to go with the flow.”\n\nAs for her personal reaction to all of the backlash her pageant responses elicited, from doting conservatives to disappointed liberals, our reigning Miss USA has a perfectly patriotic answer: “That’s what social media’s about, and that’s what America’s about.” Land of freedom of expression, and home of the tweets.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494979466/170516-zimmerman-miss-usa-tease_gvak4z", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1494979466/170516-zimmerman-miss-usa-tease_gvak4z", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494979466/170516-zimmerman-miss-usa-tease_gvak4z", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/miss-usa-2017-clarifies-controversial-stance-on-feminism-im-all-about-womens-rights", "title": "Miss USA Kara McCullough Clarifies Controversial Stance on Feminism: ‘I’m All About Women’s Rights’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Miss USA Kara McCullough Clarifies Controversial Stance on Feminism: ‘I’m All About Women’s Rights’", "keywords": "Miss USA", "og": {"title": "Miss USA Kara McCullough Clarifies Controversial Stance on Feminism: ‘I’m All About Women’s Rights’", "description": "Newly crowned Miss USA Kára McCullough denounced the word “feminism” during Sunday night’s pageant, but tells The Daily Beast, “I’m just about being equal.”", "url": "https://www.thedailybeast.com/articles/2017/05/16/miss-usa-2017-clarifies-controversial-stance-on-feminism-im-all-about-womens-rights", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494979466/170516-zimmerman-miss-usa-tease_gvak4z"}, "description": "Newly crowned Miss USA Kára McCullough denounced the word “feminism” during Sunday night’s pageant, but tells The Daily Beast, “I’m just about being equal.”", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-05-17T08:00:00.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1494979466/170516-zimmerman-miss-usa-tease_gvak4z"}, "sailthru.date": "2017-05-17T08:00:00.000Z", "sailthru.expire_date": "2017-05-31T08:00:00.000Z", "publicationDate": 201705170800, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/miss-usa-2017-clarifies-controversial-stance-on-feminism-im-all-about-womens-rights\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"EQUALIST\"},\"post_id\":\"articles/2017/05/16/miss-usa-2017-clarifies-controversial-stance-on-feminism-im-all-about-womens-rights\",\"pub_date\":\"2017-05-17T08:00:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Miss USA\",\"typeArticle\"],\"title\":\"Miss USA Kara McCullough Clarifies Controversial Stance on Feminism: ‘I’m All About Women’s Rights’\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1495008000.0, "source": "https://www.thedailybeast.com", "summary": ""}