{"url": "https://www.complex.com/pop-culture/2018/10/elizabeth-olsen-avengers-4-things-are-only-going-to-get-worse", "text": "If the ending of Avengers: Infinity War left you fucked up for the rest of the day (or week) then you may once again find yourself in a state of emotional vulnerability when the tentatively titled Avengers 4 comes out next May, at least according to the Scarlet Witch.\n\nWe say that because Elizabeth Olsen stated as much (though unlike Mark Ruffalo she kept it vague) during this past weekend's ACE ComicCon in Chicago, where she was on hand with Tom Hiddleston/Loki to answer fan questions about the billion dollar series. Anyway, this would be a good time to mention there are spoilers in the rest of this post, though it's likely you already know or don't care if you haven't seen Infinity War by now.\n\nAccording to Comicbook.com, Olsen and Hiddleston were talking about the bleak ending to that film, and the sacrifices each of their characters made, when Hiddleston referred to Scarlet Witch killing her ill-fated lover, Vision, to prevent Thanos from acquiring the Mind Stone. While she was able to destroy it (which killed Vision), Thanos figured out a way to assemble his Infinity Gauntlet by using the Time Stone to reverse those actions to get the Mind Stone anyway (while also killing Vision a second time in front of her, damn). As if that wasn't bad enough, Scarlet Witch was also one of the people who disintegrates at the end.\n\nWhile that would seem like a harsh fate, it was at that point that Olsen told the crowd: \"It’s only going to get worse.\"\n\nOlsen had previously stated that the plot was kept a secret from the cast until the directing Russo brothers, Joe and Anthony, shot it. But since that work's been done, and re-shoots have been completed, the cast is now aware of how things turn out.\n\n\"I found out from the Russos exactly what was going to happen, and it wasn’t until we shot it on that day we learned what the ending was,\" Olsen said. \"They took us into a van – all of us – we were in a van with air conditioning because it was very hot, and they told us how the movie was going to end, and no one knew. And they were like ‘Now we’re shooting it, Go!’ and we were like ‘How are we supposed to interpret that?’\"\n\nMarvel Studios boss Kevin Feige also said that the film will conclude the past decade of Marvel films that have been building to this moment. \"The entire intention of Infinity War and the next Avengers film next year was to have an ending — to bring a conclusion to 10-plus years, 22-movie narrative in a way that hadn’t been done before in this particular type of film,\" he said to Uproxx. “It doesn’t mean the MCU is coming to a close, by any means. But it means the narrative that started when we began 10 years ago will have a conclusion.”\n\nSo it would seem that all this line from Olsen could do was prep you to emote if you're the type of person who does that sort of thing at movie theaters. Or, we guess, it could also lead to you being sorely disappointed if the next Avengers doesn't line up with the sky high expectations that they've set themselves up for. Either/or.\n\nIt also falls in line with the tone of Avengers-related news that has seeped out, including a prediction that Tony Stark will die (from Iron Man writer Bob Layton), and also Chris Evans' Twitter message about playing Captain America.\n\nThe movie comes out on May 3, 2019 so...the hype hasn't really even started yet is what we're saying.", "images": ["https://images.complex.com/complex/image/upload/t_author_pic/gmppbjr0zek10c5platl.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=6685975&cv=2.0&cj=1", "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/d94gilxfo8xlog7xa1rn/avengers-four", "https://images.complex.com/complex/images/c_fill,dpr_auto,f_auto,q_90,w_1400/fl_lossy,pg_1/d94gilxfo8xlog7xa1rn/avengers-four", "https://images.complex.com/complex/image/upload/v1580766573/FFFFFF-1_cyvbjp.png"], "top_img": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/d94gilxfo8xlog7xa1rn/avengers-four", "keywords": [], "authors": ["Gavin Evans"], "canonical_link": "https://www.complex.com/pop-culture/2018/10/elizabeth-olsen-avengers-4-things-are-only-going-to-get-worse", "title": "Elizabeth Olsen on What to Expect From 'Avengers 4': 'Things Are Only Going to Get Worse'", "meta_data": {"google-site-verification": "ICK39wBGvCQQMHpEUykVHWF8Ox_0MME-_qxe6ixFUik", "theme-color": "#000000", "description": "The Scarlet Witch herself (Elizabeth Olsen) says things are \"only going to get worse\" in 'Avengers 4.'", "og": {"type": "website", "title": "Elizabeth Olsen on What to Expect From 'Avengers 4': 'Things Are Only Going to Get Worse'", "description": "The Scarlet Witch herself (Elizabeth Olsen) says things are \"only going to get worse\" in 'Avengers 4.'", "url": "https://www.complex.com/pop-culture/2018/10/elizabeth-olsen-avengers-4-things-are-only-going-to-get-worse", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/d94gilxfo8xlog7xa1rn/avengers-four", "site_name": "Complex"}, "fb": {"app_id": 310521533114641, "pages": 117696581735620}, "twitter": {"card": "summary_large_image", "title": "Elizabeth Olsen on What to Expect From 'Avengers 4': 'Things Are Only Going to Get Worse'", "description": "The Scarlet Witch herself (Elizabeth Olsen) says things are \"only going to get worse\" in 'Avengers 4.'", "url": "https://www.complex.com/pop-culture/2018/10/elizabeth-olsen-avengers-4-things-are-only-going-to-get-worse", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,h_300,q_auto,w_600/fl_lossy,pg_1/d94gilxfo8xlog7xa1rn/avengers-four", "site": {"id": 13049362}}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.complex.com", "summary": ""}