{"url": "https://en.wikipedia.org/wiki/Michael_Jordan", "text": "American basketball player and businessman\n\nThis article is about the American basketball player. For other people with the same name, see Michael Jordan (disambiguation)\n\nMichael Jeffrey Jordan (born February 17, 1963), also known by his initials MJ,[7] is an American former professional basketball player and the principal owner of the Charlotte Hornets of the National Basketball Association (NBA). He played 15 seasons in the NBA, winning six championships with the Chicago Bulls. His biography on the official NBA website states: \"By acclamation, Michael Jordan is the greatest basketball player of all time.\"[8] He was one of the most effectively marketed athletes of his generation and was considered instrumental in popularizing the NBA around the world in the 1980s and 1990s.[9]\n\nJordan played three seasons for coach Dean Smith with the North Carolina Tar Heels. As a freshman, he was a member of the Tar Heels' national championship team in 1982. Jordan joined the Bulls in 1984 as the third overall draft pick,[2] and quickly emerged as a league star and entertained crowds with his prolific scoring. His leaping ability, demonstrated by performing slam dunks from the free throw line in Slam Dunk Contests, earned him the nicknames \"Air Jordan\" and \"His Airness\". He also gained a reputation for being one of the best defensive players in basketball.[10] In 1991, he won his first NBA championship with the Bulls, and followed that achievement with titles in 1992 and 1993, securing a \"three-peat\". Although Jordan abruptly retired from basketball before the 1993–94 NBA season and started a new career in Minor League Baseball, he returned to the Bulls in March 1995 and led them to three additional championships in 1996, 1997, and 1998, as well as a then-record 72 regular-season wins in the 1995–96 NBA season. He retired for a second time in January 1999 but returned for two more NBA seasons from 2001 to 2003 as a member of the Washington Wizards.\n\nJordan's individual accolades and accomplishments include six NBA Finals Most Valuable Player (MVP) Awards, ten scoring titles (both all-time records), five MVP Awards, ten All-NBA First Team designations, nine All-Defensive First Team honors, fourteen NBA All-Star Game selections, three All-Star Game MVP Awards, three steals titles, and the 1988 NBA Defensive Player of the Year Award. He holds the NBA records for highest career regular season scoring average (30.12 points per game) and highest career playoff scoring average (33.45 points per game). In 1999, he was named the greatest North American athlete of the 20th century by ESPN, and was second to Babe Ruth on the Associated Press' list of athletes of the century. Jordan is a two-time inductee into the Naismith Memorial Basketball Hall of Fame, having been enshrined in 2009 for his individual career and again in 2010 as part of the group induction of the 1992 United States men's Olympic basketball team (\"The Dream Team\"). He became a member of the FIBA Hall of Fame in 2015.\n\nJordan is also known for his product endorsements. He fueled the success of Nike's Air Jordan sneakers which were introduced in 1984 and remain popular today.[11] Jordan also starred as himself in the 1996 film Space Jam. In 2006, he became part-owner and head of basketball operations for the Charlotte Bobcats (now Hornets) and bought a controlling interest in 2010. In 2014, Jordan became the first billionaire player in NBA history. With a net worth of $2.1 billion, he is the fourth-richest African-American, behind Robert F. Smith, David Steward, and Oprah Winfrey.\n\nEarly life\n\nJordan going in for a slam-dunk for the Laney High School varsity basketball team, 1979–80\n\nJordan was born at Cumberland Hospital in Fort Greene, Brooklyn,[12] to Deloris (née Peoples), who worked in banking, and James R. Jordan Sr., an equipment supervisor. His family moved to Wilmington, North Carolina, when he was a toddler.[13]\n\nJordan attended Emsley A. Laney High School in Wilmington, where he highlighted his athletic career by playing basketball, baseball, and football. He tried out for the varsity basketball team during his sophomore year, but at 5'11\" (1.80 m), he was deemed too short to play at that level. His taller friend, Harvest Leroy Smith, was the only sophomore to make the team.[14][15]\n\nMotivated to prove his worth, Jordan became the star of Laney's junior varsity team, and tallied several 40-point games.[14] The following summer, he grew four inches (10 cm) and trained rigorously.[8][15] Upon earning a spot on the varsity roster, Jordan averaged more than 25 points per game (ppg) over his final two seasons of high school play.[16] As a senior, he was selected to play in the 1981 McDonald's All-American Game and scored 30 points,[17][18] after averaging 27 points,[16] 12 rebounds[19][20] and 6 assists per game for the season.[20][21][22]\n\nJordan was recruited by numerous college basketball programs, including Duke, North Carolina, South Carolina, Syracuse, and Virginia.[23] In 1981, Jordan accepted a basketball scholarship to the University of North Carolina at Chapel Hill, where he majored in cultural geography.[24]\n\nCollege career\n\nJordan's number 23 jersey among others in the rafters of the Dean Smith Center\n\nAs a freshman in coach Dean Smith's team-oriented system, he was named ACC Freshman of the Year after he averaged 13.4 ppg on 53.4% shooting (field goal percentage).[25] He made the game-winning jump shot in the 1982 NCAA Championship game against Georgetown, which was led by future NBA rival Patrick Ewing.[8] Jordan later described this shot as the major turning point in his basketball career.[26] During his three seasons with the Tar Heels, he averaged 17.7 ppg on 54.0% shooting, and added 5.0 rpg.[27] He was selected by consensus to the NCAA All-American First Team in both his sophomore (1983) and junior (1984) seasons. After winning the Naismith and the Wooden College Player of the Year awards in 1984, Jordan left North Carolina one year before his scheduled graduation to enter the 1984 NBA draft. The Chicago Bulls selected Jordan with the third overall pick, after Hakeem Olajuwon (Houston Rockets) and Sam Bowie (Portland Trail Blazers). One of the primary reasons why Jordan was not drafted sooner was because the first two teams were in need of a center.[28] However, Trail Blazers general manager Stu Inman contended that it was not a matter of drafting a center, but more a matter of taking Sam Bowie over Jordan, in part because Portland already had Clyde Drexler, who was a guard with similar skills to Jordan.[29] ESPN, citing Bowie's injury-laden college career, named the Blazers' choice of Bowie as the worst draft pick in North American professional sports history.[30] Jordan returned to North Carolina to complete his degree in 1986.[31] He graduated the same year with a Bachelor of Arts degree in geography.[32]\n\nProfessional career\n\nEarly NBA years (1984–1987)\n\nDuring his rookie season with the Bulls, Jordan averaged 28.2 ppg on 51.5% shooting,[25] and helped make a team that had won 35% of games in the previous three seasons playoff contenders. He quickly became a fan favorite even in opposing arenas,[33][34][35] Roy S. Johnson of The New York Times described him as \"the phenomenal rookie of the Bulls\" in November,[35] and Jordan appeared on the cover of Sports Illustrated with the heading \"A Star Is Born\" in December.[36][37] The fans also voted in Jordan as an All-Star starter during his rookie season.[8] Controversy arose before the All-Star game when word surfaced that several veteran players—led by Isiah Thomas—were upset by the amount of attention Jordan was receiving.[8] This led to a so-called \"freeze-out\" on Jordan, where players refused to pass the ball to him throughout the game.[8] The controversy left Jordan relatively unaffected when he returned to regular season play, and he would go on to be voted Rookie of the Year.[38] The Bulls finished the season 38–44[39] and lost to the Milwaukee Bucks in four games in the first round of the playoffs.[38]\n\nJordan's second season was cut short when he broke his foot in the third game of the year, causing him to miss 64 games.[8] The Bulls made the playoffs despite Jordan's injury and a 30–52 record, at the time the fifth worst record of any team to qualify for the playoffs in NBA history.[39][40] Jordan recovered in time to participate in the postseason and performed well upon his return. Against a 1985–86 Boston Celtics team that is often considered one of the greatest in NBA history,[41] Jordan set the still-unbroken record for points in a playoff game with 63 in Game 2.[42] The Celtics, however, managed to sweep the series.[38]\n\nJordan had completely recovered in time for the 1986–87 season,[43] and he had one of the most prolific scoring seasons in NBA history. He became the only player other than Wilt Chamberlain to score 3,000 points in a season, averaging a league high 37.1 points on 48.2% shooting.[25][44] In addition, Jordan demonstrated his defensive prowess, as he became the first player in NBA history to record 200 steals and 100 blocked shots in a season.[45] He also became the third player in NBA History to have made 830 or more free throws in a single season, joining Jerry West and Wilt Chamberlain, as he knocked down 833 free throws throughout the season. No player have reached that plateau since then.[46]\n\nDespite Jordan's success, Magic Johnson won the league's Most Valuable Player Award. The Bulls reached 40 wins,[39] and advanced to the playoffs for the third consecutive year. However, they were again swept by the Celtics.[38]\n\nPistons roadblock (1987–1990)\n\nJordan (center) in 1987\n\nJordan again led the league in scoring during the 1987–88 season, averaging 35.0 ppg on 53.5% shooting[25] and won his first league MVP Award. He was also named the Defensive Player of the Year, as he had averaged 1.6 blocks and a league high 3.16 steals per game.[47] The Bulls finished 50–32,[39] and made it out of the first round of the playoffs for the first time in Jordan's career, as they defeated the Cleveland Cavaliers in five games.[48] However, the Bulls then lost in five games to the more experienced Detroit Pistons,[38] who were led by Isiah Thomas and a group of physical players known as the \"Bad Boys\".[49]\n\nIn the 1988–89 season, Jordan again led the league in scoring, averaging 32.5 ppg on 53.8% shooting from the field, along with 8 rpg and 8 apg.[25] The Bulls finished with a 47–35 record,[39] and advanced to the Eastern Conference Finals, defeating the Cavaliers and New York Knicks along the way. The Cavaliers series included a career highlight for Jordan when he hit The Shot over Craig Ehlo at the buzzer in the fifth and final game of the series.[50] However, the Pistons again defeated the Bulls, this time in six games,[38] by utilizing their \"Jordan Rules\" method of guarding Jordan, which consisted of double and triple teaming him every time he touched the ball.[8]\n\nThe Bulls entered the 1989–90 season as a team on the rise, with their core group of Jordan and young improving players like Scottie Pippen and Horace Grant, and under the guidance of new coach Phil Jackson.[51] On March 28, 1990, Jordan scored a career-high 69 points in a 117–113 road win over the Cavaliers.[52] He averaged a league leading 33.6 ppg on 52.6% shooting, to go with 6.9 rpg and 6.3 apg[25] in leading the Bulls to a 55–27 record.[39] They again advanced to the Eastern Conference Finals after beating the Bucks and Philadelphia 76ers. However, despite pushing the series to seven games, the Bulls lost to the Pistons for the third consecutive season.[38]\n\nFirst three-peat (1991–1993)\n\nIn the 1990–91 season, Jordan won his second MVP award after averaging 31.5 ppg on 53.9% shooting, 6.0 rpg, and 5.5 apg for the regular season.[25] The Bulls finished in first place in their division for the first time in 16 years and set a franchise record with 61 wins in the regular season.[39] With Scottie Pippen developing into an All-Star, the Bulls had elevated their play. The Bulls defeated the New York Knicks and the Philadelphia 76ers in the opening two rounds of the playoffs. They advanced to the Eastern Conference Finals where their rival, the Detroit Pistons, awaited them. However, this time the Bulls beat the Pistons in a four-game sweep.[53][54]\n\nThe Bulls advanced to the NBA Finals for the first time in franchise history to face the Los Angeles Lakers, who had Magic Johnson and James Worthy, two formidable opponents. The Bulls won the series four games to one, and compiled a 15–2 playoff record along the way.[53] Perhaps the best known moment of the series came in Game 2 when, attempting a dunk, Jordan avoided a potential Sam Perkins block by switching the ball from his right hand to his left in mid-air to lay the shot into the basket.[55] In his first Finals appearance, Jordan posted per game averages of 31.2 points on 56% shooting from the field, 11.4 assists, 6.6 rebounds, 2.8 steals, and 1.4 blocks.[56] Jordan won his first NBA Finals MVP award,[57] and he cried while holding the NBA Finals trophy.[58]\n\nJordan and the Bulls continued their dominance in the 1991–92 season, establishing a 67–15 record, topping their franchise record from 1990–91.[39] Jordan won his second consecutive MVP award with averages of 30.1 points, 6.4 rebounds and 6.1 assists per game on 52% shooting.[47] After winning a physical 7-game series over the New York Knicks in the second round of the playoffs and finishing off the Cleveland Cavaliers in the Conference Finals in 6 games, the Bulls met Clyde Drexler and the Portland Trail Blazers in the Finals. The media, hoping to recreate a Magic–Bird rivalry, highlighted the similarities between \"Air\" Jordan and Clyde \"The Glide\" during the pre-Finals hype.[59] In the first game, Jordan scored a Finals-record 35 points in the first half, including a record-setting six three-point field goals.[60] After the sixth three-pointer, he jogged down the court shrugging as he looked courtside. Marv Albert, who broadcast the game, later stated that it was as if Jordan was saying, \"I can't believe I'm doing this.\"[61] The Bulls went on to win Game 1, and defeat the Blazers in six games. Jordan was named Finals MVP for the second year in a row[57] and finished the series averaging 35.8 ppg, 4.8 rpg, and 6.5 apg, while shooting 53% from the floor.[57]\n\nOn January 16, 1993, Jordan scored a season-high 64 points in a home loss to the Orlando Magic.[62] It would be his last career 60-point game. In the 1992–93 season, despite a 32.6 ppg, 6.7 rpg, and 5.5 apg campaign and a second-place finish in Defensive Player of the Year voting,[47][63] Jordan's streak of consecutive MVP seasons ended as he lost the award to his friend Charles Barkley. Coincidentally, Jordan and the Bulls met Barkley and his Phoenix Suns in the 1993 NBA Finals. The Bulls won their third NBA championship on a game-winning shot by John Paxson and a last-second block by Horace Grant, but Jordan was once again Chicago's leader. He averaged a Finals-record 41.0 ppg during the six-game series,[64] and became the first player in NBA history to win three straight Finals MVP awards.[57] He scored more than 30 points in every game of the series, including 40 or more points in 4 consecutive games. With his third Finals triumph, Jordan capped off a seven-year run where he attained seven scoring titles and three championships, but there were signs that Jordan was tiring of his massive celebrity and all of the non-basketball hassles in his life.[65]\n\nGambling\n\nDuring the Bulls' playoff run in 1993, Jordan was seen gambling in Atlantic City, New Jersey, the night before a game against the New York Knicks.[66] The previous year, he admitted that he had to cover $57,000 in gambling losses,[67] and author Richard Esquinas wrote a book in 1993 claiming he had won $1.25 million from Jordan on the golf course.[68] NBA Commissioner David Stern denied in 1995 and 2006 that Jordan's 1993 retirement was a secret suspension by the league for gambling,[69][70] but the rumor spread widely.[71]\n\nIn 2005, Jordan discussed his gambling with Ed Bradley of 60 Minutes and admitted that he made reckless decisions. Jordan stated, \"Yeah, I've gotten myself into situations where I would not walk away and I've pushed the envelope. Is that compulsive? Yeah, it depends on how you look at it. If you're willing to jeopardize your livelihood and your family, then yeah\". When Bradley asked him if his gambling ever got to the level where it jeopardized his livelihood or family, Jordan replied, \"No\".[72] In 2010 Ron Shelton, director of Jordan Rides the Bus, said that he began working on the documentary believing that the NBA had suspended him, but that research \"convinced [him it] was nonsense\".[71]\n\nFirst retirement and stint in Minor League Baseball (1993–1994)\n\nOn October 6, 1993, Jordan announced his retirement, citing a loss of desire to play the game. Jordan later stated that the death of his father three months earlier also shaped his decision.[73] Jordan's father was murdered on July 23, 1993, at a highway rest area in Lumberton, North Carolina, by two teenagers, Daniel Green and Larry Martin Demery, who carjacked his luxury Lexus bearing the license plate \"UNC 0023\".[74][75] His body was dumped in a South Carolina swamp and was not discovered until August 3.[75] The assailants were traced from calls that they made on James Jordan's cell phone.[76] The two criminals were caught, convicted at trial, and sentenced to life in prison. Jordan was close to his father; as a child he had imitated his father's proclivity to stick out his tongue while absorbed in work. He later adopted it as his own signature, displaying it each time he drove to the basket.[8] In 1996, he founded a Chicago area Boys & Girls Club and dedicated it to his father.[77][78]\n\nIn his 1998 autobiography For the Love of the Game, Jordan wrote that he had been preparing for retirement as early as the summer of 1992.[79] The added exhaustion due to the Dream Team run in the 1992 Olympics solidified Jordan's feelings about the game and his ever-growing celebrity status. Jordan's announcement sent shock waves throughout the NBA and appeared on the front pages of newspapers around the world.[80]\n\nJordan then further surprised the sports world by signing a Minor League Baseball contract with the Chicago White Sox on February 7, 1994.[81] He reported to spring training in Sarasota, Florida, and was assigned to the team's minor league system on March 31, 1994.[82] Jordan has stated this decision was made to pursue the dream of his late father, who had always envisioned his son as a Major League Baseball player.[83] The White Sox were another team owned by Bulls owner Jerry Reinsdorf, who continued to honor Jordan's basketball contract during the years he played baseball.[84]\n\nIn 1994, Jordan played for the Birmingham Barons, a Double-A minor league affiliate of the Chicago White Sox, batting .202 with three home runs, 51 runs batted in, 30 stolen bases, 114 strikeouts, 51 base on balls, and 11 errors.[85] He also appeared for the Scottsdale Scorpions in the 1994 Arizona Fall League, batting .252 against the top prospects in baseball.[82] On November 1, 1994, his number 23 was retired by the Bulls in a ceremony that included the erection of a permanent sculpture known as The Spirit outside the new United Center.[86][87][88]\n\n\"I'm back\": Return to the NBA (1995)\n\nIn the 1993–94 season, the Bulls achieved a 55–27 record without Jordan in the lineup,[39] and lost to the New York Knicks in the second round of the playoffs. The 1994–95 Bulls were a shell of the championship team of just two years earlier. Struggling at mid-season to ensure a spot in the playoffs, Chicago was 31–31 at one point in mid-March.[89] The team received help, however, when Jordan decided to return to the Bulls.[90]\n\nIn March 1995, Jordan decided to quit baseball due to the ongoing Major League Baseball strike, as he wanted to avoid becoming a potential replacement player.[91] On March 18, 1995, Jordan announced his return to the NBA through a two-word press release: \"I'm back.\"[8] The next day, Jordan took to the court with the Bulls to face the Indiana Pacers in Indianapolis, scoring 19 points.[92] The game had the highest Nielsen rating of a regular season NBA game since 1975.[93] Although he could have opted to wear his normal number in spite of the Bulls having retired it, Jordan instead wore number 45, as he had while playing baseball.[92]\n\nAlthough he had not played an NBA game in a year and a half, Jordan played well upon his return, making a game-winning jump shot against Atlanta in his fourth game back. He then scored 55 points in the next game against the Knicks at Madison Square Garden on March 28, 1995.[38] Boosted by Jordan's comeback, the Bulls went 13–4 to make the playoffs and advanced to the Eastern Conference Semifinals against the Orlando Magic. At the end of Game 1, Orlando's Nick Anderson stripped Jordan from behind, leading to the game-winning basket for the Magic; he would later comment that Jordan \"didn't look like the old Michael Jordan\"[94] and that \"No. 45 doesn't explode like No. 23 used to.\"[95]\n\nJordan responded by scoring 38 points in the next game, which Chicago won. Before the game, Jordan decided that he would immediately resume wearing his former number, 23. The Bulls were fined $25,000 for failing to report the impromptu number change to the NBA.[95] Jordan was fined an additional $5,000 for opting to wear white sneakers when the rest of the Bulls wore black.[96] He averaged 31 points per game in the series, but Orlando won the series in six games.[27]\n\nSecond three-peat (1995–1998)\n\nJordan was freshly motivated by the playoff defeat, and he trained aggressively for the 1995–96 season.[97] The Bulls were strengthened by the addition of rebound specialist Dennis Rodman, and the team dominated the league, starting the season at 41–3.[98] The Bulls eventually finished with the then-best regular season record in NBA history, 72–10; this record was later surpassed by the 2015–16 Golden State Warriors.[99] Jordan led the league in scoring with 30.4 ppg[100] and won the league's regular season and All-Star Game MVP awards.[8]\n\nIn the playoffs, the Bulls lost only three games in four series (Miami Heat 3–0, New York Knicks 4–1, Orlando Magic 4–0). They defeated the Seattle SuperSonics 4–2 in the NBA Finals to win their fourth championship. Jordan was named Finals MVP for a record fourth time,[57] surpassing Magic Johnson's three Finals MVP awards. He also achieved only the second sweep of the MVP Awards in the All-Star Game, regular season and NBA Finals, Willis Reed having achieved the first, during the 1969–70 season.[38] Because this was Jordan's first championship since his father's murder, and it was won on Father's Day, Jordan reacted very emotionally upon winning the title, including a memorable scene of him crying on the locker room floor with the game ball.[8][58]\n\nIn the 1996–97 season, the Bulls started out 69–11, but missed out on a second consecutive 70-win season by losing their final two games to finish 69–13.[101] However, this year Jordan was beaten for the NBA MVP Award by Karl Malone. The Bulls again advanced to the Finals, where they faced Malone and the Utah Jazz. The series against the Jazz featured two of the more memorable clutch moments of Jordan's career. He won Game 1 for the Bulls with a buzzer-beating jump shot. In Game 5, with the series tied at 2, Jordan played despite being feverish and dehydrated from a stomach virus. In what is known as the \"Flu Game\", Jordan scored 38 points, including the game-deciding 3-pointer with 25 seconds remaining.[102] The Bulls won 90–88 and went on to win the series in six games.[101] For the fifth time in as many Finals appearances, Jordan received the Finals MVP award.[57] During the 1997 NBA All-Star Game, Jordan posted the first triple double in All-Star Game history in a victorious effort; however, he did not receive the MVP award.[103]\n\nJordan and the Bulls compiled a 62–20 record in the 1997–98 season.[39] Jordan led the league with 28.7 points per game,[47] securing his fifth regular-season MVP award, plus honors for All-NBA First Team, First Defensive Team and the All-Star Game MVP.[8] The Bulls won the Eastern Conference Championship for a third straight season, including surviving a seven-game series with the Indiana Pacers in the Eastern Conference Finals; it was the first time Jordan had played in a Game 7 since the 1992 Eastern Conference Semifinals with the Knicks.[104][105] After winning, they moved on for a rematch with the Jazz in the Finals.[106]\n\nThe Bulls returned to the Delta Center for Game 6 on June 14, 1998, leading the series 3–2. Jordan executed a series of plays, considered to be one of the greatest clutch performances in NBA Finals history.[107] With the Bulls trailing 86–83 with 41.9 seconds remaining in the fourth quarter, Phil Jackson called a timeout. When play resumed, Jordan received the inbound pass, drove to the basket, and hit a shot over several Jazz defenders, cutting the Utah lead to 86–85.[107] The Jazz brought the ball upcourt and passed the ball to forward Karl Malone, who was set up in the low post and was being guarded by Rodman. Malone jostled with Rodman and caught the pass, but Jordan cut behind him and took the ball out of his hands for a steal.[107] Jordan then dribbled down the court and paused, eyeing his defender, Jazz guard Bryon Russell. With 10 seconds remaining, Jordan started to dribble right, then crossed over to his left, possibly pushing off Russell,[108][109][110] although the officials did not call a foul. With 5.2 seconds left, Jordan made the climactic shot of his Bulls career.[111] Chicago took an 87–86 lead with his jumper over Russell. Afterwards, the Jazz' John Stockton narrowly missed a game-winning three-pointer. The buzzer sounded and Jordan and the Bulls won their sixth NBA championship,[112] achieving their second three-peat in the decade.[113] Once again, Jordan was voted the Finals MVP,[57] having led all scorers averaging 33.5 points per game, including 45 in the deciding Game 6.[114] Jordan's six Finals MVPs is a record; Shaquille O'Neal, Magic Johnson, LeBron James, and Tim Duncan are tied for second place with three apiece.[57] The 1998 Finals holds the highest television rating of any Finals series in history. Game 6 also holds the highest television rating of any game in NBA history.[115][116]\n\nSecond retirement (1999–2001)\n\nPlaque at the United Center that chronicles Jordan's career achievements\n\nWith Phil Jackson's contract expiring, the pending departures of Scottie Pippen and Dennis Rodman looming, and being in the latter stages of an owner-induced lockout of NBA players, Jordan retired for the second time on January 13, 1999.[117][118][119] On January 19, 2000, Jordan returned to the NBA not as a player, but as part owner and president of basketball operations for the Washington Wizards.[120] Jordan's responsibilities with the Wizards were comprehensive. He controlled all aspects of the Wizards' basketball operations, and had the final say in all personnel matters. Opinions of Jordan as a basketball executive were mixed.[121][122] He managed to purge the team of several highly paid, unpopular players (such as forward Juwan Howard and point guard Rod Strickland),[123][124] but used the first pick in the 2001 NBA draft to select high schooler Kwame Brown, who did not live up to expectations and was traded away after four seasons.[121][125]\n\nDespite his January 1999 claim that he was \"99.9% certain\" that he would never play another NBA game,[58] in the summer of 2001 Jordan expressed interest in making another comeback,[126][127] this time with his new team. Inspired by the NHL comeback of his friend Mario Lemieux the previous winter,[128] Jordan spent much of the spring and summer of 2001 in training, holding several invitation-only camps for NBA players in Chicago.[129] In addition, Jordan hired his old Chicago Bulls head coach, Doug Collins, as Washington's coach for the upcoming season, a decision that many saw as foreshadowing another Jordan return.[126][127]\n\nWashington Wizards comeback (2001–2003)\n\nJordan as a member of the Washington Wizards, April 14, 2003\n\nOn September 25, 2001, Jordan announced his return to the NBA to play for the Washington Wizards, indicating his intention to donate his salary as a player to a relief effort for the victims of the September 11 attacks.[130][131] In an injury-plagued 2001–02 season, he led the team in scoring (22.9 ppg), assists (5.2 apg), and steals (1.42 spg).[8] However, torn cartilage in his right knee ended Jordan's season after only 60 games, the fewest he had played in a regular season since playing 17 games after returning from his first retirement during the 1994–95 season.[25] Jordan started 53 of his 60 games for the season, averaging 24.3 points, 5.4 assists, and 6.0 rebounds, and shooting 41.9% from the field in his 53 starts. His last seven appearances were in a reserve role, in which he averaged just over 20 minutes per game.[132]\n\nPlaying in his 14th and final NBA All-Star Game in 2003, Jordan passed Kareem Abdul-Jabbar as the all-time leading scorer in All-Star Game history (a record since broken by Kobe Bryant).[133] That year, Jordan was the only Washington player to play in all 82 games, starting in 67 of them. He averaged 20.0 points, 6.1 rebounds, 3.8 assists, and 1.5 steals per game.[8] He also shot 45% from the field, and 82% from the free throw line.[8] Even though he turned 40 during the season, he scored 20 or more points 42 times, 30 or more points nine times, and 40 or more points three times.[38] On February 21, 2003, Jordan became the first 40-year-old to tally 43 points in an NBA game.[134] During his stint with the Wizards, all of Jordan's home games at the MCI Center were sold out, and the Wizards were the second most-watched team in the NBA, averaging 20,172 fans a game at home and 19,311 on the road.[135] However, neither of Jordan's final two seasons resulted in a playoff appearance for the Wizards, and Jordan was often unsatisfied with the play of those around him.[136][137] At several points he openly criticized his teammates to the media, citing their lack of focus and intensity, notably that of the number one draft pick in the 2001 NBA draft, Kwame Brown.[136][137]\n\nWith the recognition that 2002–03 would be Jordan's final season, tributes were paid to him throughout the NBA. In his final game at the United Center in Chicago, which was his old home court, Jordan received a four-minute standing ovation.[138] The Miami Heat retired the number 23 jersey on April 11, 2003, even though Jordan never played for the team.[139] At the 2003 All-Star Game, Jordan was offered a starting spot from Tracy McGrady and Allen Iverson,[140] but refused both. In the end, he accepted the spot of Vince Carter.[141]\n\nJordan played in his final NBA game on April 16, 2003, in Philadelphia. After scoring only 13 points in the game, Jordan went to the bench with 4 minutes and 13 seconds remaining in the third quarter and his team trailing the Philadelphia 76ers, 75–56. Just after the start of the fourth quarter, the First Union Center crowd began chanting \"We want Mike!\" After much encouragement from coach Doug Collins, Jordan finally rose from the bench and re-entered the game, replacing Larry Hughes with 2:35 remaining. At 1:45, Jordan was intentionally fouled by the 76ers' Eric Snow, and stepped to the line to make both free throws. After the second foul shot, the 76ers in-bounded the ball to rookie John Salmons, who in turn was intentionally fouled by Bobby Simmons one second later, stopping time so that Jordan could return to the bench. Jordan received a three-minute standing ovation from his teammates, his opponents, the officials, and the crowd of 21,257 fans.[142]\n\nNational team career\n\nJordan on the \"Dream Team\" in 1992\n\nJordan played on two Olympic gold medal-winning American basketball teams. He won a gold medal as a college player in the 1984 Summer Olympics. The team was coached by Bob Knight and featured players such as Patrick Ewing, Sam Perkins, Chris Mullin, Steve Alford, and Wayman Tisdale. Jordan led the team in scoring, averaging 17.1 ppg for the tournament.[143]\n\nIn the 1992 Summer Olympics, he was a member of the star-studded squad that included Magic Johnson and Larry Bird that was dubbed the \"Dream Team\". Jordan was the only player to start all eight games in the Olympics. Playing limited minutes due to the frequent blowouts, Jordan averaged 14.9 ppg,[144] finishing second on the team in scoring.[145] Jordan and fellow Dream Team members Ewing and Mullin are the only American men's basketball players to win Olympic gold medals as amateurs and professionals.[143][144]\n\nPost-retirement\n\nJordan on a golf course in 2007\n\nAfter his third retirement, Jordan assumed that he would be able to return to his front office position as Director of Basketball Operations with the Wizards.[146] However, his previous tenure in the Wizards' front office had produced the aforementioned mixed results and may have also influenced the trade of Richard \"Rip\" Hamilton for Jerry Stackhouse (although Jordan was not technically Director of Basketball Operations in 2002).[121] On May 7, 2003, Wizards owner Abe Pollin fired Jordan as the team's president of basketball operations.[121] Jordan later stated that he felt betrayed, and that if he had known he would be fired upon retiring he never would have come back to play for the Wizards.[72]\n\nJordan kept busy over the next few years. He stayed in shape, played golf in celebrity charity tournaments, and spent time with his family in Chicago. He also promoted his Jordan Brand clothing line and rode motorcycles.[147] Since 2004, Jordan has owned Michael Jordan Motorsports, a professional closed-course motorcycle road racing team that competed with two Suzukis in the premier Superbike championship sanctioned by the American Motorcyclist Association (AMA) until the end of the 2013 season.[148][149]\n\nCharlotte Bobcats/Hornets\n\nOn June 15, 2006, Jordan bought a minority stake in the Charlotte Bobcats, becoming the team's second-largest shareholder behind majority owner Robert L. Johnson. As part of the deal, Jordan took full control over the basketball side of the operation, with the title \"Managing Member of Basketball Operations\".[150] Despite Jordan's previous success as an endorser, he has made an effort not to be included in Charlotte's marketing campaigns.[151] A decade earlier, Jordan had made a bid to become part-owner of Charlotte's original NBA team, the Charlotte Hornets, but talks collapsed when owner George Shinn refused to give Jordan complete control of basketball operations.[152]\n\nIn February 2010, it was reported that Jordan was seeking majority ownership of the Bobcats,[153] who changed their nickname to the Hornets in 2014.[154] As February wore on, it became apparent that Jordan and former Houston Rockets president George Postolos were the leading contenders for ownership of the team. On February 27, the Bobcats announced that Johnson had reached an agreement with Jordan and his group, MJ Basketball Holdings, to buy the team pending NBA approval.[155] On March 17, the NBA Board of Governors unanimously approved Jordan's purchase, making him the first former player to become the majority owner of an NBA team.[156] It also made him the league's only African-American majority owner of an NBA team.[157]\n\nDuring the 2011 NBA lockout, The New York Times wrote that Jordan led a group of 10 to 14 hardline owners who wanted to cap the players' share of basketball-related income at 50 percent and as low as 47. Journalists observed that, during the labor dispute in 1998, Jordan had told Washington Wizards then-owner Abe Pollin, \"If you can't make a profit, you should sell your team.\"[158] Jason Whitlock of FoxSports.com called Jordan a \"sellout\" wanting \"current players to pay for his incompetence.\"[159] He cited Jordan's executive decisions to draft disappointing players Kwame Brown and Adam Morrison.[159]\n\nDuring the 2011–12 NBA season that was shortened to 66 games by the lockout, the Bobcats posted a 7–59 record. Their .106 winning percentage was the worst in NBA history.[160] \"I'm not real happy about the record book scenario last year. It's very, very frustrating,\" Jordan said later that year.[161] During the 2019 NBA offseason, Jordan sold a minority piece of the Hornets to Gabe Plotkin and Daniel Sundheim, retaining the majority of the team for himself.[162]\n\nPlayer profile\n\nJordan dunking the ball, 1987–88\n\nJordan was a shooting guard who was also capable of playing as a small forward (the position he would primarily play during his second return to professional basketball with the Washington Wizards), and as a point guard.[27] Jordan was known throughout his career for being a strong clutch performer. With the Bulls, he decided 25 games with field goals or free throws in the last 30 seconds, including two NBA Finals games and five other playoff contests.[163] His competitiveness was visible in his prolific trash-talk[164] and well-known work ethic.[165][166] Jordan often used perceived slights to fuel his performances. Sportswriter Wright Thompson described him as \"a killer, in the Darwinian sense of the word, immediately sensing and attacking someone's weakest spot.\"[167] As the Bulls organization built the franchise around Jordan, management had to trade away players who were not \"tough enough\" to compete with him in practice. To help improve his defense, he spent extra hours studying film of opponents. On offense, he relied more upon instinct and improvization at game time.[168]\n\nNoted as a durable player, Jordan did not miss four or more games while active for a full season from 1986–87 to 2001–02, when he injured his right knee.[27][169] Of the 15 seasons Jordan was in the NBA, he played all 82 regular season games nine times.[27] Jordan has frequently cited David Thompson, Walter Davis, and Jerry West as influences.[170][171] Confirmed at the start of his career, and possibly later on, Jordan had a special \"Love of the Game Clause\" written into his contract (unusual at the time) which allowed him to play basketball against anyone at any time, anywhere.[172]\n\nJordan had a versatile offensive game. He was capable of aggressively driving to the basket, as well as drawing fouls from his opponents at a high rate; his 8,772 free throw attempts are the 11th-highest total in NBA history.[173] As his career progressed, Jordan also developed the ability to post up his opponents and score with his trademark fadeaway jump shot, using his leaping ability to \"fade away\" from block attempts. According to Hubie Brown, this move alone made him nearly unstoppable.[174] Despite media criticism as a \"selfish\" player early in his career, Jordan's 5.3 assists per game[25] also indicate his willingness to defer to his teammates. After shooting under 30% from three-point range in his first five seasons in the NBA, including a career-low 13% in the 1987–88 season, Jordan improved to a career-high 50% in the 1994–95 season.[25] The three-point shot became more of a focus of his game from 1994–95 to 1996–97, when the NBA shortened its three-point line to 22 ft (6.7 m) (from 23 ft 9 in (7.24 m)).[175] His three-point field-goal percentages ranged from 35% to 43% in seasons in which he attempted at least 230 three-pointers between 1989–90 and 1996–97.[27] For a guard, Jordan was also a good rebounder (6.2 per game).[25]\n\nIn 1988, Jordan was honored with the NBA's Defensive Player of the Year Award and became the first NBA player to win both the Defensive Player of the Year and Most Valuable Player awards in a career (since equaled by Hakeem Olajuwon, David Robinson, and Kevin Garnett; Olajuwon is the only player other than Jordan to win both during the same season). In addition, he set both seasonal and career records for blocked shots by a guard,[176] and combined this with his ball-thieving ability to become a standout defensive player. He ranks third in NBA history in total steals with 2,514, trailing John Stockton and Jason Kidd.[177] Jerry West often stated that he was more impressed with Jordan's defensive contributions than his offensive ones.[178] He was also known to have strong eyesight; broadcaster Al Michaels said that he was able to read baseball box scores on a 27-inch (69 cm) television clearly from about 50 feet (15 m) away.[179]\n\nNBA career statistics\n\nLegend GP Games played GS Games started MPG Minutes per game FG% Field goal percentage 3P% 3-point field goal percentage FT% Free throw percentage RPG Rebounds per game APG Assists per game SPG Steals per game BPG Blocks per game PPG Points per game Bold Career high † Won an NBA championship * Led the league NBA record\n\nRegular season\n\nYear Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 1984–85 Chicago 82 82 38.3 .515 .173 .845 6.5 5.9 2.4 .8 28.2 1985–86 Chicago 18 7 25.1 .457 .167 .840 3.6 2.9 2.1 1.2 22.7 1986–87 Chicago 82 82 40.0 .482 .182 .857 5.2 4.6 2.9 1.5 37.1* 1987–88 Chicago 82 82 40.4* .535 .132 .841 5.5 5.9 3.2* 1.6 35.0* 1988–89 Chicago 81 81 40.2* .538 .276 .850 8.0 8.0 2.9 .8 32.5* 1989–90 Chicago 82 82 39.0 .526 .376 .848 6.9 6.3 2.8* .7 33.6* 1990–91† Chicago 82 82 37.0 .539 .312 .851 6.0 5.5 2.7 1.0 31.5* 1991–92† Chicago 80 80 38.8 .519 .270 .832 6.4 6.1 2.3 .9 30.1* 1992–93† Chicago 78 78 39.3 .495 .352 .837 6.7 5.5 2.8* .8 32.6* 1994–95 Chicago 17 17 39.3 .411 .500 .801 6.9 5.3 1.8 .8 26.9 1995–96† Chicago 82 82 37.7 .495 .427 .834 6.6 4.3 2.2 .5 30.4* 1996–97† Chicago 82 82 37.9 .486 .374 .833 5.9 4.3 1.7 .5 29.6* 1997–98† Chicago 82 82 38.8 .465 .238 .784 5.8 3.5 1.7 .5 28.7* 2001–02 Washington 60 53 34.9 .416 .189 .790 5.7 5.2 1.4 .4 22.9 2002–03 Washington 82 67 37.0 .445 .291 .821 6.1 3.8 1.5 .5 20.0 Career 1,072 1,039 38.3 .497 .327 .835 6.2 5.3 2.3 .8 30.1 All-Star 13 13 29.4 .472 .273 .750 4.7 4.2 2.8 .5 20.2\n\nPlayoffs\n\nYear Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 1985 Chicago 4 4 42.8 .436 .125 .828 5.8 8.5 2.8 1.0 29.3 1986 Chicago 3 3 45.0 .505 1.000 .872 6.3 5.7 2.3 1.3 43.7 1987 Chicago 3 3 42.7 .417 .400 .897 7.0 6.0 2.0 2.3 35.7 1988 Chicago 10 10 42.7 .531 .333 .869 7.1 4.7 2.4 1.1 36.3 1989 Chicago 17 17 42.2 .510 .286 .799 7.0 7.6 2.5 .8 34.8 1990 Chicago 16 16 42.1 .514 .320 .836 7.2 6.8 2.8 .9 36.7 1991† Chicago 17 17 40.5 .524 .385 .845 6.4 8.4 2.4 1.4 31.1 1992† Chicago 22 22 41.8 .499 .386 .857 6.2 5.8 2.0 .7 34.5 1993† Chicago 19 19 41.2 .475 .389 .805 6.7 6.0 2.1 .9 35.1 1995 Chicago 10 10 42.0 .484 .367 .810 6.5 4.5 2.3 1.4 31.5 1996† Chicago 18 18 40.7 .459 .403 .818 4.9 4.1 1.8 .3 30.7 1997† Chicago 19 19 42.3 .456 .194 .831 7.9 4.8 1.6 .9 31.1 1998† Chicago 21 21 41.5 .462 .302 .812 5.1 3.5 1.5 .6 32.4 Career 179 179 41.8 .487 .332 .828 6.4 5.7 2.1 .8 33.4\n\nSource:[27][180]\n\nLegacy\n\nJordan in 1997\n\nJordan's talent was clear from his first NBA season; by November he was being compared to Julius Erving.[33][35] Larry Bird said of the rookie Michael Jordan that he had \"Never seen anyone like him\", that Jordan was \"One of a kind\", the \"Best player he had ever seen\", and comparable to Wayne Gretzky as an athlete.[181] In his first game in Madison Square Garden against the New York Knicks, Jordan received a standing ovation of almost one minute.[35] After he scored a playoff record 63 points against the Boston Celtics on April 20, 1986, Bird described him as \"God disguised as Michael Jordan\".[42]\n\nJordan led the NBA in scoring in 10 seasons (NBA record) and tied Wilt Chamberlain's record of seven consecutive scoring titles.[8] He was also a fixture on the NBA All-Defensive First Team, making the roster nine times (NBA record shared with Gary Payton, Kevin Garnett and Kobe Bryant).[182] Jordan also holds the top career regular season and playoff scoring averages of 30.1 and 33.4 points per game, respectively.[180] By 1998, the season of his Finals-winning shot against the Jazz, he was well known throughout the league as a clutch performer. In the regular season, Jordan was the Bulls' primary threat in the final seconds of a close game and in the playoffs; he would always ask for the ball at crunch time.[183] Jordan's total of 5,987 points in the playoffs is the second-highest in NBA history.[184] He retired with 32,292 points in regular season play,[185] placing him fifth on the NBA's all-time scoring list behind Kareem Abdul-Jabbar, Karl Malone, Kobe Bryant, and LeBron James.[185]\n\nWith five regular-season MVPs (tied for second place with Bill Russell—only Kareem Abdul-Jabbar has won more, with six), six Finals MVPs (NBA record), and three All-Star Game MVPs, Jordan is the most decorated player in NBA history.[27][186] Jordan finished among the top three in regular-season MVP voting 10 times,[27] and was named one of the 50 Greatest Players in NBA History in 1996. He is one of only seven players in history to win an NCAA championship, an NBA championship, and an Olympic gold medal (doing so twice with the 1984 and 1992 U.S. men's basketball teams).[187] Since 1976, the year of the NBA's merger with the American Basketball Association,[188] Jordan and Pippen are the only two players to win six NBA Finals playing for one team.[189] In the All-Star Game fan ballot, Jordan received the most votes nine times, more than any other player.[190]\n\n\"There's Michael Jordan and then there is the rest of us.\" —Magic Johnson[8]\n\nMany of Jordan's contemporaries have said that Jordan is the greatest basketball player of all time.[178] In 1999, an ESPN survey of journalists, athletes and other sports figures ranked Jordan the greatest North American athlete of the 20th century, above such luminaries as Babe Ruth and Muhammad Ali.[191] Jordan placed second to Babe Ruth in the Associated Press' December 1999 list of 20th century athletes.[192] In addition, the Associated Press voted him the greatest basketball player of the 20th century.[193] Jordan has also appeared on the front cover of Sports Illustrated a record 50 times.[194] In the September 1996 issue of Sport, which was the publication's 50th-anniversary issue, Jordan was named the greatest athlete of the past 50 years.[195]\n\nJordan's athletic leaping ability, highlighted in his back-to-back Slam Dunk Contest championships in 1987 and 1988, is credited by many people with having influenced a generation of young players.[196][197] Several current NBA players—including LeBron James and Dwyane Wade—have stated that they considered Jordan their role model while they were growing up.[198][199] In addition, commentators have dubbed a number of next-generation players \"the next Michael Jordan\" upon their entry to the NBA, including Penny Hardaway, Grant Hill, Allen Iverson, Bryant, James, Vince Carter, and Dwyane Wade.[200][201][202] Although Jordan was a well-rounded player, his \"Air Jordan\" image is also often credited with inadvertently decreasing the jump shooting skills, defense, and fundamentals of young players,[196] a fact Jordan himself has lamented.\n\nI think it was the exposure of Michael Jordan; the marketing of Michael Jordan. Everything was marketed towards the things that people wanted to see, which was scoring and dunking. That Michael Jordan still played defense and an all-around game, but it was never really publicized.[196]\n\nDuring his heyday, Jordan did much to increase the status of the game. Television ratings increased only during his time in the league.[203] The popularity of the NBA in the U.S. declined after his last title.[203] As late as 2015, Finals ratings had not returned to the level reached during his last championship-winning season.[204]\n\nJordan receiving the Presidential Medal of Freedom from President Barack Obama at the White House\n\nIn August 2009, the Naismith Memorial Basketball Hall of Fame in Springfield, Massachusetts, opened a Michael Jordan exhibit that contained items from his college and NBA careers, as well as from the 1992 \"Dream Team\". The exhibit also has a batting glove to signify Jordan's short career in Minor League Baseball.[205] After Jordan received word of his acceptance into the Hall of Fame, he selected Class of 1996 member David Thompson to present him.[206] As Jordan would later explain during his induction speech in September 2009, when he was growing up in North Carolina, he was not a fan of the Tar Heels and greatly admired Thompson, who played at rival North Carolina State. In September, he was inducted into the Hall with several former Bulls teammates in attendance, including Scottie Pippen, Dennis Rodman, Charles Oakley, Ron Harper, Steve Kerr, and Toni Kukoč.[207] Two of Jordan's former coaches, Dean Smith and Doug Collins, were also among those present. His emotional reaction during his speech—when he began to cry—was captured by Associated Press photographer Stephan Savoia and would later go viral on social media as the Crying Jordan Internet meme.[208][209] In 2016, President Barack Obama honored Jordan with the Presidential Medal of Freedom.[210]\n\nPersonal life\n\nJordan married Juanita Vanoy in September 1989, and they had two sons, Jeffrey and Marcus, and a daughter, Jasmine. Jordan and Vanoy filed for divorce on January 4, 2002, citing irreconcilable differences, but reconciled shortly thereafter. They again filed for divorce and were granted a final decree of dissolution of marriage on December 29, 2006, commenting that the decision was made \"mutually and amicably\".[211][212] It is reported that Juanita received a $168 million settlement (equivalent to $213 million in 2019), making it the largest celebrity divorce settlement on public record at the time.[213][214]\n\nIn 1991, Jordan purchased a lot in Highland Park, Illinois, to build a 56,000 square-foot (5,200 m2) mansion, which was completed four years later. Jordan listed his Highland Park mansion for sale in 2012.[215] His two sons attended Loyola Academy, a private Roman Catholic high school located in Wilmette, Illinois.[216] Jeffrey graduated as a member of the 2007 graduating class and played his first collegiate basketball game on November 11, 2007, for the University of Illinois. After two seasons, Jeffrey left the Illinois basketball team in 2009. He later rejoined the team for a third season,[217][218] then received a release to transfer to the University of Central Florida, where Marcus was attending.[219][220] Marcus transferred to Whitney Young High School after his sophomore year at Loyola Academy and graduated in 2009. He began attending UCF in the fall of 2009,[221] and played three seasons of basketball for the school.[222]\n\nJordan is the fourth of five children. He has two older brothers, Larry Jordan and James R. Jordan Jr., one older sister, Deloris, and one younger sister, Roslyn.[223][224] James retired in 2006 as the Command Sergeant Major of the 35th Signal Brigade of the XVIII Airborne Corps in the U.S. Army.[225] Jordan's nephew through Larry, Justin Jordan, played Division I basketball at UNC Greensboro and is now a scout for the Charlotte Hornets.[226][227]\n\nOn July 21, 2006, a judge in Cook County, Illinois, determined that Jordan did not owe his alleged former lover Karla Knafel $5 million in a breach of contract claim.[228] Jordan had allegedly paid Knafel $250,000 to keep their relationship a secret.[229][230][231] Knafel claimed Jordan promised her $5 million for remaining silent and agreeing not to file a paternity suit after Knafel learned she was pregnant in 1991. A DNA test showed Jordan was not the father of the child.[228]\n\nHe proposed to his longtime girlfriend, Cuban-American model Yvette Prieto, on Christmas 2011,[232] and they were married on April 27, 2013, at Bethesda-by-the-Sea Episcopal Church.[233][234] It was announced on November 30, 2013, that the two were expecting their first child together.[235][236] On February 11, 2014, Prieto gave birth to identical twin daughters named Victoria and Ysabel.[237] Jordan became a grandfather in 2019 when his daughter Jasmine gave birth to a son, whose father is professional basketball player Rakeem Christmas.[238]\n\nCharity\n\nFrom 2001 to 2014, Jordan hosted an annual golf tournament, the Michael Jordan Celebrity Invitational, that raised money for various charities.[239] In 2006, Jordan and his wife Juanita pledged $5 million to Chicago's Hales Franciscan High School.[240] The Jordan Brand has made donations to Habitat for Humanity and a Louisiana branch of the Boys & Girls Clubs of America.[241]\n\nThe Make-A-Wish Foundation named Jordan its Chief Wish Ambassador in 2008.[239] Five years later, he granted his 200th wish for the organization.[242] As of 2019, he has raised more than $5 million for the Make-A-Wish Foundation.[239]\n\nIn 2015, Jordan donated a settlement of undisclosed size from a lawsuit against supermarkets that had used his name without permission to 23 different Chicago charities.[243] Jordan funded two Novant Health Michael Jordan Family Clinics in Charlotte, North Carolina, in 2017 by giving $7 million, the biggest donation he had made at the time.[244] One year later, after Hurricane Florence damaged parts of North Carolina, including his former hometown of Wilmington, Jordan donated $2 million to relief efforts.[245] He gave $1 million to aid the Bahamas' recovery following Hurricane Dorian in 2019.[246]\n\nMedia figure and business interests\n\nEndorsements\n\nMichael Jordan in 2008\n\nJordan is one of the most marketed sports figures in history. He has been a major spokesman for such brands as Nike, Coca-Cola, Chevrolet, Gatorade, McDonald's, Ball Park Franks, Rayovac, Wheaties, Hanes, and MCI.[247] Jordan has had a long relationship with Gatorade, appearing in over 20 commercials for the company since 1991, including the \"Be Like Mike\" commercials in which a song was sung by children wishing to be like Jordan.[247][248]\n\nNike created a signature shoe for him, called the Air Jordan, in 1984.[249] One of Jordan's more popular commercials for the shoe involved Spike Lee playing the part of Mars Blackmon. In the commercials Lee, as Blackmon, attempted to find the source of Jordan's abilities and became convinced that \"it's gotta be the shoes\".[247] The hype and demand for the shoes even brought on a spate of \"shoe-jackings\" where people were robbed of their sneakers at gunpoint. Subsequently, Nike spun off the Jordan line into its own division named the \"Jordan Brand\". The company features an impressive list of athletes and celebrities as endorsers.[250][251] The brand has also sponsored college sports programs such as those of North Carolina, California, Georgetown, and Marquette.[252]\n\nJordan also has been associated with the Looney Tunes cartoon characters. A Nike commercial shown during 1992's Super Bowl XXVI featured Jordan and Bugs Bunny playing basketball.[253] The Super Bowl commercial inspired the 1996 live action/animated film Space Jam, which starred Jordan and Bugs in a fictional story set during the former's first retirement from basketball.[254] They have subsequently appeared together in several commercials for MCI.[254] Jordan also made an appearance in the music video of Michael Jackson's \"Jam\" (1992).[255]\n\nJordan's yearly income from the endorsements is estimated to be over $40 million.[256][257] In addition, when Jordan's power at the ticket gates was at its highest point, the Bulls regularly sold out both their home and road games.[258] Due to this, Jordan set records in player salary by signing annual contracts worth in excess of US$30 million per season.[259] An academic study found that Jordan's first NBA comeback resulted in an increase in the market capitalization of his client firms of more than $1 billion.[260]\n\nMost of Jordan's endorsement deals, including his first deal with Nike, were engineered by his agent, David Falk.[261] Jordan has described Falk as \"the best at what he does\" and that \"marketing-wise, he's great. He's the one who came up with the concept of 'Air Jordan.'\"[262]\n\nBusiness ventures\n\nIn June 2010, Jordan was ranked by Forbes magazine as the 20th-most powerful celebrity in the world with $55 million earned between June 2009 and June 2010. According to the Forbes article, Jordan Brand generates $1 billion in sales for Nike.[263] In June 2014, Jordan was named the first NBA player to become a billionaire, after he increased his stake in the Charlotte Hornets from 80% to 89.5%.[264][265] On January 20, 2015, Jordan was honored with the Charlotte Business Journal's Business Person of the Year for 2014.[266] In 2017, he became a part owner of the Miami Marlins of Major League Baseball.[267]\n\nForbes designated Jordan as the athlete with the highest career earnings in 2017.[268] From his Jordan Brand income and endorsements, Jordan's 2015 income was an estimated $110 million, the most of any retired athlete.[269] As of April 2020 , his current net worth is estimated at $2.1 billion by Forbes.[1] Jordan is the fourth-richest African-American as of 2019, behind Robert F. Smith, David Steward, and Oprah Winfrey.[270]\n\nJordan co-owns an automotive group which bears his name. The company has a Nissan dealership in Durham, North Carolina, acquired in 1990,[271] and formerly had a Lincoln–Mercury dealership from 1995 until its closure in June 2009.[272][273] The company also owned a Nissan franchise in Glen Burnie, Maryland.[272] The restaurant industry is another business interest of Jordan's. His restaurants include a steakhouse in New York City's Grand Central Terminal, among others.[274] Jordan is the majority investor in a golf course, Grove XXIII, under construction in Hobe Sound, Florida.[275]\n\nBooks\n\nJordan has authored several books focusing on his life, basketball career, and world view.\n\nRare Air: Michael on Michael (1993) with Mark Vancil and Walter Iooss. [276] [277]\n\n(1993) with Mark Vancil and Walter Iooss. I Can't Accept Not Trying: Michael Jordan on the Pursuit of Excellence (1994) with Mark Vancil and Sandro Miller. [278]\n\n(1994) with Mark Vancil and Sandro Miller. For the Love of the Game: My Story (1998) with Mark Vancil. [279]\n\n(1998) with Mark Vancil. Driven from Within (2005) with Mark Vancil.[280]\n\nAwards and honors\n\nCollege\n\nNBA\n\nOther\n\nSee also\n\nNotes\n\n^ [3] Jordan scored 49 points, setting a franchise record for players wearing that jersey number.[4] Jordan wore a nameless No. 12 jersey in a February 14, 1990 game against the Orlando Magic because his No. 23 jersey had been stolen.Jordan scored 49 points, setting a franchise record for players wearing that jersey number.\n\nReferences\n\nSources", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Michael_Jordan_in_2014.jpg/220px-Michael_Jordan_in_2014.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Michael_Jordan_UNC_Jersey_cropped.jpg/170px-Michael_Jordan_UNC_Jersey_cropped.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Cazzaro_Jordan.jpg/220px-Cazzaro_Jordan.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/MJ_golf_course.jpg/220px-MJ_golf_course.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/JordanSmithWorthy2.jpg/170px-JordanSmithWorthy2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Jordan_by_Lipofsky_16577.jpg/170px-Jordan_by_Lipofsky_16577.jpg", "https://upload.wikimedia.org/wikipedia/commons/a/ae/Michael_Jordan_in_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sports_icon.png/31px-Sports_icon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Jordan_Lipofsky.jpg/170px-Jordan_Lipofsky.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Flickr_-_The_U.S._Army_-_www.Army.mil_%28273%29.jpg/170px-Flickr_-_The_U.S._Army_-_www.Army.mil_%28273%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Michael_Jordan_Achievements.jpg/220px-Michael_Jordan_Achievements.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/MichaelJordanDepOfDefense.jpg/220px-MichaelJordanDepOfDefense.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Jordan_Scorpions.jpg/280px-Jordan_Scorpions.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/BudLightDaredevils_and_Michael_Jordan.jpg/220px-BudLightDaredevils_and_Michael_Jordan.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Michael_Jordan_and_Barack_Obama_at_the_White_House.jpg/170px-Michael_Jordan_and_Barack_Obama_at_the_White_House.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Phil_Jackson_Lipofsky.JPG/170px-Phil_Jackson_Lipofsky.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Sound-icon.svg/20px-Sound-icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Sound-icon.svg/45px-Sound-icon.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Michael_Jordan_-_Laney_High_School_1980_-_02.jpg/170px-Michael_Jordan_-_Laney_High_School_1980_-_02.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Open_Access_logo_PLoS_transparent.svg/9px-Open_Access_logo_PLoS_transparent.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Michael_Jordan_in_2014.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Michael_Jordan", "title": "Michael Jordan", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Michael_Jordan_in_2014.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}