{"url": "www.billboard.com/articles/news/magazine-feature/7783997/miley-cyrus-cover-story-new-music-malibu", "text": "Well above California’s Pacific Coast Highway, just off a canyon road, sits a small house with a wooden porch painted in the colors of the Pride flag. The outside is decorated with frog planters, ­butterfly chairs, a hot-pink pig-shaped grill, ­sunflowers and daisies. This is Rainbow Land, the boho recording studio whose owner, Miley Cyrus, is on this sunny April afternoon sitting cross-legged in a swivel chair before a sound board, dressed way down with unruly long hair, cutoffs and a vintage tee that reads “Malibu” on the front.\n\nCyrus -- who’s about to play me 10 songs off a new album that promises to (yet again) transform one of the most inimitable, unpredictable careers in recent pop ­history -- is somehow animated and serene at the same time. It’s clear from the way her words tumble forth that she’s ­breaking a months long self-imposed “media blackout” and eager to unpack her latest thinking on everything from her alienation from hip-hop to engaging with Donald Trump’s supporters.\n\n“This is crazy,” she says with her ­signature raspy-voiced charm, “but I haven’t smoked weed in three weeks!” Cyrus -- who’s sitting across from a lighted wall plaque that reads “It’s 4:20 Somewhere” -- elaborates on why she decided to quit “for a second”: “I like to surround myself with people that make me want to get better, more evolved, open. And I was noticing, it’s not the people that are stoned. I want to be super clear and sharp, because I know exactly where I want to be.”\n\nWhere is that, exactly? It is, among other things, on her leafy Malibu compound that includes Rainbow Land. Cyrus, 24, shares the property with seven dogs, two pigs, two miniature horses and one Australian: fiance Liam Hemsworth, the actor with whom Cyrus reunited last year after a 2013 breakup. Hemsworth bought the property in 2014, but Cyrus moved in and has left her mark on it. (She also keeps a home with her mom, Tish, in Studio City.) In Malibu, when she’s not making music or doing two hours of Ashtanga yoga daily, Cyrus says she likes nothing better than walking her dogs or grocery shopping, where she’s generally unbothered. “I love talking to people, and I approach them in a normal, ‘Don’t treat me different, ’cause I’m not’ way. That’s what started this evolution for me, getting out of my Dead Petz phase,” she says, referring to her 2015 album, the tour for which featured her in a unicorn outfit with a strap-on phallus. “People stare at me anyway, but people stare at me a lot when I’m dressed as a ­fucking cat.”\n\nOn May 11, fans and haters alike will get a dose of New Miley with “Malibu,” the first single off an as-yet-untitled album coming later this year. It’s a breezy love song about Hemsworth -- gimmick-free pop-rock unlike anything she has recorded before, whether as Hannah Montana, the punky Disney princess who scored three Billboard 200 No. 1s in the ’00s; or as herself, on 2013’s daring Bangerz (another No. 1); or the straight-to-SoundCloud experiment Miley Cyrus & Her Dead Petz. When Cyrus sings, “I never would’ve believed you if three years ago you told me I’d be here writing this song,” she could as easily be referring to her music as to her relationship.\n\nWhile Bangerz and Petz bore the unmistakable stamps of their respective collaborators, Mike Will Made-It and Wayne Coyne of The Flaming Lips, the new album will be Cyrus’ most DIY to date. She wrote the lyrics and melodies ­herself, and producer-writer Oren Yoel (who co-wrote the Bangerz track “Adore You,” which hit No. 21 on the Billboard Hot 100) plays all the ­instruments. Cyrus wrote one song for Hillary Clinton and another for women in the workplace, but overall, the album’s less explicitly political than it is personal. That extends to the music, which adds an unprecedented dose of twang to a mix that includes quiet acoustic turns and epic pop. “This is Miley leaning into her roots more than I’ve ever heard,” says her father, country singer and actor Billy Ray Cyrus, who tells a story of Waylon Jennings teaching a young Miley guitar chords at the kitchen table. “For her, this is honest.” It’s also a showcase for her voice, one of the most expressive in music. “My main concern isn’t radio,” says Cyrus, whose “Wrecking Ball” spent three weeks at No. 1 in 2013. “I truly don’t even listen to it.”\n\nCyrus was first inspired to reach beyond her circle of “outspoken liberals” and ­cultivate ­country fans and red staters in 2016, when she began as a coach on NBC’s stalwart talent competition The Voice. (She will rejoin for season 13 this fall.) “I like talking to people that don’t agree with me, but I don’t think I can do that in an aggressive way,” says Cyrus. “I don’t think those people are going to listen to me when I’m sitting there in nipple pasties, you know?”\n\nAfter Trump was elected ­president, Cyrus -- who first ­supported Bernie Sanders and, when she won the Democratic ­nomination, Clinton -- launched #HopefulHippies, an initiative of her Happy Hippie youth-activism nonprofit that ­encourages people to “turn emotion into action.” “I have to ask myself, ‘How am I going to create real change?’” she says, “and not just ­fucking preach to the choir anymore.” With the new album, Cyrus hopes to reach the other side of the aisle. “This record is a reflection of the fact that yes, I don’t give a fuck, but right now is not a time to not give a fuck about people,” she says. “I’m ­giving the world a hug and saying, ‘Hey, look. We’re good -- I love you.’ And I hope you can say you love me back.”\n\nWhere exactly did you write ­“Malibu”?\n\nOn the way to The Voice. I drive myself everywhere, but that day I decided to Uber, and I was trying not to sing out loud because someone else was in the car.\n\nPeople might call it sentimental.\n\nThey’re going to talk about me if I come out of a restaurant with Liam. So why not put the power back in my relationship and say, “This is how I feel”?\n\nAfter you guys broke up, you said something like, “I’m so immersed in work, I can’t even think about it.”\n\nYeah, but also ’cause I needed to change so much. And changing with someone else not changing like that is too hard. Suddenly you’re like, “I don’t recognize you anymore.” We had to refall for each other.\n\nThe new album is pretty singer-­songwriter-y, no?\n\nYeah. But not granola. I don’t listen to Ed Sheeran and John Mayer and stuff.\n\nDid folk singer Melanie Safka [with whom Cyrus performed in 2015] ­influence you?\n\nShe did, and I grew up with her. But I also love that new Kendrick [Lamar] song [“Humble”]: “Show me somethin’ natural like ass with some stretch marks.” I love that because it’s not “Come sit on my dick, suck on my cock.” I can’t listen to that anymore. That’s what pushed me out of the hip-hop scene a little. It was too much “Lamborghini, got my Rolex, got a girl on my cock” -- I am so not that.\n\nI was torn on whether I was going to work with certain producers that I really like. But I feel if we’re not on the same page ­politically ... My record is political, but the sound bite doesn’t stop there. Because you can write something beautiful and you know E! News will ruin our lives and say, “This is a political record.” Because then I’m the Dixie Chicks and I’m getting my album smashed in the streets, and that’s not what I want. I want to talk to people in a compassionate, understanding way -- which people aren’t doing.\n\nWhat appealed to you about The Voice?\n\nI’m down for hanging with Blake [Shelton]. I actually want to take ­advantage of the fact that he’s there, [because] his fans don’t really take me seriously as a ­country artist. One, I haven’t given them that music. But I’ve got a tattoo of Johnny Cash’s autograph that he gave me when I was a ­little girl that says, “I’m in your corner.” Dolly Parton is my ­fucking ­godmother. The fact that ­country music fans are scared of me, that hurts me. All the ­nipple pastie shit, that’s what I did because I felt it was part of my political movement, and that got me to where I am now. I’m evolving, and I surround myself with smart people that are evolved.\n\nBut we’ve seen the way that Madonna and Lady Gaga get asked, “Is this just another costume? Another phase?”\n\nI think [Madonna and Gaga] are ­enlightened. I ­fucking hate it when people can’t adjust. I used to [resist changing]. But I haven’t smoked weed in three weeks, which is the longest I’ve ever [gone without it]. I’m not doing drugs, I’m not drinking, I’m completely clean right now! That was just something that I wanted to do.\n\nIs it hard to not smoke?\n\nIt’s easy, dude. When I want something, it’s fucking easy for me. But if anyone told me not to smoke, I would have not done it. It’s because it was on my time. I know exactly where I am right now. I know what I want this record to be. And not in the sense of manipulation -- wanting something from my fans or the audience, like some slimy thing -- “How do I get attention?” I never thought about that. Dude, I was shocked that ­people gave a fuck about the [MTV Video Music Awards in 2013, when she ­performed with Robin Thicke] -- the ­twerking, the teddy bear. It’s a totally ­different time, and I don’t think that would freak people out anymore.\n\nOur perceptions of a lot of things are changing at lightning speed. Still, there’s an audience that’s maybe a little scared of you, those who might have a tendency to vilify the “other.”\n\nI was talking about this with my sister [Noah], who’s 17, and she’s doing music right now. She basically grew up in L.A. She’s never known anything different. She doesn’t even know she’s open-minded, it’s the only kind of mind she has ever known. It’s mind-boggling to me that there was even a controversy around me having black dancers. That became a thing, where people said I was taking advantage of black culture, and with Mike [WiLL Made-It] -- what the fuck? That wasn’t true. Those were the dancers I liked!\n\nWhen I met Pharrell [Williams], before “Blurred Lines,” before “Happy,” people wouldn’t take meetings with me because they said, “He hasn’t had a hit in 10 years.” They wanted to put me with the Dr. Lukes of the world, the Max Martins, and put me through the fucking assembly line, and I said, “No. This is someone who actually cares about me. This is someone I feel safe with.” I got completely shut out, and I had to just trust myself. What feels right to me feels right to my fans, because they know some dude in a suit didn’t tell me to do it. And by the way, I brought “Wrecking Ball” to Luke. No one put me in the room with Luke. I had done “Party in the U.S.A.” with him, and that’s just someone I thought could handle that sound. Did you ever get to come to a Bangerz show?\n\nYeah, I did.\n\nI was crazy about making the tongue slide work. I was so ­embarrassed to be on the red carpet and so many of those fucking disgusting ­photographers would tell me to blow a kiss, and that’s not me! I don’t want to blow you a kiss. I didn’t know what to do with my face, so I stuck my tongue out, and it became a rebellious, punk-rock thing.\n\nThe Dead Petz track “BB Talk,” which calls out a man for his “baby ­talking,” seems to reject a similar kind of ­gender standard.\n\nI wish it would’ve gotten some ­attention. No one saw the video! It was a real rant. Dating a musician [like me] is probably the worst thing ever, because you always end up ­having your shit in songs. It’s just ­inevitable. But I’m just that way. I’m a little bit boyish. But I can also be super femme and dress as a bunny rabbit. Who I’m with has nothing to do with sex -- I’m super open, pansexual, that’s just me.\n\nDo you want your dudes to be dudes?\n\nNot even. That really grosses me out. I always get in trouble for ­generalizing straight men, ’cause straight men can be my worst nightmare ­sometimes. And I’m with a straight dude. But he’s always like, “Well, don’t call me that!” I ask him sometimes, “Do you like being a boy?” And he’s like, “I don’t really think about it.” And that’s crazy to me, because I think about being a girl all the time. I’m always like, “It’s weird that I’m a girl, because I just don’t feel like a girl, and I don’t feel like a boy. I just feel like nothing.” So when someone’s too ­masculine, that really grosses me out.\n\nBut then, girls really make me sad a lot of the time too, especially right now. I think fashion has taken us a little bit downhill. I can only speak for the years that I’ve been alive, but I don’t know if it has ever been so important to “fit in.” It’s not about standing out right now. Which is so weird, because it seems like for the really unique, smart kids in this generation, it’s all about standing out. I love seeing these kids on Instagram that dress fucking dope. This whole world right now is so divided, in the arts, fashion -- everything.\n\nThe country is certainly very divided.\n\nI like the way I think right now. But don’t Trump supporters like the way they think? So I’ve also got to be open with the way I approach people with my opinions. That’s the only way to make real change. And it’s not because I want to sell records! I know now the ways that don’t work. Because I went really hard during the ­election. But at the end of the day, we lost. We won, but because the system is fucked up, we lost. I thought, “OK. I learned my lesson on this one.”\n\nDid you have to go into The Voice right after Election Day?\n\nThat next day, dude. I wanted to go to rehearsals. Liam was like, “Just don’t go. You’re not there. And you don’t know how everyone feels on that set.” Everyone’s from all different parts of the country, so he was like, “Don’t go and get into it with ­people right now.” Because clearly ­unity is what we need.\n\nYou posted a tearful Instagram video the day after the election, and I tweeted, “Love you, Miley.” And so many alt-right dudes responded, “Are you just trying to fuck her?”\n\nThat’s them sexualizing me, because they think that you couldn’t take me seriously. The first thing I got on my Instagram when I posted that was people saying, “You said you were going to move. When are you going to move?” It’s not time for me to leave now, dude. I’ve got to be here. I’ve got to glue this place back together, because I’m from Tennessee -- that state [went to] Donald Trump. I’m such a dreamer, and I know a lot of things that I’ve wanted to do people said weren’t possible. When I started Happy Hippie -- this is before Caitlyn Jenner transitioned, before this became something that is a part of the culture...\n\nLeelah Alcorn -- a 17-year-old ­transgender girl who committed ­suicide in December 2014 -- brought a new awareness to transgender issues.\n\nYes. I was on a Christmas trip, and I was like, “How am I sitting here about to open presents and someone has taken their own life?” I started Happy Hippie because I never thought we would see this day where you have the Laverne Coxes of the world get not only trans roles, but female roles. And I realized the voice I had. That’s why I brought Jesse [Helt, a homeless man, to the 2014 VMAs], because it felt wrong for me to go and get an award, celebrating me getting naked and riding a fucking wrecking ball around for a day. I mean, what would I have said? “Thanks, uh... thanks to [“Wrecking Ball” video ­director] Terry Richardson”? That would have been so weird.\n\nDo you think you’ve managed to bring your politics into The Voice?\n\nBy sitting there after the election in head-to-toe pink, while on the inside being a gender-neutral, ­sexually fluid person, hopefully that was saying ­something. I needed some sparkle in my life, to make me able to deal. Radiating love is ­something that is important to me -- ­hopefully, that is being political.", "images": ["https://static.billboard.com/files/media/miley-cyrus-bb11-2017-fhdj-fea-billboard-1500-768x433.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/media/miley-cyrus-bb11-2017-fhdj-fea-billboard-1500-1024x577.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?31b846bafac45d8539bb"], "top_img": "https://static.billboard.com/files/media/miley-cyrus-bb11-2017-fhdj-fea-billboard-1500-1024x577.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.billboard.com/articles/news/magazine-feature/7783997/miley-cyrus-cover-story-new-music-malibu", "title": "Miley Cyrus Breaks Silence on Rootsy New Music, Fiance Liam Hemsworth & America: 'Unity Is What We Need'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2019-12-04T00:05:00-05:00", "published_time": "2017-05-03T21:50:50-04:00"}, "description": "Shaken by the election and inspired by her broad platform on The Voice, Miley Cyrus is about to emerge from a social media blackout with rootsy new music and a mission to connect with country fans and Trump voters -- even as she calls out misogyny in hip-hop and fights for transgender rights. \"Im giving the world a hug,\" she says at her home in Malibu.", "og": {"description": "Shaken by the election and inspired by her broad platform on The Voice, Miley Cyrus is about to emerge from a social media blackout with rootsy new music and a mission to connect with country fans and Trump voters -- even as she calls out misogyny in hip-hop and fights for transgender rights. \"Im giving the world a hug,\" she says at her home in Malibu.", "image": {"identifier": "https://static.billboard.com/files/media/miley-cyrus-bb11-2017-fhdj-fea-billboard-1500-1024x577.jpg", "height": 577, "width": 1024}, "title": "Miley Cyrus Cover Story May 2017 | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/magazine-feature/7783997/miley-cyrus-cover-story-new-music-malibu", "site_name": "Billboard"}, "title": "Miley Cyrus Breaks Silence on Rootsy New Music, Fiance Liam Hemsworth & America: 'Unity Is What We Need'", "twitter": {"card": "summary_large_image", "description": "Shaken by the election and inspired by her broad platform on The Voice, Miley Cyrus is about to emerge from a social media blackout with rootsy new music and a mission to connect with country fans and Trump voters -- even as she calls out misogyny in hip-hop and fights for transgender rights. \"Im giving the world a hug,\" she says at her home in Malibu.", "image": "https://static.billboard.com/files/media/miley-cyrus-bb11-2017-fhdj-fea-billboard-1500-1024x577.jpg", "title": "Miley Cyrus Breaks Silence on Rootsy New Music, Fiance Liam Hemsworth & America: 'Unity Is What We Need'", "site": "@billboard"}}, "movies": [], "publish_date": 1493862650.0, "source": "http://www.billboard.com", "summary": ""}