{"url": "www.yourtango.com/2018314762/who-is-angelina-jolies-boyfriend-details-new-details-on-the-mystery-man-shes-been-spotted-with", "text": "She wont tell anyone his name.\n\nWho is Angelina Jolie's boyfriend? Angelina Jolie is single and ready to mingle! Some of us are still adjusting to the fact that Brangelina is really, truly donezo. While some of us are patiently waiting on a reunion of the two movie stars, we may be holding our breaths because it seems that Angie has a new man in her life.\n\nWe don't know a whole lot about the identity of this new guy but there is talk he is British and quite well-off. A source close to the Salt actress says that the two met through mutual friends. The romance is only starting and rumors suggest that sparks are definitely flying.\n\nHere is what we know so far about Angie's secret new beau:\n\n1. She is keeping her new man a secret.\n\n“Angie is keeping her cards close to her chest, but she’s very happy,” a source said. “She doesn’t want his identity to be revealed until her divorce from Brad [Pitt] is official, so she’s playing coy whenever anyone asks about her love life. She doesn’t want a media circus around her man.”\n\n2. She's taking precaution to remain discreet.\n\nA post shared by Angelina Jolie (@angiiii_jolie) on Jun 28, 2018 at 5:56am PDT\n\nSources on set say the actress only refers to her new beau “by one initial,” and has asked the producers to arrange her schedule so that she can leave town on weekends. “Apparently, they’re having romantic weekends in the English countryside, away from prying eyes, whenever they get the chance.”\n\n3. Her kids have met him.\n\n“She’s introduced him to the kids already, which is a sure sign that this is more than just a fling,” says the source. “They will always be her priority and she wouldn’t take that step if she didn’t see this romance lasting.”\n\n4. This isn't the first time we're hearing about him.\n\nA post shared by ❥ Angelina Jolie (@angelinajolie.ita) on Jun 28, 2018 at 6:10am PDT\n\nThere were reports last April that Jolie was dating this mystery man who is said to be a “reputable art dealer and philanthropist.\" There was even talk of marriage. But time proved these accusations false. The fact that she is filming Maleficent 2 in London re-ignited these rumors.\n\n5. Other sources close to her say the rumors are false.\n\nA source told People the actress “is absolutely not seeing anyone and will not be. [She] remains focused on her kids” and isn’t interested in getting back in the dating game.\n\n6. She has been linked to other men.\n\nA post shared by Ed Skrein (@edskrein) on Dec 2, 2014 at 8:04am PST\n\nIncluding her Maleficent 2 costar Ed Skrein. “Angie thinks Ed’s hot and she loves the idea of working with him,” a source told Star Magazine. “Obviously, he’s a great actor but she’s also looking forward to chatting with him behind the scenes. She’d love to get to know Ed and find out what makes him tick.”\n\n7. Brad has been dating, too.\n\nPitt has been linked to a few other women as well including Margot Robbie — who Angelina supposedly hates. A source told OK! magazine about Brad's pursuit of Margot. “He thinks she’s the hottest girl in Hollywood right now. [He has] tried to woo her for numerous movie projects. This was a sore subject with Angie who blocked them from working together a few times. Now he’s single again you can expect Brad to go after Margot with a passion.”\n\nMolly Given is a writer living in Philadelphia and lover of all things to do with mystery and magic in life. When she’s not writing her fingers off she can be found planning her next adventure in a new part of the world.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2815%29.png?itok=qagYNfX8", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/image%20%2815%29.png?itok=ggtCAlyE"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2815%29.png?itok=qagYNfX8", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018314762/who-is-angelina-jolies-boyfriend-details-new-details-on-the-mystery-man-shes-been-spotted-with", "title": "Who Is Angelina Jolie's Boyfriend? New Details On The New Mystery Man She's Been Spotted With", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Angelina Jolie, entertainment and news, Buzz", "article": {"author": "https://www.facebook.com/molly.given", "published_time": "2018-06-28T18:15:00", "modified_time": "2018-06-28T18:15:00"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018314762/who-is-angelina-jolies-boyfriend-details-new-details-on-the-mystery-man-shes-been-spotted-with", "title": "Who Is Angelina Jolie's Boyfriend? New Details On The New Mystery Man She's Been Spotted With", "description": "She wont tell anyone his name.", "updated_time": "2018-06-28T18:15:00", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2815%29.png?itok=qagYNfX8", "width": 620, "height": 309}}, "description": "Superstar Angelina Jolie and Brad Pitt broke up and now are both moving on and dating. Who is Angelina Jolie's boyfriend? Here is what we know so far about the mystery man she's been spotted with, even though she won't tell anyone his name.", "abstract": "Angelina Jolie is single and ready to mingle! Some of us are still adjusting to the fact that Brangelina is really done. We are waiting on a reunion", "robots": "follow, index, noodp, noydir", "news_keywords": "angelina jolie boyfriend, angelina jolie new boyfriend, who is angelina jolie new boyfriend, who is angelina jolie's new boyfriend, angelina new boyfriend, angelina boyfriend, is angelina jolie dating anyone, angelina jolie new man, angelina jolie dating again, who is angelina jolie dating", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018314762/who-is-angelina-jolies-boyfriend-details-new-details-on-the-mystery-man-shes-been-spotted-with", "title": "Who Is Angelina Jolie's Boyfriend? New Details On The New Mystery Man She's Been Spotted With", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2815%29.png?itok=qagYNfX8", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/9xfvnyxC57s"], "publish_date": 1530180900.0, "source": "http://www.yourtango.com", "summary": ""}