{"url": "https://deadline.com/2018/03/fx-marvels-deadpool-animated-tv-series-dead-donald-glover-canceled-1202352932/", "text": "FX is not going forward with its Marvel’s Deadpool animated adult action-comedy series, from Atlanta creator/executive producer/star Donald Glover and writer Stephen Glover. The project, an adaptation of the hit Marvel character, received a 10-episode straight-to-series order last May to premiere in 2018 on FX Networks’ comedy-focused FXX.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\n“Due to creative differences, FX, Donald Glover, Stephen Glover and Marvel Television have agreed to part ways on Marvel’s Deadpool animated series,” the network said in a statement Saturday. “FX will no longer be involved with the project. FX and Marvel have an ongoing relationship through our partnership on Legion, which will continue.”\n\nFX’s other collaboration with Marvel TV, live-action drama series Legion, is heading into its second season, which debuts April 3.\n\nAccording to sources, Marvel did not agree with the Glovers’ vision for the show based on scripts written by Stephen Glover. FX supported the brothers, who have overall deals at FX Prods., so FX, with Donald and Stephen Glover, pulled out from the project. (Donald Glover and his brother Stephen were attached as showrunners, executive producers and writers of the Deadpool animated series).\n\nThe untitled Marvel’s Deadpool series was to be produced by Marvel TV in association with FX Productions and ABC Signature Studios. It is unclear yet whether Marvel TV and ABC Studios will continue to pursue the project. The rights to the Deadpool character are owned by Fox — the Deadpool live-action movie, starring Ryan Reynolds became one of Fox’s highest-grossing movies of all time — so at the moment, until the pending Disney acquisition of Fox assets is completed, a Deadpool TV series has to be done with another Fox production entity. Aside from FX Prods., there is only one other Fox TV studio — 20th Century Fox TV.\n\nIn 2016, FX Networks topper John Landgraf signaled a programming shift for the younger-skewing FXX with an emphasis on animation. FXX already has The Simpsons library, and FX hit Archer migrated to FXX with its eighth season. The goal had been to launch a new FXX animated series behind Season 9 of Archer in 2018, with Marvel’s Deadpool considered a strong contender.\n\nSince his debut in 1991, Deadpool has grown to become one of Marvel’s most popular characters. The Deadpool movie earned $783 million worldwide. Its sequel hits theaters May 18.\n\nDonald Glover has been very busy over the past year. In addition to the critically praised Atlanta, which recently returned for a second season after a lengthy hiatus, he has the Han Solo movie coming up as well as the animated The Lion King. He also earned a slew of Grammy nominations for his alter ego Childish Gambino.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F03%2Ffx-marvels-deadpool-animated-tv-series-dead-donald-glover-canceled-1202352932%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202352932&comment_count=23", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcdeadline2.files.wordpress.com/2017/05/deadpool-fxx.jpg?w=630", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/05/deadpool-fxx.jpg?w=630", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/03/fx-marvels-deadpool-animated-tv-series-dead-donald-glover-canceled-1202352932/", "title": "FX Pulls the Plug On Marvel’s Deadpool Animated TV Series From Donald Glover", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "FX is not going forward with its Marvel’s Deadpool animated adult action-comedy series, from Atlanta creator/executive producer/star Donald Glover and writer Stephen Glover.", "news_keywords": "Deadpool, Donald Glover, FX", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "FX Pulls the Plug On Marvel’s Deadpool Animated TV Series From Donald Glover", "url": "https://deadline.com/2018/03/fx-marvels-deadpool-animated-tv-series-dead-donald-glover-canceled-1202352932/", "description": "FX is not going forward with its Marvel’s Deadpool animated adult action-comedy series, from Atlanta creator/executive producer/star Donald Glover and writer Stephen Glover. The project, an adaptat…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/05/deadpool-fxx.jpg?w=630", "width": 630, "height": 423}, "locale": "en_US"}, "article": {"published_time": "2018-03-25T00:30:06+00:00", "modified_time": "2018-03-28T15:19:21+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "FX Pulls the Plug On Marvel’s Deadpool Animated TV Series From Donald Glover"}, "image": "https://pmcdeadline2.files.wordpress.com/2017/05/deadpool-fxx.jpg?w=630", "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "FX Pulls the Plug On Marvel’s Deadpool Animated TV Series From Donald Glover", "description": "FX is not going forward with its Marvel’s Deadpool animated adult action-comedy series, from Atlanta creator/executive producer/star Donald Glover and writer Stephen Glover."}, "author": "Nellie Andreeva", "content_type": "Article", "post_id": 1202352932, "title": "FX Pulls the Plug On Marvel’s Deadpool Animated TV Series From Donald Glover", "published_at": "2018-03-24 17:30:06", "image": "https://pmcdeadline2.files.wordpress.com/2017/05/deadpool-fxx.jpg?w=296&h=166&crop=1", "comment_count": 23, "tags": "FX", "topics": "TV", "body": "FX is not going forward with its Marvel’s Deadpool animated adult action-comedy series, from Atlanta creator/executive producer/star Donald Glover and writer Stephen Glover. The project, an adaptation of the hit Marvel character, received a 10-episode straight-to-series order last May to premiere in 2018 on FX Networks' comedy-focused FXX.\r\n\r\n\"Due to creative differences, FX, Donald Glover, Stephen Glover and Marvel Television have agreed to part ways on Marvel's Deadpool animated series,\" the network said in a statement Saturday. \"FX will no longer be involved with the project. FX and Marvel have an ongoing relationship through our partnership on Legion, which will continue.”\r\n\r\nFX’s other collaboration with Marvel TV, live-action drama series Legion, is heading into its second season, which debuts April 3.\r\n\r\nAccording to sources, Marvel did not agree with the Glovers’ vision for the show based on scripts written by Stephen Glover. FX supported the brothers, who have overall deals at FX Prods., so FX, with Donald and Stephen Glover, pulled out from the project. (Donald Glover and his brother Stephen were attached as showrunners, executive producers and writers of the Deadpool animated series).\r\n\r\nThe untitled Marvel’s Deadpool series was to be produced by Marvel TV in association with FX Productions and ABC Signature Studios. It is unclear yet whether Marvel TV and ABC Studios will continue to pursue the project. The rights to the Deadpool character are owned by Fox -- the Deadpool live-action movie, starring Ryan Reynolds became one of Fox’s highest-grossing movies of all time -- so at the moment, until the pending Disney acquisition of Fox assets is completed, a Deadpool TV series has to be done with another Fox production entity. Aside from FX Prods., there is only one other Fox TV studio -- 20th Century Fox TV.\r\n\r\nIn 2016, FX Networks topper John Landgraf signaled a programming shift for the younger-skewing FXX with an emphasis on animation. FXX already has The Simpsons library, and FX hit Archer migrated to FXX with its eighth season. The goal had been to launch a new FXX animated series behind Season 9 of Archer in 2018, with Marvel’s Deadpool considered a strong contender.\r\n\r\nSince his debut in 1991, Deadpool has grown to become one of Marvel’s most popular characters. The Deadpool movie earned $783 million worldwide. Its sequel hits theaters May 18.\r\n\r\nDonald Glover has been very busy over the past year. In addition to the critically praised Atlanta, which recently returned for a second season after a lengthy hiatus, he has the Han Solo movie coming up as well as the animated The Lion King. He also earned a slew of Grammy nominations for his alter ego Childish Gambino.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1521937806.0, "source": "https://deadline.com", "summary": ""}