{"url": "www.goodhousekeeping.com/health/diet-nutrition/news/a47803/gordon-ramsay-weight-loss/", "text": "Celebrity Chef Gordon Ramsay is known for his tough love methods on his Fox show Hell's Kitchen, but he was his own worst critic when it came to his weight.\n\nIn an interview with The Daily Mail, Ramsay shared how his wife, Tana, was his biggest source of motivation for losing weight because she has always been a fitness enthusiast and let him know she wasn't pleased with his weight gain, according to People.\n\n\"Tana was not impressed with the way I was,\" Ramsay revealed. \"I was overweight, 18 stone [over 250 pounds]. I looked like a sack of s--t. I look at the pictures and think, 'How did Tana stay around?' Because Tana has got better-looking and more gorgeous. And there she is, getting in bed with a fat f--k.\"\n\nGetty Images\n\nGordon and Tana have been married for over 20 years and have four children together, and at the time of his weight gain, he had just won his third Michelin star. But despite those accomplishments, Ramsay said he still suffered from low self-esteem.\n\n\"It was painful,\" he said. \"I used to look at myself in the mirror and think, 'Holy s--t!' So it was a big wake-up call.\"\n\nThe chef attributed his weight gain to not eating properly when working long hours and during vacation trips with David and Victoria Beckham and their respective families. \"I didn't have a figure,\" Ramsay said. \"I didn't feel that good. After working my a-- off and achieving a lot, I wanted to get in serious shape.\"\n\nGordon Ramsay in June 2011. Getty Images\n\n\"I don't want my industry to kill me,\" he continued. \"I know how unhealthy chefs are at the top level. Stress. Suicide. There's a big downside to cooking loads for a living. It's lethal: from obesity to heart attacks to cocaine habits.\"\n\nAround 2012, Ramsay began to make life change. \"I started focusing on getting super-fit five or six years ago when my life got super-busy,\" he told The Daily Mail. \"You get consumed by the work. You get sucked up. You get drawn in. All of a sudden your 'me time' is zero. There was no breathing space, no down time, no time to even think straight. It all started hitting me hard. I didn't panic, but my head was not in the game.\"\n\nRamsay teamed up with a trainer named Will Usher who has him ride bikes in the home gym for an hour and do other workout regiments at least three times a week.\n\nSince then, Ramsay has lost about 56 pounds and his weight has gone down to approximately 196 pounds. The 51-year-old said he stays inspired to lead a healthy lifestyle, because he does not want to die at a young age like his dad, who passed away at 53.\n\n\"That's only a couple of years' time,\" he said. \"I've got this reminder to get fit, it's scary. I get the fear on a daily basis. I may have not got on with him, but I still miss him. I miss everything I could have had from him if he was still alive in his 70s.\"\n\nIn December 2017, Ramsay released a book of his go-to recipes for when he eats well a home, titled .", "images": ["https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/980x490/landscape-1517333895-gordon-ramsay-wife-wieght-loss.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/980x490/landscape-1517333895-gordon-ramsay-wife-wieght-loss.jpg?resize=1200:*", "keywords": [], "authors": ["Eileen Reslen", "I M Eileen", "The Digital News Reporter At Hearst Digital Media."], "canonical_link": "https://www.goodhousekeeping.com/health/diet-nutrition/news/a47803/gordon-ramsay-weight-loss/", "title": "Gordon Ramsay Says He Dropped Over 50 Lbs. to Save His Marriage", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Good Housekeeping", "title": "Gordon Ramsay Says He Dropped Over 50 Lbs. to Save His Marriage", "description": "He says his wife was \"not impressed\" by his weight gain.", "url": "https://www.goodhousekeeping.com/life/entertainment/news/a47803/gordon-ramsay-weight-loss/", "image": {"identifier": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/980x490/landscape-1517333895-gordon-ramsay-wife-wieght-loss.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 119423528138309, "pages": 40241492597}, "article": {"publisher": "https://www.facebook.com/GOODHOUSEKEEPING", "modified_time": "2019-10-23 05:13:26", "published_time": "2018-01-30 05:39:00", "section": "Diet & Nutrition", "opinion": "false"}, "twitter": {"site": "@goodhousemag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/980x490/landscape-1517333895-gordon-ramsay-wife-wieght-loss.jpg?resize=640:*"}, "google-site-verification": "Cyrrih2f3Dh884Dysa4Fuafe2UewzpbR6gnQipgICss", "title": "Gordon Ramsay Lost Over 50 Pounds Out of Fear of Losing His Wife", "description": "In an interview with The Times, the celebrity chef said he feared his fit wife, Tana Ramsay, would leave him because he let himself go.", "keywords": "gordon ramsay, gordon ramsay weight loss, gordon ramsay wife, how much weight did gordon ramsay lose, who is gordon ramsay's wife, gordon ramsay fat, gordon ramsay hells kitchen, gordon ramsay weight loss times interview, gordon ramsay times interview", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/480x480/square-1517333895-gordon-ramsay-wife-wieght-loss.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Health,health,diet-nutrition,Gordon Ramsay", "sailthru.date": "2018-01-30T17:39:00Z", "sailthru.image.full": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/980x490/landscape-1517333895-gordon-ramsay-wife-wieght-loss.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/05/480x480/square-1517333895-gordon-ramsay-wife-wieght-loss.jpg", "sailthru.socialtitle": "Gordon Ramsay Says He Dropped Over 50 Lbs. to Save His Marriage", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1517261940.0, "source": "http://www.goodhousekeeping.com", "summary": ""}