{"url": "https://people.com/home/julianne-hough-30th-birthday-machu-picchu/", "text": "Julianne Hough celebrated her 30th birthday in Machu Picchu, thanks to her husband Brooks Laich.\n\nThe Dancing with the Stars judge was given a surprise trip to Peru from Laich, whom she wed last summer. The trip was payback for a surprise trip to Utah, which Hough took Laich on for his 35th birthday in June. There, they toured Zion National Park, swam in Lake Powell, hiked in Bryce Canyon National Park and went canyoneering in Canaan Mountain Wilderness, among other adventures.\n\nGet push notifications with news, features and more.\n\nLike before, both shared photos and videos from their getaway on Instagram.\n\n“Talk about best birthday ever,” she said on Instagram Stories. “This is unbelievable.”\n\n“My husband knocked my 30th birthday out of the park… and all the way to Machu Picchu,” Hough captioned one photo of them, as they snuggled up (in coordinating ponchos and hats, natch) while sitting on a mountain overlooking the 15th-century Inca site.\n\nRELATED: Julianne Hough Says Husband Brooks Laich Is ‘Obsessed’ with Modeling Vacation Outfits\n\nImage zoom Julianne Hough/Instagram\n\nImage zoom Julianne Hough/Instagram\n\nShe went on to explain that coming to Machu Picchu has “always been a dream,” but that it was especially significant because it marked “a monumental closing of a chapter and beginning of a new one.”\n\n“I have been on such a journey the last few years but especially in the last 7 months,” Hough explained. “Brooks has been there every step of the way supporting me in all of my out of the box, wild ideas and dreams… discovering new parts of me I didn’t even know existed. I couldn’t be happier turning 30 and feeling so much more of what life truly is about. #unfiltered and totally #unknown — Life is absolutely remarkable!”\n\n“Thank you Brooks for completely blowing my mind with your thoughtful and adventurous spirit!” she continued. “I love you so much I can’t even handle myself! #machupicchu #pachamamma #fathersun #bestbirthdayever #dressedtoimpress 😜 #divinefeminine #spire #energyrich.”\n\nLaich was just as sentimental about his wife.\n\n“Words cannot express how much love I have for you babe!” he wrote in a birthday tribute to her. “I love your spirit and your soul, and you bring more joy into my life than I could have ever imagined. You are a powerful young woman capable of anything you want in this world, and I can’t wait to see how you continue to grow, evolve, and change the world!”\n\nIn a video he posted from the mountain cliff, Laich showed his followers the views they experienced while sneaking in a smooch with Hough. “This is a very spiritual and sacred place. And I’m just happy that I’m able to bring [you] here — that you love this,” he said. “We’re going to have an amazing adventure here in Machu Picchu. Take a look, this is beautiful. Happy birthday, babe.”\n\nHough was so excited she said she couldn’t “even move right now.”\n\nWhen she did move, Hough made sure to film a video to her followers, asking them to participate in a breathing exercise with her “to send and receive love and gratitude to the world, to humanity and all that keeps us alive.”\n\n“What I really want for my birthday is to spread more love for the world,” she said in the clip. “That’s what the world needs, is some giving and some receiving of love. … I want that to be my birthday present. If you guys are cool to give that to me, I would be forever grateful. But it’s not just for me, it’s for you. It’s for everybody in the world.”\n\n“Let’s all do it together and spread and receive all the love we can!!!!” she wrote in the video’s caption. “Thank you in advance for the incredible birthday presents!!!! 🙂 love you all sooooooo much!!!!! 🙏🏼❤️.”\n\nVikings star Maude Hirst and Hough’s assistant and “great friend” Kristy Sowin were also along for the fun.\n\n“Happy Birthday to my favorite person ever,” wrote Sowin. “‘You must be the change you wish to see in the world’ couldn’t describe Jules any better. This girl is filled with more joy, compassion, love, and energy than anyone I’ve ever met. I often say that I don’t feel like I have a job, and that’s because my job is simply supporting this girl in her mission to impact the world.”\n\n“For me personally, Jules you have believed in me when I didn’t believe in myself and have (patiently) helped me build a foundation of support in myself that I never thought was possible,” she said. “You make me laugh harder, love deeper, and express myself more freely. Our memories range from hiking Machu Picchu (2 hours ago), watching too many hours of SVU in the back of the tour bus, getting me a puppy, walking on fire, driving each other crazy, endless closet clean outs, 5,000 breakthroughs, obsessing over our dogs, and more. I am so grateful to be your right hand chick, and wouldn’t rather be anywhere else.”\n\nImage zoom Maude Hirst/Instagram\n\nImage zoom Maude Hirst/Instagram\n\nRELATED VIDEO: Go Inside the World’s Best Hotel\n\nHirst called Hough an “incredible woman” in a photo of the two doing yoga moves together.\n\n“I love you more and more everyday, and what a way to celebrate you today,” she wrote.\n\n“Machu Picchu, you have our hearts,” she added, calling Hough’s big day the “best birthday ever.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fscreen-shot-2018-07-21-at-2-15-52-pm-1.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fscreen-shot-2018-07-21-at-2-16-10-pm-1.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fscreen-shot-2018-07-21-at-2-13-18-pm-1.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fscreen-shot-2018-07-21-at-2-13-05-pm-1.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fjulianne.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fjulianne.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/home/julianne-hough-30th-birthday-machu-picchu/", "title": "Julianne Hough's Husband Makes Her 'Dream' Come True on Surprise Birthday Trip to Machu Picchu", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Julianne Hough,News,Travel,TV", "news_keywords": "Julianne Hough,News,Travel,TV", "description": "Julianne Hough celebrated her 30th birthday in Machu Picchu, thanks to her husband Brooks Laich", "og": {"title": "Julianne Hough's Husband Makes Her 'Dream' Come True on Surprise Birthday Trip to Machu Picchu", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/home/julianne-hough-30th-birthday-machu-picchu/", "description": "Julianne Hough&nbsp;celebrated her 30th birthday in Machu Picchu, thanks to her husband Brooks Laich. The&nbsp;Dancing with the Stars judge was given a surprise trip to&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fjulianne.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/home/julianne-hough-30th-birthday-machu-picchu/", "description": "Julianne Hough celebrated her 30th birthday in Machu Picchu, thanks to her husband Brooks Laich", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fjulianne.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/home/julianne-hough-30th-birthday-machu-picchu/", "title": "Julianne Hough's Husband Makes Her 'Dream' Come True on Surprise Birthday Trip to Machu Picchu", "description": "Julianne Hough celebrated her 30th birthday in Machu Picchu, thanks to her husband Brooks Laich", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fjulianne.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}