{"url": "https://www.etonline.com/royal-wedding-countdown-meghan-markle-preparing-for-her-big-day-with-the-help-of-designer-and-aide", "text": "Meghan Markle and Prince Harry will officially be tying the knot at St. George's Chapel in...\n\nDeal or No Deal\n\n...and each and every week, ET will be breaking down all the latest updates as they gear up for their May 19 nuptials.\n\nBIGGEST NEWS OF THE WEEK\n\nWhile there was plenty of royal news that flooded our inboxes this week, we were most excited about getting an update on Meghan's wedding dress! We already knew that she had selected a dress designer (thanks to her stylist-turned-pal, Jessica Mulroney), but now we know what she'll be wearing on her special day is officially in the design process!\n\nA source told ET earlier this week that Meghan has already met with the dress designer, and is busy adding unique touches to the couple's big day.\n\nWe also found out that the Los Angeles native has been appointed a secretary to handle her increasingly busy royal schedule and duties. Amy Pickerill, a former Kensington Palace press officer, was announced on Monday as the new assistant private secretary in the office of Prince Harry.\n\nMeghan Markle Is Planning an 'Intimate' Wedding to Prince Harry This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Meghan Markle Is Planning an 'Intimate' Wedding to Prince Harry\n\nAs for Meghan and Prince Harry's actual wedding day, expect a lot of security. Ken Wharfe, the late Princess Diana's former bodyguard, told ET on Thursday that police will make sure nothing is overlooked for the massive occasion, and no expense will be spared.\n\n\"From my own experiences -- and speaking to colleagues within the last few weeks -- Scotland Yard and neighboring police forces that will be part of this operation will be only too aware of how important it is to make sure that no stone is left unturned, and you know, one talks in this day of austerity of finance,\" he said. \"Trust me on this occasion, finance has nothing to do with this. Scotland Yard, together with Thames Valley Police -- which will be policing this event -- money is not an object, and they make sure that the very best of security is put on display to make sure that security is not compromised.\"\n\nAnd after the soon-to-be-married couple's anthrax scare last Monday, we wouldn't be surprised if there's even more heightened security as they continue their royal duties ahead of their nuptials.\n\nROYAL RUMOR ROUNDUP\n\nLooks like Megan and Kate Middleton have been spending even more quality time together! The former Suits star often goes from her Nottingham Cottage to Kate's humble abode to have tea or exchange advice, according to US Weekly.\n\n“[Meghan] shares tips she’s read about healthy eating,\" a source told the publication.\n\nAnd while it's not a rumor, it seems as if people are comparing Meghan to Princess Diana more and more frequently. According to multiple reports, the bride-to-be has been making secret visits to comfort victims of the Grenfell Tower, much like when Diana would also sneak away from Kensington Palace to visit hospital patients.\n\n\"Meghan's visits mean so much to us. She has a special place in our hearts,\" one community member, who met the soon-to-be-royal, told E!\n\nOUT AND ABOUT\n\nAfter making a trip to Scotland, Meghan and Harry took a break from the spotlight this week -- but did have time for a fun date night.\n\nThe engaged couple attended a Hamilton show at the Victoria Palace Theatre in London's West End last Friday night. One of the show's cast members, Leslie Garcia Bowman, even took to Twitter to express his excitement over having the couple in attendance.\n\nWas an honour to have Prince Harry and Meghan Markle in to watch @HamiltonWestEnd last night! — Leslie Garcia Bowman (@lesliegbowman) February 17, 2018\n\nSERVIN' UP SUITS\n\nIf you've been following along with our royals countdown each week, then you're well aware that we've been binge-watching Meghan's show, Suits, since the beginning. This week, we were super happy to see Meghan, who plays aspiring lawyer Rachel Zane, try on an Anne Barge wedding gown during the \"Cold Feet\" episode of season 5.\n\nWhen the episode originally aired on the USA network last year, Meghan spoke with Glamour, revealing some of her personal favorite bridal styles.\n\n\"Delphine Manivet and Christos Costarellos are faves of mine for their uniqueness and beauty,\" she gushed at the time. \"I will always be a fan of Ellie Saab. J. Mendel is spectacular as well, especially for more structural designs.\"\n\nWatch Meghan model her character's wedding dress in the video below:\n\nSPARKLE LIKE MARKLE\n\nBecause our muscles are still kinda hating us from trying Meghan's favorite Pilates class last week (more on that HERE), we decided to take it easy this time by having a \"treat yourself\" night. We sat back, relaxed and drank like Meghan. Yes, turns out, girl loves a good wine!\n\n\"God, do I love wine; a beautiful full red or a crisp white,\" she revealed in an interview with The New Potato in 2013. \"But if it’s cocktails, I love a spicy tequila cocktail, negroni, or good scotch (neat).\"\n\nShane Mahood/USA Network/NBCU Photo Bank via Getty Images\n\nRATHER REGAL LOOKS\n\nThe queen-to-be truly shined! The seven-month pregnant Duchess of Cambridge looked exquisite at the 2018 BAFTAs, Britain's equivalent to the Oscars, on Feb. 18.\n\nThe expecting mother donned a dark green Jenny Packham gown with cap-sleeves and a black ribbon to accentuate her baby bump. Kate accessorized her regal look with emerald and diamond earrings and a matching necklace.\n\nWPA Pool/Chris Jackson/Getty Images\n\nNEXT IN LINE\n\nOnto Prince William and, of course, more Kate!\n\nThe Duchess began her week alongside Sophie Countess of Wessex, by hosting the Commonwealth Fashion Exchange reception at Buckingham Palace. The brunette beauty arrived wearing a black-and-white floral print Erdem lace dress with black heels, and talked to designers and artisans from around the Commonwealth about their work.\n\nDominic Lipinski - Pool/Getty Images\n\nMeanwhile, the Duke of Cambridge proved he's the coolest dad around town, taking a spin on a motorcycle during his trip to Triumph Motorcycles and MIRA Technology Park in Warwickshire on Feb. 20. Rocking a sleek black motorcycle jacket, he took a test drive on a red Triumph Tiger 1200.\n\nThe Duke test-drives the latest Triumph Tiger 1200. pic.twitter.com/Igul53lui4 — Kensington Palace (@KensingtonRoyal) February 20, 2018\n\nBoth William and Kate continued their royal duties the following day by paying a visit to the Fire Station Sun, one of Sunderland, England's most iconic buildings. There, they put on hard hats and reflective vests as they ventured to the Northern Spire, a new bridge over the River Wear that is scheduled to open later this year.\n\nChris Jackson/Getty Images\n\nQueen Elizabeth II also had quite the interesting week! Her Majesty graced fashionistas with her presence at London Fashion Week, where she presented the inaugural Queen Elizabeth II Award for British Design to Richard Quinn. The 91-year-old head of the monarchy looked enthusiastic as she sat front row next to Vogue editor-in-chief Anna Wintour at the emerging British designer's runway show.\n\nQueen Elizabeth was sophisticatedly dressed in a powder blue Angela Kelly skirt and matching jacket with black gloves and a chic handbag.\n\nYui Mok - Pool/Getty Images\n\nLastly, what we've all been waiting for will finally happen. The Fab Four -- Kate, William, Meghan and Harry -- will all attend the first annual Royal Foundation Forum on Wednesday. And you can bet we'll be going all out for the royal couple's first engagement together since Christmas!\n\nAnd that's a wrap on your weekly royals update. Join us next week for another roundup, and stay tuned to ETonline.com daily for the latest on the royal family!\n\nRELATED CONTENT:\n\nMeghan Markle and Prince Harry Enjoy 'Hamilton' Date Night\n\nMeghan Markle Gets Royal Aide Ahead of Wedding to Prince Harry\n\nKate Middleton and Prince William Put on Hard Hats and Neon Vests to Visit Construction Site\n\nMeghan Markle Is Planning an 'Intimate' Wedding to Prince Harry This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-02/gettyimages-922109150.jpg?itok=50J194ti", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-02/gettyimages-483585198.jpg?itok=p-CGUZRO", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-02/kate_middleton_gettyimages-920876242.jpg?itok=I2xycYsy", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/meghanharry.jpg?h=827f73f4&itok=QSE_OjgD", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-02/gettyimages-919989542.jpg?itok=PDYSDTrW", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/z_03_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=PeQUV6Y8", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-02/z_markle_v3.jpg?itok=Osvs7xhA", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-02/queen_elizabeth_anna_wintour_gettyimages-921522746.jpg?itok=C5rVL0Uw"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/z_03_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=PeQUV6Y8", "keywords": [], "authors": ["Liz Calvario", "Desiree Murphy"], "canonical_link": "https://www.etonline.com/royal-wedding-countdown-meghan-markle-preparing-for-her-big-day-with-the-help-of-designer-and-aide", "title": "Royal Wedding Countdown: Meghan Markle Preparing for Her Big Day With the Help of Designer and Aide", "meta_data": {"article": {"opinion": "false"}, "title": "Royal Wedding Countdown: Meghan Markle Preparing for Her Big Day With the Help of Designer and Aide | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/royal-wedding-countdown-meghan-markle-preparing-for-her-big-day-with-the-help-of-designer-and-aide", "title": "Royal Wedding Countdown: Meghan Markle Preparing for Her Big Day With the Help of Designer and Aide", "description": "ET breaks down everything you need to know ahead of the former 'Suits' star's May 19 nuptials to Prince Harry!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/z_03_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=PeQUV6Y8", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "ET breaks down everything you need to know ahead of the former 'Suits' star's May 19 nuptials to Prince Harry!", "title": "Royal Wedding Countdown: Meghan Markle Preparing for Her Big Day With the Help of Designer and Aide", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Liz Calvario‍ and Desiree Murphy‍", "url": "https://www.etonline.com/royal-wedding-countdown-meghan-markle-preparing-for-her-big-day-with-the-help-of-designer-and-aide", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/z_03_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=PeQUV6Y8"}, "description": "ET breaks down everything you need to know ahead of the former 'Suits' star's May 19 nuptials to Prince Harry!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, News, Kate Middleton, Meghan Markle, Prince Harry, Prince William, Royals, Royal Wedding", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/kXVHf2NGOIU?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}