{"url": "https://www.britannica.com/biography/Anne-Wojcicki", "text": "Anne Wojcicki, (born July 28, 1973, San Mateo county, California), American entrepreneur and cofounder and chief executive officer of the personal genetics company 23andMe.\n\nWojcicki received a B.S. degree (1996) in biology from Yale University. She later worked as a researcher and as an investment analyst. In 2006, while pursuing her interest in the potential to influence health care through personal genetic testing, Wojcicki cofounded 23andMe with American biologist Linda Avey. Wojcicki and Avey believed that individuals provided with personal knowledge of disease risk would be empowered and better prepared to take steps toward disease prevention. The company’s mission—to make genetic testing and its results, including findings about predisposition to disease, available to anyone who was willing to pay—was highly controversial, however. Many officials were concerned about the implications for genetic privacy and about potentially flawed test results. Moreover, much was yet unknown about gene-environment interactions and to what degree certain environmental factors ultimately influenced disease risk.\n\nDespite the controversy, 23andMe quickly gained a foothold in the industry of personalized health care. In 2008 a retail saliva genetic test developed by researchers at 23andMe was named Time magazine’s Invention of the Year. The test provided customers with information about their genetic traits, including estimates of their predisposition toward various health conditions. Customers were able to access their test results online. From 2013 to 2015, however, the company underwent regulatory review by the U.S. Food and Drug Administration (FDA), during which time customers were allowed access only to test results related to their ancestry. Meanwhile, Wojcicki oversaw a number of internal changes at 23andMe, which helped to convince the FDA that the company’s genetic health-related tests and the data they yielded were accurate.\n\nIn 2015, 23andMe also gained FDA approval to sell a genetic test capable of detecting more than 30 autosomal recessive disorders—conditions that manifest when two copies of a disease-causing gene are present in an individual, one inherited from each parent. Such disorders include cystic fibrosis, sickle cell anemia, and Tay-Sachs disease.\n\nGet exclusive access to content from our 1768 First Edition with your subscription. Subscribe today\n\nBy 2016, researchers at 23andMe had genotyped more than one million people worldwide. That same year Wojcicki announced the release of the company’s first genetics research-focused module developed with ResearchKit, an open-source software created by Apple Inc. for the iPhone. The new module enabled researchers to collect genetic information for their studies from 23andMe customers, who had the option of contributing their data to research studies. The development marked a major step forward in Wojcicki’s effort to make the company’s ever-growing database of genetic information available to scientists.\n\nWojcicki and her ex-husband, Sergey Brin, a cofounder of Google, were codirectors of the Brin Wojcicki Foundation, a private grant-making organization with various interests. Wojcicki also led a private real-estate holding company, Los Altos Community Investments (formerly Passerelle Investment Co.), which was known for its investment in the sustainable growth of Los Altos, California, where she lived.", "images": ["https://cdn.britannica.com/s:180x120,c:crop/73/144873-050-104022AE/Yale-University-New-Haven-Conn.jpg", "https://cdn.britannica.com/61/193161-050-D57618EA/Anne-Wojcicki-announcement-23andMe-campus-Breakthrough-Prize-February-20-2013.jpg", "https://safe.britannica.com/safeimages/BFP_marketing_ads_slider.jpg", "https://safe.britannica.com/safeimages/BFP_marketing_ads_300x90_C.jpg", "https://cdn.britannica.com/s:180x120,c:crop/72/151872-050-01556B0A/researcher-microscope-specimen-laboratory.jpg", "https://cdn.britannica.com/marketing/newsletter-icon-white-SM.png", "https://cdn.britannica.com/s:180x120,c:crop/44/155244-050-4460310B/Strands-human-chromosomes.jpg", "https://cdn.britannica.com/s:300x300/61/193161-050-D57618EA/Anne-Wojcicki-announcement-23andMe-campus-Breakthrough-Prize-February-20-2013.jpg"], "top_img": "https://cdn.britannica.com/61/193161-050-D57618EA/Anne-Wojcicki-announcement-23andMe-campus-Breakthrough-Prize-February-20-2013.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.britannica.com/biography/Anne-Wojcicki", "title": "Anne Wojcicki | Biography, Facts, & 23andMe", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "p": {"domain_verify": "5247c07bac63b6b3250f68cfe355c9a2"}, "fb": {"pages": 74442380906, "app_id": 1887621861548296}, "description": "Anne Wojcicki, American entrepreneur and cofounder and chief executive officer of the personal genetics company 23andMe.", "keywords": "Anne Wojcicki, encyclopedia, encyclopeadia, britannica, article", "twitter": {"card": "summary_large_image", "site": "@britannica", "image": "https://cdn.britannica.com/61/193161-050-D57618EA/Anne-Wojcicki-announcement-23andMe-campus-Breakthrough-Prize-February-20-2013.jpg", "description": "Anne Wojcicki, American entrepreneur and cofounder and chief executive officer of the personal genetics company 23andMe."}, "og": {"type": "ARTICLE", "title": "Anne Wojcicki | Biography, Facts, & 23andMe", "description": "Anne Wojcicki, American entrepreneur and cofounder and chief executive officer of the personal genetics company 23andMe.", "site_name": "Encyclopedia Britannica", "url": "https://www.britannica.com/biography/Anne-Wojcicki", "image": {"identifier": "https://cdn.britannica.com/61/193161-050-D57618EA/Anne-Wojcicki-announcement-23andMe-campus-Breakthrough-Prize-February-20-2013.jpg", "type": "image/jpeg"}}}, "movies": [], "publish_date": null, "source": "https://www.britannica.com", "summary": ""}