{"url": "https://web.archive.org/web/20180616013957/https://www.viralwdc.site/national-guard-storms-mexico-border-makes-game-changing-impact-in-just-30-days/", "text": "A major game-changing incident took place after the National Guard stormed the border to protect the immigration laws and defend citizens from having nearly 2,000 people break into America illegally. America is a land of laws and those wishing to immigrate to the country must follow the proper laws and protocol because people cannot simply walk in without following the rules. Thanks to the National Guard arriving at the border to help lend a hand to the roving tribe of potential illegal immigrants, The U.S. Customs and Border Protection officers were able to arrest 1,600 extra people who were trying to allegedly cross the border illegally.\n\nOut of those 1,600 it’s unknown how many people have criminal records, but they were all about to have a criminal record if they broke into a country illegally. The National Guard helped protect the border and provided the extra manpower that was needed to keep the situation under control. It was reported that the level of criminal activity has slowed due to the agents being present.\n\nThe Washington Examiner provided this information about the border situation: “U.S. Customs and Border Protection officers have apprehended an additional 1,600 people attempting to illegally enter the country from Mexico since April 15 as a result of the deployment of National Guard troops to the southwest border, CBP and defense officials said Wednesday.\n\nNational Guard officials overseeing the border state deployments said troops helping monitor the international boundary have freed up more border agents to physically guard the border. The result has led to a surge in the amount of criminal activity agents have stopped.\n\nTrending: BUSTED!! Hillary’s Strange Scarf Accidentally Slips Off In Public Exposes What She’s Been Hiding For Months!\n\nThe increased surveillance and communication between guardsmen and border officers also led to CBP intercepting an additional 451 people who were turned back before illegally entering the U.S.\n\nThose numbers could tick up considerably if the 4,000 National Guard troops President Trump approved on April 4 are called on in a future request from CBP.\n\nAs of Wednesday, 775 troops have been deployed and are on the ground providing “direct support on the ground” in seven sectors assisting law enforcement officers.\n\nTroops are providing support from the air, surveillance back-up, and assistance with infrastructure projects like vegetation clearing and road maintenance, not including to the border wall construction. Another task is to specifically free up agents to leave their desks and get back out to the field. The troops monitoring remote video surveillance systems have then been able to report sightings to a greater field of agents and thus, the number of apprehensions has increased, officials said.\n\n“Those folks are giving us the additional situational awareness in the radio rooms … which are allowing the Border Patrol agents sitting in those areas to go into the field,” said one National Guard official, who described the addition of the Guard as a “force-multiplier” for the CBP.\n\n“As a reminder, these guardsmen are not carrying out law enforcement duties,” an official representing the Texas National Guard said.\n\nGuardsmen have been deployed to the following Border Patrol sectors: 200 to the Rio Grande Valley, 120 to Laredo, 90 to Del Rio, 70 to Big Bend, 110 to El Paso, 135 to Tuscon, and 50 to Yuma.\n\nIn late April, the California National Guard said 200 guardsmen were in training at Camp Roberts and would be deployed in early May. Around 55 troops are already working in those sectors.\n\nThe deployment is funded through the end of fiscal year 2018, September 30. Ronald Vitiello, CBP deputy commissioner, said in April the intent of the mission is for CBP to regain operational control of the border.”\n\nWith the deployment being funded through to the end of the fiscal year of 2018, that means the law should likely be upheld for quite a while until it’s time to renew the budget or the illegal swarm backs off and follows the law.\n\nSome critics are upset that America won’t simply allow people to break into the country, but borders exist for reasons and permit the land to adhere to their laws. Some people want borderless countries, but that would result in absolute chaos much like what’s happening to Germany, Sweden, and London where they have been ravaged by refugees.\n\nWill you comment below and share this to your friends? Will you start a conversation about borders and the proper protocol that it takes to enter a country the legal way.\n\nSource:Viralwdc", "images": ["https://web.archive.org/web/20180616013957im_/http://www.grazeme.com/wp-content/uploads/2016/06/breaking-news1.jpg"], "top_img": "https://web.archive.org/web/20180616013957im_/http://www.grazeme.com/wp-content/uploads/2016/06/breaking-news1.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180616013957/https://www.viralwdc.site/national-guard-storms-mexico-border-makes-game-changing-impact-in-just-30-days/", "title": "National Guard Storms Mexico Border, Makes Game-Changing Impact In Just 30 Days", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.9.6", "fb": {"pages": 262031777305346}, "ia": {"markup_url": "https://www.viralwdc.site/national-guard-storms-mexico-border-makes-game-changing-impact-in-just-30-days/?ia_markup=1"}, "og": {"type": "article", "title": "National Guard Storms Mexico Border, Makes Game-Changing Impact In Just 30 Days", "url": "https://web.archive.org/web/20180616013957/https://www.viralwdc.site/national-guard-storms-mexico-border-makes-game-changing-impact-in-just-30-days/", "description": "A major game-changing incident took place after the National Guard stormed the border to protect the immigration laws and defend citizens from having nearly 2,000 people break into America illegall…", "site_name": "Viral WDC", "image": {"identifier": "https://web.archive.org/web/20180616013957im_/http://www.grazeme.com/wp-content/uploads/2016/06/breaking-news1.jpg", "width": 657, "height": 370}, "locale": "en_US"}, "article": {"published_time": "2018-05-14T18:31:43+00:00", "modified_time": "2018-05-14T18:31:43+00:00"}, "twitter": {"text": {"title": "National Guard Storms Mexico Border, Makes Game-Changing Impact In Just 30 Days"}, "card": "summary"}}, "movies": [], "publish_date": 1526322703.0, "source": "https://web.archive.org", "summary": ""}