{"url": "https://stylecaster.com/boycott-khloe-kardashian-revenge-body/", "text": "We didn’t even have to watch the Revenge Body premiere last night to know there are serious problems with Khloé Kardashian’s new show. But watch we did, and let’s just say we’re not impressed with the reality TV star’s latest endeavor. They say the best revenge is living well—not losing weight. But Kardashian spun the more than 40 pounds she shed after breaking up with ex-husband Lamar Odom into not just a term—”revenge body”—but a TV show. And the results are appalling.\n\nAt the start of the show, you hear a voiceover, led by Kardashian: “This revenge body, who is it for?” Three contestants answer: “My ex-fiancé.” “My mom.” “My friends.” Then you hear Kardashian say, “Haters are our greatest motivators.” To which we say: A resounding no. Here, we list the top five reasons why you should boycott Kardashian’s new show.\n\n👺 1. Weight Loss Should Not Be About Revenge\n\nIf you choose to lose weight, it should be about fulfilling your own personal health goals—not about fulfilling some sort of fantasy to “show” people in your life something. If you’re going to show anyone anything, you should just live your best life. What’s more, the idea that “haters” should be our greatest motivators is so twisted, because if one is using the imagined idea of someone else’s perception as a gauge for personal growth, the scale is pretty much guaranteed to come out skewed.\n\nPlus, Kardashian herself said that she began to work out as a method of stress relief, which, according to her, had nothing to do with losing weight. “I started working out during my divorce, but it was more for sanity reasons,” she told ET.\n\nIn 2013, Kardashian “decided to turn to fitness as a form of therapy and as a stress reliever,” as she wrote on Instagram. “I started slow and eventually I started working out four to five days a week,” she said. That all sounds good: It’s been proven that exercise can lead to happiness, and there are tons of studies on the effect of physical movement on one’s overall well-being.\n\nBut this is a far cry from the spectacle into which she’s spun her enjoyment of exercise. It’s one thing to use moderate exercise as an outlet during a breakup—anything that helps ground oneself in times of chaos is good. “Generally speaking, the strategy of doubling down on self-care in response to a break up is a good one,” eating disorder specialist Tabitha Limotte, LMFT, CEDS, tells us. “However, that means ‘self-care’ in a much broader sense, and with the goals of exerting some control over our life and self-improvement, not revenge.”\n\n👺 2. The Show Is All About Getting Thin—Not Healthy\n\nKardashian has been sharing some seriously problematic “before and after” photos on Instagram leading up to the premiere. For example, in the image on the above left, Kardashian looks perfectly healthy—there’s no reason for her to seek weight loss. But instead, she began working out and obtained what she calls a “revenge body,” which she shows off on the right.\n\nThe issue with channeling one’s attention into revenge—and, even more troubling, into molding one’s body into severely skewed societal standards around what bodies “should” look like as a vehicle toward such a goal—is that it can be extremely unhealthy, and it just doesn’t work, at least not in the long-term.\n\n“The real problem in focusing on our bodies, and on revenge, is that both lend themselves to obsessive behavior,” notes Limotte. “That might make great television, but is not a viable strategy for coping with loss and rejection. The best medicine for that is time, self-discovery, and understanding our relationship patterns so that we are less likely to repeat them.” Yeah, no one is talking about any of that on Revenge Body, that’s for sure.\n\n👺 3. It’s Horribly Exploitative\n\nIn the first few minutes of the show, cameras watch a young man named Will binge-eating Chinese takeout and a chocolate cake alone in his apartment, then sitting shirtless on his bed, looking sad. Then, cut to a snuggle with a huge teddy bear. The shots are voyeuristic and parasitic, clearly reveling in this “inside look”—and completely unnecessary for the storyline of the show. This is plain-old exploitation at its finest, and we can just hear some TV exec saying, “Do we have a giant stuffed animal somewhere? Can we get that on screen?” And so begins an hour of extremely disturbing television.\n\nSure, some may argue that he and his fellow cohort signed up for this, and sign up they did. But people will volunteer to do literally anything if it’ll be televised—see Born in the Wild and Dating Naked—especially if a Kardashian is involved. “It was one of those moments that you’ll never forget in your life, because it’s Khloé Kardashian,” Will says in an on-screen confessional of meeting the reality star.\n\nAs to why Will joined the show: “My boyfriend, Kyle, broke up with me, and I want him back so bad,” he told Kardashian. “I really want to lose all this weight, so maybe I can get him back … He told me, straight to my face, he wasn’t attracted to me anymore.” Kardashian’s response: “Mmm,” telegraphing her best concerned face.\n\n👺 4. This Kind of Exercise Can Lead to Obsession and Eating Disorders\n\nRevenge Body certainly isn’t the first TV show to follow a bunch of people working out in the hopes of losing weight. (Those other shows have their own problems.) But it is the first one to make the process about revenge—the people on this show aren’t motivated to hit the gym for health reasons, though that may play into their decision. They’re getting their sweat on for the express purpose of making someone else feel bad.\n\nIf you start a revenge-based workout plan, it can lead to obsessive exercise. “If the exercise becomes obsessive, it can lead to life-threatening health consequences,” says Limotte, noting those can include physical injury and “psychological impairment.” There’s even a condition associated with this phenomenon—”overtraining syndrome”—which looks like “depression, irritability, and increased anxiety and guilt around not exercising,” adds Limotte. “Over-exercise can also lead to the development of an eating disorder, which is a serious illness that often persists for many years.”\n\n👺 5. Exercise Should Be About Health—and Moderation\n\nEpisode 1 of Revenge Body is the first and last installment of the series we plan to watch. And as far as Limotte is concerned, when in doubt, slow your roll. “I recommend Churchill’s principal of economy of effort: Why exercise for two hours when 30 minutes will suffice?”\n\nKardashian’s last show, Kocktails with Khloé, had an unfortunate name and was pretty lackluster, but at least it was benign. When it was, uh, kanceled, no one was exactly surprised, but perhaps we all should’ve paid a little more attention to the fact that Kardashian was apparently pining to focus her attention on “other jobs,” according to a source via TMZ when Kocktails was shut down. Now we know what those “other jobs” entail, and now we’re pining—for earlier days of Kardashian TV.", "images": ["https://scstylecaster.files.wordpress.com/2015/12/bibi-dietz.jpeg?resize=%2C", "https://scontent-lax3-1.cdninstagram.com/v/t51.2885-15/e15/10369437_1405176929794377_1260868061_n.jpg?_nc_ht=scontent-lax3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=0K3A-poQoYYAX9ahjUN&oh=df3a128bbf3ea7268a52005d734d3f89&oe=5EC38AA0", "https://scstylecaster.files.wordpress.com/2020/04/chris-harrison.png?w=120&h=120&crop=1", "https://scstylecaster.files.wordpress.com/2020/03/tiger-king-netflix-1.png?w=120&h=120&crop=1", "https://scstylecaster.files.wordpress.com/2017/01/boycott-khloe-kardashian-revenge-body.jpg", "https://scstylecaster.files.wordpress.com/2020/04/blackpink-jisoo.jpg?w=120&h=120&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=stylecaster.com&path=%2Fboycott-khloe-kardashian-revenge-body%2F&ct=article&lob=&loc=us&env=desktop&post_id=657310&comment_count=1", "https://www.facebook.com/tr?id=1130306277008218&ev=PageView&noscript=1", "https://scstylecaster.files.wordpress.com/2020/02/prince-harry.png?w=120&h=120&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://scontent-lax3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/15877053_244837915939489_6008249507223961600_n.jpg?_nc_ht=scontent-lax3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=OIf40191b18AX9M-RJs&oh=b187e6e7d184dfa36d9fd1e0a473d23c&oe=5EC3CBA0", "https://scontent-lax3-2.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/15802860_848743975228931_5559092294243581952_n.jpg?_nc_ht=scontent-lax3-2.cdninstagram.com&_nc_cat=111&_nc_ohc=d7LYvB_ajMAAX9_P3Wo&oh=e88fcd0a3e44d2ece63e2638ab77b393&oe=5EC49D47"], "top_img": "https://scstylecaster.files.wordpress.com/2017/01/boycott-khloe-kardashian-revenge-body.jpg", "keywords": [], "authors": ["Bibi Deitz"], "canonical_link": "https://stylecaster.com/boycott-khloe-kardashian-revenge-body/", "title": "5 Reasons to Boycott Khloe Kardashian’s New Show, ‘Revenge Body’", "meta_data": {"description": "We don't even have to watch Revenge Body to know there are serious problems with Khloé Kardashian's new show. But watch we did, and let's just say we're not impressed with the reality TV star's latest endeavor. Quite frankly, the show is appalling.", "keywords": "the kardashians, khloe kardashian, revenge body, celebrity workouts, celebrity fitness, the problem with revenge body, eating disorders", "msvalidate.01": "7A34A1C1904BAFB83691E8B3718CA9A2", "article": {"publisher": "https://www.facebook.com/stylecaster", "published_time": "2017-01-13T22:00:52+00:00", "modified_time": "2018-12-18T01:30:59+00:00", "author": "Bibi Deitz", "section": "Entertainment", "tag": "the problem with revenge body"}, "google-site-verification": "yB_5UwT5pPNnn93Mba5HIaFkNtbrafDQWP_Rj34Iw08", "news_keywords": "Celebrity Fitness, Celebrity workouts, eating disorders, khloe kardashian, Revenge Body, the kardashians, the problem with revenge body", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "generator": "WordPress.com", "author": "Bibi Deitz", "application-name": "StyleCaster", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Style News, Fashion Trends & Beauty Tips", "msapplication-task": "name=Subscribe;action-uri=https://stylecaster.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/f95e80beb275448b98a924f84cc3473a?s=16", "onesignal": "wordpress-plugin", "og": {"site_name": "StyleCaster", "type": "article", "locale": "en_US", "url": "https://stylecaster.com/boycott-khloe-kardashian-revenge-body/", "title": "5 Reasons to Boycott Khloe Kardashian’s New Show, ‘Revenge Body’", "description": "For starters, it promotes eating disorders.", "image": {"identifier": "https://scstylecaster.files.wordpress.com/2017/01/boycott-khloe-kardashian-revenge-body.jpg", "width": 1024, "height": 683}}, "fb": {"app_id": 134683123322801, "pages": 48566051011, "article_style": "scdefault"}, "twitter": {"card": "summary_large_image", "site": "@stylecaster", "creator": "@stylecaster", "title": "5 Reasons to Boycott Khloe Kardashian’s New Show, ‘Revenge Body’", "description": "For starters, it promotes eating disorders.", "image": "https://scstylecaster.files.wordpress.com/2017/01/boycott-khloe-kardashian-revenge-body.jpg", "account_id": 55678606}}, "movies": [], "publish_date": 1484344852.0, "source": "https://stylecaster.com", "summary": ""}