{"url": "https://www.bustle.com/p/what-did-robert-say-to-willow-on-the-royals-finale-the-kings-words-were-extra-convincing-9029778", "text": "Spoilers for The Royals Season 4 finale follow. King Robert has demonstrated before that he can talk his way out of things, but he proves just how smooth he is during The Royals Season 4 finale. Willow chooses to marry Robert on The Royals after she had promised his family to expose his corruptness to the world. Robert speaks to Willow right before their wedding and apparently, whatever he tells her makes Willow change her mind. So what did Robert tell Willow to convince her to marry him? Only a Season 5 could reveal the true answer, but Robert's words were inspired by a vision of his dead father.\n\nBefore the wedding, Liam talks to Robert in an effort to make him realize that he would be better as a virtuous king. \"Dad wanted to disband the monarchy because he understood how that kind of power can corrupt even the best of us,\" Liam says. Robert is initially insulted by Liam's insinuations, but he softens when Liam tells him how much he loved and appreciated Robert when Robert was good. Robert then envisions his father, who is the reason Robert is so desperate to be considered a great king. King Simon tells him, \"You know where your salvation lies.\" As their conversation continues, it becomes clear that King Simon is saying that Willow is Robert's salvation.\n\nE!\n\nWhy Robert chose Willow to be his bride is still a bit of a mystery. Although he claims it's because of how he feels, the previous episode proved that was a lie. He had used Eleanor's letter to Jasper to win back Willow after a fight. And if you genuinely loved someone, you would be able to express yourself without assistance. Willow recognizes this, which is why she decides she can't marry Robert and offers to say that he caused the power outage during the wedding.\n\nBut something clicked for Robert after his conversations with Liam and his ghost dad. While Willow waits by herself to walk down the aisle, Robert approaches her — breaking wedding tradition. \"We need to talk,\" Robert says. The Royals doesn't show what he says to her, but one theory is that he is finally honest with Willow. He's been so focused on being a king that he hasn't really opened himself up to actually love her. Does he tell Willow this and show his vulnerable side? Does he say he needs her to make him a better man, as his father said? Is that why she goes through with the marriage?\n\nE!\n\nWell, Robert better have been honest to Willow. Especially since his father had just told him, \"Don't diminish her light with your darkness.\" And while it's optimistic to think Robert has decided to be a decent ruler and person, maybe he's not really as bad as his family thinks he is. Willow's face definitely conveys that she's really happy with her decision to say, \"I do.\"\n\nYet, it's Robert's face that people should be paying attention to in that moment. Because while he looks happy, he also looks a bit too pleased with himself. Is that the face of a man who just married the woman he loves? Or is that the face of a man who has just won?\n\nE!\n\nIf Robert is still being manipulative, then he could have told Willow what he thought she wanted to hear to ensure she went through with the wedding. Perhaps his conversation with Liam tipped him off that something was amiss, so he did some damage control. Or, there's the option that there's a darkness in Willow too. Both Eleanor and Liam believe that Willow is a decent, trustworthy person. But maybe now that she has gotten this close to marrying the king, his words make her realize she doesn't want to back out now. Her desire to become queen could have overwhelmed her. It would be a drastic shift for the character, but it would make for some excellent drama in a potential Season 5 if King Robert and Queen Wilhelmina ruled the U.K. as an evil power couple.\n\nSpeaking of Season 5, what Robert said to Willow before their wedding should be revealed if The Royals gets another season. And at that point, the show should also reveal whether Willow did some talking of her own and exposed Robert's family as traitors.", "images": ["https://imgix.bustle.com/uploads/image/2018/5/11/b0cf584d-a746-4656-9474-e9fe4609e543-screen-shot-2018-05-11-at-13159-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/12/cbcfaed8-1fcd-4659-ba5c-92e3b20ea7f9-151738_9780.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/16a00067-56c2-49ee-a7ae-5beaeaa06573-mv5bnti4n2exytctm2jims00ztiylwjjyjitymvlmdy5ztg0mmuxxkeyxkfqcgdeqxvymtkxnjuynq_v1_sy1000_sx1500_al_.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/11/d7ed7d2b-2ff7-46a0-b5f8-e5dd174222a5-screen-shot-2018-05-11-at-15240-pm.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/c9efe01b-626e-4b4f-ad3c-61f6a7b2a773-domhnall-gleeson-merritt-wever.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/5/11/a6ec7002-7946-4fe6-88ef-e7df7b51f13f-screen-shot-2018-05-11-at-13150-pm.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/11/b0cf584d-a746-4656-9474-e9fe4609e543-screen-shot-2018-05-11-at-13159-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/11/211fc0aa-35a9-4016-8d55-c9087a924e9d-screen-shot-2018-05-11-at-64623-pm.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/7a1b5b98-35a3-43f9-b4b6-aaa2be1ff6a5-154120_0225.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/11/b0cf584d-a746-4656-9474-e9fe4609e543-screen-shot-2018-05-11-at-13159-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/what-did-robert-say-to-willow-on-the-royals-finale-the-kings-words-were-extra-convincing-9029778", "title": "What Did Robert Say To Willow On 'The Royals' Finale? The King's Words Were Extra Convincing", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/what-did-robert-say-to-willow-on-the-royals-finale-the-kings-words-were-extra-convincing-9029778", "type": "article", "title": "Willow Makes Her Decision About Marrying Robert On 'The Royals'", "description": "Spoilers for The Royals Season 4 finale follow. King Robert has demonstrated before that he can talk his way out of things, but he proves just how smooth he is during The Royals Season 4 finale. Willow chooses to marry Robert on The Royals after she…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/11/b0cf584d-a746-4656-9474-e9fe4609e543-screen-shot-2018-05-11-at-13159-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Spoilers for The Royals Season 4 finale follow. King Robert has demonstrated before that he can talk his way out of things, but he proves just how smooth he is during The Royals Season 4 finale. Willow chooses to marry Robert on The Royals after she…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}