{"url": "https://variety.com/2017/tv/news/greys-anatomy-season-finale-stephanie-edwards-jerrika-hinton-leaving-1202434888/", "text": "SPOILER ALERT: Do not read ahead, if you have not watched the season finale of “Grey’s Anatomy” Season 13, which aired on Thursday, May 18.\n\nGrey Sloan Memorial said goodbye to one of its own, after a fire rocked the hospital in the Season 13 finale of “Grey’s Anatomy” — but despite some major foreshadowing, the goodbye was not due to death, unlike most “Grey’s” departures.\n\nHowever, that doesn’t mean the exit isn’t permanent. The season finale revealed that Jerrika Hinton’s Dr. Stephanie Edwards is leaving her job and the medical profession entirely. The storyline comes as the actress is exiting the ABC series for a role in Alan Ball’s new HBO drama, as Variety previously reported.\n\nIn Thursday night’s episode, after fighting off a rapist and dodging an explosion, Edwards spent the season-ender ignoring her own life-threatening burns to save a little girl — which she did, by the way — in the process, she realized what she wants out of life: to stop spending all her time in hospitals.\n\nAs for Hinton, the actress joined “Grey’s Anatomy” in 2012. She expanded her Shondaland relationship last season when she was cast as the lead in the company’s comedy pilot “Toast,” which ultimately did not go to series.\n\nRegarding Hinton’s exit, in a statement provided to Variety, series creator Shonda Rhimes said: “Actors evolve differently and when an actor like Jerrika comes to me and says she wants to try something new creatively, I like to honor that. Jerrika has shared so much of herself with Stephanie and I am incredibly proud of the journey we’ve taken together. While I’m sad to see Stephanie leave Grey Sloan Memorial Hospital, I am excited to see what’s next for Jerrika.”\n\nHere, Hinton fights back tears as she speaks to Variety about her decision to leave “Grey’s Anatomy,” her new HBO series, and why you shouldn’t expect to see Edwards back in Seattle any time soon…\n\nWhen did you decide to leave the show?\n\nShonda and I met almost a year ago now, and we had a very lengthy and gratifying and really splendid conversation about work and creative process. She was immensely supportive of my wishes, and she’s really lovely, Shonda. Every private conversation I’ve had with her has left with me feeling just heard and seen and respected as a human being and as an artist, and I really appreciate that.\n\nHave we seen the last of Edwards full time, or could we see her come back in a guest role?\n\nI genuinely don’t know the answer to that question. I will say, though, that because of the nature of her injuries and because of what she says she wants to experience in her next chapter of life, if we do see her come back through those doors, it will be a long time. I think that she needs to heal. She needs to heal in a variety of ways before that place becomes a viable option again.\n\nCan you pinpoint a favorite moment you had with your character over the years?\n\nTo be honest, that final scene … with Jim Pickens [who plays Dr. Webber], that stands out in my memory. That was, for a scene that’s so weighty, so heavy, tapping into it was a beautifully straightforward process. Jim is a fantastic scene partner. I always feel very safe with him. And Debbie [Allen, who directed the episode], the way that Debbie really just let us do what we needed to do allowed for all elements to really coalesce. And I haven’t seen it, [so] I hope that it comes across on screen. But on the day, shooting that was lovely.\n\nDo you have a favorite memory from your time on the show?\n\nI don’t know if I’m gonna have an opportunity to talk about what I will miss about Stephanie, is that okay? I’m gonna miss — wow, I didn’t expect this. I’m feeling emotional now. Need to go grab some Kleenex. I think I’m just gonna miss her willingness to go the extra mile for what she believes in. I think it’s a quality that has been there from day one. I was thinking about this a few weeks ago, and something I remember from back in Season 9 is the way she really rallied Leah and Joe when Shane was going through a hard time. She told them not to give up and that we are all a part of this together. … I think that she has such great fortitude and empathy and brilliance, and she’s just, I think, for all of the folly of youth that she has, she’s such a wonderful person. I was friends with her, and that’s a great compliment because I choose friends carefully.\n\nCan you tease anything about your HBO show?\n\nI will say this: Five years of working in Shondaland makes me nervous about teasing things. I think I can, but all of my instincts in my body say, “Keep your mouth shut,” and I’ve gotta work on letting go of that. But it’s a really wonderful new project. It’s a new drama from Alan Ball, who is a phenomenal writer. And I will say that we’ve already started working on it, and it’s genuinely been a gratifying, collaborative, generous, and welcoming experience, and I feel so fortunate. I used to say, all the time, that being welcomed into Shondaland felt like winning the lottery, and I still feel that way. And now, moving from there to this, I don’t even know what’s beyond the lottery.\n\nEven though you’re leaving, do you have any intel on “Grey’s Anatomy” Season 14?\n\nI literally have zero idea, and I have not asked because I don’t work there anymore. When I worked there, I would ask all of those questions, and now that I don’t, it’s a beautiful mystery.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2017/05/greys-anatomy-finale.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fgreys-anatomy-season-finale-stephanie-edwards-jerrika-hinton-leaving-1202434888%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202434888&comment_count=14", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/05/greys-anatomy-finale.jpg?w=1000", "keywords": [], "authors": ["Jean Bentley"], "canonical_link": "https://variety.com/2017/tv/news/greys-anatomy-season-finale-stephanie-edwards-jerrika-hinton-leaving-1202434888/", "title": "‘Grey’s Anatomy’ Season 13 Finale Says Goodbye to Another Cast Member (SPOILERS)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Jerrika Hinton is leaving \"Grey's Anatomy.\" The actress spoke to Variety about her exit and the Season 13 finale.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202434888, "author": "Jean Bentley", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-05-18T18:00:19"}, "pmc-tag": "ABC,Grey's Anatomy,Jerrika Hinton", "title": "‘Grey’s Anatomy’ Season 13 Finale Says Goodbye to Another Cast Member (SPOILERS)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Grey’s Anatomy’ Season 13 Finale Says Goodbye to Another Cast Member (SPOILERS)", "url": "https://variety.com/2017/tv/news/greys-anatomy-season-finale-stephanie-edwards-jerrika-hinton-leaving-1202434888/", "description": "SPOILER ALERT: Do not read ahead, if you have not watched the season finale of “Grey’s Anatomy” Season 13, which aired on Thursday, May 18. Grey Sloan Memorial said goodbye to one…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/05/greys-anatomy-finale.jpg?w=1000", "width": 1000, "height": 563, "alt": "Grey's Anatomy Jerrika Hinton"}, "locale": "en_US"}, "article": {"published_time": "2017-05-19T01:00:19+00:00", "modified_time": "2017-05-19T01:09:19+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "‘Grey’s Anatomy’ Season 13 Finale Says Goodbye to Another Cast Member (SPOILERS)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/05/greys-anatomy-finale.jpg?w=1000", "alt": "Grey's Anatomy Jerrika Hinton"}, "card": "summary_large_image", "title": "‘Grey’s Anatomy’ Season 13 Finale Says Goodbye to Another Cast Member (SPOILERS)", "description": "Jerrika Hinton is leaving \"Grey's Anatomy.\" The actress spoke to Variety about her exit and the Season 13 finale."}, "author": "Jean Bentley", "content_type": "Article", "post_id": 1202434888, "title": "'Grey's Anatomy' Season 13 Finale Says Goodbye to Another Cast Member (SPOILERS)", "published_at": "2017-05-18 18:00:19", "image": "https://pmcvariety.files.wordpress.com/2017/05/greys-anatomy-finale.jpg?w=1000", "comment_count": 14, "tags": "Jerrika Hinton", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read ahead, if you have not watched the season finale of \"Grey's Anatomy\" Season 13, which aired on Thursday, May 18.\r\n\r\nGrey Sloan Memorial said goodbye to one of its own, after a fire rocked the hospital in the Season 13 finale of \"Grey's Anatomy\" — but despite some major foreshadowing, the goodbye was not due to death, unlike most \"Grey's\" departures.\r\n\r\nHowever, that doesn't mean the exit isn't permanent. The season finale revealed that Jerrika Hinton's Dr. Stephanie Edwards is leaving her job and the medical profession entirely. The storyline comes as the actress is exiting the ABC series for a role in Alan Ball's new HBO drama, as Variety previously reported.\r\n\r\n\r\n\r\nIn Thursday night's episode, after fighting off a rapist and dodging an explosion, Edwards spent the season-ender ignoring her own life-threatening burns to save a little girl -- which she did, by the way -- in the process, she realized what she wants out of life: to stop spending all her time in hospitals.\r\n\r\nAs for Hinton, the actress joined \"Grey's Anatomy\" in 2012. She expanded her Shondaland relationship last season when she was cast as the lead in the company's comedy pilot \"Toast,\" which ultimately did not go to series.\r\n\r\nRegarding Hinton's exit, in a statement provided to Variety, series creator Shonda Rhimes said: \"Actors evolve differently and when an actor like Jerrika comes to me and says she wants to try something new creatively, I like to honor that. Jerrika has shared so much of herself with Stephanie and I am incredibly proud of the journey we've taken together. While I'm sad to see Stephanie leave Grey Sloan Memorial Hospital, I am excited to see what's next for Jerrika.\"\r\n\r\n\r\n\r\nHere, Hinton fights back tears as she speaks to Variety about her decision to leave \"Grey's Anatomy,\" her new HBO series, and why you shouldn't expect to see Edwards back in Seattle any time soon...\r\n\r\nWhen did you decide to leave the show?\r\n\r\nShonda and I met almost a year ago now, and we had a very lengthy and gratifying and really splendid conversation about work and creative process. She was immensely supportive of my wishes, and she's really lovely, Shonda. Every private conversation I've had with her has left with me feeling just heard and seen and respected as a human being and as an artist, and I really appreciate that.\r\n\r\nHave we seen the last of Edwards full time, or could we see her come back in a guest role?\r\n\r\nI genuinely don't know the answer to that question. I will say, though, that because of the nature of her injuries and because of what she says she wants to experience in her next chapter of life, if we do see her come back through those doors, it will be a long time. I think that she needs to heal. She needs to heal in a variety of ways before that place becomes a viable option again.\r\n\r\nCan you pinpoint a favorite moment you had with your character over the years?\r\n\r\nTo be honest, that final scene ... with Jim Pickens [who plays Dr. Webber], that stands out in my memory. That was, for a scene that's so weighty, so heavy, tapping into it was a beautifully straightforward process. Jim is a fantastic scene partner. I always feel very safe with him. And Debbie [Allen, who directed the episode], the way that Debbie really just let us do what we needed to do allowed for all elements to really coalesce. And I haven't seen it, [so] I hope that it comes across on screen. But on the day, shooting that was lovely.\r\n\r\nDo you have a favorite memory from your time on the show?\r\n\r\nI don't know if I'm gonna have an opportunity to talk about what I will miss about Stephanie, is that okay? I'm gonna miss — wow, I didn't expect this. I'm feeling emotional now. Need to go grab some Kleenex. I think I'm just gonna miss her willingness to go the extra mile for what she believes in. I think it's a quality that has been there from day one. I was thinking about this a few weeks ago, and something I remember from back in Season 9 is the way she really rallied Leah and Joe when Shane was going through a hard time. She told them not to give up and that we are all a part of this together. ... I think that she has such great fortitude and empathy and brilliance, and she's just, I think, for all of the folly of youth that she has, she's such a wonderful person. I was friends with her, and that's a great compliment because I choose friends carefully.\r\n\r\nCan you tease anything about your HBO show?\r\n\r\nI will say this: Five years of working in Shondaland makes me nervous about teasing things. I think I can, but all of my instincts in my body say, \"Keep your mouth shut,\" and I've gotta work on letting go of that. But it's a really wonderful new project. It's a new drama from Alan Ball, who is a phenomenal writer. And I will say that we've already started working on it, and it's genuinely been a gratifying, collaborative, generous, and welcoming experience, and I feel so fortunate. I used to say, all the time, that being welcomed into Shondaland felt like winning the lottery, and I still feel that way. And now, moving from there to this, I don't even know what's beyond the lottery.\r\n\r\nEven though you're leaving, do you have any intel on \"Grey's Anatomy\" Season 14?\r\n\r\nI literally have zero idea, and I have not asked because I don't work there anymore. When I worked there, I would ask all of those questions, and now that I don't, it's a beautiful mystery.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1495155619.0, "source": "https://variety.com", "summary": ""}