{"url": "https://deadline.com/2018/08/the-big-bang-theory-end-run-12-seasons-final-season-cbs-1202450437/", "text": "The Big Bang Theory is going out on top. Despite recent remarks by CBS that it was in talks for more seasons of the highly-rated series, the network, producing studio Warner Bros. TV and executive producer Chuck Lorre just announced that the comedy will end its run in May 2019 with its upcoming 12th season. The Big Bang Theory still will rank as the longest-running multi-camera series in television history per WBTV, spanning 12 seasons and a record-breaking 279 episodes, .\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\n“We are forever grateful to our fans for their support of The Big Bang Theory during the past twelve seasons. We, along with the cast, writers and crew, are extremely appreciative of the show’s success and aim to deliver a final season, and series finale, that will bring The Big Bang Theory to an epic creative close,” WBTV, CBS and Chuck Lorre Productions said in a joint statement.\n\nCBS\n\nThe announcement about The Big Bang Theory coming to an end comes just two weeks after CBS Entertainment president Kelly Kahl said at TCA that “we don’t believe it’s the final season; we are in preliminary discussions to renew the show with the studio that produces it, Warner Bros.”\n\nI hear conversations about a possible two-year renewal were going on as recently as late last week.\n\nEleven seasons in, The Big Bang Theory remains one of the biggest shows on television. Season 11 averaged 18.9 million viewers, even with Season 10. It was the second most watched series of last season, edging Sunday Night Football and only behind the now-canceled Roseanne. Among adults 18-49, Big Bang slipped a bit (4.4 in Live+7 vs. 4.9 last season) but still ranked as the second highest-rated entertainment program behind only NBC’s This Is Us.\n\nAccording to sources, the decision to end the series was largely a creative one made by the producers. It was perceived that Season 12 would be the show’s last when CBS in 2017 renewed Big Bang for seasons 11 and 12 after WBTV had closed new two-year deals with the cast. But then few expected that Big Bang would remain as strong in the ratings as it’s been, maintaining its viewership and top standing in the rankings when most broadcasting series have been sliding.\n\nTo go beyond 12 seasons, Warner Bros. TV would’ve had to negotiate new contracts with the actors. The show’s original quintet are the highest-paid actors on TV with paychecks of around $1 million an episode.\n\nREX/Shutterstock\n\nThere are no deals in place for next season between CBS and WBTV, between the studio and the cast as well as between the studio and the series’ creative staff. While this was not a business call as CBS and WBTV would’ve likely reached an agreement for more seasons, I hear that, with so many unknowns and not clear whether everyone wanted to come back, the producers had no desire to continue with the show creatively without the entire family on the show intact.\n\nThat and the lure of leaving on top, as the highest-rated comedy on television, having achieved the milestone of longest-running multi-camera sitcom, sealed the decision to end the series.\n\nThe final season of The Big Bang Theory will debut Monday, September 24 on CBS before moving to its regular time period on Thursday, September 27.\n\n“The Big Bang Theory has been the defining comedy of its generation,” Kahl said today. “All of us at the Network take exceptional pride in this series that uniquely combines creative genius, commercial ratings success, cultural influence and characters who became so popular, they are easily known by just one name. We’re incredibly grateful for our partnership with Warner Bros., Chuck Lorre Productions and a brilliant cast and crew that has made such a ‘big bang’ and lasting legacy on the television landscape.”\n\n.\n\nThe Big Bang Theory, which debuted in 2007 and airs in syndication around the world, has received 52 Emmy nominations and 10 wins to date (though has never won for Outstanding Comedy Series), and 7 Golden Globe nominations.\n\nSince its off-network launch, Big Bang has been a syndication powerhouse and continues to deliver big ratings for TBS and the stations that carry it, with its success possibly marking an end of an era and may never be matched again.\n\nThe Big Bang Theory is executive produced by Chuck Lorre, Bill Prady, Steven Molaro and Steve Holland. The series stars Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar, Mayim Bialik and Melissa Rauch. The Big Bang Theory is produced by Chuck Lorre Productions, Inc., in association with Warner Bros. Television.\n\nIn 2015, the first-ever UCLA scholarship created by and named for a television series, The Big Bang Theory Scholarship supports undergraduate students in need of financial aid who are pursuing their higher education in the fields of Science, Technology, Engineering and Mathematics (STEM).\n\nAnd some fun facts: In addition to centering many of its episodes in the worlds of science and technology, The Big Bang Theory enjoys a healthy appreciation and support from the scientific community at large, including having a bee species (Euglossa bazinga), a jellyfish species (Bazinga Rieki) and a monkey at the Columbus Zoo (Dr. Sheldon Cooper) named in the show’s honor.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F08%2Fthe-big-bang-theory-end-run-12-seasons-final-season-cbs-1202450437%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202450437&comment_count=70", "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pmcdeadline2.files.wordpress.com/2018/05/big-bang-theory-s11-finale.jpg?w=1024", "https://pmcdeadline2.files.wordpress.com/2018/03/big-bang-theory.jpg?w=418&h=283", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/09/cbs-logo.jpg?w=149&h=152"], "top_img": "https://pmcdeadline2.files.wordpress.com/2018/05/big-bang-theory-s11-finale.jpg?w=1024", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/08/the-big-bang-theory-end-run-12-seasons-final-season-cbs-1202450437/", "title": "‘The Big Bang Theory’ To End Run After 12 Seasons On CBS With “Epic Close”", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "The Big Bang Theory will end its run after 12 seasons.", "news_keywords": "CBS, The Big Bang Theory", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Big Bang Theory’ To End Run After 12 Seasons On CBS With “Epic Close”", "url": "https://deadline.com/2018/08/the-big-bang-theory-end-run-12-seasons-final-season-cbs-1202450437/", "description": "The Big Bang Theory is going out on top. Despite recent remarks by CBS that it was in talks for more seasons of the highly-rated series, the network, producing studio Warner Bros. TV and executive …", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/05/big-bang-theory-s11-finale.jpg?w=1024", "width": 1024, "height": 719}, "locale": "en_US"}, "article": {"published_time": "2018-08-22T18:27:10+00:00", "modified_time": "2019-09-06T22:34:04+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘The Big Bang Theory’ To End Run After 12 Seasons On CBS With “Epic Close”"}, "image": "https://pmcdeadline2.files.wordpress.com/2018/05/big-bang-theory-s11-finale.jpg?w=1024", "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "‘The Big Bang Theory’ To End Run After 12 Seasons On CBS With “Epic Close”", "description": "The Big Bang Theory will end its run after 12 seasons."}, "author": "Nellie Andreeva", "content_type": "Article", "post_id": 1202450437, "title": "'The Big Bang Theory' To End Run After 12 Seasons On CBS With \"Epic Close\"", "published_at": "2018-08-22 11:27:10", "image": "https://pmcdeadline2.files.wordpress.com/2018/05/big-bang-theory-s11-finale.jpg?w=296&h=166&crop=1", "comment_count": 70, "tags": "The Big Bang Theory", "topics": "TV", "body": "The Big Bang Theory is going out on top. Despite recent remarks by CBS that it was in talks for more seasons of the highly-rated series, the network, producing studio Warner Bros. TV and executive producer Chuck Lorre just announced that the comedy will end its run in May 2019 with its upcoming 12th season. The Big Bang Theory still will rank as the longest-running multi-camera series in television history per WBTV, spanning 12 seasons and a record-breaking 279 episodes, .\r\n\r\n“We are forever grateful to our fans for their support of The Big Bang Theory during the past twelve seasons. We, along with the cast, writers and crew, are extremely appreciative of the show’s success and aim to deliver a final season, and series finale, that will bring The Big Bang Theory to an epic creative close,” WBTV, CBS and Chuck Lorre Productions said in a joint statement.\r\n\r\n\r\n\r\nThe announcement about The Big Bang Theory coming to an end comes just two weeks after CBS Entertainment president Kelly Kahl said at TCA that “we don’t believe it’s the final season; we are in preliminary discussions to renew the show with the studio that produces it, Warner Bros.”\r\n\r\nI hear conversations about a possible two-year renewal were going on as recently as late last week.\r\n\r\nEleven seasons in, The Big Bang Theory remains one of the biggest shows on television. Season 11 averaged 18.9 million viewers, even with Season 10. It was the second most watched series of last season, edging Sunday Night Football and only behind the now-canceled Roseanne. Among adults 18-49, Big Bang slipped a bit (4.4 in Live+7 vs. 4.9 last season) but still ranked as the second highest-rated entertainment program behind only NBC’s This Is Us. \r\n\r\nAccording to sources, the decision to end the series was largely a creative one made by the producers. It was perceived that Season 12 would be the show's last when CBS in 2017 renewed Big Bang for seasons 11 and 12 after WBTV had closed new two-year deals with the cast. But then few expected that Big Bang would remain as strong in the ratings as it's been, maintaining its viewership and top standing in the rankings when most broadcasting series have been sliding.\r\n\r\nTo go beyond 12 seasons, Warner Bros. TV would've had to negotiate new contracts with the actors. The show’s original quintet are the highest-paid actors on TV with paychecks of around $1 million an episode.\r\n\r\n\r\n\r\nThere are no deals in place for next season between CBS and WBTV, between the studio and the cast as well as between the studio and the series' creative staff. While this was not a business call as CBS and WBTV would've likely reached an agreement for more seasons, I hear that, with so many unknowns and not clear whether everyone wanted to come back, the producers had no desire to continue with the show creatively without the entire family on the show intact.\r\n\r\nThat and the lure of leaving on top, as the highest-rated comedy on television, having achieved the milestone of longest-running multi-camera sitcom, sealed the decision to end the series.\r\n\r\nThe final season of The Big Bang Theory will debut Monday, September 24 on CBS before moving to its regular time period on Thursday, September 27.\r\n\r\n“The Big Bang Theory has been the defining comedy of its generation,” Kahl said today. “All of us at the Network take exceptional pride in this series that uniquely combines creative genius, commercial ratings success, cultural influence and characters who became so popular, they are easily known by just one name. We’re incredibly grateful for our partnership with Warner Bros., Chuck Lorre Productions and a brilliant cast and crew that has made such a ‘big bang’ and lasting legacy on the television landscape.”\r\n\r\n\r\n\r\nThe Big Bang Theory, which debuted in 2007 and airs in syndication around the world, has received 52 Emmy nominations and 10 wins to date (though has never won for Outstanding Comedy Series), and 7 Golden Globe nominations.\r\n\r\nSince its off-network launch, Big Bang has been a syndication powerhouse and continues to deliver big ratings for TBS and the stations that carry it, with its success possibly marking an end of an era and may never be matched again.\r\n\r\nThe Big Bang Theory is executive produced by Chuck Lorre, Bill Prady, Steven Molaro and Steve Holland. The series stars Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar, Mayim Bialik and Melissa Rauch. The Big Bang Theory is produced by Chuck Lorre Productions, Inc., in association with Warner Bros. Television.\r\n\r\nIn 2015, the first-ever UCLA scholarship created by and named for a television series, The Big Bang Theory Scholarship supports undergraduate students in need of financial aid who are pursuing their higher education in the fields of Science, Technology, Engineering and Mathematics (STEM).\r\n\r\nAnd some fun facts: In addition to centering many of its episodes in the worlds of science and technology, The Big Bang Theory enjoys a healthy appreciation and support from the scientific community at large, including having a bee species (Euglossa bazinga), a jellyfish species (Bazinga Rieki) and a monkey at the Columbus Zoo (Dr. Sheldon Cooper) named in the show’s honor.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1534962430.0, "source": "https://deadline.com", "summary": ""}