{"url": "https://www.today.com/style/holiday-hair-styles-tips-great-looks-holiday-season-t105813", "text": "This is the perfect time of year to take your style up a notch. TODAY Style scoped out 14 wow-worthy hairstyles that are sure to turn heads at every and any upcoming event.\n\nNow the only question is: Which one should you choose?\n\n1. Perky ponytail\n\nGwen Stefani opts for a holiday-ready perky ponytail. WireImage\n\nSure, ponytails are typically a casual style, but that doesn't mean you can't dress them up for the holidays. Add some volume on top and wrap an extra layer of hair around the base of your pony to give it added dimension and sass that’s sure to get oodles of compliments.\n\n2. Holiday bow\n\nThis isn't your classic half-up, half-down hairstyle, but this creation from Sarah Potempa, creator of The Beachwaver, is actually incredibly easy to do.\n\nStart by curling your hair and running your fingers through to make the curls feel more natural. Take about a 1-inch section of hair from the top and tie using an elastic. Pull the hair halfway through, so that you create a looped bun while leaving the ends out. The more hair in the looped bun, the bigger, more dramatic the bow.\n\nSplit the loop in half to create two smaller loops and secure to opposite sides with bobby pins. To finish, pick up the remaining ends from the ponytail and wrap them up and around the center of the bow. Secure with a bobby pin. Fluff both sides and you're done!\n\n3. The easiest updo\n\nThis style is perfectly imperfect! TODAY\n\nCreate a textured, modern updo in seconds with this quick tutorial from Potempa. If you normally wear your hair down, it's an easy way to give any outfit a brand new feel.\n\nStart with a high ponytail and then braid it. Pull the edges of the braid outward to give it some texture. This technique is called \"pancaking\" and can create the illusion of thicker, fuller hair. To finish the look, grab a bun maker, twist the hair all the way up and pin in any stray pieces.\n\n4. Sleek and smooth\n\nPriyanka Chopra flaunts her sleek, smooth locks. WireImage\n\nWhen you're hitting up multiple parties or just you don't have time to worry about creating several stunning styles, a sleek, straight ‘do that lasts a few days will save you time. Blow dry the hair straight and then go over small sections with a flat iron. It's important to keep the flat iron parallel to the floor when straightening for an ultrasleek look, as Potempa explained here. For protection and long-lasting wear, make sure to spritz locks with a heat protector before styling.\n\nStuff We Love Get a daily roundup of items that will make your life easier, healthier and more stylish. This site is protected by recaptcha\n\n5. The wet look\n\nSelena Gomez looks sultry with wet hair. WireImage\n\nWet hair, don't care! Whether you're strapped for time or simply want an easy-peasy style, there's something undeniably sexy about a wet hair look. Simply reach for your favorite gel or wax, apply generously and let those sultry locks speak for themselves.\n\n6. Awesome accessories\n\nHow festive is this look?! TODAY\n\n'Tis the season to add some sparkle to your whole look ... so why not add some baubles to your hair? Instead of relying on the same-old statement necklace or earrings, let your hair steal the spotlight. Follow the steps from Potempa below.\n\nStart by creating several braids on one side of your head. Next, grab a sparkly hair clip and your style will be instantly ready to party!\n\nIf you don't have a dazzling hair clip, you can create your own by hot gluing a hair barrette to your favorite brooch.\n\n7. Retro curls\n\nDreaming of a retro holiday? A Hollywood glam look is always in vogue, whether you're celebrating the holidays at home or somewhere fancy.\n\nTo get the look, Potempa recommends starting with a deep, side part and separating the hair into three sections (left, right and back). Then use a 1-inch curling iron to curl each section, rolling each curl under and holding for three to four seconds before securing with a single-prong clip. Potempa suggests putting your finger through the center of the curl and rolling until it hit the root for the best results. Repeat these steps until you've completed the roller set. Allow the curls to cool.\n\nSpray a brush with a flexible hairspray, remove the clips and brush through the curls in large sections. Potempa says its similar to how you would brush a ponytail. Finish off with another spritz of hairspray for extra hold and you're done!\n\nPro tip: To define certain curls and waves, leave clips in the front of the hair after brushing for 3-5 minutes.\n\n8. Punky pixie\n\nPink is a pixie chameleon. WireImage\n\nWhen it comes to awesome party looks, pixies are one of the most versatile options around. The borrowed-from-the-boys trend can be worn countless ways, but we’re partial to this shiny rolled version!\n\n9. Beautiful braids\n\nMandy Moore sports a stylish braided 'do. FilmMagic\n\nFor the holiday hostess who has more to focus on than dealing with her hair, this classy braid is ideal. Practical and pretty, the style will help you look your best and keep your hair out of the way. Win, win!\n\nThere's not on bobby pin in this hairstyle -- we swear! TODAY\n\nA stretchy headband could be the secret to most sophisticated updo ever. The best news is, there are no bobby pins required! Potempa shares her tips for creating this look below.\n\nFirst, curl hair with your favorite wand or curling iron. If you're short on time, you can even just curl the front. Next, pick a stretchy headband that has some sparkle or lace to make a real statement. Place the headband over your forehead and tuck hair into the headband around the back and sides. Leave the front strands untucked for an undone, modern look.\n\n11. Sassy updo\n\nCarrie Underwood sports a sexy, sassy updo perfect for holiday parties. Getty Images\n\nDear Santa, we really want our hair to look this amazing! A funky updo with texture to spare is at the top of our wish list this holiday season, and we're making it happen with lots of sea salt spray.\n\n12. Holiday twist\n\nThis hairstyle might look complicated, but it's actually quite easy. Instead of braiding, all you need to do is twist. Potempa shares step-by-step instructions, so you can do this right at home.\n\nCurl your hair and run your fingers through it to separate the curls and turn them into loose waves. Then grab two pieces of hair (one from the left and the other from the right) and secure together with an elastic. Underneath each section, grab a small piece of hair and pull it over and through the first strand on both sides. Connect those two pieces of hair above the previous ponytail. Repeat one more time on both sides and secure with an elastic. Complete the look with your favorite hair jewel for a festive touch.\n\n13. Classic blowout\n\nMeghan Markle is a frequent fan of the classic blowout style. Getty Images\n\nThe best part about a blowout? It’ll last you several days with the help of some dry shampoo. Did we mention it’s pretty much the little black dress of hairstyles?\n\n14. Top-notch topknot\n\nChrissy Teigen is a master at casual-meets-chic hairstyles. FilmMagic\n\nTopknots are basically a lazy gal's hair dream, but they don't have to look sloppy. Tease roots for maximum volume and run a shine serum through the rest of your hair to lend a polished vibe to your carefree holiday style.\n\nThis article was originally published on Dec. 21, 2017 on TODAY.", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.fit-760w.jpg", "https://media2.s-nbcnews.com/j/MSNBC/Components/Video/201712/x_tdy_style_glam_holiday_hair_171218.focal-760x428.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/MSNBC/Components/Video/201712/x_tdy_style_holiday_hair_bow_171218.focal-760x428.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media1.s-nbcnews.com/j/MSNBC/Components/Video/201712/x_tdy_style_holiday_twist_171218.focal-760x428.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.social_share_1200x630_center.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.social_share_1200x630_center.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.today.com/style/holiday-hairstyle-ideas-christmas-or-new-year-s-eve-t119971", "title": "14 holiday hairstyles for Christmas or New Year's Eve", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/style/holiday-hairstyle-ideas-christmas-or-new-year-s-eve-t119971", "title": "14 easy-to-do hairstyles for New Year's Eve or anytime", "description": "The easy hairstyle ideas you have to try for Christmas and New Year's Eve.", "image": {"identifier": "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.social_share_1200x630_center.jpg", "secure_url": "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.social_share_1200x630_center.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.social_share_1024x512_center.jpg", "title": "14 easy-to-do hairstyles for New Year's Eve or anytime", "description": "The easy hairstyle ideas you have to try for Christmas and New Year's Eve.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "Looking for cute Christmas hairstyles to try? What about New Year's Eve hairstyles? Check out our list of the best holiday hair including hair bows, ponytails, braided hairstyles and more.", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media2.s-nbcnews.com/j/newscms/2018_51/1397011/gwen-stefani-chrissy-teigen-today-181221-main-03_89c5e62e2f80c72a8f4ab47fa7954038.social_share_1024x768_scale.jpg", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1545422760.0, "source": "https://www.today.com", "summary": ""}