{"url": "https://www.etonline.com/inside-khloe-kardashians-pregnancy-everything-we-know-so-far-95518", "text": "What a whirlwind few months its been for Khloe Kardashian!\n\nSince we first learned that the Keeping Up With the Kardashians star was expecting her first child with her boyfriend, NBA star Tristan Thompson, the Good American denim designer has transformed from everyone's favorite cool aunt to a blissful mom-to-be.\n\nBut in contrast with sister Kylie Jenner's uber-low profile pregnancy, as the 33-year-old reality star gets into the final stretch, she's hardly stayed out of the public eye. From social media shares on maternity fitness and all the baby bump updates in between, keeping up with Khloe has been a fruitful endeavor.\n\nHere's everything we've learned about her journey to parenthood.\n\nWe've known she was pregnant since late September.\n\nJust days after it was revealed that Khloe's youngest sister, Kylie, was expecting a child with rapper Travis Scott, a source told ET that Khloe was also pregnant with her first baby.\n\n\"Everyone is thrilled,\" a source told ET. \"It's no secret that Khloe was eager to become a mother. This is something she has wanted for a long time and, finally, the timing is right.\"\n\nThe news, of course, came as no surprise to KUWTK fans, who saw a June episode where Khloe revealed that her Tristan -- who she'd been romantically linked to since 2016, was looking to start a family with her.\n\n\"He wants to have kids now,\" Khloe explained. \"He said, 'I want to have kids with you, [and] if you get pregnant, you could make maternity jeans for [your clothing line] Good American.\"\n\n\"He's so f**king cute and supportive and sweet. I've just never had that,\" she continued. \"He's such a nice, nice, nice person.\"\n\nIn October, a source told ET that the couple was expecting a baby boy.\n\nHow she told her family.\n\nE!\n\nIt was revealed in the two-part midseason premiere of KUWTK in January that Khloe and Tristan shared the baby news with her family at a barbecue, before Facetiming sisters Kendall Jenner and Kylie, who couldn't be present on the occasion.\n\n\"Well, you missed the barbecue, and I really wanted to tell you something,\" she told Kylie. \"Are you pregnant?\"\n\n\"Are you kidding? Because I'm going to cry!\" she added. \"That makes me happy! I'm so happy for you!\"\n\n\"I'm SO happy we captured all this!! Such a blessing to have all of these memories forever!\" Khloe said of the episode. And interestingly, the on-camera reveal meant her family was technically the second to know -- after the KUWTK cast and crew!\n\n\"I've known the crew since 2007, we've had pretty much essentially the same crew,\" she explained on Jimmy Kimmel Live! in early January. \"They've been involved in pretty much the best and worst of our lives, and they keep quiet.\"\n\nShe broke the news to the public in late December.\n\nWhile it had been widely reported for months, Khloe officially confirmed her baby news on Dec. 20 with an emotionally-captioned baby bump reveal on Instagram, where the reality star raved about her co-parent-to-be, Tristan.\n\n\"My greatest dream realized! We are having a baby! I had been waiting and wondering but God had a plan all along. He knew what He was doing. I simply had to trust in Him and be patient. I still at times can't believe that our love created life!\" Khloe wrote. \"Tristan, thank you for loving me the way that you do! Thank you for treating me like a Queen! Thank you for making me feel beautiful at all stages! Tristan, most of all, Thank you for making me a MOMMY!!! You have made this experience even more magical than I could have envisioned! I will never forget how wonderful you've been to me during this time! Thank you for making me so happy my love!\"\n\n\"Thank you to everyone for the love and positive vibes! I know we've been keeping this quiet but we wanted to enjoy this between our family and close friends as long as we could privately,\" she added. \"To enjoy our first precious moments just us ❤️ Thank you all for understanding. I am so thankful, excited, nervous, eager, overjoyed and scared all in one! But it's the best bundle of feelings I've ever felt in my life! ❤️❤️❤️.\"\n\nIn January, Khloe shared on her website how she managed to conceal her bump for so long. One style staple? A \"billowy coat.\"\n\n\"I almost never left home without one!\" she said of the outerwear. \"So comfy -- and zero eyes on the bump.\"\n\nTristan returned the love and then some.\n\nAfter Khloe made the baby announcement, Tristan expressed his devotion to his lady love in the comments\n\n\"Thank you for allowing me to be a part of your journey and entering your life that day at the Bel Air Hotel. One of the best moments in my life,\" the 26-year-old basketball pro began. \"I'm soo happy to be on this journey together with you and creating this angel from the man above. Every day I give thanks to him for bring[ing] us together.\"\n\n\"I love you soo much and I know our little angel feels the love we share together and will know that mommy and daddy loves them unconditional forever and ever amen,\" he added.\n\nDays later, Khloe showed off her baby bump again during the family's Christmas Eve party, revealing her entire metallic party look on Christmas Day.\n\nShe's due sometime in late March/early April.\n\nJust a couple weeks after Khloe officially revealed her pregnancy, she shared an update on Jan. 2 that she was officially six months along.\n\n“For six months [pregnant], you a fine six months, baby. I’ll tell you that,\" Tristan flirted in a sweet Snapchat video from the couple's New Year's Eve night out in Ohio, where he plays for the Cleveland Cavaliers.\n\nKhloe is embracing the third trimester of her pregnancy, which she opened up about on her app.\n\n“I heard later in your third trimester you go through a stage called 'nesting,' where you just want to clean and organize everything. My sisters said I would love that, LOL,\" she wrote. \"So I am actually looking forward to it. I just want everything organized and planned and as perfect as possible before the baby comes.”\n\nTristan plans to be a hands-on parent.\n\nKhloe and her beau have taken planes, (probably not) trains and automobiles to be together as he plays professionally for the Cavs, and she spent much of the holidays in Ohio to accommodate his basketball schedule.However, in January, a source told ET that the NBA player is considering moving to Los Angeles to be closer to Khloe and her close-knit family.\n\nEither way, Tristan, who is also a father to a 1-year-old son, Prince, from a previous relationship, plans to be very involved in his second child's life.\n\n\"Tristan is going to be 100 percent hands-on,\" the source said. \"And there's a chance he may come play for the Clippers.\"\n\n\"Her family and support network is in L.A. It's her first baby, and she's going to want the support of her sisters and [mom] Kris,\" the source added.\n\nKhloe and Tristan have been super adorable -- and packed on the PDA.\n\nOne thing's for sure -- the distance has done nothing to hold back the couple's affection for each other!\n\nTheir New Year's Eve rendezvous, in particular, was full of pure adoration -- and plenty of making out -- which was covered in detail on Khloe's Snapchat.\n\nThe two attended a massive NYE party in Cleveland, where they wore 2018 glasses and danced all around. \"He's sooooo handsome,\" Khloe lovingly captioned one of the snaps.\n\nNot to mention, Khloe's end-of-year Instagram recap featured not one, not two, but three pictures of her locking lips with her guy.\n\nShe hasn't lost her focus on her health and fitness.\n\nKhloe has not been shy about sharing her workout regimen while pregnant. While some have criticized the reality star for it, she retorted on Twitter in January, \"For the ones who think they are physicians all of a sudden but MY doctor and I communicate and my workouts are cleared and highly recommended.\"\n\n\n\nShe reiterated a similar sentiment during a sit-down interview with ET at the beginning of the year.\n\n\"It's bizarre to me that people don't want me to be happy and stay healthy and fit,\" she admitted. \"My doctor wants me to work out every day if I could, so I'm doing doctor's orders and I feel good.\"\n\nSome of that fitness involves workouts with her big sister, Kourtney Kardashian, who took to the gym with her late last year, as documented on Khloe's snaps.\n\n\"For me, health and wellness resolutions are especially important this year. Being pregnant, it's a whole different type of self-care,\" Khloe shared on her website. \"I still exercise to maintain my sanity and also to feel good about myself, but my workouts are not as intense as they once were. I'm also eating differently because, of course, I have cravings, but I want to make sure I'm supplying my baby with the proper nutrients.\"\n\nShe's also dealing with all the normal pregnancy things -- from cravings to kicking!\n\nKhloe's shared on her website that she is letting herself indulge during her pregnancy while being mindful of giving her baby what it needs.\n\n\"During my pregnancy, I'm obviously not beating myself up about what I'm eating at all,\" she said. \"I'm more encouraged by how, after the baby comes, I'm going to work off every pound. I'm actually really excited to get my body back. I can't wait!\"\n\nWith that said, she does miss some thing's about her pre-pregnancy physique.\n\n\"I now have cellulite on my legs! Cute! Cute! 'Pregnancy may make cellulite look worse for a while, because the weight that you gain in pregnancy could make it more noticeable,'\" she tweeted recently. \"I feel like I've always had cellulite but it's way more prominent at the moment.\"\n\nI now have cellulite on my legs! Cute! Cute! \"Pregnancy may make cellulite look worse for a while, because the weight that you gain in pregnancy could make it more noticeable.\" — Khloé (@khloekardashian) January 26, 2018\n\nI feel like I've always had cellulite but it's way more prominent at the moment 🤦🏼‍♀️ — Khloé (@khloekardashian) January 26, 2018\n\n\"So far no stretch marks,\" she did note. \"So I'm happy about that the perks of being chubby previously. Lol my tummy knows how to stretch.\"\n\nSo far no stretch marks. So I'm happy about that 🤞🏽 the perks of being chubby previously. Lol my tummy knows how to stretch — Khloé (@khloekardashian) January 26, 2018\n\nAnd in late January, the reality star also shared that her little guy is kicking more and more!\n\n\"I have felt them before but now it's way more frequent and stronger,\" she replied to a fan on Twitter.\n\n👶🏽 💋kick kick kick 👶🏽💋 exciting 🙏🏽🙏🏽🙏🏽🙏🏽 — Khloé (@khloekardashian) January 27, 2018\n\nNo I have felt them before but now it's way more frequent and stronger — Khloé (@khloekardashian) January 27, 2018\n\nSo far, she hasn't decided on (or announced) the boy's name!\n\nUgh me too!! lol I can barely decide what I want to eat. Let alone name a baby 🤦🏼‍♀️ https://t.co/UROXb7su4j — Khloé (@khloekardashian) January 19, 2018\n\nWhile she seems pretty prepared in every other way, Khloe did share recently that one area she's still pretty unprepared for is naming her baby.\n\n\"Lol I can barely decide what I want to eat. Let alone name a baby,\" Khloe tweeted, but she does have some inspiration, if her feelings towards sister Kim Kardashian and brother-in-law Kanye West's third child, Chicago, is any indication.\n\n\"I LOOOOOOOOOOVE her name hey Chi (shy),\" she tweeted in response to Kim's name reveal.\n\nAnd about the paparazzi....\n\nReally wish paparazzi would understand how hard flying is on my body right now. It's the only time I feel incredibly exhausted, swollen and nauseous. Screaming rude things and taking my picture when I already feel like crap I can really do without. At least be quite if you must — Khloé (@khloekardashian) January 29, 2018\n\nI love you guys! I know it comes with the territory and I hate when people complain about stuff like that. But while I'm pregnant I would love some boundaries with the paparazzi. I know it won't happen but here's to putting it in the universe. — Khloé (@khloekardashian) January 29, 2018\n\nLook, Khloe's a Kardashian. She's fully bought into everything that means. However, on Jan. 28, she did take to social media to level with some of those who have been photographing her, asking them to take some consideration of her current physical and mental state while she's expecting.\n\n\"Really wish paparazzi would understand how hard flying is on my body right now. It's the only time I feel incredibly exhausted, swollen and nauseous. Screaming rude things and taking my picture when I already feel like crap I can really do without. At least be [quiet] if you must,\" she tweeted.\n\n\"I love you guys! I know it comes with the territory and I hate when people complain about stuff like that,\" she clarified. \"But while I'm pregnant I would love some boundaries with the paparazzi. I know it won't happen but here's to putting it in the universe.\"\n\nWell, hopefully, Khloe can get the space she needs to prepare for a happy, healthy baby boy.\n\nWatch the video below for more on Khloe's pregnancy.\n\nKhloe Kardashian Focused on Healthy Pregnancy as Kylie Jenner Takes a Break to 'Recharge' (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nKhloe Kardashian Praises Sister Kim's Social Media Clap Backs: 'Confidence Looks Good on You'\n\nKhloe Kardashian Dishes on How She and Boyfriend Tristan Thompson Spend a Night In\n\nKhloe Kardashian’s Hair Is Getting Curlier Throughout Her Pregnancy – Here’s Why!\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-03/khloe_kardashian_gettyimages-513509684_1280.jpg?h=c673cd1c&itok=YcpBNBaL", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-12/khloe_tristan.jpg?h=66a28218&itok=OGYpxnnK", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/kylie_jenner_kuwtk_0.jpg?itok=GjArhyUN", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/khloe_tristan.jpg?h=66a28218&itok=7GKArKjt"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/khloe_tristan.jpg?h=66a28218&itok=7GKArKjt", "keywords": [], "authors": ["Alex Ungerman"], "canonical_link": "https://www.etonline.com/inside-khloe-kardashians-pregnancy-everything-we-know-so-far-95518", "title": "Inside Khloe Kardashian's Pregnancy: Everything We Know So Far", "meta_data": {"article": {"opinion": "false"}, "title": "Inside Khloe Kardashian's Pregnancy: Everything We Know So Far | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/inside-khloe-kardashians-pregnancy-everything-we-know-so-far-95518", "title": "Inside Khloe Kardashian's Pregnancy: Everything We Know So Far", "description": "From the baby bump reveal to Tristan Thompson's affection and all the pregnancy updates, it's been a busy pregnancy for the mom-to-be.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/khloe_tristan.jpg?h=66a28218&itok=7GKArKjt", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "From the baby bump reveal to Tristan Thompson's affection and all the pregnancy updates, it's been a busy pregnancy for the mom-to-be.", "title": "Inside Khloe Kardashian's Pregnancy: Everything We Know So Far", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Alex Ungerman‍", "url": "https://www.etonline.com/inside-khloe-kardashians-pregnancy-everything-we-know-so-far-95518", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/khloe_tristan.jpg?h=66a28218&itok=7GKArKjt"}, "description": "From the baby bump reveal to Tristan Thompson's affection and all the pregnancy updates, it's been a busy pregnancy for the mom-to-be.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Khloe Kardashian, Tristan Thompson", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}