{"url": "www.inquisitr.com/4488994/is-mariah-carey-forbidding-bryan-tanaka-from-seeing-her-without-clothes-makeup-on-debunked/", "text": "Has Mariah Carey forbidden boyfriend Bryan Tanaka from seeing her without clothes or makeup on? That’s the sensational claim that’s been made in an article by Star Magazine. Apparently, Carey is so upset about her weight gain that she refuses to let Tanaka see her unless she’s fully clothed and made up.\n\nBut Gossip Cop, a site that’s well known for debunking celebrity rumors, is claiming that the story is nothing but fake news.\n\nAs Gossip Cop reports, Star Magazine has alleged that Mariah Carey gained 60 pounds during the summer and she has been hiding her body from her backup dancer-turned-boyfriend.\n\n“Bryan has told Mariah that he loves her no matter what she weighs, but Mimi still won’t let him see her without clothes on,” their reported insider said.\n\nThe article goes on to say that Mariah has had special mirrors and lighting installed in her home which make her look thinner than she really is. She has reportedly done this because she thinks that making changes to her home would be easier than changing her body.\n\nBut Gossip Cop contacted Mariah’s press rep who has denied that these rumors are true. Mariah’s rep says that the story is a fabrication and “ridiculous.”\n\nAfter the show it's the after party ???? @mastrosofficial A post shared by Mariah Carey (@mariahcarey) on Aug 1, 2017 at 1:19am PDT\n\n#fbf Wearing a @charbelzoecouture in #Barcelona thank you for the beautiful dress! A post shared by Mariah Carey (@mariahcarey) on Aug 18, 2017 at 10:36am PDT\n\nMariah Carey is more than likely too busy working on new developments in her career to worry about rumors about her relationship with Bryan Tanaka.\n\nAs Billboard reports, Carey recently shared a trailer for All I Want For Christmas Is You, an animated movie based on her hit Christmas song. The story will revolve around a young Mariah who wants nothing more than to get a particular puppy for Christmas. Her uncle tells her that the only way she can get the puppy is if she takes care of his dog over the holidays which leads to a very adventurous Christmas.\n\nHere’s the first look at my brand-new animated film, Mariah Carey’s \"All I Want For Christmas Is You\"! #ALLIWANTMOVIE @AllIWantMovie pic.twitter.com/eOk0tTz89V — Mariah Carey (@MariahCarey) September 6, 2017\n\nAccording to Billboard, the movie’s soundtrack will feature one new original song by Mariah alongside two renditions of holiday songs. All I Want For Christmas Is You will be released on November 14, 2017, on Blu-Ray, DVD, and online streaming.\n\nDo you think that Mariah Carey is in denial about her weight loss, so much so that she’s installed special mirrors in her home to make her look smaller? Is she so insecure about her body that she doesn’t even want Bryan Tanaka to see her without clothes on? Let us know what you think in the comments below.\n\nRELATED POSTS ON THE INQUISITR\n\nIs Mariah Carey Going Broke Amidst Constant Body Shaming Online?\n\nMariah Carey Allegedly Forcing Children Into Spotlight Against Will: Diva’s Parenting Skills Questioned\n\nMariah Carey: Star Has Skinny Mirrors All Over Her House? Not Letting Body-Shaming Affect Her\n\n[Featured Image by Nicholas Hunt/Getty Images for imPRint]", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Mariah-Carey-and-Bryan-Tanaka.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4488994/is-mariah-carey-forbidding-bryan-tanaka-from-seeing-her-without-clothes-makeup-on-debunked/", "title": "Is Mariah Carey Forbidding Bryan Tanaka From Seeing Her Without Clothes And Makeup On? [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}