{"url": "https://people.com/health/jeannie-mai-weight-gain-eating-issue/", "text": "After revealing on Instagram last week she has gained 17 lbs., talk show host Jeannie Mai says she’s never felt better.\n\nThe 39-year-old, who is a co-anchor on The Real, opened up to PEOPLE, revealing her past struggles with food and how far she has come in the past three months.\n\nGet push notifications with news, features and more.\n\n“It was a lot of over-control,” Mai says. “I was eating — if you were my friend and you hung out with me, you would see me just normally eating my food — but there was a level of control to it that I knew if I woke up the next day and weighed myself and I was over 103 [pounds], I would scale it back and make sure that I didn’t creep one ounce over that weight.”\n\nMai says she was consistently 103 lbs. for the past 12 years — her entire career on television.\n\n“When you’re in Hollywood, at the time, being thinner is just something … it’s almost like the unachievable thing,” she tells PEOPLE.\n\n“Everywhere you go somebody is on a diet. Everywhere you go in L.A. there is a no-carb option. I stayed at that weight because it’s what I thought I should be because I’m already small and I also lost a lot of weight since high school. I used to be a not-healthy 130-lb. girl, all in my stomach, all in my arms so I lost the weight and I stayed there then I became a control freak about the way I was eating and it just became the norm.”\n\nMai says people would also comment on her weight, asking her how she stayed so thin, which felt like a compliment.\n\n“I thought I have what a lot of women want but can’t get so I better stick with it,” she says. “You just think that’s the right thing to do. I fit everything. I fit the model sizes.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nTo maintain her 103-lb., 5-foot-4-inch figure, Mai says she would eat zero carbs or starches, count her bites so she’d limit herself, and eat nothing after 7 p.m. — not even water.\n\n“I wanted to make sure I was 103 when I weighed myself the next day,” she says.\n\nAfter realizing how harsh she was being on herself, Mai says she went home and threw out her scale and decided to make a change.\n\n“I didn’t realize it until I was just inspired by Instagram and seeing a lot of these workout videos and also ‘transformation Tuesday’ — one of my favorite hashtags— just seeing how many people reported they were changing their bodies through their workouts and I was like, ‘No way, is this really real?'” she says.\n\n“I also had kind of a spirit check when I was on the show and it was another one of those days where I was making fun of my flat butt because I’ve always had a flat butt, and I just realized as I was hearing myself when I saw the show, I was like, ‘Oh my god, for the type of woman you are’ — I am very against body shaming—I couldn’t believe I was body shaming myself and not realizing it.”\n\nMai, who now weighs 121 lbs., met with a doctor and learned about how to gain healthy muscle and weight.\n\nRELATED VIDEO: Jenny Mollen Reveals a Thyroid Problem Post-Pregnancy Has Caused Her to Rapidly Lose Weight\n\nBut she says putting on the pounds wasn’t easy at first.\n\n“When I got on the scale at my doctor’s office, I felt my necklace and my earrings to make sure I didn’t have some heavy-ass piece of jewelry on because I was like, ‘No way I’m 120,” she says. “I got scared and I found my old self creeping back in, so I cut back at dinner. Then I had to remind myself, ‘No, the whole point is to stop over-controlling yourself,’ then I was able to get back on track and eat normally the next day.”\n\nNow Mai says: “I feel more like a woman than I ever have before.”\n\nImage zoom Jeannie Mai\n\nShe is also eating many foods she did not dare let herself even take a bite of for over a decade.\n\n“I had the whole burger. I ate the sandwiches. I had peanut butter and jelly sandwiches, which I haven’t had since I was a kid and that was my favorite basic food,” she says. “I went to Stagecoach and Coachella and stopped at Chick-fil-A. My friends were visiting from Italy and brought pasta. I haven’t had a full plate of pasta in 12 years.”\n\nAlthough she is eating foods that she used to restrict, her main diet focuses on “lots of protein, lots of healthy complex carbs, and lots of healthy fats.”\n\nFor her workouts, she goes to the gym 5 times a week to lift heavy weights and goes hiking with her friends for cardio.\n\n“My goal is to develop curves on my body,” she says. “I never had curves. Now I want to round out my knees, I want my thighs to be just solid and I want a nice good tush, I want to crack walnuts with my butt.”\n\nMai, who separated from her husband of 10 years, Freddy Harteis, in October and has been open about her decision to not have children, adds, “I know one of the blessings of being a mother is getting hips and I’m not going to have that because I chose not to have kids so I believe God is going to give me some hips if I work for it. I’m, literally, every day dedicating a day to a different body part.”\n\nMai says her advice for other people struggling with a similar situation is to look internally.\n\n“You know yourself if you are at an unhealthy weight, only you would know this. So if you’re that person, what would your body be shaped like if it was the strongest version of you?” she says. “If you can apply that to a health plan to get it into that shapely, strong indestructible form of you, I think it would look different than the controlled skinny version you’re trying to be.”\n\nHarteis recently announced he is expecting his first child with his girlfriend Linsey Toole.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjeannie-mai-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjeannie-mai-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjeannie-mai-2.jpg", "keywords": [], "authors": ["Jessica Fecteau"], "canonical_link": "https://people.com/health/jeannie-mai-weight-gain-eating-issue/", "title": "Jeannie Mai on Gaining 17 Lbs. in 3 Months: 'I Feel More Like a Woman Than I Ever Have Before'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bodies,Bodies News,Celebrity Bodies,Celebrity Health,Health,Health News,News,Weight Loss", "news_keywords": "Bodies,Bodies News,Celebrity Bodies,Celebrity Health,Health,Health News,News,Weight Loss", "description": "The daytime talk show host opens up to PEOPLE about her past struggles with food and how she is steadily gaining weight", "og": {"title": "Jeannie Mai on Gaining 17 Lbs. in 3 Months: 'I Feel More Like a Woman Than I Ever Have Before'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/health/jeannie-mai-weight-gain-eating-issue/", "description": "After revealing on Instagram last week she has gained 17 lbs., talk show host Jeannie Mai says she’s never felt better. The 39-year-old, who is&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjeannie-mai-2.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/health/jeannie-mai-weight-gain-eating-issue/", "description": "The daytime talk show host opens up to PEOPLE about her past struggles with food and how she is steadily gaining weight", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjeannie-mai-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/health/jeannie-mai-weight-gain-eating-issue/", "title": "Jeannie Mai on Gaining 17 Lbs. in 3 Months: 'I Feel More Like a Woman Than I Ever Have Before'", "description": "The daytime talk show host opens up to PEOPLE about her past struggles with food and how she is steadily gaining weight", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjeannie-mai-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}