{"url": "www.yourtango.com/2018312950/are-the-property-brothers-feuding-new-details-about-jonathan-and-drew-scott-blowout-fights", "text": "Double trouble?\n\nAre the Property Brothers feuding? Property Brothers has been a beloved show on HGTV for years. Twin brothers Drew and Johnathan Scott help couples with their fixer-uppers and transform frumpy houses into gorgeous homes. Each episode shows the brothers using their skills at home renovation (Jonathan) and real estate (Drew) to make their sometimes risky and tough renovations to the houses. Viewers love the dynamic between the two and it's is easy to see why the show is a hit.\n\nBut it's not all sunshine and rainbows with the handy twins. There have been recent reports that the relationship between the brothers has been on the rocks and that Jonathan and Drew Scott. Here's what we know so far:\n\n1. They've been fighting over Johnathan's recent breakup.\n\nA post shared by Jonathan Scott (@mrsilverscott) on Nov 29, 2017 at 10:48am PST\n\nDrew is only a few months from getting married to fiance Linda Phan. Johnathan, on the other hand, just went through a bad breakup with longtime girlfriend Jacinta Kuznetsov. Johnathan's heartbreak has served as a divide between the brothers, according to a source.\n\n\"Jonathan is going through a rough time right now and feels left in the shadow of Drew.” As a result, “it’s causing a rift between the two” and “things have gotten so bad, they’ve stopped talking at times.”\n\nThe source also hinted that Drew has taken the side of Kuznetsov in the breakup and is more sympathetic to her. Johnathan has gotten very heated over this issue and threatened to not attend his brother's wedding if his ex is still on the guest list. Ouch.\n\n2. They're extremely competitive with each other.\n\nA post shared by Property Brothers (@propertybrothers) on Apr 10, 2018 at 7:05am PDT\n\nIt's natural to have sibling rivalry but with these overachievers, the competition's at a whole new level. At work, they try to outdo each other and it seems now they're in competition in the love department. “Jonathan’s afraid now he’ll never meet the woman of his dreams,” the source said. “He keeps envisioning his brother being happily married with a family while he’s single and alone.”\n\n3. Despite rift reports the brothers have a cruise to the Bahamas with fans coming up.\n\nA post shared by Property Brothers (@propertybrothers) on Mar 14, 2018 at 8:13am PDT\n\nIf you're a Property Brothers fan, good news! You can take a vacation with the duo to the beautiful islands of the Bahamas this December. The cruise is called “Sailing With The Scotts,” aboard Royal Caribbean International’s 'Mariner of the Seas,' a $90-million dollar newly-renovated ship.\n\nShip updates are reported to include a virtual-reality bungee trampoline, surf simulator, three-story-high waterslides for adrenaline junkies, an Italian restaurant by Jamie Oliver, made-to-order sushi, tiki bar for foodies and drink enthusiasts; glow-in-the-dark laser tag, a sports bar and arcade, and an Escape Room for gamers.\n\n“We cannot wait to set sail with our fans. Jonathan and I have so much exciting stuff planned,” Drew said.\n\n4. The brothers deny the claims.\n\nA post shared by Property Brothers (@propertybrothers) on Feb 14, 2018 at 8:03am PST\n\nBack in January, the pair was in the news again for reports that they were having a blowout fight. Both brothers said the claims were false. “Some people love to make up fake drama. Our family is as close as we’ve always been!” Drew said on Twitter. Jonathan also responded on Twitter, “#TabloidsNeedBetterSources.” The brothers have not commented on the recent reports of fighting but we'll see if they chime in anytime soon and update this post with any new developments.\n\nMolly Given is a writer living in Philadelphia and lover of all things to do with mystery and magic in life. When she’s not writing her fingers off she can be found planning her next adventure in a new part of the world.", "images": ["https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/prop%20bros%20copy%202.png?itok=VhQPAO_Q", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/prop%20bros%20copy%202.png?itok=Ef0xsiiH"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/prop%20bros%20copy%202.png?itok=Ef0xsiiH", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018312950/are-the-property-brothers-feuding-new-details-about-jonathan-and-drew-scott-blowout-fights", "title": "Are The Property Brothers Feuding? New Details About Jonathan And Drew Scott's Alleged Blowout Fights", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Engaged, Married, Remarried, Single, entertainment and news, Buzz", "article": {"author": "https://www.facebook.com/molly.given", "published_time": "2018-04-26T20:30:30", "modified_time": "2018-04-26T20:30:30"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018312950/are-the-property-brothers-feuding-new-details-about-jonathan-and-drew-scott-blowout-fights", "title": "Are The Property Brothers Feuding? New Details About Jonathan And Drew Scott's Alleged Blowout Fights", "description": "Double trouble?", "updated_time": "2018-04-26T20:30:30", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/prop%20bros%20copy%202.png?itok=Ef0xsiiH", "width": 620, "height": 309}}, "description": "Are The Property Brothers Feuding? HGTV's Property Brother's stars Johnathan and Drew Scott are reported to be in a huge blowout fight caused by a recent breakup, an upcoming marriage and a competitive relationship.", "abstract": "Property Brothers has been a beloved show on HGTV for years. Twin brothers Drew and Johnathan Scott helps couples with their fixer uppers and", "robots": "follow, index, noodp, noydir", "news_keywords": "are property brothers feuding, are property brothers fighting, property brothers feud, property brothers fight, property brothers fighting, johnathan scott, drew scott, jonathan drew scott, jonathan drew scott fight, jonathan drew scott feud", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018312950/are-the-property-brothers-feuding-new-details-about-jonathan-and-drew-scott-blowout-fights", "title": "Are The Property Brothers Feuding? New Details About Jonathan And Drew Scott's Alleged Blowout Fights", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/prop%20bros%20copy%202.png?itok=Ef0xsiiH", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/aaQDxds35xk"], "publish_date": 1524745830.0, "source": "http://www.yourtango.com", "summary": ""}