{"url": "https://people.com/tv/damon-wayans-claims-clayne-crawford-caused-his-onset-injury/", "text": "Damon Wayans claims his former Lethal Weapon costar Clayne Crawford was responsible for an onset injury he sustained.\n\nWayans, 57, made the allegations on Twitter Monday night after the Fox series was renewed for a third season and Crawford’s replacement announced.\n\nGet push notifications with news, features and more.\n\nAs fans got upset about the news, Wayans defended the casting changes and he shared a video of himself in which he says he was hit by shrapnel during a small explosion on the set.\n\n“Now that the fate of the show is solidified.. I’d like to address the TWITTER outrage with this video and image to follow. #directedby @ClayneCrawford,” Wayans tweeted.\n\nRepresentatives for Fox, Warner Bros. TV and Crawford did not immediately respond to PEOPLE’s request for comment.\n\nIn the video, something explodes behind Wayans and the actor is seen ducking with his face twisted in pain as he clutches his head. In the hashtag, Wayans included the episode in which he sustained the injury was directed by Crawford.\n\nIn a second tweet, Wayans shows a close-up look at his injury, a cut on the back of his head with blood dripping down his neck.\n\n“How does the shrapnel from this hit me on the opposite side of the head? #directedby@claynecrawford,” he tweeted.\n\nThe star then shared what appeared to be an explanation he was given for the incident.\n\n“Below is a rendering seeking to explain yesterday’s incident. It turns out there was a second shooter, to Damon’s left, on the other side of the pillar behind which his character was crouched, which accounts for what he heard from his left side. @claynecrawford #noapology,” Wayans tweeted.\n\nIn more tweets, Wayans alleged Crawford “hit another actor in the mouth with a bottle of green tea and busted his mouth open.”\n\n“He hit another actor in the mouth with a bottle of green tea and busted his mouth open. @lancehenriksen a white man!!! #notanaccident #knowyourfacts!” he tweeted.\n\nA representative for Henriksen did not immediately respond to PEOPLE’s request for comment.\n\nImage zoom Damon Wayans Twitter\n\nWayans then shared a photo of a sticker he said could be seen around the studio lot where the show was filmed which read, “Clayne Crawford Is An Emotional Terrorist.”\n\nRELATED: Clayne Crawford to Be Replaced on Lethal Weapon If Series Is Renewed\n\n“Since @warnerbrostv is not defending me at all.. here’s another photo of images other people were posting in and around the lot. Not me! He became UNINSURABLE!” Wayans continued in a different tweet. “Relished in making female cry. And stuck fear in cast and crew. #dontblameme.”\n\nCrawford, 40, apologized for his behavior in two past incidents – including the one that has now been revealed to have invloved Wayans – that occurred on set at the end of April.\n\nThe actor, who starred as Martin Riggs, addressed the incidents on Instagram, revealing he had been “reprimanded” for them.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\n“It is true that I have been reprimanded twice during this past season of Lethal Weapon. The first reprimand was because I reacted with anger over working conditions that did not feel safe or conducive to good work under the leadership of a guest director and assistant director who, in turn, were angry at my response. I met with Human Resources, I apologized for my part of the conflict, and I completed studio-appointed therapy. I even shared a sizable portion of my paycheck with one of the parties involved per the instruction of the studio,” Crawford began.\n\nImage zoom Damon Wayans and Clayne Crawford FOX via Getty\n\nHe wrote about the second incident that took place on the set of the drama series: “The second reprimand came during an episode I was directing. An actor on set felt unsafe because a piece of shrapnel from an effect hit him. It was an unfortunate event that happened in spite of all safety precautions and procedures being followed. I take responsibility for the incident because I was in charge of the set.”\n\nImage zoom Damon Wayans, Clayne Crawford Jeffrey Mayer/WireImage; Jason LaVeris/FilmMagic\n\nThe actor continued by sharing that he has absolute “love, respect and care for my crew and cast, and would never intentionally jeopardize so many jobs. Moreover, I love the process of making film and television. I appreciate and respect the work of everyone involved. It takes a village. I am incredibly sorry if my passion for doing good work has ever made anyone feel less than comfortable on our set, or feel less than celebrated for their efforts.”\n\n“Furthermore, I apologize to all the crew and cast for any negative attention Lethal Weapon is receiving because of these incidents,” continued Crawford, who said that he takes “great pride in treating everyone in life with dignity and kindness.”\n\nLast week, Entertainment Weekly confirmed a report from The Hollywood Reporter that stated Fox and its studio partner Warner Bros. TV were searching for a new actor to play Riggs if the series was renewed for a third season.\n\nCrawford seemingly responded on Twitter Tuesday by first sharing a photo of himself on a boat with his arms up and the caption, “Hmmmmmm?” and then tweeting, “Wait, wait, wait……you can’t fire me on my day off!”\n\nSeann William Scott was hired to replace Crawford as Riggs’ brother, according to Variety.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fcrawford-wayans-2-2000b1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fcrawford-wayans-2-2000-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fclayne-crawford-lethal-weapon.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdamon-wayans-1-2000-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fcrawford-wayans-2-2000b1.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/tv/damon-wayans-claims-clayne-crawford-caused-his-onset-injury/", "title": "Damon Wayans Claims Clayne Crawford Injured Him on Lethal Weapon Set", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrities,Damon Wayans,News,TV,TV Watch", "news_keywords": "Celebrities,Damon Wayans,News,TV,TV Watch", "description": "Lethal Weapons actor Damon Wayans claims his former costar Clayne Crawford was responsible for an onset injury he sustained", "og": {"title": "Damon Wayans Claims Clayne Crawford Injured Him on Set & 'Hit' Another 'Actor in the Mouth'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/damon-wayans-claims-clayne-crawford-caused-his-onset-injury/", "description": "Damon Wayans claims his former Lethal Weapon&nbsp;costar Clayne Crawford was responsible for an onset injury he sustained. Wayans, 57, made the allegations on Twitter Monday&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fcrawford-wayans-2-2000b1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/damon-wayans-claims-clayne-crawford-caused-his-onset-injury/", "description": "Lethal Weapons actor Damon Wayans claims his former costar Clayne Crawford was responsible for an onset injury he sustained", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fcrawford-wayans-2-2000b1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/damon-wayans-claims-clayne-crawford-caused-his-onset-injury/", "title": "Damon Wayans Claims Clayne Crawford Injured Him on Set & 'Hit' Another 'Actor in the Mouth'", "description": "Lethal Weapons actor Damon Wayans claims his former costar Clayne Crawford was responsible for an onset injury he sustained", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fcrawford-wayans-2-2000b1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}