{"url": "www.newsday.com/entertainment/celebrities/katie-holmes-tom-cruise-divorce-deal-lets-her-control-suri-s-upbringing-source-says-1.3829086", "text": "LOS ANGELES - For Tom Cruise, a quick resolution to his divorce from Katie Holmes looked like “Mission: Impossible” just last week. But the Hollywood action hero appears to have extinguished the tabloid firestorm with an agreement that one source said grants Holmes primary custody of their daughter, Suri, and control of her religious upbringing.\n\nThe confidential deal was hammered out over the weekend in New York and announced Monday, 11 days after Holmes took the industry and her husband by surprise with the filing of divorce papers in Manhattan. A key issue in the split was the Church of Scientology, of which Cruise is the most prominent member.\n\nWith a prenuptial agreement governing the distribution of assets, talks between lawyers for Cruise and Holmes, who was raised Roman Catholic, centered on the role of Scientology in the upbringing of 6-year-old Suri, according to the source who was familiar with the negotiations but not authorized to discuss them publicly. The agreement provides Cruise with visitation rights but gives Holmes the lead role in choosing how Suri will be educated, the source said Monday.\n\n“She is the primary caretaker right now and Tom is the one who primarily goes away on movies. So little will change,” the source said.\n\nHolmes initiated divorce proceedings on June 28, reportedly identifying the parties as Anonymous versus Anonymous. Cruise had not yet responded in court when the parties began settlement discussions. The deal avoids a long court battle that could have become a public relations nightmare not only for the 50-year-old “Top Gun” veteran, who has several big-budget movies upcoming, but also for Scientology.\n\nTabloid coverage of the split has portrayed Cruise and Scientology negatively, with headlines such as “Katie Holmes ‘Felt Like She Was in Rosemary’s Baby’ ” and “Katie Free at Last.” While Cruise has remained silent beyond a brief statement saying he was “deeply saddened,” Scientology has dispatched spokesmen to defend its practices.\n\nCruise and Holmes appeared to refer to the religious component of their split in a joint statement: “We want to keep matters affecting our family private and express our respect for each other’s commitment to each of our respective beliefs and support each other’s roles as parents,” they said.\n\nHolmes had hired three law firms with experience handling high-profile breakups and she relied on her father, Martin, a Toledo, Ohio, attorney who lists family law among his specialties. Jonathan Wolfe, a New Jersey lawyer for Holmes, said Monday: “The case has been settled and the agreement has been signed. We are thrilled for Katie and her family and are excited to watch as she embarks on the next chapter of her life.”\n\nSign up for Newsday's Entertainment newsletter Get the latest on celebs, TV and more. By clicking Sign up, you agree to our privacy policy.\n\nCruise was represented by longtime legal counsel Bert Fields, and Dennis Wasser, who handled the “Mission: Impossible” star’s divorce from Nicole Kidman. “Tom is really pleased we got there, and so am I,” Fields said in a statement.\n\nHolmes and Cruise married in 2006. It was his third marriage and her first. Cruise’s net worth far outstrips that of Holmes, who is 16 years his junior and best known for her role on the TV show “Dawson’s Creek.” (Forbes magazine estimated last week that Cruise earned $75 million in the 12 months ending in May.)\n\nThe couple signed a prenuptial agreement spelling out what Cruise would pay Holmes in the event of a divorce, according to the source familiar with divorce negotiations. “Katie does not get any significant money or property,” the source said.\n\nWhen Cruise and Kidman ended their marriage in 2001, they shared legal custody of their two children, Connor and Isabella. Cruise, however, became the primary caretaker, raising the children in Los Angeles while Kidman moved to Nashville, Tenn., and remarried.\n\nExperts said that no matter what the terms of the separation agreement, Cruise will still have a legal right to teach Suri Scientology when she is in his care. Authorities in so-called “spiritual custody” disputes said that while family law judges try to ensure that the interests of children of divorce are protected in matters like medical care and housing, they give both parents broad leeway in choosing a religious upbringing.\n\n“The general rule is the courts will defer unless the consequences are really detrimental to the health of the child — a threat of immediate and substantial harm,” said Jeffrey Shulman, a professor of law at Georgetown University who has written extensively about the issue and believes that standard doesn’t protect children sufficiently.\n\nIn the case of Cruise and Scientology, a judge could intervene if the religion was used to turn Suri away from Holmes because she was not an adherent, Shulman said. “The courts could say to Cruise, ‘You cannot conduct yourself in a way that alienates the child from Katie Holmes.’ But mere doctrine may not be enough for the court to do that.”\n\nCourts won’t rule on the merits of a particular religion, New York lawyer Malcolm Taub said. “They would not say that Scientology is not a valid religion so we’re going to award (sole spiritual custody) to Katie Holmes,” Taub said.\n\nSpeaking generally and not in particular regard to Scientology, Alton Abramowitz, a family law attorney in Manhattan, said, “There are ways of dealing with radical beliefs that still allows the parents to practice what they believe and expose the child to those beliefs.”\n\nBut there are limits. Not that long ago, Abramowitz was involved in a case where a father’s religion called for animal sacrifice. The mother objected, the lawyer said, with the court ruling “that no animal sacrifices will be performed in the child’s presence.”\n\n———\n\n(Times staff writer Harriet Ryan contributed to this story.)\n\n———", "images": ["https://www.newsday.com/img/newsday/newsdayLogo.svg", "https://cdn.newsday.com/polopoly_fs/1.22642050.1556723435!/httpImage/image.png_gen/derivatives/preview_115/image.png", "https://cdn.newsday.com/polopoly_fs/1.22642050.1556723435!/httpImage/image.png_gen/derivatives/landscape_768/image.png", "https://cdn.newsday.com/polopoly_fs/1.3826933.1482011486!/httpImage/image.jpg_gen/derivatives/landscape_456/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43909013.1587069599!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43908722.1587069202!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43908034.1587085834!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43885963.1587080063!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.3826933.1342561095!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.22642050.1556723435!/httpImage/image.png_gen/derivatives/landscape_384/image.png", "https://cdn.newsday.com/polopoly_fs/1.43925255.1587144510!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43740316.1586625604!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43740316.1586625604!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43903156.1587058761!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43905888.1587138439!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg"], "top_img": "https://cdn.newsday.com/polopoly_fs/1.3826933.1342561095!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "keywords": [], "authors": ["The Associated Press"], "canonical_link": "https://www.newsday.com/entertainment/celebrities/katie-holmes-tom-cruise-divorce-deal-lets-her-control-suri-s-upbringing-source-says-1.3829086", "title": "Katie Holmes-Tom Cruise divorce deal lets her control Suri's upbringing, source says", "meta_data": {"viewport": "width=100%,initial-scale=1.0,maximum-scale=2.0", "description": "For Tom Cruise, a quick resolution to his divorce from Katie Holmes looked like “Mission: Impossible” just last week. But the Hollywood action hero appears to have extinguished the tabloid firestorm", "msvalidate.01": "AC41EB10D1EC6B5358F0ECA0E861CCAA", "theme-color": "#0077c8", "google-site-verification": "WS-IPs_DqbPtrQ9XhKPi_32a-1spE4tjsjhWUqwVVns", "application-name": "Newsday", "msapplication-TileColor": "#1B3664", "msapplication-TileImage": "/img/newsday/nd-win8-icon.png", "p": {"domain_verify": "b22f651177478af415d53d6eb00b8167"}, "fb": {"pages": 19175874448, "app_id": 147686468041}, "paywall_status": "metered", "news_keywords": "newsday,entertainment,celebrities,source", "og": {"title": "Source: Holmes gets control of Suri's religious upbringing", "url": "https://www.newsday.com/entertainment/celebrities/katie-holmes-tom-cruise-divorce-deal-lets-her-control-suri-s-upbringing-source-says-1.3829086", "image": "https://cdn.newsday.com/polopoly_fs/1.3826933.1342561095!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "site_name": "Newsday", "description": "For Tom Cruise, a quick resolution to his divorce from Katie Holmes looked like “Mission: Impossible” just last week. But the Hollywood action hero appears to have extinguished the tabloid firestorm", "type": "article"}, "twitter": {"card": "summary_large_image", "site": "@Newsday", "title": "Source: Holmes gets control of Suri's religious upbringing", "description": "For Tom Cruise, a quick resolution to his divorce from Katie Holmes looked like “Mission: Impossible” just last week. But the Hollywood action hero appears to have extinguished the tabloid firestorm", "image": "https://cdn.newsday.com/polopoly_fs/1.3826933.1342561095!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "app": {"id": {"iphone": 358571317, "ipad": 358571317, "googleplay": "com.pagesuite.newsday"}}}, "sailthru.date": "Tue, 10 Jul 2012 11:13:00 -0400", "sailthru.title": "Source: Holmes gets control of Suri's religious upbringing", "sailthru.tags": "newsday,entertainment,celebrities,source", "sailthru.author": "THE ASSOCIATED PRESS", "isDesktop": "true"}, "movies": [], "publish_date": 1341936780.0, "source": "http://www.newsday.com", "summary": ""}