{"url": "https://web.archive.org/web/20120619023435/http://www.foxnews.com/on-air/fox-news-sunday/2012/06/17/david-plouffe-sen-joe-lieberman-and-gen-michael-hayden-talk-national-security-leaks?page=3", "text": "So, this is very, very important, that this is a two-year period so that people can apply. And it allows our law enforcement officials to focus on criminals who really posed a threat and ought to be the focus here. But the only permanent way to fix our immigration system, certainly to provide a permanently relief for DREAM Act eligible populations is for Congress to act.\n\nWALLACE: You mentioned Governor Romney. I don't to get into the whole thing about the differences will get to the economy in a minute. But specifically for Hispanic voters, do you think there's a clear choice between Obama and Romney?\n\nPLOUFFE: I think there's a clear choice for everybody.\n\nWALLACE: Well, I'm asking about Hispanics.\n\nPLOUFFE: Well, first of all --\n\nWALLACE: On this issue of immigration.\n\nPLOUFFE: Well, first of all, Hispanic voters highly support the health care bill, what we're trying to do in education. On immigration, yes, this is a president who's tried to get immigration done in a comprehensive way. We're getting close to getting the DREAM Act done.\n\nSo, this is someone who believed that we are a nation of laws, but also a nation of immigrants. And that people who want to staff our labs and start businesses and serve their country ought to be able to do that. Governor Romney has said he would veto the DREAM Act. Governor Romney essentially said the 11 million here ought to just go home. They ought to self deport.\n\nSo, this is someone you're not going to be able to trust. And this one of the important choices that the president talked about earlier this week in Ohio. President Romney if he's elected is not going to fix our immigration system. He's been very clear about that. You watch Republican debate after Republican debate, many of them on your network, where Governor Romney was very clear, he would veto the DREAM Act. He thinks these 11 million people ought to just be sent home.\n\nSo, I think that's a clear choice just not for the Latino community, but for the American electorate at large.\n\nWALLACE: All right. Let's turn to the economy. The president gave a major economic speech this week in Ohio in which he called for targeted investments for things like energy and education and state workers, first responders and teachers, and tax hikes for the wealthy. But there was -- forgive me -- nothing new.\n\nIs that the president's agenda for the next four years -- pass the jobs plan that I have been pushing for over the last 12 months and that will fix the economy?\n\nPLOUFFE: What the president laid out is a clear choice facing the American people. And the contrast could not be clear. This is a president who believes we need to grow the economy by putting the middle class first, creating middle class jobs, by reducing the deficit in a fair or balanced way, and making sure we can invest in things like innovation and infrastructure and science and research.\n\nThe congressional Republican approach, Governor Romney's approach -- by the way, it's fitting, he's with John Boehner today -- because Governor Romney is going to rubber stamp the Republican agenda, which basically gives huge tax cuts for the wealthy. They believe the economy works best from the top down. That's failed.\n\nBy the way, Governor Romney wouldn't reduce the deficit. Every independent economists who's looked at this plan says he would add to the deficit, he would starve investment in education, he would allow infrastructure to deteriorate even more. This is not a recipe for growing the economy, reducing the deficit or helping the middle class. So, that's the stark choice --\n\nWALLACE: Does the president's agenda -- because I did not hear anything new in Ohio -- is the president's agenda for the next four years more of the same?\n\nPLOUFFE: Well, what it is, is what this country needs to do, which is reduce the deficit in a right way, fair and balanced way.\n\nWALLACE: I like the fact that you keep saying fair and balanced.\n\nPLOUFFE: Well, it's the right way, which is we need to cut more spending. This president has already signed into law, by the way, over -- almost $2 trillion on spending cuts. We have to focus on what is going to grow this economy for the middle class. And that's going to be continuing to focus on our manufacturing --\n\nWALLACE: But you would agree, there is no new agenda beyond what he is pushing for the last year?\n\nPLOUFFE: This is the direction he thinks that the country needs to go.\n\nNow, let's look at the other direction, it failed miserably. When Governor Romney led Massachusetts, number one debt in the country -- think about that. Added debt. For all of this talk about government, for every private sector job created in Massachusetts by Governor Romney, six public sector jobs.\n\nThis is someone who -- his state was 47 in job creation. And he wants to return to the same policies that led to the great recession that, you know, caused a huge harm to our businesses, our economy and people in this country.\n\nSo, the choice is clear here.\n\nWALLACE: OK.\n\nPLOUFFE: The choice is clear.\n\nWALLACE: I have a couple of minutes left and I want to get to these campaign questions. You were the Obama campaign manager in 2008. I ask about whether there's anything new, because you are taking hits right now -- you, the campaign -- from some notable Democrats like James Carville and Bill Clinton, who are saying that you need to stop talking about the progress we've made and start talking about a new agenda, how things in the next four years are going to be different than they were in the last one.\n\nAre they wrong?\n\nPLOUFFE: First of all, President Clinton, he's appeared with President Obama. He said very clearly that we are beginning to grow again. We're beginning to make progress. We can't return to the same policy.\n\nPresident Clinton is someone knows something about reducing the deficit, about creating jobs, and he's been very clear -- he thinks Mitt Romney would be a disaster for this country.\n\nSo, listen, those other Democrats aren't paying attention to what the president said, which is everyday, not just on what he said, but what he does -- he understands our economy is not strong as it needs to be, that this didn't happen overnight, it's going to take us a long time to recover, there's a lot of people out there hurting.\n\nSo, we are making progress. We need to make a lot of more. That's very clear.\n\nWALLACE: But you said, just a few months ago, that trajectory in the economy is going well. We had fewer and fewer jobs, each of the last four months. GDP growth is 1.9 percent, 69,000 jobs, the lowest in the year created. The trajectory is not going like this anymore, sir. It's going like this.\n\nPLOUFFE: Well, compared to where we were in recession we had over 4 million jobs created over the last 26 months. We had that private sector jobs --\n\nWALLACE: But you've got three and a half years to fix it. PLOUFFE: Well, listen, this is a deep hole caused by the same policies Mitt Romney wants to go back to. This is what folks need to focus on. We just went through recession.\n\nRemarkably, what Mitt Romney and the congressional Republicans want to do is, hey, I guess that worked out well. Let's go back to the same rules. Let Wall Street writes its own rules, make it easier to polluters to foul our air more, huge tax cuts to people like Mitt Romney and basically paid for by raising taxes on working Americans, and making it harder for people to get education, not believing in the new energy future, not rebuilding this country.\n\nSo, listen, this is a tough recession we are recovering from. We are making slow and steady progress. Nobody is satisfied. The president most of all knows we have to recover more quickly, create jobs more quickly. But the choice is, are we going to continue and move forward -- are we going to go back to the same policies that caused the recession?\n\nWALLACE: I got it. One last question --\n\nPLOUFFE: It's important. Nothing is more important than this, Chris.\n\nWALLACE: One more question real quickly, any chance you'll leave the White House, go back to Chicago and run this campaign.", "images": ["https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/foxnews.com.on-air.fox-news-sunday/themes/shows_foxnews/img/close.png", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/all/modules/modules-fox/fox_shows_general/images/icon-facebook.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/all/modules/modules-fox/fox_shows_general/images/icon-blog.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/all/modules/modules-fox/fox_shows_general/images/icon-podcast.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/foxnews.com.on-air.fox-news-sunday/files/130_mssnc.jpg", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/foxnews.com.on-air.fox-news-sunday/files/plouffe%2C%20david_0.jpg", "https://web.archive.org/web/20120619023435im_/http://global.fncstatic.com/static/dc/img/show-pages/logo-fn-2.png", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/all/modules/modules-fox/fox_shows_general/images/icon-twitter.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/foxnews.com.on-air.fox-news-sunday/files/Lieberman%20hayden_0.jpg", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/all/modules/modules-fox/fox_shows_general/images/icon-email.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/all/modules/modules-fox/fox_shows_general/images/icon-hulu.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/static/all/img/fn_128x128.png", "https://web.archive.org/web/20120619023435im_/http://metrics.foxnews.com/b/ss/foxnews/1/H22.1--NS/1340073230?pageName=noscript:fnc:subsection:text&g=http://www.foxnews.com/on-air/fox-news-sunday/2012/06/17/david-plouffe-sen-joe-lieberman-and-gen-michael-hayden-talk-national-security-leaks", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/foxnews.com.on-air.fox-news-sunday/themes/shows_foxnews/img/base/blank.gif", "https://web.archive.org/web/20120619023435im_/http://global.fncstatic.com/static/dc/img/show-pages/logo-fn.gif", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/static/managed/img/icon-twitter.jpg", "https://web.archive.org/web/20120619023435im_/http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-801796h&cg=0&cc=1&si=http://www.foxnews.com/on-air/fox-news-sunday/2012/06/17/david-plouffe-sen-joe-lieberman-and-gen-michael-hayden-talk-national-security-leaks&ts=noscript&rnd=1340073230", "https://web.archive.org/web/20120619023435im_/http://b.scorecardresearch.com/p?c1=2&c2=9013181&c3=&c4=http://www.foxnews.com/on-air/fox-news-sunday/2012/06/17/david-plouffe-sen-joe-lieberman-and-gen-michael-hayden-talk-national-security-leaks&c5=&c6=&c15=&cv=2.2&cj=1", "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/on-air/fox-news-sunday/sites/foxnews.com.on-air.fox-news-sunday/files/skewers_4_0.JPG"], "top_img": "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/static/all/img/fn_128x128.png", "keywords": [], "authors": ["Published June", "Fox News Sunday", "Chris Wallace"], "canonical_link": "https://web.archive.org/web/20120619023435/http://www.foxnews.com/on-air/fox-news-sunday/2012/06/17/david-plouffe-sen-joe-lieberman-and-gen-michael-hayden-talk-national-security-leaks", "title": "David Plouffe, Sen. Joe Lieberman and Gen. Michael Hayden talk national security leaks", "meta_data": {"dc.title": "David Plouffe, Sen. Joe Lieberman and Gen. Michael Hayden talk national security leaks", "description": "The Fox News Sunday blog, Wallace Watch, allows viewers to interact with the show, go behind the scenes with the FNS guests, and get to know Chris Wallce, the host Fox News Sunday.", "dc.description": "The Fox News Sunday blog, Wallace Watch, allows viewers to interact with the show, go behind the scenes with the FNS guests, and get to know Chris Wallce, the host Fox News Sunday.", "dcterms.abstract": "The Fox News Sunday blog, Wallace Watch, allows viewers to interact with the show, go behind the scenes with the FNS guests, and get to know Chris Wallce, the host Fox News Sunday.", "dc.language": "en-US", "dc.publisher": "Fox News", "dc.date": "2012-06-17", "dcterms.created": "2012-06-17T12:28:36-04:00", "dcterms.modified": "2012-06-18T13:18:12-04:00", "dc.format": "text/html", "dc.type": "Text", "prism.genre": "transcript", "dc.identifier": "urn:uri:base64:dHJhbnNjcmlwdDE5ODg=", "keywords": "Fox News Sunday, FNS, Chris Wallace, Capitol Hill, Washington DC, Politics, Panel Plus, Wallace Unplugged, Power Player, Wallace Watch, Morning Booking Call, Bill Kristol, Mara Liasson, Kevin Madden, Juan Williams, Fox News Channel, FNC, Fox News, shows, FoxNews.com", "dc.subject": "Fox News Sunday, FNS, Chris Wallace, Capitol Hill, Washington DC, Politics, Panel Plus, Wallace Unplugged, Power Player, Wallace Watch, Morning Booking Call, Bill Kristol, Mara Liasson, Kevin Madden, Juan Williams, Fox News Channel, FNC, Fox News, shows, FoxNews.com", "prism.aggregationType": "subsection", "prism.channel": "fnc", "prism.section": "shows", "prism.subsection1": "foxnewssunday", "prism.subsection2": "transcript", "prism.subsection3": "interviews", "og": {"type": "article", "title": "David Plouffe, Sen. Joe Lieberman and Gen. Michael Hayden talk national security leaks", "description": "The Fox News Sunday blog, Wallace Watch, allows viewers to interact with the show, go behind the scenes with the FNS guests, and get to know Chris Wallce, the host Fox News Sunday.", "image": "https://web.archive.org/web/20120619023435im_/http://www.foxnews.com/static/all/img/fn_128x128.png", "url": "https://web.archive.org/web/20120619023435/http://www.foxnews.com/on-air/fox-news-sunday/2012/06/17/david-plouffe-sen-joe-lieberman-and-gen-michael-hayden-talk-national-security-leaks?page=3", "site_name": "Fox News"}, "fb": {"admins": 100000924384522}}, "movies": [], "publish_date": 1339862400.0, "source": "https://web.archive.org", "summary": ""}