{"url": "https://www.indiewire.com/2018/04/star-wars-victoria-mahoney-african-american-woman-filmmaker-1201954269/", "text": "Director J.J. Abrams has tapped the filmmaker and producer to serve as second unit director on his upcoming film, marking a major milestone for the series.\n\nThe “Star Wars” universe is making some changes.\n\nWhile the ever-expanding movie franchise has been taken to task plenty of times for its repeated hiring of exactly one type of filmmaker — white males, including recent turns from Ron Howard and Rian Johnson — “The Force Awakens” director J.J. Abrams is bringing someone brand new into the fold: filmmaker Victoria Mahoney. The filmmaker and producer (and, fun fact, bit actor in “Legally Blonde”) will serve as the second unit director on Abrams’ upcoming untitled “Episode IX,” marking the first time an African-American woman has served in any directing capacity on a “Star Wars” film.\n\nThe news was first announced by fellow Disney filmmaker, Ava DuVernay, who shared a picture of Mahoney and Abrams hanging out at a recent open house at her own production and distribution company, ARRAY.\n\nHappy to share this historic news. A black woman directing stories in a galaxy far, far away. First unit director #JJAbrams. Second unit director @VictoriaMahoney. #StarWarsE9 #StarWars pic.twitter.com/s689jv9I4u — Ava DuVernay (@ava) April 17, 2018\n\nAbrams is currently in pre-production on the film, and Mahoney will step into a role that requires a close attention to detail, mostly dedicated to shooting essential pieces like establishing shots, stunts, inserts, and cutaways. Mahoney is herself already an established filmmaker who has spent the past few years working inside the television space, including stints on DuVernay’s “Queen Sugar,” plus “Gypsy,” “Grey’s Anatomy,” and more. She just completed directing a pilot for CBS entitled “Red Line,” which was executive produced by DuVernay and fellow heavy-hitter Greg Berlanti. Also on deck: Mahoney is penning a TV adaptation of the novel “Dawn” for DuVernay and Charles King’s MACRO.\n\nPopular on IndieWire\n\nBut she’s no stranger to filmmaking, and Mahoney’s debut feature — “Yelling at the Sky,” which was loosely based on her own life — premiered at the Berlin Film Festival in 2011.\n\nWhile Lucasfilm president Kathleen Kenned has repeatedly said that “Star Wars” is eager to tap more diverse talent, the hiring of Mahoney is the first major sign of progress in years. Last year, Kennedy drew ire after a Variety interview during which she told the trade that although finding a female director for one of their features was a priority, the studio “want[s] to make sure that when we bring a female director in to do ‘Star Wars,’ they’re set up for success…They’re gigantic films, and you can’t come into them with essentially no experience.”\n\nShe also added that, because of the perceived lack of female filmmakers with blockbuster experience believed to be essential to making a “Star Wars” film, they were actively looking for appropriate talent. Kennedy said at the time, “We want to really start to focus in on people we would love to work with and see what kinds of things they’re doing to progress up that ladder now, and then pull them in when the time is right.”\n\n“Star Wars: Episode IX” is currently slated to open on December 20, 2019.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://www.indiewire.com/wp-content/uploads/2018/04/shutterstock_6927150u.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F04%2Fstar-wars-victoria-mahoney-african-american-woman-filmmaker-1201954269%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201954269&comment_count=3", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/uploads/2018/04/shutterstock_6927150u.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2016/05/kate-erbland.png?resize=96%2C96&ssl=1"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/04/shutterstock_6927150u.jpg", "keywords": [], "authors": ["Kate Erbland"], "canonical_link": "https://www.indiewire.com/2018/04/star-wars-victoria-mahoney-african-american-woman-filmmaker-1201954269/", "title": "‘Star Wars’: Filmmaker Victoria Mahoney Will Be First African-American Woman to Direct for Franchise", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Director J.J. Abrams has tapped the filmmaker and producer to serve as second unit director on his upcoming film.", "news_keywords": "Female Filmmakers, JJ Abrams, Star Wars, Victoria Mahoney", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Kate Erbland", "content_type": "Article", "post_id": 1201954269, "title": "'Star Wars': Filmmaker Victoria Mahoney Will Be First African-American Woman to Direct for Franchise", "published_at": "2018-04-18 10:58:13", "image": "https://www.indiewire.com/wp-content/uploads/2018/04/shutterstock_6927150u.jpg?w=300", "comment_count": 3, "tags": "Victoria Mahoney", "topics": "Film", "body": "The \"Star Wars\" universe is making some changes.\r\n\r\nWhile the ever-expanding movie franchise has been taken to task plenty of times for its repeated hiring of exactly one type of filmmaker -- white males, including recent turns from Ron Howard and Rian Johnson -- \"The Force Awakens\" director J.J. Abrams is bringing someone brand new into the fold: filmmaker Victoria Mahoney. The filmmaker and producer (and, fun fact, bit actor in \"Legally Blonde\") will serve as the second unit director on Abrams' upcoming untitled \"Episode IX,\" marking the first time an African-American woman has served in any directing capacity on a \"Star Wars\" film.\r\n\r\n\r\n\r\nThe news was first announced by fellow Disney filmmaker, Ava DuVernay, who shared a picture of Mahoney and Abrams hanging out at a recent open house at her own production and distribution company, ARRAY.\r\n\r\nhttps://twitter.com/ava/status/986378268742828032?tfw_creator=krolljvar&tfw_site=variety&ref_src=twsrc%5Etfw&ref_url=http%3A%2F%2Fvariety.com%2F2018%2Ffilm%2Fnews%2Fj-j-abrams-victoria-mahoney-second-unit-director-for-star-wars-ix-1202756681%2F\r\n\r\nAbrams is currently in pre-production on the film, and Mahoney will step into a role that requires a close attention to detail, mostly dedicated to shooting essential pieces like establishing shots, stunts, inserts, and cutaways. Mahoney is herself already an established filmmaker who has spent the past few years working inside the television space, including stints on DuVernay's \"Queen Sugar,\" plus \"Gypsy,\" \"Grey's Anatomy,\" and more. She just completed directing a pilot for CBS entitled \"Red Line,\" which was executive produced by DuVernay and fellow heavy-hitter Greg Berlanti. Also on deck: Mahoney is penning a TV adaptation of the novel “Dawn” for DuVernay and Charles King’s MACRO.\r\n\r\n\r\n\r\nBut she's no stranger to filmmaking, and Mahoney's debut feature -- \"Yelling at the Sky,\" which was loosely based on her own life -- premiered at the Berlin Film Festival in 2011.\r\n\r\nWhile Lucasfilm president Kathleen Kenned has repeatedly said that \"Star Wars\" is eager to tap more diverse talent, the hiring of Mahoney is the first major sign of progress in years. Last year, Kennedy drew ire after a Variety interview during which she told the trade that although finding a female director for one of their features was a priority, the studio “want[s] to make sure that when we bring a female director in to do ‘Star Wars,’ they’re set up for success…They’re gigantic films, and you can’t come into them with essentially no experience.”\r\n\r\nShe also added that, because of the perceived lack of female filmmakers with blockbuster experience believed to be essential to making a “Star Wars” film, they were actively looking for appropriate talent. Kennedy said at the time, “We want to really start to focus in on people we would love to work with and see what kinds of things they’re doing to progress up that ladder now, and then pull them in when the time is right.”\r\n\r\n\"Star Wars: Episode IX\" is currently slated to open on December 20, 2019.\r\n\r\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/04/star-wars-victoria-mahoney-african-american-woman-filmmaker-1201954269/", "title": "‘Star Wars’: Filmmaker Victoria Mahoney Will Be First African-American Woman to Direct for Franchise", "description": "Director J.J. Abrams has tapped the filmmaker and producer to serve as second unit director on his upcoming film, marking a major milestone for the series.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/04/shutterstock_6927150u.jpg", "width": 780, "height": 527}}, "article": {"published_time": "2018-04-18T14:58:13+00:00", "modified_time": "2018-04-18T14:58:13+00:00", "author": "https://www.indiewire.com/author/kateindiewire/", "section": "Film", "tag": "Victoria Mahoney"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1524063493.0, "source": "https://www.indiewire.com", "summary": ""}