{"url": "https://gingesbecray.com/invite-only-cabo-s1e1-tick-tick-boom-recap/", "text": "Hi guys an welcome to Invite Only Cabo! It's a new Bravo show and SallyAnn Salsano (of Jersey Shore and Party Down South) is involved so I thought I would check it out because the Twitterverse is digging the \"grown folks.\" I have a history of falling in love with shows that Bravo only produces for one season, rest in peace Work Out New York and especially Apres Ski, but I have higgghhh hopes for IoC! Rolling S1:E1 Tick Tick Boom after the break\n\nHere is the premise: Larry Sims has a bunch of disparate friend groups and he's decided to invite them ALL on vacation with him. This sounds like when I got married! I wish you all the best, Larry, you and your crew.\n\nLarry Sims!\n\nBianca Banks\n\nKamani Alana, Jermane Britton, Emily Moses\n\nAgu Ukaogo\n\nMalaku Quisada\n\nAnd we're off! We open in Los Angeles, where Larry is working on the set of Being Mary Jane and Gabrielle Union is there! CAN YOU BELIEVE THAT WOMAN IS IN HER FORTIES??? Me neither! He's her celebrity hairstylist and she wants to know the last time he had a vacation? Like, never?\n\nGurl, you live in Los Angeles!! Every day is a vacation!\n\nHe tells her of his plan to bring all his friends and she warns him to be careful with his invite list (what fun would that be?), since people don't know each other they'll all be fighting to establish their preeminence with the person they do know: their BFF Larry. Or as Gabrielle Union puts it: his BFFFFFFFFF\n\nThis mansion is amazing!!! Dat infinity pool! Is there where Temptation Island was filmed? Asking for a friend who LOVED THAT SHOW.\n\nBianca is the first to arrive; oh. I thought she was his girlfriend from previews but she calls herself her bae, his cookie, his best friend but just friends. My bad. I also thought Larry was gay, but labels are so pre-Billions-season-2, aren't they?\n\nNext to arrive is Jermane, Larry's ride or die friend since he was 16, ALSO Larry's BFF. This is gonna be awesome! BFF Cagematch! Gayle and Oprah, ladies and gents\n\nKamani is the only friend Larry doesn't run at to hug; they danced together back a decade ago for Missy Elliot.\n\nShe's a recently divorced mom (hay gurl hay!), single and ready to be tingled. Bianca isn't digging this new addition, why is that? She should have been more threatened with Jermane-Ride-Or-Die's arrival for the BFF Cagematch, maybe she knows Kamani. Nope, she just jelly.\n\nNext guy we meet is Agu, Larry's wingman. He likes working out and looking good but most of all: being naked.\n\nThat's right, for the first time on Bravo, we have a pixellated bumhole\n\nHe's haaaawwwwwttttttttttttt, and not at the house yet, they have to wait for Emily\n\nMalaku is shouty at the hizzay, he and Larry were in a boyband!!\n\nAwww, they're so cute! He's besties with Jermane, too so at least he knows someone else there. Everyone is very excited to see him so he must rock.\n\nAnd now we meet Emily, the makeup artist half of their esthetics team\n\nThe party starts when she walks in, don't stop! Well it doesn't always start good, but it starts. She and Agu hit it off immediately; she's hoping he's gay because she has a serious boyfriend and doesn't need the temptation. For the record, Agu is haaaawwwwttttt\n\nMalaku is not excited to see Emily at all; last time he saw her she ripped a shirt off a man DURING a dinner party.\n\nEmily's our trailer trash in nice shoes, isn't she? You can say, just tell me! Oh, she's Australian, that's the accent I was just getting a piece of, do they have trailer parks in Oz?\n\nI love how Malku was totally mortified.\n\nHouse tour; now everybody has to choose rooms! But Larry's already done that, pairing Emily with Agu (that's it, now she's single too - Agu is haaawwwttttt), Kamani and Bianca (Kamani figures she's conceding enough sharing a HOUSE), Malaku with Jermane (no drama) and Larry by hisself?\n\nMalaku and Jermane discuss Emily in their room; he calls her a \"tick tick boom\" because you never know when she's going to go off. Emily's in her room unpacking with Agu, worried about losing \"the beginning of the most successful relationship\" of her life and girl, you can't tell that at the BEGINNING! They all look like that to start!\n\nHer boyfriend Joseph is adorable\n\nBut you know, not haaaawwwt and sleeping in the same room. Plus she hasn't had sex for a whole three days\n\nSupper time! Emily is making guacamole but she's using the same fork to stir and she's using to taste. Jermane and I are taking a hard pass on the germy guac plus she keeps switching her sweaty hair around and you know that shit needs to be tied up during food prep.\n\nEveryone talks about how they know Larry at supper, then it's on to pool party and we getta stare at all the hot bawdies. I gotta give Bravo props, they give equal time to tiny swimsuit bottoms and Agu's abs.\n\nBianca swims over and plunks her bum down on Larry's crotch\n\nWho responds by laughing, which is not what you want when you do that. He gently guides her off his lap.\n\nLarry asks everyone what they would change about their bodies if they could; Agu said he'd get a penis reduction because \"not everybody can f*cking take it.\" Emily is getting increasingly worried about sharing a room with Agu The Tripod.\n\nEveryone gets out of the pool, Agu stripping down and running through the house naked because he forgot a towel.\n\nEmily asks Bianca to switch rooms with her; this is how she's messed up every single relationship she's had in the past. Plus, its been three whole days since she had sex, nobody could be expected to withstand that kind of temptation.\n\nLarry puts on the brakes, he's worried about diva Kamani and wrecking ball Emily being in the same room, but in the end allows it because he didn't come here to argue with his friends!\n\nAgu and Bianca chat back in their room, there is zero vibe there. Chemistry is funny, when you got it, you GOT it, when you don't: can't force it.\n\nBianca thinks it's just a matter of time until her and Larry hook it up; but she's ready to wait for him to make the move. She's not the aggressor. Sitting on his lap.\n\nHow can this woman spend this much time with someone she calls her best friend and not realise she's a hag?\n\nKamani comes down for dinner with her nipples out; Agu is ready to take her to Disneyland and pick up her drycleaning, it's ON.\n\nClub time! There's a stripper pole because of course there is and Emily's on it the whole time because of course she is, let Kamani have a turn! She gets up there and Agu jumps up and immediately takes his shirt off. He's liplicking, he's eye-humping, he is werqing this woman. The literally humping her knees was too far, though, back it up, back it up Agu. Kamani is intrigued but knows a player when she sees one, so she definitely has her guard up.\n\nJermane, Kamani and Malaku are confused by Larry kissing Bianca a bunch of times\n\nBut then he goes and dances with a bunch more women and Bianca starts to steeeamm. She feels completely disrespected. Kamani is watching this all; she knows how Bianca is feeling, she's been that girl before.\n\nI think I love Kamani just for that one little interview; who HASN'T been that person trying to pretend that you don't care coz you can't care but you SO CARE?\n\nTime to go! Larry, Malku and Jermane go in one SUV, of course Agu rides with the ladies, including Emily who isn't wearing any panties and shows that to everyone along with her pole bruise because of course she does.\n\nEmily is grossssss, coughing all over the food, sitting on the couch with her cooter out and chewing on her nails between passing around pizza. That ain't right.\n\nThe next morning, Kamani calls her daughter while Agu talks about her with the guys. It seems he wasn't just spinning a line with that wanting to know about her family, etc, he's been out of relationships for a while and now he's interested in taking things a little deeper. He had the same problem Emily did in past relationships: couldn't keep it in his pants.\n\nBianca is all icy rage in the morning but to her credit she confronts Larry right away. He didn't realise that their relationship shifted for her when they kissed; he was just having fun in the moment. Sigh\n\nA lovely day in Cabo later, they're off to dinner in town. Where we find out that Emily is a dirty, dirty betch and not in a fun weekend away way. She's coughing on the food, double dipping again and now: chewing off her fake nails and putting them on the floor.\n\nCHEQUE PLEASE!!\n\nKamani calls her onnit; and yes, we're doing this, Emily. Nailgate ensues while Larry tells us he felt the same way about Emily when he met her, but he came around to see she's a really sweet person and he hopes his friends do too. They're too busy counting how many French tips are on the floor to see the \"real\" her right now.\n\nKamani's had enough; she's disgusted with Emily, who she thinks is pulling down Larry's cachet by being a dirtbag. She's owt and not far behind her is Emily, who won't be talked to like that! We're done\n\nSo. What didja think? I like Larry, Jermane and Malaku, course, but Agu is not hard to look at either. I have just a tetch of affection for Kamani, mostly because picking your nails off at the table IS nasty but also Emily. I think she's sweet. I also think she drinks too much and trades on this \"fun\" persona more heavily than she should, but haven't we all? I can even relate to Bianca, who seems just a little too old to be playing middle school rules games with Larry but we all get there when we get there, amirite?\n\nLarry is adorable, I love how the women are all: HE HAS STYLE AND CAN DO MY HAIR IN THE MORNING!! He must have had quite the life; boybands, dancing for Missy Elliot, now a celeb hairstylist? Woot!\n\nUntil next time!", "images": ["https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/6.40.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/3.32.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/icons_theme/default/default_instagram.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/2_35.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/19_23.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2016/01/cropped-TALKING-SHITE-2-32x32.png", "https://secure.gravatar.com/avatar/038e5442cf45a851bb6509d4179e4de7?s=64&d=wavatar&r=pg", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/12_37.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/9.47.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/12_49.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/icons_theme/default/default_twitter.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/icons_theme/default/default_subscribe.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/9.18.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/icons_theme/default/default_facebook.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/visit_icons/twitter.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/3.36.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/visit_icons/en_US_Follow.svg", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/4_20.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/7.53.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/close.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/visit_icons/fbshare_bck.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/15.20.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/21_38.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/share_icons/Pinterest_Save/en_US_save.svg", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/3.40.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/10_27.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/visit_icons/en_US_Tweet.svg", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/follow_subscribe.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/3.23.png", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2017/06/29_07.gif", "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/plugins/ultimate-social-media-icons/images/icons_theme/default/default_rss.png"], "top_img": "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2016/01/cropped-TALKING-SHITE-2-32x32.png", "keywords": [], "authors": ["View All Posts"], "canonical_link": "https://gingesbecray.com/invite-only-cabo-s1e1-tick-tick-boom-recap/", "title": "Invite Only Cabo S1:E1 Tick Tick Boom Recap – Ginges Be Cray", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "Site Kit by Google 1.6.0", "follow.it-verification-code-cTJDV1QvTEova0ZTYkFUbFpRUTN4SXphZDJ6QnJZR0YzbnMrdE0rNFlsWmsvSncwdXQ4ZVhwWDB2Q3R3ZzRMRE1IeVhpQXdkcGNNSnV1S3BBd3AxaWt4elN1VWJLV2xTR29LckE3T2RxUnF6UkdwMzN4cjZaQ0xETUtGalZ4emF8REhnWTNOaFg1VlJyalYrUkUxZzU1K1BLUlVBcHM1MXloSUM4UWZTblJmTT0=": "FHfFT0vFwZvnSSdH6xs8", "google-site-verification": "eMdC3X37kbLZ55vCTohIPjTvKBeZAQnWDAmbZzWcPHM", "msapplication-TileImage": "https://secureservercdn.net/184.168.47.225/523.a04.myftpupload.com/wp-content/uploads/2016/01/cropped-TALKING-SHITE-2-270x270.png"}, "movies": [], "publish_date": null, "source": "https://gingesbecray.com", "summary": ""}