{"url": "www.accessonline.com/articles/britney-spears-speaks-pop-star-talks-sisters-pregnancy-new-music-more-64865/", "text": "Britney Spears has opened up about the shock of her teenage sister’s pregnancy, her new album, and future acting plans, in a new interview with OK! magazine.\n\nPlus, the pop star’s father, Jamie Spears, offers an update on the conservatorship over Britney’s estate and what he really thinks of her ex, Kevin Federline.\n\nIn excerpts from the article, Britney, in her first sit down interview in almost two years, spoke about her reaction to Jamie Lynn Spears’ pregnancy at 16. Britney traveled to her hometown of Kentwood, Louisiana, for the birth of her niece by the now 17-year-old Jamie Lynn, and while she was thrilled with little baby Maddie, she was taken aback.\n\n“That was special, but it was also strange because she’s always been the baby, and now the baby was having a baby. It was mind-boggling. I was shocked a little bit,” Britney told OK! “But it was really cool, and she was happy. When she got to the hospital, we all thought it was going to be an all-day thing, and instead, the baby just sort of popped out. OK, we’re happy now!”\n\nClick HERE to view a gallery of Britney Spears photos.\n\nBritney said Jamie Lynn will be bringing baby Maddie to Los Angeles soon, allowing the newborn to finally meet her cousins – Sean Preston, and Jayden James.\n\n“She’s going to come out here for the kids’ birthdays. It will be the first time the cousins meet. I’m sure the boys will be like big brothers to Maddie,” Britney told the mag.\n\nBritney also provided an update on her new album, the follow up to last year’s “Blackout,” which will be out in “the next six to nine months,” the pop star said.\n\n“I’m writing every day, right here at the piano in this living room,” Brit told OK! “This is my best work ever.”\n\nBritney said she is working with talented people who are helping her take her songs up a level.\n\n“I think it is more urban. I’m working with producers who are just amazing. It’s Harvey Mason of The Underdogs,” she noted. “There is this fresh new energy. “\n\nAnd it’s not just music Britney is working on. She confirmed she is interested in doing more acting, following her successful appearance on “How I Met Your Mother,” which helped the show achieve its best ever ratings.\n\n“I’d love to, if I can find the right movie,” Brit said when asked about continuing her thespian streak. “Actually, I have a part that just came up. We’re just trying to work it out with my schedule, with the children.”\n\nThough it was unclear from the excerpts released at press time by OK! whether Britney addressed her hospitalizations of early 2008, her run ins with the paparazzi or the conservatorship protection she is under until the end of October, her father and co-conservator, Jamie Spears, provided some answers to OK!\n\nJamie said the conservatorship of his daughter will come to a close, though he hopes it will last just a bit longer, for Britney’s sake.\n\n“I would hope it stands until the end of the year, and then we’ll sit back and evaluate where we are at that time, where Britney is at that time,” he said.\n\nThe conservatorship reunited father and daughter, who in the past had moments where they were estranged from one another.\n\n“It’s wonderful,” he said of their relationship. “It is new for both of us. She sometimes calls me 50 times a day and asks me things that light my life up. But like all daughters, she is very manipulative and cunning. So she gets what she wants a lot.”\n\nJamie also said that despite the troubles that previously affected the pop star, there was a silver lining – their new relationship and his relationship with his grandsons.\n\n“God has a way of taking something bad and turning it into something good,” Jamie told OK! “If this hadn’t happened, I would never have been able to get back with my daughter and have this relationship I have with these two little boys.”\n\nIn related news, Jamie also explained why Britney and her ex-husband, Kevin Federline, settled their custody dispute over their two children, without going to trial.\n\n“Britney and Kevin wanted to settle… The trial that was coming up was for permanent custody. It made no sense for that trial to proceed so we worked out an agreement. The agreement says that on Oct. 1 we’ll probably get another overnight, and that will stay in place until the end of the year or the end of the conservatorship,” he said.\n\nAs for how Jamie feels about Kevin, he offered a mixed answer.\n\n“Kevin has a wonderful heart. I don’t agree with giving him more money,” Jamie said.", "images": ["https://static.accessonline.com/uploads/73521.jpg", "http://www.accessonline.com/articles/britney-spears-speaks-pop-star-talks-sisters-pregnancy-new-music-more-64865/assets/images/logo-gray-1.png"], "top_img": "https://static.accessonline.com/uploads/73521.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.accessonline.com/articles/britney-spears-speaks-pop-star-talks-sisters-pregnancy-new-music-more-64865", "title": "Britney Spears Speaks: Pop Star Talks Sister’s Pregnancy, New Music & More", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=2", "tp": {"EnableExternalController": "true"}, "fb": {"pages": 162290915432}, "google-site-verification": "TkPbHnf5fGyE6vrIQcUc5hATUn1xbAXICAeDmJ7TtsM", "msvalidate.01": "925622343B9488A94BAEAC1029ED5D78", "description": "Britney Spears has opened up about the shock of her teenage sister’s pregnancy, her new album, and future acting plans, in a new interview with OK! magazine. Plus, the pop star’s father, Jamie Spears, offers an update on the conservatorship over Britney’s estate and what he really thinks of her ex, Kevin Federline. In excerpts [&hellip;]", "og": {"site_name": "Access", "title": "Britney Spears Speaks: Pop Star Talks Sister’s Pregnancy, New Music & More | Access Online", "image": "https://static.accessonline.com/uploads/73521.jpg", "description": "Britney Spears has opened up about the shock of her teenage sister’s pregnancy, her new album, and future acting plans, in a new interview with OK! magazine. Plus, the pop star’s father, Jamie Spears, offers an update on the conservatorship over Britney’s estate and what he really thinks of her ex, Kevin Federline. In excerpts [&hellip;]", "type": "article", "url": "https://www.accessonline.com/articles/britney-spears-speaks-pop-star-talks-sisters-pregnancy-new-music-more-64865"}, "twitter": {"card": "summary_large_image", "site": "@accessonline", "title": "Britney Spears Speaks: Pop Star Talks Sister’s Pregnancy, New Music & More | Access Online", "description": "Britney Spears has opened up about the shock of her teenage sister’s pregnancy, her new album, and future acting plans, in a new interview with OK! magazine. Plus, the pop star’s father, Jamie Spears, offers an update on the conservatorship over Britney’s estate and what he really thinks of her ex, Kevin Federline. In excerpts [&hellip;]", "image": {"src": "https://static.accessonline.com/uploads/73521.jpg"}}}, "movies": [], "publish_date": null, "source": "http://www.accessonline.com", "summary": ""}