{"url": "https://www.teenvogue.com/story/amber-tamblyn-open-letter-james-woods", "text": "Dear Mr. Woods,\n\nWhat you are experiencing is called a teachable moment. It is called a gift. It is called a humbling. It is called Jesus, I come to thee. It is called an awakening. It is called a growth edge. It is called hope.\n\nThe hope being that through this experience, you can change. You can redefine the man who will come after this moment and this man who came before.\n\nSince you've now called me a liar, I will now call you a silencer. I see your gaslight and now will raise you a scorched earth.\n\nMy friend Billy and I were at the Roxy on Sunset Boulevard seeing a band we loved. We decided to go to Mel's diner on Sunset Boulevard in Hollywood to get burgers after. I had just gotten my driver's license and very specifically remember my nervousness trying to park in the diner parking lot. Upon leaving the restaurant we were stopped by you and your friend, who both seemed very nice. At one point you suggested we should all go to Las Vegas together. \"It's such a great place, have you ever been?\" You tried to make it sound innocent. This is something predatory men like to do, I've noticed. Make it sound innocent. Just a dollop of insinuation. Just a hair of persuasion. Just a pinch of suggestion. \"It will be so much fun, I promise you. Nothing has to happen, we will just have a good time together.\" I told you my age, kindly and with no judgment or aggression. I told you my age because I thought you would be immediately horrified and take back your offer. You laughed and said, \"Even better. We'll have so much fun, I promise.\"\n\nHere's the thing, Mr. Woods. At that time I was not a public persona. I had done a couple years on a soap opera as an actress, but you wouldn't know me from Adam. I'm sure you've racked your brain trying to remember how you could've possibly hit on the actress Amber Tamblyn at a diner almost two decades ago. You think, it's not possible, there's no way I would've been so stupid as to hit on a 16-year-old known actress. But I wasn't known then, James. I was just a girl. And I'm going to wager that there have been many girls who were just girls or women who were just women who you've done this to because you can get away with it.\n\nThe saddest part of this story doesn't even concern me but concerns the universal woman's story. The nation's harmful narrative of disbelieving women first, above all else. Asking them to first corroborate or first give proof or first make sure we're not misremembering or first consider the consequences of speaking out or first let men give their side or first just let your sanity come last.\n\nSo it is with hope, Mr. Woods, that I ask you to go inward now and ask yourself the hard stuff. The ominous unconscious stuff. The archetypal masculinity stuff. The power-play stuff. The perversion persuasion stuff. The secretive stuff. The id's most cherished stuff.\n\nOnly you and your darkness know who you are. Only you and your actions know what you've done. That means you and only you have the power to change your behavior.\n\nAre you and your history with women and girls a part of the problem, Mr. Woods?\n\nGo now and look in the mirror and ask yourself if this is true. Go on, I'll wait. But I won't hold my breath.\n\nRelated: Amber Tamblyn Shares Sexual Assault Story After Donald Trump Comments", "images": ["https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://assets.teenvogue.com/photos/59b941b961993376b0288953/16:9/w_2560%2Cc_limit/GettyImages-693284854.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/59b941d8a9c19825187553cb/16:9/w_1280,c_limit/amberfbfbf.jpg"], "top_img": "https://assets.teenvogue.com/photos/59b941d8a9c19825187553cb/16:9/w_1280,c_limit/amberfbfbf.jpg", "keywords": [], "authors": ["Teen Vogue Staff", "Teen Vogue Staf"], "canonical_link": "https://www.teenvogue.com/story/amber-tamblyn-open-letter-james-woods", "title": "Amber Tamblyn Pens Open Letter to James Woods", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Teen Vogue Staff", "copyright": "Copyright (c) Condé Nast 2020", "description": "Amber Tamblyn alleges James Woods tried to pick her up and invite her to Vegas at age 16, an accusation that Woods called a lie. Read her open letter to him here.", "id": "59b864714c8e01447eed50a3", "keywords": "sexual health + identity,amber tamblyn,james corden", "news_keywords": "sexual health + identity,amber tamblyn,james corden", "robots": "index, follow", "content-type": "article", "parsely-post-id": "59b864714c8e01447eed50a3", "parsely-metadata": "{\"description\":\"Amber Tamblyn alleges James Woods tried to pick her up and invite her to Vegas at age 16, an accusation that Woods called a lie. Read her open letter to him here.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/59b926f07bfc8d379a0f2deb/16:9/w_1000,c_limit/GettyImages-693284854.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/59b926f07bfc8d379a0f2deb/1:1/w_1000,c_limit/GettyImages-693284854.jpg\"}", "og": {"description": "\"Dear Mr. Woods...\"", "image": "https://assets.teenvogue.com/photos/59b941d8a9c19825187553cb/16:9/w_1280,c_limit/amberfbfbf.jpg", "site_name": "Teen Vogue", "title": "Amber Tamblyn Asks James Woods if He's \"Part of the Problem\" in an Open Letter", "type": "article", "url": "https://www.teenvogue.com/story/amber-tamblyn-open-letter-james-woods"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "\"Dear Mr. Woods...\"", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/59b941d8a9c19825187553cb/16:9/w_1280,c_limit/amberfbfbf.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "Amber Tamblyn Asks James Woods if He's \"Part of the Problem\" in an Open Letter"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}