{"url": "https://en.wikipedia.org/wiki/Nicole_Richie", "text": "Nicole Camille Richie (née Escovedo; born September 21, 1981) is an American television personality, fashion designer, author, socialite and actress. Richie rose to prominence for her role in the Fox reality television series The Simple Life, alongside her childhood best friend and fellow socialite Paris Hilton, which lasted five seasons. The Simple Life was a hit for the Fox network, premiering with 13 million viewers.[2] Richie's personal life attracted significant media attention during The Simple Life's five-year run, and she was a constant fixture of tabloid journalism before and after her appearance.\n\nRichie appeared as one of the three mentors on NBC's Fashion Star. In July 2014, Richie's reality series Candidly Nicole premiered on VH1 and ran for two seasons.[3] From 2017 to 2018, Richie appeared in her first series regular role as Portia Scott-Grifith in the NBC sitcom Great News.\n\nEarly life [ edit ]\n\nRichie was born in Berkeley, California, and has English, Mexican and Creole African-American ancestry.[1][4][5] Her biological father, Peter Michael Escovedo, is the brother of Sheila E,[6] and her biological mother is Karen Moss.[7] When she was three years old, her biological parents agreed to let her move in with Lionel Richie because they could not afford to provide for her. \"My parents were friends with Lionel,\" she told People in 2003. \"They trusted that they would be better able to provide for me.\"[8] Initially, Lionel Richie became her guardian.[9]\n\nRichie and his wife Brenda Harvey legally adopted Nicole when she was nine.[10] Shortly after, Lionel's affair with another woman became public knowledge.[11] Lionel and Brenda went through a bitter public split; as a result, they were indulgent to the young Nicole. \"Their way of making me happy was to say, 'yes,' to everything I wanted, but I don't think a little girl should have that much freedom,\" said Richie in an interview with Vanity Fair.[12] Following the divorce, Lionel remarried and had two more children: Miles (b. 1994) and Sofia (b. 1998).[13] Richie's godmother is Nancy Davis, daughter of Marvin Davis and mother of Brandon Davis. Michael Jackson was Richie's godfather. Quincy Jones said in a People magazine interview that he has \"known Nicole Richie since she was a baby. She's a very smart girl\".[14]\n\nRichie graduated from Montclair College Preparatory School in 1999, then attended the University of Arizona in Tucson, Arizona, alongside Kourtney Kardashian and Luke Walton, where she studied Arts and Media. She did not have a definitive study plan in Arizona, dropped out after two years, and returned to California.[15][10]\n\nCareer [ edit ]\n\nTelevision [ edit ]\n\nIn 2003, Richie and her childhood best friend Paris Hilton starred in the reality series The Simple Life, in which they lived for a month with a family in the rural community of Altus, Arkansas.[16] The series premiere debuted on Fox on December 2, 2003, to 13 million viewers, increasing Fox's reach among viewers 18–49.[2] The series continued for a second and third season.[17]\n\nFox subsequently canceled the show after a dispute between Hilton and Richie, but it was aired by E! Entertainment Television for its fourth season, drawing nearly one million viewers and was followed by a relatively unsuccessful fifth season.[18] Complications arose during production of the fifth season, with both Richie and Hilton facing major charges for DUI, and at risk of serving jail time. Hilton was sentenced to 23 days in jail, though this was after production of the season had finished.[19] Richie accepted a plea agreement and was sentenced to four days in jail, again after production had wrapped.[20] Despite talks of a sixth season,[21] the series finished its run at the end of the moderately unsuccessful fifth season.[22][23]\n\nIn 2005, Richie made her acting debut in the comedy film Kids in America. Richie has guest starred in television series including Eve, Six Feet Under, American Dreams, 8 Simple Rules for Dating My Teenage Daughter, and Chuck.[24] In July 2008, plans were announced to turn Richie's 2005 novel, The Truth About Diamonds, into a television series.[25] On January 1, 2010, it was announced that Richie would appear as a guest judge on Project Runway.[26]\n\nIn early 2016, Richie auditioned for a role in the NBC sitcom, Great News, created by Tracey Wigfield and produced by Wigfield and Tina Fey, which is set in the world of television news. Although Richie's audition was not successful, she was later brought in to replace Kimrie Lewis-Davis in the supporting role of Portia, an anchorwoman at the news channel depicted in the series. The show's producers had initially cast Lewis-Davis for the role, but decided to go in a different direction with the character after seeing the pilot episode.[27] When speaking about casting Richie in her first scripted series-regular television role, Fey explained: \"She's a really funny person and has an instant likability. Those are instincts you can't teach. People have it or not. She has good timing without really pushing it.\"[28] The series concluded on January 25, 2018 after two seasons.\n\nIn March 2019 Richie was cast in the FOX comedy pilot Richard Lovely.[29]\n\nWriting [ edit ]\n\nIn 2005, Richie wrote a semi-autobiographical novel, The Truth About Diamonds, which was released by Bharell Jackson Publishing. The novel is loosely based on her life but is mostly fictional. It chronicles the life of a famous singer's adopted daughter named Chloe Parker, who makes her way through all the popular nightclubs and parties in Hollywood while battling a drug addiction. In early January 2006, The Truth About Diamonds peaked at number No. 32 in Hardcover Fiction on The New York Times Best-Seller List.[30]\n\nRichie's second novel, Priceless, was released on September 28, 2010.[31] It tells the story of a girl who loses everything and then learns about what really matters in life.[32]\n\nFashion [ edit ]\n\nRichie at David Jones in Sydney promoting her House of Harlow sunglasses line in 2012\n\nRichie has been featured in several fashion blogs and magazines such as Harper's Bazaar, Seventeen, Lucky, Marie Claire, Elle, InStyle, Paper, Company, Nylon, Tatler, Flare and Teen Vogue.[33] She has also modeled for Australia's Vogue and Elle; US' People, Stuff, Blender and Hollywood Reporter; Mexico's Marie Claire and UK's Glamour.[33] Richie has been the face of Bongo Jeans and Jimmy Choo advertising campaigns. In April 2007, Richie announced plans to start a jewelry, accessories, and sunglasses line along with a perfume and style book.[34] In October 2008, she debuted a jewelry line, House of Harlow 1960.[35] The line became available at Kitson's online boutique.[36] In spring 2010, the line was extended to include apparel and shoes. House of Harlow 1960 later became a lifestyle brand including eyewear, home fragrance, and accessories.[37] In 2009, Richie joined maternity store A Pea in the Pod to create the new collection maternity clothes.[38] The line was titled \"Nicole\" which had pieces that she would wear as an expectant mother.[39] In February 2010, Richie expanded her fashion business with a women's line called Winter Kate, her daughter's two middle names. The collection was inspired by timeless prints and shapes, beautiful paisley and florals.[40]\n\nIn 2010, Richie won \"Entrepreneur of the Year\" for her House of Harlow 1960 brand at the Glamour Women of the Year Awards.[41] House of Harlow 1960 was also nominated in the category \"Celebrity Fashion Line\" at the 2010 Teen Choice Awards.[42] In July 2011, it was reported that Richie's House of Harlow 1960 line has unveiled a 14-piece handbag collection. The House of Harlow 1960 handbag collection became available at Bergdorf Goodman, Neiman Marcus, Nordstrom and Shopbop.[43] In July 2011, it was announced that Richie would be one of the three mentors in NBC's new reality show Fashion Star alongside Jessica Simpson. Richie guided aspiring designers who hope to become the next big brand in fashion.[44][45] She launched a collection for Macy's Impulse line in September 2012, which was sold in 100 Macy's stores as well as online.[46] Her first fragrance, Nicole by Nicole Richie, was also launched in September 2012.[47][48] Her second fragrance, No Rules by Nicole Richie was launched in March 2014.[49]\n\nIn 2015, Richie became Urban Decay's brand ambassador, representing their \"Troublemaker\" mascara.[50][51] Richie's fashion line House of Harlow 1960 partnered with Urban Decay for a limited-edition collection in April 2018. The line was exclusively sold at Revolve's official website.[52]\n\nMusic [ edit ]\n\nRichie made her musical debut in February 2005 with a live appearance on ABC's The View playing the piano.[53] Although widely speculated that Richie was working on an album, she denied such rumors to People. She was quoted as saying, \"I do eventually [want to record an album], but right now I have a lot on my plate\".[54] In February 2010, Richie was featured on the charity single \"We Are the World 25 for Haiti\". \"I was four years old in a studio, watching my dad record \"We Are the World\" and today I get to do it again. Excited to help make a change,\" she later said of the experience.[55]\n\nIn 2004, she auditioned for the part of Maureen in the popular Broadway hit Rent but did not get the part.[56] In 2008, she was offered the lead role in the musical Chicago as Roxie Hart.[57]\n\nIn September 2013, Richie made a cameo appearance in Christina Aguilera's music video for the song \"Let There Be Love\".[58]\n\nPersonal life [ edit ]\n\nIn April 2005, reports surfaced that Richie and longtime friend Paris Hilton were no longer speaking. Hilton commented: \"It's no big secret that Nicole and I are no longer friends. Nicole knows what she did, and that's all I'm ever going to say about it\".[59] Neither Richie nor Hilton spoke publicly about the cause of the split. They eventually reconciled in October 2006.[60] She dated DJ Adam Goldstein from 2003 to 2005 but broke up after a nine-month engagement.[61]\n\nIn December 2006, Richie began dating singer Joel Madden of the rock group Good Charlotte.[62] They have two children, a daughter born in January 2008[63] and a son born in September 2009.[64] In February 2008, the first photos of their daughter were sold to People magazine for $1 million.[65] The couple confirmed their engagement in February 2010,[66] and married on December 11, 2010.[67] The couple resides in Los Angeles, California.[68]\n\nHealth [ edit ]\n\nIn early 2006, Richie was notably thinner compared to her previous appearance in the first two seasons of The Simple Life.[69] In May she told Vanity Fair, \"I know I'm too thin right now, so I wouldn't want any young girl looking at me and saying, 'That's what I want to look like.'\"[70] She also said, \"I started seeing a nutritionist and a doctor. I was scared that it could be something more serious.\"[71] During this time it was reported that she had also sought the help of a psychiatrist and a personal trainer.[72] Later that year, in September, Richie stated \"I am not anorexic. I am not bulimic. I do not have an eating disorder.\"[72] On October 27, 2006, it was announced that Richie was seeking treatment for \"an inability to put on weight\", though it was not for an eating disorder.[72]\n\nIn March 2007, Richie was taken to the hospital for dehydration. On March 21, her representatives announced she was diagnosed with hypoglycemia.[73]\n\nLegal issues [ edit ]\n\nIn October 2002, Richie was arrested following a brawl in a New York City nightclub. The charges were dropped.[74]\n\nOn February 27, 2003, when Richie was arrested in Malibu, California, for driving with a revoked license and possession of heroin, she checked herself into a rehabilitation center. In August 2003, she was sentenced to three years' probation.[74]\n\nOn December 11, 2006, Richie was arrested by the California Highway Patrol after she failed a field sobriety test. She was charged with driving under the influence on State Route 134 in the Burbank/Glendale, California area. Several motorists had reported a black Mercedes-Benz G-Class entering the freeway on the exit ramp and traveling in the opposite traffic direction.[75]She admitted to using marijuana and the narcotic Vicodin before the incident.[75] On July 27, 2007, Richie was sentenced to four days in jail at the Century Regional Detention Center in Lynwood, California.[76] However, she only served about 82 minutes of the sentence and was released at 16:37 PDT on August 23, 2007.[77] A spokeswoman for the sheriff's department told People magazine that Richie \"was released early due to overcrowding in the jail system. This is standard procedure for nonviolent offenders.\" After spending 82 minutes in jail, Richie was \"Of course pleasantly surprised to be released so quickly,\" said her attorney.[78]\n\nRichie enrolled in an 18-month anti-drinking driver education program, according to papers filed with the Superior Court of California.[79] On June 22, her probation was extended one year to March 2011 because she missed her anti-drinking driving class.[80] However, Richie's probation was terminated early on December 29, 2010, after her lawyer presented details to the judge that Richie had completed all terms of her probation.[81]\n\nPhilanthropy [ edit ]\n\nIn November 2007, Richie and her husband Joel Madden created \"The Richie Madden Children's Foundation\" in support of disadvantaged young mothers and children.[82] She has been involved with the Red Cross, UNICEF, Elton John AIDS Foundation, Charlize Theron Africa Outreach Project, Dana-Farber Cancer Institute, March of Dimes, Playing for Change, Small Steps Project, and Baby2Baby.[83] Richie is a board member of Baby2Baby.[84]\n\nIn 2007, Richie and Madden donated 100 baby gifts to expectant mothers at Los Angeles Free Clinic, through The Richie Madden Children's Foundation.[85] In May 2008, Richie and Madden shot a UNICEF public-service announcement to generate aid for the cyclone-devastated Myanmar.[86] Richie and Madden have also written blogs on the UNICEF website and encouraged people to help children in need.[87] Richie, Joel and Benji Madden along with UNICEF held a fundraiser for the Tap Project in March 2009. They sold 143 water pumps to bring water directly to the villages and raised $100,000.[88] Esprit donated 10% of all the sales on April 2, 2009, at their newly opened 3rd Street Promenade store to The Richie-Madden Children's Foundation.[89] The Richie-Madden Foundation specially designed \"Cup with a Cause\" for 7-Eleven. It was a part of their charity-focused coffee campaign in February 2010.[90] During 2010 the Foundation worked together with Beyond Shelter, a non-profit organization devoted to providing shelter for homeless families in Los Angeles.[91]\n\nRichie has been a board member of the Environmental Media Association for several years and took part in their awareness program in May 2009.[92] Each member \"adopted\" a school to raise awareness for the program and help students with environmental education. She participated in a charity hand-me-downs auction that started on the website handmedowns.com. The proceeds went directly to The Richie Madden Children's Foundation to help bring more opportunities to children in the US and abroad.[93]\n\nIn November 2011, Richie hosted Baby2Baby's charity event to support families in need during holiday season.[94] She was a guest speaker at WE Charity's \"WE Day California\" in 2018.[95][96]\n\nFilmography [ edit ]\n\nMusic Videos [ edit ]\n\nAward nominations [ edit ]\n\nYear Award Category Result 2005 Teen Choice Awards Choice TV Personality: Female Nominated 2010 Best Celebrity Fashion Line Nominated\n\nPublished works [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Nicole_Richie_and_Joel_Madden_%40_2010_Academy_Awards.jpg/220px-Nicole_Richie_and_Joel_Madden_%40_2010_Academy_Awards.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Nicole_Richie_at_the_82nd_Academy_Awards_%28cropped%29.jpg/220px-Nicole_Richie_at_the_82nd_Academy_Awards_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/6/68/Nicole_Richie_at_the_82nd_Academy_Awards_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Nicole_Richie_7%2C_2012.jpg/170px-Nicole_Richie_7%2C_2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/68/Nicole_Richie_at_the_82nd_Academy_Awards_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nicole_Richie", "title": "Nicole Richie", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/6/68/Nicole_Richie_at_the_82nd_Academy_Awards_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}