{"url": "https://www.today.com/popculture/emmys-2017-highlights-television-s-biggest-night-t116399", "text": "Stephen Colbert kicked off the 69th annual Primetime Emmy Award ceremony on Sunday with a monologue that celebrated — and skewered — many of the night's nominees, including \"This Is Us\" star Milo Ventimiglia.\n\nStephen Colbert AFP - Getty Images\n\n\"But seriously, Milo, you're going to die this season, right?\" Colbert ribbed the actor as he sat in the audience. \"Just give us a hint. You slip in a bathtub? Bad clams? A circus lion in a convenience store? What happens? I'm just saying your fans want to see you dead.\"\n\nThe late-night funny man also poked fun at U.S. President Donald Trump, recalling a time when Trump, miffed that his reality show, \"The Celebrity Apprentice,\" never won an Emmy, alleged the award process was rigged.\n\n\"Unlike the presidency, Emmys go to the winner of the popular vote,\" Colbert quipped.\n\nDave Chappelle and Melissa McCarthy Chris Pizzello / AP\n\n'SNL' scores big time\n\n\"Westworld\" and \"Saturday Night Live\" led the night's nominees with 22 nods each, but it was \"SNL\" that racked up more awards, nearly sweeping the comedy categories. The legendary comedy show entered the evening with at least two Emmys under its belt from last weekend's Creative Arts Emmys ceremony, where \"SNL\" guest stars Dave Chappelle and Melissa McCarthy won awards.\n\nFormer White House Press Secretary Sean Spicer was one of the night's most unexpected guests. Kevin Winter / Getty Images\n\nMcCarthy won, of course, for her hilarious impersonation of former White House Press Secretary Sean Spicer. In an unexpected twist, Spicey himself made a brief cameo during Colbert's opening monologue, causing McCarthy's jaw to drop.\n\n\"SNL\" also nabbed the Emmy for Best Variety Sketch Series, and continued to pick up awards throughout the evening.\n\nKate McKinnon Chris Pizzello / AP\n\nTrending stories,celebrity news and all the best of TODAY. This site is protected by recaptcha\n\nThe great Kate wins again\n\n\"Saturday Night Live\" star Kate McKinnon won her second consecutive Emmy for Best Supporting Actress on a Comedy Series, beating out her cast mates Leslie Jones and Vanessa Bayer, among other talented funny ladies. The actress, who portrayed Democratic presidential candidate Hillary Clinton during the 2016 election, thanked Clinton \"for your grace and grit.\"\n\nAlec Baldwin Kevin Winter / Getty Images\n\nAlec Baldwin wins, too\n\nAlec Baldwin nabbed an Emmy for portraying Donald Trump on \"Saturday Night Live\" and accepted his award by joking, \"'At long last, Mr. President, here is your Emmy.'\"\n\n\"9 to 5\" stars Lily Tomlin, Dolly Parton and Jane Fonda reunite. Kevin Winter / Getty Images\n\nA '9 to 5' reunion\n\nIn one of the evening's most thrilling surprises the stars of the legendary 1980 comedy \"9 to 5\" — Lily Tomlin, Dolly Parton and Jane Fonda — took to the stage together to present the award for Best Supporting Actor in a Limited Series to \"Big Little Lies\" star Alexander Skarsgard.\n\n\"Big Little Lies\" stars Alexander Skarsgard, Nicole Kidman and Reese Witherspoon pose with their Emmys. Reuters\n\nMore big wins for 'Big Little Lies'\n\n\"Big Little Lies\" star Nicole Kidman won her first Emmy for Best Lead Actress in a Limited Series or Movie, dominating in a tough category that included three other Oscar winners — her \"Big Little Lies\" co-star Reese Witherspoon, and \"Feud\" stars Jessica Lange and Susan Sarandon.\n\n\"I have two little girls and my darling Keith (Urban) who I asked to help me pursue this artistic path and they have to sacrifice so much for it,\" said Kidman when she accepted her award. \"This is yours. I want my little girls to have this on their shelf and to look at it and go overtime my mom didn’t put me to bed it’s because of this.\"\n\nKidman's co-star Laura Dern picked up her first Emmy for Best Supporting Actress and the HBO series also won Best Limited Series, among other awards throughout the night.\n\nBest Actor winner Sterling K. Brown brought down the house with his hilarious acceptance speech. Kevin Winter / Getty Images\n\nA \"This Is Us\" win — with a hilarious speech\n\n\"This Is Us\" star Sterling K. Brown brought the house down with his hilarious speech when he won Best Lead Actor in a Drama Series— beating out his TV dad, Milo Ventimiglia.\n\nThe two-time Emmy winner thanked his cast mates, joking, \"Milo, Mandy, Justin, Chrissy, you are the best white TV family that a brother has ever had. Better than Mr. Drummond, better than them white folks that raised Webster.\"\n\nBrown also thanked his TV wife, Susan Kelechi Watson, and his other TV dad, Ron Cephas Jones.\n\nJulia Louis-Dreyfus made Emmy history when she became the first actress to win 6 Emmys for playing the same character. Kevin Winter / Getty Images\n\nJulia Louis-Dreyfus makes Emmy history\n\nEmmy favorite Julia Louis-Dreyfus made history when she won her eighth Emmy for her work on \"Veep,\" tying with TV legend Cloris Leachman for most Emmy wins. But Louis-Dreyfus broke the record for wins for an actor playing the same character now that she's won six consecutive Emmys for playing zany Selina Meyer.\n\n\"This is and continues to be the role of a lifetime,\" said the actress before joking, \"We did have a whole story about impeachment but we abandoned that because were were worried someone else might get to it first.\"\n\n\"Veep\" also picked up a final Emmy award for Best Comedy Series. The HBO series recently announced it would be ending its run.\n\nElisabeth Moss (R) accepts the Best Drama Series for \"The Handmaid's Tale\" from Oprah Winfrey. Kevin Winter / Getty Images\n\n\"The Handmaid's Tale\" nabs Best Drama, more\n\nIt was also a big night for Hulu's chilling dystopian series \"The Handmaid's Tale,\" which beat out \"This Is Us,\" \"Stranger Things,\" \"House of Cards\" and more hit shows when it nabbed the award for Best Drama Series. The cast was joined onstage by author Margaret Atwood, who wrote the 1985 novel the series is based on.\n\nThe show's stars Elisabeth Moss and Ann Dowd won Best Actress in A Drama Series and Best Supporting Actress in a Drama Series, respectively. And, at last weekend's Creative Arts Emmys, \"Gilmore Girls\" alum Alexis Bledel scored a Best Guest Actress award her work on the show.\n\nLena Waithe accepts the award for Outstanding Writing for a Comedy Series for \"Master of None.\" AFP - Getty Images\n\nA historic win for Lena Waithe\n\n\"Master of None\" star Lena Waithe created Emmy history when she became the first black woman to win an Emmy for writing a comedy series.\n\n\"The things that make us different,\" the LGBTQ actress said in her emotional speech, \"those are our superpowers... The world would not be as beautiful as it is without us in it.", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/MSNBC/Components/Video/201709/1920emmyScreen_Shot_2017-09-12_at_4-17-50_PM.focal-760x428.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2017_37/1282982/emmy-awards-pretty-little-lies-today-170917-tease_48139ba498a03c962cc906758916afe0.social_share_1200x630_center.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/MSNBC/Components/Video/201709/tdy_pop_mor_emmys_170918.focal-760x428.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media3.s-nbcnews.com/j/newscms/2017_37/1282982/emmy-awards-pretty-little-lies-today-170917-tease_48139ba498a03c962cc906758916afe0.social_share_1200x630_center.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.today.com/popculture/emmys-2017-highlights-television-s-biggest-night-t116399", "title": "Emmys 2017: Highlights from television's biggest night", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/popculture/emmys-2017-highlights-television-s-biggest-night-t116399", "title": "Surprises, zingers and an epic reunion: Here are the biggest Emmys moments", "description": "Host Stephen Colbert kept the laughs coming on television's biggest night, but he had help from our favorite stars.", "image": {"identifier": "https://media3.s-nbcnews.com/j/newscms/2017_37/1282982/emmy-awards-pretty-little-lies-today-170917-tease_48139ba498a03c962cc906758916afe0.social_share_1200x630_center.jpg", "secure_url": "https://media3.s-nbcnews.com/j/newscms/2017_37/1282982/emmy-awards-pretty-little-lies-today-170917-tease_48139ba498a03c962cc906758916afe0.social_share_1200x630_center.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media3.s-nbcnews.com/j/newscms/2017_37/1282982/emmy-awards-pretty-little-lies-today-170917-tease_48139ba498a03c962cc906758916afe0.social_share_1024x512_center.jpg", "title": "Surprises, zingers and an epic reunion: Here are the biggest Emmys moments", "description": "Host Stephen Colbert kept the laughs coming on television's biggest night, but he had help from our favorite stars.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "Host Stephen Colbert kept the laughs coming on television's biggest night, but he had help from our favorite stars.", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media3.s-nbcnews.com/j/newscms/2017_37/1282982/emmy-awards-pretty-little-lies-today-170917-tease_48139ba498a03c962cc906758916afe0.social_share_1024x768_scale.jpg", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1505698680.0, "source": "https://www.today.com", "summary": ""}