{"url": "https://variety.com/2017/tv/features/the-crown-season-2-matt-smith-vanessa-kirby-interview-1202629420/", "text": "Change is afoot when Netflix’s hit period drama “The Crown” returns for a second season.\n\nNot only will there be a changing of the guard at the end of the 10 new episodes, as Season 2 is both Claire Foy and Matt Smith’s final seasons playing Queen Elizabeth and Prince Philip, Duke of Edinburgh, respectively, but also there will be new settings and relationships within the story.\n\nTo begin with, Philip takes a five-month journey to faraway lands to be the royal face at events like the Olympic Games, which will move much of the story out of the confines of Buckingham Palace, while Princess Margaret (Vanessa Kirby) balks at the constraints of royal expectations and finds a new love in photographer Antony Armstrong-Jones, better known as Lord Snowdon (Matthew Goode).\n\n“The family explodes out of the palace: Philip’s out on tour and Margaret suddenly gets into a reality of London that she’s never experienced before. It’s not a fairy tale love story. She’s actually meeting somebody when she’s still extremely wounded and so is he, as we later discover,” Kirby tells Variety. “Matthew Goode is incredible. He encapsulated everything Margaret was trying to discover in season one, which was anti-establishment, anti-royal [and] made her feel — at least temporarily — more complete.”\n\nFor Kirby, a continued challenge comes to portraying Princess Margaret in that duality of being “so essentially royal” and “part of this old establishment” while still wanting to be “normal and a modern woman.” In the second season, her forward motion as a somewhat unwilling princess straining at the confines of royal responsibility are front and center.\n\n“It’s more about how Margaret is wrestling with remaining part of her family and not having a choice of the way she wants to live her life — the man and the children she would have had,” Kirby says of the emotional journey. “She’s attempting to define herself in contrary to it. That’s why she finds someone very distinctly unroyal, that’s not approved by the establishment, that’s not aristocratic. She finds her salvation in [Snowdon], who is the antithesis of her life and past.”\n\nSnowdon has a significant effect on Margaret when it comes to her “sense of place in the world,” Kirby continues. “Her autonomy to meet someone who was her wingman and someone she could confide in and love and walk down the aisle with [was] something she’d always been waiting to do.”\n\nMeanwhile, the continued complexity of playing Philip, for Smith, comes from the fact that he is a man who loves his wife but is perpetually frustrated being in second position to her royal needs and responsibilities.\n\n“I’m always really compelled by the deep conflict in Philip,” Smith says, citing “his duty to himself as a man” first. “He’s a very male character, whatever that means nowadays, and his duty to his wife and the strange conflict it generates in him: the desire to be the head of the family and being usurped. They’re weirdly similar in that way, Philip and Margaret, they wanted their own wings but they were constantly being clipped.”\n\nThis is something Kirby has noticed throughout the series as well. “When Philip says, ‘You’ve taken my name, you’ve taken my home,’ that’s what every woman says. It was quite amazing to see a series where a man says that,” she points out.\n\nSmith acknowledges that the public’s ongoing fascination with the royal family and what they may be like behind closed doors versus their public appearances is a driving factor for the second season of “The Crown.” “They’re often most interesting when they’re being domestic. That’s what’s good about the show: you come to understand they’re normal human beings — their blood isn’t blue, contrary to popular opinion,” he says.\n\nTo that point, viewers will also learn more about Philip’s younger years. “We glimpse the difficulty and the pain and tragedy he went through and we see why he is the way he is now. We see the sardonic, dry wit and where it comes from; it’s borne out of pain,” Smith explains.\n\nMarital strife is front and center in the second season, as well, as Philip and Elizabeth continue to struggle with being man and wife vs. Queen and royal subject. “There’s a scene in season two where Philip and Elizabeth have an argument about where Charles should go to school. He says, ‘You can’t keep falling back on what the royal family needs, what about what I need?’ And I like the fact that Philip’s needy! He’s a needy man but he’s also a really male man. He needs her attention,” Smith says.\n\nOf course, what happens if and when Elizabeth cannot give Philip the attention he needs will undoubtedly add to the marital tension felt within the second season.\n\n“The Crown” Season 2 streams Dec. 8 on Netflix.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Ffeatures%2Fthe-crown-season-2-matt-smith-vanessa-kirby-interview-1202629420%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202629420&comment_count=1", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2017/12/thecrown_203_unit_00424_r_crop1.jpg?w=1024", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/12/thecrown_203_unit_00424_r_crop1.jpg?w=1024", "keywords": [], "authors": ["Diane Gordon"], "canonical_link": "https://variety.com/2017/tv/features/the-crown-season-2-matt-smith-vanessa-kirby-interview-1202629420/", "title": "‘The Crown’ Stars on Season 2 Marital Tension, Life Outside Buckingham Palace and Diving Deeper Into Character", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"The Crown\" stars Matt Smith and Vanessa Kirby preview Season 2 of Netflix's hit period drama.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202629420, "author": "Diane Gordon", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-12-04T11:00:12"}, "pmc-tag": "Matt Smith,The Crown,Vanessa Kirby", "title": "‘The Crown’ Stars on Season 2 Marital Tension, Life Outside Buckingham Palace and Diving Deeper Into Character", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Crown’ Stars on Season 2 Marital Tension, Life Outside Buckingham Palace and Diving Deeper Into Character", "url": "https://variety.com/2017/tv/features/the-crown-season-2-matt-smith-vanessa-kirby-interview-1202629420/", "description": "Change is afoot when Netflix’s hit period drama “The Crown” returns for a second season. Not only will there be a changing of the guard at the end of the 10 new episodes, as Season 2 is both Claire…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/12/thecrown_203_unit_00424_r_crop1.jpg?w=1024", "width": 1200, "height": 800, "alt": "The Crown(L to R) Elizabeth, Adeane, PhilipElizabeth and Philip return from the world tour"}, "locale": "en_US"}, "article": {"published_time": "2017-12-04T19:00:12+00:00", "modified_time": "2017-12-04T19:00:14+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "‘The Crown’ Stars on Season 2 Marital Tension, Life Outside Buckingham Palace and Diving Deeper Into Character"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/12/thecrown_203_unit_00424_r_crop1.jpg?w=1024", "alt": "The Crown(L to R) Elizabeth, Adeane, PhilipElizabeth and Philip return from the world tour"}, "card": "summary_large_image", "title": "‘The Crown’ Stars on Season 2 Marital Tension, Life Outside Buckingham Palace and Diving Deeper Into Character", "description": "\"The Crown\" stars Matt Smith and Vanessa Kirby preview Season 2 of Netflix's hit period drama."}, "author": "Diane Gordon", "content_type": "Article", "post_id": 1202629420, "title": "'The Crown' Stars on Season 2 Marital Tension, Life Outside Buckingham Palace and Diving Deeper Into Character", "published_at": "2017-12-04 11:00:12", "image": "https://pmcvariety.files.wordpress.com/2017/12/thecrown_203_unit_00424_r_crop1.jpg?w=1024", "comment_count": 1, "tags": "Vanessa Kirby", "topics": "News", "appeared_in_print": "No", "body": "Change is afoot when Netflix’s hit period drama “The Crown” returns for a second season.\r\n\r\nNot only will there be a changing of the guard at the end of the 10 new episodes, as Season 2 is both Claire Foy and Matt Smith's final seasons playing Queen Elizabeth and Prince Philip, Duke of Edinburgh, respectively, but also there will be new settings and relationships within the story.\r\n\r\nTo begin with, Philip takes a five-month journey to faraway lands to be the royal face at events like the Olympic Games, which will move much of the story out of the confines of Buckingham Palace, while Princess Margaret (Vanessa Kirby) balks at the constraints of royal expectations and finds a new love in photographer Antony Armstrong-Jones, better known as Lord Snowdon (Matthew Goode).\r\n\r\n\"The family explodes out of the palace: Philip’s out on tour and Margaret suddenly gets into a reality of London that she’s never experienced before. It’s not a fairy tale love story. She’s actually meeting somebody when she’s still extremely wounded and so is he, as we later discover,\" Kirby tells Variety. \"Matthew Goode is incredible. He encapsulated everything Margaret was trying to discover in season one, which was anti-establishment, anti-royal [and] made her feel — at least temporarily — more complete.\"\r\n\r\nFor Kirby, a continued challenge comes to portraying Princess Margaret in that duality of being \"so essentially royal\" and \"part of this old establishment\" while still wanting to be \"normal and a modern woman.\" In the second season, her forward motion as a somewhat unwilling princess straining at the confines of royal responsibility are front and center.\r\n\r\n\"It’s more about how Margaret is wrestling with remaining part of her family and not having a choice of the way she wants to live her life — the man and the children she would have had,\" Kirby says of the emotional journey. \"She’s attempting to define herself in contrary to it. That’s why she finds someone very distinctly unroyal, that’s not approved by the establishment, that’s not aristocratic. She finds her salvation in [Snowdon], who is the antithesis of her life and past.\"\r\n\r\nSnowdon has a significant effect on Margaret when it comes to her \"sense of place in the world,\" Kirby continues. \"Her autonomy to meet someone who was her wingman and someone she could confide in and love and walk down the aisle with [was] something she’d always been waiting to do.”\r\n\r\nMeanwhile, the continued complexity of playing Philip, for Smith, comes from the fact that he is a man who loves his wife but is perpetually frustrated being in second position to her royal needs and responsibilities.\r\n\r\n\"I’m always really compelled by the deep conflict in Philip,\" Smith says, citing \"his duty to himself as a man\" first. \"He’s a very male character, whatever that means nowadays, and his duty to his wife and the strange conflict it generates in him: the desire to be the head of the family and being usurped. They’re weirdly similar in that way, Philip and Margaret, they wanted their own wings but they were constantly being clipped.\"\r\n\r\nThis is something Kirby has noticed throughout the series as well. \"When Philip says, 'You’ve taken my name, you’ve taken my home,' that’s what every woman says. It was quite amazing to see a series where a man says that,\" she points out.\r\n\r\nSmith acknowledges that the public's ongoing fascination with the royal family and what they may be like behind closed doors versus their public appearances is a driving factor for the second season of \"The Crown.\" \"They’re often most interesting when they’re being domestic. That’s what’s good about the show: you come to understand they’re normal human beings — their blood isn’t blue, contrary to popular opinion,\" he says.\r\n\r\nTo that point, viewers will also learn more about Philip’s younger years. \"We glimpse the difficulty and the pain and tragedy he went through and we see why he is the way he is now. We see the sardonic, dry wit and where it comes from; it’s borne out of pain,\" Smith explains.\r\n\r\nMarital strife is front and center in the second season, as well, as Philip and Elizabeth continue to struggle with being man and wife vs. Queen and royal subject. \"There’s a scene in season two where Philip and Elizabeth have an argument about where Charles should go to school. He says, 'You can’t keep falling back on what the royal family needs, what about what I need?' And I like the fact that Philip’s needy! He’s a needy man but he’s also a really male man. He needs her attention,\" Smith says.\r\n\r\nOf course, what happens if and when Elizabeth cannot give Philip the attention he needs will undoubtedly add to the marital tension felt within the second season.\r\n\r\n\"The Crown\" Season 2 streams Dec. 8 on Netflix.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1512414012.0, "source": "https://variety.com", "summary": ""}