{"url": "https://tvline.com/2018/10/16/roseanne-dead-the-conners-recap-season-1-episode-1-premiere/", "text": "ABC on Tuesday launched The Conners, a spinoff (so to speak) of the short-lived Roseanne revival, which was torpedoed when… you know. So how did the highly anticipated continuation address the elephant in the room? Read on to find out…\n\nThe premiere picks up fewer than three months after the events of the revival, and just three weeks after the death of Roseanne Conner. The family is gathered in the kitchen, still in mourning after Roseanne’s supposed heart attack. We’re told she died in her sleep, and Dan’s been sleeping on the couch ever since. Bev mentions that a mother should never have to bury one of her children, while Jackie, who just can’t help herself, tells her still-thriving, 92-year-old mother that she’ll likely stick around long enough to bury the entire family, before she’s buried by a robot. Amid the discussion, D.J. enters with his wife Geena (new series regular Maya Lynne Robinson), who’s home from Afghanistan on a five-day leave.\n\nShortly thereafter, Jackie receives a phone call from the coroner’s office and asks Dan if they can speak in private. She reveals that Roseanne didn’t die of a heart attack: She overdosed on opioids. Dan is gobsmacked, believing Roseanne stopped taking prescription pain killers following her successful knee surgery. Becky and Darlene join Dad and Aunt Jackie outside to discuss the not-so-shocking coroner’s report, at which point Becky reveals that she found a pill bottle prescribed to a Marcy Bellinger in Roseanne’s closet. (If the name sounds familiar, it’s because Dan previously found pills belonging to Marcy when he confronted Roseanne about her addiction in the revival’s second-to-last episode). Dan confiscates the pills and heads back inside, then Becky says, “That was the only thing from Mom’s closet that I wanted.”\n\nThe next day, Becky and Darlene are dealing with Dan and Roseanne’s many past-due bills. They consider using Mom’s death as an excuse, then remember that Roseanne has already used a death in the family as an excuse far too many times. The sisters share a chuckle, then Darlene asks if they’re horrible people for laughing. “Well, I’m tired of crying,” Becky says, and laughing inappropriately is what Mom taught them to do. Becky then gets up to go to work. When Darlene asks when she’ll back to help with business, Becky says she has no time. Not only is she working, but she’s dating again. She defends her selfishness, saying she already went through all of this when Mark died, and can’t bear to go through it again. She tells her younger sister that she’s the obvious choice to take over for Mom, since she already lives there and has the whole “scary tyrant” thing down.\n\nHarris walks in and witnesses the sisters fighting. She insists they stop so one of them doesn’t come to regret what they say should the other suddenly die. It’s then revealed that Harris is riddled with guilt since she and Granny Rose always fought. Darlene assures her daughter that all families bicker, and Roseanne knew that her granddaughter loved her. Becky leaves, and Darlene and Harris head into the living room to find Jackie steam-cleaning the couch. Within seconds, Becky walks back in to apologize to Darlene… and to ask for a ride to work.\n\nAfterwards, Dan and Chuck are having drinks at the restaurant. Darlene enters and confronts him about a poster board taped to his truck, calling out Marcy for killing his wife. She tells Dad he needs to remove the poster board, but Dan says he needs to do this to keep from driving his car through Marcy’s house.\n\nLater that night, Dan returns home and watches a movie with D.J., Geena, Becky and Bev, while Darlene’s busy paying the bills. Geena accompanies Darlene when she heads into the kitchen, where Jackie’s keeping herself busy by working on a system for better flow to the coffeemaker. Geena suggests Jackie’s had enough caffeine, while Darlene tells her aunt to go home and get some sleep. She then opens a kitchen drawer to find more of Roseanne’s pills. Jackie reveals she found them in Roseanne’s icepack, and was hiding them because she knew they’d upset Darlene.\n\nWe then cut back to the living room. There’s a knock at the door, and it’s none other than Marcy (played by Last Man on Earth survivor Mary Steenburgen). Dan goes outside and shuts the door behind him, telling Marcy she’s got a lot of nerve for showing up here. Marcy wants him to remove the sign from his car, because everyone already hates her. She explains that folks in Lanford traded meds because no one’s insurance covered everything they needed. Roseanne called her complaining about her knee, saying she needed painkillers if she was ever going to return to work. If she’d known Roseanne had a substance abuse issue, she says, she wouldn’t have given her the pills. She apologizes, then walks away once Darlene steps outside and tells Dan that they’ve found additional pills prescribed to people other than Marcy. Dan feels bad and asks Darlene to drive Marcy home, then breaks down in tears.\n\nThe following afternoon, Darlene visits her father out in the garage. Dan tells her that he’s most upset that he no longer has anyone to blame for his wife’s death. He also admits that his wife could be a very stubborn person, and she wouldn’t have listened to anyone who tried to help her overcome her addiction. Darlene then returns to the kitchen to find Aunt Jackie’s made an even bigger mess. Her reorganization efforts have come to a screeching halt. She just wanted to step in and pick up where her big sister left off, but she doesn’t know what to do with herself. She doesn’t know where anything belongs, and doesn’t quite feel like she belongs now that Roseanne is gone. Darlene gives her aunt a shoulder to cry on, then tells Jackie to go home and get some sleep.\n\nThe next morning, the entire family’s once again gathered in the kitchen. Jackie’s patting herself on the back for the newly established “flow,” while Darlene, Becky and D.J. are bickering, just like old times. Everyone then sits down to the breakfast, which transitions into the new opening title sequence. It’s very much like the old one (the accompanying theme song is nearly identical), only now we close on a shot of Darlene laughing as Dan sneaks a breakfast sausage.\n\nAfter the final commercial break, we see Dan get ready for bed. It’s the first time he’s slept in his room since Roseanne’s passing, and the pillows next to him are still bunched up from the night he found her. He fixes them, then puts his arm around Roseanne’s pillow as if she’s still there.\n\nLast but not least is Mark, who’s at the center of the premiere’s B-story. After his new friends Enrique and Joey leave, Mark asks Dan for his advice. He has crushes on both Enrique and Joey, but doesn’t know who to sit next to on the bus during an upcoming field trip. Dan’s initially uncomfortable, but ultimately helps Mark come to a decision by episode’s end, sitting his grandson down to make a pros and cons list for each boy.\n\nWhat did you think of The Conners premiere? Regardless of your feelings about Roseanne Barr and her firing, do you think the spinoff ultimately did justice to the character of Roseanne Conner? Hit the comments with your reactions! (Looking for our next recap? Read about Episode 2 here.)\n\n—", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://pmctvline2.files.wordpress.com/2018/10/becky-darlene-the-conners-season-1-episode-1.jpg?w=300&h=203", "https://pmctvline2.files.wordpress.com/2019/06/lucifer-season-4-episode-4.jpg?w=620", "https://pmctvline2.files.wordpress.com/2018/10/beverly-the-conners-season-1-episode-1.jpg?w=300&h=203", "https://pmctvline2.files.wordpress.com/2018/10/roseanne-dead-the-conners-season-1-episode-1.jpg?w=620&h=420&crop=1", "https://pmctvline2.files.wordpress.com/2020/04/macgyver-spoilers-mac-riley-desi.jpg?w=620", "https://pmcdeadline2.files.wordpress.com/2019/12/writers-guild-of-america-logo-wga.jpg?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2020/03/dw-2.jpg?w=280", "https://pmctvline2.files.wordpress.com/2018/10/roseanne-dead-the-conners-season-1-episode-1.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/too-hot-to-handle-recap.jpg?w=620", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcspy.files.wordpress.com/2020/04/81qjuhuijrl._ac_sl1500_.jpg?resize=180%2C101", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=tvline.com&path=%2F2018%2F10%2F16%2Froseanne-dead-the-conners-recap-season-1-episode-1-premiere%2F&ct=article&lob=tvline&loc=us&env=desktop&post_id=990283&comment_count=125", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/amy-schumer-quarantine-shutterstock-ftr.jpg?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2018/10/mary-steenburgen-the-conners-season-1-episode-1.jpg?w=240&h=300", "https://pmctvline2.files.wordpress.com/2020/04/potw-5.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/drag-race-recap-2.jpg?w=620", "https://pmctvline2.files.wordpress.com/2018/09/the-conners-season-1-episode-9-featured.jpg?w=620&h=430", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://pixel.wp.com/b.gif?v=noscript", "https://boygeniusreport.files.wordpress.com/2020/04/webp.net-resizeimage-16.jpg?quality=98&strip=all&resize=180%2C101", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2020/03/simpsons-group.jpg?resize=180%2C101&ssl=1"], "top_img": "https://pmctvline2.files.wordpress.com/2018/10/roseanne-dead-the-conners-season-1-episode-1.jpg?w=620", "keywords": [], "authors": ["Ryan Schwartz"], "canonical_link": "https://tvline.com/2018/10/16/roseanne-dead-the-conners-recap-season-1-episode-1-premiere/", "title": "The Conners Premiere Recap: Roseanne's Tragic Fate Revealed", "meta_data": {"viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "yes", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "Is Roseanne dead on 'The Conners'? Read TVLine's recap of Season 1, Episode 1, then grade the premiere.", "news_keywords": "ABC, Roseanne, Roseanne Barr, The Conners", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress.com", "og": {"type": "article", "title": "The Conners Premiere Recap: Roseanne's Tragic Fate Revealed", "url": "https://tvline.com/2018/10/16/roseanne-dead-the-conners-recap-season-1-episode-1-premiere/", "description": "ABC on Tuesday launched The Conners, a spinoff (so to speak) of the short-lived Roseanne revival, which was torpedoed when… you know. So how did the highly anticipated continuation address th…", "site_name": "TVLine", "image": {"identifier": "https://pmctvline2.files.wordpress.com/2018/10/roseanne-dead-the-conners-season-1-episode-1.jpg?w=620", "width": 620, "height": 420, "alt": "roseanne dead the conners season 1 episode 1"}, "locale": "en_US"}, "article": {"published_time": "2018-10-17T00:28:08+00:00", "modified_time": "2018-10-31T01:29:31+00:00"}, "twitter": {"site": "@TVLine", "text": {"title": "<i>The Conners</i> Premiere Recap: Roseanne's Tragic Fate Revealed"}, "image": {"identifier": "https://pmctvline2.files.wordpress.com/2018/10/roseanne-dead-the-conners-season-1-episode-1.jpg?w=620", "alt": "roseanne dead the conners season 1 episode 1"}, "card": "summary_large_image", "creator": "@RyanSchwartz", "title": "The Conners Premiere Recap: Roseanne's Tragic Fate Revealed", "description": "Is Roseanne dead on 'The Conners'? Read TVLine's recap of Season 1, Episode 1, then grade the premiere."}, "author": "Ryan Schwartz", "content_type": "Article", "post_id": 990283, "title": "<i>The Conners</i> Premiere Recap: Roseanne's Tragic Fate Revealed", "published_at": "2018-10-16 17:28:08", "image": "https://pmctvline2.files.wordpress.com/2018/10/roseanne-dead-the-conners-season-1-episode-1.jpg?w=300&h=208&crop=1", "comment_count": 125, "tags": "The Conners", "topics": "Recaps", "body": "ABC on Tuesday launched The Conners, a spinoff (so to speak) of the short-lived Roseanne revival, which was torpedoed when... you know. So how did the highly anticipated continuation address the elephant in the room? Read on to find out...\r\n\r\nThe premiere picks up fewer than three months after the events of the revival, and just three weeks after the death of Roseanne Conner. The family is gathered in the kitchen, still in mourning after Roseanne's supposed heart attack. We're told she died in her sleep, and Dan's been sleeping on the couch ever since. Bev mentions that a mother should never have to bury one of her children, while Jackie, who just can't help herself, tells her still-thriving, 92-year-old mother that she'll likely stick around long enough to bury the entire family, before she's buried by a robot. Amid the discussion, D.J. enters with his wife Geena (new series regular Maya Lynne Robinson), who's home from Afghanistan on a five-day leave.\r\n\r\nShortly thereafter, Jackie receives a phone call from the coroner's office and asks Dan if they can speak in private. She reveals that Roseanne didn't die of a heart attack: She overdosed on opioids. Dan is gobsmacked, believing Roseanne stopped taking prescription pain killers following her successful knee surgery. Becky and Darlene join Dad and Aunt Jackie outside to discuss the not-so-shocking coroner's report, at which point Becky reveals that she found a pill bottle prescribed to a Marcy Bellinger in Roseanne's closet. (If the name sounds familiar, it's because Dan previously found pills belonging to Marcy when he confronted Roseanne about her addiction in the revival's second-to-last episode). Dan confiscates the pills and heads back inside, then Becky says, \"That was the only thing from Mom's closet that I wanted.\"\r\n\r\nThe next day, Becky and Darlene are dealing with Dan and Roseanne's many past-due bills. They consider using Mom's death as an excuse, then remember that Roseanne has already used a death in the family as an excuse far too many times. The sisters share a chuckle, then Darlene asks if they're horrible people for laughing. \"Well, I'm tired of crying,\" Becky says, and laughing inappropriately is what Mom taught them to do. Becky then gets up to go to work. When Darlene asks when she'll back to help with business, Becky says she has no time. Not only is she working, but she's dating again. She defends her selfishness, saying she already went through all of this when Mark died, and can't bear to go through it again. She tells her younger sister that she's the obvious choice to take over for Mom, since she already lives there and has the whole \"scary tyrant\" thing down.\r\n\r\nHarris walks in and witnesses the sisters fighting. She insists they stop so one of them doesn't come to regret what they say should the other suddenly die. It's then revealed that Harris is riddled with guilt since she and Granny Rose always fought. Darlene assures her daughter that all families bicker, and Roseanne knew that her granddaughter loved her. Becky leaves, and Darlene and Harris head into the living room to find Jackie steam-cleaning the couch. Within seconds, Becky walks back in to apologize to Darlene... and to ask for a ride to work.\r\n\r\nAfterwards, Dan and Chuck are having drinks at the restaurant. Darlene enters and confronts him about a poster board taped to his truck, calling out Marcy for killing his wife. She tells Dad he needs to remove the poster board, but Dan says he needs to do this to keep from driving his car through Marcy's house.\r\n\r\nLater that night, Dan returns home and watches a movie with D.J., Geena, Becky and Bev, while Darlene's busy paying the bills. Geena accompanies Darlene when she heads into the kitchen, where Jackie's keeping herself busy by working on a system for better flow to the coffeemaker. Geena suggests Jackie's had enough caffeine, while Darlene tells her aunt to go home and get some sleep. She then opens a kitchen drawer to find more of Roseanne's pills. Jackie reveals she found them in Roseanne's icepack, and was hiding them because she knew they'd upset Darlene.\r\n\r\nWe then cut back to the living room. There's a knock at the door, and it's none other than Marcy (played by Last Man on Earth survivor Mary Steenburgen). Dan goes outside and shuts the door behind him, telling Marcy she's got a lot of nerve for showing up here. Marcy wants him to remove the sign from his car, because everyone already hates her. She explains that folks in Lanford traded meds because no one's insurance covered everything they needed. Roseanne called her complaining about her knee, saying she needed painkillers if she was ever going to return to work. If she'd known Roseanne had a substance abuse issue, she says, she wouldn't have given her the pills. She apologizes, then walks away once Darlene steps outside and tells Dan that they've found additional pills prescribed to people other than Marcy. Dan feels bad and asks Darlene to drive Marcy home, then breaks down in tears.\r\n\r\nThe following afternoon, Darlene visits her father out in the garage. Dan tells her that he's most upset that he no longer has anyone to blame for his wife's death. He also admits that his wife could be a very stubborn person, and she wouldn't have listened to anyone who tried to help her overcome her addiction. Darlene then returns to the kitchen to find Aunt Jackie's made an even bigger mess. Her reorganization efforts have come to a screeching halt. She just wanted to step in and pick up where her big sister left off, but she doesn't know what to do with herself. She doesn't know where anything belongs, and doesn't quite feel like she belongs now that Roseanne is gone. Darlene gives her aunt a shoulder to cry on, then tells Jackie to go home and get some sleep.\r\n\r\nThe next morning, the entire family's once again gathered in the kitchen. Jackie's patting herself on the back for the newly established \"flow,\" while Darlene, Becky and D.J. are bickering, just like old times. Everyone then sits down to the breakfast, which transitions into the new opening title sequence. It's very much like the old one (the accompanying theme song is nearly identical), only now we close on a shot of Darlene laughing as Dan sneaks a breakfast sausage.\r\n\r\nAfter the final commercial break, we see Dan get ready for bed. It's the first time he's slept in his room since Roseanne's passing, and the pillows next to him are still bunched up from the night he found her. He fixes them, then puts his arm around Roseanne's pillow as if she's still there.\r\n\r\n\r\n\r\nLast but not least is Mark, who's at the center of the premiere's B-story. After his new friends Enrique and Joey leave, Mark asks Dan for his advice. He has crushes on both Enrique and Joey, but doesn't know who to sit next to on the bus during an upcoming field trip. Dan's initially uncomfortable, but ultimately helps Mark come to a decision by episode's end, sitting his grandson down to make a pros and cons list for each boy.\r\n\r\nWhat did you think of The Conners premiere? Regardless of your feelings about Roseanne Barr and her firing, do you think the spinoff ultimately did justice to the character of Roseanne Conner? Hit the comments with your reactions! (Looking for our next recap? Read about Episode 2 here.)\r\n\r\n\r\n--", "fb": {"pages": 187516444593639, "page_id": 187516444593639}, "application-name": "TVLine", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "TV News, Previews, Spoilers, Casting Scoop, Interviews", "msapplication-task": "name=Subscribe;action-uri=https://tvline.com/feed/;icon-uri=https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "msapplication-TileImage": "https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1539619200.0, "source": "https://tvline.com", "summary": ""}