{"url": "en.wikipedia.org/wiki/Joel_Madden", "text": "Not to be confused with Joe Maddon\n\nJoel Rueben Madden (né Combs; March 11, 1979) is the lead vocalist for the American pop punk band Good Charlotte, as well as a record producer, actor, DJ, and UNICEF Goodwill Ambassador. He is also part of the pop rock collaboration The Madden Brothers with his identical twin brother Benji Madden.\n\nEarly life [ edit ]\n\nMadden was born Joel Rueben Combs in Waldorf, Maryland, the son of Robin Madden and Roger Combs.[1] He has an identical twin, Benji Madden, who plays guitar and sings backing vocals in their band, Good Charlotte. He also has an older brother named Josh Madden who also works in the music industry, and a younger sister named Sarah Madden.[1] Madden attended La Plata High School.\n\nCareer [ edit ]\n\nGood Charlotte [ edit ]\n\nIn 1995, at the age of 16, Joel Madden, his brother Benji, and a friend started their own band. The band was short-lived and the Maddens eventually recruited fellow high schoolers Paul Thomas, Aaron Escolopio, and Billy Martin to form their current band Good Charlotte. They took the name Good Charlotte from the children's book, Good Charlotte: Girls of the Good Day Orphanage, by Carol Beach York.[2]\n\nOther projects [ edit ]\n\nIn the 2001 film Not Another Teen Movie, Joel and the other Good Charlotte members made a cameo as the band at the school's prom. He later had a cameo role in the 2004 film Fat Albert and in the 2006 film Material Girls with his brother Benji. He also had a guest appearance in the hit Nickelodeon musical comedy series The Naked Brothers Band, in which he joined the band for a performance.\n\nMadden started a clothing line called MADE Clothing along with his brothers Benji and Josh. The line is now defunct. In early 2006 MADE Clothing became DCMA Collective. The line is owned by Joel, his brothers Benji Madden, Josh Madden, and friend Tal Cooperman. The Madden brothers also front a production team called Dead Executives.\n\nIn November 2007, Nicole Richie and Madden created The Richie Madden Children's Foundation. The charity will create and promote an online registry to inspire the purchases of items for moms and their families in need.[3] He is also a UNICEF Goodwill Ambassador. In 2010, with his brother, Madden contributed to \"We Are the World 25 for Haiti,\" a remake of the song \"We Are the World\" by USA for Africa, written by Michael Jackson and Lionel Richie.\n\nOn November 23, 2011, Madden was confirmed as one of the four vocal coaches in the first season of the Australian version of the reality singing competition The Voice.[4] His brother, Benji Madden was later his mentor on the show. Joel continued on as a coach in seasons two and three with Benji joining Joel as a coach on season 4 in 2015. Because of his commitments to The Voice Australia, he relocated to Sydney.\n\nJoel is featured in Blood on the Dance Floor's fifth studio album on the track \"Incomplete and All Alone\" released on June 19, 2012. The track was available for free download with pre-orders of the album.[5]\n\nIn 2012, he joined the 11th annual Independent Music Awards judging panel to assist independent musicians' careers.[6]\n\nIn 2013, he also provided songwriting and production assistance to the Australian band 5 Seconds of Summer on their first album. He has also helped write songs with them again for their later album Sounds Good Feels Good.\n\nJoel featured in Alex Kunnari & Heikki L's single \"City of Sin\", released on July 12, 2013.[7]\n\nJoel is now in a pop rock duo with his brother Benji called The Madden Brothers. They released the record \"Greetings from California\" on September 16, 2014. The album title Greetings from California comes from a conversation that the brothers had over breakfast one morning where they were reminiscing over how far they had come since the days of making music in their bedrooms.[8]\n\nIn 2015, he appears as guest in the American TV series Empire.\n\nThe Voice Australia [ edit ]\n\nFrom the beginning of the show in 2012 to the end of the fifth season in 2016, Joel was a coach on The Voice Australia. He was also a coach with his brother Benji for The Voice Kids. In 2013, Joel won the Logie Award for Most Popular New Male Talent for his role as coach on the program.\n\nPersonal life [ edit ]\n\nIn July 2004, a 25-year-old Madden began dating teen idol Hilary Duff when she was 16.[9] After a long period of tabloid speculation, Duff's mother Susan announced their relationship in a June 2005 interview for Seventeen magazine.[10] In November 2006, Madden and Duff broke up.[11]\n\nMadden started dating Nicole Richie in December 2006.[12] They have two children: daughter Harlow Winter Kate Madden (born January 11, 2008)[13] and son Sparrow James Midnight Madden (born September 9, 2009).[14] The couple confirmed their engagement in February 2010,[15] and married on December 11, 2010. Joel's brother Benji is married to actress Cameron Diaz.[16] Madden has residences in both Los Angeles and Sydney.\n\nMadden has a trademark habit of chewing toothpicks[17] to help reduce the number of cigarettes he smokes a day.[18]\n\nGrowing up in Maryland, Madden and his brother became big fans of the Baltimore Orioles and the Washington Redskins.[citation needed]\n\nDiscography [ edit ]\n\nWith Good Charlotte [ edit ]\n\nWith The Madden Brothers [ edit ]\n\nGuest appearances [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/GoodcharlotteinKL.JPG/220px-GoodcharlotteinKL.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg/1200px-20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Nicole_Richie_and_Joel_Madden_%40_2010_Academy_Awards.jpg/220px-Nicole_Richie_and_Joel_Madden_%40_2010_Academy_Awards.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg/220px-20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg/1200px-20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Joel_Madden", "title": "Joel Madden", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg/1200px-20170615-126-Nova_Rock_2017-Good_Charlotte-Joel_Madden.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}