{"url": "https://people.com/music/kelly-cutrone-accuses-russell-simmons-of-trying-to-rape-her-he-threw-me-down-on-the-floor/", "text": "Famed fashion publicist Kelly Cutrone is the latest woman to come forward with allegations of sexual misconduct against Russell Simmons.\n\nOn Thursday, Cutrone, who starred in reality shows The Hills and America’s Next Top Model, told the New York Post‘s Page Six that Simmons attempted to rape her in 1991 in his apartment. The alleged attack occurred when she was 26-years-old and he was 34.\n\nGet push notifications with news, features and more.\n\n“He pushed me into his apartment and then he threw me down on the floor and literally tried to grab… take my clothes off of me,” she told Page Six.\n\n“And I started kicking him really, really hard, screaming, telling him to get the f— off of me. And that I would have him killed if he ever f—ing laid a hand on me,” she recalled, adding that the idea of going to the police felt “overwhelming” at the time.\n\nImage zoom Kelly Cutrone; Russell Simmons Jim Spellman/WireImage; Vivien Killilea/Getty\n\nCutrone later posted a picture of herself and the music mogul on social media and captioned the image “#MeToo #YesYou.”\n\nRepresentatives for the publicist and Simmons did not immediately respond to PEOPLE’s request for comment.\n\nCutrone’s allegations come one day after reports in The Hollywood Reporter, New York Times and Los Angeles Times revealed new claims of sexual assault against the father of three.\n\nIn a statement to PEOPLE, Simmons, 60, “vehemently” denies all the allegations, saying that all his “relations have been consensual” and the “horrific accusations have shocked me to my core.”\n\n“I am blessed to have shared extraordinary relationships, whether through work or love, with many great women; and I have enormous respect for the women’s movement worldwide and their struggle for respect, dignity, equality and power. I am devastated by any reason I may have given to anyone to say or think of me in the ways that are currently being described. In recent weeks, some former business, creative and romantic partners have aired grievances as claims I categorically reject. In some of these instances, financial motives and direct contradictory witness testimony has been supplied to the media, which has been completely left out of stories. In the last few days, one woman attempted to extort me for $500,000 only to recant her ridiculous claim. The current allegations sent to me by the New York Times and Los Angeles Times range from the patently untrue to the frivolous and hurtful. The presumption of innocent until proven guilty must not be replaced by ‘Guilty by Accusation,’” he continues in the statement.\n\n“I have already apologized for the instances of thoughtlessness in my consensual relations. I have separated myself from my businesses and charities in order to not become a distraction. I have re-dedicated myself to spiritual learning, healing and working on behalf of the communities to which I have devoted my life. I have accepted that I can and should get dirt on my sleeves if it means witnessing the birth of a new consciousness about women. What I will not accept is responsibility for what I have not done. I have conducted my life with a message of peace and love. Although I have been candid about how I have lived in books and interviews detailing my flaws, I will relentlessly fight against any untruthful character assassination that paints me as a man of violence,” he concludes.\n\nRELATED: Model Recalls ‘Terrifying’ Alleged Russell Simmons Sexual Assault – as Mogul Says He’s ‘Still Evolving’\n\nWith Cutrone’s claims, at least 13 women have accused Simmons of sexual misconduct and harassment.\n\nThe accusations span more than three decades, from inappropriate behavior in business meetings to attempted assault in a women’s restroom in New York City during a night of partying to rape at his apartment.\n\nOn Thursday, the New York Police Department opened an investigation of Simmons following the over dozen accusations — seven of which allegedly occurred in New York City.\n\nEarlier this month, Simmons announced he was stepping down from his businesses amid multiple allegations of sexual misconduct. He added that he was stepping down from the companies he founded because he doesn’t want to be a “distraction.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkelly-cutrone-russell-simmons.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkelly-cutrone-russell-simmons.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkelly-cutrone-russell-simmons.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/music/kelly-cutrone-accuses-russell-simmons-of-trying-to-rape-her-he-threw-me-down-on-the-floor/", "title": "Kelly Cutrone Accuses Russell Simmons of Attempted Rape", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "News,Russell Simmons,Sexual Assault,Style,Style News", "news_keywords": "News,Russell Simmons,Sexual Assault,Style,Style News", "description": "Kelly Cutrone claims Russell Simmons tried to rape her in 1991 in his apartment", "og": {"title": "Kelly Cutrone Accuses Russell Simmons of Attempted Rape", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/kelly-cutrone-accuses-russell-simmons-of-trying-to-rape-her-he-threw-me-down-on-the-floor/", "description": "Famed fashion publicist Kelly Cutrone is the latest woman to come forward with allegations of&nbsp;sexual misconduct&nbsp;against Russell Simmons. On Thursday, Cutrone, who starred in reality&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkelly-cutrone-russell-simmons.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://people.com/music/kelly-cutrone-accuses-russell-simmons-of-trying-to-rape-her-he-threw-me-down-on-the-floor/", "description": "Kelly Cutrone claims Russell Simmons tried to rape her in 1991 in his apartment", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkelly-cutrone-russell-simmons.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/kelly-cutrone-accuses-russell-simmons-of-trying-to-rape-her-he-threw-me-down-on-the-floor/", "title": "Kelly Cutrone Accuses Russell Simmons of Attempted Rape", "description": "Kelly Cutrone claims Russell Simmons tried to rape her in 1991 in his apartment", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkelly-cutrone-russell-simmons.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}