{"url": "https://www.hollywoodreporter.com/live-feed/oitnb-end-season-7-netflix-1153175", "text": "Orange Is the New Black is officially saying goodbye to Litchfield.\n\nThe forthcoming seventh season of the Jenji Kohan-created prison dramedy will be its last, Netflix announced Wednesday. The final episodes will debut in 2019.\n\n\"After seven seasons, it’s time to be released from prison. I will miss all the badass ladies of Litchfield and the incredible crew we’ve worked with. My heart is orange but fade to black,\" Kohan said Wednesday.\n\nOITNB was renewed for a seventh season when the Lionsgate-produced series received a three-season pickup ahead of season four back in 2016. The news that season seven will be the dramedy's last comes as little surprise given the bulk pickup — a first at the time for Netflix. Last year, amid mixed reviews of season five's three-day riot storyline, Kohan did not rule out as much when speaking to The New York Times. \"I haven’t made a final decision yet, but I’m leaning toward ending it after seven,\" she said, \"although the nature of the show is one that can go on and on because you can bring in new people.\" Kohan also said she thought she had a series ending in mind, though she wouldn't share it.\n\nAfter spending six years in the minimum and maximum security prisons of Litchfield Penitentiary, OITNB delivered a game-changing finale at the end of season six. The series set the stage for its final run when its central character, inmate Piper Chapman (Taylor Schilling), was released early. That allowed season seven to follow her life outside the show's central core of inmates for the first time since season one.\n\nBoth Schilling and co-star Laura Prepon (Alex) told The Hollywood Reporter that they were both already preparing for the end of the show. \"As an actor getting ready to say goodbye to a role that I’ve lived with for six years, it’s very poignant,\" Schilling said before heading back into production on season seven. \"It’s a very kind of surreal time. It’s as surreal as it was when the thing came out of the gate and was so powerful those first few seasons. It’s equally as surreal now to be ending it all.\"\n\nAdded Prepon, \"The endgame is there. As of now, season seven is our last season. So, the endgame is clear. ... I don't know if I can say that I'm prepared for the end, but I've been doing this for a long time and I know that there's always going to be more after that. It will just be different. Orange is its own special thing, just like That '70s Show was, and I'm so happy that I get to be a part of it.\"\n\n\"During production of season one, everyone involved with Orange Is the New Black felt like we knew a special secret we couldn't wait to share with the world,\" Netflix vp originals Cindy Holland said. \"Since then, we have laughed, cried, raged and roared with the women of Litchfield, and every moment spent with them felt like borrowed time — too good to last forever. We will be sad to say goodbye but we will definitely be going out on a high. We are grateful to Jenji Kohan and her groundbreaking vision; to her supremely talented team of writers and producers; and to a once-in-a-lifetime cast and crew for creating a truly special work of art that has inspired conversations and connected audiences around the world.\"\n\nThe announcement on Wednesday came with a video message from the cast.\n\nWarning: This may make you cry. The Final Season, 2019. #OITNB pic.twitter.com/bUp2yY0aoK — Orange Is the New... (@OITNB) October 17, 2018\n\nFor her part, showrunner Kohan will remain in business with Netflix, where she inked the streaming giant's first massive overall deal. Under the pact, she already executive produces awards darling GLOW. Kohan produced OITNB for Lionsgate TV, where she was under a longtime overall deal (and for whom she created the Showtime hit Weeds) before moving to Netflix. She next produces Lifetime's American Princess.\n\n\"Orange Is the New Black has profoundly impacted popular culture worldwide, and has played a prominent role in building Lionsgate into a platform-defining brand,\" said Lionsgate Television Group chairman Kevin Beggs. \"Thanks to the brilliance of Jenji Kohan, the mastery of the creative and production team, the transcendent cast, and our tremendous partnership with Netflix, the series has surpassed our expectations year after year. With great pride, we are working together to bring this landmark series to a triumphant, satisfying close with the upcoming seventh season.”\n\nFor Netflix, meanwhile, the decision to wrap up OITNB arrives as the streamer is saying farewell to House of Cards. The political drama launched Netflix into the scripted originals business, with OITNB following shortly afterward.\n\nOITNB, which is inspired by Piper Kerman's memoir of the same name, bowed to critical acclaim in 2013. The 16-time Emmy nominated dramedy received 12 nods for its first season, including a historic nomination for Laverne Cox, who become the first transgender person nominated for an Emmy. That year, the show won the Emmy for best comedy. The series has since nabbed three additional wins. After an Emmy rule change in 2015 classifying the series as a drama, OITNB became the first series to receive Emmy nominations in both the comedy and drama categories. Though the streamer does not release numbers, OITNB has became one of Netflix's most-watched original series.\n\nLesley Goldberg contributed to this report.", "images": ["https://cdn1.thr.com/sites/default/files/2018/08/taylor.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/11/netflix.png", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/12/bywcqq0k.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/08/taylor.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/09/orange_is_the_new_black_still_ok_-_h_2014.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/08/taylor.jpg", "keywords": [], "authors": ["Jackie Strause", "Jackie.Strause Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/oitnb-end-season-7-netflix-1153175", "title": "'Orange Is the New Black' to End With Season 7 on Netflix", "meta_data": {"viewport": "width=device-width", "description": "'Orange Is the New Black' is officially saying goodbye to Litchfield. The forthcoming seventh season of the Jenji Kohan-created series will be its last, Netflix announced Wednesday.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/oitnb-end-season-7-netflix-1153175", "domain": "https://www.hollywoodreporter.com/", "title": "'Orange Is the New Black' to End With Season 7 on Netflix", "description": "The dramedy, from Lionsgate Television, was widely expected to conclude with its forthcoming season, which will return in 2019.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/08/taylor.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Orange Is the New Black' to End With Season 7 on Netflix", "description": "The dramedy, from Lionsgate Television, was widely expected to conclude with its forthcoming season, which will return in 2019.", "url": "https://www.hollywoodreporter.com/live-feed/oitnb-end-season-7-netflix-1153175", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/08/taylor.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Orange Is the New Black' to End With Season 7 on Netflix", "sailthru.description": "The dramedy, from Lionsgate Television, was widely expected to conclude with its forthcoming season, which will return in 2019.", "sailthru.author": "Jackie Strause", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-10-17 14:02:54", "sailthru.tags": "Live Feed, Television, Netflix, Orange is the New Black"}, "movies": [], "publish_date": 1539756174.0, "source": "https://www.hollywoodreporter.com", "summary": ""}