{"url": "https://people.com/tv/dr-phil-show-denies-claims-drugs/", "text": "Image zoom Peter Kramer/NBC\n\nRepresentatives for The Dr. Phil Showare balking at allegations that the daytime talk show’s psychiatrist’s staff enabled guests with substance addictions to boost ratings.\n\nThe long-running television program, which is lead by Phil McGraw, came under fired Thursday when STAT and The Boston Globe published an exposé featuring claims from multiple guests — including former Survivor: China winner Todd Herzog, who struggled with alcohol abuse in the years after winning the show.\n\nGet push notifications with news, features and more.\n\nAmong Herzog’s claims included what he said was the real story behind his headline-making appearance on the program in 2013, in which McGraw said, “I’ve never talked to a guest who was closer to death.” As viewers saw, Herzog had to be carried onto set before his sit-down with the host because he was intoxicated (he registered a .263 blood alcohol content on the show and admitted he had drank an entire bottle of vodka).\n\nBut that bottle of vodka was provided for Herzog in his dressing room by Dr. Phil producers, Herzog claimed, despite the fact that he had detoxed for two days in a hotel paid for by producers and was sober when he arrived for his scheduled taping. He also alleged that he was given a Xanax to “calm his nerves” before filming.\n\nAnother bottle of vodka appeared in his dressing room during Herzog’s third appearance on Dr. Phil, Herzog alleged, though he said he did not drink it.\n\n“The Stat article does not fairly or accurately describe the methods of Dr. Phil, the TV show, or its mission to educate millions of viewers about drug and alcohol addiction. The show does not give drugs or alcohol to its guests and any suggestions to the contrary is errant nonsense,” a spokesperson for the program tells PEOPLE in a statement.\n\n“For the past 16 years, the Dr. Phil show has provided valuable information to viewers by telling compelling stories about people who are fighting the battle to overcome alcohol and drug addiction. Unfortunately, addicts often lash out at the very people who are trying the hardest to help them break the cycle of addiction. Although terribly unfortunate, this is an understandable part of the behavior of addicts on their journey to recovery. Deception, dishonesty and denial are hallmarks of addiction. It tears families apart and certainly creates levels of complexities when we produce these important shows. None of this will deter the Dr. Phil show from it’s commitment to continue to educate and inform the public about the worsening epidemic of addiction.”\n\nMartin Greenberg — the show’s director of professional affairs — described Herzog’s claims and others made by former guests and their families to STAT and The Boston Globe as “absolutely, unequivocally untrue.”\n\n“We do not do that with this guest or any other,” Greenberg told STAT of Herzog’s account, later adding, that Herzog was “medically supervised the entire time” by personnel from an unnamed treatment center during his taping schedule.\n\n(Steve Thomason, the executive director of the center Herzog attended in Texas, claims no one from that facility monitored Herzog in L.A., STAT and The Boston Globe report, explaining that doing so would violate their licenses).\n\n“Addicts are notorious for lying, deflecting and trivializing,” Greenberg added. “But, if they are at risk when they arrive, then they were at risk before they arrived. The only change is they are one step closer to getting help, typically help they could not have even come close to affording.”\n\nElsewhere in the report, families of former guests — like Marianne Smith (whose niece Jordan appeared on the show) and Joelle King-Parrish (whose pregnant daughter Kaitlin appeared on the show) claimed that producers encouraged them to go to Skid Row in Los Angeles to find drugs, which the King-Parrishs did. They also both claimed that the show did not provide any medical assistance as they awaited taping.\n\n“We could go on and talk about Jordan L. or ten others. Same reality. All had medical supervision,” Greenberg said in denial, adding that Kaitlin’s mother had allegedly “agreed to be 100 percent responsible for managing her daughter’s health and possible withdrawal” and the individual who filmed the Skid Row trip, “simply documented the natural behavior she observed, which would have occurred whether she was there or not.”\n\nNot all reports were bad, though. Some interviewed for the story praised McGraw and the show for getting them the help they need, like former heroin addict Niki Dietrich.\n\n“Few people contact us just to let us know how well things are going,” the show wrote in a statement to STAT and The Globe. “The fact you can ‘cherry pick’ three, or thirty, or three hundred guests for that matter, who seek to blame others for their plight or struggle in life, is not the least bit surprising.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fdr-phil-wp.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fdr-phil-wp.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fdr-phil-wp.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/dr-phil-show-denies-claims-drugs/", "title": "Dr. Phil Show Denies Claims That Guests Were Baited with Drugs and Alcohol to Boost Ratings", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "News,Phil McGraw,Survivor,The Dr. Phil Show,TV", "news_keywords": "News,Phil McGraw,Survivor,The Dr. Phil Show,TV", "description": "Reps for The Dr. Phil Show are balking back at allegations that the daytime talk show's psychiatrist's staff enabled guests with substance addictions to boost ratings", "og": {"title": "Dr. Phil Show Denies Claims That Guests Were Baited with Drugs and Alcohol to Boost Ratings", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/dr-phil-show-denies-claims-drugs/", "description": "Representatives for&nbsp;The Dr. Phil Showare balking at allegations that the daytime talk show’s&nbsp;psychiatrist’s staff enabled guests with substance addictions to boost ratings. The long-running television&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fdr-phil-wp.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/dr-phil-show-denies-claims-drugs/", "description": "Reps for The Dr. Phil Show are balking back at allegations that the daytime talk show's psychiatrist's staff enabled guests with substance addictions to boost ratings", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fdr-phil-wp.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/dr-phil-show-denies-claims-drugs/", "title": "Dr. Phil Show Denies Claims That Guests Were Baited with Drugs and Alcohol to Boost Ratings", "description": "Reps for The Dr. Phil Show are balking back at allegations that the daytime talk show's psychiatrist's staff enabled guests with substance addictions to boost ratings", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fdr-phil-wp.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/OYOD_MM6h1o"], "publish_date": null, "source": "https://people.com", "summary": ""}