{"url": "http://time.com/money/4958068/chip-joanna-gaines-net-worth-2017/", "text": "HGTV stars Chip Gaines and Joanna Gaines shocked the reality television world Tuesday when the Waco, Texas residents announced that their hit show Fixer Upper will end after season five.\n\nThat Fixer Upper is soon to be cancelled has fans wondering what’s next — and when you consider their wide-ranging business empire, named Magnolia, plus a couple of book deals, the Gaines’ net worth may come to mind.\n\nSo what exactly is the net worth of Chip and Joanna Gaines? According to CelebrityNetWorth.com, Chip and Joanna Gaines are each worth $8 million. A big chunk of their net worth obviously comes from Fixer Upper, which reportedly earns them $30,000 an episode from homeowners seeking renovations, plus an undisclosed fee from HGTV. But the Gaines’ have far more revenue sources adding to their net worth to boot.\n\nThe Magnolia umbrella includes Magnolia Homes, the couple’s renovation business; Magnolia Realty, a real estate agency selling homes throughout Texas in cities like Waco, Dallas, Fort Worth, Austin, Houston and San Antonio; Magnolia Silos, a boutique marketplace in Waco selling home decor and food truck-cuisine; the Magnolia Journal, a quarterly magazine that reportedly boasts 700,000 subscribers paying $20 a year; and last, but not least, the Magnolia House and soon-to-open Hillcrest Estate, luxury rental properties that fetch at least $600 a night.\n\nThat’s not to mention the Gaines’ book deals, which were likely lucrative given their celebrity status. The Magnolia Story, which arrived on shelves last October, was the bestselling book in the country, moving 121,000 copies in the first week, according to Publisher’s Weekly. Chip Gaines’ solo debut, Capital Gaines, is due out in October, and Joanna Gaines has a book of her own coming out in 2018.\n\nSo, in short: Chip and Joanna Gaines may seem like they’re walking away from a life of fame and fortune, but given their business empires, their net worth is likely doing just fine.\n\nCorrection: The original version of this story incorrectly described Chip and Joanna Gaines’ wealth. According to CelebrityNetWorth.com, they are each worth $8 million. They do not make $8 million a year.", "images": ["https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2017/09/chip-joanna-gaines-net-worth.jpg?quality=85", "http://time.com/img/navigation/subscribe-icon.svg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2017/09/chip-joanna-gaines-net-worth.jpg?quality=85", "keywords": [], "authors": ["Aric Jenkins"], "canonical_link": "https://money.com/chip-joanna-gaines-net-worth-2017/", "title": "Fixer Upper Is Ending. What Is Chip and Joanna Gaines' Net Worth?", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "joanna gaines net worth, chip gaines net worth, net worth of chip and joanna gaines, fixer upper cancelled, fixer upper joanna", "news_keywords": "joanna gaines net worth, chip gaines net worth, net worth of chip and joanna gaines, fixer upper cancelled, fixer upper joanna", "description": "Fixer Upper is being cancelled, but Chip and Joanna Gaines are doing just fine. Here's their net worth.", "og": {"title": "Fixer Upper Is Ending. What Is Chip and Joanna Gaines' Net Worth?", "type": "article", "site_name": "Money", "url": "https://money.com/chip-joanna-gaines-net-worth-2017/", "description": "The couple earns plenty of money in other ways", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2017/09/chip-joanna-gaines-net-worth.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/chip-joanna-gaines-net-worth-2017/", "description": "Fixer Upper is being cancelled, but Chip and Joanna Gaines are doing just fine. Here's their net worth.", "media": "https://moneydotcomvip.files.wordpress.com/2017/09/chip-joanna-gaines-net-worth.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/chip-joanna-gaines-net-worth-2017/", "title": "Fixer Upper Is Ending. What Is Chip and Joanna Gaines' Net Worth?", "description": "The couple earns plenty of money in other ways", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2017/09/chip-joanna-gaines-net-worth.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}