{"url": "www.bustle.com/p/are-katy-perry-the-weeknd-dating-the-two-got-dinner-immediately-set-off-rumors-5525361", "text": "Can music fans expect an amazing \"Starboy\"/\"Swish Swish\" mashup sometime soon? Katy Perry and The Weeknd recently had dinner together, according to multiple sources. But since the two singers are both currently single — with Perry's breakup from Orlando Bloom and The Weeknd recently splitting from Selena Gomez — could this dinner date be a sign of anything more than a friendship or a possible collaboration going on between the two?\n\nSources including Glamour UK and Vogue, reported that the two singers had a fashionable dinner date. According to The Sun's report, Perry and The Weeknd, aka Abel Tesfaye, dined together in West Hollywood and apparently had a great time with each other. They then reportedly went home separately. The Sun's report suggests that the date between the pair was romantic and not just a dinner between friends, but take that with a grain of salt. Not only are there are no details available from the singers themselves, but other publications are reporting that they simply got dinner, no romance involved.\n\nWhile many sources have reported on this dinner between Perry and The Weeknd, most outlets have yet to report anything regarding a potential relationship between the pair. Sorry to burst the bubble of any Katy Perry and The Weeknd shippers, but it's probably just a rumor that the two are dating — at least right now.\n\nChristopher Polk/Getty Images Entertainment/Getty Images\n\nThe Weeknd has found himself linked to a couple of different women after his breakup with Gomez, and it's not likely that he's actually dating every single person he'e seen with. On Nov. 11, Us Weekly reported that he was seen holding hands with Yovanna Ventura, who was previously linked to Justin Bieber, who is currently dating his ex-girlfriend (and The Weeknd's ex-girlfriend, for that matter) Gomez. According to an Us Weekly source, \"[The Weeknd] was trying to make it obvious that he was with someone. They were pretty affectionate and were together the whole night.\"\n\nThere were also reports that The Weeknd was back in contact with his ex-girlfriend Bella Hadid. Although they reportedly haven't gotten back together romantically, People reported on Nov. 17 that \"He is talking to Bella a lot and they've hung out too.\" The Weeknd and Hadid apparently \"still love each other\" and are seeing where things go with them, according to E!. It was also reported by Hollywood Life that he sent Hadid flowers before the Victoria's Secret Fashion Show \"with a sweet note\". The abundance of rumors surrounding The Weeknd's love life, show that romance rumors might be quick to catch-on whenever he's seen hanging out with anyone, as in the case with Perry.\n\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\n\nRomance rumors surrounding the \"Starboy\" singer have been abundant ever since he and fellow singer Gomez were reported to have broken up. According to E!, the two singers dated for 10 months before they called it quits in late October. The split was reportedly amicable and it had nothing to do with Gomez hanging out with her ex. A source said, \"The relationship was basically over before Justin Bieber and Selena hung out.\" It wasn't long after those two lovebirds' reunion hit the headlines. But, since it doesn't sound as though there wasn't any bad blood with that breakup, it's likely that The Weeknd is just focusing on doing his own thing.\n\nDoes his own thing involve Katy Perry? Probably not in a romantic way. Until the two singers confirm anything about a potential relationship, it's more likely that they are just two friends hanging out and possibly making some fans' pop dreams come true.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/4/ed906c28-a728-4e62-a5ca-6ee53b9f10cb-getty-1169491940.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2017/11/21/7059d97d-6223-45cf-ac2e-a390340748c5-screen-shot-2017-11-21-at-35037-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/11/21/7059d97d-6223-45cf-ac2e-a390340748c5-screen-shot-2017-11-21-at-35037-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/6/79121f92-d8b4-4332-ab4b-75f001e21b6b-getty-1199124896.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/21/cc8aa127-aed5-4030-a3d1-f05b8840c07f-getty-840129150.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/21/c85108a1-84ea-4faa-8da4-e21901e3d710-getty-527561776.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/7/e961f581-b7fe-48cc-a0fa-389ebd53c071-getty-1192972093.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/8feb9158-e1b8-420e-952c-a847f4994e90-getty-1187049088.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/11/21/7059d97d-6223-45cf-ac2e-a390340748c5-screen-shot-2017-11-21-at-35037-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/are-katy-perry-the-weeknd-dating-the-two-got-dinner-immediately-set-off-rumors-5525361", "title": "Are Katy Perry & The Weeknd Dating? The Two Got Dinner & Immediately Set Off Rumors", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/are-katy-perry-the-weeknd-dating-the-two-got-dinner-immediately-set-off-rumors-5525361", "type": "article", "title": "Katy Perry & The Weeknd Got Dinner & Immediately Set Off Dating Rumors, Of Course", "description": "Can music fans expect an amazing \"Starboy\"/\"Swish Swish\" mashup sometime soon? Katy Perry and The Weeknd recently had dinner together, according to multiple sources. But since the two singers are both currently single — with Perry's breakup from…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/11/21/7059d97d-6223-45cf-ac2e-a390340748c5-screen-shot-2017-11-21-at-35037-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Can music fans expect an amazing \"Starboy\"/\"Swish Swish\" mashup sometime soon? Katy Perry and The Weeknd recently had dinner together, according to multiple sources. But since the two singers are both currently single — with Perry's breakup from…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}