{"url": "http://triblive.com/politics/politicalheadlines/8147758-74/bush-terrorism-florida#axzz3XO3B7Cm9", "text": "Last Modified: Feb. 11, 2018\n\nAcceptance of the Terms of Service\n\nTribLIVE also is affiliated with third-party content providers, some of which feature our branding. This policy statement does not apply to those companies' websites. Information about the privacy policies of those websites and the companies operating such websites can be obtained from their individual websites. These websites include, without limitation:\n\nChanges to the Terms of Service\n\nAccessing the Website and Account Security\n\nIntellectual Property Rights\n\nYou may establish a hypertext link to this Website so long as the link does not state or imply any sponsorship of your site by TribLIVE.com or any affiliated newspapers or websites. However, you may not, without the prior written permission of TribLIVE.com, frame any of the content of the Website, or incorporate into another website or other service any intellectual property of TribLIVE.com, its parent or affiliate companies or its licensors.\n\nYour computer may temporarily store copies of such materials in RAM or any form of temporary or cached memory incidental to your accessing and viewing those materials.\n\nYou may store files that are automatically cached by your Web browser for display enhancement purposes.\n\nYou may print or download one copy of a reasonable number of pages of the Website for your own personal, non-commercial use and not for further reproduction, publication or distribution.\n\nIf we provide desktop, mobile or other applications for download, you may download a single copy to your computer or mobile device solely for your own personal, non-commercial use, provided you agree to be bound by our end user license agreement in effect at that time for such applications.\n\nIf we provide social media features with certain content, you may take such actions as are enabled by such features.\n\nYou must not:\n\nModify copies of any materials from this site.\n\nUse any illustrations, photographs, video or audio sequences or any graphics separately from the accompanying text.\n\nDelete or alter any copyright, trademark or other proprietary rights notices from copies of materials from this site.\n\nYou must not access or use for any commercial purposes any part of the Website or any services or materials available through the Website.\n\nTrademarks\n\nProhibited Uses\n\nIn any way that violates any applicable federal, state, local or international law or regulation (including, without limitation, any laws regarding the export of data or software to and from the US or other countries).\n\nFor the purpose of exploiting, harming or attempting to exploit or harm minors in any way by exposing them to inappropriate content, asking for personally identifiable information or otherwise.\n\nTo send, knowingly receive, upload, download, use or re-use any material which does not comply with the content standards set forth in these Terms of Service.\n\nTo transmit, or procure the sending of, any advertising or promotional material without our prior written consent, including any \"junk mail\", \"chain letter\" or \"spam\" or any other similar solicitation.\n\nTo impersonate or attempt to impersonate the Company, a Company employee, another user or any other person or entity (including, without limitation, by using e-mail addresses or screen names associated with any of the foregoing).\n\nTo engage in any other conduct that restricts or inhibits anyone's use or enjoyment of the Website, or which, as determined by us, may harm the Company or users of the Website or expose them to liability.\n\nAdditionally, you agree not to:\n\nUse the Website in any manner that could disable, overburden, damage, or impair the site or interfere with any other party's use of the Website, including their ability to engage in real time activities through the Website.\n\nUse any robot, spider or other automatic device, process or means to access the Website for any purpose, including monitoring or copying any of the material on the Website.\n\nUse any manual process to monitor or copy any of the material on the Website or for any other unauthorized purpose without our prior written consent.\n\nUse any device, software or routine that interferes with the proper working of the Website.\n\nIntroduce any viruses, Trojan horses, worms, logic bombs or other material which is malicious or technologically harmful.\n\nAttempt to gain unauthorized access to, interfere with, damage or disrupt any parts of the Website, the server on which the Website is stored, or any server, computer or database connected to the Website.\n\nAttack the Website via a denial-of-service attack or a distributed denial-of-service attack.\n\nOtherwise attempt to interfere with the proper working of the Website.\n\nUser Contributions\n\nMonitoring and Enforcement; Termination\n\nWe have the right to:\n\nRemove or refuse to post any User Contributions for any or no reason in our sole discretion.\n\nTake any action with respect to any User Contribution that we deem necessary or appropriate in our sole discretion, including if we believe that such User Contribution violates the Terms of Service, including the Content Standards, infringes any intellectual property right or other right of any person or entity, threatens the personal safety of users of the Website or the public or could create liability for the Company.\n\nDisclose your identity or other information about you to any third party who claims that material posted by you violates their rights, including their intellectual property rights or their right to privacy.\n\nTake appropriate legal action, including without limitation, referral to law enforcement, for any illegal or unauthorized use of the Website.\n\nTerminate or suspend your access to all or part of the Website for any reason or no reason, including without limitation, any violation of these Terms of Service.\n\nContent Standards\n\nContain any material which is defamatory, obscene, indecent, abusive, threatening, offensive, harassing, violent, hateful, inflammatory or otherwise objectionable.\n\nPromote sexually explicit or pornographic material, violence, or discrimination based on race, sex, religion, nationality, disability, sexual orientation or age.\n\nInfringe the Company's Intellectual Property Rights or any patent, trademark, trade secret, copyright or other intellectual property or other rights of any other person.\n\nViolate the legal rights (including the rights of publicity and privacy) of others or contain any material that could give rise to any civil or criminal liability under applicable laws or regulations or that otherwise may be in conflict with these Terms of Service and our Privacy Policy\n\nBe likely to deceive any person.\n\nPromote any illegal activity, or advocate, promote or assist any unlawful act.\n\nCause annoyance, inconvenience or needless anxiety or be likely to upset, embarrass, alarm or annoy any other person.\n\nImpersonate any person, or misrepresent your identity or affiliation with any person or organization.\n\nInvolve commercial activities or sales, such as contests, sweepstakes and other sales promotions, barter or advertising.\n\nGive the impression that they emanate from or are endorsed by us or any other person or entity, if this is not the case.\n\nCopyright Infringement\n\nReliance on Information Posted\n\nChanges to the Website\n\nInformation About You and Your Visits to the Website\n\nLinking to the Website and Social Media Features\n\nLink from your own or certain third-party websites to certain content on this Website\n\nSend e-mails or other communications with certain content, or links to certain content, on this Website.\n\nCause limited portions of content on this Website to be displayed or appear to be displayed on your own or certain third-party websites.\n\nEstablish a link from any website that is not owned by you.\n\nCause the Website or portions of it to be displayed, or appear to be displayed by, for example, framing, deep linking or in-line linking, on any other site.\n\nOtherwise take any action with respect to the materials on this Website that is inconsistent with any other provision of these Terms of Service.\n\nLinks from the Website\n\nGeographic Restrictions\n\nDisclaimer of Warranties\n\nLimitation on Liability\n\nIndemnification\n\nGoverning Law and Jurisdiction\n\nWaiver and Severability\n\nEntire Agreement\n\nPrivacy Policy\n\nIntroduction\n\nOn this Website.\n\nThrough social media.\n\nIn e-mail, text and other electronic messages between you and this Website.\n\nWhen you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy.\n\nIn other ways that we describe to you at the point of collection or otherwise with your consent.\n\nus offline or through any other means, including on any other website operated by Company or any third party (including our affiliates and subsidiaries); or\n\nany third party (including our affiliates and subsidiaries), including through any application or content (including advertising) that may link to or be accessible from or on the Website\n\nChildren Under the Age of 13\n\nInformation We Collect About You and How We Collect It\n\nby which you may be personally identified, such as name, postal address, e-mail address, telephone number, or any other identifier by which you may be contacted online or offline (\"personal information\");\n\nthat is about you but individually does not identify you, such as content preferences and frequency of readership; and/or\n\nabout your internet connection, the equipment you use to access our Website and usage details.\n\nDirectly from you when you provide it to us.\n\nAutomatically as you navigate through the Website. Information collected automatically may include without limitation usage details, IP addresses and information collected through cookies, web beacons and other tracking technologies.\n\nInformation You Provide to Us\n\nInformation that you provide by filling in forms on our Website. This includes information provided at the time of registering to use certain features of our Website or posting material. We may also ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with our Website.\n\nRecords and copies of your correspondence (including e-mail addresses), if you contact us or open an email from us.\n\nYour responses to polls, surveys or questions that we might ask you to complete.\n\nYour search queries on the Website.\n\nInformation We Collect Through Automatic Data Collection Technologies\n\nDetails of your visits to our Website, including traffic data, location data, logs and other communication data and the resources that you access and use on the Website.\n\nInformation about your identity.\n\nInformation about your computer and internet connection, including your IP address, operating system and browser type.\n\nEstimate our audience size and usage patterns.\n\nStore information about your preferences, allowing us to customize our Website according to your individual interests.\n\nSpeed up your searches.\n\nDetermine what products or services may be of interest to you.\n\nRecognize you when you return to our Website.\n\nCookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our Website. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Website.\n\nFlash Cookies. Certain features of our Website may use local stored objects (or Flash cookies) to collect and store information about your preferences and navigation to, from and on our Website. Flash cookies are not managed by the same browser settings as are used for browser cookies. For information about managing your privacy and security settings for Flash cookies, see Choices about How We Use and Disclose Your Information below.\n\nAny industry standard data and website information collection methodologies then in existence.\n\nHow We Use Your Information\n\nTo present our Website and its contents to you.\n\nTo provide you with information, products or services that you request from us.\n\nTo fulfill any other purpose for which you provide it.\n\nTo carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection.\n\nTo notify you about changes to our Website or any products or services we offer or provide through it.\n\nTo allow you to participate in interactive features on our Website.\n\nIn any other way we may describe when you provide the information.\n\nFor any purposes permitted under this policy or the Terms of Service.\n\nFor any other purpose with your consent.\n\nDisclosure of Your Information\n\nTo our subsidiaries and affiliates.\n\nTo contractors, service providers and other third parties we use to support our business and who are bound by contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them.\n\nTo a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of the Company's assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by the Company about our Website users is among the assets transferred.\n\nTo fulfill the purpose for which you provide it.\n\nFor any other purpose disclosed by us when you provide the information.\n\nWith your consent.\n\nTo comply with any court order, law or legal process, including to respond to any government or regulatory request.\n\nTo enforce or apply our Terms of Service and other agreements, including for billing and collection purposes.\n\nIf we believe disclosure is necessary or appropriate to protect the rights, property, or safety of the Company, other users of the Website, our customers or others.\n\nChoices About How We Use and Disclose Your Information\n\nTracking Technologies and Advertising. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. To learn how you can manage your Flash cookie settings, visit the Flash player settings page on Adobe's website. If you disable or refuse cookies, please note that some parts of this site may then be inaccessible or not function properly.\n\nAccessing and Correcting Your Information\n\nYour California Privacy Rights\n\nChanges to Our Privacy Policy\n\nContact Information\n\nThese terms of service are entered into by and between You and Trib Total Media, LLC. (\"Company\", \"we\" or \"us\"). The following terms and conditions (these \"Terms of Service\"), govern your access to and use of TribLIVE.com, including any content, functionality and services offered on or through TribLIVE.com and its Affiliated Websites (as defined below) (collectively, the \"Website\"), whether as a guest or a registered user. Please read the Terms of Service carefully before you start to use the Website. By using the Website, you accept and agree to be bound and abide by these Terms of Service and our Privacy Policy , as follows below. If you do not want to agree to these Terms of Service or the Privacy Policy , you must not access or use the Website. The following Terms of Service and Privacy Policy applies to TribLIVE and its affiliated websites (\"Affiliated Websites\") now in existence or hereinafter acquired, created or implemented, including, but not limited to:We may revise and update these Terms of Service from time to time in our sole discretion. All changes are effective immediately when we post them, and apply to all access to and use of the Website thereafter. Your continued use of the Website following the posting of revised Terms of Service means that you accept and agree to the changes. You are expected to check this page from time to time so you are aware of any changes, as they are binding on you.We reserve the right to withdraw or amend this Website, and any service or material we provide on the Website, in our sole discretion without notice. We will not be liable if for any reason all or any part of the Website is unavailable at any time or for any period. From time to time, we may restrict access to some parts of the Website, or the entire Website, to users, including registered users. You are responsible for (i) making all arrangements necessary for you to have access to the Website; and (ii) ensuring that all persons who access the Website through your internet connection are aware of these Terms of Service and comply with them. To access the Website or some of the resources it offers, you may be asked to provide certain registration details or other information personal to you. It is a condition of your use of the Website that all the information you provide on the Website is correct, current and complete. You agree that all information you provide to register with this Website or otherwise, including but not limited to through the use of any interactive features on the Website, is governed by our Privacy Policy , and you consent to all actions we take with respect to your information consistent with our Privacy Policy . If you choose, or are provided with, a user name, password or any other piece of information as part of our security procedures, you must treat such information as confidential, and you must not disclose it to any other person or entity. You also acknowledge that your account is personal to you and agree not to provide any other person with access to this Website or portions of it using your user name, password or other security information. You agree to notify us immediately of any unauthorized access to or use of your user name or password or any other breach of security. You also agree to ensure that you exit from your account at the end of each session. You should use particular caution when accessing your account from a public or shared computer so that others are not able to view or record your password or other personal information. We have the right to disable any user name, password or other identifier, whether chosen by you or provided by us, at any time if, in our sole and exclusive opinion, you have violated any provision of these Terms of Service. The Website and its entire contents, features and functionality (including but not limited to all information of any source, software, text, displays, images, video and audio, and the design, selection and arrangement thereof), are owned by the Company, its licensors or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret and other intellectual property or proprietary rights laws. The Company is and shall be, the sole and exclusive owner of all right, title, and interest throughout the world in and to all such patents, copyrights, trademarks, trade secrets, and other intellectual property rights (collectively \"Intellectual Property Rights\"). These Terms of Service permit you to use the Website for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store or transmit any of the material on our Website, except as follows:If you print, copy, modify, download or otherwise use or provide any other person with access to any part of the Website in breach of the Terms of Service, your right to use the Website will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. No right, title or interest in or to the Website or any content on the Website is transferred to you, and all rights not expressly granted are reserved by the Company. Any use of the Website not expressly permitted by these Terms of Service is a breach of these Terms of Service and may violate copyright, trademark and other laws.The Company name, TribLIVE, the Company and TribLIVE logos and all related names, logos, product and service names, designs and slogans are trademarks of the Company or its affiliates or licensors. You must not use such marks or any of the Company's registered or common law trademarks without the prior written permission of the Company. All other names, logos, product and service names, designs and slogans on this Website are the trademarks of their respective owners.You may use the Website only for lawful purposes and in accordance with these Terms of Service.The Website may contain comments sections to submissions and pages, message boards, chat rooms, personal web pages or profiles, forums, bulletin boards, surveys and other interactive features, such as our Feedback form, (collectively, \"Interactive Services\") that allow users to post, submit, publish, display or transmit to other users or other persons (hereinafter, \"post\") content or materials (collectively, \"User Contributions\") on or through the Website. All User Contributions must comply with the Content Standards set forth in these Terms of Service. Any User Contribution you post to the site will be considered non-confidential and non-proprietary. By providing any User Contribution on the Website, you grant us and our licensees, successors and assigns the right to use, reproduce, modify, perform, display, distribute and otherwise disclose to third parties any such material. You represent and warrant that (i) you own or control all rights in and to the User Contributions and have the right to grant the license granted above to us and our licensees, successors and assigns; and (ii) all of your User Contributions do and will comply with these Terms of Services. You understand and acknowledge that you are responsible for any User Contributions you submit or contribute, and you, not the Company, have fully responsibility for such content, including its legality, reliability, accuracy and appropriateness. We are not responsible, or liable to any third party, for the content or accuracy of any User Contributions posted by you or any other user of the Website.Without limiting the foregoing, we have the right to fully cooperate with any law enforcement authorities or court order requesting or directing us to disclose the identity or other information of anyone posting any materials on or through the Website. YOU WAIVE AND HOLD HARMLESS THE COMPANY AND ITS AFFILIATES, LICENSEES AND SERVICE PROVIDERS FROM ANY CLAIMS RESULTING FROM ANY ACTION TAKEN BY ANY OF THE FOREGOING PARTIES DURING OR AS A RESULT OF ITS INVESTIGATIONS AND FROM ANY ACTIONS TAKEN AS A CONSEQUENCE OF INVESTIGATIONS BY EITHER SUCH PARTIES OR LAW ENFORCEMENT AUTHORITIES. However, we do not undertake to review all material before it is posted on the Website, and cannot ensure prompt removal of objectionable material after it has been posted. Accordingly, we assume no liability for any action or inaction regarding transmissions, communications or content provided by any user or third party. We have no liability or responsibility to anyone for performance or nonperformance of the activities described in this section. These content standards apply to any and all User Contributions and use of Interactive Services. User Contributions must in their entirety comply with all applicable federal, state, local and international laws and regulations. Without limiting the foregoing, User Contributions must not:If you believe that any User Contributions violate your copyright, please see our Copyright Policy for instructions on sending us a notice of copyright infringement. It is the policy of the Company to terminate the user accounts of repeat infringers.The information presented on or through the Website is made available solely for general information purposes. We do not warrant the accuracy, completeness or usefulness of this information. Any reliance you place on such information is strictly at your own risk. We disclaim all liability and responsibility arising from any reliance placed on such materials by you or any other visitor to the Website, or by anyone who may be informed of any of its contents. This Website may include content provided by users and third parties, including materials provided by other users, bloggers and third-party licensors, syndicators, aggregators and/or reporting services. All statements and/or opinions expressed in these materials, and all articles and responses to questions and other content, other than the content provided by the Company, are solely the opinions and the responsibility of the person or entity providing those materials. These materials do not necessarily reflect the opinion of the Company. We are not responsible, or liable to you or any third party, for the content or accuracy of any materials provided by any third parties. We are in no way responsible for any information submitted by any user or third party, nor shall we be deemed to be endorsing any user or third party information submitted on the Website.We may update the content on this Website from time to time, but its content is not necessarily complete or up-to-date. Any of the content, information, or material on the Website may be out of date at any given time, and we are under no obligation to update such content, information, and material.All information we collect on this Website is subject to our Privacy Policy . By using the Website, you consent to all actions taken by us with respect to your information in compliance with the Privacy Policy You may link to our homepage, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it, but you must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part without our express written consent. This Website may provide certain social media features that enable you to:You may use these features solely as they are provided by us, and solely with respect to the content they are displayed with and otherwise in accordance with any additional terms and conditions we provide with respect to such features. Subject to the foregoing, you must not:If the Website contains links to other sites and resources provided by third parties, these links are provided for your convenience only. This includes links contained in advertisements, including banner advertisements and sponsored links. We have no control over the contents of those sites or resources, and accept no responsibility for them or for any loss or damage that may arise from your use of them. If you decide to access any of the third party websites linked to this Website, you do so entirely at your own risk and subject to the terms and conditions of use for such websites. Any links to third party websites or material shall not be deemed to be any endorsement of such material and website by us.The owner of the Website is based in the Commonwealth of Pennsylvania in the United States. We provide this Website for use only by persons located in the United States. We make no claims that the Website or any of its content is accessible or appropriate outside of the United States. Access to the Website may not be legal by certain persons or in certain countries. If you access the Website from outside the United States, you do so on your own initiative and are responsible for compliance with local laws.You understand that we cannot and do not guarantee or warrant that files available for downloading from the internet or the Website will be free of viruses or other destructive code. You are responsible for implementing sufficient procedures and checkpoints to satisfy your particular requirements for anti-virus protection and accuracy of data input and output, and for maintaining a means external to our site for any reconstruction of any lost data. WE WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY A DISTRIBUTED DENIAL-OF-SERVICE ATTACK, VIRUSES OR OTHER TECHNOLOGICALLY HARMFUL MATERIAL THAT MAY INFECT YOUR COMPUTER EQUIPMENT, COMPUTER PROGRAMS, DATA OR OTHER PROPRIETARY MATERIAL DUE TO YOUR USE OF THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR TO YOUR DOWNLOADING OF ANY MATERIAL POSTED ON IT, OR ON ANY WEBSITE LINKED TO IT. YOUR USE OF THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE IS AT YOUR OWN RISK. THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED. NEITHER THE COMPANY NOR ANY PERSON ASSOCIATED WITH THE COMPANY MAKES ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, QUALITY, ACCURACY OR AVAILABILITY OF THE WEBSITE. WITHOUT LIMITING THE FOREGOING, NEITHER THE COMPANY NOR ANYONE ASSOCIATED WITH THE COMPANY REPRESENTS OR WARRANTS THAT THE WEBSITE, ITS CONTENT OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL BE ACCURATE, RELIABLE, ERROR-FREE OR UNINTERRUPTED, THAT DEFECTS WILL BE CORRECTED, THAT OUR SITE OR THE SERVER THAT MAKES IT AVAILABLE ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS OR THAT THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL OTHERWISE MEET YOUR NEEDS OR EXPECTATIONS. THE COMPANY HEREBY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR PARTICULAR PURPOSE. THE FOREGOING DOES NOT AFFECT ANY WARRANTIES WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW.IN NO EVENT WILL THE COMPANY, ITS AFFILIATES OR THEIR LICENSORS, SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS OR DIRECTORS BE LIABLE FOR DAMAGES OF ANY KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR USE, OR INABILITY TO USE, THE WEBSITE, ANY WEBSITES LINKED TO IT, ANY CONTENT ON THE WEBSITE OR SUCH OTHER WEBSITES OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR SUCH OTHER WEBSITES, INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING BUT NOT LIMITED TO, PERSONAL INJURY, PAIN AND SUFFERING, EMOTIONAL DISTRESS, LOSS OF REVENUE, LOSS OF PROFITS, LOSS OF BUSINESS OR ANTICIPATED SAVINGS, LOSS OF USE, LOSS OF GOODWILL, LOSS OF DATA, AND WHETHER CAUSED BY TORT (INCLUDING NEGLIGENCE), BREACH OF CONTRACT OR OTHERWISE, EVEN IF FORESEEABLE. THE FOREGOING DOES NOT AFFECT ANY LIABILITY WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW.You agree to defend, indemnify and hold harmless the Company, its affiliates, licensors and service providers, and its and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors and assigns from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses or fees (including reasonable attorneys' fees) arising out of or relating to your violation of these Terms of Service or your use of the Website, including, but not limited to, your User Contributions, any use of the Website's content, services and products other than as expressly authorized in these Terms of Service or your use of any information obtained from the Website.All matters relating to the Website and these Terms of Service and any dispute or claim arising therefrom or related thereto (in each case, including non-contractual disputes or claims), shall be governed by and construed in accordance with the internal laws of the Commonwealth of Pennsylvania without giving effect to any choice or conflict of law provision or rule (whether of the Commonwealth of Pennsylvania or any other jurisdiction). Any legal suit, action or proceeding arising out of, or related to, these Terms of Service or the Website shall be instituted exclusively in the federal courts of the United States or the courts of the Commonwealth of Pennsylvania and County of Allegheny, although we retain the right to bring any suit, action or proceeding against you for breach of these Terms of Service in your country of residence or any other relevant country. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts.No waiver of by the Company of any term or condition set forth in these Terms of Service shall be deemed a further or continuing waiver of such term or condition or a waiver of any other term or condition, and any failure of the Company to assert a right or provision under these Terms of Service shall not constitute a waiver of such right or provision. If any provision of these Terms of Service is held by a court or other tribunal of competent jurisdiction to be invalid, illegal or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent such that the remaining provisions of the Terms of Service will continue in full force and effect.The Terms of Service and our Privacy Policy constitute the sole and entire agreement between you and Trib Total Media, LLC. with respect to the Website and supersede all prior and contemporaneous understandings, agreements, representations and warranties, both written and oral, with respect to the Website. Trib Total Media, LLC. and any and all of its affiliates, including 535 Media, LLC, (\"Company\" or \"We\") respect your privacy and are committed to protecting it through our compliance with this privacy policy (this \"policy\"). This policy describes the types of information we may collect from you or that you may provide when you visit the website TribLIVE.com (our \"Website\") and our practices for collecting, using, maintaining, protecting and disclosing that information. The privacy policy of your Site must clearly disclose to end users that you are using the Solution, and provide a link to the Privacy Policy. AppendAd will continue to collect Advertisement Data in respect of Advertisement Data so long as the Implementing Code is installed, even after termination of these Terms. As such, it is your sole responsibility to remove Implementing Code if you wish to cease AppendAd's collection and processing of the Advertisement Data. This policy is subject to and in addition to our Terms of Service . This policy applies to all information we collect:It does not apply to information collected by:Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using this Website, you agree to this Privacy Policy . This policy may change from time to time (see Changes to our Privacy Policy below). Your continued use of this Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates.Our Website is not intended for children under 13 years of age. No one under age 13 may provide any personal information to or on the Website. We do NOT knowingly collect personal information from children under 13. If you are under 13, do not provide any information on this Website or on or through any of its features/register on the Website, make any purchases through the Website, use any of the interactive or public comment features of this Website or provide any information about yourself to us, including your name, address, telephone number, e-mail address or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us at privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084.We collect several types of information from and about users of our Website, including information:We collect this information:The information we collect on or through our Website may include:You also may provide information to be published or displayed (hereinafter, \"posted\") on public areas of the Website, or transmitted to other users of the Website or third parties (collectively, \"User Contributions\"). Your User Contributions are posted on and transmitted to others at your own risk. Although we limit access to certain pages, please be aware that no security measures are perfect or impenetrable. Additionally, we cannot control the actions of other users of the Website with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons.As you navigate through and interact with our Website, we may use automatic data collection technologies to collect certain information about you, your equipment, browsing actions and patterns, including without limitation:The information we collect automatically is statistical data and may include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to improve our Website and to deliver a better and more personalized service, including by enabling us to:The technologies we use for this automatic data collection may include without limitation:We use information that we collect about you or that you provide to us, including any personal information:We may use the information we have collected from you to enable us to display advertisements to our advertisers' target audiences and to send emails, mailings or social media messaget to you about content, products or services. Even though we do not disclose your personal information for these purposes without your consent except as set forth herein, if you click on or otherwise interact with an advertisement, the advertiser may assume that you meet its target criteria.We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this Privacy Policy We may also disclose your personal information:We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information:We do not control third parties' collection or use of your information to serve interest-based advertising. However these third parties may provide you with ways to choose not to have your information collected or used in this way. You can opt out of receiving targeted ads from members of the Network Advertising Initiative (\"NAI\") on the NAI's website.You can review and change your personal information by logging into the Website and visiting your account profile page. If you delete your User Contributions from the Website, copies of your User Contributions may remain viewable in cached and archived pages, or might have been copied or stored by other Website users. Proper access and use of information provided on the Website, including User Contributions, is governed by our Terms of Service California \"Shine the Light\" law permits users of our Website that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084.We reserve the right to modify, amend, alter or change this policy at any time for any reason or no reason. It is our policy to post any changes we make to our Privacy Policy on this page. If we make material changes to how we treat our users' personal information, we will notify you through a notice on the Website home page. The date the Privacy Policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Website and this Privacy Policy to check for any changes.To ask questions or comment about this Privacy Policy and our privacy practices, contact us at: Email: privacy@tribweb.com U.S. Mail: TribLive, 210 Wood Street, Tarentum, PA 15084.", "images": ["https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/TribLIVELogo.jpg", "https://ttm-validate.onecount.net/onecount/oc_track/tracker_nojs.php?_ca=d1a46b1ede4b1aa2d878872edaa4f2210c7f1f01", "https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/total-media.png", "https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/TribLIVElogo.png", "https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/other/nnnicon.png"], "top_img": "https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/TribLIVELogo.jpg", "keywords": [], "authors": [], "canonical_link": "https://triblive.com/termsofservice/", "title": "Terms of Service", "meta_data": {"viewport": "width=device-width", "robots": "FOLLOW", "og": {"locale": "en_US", "type": "website", "site_name": "TribLIVE.com", "title": "Terms of Service", "url": "https://triblive.com/termsofservice/", "image": "https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/TribLIVELogo.jpg", "description": "Last Modified: Feb. 11, 2018 Acceptance of the Terms of Service These terms of service are entered into by and between You and Trib Total Media, LLC. (“Company”, “we” or “us”). The following terms and conditions (these “Terms of Service”), govern your access to and use of TribLIVE.com, including any content, functionality and services offered on or through TribLIVE.com and its Affiliated Websites (as defined below) (collectively, the “Website”), whether as a guest or a registered user. Please read the Terms of Service carefully before you start to use the Website. By using the Website, you accept and agree to be bound and abide by these Terms of Service and our Privacy Policy, as follows below. If you do not want to agree to these Terms of Service or the Privacy Policy, you must not access or use the Website. The following Terms of Service and Privacy Policy applies to TribLIVE and its affiliated websites (“Affiliated Websites”) now in existence or hereinafter acquired, created or implemented, including, but not limited to: TribLIVE.com PittsburghAutoSuperStore.com PittsburghPennySaver.com PghTrib.com Trib HSSN – Western PA’s High School Sports Source TribLIVE also is affiliated with third-party content providers, some of which feature our branding. This policy statement does not apply to those companies’ websites. Information about the privacy policies of those websites and the companies operating such websites can be obtained from their individual websites. These websites include, without limitation: AccuWeather Privacy Policy Terms of Service Ad Lightning Privacy Policy Terms of Service Adblade Privacy Policy Terms of Service Adiant Amazon Web Services Privacy Policy Terms of Service BounceX Privacy Policy Terms of Service CivicScience Privacy Policy Terms of Service Cloudflare Privacy Policy Terms of Service EVVNT Privacy Policy Terms of Service Facebook Privacy Policy Terms of Service FirstImpression.io Privacy Policy Terms of Service Flipp Privacy Policy Terms of Service Google Ad Manager Privacy Policy Terms of Service Google Analytics Privacy Policy Terms of Service Google Tag Manager Privacy Policy Terms of Service Hudl Privacy Policy Terms of Service JW Player Privacy Policy Terms of Service Legacy.com Privacy Policy Terms of Service NewsEngin Inc. ONECount Privacy Policy Terms of Service OwnLocal Origami Privacy Policy Terms of Service Sailthru Privacy Policy Terms of Service Sajari Privacy Policy Terms of Service Second Street Privacy Policy Terms of Service SendtoNews Privacy Policy Terms of Service SmartSource Privacy Policy Terms of Service Sports Network SportsManias.com Privacy Policy Terms of Service Transparensee Systems Type Network Privacy Policy Terms of Service Changes to the Terms of Service We may revise and update these Terms of Service from time to time in our sole discretion. All changes are effective immediately when we post them, and apply to all access to and use of the Website thereafter. Your continued use of the Website following the posting of revised Terms of Service means that you accept and agree to the changes. You are expected to check this page from time to time so you are aware of any changes, as they are binding on you. Accessing the Website and Account Security We reserve the right to withdraw or amend this Website, and any service or material we provide on the Website, in our sole discretion without notice. We will not be liable if for any reason all or any part of the Website is unavailable at any time or for any period. From time to time, we may restrict access to some parts of the Website, or the entire Website, to users, including registered users. You are responsible for (i) making all arrangements necessary for you to have access to the Website; and (ii) ensuring that all persons who access the Website through your internet connection are aware of these Terms of Service and comply with them. To access the Website or some of the resources it offers, you may be asked to provide certain registration details or other information personal to you. It is a condition of your use of the Website that all the information you provide on the Website is correct, current and complete. You agree that all information you provide to register with this Website or otherwise, including but not limited to through the use of any interactive features on the Website, is governed by our Privacy Policy, and you consent to all actions we take with respect to your information consistent with our Privacy Policy. If you choose, or are provided with, a user name, password or any other piece of information as part of our security procedures, you must treat such information as confidential, and you must not disclose it to any other person or entity. You also acknowledge that your account is personal to you and agree not to provide any other person with access to this Website or portions of it using your user name, password or other security information. You agree to notify us immediately of any unauthorized access to or use of your user name or password or any other breach of security. You also agree to ensure that you exit from your account at the end of each session. You should use particular caution when accessing your account from a public or shared computer so that others are not able to view or record your password or other personal information. We have the right to disable any user name, password or other identifier, whether chosen by you or provided by us, at any time if, in our sole and exclusive opinion, you have violated any provision of these Terms of Service. Intellectual Property Rights The Website and its entire contents, features and functionality (including but not limited to all information of any source, software, text, displays, images, video and audio, and the design, selection and arrangement thereof), are owned by the Company, its licensors or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret and other intellectual property or proprietary rights laws. The Company is and shall be, the sole and exclusive owner of all right, title, and interest throughout the world in and to all such patents, copyrights, trademarks, trade secrets, and other intellectual property rights (collectively “Intellectual Property Rights”). These Terms of Service permit you to use the Website for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store or transmit any of the material on our Website, except as follows: You may establish a hypertext link to this Website so long as the link does not state or imply any sponsorship of your site by TribLIVE.com or any affiliated newspapers or websites. However, you may not, without the prior written permission of TribLIVE.com, frame any of the content of the Website, or incorporate into another website or other service any intellectual property of TribLIVE.com, its parent or affiliate companies or its licensors. Your computer may temporarily store copies of such materials in RAM or any form of temporary or cached memory incidental to your accessing and viewing those materials. You may store files that are automatically cached by your Web browser for display enhancement purposes. You may print or download one copy of a reasonable number of pages of the Website for your own personal, non-commercial use and not for further reproduction, publication or distribution. If we provide desktop, mobile or other applications for download, you may download a single copy to your computer or mobile device solely for your own personal, non-commercial use, provided you agree to be bound by our end user license agreement in effect at that time for such applications. If we provide social media features with certain content, you may take such actions as are enabled by such features. You must not: Modify copies of any materials from this site. Use any illustrations, photographs, video or audio sequences or any graphics separately from the accompanying text. Delete or alter any copyright, trademark or other proprietary rights notices from copies of materials from this site. You must not access or use for any commercial purposes any part of the Website or any services or materials available through the Website. If you print, copy, modify, download or otherwise use or provide any other person with access to any part of the Website in breach of the Terms of Service, your right to use the Website will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. No right, title or interest in or to the Website or any content on the Website is transferred to you, and all rights not expressly granted are reserved by the Company. Any use of the Website not expressly permitted by these Terms of Service is a breach of these Terms of Service and may violate copyright, trademark and other laws. Trademarks The Company name, TribLIVE, the Company and TribLIVE logos and all related names, logos, product and service names, designs and slogans are trademarks of the Company or its affiliates or licensors. You must not use such marks or any of the Company’s registered or common law trademarks without the prior written permission of the Company. All other names, logos, product and service names, designs and slogans on this Website are the trademarks of their respective owners. Prohibited Uses You may use the Website only for lawful purposes and in accordance with these Terms of Service. You agree not to use the Website: In any way that violates any applicable federal, state, local or international law or regulation (including, without limitation, any laws regarding the export of data or software to and from the US or other countries). For the purpose of exploiting, harming or attempting to exploit or harm minors in any way by exposing them to inappropriate content, asking for personally identifiable information or otherwise. To send, knowingly receive, upload, download, use or re-use any material which does not comply with the content standards set forth in these Terms of Service. To transmit, or procure the sending of, any advertising or promotional material without our prior written consent, including any “junk mail”, “chain letter” or “spam” or any other similar solicitation. To impersonate or attempt to impersonate the Company, a Company employee, another user or any other person or entity (including, without limitation, by using e-mail addresses or screen names associated with any of the foregoing). To engage in any other conduct that restricts or inhibits anyone’s use or enjoyment of the Website, or which, as determined by us, may harm the Company or users of the Website or expose them to liability. Additionally, you agree not to: Use the Website in any manner that could disable, overburden, damage, or impair the site or interfere with any other party’s use of the Website, including their ability to engage in real time activities through the Website. Use any robot, spider or other automatic device, process or means to access the Website for any purpose, including monitoring or copying any of the material on the Website. Use any manual process to monitor or copy any of the material on the Website or for any other unauthorized purpose without our prior written consent. Use any device, software or routine that interferes with the proper working of the Website. Introduce any viruses, Trojan horses, worms, logic bombs or other material which is malicious or technologically harmful. Attempt to gain unauthorized access to, interfere with, damage or disrupt any parts of the Website, the server on which the Website is stored, or any server, computer or database connected to the Website. Attack the Website via a denial-of-service attack or a distributed denial-of-service attack. Otherwise attempt to interfere with the proper working of the Website. User Contributions The Website may contain comments sections to submissions and pages, message boards, chat rooms, personal web pages or profiles, forums, bulletin boards, surveys and other interactive features, such as our Feedback form, (collectively, “Interactive Services”) that allow users to post, submit, publish, display or transmit to other users or other persons (hereinafter, “post”) content or materials (collectively, “User Contributions”) on or through the Website. All User Contributions must comply with the Content Standards set forth in these Terms of Service. Any User Contribution you post to the site will be considered non-confidential and non-proprietary. By providing any User Contribution on the Website, you grant us and our licensees, successors and assigns the right to use, reproduce, modify, perform, display, distribute and otherwise disclose to third parties any such material. You represent and warrant that (i) you own or control all rights in and to the User Contributions and have the right to grant the license granted above to us and our licensees, successors and assigns; and (ii) all of your User Contributions do and will comply with these Terms of Services. You understand and acknowledge that you are responsible for any User Contributions you submit or contribute, and you, not the Company, have fully responsibility for such content, including its legality, reliability, accuracy and appropriateness. We are not responsible, or liable to any third party, for the content or accuracy of any User Contributions posted by you or any other user of the Website. Monitoring and Enforcement; Termination We have the right to: Remove or refuse to post any User Contributions for any or no reason in our sole discretion. Take any action with respect to any User Contribution that we deem necessary or appropriate in our sole discretion, including if we believe that such User Contribution violates the Terms of Service, including the Content Standards, infringes any intellectual property right or other right of any person or entity, threatens the personal safety of users of the Website or the public or could create liability for the Company. Disclose your identity or other information about you to any third party who claims that material posted by you violates their rights, including their intellectual property rights or their right to privacy. Take appropriate legal action, including without limitation, referral to law enforcement, for any illegal or unauthorized use of the Website. Terminate or suspend your access to all or part of the Website for any reason or no reason, including without limitation, any violation of these Terms of Service. Without limiting the foregoing, we have the right to fully cooperate with any law enforcement authorities or court order requesting or directing us to disclose the identity or other information of anyone posting any materials on or through the Website. YOU WAIVE AND HOLD HARMLESS THE COMPANY AND ITS AFFILIATES, LICENSEES AND SERVICE PROVIDERS FROM ANY CLAIMS RESULTING FROM ANY ACTION TAKEN BY ANY OF THE FOREGOING PARTIES DURING OR AS A RESULT OF ITS INVESTIGATIONS AND FROM ANY ACTIONS TAKEN AS A CONSEQUENCE OF INVESTIGATIONS BY EITHER SUCH PARTIES OR LAW ENFORCEMENT AUTHORITIES. However, we do not undertake to review all material before it is posted on the Website, and cannot ensure prompt removal of objectionable material after it has been posted. Accordingly, we assume no liability for any action or inaction regarding transmissions, communications or content provided by any user or third party. We have no liability or responsibility to anyone for performance or nonperformance of the activities described in this section. Content Standards These content standards apply to any and all User Contributions and use of Interactive Services. User Contributions must in their entirety comply with all applicable federal, state, local and international laws and regulations. Without limiting the foregoing, User Contributions must not: Contain any material which is defamatory, obscene, indecent, abusive, threatening, offensive, harassing, violent, hateful, inflammatory or otherwise objectionable. Promote sexually explicit or pornographic material, violence, or discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe the Company’s Intellectual Property Rights or any patent, trademark, trade secret, copyright or other intellectual property or other rights of any other person. Violate the legal rights (including the rights of publicity and privacy) of others or contain any material that could give rise to any civil or criminal liability under applicable laws or regulations or that otherwise may be in conflict with these Terms of Service and our Privacy Policy. Be likely to deceive any person. Promote any illegal activity, or advocate, promote or assist any unlawful act. Cause annoyance, inconvenience or needless anxiety or be likely to upset, embarrass, alarm or annoy any other person. Impersonate any person, or misrepresent your identity or affiliation with any person or organization. Involve commercial activities or sales, such as contests, sweepstakes and other sales promotions, barter or advertising. Give the impression that they emanate from or are endorsed by us or any other person or entity, if this is not the case. Copyright Infringement If you believe that any User Contributions violate your copyright, please see our Copyright Policy for instructions on sending us a notice of copyright infringement. It is the policy of the Company to terminate the user accounts of repeat infringers. Reliance on Information Posted The information presented on or through the Website is made available solely for general information purposes. We do not warrant the accuracy, completeness or usefulness of this information. Any reliance you place on such information is strictly at your own risk. We disclaim all liability and responsibility arising from any reliance placed on such materials by you or any other visitor to the Website, or by anyone who may be informed of any of its contents. This Website may include content provided by users and third parties, including materials provided by other users, bloggers and third-party licensors, syndicators, aggregators and/or reporting services. All statements and/or opinions expressed in these materials, and all articles and responses to questions and other content, other than the content provided by the Company, are solely the opinions and the responsibility of the person or entity providing those materials. These materials do not necessarily reflect the opinion of the Company. We are not responsible, or liable to you or any third party, for the content or accuracy of any materials provided by any third parties. We are in no way responsible for any information submitted by any user or third party, nor shall we be deemed to be endorsing any user or third party information submitted on the Website. Changes to the Website We may update the content on this Website from time to time, but its content is not necessarily complete or up-to-date. Any of the content, information, or material on the Website may be out of date at any given time, and we are under no obligation to update such content, information, and material. Information About You and Your Visits to the Website All information we collect on this Website is subject to our Privacy Policy. By using the Website, you consent to all actions taken by us with respect to your information in compliance with the Privacy Policy. Linking to the Website and Social Media Features You may link to our homepage, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it, but you must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part without our express written consent. This Website may provide certain social media features that enable you to: Link from your own or certain third-party websites to certain content on this Website Send e-mails or other communications with certain content, or links to certain content, on this Website. Cause limited portions of content on this Website to be displayed or appear to be displayed on your own or certain third-party websites. You may use these features solely as they are provided by us, and solely with respect to the content they are displayed with and otherwise in accordance with any additional terms and conditions we provide with respect to such features. Subject to the foregoing, you must not: Establish a link from any website that is not owned by you. Cause the Website or portions of it to be displayed, or appear to be displayed by, for example, framing, deep linking or in-line linking, on any other site. Otherwise take any action with respect to the materials on this Website that is inconsistent with any other provision of these Terms of Service. Links from the Website If the Website contains links to other sites and resources provided by third parties, these links are provided for your convenience only. This includes links contained in advertisements, including banner advertisements and sponsored links. We have no control over the contents of those sites or resources, and accept no responsibility for them or for any loss or damage that may arise from your use of them. If you decide to access any of the third party websites linked to this Website, you do so entirely at your own risk and subject to the terms and conditions of use for such websites. Any links to third party websites or material shall not be deemed to be any endorsement of such material and website by us. Geographic Restrictions The owner of the Website is based in the Commonwealth of Pennsylvania in the United States. We provide this Website for use only by persons located in the United States. We make no claims that the Website or any of its content is accessible or appropriate outside of the United States. Access to the Website may not be legal by certain persons or in certain countries. If you access the Website from outside the United States, you do so on your own initiative and are responsible for compliance with local laws. Disclaimer of Warranties You understand that we cannot and do not guarantee or warrant that files available for downloading from the internet or the Website will be free of viruses or other destructive code. You are responsible for implementing sufficient procedures and checkpoints to satisfy your particular requirements for anti-virus protection and accuracy of data input and output, and for maintaining a means external to our site for any reconstruction of any lost data. WE WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY A DISTRIBUTED DENIAL-OF-SERVICE ATTACK, VIRUSES OR OTHER TECHNOLOGICALLY HARMFUL MATERIAL THAT MAY INFECT YOUR COMPUTER EQUIPMENT, COMPUTER PROGRAMS, DATA OR OTHER PROPRIETARY MATERIAL DUE TO YOUR USE OF THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR TO YOUR DOWNLOADING OF ANY MATERIAL POSTED ON IT, OR ON ANY WEBSITE LINKED TO IT. YOUR USE OF THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE IS AT YOUR OWN RISK. THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE ARE PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS, WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED. NEITHER THE COMPANY NOR ANY PERSON ASSOCIATED WITH THE COMPANY MAKES ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, QUALITY, ACCURACY OR AVAILABILITY OF THE WEBSITE. WITHOUT LIMITING THE FOREGOING, NEITHER THE COMPANY NOR ANYONE ASSOCIATED WITH THE COMPANY REPRESENTS OR WARRANTS THAT THE WEBSITE, ITS CONTENT OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL BE ACCURATE, RELIABLE, ERROR-FREE OR UNINTERRUPTED, THAT DEFECTS WILL BE CORRECTED, THAT OUR SITE OR THE SERVER THAT MAKES IT AVAILABLE ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS OR THAT THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL OTHERWISE MEET YOUR NEEDS OR EXPECTATIONS. THE COMPANY HEREBY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR PARTICULAR PURPOSE. THE FOREGOING DOES NOT AFFECT ANY WARRANTIES WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Limitation on Liability IN NO EVENT WILL THE COMPANY, ITS AFFILIATES OR THEIR LICENSORS, SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS OR DIRECTORS BE LIABLE FOR DAMAGES OF ANY KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR USE, OR INABILITY TO USE, THE WEBSITE, ANY WEBSITES LINKED TO IT, ANY CONTENT ON THE WEBSITE OR SUCH OTHER WEBSITES OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR SUCH OTHER WEBSITES, INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING BUT NOT LIMITED TO, PERSONAL INJURY, PAIN AND SUFFERING, EMOTIONAL DISTRESS, LOSS OF REVENUE, LOSS OF PROFITS, LOSS OF BUSINESS OR ANTICIPATED SAVINGS, LOSS OF USE, LOSS OF GOODWILL, LOSS OF DATA, AND WHETHER CAUSED BY TORT (INCLUDING NEGLIGENCE), BREACH OF CONTRACT OR OTHERWISE, EVEN IF FORESEEABLE. THE FOREGOING DOES NOT AFFECT ANY LIABILITY WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Indemnification You agree to defend, indemnify and hold harmless the Company, its affiliates, licensors and service providers, and its and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors and assigns from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses or fees (including reasonable attorneys’ fees) arising out of or relating to your violation of these Terms of Service or your use of the Website, including, but not limited to, your User Contributions, any use of the Website’s content, services and products other than as expressly authorized in these Terms of Service or your use of any information obtained from the Website. Governing Law and Jurisdiction All matters relating to the Website and these Terms of Service and any dispute or claim arising therefrom or related thereto (in each case, including non-contractual disputes or claims), shall be governed by and construed in accordance with the internal laws of the Commonwealth of Pennsylvania without giving effect to any choice or conflict of law provision or rule (whether of the Commonwealth of Pennsylvania or any other jurisdiction). Any legal suit, action or proceeding arising out of, or related to, these Terms of Service or the Website shall be instituted exclusively in the federal courts of the United States or the courts of the Commonwealth of Pennsylvania and County of Allegheny, although we retain the right to bring any suit, action or proceeding against you for breach of these Terms of Service in your country of residence or any other relevant country. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts. Waiver and Severability No waiver of by the Company of any term or condition set forth in these Terms of Service shall be deemed a further or continuing waiver of such term or condition or a waiver of any other term or condition, and any failure of the Company to assert a right or provision under these Terms of Service shall not constitute a waiver of such right or provision. If any provision of these Terms of Service is held by a court or other tribunal of competent jurisdiction to be invalid, illegal or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent such that the remaining provisions of the Terms of Service will continue in full force and effect. Entire Agreement The Terms of Service and our Privacy Policy constitute the sole and entire agreement between you and Trib Total Media, LLC. with respect to the Website and supersede all prior and contemporaneous understandings, agreements, representations and warranties, both written and oral, with respect to the Website. Privacy Policy Introduction Trib Total Media, LLC. and any and all of its affiliates, including 535 Media, LLC, (“Company” or “We”) respect your privacy and are committed to protecting it through our compliance with this privacy policy (this “policy”). This policy describes the types of information we may collect from you or that you may provide when you visit the website TribLIVE.com (our “Website”) and our practices for collecting, using, maintaining, protecting and disclosing that information. The privacy policy of your Site must clearly disclose to end users that you are using the Solution, and provide a link to the Privacy Policy. AppendAd will continue to collect Advertisement Data in respect of Advertisement Data so long as the Implementing Code is installed, even after termination of these Terms. As such, it is your sole responsibility to remove Implementing Code if you wish to cease AppendAd’s collection and processing of the Advertisement Data. This policy is subject to and in addition to our Terms of Service. This policy applies to all information we collect: On this Website. Through social media. In e-mail, text and other electronic messages between you and this Website. When you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy. In other ways that we describe to you at the point of collection or otherwise with your consent. It does not apply to information collected by: us offline or through any other means, including on any other website operated by Company or any third party (including our affiliates and subsidiaries); or any third party (including our affiliates and subsidiaries), including through any application or content (including advertising) that may link to or be accessible from or on the Website Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using this Website, you agree to this Privacy Policy. This policy may change from time to time (see Changes to our Privacy Policy below). Your continued use of this Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates. Children Under the Age of 13 Our Website is not intended for children under 13 years of age. No one under age 13 may provide any personal information to or on the Website. We do NOT knowingly collect personal information from children under 13. If you are under 13, do not provide any information on this Website or on or through any of its features/register on the Website, make any purchases through the Website, use any of the interactive or public comment features of this Website or provide any information about yourself to us, including your name, address, telephone number, e-mail address or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us at privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084. Information We Collect About You and How We Collect It We collect several types of information from and about users of our Website, including information: by which you may be personally identified, such as name, postal address, e-mail address, telephone number, or any other identifier by which you may be contacted online or offline (“personal information”); that is about you but individually does not identify you, such as content preferences and frequency of readership; and/or about your internet connection, the equipment you use to access our Website and usage details. We collect this information: Directly from you when you provide it to us. Automatically as you navigate through the Website. Information collected automatically may include without limitation usage details, IP addresses and information collected through cookies, web beacons and other tracking technologies. Information You Provide to Us The information we collect on or through our Website may include: Information that you provide by filling in forms on our Website. This includes information provided at the time of registering to use certain features of our Website or posting material. We may also ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with our Website. Records and copies of your correspondence (including e-mail addresses), if you contact us or open an email from us. Your responses to polls, surveys or questions that we might ask you to complete. Your search queries on the Website. You also may provide information to be published or displayed (hereinafter, “posted”) on public areas of the Website, or transmitted to other users of the Website or third parties (collectively, “User Contributions”). Your User Contributions are posted on and transmitted to others at your own risk. Although we limit access to certain pages, please be aware that no security measures are perfect or impenetrable. Additionally, we cannot control the actions of other users of the Website with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons. Information We Collect Through Automatic Data Collection Technologies As you navigate through and interact with our Website, we may use automatic data collection technologies to collect certain information about you, your equipment, browsing actions and patterns, including without limitation: Details of your visits to our Website, including traffic data, location data, logs and other communication data and the resources that you access and use on the Website. Information about your identity. Information about your computer and internet connection, including your IP address, operating system and browser type. The information we collect automatically is statistical data and may include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to improve our Website and to deliver a better and more personalized service, including by enabling us to: Estimate our audience size and usage patterns. Store information about your preferences, allowing us to customize our Website according to your individual interests. Speed up your searches. Determine what products or services may be of interest to you. Recognize you when you return to our Website. The technologies we use for this automatic data collection may include without limitation: Cookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our Website. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Website. Flash Cookies. Certain features of our Website may use local stored objects (or Flash cookies) to collect and store information about your preferences and navigation to, from and on our Website. Flash cookies are not managed by the same browser settings as are used for browser cookies. For information about managing your privacy and security settings for Flash cookies, see Choices about How We Use and Disclose Your Information below. Any industry standard data and website information collection methodologies then in existence. How We Use Your Information We use information that we collect about you or that you provide to us, including any personal information: To present our Website and its contents to you. To provide you with information, products or services that you request from us. To fulfill any other purpose for which you provide it. To carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection. To notify you about changes to our Website or any products or services we offer or provide through it. To allow you to participate in interactive features on our Website. In any other way we may describe when you provide the information. For any purposes permitted under this policy or the Terms of Service. For any other purpose with your consent. We may use the information we have collected from you to enable us to display advertisements to our advertisers’ target audiences and to send emails, mailings or social media messaget to you about content, products or services. Even though we do not disclose your personal information for these purposes without your consent except as set forth herein, if you click on or otherwise interact with an advertisement, the advertiser may assume that you meet its target criteria. Disclosure of Your Information We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this Privacy Policy: To our subsidiaries and affiliates. To contractors, service providers and other third parties we use to support our business and who are bound by contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them. To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of the Company’s assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by the Company about our Website users is among the assets transferred. To fulfill the purpose for which you provide it. For any other purpose disclosed by us when you provide the information. With your consent. We may also disclose your personal information: To comply with any court order, law or legal process, including to respond to any government or regulatory request. To enforce or apply our Terms of Service and other agreements, including for billing and collection purposes. If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of the Company, other users of the Website, our customers or others. Choices About How We Use and Disclose Your Information We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information: Tracking Technologies and Advertising. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. To learn how you can manage your Flash cookie settings, visit the Flash player settings page on Adobe’s website. If you disable or refuse cookies, please note that some parts of this site may then be inaccessible or not function properly. We do not control third parties’ collection or use of your information to serve interest-based advertising. However these third parties may provide you with ways to choose not to have your information collected or used in this way. You can opt out of receiving targeted ads from members of the Network Advertising Initiative (“NAI”) on the NAI’s website. Accessing and Correcting Your Information You can review and change your personal information by logging into the Website and visiting your account profile page. If you delete your User Contributions from the Website, copies of your User Contributions may remain viewable in cached and archived pages, or might have been copied or stored by other Website users. Proper access and use of information provided on the Website, including User Contributions, is governed by our Terms of Service. Your California Privacy Rights California “Shine the Light” law permits users of our Website that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084. Changes to Our Privacy Policy We reserve the right to modify, amend, alter or change this policy at any time for any reason or no reason. It is our policy to post any changes we make to our Privacy Policy on this page. If we make material changes to how we treat our users’ personal information, we will notify you through a notice on the Website home page. The date the Privacy Policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Website and this Privacy Policy to check for any changes. Contact Information To ask questions or comment about this Privacy Policy and our privacy practices, contact us at: Email: privacy@tribweb.com U.S. Mail: TribLive, 210 Wood Street, Tarentum, PA 15084. Cookie Settings"}, "fb": {"app_id": 144410955752326}, "article": {"publisher": "https://www.facebook.com/triblive", "section": "Terms of Service", "mainsection": "Terms of Service", "subsection": "Terms of Service", "category": "Terms of Service", "subcategory": "Terms of Service", "title": "Terms of Service"}, "apple-itunes-app": "app-id=328217517", "description": "Last Modified: Feb. 11, 2018 Acceptance of the Terms of Service These terms of service are entered into by and between You and Trib Total Media, LLC. (“Company”, “we” or “us”). The following terms and conditions (these “Terms of Service”), govern your access to and use of TribLIVE.com, including any content, functionality and services offered on or through TribLIVE.com and its Affiliated Websites (as defined below) (collectively, the “Website”), whether as a guest or a registered user. Please read the Terms of Service carefully before you start to use the Website. By using the Website, you accept and agree to be bound and abide by these Terms of Service and our Privacy Policy, as follows below. If you do not want to agree to these Terms of Service or the Privacy Policy, you must not access or use the Website. The following Terms of Service and Privacy Policy applies to TribLIVE and its affiliated websites (“Affiliated Websites”) now in existence or hereinafter acquired, created or implemented, including, but not limited to: TribLIVE.com PittsburghAutoSuperStore.com PittsburghPennySaver.com PghTrib.com Trib HSSN – Western PA’s High School Sports Source TribLIVE also is affiliated with third-party content providers, some of which feature our branding. This policy statement does not apply to those companies’ websites. Information about the privacy policies of those websites and the companies operating such websites can be obtained from their individual websites. These websites include, without limitation: AccuWeather Privacy Policy Terms of Service Ad Lightning Privacy Policy Terms of Service Adblade Privacy Policy Terms of Service Adiant Amazon Web Services Privacy Policy Terms of Service BounceX Privacy Policy Terms of Service CivicScience Privacy Policy Terms of Service Cloudflare Privacy Policy Terms of Service EVVNT Privacy Policy Terms of Service Facebook Privacy Policy Terms of Service FirstImpression.io Privacy Policy Terms of Service Flipp Privacy Policy Terms of Service Google Ad Manager Privacy Policy Terms of Service Google Analytics Privacy Policy Terms of Service Google Tag Manager Privacy Policy Terms of Service Hudl Privacy Policy Terms of Service JW Player Privacy Policy Terms of Service Legacy.com Privacy Policy Terms of Service NewsEngin Inc. ONECount Privacy Policy Terms of Service OwnLocal Origami Privacy Policy Terms of Service Sailthru Privacy Policy Terms of Service Sajari Privacy Policy Terms of Service Second Street Privacy Policy Terms of Service SendtoNews Privacy Policy Terms of Service SmartSource Privacy Policy Terms of Service Sports Network SportsManias.com Privacy Policy Terms of Service Transparensee Systems Type Network Privacy Policy Terms of Service Changes to the Terms of Service We may revise and update these Terms of Service from time to time in our sole discretion. All changes are effective immediately when we post them, and apply to all access to and use of the Website thereafter. Your continued use of the Website following the posting of revised Terms of Service means that you accept and agree to the changes. You are expected to check this page from time to time so you are aware of any changes, as they are binding on you. Accessing the Website and Account Security We reserve the right to withdraw or amend this Website, and any service or material we provide on the Website, in our sole discretion without notice. We will not be liable if for any reason all or any part of the Website is unavailable at any time or for any period. From time to time, we may restrict access to some parts of the Website, or the entire Website, to users, including registered users. You are responsible for (i) making all arrangements necessary for you to have access to the Website; and (ii) ensuring that all persons who access the Website through your internet connection are aware of these Terms of Service and comply with them. To access the Website or some of the resources it offers, you may be asked to provide certain registration details or other information personal to you. It is a condition of your use of the Website that all the information you provide on the Website is correct, current and complete. You agree that all information you provide to register with this Website or otherwise, including but not limited to through the use of any interactive features on the Website, is governed by our Privacy Policy, and you consent to all actions we take with respect to your information consistent with our Privacy Policy. If you choose, or are provided with, a user name, password or any other piece of information as part of our security procedures, you must treat such information as confidential, and you must not disclose it to any other person or entity. You also acknowledge that your account is personal to you and agree not to provide any other person with access to this Website or portions of it using your user name, password or other security information. You agree to notify us immediately of any unauthorized access to or use of your user name or password or any other breach of security. You also agree to ensure that you exit from your account at the end of each session. You should use particular caution when accessing your account from a public or shared computer so that others are not able to view or record your password or other personal information. We have the right to disable any user name, password or other identifier, whether chosen by you or provided by us, at any time if, in our sole and exclusive opinion, you have violated any provision of these Terms of Service. Intellectual Property Rights The Website and its entire contents, features and functionality (including but not limited to all information of any source, software, text, displays, images, video and audio, and the design, selection and arrangement thereof), are owned by the Company, its licensors or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret and other intellectual property or proprietary rights laws. The Company is and shall be, the sole and exclusive owner of all right, title, and interest throughout the world in and to all such patents, copyrights, trademarks, trade secrets, and other intellectual property rights (collectively “Intellectual Property Rights”). These Terms of Service permit you to use the Website for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store or transmit any of the material on our Website, except as follows: You may establish a hypertext link to this Website so long as the link does not state or imply any sponsorship of your site by TribLIVE.com or any affiliated newspapers or websites. However, you may not, without the prior written permission of TribLIVE.com, frame any of the content of the Website, or incorporate into another website or other service any intellectual property of TribLIVE.com, its parent or affiliate companies or its licensors. Your computer may temporarily store copies of such materials in RAM or any form of temporary or cached memory incidental to your accessing and viewing those materials. You may store files that are automatically cached by your Web browser for display enhancement purposes. You may print or download one copy of a reasonable number of pages of the Website for your own personal, non-commercial use and not for further reproduction, publication or distribution. If we provide desktop, mobile or other applications for download, you may download a single copy to your computer or mobile device solely for your own personal, non-commercial use, provided you agree to be bound by our end user license agreement in effect at that time for such applications. If we provide social media features with certain content, you may take such actions as are enabled by such features. You must not: Modify copies of any materials from this site. Use any illustrations, photographs, video or audio sequences or any graphics separately from the accompanying text. Delete or alter any copyright, trademark or other proprietary rights notices from copies of materials from this site. You must not access or use for any commercial purposes any part of the Website or any services or materials available through the Website. If you print, copy, modify, download or otherwise use or provide any other person with access to any part of the Website in breach of the Terms of Service, your right to use the Website will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. No right, title or interest in or to the Website or any content on the Website is transferred to you, and all rights not expressly granted are reserved by the Company. Any use of the Website not expressly permitted by these Terms of Service is a breach of these Terms of Service and may violate copyright, trademark and other laws. Trademarks The Company name, TribLIVE, the Company and TribLIVE logos and all related names, logos, product and service names, designs and slogans are trademarks of the Company or its affiliates or licensors. You must not use such marks or any of the Company’s registered or common law trademarks without the prior written permission of the Company. All other names, logos, product and service names, designs and slogans on this Website are the trademarks of their respective owners. Prohibited Uses You may use the Website only for lawful purposes and in accordance with these Terms of Service. You agree not to use the Website: In any way that violates any applicable federal, state, local or international law or regulation (including, without limitation, any laws regarding the export of data or software to and from the US or other countries). For the purpose of exploiting, harming or attempting to exploit or harm minors in any way by exposing them to inappropriate content, asking for personally identifiable information or otherwise. To send, knowingly receive, upload, download, use or re-use any material which does not comply with the content standards set forth in these Terms of Service. To transmit, or procure the sending of, any advertising or promotional material without our prior written consent, including any “junk mail”, “chain letter” or “spam” or any other similar solicitation. To impersonate or attempt to impersonate the Company, a Company employee, another user or any other person or entity (including, without limitation, by using e-mail addresses or screen names associated with any of the foregoing). To engage in any other conduct that restricts or inhibits anyone’s use or enjoyment of the Website, or which, as determined by us, may harm the Company or users of the Website or expose them to liability. Additionally, you agree not to: Use the Website in any manner that could disable, overburden, damage, or impair the site or interfere with any other party’s use of the Website, including their ability to engage in real time activities through the Website. Use any robot, spider or other automatic device, process or means to access the Website for any purpose, including monitoring or copying any of the material on the Website. Use any manual process to monitor or copy any of the material on the Website or for any other unauthorized purpose without our prior written consent. Use any device, software or routine that interferes with the proper working of the Website. Introduce any viruses, Trojan horses, worms, logic bombs or other material which is malicious or technologically harmful. Attempt to gain unauthorized access to, interfere with, damage or disrupt any parts of the Website, the server on which the Website is stored, or any server, computer or database connected to the Website. Attack the Website via a denial-of-service attack or a distributed denial-of-service attack. Otherwise attempt to interfere with the proper working of the Website. User Contributions The Website may contain comments sections to submissions and pages, message boards, chat rooms, personal web pages or profiles, forums, bulletin boards, surveys and other interactive features, such as our Feedback form, (collectively, “Interactive Services”) that allow users to post, submit, publish, display or transmit to other users or other persons (hereinafter, “post”) content or materials (collectively, “User Contributions”) on or through the Website. All User Contributions must comply with the Content Standards set forth in these Terms of Service. Any User Contribution you post to the site will be considered non-confidential and non-proprietary. By providing any User Contribution on the Website, you grant us and our licensees, successors and assigns the right to use, reproduce, modify, perform, display, distribute and otherwise disclose to third parties any such material. You represent and warrant that (i) you own or control all rights in and to the User Contributions and have the right to grant the license granted above to us and our licensees, successors and assigns; and (ii) all of your User Contributions do and will comply with these Terms of Services. You understand and acknowledge that you are responsible for any User Contributions you submit or contribute, and you, not the Company, have fully responsibility for such content, including its legality, reliability, accuracy and appropriateness. We are not responsible, or liable to any third party, for the content or accuracy of any User Contributions posted by you or any other user of the Website. Monitoring and Enforcement; Termination We have the right to: Remove or refuse to post any User Contributions for any or no reason in our sole discretion. Take any action with respect to any User Contribution that we deem necessary or appropriate in our sole discretion, including if we believe that such User Contribution violates the Terms of Service, including the Content Standards, infringes any intellectual property right or other right of any person or entity, threatens the personal safety of users of the Website or the public or could create liability for the Company. Disclose your identity or other information about you to any third party who claims that material posted by you violates their rights, including their intellectual property rights or their right to privacy. Take appropriate legal action, including without limitation, referral to law enforcement, for any illegal or unauthorized use of the Website. Terminate or suspend your access to all or part of the Website for any reason or no reason, including without limitation, any violation of these Terms of Service. Without limiting the foregoing, we have the right to fully cooperate with any law enforcement authorities or court order requesting or directing us to disclose the identity or other information of anyone posting any materials on or through the Website. YOU WAIVE AND HOLD HARMLESS THE COMPANY AND ITS AFFILIATES, LICENSEES AND SERVICE PROVIDERS FROM ANY CLAIMS RESULTING FROM ANY ACTION TAKEN BY ANY OF THE FOREGOING PARTIES DURING OR AS A RESULT OF ITS INVESTIGATIONS AND FROM ANY ACTIONS TAKEN AS A CONSEQUENCE OF INVESTIGATIONS BY EITHER SUCH PARTIES OR LAW ENFORCEMENT AUTHORITIES. However, we do not undertake to review all material before it is posted on the Website, and cannot ensure prompt removal of objectionable material after it has been posted. Accordingly, we assume no liability for any action or inaction regarding transmissions, communications or content provided by any user or third party. We have no liability or responsibility to anyone for performance or nonperformance of the activities described in this section. Content Standards These content standards apply to any and all User Contributions and use of Interactive Services. User Contributions must in their entirety comply with all applicable federal, state, local and international laws and regulations. Without limiting the foregoing, User Contributions must not: Contain any material which is defamatory, obscene, indecent, abusive, threatening, offensive, harassing, violent, hateful, inflammatory or otherwise objectionable. Promote sexually explicit or pornographic material, violence, or discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe the Company’s Intellectual Property Rights or any patent, trademark, trade secret, copyright or other intellectual property or other rights of any other person. Violate the legal rights (including the rights of publicity and privacy) of others or contain any material that could give rise to any civil or criminal liability under applicable laws or regulations or that otherwise may be in conflict with these Terms of Service and our Privacy Policy. Be likely to deceive any person. Promote any illegal activity, or advocate, promote or assist any unlawful act. Cause annoyance, inconvenience or needless anxiety or be likely to upset, embarrass, alarm or annoy any other person. Impersonate any person, or misrepresent your identity or affiliation with any person or organization. Involve commercial activities or sales, such as contests, sweepstakes and other sales promotions, barter or advertising. Give the impression that they emanate from or are endorsed by us or any other person or entity, if this is not the case. Copyright Infringement If you believe that any User Contributions violate your copyright, please see our Copyright Policy for instructions on sending us a notice of copyright infringement. It is the policy of the Company to terminate the user accounts of repeat infringers. Reliance on Information Posted The information presented on or through the Website is made available solely for general information purposes. We do not warrant the accuracy, completeness or usefulness of this information. Any reliance you place on such information is strictly at your own risk. We disclaim all liability and responsibility arising from any reliance placed on such materials by you or any other visitor to the Website, or by anyone who may be informed of any of its contents. This Website may include content provided by users and third parties, including materials provided by other users, bloggers and third-party licensors, syndicators, aggregators and/or reporting services. All statements and/or opinions expressed in these materials, and all articles and responses to questions and other content, other than the content provided by the Company, are solely the opinions and the responsibility of the person or entity providing those materials. These materials do not necessarily reflect the opinion of the Company. We are not responsible, or liable to you or any third party, for the content or accuracy of any materials provided by any third parties. We are in no way responsible for any information submitted by any user or third party, nor shall we be deemed to be endorsing any user or third party information submitted on the Website. Changes to the Website We may update the content on this Website from time to time, but its content is not necessarily complete or up-to-date. Any of the content, information, or material on the Website may be out of date at any given time, and we are under no obligation to update such content, information, and material. Information About You and Your Visits to the Website All information we collect on this Website is subject to our Privacy Policy. By using the Website, you consent to all actions taken by us with respect to your information in compliance with the Privacy Policy. Linking to the Website and Social Media Features You may link to our homepage, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it, but you must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part without our express written consent. This Website may provide certain social media features that enable you to: Link from your own or certain third-party websites to certain content on this Website Send e-mails or other communications with certain content, or links to certain content, on this Website. Cause limited portions of content on this Website to be displayed or appear to be displayed on your own or certain third-party websites. You may use these features solely as they are provided by us, and solely with respect to the content they are displayed with and otherwise in accordance with any additional terms and conditions we provide with respect to such features. Subject to the foregoing, you must not: Establish a link from any website that is not owned by you. Cause the Website or portions of it to be displayed, or appear to be displayed by, for example, framing, deep linking or in-line linking, on any other site. Otherwise take any action with respect to the materials on this Website that is inconsistent with any other provision of these Terms of Service. Links from the Website If the Website contains links to other sites and resources provided by third parties, these links are provided for your convenience only. This includes links contained in advertisements, including banner advertisements and sponsored links. We have no control over the contents of those sites or resources, and accept no responsibility for them or for any loss or damage that may arise from your use of them. If you decide to access any of the third party websites linked to this Website, you do so entirely at your own risk and subject to the terms and conditions of use for such websites. Any links to third party websites or material shall not be deemed to be any endorsement of such material and website by us. Geographic Restrictions The owner of the Website is based in the Commonwealth of Pennsylvania in the United States. We provide this Website for use only by persons located in the United States. We make no claims that the Website or any of its content is accessible or appropriate outside of the United States. Access to the Website may not be legal by certain persons or in certain countries. If you access the Website from outside the United States, you do so on your own initiative and are responsible for compliance with local laws. Disclaimer of Warranties You understand that we cannot and do not guarantee or warrant that files available for downloading from the internet or the Website will be free of viruses or other destructive code. You are responsible for implementing sufficient procedures and checkpoints to satisfy your particular requirements for anti-virus protection and accuracy of data input and output, and for maintaining a means external to our site for any reconstruction of any lost data. WE WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY A DISTRIBUTED DENIAL-OF-SERVICE ATTACK, VIRUSES OR OTHER TECHNOLOGICALLY HARMFUL MATERIAL THAT MAY INFECT YOUR COMPUTER EQUIPMENT, COMPUTER PROGRAMS, DATA OR OTHER PROPRIETARY MATERIAL DUE TO YOUR USE OF THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR TO YOUR DOWNLOADING OF ANY MATERIAL POSTED ON IT, OR ON ANY WEBSITE LINKED TO IT. YOUR USE OF THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE IS AT YOUR OWN RISK. THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE ARE PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS, WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED. NEITHER THE COMPANY NOR ANY PERSON ASSOCIATED WITH THE COMPANY MAKES ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, QUALITY, ACCURACY OR AVAILABILITY OF THE WEBSITE. WITHOUT LIMITING THE FOREGOING, NEITHER THE COMPANY NOR ANYONE ASSOCIATED WITH THE COMPANY REPRESENTS OR WARRANTS THAT THE WEBSITE, ITS CONTENT OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL BE ACCURATE, RELIABLE, ERROR-FREE OR UNINTERRUPTED, THAT DEFECTS WILL BE CORRECTED, THAT OUR SITE OR THE SERVER THAT MAKES IT AVAILABLE ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS OR THAT THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL OTHERWISE MEET YOUR NEEDS OR EXPECTATIONS. THE COMPANY HEREBY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR PARTICULAR PURPOSE. THE FOREGOING DOES NOT AFFECT ANY WARRANTIES WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Limitation on Liability IN NO EVENT WILL THE COMPANY, ITS AFFILIATES OR THEIR LICENSORS, SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS OR DIRECTORS BE LIABLE FOR DAMAGES OF ANY KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR USE, OR INABILITY TO USE, THE WEBSITE, ANY WEBSITES LINKED TO IT, ANY CONTENT ON THE WEBSITE OR SUCH OTHER WEBSITES OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR SUCH OTHER WEBSITES, INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING BUT NOT LIMITED TO, PERSONAL INJURY, PAIN AND SUFFERING, EMOTIONAL DISTRESS, LOSS OF REVENUE, LOSS OF PROFITS, LOSS OF BUSINESS OR ANTICIPATED SAVINGS, LOSS OF USE, LOSS OF GOODWILL, LOSS OF DATA, AND WHETHER CAUSED BY TORT (INCLUDING NEGLIGENCE), BREACH OF CONTRACT OR OTHERWISE, EVEN IF FORESEEABLE. THE FOREGOING DOES NOT AFFECT ANY LIABILITY WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Indemnification You agree to defend, indemnify and hold harmless the Company, its affiliates, licensors and service providers, and its and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors and assigns from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses or fees (including reasonable attorneys’ fees) arising out of or relating to your violation of these Terms of Service or your use of the Website, including, but not limited to, your User Contributions, any use of the Website’s content, services and products other than as expressly authorized in these Terms of Service or your use of any information obtained from the Website. Governing Law and Jurisdiction All matters relating to the Website and these Terms of Service and any dispute or claim arising therefrom or related thereto (in each case, including non-contractual disputes or claims), shall be governed by and construed in accordance with the internal laws of the Commonwealth of Pennsylvania without giving effect to any choice or conflict of law provision or rule (whether of the Commonwealth of Pennsylvania or any other jurisdiction). Any legal suit, action or proceeding arising out of, or related to, these Terms of Service or the Website shall be instituted exclusively in the federal courts of the United States or the courts of the Commonwealth of Pennsylvania and County of Allegheny, although we retain the right to bring any suit, action or proceeding against you for breach of these Terms of Service in your country of residence or any other relevant country. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts. Waiver and Severability No waiver of by the Company of any term or condition set forth in these Terms of Service shall be deemed a further or continuing waiver of such term or condition or a waiver of any other term or condition, and any failure of the Company to assert a right or provision under these Terms of Service shall not constitute a waiver of such right or provision. If any provision of these Terms of Service is held by a court or other tribunal of competent jurisdiction to be invalid, illegal or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent such that the remaining provisions of the Terms of Service will continue in full force and effect. Entire Agreement The Terms of Service and our Privacy Policy constitute the sole and entire agreement between you and Trib Total Media, LLC. with respect to the Website and supersede all prior and contemporaneous understandings, agreements, representations and warranties, both written and oral, with respect to the Website. Privacy Policy Introduction Trib Total Media, LLC. and any and all of its affiliates, including 535 Media, LLC, (“Company” or “We”) respect your privacy and are committed to protecting it through our compliance with this privacy policy (this “policy”). This policy describes the types of information we may collect from you or that you may provide when you visit the website TribLIVE.com (our “Website”) and our practices for collecting, using, maintaining, protecting and disclosing that information. The privacy policy of your Site must clearly disclose to end users that you are using the Solution, and provide a link to the Privacy Policy. AppendAd will continue to collect Advertisement Data in respect of Advertisement Data so long as the Implementing Code is installed, even after termination of these Terms. As such, it is your sole responsibility to remove Implementing Code if you wish to cease AppendAd’s collection and processing of the Advertisement Data. This policy is subject to and in addition to our Terms of Service. This policy applies to all information we collect: On this Website. Through social media. In e-mail, text and other electronic messages between you and this Website. When you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy. In other ways that we describe to you at the point of collection or otherwise with your consent. It does not apply to information collected by: us offline or through any other means, including on any other website operated by Company or any third party (including our affiliates and subsidiaries); or any third party (including our affiliates and subsidiaries), including through any application or content (including advertising) that may link to or be accessible from or on the Website Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using this Website, you agree to this Privacy Policy. This policy may change from time to time (see Changes to our Privacy Policy below). Your continued use of this Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates. Children Under the Age of 13 Our Website is not intended for children under 13 years of age. No one under age 13 may provide any personal information to or on the Website. We do NOT knowingly collect personal information from children under 13. If you are under 13, do not provide any information on this Website or on or through any of its features/register on the Website, make any purchases through the Website, use any of the interactive or public comment features of this Website or provide any information about yourself to us, including your name, address, telephone number, e-mail address or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us at privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084. Information We Collect About You and How We Collect It We collect several types of information from and about users of our Website, including information: by which you may be personally identified, such as name, postal address, e-mail address, telephone number, or any other identifier by which you may be contacted online or offline (“personal information”); that is about you but individually does not identify you, such as content preferences and frequency of readership; and/or about your internet connection, the equipment you use to access our Website and usage details. We collect this information: Directly from you when you provide it to us. Automatically as you navigate through the Website. Information collected automatically may include without limitation usage details, IP addresses and information collected through cookies, web beacons and other tracking technologies. Information You Provide to Us The information we collect on or through our Website may include: Information that you provide by filling in forms on our Website. This includes information provided at the time of registering to use certain features of our Website or posting material. We may also ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with our Website. Records and copies of your correspondence (including e-mail addresses), if you contact us or open an email from us. Your responses to polls, surveys or questions that we might ask you to complete. Your search queries on the Website. You also may provide information to be published or displayed (hereinafter, “posted”) on public areas of the Website, or transmitted to other users of the Website or third parties (collectively, “User Contributions”). Your User Contributions are posted on and transmitted to others at your own risk. Although we limit access to certain pages, please be aware that no security measures are perfect or impenetrable. Additionally, we cannot control the actions of other users of the Website with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons. Information We Collect Through Automatic Data Collection Technologies As you navigate through and interact with our Website, we may use automatic data collection technologies to collect certain information about you, your equipment, browsing actions and patterns, including without limitation: Details of your visits to our Website, including traffic data, location data, logs and other communication data and the resources that you access and use on the Website. Information about your identity. Information about your computer and internet connection, including your IP address, operating system and browser type. The information we collect automatically is statistical data and may include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to improve our Website and to deliver a better and more personalized service, including by enabling us to: Estimate our audience size and usage patterns. Store information about your preferences, allowing us to customize our Website according to your individual interests. Speed up your searches. Determine what products or services may be of interest to you. Recognize you when you return to our Website. The technologies we use for this automatic data collection may include without limitation: Cookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our Website. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Website. Flash Cookies. Certain features of our Website may use local stored objects (or Flash cookies) to collect and store information about your preferences and navigation to, from and on our Website. Flash cookies are not managed by the same browser settings as are used for browser cookies. For information about managing your privacy and security settings for Flash cookies, see Choices about How We Use and Disclose Your Information below. Any industry standard data and website information collection methodologies then in existence. How We Use Your Information We use information that we collect about you or that you provide to us, including any personal information: To present our Website and its contents to you. To provide you with information, products or services that you request from us. To fulfill any other purpose for which you provide it. To carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection. To notify you about changes to our Website or any products or services we offer or provide through it. To allow you to participate in interactive features on our Website. In any other way we may describe when you provide the information. For any purposes permitted under this policy or the Terms of Service. For any other purpose with your consent. We may use the information we have collected from you to enable us to display advertisements to our advertisers’ target audiences and to send emails, mailings or social media messaget to you about content, products or services. Even though we do not disclose your personal information for these purposes without your consent except as set forth herein, if you click on or otherwise interact with an advertisement, the advertiser may assume that you meet its target criteria. Disclosure of Your Information We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this Privacy Policy: To our subsidiaries and affiliates. To contractors, service providers and other third parties we use to support our business and who are bound by contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them. To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of the Company’s assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by the Company about our Website users is among the assets transferred. To fulfill the purpose for which you provide it. For any other purpose disclosed by us when you provide the information. With your consent. We may also disclose your personal information: To comply with any court order, law or legal process, including to respond to any government or regulatory request. To enforce or apply our Terms of Service and other agreements, including for billing and collection purposes. If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of the Company, other users of the Website, our customers or others. Choices About How We Use and Disclose Your Information We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information: Tracking Technologies and Advertising. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. To learn how you can manage your Flash cookie settings, visit the Flash player settings page on Adobe’s website. If you disable or refuse cookies, please note that some parts of this site may then be inaccessible or not function properly. We do not control third parties’ collection or use of your information to serve interest-based advertising. However these third parties may provide you with ways to choose not to have your information collected or used in this way. You can opt out of receiving targeted ads from members of the Network Advertising Initiative (“NAI”) on the NAI’s website. Accessing and Correcting Your Information You can review and change your personal information by logging into the Website and visiting your account profile page. If you delete your User Contributions from the Website, copies of your User Contributions may remain viewable in cached and archived pages, or might have been copied or stored by other Website users. Proper access and use of information provided on the Website, including User Contributions, is governed by our Terms of Service. Your California Privacy Rights California “Shine the Light” law permits users of our Website that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084. Changes to Our Privacy Policy We reserve the right to modify, amend, alter or change this policy at any time for any reason or no reason. It is our policy to post any changes we make to our Privacy Policy on this page. If we make material changes to how we treat our users’ personal information, we will notify you through a notice on the Website home page. The date the Privacy Policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Website and this Privacy Policy to check for any changes. Contact Information To ask questions or comment about this Privacy Policy and our privacy practices, contact us at: Email: privacy@tribweb.com U.S. Mail: TribLive, 210 Wood Street, Tarentum, PA 15084. Cookie Settings", "pagetype": "page", "headline": "Terms of Service", "twitter": {"card": "summary_large_image", "image": "https://triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/TribLIVELogo.jpg", "site": {"identifier": "@triblive", "id": 20269833}, "creator": "@triblive", "title": "Terms of Service", "description": "Last Modified: Feb. 11, 2018 Acceptance of the Terms of Service These terms of service are entered into by and between You and Trib Total Media, LLC. (“Company”, “we” or “us”). The following terms and conditions (these “Terms of Service”), govern your access to and use of TribLIVE.com, including any content, functionality and services offered on or through TribLIVE.com and its Affiliated Websites (as defined below) (collectively, the “Website”), whether as a guest or a registered user. Please read the Terms of Service carefully before you start to use the Website. By using the Website, you accept and agree to be bound and abide by these Terms of Service and our Privacy Policy, as follows below. If you do not want to agree to these Terms of Service or the Privacy Policy, you must not access or use the Website. The following Terms of Service and Privacy Policy applies to TribLIVE and its affiliated websites (“Affiliated Websites”) now in existence or hereinafter acquired, created or implemented, including, but not limited to: TribLIVE.com PittsburghAutoSuperStore.com PittsburghPennySaver.com PghTrib.com Trib HSSN – Western PA’s High School Sports Source TribLIVE also is affiliated with third-party content providers, some of which feature our branding. This policy statement does not apply to those companies’ websites. Information about the privacy policies of those websites and the companies operating such websites can be obtained from their individual websites. These websites include, without limitation: AccuWeather Privacy Policy Terms of Service Ad Lightning Privacy Policy Terms of Service Adblade Privacy Policy Terms of Service Adiant Amazon Web Services Privacy Policy Terms of Service BounceX Privacy Policy Terms of Service CivicScience Privacy Policy Terms of Service Cloudflare Privacy Policy Terms of Service EVVNT Privacy Policy Terms of Service Facebook Privacy Policy Terms of Service FirstImpression.io Privacy Policy Terms of Service Flipp Privacy Policy Terms of Service Google Ad Manager Privacy Policy Terms of Service Google Analytics Privacy Policy Terms of Service Google Tag Manager Privacy Policy Terms of Service Hudl Privacy Policy Terms of Service JW Player Privacy Policy Terms of Service Legacy.com Privacy Policy Terms of Service NewsEngin Inc. ONECount Privacy Policy Terms of Service OwnLocal Origami Privacy Policy Terms of Service Sailthru Privacy Policy Terms of Service Sajari Privacy Policy Terms of Service Second Street Privacy Policy Terms of Service SendtoNews Privacy Policy Terms of Service SmartSource Privacy Policy Terms of Service Sports Network SportsManias.com Privacy Policy Terms of Service Transparensee Systems Type Network Privacy Policy Terms of Service Changes to the Terms of Service We may revise and update these Terms of Service from time to time in our sole discretion. All changes are effective immediately when we post them, and apply to all access to and use of the Website thereafter. Your continued use of the Website following the posting of revised Terms of Service means that you accept and agree to the changes. You are expected to check this page from time to time so you are aware of any changes, as they are binding on you. Accessing the Website and Account Security We reserve the right to withdraw or amend this Website, and any service or material we provide on the Website, in our sole discretion without notice. We will not be liable if for any reason all or any part of the Website is unavailable at any time or for any period. From time to time, we may restrict access to some parts of the Website, or the entire Website, to users, including registered users. You are responsible for (i) making all arrangements necessary for you to have access to the Website; and (ii) ensuring that all persons who access the Website through your internet connection are aware of these Terms of Service and comply with them. To access the Website or some of the resources it offers, you may be asked to provide certain registration details or other information personal to you. It is a condition of your use of the Website that all the information you provide on the Website is correct, current and complete. You agree that all information you provide to register with this Website or otherwise, including but not limited to through the use of any interactive features on the Website, is governed by our Privacy Policy, and you consent to all actions we take with respect to your information consistent with our Privacy Policy. If you choose, or are provided with, a user name, password or any other piece of information as part of our security procedures, you must treat such information as confidential, and you must not disclose it to any other person or entity. You also acknowledge that your account is personal to you and agree not to provide any other person with access to this Website or portions of it using your user name, password or other security information. You agree to notify us immediately of any unauthorized access to or use of your user name or password or any other breach of security. You also agree to ensure that you exit from your account at the end of each session. You should use particular caution when accessing your account from a public or shared computer so that others are not able to view or record your password or other personal information. We have the right to disable any user name, password or other identifier, whether chosen by you or provided by us, at any time if, in our sole and exclusive opinion, you have violated any provision of these Terms of Service. Intellectual Property Rights The Website and its entire contents, features and functionality (including but not limited to all information of any source, software, text, displays, images, video and audio, and the design, selection and arrangement thereof), are owned by the Company, its licensors or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret and other intellectual property or proprietary rights laws. The Company is and shall be, the sole and exclusive owner of all right, title, and interest throughout the world in and to all such patents, copyrights, trademarks, trade secrets, and other intellectual property rights (collectively “Intellectual Property Rights”). These Terms of Service permit you to use the Website for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store or transmit any of the material on our Website, except as follows: You may establish a hypertext link to this Website so long as the link does not state or imply any sponsorship of your site by TribLIVE.com or any affiliated newspapers or websites. However, you may not, without the prior written permission of TribLIVE.com, frame any of the content of the Website, or incorporate into another website or other service any intellectual property of TribLIVE.com, its parent or affiliate companies or its licensors. Your computer may temporarily store copies of such materials in RAM or any form of temporary or cached memory incidental to your accessing and viewing those materials. You may store files that are automatically cached by your Web browser for display enhancement purposes. You may print or download one copy of a reasonable number of pages of the Website for your own personal, non-commercial use and not for further reproduction, publication or distribution. If we provide desktop, mobile or other applications for download, you may download a single copy to your computer or mobile device solely for your own personal, non-commercial use, provided you agree to be bound by our end user license agreement in effect at that time for such applications. If we provide social media features with certain content, you may take such actions as are enabled by such features. You must not: Modify copies of any materials from this site. Use any illustrations, photographs, video or audio sequences or any graphics separately from the accompanying text. Delete or alter any copyright, trademark or other proprietary rights notices from copies of materials from this site. You must not access or use for any commercial purposes any part of the Website or any services or materials available through the Website. If you print, copy, modify, download or otherwise use or provide any other person with access to any part of the Website in breach of the Terms of Service, your right to use the Website will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. No right, title or interest in or to the Website or any content on the Website is transferred to you, and all rights not expressly granted are reserved by the Company. Any use of the Website not expressly permitted by these Terms of Service is a breach of these Terms of Service and may violate copyright, trademark and other laws. Trademarks The Company name, TribLIVE, the Company and TribLIVE logos and all related names, logos, product and service names, designs and slogans are trademarks of the Company or its affiliates or licensors. You must not use such marks or any of the Company’s registered or common law trademarks without the prior written permission of the Company. All other names, logos, product and service names, designs and slogans on this Website are the trademarks of their respective owners. Prohibited Uses You may use the Website only for lawful purposes and in accordance with these Terms of Service. You agree not to use the Website: In any way that violates any applicable federal, state, local or international law or regulation (including, without limitation, any laws regarding the export of data or software to and from the US or other countries). For the purpose of exploiting, harming or attempting to exploit or harm minors in any way by exposing them to inappropriate content, asking for personally identifiable information or otherwise. To send, knowingly receive, upload, download, use or re-use any material which does not comply with the content standards set forth in these Terms of Service. To transmit, or procure the sending of, any advertising or promotional material without our prior written consent, including any “junk mail”, “chain letter” or “spam” or any other similar solicitation. To impersonate or attempt to impersonate the Company, a Company employee, another user or any other person or entity (including, without limitation, by using e-mail addresses or screen names associated with any of the foregoing). To engage in any other conduct that restricts or inhibits anyone’s use or enjoyment of the Website, or which, as determined by us, may harm the Company or users of the Website or expose them to liability. Additionally, you agree not to: Use the Website in any manner that could disable, overburden, damage, or impair the site or interfere with any other party’s use of the Website, including their ability to engage in real time activities through the Website. Use any robot, spider or other automatic device, process or means to access the Website for any purpose, including monitoring or copying any of the material on the Website. Use any manual process to monitor or copy any of the material on the Website or for any other unauthorized purpose without our prior written consent. Use any device, software or routine that interferes with the proper working of the Website. Introduce any viruses, Trojan horses, worms, logic bombs or other material which is malicious or technologically harmful. Attempt to gain unauthorized access to, interfere with, damage or disrupt any parts of the Website, the server on which the Website is stored, or any server, computer or database connected to the Website. Attack the Website via a denial-of-service attack or a distributed denial-of-service attack. Otherwise attempt to interfere with the proper working of the Website. User Contributions The Website may contain comments sections to submissions and pages, message boards, chat rooms, personal web pages or profiles, forums, bulletin boards, surveys and other interactive features, such as our Feedback form, (collectively, “Interactive Services”) that allow users to post, submit, publish, display or transmit to other users or other persons (hereinafter, “post”) content or materials (collectively, “User Contributions”) on or through the Website. All User Contributions must comply with the Content Standards set forth in these Terms of Service. Any User Contribution you post to the site will be considered non-confidential and non-proprietary. By providing any User Contribution on the Website, you grant us and our licensees, successors and assigns the right to use, reproduce, modify, perform, display, distribute and otherwise disclose to third parties any such material. You represent and warrant that (i) you own or control all rights in and to the User Contributions and have the right to grant the license granted above to us and our licensees, successors and assigns; and (ii) all of your User Contributions do and will comply with these Terms of Services. You understand and acknowledge that you are responsible for any User Contributions you submit or contribute, and you, not the Company, have fully responsibility for such content, including its legality, reliability, accuracy and appropriateness. We are not responsible, or liable to any third party, for the content or accuracy of any User Contributions posted by you or any other user of the Website. Monitoring and Enforcement; Termination We have the right to: Remove or refuse to post any User Contributions for any or no reason in our sole discretion. Take any action with respect to any User Contribution that we deem necessary or appropriate in our sole discretion, including if we believe that such User Contribution violates the Terms of Service, including the Content Standards, infringes any intellectual property right or other right of any person or entity, threatens the personal safety of users of the Website or the public or could create liability for the Company. Disclose your identity or other information about you to any third party who claims that material posted by you violates their rights, including their intellectual property rights or their right to privacy. Take appropriate legal action, including without limitation, referral to law enforcement, for any illegal or unauthorized use of the Website. Terminate or suspend your access to all or part of the Website for any reason or no reason, including without limitation, any violation of these Terms of Service. Without limiting the foregoing, we have the right to fully cooperate with any law enforcement authorities or court order requesting or directing us to disclose the identity or other information of anyone posting any materials on or through the Website. YOU WAIVE AND HOLD HARMLESS THE COMPANY AND ITS AFFILIATES, LICENSEES AND SERVICE PROVIDERS FROM ANY CLAIMS RESULTING FROM ANY ACTION TAKEN BY ANY OF THE FOREGOING PARTIES DURING OR AS A RESULT OF ITS INVESTIGATIONS AND FROM ANY ACTIONS TAKEN AS A CONSEQUENCE OF INVESTIGATIONS BY EITHER SUCH PARTIES OR LAW ENFORCEMENT AUTHORITIES. However, we do not undertake to review all material before it is posted on the Website, and cannot ensure prompt removal of objectionable material after it has been posted. Accordingly, we assume no liability for any action or inaction regarding transmissions, communications or content provided by any user or third party. We have no liability or responsibility to anyone for performance or nonperformance of the activities described in this section. Content Standards These content standards apply to any and all User Contributions and use of Interactive Services. User Contributions must in their entirety comply with all applicable federal, state, local and international laws and regulations. Without limiting the foregoing, User Contributions must not: Contain any material which is defamatory, obscene, indecent, abusive, threatening, offensive, harassing, violent, hateful, inflammatory or otherwise objectionable. Promote sexually explicit or pornographic material, violence, or discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe the Company’s Intellectual Property Rights or any patent, trademark, trade secret, copyright or other intellectual property or other rights of any other person. Violate the legal rights (including the rights of publicity and privacy) of others or contain any material that could give rise to any civil or criminal liability under applicable laws or regulations or that otherwise may be in conflict with these Terms of Service and our Privacy Policy. Be likely to deceive any person. Promote any illegal activity, or advocate, promote or assist any unlawful act. Cause annoyance, inconvenience or needless anxiety or be likely to upset, embarrass, alarm or annoy any other person. Impersonate any person, or misrepresent your identity or affiliation with any person or organization. Involve commercial activities or sales, such as contests, sweepstakes and other sales promotions, barter or advertising. Give the impression that they emanate from or are endorsed by us or any other person or entity, if this is not the case. Copyright Infringement If you believe that any User Contributions violate your copyright, please see our Copyright Policy for instructions on sending us a notice of copyright infringement. It is the policy of the Company to terminate the user accounts of repeat infringers. Reliance on Information Posted The information presented on or through the Website is made available solely for general information purposes. We do not warrant the accuracy, completeness or usefulness of this information. Any reliance you place on such information is strictly at your own risk. We disclaim all liability and responsibility arising from any reliance placed on such materials by you or any other visitor to the Website, or by anyone who may be informed of any of its contents. This Website may include content provided by users and third parties, including materials provided by other users, bloggers and third-party licensors, syndicators, aggregators and/or reporting services. All statements and/or opinions expressed in these materials, and all articles and responses to questions and other content, other than the content provided by the Company, are solely the opinions and the responsibility of the person or entity providing those materials. These materials do not necessarily reflect the opinion of the Company. We are not responsible, or liable to you or any third party, for the content or accuracy of any materials provided by any third parties. We are in no way responsible for any information submitted by any user or third party, nor shall we be deemed to be endorsing any user or third party information submitted on the Website. Changes to the Website We may update the content on this Website from time to time, but its content is not necessarily complete or up-to-date. Any of the content, information, or material on the Website may be out of date at any given time, and we are under no obligation to update such content, information, and material. Information About You and Your Visits to the Website All information we collect on this Website is subject to our Privacy Policy. By using the Website, you consent to all actions taken by us with respect to your information in compliance with the Privacy Policy. Linking to the Website and Social Media Features You may link to our homepage, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it, but you must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part without our express written consent. This Website may provide certain social media features that enable you to: Link from your own or certain third-party websites to certain content on this Website Send e-mails or other communications with certain content, or links to certain content, on this Website. Cause limited portions of content on this Website to be displayed or appear to be displayed on your own or certain third-party websites. You may use these features solely as they are provided by us, and solely with respect to the content they are displayed with and otherwise in accordance with any additional terms and conditions we provide with respect to such features. Subject to the foregoing, you must not: Establish a link from any website that is not owned by you. Cause the Website or portions of it to be displayed, or appear to be displayed by, for example, framing, deep linking or in-line linking, on any other site. Otherwise take any action with respect to the materials on this Website that is inconsistent with any other provision of these Terms of Service. Links from the Website If the Website contains links to other sites and resources provided by third parties, these links are provided for your convenience only. This includes links contained in advertisements, including banner advertisements and sponsored links. We have no control over the contents of those sites or resources, and accept no responsibility for them or for any loss or damage that may arise from your use of them. If you decide to access any of the third party websites linked to this Website, you do so entirely at your own risk and subject to the terms and conditions of use for such websites. Any links to third party websites or material shall not be deemed to be any endorsement of such material and website by us. Geographic Restrictions The owner of the Website is based in the Commonwealth of Pennsylvania in the United States. We provide this Website for use only by persons located in the United States. We make no claims that the Website or any of its content is accessible or appropriate outside of the United States. Access to the Website may not be legal by certain persons or in certain countries. If you access the Website from outside the United States, you do so on your own initiative and are responsible for compliance with local laws. Disclaimer of Warranties You understand that we cannot and do not guarantee or warrant that files available for downloading from the internet or the Website will be free of viruses or other destructive code. You are responsible for implementing sufficient procedures and checkpoints to satisfy your particular requirements for anti-virus protection and accuracy of data input and output, and for maintaining a means external to our site for any reconstruction of any lost data. WE WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY A DISTRIBUTED DENIAL-OF-SERVICE ATTACK, VIRUSES OR OTHER TECHNOLOGICALLY HARMFUL MATERIAL THAT MAY INFECT YOUR COMPUTER EQUIPMENT, COMPUTER PROGRAMS, DATA OR OTHER PROPRIETARY MATERIAL DUE TO YOUR USE OF THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR TO YOUR DOWNLOADING OF ANY MATERIAL POSTED ON IT, OR ON ANY WEBSITE LINKED TO IT. YOUR USE OF THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE IS AT YOUR OWN RISK. THE WEBSITE, ITS CONTENT AND ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE ARE PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS, WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED. NEITHER THE COMPANY NOR ANY PERSON ASSOCIATED WITH THE COMPANY MAKES ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, QUALITY, ACCURACY OR AVAILABILITY OF THE WEBSITE. WITHOUT LIMITING THE FOREGOING, NEITHER THE COMPANY NOR ANYONE ASSOCIATED WITH THE COMPANY REPRESENTS OR WARRANTS THAT THE WEBSITE, ITS CONTENT OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL BE ACCURATE, RELIABLE, ERROR-FREE OR UNINTERRUPTED, THAT DEFECTS WILL BE CORRECTED, THAT OUR SITE OR THE SERVER THAT MAKES IT AVAILABLE ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS OR THAT THE WEBSITE OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE WILL OTHERWISE MEET YOUR NEEDS OR EXPECTATIONS. THE COMPANY HEREBY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR PARTICULAR PURPOSE. THE FOREGOING DOES NOT AFFECT ANY WARRANTIES WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Limitation on Liability IN NO EVENT WILL THE COMPANY, ITS AFFILIATES OR THEIR LICENSORS, SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS OR DIRECTORS BE LIABLE FOR DAMAGES OF ANY KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR USE, OR INABILITY TO USE, THE WEBSITE, ANY WEBSITES LINKED TO IT, ANY CONTENT ON THE WEBSITE OR SUCH OTHER WEBSITES OR ANY SERVICES OR ITEMS OBTAINED THROUGH THE WEBSITE OR SUCH OTHER WEBSITES, INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING BUT NOT LIMITED TO, PERSONAL INJURY, PAIN AND SUFFERING, EMOTIONAL DISTRESS, LOSS OF REVENUE, LOSS OF PROFITS, LOSS OF BUSINESS OR ANTICIPATED SAVINGS, LOSS OF USE, LOSS OF GOODWILL, LOSS OF DATA, AND WHETHER CAUSED BY TORT (INCLUDING NEGLIGENCE), BREACH OF CONTRACT OR OTHERWISE, EVEN IF FORESEEABLE. THE FOREGOING DOES NOT AFFECT ANY LIABILITY WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Indemnification You agree to defend, indemnify and hold harmless the Company, its affiliates, licensors and service providers, and its and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors and assigns from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses or fees (including reasonable attorneys’ fees) arising out of or relating to your violation of these Terms of Service or your use of the Website, including, but not limited to, your User Contributions, any use of the Website’s content, services and products other than as expressly authorized in these Terms of Service or your use of any information obtained from the Website. Governing Law and Jurisdiction All matters relating to the Website and these Terms of Service and any dispute or claim arising therefrom or related thereto (in each case, including non-contractual disputes or claims), shall be governed by and construed in accordance with the internal laws of the Commonwealth of Pennsylvania without giving effect to any choice or conflict of law provision or rule (whether of the Commonwealth of Pennsylvania or any other jurisdiction). Any legal suit, action or proceeding arising out of, or related to, these Terms of Service or the Website shall be instituted exclusively in the federal courts of the United States or the courts of the Commonwealth of Pennsylvania and County of Allegheny, although we retain the right to bring any suit, action or proceeding against you for breach of these Terms of Service in your country of residence or any other relevant country. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts. Waiver and Severability No waiver of by the Company of any term or condition set forth in these Terms of Service shall be deemed a further or continuing waiver of such term or condition or a waiver of any other term or condition, and any failure of the Company to assert a right or provision under these Terms of Service shall not constitute a waiver of such right or provision. If any provision of these Terms of Service is held by a court or other tribunal of competent jurisdiction to be invalid, illegal or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent such that the remaining provisions of the Terms of Service will continue in full force and effect. Entire Agreement The Terms of Service and our Privacy Policy constitute the sole and entire agreement between you and Trib Total Media, LLC. with respect to the Website and supersede all prior and contemporaneous understandings, agreements, representations and warranties, both written and oral, with respect to the Website. Privacy Policy Introduction Trib Total Media, LLC. and any and all of its affiliates, including 535 Media, LLC, (“Company” or “We”) respect your privacy and are committed to protecting it through our compliance with this privacy policy (this “policy”). This policy describes the types of information we may collect from you or that you may provide when you visit the website TribLIVE.com (our “Website”) and our practices for collecting, using, maintaining, protecting and disclosing that information. The privacy policy of your Site must clearly disclose to end users that you are using the Solution, and provide a link to the Privacy Policy. AppendAd will continue to collect Advertisement Data in respect of Advertisement Data so long as the Implementing Code is installed, even after termination of these Terms. As such, it is your sole responsibility to remove Implementing Code if you wish to cease AppendAd’s collection and processing of the Advertisement Data. This policy is subject to and in addition to our Terms of Service. This policy applies to all information we collect: On this Website. Through social media. In e-mail, text and other electronic messages between you and this Website. When you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy. In other ways that we describe to you at the point of collection or otherwise with your consent. It does not apply to information collected by: us offline or through any other means, including on any other website operated by Company or any third party (including our affiliates and subsidiaries); or any third party (including our affiliates and subsidiaries), including through any application or content (including advertising) that may link to or be accessible from or on the Website Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using this Website, you agree to this Privacy Policy. This policy may change from time to time (see Changes to our Privacy Policy below). Your continued use of this Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates. Children Under the Age of 13 Our Website is not intended for children under 13 years of age. No one under age 13 may provide any personal information to or on the Website. We do NOT knowingly collect personal information from children under 13. If you are under 13, do not provide any information on this Website or on or through any of its features/register on the Website, make any purchases through the Website, use any of the interactive or public comment features of this Website or provide any information about yourself to us, including your name, address, telephone number, e-mail address or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us at privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084. Information We Collect About You and How We Collect It We collect several types of information from and about users of our Website, including information: by which you may be personally identified, such as name, postal address, e-mail address, telephone number, or any other identifier by which you may be contacted online or offline (“personal information”); that is about you but individually does not identify you, such as content preferences and frequency of readership; and/or about your internet connection, the equipment you use to access our Website and usage details. We collect this information: Directly from you when you provide it to us. Automatically as you navigate through the Website. Information collected automatically may include without limitation usage details, IP addresses and information collected through cookies, web beacons and other tracking technologies. Information You Provide to Us The information we collect on or through our Website may include: Information that you provide by filling in forms on our Website. This includes information provided at the time of registering to use certain features of our Website or posting material. We may also ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with our Website. Records and copies of your correspondence (including e-mail addresses), if you contact us or open an email from us. Your responses to polls, surveys or questions that we might ask you to complete. Your search queries on the Website. You also may provide information to be published or displayed (hereinafter, “posted”) on public areas of the Website, or transmitted to other users of the Website or third parties (collectively, “User Contributions”). Your User Contributions are posted on and transmitted to others at your own risk. Although we limit access to certain pages, please be aware that no security measures are perfect or impenetrable. Additionally, we cannot control the actions of other users of the Website with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons. Information We Collect Through Automatic Data Collection Technologies As you navigate through and interact with our Website, we may use automatic data collection technologies to collect certain information about you, your equipment, browsing actions and patterns, including without limitation: Details of your visits to our Website, including traffic data, location data, logs and other communication data and the resources that you access and use on the Website. Information about your identity. Information about your computer and internet connection, including your IP address, operating system and browser type. The information we collect automatically is statistical data and may include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to improve our Website and to deliver a better and more personalized service, including by enabling us to: Estimate our audience size and usage patterns. Store information about your preferences, allowing us to customize our Website according to your individual interests. Speed up your searches. Determine what products or services may be of interest to you. Recognize you when you return to our Website. The technologies we use for this automatic data collection may include without limitation: Cookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our Website. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Website. Flash Cookies. Certain features of our Website may use local stored objects (or Flash cookies) to collect and store information about your preferences and navigation to, from and on our Website. Flash cookies are not managed by the same browser settings as are used for browser cookies. For information about managing your privacy and security settings for Flash cookies, see Choices about How We Use and Disclose Your Information below. Any industry standard data and website information collection methodologies then in existence. How We Use Your Information We use information that we collect about you or that you provide to us, including any personal information: To present our Website and its contents to you. To provide you with information, products or services that you request from us. To fulfill any other purpose for which you provide it. To carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection. To notify you about changes to our Website or any products or services we offer or provide through it. To allow you to participate in interactive features on our Website. In any other way we may describe when you provide the information. For any purposes permitted under this policy or the Terms of Service. For any other purpose with your consent. We may use the information we have collected from you to enable us to display advertisements to our advertisers’ target audiences and to send emails, mailings or social media messaget to you about content, products or services. Even though we do not disclose your personal information for these purposes without your consent except as set forth herein, if you click on or otherwise interact with an advertisement, the advertiser may assume that you meet its target criteria. Disclosure of Your Information We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this Privacy Policy: To our subsidiaries and affiliates. To contractors, service providers and other third parties we use to support our business and who are bound by contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them. To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of the Company’s assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by the Company about our Website users is among the assets transferred. To fulfill the purpose for which you provide it. For any other purpose disclosed by us when you provide the information. With your consent. We may also disclose your personal information: To comply with any court order, law or legal process, including to respond to any government or regulatory request. To enforce or apply our Terms of Service and other agreements, including for billing and collection purposes. If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of the Company, other users of the Website, our customers or others. Choices About How We Use and Disclose Your Information We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information: Tracking Technologies and Advertising. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. To learn how you can manage your Flash cookie settings, visit the Flash player settings page on Adobe’s website. If you disable or refuse cookies, please note that some parts of this site may then be inaccessible or not function properly. We do not control third parties’ collection or use of your information to serve interest-based advertising. However these third parties may provide you with ways to choose not to have your information collected or used in this way. You can opt out of receiving targeted ads from members of the Network Advertising Initiative (“NAI”) on the NAI’s website. Accessing and Correcting Your Information You can review and change your personal information by logging into the Website and visiting your account profile page. If you delete your User Contributions from the Website, copies of your User Contributions may remain viewable in cached and archived pages, or might have been copied or stored by other Website users. Proper access and use of information provided on the Website, including User Contributions, is governed by our Terms of Service. Your California Privacy Rights California “Shine the Light” law permits users of our Website that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to privacy@tribweb.com or write us at: TribLive, 210 Wood Street, Tarentum, PA 15084. Changes to Our Privacy Policy We reserve the right to modify, amend, alter or change this policy at any time for any reason or no reason. It is our policy to post any changes we make to our Privacy Policy on this page. If we make material changes to how we treat our users’ personal information, we will notify you through a notice on the Website home page. The date the Privacy Policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Website and this Privacy Policy to check for any changes. Contact Information To ask questions or comment about this Privacy Policy and our privacy practices, contact us at: Email: privacy@tribweb.com U.S. Mail: TribLive, 210 Wood Street, Tarentum, PA 15084. Cookie Settings", "app": {"name": {"iphone": "TribLIVE News and Sports", "ipad": "TribLIVE News and Sports"}, "id": {"iphone": 328217517, "ipad": 328217517}, "url": {"iphone": "tribbird://", "ipad": "tribbird://"}}}}, "movies": [], "publish_date": null, "source": "http://triblive.com", "summary": ""}