{"url": "https://www.inquisitr.com/4607176/greys-anatomy-300th-episode-to-bring-back-original-docs-izzie-george-and-cristina-but-not-how-you-think/", "text": "Grey’s Anatomy fans know ghosts aren’t out of the question at Grey Sloan Memorial Hospital—a pre-Walking Dead Jeffery Dean Morgan made ghostly cameos as deceased heart patient Denny Duquette in early seasons of the show. But does that mean late doctor George O’Malley will follow in Denny’s footsteps for the upcoming Grey’s Anatomy 300th episode? Not exactly.\n\nAs the 14th season of the Grey’s Anatomy embarks on a major milestone for the show, producers will bring back three dearly departed docs for the ABC medical drama’s 300th episode—but not by bringing back the original actors. As part of a tribute to Grey’s Anatomy’s long history, the 300th episode will pay tribute to past doctors George O’Malley, Izzie Stevens, and Cristina Yang (played by T.R. Knight, Katherine Heigl, and Sandra Oh, respectively).\n\nBut the original actors have not been announced as special guest stars for the episode. Instead, hospital patients involved in a roller coaster accident who look like the original cast members will be introduced to viewers, and this will conjure up a ton of memories for the Seattle doctors left in their wake. You can see two of the lookalike patients in the Grey’s Anatomy sneak peek video below.\n\nAccording to Grey’s Anatomy star Sarah Drew ( Dr. April Kepner on the show), the 300th Grey’s Anatomy episode, titled “Who Lives, Who Dies, Who Tells Your Story,” will feature a pseudo-reunion of the original “Fab Five” interns, which also included Meredith Grey (Ellen Pompeo) and Alex Karev (Justin Chambers).\n\n“Cristina, George, and Izzie we’re thinking about a lot during this episode because our three guest actors on the show actually really look like them and remind the rest of the doctors of those characters,” Sarah Drew told Entertainment Weekly, “That causes the original group to really remember those people well and want to fight for these ones to live.”\n\n[Image by Mitch Haaseth/ABC]\n\nWhen Grey’s Anatomy debuted in 2005, Meredith Grey and her fellow four interns were just starting their careers at Seattle Grace Hospital. But 12 years later, amid death, divorce, and a whole lot of drama, only Alex and Meredith are left from the original friend group. Of the three “returning” doctors, only George O’Malley was killed off of Grey’s Anatomy. So does that leave any room for Katherine Heigl or Sandra Oh to make a cameo? Unfortunately, Heigl left the show on reportedly bad terms with showrunner Shonda Rhimes. As for Oh, her exit after 10 seasons was far more amicable, and her former TV flame, Kevin McKidd, (Dr. Owen Hunt on the show), isn’t ruling out a real-life reunion at some point.\n\n“Even though I was part of it, Cristina and Owen [were my favorite couple on the show],” McKidd told Entertainment Tonight.\n\nThe actor revealed that when his character got married to Amelia, Sandra Oh got kind of jealous. McKidd revealed he told his former co-star that she needs to come back to Grey’s Anatomy if she wants to change things—and Oh didn’t rule it out.\n\n“I hope she will,” McKidd added. ” I think it would be so much fun. It would open up so much again in the story and mix everything up.”\n\n[Image by Richard Shotwell/Invision/AP Images]\n\nAs for that 300th episode, while Sandra Oh and the other former stars won’t actually appear in it, the landmark episode will be a “poem” to loyal fans of the show.\n\n“It’s an interesting episode,” McKidd told ET. “People come into the hospital that kind of trigger memories for a lot of our doctors. It’s really cool the way the stories have been woven together to do that … There’s a lot of surprises and nuggets hidden within the episode.”\n\nThe 300th episode of Grey’s Anatomy airs Thursday, November 9 at 8 p.m. ET on ABC.\n\n[Featured Image by Todd Williamson /Invision/AP Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/11/Kevin-McKidd-Sandra-Oh.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/Greys-Anatomy-Stars.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/8881934fec783f32aef96d94ac2f65be?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/Greys-Anatomy-300th-Episode.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Victoria Miller"], "canonical_link": "https://www.inquisitr.com/4607176/greys-anatomy-300th-episode-to-bring-back-original-docs-izzie-george-and-cristina-but-not-how-you-think/", "title": "‘Grey’s Anatomy’ 300th Episode To Bring Back Original Docs Izzie, George, And Cristina—But Not How You Think", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/eU88JQmi5AE?feature=oembed"], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}