{"url": "https://www.checkpregnancy.com/cardi-b-pregnancy/", "text": "Cardi B is no stranger to headlines. The Bronx bred rapper has been on the news ever since her debut single ‘Bodak Yellow’ set the music world on fire.\n\nThe hit single was the first female-sung song to reach #1 on the Hot 100 chart since 1998. ‘Bodak Yellow’ reigned at the charts for three weeks – the joint longest by any female in 2017.\n\nHowever, this time she created headlines for a whole new reason. Belcalis Marlenis Almanza, or Cardi B as she is popularly known, has given birth to a baby girl.\n\nShe let the world know through Instagram, revealing the name of the girl, ‘Kulture Kiari Cephus.’ The caption was set against a nude floral picture of Cardi B.\n\nIs Cardi B Pregnant?\n\n“Cardi was so excited to have the baby early and has been nothing but head over heels with her baby girl,” a source shared with a private news agency. “She had a smooth delivery, and the baby was definitely ready to be here early.”\n\nThis is her first and her beau Offset’s fourth child.\n\nBorn on 10th of July 2018, Kulture has been hidden well beyond the eyes of the paparazzi for all of her existence. However, the rapper is beginning to give her fans a sneak peek into her world of being a mother.\n\nOnly recently she uploaded a video of her baby’s custom-made crib on Instagram to much interest of Hollywood.\n\nBut that’s about it. The rapper has secluded to privacy and is reluctant to share pictures of herself or her baby. The rapper even refused to confront her own cellphone camera.\n\nAs per various reports, Cardi is obsessed with Kulture and is very attached and overprotective. She has only let her family and a few friends see the baby and has been spending a lot of time at home with her husband.\n\nCardi B resorted to Instagram to thank her fans for the overwhelming support that helped her achieve 10 MTV Music Video Award Nominations. However, the video focused on a doll instead of the famous Instagram star herself.\n\nShe stated , “ It’s your girl Cardi B. I wish I could show my face right now, but a bitch looks f–ked up in the game. My hair’s f–ked up. My eyes are so dark and puffy. Like, I’m wild pale.”\n\nShe added, “I know I haven’t said anything about it but it’s because I’ve just been so busy, so tired and like in a different world, different dimension.”\n\nFrom rocking the red carpet to refusing to show her face – the birth of Kulture has signaled a change in the ways of Cardi B.\n\nShe was ‘ecstatic’ about the whole pregnancy affair and has grown very overprotective and dedicated to her newborn, according to close sources.\n\nComing off the success of her album ‘Invasion Of Privacy’ which debuted at #1 at the Billboard, the female rapper is fully committed to being an ideal mother, so much that she has rejected the idea of a nanny.\n\n‘I have not gotten a nanny yet,’ she said in a video . ‘I just want to learn how to be a mom. I want to enjoy every single second of it since I’m going back to work.’\n\nCardi B’s Pregnancy Experience\n\nNot everything has been smooth about her road to motherhood though. Cardi B has seen the highs and lows during her pregnancy. Here we will look through the highlights of the time Cardi was pregnant.\n\nFirstly, she was hit by a cheating rumor regarding Offset in December 2017, just two months after he proposed her in a concert. Hackers had released private images of Offset which sparked the rumors. She was in her initial stages of pregnancy at that time.\n\nShe was reportedly upset but asked for privacy and respect from the media. She said, “I’m going to make a decision in my own times with my heart and mind. I don’t need to be rushed or be told what to do.”\n\nThe two made peace and moved on rather affectionately, spotted in the 2018 Grammy’s in January.\n\nThe rapper had said in an interview at the 2018 Grammy Awards that somebody is always saying that she’s pregnant every two weeks. “So it’s just like, if ya’ll wanna know, ask me, I’ll tell ya,” she added.\n\nShe remained tight-lipped during the whole affair, responding to pregnancy questions by saying she’s getting fat. A reply to a followers question read “No bitch I’m just getting fat. Let me fat in peace.”\n\nDuring this period Cardi B was attending functions in heavy, well-covered dresses with extravagant frills and puffs that did well to hide the baby bump. While many speculated the reason behind the change in design, for most it was just a fashion tweak.\n\nThe announcement came in April, as she was hosting the SNL Live with actor Chadwick Boseman. Dressed in a skin-tight gown that revealed the baby bump in all its grace, the rapper addressed the world.\n\nIn response to the mean comments, she reiterated her desire for privacy. “This is why I did not want to say nothing,” she wrote on Instagram. “People be so thirsty to scrutinize and try to destroy something that is supposed to be a blessing.”\n\nIn a later interview, she revealed she had some doubts about the whole pregnancy thing. However, she was determined to go on and be a mother. Cardi was recorded saying, “You know what—I’m a grown woman. I’m 25 years old. I’m a schmillionaire and I’m prepared for this.”\n\nWhile she was setting the industry ablaze previously, she did not stop with pregnancy. Cardi performed at Coachella 2018 along with gracing prestigious events, the Billboard Latin Music Awards and the Met Gala.\n\nIn May, she revealed in an interview that the child is going to be a girl. This revelation was followed by another major revelation.\n\nIn May, Rolling Stone unveiled their cover for the July edition. It showed Offset kissing Cardi’s baby bump. She revealed that the two secretly got married last year.\n\nShe added to the revelation in typical fashion. “Well now since you lil nosey f–ks know at least ya can stop saying I had a baby out of wedlock.”\n\nSince July, Cardi B had dedicated her time and energy to her baby. Now that Kulture is here safe and sound, she will look to return to work.\n\nThe upcoming weeks are all reserved to her motherhood before she leaves for a tour with Bruno Mars in September.\n\nRelevant Topics:\n\nNorth West Stylist: Baby North West Has Her Own Stylist\n\nPerfect Baby Names for Kate Middleton & Prince William’s Third Child\n\nJohn Stamos Opens Up About His Parenting Struggles", "images": ["https://www.checkpregnancy.com/wp-content/uploads/2018/08/pregnancy.png?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2015/08/periodafteramiscarriage-100x70.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/08/cardi-bs-pregnancy.jpg", "https://www.checkpregnancy.com/wp-content/uploads/2019/10/pasted-image-0-100x70.png?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/08/Cardi-B’s-Pregnancy-1.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/04/logo1-300x111.png?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/08/hollywood-celebrities-and-their-pregnancy-218x150.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/08/Meghan-Markle-218x150.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2016/06/Infertility-2.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2019/10/2-100x70.png?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/11/Amazing-Thanksgiving-History--218x150.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2016/06/PCOS-anatomy.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/08/chrissy-teigen-is-giving-parenting-goals-218x150.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2016/03/Swimming-while-pregnant.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2016/10/Too-protective.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/10/The-History-of-Halloween-1-218x150.jpg?x65456", "https://www.checkpregnancy.com/wp-content/uploads/2018/08/John-Stamos-parenting-struggles-218x150.jpg?x65456"], "top_img": "https://www.checkpregnancy.com/wp-content/uploads/2018/08/cardi-bs-pregnancy.jpg", "keywords": [], "authors": ["Please Enter Your Name Here"], "canonical_link": "https://www.checkpregnancy.com/cardi-b-pregnancy/", "title": "A Look Back at Cardi B’s Pregnancy as Her Due Date Approaches", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": {"identifier": "https://www.checkpregnancy.com/wp-content/uploads/2018/08/cardi-bs-pregnancy.jpg", "secure_url": "https://www.checkpregnancy.com/wp-content/uploads/2018/08/cardi-bs-pregnancy.jpg", "width": 1000, "height": 667}, "locale": "en_US", "type": "article", "title": "A Look Back at Cardi B’s Pregnancy as Her Due Date Approaches", "description": "Cardi B is no stranger to headlines. The Bronx bred rapper has been on the news ever since her debut single ‘Bodak Yellow’ set the music world on fire. The hit single was the first female-sung song to reach #1 on the Hot 100 chart since 1998. ‘Bodak Yellow’ reigned at the charts for three …", "url": "https://www.checkpregnancy.com/cardi-b-pregnancy/", "site_name": "CheckPregnancy"}, "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "article": {"section": "News & Stories", "published_time": "2018-08-09T07:19:54+00:00"}, "generator": "WordPress 5.2.5"}, "movies": [], "publish_date": 1533799194.0, "source": "https://www.checkpregnancy.com", "summary": ""}