{"url": "https://www.vulture.com/2018/01/everything-you-need-to-know-about-the-2018-grammys.html", "text": "We’ve told you our predictions for the 2018 Grammys, now let’s dive into what’s been confirmed (or at least strongly reported) will happen on Music’s Biggest Night. The Grammys get underway this Sunday, January 28, on CBS at 7:30 p.m. ET, slightly earlier than usual. So set your alarms accordingly! But even before the stars take the stage, nearly 100 awards will be handed out offscreen — think most genre-specific categories like rap, country, R&B, etc. — in a pre-ceremony that kicks off at 3 p.m. ET; it’ll be livestreamed on CBS and the Grammys’ respective sites. The main event can also be streamed with a CBS subscription (here’s a handy guide to how to watch). For all your other 2018 Grammys FAQ, we’ve got you covered.\n\nLocation\n\nThey’ve moved! For the first time in 15 years, the Grammys this year are being hosted in New York City, specifically at Madison Square Garden. And with NYC, comes NYC weather: So far, the forecast for Sunday looks rainy and not particularly warm (though 50 degrees here in January may as well be spring). Expect to see a lot of hasty red-carpet interviews, space heaters, and stylists frantically trying to pair dresses and suits with outerwear. The reason they’re happening in January and not the usual February is due to a scheduling conflict this year with the Winter Olympics, which kicks off next month. Also new to this year’s show is Grammy voters’ ability to cast their ballots entirely online for the first time ever, which could affect the outcome across the board. (It’s possible more people will have voted this year now that it’s paperless and not location-dependent.)\n\nHost\n\nJames Corden will return for a second year, likely bringing this year’s Carpool Karaoke segment to a yellow cab. When in New York! And given the night’s planned nod to Broadway legends, you can bet the repeat Tonys host will waste no opportunity to get in on the action.\n\nNominees\n\nThis year’s Grammy nominations are notable for giving widespread attention to artists of color in all the top categories, though representation is scarce overall for women. Jay-Z leads the pack with eight nominations, followed by Kendrick Lamar with seven and Bruno Mars with six. Hov will attempt to go for his first-ever Album of the Year, but he’s up against stiff competition like Kendrick Lamar, Bruno Mars, Lorde, and Childish Gambino. Song of the Year looks to be a showdown between Logic’s “1-800-273-8255,” Jay-Z’s “4:44,” and possibly “Despacito,” while there’re also Julia Michaels and Bruno Mars in the mix. Record of the Year could see “Despacito” make history, but it’ll have to beat out the likes of Jay-Z, Kendrick Lamar, Bruno Mars, and Childish Gambino. This year’s Best New Artist field is a crop of fresh talent including SZA, Khalid, Lil Uzi Vert, Julia Michaels, and Alessia Cara, though SZA is the likely favorite. For more predictions, check out Vulture’s comprehensive breakdown.\n\nTributes\n\nPatti LuPone and Ben Platt: It wouldn’t be Music’s Biggest Night in New York City without some show tunes. LuPone and Platt will lead a Broadway invasion as part of a special tribute to Andrew Lloyd Webber and Leonard Bernstein. She’ll reprise her iconic 1981 Grammy performance of “Don’t Cry for Me, Argentina” from Evita (and she and Webber have ended their decades-old feud!), while Platt will sing a song from West Side Story. (Surely to double as his audition tape for Spielberg’s remake.)\n\nKesha: She’ll reportedly sing “Praying” with Cyndi Lauper, Camila Cabello, Julia Michaels, and Andra Day as part of a special moment acknowledging #MeToo and Time’s Up. (More on that below.) She’s confirmed her performance, saying that she’s “so proud and nervous and overwhelmed” to sing her “emotional raw victory” song at the Grammys.\n\nEric Church, Maren Morris, Brothers Osborne: The Grammys will reunite these three Route 91 Harvest festival performers for a tribute to the victims of the Las Vegas shooting, as well as of all gun violence.\n\nJon Batiste and Gary Clark Jr: The leader of Stephen Colbert’s Late Show house band will be joined by the Grammys’ perennial tribute performer to honor the late Chuck Berry and Fats Domino.\n\nElton John and Miley Cyrus: Sam Smith, Chris Martin, and Miley will honor Elton John, who is retiring from touring in 2021, at a separate Grammys-affiliated concert for the legend days after the awards show. But first, Elton and Miley will join forces onstage at the Grammys for two of his songs, because the Grammys love odd couples.\n\nOther Performers\n\nKendrick Lamar: He’ll open the show, reportedly with U2 and, somehow, Dave Chappelle.\n\nU2: They’ll perform from a barge in the middle of the Hudson River, though not exactly live. It’ll reportedly air as a pre-taped performance, filmed Friday night, after which they’re said to join Kendrick Lamar live on stage as part of the show’s opening. (The two acts have collaborated on both of their latest albums.)\n\nLogic, Alessia Cara, and Khalid: The trio will perform their nominated suicide prevention song joined by a group of suicide attempt survivors and those who’ve lost loved ones to suicide selected by the National Suicide Prevention Lifeline.\n\nLuis Fonsi and Daddy Yankee: They’ll perform “Despacito” with Zuleyka Rivera, but sans Justin Bieber mangling his Spanish.\n\nRihanna, DJ Khalid, and Bryson Tiller: They’ll perform “Wild Thoughts.”\n\nBruno Mars and Cardi B: They’ll perform their “Finesse” remix.\n\nLady Gaga\n\nChris Stapleton and Emmylou Harris\n\nPink\n\nSam Smith\n\nSting (please be with Shaggy!)\n\nSZA\n\nLittle Big Town (could this mean a surprise appearance from Taylor Swift?)\n\nLorde reportedly declined to perform after not being offered a solo spot like her male Album of the Year competitors. According to Variety, she was asked to perform “American Girl” as part of a collective Tom Petty tribute.\n\nDespite being the most-nominated artist and the show happening in his home city, Jay-Z will reportedly not perform, though he and Beyoncé are expected to attend.\n\n#MeToo\n\nWhile #MeToo has been a watershed moment for Hollywood, it’s had barely any ramifications for the music industry, which has mostly carried on with business as usual. Beyond Russell Simmons, some rumblings about L.A. Reid, and a disgraced band member here and there, music has all but kept out of the conversation. But at Sunday’s show, artists have been asked to wear white roses in solidarity with the movement. According to the New York Times, female music executives sent out a mass email on Wednesday encouraging attendees to participate after they contacted Time’s Up about getting involved. Corden has said he’ll wear a rose, while Halsey, Dua Lipa, Rapsody, Lady Gaga, and more have also committed to wearing one. Recording Academy president Neil Portnow told the Associated Press that he wasn’t informed enough about the white rose initiative to confirm if he would join in wearing one.\n\nBut #MeToo won’t just be relegated to the red carpet. Corden teased that there will be a special performance that acknowledges the movement and shows support for Time’s Up, saying, “It’s going to be a moving movement.” The Times reports that the performance will be led by Kesha, whose legal battle against Dr. Luke is the closest the music business has come to its own #MeToo moment in recent history, though her fight predates it.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/01/26/26-grammy-guide-1.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/181/262/b6164dc72817749703b366c46416674acc-26-grammy-guide-1.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/181/262/b6164dc72817749703b366c46416674acc-26-grammy-guide-1.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Dee Lockett"], "canonical_link": "https://www.vulture.com/2018/01/everything-you-need-to-know-about-the-2018-grammys.html", "title": "Everything You Need to Know About the 2018 Grammys", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Everything You Need to Know About the 2018 Grammys", "url": "https://www.vulture.com/2018/01/everything-you-need-to-know-about-the-2018-grammys.html", "description": "The performers, location change, and how the night will address #MeToo.", "image": "https://pyxis.nymag.com/v1/imgs/181/262/b6164dc72817749703b366c46416674acc-26-grammy-guide-1.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Everything You Need to Know About the 2018 Grammys", "description": "The performers, location change, and how the night will address #MeToo.", "image": "https://pyxis.nymag.com/v1/imgs/181/262/b6164dc72817749703b366c46416674acc-26-grammy-guide-1.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-01-26T14:31:19.866-05:00", "tag": "grammys 2018, vulture guides, music, kesha, james corden", "publisher": "https://www.facebook.com/Vulture"}, "description": "Your guide to the 2018 Grammys: the performers, host, location, and #MeToo. Chris Martin, U2, Cardi B, and many more.", "sailthru.tags": "grammys 2018, vulture guides, music, kesha, james corden", "author": "Dee Lockett", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1516995079.866, "source": "https://www.vulture.com", "summary": ""}