{"url": "https://web.archive.org/web/20170106205954/http://www.forbes.com/sites/brandonkatz/2017/01/06/megyn-kelly-replacing-savannah-guthrie-on-today-show/", "text": "Is morning television on the brink of a major change? NBC chairman Andy Lack just signed Megyn Kelly to a major deal, and now the New York Post reports that there are rumors at the Peacock Network that the former Fox News star could take over for Savannah Guthrie on the Today show.\n\nThough Kelly had taken pitches from ABC and CNN after leaving FOX, the promise of a daytime slot and a Sunday night show at NBC was too much for her to pass up. However, there may not be much to the Today rumors — NBC insists that Guthrie, who is currently on maternity leave and recently signed a five-year deal with Today, isn’t going anywhere.\n\n“We just signed Savannah to a massive deal that is longer than Megyn’s,” a high-level NBC source told Page Six. “A lead anchor role at Today isn’t part of the conversation for Megyn. The goal was simply to get someone of Megyn’s talent and caliber through the door at NBC. We have not made a decision on her daytime slot. It is being discussed.”\n\nIt was rumored that Kelly was in deep talks with ABC to replace Robin Roberts on Good Morning America, though network officials have denied any such reports.\n\nKelly, who was FOX’s No. 2 anchor for some time behind Bill O’Reilly, announced earlier this month that she would be leaving the network for NBC News. Her decision comes after Greta Van Susteren also departed FOX last fall in favor of MSNBC, leaving the network without its top two female anchors. Mediaite claimed that FOX had offered Kelly as much as $100 million to remain, though it seems money did not sway her final decision. She will be replaced by The Daily Caller founder Tucker Carlson.\n\nAlso on FORBES:\n\n“I have grown up here and been given every chance a young reporter could ever ask for,” she said while praising Rupert Murdoch and the FOX family.\n\nKelly spent 12 years with FOX, quickly climbing up the ranks and becoming a nationally recognized brand. President-elect Trump’s attacks on her during the election cycle helped raise her profile even more. However, a possible Today gig is a far different animal than the 9 p.m. slot Kelly is used to, with audiences typically favoring entertainment stories and lighter subject matter as opposed to her traditional hard news.\n\nWill Carlson, who has had an up-and-down career in front of the cameras, be an effective replacement at FOX? Will NBC push Guthrie out on Today in favor of Kelly? The answers to both questions will have far reaching impacts for their respective networks.\n\nSave\n\nSave\n\nSave\n\nSave\n\nSave\n\nSave\n\nIf you like what you're reading, follow @Great_Katzby on Twitter.", "images": ["https://web.archive.org/web/20170106205954im_/http://specials-images.forbesimg.com/imageserve/12035ee89b23417cab8d292a7f3bceec/640x434.jpg?fit=scale"], "top_img": "https://web.archive.org/web/20170106205954im_/http://specials-images.forbesimg.com/imageserve/12035ee89b23417cab8d292a7f3bceec/640x434.jpg?fit=scale", "keywords": [], "authors": ["Brandon Katz"], "canonical_link": "https://web.archive.org/web/20170106205954/http://www.forbes.com/sites/brandonkatz/2017/01/06/megyn-kelly-replacing-savannah-guthrie-on-today-show/", "title": "Could Megyn Kelly Replace Savannah Guthrie On 'Today' Show?", "meta_data": {"referrer": "origin", "viewport": "width=device-width,initial-scale=1,minimum-scale=1,maximum-scale=1,user-scalable=no,minimal-ui", "description": "Megyn Kelly ditched FOX for NBC, but will she get the lead anchor gig on 'Today?'", "author": "Brandon Katz", "article": {"section": "Business", "section_url": "//www.forbes.com/business", "id": "blogAndPostId/blog/post/4570-438", "published": "2017-01-06", "modified": "2017-01-06", "publisher": "https://www.facebook.com/forbes"}, "apple-itunes-app": "app-id=588647136", "og": {"title": "Could Megyn Kelly Replace Savannah Guthrie On 'Today' Show?", "site_name": "Forbes", "type": "article", "url": "https://web.archive.org/web/20170106205954/http://www.forbes.com/sites/brandonkatz/2017/01/06/megyn-kelly-replacing-savannah-guthrie-on-today-show/", "image": "https://web.archive.org/web/20170106205954im_/http://specials-images.forbesimg.com/imageserve/12035ee89b23417cab8d292a7f3bceec/640x434.jpg?fit=scale", "description": "Megyn Kelly ditched FOX for NBC, but will she get the lead anchor gig on 'Today?'", "updated_time": "2017-01-06T10:43:56-05:00"}, "fb": {"app_id": 123694841080850}, "twitter": {"card": "summary_large_image", "site": "@forbes", "creator": "@Great_Katzby", "title": "Could Megyn Kelly Replace Savannah Guthrie On 'Today' Show?", "description": "Megyn Kelly ditched FOX for NBC, but will she get the lead anchor gig on 'Today?'", "image": "https://web.archive.org/web/20170106205954im_/http://specials-images.forbesimg.com/imageserve/12035ee89b23417cab8d292a7f3bceec/640x434.jpg?fit=scale"}}, "movies": [], "publish_date": 1483632000.0, "source": "https://web.archive.org", "summary": ""}