{"url": "https://www.romper.com/p/will-there-be-a-season-3-of-the-arrangement-fans-want-the-drama-to-continue-9012915", "text": "UPDATE: Unfortunately, The Arrangement has been canceled by E! and wil not be getting a third season. The second season of The Arrangement was even wilder and more twisted than the first, which would explain why fans are so hooked. Now that the season is coming to a close, though, it's only natural to start wondering: will there be a Season 3 of The Arrangement? At this point, it's hard to say for sure one way or the other.\n\nThe drama series hasn't been renewed yet, but it's also a little early for a renewal. The higher ups at E! will most likely wait until after the season finale before they make a decision, and even then it may take a little more time before there's news about the show's future. Still, right now it's certainly not looking good for The Arrangement. Compared to its first season, Season 2's ratings are down almost 40 percent, and haven't improved over the course of the season.\n\nIt seems less and less people are tuning in, and if no one's watching or talking about the show, than it's likely that the network will decide to cancel the series altogether. Thankfully, fans of the show have already taken to social media to make their voices heard about wanting a third season, and that's the best indicator to the network that they should keep the show going. But will fan pleas be enough? Unfortunately, you'll just have to wait and see.\n\nFor now though, fans have a lot to look forward to going into the season finale. The penultimate episode was filled with drama. After Megan learned Kyle's darkest secret — that he caused a man to become paralyzed from the waist down — Megan was able to forgive him, anyway. Kyle even went to talk to the man, Aaron, and while they certainly aren't BFFs, they're now on good terms. Or, at least, it seemed like they were.\n\nAfter Kyle's secret was revealed, Megan was officially done with Terence and The Institute of the Higher Mind (IHM). Megan told Kyle he had to choose — either IHM or her. Thankfully, Kyle made the right decision and went with Megan. At their wedding rehearsal, the pair dropped the bomb on Terence letting him know Kyle was out. Being as nice about it as possible, Kyle said he'd leave quietly so it wouldn't be embarrassing for Terence.\n\nRegardless of any niceties, Terence apparently didn't take it well because when Megan went to check on Aaron and his partner, Julie, they were nowhere to be found. Since only Megan and Kyle knew where they were hiding out, Megan accused Kyle of spilling the means to Terence and not really leaving IHM after all. Kyle denied it, but Megan didn't believe him and on the eve of their wedding she left him and went straight into the arms of Xavier, who she ended up making out with. Yikes!\n\nE! Entertainment on YouTube\n\nIt looks like this wedding isn't going to happen. Can Kyle turn this around somehow and prove to Megan he wasn't the one who gave away Aaron's location? Perhaps, but is Kyle really as innocent as he claims or did he actually do what Megan accused him of? Hopefully the season finale will give viewers some much needed answers, but knowing this show you can most likely expect the finale to end on a bit of a cliffhanger.\n\nTo find out what's in store for Megan and Kyle — and to see if they actually do make it down the aisle — make sure to tune in for the season finale of The Arrangement on Sunday, May 13 at 9 p.m. ET on E!", "images": ["https://imgix.bustle.com/uploads/image/2020/4/18/63b9053a-d565-4200-b06b-71e3762be4aa-screen-shot-2020-04-17-at-114519-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/image/2018/5/9/81e37f07-32d2-42f3-85e6-06c67c50be8d-bodybuilders_cta_hubs.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/8/80a1dd30-f4c4-42ba-b51f-8e3af19e55f1-nup_180320_0393.JPG?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/8/80a1dd30-f4c4-42ba-b51f-8e3af19e55f1-nup_180320_0393.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/16/2f761a69-d2b0-4c45-9d35-44f6e18e5a5d-workin-moms.PNG?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/3/30/c891a522-cab5-4500-9a2e-57cc3dcaa68d-screen-shot-2020-03-30-at-35645-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/8/80a1dd30-f4c4-42ba-b51f-8e3af19e55f1-nup_180320_0393.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/will-there-be-a-season-3-of-the-arrangement-fans-want-the-drama-to-continue-9012915", "title": "Will There Be A Season 3 Of ‘The Arrangement’? Fans Want The Drama To Continue", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/will-there-be-a-season-3-of-the-arrangement-fans-want-the-drama-to-continue-9012915", "type": "article", "title": "More Episodes Of ‘The Arrangement’ Could Be On The Way", "description": "UPDATE: Unfortunately, The Arrangement has been canceled by E! and wil not be getting a third season. The second season of The Arrangement was even wilder and more twisted than the first, which would explain why fans are so hooked. Now that the…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/8/80a1dd30-f4c4-42ba-b51f-8e3af19e55f1-nup_180320_0393.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "UPDATE: Unfortunately, The Arrangement has been canceled by E! and wil not be getting a third season. The second season of The Arrangement was even wilder and more twisted than the first, which would explain why fans are so hooked. Now that the…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}