{"url": "comicbook.com/tv-shows/2017/12/13/chilling-adventures-of-sabrina-netflix-tv-show-selena-gomez/", "text": "Netflix is set to bring Archie Horror's Chilling Adventures of Sabrina to the small screen, but it looks like one former teenage witch won't be a part of it.\n\nDuring a recent interview on BBC's Radio 1 Breakfast Show, Selena Gomez was asked about the possibility of her starring in the series, which is currently being called Sabrina. But as she revealed, the role isn't in the cards, so much so that she hasn't even heard about the part.\n\n\"I love that!\" Gomez revealed. \"That's new information for me. No, that's a rumor.\"\n\nWhile most know Gomez now for her music career, she actually got her start starring in Disney Channel's Wizards of Waverly Place. This, combined with her working relationship with Netflix on 13 Reasons Why, made many of her fans suggest that she should play the new Sabrina Spellman. But as Gomez explained, she doesn't plan to return to the realm of television witchcraft anytime soon.\n\n\"I've done my magic enough,\" Gomez added.\n\nThe Sabrina reboot was first announced earlier this year, with many eagerly trying to predict who would land the title role. Early reports have suggested that the casting call for Sabrina is open ethnicity, and that her relationship with both Harvey Kinkle and her aunts will come into play.\n\nThe series will also serve as a spinoff of The CW's hit series Riverdale, leaving the door open for crossovers during the line. And as Riverdale and Sabrina showrunner Roberto Aguirre-Sacasa explained, there will be a bit of a shared supernatural aura between the two.\n\n“There’s no secret that I love that character, and that that character is a huge part of the Archie universe,” Aguirre-Sacasa told ComicBook.com after Riverdale's season one finale. \"The show kind of has hints of the supernatural throughout it; there are visions of Jason as a ghost, as a zombie. Archie sees werewolves. There’s a lot of talk about angry, pagan gods and there’s a voodoo doll. We are going to continue exploring the idea of the supernatural being on the fringes of Riverdale, and that might be to lead up to Sabrina’s arrival or that might just be to make it more like Twin Peaks and the way they dealt with the supernatural.\"\n\nSabrina will premiere on Netflix sometime in 2018.", "images": ["https://media.comicbook.com/2017/12/selena-gomez-sabrina-the-teenage-witch-1065886-640x320.jpg", "https://media.comicbook.com/2017/12/sabrina-temp-default-1062517.jpg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png"], "top_img": "https://media.comicbook.com/2017/12/selena-gomez-sabrina-the-teenage-witch-1065886-640x320.jpg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/tv-shows/2017/12/13/chilling-adventures-of-sabrina-netflix-tv-show-selena-gomez/", "title": "Selena Gomez Responds to 'Sabrina' Casting Rumors", "meta_data": {"description": "Netflix is set to bring Archie Horror's Chilling Adventures of Sabrina to the small screen, but it looks like one former teenage witch won't be a part of it.During a recent interview on BBC's Radio 1 Breakfast Show, Selena Gomez was asked about the possibility of her starring in the series, which [...]", "keywords": "Chilling Adventures of Sabrina,Selena Gomez,Netflix,Archie Horror,Chilling Adventures of Sabrina", "news_keywords": "Chilling Adventures of Sabrina,Selena Gomez,Netflix,Archie Horror,Chilling Adventures of Sabrina", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Selena Gomez Responds to 'Sabrina' Casting Rumors", "description": "Netflix is set to bring Archie Horror's Chilling Adventures of Sabrina to the small screen, but [...]", "image": "https://media.comicbook.com/2017/12/selena-gomez-sabrina-the-teenage-witch-1065886-640x320.jpg"}, "og": {"title": "Selena Gomez Responds to 'Sabrina' Casting Rumors", "type": "article", "url": "https://comicbook.com/tv-shows/2017/12/13/chilling-adventures-of-sabrina-netflix-tv-show-selena-gomez/", "image": {"identifier": "https://media.comicbook.com/2017/12/selena-gomez-sabrina-the-teenage-witch-1065886-640x320.jpg", "width": 640, "height": 320}, "site_name": "TV Shows", "description": "Netflix is set to bring Archie Horror's Chilling Adventures of Sabrina to the small screen, but [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1513094400.0, "source": "http://comicbook.com", "summary": ""}