{"url": "https://www.hollywoodreporter.com/news/naacp-image-awards-2018-party-things-you-didnt-see-tv-1074934", "text": "A ton of excitement for Marvel's 'Black Panther,' a strong statement from Maxine Waters, a 'Key & Peele' reunion and a 'Stranger Things' star's sweet dance moves.\n\nAva DuVernay, Anthony Anderson, Tracee Ellis Ross, Daniel Kaluuya and Omari Hardwick won big at the NAACP Image Awards, applauding the creative accomplishments of people of color. But there were a few memorable moments that didn't make TV One's live telecast from the Pasadena Civic Auditorium. The Hollywood Reporter shares the things the live broadcast missed:\n\n1. Before host Anderson kicked off his opening monologue with talk of Oprah Winfrey's potential presidential run (“Why would she move to a smaller house?”), attendees turned to THR to brainstorm who her running mate could be. Lil Rel Howery suggested Gayle King, Loretta Devine mentioned Tyler Perry and Yvonne Orji hoped for Michelle Obama. Storm Reid, who is 14 years old and won’t be eligible to vote in 2020, said of her Wrinkle in Time co-star, “I’d vote for her if I could — it’s way better than what we have right now!”\n\n2. Anticipation was high for the upcoming Marvel movie Black Panther, as its stars Chadwick Boseman, Michael B. Jordan, Danai Gurira, Sterling K. Brown and Kaluuya were in attendance. \"It's gonna change the world — I genuinely felt that on set,\" Kaluuya told THR. Attendees also lamented the myth that \"black movies\" don't sell internationally — Yvette Nicole Brown explained, \"That's crap.... You love our butts, our lips, our music, our sports prowess, you love our inventions and you love that we built this entire country, but somehow you can't watch us play a mother in a movie or play an action star in a movie? Somehow that's just a stretch?\"\n\n3. However, attendees were split when it came to the HBO series Insecure, as THR polled whether people are rooting for the character Issa or for Lawrence. Girls Trip's Malcolm D. Lee is pulling for Lawrence, and Danielle Brooks is backing Issa.\n\n4. The first award of the night was presented by Kerry Washington, Tracee Ellis Ross, Lena Waithe, Jurnee Smollett-Bell, Angela Robinson and Laverne Cox, who also shared a powerful message on behalf of the initiative Time's Up. The group said that black women had \"always been on the front lines of change\" and challenged viewers to \"stand by us, stand for us, stand with us.\" Unfortunately, since the ceremony was a live telecast, doors to the auditorium closed once the show began and only let people in during commercial breaks. That means dozens of attendees — including Empire's Jussie Smollett, whose own sister was onstage — were stuck in the lobby, watching the moment on a big-screen TV.\n\n5. During the commercial break, a microphone was passed to representative Maxine Waters, who stood up to introduce her guest: Gwen Carr, the mother of Eric Garner. She then told the venue to great applause, “We’re gonna impeach Trump.”\n\n6. After the ceremony — which closed with DuVernay's uplifting speech and a standing ovation — the party continued with a bash next door at the Pasadena Ballroom, which was also the setting for a Key & Peele reunion, as former co-stars Keegan-Michael Key and Jordan Peele caught up while grabbing a drink at the bar.\n\n7. The kids of Blackish, This Is Us and Stranger Things kicked things off on the dance floor, forming a circle and showing off their best moves. Caleb McLaughlin, who won the award for best youth performance, got massive applause for his spins and splits.", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/08/2psfljou_400x400.jpg", "https://cdn1.thr.com/sites/default/files/2018/01/317a3e37-4857-4429-a968-b9d7ac786a67.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/01/317a3e37-4857-4429-a968-b9d7ac786a67.png", "keywords": [], "authors": ["Ashley Lee", "Ashley.Lee Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/naacp-image-awards-2018-party-things-you-didnt-see-tv-1074934", "title": "NAACP Image Awards: 7 Things the TV Cameras Missed", "meta_data": {"viewport": "width=device-width", "description": "A ton of excitement for Marvel's 'Black Panther,' a strong statement from Maxine Waters, a 'Key & Peele' reunion and a 'Stranger Things' star's sweet dance moves.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/naacp-image-awards-2018-party-things-you-didnt-see-tv-1074934", "domain": "https://www.hollywoodreporter.com/", "title": "NAACP Image Awards: 7 Things the TV Cameras Missed", "description": "A ton of excitement for Marvel's 'Black Panther,' a strong statement from Maxine Waters, a 'Key & Peele' reunion and a 'Stranger Things' star's sweet dance moves.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/01/317a3e37-4857-4429-a968-b9d7ac786a67.png"}, "og": {"site_name": "The Hollywood Reporter", "title": "NAACP Image Awards: 7 Things the TV Cameras Missed", "description": "A ton of excitement for Marvel's 'Black Panther,' a strong statement from Maxine Waters, a 'Key & Peele' reunion and a 'Stranger Things' star's sweet dance moves.", "url": "https://www.hollywoodreporter.com/news/naacp-image-awards-2018-party-things-you-didnt-see-tv-1074934", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/01/317a3e37-4857-4429-a968-b9d7ac786a67.png", "width": 1280, "height": 720, "type": "image/png"}, "type": "article"}, "sailthru.title": "NAACP Image Awards: 7 Things the TV Cameras Missed", "sailthru.description": "A ton of excitement for Marvel's 'Black Panther,' a strong statement from Maxine Waters, a 'Key & Peele' reunion and a 'Stranger Things' star's sweet dance moves.", "sailthru.author": "Ashley Lee", "sailthru.vertical": "Awards", "sailthru.date": "2018-01-16 07:05:01", "sailthru.tags": "Awards,NAACP Image Awards"}, "movies": [], "publish_date": 1516057501.0, "source": "https://www.hollywoodreporter.com", "summary": ""}