{"url": "www.inquisitr.com/4899991/katie-holmes-is-not-pregnant-with-jamie-foxxs-child-debunked/", "text": "Katie Holmes is not pregnant with Jamie Foxx’s child. Rumors that Katie might be expecting her first child with the actor began circulating after reports suggested the former Dawson’s Creek star had been telling her friends that she and Foxx were going to have a baby.\n\nAccording to a May 14 report by Gossip Cop, the rumors about Katie Holmes being pregnant with Jamie Foxx’s child is completely untrue. A rep for the actress has reportedly confirmed to the website that she is “not expecting” a child at all.\n\nThe pregnancy rumors began when a source allegedly told Woman’s Day that Katie Holmes had been telling her close friends she was expecting Jamie Foxx’s child after months of not drinking alcohol and wearing bagging clothing. The report reveals that Katie finally confessed her pregnancy, and revealed that she and Jamie were expecting a baby girl and that the child was due in December.\n\nThe report also claimed that Katie Holmes had been suffering from some health complications during the alleged pregnancy, and was required to be on bed rest. However, the insider added that she was feeling much better and that Jamie had been going to “every single doctor’s appointment” with her. However, the pregnancy news simply isn’t true according to Holmes’ camp.\n\nJamie Foxx NOT “Ready To Tie The Knot” With Katie Holmes, Despite Late And Wrong Report https://t.co/KLNZtlbki9 pic.twitter.com/CSIIFw2vsr — Gossip Cop (@GossipCop) May 11, 2018\n\nMeanwhile, People Magazine recently reported that while Katie Holmes and Jamie Foxx aren’t keeping their relationship a secret, they do like to make sure it is “under the radar.” A source told the magazine that Holmes and Foxx are “happy” and that Jamie will “always go out of his way to stay discreet” when it comes to his love life.\n\nWhile Holmes and Foxx have been dating under the radar for quite awhile, the couple still doesn’t want to place a label on their relationship. The insider claims that the pair doesn’t think of themselves as a couple in the “traditional sense,” and that they “don’t want” to have any expectations thrust upon them when they are seen out together in public.\n\nIt looks like Katie Holmes and Jamie Foxx are creating their own rules when it comes to their low key romance, and that they’re seemingly not starting to a family together anytime soon.", "images": ["https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/Jamie-Foxx-Katie-Holmes.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4899991/katie-holmes-is-not-pregnant-with-jamie-foxxs-child-debunked/", "title": "Katie Holmes Is Not Pregnant With Jamie Foxx’s Child [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}