{"url": "https://www.etonline.com/rhonj-melissa-gorga-says-she-knew-danielle-staubs-marriage-wasnt-going-to-last-exclusive-114584", "text": "Where there’s a Danielle, there’s drama.\n\nThat’s at least true on The Real Housewives of New Jersey. While OG Housewife Danielle Staub is just a “friend” of the cast this season, Melissa Gorga promises she’s at the heart of much of what goes down in the episodes to come.\n\n“I think Danielle is always good for the wow factor,” Melissa tells ET. “When Danielle comes in, she's very passionate … so, it brings a really good flavor of like that passion, like crazy… I can't explain it, but she brings something to the table.”\n\nDanielle only makes brief appearances in the season nine trailer, most of them in flashes of dramatic moments that have little context. One of those moments is Melissa flipping out while the ladies are in Mexico on their all-cast trip. The 39-year-old screams at, seemingly, Danielle, “You got the wrong f**king girl!”\n\n“I think everyone knows me by now, to have Melissa Gorga, like, wig out and go crazy, you really have to push my buttons to the limit,” she teases. “So, when we're away in Cabo, I have a moment. I watch it back and I'm like, 'Ooh! I look like a tough girl. Oh, my God!’ I'm really not mean like this, but somebody must have pushed my buttons! Let's put it that way.”\n\nMelissa says that as far as she knows, Danielle won’t get confessional interviews this season like the rest of the cast to explain her side of everything. That means viewers will only experience all the Danielle drama through the lens of her co-stars, and most of the cast isn’t on great terms with the 56-year-old. Today, Melissa says it’s really only her sister-in-law, Teresa Giudice, who keeps up with Danielle.\n\nRodrigo Varela / Getty Images\n\nIt’s an unexpected turn for the group, seeing as Melissa, Teresa and Margaret Josephs all served in Danielle’s May wedding to former baseball player Marty Caffrey. The couple split just months later, a move that Melissa admits did not shock her.\n\n“There was tension at the wedding,” she reveals. “You are gonna see it, and you're gonna see us saying something is off here. You know, like, why are we doing this? Yeah, I think I could see. Listen, I'm no pro, but I've been in the game for 14 years of marriage. You know 14 years going strong. So, it's like, I could see when something is not gonna be a match.”\n\nIt’s not all Danielle drama this year, though. Melissa is also swept up in family tension, playing monkey in the middle with her husband, Joe, and sister-in-law, Teresa, over the Gorgas not spending enough time with Teresa and Joe’s ailing father, according to Teresa. Still, Melissa says things will never get as bad as they were in her early RHONJ days, when her and Teresa’s husbands got into a brawl at Melissa’s son’s christening.\n\nTeresa Giudice Has No Plans to Divorce Husband Joe After Deportation Verdict (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Teresa Giudice Has No Plans to Divorce Husband Joe After Deportation Verdict (Exclusive)\n\n“We're in a good place,” Melissa shares. “We're not in a bad place, we're just not going to agree on everything. It's not real to agree on everything for her and I.”\n\n“I think if we were friends, it'd be worse because we wouldn't have mutual children that love each other with the same bloodline,” she adds. “So I'd be like, 'B*tch!' It would be different.”\n\nMelissa is currently standing by her sister-in-law as she and her family await a final ruling on her husband Joe Giudice’s deportation to Italy. The family submitted an appeal earlier this month.\n\n“I think the next step right now is just to wait it out and pray,” Melissa says. “That's basically what everybody is doing. They're just kinda hoping that it's gonna turn around. It is very sad because, you know, he has four daughters and they love him. Like, they truly -- which all little girls love their daddy -- they want him here. So we are all just praying that it turns around.”\n\nThe Real Housewives of New Jersey airs Wednesdays at 9 p.m. ET on Bravo.\n\nRELATED CONTENT:\n\n'RHONJ': Melissa Gorga Now Understands Why Couples Get Divorced (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\n'RHONJ' Star Melissa Gorga Admits She Now Understands Why Couples Get Divorced (Exclusive)\n\nWhy Teresa Giudice's 'RHONJ' Castmate Doesn't Think She'll Ever Divorce Joe\n\n‘RHONJ’: Dolores Catania Ready to ‘Flip Out’ on ‘Wackadoo’ Danielle Staub (Exclusive)", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/intv_melissa_gorga_drama_112718_vidpic.jpg?h=c673cd1c&itok=-WZeL7Q-", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-11/getty_cast_at_wedding_1.jpg?itok=xXohX71-", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2018-12/megyn_kelly_gettyimages-1053390462_1280.jpg?h=c673cd1c&itok=GkyEoz-G", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/gettyimages-1188309777_copy.jpg?h=c673cd1c&itok=TUXJDh-j"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/intv_melissa_gorga_drama_112718_vidpic.jpg?h=c673cd1c&itok=-WZeL7Q-", "keywords": [], "authors": ["Brice Sander"], "canonical_link": "https://www.etonline.com/rhonj-melissa-gorga-says-she-knew-danielle-staubs-marriage-wasnt-going-to-last-exclusive-114584", "title": "'RHONJ': Melissa Gorga Says She Knew Danielle Staub's Marriage Wasn't Going to Last (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "'RHONJ': Melissa Gorga Says She Knew Danielle Staub's Marriage Wasn't Going to Last (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/rhonj-melissa-gorga-says-she-knew-danielle-staubs-marriage-wasnt-going-to-last-exclusive-114584", "title": "Melissa Gorga Says She Knew Danielle Staub's Marriage Wouldn't Last", "description": "The ‘Real Housewives of New Jersey’ star says fans will see it all play out on season nine, just without confessionals from Danielle!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/intv_melissa_gorga_drama_112718_vidpic.jpg?h=c673cd1c&itok=-WZeL7Q-", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The ‘Real Housewives of New Jersey’ star says fans will see it all play out on season nine, just without confessionals from Danielle!", "title": "Melissa Gorga Says She Knew Danielle Staub's Marriage Wouldn't Last", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Brice Sander‍", "url": "https://www.etonline.com/rhonj-melissa-gorga-says-she-knew-danielle-staubs-marriage-wasnt-going-to-last-exclusive-114584", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/intv_melissa_gorga_drama_112718_vidpic.jpg?h=c673cd1c&itok=-WZeL7Q-"}, "description": "The ‘Real Housewives of New Jersey’ star says fans will see it all play out on season nine, just without confessionals from Danielle!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, Melissa Gorga, Danielle Staub, Teresa Giudice, The Real Housewives, The Real Housewives of New Jersey", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}