{"url": "https://web.archive.org/web/20090913221204/http://www.whitehouse.gov:80/the_press_office/Briefing-by-White-House-Press-Secretary-Robert-Gibbs-9/10/09", "text": "THE WHITE HOUSE Office of the Press Secretary\n\n___________________________________________________________________________\n\nFor Immediate Release September 10, 2009 PRESS BRIEFING\n\nBY PRESS SECRETARY ROBERT GIBBS James S. Brady Press Briefing Room\n\n1:45 P.M. EDT\n\nMR. GIBBS: Good afternoon. Before we get started, let me just run through real quickly, just for your planning purposes, some events that the President will be doing in and around the meeting later this month at the United Nations General Assembly. We'll have more detail on this for you then, but I just wanted to give you just a quick sketch.\n\nThe President of course will deliver his first address to the U.N. General Assembly. Secondly, he will attend and deliver remarks at Secretary General Ban Ki-moon's climate change summit.\n\nQ Can you give us some dates?\n\nMR. GIBBS: That would be good if I had them. I don't at the moment.\n\nThird, the President will attend the Secretary General's luncheon for heads of state and host the traditional American reception for other heads of state. The President will also host a lunch for heads of states and governments from sub-Sahara Africa to discuss building a 21st century partnership to increase economic and social development.\n\nHere's one date I do have. On September 24th, the President will chair a summit-level meeting of the U.N. Security Council on the topic of nuclear non-proliferation and nuclear disarmament. This is only the fifth time in the history of the U.N. that a head of state-level Security Council summit has been convened, and the first time ever that a U.S. President will chair a U.N. Security Council summit.\n\nQ Did you ask for it?\n\nMR. GIBBS: We did ask for it, and are heading it. And then lastly, the President will host a meeting with countries that contribute the largest numbers of troops and police to U.N. peacekeeping operations. Again, more detail on this as we get a little closer to U.N., but wanted to walk --\n\nQ Can you repeat that last one?\n\nMR. GIBBS: Yes. Host a meeting with countries that contribute the largest number of troops and police to U.N. peacekeeping operations.\n\nQ Are all the heads of state invited to the reception?\n\nMR. GIBBS: I don't have a list of who's RSVP'd.\n\nQ Will President Ahmadinejad be invited?\n\nMR. GIBBS: I doubt it.\n\nQ Who controls the invite list?\n\nMR. GIBBS: Burton does.\n\nQ No, but I mean, is it -- (laughter) -- is it the U.S. or --\n\nMR. GIBBS: Yes, yes, this is an American reception, so yes.\n\nAll right, now back to our regularly scheduled programming. Yes, ma'am.\n\nQ Why would he be left out?\n\nMR. GIBBS: Because Iran is failing to live up to its international obligations.\n\nQ There's no other nation in the U.N. --\n\nMR. GIBBS: No, I don't -- I think there are others that might miss out on the hors d'oeuvres.\n\nYes, ma'am.\n\nQ Earlier today, Speaker Pelosi said that she sees little support in the country or in Congress for sending more troops to Afghanistan. Has the President decided what he's going to do in Afghanistan? Do her comments kind of box him in in any way?\n\nMR. GIBBS: Look, as we've discussed before, obviously the assessment that has been delivered to Central Command, to the Pentagon, and to the White House from General McChrystal is part of a rigorous assessment process that the President wanted instituted upon coming into office, and to reassess our strategy in this very important region of the world. That continues to be discussed here and at the Pentagon.\n\nAs we've also talked about, separate resource decision reports will be coming in the next few weeks, but have not been received as of yet. The President will make a decision based on what he thinks is in the best national security interest of this country.\n\nQ What is his time frame for making a decision? And when he does make a decision, how will he --\n\nMR. GIBBS: Well, it's hard -- again, the evaluation process is ongoing on the original assessment. We've not received yet a resource report from commanders in Afghanistan to begin to consider. So there are several different assessments that will happen prior to that, and this is an ongoing process.\n\nQ Haven't they been told not to ask for more troops?\n\nMR. GIBBS: Not in any way, shape, or form.\n\nYes, ma'am.\n\nQ Speaking of Iran, yesterday you said the administration wanted to see progress from Iran in the proposals that it submitted yesterday. Now that you've had a chance to look at them, did you see what you wanted? Also, Iran is saying that the proposals did not deal directly with its nuclear activities. Is that the case? And finally, Russia came out a little bit ago and said the U.N. Security Council would not support oil sanctions. Does this administration agree?\n\nMR. GIBBS: I have not seen the Russian comments. Let me speak more broadly about Iran and -- obviously this week's discussion at the IAEA makes further clear the concern that the international community has and the gravity that we have about Iran's illicit nuclear program. Iran has failed to address past violations, failed to comply with U.N. Security Council resolutions to suspend its nuclear activity. The offer is still being evaluated by the P5-plus-1. I would say Iran's proposals have time and again failed to live up to its international obligations. And we've discussed that Iran obviously has two paths that they can choose. One of those paths leads to increased international isolation if they don't take concrete steps to end their program.\n\nAs we get closer to the U.N. and the G20, obviously there will be a period of discussion and evaluation as to where we are as we move forward together with the international community.\n\nYes, sir.\n\nQ The President yesterday, last night, said that the bills, the health care reform bills, whatever he signs will be deficit-neutral and will bend the cost curve. The Democratic bills that have been introduced in the House and Senate so far, at least according to the Congressional Budget Office, will not do that. They will increase the deficit, according to Doug Elmendorf, and they will not bend the cost curve. In fact, the cost curve will continue to go up. Does the White House accept what the CBO director says about these bills? And if so, what pressure is the White House conveying or using on Congress and Democrats to improve these two elements that the President said were so important to him?\n\nMR. GIBBS: Well, let's -- let me take these separately. First and foremost, it's not up to us to judge -- well, obviously we take at face value whatever the CBO says about legislation, as we've discussed in here. The proposal that the President outlined last night is obviously in some ways different than what we -- what has been discussed on Capitol Hill thus far. I think CBO would be one of the first to tell you that one way to bend that cost curve is to go after and discuss how to prevent what the President called Cadillac health insurance plans last night, that tend to make steeper that curve going upwards.\n\nI think one of the things that the CBO has said is addressing that will put that downward pressure on cost, and obviously the President, as part of his plan, last night outlined a fee on insurance companies that offer these Cadillac plans after -- at a certain rate. So I think that, first and foremost, is one of the things that the President outlined. And I think, secondly, the President outlined a trigger, a deficit trigger that would evaluate whether or not savings have been achieved. And if savings haven't been achieved before moving forward, how that savings can be achieved before the plan is fully implemented in 2013. I think those are two ways that the President outlined last night to address those concerns.\n\nBut, Jake, you heard him I think say pretty clearly that this was -- this has to change the direction of our -- of government spending on health care, and this has to not add a dime to the deficit. The President is very serious about keeping those promises.\n\nQ How firm is he being with Democratic leaders, because they -- I mean, we've heard from Harry Reid and Nancy Pelosi that they're 90 percent there. You guys have said that there's 80 percent agreement. It seems to be that they're -- and I understand the President --\n\nMR. GIBBS: I put some of the proposal the President outlined in that sort of 10 to 20 percentage range.\n\nQ Well, is it going to be that significant? I mean, are these major steps that are actually going to change the impacts of these bills, according to the CBO announcing --\n\nMR. GIBBS: I mean, again, I think the CBO has evaluated a number of cost-cutting mechanisms that have been outlined. And the one that they think has the greatest ability is to -- deals with these Cadillac health insurance plans, which the President talked about last night.\n\nSo I do think the President believes that will have a -- will have an impact on the cost curve.\n\nYes, ma'am.\n\nQ Congressman Wilson's apology -- I don't want to dwell too much -- but how was that apology conveyed to the President?\n\nMR. GIBBS: It's my understanding that Congressman Wilson called the Chief of Staff last night -- I can check on the time in which we got an e-mail on that -- an hour or so after the conclusion of the speech, to express his apology for what he had said, and that the Chief of Staff accepted that on behalf of the President.\n\nQ Was that apology conveyed to the President this morning or --\n\nMR. GIBBS: Last night.\n\nQ Last night.\n\nMR. GIBBS: But, you know, again, the President -- to reiterate what the President said in the Cabinet meeting, we can disagree -- he's said this millions of times -- we can disagree without being disagreeable; that we can have an honest debate about our views on health care and what we think is best for the American people, but we can do so without what you saw last night. And I think it's obvious that Congressman Wilson agrees with that.\n\nQ And do you have details on this meeting with the President and centrist Democrats today in the Senate?\n\nMR. GIBBS: I think we will, if we haven't already, put out a list of senators that will be there. I think there's 15 to 17 that will be there.\n\nQ What time?\n\nMR. GIBBS: I think it's at 4:15 p.m. this afternoon, if I'm not mistaken.\n\nQ And what's the President's message going to be?\n\nMR. GIBBS: Well, I think the President wants to talk through with moderate Democrats and centrist Democrats some of the proposals that he outlined last night, some of which we just talked about that have and enjoy their support, and figuring out how we can move this -- continue to move this process forward. We'll have a short readout from after the meeting, as well.\n\nQ How long do you think it will go?\n\nMR. GIBBS: I think it's on the schedule for probably 30 to 45 minutes, but we'll check.\n\nYes, ma'am.\n\nQ Do you think he has satisfied the liberal Democrats? And also, what is he going to do now to keep the momentum?\n\nMR. GIBBS: Well, I think most of you have seen that we will travel on Saturday to Minnesota to talk again -- on Saturday -- to talk again about the importance of health care reform and to keep this going. In terms of -- I think what the President outlined last night is something that can appeal to Democrats and Republicans and bring people together to solve this problem that we've been talking about for so long.\n\nI don't want to speak directly for members of Congress, but judging from many of the comments that I've seen in reporting today, I think the President did a good job of appealing across the political spectrum in outlining a proposal that -- the elements of which he thinks can represent an important step forward in health care reform.\n\nYes, sir.\n\nQ Senator Baucus today said that as far as he's concerned, it sounded like the President was reading his plan -- or \"our plan\" as he put it. He said, it sounds like we're in sync in openness to co-ops, $900 billion, deficit-neutral, deficit trigger. Was the President making a conscious effort to move in the direction of the Gang of Six/Baucus plan?\n\nMR. GIBBS: Well, look, let me -- obviously the President fully supports and has lauded the efforts of the Finance Committee to continue to work on getting a plan out of their committee. Obviously he talked about four of five committees of jurisdiction -- something that's never happened before -- have completed that work. Senator Baucus announced earlier yesterday that the committee would convene on the 21st to mark up legislation. Again, I think it's a tremendously positive and important development in continuing health care reform through the congressional process.\n\nLook, I think there's plenty of room for agreement. The President has used the figure that Jake cited as about 80 percent agreement, I think a lot of which he reiterated last night. And we certainly hope that the Finance Committee, the Gang of Six, Republicans and Democrats, will find enough to like in all these pieces of legislation and in this proposal to move something forward.\n\nQ A lot of your favorite people, the pundits, are concluding already that what the President was basically doing, by making an argument for public option but then making it so clear that he's open to either the co-op or the trigger, he's basically saying, I'm moving in the direction of Baucus and company, or the trigger, and you 100 or 80, whatever you are, liberal Democrats in the House, you're going to have to face reality here; you're not going to get what you want. Was that the President's message last night?\n\nMR. GIBBS: Well, I mean, I -- again, without referring to my good friends, the pundits, I'd look more directly just exactly at what the President said. I think there's no doubt that the President laid down the notion that we have to have options, particularly in a private insurance or small group insurance market that, as the President noted, 75 percent of -- more than half the states are dominated by just five companies in each state. I have used the example many times of Alabama being dominated -- 89 percent of that insurance market is dominated by exactly one company; that we have to have that choice and competition. And quite frankly we've always thrived in this country with choice and competition in whatever it is.\n\nI think he reiterated that the public option is not the be-all, end-all of health care reform; that he's open to ways to achieve choice and competition and wants to work with Congress to see that happen. I think this is part of the process of bringing people together and getting a solution.\n\nQ A lot of people say what you just said is a death knell, really, for a robust public option.\n\nMR. GIBBS: I think -- I think if you watched what the President said last night, I think he's very clear on that.\n\nYes, sir.\n\nQ Robert, we heard the President today again say he's open to talking to anybody about any ideas. But is it fair to say that actions are speaking louder than words? Today, the President is meeting with a group of just Democrats. Saturday, he's traveling to Minneapolis, a state that has got two Democratic senators, a state that gave you the 60th U.S. Senate seat.\n\nMR. GIBBS: There's 59 U.S. Senate seats right now.\n\nQ There's 59, I understand that. But it was -- gave you the 60 at the time. Is there --\n\nMR. GIBBS: I remember Minnesota being a swing state at or around this time last year.\n\nQ I was trying to remember when that was.\n\nMR. GIBBS: It was about the time the Republican convention ended in St. Paul, Minnesota -- (laughter) -- with Tim Pawlenty as the governor.\n\nQ My point is the President talked --\n\nMR. GIBBS: At or around then. (Laughter.)\n\nQ -- the President talked a lot about Republican ideas, bipartisanship. Should we expect to see a meeting here at the White House with a group of Republicans?\n\nMR. GIBBS: Look, I presume we will have Republicans and Democrats down here to talk about this proposal. The President didn't go to Capitol Hill just to give lip service to both sides of the aisle. I don't think that you can judge one day's effort, or one afternoon's effort, the one day after the speech.\n\nThe President is focused on hearing all of those ideas. Again, as you said, he reiterated that not once, but then a second time at the Cabinet meeting today when you all were in there. I hesitate to -- again, Minnesota was a swing state for quite some time in the general election. So I don't know that I would throw Minnesota in one --\n\nQ But this is about winning votes, and a lot of times we see -- we watch Presidents when they've got initiatives that they're trying to win votes, all of a sudden they show up in states where they're trying to get -- it's obvious you have both Democratic Senate -- but, I mean -- so I'm just saying, should we not read into where you're going?\n\nMR. GIBBS: No, the state wasn't -- the state wasn't picked for who represents it in the Senate, no more than it was than who represents it at any level of government. It's a state the President hasn't been to, and looks forwards to going to going to on Saturday.\n\nQ Who was the last Republican, besides Olympia Snowe, that he's talked with about -- that he's -- the President himself has talked with about health care?\n\nMR. GIBBS: I have to go back and look at my call list.\n\nQ Was it recent?\n\nMR. GIBBS: I don't have the call list. I'd have to go back and look. Let me go back and look.\n\nQ And following up on Afghanistan, does the President believe there should be an exit strategy at some point?\n\nMR. GIBBS: Absolutely. I mean, I think the President -- first and foremost, I think the President has always discussed, and particularly since coming to office, that there isn't a -- there isn't a military solution alone for Afghanistan. We do not have -- we do not have the troops or the money to be there in perpetuity. I think the Secretary of Defense has been pretty clear on this, as well, that we're not there to build some utopian democracy. We have very clear goals. We are working with Congress on those benchmarks -- as the Speaker mentioned in her press availability today -- to disrupt, dismantle, and destroy al Qaeda and its extremist allies. But, no, we're -- the President does not in any way envision us being there -- being there forever.\n\nQ Should the American public expect to see the President say, okay, look, we have an exit strategy, here it is, or (inaudible) happen sooner rather than later?\n\nMR. GIBBS: I think the President will continue to talk about -- I think the President will continue to talk about the objectives and the goals that he has for this policy, and underscore that, again, we don't have -- we don't have the human resources or the material resources to be there forever.\n\nQ Well, what's the strategy?\n\nMR. GIBBS: What's the strategy? Well, the President has outlined --\n\nQ To leave.\n\nMR. GIBBS: Well, the President and Congress are working on very strict benchmarks to measure our progress in, as I just said, dismantling, disrupting, and destroying al Qaeda.\n\nQ So how long will that take?\n\nMR. GIBBS: That's part of the current assessment that is going on. Obviously this is an effort, Helen, that started in 2001, and I think it's fair to say the President was a critic of the lack of attention and focus paid to this effort for quite some time; that he asked that the strategy be reassessed during the transition. Part of that reassessment was changing commanders on the ground. And as part of that change, we now have received General McChrystal's assessment of his first two months in Afghanistan.\n\nJonathan.\n\nQ Picking up on Chuck's line of questioning -- pre-Afghanistan. Is Democratic unity now the first objective post-speech in the legislative strategy? And what is your thinking right now about avoiding reconciliation --\n\nMR. GIBBS: Well, we have always discussed on any topic the notion that we want, first and foremost, Democrats and Republicans to work together to solve the problem of the magnitude that health care is. I wouldn't put one series of lawmakers above another. I think every vote in Congress is created equal. And the President would be pleased and happy to have each and every one of them.\n\nSo, again, I think there will be extensive consultation with Congress -- Democrats, Republicans, and independents -- about how we move forward best on this legislation.\n\nQ And can you tell us what other folks like the Chief of Staff, Jim Messina, Phil Schiliro, what their -- and actually Joe Biden -- what their roles are right now, what they might be doing today and the next couple of days?\n\nMR. GIBBS: All four of those guys spent at least an hour and a half in a Cabinet meeting today where health care was discussed extensively.\n\nCan somebody go check on the -- just have them turn it off if the static is -- but I have no doubt that they will be reaching out throughout Capitol Hill, again, to Democrats and Republicans. Nancy-Ann will be meeting with groups of lawmakers to discuss how best we move forward.\n\nQ Now, on Joe Biden, the Vice President was called on as the pivotal person at the end of the stimulus process. And I wonder what role you see the Vice President taking --\n\nMR. GIBBS: Well, look, obviously the Vice President brings extensive knowledge of a number of members of Congress, knowledge that the President relied on in the buildup in the days ahead of the speech, in the discussions, the policy discussions, that we had here. And he will continue to rely on his knowledge and his expertise in moving this legislation forward. I think Vice President Biden on this topic as well as many other topics plays an incredibly important and crucial role for the President and our team.\n\nQ Robert, can you elaborate beyond the one sentence in your written readout on what the President said to Prime Minister Brown about the release of the Pan Am 103 bomber?\n\nMR. GIBBS: Look, the President restated to Prime Minister Brown our opposition that was conveyed to the Scottish government prior to their decision, and the President relayed during this conversation the disappointment in the decision that had been made. He thought this was a mistake. He continues to think it was a mistake. Obviously nearly 200 Americans lost their lives in that terrorist tragedy. The President and the administration had communicated clearly to the Scottish government that we believed any release would be a mistake and that this individual should serve the remainder of their term in Scotland.\n\nQ Is the President satisfied with what Brown responded?\n\nMR. GIBBS: He is satisfied, but again underscores his opposition to and disappointment at the decision that was made.\n\nQ Did Prime Minister Brown respond differently to what he has said publicly?\n\nMR. GIBBS: I would -- we sort of have a practice not to read out what other governments have said, and I would ask you to speak with the Brits on that.\n\nQ And one more. Is there any health care event beyond Saturday coming up in the early days of next week?\n\nMR. GIBBS: Let me -- I have not looked that far on the schedule.\n\nLynn, do you have a --\n\nQ Just to follow up on that release situation. Later this month in New York the President is going to host a reception for the world leaders after the U.N. opening. Will Ghadafi be invited to that reception?\n\nMR. GIBBS: We will get a list of who is and who won't be invited to the party.\n\nQ Because usually all the world leaders are.\n\nMR. GIBBS: Let me -- having not been here for an administration's effort at the U.N. General Assembly, let me get NSC to weigh in on that.\n\nYes, ma'am.\n\nQ Of the $900 billion cost over 10 years that the President said last night, could you outline and break down the specifics to how the White House would --\n\nMR. GIBBS: I don't have some of that paper with me. I'll outline it in sort of broad effect. Obviously we have discussed, I think in some detail, the waste, fraud, and abuse that is prevalent in Medicare -- that strengthening the Medicare trust fund through spending health care dollars more wisely; ending the insurance company subsidies to Medicare Advantage. Obviously you have some amount of revenue from agreements with the hospitals and with the pharmaceutical industry, some of which will be used, in the pharmaceutical industry's example, to close the doughnut hole for seniors and again strengthen the Medicare program as we know it. Also some of that will be used for broader health care reform. And then obviously the fee that we talked about on insurance companies is a broad part of that, as well.\n\nQ Do you have any estimate of how much that fee --\n\nMR. GIBBS: I don't have that -- I don't have that with me.\n\nQ Or even the threshold that the President would like to see?\n\nMR. GIBBS: Well, I think, again, I think that's one of the things that we'll work through and discuss with Congress as we move forward. Obviously there are --\n\nQ You haven't set a threshold.\n\nMR. GIBBS: Not that I know of yet, no.\n\nQ Robert, a couple on health care and then one on trade. How would the medical malpractice aspects that the President talked about last night work, and when are we likely to see action on that?\n\nMR. GIBBS: Well, as you know, the President instructed the Secretary of Health and Human Services to begin working on these projects immediately. I'll give you a couple of different examples of how some of these things might work, and as these get developed obviously we'll report on them for you.\n\nThe President introduced legislation with now Secretary of State Clinton in 2005 in the Senate that builds on very successful programs that medical systems and hospitals in areas have tried that seeks mediation over litigation in ways of solving some of these disputes.\n\nI think the President and his team will look at very closely what Congressman Bart Gordon put in the Energy and Commerce legislation, which requires prior to a suit being heard in court, prior to that litigation moving forward, a certificate of merit that is given by a board of medical professionals that certifies the validity of any litigation moving forward to cut down on unnecessary costs, and as the President said, defensive medicine that he hears about from doctors and doctors' groups.\n\nQ Does that suggest that part of this could become a part of the legislation itself? Or would -- you want to handle it entirely through the administrative process?\n\nMR. GIBBS: We -- I think --\n\nQ Open to both?\n\nMR. GIBBS: Open to both.\n\nQ Okay. And the President talked about this trigger or hinge mechanism -- if you're not saving enough, we have to hold back. Is that a must-have in the legislation?\n\nMR. GIBBS: That's a -- that is a -- it is one of the President's proposals, and I think one of the things that he'll insist on being in reform. Again, I think it underscores the promise that he made that this must -- that this must not add to the deficit. And, look, it's probably an uncomfortable moment for Democrats and Republicans when the President reminded many in that chamber that we'd watched over the past many years sometimes very popular programs added to the government's tab without being paid for, right -- $1.6 trillion for tax cuts in 2001 and 2003; several hundred billion dollars, I forget the final price tag, for Medicare Part D; wars in Iraq and Afghanistan that never went through a budget process. We have troops in two countries, and you are going through an emergency supplemental process that is not counted on the deficit. Those are three pretty broad examples of big chunks that we're now paying for that weren't paid for when we started.\n\nI think the President is determined, as we address the challenges that this country faces, that one of the challenges that we face is paying for what we want to do. And I think that's exactly what the President outlined.\n\nQ And that's only up until 2013? Or does that continue on after --\n\nMR. GIBBS: No, no, the -- I think --\n\nQ -- the 10-year window of this legislation?\n\nMR. GIBBS: The President -- the President extended that going forward. Do you have a follow-up on that?\n\nQ If it is so important to keep this deficit-neutral, why not outline specific ways of getting to the $900 billion --\n\nMR. GIBBS: Again, I just outlined some very specific ways that the President seeks to do it.\n\nQ But to break it down dollar -- dollar by dollar?\n\nMR. GIBBS: Again, we're going to work with Congress on -- it would be hard to estimate the total amount raised by the fee on Cadillac insurance plans, the fee on insurance companies, without a threshold. Obviously that's something that we're going to discuss with Democrats and Republicans alike who have come to the table at this point in the debate, understanding that this proposal can do -- can do several things, including bend that cost curve.\n\nQ So you do have some sense to be able to --\n\nMR. GIBBS: Well, I mean, there's a broad range of different things, yes.\n\nQ Let me do the one trade thing, Robert. It's somewhat obscure, but it's pending, so I hope you have some general analysis you can give me on this.\n\nMR. GIBBS: We'll see on that.\n\nQ A union representing U.S. tiremakers won a claim against China for the surge of tire imports in the United States. The President has until the 17th of this month to either follow an International Trade Commission recommendation of three years of tariffs against China, or do something else or nothing at all. What is his approach? How is this being handled? Is he more in favor in sanctions, meaning tariffs, or some sort of negotiated mediation on this?\n\nMR. GIBBS: I am aware, but you probably will find the answer to be semi-unsatisfactory. It's obviously something that the administration was -- we didn't have an Economic Daily Briefing with the President today for some scheduling reasons, but this has been touched on in a couple of those and is being worked on with representatives from the Department of Labor, the Department of Commerce, the U.S. Trade Representative, and the NEC. And as we get closer to that deadline, we'll have more on that.\n\nQ Would a response involving tariffs be viewed by the President as protectionist or within the realm of something that is a natural response if you are a victim of surge or --\n\nMR. GIBBS: Let me just not get ahead of where we are on that at this moment.\n\nYes, sir.\n\nQ Thanks, Robert. The United States Olympic Committee is meeting today in Chicago about the city's bid to host the 2016 games. The International Olympic Committee makes its decision October 2nd in Copenhagen. Apparently it's very important for a leader to be there. Spain, Tokyo -- the leaders of Spain, Tokyo, and Brazil have committed to being there October 2nd in Copenhagen, I believe. Is the President going to go?\n\nMR. GIBBS: Not that I'm aware of, no.\n\nQ Has he --\n\nQ Really? Why not? (Laughter.)\n\nMR. GIBBS: The -- yes, I was going to -- hometown interest.\n\nQ Chicago wants to know.\n\nMR. GIBBS: Let me double-check on the President's schedule. Obviously I anticipate having representatives there.\n\nQ But we know that Valerie is going, okay, and there had always been a thought, I thought -- thank you for bringing it up -- (laughter) --\n\nQ No, please.\n\nQ All right. (Laughter.)\n\nMR. GIBBS: The gentleman yields his time to the gentle lady from -- representing Chicago. Yes.\n\nQ Well, as you now know, you probably made a few million ears perk up by saying that he's not coming. So if you have some explanation as to why not, that says something.\n\nMR. GIBBS: I should say -- I said that as far as the schedule I had seen, that was not planned. I will -- based on the millions of --\n\nQ Well, you don't hop over to Copenhagen. I mean, obviously --\n\nQ Is the date being held?\n\nMR. GIBBS: This is -- I will, because of those several million ears that have now since perked, check.\n\nQ Is the date being held?\n\nMR. GIBBS: Let me check. It's hard for me to look into my invisible crystal ball.\n\nQ If he's not -- that would -- that he might not come if it was thought the city's bid -- which has a little bumpy road back home right now -- was in trouble. So that would be very useful to get the whole picture from you.\n\nMR. GIBBS: Well, look, I think the last set of articles I read on where the IOC was on Olympic bids had America's bid in Chicago at the top of that list. So I don't -- without getting into Chicago politics on that, I think our bid is -- this country's bid is very well represented and seems to be making progress.\n\nAre you extending your time? (Laughter.)\n\nQ No, I'll pass.\n\nQ Well, now could this be a today thing to get back and clarify?\n\nMR. GIBBS: I will endeavor to call up the schedule when I get back to my office.\n\nQ Thank you.\n\nQ Can you get back to all of us?\n\nMR. GIBBS: I was going to say, I guess these million or so ears include quite a few dozen in here.\n\nYes, ma'am.\n\nQ A couple of \"specifics\" questions. I noticed last night the President said 30 million or more than 30 million American citizens lack insurance and I was struck by that figure, commonly used figure -- the one the Census Bureau used today was 46 million people without insurance.\n\nMR. GIBBS: Forty-six point three, right.\n\nQ Right. So why did the President limit it to 36 million -- or 30 million citizens? Was this a way to draw a distinction between American citizens and those who are illegal immigrants and the subject of contention, or what --\n\nMR. GIBBS: Obviously this has been a point of some contention during the speech, as I recall.\n\nQ Right. So --\n\nMR. GIBBS: The legislation -- the proposal that the President outlined covers American citizens. I think he was clear for almost everyone that the legislation does not cover -- his plan would not cover illegal immigrants. If you subtract a rough estimate from that 46.3 million, you get a number that's somewhat unknown but in the 30s that represents American citizens, as the President pointed out. I would go one step further to point out that last night was not the first time that the President has talked about the fact that illegal immigrants aren't covered -- or would not be covered as part of his plan. He said that most recently in the interview -- radio interview that was done here, and said that also in the campaign in 2008.\n\nQ So in effect he's saying that a quarter or more of the people who currently lack insurance will still lack insurance once the plan is passed, is that correct?\n\nMR. GIBBS: Well, again, I don't know --\n\nQ -- many uninsured people in this country presumably driving up health care costs. Is that correct?\n\nMR. GIBBS: Well, I think the President would look at -- because he's -- would look at how many American citizens are covered under our proposal, rather than looking at different numbers that don't include American citizens.\n\nQ What I'm asking, though, is it then his vision that there could still be at the end of the day as many as, say, 16 million people living in this country without health insurance who --\n\nMR. GIBBS: Again, I don't think it's -- the President outlined a plan that doesn't cover illegal immigrants. The number that the President seeks to cover is to provide universal access to coverage for American citizens. I think you heard the President even discuss last night that there are going to be some American citizens who decide they don't want or don't need health insurance that are also going to be living here.\n\nQ Robert, what's the reasoning behind that? Obviously some concerns among conservative Republicans about this have to do with that you're not legislating the negative here, you're not adding -- you know, passing this amendment, I guess, that they want to triple-check that there's no way illegal -- I mean, why not go along with that if that assuages --\n\nMR. GIBBS: Well, Chuck, I think --\n\nQ What is the legal reason --\n\nMR. GIBBS: Let me just give you this example. I got how many questions for how many weeks about why the President hasn't offered his views on the legislation, right? How come he hasn't introduced his plan? We did that last night. The President said in his plan it wouldn't cover illegal immigrants.\n\nQ So if it takes throwing an amendment on this, you guys are okay with that?\n\nMR. GIBBS: The President -- the legislation that the President will sign won't cover illegal immigrants.\n\nQ But in the past he has used the larger number, so then they were including illegal immigrants?\n\nMR. GIBBS: I think there was just a reference to the larger number.\n\nQ But you knew that included a very large number, millions of illegal immigrants. So isn't it logical for people to assume that for a long time you were including illegal immigrants in people you want to get health insurance?\n\nMR. GIBBS: No, no more than I would assume the logic of them having listened to what he said in the campaign where it's not going to happen.\n\nQ Well, Robert, Joe Wilson this morning said -- defended his outburst by saying that illegal immigrants could still buy money on the federal exchange.\n\nMR. GIBBS: Again, Jonathan, let me -- let me use the example --\n\nQ Can you --\n\nMR. GIBBS: No, no, no, no. Let me -- because I stood up here and caught a lot of spears for a lot of days about where the President's plan was. It was delivered last night -- 10 minutes after 8:00 p.m., zip code 20015, the President outlined and reiterated his belief, as enunciated in the campaign in 2008, that his plan wouldn't cover illegal immigrants.\n\nQ So are you saying --\n\nMR. GIBBS: I'm not going to get into -- I'm not a member of the House.\n\nQ Right, but his -- look, in his plan, would he say that an illegal immigrant could not take money out of his pocket, go on the federal exchange, and buy an insurance policy with his money?\n\nMR. GIBBS: The policy would not cover -- the plan would not cover illegal immigrants, period.\n\nQ I think the question is the House bill, for instance, 3200, explicitly says that none of the subsidies can go to people who are in this country illegally.\n\nMR. GIBBS: Right.\n\nQ Right, but some -- what some of the criticisms, and what the Congressional Research Service analysis says of it, is that people who are illegal, as John points out, are able to buy insurance, as they already do --\n\nMR. GIBBS: I can't speak for somebody that's here illegally. But I would think it would be somewhat of a bad course of events, if you're here illegally, to alert people that you are here illegally and sign up for a government program.\n\nQ Just to put the dot on that, I mean, there are illegal immigrants who are covered by emergency Medicaid all the time -- millions.\n\nMR. GIBBS: As a result of I think a 1986 law that was signed by President Reagan.\n\nQ Right. But the House bill --\n\nMR. GIBBS: The last time Congress took up immigration reform, in 1986.\n\nQ The House bill would expand Medicaid, and that could lead to expansion of emergency Medicaid that would cover, possibly --\n\nMR. GIBBS: Again, the proposal --\n\nQ This is what I'm asking -- so when you say that illegal immigrants will not be covered, does that mean they can't be covered by any expansion in emergency Medicaid; they can't buy into the health exchange?\n\nMR. GIBBS: Again, again, let me check with the health care guys on how this would affect the 1986 law. But they would not be covered under the health care exchange in the proposal --\n\nQ And they can't -- right, they can't -- they would be prohibited from buying insurance through the exchange?\n\nMR. GIBBS: As I understand that, yes.\n\nQ If I could just follow up. This sort of takes us to the -- another issue that the President has said he wants to address, which is immigration reform. And I wonder, would it be his vision, when he addresses immigration reform, to bring those people who are illegal immigrants into a path toward citizenship, and ultimately into a status where they could be insured?\n\nMR. GIBBS: That's -- I don't know what would be involved in, or has been involved in legislation in the past --\n\nQ May I follow up on that to clarify what you mean by an exchange, because you keep saying that you have a range of choices in an exchange, one of them being a public option, which, you know, means that if an illegal immigrant wants to get insurance and it isn't the public option, then how could there be any documentation or any way of forbidding them to do that?\n\nMR. GIBBS: You've taken your confusing question and confused me. I don't have the slightest idea what you're talking about.\n\nQ On the fees, the President --\n\nMR. GIBBS: Can we just -- we skip on that one, because --just -- we're skipping that one because --\n\nQ Yes, well --\n\nMR. GIBBS: You're as befuddled as I am? Fair enough. (Laughter.)\n\nQ All right, here's a simple question.\n\nMR. GIBBS: Well, one would presume that one was. Go ahead.\n\nQ Okay. The President talked about imposing a fee on insurers that offer high-end policies.\n\nMR. GIBBS: Right.\n\nQ But he used to talk about being open to a tax. And Baucus's plan calls for a tax on high-end insurance policies. So why is he backing off of that?\n\nMR. GIBBS: I think the proposal that the President outlined last night is very analogous to what Senator Baucus apparently has in his plan and what Senator Kerry has offered or -- I think what Senator Kerry devised -- first devised this idea.\n\nQ It might be slightly analogous, but it doesn't change the (inaudible).\n\nMR. GIBBS: Ask an insurance company whether their fee or whatever you call it is -- it's the same thing.\n\nQ Robert, on the 9/11 anniversary, A, I know we've talked about some of this before. I'm interested in whatever preview you could give us on the President's remarks.\n\nAnd also -- I know we've also talked about this before -- has the President, since taking office, made a conscious effort to tone down some of the \"war on terror\" rhetoric that we have heard over the years of the Bush administration and specifically on 9/11 anniversaries?\n\nMR. GIBBS: Well, look, I mean, remember -- well, let me just outline again what the President is going to do. The President will visit with families at the memorial at the Pentagon and speak there. I think we just announced that Vice President Biden and his wife will visit New York and take part in that official ceremony. I think, if I'm not mistaken, that's the first time either a President or a Vice President -- sitting President or Vice President has taken part of the official ceremony. And I would --\n\nQ In New York?\n\nMR. GIBBS: The official ceremony. I think that's the case. But I certainly will ask the Vice President to go back and --\n\nQ The ceremony on the fifth anniversary, George Bush was President --\n\nMR. GIBBS: Well, I'll get back to you. Look, this was -- I'm not sure exactly what you were trying to get at in your question. I think the President -- I mean, I think if you look at how the President observed this last year as a candidate for the presidency with his Republican competitor for the same office, there was a conscious effort on both sides, I think, quite frankly, to remove the politics of 9/11 and instead remember the sacrifice that so many made, the tragedy that was involved, and do it in a way that removed political labels from such an important day.\n\nI don't know if that answers that part of your question.\n\nQ Well, let me ask it this way. President Bush used to say repeatedly, \"America is a nation at war.\" He did so on 9/11, but other occasions during the year. My impression is that since taking office, President Obama has purposely tried to turn down the heat on the rhetoric.\n\nMR. GIBBS: Well, look, I think we've certainly cut down on the use of the phrase, but, again, our focus is on getting the policy right. I don't -- I think the President spends part of each of his day in meetings about and thinking about the men and women that we have in Iraq and Afghanistan and that are through -- stationed throughout the world to protect our freedom and to address Islamic extremism. And that takes up part of his day and is something that -- the sacrifice which he's thankful for and I think all of us are thankful for each and every day. Regardless of how it's phrased, he's mindful of the effort of so many on our behalf.\n\nSavannah.\n\nQ Just to clear this up, are you saying that the President's plan, in contrast to what Democratic plans are right now, would expressly prohibit illegal immigrants from buying private insurance on this exchange?\n\nMR. GIBBS: Let me double-check. That's my impression, yes.\n\nQ Okay. We all know that the House bill even says you can't subsidize -- no government subsidies for illegal immigrants --\n\nMR. GIBBS: Let me -- I will double-check --\n\nQ -- but on a free market --\n\nMR. GIBBS: -- again, this is not something that -- I think the President was pretty clear on not covering illegal immigrants.\n\nYes, Margaret.\n\nQ Thank you. But illegal immigrants would still, if they were grievously injured and wandered into a hospital, be able to receive the same emergency care that they do now -- it's a basic human right, right? I mean --\n\nMR. GIBBS: I don't know whether -- I don't know whether the legislation envisioned changes, as I said, to the 1986 immigration law that went through Congress and was signed by then-President Reagan.\n\nQ What I wanted to ask is, when you're going back to check with your health experts, have you guys -- and I think this follows on Sheryl's question -- been able to --\n\nMR. GIBBS: She asked like eight. (Laughter.)\n\nQ And they were all excellent.\n\nQ They were great, right. But it's sort of a Catch-22, right, because there's the political reality that the country probably wouldn't support including illegal immigrants in a comprehensive care bill, but then there's the reality of the way we treat people in this country, which is if you're injured and you to a hospital you'll get the care. So --\n\nMR. GIBBS: Well, I think I'd go back and point you to the President's interview -- the President's interview where he last talked about this.\n\nQ Can you achieve true cost savings, sufficient cost savings, to repair the system and bend the cost curve if you still treat illegal immigrants through emergency care, because you can't do it the other way?\n\nMR. GIBBS: Well, certainly the President believes so. I mean, if you're taking some untold number out of 46 and reducing it by -- well, quite frankly, more than that. I think the latest -- I do not have the latest number handy on an estimate for illegal immigrants is what, 10 to 11 million, minus 46.3 million is 36 to 35.3 million. So you're reducing by -- again, I'm in politics, that's why I'm not so good at math -- three-quarters, or -- between two-thirds and three-quarters.\n\nQ But those 10 million hanging out there are not going to mess up the equation?\n\nMR. GIBBS: I think the President believes that through a series of proposals that he's outlined, we can achieve significant cost savings and bend that cost curve.\n\nQ Robert, the President during the campaign talked about surmounting old divisions, following back on some of the polarization in the country. Given the outburst we saw on the floor of the House last night, and given some of the anger we saw at the town hall meetings over the summer, is that project still alive? Is that feasible, to try to ratchet down that temperature?\n\nMR. GIBBS: Sure. Quite frankly, I think that's what Congressman Wilson did around 10:45 p.m. last night. I think -- look, the President I think said this today, that we all make mistakes. Sometimes we all let our emotions get the better of us. But I think the President outlined a series of ideas last night, many of which Republicans have talked about. We talked about one today, medical malpractice reform. It might not be everything that everybody wants, but I did notice a number of people on that side of the chamber stand up and applaud.\n\nI have seen remarks from Republicans throughout the political spectrum, discuss the need to get something done this year. We always take them at their word on that. We're working with Democrats and Republicans to get something done, and I think there's a genuine chance to see reform this year.\n\nApril.\n\nQ Robert, a follow-up somewhat to that. Understanding that the Republican Party and even this White House -- some people in this White House want to see this liar comment story go away --\n\nMR. GIBBS: See the what?\n\nQ The liar comment story go away --\n\nMR. GIBBS: I don't think it -- well, go ahead. No, no, no.\n\nQ Go ahead, finish what you have to say. (Laughter.)\n\nMR. GIBBS: It's like I'm -- no, I'm not going to say that. I think the story largely goes away, April, because the Congressman admitted a mistake, called the Chief of Staff to apologize, and the President today accepted publicly that apology.\n\nQ That's the point. The White House --\n\nMR. GIBBS: I knew it. (Laughter.) Go ahead.\n\nQ Either way, there's a large segment of this country that's still very upset with the fact that decorum was breached -- and other issues, at the very least -- and they want this man to either step down, resign, what have you -- something to happen to him. And with this apology being accepted, it's still not going away. What do you say to that segment of America that still wants something -- some type of punishment? Even people are asking for a public apology since he made a public declaration of the word in the well of the House. People are wanting a public apology from this man.\n\nMR. GIBBS: I don't think -- I'm not here, and I don't think anybody in this building or anybody, quite frankly, on Capitol Hill is here to absolve what was said. We take Congressman Wilson at his word that he apologizes for an outburst that he regrets. That was the message that was communicated to the Chief of Staff last night.\n\nThe President strongly believes, though, that if we are going to deal with many of the big problems in our country that for years and years and years have not been settled -- partly because we get into these very convenient, often Washington games, where seeking a solution takes a backseat to political points being scored and name-calling and what have you -- the President is determined to break that cycle. The President is determined to seek solutions for, and get solutions passed, for those problems.\n\nI think millions of Americans would rather see their President and their Congress -- all of their Congress -- focus on providing that security and stability for those that have insurance, and providing a route to accessible and affordable coverage for those who don't, rather than debating the back-and-forth of the apology.\n\nQ Robert, could I just follow on that, please? There seems to be a bigger -- I think there is a bigger issue here, which a lot of people see, following on April's question, which is, one, the decorum of the House, and the other is the respect for the presidency of the United States, no matter who it is. Senator Specter and Whip James Clyburn both this morning said that if you just let him get away with making the phone call to Rahm Emanuel, you're just encouraging other people to do the same thing. So don't you need something like a public apology or a reprimand to make sure that --\n\nMR. GIBBS: Without having talked to -- I bet if you talked to the press secretary of that congressman today, I would not think that he's gone unpunished. My sense is that phone rang off the hook for quite some time.\n\nQ Doesn't it encourage the same kind of behavior for other people towards Presidents, no matter who it is?\n\nMR. GIBBS: I doubt anybody wants to do that and stand up and publicly apologize. I don't think that's what people want to do.\n\nGeorge.\n\nQ Robert, two weeks ago you said the President was willing to go to the moon if necessary to get health care reform --\n\nMR. GIBBS: I will check on that, and about Copenhagen, as well. (Laughter.) Could be on the way. (Laughter.)\n\nQ House Republicans have been waiting since May, trying to get a meeting with the President. Are they somehow in an orbit beyond the moon? Or why no -- why hasn't he responded?\n\nMR. GIBBS: Tempting to answer that in certainly different ways. (Laughter.)\n\nNo, the President -- I mentioned that the President would meet with many groups and many different leaders. And I believe that that includes Senate Republicans; he's talked to them. It includes House Republicans -- again, many of which I think have constructive ideas and want to see this process move forward.\n\nQ So you don't rule out that he'll accept a meeting with House Republicans?\n\nMR. GIBBS: No, not all. I mean, you know, again, we -- look, the President went to Capitol Hill four hours after the House Republican Caucus announced its opposition to the recovery plan in order to go up there to talk to House Republicans -- whose leadership had just said, we oppose your plan -- to try to get them to support the plan.\n\nI don't doubt that the President will have a similar effort on this legislation, as well.\n\nYes, sir.\n\nQ Who will be the ultimate arbiter of whether the health care legislation that comes before the President's desk increases the budget deficit? Will it be the OMB? Will it be the CBO, another entity? Who do you perceive being the arbiter on that?\n\nMR. GIBBS: I don't know that it's been designated, but obviously CBO is by law charged with letting you and America and, more importantly, Congress know how much legislation is going to cost. So I certainly believe that they're going to -- they will enter a verdict into what a bill costs, and I think that would certainly be a large part of this.\n\nQ Thank you.\n\nMR. GIBBS: Thanks, guys.\n\nQ Is that the binding one, the administration, CBO? The binding arbiter?\n\nMR. GIBBS: I wouldn't say binding, but I would say it's a -- it goes a big, big way.\n\nThanks, guys.\n\nQ Robert, when did the Kennedy letter come in?\n\nMR. GIBBS: Say again?\n\nQ When did Senator Kennedy's letter come in?\n\nMR. GIBBS: Let me figure that -- I'll get that date, and we'll get that out to you.\n\nThank you.\n\nEND\n\n2:45 P.M. EDT", "images": ["https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/images/eop/hdr-usa-flag.gif", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/assets/images/get_connected_01.jpg", "https://web.archive.org/web/20090913221204im_/http://statse.webtrendslive.com/dcs0l9nq800000ctek411lue6_2c8b/njs.gif?dcsuri=/nojavascript&WT.js=No&DCS.dcscfg=1&WT.tv=8.6.0", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/images/eop/clear.gif", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/assets/tout/smc_nt_04.jpg", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/assets/tout/fy-2010-budget.jpg", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/images/eop/sftr-whgov.gif", "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/assets/images/home_touts_03.jpg"], "top_img": "https://web.archive.org/web/20090913221204im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Briefing by White House Press Secretary Robert Gibbs, 9/10/09", "meta_data": {"keywords": "President, Barack Obama, White House, United States of America, 44th President, White House history, President Obama, Barck, Barek, Barak, Barrack, Barrak, Obma, Barack", "description": "WhiteHouse.gov is the official web site for the White House and President Barack Obama, the 44th President of the United States. This site is a source for information about the President, White House news and policies, White House history, and the federal government."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}