{"url": "https://www.hollywoodreporter.com/live-feed/x-files-what-did-scully-whisper-mulder-1094323", "text": "[This story contains spoilers from the March 14 episode of The X-Files.]\n\n\n\nWhen first-time The X-Files scribe Karen Nielsen wrote Wednesday’s episode, “Nothing Lasts Forever,” she set out to tell a character-based piece.\n\n“I wanted to have some character moments with Mulder and Scully — that was super important to me,” says Nielsen. “I thought it would be interesting to have Scully reflecting on her religion. My sister is very Catholic, and I’m not. So I liked the dynamic of Scully being very Catholic and Mulder not; I related to that.”\n\n\n\nWhat Nielsen didn’t know at the time was that her episode would shift back one to become the penultimate episode of the season and potentially the series as a whole. Wednesday's episode revolved around a cult led by a former actress (Fiona Vroom) who was obsessed with maintaining their youth and the woman (Carlena Britch) trying to save her sister from them. The installment also could be the last “monster of the week” episode the iconic series does with its core team intact as star Gillian Anderson has said this will be her final year playing Scully.\n\n“The pressure that society puts on women to be perfect, to be beautiful is intense, because we’re such a consumerism society that we have to prey off of women’s insecurity to sell, sell, sell,” Nielsen says. The writer, who doubles as the show's script coordinator, also made sure the female characters were well-rounded and the episode also featured an inclusive cast. “Especially in Hollywood, you’re a write-off after 30. That pressure is quadrupled as an actress. That was a horrible and wonderful rabbit hole to go down [in writing]: having an actress try to hold on to her youth and obtaining that.”\n\nNielsen credits longtime X-Files writers James Wong (who directed the hour) and Glen Morgan with being the genesis of Scully’s (Gillian Anderson) religious origin story in the episode. When Scully was younger, her brother was sick, and her mother asked the family to pray for him. The first few days, a young Scully asked for a puppy … which she got shortly after her brother recovered. “It was the architecture of Jim and Glen knowing this character for so long, and seeing the things that she should be coming from,” she says, calling the duo her “dream team” collaborators. Morgan was also the one to suggest they have a visual callback to the mysterious coin Scully’s mother had on her when she died last season.\n\n\n\nThe hour ended up being pivotal for Mulder (David Duchovny) and Scully, whose relationship has grown increasingly murky. The dynamic duo’s partnership was always complicated during the original run of the series: after years of closeness, they slept together in season seven — a move that appeared to be responsible for the conception of Scully’s son, William — but due to outside forces (and Duchovny’s increased absence from the franchise) they were never properly a couple. The second feature film, The X-Files: I Want to Believe, found the two living together, away from the FBI life, but there was obvious tension in the relationship as they worked the movie’s case; they were broken up by the 2016 television revival.\n\n\n\nHowever, they appeared to potentially reconcile early in season 11, when they slept together and arranged a couple of dates. But in true Mulder and Scully fashion, they simply seemed to be existing together (they still reside in separate homes, for instance) versus actively engaging the shift in their relationship and what it could mean. But Scully took a step forward to break them out of their standstill in the final scene of the episode: when Mulder mentioned they were good together, she simply asked, “Are we together?”\n\n“To me it was about having a honest moment,” Nielsen says, acknowledging the open conversation between the two was part of why the episode moved directly pre-finale. “We need to be real, we need to be honest, we need to start saying something. They’ve gone through so many emotional things with their son, coming back to the X-Files and things not going so smoothly. And [also] coming back to the relationship, because they were away from it for so long; to see where that relationship sits now. It’s exhausting not being honest when you get to that stage. To be true to these characters, you had to have a true moment. It’s what those characters needed.”\n\n\n\nBut what was it that Scully needs? \"I don’t know if any God is listening, but I am standing right here,” Mulder told his partner. “And I am listening. Right besides you, all ears. That’s my choice.” She paused, looked around at the empty church, before whispering her hope for her future in his ear. “That’s not my 4-year-old self looking for a miracle,” she said. “That’s my leap of faith forward. And I’d like to do it together.”\n\n\n\nThe audience is in the dark about Scully’s request during the hour, intentionally. “That’s between Mulder and Scully,” Nielsen notes. “Having those private moments, it’s important for any couple.” And it won’t be revealed going forward, either: “It’ll always be between Mulder and Scully,” she says with a laugh. “It’s not for anyone else. That was their moment.” (Chalk it up to another unsolved mystery, a la the duo’s Christmas gifts to each other.)\n\nWith that exact sentiment remaining unspoken, it was essential the tone be handled correctly while filming the scene. “It’s just [them] being honest with each other,” Nielsen notes. “When you’re used to having that playful banter with someone, when they’re suddenly honest, it takes you aback. It’s, ‘Oh, we’re actually going to have a real conversation about this.’ Sometimes those things can be scary. It was something from the heart, which can be terrifying for her to do, especially given how much she’s been through and how much her heart has been broken, especially this season. That’s where I wanted it to come from: her vulnerability.”\n\n\n\nAnd, yes, in Nielsen’s mind, Mulder and Scully are meant to be together. “I feel like they’re each other’s soulmates and they know it,” she says. “They get in each other’s way, they’re complicated, they both have reasons why they hold back. They both have reasons they need each other. That’s why they’ve had such an up and down relationship: it’s not as easy as saying, ‘I like you, let’s make this work.’ The world they live in just doesn’t allow for that. Their love for each other, mind and body, makes them go, ‘There’s nobody else.’ There are so many moments you see them, they look at each other, and just from a look, [it’s] no one will get me like you do. That’s my personal take on it: they’re soulmates.”\n\n\n\nWhat do you think Scully whispered to Mulder?", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2018/03/the_x-files_s02e08_still.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/03/the_x-files_s02e08_still.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/03/the_x-files_s02e08_still.jpg", "keywords": [], "authors": ["Marisa Roffman", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/x-files-what-did-scully-whisper-mulder-1094323", "title": "'The X-Files': What Did Scully Whisper to Mulder?", "meta_data": {"viewport": "width=device-width", "description": "\"When you’re used to having that playful banter with someone, when they’re suddenly honest, it takes you aback,\" says episode writer Karen Nielsen. \"It’s, ‘Oh, we’re actually going to have a real conversation about this.’ Sometimes those things can be scary.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/x-files-what-did-scully-whisper-mulder-1094323", "domain": "https://www.hollywoodreporter.com/", "title": "'The X-Files': What Did Scully Whisper to Mulder?", "description": "\"When you’re used to having that playful banter with someone, when they’re suddenly honest, it takes you aback,\" says episode writer Karen Nielsen. \"It’s, ‘Oh, we’re actually going to have a real conversation about this.’ Sometimes those things can be scary.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/03/the_x-files_s02e08_still.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'The X-Files': What Did Scully Whisper to Mulder?", "description": "\"When you’re used to having that playful banter with someone, when they’re suddenly honest, it takes you aback,\" says episode writer Karen Nielsen. \"It’s, ‘Oh, we’re actually going to have a real conversation about this.’ Sometimes those things can be scary.\"", "url": "https://www.hollywoodreporter.com/live-feed/x-files-what-did-scully-whisper-mulder-1094323", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/03/the_x-files_s02e08_still.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'The X-Files': What Did Scully Whisper to Mulder?", "sailthru.description": "\"When you’re used to having that playful banter with someone, when they’re suddenly honest, it takes you aback,\" says episode writer Karen Nielsen. \"It’s, ‘Oh, we’re actually going to have a real conversation about this.’ Sometimes those things can be scary.\"", "sailthru.author": "Marisa Roffman", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-03-14 18:00:00", "sailthru.tags": "Live Feed, Television, The X-Files"}, "movies": [], "publish_date": 1521021600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}