{"url": "https://www.usatoday.com/story/life/people/2018/04/06/when-did-prince-harry-and-meghan-markle-first-hold-hands-public-timeline-their-royal-romance/489866002/", "text": "Maya King\n\nUSA TODAY\n\nIn a few weeks, actress Meghan Markle will go from a TV star to a member of the royal family.\n\nOn May 19, the 36-year-old Suits actress is set to take her vows with Prince Harry at St. George's Chapel in Windsor Castle. The couple has invited 600 guests to the event, which is set to include a church service, reception and after party, all paid for by the royal family.\n\nBut what lead up to the impending \"I dos\"? Here is an overview of the couple's royal relationship since they started dating in 2016.\n\nOct. 31, 2016: The news of Harry and Markle's relationship begins to break as a A close friend of Harry’s reportedly confirms that the couple has been dating for three months in an interview withPeople.\n\nNov. 8, 2016: In an unprecedented move, Kensington Palace issues a statement on behalf of Prince Harry in which Markle is referred to as Harry’s girlfriend for the first time. According to the release, then 35-year-old Markle fell “subject to a wave of abuse and harassment” by the media. “It is not right that a few months into a relationship with him that Ms. Markle should be subjected to such a storm,” it read.\n\nDec. 15, 2016: Prince Harry and Meghan Markle are photographed together for the first time while on a date . The couple reportedly went on a walk through Piccadilly London strolling through a busy street on their way to the Apollo Theatre. Some of the first images of the pair were captured on a few cellphone photos and published in the British tabloid magazine The Sun.\n\nJan. 3, 2017: Harry wears the blue bangle he matches with Markle on the cover of Town and Country magazine.\n\nJan. 16, 2017: Harry reportedly introduces Markle to his sister-in-law the Duchess Kate of Cambridge.\n\nMarch 2, 2017: Prince Harry and Markle attend a friend’s wedding in Jamaica together. They were spotted while en route to the reception.\n\nMay 8, 2017: Markle attends the Audi Polo Challenge in Ascot, England, where she was seen applauding Harry from the royal box.\n\nJune 11, 2017: Harry and Markle arrive together at the wedding reception for Pippa Middleton, Kate Middleton’s younger sister, who married James Matthews.\n\nSept. 5, 2017: Markle confirms her relationship with Harry in an interview with Vanity Fair, repeatedly referring to him as her boyfriend.\n\n“At the end of the day, I think it’s really simple,” she told the magazine. “We are two people who are really happy.”\n\nSept. 25, 2017: Harry and Markle make their public debut as a couple by arriving to the Toronto Invictus Games hand-in-hand.\n\nNov. 27, 2017: Markle moves to the U.K. and the couple officially announce their engagement with a photo shoot in the Sunken Gardens at Kensington Palace.\n\nNov. 28, 2017: Kensington Palace officially announces the royal wedding date.\n\nDec. 1, 2017: The couple make their first post-engagement public appearance in Nottingham, England.\n\nDec. 20, 2017: Markle joins Prince Harry for her first pre-Christmas lunch with the royal family at Buckingham Palace.\n\nDec. 25, 2017: The newly-engaged couple attend Christmas Day service with the entire royal family at St. Mary Magdalene Church in Sandringham, England.\n\nFeb. 1, 2018: Prince Harry and Meghan Markle arrive together at the Endeavour Fund Awards in London. This was Markle’s first official evening appearance with the prince.\n\nFeb. 13, 2018: Markle and Harry take a tour of the Edinburgh Castle in Edinburgh, Scotland. The couple broke the royal tradition of little physical contact in public by walking hand-in-hand.\n\nFeb. 28, 2018: Markle makes her first joint appearance with Prince William and Duchess Kate of Cambridge for the first Royal Foundation Forum, held in London. When she weds Prince Harry, Markle’s name will be added to the foundation’s title and launch her to the official role of royal philanthropist.\n\nMarch 8, 2018: Harry and Markle are photographed in Birmingham, England to celebrate International Women’s Day. The two also spent time with local students while in the English city.\n\nMarch 12, 2018: Harry and Markle accompany Prince William and Duchess Kate of Cambridge to Commonwealth Day service at Westminster Abbey.\n\nMarch 23, 2018: The couple make their first official visit together in a trip to Northern Ireland.\n\nMarch 31, 2018: Prince Harry and Markle select Philippa Craddock to design the floral arrangements for the couple's church service, wedding ceremony and reception.\n\nMore: Prince Harry and Meghan Markle's royal wedding: What we know and what we don't know\n\n\n\nMore: How watching 'Suits' has changed, now that Meghan Markle is almost royal", "images": ["https://www.gannett-cdn.com/-mm-/cef796087f7d40c8faec928557f4ddce08bc86e4/c=0-89-2037-1240/local/-/media/2018/04/05/USATODAY/USATODAY/636585337616712293-AP-ROYAL-WEDDING-AMERICAN-PRINCESSES-98908243.JPG?width=2037&height=1151&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/cef796087f7d40c8faec928557f4ddce08bc86e4/c=0-89-2037-1240/local/-/media/2018/04/05/USATODAY/USATODAY/636585337616712293-AP-ROYAL-WEDDING-AMERICAN-PRINCESSES-98908243.JPG?width=2037&height=1151&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/04/06/when-did-prince-harry-and-meghan-markle-first-hold-hands-public-timeline-their-royal-romance/489866002/", "title": "When did Prince Harry and Meghan Markle first hold hands in public? A timeline of their royal romance", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "When did Prince Harry and Meghan Markle first hold hands in public? A timeline of their royal romance", "description": "A look at Prince Harry and Meghan Markle's relationship since they first began dating in 2016.", "url": "https://www.usatoday.com/story/life/people/2018/04/06/when-did-prince-harry-and-meghan-markle-first-hold-hands-public-timeline-their-royal-romance/489866002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/cef796087f7d40c8faec928557f4ddce08bc86e4/c=0-89-2037-1240/local/-/media/2018/04/05/USATODAY/USATODAY/636585337616712293-AP-ROYAL-WEDDING-AMERICAN-PRINCESSES-98908243.JPG?width=2037&height=1151&fit=crop&format=pjpg&auto=webp", "width": 2037, "height": 1151}, "type": "article"}, "article": {"author": "Maya King", "content_tier": "free", "opinion": "false"}, "description": "A look at Prince Harry and Meghan Markle's relationship since they first began dating in 2016.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/cef796087f7d40c8faec928557f4ddce08bc86e4/c=0-89-2037-1240/local/-/media/2018/04/05/USATODAY/USATODAY/636585337616712293-AP-ROYAL-WEDDING-AMERICAN-PRINCESSES-98908243.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "When did Prince Harry and Meghan Markle first hold hands in public? A timeline of their royal romance", "description": "A look at Prince Harry and Meghan Markle's relationship since they first began dating in 2016."}}, "movies": [], "publish_date": 1522944000.0, "source": "https://www.usatoday.com", "summary": ""}