{"url": "https://www.oversixty.com.au/lifestyle/relationships/the-truth-about-michael-j-fox-and-tracy-pollans-inspiring-30-year-love-story", "text": "They fittingly met on the ‘80s hit show Family Ties, but it wasn’t love at first sight for Michael J. Fox and Tracy Pollan. In fact, both were seeing other people at the time and it would be several years before the pair coupled up to become one of Hollywood’s most enduring relationships.\n\nAlthough their characters Alex P. Keaton and Ellen Reed were loved up on Family Ties, in real life Pollan was in a serious long-term relationship with Kevin Bacon and Fox was dating Facts of Life actress Nancy McKeon.\n\n\"I always thought [Tracy] was cool,\" Fox told People years later, \"but it was like a couple of married people who worked together and liked each other.\"\n\nIt wasn’t until 1987 when the Pollen and Fox worked together in a movie called Bright Lights, Big City that a romance began to blossom.\n\nPollan told Winfrey in 2002: \"From the beginning, I loved his sense of humour and that brain of his. He's so smart.\"\n\nFox told People in 1989 of hearing that Pollen and Bacon had split: \"It sounds really horrible, but it was one of those things. Someone goes, 'Did you hear that so-and-so aren't together anymore?' and you go, 'Hmm, that's too bad. Where's the phone?'\"\n\nSeven months after they started dating, he proposed on December 26, 1987.\n\n\"I wasn't really worried that she would say no,\" he recalled. \"The toughest part was trying to figure out when to get married, and then to figure out how nobody else could know about it.\"\n\nThe couple tied the knot in an outdoor ceremony at Vermont's West Mountain Inn on July 16, 1988. Fox, who is Episcopalian, and Pollan, who is Jewish, had an interfaith ceremony with both a minister and rabbi.\n\n\"Michael seemed a little nervous,\" Rev. Joan O'Gorman later told People. \"In fact, they seemed just like any other young and loving couple who were excited to be getting married.\"\n\nTheir first child, a son they named Sam Michael, was born on May 30, 1989. Fox and Pollan loved being parents, and would go on to have twin girls, Aquinnah Kathleen and Schuyler Frances, in 1995, and one more daughter, Esmé, in 2001.\n\n\"I kind of shut the door and said to everyone we love who wanted to see the baby, 'Just give us a little bit of time to get used to it ourselves,'\" Fox said after the birth of Sam. \"What's interesting is that the parental instinct just kicks in. The next thing you know, you've got a sore hip because you're holding him all the time.\"\n\nThe couple grew even closer when faced with one of life’s biggest challenges – Fox was diagnosed with Parkinson's disease at age 29 in 1991 (though it wasn’t until 1998 that he shared the news publicly).\n\n\"A lot of my adjustment has been dictated by Michael's point of view,\" Pollan said in a 2002 interview with Oprah Winfrey. \"He's so relaxed and so accepting of where he is, and that makes it easier for me, the kids, and everyone around him.\"\n\nBut when the couple first received the news, it completely shocked and devastated them. Fox fell into a depression and started drinking heavily, before eventually getting a handle on his new reality.\n\n\"I used to drink to party,\" the actor recalled on The Howard Stern Show in 2013, \"but...now I was drinking alone and to just not be [present]. Every day.\"\n\n\"So once I did that,\" he continued, \"then there was about a year of, like, a knife fight in a closet, where I just didn't have my tools to deal with it. Then after that, I went into therapy and it all started to get really clear to me.\"\n\nHe said he realised he just had to take life \"one day at a time” and \"then everything started to really turn the other way. My marriage got great, and my career...\"\n\nStern interjected here to suggest Fox's marriage \"got great\" after he realszed that Pollan wasn't going anywhere after his diagnosis. \"Exactly,\" Fox agreed.\n\nFox later told Winfrey: \"There were a lot of questions I was afraid to ask Tracy. \"Like, 'Does it scare you that I'm sick? Do you not love me because I'm sick?' I didn't ask her those questions. But nothing Tracy was doing was showing me that she didn't want to be with me.\"\n\nWhen Fox publicly revealed that he had Parkinson's disease in 1998, he began in earnest his life’s mission of raising awareness and money for Parkinson’s through the Michael J. Fox Foundation. As of April 2017 the foundation has funded more than $700 million in research.\n\n\"The reason I wasn't telling was that I wondered if people would still laugh if they knew I was sick,\" Fox told Winfrey. \"Can you laugh at a sick person [on TV] and not feel like an a--hole? I finally thought, let me not worry about that. What other people think is none of my business. I just have to have faith in the audience. If it's funny, they'll laugh.\"\n\nAnd every day the couple deal with Fox's condition, but always as a team.\n\n\"Tracy wasn't sentimental or romantic about it at all,\" he told AARP magazine in 2017 about how his wife reacted to his Parkinson's diagnosis. \"No terror. No big windy... So, no exhibition of grief and fear. Tracy was just like, 'You've got a stone in your shoe. We'll do what we can until you can get it out. In the meantime, if you limp with the stone, that's all right. You can hold my hand, and we'll get over that.'\"\n\nPollan added that, of course, there were tough days, but they both knew they were in this together.\n\n\"Through it all we've loved each other,\" Fox said. \"And that love never died,\" Pollan added. \"We had a solid foundation to begin with.\"\n\nWhen Winfrey asked if Fox felt Parkinson's had been a blessing for their marriage, giving them no choice but to become stronger, Fox replied: \"I've often referred to Parkinson's as the gift that keeps on taking. It's a gift in that it really gave me a whole different appreciation for life. I discovered that I wasn't me minus Parkinson's. I was me plus it. I have been enriched by what it has opened up for me. It hasn't allowed me to take anything for granted.\"\n\nBefore the diagnosis, \"I had been constantly taking care of this and making sure that was okay, and now Tracy and I are just in it.\"\n\nWhen asked about their then-27-year marriage in 2015, Pollen said: \"It's like dog years!\"\n\nShe told People that \"giving each other the benefit of the doubt\" has been key to keeping their marriage strong.\n\n\"There are so many times when you have arguments, when you have things come up, and it really doesn't have anything to do with what he did, or said – it's how I am projecting that onto myself,\" Pollan continued. \"A lot of times he'll just say to me, 'You know who I am, would I ever say anything to try to hurt your feelings? Just give me the benefit of the doubt.'\"\n\n\"I'm irritating but lovable, I have that effect on everybody,\" Fox said during the Daily Shot interview.\n\n\"[I] won the lottery in the wife department,\" he later added.", "images": ["https://hips.hearstapps.com/clv.h-cdn.co/assets/17/39/768x980/gallery-1506544204-gettyimages-140631084.jpg?resize=480:*", "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/39/980x1001/gallery-1506543551-gettyimages-1319529.jpg?resize=480:*", "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/39/980x654/gallery-1506544626-gettyimages-693930746.jpg?resize=480:*", "https://oversixtydev.blob.core.windows.net/media/7819827/michael-j-fox-tracy-pollen.jpg", "https://www.oversixty.com.au/assets/images/OverSixty_200x40_White.svg", "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/39/768x995/gallery-1506542281-gettyimages-529485432.jpg?resize=480:*", "https://akns-images.eonline.com/eol_images/Entire_Site/2018612/rs_1024x759-180712134829-1024-mjfox-tracy-nba-game.jpg?fit=inside|900:auto&output-quality=90"], "top_img": "https://oversixtydev.blob.core.windows.net/media/7819827/michael-j-fox-tracy-pollen.jpg", "keywords": [], "authors": ["Melody Teh"], "canonical_link": "https://www.oversixty.com.au/lifestyle/relationships/the-truth-about-michael-j-fox-and-tracy-pollans-inspiring-30-year-love-story", "title": "The truth about Michael J. Fox and Tracy Pollan's inspiring 30-year love story", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"url": "https://www.oversixty.com.au/lifestyle/relationships/the-truth-about-michael-j-fox-and-tracy-pollans-inspiring-30-year-love-story", "type": "article", "title": "The truth about Michael J. Fox and Tracy Pollan's inspiring 30-year love story | OverSixty", "description": "Michael J. Fox and Tracy Pollan share how they’ve kept their 30-year marriage so strong.", "image": "https://oversixtydev.blob.core.windows.net/media/7819827/michael-j-fox-tracy-pollen.jpg"}, "gtm": "GTM-TXMT52H", "fuse": 1129, "taboola": "au", "description": "Michael J. Fox and Tracy Pollan share how they’ve kept their 30-year marriage so strong.", "author": "Melody Teh", "keywords": "Relationships,Movies,Hollywood,Michael J. Fox,Tracy Pollen", "fuseSection": "lifestyle", "fuseSubsection": "relationships"}, "movies": [], "publish_date": null, "source": "https://www.oversixty.com.au", "summary": ""}