{"url": "https://www.vogue.com/article/supermodel-diets-gisele-bundchen-lily-aldridge-miranda-kerr", "text": "First, let’s state the obvious: The lithe, lean build of a top model is a matter of hereditary luck, the result of a genetic supernova. And yet, even the world’s best bodies have to put in the proverbial work, approaching their high-intensity training schedules with the focus of a professional athlete—and, in many cases, honing in on the precise healthy eating plan that will keep them photo-ready 365 days a year. When it comes to the latter, there’s good news for mere mortals, who can benefit from their carefully chosen programs, too. Here are five model tried-and-true food philosophies worth investigating this month.\n\nGisele Bündchen: The Plant-Based Diet\n\nThe details of Gisele Bündchen and Tom Brady’s plant-based, organic regimen have been public since 2016; since then, their diet, masterminded by personal chef Allen Campbell, has been making waves in the health community. Consisting of almost 80 percent vegetables, it’s rounded out with whole grains like millet, quinoa, and beans, as well as lean meats like grass-fed steak, duck, and wild salmon. Following that list of dos is a long list of don’ts. For Brady and Bündchen, there is no white sugar, white flour, iodized salt, caffeine, fungus, or nightshades (if you need a brush up, that encompasses tomatoes, peppers, mushrooms, eggplants); fresh fruit is reserved mainly for the couple’s kids. While meal planning for these particulars may be harrowing, a single week of this clean eating can press reset on bad habits.\n\nLily Aldridge: The Sakara Meal-Delivery Diet\n\nFor super nutrition without any of the shopping, chopping, or portioning, the chic and health-conscious flock to Sakara. The cultish meal-delivery brand boasts bombshell Lily Aldridge as a devotee—her favorite breakfasts, lunches, and dinners even inspired a limited edition curated Sakara plan bearing her name; fellow models Erin Heatherton, Chrissy Teigen, Karolina Kurkova, and Hilary Rhoda have also sung its praises. Available in three- or five-day per-week subscriptions, as well as a 10-day reset plan, Sakara delivers fresh, fully organic, vegetarian breakfasts, lunches, dinners, and drinks to your door—meaning all you have to do to eat well is tear off the lid.\n\nCarolyn Murphy: The Alkaline Diet\n\nAn alkaline diet, which limits acidic foods in an effort to alter the body’s pH level, is high in fruits, vegetables, nuts, and legumes and low in meat, fish, dairy, eggs, grains, and alcohol. While detractors point out that the digestion process introduces all foods to acid in the stomach, and therefore argue that any pH balancing effect would be short lived, the diet’s emphasis on vegetables, fruit, and low-fat proteins is inarguably heart-friendly. If committing full scale to the eating plan isn’t in the cards, take a cue from the ageless Carolyn Murphy, who has been vocal about her love of alkaline water, along with Transcendental Meditation, as an established part of bringing balance to her health routine.\n\nMiranda Kerr: The Blood Type Diet\n\nNaturopath Dr. Peter J. D’Adamo’s much-debated dietary system is designed for each of the four blood types (A, B, AB, and O) and asks followers to stick to a largely vegetarian diet while steering clear of corn, wheat, and certain beans. While a major scientific review of the diet in 2014 found the benefits of D’Adamo’s different programs did not show any correlation to participants’ blood types, it did find that devotees of the blood type A program, which have included model Miranda Kerr, lowered BMI, waist circumference, blood pressure, cholesterol, insulin, and other significant markers.\n\nBridget Malcolm: The Vegan Diet\n\nA vegan diet, touted by everyone from Beyoncé to Australian Victoria’s Secret model Bridget Malcolm, is free from all animal-derived products. Centered around fruit, vegetables, and grains, the diet can cover all nutritional needs, if care is given to balancing meals. “When I first became vegan, I heard from so many people that I had a new glow to me,” Malcolm, who was named PETA Australia’s Sexiest Vegetarian of 2015, has said—reason enough to stick to green and clean cuisine.", "images": ["https://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg", "https://assets.vogue.com/photos/59260ae4a792802a019c4d1d/16:9/w_1280,c_limit/00-social-tout-model-diet-update.jpg", "https://assets.vogue.com/photos/5858495cc0c370f2147503db/1:1/w_90%2Cc_limit/elizabeth-inglese-bio-pic.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://www.vogue.com/wp-content/uploads/2018/04/25/Banner-Beauty.jpg", "https://assets.vogue.com/photos/59260ac6a792802a019c4d1b/master/w_2560%2Cc_limit/00-lede-model-diet-update.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg"], "top_img": "https://assets.vogue.com/photos/59260ae4a792802a019c4d1d/16:9/w_1280,c_limit/00-social-tout-model-diet-update.jpg", "keywords": [], "authors": ["Elizabeth Inglese", "Elizabeth Ingles"], "canonical_link": "https://www.vogue.com/article/supermodel-diets-gisele-bundchen-lily-aldridge-miranda-kerr", "title": "Eat Like a Supermodel! 5 Healthy Food Plans Behind the World’s Best Bodies", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Elizabeth Inglese", "copyright": "Copyright (c) Condé Nast 2020", "description": "From the plant-based diet to the blood-type diet, here are five healthy food plans behind the world's best bodies.", "id": "58915cf358aa89a00d542fe1", "keywords": "health & fitness,models,beauty secrets,supermodels!,miranda kerr,gisele bündchen,lily aldridge,carolyn murphy", "news_keywords": "health & fitness,models,beauty secrets,supermodels!,miranda kerr,gisele bündchen,lily aldridge,carolyn murphy", "robots": "index, follow", "content-type": "article", "parsely-post-id": "58915cf358aa89a00d542fe1", "parsely-metadata": "{\"description\":\"From the plant-based diet to the blood-type diet, here are five healthy food plans behind the world's best bodies.\",\"image-16-9\":\"https://assets.vogue.com/photos/59260ac3c4070c785e172c27/16:9/w_1000,c_limit/00-tout-model-diet-update.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/59260ac3c4070c785e172c27/1:1/w_1000,c_limit/00-tout-model-diet-update.jpg\"}", "og": {"description": "From the plant-based diet to the blood-type diet, here are five healthy food plans behind the world's best bodies.", "image": "https://assets.vogue.com/photos/59260ae4a792802a019c4d1d/16:9/w_1280,c_limit/00-social-tout-model-diet-update.jpg", "site_name": "Vogue", "title": "Eat Like a Supermodel! 5 Healthy Food Plans Behind the World’s Best Bodies", "type": "article", "url": "https://www.vogue.com/article/supermodel-diets-gisele-bundchen-lily-aldridge-miranda-kerr"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "From the plant-based diet to the blood-type diet, here are five healthy food plans behind the world's best bodies.", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/59260ae4a792802a019c4d1d/16:9/w_1280,c_limit/00-social-tout-model-diet-update.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "Eat Like a Supermodel! 5 Healthy Food Plans Behind the World’s Best Bodies"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "https://www.vogue.com", "summary": ""}