{"url": "www.thehollywoodgossip.com/2018/03/beyonce-blasts-kim-kardashian-with-diss-track-lyrics/", "text": "While Kim Kardashian was busy trying to figure out a way to take down Kylie Jenner -- or at least one-up her younger sister as they vie to be Most Successful Kardashian -- she should have been wary of someone else.\n\nBeyonce's come out with some new lyrics that appear to be taking aim at Kim Kardashian.\n\nThis feud is heating up again!\n\nIt's true that Beyonce is notorious for dropping new music or explosive new music videos without notice, allowing her art to promote itself through word of mouth and social media as a display of her power and impact.\n\nBut no, Beyonce didn't just drop another Lemonade on us last night.\n\nInstead, she's lent her considerable talents to DJ Khaled, being featured in his song \"Top Off.\"\n\nActually, both Beyonce and Jay-Z are featured -- and so is Future, for that matter.\n\nBut it's Queen Bey who's getting the most attention. In part because she's Beyonce.\n\nIn part, however, because her lyrics appear to be taking direct aim at Kim Kardashian.\n\nHere are the lyrics in question:\n\n\"I'm the only lady here, still the realest n--ga in the room.\"\n\nThe other individuals would be Jay-Z, DJ Khaled, and Future, one assumes.\n\n\"I break the internet, top two and I ain't number two.\"\n\nThat line sounds innocuous enough as well as a round-about way of calling oneself number one but, as we'll explain, it appears to be a Kim Kardashian diss track.\n\nAnd so does:\n\n\"My body, my ice, my cash, all real, I'm a triple threat.\"\n\nThen there are some lyrics that mesh a little more directly with DJ Khaled's song but aren't necessarily as relevant to this.\n\n(And then there's another fairly direct call-out but we'll get to that in a moment)\n\nLet's start with that line about her body and her wealth and her ice being \"all real.\"\n\nIce, of course, is a reference to jewelry not being fake. As for wealth, Jay-Z revealed in his 4:11 album that Kanye is apparently in debt to him. Is Beyonce implying that maybe Kanye's wealth is at least partially an illusion?\n\nBut it's been rumored time and time again that Kim Kardashian's body is the result of plastic surgery. Or that, at the very least, she's had a little work done to keep herself looking her best.\n\nKim has spoken out about these rumors on Keeping Up With The Kardashians, saying that they're not true.\n\nWhen Beyonce says that she breaks the internet, it could not more clearly be a reference to Kim's epic Paper photo.\n\nWhether in lust or awe or confusion or shock or a newfound definition of how humans could look, Kim Kardashian's infamous viral photo was everywhere a few years back.\n\nObviously, the photo did no damage to the internet, but merely received a tremendous amount of attention.\n\nBeyonce also receives a tremendous amount of attention -- for her songs, for her music videos, for her activism.\n\nHer jab at Kim may go beyond saying that she's better.\n\nBeyonce may be highlighting that Kim's most powerful social media presence tends to come from her body, rather than from creative output.\n\nOf course, Kim Kardashian wasn't the only person at whom Beyonce took aim with her lyrics on this song.\n\n\"Two deep, it's just me and JAY / Just posted in them courtside seats.\"\n\nAnd then:\n\n\"Woo! I'm like \"hol' up / Woo! I might roll up \\ If they're tryna party with the queen / They gon' have to sign a non-disclosure, ayy\"\n\nThat has been identified by numerous fans as a clear reference to Tiffany Haddish revealing too much about Beyonce recently.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--UY9uh3_o--/t_small/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1364526853/jay-z-image.jpg", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--aE-RERxA--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1520263613/attachment/beyonce-kim-kardashian-split.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--9Y9PL_fG--/t_small/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1364526893/blue-ivy-carter-picture.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--aE-RERxA--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1520263613/attachment/beyonce-kim-kardashian-split.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/03/beyonce-blasts-kim-kardashian-with-diss-track-lyrics/", "title": "Beyonce Blasts Kim Kardashian with Diss Track Lyrics", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/03/beyonce-blasts-kim-kardashian-with-diss-track-lyrics/", "title": "Beyonce Blasts Kim Kardashian with Diss Track Lyrics", "description": "Beyonce has come out with new lyrics that appear to be taking aim at Kim Kardashian. This feud still hasn't gone away.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--9sAT2LNy--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1473799044/katy-perry-taylor-swift-grammy-awards-icons-salute-2010.jpg", "type": "image/jpeg", "width": 630, "height": 1046}}, "article": {"published_time": "2018-03-05T11:31:04-05:00", "modified_time": "2018-03-05T11:32:33-05:00", "tag": "Music", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Beyonce Blasts Kim Kardashian with Diss Track Lyrics", "description": "Beyonce has come out with new lyrics that appear to be taking aim at Kim Kardashian. This feud still hasn't gone away.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--aE-RERxA--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1520263613/attachment/beyonce-kim-kardashian-split.png"}}, "description": "Beyonce has come out with new lyrics that appear to be taking aim at Kim Kardashian. This feud still hasn't gone away."}, "movies": [], "publish_date": 1520267464.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}