{"url": "https://www.inquisitr.com/5206930/britney-spears-and-boyfriend-sam-asghari-post-hilarious-new-video-on-instagram/", "text": "Britney Spears and her boyfriend Sam Asghari posted a video on Wednesday night which gave fans a hilarious glimpse at what the singer is really like when she’s hungry. In the Instagram clip, Spears and Asghari start off walking hand in hand down a hallway. As they walk, you can hear Asghari complimenting Spears on her outfit. But then she interrupts him and asks where they’ll be eating. When he says “steakhouse,” she gets a goofy expression on her face and runs off, to which Asghari replies, “I think she’s really hungry.”\n\nSpears confirmed that in the caption of her video.\n\n“I was freaking hungry.” she wrote.\n\nBritney Spears and Sam Asghari have often given fans behind the scenes peeks into their relationship via posts on Instagram. They’ve become known for their couples workout videos which show off their physical fitness and affection for each other. Britney also regularly shares heartwarming photos of them looking very much in love.\n\nIn the past, Asghari has said that he believes that they were brought together by fate. He was cast in her “Slumber Party” video in 2016 and he told Men’s Health that his inclusion in the taping was a last minute decision as they had already hired most of the other people who were in it.\n\n“I got a call at midnight,” Asghari told Men’s Health in July.\n\n“It went through so much to get to me. I don’t know if it’s some sort of a blessing or just meant to be.”\n\nThe Iranian-born model added that he tried to be funny with her after she introduced herself by pretending that he didn’t hear her name. It looks like the joke worked though because shortly after the video was released, the two were photographed together by paparazzi. Based on what Asghari said to Men’s Health, it looks like they started dating very soon after they met because, at one point, he reveals they never had any intention of being friends.\n\nDuring the interview, Asghari raved about his popstar girlfriend, praising her for her humble nature and expressing gratitude for her presence in his life.\n\n“She motivates me more than anyone,” Asghari continued.", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/12/Britney-Spears-and-Sam-Asghari.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/5206930/britney-spears-and-boyfriend-sam-asghari-post-hilarious-new-video-on-instagram/", "title": "Britney Spears And Boyfriend Sam Asghari Post Hilarious New Video On Instagram", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}