{"url": "https://people.com/tv/why-nikki-bella-hid-her-first-marriage-from-john-cena-and-how-he-reacted-when-he-found-out/", "text": "John Cena and Nikki Bella had a lot of ups and downs in their six-year relationship, one of which was the time Bella revealed that she had been married before she met Cena.\n\nThe secret was one of the biggest plot points of Total Divas season 2, which aired in 2014.\n\nGet push notifications with news, features and more.\n\nBy that point, Cena, 40, and Bella, 34, had been dating for two years. She was even living with him, having signed his 75-page cohabitation agreement that forces her to move out all her belongings “as soon as possible” upon their separation.\n\nBut Bella was still hiding her past nuptials. And it turns out, it was not just from Cena.\n\nDuring an emotional sit-down captured on camera, Bella told her family about her wedding for the first time — explaining to mom Kathy Colace, brother JJ Garcia and twin sister Brie (among others) that she was ashamed of her decision.\n\n“I got married when I was 20. And got divorced at 23, to my high school sweetheart,” Bella said. “Basically we got married by Elvis. We drove to Vegas, did it.”\n\nThe union was something Bella regretted from the beginning. “Even when I started walking down the aisle, I knew this was a huge mistake and how can I get out of it and I couldn’t,” she recalled. “I tried to forget about it but now it’s starting to come up, and I figured you guys have to hear from me before you hear from anyone else. It’s crazy ’cause John doesn’t even know and here we talk about marriage and we never bring it up.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nHer family were not happy, especially Colace, who wondered why Bella didn’t think she could come to her.\n\nBut it was Garcia who showed the most anger, some of which was on behalf of Cena.\n\n“John’s gonna be pissed. I’d be pissed for him if you hadn’t told him. ‘Cause you talk about marriage all the time with him, don’t expect it to be easy,” Garcia said. “[These things] really don’t just happen. You don’t just run off and get married and not tell your family for 10 years. That doesn’t just happen. You do what you got to do and I hope you figure it all out with John.”\n\nImage zoom\n\nIt was Garcia who would accidentally spill the beans about the secret nuptial to Cena first, mentioning it at sister Brie’s 2014 wedding to her husband Daniel Bryan.\n\n“I heard you’re handling everything awesome,” he told Cena. “For her to tell you that she’s been married before and you had no problem with it, I have to give you kudos man.\n\nCena look flabbergasted but kept the conversation moving.\n\nLater, Bella finally got the courage to say something to Cena herself.\n\nLuckily, having gone through a divorce (to ex-wife Elizabeth Huberdeau in 2012 after three years of marriage), Cena was more understanding than anything. Still, as the two had been fighting about marriage — with Cena reluctant to walk down the aisle again — he encouraged Bella to be more honest with him.\n\n“When the focus of most of our problems has to do with that particular topic, maybe I should know that stuff,” he told Bella. “I know how you feel. You’re a human being, so I know you want certain things. But I would especially know how you feel about it because you had a bad experience.”\n\n“I don’t care,” Cena added. “What you did before you met me is what you did before you met me, I don’t need to know everything about you. It’s just when you can tell other people and I kind of would like to be on that totem pole somewhere — I don’t have to be at the top … I just would like to be on it.”\n\nImage zoom Gary Miller/FilmMagic\n\nBella look relieved, though she said she did “feel bad” she didn’t tell Cena.\n\n“I’ve realized that I need to start having confidence in my relationship with John and that he accepts me for all my faults,” she told the camera. “I am so relieved that John and I have made up and I’m just happy to be here with my family… honestly, nothing can go wrong now. Everything is perfect.”\n\nRELATED VIDEO: John Cena and Nikki Bella End Engagement Weeks Before Destination Wedding\n\nCena and Nikki announced that they called off their engagement Sunday, a year after he proposed during WrestleMania 33.\n\nThe couple, who were together for six years, were supposed to marry May 5 during their planned destination wedding.\n\nAn insider previously told PEOPLE she was the one who pulled the plug on their wedding.\n\n“John acted more and more like he was doing her a favor by somehow conceding to go ahead and marry her,” the insider said. “[Nikki] doesn’t need a pity proposal, a pity wedding, a pity husband. She’s a phenomenal, tremendous woman.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fjohn-cena-nikki.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fespy-awards-24-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=800&h=419&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fespy-awards-24-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=800&h=419&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fespy-awards-24-1.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/why-nikki-bella-hid-her-first-marriage-from-john-cena-and-how-he-reacted-when-he-found-out/", "title": "Why Nikki Bella Hid Her First Marriage from John Cena — and How He Reacted When He Found Out", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Athletes,John Cena,News,Nikki Bella,TV", "news_keywords": "Athletes,John Cena,News,Nikki Bella,TV", "description": "John Cena and Nikki Bella had a lot of ups and downs in their six-year relationship, one of which was the time Bella revealed that she had been married before she met Cena", "og": {"title": "Why Nikki Bella Hid Her First Marriage from John Cena — and How He Reacted When He Found Out", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/why-nikki-bella-hid-her-first-marriage-from-john-cena-and-how-he-reacted-when-he-found-out/", "description": "John Cena and Nikki Bella&nbsp;had a lot of ups and downs in their six-year relationship, one of which was the time Bella revealed that she&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=800&h=419&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fespy-awards-24-1.jpg", "width": 800, "height": 419}}, "pinterest": {"url": "https://people.com/tv/why-nikki-bella-hid-her-first-marriage-from-john-cena-and-how-he-reacted-when-he-found-out/", "description": "John Cena and Nikki Bella had a lot of ups and downs in their six-year relationship, one of which was the time Bella revealed that she had been married before she met Cena", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fespy-awards-24-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/why-nikki-bella-hid-her-first-marriage-from-john-cena-and-how-he-reacted-when-he-found-out/", "title": "Why Nikki Bella Hid Her First Marriage from John Cena — and How He Reacted When He Found Out", "description": "John Cena and Nikki Bella had a lot of ups and downs in their six-year relationship, one of which was the time Bella revealed that she had been married before she met Cena", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=800&h=419&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fespy-awards-24-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/LKzA4vDL3bg", "https://www.youtube.com/embed/sP5Ju-RX-pc", "https://www.youtube.com/embed/OkalERYw9iw"], "publish_date": null, "source": "https://people.com", "summary": ""}