{"url": "https://variety.com/2017/tv/news/shows-we-quit-2017-walking-dead-homeland-riverdale-1202645055/", "text": "In general, it’s advisable to finish what you start — but if what you started was a show that eventually felt more like an obligation than entertainment, who has the time to stick with it?\n\nAnd in the era of Peak TV, sometimes we have to sacrifice series in place of others. Maybe they were once beloved and just dragged on too long; maybe they were new shows that just didn’t stick; or maybe, life just got busy. Variety‘s own staff had to leave a few series behind, whether they were finally giving up on Rick Grimes and co. on “The Walking Dead” or saying goodbye to “Friends From College” in its first season. Here are their show-quitting confessions.\n\n“House of Cards” (Netflix)\n\nKnowing what we know now, my decision to break up with the political potboiler seems prescient. But I tuned out long before the Kevin Spacey revelations — when its fifth season premiered — and though the prospect of watching Robin Wright take center stage is certainly tempting, I’ve already moved on. Blame it on the headlines. Blame it on the constant churn of the news cycle. But this political junkie gets enough of a fix from reality. — Debra Birnbaum\n\nMaybe “House of Cards,” like your typical presidential term, should have ended after four years. Even before the Kevin Spacey allegations dropped, the Frank Underwood shtick was starting to feel old. As the show killed off more characters — and tainted the rest — who was left to root for? Robin Wright’s electric charisma could only keep me hanging on for so long. But who am I kidding? As producers mull killing off Frank Underwood in its sixth and final season, the promise of Claire Underwood leading a (kind of) grieving nation may just yet pull me back in. — Alex Stedman\n\n“Game of Thrones” (HBO)\n\nEndings are tough, and with a sprawling cast and a story spread out over several different mythical worlds, “Game of Thrones” faces a unique challenge. Still, after deliberately and painstakingly laying out its warring Iron Throne aspirants over six seasons, the HBO show’s creators are rushing to wrap things up with dizzying speed. That’s led to some serious plot holes and pacing problems, as “Game of Thrones” has dispatched key characters to tie up loose ends across the Seven Kingdoms, often ignoring pesky issues of geography and travel time. For me, the show officially jumped the white walker when Jon Snow was sent to the other side of the Wall to capture a “live” wight in order to convince Cersei to join forces with hated enemy Daenerys to stave off the existential threat posed by armies of the undead. That scheme is ludicrous because Cersei has shown no taste for empirical evidence in the proceeding seasons and because a journey that would have consumed a 12-episode arc in previous years transpires over the course of a half hour. As loyal viewers know, the whole adventure ends with a late-in-the-game dragon rescue and me deciding to pack it in without finding out who will rule Westeros. — Brent Lang\n\n“Santa Clarita Diet” (Netflix)\n\n\n\nHaving grown up in the Santa Clarita Valley, it was always fun to point out locations in shows or movies that I recognized around town. Santa Clarita is so often used to represent other locations, and it’s ironic that when a show is finally set in SCV, the town is almost unrecognizable. If you’re using real businesses, why make up locations? And if you’re going to make up locations why set the show in a real town rather than a fictional one? Much of the show’s humor is dead on arrival, based on inside jokes about SCV life that non-residents probably won’t fully grasp, recycled gags, or repetitive references to Drew Barrymore’s character’s undead vagina. While the show’s premise had promise and its social critique of suburban life is often spot-on, clunky writing and lifeless performances from Barrymore and Timothy Olyphant kill any momentum before it even takes off. — Matt Fernandez\n\n“The Walking Dead” (AMC)\n\nWhen Glenn’s brains hit the pavement, so did my heart. To be fair, even after that traumatic Season 6 premiere that bordered on torture porn, I stuck through it for 2016, dredging through every demoralizing episode. And it did get better — though it was painful to watch us lose Sasha as Sonequa Martin-Green moved on to “Star Trek: Discovery,” I cheered as Shiva mauled one of Negan’s soldiers and Maggie led Hilltop in triumphant fashion in the finale. I thought that would be enough to reel me back in, since I was already hanging by a thread, but Season 7’s slow start finally made me lose interest. It’s not like I meant to break it off with “The Walking Dead.” In fact, I fully intended to return to those episodes piling up on my DVR like wasted zombie bodies! But after I heard about a certain character’s death in the Season 7 midseason finale, I’m not sure it’s stress I want to put back on myself. — Alex Stedman\n\nDC on the CW (“Arrow,” “The Flash,” “DC’s Legends of Tomorrow,” “Supergirl”)\n\nAnti-hero series were quite the trend a few years ago, but these four series, each with varying degrees of roots in DC comic book characters, were designed to have the central figures be the heroes of the stories. However, all-too-often the heroes were the ones causing catastrophic complications — from Barry Allen (Grant Gustin) becoming Savitar to the Legends literally breaking time. While initially interesting as origin story missteps, as time (and seasons) went on, it became harder and harder to root for characters that kept putting selfishness above their supposed greater good. Similarly, it became hard to watch, let alone root for, shows that constantly put its core characters in life or death situations that it was obvious they would get out of due to contract statuses. It felt both emotionally manipulative and like low stakes, and the suspension of disbelief could not be sustained. — Danielle Turchiano\n\n“Big Mouth” (Netflix)\n\nTo put it simply, “Big Mouth,” which follows a group of seventh graders as they undergo the wonders of puberty, is an uncomfortable and cringe-worthy show whose juvenile humor is entirely comprised of sex jokes and disgusting visual gags. For a show packed with comedic talent, it’s hard to believe that penis jokes wet dreams are the best that the likes of Nick Kroll, John Mulaney, Jordan Peele, and Maya Rudolph have to offer. While it could be argued that the show’s awkwardness and dirty humor mirror the experiences of the characters and teens going through that stage of life, prepubescent tweens are obviously not the target audience and edginess for edginess sake is never a good thing. — Matt Fernandez\n\n“Homeland” (Showtime)\n\nIt’s not a popular opinion, but Quinn (Rupert Friend) should have died in Season 5. Instead, the show left him lingering in the hospital, only to have Carrie (Claire Danes) pull his pulse monitor off of his slack body in the hospital bed in the finale. Season 6 picked up a few months later — and Quinn was still very much alive, although impaired due to complications from a stroke. It felt like the show was just reluctant to lose an actor they so loved, and it also felt like a repeat of earlier season fake-outs regarding Brody’s (Damian Lewis) own alive or deceased status. Too much of the same-ole-same-ole made this long-in-the-tooth-drama a victim to the era of Peak TV. — Danielle Turchiano\n\n“New Girl” (Fox)\n\n\n\nThere was no particular reason why, but after Cece and Schmidt got together, I just lost interest in the show. It seemed to just meander on without a purpose. The lines weren’t that funny, nothing seemed to happen. Every week, the DVR’ed show would pile up and seemed to look at me accusingly. I knew there were five shows or more waiting for me, but they seemed to be a chore, like laundry that hasn’t been put away. I finally deleted the series from my DVR. — Shalini Dore\n\n“Ray Donovan” (Showtime)\n\nDear Ray: It’s not you, it’s me. I knew what I was getting into when I entered this relationship — that there was a limit to what you could give me emotionally. And though you did awful things, I always found it in my heart to forgive you. But I admit it: I started cheating on you. Other men came into my life with a bit less baggage, and given the choice between an antihero and a hero with heart, the good guys won. I know my timing wasn’t great — I heard this season was rough for you (my condolences about Abby) — but just like you, I never meant to be truly cruel. — Debra Birnbaum\n\n“Modern Family” (ABC)\n\nTo the Dunphy, Pritchett-Delgado, Pritchett-Tucker families — don’t take it personal. The ABC family comedy at its best still delivers a deft mix of big funny and authentically poignant moments. But the situations, the hijinks, the what-goofy-thing-will-the-kids-do-next set-ups have grown predictable and retread. I stopped keeping up on a weekly basis about halfway through Season 8, and haven’t checked in at all yet for Season 9. Like all messy family relationships, I’m sure we’ll patch things up one of these days. — Cynthia Littleton\n\n“Riverdale” (The CW)\n\n\n\n“Riverdale’s” first season was a great example of bad TV you loved to watch. It had a cheesy murder mystery, steamy teacher-student relationships, and enough melodrama — from the kids and adults of of the town alike — to weaponize. Unfortunately, the second season seems to have thrown out everything that made the show a quintessential guilty pleasure. In it’s place is an increasing dark and brooding series with dialogue (which was admittedly never great) that is borderline impossible to sit through in some scenes. That and having the students of Riverdale form a group to hunt down the Black Hood is a bizarre move. Not every show in your lineup has to be a vigilante origin story, CW. — Jacob Bryant\n\n“The Deuce” (HBO)\n\n\n\nThe prospect of another series from David Simon, creator of what many critics consider the greatest TV show of all time with “The Wire,” had many salivating long before “Deuce” began on HBO. And it’s certainly not a bad show; many of the individual performances are actually quite good. But as painstaking recreated as 1970s-era Manhattan is in all its seedy exoticism, no amount of production value can make up for the fact that the stories move way too sluggishly in those opening episodes. The milieu of pimps and porn stars also feels thoroughly picked over by pop-culture predecessors from “Taxi Driver” to “Boogie Nights.” The creative risk of having James Franco play twins doesn’t work at all. Simon brings the same eye for the complexities of society’s underclass that he always delivers. But “Deuce” just isn’t great, and it suffers greatly in the shadow of “Wire” regardless of whether that comparison is fair or not. — Andrew Wallenstein\n\n“Ozark” (Netflix)\n\nAn actor as accomplished as Jason Bateman deserves to try his hand at drama, and it’s great that Netflix gave him the chance. But while the actor is more than up to the task, the script does him a disservice; the Ozarks just doesn’t make up for a particularly interesting setting for an entire series. Plus Laura Linney is thoroughly wasted in a role that in its first season doesn’t feel multi-dimensional enough for someone of her caliber to inhabit. As for Bateman, his comedy acumen is so strong that it catches up to him; there’s so many times where you want him to just wisecrack his way through scenes the way we’ve known him do so ably over the course of his career. “Ozark” should have better matched the man with the material to allow him to show off what he does best. — Andrew Wallenstein\n\n“Friends From College” (Netflix)\n\n\n\n“Party Bus” was the straw that broke the camel’s back. It happened mid-way through the fifth episode of the eight-ep series. And you know there’s no turning back when the show stops appearing on your Netflix “continue watching” queue. As much as I wanted to love “Friends From College” — considering that it was created and directed by Nicholas Stoller (“Forgetting Sarah Marshall”) and Francesca Delbanco, and stars Keegan-Michael Key, Cobie Smulders, Nat Faxon, and Billy Eichner — I just couldn’t bear it. I went from hate-watching the comedy to hating watching it. It’s not the fact that the characters are so desperately flawed (I stuck by Don Draper, Walter White, and Frank Underwood) that’s infuriating, but that we don’t know why they’re dysfunctional. The characters have no depth, leading to a shallow comedy that just isn’t funny — plain and simple. The jokes fall flat, even when delivered by Key, and the pointless plot wears thin in no time. — Maane Khatchatourian", "images": ["https://pmcvariety.files.wordpress.com/2017/09/house.jpg?w=1000&h=563", "https://pmcvariety.files.wordpress.com/2017/04/homeland_612_3226-r.jpg?w=1024&h=768", "https://pmcvariety.files.wordpress.com/2017/08/modern-family.jpg?w=1000&h=667", "https://pmcvariety.files.wordpress.com/2017/01/variety-shows-we-quit-in-2017.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2017/12/walking-dead2.jpg?w=1000&h=563", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fshows-we-quit-2017-walking-dead-homeland-riverdale-1202645055%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202645055&comment_count=31", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2017/12/laura-linney-ozark.jpg?w=1000&h=562", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/01/variety-shows-we-quit-in-2017.jpg?w=1000", "keywords": [], "authors": ["Variety Staff"], "canonical_link": "https://variety.com/2017/tv/news/shows-we-quit-2017-walking-dead-homeland-riverdale-1202645055/", "title": "TV Shows We Quit in 2017", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Variety staffers reveal which TV shows they quit -- new or old -- in 2017.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202645055, "author": "Variety Staff", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-12-21T08:00:54"}, "pmc-tag": "Best of 2017", "title": "TV Shows We Quit in 2017", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "TV Shows We Quit in 2017", "url": "https://variety.com/2017/tv/news/shows-we-quit-2017-walking-dead-homeland-riverdale-1202645055/", "description": "In general, it’s advisable to finish what you start — but if what you started was a show that eventually felt more like an obligation than entertainment, who has the time to stick with …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/01/variety-shows-we-quit-in-2017.jpg?w=1000", "width": 1000, "height": 562, "alt": "Variety Shows we Quit in 2017"}, "locale": "en_US"}, "article": {"published_time": "2017-12-21T16:00:54+00:00", "modified_time": "2017-12-28T13:28:54+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "TV Shows We Quit in 2017"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/01/variety-shows-we-quit-in-2017.jpg?w=1000", "alt": "Variety Shows we Quit in 2017"}, "card": "summary_large_image", "title": "TV Shows We Quit in 2017", "description": "Variety staffers reveal which TV shows they quit -- new or old -- in 2017."}, "author": "Variety Staff", "content_type": "Article", "post_id": 1202645055, "title": "TV Shows We Quit in 2017", "published_at": "2017-12-21 08:00:54", "image": "https://pmcvariety.files.wordpress.com/2017/01/variety-shows-we-quit-in-2017.jpg?w=1000", "comment_count": 31, "tags": "Best of 2017", "topics": "News", "appeared_in_print": "No", "body": "In general, it's advisable to finish what you start -- but if what you started was a show that eventually felt more like an obligation than entertainment, who has the time to stick with it?\r\n\r\nAnd in the era of Peak TV, sometimes we have to sacrifice series in place of others. Maybe they were once beloved and just dragged on too long; maybe they were new shows that just didn't stick; or maybe, life just got busy. Variety's own staff had to leave a few series behind, whether they were finally giving up on Rick Grimes and co. on \"The Walking Dead\" or saying goodbye to \"Friends From College\" in its first season. Here are their show-quitting confessions.\r\n\r\n\r\n\r\n\"House of Cards\" (Netflix)\r\n\r\nKnowing what we know now, my decision to break up with the political potboiler seems prescient. But I tuned out long before the Kevin Spacey revelations — when its fifth season premiered — and though the prospect of watching Robin Wright take center stage is certainly tempting, I've already moved on. Blame it on the headlines. Blame it on the constant churn of the news cycle. But this political junkie gets enough of a fix from reality. -- Debra Birnbaum\r\n\r\nMaybe \"House of Cards,\" like your typical presidential term, should have ended after four years. Even before the Kevin Spacey allegations dropped, the Frank Underwood shtick was starting to feel old. As the show killed off more characters -- and tainted the rest -- who was left to root for? Robin Wright's electric charisma could only keep me hanging on for so long. But who am I kidding? As producers mull killing off Frank Underwood in its sixth and final season, the promise of Claire Underwood leading a (kind of) grieving nation may just yet pull me back in. -- Alex Stedman\r\n\r\n\"Game of Thrones\" (HBO)\r\n\r\nEndings are tough, and with a sprawling cast and a story spread out over several different mythical worlds, \"Game of Thrones\" faces a unique challenge. Still, after deliberately and painstakingly laying out its warring Iron Throne aspirants over six seasons, the HBO show's creators are rushing to wrap things up with dizzying speed. That's led to some serious plot holes and pacing problems, as \"Game of Thrones\" has dispatched key characters to tie up loose ends across the Seven Kingdoms, often ignoring pesky issues of geography and travel time. For me, the show officially jumped the white walker when Jon Snow was sent to the other side of the Wall to capture a \"live\" wight in order to convince Cersei to join forces with hated enemy Daenerys to stave off the existential threat posed by armies of the undead. That scheme is ludicrous because Cersei has shown no taste for empirical evidence in the proceeding seasons and because a journey that would have consumed a 12-episode arc in previous years transpires over the course of a half hour. As loyal viewers know, the whole adventure ends with a late-in-the-game dragon rescue and me deciding to pack it in without finding out who will rule Westeros. -- Brent Lang\r\n\r\n\"Santa Clarita Diet\" (Netflix)\r\n\r\nHaving grown up in the Santa Clarita Valley, it was always fun to point out locations in shows or movies that I recognized around town. Santa Clarita is so often used to represent other locations, and it’s ironic that when a show is finally set in SCV, the town is almost unrecognizable. If you’re using real businesses, why make up locations? And if you’re going to make up locations why set the show in a real town rather than a fictional one? Much of the show’s humor is dead on arrival, based on inside jokes about SCV life that non-residents probably won’t fully grasp, recycled gags, or repetitive references to Drew Barrymore’s character’s undead vagina. While the show’s premise had promise and its social critique of suburban life is often spot-on, clunky writing and lifeless performances from Barrymore and Timothy Olyphant kill any momentum before it even takes off. -- Matt Fernandez\r\n\r\n\r\n\r\n\"The Walking Dead\" (AMC)\r\n\r\nWhen Glenn's brains hit the pavement, so did my heart. To be fair, even after that traumatic Season 6 premiere that bordered on torture porn, I stuck through it for 2016, dredging through every demoralizing episode. And it did get better -- though it was painful to watch us lose Sasha as Sonequa Martin-Green moved on to \"Star Trek: Discovery,\" I cheered as Shiva mauled one of Negan's soldiers and Maggie led Hilltop in triumphant fashion in the finale. I thought that would be enough to reel me back in, since I was already hanging by a thread, but Season 7's slow start finally made me lose interest. It's not like I meant to break it off with \"The Walking Dead.\" In fact, I fully intended to return to those episodes piling up on my DVR like wasted zombie bodies! But after I heard about a certain character's death in the Season 7 midseason finale, I'm not sure it's stress I want to put back on myself. -- Alex Stedman\r\n\r\nDC on the CW (\"Arrow,\" \"The Flash,\" \"DC's Legends of Tomorrow,\" \"Supergirl\")\r\n\r\nAnti-hero series were quite the trend a few years ago, but these four series, each with varying degrees of roots in DC comic book characters, were designed to have the central figures be the heroes of the stories. However, all-too-often the heroes were the ones causing catastrophic complications — from Barry Allen (Grant Gustin) becoming Savitar to the Legends literally breaking time. While initially interesting as origin story missteps, as time (and seasons) went on, it became harder and harder to root for characters that kept putting selfishness above their supposed greater good. Similarly, it became hard to watch, let alone root for, shows that constantly put its core characters in life or death situations that it was obvious they would get out of due to contract statuses. It felt both emotionally manipulative and like low stakes, and the suspension of disbelief could not be sustained. -- Danielle Turchiano\r\n\r\n\"Big Mouth\" (Netflix)\r\n\r\nTo put it simply, \"Big Mouth,\" which follows a group of seventh graders as they undergo the wonders of puberty, is an uncomfortable and cringe-worthy show whose juvenile humor is entirely comprised of sex jokes and disgusting visual gags. For a show packed with comedic talent, it’s hard to believe that penis jokes wet dreams are the best that the likes of Nick Kroll, John Mulaney, Jordan Peele, and Maya Rudolph have to offer. While it could be argued that the show’s awkwardness and dirty humor mirror the experiences of the characters and teens going through that stage of life, prepubescent tweens are obviously not the target audience and edginess for edginess sake is never a good thing. -- Matt Fernandez\r\n\r\n\r\n\r\n\"Homeland\" (Showtime)\r\n\r\nIt's not a popular opinion, but Quinn (Rupert Friend) should have died in Season 5. Instead, the show left him lingering in the hospital, only to have Carrie (Claire Danes) pull his pulse monitor off of his slack body in the hospital bed in the finale. Season 6 picked up a few months later — and Quinn was still very much alive, although impaired due to complications from a stroke. It felt like the show was just reluctant to lose an actor they so loved, and it also felt like a repeat of earlier season fake-outs regarding Brody's (Damian Lewis) own alive or deceased status. Too much of the same-ole-same-ole made this long-in-the-tooth-drama a victim to the era of Peak TV. -- Danielle Turchiano\r\n\r\n\"New Girl\" (Fox)\r\n\r\nThere was no particular reason why, but after Cece and Schmidt got together, I just lost interest in the show. It seemed to just meander on without a purpose. The lines weren't that funny, nothing seemed to happen. Every week, the DVR'ed show would pile up and seemed to look at me accusingly. I knew there were five shows or more waiting for me, but they seemed to be a chore, like laundry that hasn't been put away. I finally deleted the series from my DVR. -- Shalini Dore\r\n\r\n\"Ray Donovan\" (Showtime)\r\n\r\nDear Ray: It's not you, it's me. I knew what I was getting into when I entered this relationship — that there was a limit to what you could give me emotionally. And though you did awful things, I always found it in my heart to forgive you. But I admit it: I started cheating on you. Other men came into my life with a bit less baggage, and given the choice between an antihero and a hero with heart, the good guys won. I know my timing wasn't great — I heard this season was rough for you (my condolences about Abby) — but just like you, I never meant to be truly cruel. -- Debra Birnbaum\r\n\r\n\r\n\r\n\"Modern Family\" (ABC)\r\n\r\nTo the Dunphy, Pritchett-Delgado, Pritchett-Tucker families -- don’t take it personal. The ABC family comedy at its best still delivers a deft mix of big funny and authentically poignant moments. But the situations, the hijinks, the what-goofy-thing-will-the-kids-do-next set-ups have grown predictable and retread. I stopped keeping up on a weekly basis about halfway through Season 8, and haven’t checked in at all yet for Season 9. Like all messy family relationships, I’m sure we’ll patch things up one of these days. -- Cynthia Littleton\r\n\r\n\"Riverdale\" (The CW)\r\n\r\n\"Riverdale's\" first season was a great example of bad TV you loved to watch. It had a cheesy murder mystery, steamy teacher-student relationships, and enough melodrama -- from the kids and adults of of the town alike -- to weaponize. Unfortunately, the second season seems to have thrown out everything that made the show a quintessential guilty pleasure. In it's place is an increasing dark and brooding series with dialogue (which was admittedly never great) that is borderline impossible to sit through in some scenes. That and having the students of Riverdale form a group to hunt down the Black Hood is a bizarre move. Not every show in your lineup has to be a vigilante origin story, CW. -- Jacob Bryant\r\n\r\n\"The Deuce\" (HBO)\r\n\r\nThe prospect of another series from David Simon, creator of what many critics consider the greatest TV show of all time with \"The Wire,\" had many salivating long before \"Deuce\" began on HBO. And it's certainly not a bad show; many of the individual performances are actually quite good. But as painstaking recreated as 1970s-era Manhattan is in all its seedy exoticism, no amount of production value can make up for the fact that the stories move way too sluggishly in those opening episodes. The milieu of pimps and porn stars also feels thoroughly picked over by pop-culture predecessors from \"Taxi Driver\" to \"Boogie Nights.\" The creative risk of having James Franco play twins doesn't work at all. Simon brings the same eye for the complexities of society's underclass that he always delivers. But \"Deuce\" just isn't great, and it suffers greatly in the shadow of \"Wire\" regardless of whether that comparison is fair or not. -- Andrew Wallenstein\r\n\r\n\r\n\r\n\"Ozark\" (Netflix)\r\n\r\nAn actor as accomplished as Jason Bateman deserves to try his hand at drama, and it's great that Netflix gave him the chance. But while the actor is more than up to the task, the script does him a disservice; the Ozarks just doesn't make up for a particularly interesting setting for an entire series. Plus Laura Linney is thoroughly wasted in a role that in its first season doesn't feel multi-dimensional enough for someone of her caliber to inhabit. As for Bateman, his comedy acumen is so strong that it catches up to him; there's so many times where you want him to just wisecrack his way through scenes the way we've known him do so ably over the course of his career. \"Ozark\" should have better matched the man with the material to allow him to show off what he does best. -- Andrew Wallenstein\r\n\r\n\"Friends From College\" (Netflix)\r\n\r\n\"Party Bus\" was the straw that broke the camel's back. It happened mid-way through the fifth episode of the eight-ep series. And you know there's no turning back when the show stops appearing on your Netflix \"continue watching\" queue. As much as I wanted to love \"Friends From College\" -- considering that it was created and directed by Nicholas Stoller (\"Forgetting Sarah Marshall\") and Francesca Delbanco, and stars Keegan-Michael Key, Cobie Smulders, Nat Faxon, and Billy Eichner -- I just couldn't bear it. I went from hate-watching the comedy to hating watching it. It's not the fact that the characters are so desperately flawed (I stuck by Don Draper, Walter White, and Frank Underwood) that's infuriating, but that we don't know why they're dysfunctional. The characters have no depth, leading to a shallow comedy that just isn't funny -- plain and simple. The jokes fall flat, even when delivered by Key, and the pointless plot wears thin in no time. -- Maane Khatchatourian\r\n\r\n\r\n\r\nVariety's Best of 2017\r\n\r\n\r\nREAD MORE", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1513872054.0, "source": "https://variety.com", "summary": ""}