{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/28/grammy-awards-2018-ranking-the-live-performances-from-best-to-worst/", "text": "Among some of the show’s more serious moments (which we didn’t rank), country artists Brothers Osborne, Maren Morris and Eric Church dedicated an emotional performance of Eric Clapton’s “Tears in Heaven” to the victims of mass tragedies at recent concerts in Las Vegas and Manchester, England. Logic, Cara and Khalid performed “1-800-273-8255” to bring awareness to suicide prevention. And before going into the official “In Memoriam” segment of the show, Chris Stapleton and Emmylou Harris performed Tom Petty’s 1994 hit, “Wildflowers.” (Petty died in October at 66.)\n\nAD\n\nAD\n\nWe’ve ranked all the other performances, from best to worst.\n\n\n\n1. Kendrick Lamar\n\nKendrick Lamar did not come to play around. I mean, he sort of did. He brought along Dave Chappelle to interject his performances with gems of knowledge cloaked in humor. (“Hi, I’m Dave Chappelle. And I just wanted to remind the audience that the only thing more frightening than watching a black man being honest in America is being an honest black man in America.” He added, “Is this on cable? CBS? Because it looks like he’s singing and dancing, but this brother is taking enormous chances.”)\n\nThen there was the whole “This is a satire, by Kendrick Lamar” message that flashed behind the Compton rapper, which came after a rather unfortunate cameo from U2. But, upshot: Chappelle got more cameos than Bono and the Edge.\n\nAD\n\nAD\n\nKendrick opened with American flags and was surrounded by dozens of dudes in Army fatigues who ended up dancing their hearts out. Among the songs he performed was his mega-banger “DNA,” during which it’s metaphysically impossible to stay still. There was also a drummer with a giant drum that set off crazy pyrotechnics. (Ah, yes, fire, an old classic. Can’t go wrong.) Solid opener, and far, far preferable to a carpool karaoke bit.\n\n2. Kesha\n\nKesha did more than just perform “Praying.” She made a powerful declaration in a performance that was as moving as it appeared to be cleansing for the singer, who spent years in a legal battle with Sony Music producer Dr. Luke after sexual-abuse allegations.\n\nAD\n\nFlanked by an army of women — including Andra Day, Bebe Rexha, Camila Cabello, Cyndi Lauper, Julia Michaels and the Resistance Revival Chorus — Kesha sang her heart out, belting her lyrics with dripping, raw emotion. After she finished, shaking with sobs, the audience gave her a standing ovation. The Grammy telecast showed some audience members crying. She may have been on a stage in Madison Square Garden singing for thousands, but Kesha’s performance felt about as intimate as it gets.\n\nAD\n\n3. Bruno Mars and Cardi B\n\nThank heavens for these two and their resurrection of new jack swing. Bruno Mars and Cardi B, in head-to-toe Cross Colours attire, kept the “In Living Color” tribute strong while performing “Finesse.” Cardi B wore a giant medallion around her neck, and Bruno Mars did the running man as if it were “House Party” and “House Party 2.” As to be expected with Bruno Mars, this performance was incredibly well-produced with very, very good dancing. And Cardi B just being Cardi B is enough to lift the spirits of anyone with a beating heart.\n\n4. Childish Gambino\n\nHello, Sam Smith? I hope you are taking notes. This is how you rock a white suit while singing an R&B song. And also how you sing one live.\n\nDonald Glover, a.k.a. Childish Gambino, performed “Terrified” with an updated-for-2018 Teddy Pendergrass vibe. (Think: A sext, actualized.) Also, this man kept his hand in his pocket nearly THE ENTIRE TIME. At the end, he wailed like the best of ’em as he was joined by impressive young singer JD McCrary, Glover’s “The Lion King” castmate, to take it home.\n\n5. Luis Fonsi and Daddy Yankee\n\n“Despacito” might have been the song of the summer, but thanks to this performance, it’ll probably be stuck in our heads for the rest of winter, too. All together, everyone: Des *pause* pa *pause pause* cito.\n\nDaddy Yankee showed up with all the gold in the world around his neck, while Luis Fonsi opted for some wrinkly leather pants. The performance was underwhelming given the energy of the song, but we’re commending its lack of Justin Bieber. (Remember that “burrito” disaster?) It probably could’ve done without that backup dancer, too.\n\n6. SZA\n\nSZA sings the music of the edgy youth, a concept best captured by her outfit: a cutup cheerleader top. “Broken Clocks” was an unusual choice for the R&B artist to perform at the Grammys, given the immense popularity of hits “Love Galore” and “The Weekend,” but she sang the heck out of it in front of a “Matrix”-esque backdrop. This performance further convinced us that SZA was #snubbed for Best New Artist.\n\n7. Lady Gaga\n\nLady Gaga transformed her piano into a giant bird, complete with feathers — so really, one of her more understated awards show performances. (Or maybe they were angel wings?) Either way, she started things off with “Joanne,” the title track of her latest album and a ballad that honors her late aunt, who died of lupus in 1974 at age 19.\n\nAD\n\nAD\n\n“This is for my father’s late sister, Joanne,” she said. “This is for love and compassion, even when you can’t understand.”\n\nWhen she was done, she looked up and said “Time’s up,” a reference to the legal fund to help fight sexual harassment and inequality in the workplace. Then she segued flawlessly into another ballad, “Million Reasons,” ending it with a questionable high note.\n\nI’m not too proud to admit that I’ve always been a little scared of Lady GaGa, but after seeing what she did to this bird with this piano, I’m petrified. #Grammys pic.twitter.com/4bxjOWF8BP — John Dedman (@JohnDedman) January 29, 2018\n\nWas it a bird or an angel that died to make @ladygaga piano?! #Grammys2018 #Grammys — Michael Dorsey BL14 (@mldorsey78) January 29, 2018\n\n8. U2\n\nWhen Camila Cabello appeared on stage and told the audience how proud she is to be a Cuban Mexican immigrant, nobody expected her to introduce U2 immediately after. In fact, the Irish rock band’s performance popped up out of the blue just as its album “Songs of Innocence” did on everyone’s iTunes libraries back in 2014.\n\nU2 sang “Get Out of Your Own Way” on an outdoor stage, standing in front of a screen flashing pairs of eyes a la “Orange Is the New Black.” Bono yelled into an American-flag-printed megaphone on a platform situated in front of the Statue of Liberty. Points for vocals, but we might subtract a few for the painfully political image.\n\n9. Jon Batiste and Gary Clark Jr. (Chuck Berry and Fats Domino tribute)\n\nTribute performances can be tricky undertakings, but John Batiste and Gary Clark Jr. did a fine job paying homage to Chuck Berry and Fats Domino — and in doing so, reminded all the nominated young ‘uns about the roots of American popular music.\n\nBatiste impressively tickled those ivories, and the two rocked out in proper fashion while playing “Maybellene.” Well done, gentlemen.\n\n10. DJ Khaled, Rihanna and Bryson Tiller\n\nEven Her Royal Highness Robyn Rihanna Fenty’s presence wasn’t enough to save this performance from being a bit of a disaster. Rihanna work, work, work, work, worked while DJ Khaled yelled a bunch of nonsense, ranging from “Sing it!” (duh, she is) to “This the Grammys!” (duh, we know). He bumped this performance down a notch each time he decided to open his mouth. Bryson Tiller showed up for a hot second, too, but he was hidden by a bunch of finger-wave-sporting backup dancers who looked as though a police raid had forced them out of the speakeasy.\n\n11. Little Big Town\n\nDressed as always in coordinated outfits (but with a bit more sparkle this time), country music’s most harmonious quartet delivered a pleasingly solid performance of “Better Man.” Upon release in 2016, the song’s writer was kept a closely guarded secret until they revealed that it was none other than TAYLOR SWIFT, who wrote the song by herself but felt that it might fit the group’s sound. (Indeed, the lyrics have Taylor written all over them, including a reference to being wide-awake at 4 a.m. thinking about a lost love.) Vocalist Karen Fairchild took the lead on this ballad about a toxic relationship, which already won best country group/duo vocal in the Grammys pre-telecast.\n\n12. Elton John and Miley Cyrus\n\nElton John is notable for his ability to command the stage from the seat of a piano. In a characteristically sparkly jacket with “Elton” emblazoned on the back, he sang along to “Tiny Dancer” with Miley Cyrus, who is clearly working very, very hard to create her image as a Serious Performer. Whatever Elton gave us, Cyrus took away, as she dragged the performance down with some off-key notes spattered throughout.\n\n13. Pink\n\nYou may remember Pink swinging from a trapeze at a previous Grammys show — here she is in grocery-shopping clothes! And just standing behind a microphone and not scaling a building, as she did at the American Music Awards. Granted, this was one of her more serious songs; “Wild Hearts Can’t Be Broken” was originally written for a movie about the suffragette movement. At the end, the camera panned to her young daughter for a certifiably Adorable Grammy Moment™.\n\n14. Ben Platt and Patti LuPone\n\nRemember when that a cappella group in “Pitch Perfect” wouldn’t let Ben Platt perform? Normally, that would have seemed like a remarkably silly move. Platt has the voice of a young angel. But his rendition tonight of “Somewhere” from “West Side Story” can best be described as textbook, in that it was technically perfect but kind of boring. It instead got us thinking about whom we’d cast in Steven Spielberg’s upcoming adaptation of the musical. Get James Corden as far away from that as possible.\n\nSpeaking of Tonys, Broadway legend Patti Lupone’s performance of “Don’t Cry for Me Argentina” went on and on and on. Was it great? Sure. Was it right for the Grammys? Probably not. But LuPone can do whatever she wants, and the audience will listen intently.\n\n15. Sting and Shaggy\n\nThe Grammys are very pleased with themselves that they transported the show from Los Angeles all the way to New York, so to celebrate, they brought Sting out for a perfectly passable but dull rendition of “Englishman in New York.” Then Shaggy arrived to increase the weirdness factor because these two recently collaborated on an album together. Your guess is as good as ours.\n\n16. Sam Smith\n\nDressed in an outfit best described as Boyz II Men meets pajama chic, Sam Smith stood still on stage and reminded us all that we should’ve gone to church this morning. Seriously, this performance was full of finger wagging and disappointed head nods that would put a grandmother to shame. But who is Smith to tell us what to do if he didn’t even make sure the choir was lit properly?\n\nAD\n\nAD\n\nWhich black choir has Sam Smith kidnapped now — Shakira (@jodecicry) January 29, 2018", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/5bd13033-50c2-4ef3-a231-2f9d3ef43dcc.png&w=90&h=90", "https://www.washingtonpost.com/resizer/Eu3iYH4AAOOaEif1q6vaFGCHM_g=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NS75RJNZFQYXPM6TN6FDEQFEQ4.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9624aab6-2742-4553-9ae0-96a331f3e138.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/Eu3iYH4AAOOaEif1q6vaFGCHM_g=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NS75RJNZFQYXPM6TN6FDEQFEQ4.jpg", "keywords": [], "authors": ["Elahe Izadi", "Pop Culture Writer", "Emily Yahr", "Style Reporter Covering Pop Culture", "Sonia Rao", "Pop Culture Reporter"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/28/grammy-awards-2018-ranking-the-live-performances-from-best-to-worst/", "title": "Grammy Awards 2018: Ranking the performances from best to worst", "meta_data": {"description": "From Kendrick Lamar to Bruno Mars, we picked who did the best at the 60th annual awards.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/28/grammy-awards-2018-ranking-the-live-performances-from-best-to-worst/", "image": "https://www.washingtonpost.com/resizer/Eu3iYH4AAOOaEif1q6vaFGCHM_g=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NS75RJNZFQYXPM6TN6FDEQFEQ4.jpg", "title": "Analysis | The 2018 Grammy performances ranked, from best to worst", "description": "From Kendrick Lamar to Bruno Mars, we picked who did the best at the 60th annual awards."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | The 2018 Grammy performances ranked, from best to worst", "description": "From Kendrick Lamar to Bruno Mars, we picked who did the best at the 60th annual awards."}, "last_updated_date": "2018-02-26T00:16:41.218Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1517068800.0, "source": "https://www.washingtonpost.com", "summary": ""}