{"url": "https://en.wikipedia.org/wiki/Lindsey_Morgan", "text": "Lindsey Marie Morgan (born February 27, 1990) is an American actress. She is best known for her role as mechanic Raven Reyes on The CW sci-fi drama series The 100.[1]\n\nEarly life [ edit ]\n\nLindsey Marie Morgan was born February 27, 1990, in Houston, Texas, to Kelly Morgan and Alice Burciaga. She is half Mexican and half Irish.[2] She has an older brother, a half-sister, and five step-siblings.[3]\n\nCareer [ edit ]\n\n2010–13: Career beginnings and General Hospital [ edit ]\n\nMorgan began her career in college at the University of Texas at Austin, then left for Los Angeles to chase her acting dream. Within her first year of college, Morgan stayed busy by continually booking commercials and print ads. She was cast as an extra on the critically acclaimed series Friday Night Lights. Morgan made the decision to move to Los Angeles to continue her work as an actress. Her first real role was in the movie Detention (2011) starring Josh Hutcherson where she played a mean cheerleader named Alexis. In 2011, she landed the leading role in the MTV film DisCONNECTED (2011) as social media obsessed Maria. \"DISconnected\" was part of the MTV \"A Thin Line\" campaign. The film and the campaign were developed in order to empower young people to identify, respond to, and stop the spread of digital abuse in their lives.[citation needed]\n\nOn April 17, 2012, TVLine reported that Morgan had been cast as the contract role of Kristina Davis on the American ABC Daytime soap opera General Hospital and would make her debut on May 25, 2012.[4][5] For this role Morgan was nominated for Daytime Emmy Award for Outstanding Younger Actress in a Drama Series in 2013.[6] Of learning about her Emmy nomination, she said, \"I was worried that I'd gotten the call time wrong for my appearance on Franklin & Bash before I saw that it said \"Congratulations!, I'm stunned, I'm still so shocked. I'm so honored.[7] On March 26, 2013, it was announced that she would be departing her role as Kristina, last airing on March 4, 2013.[8]\n\nImmediately upon leaving General Hospital, Morgan filmed a web series called Destroy the Alpha Gammas, about which she told TV Source Magazine:\n\n\"I loved every second of it. I made some great friends and had a great blast doing it.\"[9]\n\nIn 2013, Morgan had a supporting role in the indie movie Chastity Bites (2013).[citation needed]\n\n2014–present: The 100 [ edit ]\n\nOn August 20, 2013, it was announced that Morgan landed a recurring role on CW sci-fi drama series The 100, which is now in its sixth season.[10] For season 2, Morgan was upgraded to series regular.[11]\n\nMorgan describes her character:\n\n\"Raven is a total badass. She is a guy AND girl who is brilliant because she's also a prodigy when it comes to mechanical engineering. She's the youngest mechanical engineer the space station has had in 52 years, and she loves getting dirty and down with it. She's feisty, she's sassy, she's strong; she's a really cool girl. She can definitely hold her own.\"[12]\n\nIn 2015, Morgan filmed her first leading film role starring as Ariana in the TV Movie Casa Vita alongside ABC Family's Baby Daddy star Jean-Luc Bilodeau. Ariana is a Mexican-American cook dreaming of opening her own fusion cuisine restaurant much to her father's dismay. Ariana works at her father's restaurant, Casa Vita, where she meets Early Lindstrom.[13]\n\nOn April 18, 2016, Morgan landed a lead role in the independent thriller Lasso, alongside Andrew Jacobs, Sean Patrick Flanery. Morgan's character holds a huge amount of guilt for not keeping the senior citizens safe and takes on the duty of ensuring their safety throughout the film.[14]\n\nFilmography [ edit ]\n\nFilm roles Year Title Role Notes 2011 Detention Alexis Spencer 2011 DisCONNECTED Maria 2013 Chastity Bites Noemi 2014 ETXR Florence 2017 Beyond Skyline Cpt. Rose 2018 Lasso Kit 2018 Summertime Debbie Espinoza 2019 Inside Game Stephanie\n\nMusic video roles Year Title Artist 2011 Boyfriend Big Time Rush\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Lindsey_Morgan_by_Gage_Skidmore_2.jpg/1200px-Lindsey_Morgan_by_Gage_Skidmore_2.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Lindsey_Morgan%2C_Alma_Awards_2012_Red_Carpet_Arrivals.jpg/172px-Lindsey_Morgan%2C_Alma_Awards_2012_Red_Carpet_Arrivals.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Lindsey_Morgan_by_Gage_Skidmore_2.jpg/220px-Lindsey_Morgan_by_Gage_Skidmore_2.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Lindsey_Morgan_by_Gage_Skidmore_2.jpg/1200px-Lindsey_Morgan_by_Gage_Skidmore_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lindsey_Morgan", "title": "Lindsey Morgan", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Lindsey_Morgan_by_Gage_Skidmore_2.jpg/1200px-Lindsey_Morgan_by_Gage_Skidmore_2.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}