{"url": "www.thehollywoodgossip.com/2017/09/katie-holmes-pregnant-with-jamie-foxxs-baby/", "text": "After several months of the couple trying and failing to keep their relationship on the down-low, we now know that Katie Holmes and Jamie Foxx are dating.\n\nWe still don't know exactly how long the actors have been together, but it seems they're moving very quickly.\n\nDespite the fact that Foxx doesn't even tell his friends about Holmes (The man is seriously committed to maintaining his privacy.), sources say the relationship is already very serious.\n\nIn fact, sources are now claiming that there's a very good reason Holmes and Foxx decided to finally go public with their relationship last week.\n\nAccording to Australian tabloid NW, Holmes and Foxx are expecting a child together.\n\nInsiders tell the magazine that the pregnancy was planned, and Katie is roughly three months along.\n\n\"Katie had always wanted to have another baby and knew her biological clock was ticking - and, at long last, it's happening!\" says one source.\n\nNoting that Holmes described the pregnancy as \"perfect timing,\" the insider adds:\n\n\"Katie's always wanted a sibling for Suri and now she'll have a little sister.\"\n\nWe'll hold off on offering out congratulations until the news comes from a source that's slightly more credible than a random Australian tabloid.\n\nThat said, we wouldn't be surprised if it turns out there's some truth to these reports.\n\nAfter all, Katie and Jamie are both devoted parents, and sources close to the couple have confirmed their relationship is very serious.\n\nPlus, after the experience of having a child with Tom Cruise, we imagine Katie would like to find out what child-rearing is like when you're not under 24-hour surveillance from a cabal of cult leaders.\n\nJust kidding, Scientologists! Please don't sue us!\n\nAnyway, sources say that in the years after her split from Cruise, Katie pretty much holed up and devoted herself thoroughly to being a mom.\n\nThese days, she's loosening up a bit, and her loved ones credit Foxx with teaching her how to relax and have fun.\n\n“She was a homebody,” says one insider.\n\n“It’s great to see her out and having fun, and I bet Jamie has played a big part in that.”\n\nHopefully, the knowledge that everyone will now be scrutinizing her midsection in search of a baby bump won't stop Katie from continuing to go out and enjoy herself.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--JjhPEgXR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1505500765/jamie-foxx-katie-holmes-split.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--JjhPEgXR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1505500765/jamie-foxx-katie-holmes-split.png", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/09/katie-holmes-pregnant-with-jamie-foxxs-baby/", "title": "Katie Holmes: PREGNANT With Jamie Foxx's Baby?!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/09/katie-holmes-pregnant-with-jamie-foxxs-baby/", "title": "Katie Holmes: PREGNANT With Jamie Foxx's Baby?!", "description": "Katie Holmes is reportedly pregnant! Sources say the actress is expecting a child by boyfriend Jamie Foxx.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XgxsTCY1--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1483470583/lauren-conrad-and-william-tell-are-cute.jpg", "type": "image/jpeg", "width": 378, "height": 594}}, "article": {"published_time": "2017-09-15T13:22:58-04:00", "modified_time": "2017-09-15T14:41:57-04:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Katie Holmes: PREGNANT With Jamie Foxx's Baby?!", "description": "Katie Holmes is reportedly pregnant! Sources say the actress is expecting a child by boyfriend Jamie Foxx.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--JjhPEgXR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1505500765/jamie-foxx-katie-holmes-split.png"}}, "description": "Katie Holmes is reportedly pregnant! Sources say the actress is expecting a child by boyfriend Jamie Foxx."}, "movies": [], "publish_date": 1505496178.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}