{"url": "www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/angelina-jolie-exposes-her-rebelturnedsaint-myth-by-trashing-brad-pitt/news-story/0e0c5c115f8ea7ff8907d58d79dfa677", "text": "OPINION\n\nPOSSIBLY the only thing more surprising than the news that Angelina Jolie filed for divorce from Brad Pitt were the unceasing, unremitting details.\n\nAs a brand, Brangelina spent more than a decade on lockdown: Their camp had no leaks. Tabloids knew nothing the couple didn’t want known. Their image as the chic-est, jet-setting-est, most racially harmonious family on Earth was impenetrable.\n\nUntil Tuesday, when Jolie’s filing demanding sole physical custody sent the media into overdrive: What had Pitt, heretofore known as a devoted father, possibly done?\n\nIncredibly, almost on the hour, the story kept advancing: TMZ reported that Jolie had concerns “with the way Brad was parenting” and that she was “fed up” with his heavy use of weed and alcohol. He had an “anger problem.”\n\nNext came accusations of Pitt cheating — with a co-star and with Russian hookers, their nationality an odd detail — of using hard drugs, and of verbally and physically attacking one of their children on a private plane.\n\nWithin 72 hours, the world knew more about Brangelina than in the 12 years they had been together. It was sordid and dirty, the photo negative of the perfect ­image they had so smugly, aggressively promoted.\n\nThe likeliest source of that narrative flip? Angelina Jolie, who at 41 has masterfully manipulated the media for over two decades.\n\nStrategically, Jolie seems miles ahead of Pitt, but she may lose the long game. Video reportedly exists of the plane incident, and no physical altercation is said to have occurred. People have come to ­admire her, but they love him.\n\n“The whole thing seems very impetuous,” says Jolie’s biographer, Andrew Morton. “Her mother would freeze out people for whatever reason, and now Angie has frozen out Brad — who was far more dignified and just issued a quiet statement.”\n\nBy so publicly disparaging the father of her children — some old enough to read what’s being said online — Jolie is endangering her own self-created myth, that of ­depraved Hollywood hellion-turned-St. Angelina, humanitarian nonpareil.\n\n“It’s Bad Dad vs. St. Ange,” Morton says. “The ultimate losers are the children.”\n\nAnd Jolie’s halo, which may be revoked.\n\nIt’s easy to forget how deeply weird Angelina Jolie was when she came on the scene in the mid-’90s. There’s an entire generation that knows her as an actress, yes, but more so as the selfless philanthropist, the devoted mother of six, one-half of the most glamorous couple in Hollywood.\n\nJolie has never used a publicist, and this has only added to the sense — true or not — that she’s authentic. But she is, at heart, an actress. Jolie and her estranged father, actor Jon Voight, share one key trait: Both, she’s said, are “drama queens.”\n\nAs a premillennial starlet, Jolie was unlike any of her peers. She was in stark opposition to the arch, cosmopolitan WASP-iness of Gwyneth Paltrow, who was then engaged to Pitt. She made Winona Ryder’s eccentric darkness seem purely adolescent. Drew Barrymore, with her trauma, her drug use and mid-20s marriage spree, could not compare.\n\nJolie carved her own niche, controlled her own narrative, and it was impossible to look away. She was the wildest of the wild. She divulged thoughts and experiences so outlandish, you had to wonder how much was true.\n\nShe spoke of self-harm, rampant drug use — heroin, she said, her favourite — her bisexuality, how much she loved knife-play and S&M, her history of insomnia and eating disorders, of committing herself to the psych ward at UCLA for 72 hours, of suicidal ideations and of once hiring a hit man to kill her before changing her mind. All this by age 22.\n\nIn 1996, she married British actor Jonny Lee Miller. She said she wed in a white shirt with Miller’s name scrawled in blood on the back.\n\nThey divorced in 2000, the same year Jolie began cavorting with her brother, James Haven, on red carpets, making out in front of photographers. When she won the Best Supporting Actress Oscar that year for Girl, Interrupted, she gushed over him in her acceptance speech.\n\n“I’m so in love with my brother right now,” she said.\n\nIt was too weird, even by Hollywood standards. Haven quickly receded from Jolie’s public life, and within weeks, she wed her Pushing Tin co-star Billy Bob Thornton, who was then engaged to actress Laura Dern.\n\n“I left our home to work on a movie,” Dern told Talk magazine in 2000, “and while I was away, my boyfriend got married, and I’ve never heard from him again.”\n\nJolie and Thornton — then 24 and 44, respectively — embraced their role as Hollywood’s premier freak-show couple. They wore ­vials of each other’s blood around their necks and boasted of wild sex on fur-lined harnesses.\n\nThe marriage lasted four years, until the moment Jolie said was life-changing: Her decision, while filming Lara Croft: Tomb Raider in Cambodia, to adopt a child.\n\n“I knew once I committed to Maddox,” she said, “I would never be self-destructive again.”\n\nJolie divorced Thornton. “She used the same M.O. as with Brad — accused him of having affairs and being drunk,” says Morton, her biographer. “As soon as Maddox came along, Billy Bob had served his purpose.”\n\nThus Jolie began her pivot from savage, man-stealing sex bomb to valiant single mom of an indigent child. She began working with the United Nations as a goodwill ambassador. Her time in Cambodia, she said, “made me suddenly realise certain things about the world and how much I had to learn.”\n\nShe was a spoiled Hollywood brat who orchestrated her public awakening to the less fortunate and duly expressed shame. As an actress, things were less exciting. She trudged along in a series of unremarkable movies: Original Sin, Life or Something Like It, Beyond Borders, Alexander.\n\nIt wasn’t until 2004, when she replaced Nicole Kidman in a film called Mr. & Mrs. Smith, that Angelina Jolie’s star power ­became stratospheric.\n\nThis, of course, was the movie where Pitt and Jolie met and fell in love. At the time, Pitt was married to Jennifer Aniston, and they were considered Hollywood’s golden couple: he the wholesome, Midwestern matinee idol, content with a bong and a beer, she the A-list star of Friends, the breezy, sort-of-plain popular girl who had landed the high-school quarterback.\n\nJolie, with or without Pitt’s knowledge, helped extricate him from that marriage expertly. In April 2005, amid rumours of their affair, Pitt flew to visit Jolie and her toddler son in Kenya. Paparazzi somehow knew to be there, and a now-iconic image of Jolie, Pitt and Maddox made the cover of US Weekly.\n\nAniston had said goodbye to Pitt hours earlier, with no knowledge of his plans. “The world was shocked, and I was shocked,” Aniston told Vanity Fair that year.\n\nRumours were rampant that Jolie was pregnant with Pitt’s baby — compounding the tabloid narrative that Pitt badly wanted to be a dad but, denied by his career-obsessed wife, had no choice but to leave.\n\n“My worst fear,” Aniston’s friend Kristin Hahn told Vanity Fair, “is that Jen will have to face them having a baby together soon, because that would be beyond painful.”\n\nIn July of that year, Jolie adopted a baby girl from Ethiopia, an event she announced in People magazine. She began heavily publicising her work as a UN ambassador. To paraphrase the old saying about Ginger Rogers and Fred Astaire: Jolie gave Pitt gravitas, and Pitt gave her respectability.\n\nIn May 2007, the couple relocated to Namibia, where a heavily pregnant Jolie was again shot by paparazzi, with Pitt and her two children, on otherwise empty sand dunes — this, even though the couple had gotten the Namibian government to ban all journalists from entry so she could give birth there.\n\nAfter their daughter Shiloh was born, Pitt and Jolie gave a press conference only to Namibian reporters. They sat on a dais with Namibia’s president, Sam Nujoma, formerly the country’s dictator, and began their spin off planet Earth.\n\nIn 2007, Jolie began forcing celebrity journalists to sign contracts before interviewing her. These forbade “any questions regarding her personal relationships,” even though her personal relationships were exactly what she was selling. In April of that year, People glowingly reported Jolie’s adoption of a 3-year-old boy from Vietnam.\n\nHis mother was still living, and Jolie changed his name from Pham Quang Sang to Pax. He spoke no English, but no matter — the magazine deified Jolie, shooting her in profile, holding her new toddler as they gazed off at the horizon. In less than two years, Jolie and Pitt had a family of four.\n\n“I know we seem crazy, just bringing them in one after the other,” Jolie told The New York Times in 2008, the year she gave birth to twins Knox and Vivienne.\n\n“But we do plan,” she said. “We make sure one is absorbed completely into the family before we add ­another.”\n\nSanding down their scandalous origin story further, Jolie founded the Maddox Jolie Pitt Foundation in 2006. Though the couple have always said they donate all the money they make from selling family photos to magazines, tax filings raise questions.\n\nIn 2008, the year they sold pictures of the twins to People for $US14 million, the foundation gave away a little over $6 million. The UN High Commission on Refugees got $US100,000; the Council on Foreign Relations — which extended membership to Jolie the year before — got $110,000, and Pitt’s own non-profit, Make It Right, got $1 million.\n\nThe year before, the MJP Foundation listed itself as a “consultant” to Make It Right, earning $US204,867 in fees. It also listed nearly $4 million in assets invested, with, among others, Goldman Sachs and Merrill Lynch. They donated just $1.4 million, with $333,000 going to the UNHCR, which finally, after nearly $1 million in total donations from MJP, named Jolie a special envoy in 2012.\n\nIn 2014, People paid $US2 million for the Jolie-Pitt wedding photos. But the magazine doesn’t appear on MJP Foundation filings. However, Asprey, the jewellery company that has commissioned designs from the couple, does.\n\nReps for Pitt and ­Jolie did not return requests for comment.\n\nAs adroit as she has been, Jolie has seemed to lose touch with how she’s actually perceived. Her pretension has become boundless: bragging to a UK radio program that her six kids speak seven languages, including sign language.\n\n“Vivienne really wanted to learn Arabic,” she said.\n\nVivienne is 8.\n\nJolie has been publicly on the verge of quitting acting since 2005, ready to sacrifice movie stardom for her kids — never a mention of the nannies — her charities, the world. In November, she begins a visiting professorship at the London School of Economics. She is reportedly seeking to move to England permanently to join the House of Lords, which requires UK citizenship, and remake herself yet again, this time as a politician.\n\n“I’ve never loved being in front of the camera,” she said in 2014.\n\nIt’s a transition sparked, most likely, by her failed attempts to become a serious writer-director. Each successive film — 2011’s In the Land of Blood and Honey, 2014’s Unbroken and last year’s disasterpiece, By the Sea, in which she and Pitt played a couple on the verge of divorce — has bombed exponentially.\n\nThe Sony hack revealed true ­industry opinion of Jolie. “Minimally talented spoiled brat,” wrote super-producer Scott Rudin to then-Sony chief Amy Pascal. “She’s a camp event and a celebrity and that’s all.”\n\nBy seeking to elevate herself by denigrating Pitt, Jolie’s hypocrisy has begun to show. Whatever went down on that plane, it most likely can’t be worse than having her children witness their father’s public humiliation at their mother’s hands — the ultimate irony for a woman who prides herself on motherhood above all.\n\nAs she told The New York Times in 2008, she was already worried about what her children might read about their lives. “There’s a lot we’re going to have to explain to them,” she said, “about how public their family is.”\n\nAdditional reporting by Isabel Vincent.\n\nThis story originally appeared in the NY Post and is republished here with permission.", "images": ["https://cdn.newsapi.com.au/image/v1/4b33b10ee0c049b600c53c92fc4492b0", "https://cdn.newsapi.com.au/image/v1/3cada8d1f198289453081cf6447a692a", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/spp-api/v1/template/?path=components.nav-primary&t_domain=news.com.au&t_product=newscomau", "https://cdn.newsapi.com.au/image/v1/6c41f2a19c57c9e1ee62065c666f4fa3", "https://cdn.newsapi.com.au/image/v1/ab6264370e8ec5c9437caedbd6742648", "https://cdn.newsapi.com.au/image/v1/8e3ecfb9c831bc764e40b97954873485", "https://cdn.newsapi.com.au/image/v1/cbfa1025f6f8de391e9f2fef9c5ba1a2", "https://cdn.newsapi.com.au/image/v1/b165ec991996faf89eb8a60bd5e0fe75", "https://cdn.newsapi.com.au/image/v1/98cfd47be1e0f29c1a7826248e13cd00", "https://cdn.newsapi.com.au/image/v1/9cc2fc74845e9fb6c10c8b5182811443", "https://content.api.news/v3/images/bin/46f06691d34fb524701e871327c9623c", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/chartbeat/live/toppages/v3/?esi=true&host=news.com.au&limit=5&section=entertainment&sort_by=internal&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/trending&td_heading=trending%2520in%2520entertainment&td_showcount=true&td_showimages=true&type=article", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/c4d631c1e54a359f14b393b702889ad6?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/39f913e15c4402fb392766e6c932d403?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/a898aa938552dd3dadaefb1f2777d72a?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/spp-api/v1/template/?articleGMT=10&path=components.footer-desktop&t_domain=news.com.au&t_product=newscomau", "https://cdn.newsapi.com.au/image/v1/37c528d4d89042e2c0dc15f101d6edb5", "https://cdn.newsapi.com.au/image/v1/1fc2539da2be8632113e7c5a29abb0b8", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/resource/networksales/exoduscampaigns/campaigns.json?esi=true&t_product=newscomau&t_template=s3/networksales-loader/index&td_channel=desktop&td_domain=news.com.au&td_pagetype=story&td_section=entertainment/celebrity-life/hook-ups-break-ups", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/spp-api/v1/template/?path=components.header-desktop&t_domain=news.com.au&t_product=newscomau", "https://cdn.newsapi.com.au/image/v1/1ceb680747e448c7c74fe49aa85cbb3d", "https://cdn.newsapi.com.au/image/v1/be701fd4abde38e56fa212398c084b56", "https://cdn.newsapi.com.au/image/v1/3e88beda9c8dface6cd84d08cbdc867a", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/17e7e428f6cde48e306a666c0fe86f98?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/f8f3c04086f03f4a06886c4f64b8680c?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://cdn.newsapi.com.au/image/v1/92fa5dc5a60c42a8d9fb87a0876940c9", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/news/content/v2?includeRelated=true&pageSize=8&query=(contentType:NEWS_STORY%2520AND%2520paidStatus:NON_PREMIUM%2520AND%2520domains:news.com.au%2520AND%2520categories.value:%2522%252Fdisplay%252Fnewscorpaustralia.com%252FWeb%252FNewsNetwork%252FEntertainment%2520-%2520syndicated%252FLife%252Fhooks%2520up%2520and%2520break%2520ups%252F%2522)&t_product=newscomau&t_template=s3/ncatemp/standalone/readnext/more-in&td_module-header=celebrity+life&td_storyID=0e0c5c115f8ea7ff8907d58d79dfa677", "https://cdn.newsapi.com.au/image/v1/76799c1cc1e43fda720467af8ca8368a"], "top_img": "https://cdn.newsapi.com.au/image/v1/ab6264370e8ec5c9437caedbd6742648", "keywords": [], "authors": ["Maureen Callahan"], "canonical_link": "https://www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/angelina-jolie-exposes-her-rebelturnedsaint-myth-by-trashing-brad-pitt/news-story/0e0c5c115f8ea7ff8907d58d79dfa677", "title": "Angelina Jolie shows true colours after Brad Pitt breakup", "meta_data": {"viewport": "width=device-width", "generator": "tcog", "articleid": "0e0c5c115f8ea7ff8907d58d79dfa677", "article": {"published_time": "2016-09-25T21:19:00.000Z", "modified_time": "2016-09-25T21:48:26.000Z", "publisher": "News Limited", "author": "Maureen Callahan", "publicationdate": "26/09/2016"}, "description": "OPINION", "keywords": "personal relationships,valiant single mom,scandalous origin story,man-stealing sex bomb,celebrity journalists,anger problem,press conference,toddler son,tax filings,movie stardom,jewellery company,industry opinion,family photos,empty sand dunes,Celebrity divorce,wedding photos,goodwill ambassador,acceptance speech,radio program,drama queens,baby girl,psych ward,premier freak-show couple,indigent child,humanitarian nonpareil,Namibian reporters,narrative flip,Namibian government,matinee idol,then-Sony chief,British actor,rebel-turned-saint myth,eccentric darkness,high-school quarterback,tabloid narrative,odd detail,Russian hookers,photo negative,now-iconic image,special envoy,selfless philanthropist,hit man,premillennial starlet,sole physical custody,Kenya,Cambodia,England,Vietnam,Namibia,Hollywood,California,United States of America,Ethiopia,New York Times Company,House of Lords,London School of Economics,Council on Foreign Relations,Maddox Jolie Pitt Foundation,Merrill Lynch & Co., Inc.,The Goldman Sachs Group, Inc.,Vanity Fair,S and M,Make It,University of California, Los Angeles,United Nations High Commissioner for Refugees,United Nations Organization,UN High Commission on Refugees,People magazine,Talk magazine,Billy Bob Thornton,Nicole Kidman,Gwyneth Paltrow,Jennifer Aniston,Jon Voight,Laura Dern,Brad Pitt,Jonny Lee Miller,Angelina Jolie,Drew Barrymore,Winona Ryder,Sam Nujoma,Amy Pascal,Scott Rudin,James Haven,Smith,Fred Astaire,Andrew Morton,Lara Croft,Ginger Rogers,Maureen Callahan,Isabel Vincent,Shiloh,Kristin Hahn,Original Sin,Ange", "og": {"image": "https://cdn.newsapi.com.au/image/v1/ab6264370e8ec5c9437caedbd6742648", "title": "The Brangelina divorce is getting messier by the day", "type": "article", "url": "https://www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/angelina-jolie-exposes-her-rebelturnedsaint-myth-by-trashing-brad-pitt/news-story/0e0c5c115f8ea7ff8907d58d79dfa677", "site_name": "NewsComAu", "description": "OPINION"}, "fb": {"app_id": 113758722003364, "admins": "1533025129,653135158,737988273"}, "twitter": {"card": "summary_large_image", "site": "@newscomauHQ", "title": "The Brangelina divorce is getting messier by the day"}, "robots": "noarchive", "apple-mobile-web-app-title": "news.com.au", "msapplication-TileColor": "#ffffff", "theme-color": "#ffffff", "msapplication-TileImage": "https://resources.newscdn.com.au/cs/nca/latest/public/img/favicons/mstile-144x144.png", "msapplication-config": "https://resources.newscdn.com.au/cs/nca/latest/public/img/favicons/browserconfig.xml", "application-name": "news.com.au", "referrer": "origin", "google-site-verification": "GWTbDFKaKnGKyk3q0Na5jIbWHZ4qXn-ibcfMayjSQA0"}, "movies": [], "publish_date": 1474838340.0, "source": "http://www.news.com.au", "summary": ""}