{"url": "www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "text": "Image zoom Halfpoint/shutterstock.com\n\nWinter Worry: Baby, it's cold outside!\n\nThe Cool News: Pregnancy naturally ups your internal thermostat. And that means you're more likely to remain warm even when it's downright chilly. Jennifer Baldwin, of Rancho Santa Margarita, California, says that her winter pregnancy with son Luke, now 4 months, was much more comfortable than her previous summer pregnancy. \"The cold weather was a huge plus,\" she says. \"Especially at the very end, when you're so big, it's nice not to feel overheated.\" The cooler weather also helped her sleep better, which was much needed since she was busy running after her toddler, Julia, 3. \"With Julia, even with air-conditioning, I felt so hot all the time. But when I was pregnant in the winter, I could bundle under the covers and just get comfy. I slept so well.\"\n\nStaying Indoors Will Drive Me Crazy!\n\nWinter Worry: I'll go crazy from cabin fever!\n\nThe Cool News: Yes, the cold and snow may keep you indoors more often, but Jenny Ingram, of Poulsbo, Washington, considered that a plus in her third pregnancy. \"The weather fit with my nesting instincts,\" says the mom to Joel, 8, Olivia, 6, and Lucy, 3. \"I got a lot of stuff done. I was able to organize my home, get the baby's space ready, and sort through my other children's things to make more room. I cooked more, froze some meals to have after the baby was born, and even organized photos.\" Baldwin agrees: \"We spent a lot more time preparing for Luke's arrival. It made things easier later on.\"\n\nBut you don't have to spend all of that time focused on baby's impending arrival. After all, it's hard to find that elusive \"me\" time once your newborn arrives. So read that book that's on your nightstand, finish those thank-you notes from your shower, or make good use of your Netflix subscription. Or find a reason to get out of the house.\n\n\"I didn't let the weather keep me down,\" says Kellie Corner, of Little Rock, Arkansas. \"I went shopping. I went to see friends and family.\" Baldwin also says that interacting with others helped keep cabin fever at bay. \"I just made sure to be as social as possible.\"\n\nI'll Look Frumpy!\n\nWinter Worry: I'm going to look like a giant frump!\n\nThe Cool News: Maternity clothes have come a long way, so you have plenty of options other than your husband's old jammie bottoms or the shapeless sweatshirt hiding in the back of your closet. Susan Baker, of Arlington, Virginia, appreciated that her maternity tops offered extra coverage when she was pregnant with Gia, now 1. \"It was so nice that I didn't have to display my flabby arms,\" she says. Ask any woman whose body is going through pregnancy changes: winter clothes hide those extra curves. (Plus, at this time of year, you generally don't have to worry about putting on a bathing suit.) And not only are winter maternity clothes more forgiving, they are also more versatile. Ingram liked being able to layer. \"In summer, you can strip down only so much,\" she says. \"But in winter, you can layer and stay comfortable no matter what the weather brings.\"\n\nCorner was working as a teacher while she was pregnant with Miranda, now 3, and found she had plenty of options in the winter for work clothes -- many of them from her own prepregnancy closet. \"Sweaters tend to be loose anyway,\" she says. \"I found that I got a lot of mileage out of clothes I already had.\"\n\nI Can't Do Any of My Favorite Outdoor Activities!\n\nWinter Worry: I can't do any of my favorite outdoor activities!\n\nThe Cool News: It's true, downhill skiing and sledding are generally off-limits because you could fall on your stomach, says Marjorie Greenfield, MD, author of The Working Woman's Pregnancy Book. But other sports such as cross-country skiing and snowshoeing are still okay. Dr. Greenfield advises using common sense when choosing activities. \"You don't want any short stops or starts or to do anything that might bang your abdomen,\" she says. If you aren't sure about an activity, ask your ob.\n\nThere is also plenty you can do indoors to get your recommended daily dose of physical activity. Try popping in an exercise video or going to the gym and getting on the treadmill or stationary bike. Exercising can help you maintain a healthy weight and feel better, and it will give you a much-needed boost of energy.\n\nOf course, many moms don't let Jack Frost derail outdoor exercise. Laura Martin, of Greenville, North Carolina, spent both of her pregnancies on a hilly army post in bitter-cold Germany. \"With my first, I walked constantly,\" says the mom of Tally, 2, and Hunter, 4 months. \"It helped to keep me active.\"\n\nBut if your driveway needs shoveling, feel free to delegate. \"Get your husband or someone else to do it,\" says Catherine Ruhl, a certified nurse-midwife in Washington, D.C. Shoveling heavy snow may up your chance of falling or straining those already overworked back muscles.\n\nThere are plenty of reasons to relish your winter pregnancy. But one of the greatest benefits is the outcome -- a spring baby. There's no better recovery from pregnancy than enjoying the fair weather with your little one.\n\nOriginally published in the November 2008 issue of American Baby magazine.\n\nAll content on this Web site, including medical opinion and any other health-related information, is for informational purposes only and should not be considered to be a specific diagnosis or treatment plan for any individual situation. Use of this site and the information contained herein does not create a doctor-patient relationship. Always seek the direct advice of your own doctor in connection with any questions or issues you may have regarding your own health or the health of others.\n\nSource: American Baby", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2008%2F10%2F12230502%2Fhalfpoint2shutterstock.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2015%2F07%2F12231818%2Fffn_jewelrybox_500_cld.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1798&h=941&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2008%2F10%2F12230502%2Fhalfpoint2shutterstock.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2017%2F05%2F12214856%2Fgettyimages-530066585.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2013%2F04%2F12212607%2FV4MjF5NDE6sYgJb6iEbxbPjKCD0jQBT_.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2001%2F02%2F12212410%2Fwoman-in-labor-in-hospital_0.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2015%2F06%2F01220038%2FBullyproof-children_copy.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2019%2F06%2F24202248%2Ffather-and-children-on-bunk-beds-eb62abbe.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2015%2F10%2F12220956%2FGettyImages-543767951.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2019%2F10%2F191011-popular-Baby-Name-Trends.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2019%2F06%2F28134754%2Ftwo-moms-holding-children-f6b7869a.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2019%2F06%2F25153528%2Fchild-gardening-with-dog-ecfcae49.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2010%2F01%2F12214513%2FYzMXBoNDE6wOUtVKM2dPa4mDAxbvi1hW.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2013%2F04%2F12212409%2Fshutterstock_488651425.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1798&h=941&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2008%2F10%2F12230502%2Fhalfpoint2shutterstock.jpg", "keywords": [], "authors": ["Kayt Sukel"], "canonical_link": "https://www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "title": "4 Winter Pregnancy Worries -- and How to Deal", "meta_data": {"viewport": "width=device-width, initial-scale=1", "original-source": "American Baby", "description": "Being pregnant in winter may seem like a nuisance, but there are actually plenty of upsides to expecting once the temperatures plunge. Here are four reasons to stop worrying and start embracing your cold-weather pregnancy.", "og": {"title": "4 Winter Pregnancy Worries -- and How to Deal", "type": "article", "site_name": "Parents", "url": "https://www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "description": "Being pregnant in winter may seem like a nuisance, but there are actually plenty of upsides to expecting once the temperatures plunge. Here are four reasons to stop worrying and start embracing your cold-weather pregnancy.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1798&h=941&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2008%2F10%2F12230502%2Fhalfpoint2shutterstock.jpg", "width": 1798, "height": 941}}, "pinterest": {"url": "https://www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "description": "Being pregnant in winter may seem like a nuisance, but there are actually plenty of upsides to expecting once the temperatures plunge. Here are four reasons to stop worrying and start embracing your cold-weather pregnancy.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2008%2F10%2F12230502%2Fhalfpoint2shutterstock.jpg"}, "twitter": {"card": "summary", "url": "https://www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "title": "4 Winter Pregnancy Worries -- and How to Deal", "description": "Being pregnant in winter may seem like a nuisance, but there are actually plenty of upsides to expecting once the temperatures plunge. Here are four reasons to stop worrying and start embracing your cold-weather pregnancy.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1798&h=941&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F38%2F2008%2F10%2F12230502%2Fhalfpoint2shutterstock.jpg"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}, "article": {"opinion": "false"}}, "movies": [], "publish_date": null, "source": "http://www.parents.com", "summary": ""}