{"url": "https://outeast.com/stories/hamptons-celebrities-homes/", "text": "The Hamptons are a major hotspot for celebrity real estate. Hollywood’s most famous flock to eastern Long Island every summer to live as only Hamptons celebrities can: soaking up sun on the beach, relaxing in their sprawling mansions, and hitting up adorable farm stands. It’s enough to make us all a little envious. But we can always dream, right? Let’s take a look at some of the most amazing celebrity homes in the Hamptons, including some formerly celebrity-owned homes that are currently for sale or rent.\n\nBrooke Shields in Southampton\n\nAmerica’s sweetheart owns this charming cottage in Southampton: one of the more classic, historic neighborhoods in the Hamptons, and also one of the wealthiest. This 6-bedroom, 8-bath home has two laundry rooms and a library, and its covered outdoor dining area and huge freshwater pool look like they’d make great places to take it easy.\n\nAnderson Cooper in Westhampton\n\nOur favorite CNN personality used to own this beautiful home in the quieter, more relaxed town of Westhampton. With those waterfront views and three acres of land, it’s a wonder Cooper ever managed to leave. The place also has a ton of great designer touches, including built-ins, fireplaces and Viking appliances.\n\nAnthony Scaramucci in Water Mill\n\nAnthony Scaramucci’s stint in the Trump administration wasn’t much shorter than his stint as the owner of this Water Mill house. Though he and his wife bought the new construction home in 2018 — for a whopping $9 million — they put it back on the market almost immediately as they searched for a home on the waterfront. This price isn’t out of the norm for this hamlet on the South Fork, which has a bustling art scene. And here it pays for 8 bedrooms, a huge pool with hot tub, separate guest and staff suites, a media room, and a gym, not to mention style and charm galore. The home is no longer on the market, with a pending sale at an asking price of $7.8 million.\n\nNeil Patrick Harris in East Hampton\n\nNeil Patrick Harris hit it big with a house that sits on 13.5 acres of land in East Hampton. With a tennis court, pool, cabana, garage, and a location adjacent to 10 acres of town-owned, conserved land, he is truly living in the lap of luxury — and privacy.\n\nBethenny Frankel in Bridgehampton\n\nSkinnygirl magnate and reality TV star Bethenny Frankel put her Bridgehampton home up for sale this spring for just shy of $3 million, only seven months after she purchased it. A recently renovated shingle-style classic, the house has 7 bedrooms, a pool, stone patio, and much, much more. It’s now in contract.\n\nRamona Singer in Southampton\n\nOkay, so maybe Ramona Singer doesn’t live at this Southampton manse anymore, but that only means we regulars have an opportunity to rent one of the Real Housewives’ Hamptons homes. In addition to having a ridiculously nice interior, the waterfront property also comes with a heated pool, covered decks, bocce ball court, sunken tennis court, and more. What a place to spend the summer.\n\nBeyoncé and Jay Z on Georgica Pond\n\nThe couple who could very well take over the world (their combined net worth is $1.35 billion) have a lovely home in East Hampton, one of the most exclusive towns in the Hamptons. Their house fits right in. Known as “Pond House,” it’s located next to Georgica Pond and sits near 17 acres of meadow preserve. With an infinity pool, hand-carved, heated marble bathtubs, and parquet de Versailles flooring, it’s no wonder Beyoncé and Jay Z shelled out $25 million for the place.\n\nJulianne Moore in Montauk\n\nJulianne Moore’s Montauk home is an airy cottage with wood-paneled walls, wide-planked floors, and a screened-in porch. With the water just past the backyard, Moore has easy access to kayaking, paddle boarding, swimming, and more. Truly a Hamptons dream!\n\nAlec Baldwin in East Hampton\n\nAlec Baldwin has been spending much of his time in East Hampton since the ‘80s, when he started renting there. He purchased this house in 1995, and he and his wife Hilaria have since renovated it into a gorgeous family home.\n\nKelly Ripa and Mark Consuelos in Southampton\n\nKelly Ripa and husband Mark Consuelos bought their Southampton house in 2004 for $2.35 million, and have since put a whole lot of work into it. Kelly’s familiarity with the Hamptons is paying off — the TV network Freeform just picked up her and Consuelos’ new show about Hamptons “share homes,” based on Jasmin Rosemberg’s book “How The Other Half Hamptons.” Get ready for drama!\n\nRobert Downey, Jr. in East Hampton\n\nIron Man himself owns the famous “Windmill Cottage” in East Hampton, which doesn’t feature a truly working windmill, but rather a replica of a classic Hamptons one. The house was apparently used to film the movie “Deathtrap” during the ‘80s. There’s also a separate guesthouse onsite, in addition to a tennis court and pool.\n\nRobert De Niro in Montauk\n\nRobert De Niro owns this oceanfront property in Montauk, although he got permission last year to knock down the existing house and build something smaller. While we’re not sure that ever happened, we’re excited to see what De Niro might do.\n\nCalvin Klein in Southampton\n\nFashion designer Calvin Klein reportedly spent more than $75 million building this house out on Meadow Lane in Southampton, which, at least from this Google Street View image, looks like a big glass box. But of course it’s more than that: The home sits right on the water, and sliding glass doors in every room look out over expertly landscaped sand dunes. The whole thing took years to complete.\n\nChristie Brinkley in Bridgehampton\n\nThe actress and model actually listed both of her Hamptons homes in 2018 and decided that she would live in whichever one didn’t sell. The result? She still calls Tower Hill — an 11,000-square-foot historic home on 20 acres — home.\n\nJill Martin in Southampton\n\nWhen the TV personality and sportscaster needs a little break, she heads to a six-bedroom, six-bath Southampton home that was built in 2016. The 5,300-square-foot hideaway also includes a wine cellar and sauna.\n\nLouis CK on Shelter Island\n\nThe comedian dropped $2.44 million in 2014 for a charming Tudor from the 1900s dubbed Primrose Cottage. Inside the historic home there’s plenty of original details and impressive old-world craftsmanship. And the two acres of waterfront escape (complete with a dock) make it an ideal retreat from the stage.\n\nElie Tahari in Sagaponack\n\nThis Sagaponack oceanfront home is everything you’d expect from one of the world’s top fashion designers. Spread out over 4,500-square-feet is three bedrooms and bathrooms, a great room with soaring ceilings, chef’s kitchen and master suite with unobstructed views of the Atlantic Ocean. And the 60-foot swimming pool is perfectly secluded by Russian Olive trees. The house is currently on the market, but Tahari can still call it home for now.\n\nIna Garten in East Hampton\n\nAn eat-in kitchen with professional appliances and doors opening to rear dining terrace is par for the course when it comes to a celebrity chef’s home. The rest of the cozy space includes a master suite with a balcony, wraparound porch, and a formal dining with French doors to an arbor. Garten did list the three acre lot in prime East Hampton Village in 2019, but the listing has since been removed.\n\n—\n\nFor the best of the Hamptons and North Fork, follow us on Facebook and Instagram.", "images": ["https://wp-tid.zillowstatic.com/outeast/1/Christie-3874ab.png", "https://wp.zillowstatic.com/outeast/1/calvin-klein-house-hamptons-15ac17.jpg", "https://wp.zillowstatic.com/outeast/1/robert-de-niro-montauk-house-2ebbbe.jpg", "https://wp-tid.zillowstatic.com/outeast/1/ina-0a60e6.png", "https://wp.zillowstatic.com/outeast/1/ramona-singer-hamptons-house-702c28.jpg", "https://wp.zillowstatic.com/outeast/1/alec-baldwin-house-1a9441.jpg", "https://wp-tid.zillowstatic.com/outeast/1/CelebHouses_Thumbnail-95eefd.jpg", "https://wp-tid.zillowstatic.com/outeast/1/OE_avatar-a545e6-150x150.jpg", "https://wp-tid.zillowstatic.com/outeast/1/louis-8c4ce7.png", "https://wp.zillowstatic.com/outeast/1/kelly-ripa-and-mark-consuelos-hamptons-house-0e119f.jpg", "https://wp.zillowstatic.com/outeast/1/brooke-shields-house-hamptons-92a00b.jpg", "https://wp.zillowstatic.com/outeast/1/Bethenny-Frankel-Lists-Morning-Glory-House-f88442-c823d6.jpg", "https://wp.zillowstatic.com/outeast/1/juliane-moore-hamptons-house-0d2286.jpg", "https://wp.zillowstatic.com/outeast/1/neil-patrick-harris-hamptons-house-39305e.jpg", "https://wp.zillowstatic.com/outeast/1/Robert-Downey-Jr-Hamptons-7d67ae.jpg", "https://wp-tid.zillowstatic.com/outeast/1/Jill-009c8a.png", "https://wp.zillowstatic.com/outeast/1/jay-bey-pond-house-5f8c0c-1024x462-a78a94.jpg", "https://outeast.com/wp-content/themes/out-east/dist/images/i-shorthand-white_29dc66d7.svg", "https://wp.zillowstatic.com/outeast/1/Anderson-Cooper-house-hamptons-471a93.jpg", "https://wp.zillowstatic.com/outeast/1/Scaramucci-New-Water-Mill-House-3555c5-118444.jpg", "https://wp-tid.zillowstatic.com/outeast/1/elie-4a723a.png", "https://outeast.com/wp-content/themes/out-east/dist/images/i-logo_1e8046f1.svg", "https://secure.gravatar.com/avatar/?s=50&d=mm&r=g"], "top_img": "https://wp-tid.zillowstatic.com/outeast/1/CelebHouses_Thumbnail-95eefd.jpg", "keywords": [], "authors": ["Heading Out", "Grace Cassidy", "Andrea Mazandi", "Mariela Quintana"], "canonical_link": "https://outeast.com/stories/hamptons-celebrities-homes/", "title": "Hamptons Celebrities' Homes: See How the Stars Live", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=0", "description": "The Hamptons is full of celebrities, and you won't believe some of their homes. Check out the Hamptons homes of Anderson Cooper, Beyoncé and Jay Z, Julianne Moore, Robert Downey Jr., and many more on Heading Out, a new destination for Out East stories.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Hamptons Celebrities' Homes: See How the Stars Live | Out East", "description": "The Hamptons is full of celebrities, and you won't believe some of their homes. Check out the Hamptons homes of Anderson Cooper, Beyoncé and Jay Z, Julianne Moore, Robert Downey Jr., and many more on Heading Out, a new destination for Out East stories.", "url": "https://outeast.com/stories/hamptons-celebrities-homes/", "site_name": "Heading Out by Out East", "updated_time": "2020-02-04T15:23:04+00:00", "image": {"identifier": "https://wp-tid.zillowstatic.com/outeast/1/CelebHouses_Thumbnail-95eefd.jpg", "secure_url": "https://wp-tid.zillowstatic.com/outeast/1/CelebHouses_Thumbnail-95eefd.jpg", "width": 800, "height": 534}}, "article": {"tag": "Westhampton", "section": "Life Out East", "published_time": "2020-01-27T21:13:24+00:00", "modified_time": "2020-02-04T15:23:04+00:00"}, "twitter": {"card": "summary_large_image", "description": "The Hamptons is full of celebrities, and you won't believe some of their homes. Check out the Hamptons homes of Anderson Cooper, Beyoncé and Jay Z, Julianne Moore, Robert Downey Jr., and many more on Heading Out, a new destination for Out East stories.", "title": "Hamptons Celebrities' Homes: See How the Stars Live | Out East", "image": "https://wp-tid.zillowstatic.com/outeast/1/CelebHouses_Thumbnail-95eefd.jpg"}, "generator": "WordPress 5.3.2", "msapplication-TileImage": "https://wp-tid.zillowstatic.com/outeast/1/oe-favicon-0575c298979be4a2fccf60021a3d3d0738d43eab198beac9ada4483147965ef0-1d9991.png"}, "movies": [], "publish_date": 1580159604.0, "source": "https://outeast.com", "summary": ""}