{"url": "https://www.tvinsider.com/731428/wwe-naomi-interview-total-divas-survivor-series/", "text": "It’s hard to believe SmackDown Live superstar Naomi is approaching a decade working with WWE. And her husband Jonathan Fatu, known to fans as Jimmy Uso, has been there for most of the way as she transformed from former Orlando Magic dancer into pro-wrestling champion. Their relationship continues to be chronicled on the E! reality show Total Divas.\n\n“Where we were in our lives 10 years ago is a lot different than where we are now,” Naomi, real name Trinity, said. “We were a lot younger, way more immature. Life is different. Our careers have picked up. We got married. We’re home owners now. I’m full-on, hands-on with my step kids now, which I love. We’re truly adulting.”\n\nThe “Feel the Glow” personality has gotten used to the cameras, even when she butts heads with her fellow WWE spouse. In recent episodes of Season 8, Naomi is missing family in Atlanta and wants to spend time with Jon outside of Pensacola. This leads to some uneasy marital discussions.\n\n“Everything that comes with our lifestyle now is not going to be perfect and easy all the time,” she said. “We’re trying to understand each other’s wants and needs at this point in our life because we have both changed as people. That’s what I’m learning and what we are trying to figure out in our marriage right now.\n\n\"You’re getting to see that unfold on Total Divas. It’s real, what is going on and where we are. Hopefully, it can help out other couples and others who are watching can relate because they are going through similar situations.\n\n“What we put out is real, and what we put out is with no regrets. It’s very important to see that as much as we love each other, there are flaws. It’s a constant fight to get through life.\n\n\"But as long as that bond and love is there, everything will work out. It’s interesting how people see that because of social media nowadays. Overall it has been positive. At the end of the day, we are truly ourselves. That’s all that matters.”\n\nSee Also WWE 'Total Divas' Superstar Naomi Is Gearing up for a Glowing 2018 Naomi talks to us about the E! reality hit, being one of the competitors in the first-ever Women's Royal Rumble match, and more.\n\nNaomi learns a lot about herself from watching previous episodes. The long time Total Divas cast member sees instances when she got swept up in the heat of the moment. It’s been a unique kind of therapy.\n\n“You are just reacting and emotional. You’re not thinking. So sometimes I would watch stuff and not even remember why I was so angry,” she said.\n\n“Then there are times where I think, ‘Oh my gosh! I was wrong. Why would I say that? Why would I do that? He was totally right in that situation.’ Sometimes you are so blinded you only see things one way. That’s the cool thing about it to me. We have this to look back in our lives forever. It’s crazy.”\n\nOutside her personal life, Naomi is proud to be part of an overall push for female empowerment within WWE. In 2017, the athletic performer became the first African-American SmackDown women’s champion. She followed it up this year by participating in the inaugural women’s Royal Rumble and ended up winning the first-ever women’s battle royal at WrestleMania.\n\n“Our locker room is so positive,” she said. “We are all focused on the same objectives, and that’s equality for women. Changing the perspective. We want it to be the norm for us to get TV time and for it not to be a big deal if a woman is in the main event. We want the same opportunities as the men, and we’re still focused on proving that.\n\n“This isn’t just about what is happening right now. This is the future. I think all of us being on the same page has brought us closer together. Our mission and goal are to prove that as women we belong on top just as much as the men. That we belong here, and that people are coming to see us just as much as the men.”\n\nSee Also WWE Superstar Carmella Explains Why 'Mella Is Money' on 'SmackDown Live' The first 'Ms. Money in the Bank' & former women's champ also talks WWE 2K19 and why you don't see her on 'Total Divas' anymore.\n\nAnother milestone was marked in October when WWE presented the first all-women’s Pay-Per-View Evolution. Naomi hopes the historic show isn’t the last of its kind.\n\n“I think with as many Pay-Per-Views as we have, I think this shouldn’t be a one-time thing,” Naomi said.\n\n“I think it was very inspiring, very impactful, and it was good. We had a good Pay-Per-View. I’m proud of what we produced, what we brought to the table. To me, it would be a tragedy if this was the only one. As many Pay-Per-Views as we have, at least one year. Even if it just starts with us having one a year, that wouldn’t be too much to ask.”\n\nAttention turns to Survivor Series as Naomi stands alongside Team SmackDown against Team Raw. She is happy her recent tag partner Asuka also featured in the five-on-five elimination match. In her eyes, they’ve only scratched the surface of their potential working together.\n\n“A dream of mine is that if and when we get the tag team titles, I want me and Asuka to be the first to hold them,” she said.\n\n“I think where things stand right now, you’re seeing a different side of her. We all know Asuka is probably the baddest women, toughest women and most talented. I think she is truly talented. I’ve been learning so much from her.\n\n“And as cute and pretty as she is, when she gets pissed off or mad, she can take down any woman or man. I think she is the best. That’s who I want on my team and my corner.\n\n\"I’ve created such a real friendship with her. She is freaking hilarious. That is who Asuka is. Maybe her being around me is giving her an opportunity to be shown. But she is probably one of the funniest people I know and one of the most kick ass women I know. I love her.”\n\nWith Charlotte filling in for an injured Becky Lynch against Ronda Rousey, Naomi has a suggestion for the blue brand’s team captain.\n\n“I would love to get bumped up to be team captain, or even Asuka. Either-or. We can even be co-captains,” she said. “We’re really looking forward to getting some retaliation for Becky at Survivor Series match.”\n\nSurvivor Series, Sunday, November 18, 7/6c live, Pay-Per-View and the WWE Network\n\nTotal Divas, Wednesdays, 9/8c, E!", "images": ["https://www.tvinsider.com/wp-content/uploads/2017/01/partner2.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner3.png", "http://b.scorecardresearch.com/p?c1=2&c2=19587797&cv=2.0&cj=1", "https://www.tvinsider.com/wp-content/uploads/2017/02/logo-tvinsider.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/comfort-tv-logo.gif?x=1", "https://www.tvinsider.com/wp-content/uploads/2018/10/Becky-Lynch-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/09/DSC_0240-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/10/ShaynaBaszler2-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-footer.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.tvinsider.com/wp-content/uploads/2020/03/tvi-white.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner1-38x32.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/Bosch-Season-6-304x195.jpg", "https://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif", "https://www.tvinsider.com/wp-content/uploads/2018/02/NaomiWWE-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/08/OnDISH_Mini-Logo.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/party-of-five-reboot-freeform-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/10/Paige1-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner6.png", "https://www.tvinsider.com/wp-content/uploads/2018/01/Naomi-Entrance-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/04/naomi-jimmy-uso-570x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/09/DSC_0261-1-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/11/038_EDIVAS_01162014mc_343-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner4.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/whats-on.png"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/02/NaomiWWE-1014x570.jpg", "keywords": [], "authors": ["Scott Fishman", "Meaghan Darwish", "Matt Roush", "Samantha Bergeson", "Meredith Jacobs"], "canonical_link": "https://www.tvinsider.com/731428/wwe-naomi-interview-total-divas-survivor-series/", "title": "WWE Star Naomi Keeps It Real When It Comes to Showing Her Marriage on 'Total Divas'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "pocket-site-verification": "c2d9d3d73032bf0b0959f31688efb2", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "The 'Feel the Glow' superstar is also part of Team SmackDown at 'Survivor Series'", "url": "https://www.tvinsider.com/731428/wwe-naomi-interview-total-divas-survivor-series/", "title": "WWE Star Naomi Keeps It Real When It Comes to Showing Her Marriage on 'Total Divas'", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/02/NaomiWWE-1014x570.jpg", "width": 1014, "height": 570}}, "theme-color": "#00aeef", "title": "WWE Star Naomi Keeps It Real When It Comes to Showing Her Marriage on 'Total Divas'", "description": "The 'Feel the Glow' superstar is also part of Team SmackDown at 'Survivor Series'", "author": "Scott Fishman", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/731428/wwe-naomi-interview-total-divas-survivor-series/", "title": "WWE Star Naomi Keeps It Real When It Comes to Showing Her Marriage on 'Total Divas'", "creator": "@tvinsider", "description": "The 'Feel the Glow' superstar is also part of Team SmackDown at 'Survivor Series'", "image": "https://www.tvinsider.com/wp-content/uploads/2018/02/NaomiWWE-1014x570.jpg?628", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "https://www.tvinsider.com", "summary": ""}