{"url": "www.inquisitr.com/2129366/justin-bieber-hollywood-life-site-selena-gomez-fake-garbage-media/", "text": "Justin Bieber put Hollywood Life on public blast on Friday. The superstar took to Instagram to slam the gossip blog for a false story it published about him and former girlfriend Selena Gomez.\n\nSingling out just one of the numerous, fabricated Jelena claims the website has made up over the years, Bieber called out a story the blog posted on Thursday, May 28 headlined, “Justin Bieber & Selena Gomez: Why Their Church Believes They Should Be Together.”\n\n“Hollywood Life is the most outrageous fake weird non factual garbage website I’ve ever seen,” the 21-year-old ripped on Instagram, alongside a screenshot of the headline.\n\nExplaining why he finally spoke up, Bieber went on, “They literally make up whatever they want and usually I don’t care, but this one is so ridiculous I had to say something. Don’t go to their website and give them any traffic.”\n\nThe heartthrob subsequently deleted his Instagram posting, but not before it was picked up by media outlets and commended by his fans.\n\nWhat’s more insane is how much other outlets quotes their fanfics as facts https://t.co/4vBBbjmDu9 — Anzi (@JustinK007) May 29, 2015\n\nThe fake jelena stories are the worst… when they decided to drag the church into it, he had enough — banjokofolake (@banjokofolake) May 29, 2015\n\nFinally he said it…suck on that @HollywoodLife. — JustinBieberCrew.com (@JBCrewdotcom) May 29, 2015\n\nIf i ever see a RT on my TL from @HollywoodLife you’re getting automatically blocked i don’t want to see any of their nonsense anymore. — Irene (@Tanziirene) May 29, 2015\n\nselena stans need to chill. he wasn’t being mean to her at all. he’s defending their church, which is important not only to him but her too — Laura (@PraiseNDream) May 29, 2015\n\nIn typical Hollywood Life fashion, the blog exploited Bieber and Gomez’s Internet-igniting, joint appearance in a Snapchat story posted by Pastor Rich Wilkerson Jr. from a church-related meet in Los Angeles on Wednesday, (May 27). The pair were also reportedly seen at Hillsong Church in Los Angeles on May 24.\n\nAmong the claims Bieber found so “ridiculous” in the site’s subsequent report was a quote from a so-called “source” which alleged, “[Justin and Selena’s] pastors are pretty much all married and they married very young. They are very pro-marriage and pro-family and the feeling in that group is that Justin and Selena belong together.”\n\nThe imaginary insider went on, “Justin has said many many times that he believes Selena is his soul mate, and that isn’t something his pastors take lightly. (sic)”\n\nThe site also alleged that Selena’s friend Taylor Swift was miffed over Bieber and Gomez hanging out. It’s claimed that “once she [Swift] heard about Selena being with Justin again, she just shook her head and was very disappointed.”\n\nThe watchdog website Gossip Cop has since confirmed Swift made no such comment. In addition, both E! News and TMZ reported Bieber and Gomez are not remotely considering reuniting and ran into each other unexpectedly at Wilkerson’s gathering.\n\n“They are definitely not back together whatsoever,” an insider told E! “Definitely not.” The source added that the duo were “cordial and friendly to each other,” and that, “for the first time, it wasn’t awkward. It was harmless.”\n\nBefore Bieber deleted his riot act Instagram, fans noticed Ariana Grande was among the thousands who left a comment. The songstress wrote, “yaaaaasss justin yaaaaasss.”\n\n(Photo: Screenshot of Ariana Grande comment At Justin Bieber's pre-deleted Instagram post)\n\nIn so doing, Grande joins an ever-expanding list of celebrities who have publicly criticized Hollywood Life for fabricating reports. That list includes Gomez, who previously stated that the site’s stories about her were “never true.” Austin Mahone angry-tweeted the site after it reported a false story about his breakup with Fifth Harmony’s Camila Cabello.\n\nMore recently, Hailey Baldwin slammed the site as “absolutely disgusting” after it claimed that she, Bieber, and mutual pal Kendall Jenner, are involved in a sexual love triangle.\n\nHey @HollywoodLife I think u guys are absolutely disgusting. U should really learn to leave teenagers be and stop writing so much garbage. — Hailey Baldwin (@haileybaldwin) May 13, 2015\n\nConsidering the disgraced Hollywood Life topped Gossip Cop’s “Worst Outlet in Celebrity Journalism” report last November, and has just been shamed again by the watchdog site for falsely claiming Bieber recently contacted Gomez about recording a new duet — only one question remains:\n\nWhy is any media outlet of repute still citing Hollywood Life as a credible source? Is it at all likely that this repeatedly exposed clickbait-chaser has access to insiders close enough to Bieber and Gomez to back up its risible, 24/7 “Exclusives!”?\n\nUpdate: Tellingly, the story in question has since been taken down from Hollywood Life’s website since Bieber’s “final straw” statement. Whether the blog intends to remove the rest of its extensive Jelena content remains to be seen.\n\n[Images via Juliano-KMMix/x17online/Instagram]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2015/05/yas.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2015/05/Justin-Bieber-Shames-Hollywood-Life-Over-Ridiculous-Selena-Gomez-Story.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/b911717e2a01903d946c8f1136c6928f?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Page Mackinley"], "canonical_link": "https://www.inquisitr.com/2129366/justin-bieber-hollywood-life-site-selena-gomez-fake-garbage-media/", "title": "Justin Bieber Destroys Gossip Site Over Bogus Selena Gomez Church Story", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/L_m-pXGNXd4"], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}