{"url": "https://www.yelp.com/biz/museum-of-ice-cream-los-angeles-4", "text": "693\n\n2018 E 7th Pl\n\nLos Angeles , CA 90021\n\n\n\n(213) 395-0499\n\nI have been to several of these pop up museums. The Ice Cream one was one of the first I went to and one of the better ones. It's good specially if you are into Instagram and Social Media so you can posts some cool pics. The bonus is that you get to taste some free ice cream! If you have kids it is a great place to spend an hour or so with them. Also great place to take a date, if you are dating someone. I remember that it was tough to get tickets and you had to reserve way in advance. But I guess it is closed now and moved on to other cities.\n\nHad SUPER FOMO when I saw everyone and their mothers going here so i impulsively bought 2 tickets and tbh, my life would have been the same if i went or not. Yes, all the photos on IG are great representations of what it looks like inside but yall dont understand the STRUGGLE it was to really get through everything. Glad i went just to see what it was all about but this kind of left a sour taste in my mouth when it comes to interactive museums. Pros: - I had such a busy day that day and I had to haul my friend's and my ass to LA in traffic which was BRUTAL! we missed our call time ( you have to buy tickets for a specific time slot) and we thought we would be denied to come in cause they have time slots for a reason. THANKFULLY, they were so nice about it! they let us come in with the next group so no sweat on that! - omg the workers have SO MUCH ENERGY ITS AMAZING! even from the beginning when we were all waiting in line, they had workers in hoolah-hoops talking to us and really getting the crowd pumped for whats inside! CAN I HIRE YALL FOR MY WEDDING OR SOMETHIN?? - they give out small samples of various desserts/candies/snackies that fit the theme of each room! Loved it cause who doesnt love free food?? - i LOVED the set up and the displays! you really get the whole ig-worthy feel from this place! Mehs: - i get that there is a time crunch but i felt like we were rushed most of the time in each room. They time you for the sprinkle pool and kind of push you to the next room if youre taking too long. I saw everything i wanted to see in the time they gave us but i dont think other people appreciated the fact that they paid for this but they can't take their time in each room. Pros: - the wait time for each photo op is CRAZY. the majority of our time there, we were waiting just to take photos for under a minute. A lot of people are obviously there for the photo opportunity and the experience and it was disappointing that we spent almost 2 hours there waiting to take pics.\n\nWe got to explore this when it popped up in LA! It was definitely a fun, tasty and engaging experience! It was totally worth the wait and price.\n\nI came to Museum of Ice Cream for a date with my boyfriend last summer and it was such a great experience. My boyfriend and I both worked at an ice cream shop before so you can see our excitement over it. The tickets were pricey but you definitely pay for the experience. There's so many cute places to take photos of and I wish I brought my actual camera instead of my iPhone. My favorite place, of course, is the sprinkle pool but it was a timed!! We were timed to take pictures and enjoy the sprinkly pool which sucked but I don't think we needed any more time. I left that place with fake sprinkles until I got all the way home!!! We got lucky because we got treated with Salt & Straw (AKA the best ice cream EVER) along with their mochi mint ice cream, edible cookie dough, and their pancake ice cream sandwich. All the rooms were pretty cute. You'll love this place if you love taking pictures (and ice cream). I got so lucky to visit this place while tickets were high in demand and sold out for a while. I definitely think this was worth my money. This is such a good place for a cute fun date idea and family day~ Wish I could come back!\n\nYep, I did it. I subjected myself to the MOIC- AKA the Social Media Zoo. Let's put it this way, if I see one more teenager taking a selfie, my head is going to explode. The narcissism at this place was pretty sickening. I understand that the point of this place is to take pictures, but this was to a level that I couldn't comprehend. How can I put this nicely? This place isn't my cup of tea. You are literally standing In line to take pictures with gummy bears. I feel like it's overhyped X 500 and that the ice cream sucked. Will I say everything was bad? Yes and no. The mirror room was the best room and the one I enjoyed the most. The mint room had absolutely no purpose. It was a bunch of mint plants in a room which looked like something that my 6 year old cousins could have planted. The sprinkles pool (which everyone wanted to go into), grossed me out. I don't even want to know how many germs is in that thing or how many babies mistakenly peed in it. With that said, BEWARE!! People at this place are SERIOUS about their pictures/selfies. They bring their professional cameras to get their money shot...you know...because they need to be set apart from the other thousands of people who have been to this joint. I bring this up because you have to wait In line to go into each room. The wait time can vary depending on how many self absorbed people are in front of you. I think we waited 15 minutes for one room because the group in front of us had to take 40 pictures with the same pose. We even heard a little kid say, \"mom, how much longer are they going to take?\" No joke. I went into this \"museum\" knowing it was a social media trend, but I also had this picture in my head that it would be similar to a scene from the movie Charlie and the Chocolate Factory. I was WRONG, WRONG and majorly WRONG. I guess I'm too old to get this pathetic excuse of a \"museum.\" I remember the days when I was younger and used to get excited for the scholastic book fair. Nowadays, it's tweens getting excited to take 40 pictures of themselves with bright and shiny objects. Thank the lord for the wine bar down the street. That place made the whole night worthwhile.\n\nI think I just heard the sound of an ice cream truck go by! Fortunately, it was just a dream, after a nap, from a sugar high, the day after returning home from the Museum of Ice Cream in LA. The MOIC is a place that continues to boost some demand. So much so, that it recently opened an installation in San Francisco and soon another location will open in Miami. What a brilliant idea! A mega sized art installation, where one can play out one's ice cream dreams in real life. Let's face it, visiting the MOIC is all about the photo opportunities! Parent's capturing memories of their children, friends taking their best photo shoots of each other and couples having a selfie stick date day! This is the place to boost your social media coverage. There is fun to be had, such as free samples and some interactive exhibits, yet there is something to be desired too. There are plenty of photos and information on the MOIC, so no additional details on this are required. Personally, I like looking at the photos and reading what people have to say about this place. It's always interesting how someone has a different perspective on the same photo or one may write about expectations, although it's pretty well spelled out on the site, what you will experience. Much like a music video, I would write the script of the museum a bit differently. I would play Joni Mitchell and have a room to build ice cream castles. I would bring back Eskimo Pies, I always loved the riddles on the stick when you finished. I would also add an old fashioned soda bar featuring the classic banana split, complete with cherries on top! It's so different than the nitrogen based ice cream my husband and I have become accustomed to today! The Museum of Broken Relationships didn't make it in LA, but the Museum of Ice Cream did! It will be interesting to see what larger than life food item makes it to installation next. I'm guessing the donut and pizza are not far behind the ice cream! Imagine the photo opportunities one could dream up here. Pie in the sky! #MuseumofIceCream #LosAngeles #SanFrancisco #Miami\n\nI wonder. Does all of our social networking, amazon shopping, and netflix hulu-hooping-- make us yearn for more effectual, real-world physical interaction? After all, life moves pretty fast. If you don't stop to look around once in a while, you might miss it. Or... do we decide to head out into the world when our selfies need new backgrounds?!? In any case... the limited, really-really-very-last, \"not fooling\", absolutely-final, red-hot, must-have tickets ... made the pop-up / pop-art \"Museum of Ice Cream\" #so-exclusive. As expected, there were vibrant pink and yellow paintings and art pieces of the celebrated frozen dessert. But there's also real-world physical interaction, thank you. Interactions such as the snap-a-selfie room, faux-banana jungle room, pink telephone room, giant-gummy-bear-spectacular, fruity popsicle paradise, and of course the pool of 100-million-sprinkles. Occasionally you're treated to a chocolate, gummy bear, licorice, or McConnell's Fine Ice Cream treat. Some might think that thousands of participants bathing / posing in the colorful little plastic sprinkles would be unsanitary. #MeToo. But supposedly the plastic nodules are treated daily with an anti-microbial agent (Plan-B flu and Morning-after hepatitis shots are available in the gift shop). Although it is named the \"Museum\" of Ice Cream, there really isn't much knowledge to be gained about ice cream. But you didn't come here for \"knowledge\", did you? Knowledge is boring, can't help you in a fist-fight, and doesn't get very many likes. The reason to visit here is to document on your social-media how busy you are experiencing the \"real world\". The so-special, \"better-than-you\", #so-exclusive real world. And perhaps (accidentally or on-purpose), enjoy some playful interaction at this otherwise ugly, barren warehouse on the wrong side of the tracks... made beautiful. Real world Instagram beautiful.\n\nWhen you find out there's a Museum of Ice Cream in LA, first things first, let's score some tickets! Just to preface this, I'm one of the rare crazy ones who has visited MOIC in LA once and MOIC in SF TWICE! What: LA Bestie Summer Fun I'm not one for the traditional museum, but my favorite food is ice cream! This is in contrast with said Bestie who loves the traditional museum layout. MOIC LA is more for the pictures and the experience. As long as your expectations are along those lines, you will enjoy the experience. You won't necessarily \"learn\" about art here. If that's what you're going for, MOIC may not be for you. Highlights of MOIC LA: 1. Sprinkle Pool: a glorious pool of plastic sprinkles (sprinkle pool in LA is more pink); however, these sprinkles FOLLOW you despite all that shaking off and air sprays that you do to remove them. Also, socks are a must (more hygienic)! 2. Getting Up Close and Personal with those Pink and Yellow Bananas: They are literally overhead. For those artsy folks, you can definitely work with your subject having a cathartic moment with said banana background 3. Variation in Colors: At MOIC LA, you have rooms with various themed colors (mint green, chocolate brown with the contrast of white, strawberry pink, waffle cone walls, etc.) 4. Giant Gummy Bear Displays: There are so many gummy bears (mind you, also in my favorite colors) of various sizes! Tastings: 1. CREAM = Cookies Rule Everything Around Me (Funny how this vendor showed up because I personally discovered CREAM in Berkeley so for me, it's a NorCal thing.) Our flavor was churro! Yum! 2. Mint Mochi Ice Cream (delicious) 3. Licorice Gummy Bears (not much of a fan) 4. Pancake Ice Cream Sandwich (The pancakes became soggy because of the ice cream. This honestly was a bit too heavy for the last tasting.) Tips: Bring your own water! You'll definitely need something to quench your thirst after such a sugar high! Service: All of the employees are so excited to be here! They get you pumped up right from the beginning! Also, they are willing to take you picture too if you ask. Crowds: There is a long line to get in. It is recommended to start lining up at least the 15-20 minute mark prior to your reserved time. However, the crowd seemed tame. Everyone is too absorbed trying to take their own pictures! We would actually ask those working at MOIC to take our pictures (they were happy to do so). Outdoor Activities: There's a picnic area where you can bask in the sun-Hello, LA! and you can play various outdoor games set up (bean bag toss, tic tac toe) Parking: Being that it's in LA, parking is always a question. There was a MOIC sign (ideally they should make it bigger) that offers valet parking. If you don't see said sign, do just follow the crowds of people going to MOIC. Price: These MOIC LA tickets ($29) are actually cheaper than MOIC SF! MOIC is something you do once and move on unless you're really interested in visiting all of the locations. The Bestie and I only found out about MOIC SF while in line to get into MOIC LA. If we'd known prior to that, we'd have waited and gone to only MOIC SF instead, but we ended up making a separate trip just to check it out. Otherwise, I can't justify spending so much on MOIC tickets. This is an ice cream lover's dream! Bottom line: Go here for your ice cream lover's fix!\n\nAs much as I love pop up art and social media, I have to agree with all the criticism on the previous reviews concerning the MOIC. In a nutshell, you are not getting any value from spending $29 plus fees for museum entrance. Speaking of museum, it's not even a museum - it's a huge space for everyone's social media pictures. In any case, it's still a fantastic event for kids and families, who seemed to enjoy it on the day I went. For $35, you are treated to a piece of Dove chocolate, a scoop of ice cream in a cup, half a mint chocolate mochi ice cream (my favorite), a handful of gummy bears, a cherry bomb and licorice \"shot,\" and to top it off, an \"exclusive,\" ice cream cone featuring crushed Oreo cookies at the bottom. Disappointed yet? Despite the long lines, lack of any real ice cream facts other than the mint room, and the mostly disappointing ice cream that was featured, I did appreciate the sprinkles pool, because let's face it, although it's probably harmful to the environment, running your feet through those tiny plastic sprinkles feels so goddamn therapeutic. Anyways, save yourself a few bucks and park on the street.\n\nSo I HAD to see what all the hype was about and through the MOIC social media, scored myself a $29 ticket just for myself on a Saturday. The tickets were literally selling out before my eyes and I couldn't wait to book for anyone else! Once you arrive, there's Valet for $6, a next door lot for $4, but I got street parking in Mateo for free - no meters (yay)! Follow the sprinkles on the sidewalk cos they're there and you'll see they get everywhere! I love the spray painted ice cream cones on the walk up to the line up, which you'll find against the pink wall just to the left of the entrance. There will be a greeter there in pink answering any questions. Particularly, if you have kids, there's also a mock patio lawn area to play in. So greeters are super enthusiastic! They'll check tickets and ID and you go in as a group under your reserved time. Err, since I was 20 mins late, I went in with the next group (cool, thanks for not reprimanding me)! You'll notice even waiting outside, its Instagram heaven with young women in their 20s-30s in groups of two doing selfies. You'll notice this throughout the visit. This is definitely an experience to do with a buddy, or three to help pose and social media the crap out of the experience! After designating a cute group name (which lasts about a minute because once we're in, everyone takes off at their own pace), we get a complimentary Dove candy in the foyer. You can stay in any room except the sprinkle pool at your own pace, but you CANNOT go backwards. You'll start getting ice cream samples in the second Venice Beachy type of room you enter. They're coming out like clockwork, this Staff is trained well! Next are swings. A line, but skipped as a solo. Pride or shyness wouldn't let me ask others for a pic alone on a swing haha - I stuck to selfies! So off I went to the very cool Banana room, then around to my favorite: the lesser known mint room and got a chocolate mint Star-shaped Mochi! Mmmm! It was all green and had mint with its history on display. I didn't know of this room previously, and it's my favorite color so it really stands apart by the pink which is why I loved it! More displays of colored walls, pink telephones, melting popsicles dropping on the walls (don't touch), a gummy bear room (I waited for some, but the male staffer was too busy flirting with the two cute millenials in front of me, ok, I moved on) were the next exhibits. I was alone in the \"corrupted chocolate\" room as Staffer Hailey explained to me about the artist where I stayed back a bit to small talk with her. I chose her candy offerings of a cherry bomb chocolate ball which was delicious! Next was the sprinkle room and I had a shy group! We first put our shoes and purses in lockers. Then after some rules, We embarked on the pool and the toddlers went in for pics but the adults were taking too long so I was the first to wade in and helped myself to selfies and Instagram stories. Halley came round and offered to take a pic to my relief! Came out well, thanks girl! Time to get out and shake off days of sprinkles, which I took with me, its worse than sand (souvenir!?). There's a bathroom for cleaning up, on the way to the last room which has foozeball games and more pink, soft serve ice cream with finally, an overpriced gift shop. Nothing under $12 and that's just for pins. All in all, a cute experience for the 30 minutes it took to walk through, but needs to be done with a friend. I wouldn't go back for the price, but I am happy for the opportunity to check out MOIC for myself!\n\nGenius. Absolute genius! Someone decided to make a few rooms look pretty for selfies, pretend it's a museum, throw a few little treats at people, and charge nearly 30 dollars for them to take a bunch of selfies! Start in the phone room. Pick up a pink receiver, pose in a listening pose and pretend you hear something other than silence. Grab some sugary, food-coloring saturated unicorn vomit in the next room and grab a pic in front of the ice-creamed Hollywood sign wall. Don't worry, people will totally think you're there! Feast your eyes on hanging bananas you can't touch and line up for the banana swings. Sit, pretend to swing. Don't swing too fast or your photos will be blurry! Half a Mint Chocolate Chip Mochi waiting in a sterile green room with mint plants. Not a whole mochi, though, because they can't afford that at 30 dollars a ticket. Eat some gummy bears while looking at giant plastic ones. Eye the work of artist Abel Bentin in the next room, a wall of smushed ice cream cones. Feast on some Sixlets and black licorice while you feast your eyes. End your trip with a dip in a shallow pool of plastic sprinkles. Brush them all off, or you think you did, only to find that they came off your clothing and blew down the street to litter DTLA. Last room is for purchasing overpriced souvenirs as you slurp from a cone of watery vanilla soft serve infused with pink food coloring. McDonald's makes better soft serve. How is this even a museum? You can see the Metropolitan Museum of Art in New York City for less, and to call this a \"museum\" is an outright lie. Just be honest and call it \"rooms for selfies\". There will still be plenty of people who love it, and it'll save suckers like me some time and money.\n\nMore of a 3.5 experience, but I'm feeling generous at the moment. As many mentioned, each $30 ticket had to be bought months in advance. The staff is strict on your appointment time and all members of your group must be present while in line. Each room had a theme ranging from life-size gummy bears to popsicles to Hollywood. It's self paced, but sections may become crowded depending on how fast people are going. You can't backtrack to a prior room, but no one has to know. Just saying. Some rooms were interactive with samples ranging from gummy bears to mochi to ice cream. Keep in mind that these are literally bite-size samples, don't come on an empty stomach. My favorite part is the sprinkles pool, but only 5 minutes were given to play and take photos. Overall, staff is nice and friendly. I think they did the best they could to promote a safe and clean environment. Would I come back again? Probably not. This is more of a one and done type place.\n\nI waited longer in the virtual waiting room to purchase tickets compared to the actual time I spent in the museum... Heads up: This is one big installation dedicated for people looking for a new profile picture to post on social media. Though it does seem like a fun family outing for those with younger kids. Sadly there is minimal history or actual opportunity to learn about ice cream. I wish I knew this beforehand. All the \"photo shoots\" that are occurring do make for some fun people watching though. I was prompted to come here entirely due to the ice cream samples I was told I would be given - ex: the charcoal cone and pancake ice cream sandwich. These samples are gone! :'( At least when I went. And were replaced with a different cone (not too bad) and a mixed handful of candies (meh). I did appreciate how the employees were upbeat and even offered to take photos for you. You're also able to make your way through the installation on your own time. I would otherwise skip the overpriced fee and use it to buy yourself ice cream elsewhere. It's not worth the hype.\n\nAlthough this location is now closed I needed to provide a review especially since I now have been informed that the San Francisco museum is permanent :) I have been to the Museum of Icecream in LA twice and loved every moment (and not to mention the free desserts in most of the stations). This is a perfect place to bring friends and families and for those who are selfie king and queens this is the place for you. Although there hasn't been one area that I didn't like there isn't just one area that I liked....I LOVED them all. If you have an opportunity to attend the SF location you will definitely have a great time so what are you waiting for?\n\nLocated in DTLA; this is the perfect venue for all you hipster, Instagram obsessed, beyond basic beeches. So why was I here? I'm basic, duh~ Entrance to this \"museum\" requires tix of which they sold out months ago. Good luck trying to get in, the next time they go on sale. I'm blessed to have a friend who is on top of these things and buys extra tix for us losers who suck at that ish. Thanks, Howie! Ladies, he's single! HMU if you wanna meet a cool af six foot stunna ;) The rundown: Line up outside a few min before you're allotted time. Make sure the ticket holder is there with their ID ready. You'll get instructions for your visit... DO NOT TOUCH is basically what they'll tell you. I didn't follow these directions well, too many bananas everywhere. Couldn't help but play with one or two or more. Shhhhhh, it's our secret! Y'all better not post those pics or I'm dumping you as a friend :p The museum is divided into rooms/sections each with an ice cream theme, obvi, it's an ice cream museum! You get a small treat each time you \"enter\" a new section, but you're not allowed to go back once you enter a new room so take all the pics you want before moving along to the next! Go with fun friends and hilarities will ensue as soon as you step inside :) Be silly, make faces, and have fun! And remember, it's OK to have someone other than yourself take a pic of you. Selfies have taken over much of social media, can we PLEASE see more than just your face?! A little background never hurt nobody. I promise, it'll be ok ;p\n\nYaaaayyyy after 2 months of waiting we finally came here this past Wednesday evening. Valet is $6.00 so if you cant find street parking it's best to park with Valet. We arrived we lined up and we had one of the employees scan us in and check our tickets. From there we were directed by the lovely Gelato Jane who gave us some rules and pepped us up before we entered. So the rules were to not touch any of the work installations and once you leave a room you can't go back, you can only go forward. Right when you walk in there is a room that the walls are adorned with pretty little trinkets and an ice cream cart on the side that is filled with dove chocolate, feel free to help yourself, I know I did. :) 2nd room was the pink room with the old school phones, when you pick it up there is lady saying something but I couldn't really hear, it's a good photo opp. 3rd room was pink palm trees and walls with a cool sign that had little ice cream cones on it, there we were treated with treat number 2, Afters ice cream I don't know what flavor it was, all I know it was delicious!!! 4th room was the banana room, there are two swings with the banana paper in the background so get your boomerang ready and swing. The other room was the pink and yellow banana art installations. I felt so rushed here because the girls in front of us were taking their pictures which I'm totally not hating on but than another tour group came in and there were a ton of people now in this room waiting to take a picture so literally didn't get to enjoy this room unfortunately. 5th room was the Mint room where actual mint gardens are there and you can smell and touch the mint. We were given yet another treat, mint mochi ice cream. 6th room was the rainbow room with a big old mirror and a crane playing machine which has some cool souvenir prizes, unfortunately after 4 turns we didn't win anything, close, but not close enough. =( 7th room was this room with boots on the wall. There was also a selfie camera computer thing so after taking the picture you can email it to yourself. . 8th room was the Popsicle room, no touching the popsicles! 9th room was the Gummy Bear room which has tons of giant teddy bears around and a girl who gives you gummy bears if you do the gummy bear dance, my son had a lot of fun doing the gummy bear dance. 10th room was the cookie dough room with black ice cream attached to the wall and to a sculpture. They gave some type of gummy or black licorice in here I honestly don't know what it was, it looked gross so I politely passed. 11th room was the infamous Sprinkle pool!! Okay here you must take of your shoes and you literally have 5 minutes in here, it sucked because I feel like I didn't get to enjoy the sprinkle pool and wade around because there were a lot of people and everyone was taking pictures so you didn't want to ruin their photo opp. It's okay because I was one of those selfie people too. I wish they gave you a little more time. Last but not least was the last room it was the souvenir room that had this big old ice cream sandwich swing, the museum of ice cream sign, gift shop and you get your last treat. They gave us a vanilla ice cream with cone but the ice cream was this pink color I don't know how it was vanilla and pink either way it was delicious. You can just chill here, swing on the ice cream swing, play ping pong, sit down, take pictures, enjoy your ice cream, and buy some souvenoirs if your heart contents. All in all this place was a fun experience, it's pretty, its all for selfies, you get to have yummy ice cream but you learn nothing about ice cream, not sure why it's call Museum when its just a bunch of installations and things of ice cream. I had a good time, I really felt rushed that was my biggest concern. I believe they let people go in every 15 minute intervals, they were very efficient but I think they should change it to every 20 mins or so so everyone can have an opportunity to actually enjoy each room, take their pics, etc. Glad I was finally able to see what the hype was all about.\n\nCame here on a Wednesday and was the first group to be let inside. As mentioned before as you walk inside you can only go in one direction. Once you pass a room you can not go back. The good thing is that there is no time limit on how long you can stay in each room besides the sprinkle pool. You are only allowed 3 minutes which I felt like it was more than enough time. Throughout the museum you get samples of ice cream and candy. The first one that we were able to try was the animal cracker ice cream which you can only get at the museum. IMO it was way too sweet and too many chunks of the crackers. The other sample we were able to try was the mint mocha. Which prob was my second favorite. And then the only other ice cream we were given was the pink vanilla soft serve which was my favorite. The candy they gave us was black licorice which I did not like at all. Overall, I was hoping to learn something about ice cream or at least how it is made. But did not learn anything. It's pretty short and I feel like it's not worth 30 bucks. If anything I feel like it's worth 10 bucks a person at most. This place is mostly for the gram and to take pictures.\n\n\"Dont believe the hype!\" It's not worth the $30 (adults) and $18 (for kids). If you're like me, thinking you're going to be sampling all kinds of ice cream and whatnot, then you may not want to come here. Because of the name, \"Museum of Ice Cream\", I was under the impression that it I would be learning the \"history\" of ice cream, making ice cream, and/or tasting unique flavors. Nope, not the case! You go from room to room (self-guided tour), looking at (and snapping pics of) various art pieces and things that may be associated with ice cream. As many of the other reviewers mentioned, this place is all for posting pics/Boomerang on Instagram. Going from room to room, I was like \"That's it?!\" At the beginning, you get a teeny tiny scoop of ice cream and at the end you get a pancake ice cream sandwich. I was so unimpressed. The only thing I looked forward to was the infamous \"everybody-and-their-mama-got-this-picture-posted-on-Instagram\" sprinkle pool lol. There's valet parking, but I found parking on the street. Considering I paid for my 3 kids and me, it was totally a waste of money.\n\nPricey? Yes, $30 ticket price. Hot? Yes, no AC in here. Tour too short? Yes, I think it was done in half hour. Felt rushed? Yes, especially in the pool area. Not a real museum? Again yes, it's a pop up shoppe with rooms of different colorful installations worthy of instagram opportunities. Did I have good time though? Definitely! In spite of all the cons, I still had a blast during my visit. Here's how the tour went room by room: 1. Upon entry, a room with walls adorned with cool little trinkets. An ice cream cart holds your first treat - a dove chocolate. 2. Pink room with old-school phones. You can pick it up and listen to the museum rules. 3. Room with pink palm trees and walls. Here we were treated with Cool Haus ice cream. 4. Banana room - there are two swings provided for photo ops before proceeding to the pink and yellow banana art installations. 5. Mint room where actual mint garden beds are present with matching mint garden tools. We got a mint mochi ice cream for a treat. 6. Rainbow room with a crane play machine allowing you a possibility to win a souvenir ice cream novelty. No, I didn't win any. 7. Hooker boots wall - at least, that's how I call it. Everything on this wall are all white including two boots adorned with you guessed it right! In cream! 8. Popsicle room in different colors and in melting state. There's a bench in here to sit on. 9. Gummy bear room which isn't complete without the giant teddies and a scoop of gummie bears. 10. Cookie dough room with black ice cream attached to the wall and to a sculpture. Those ice cream should be used only for that purpose because it's disgusting. I threw it away. 11. Sprinkle pool where you spend I believe five minutes in a pool where hundreds of thousands of people already dived in ahead of you. They said it's sanitized but still... 12. Souvenir room with other random stuff such as ice cream sandwich swing, badminton table, neon sign of the Ice Cream Museum, and gift shop. You get your last ice cream treat here which was a pink pancake ice cream sandwich that was already melting with pancakes of styrofoam like texture and taste. Again, I threw this away. Overall, still a fun experience! It's colorful, interactive, and unique in its own way. The big question mark - what did I learn about the history of ice cream? Nothing!", "images": ["https://s3-media0.fl.yelpcdn.com/bphoto/9WnB_DkkHCJCLz4eXi58Tg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/7RX-bW5sbVRx5N1S0gkcjw/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/c7dDuTpZ04_eBxsotI2SIQ/348s.jpg", "https://s3-media0.fl.yelpcdn.com/assets/public/burst_desktop_xsmall_outline.yelp-shared-styles.yji-58cfc999e1f5da75e75ddf71c868c656.png", "https://s3-media0.fl.yelpcdn.com/bphoto/RB8XblOZIOhxAjlzq4BAWQ/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/wsr91jDR80OwFkMUYlS5BA/l.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/U5_ARVxKafWdLapQj8jlcQ/300s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/4oDN-gUOn4aIR6Fu-hYi5w/60s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/n3u5Qd0b7JuOVP3uGvz-5Q/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/WCNIi9ecOLgN2LetTTKOOQ/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/L0Yp3GJJuWZp-TUcTmMV8w/300s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/Wq7b3CxZ2VdJGxKlTMG7yA/300s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/eIJBkbhWoYF7ZcUbvF7iuA/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/giBJlb_Nrl2rbEkEmll8Bg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/AaJfzOc40Bifu7af_G0PMg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/K5Kr1hMJecVFYXCD8VcgAA/300s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/q3KpVguIt6Mx3WzXS--SPw/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/34h5mCiVUEowePAtzMyoQA/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/mO5SsMKRPwAf8atgDzwhHg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/b3cxOf8xb3NIOrXlWjAhNw/60s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/WyD3upz1T3nfpe2r69ORrA/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/gNOjcl9GX4agbaGW6AlT7A/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/30BNGlJ7Jod3cSWfQoIUTQ/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/iAKjq_Y3APMu4CwFeEsCYQ/348s.jpg", "https://idsync.rlcdn.com/398766.gif?partner_uid=5B9F81868ED1BDCC", "https://s3-media0.fl.yelpcdn.com/bphoto/xGruB2RC-9GLfBiLgsZ_PA/l.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/SPy47BIre6wcNs4_5yKDoA/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/WbM8lFoQxwIjRoMTlcntFQ/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/XZwV97BJpUg9SZz-XhhZJg/348s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/FeAjdtHzf_tJB0LgpI3h6w/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/HSiMmJoepLCsbKb7i2rrSQ/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/goEBumEsxcySoL-aqS9WtA/348s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/jIQw5BR4dg0-EgmFZdLYJA/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/T2TkG9p7Tp0AnORFksgg4A/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/8HnRgco8VE6KKzp-BzkMwQ/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/LUd759xYrt2kGUrSxGKwsw/l.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/4xVGwcKW-nmYzo94ZdkC7g/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/0PlqoqC4XfK_eG57-7W0Cw/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/qY8ffrI-TU_SQc0RSuss6Q/348s.jpg", "https://maps.googleapis.com/maps/api/staticmap?scale=1&center=34.033573%2C-118.231629&language=en&zoom=15&markers=scale%3A1%7Cicon%3Ahttps%3A%2F%2Fyelp-images.s3.amazonaws.com%2Fassets%2Fmap-markers%2Fannotation_32x43.png%7C34.033573%2C-118.231629&client=gme-yelp&sensor=false&size=315x150&signature=zFBZsPmc0ZUVEBHYdEl3Ym1r0lg=", "https://s3-media0.fl.yelpcdn.com/bphoto/auaKHcsgf0oDo3hOn313gg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/eJ_6_u2L4zd4VKMcAMGqRQ/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/4mVFKIdQlj7wGShjaRpnmQ/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/OcbpBKKAkxaHXGFCPdQ3MA/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/7TxbRmhuf1TEmS59TV2QpA/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/zMUNQAuXbNbCe1E9anxHbw/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/t4yPhF1ckipX_Liy2RzonQ/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/HCBBCQuabrdPwvpCrA39hw/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/wsr91jDR80OwFkMUYlS5BA/o.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/WGJ1_uB6OSpkZUCnXB5u5w/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/9SclnmC6zDkiToounxnOgg/300s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/xdQfPpGf5gAGgrKVVdGgdg/168s.jpg", "https://www.facebook.com/tr?id=102029836881428&ev=PageView&noscript=1", "https://s3-media0.fl.yelpcdn.com/bphoto/nd6xh7I8nFXlM_rMFI-Myg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/rPKxuysuVGrr1jqek6z-kA/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/GOlbr-60FNw3MgyorMUGEw/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/SeOrqR4-iyeFbSSdZrWDEQ/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/qF6kjwIrTNeWwkhr7Nwi6Q/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/LS-8XebdD5c8KpPumJINUA/168s.jpg", "https://s3-media0.fl.yelpcdn.com/assets/public/empty_profile.yelp-react-component-review.yji-1f2e356daa5c4d3f196e4da56d029152.png", "https://s3-media0.fl.yelpcdn.com/assets/public/logo_desktop_xsmall_outline.yelp-shared-styles.yji-17089be275f0e32eb065304790b0c35e.png", "https://www.facebook.com/tr?id=1432291440371688&ev=NoScript&cd%5Bcategory%5D%5B%5D=museums", "https://s3-media0.fl.yelpcdn.com/bphoto/3lm1sBAXMOermStIx-1KVg/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/0L4V6Ao5INkb3btIlSvKnA/348s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/qUm6a3AAAIX4v6WarjBGuQ/60s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/AhOqvLB2qXAgnx1fjTj7tw/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/Yi7PejrCH_OHhV5WV22q7w/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/9hFMh8iBeyG6Bf6bMbXKZA/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/4EBoIuUJP5k8e1vd2ptu-g/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/bnhs44_iec_Icykbnt3s_Q/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/jq-nO6j5SE6FgVF28X8DWA/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/zIXsLr6aD-xMU7O0giyRzA/300s.jpg", "https://s3-media0.fl.yelpcdn.com/assets/public/stars_v2.yelp_design_web.yji-52d3d7a328db670d4402843cbddeed89.png", "https://s3-media0.fl.yelpcdn.com/photo/YQp6yeThuvI7cmhWKqvCKg/60s.jpg", "https://s3-media0.fl.yelpcdn.com/assets/2/www/img/b7e9d647188d/gfx/header_print.gif", "https://s3-media0.fl.yelpcdn.com/bphoto/g9qHGjWJ-7nxc58QV9vaqA/l.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/rKF-PzR8hDQwlhyhPsg0mA/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/_PMjUVoWVdVgf7EyeOkqSQ/300s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/sSWwRxoGCfUnrK66GvXisw/168s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/4VWTXt7y0CKAWrV1IyT0-g/300s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/iNjHioeU0_UXHZins0nTfA/348s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/VYGdVHEbefJ2JZvxd4sYfg/348s.jpg", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-804377h&cg=0&cc=1&ts=noscript", "https://s3-media0.fl.yelpcdn.com/photo/U9ILq9KDGNdQPGVT_RERgQ/60s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/Cmp6SIM1yOVVdPNjjC2Ypw/60s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/ffExNFI_CfKPTm4s3aut7Q/60s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/X5gxRleVpgQ3jRzP8IHaug/300s.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/OMjsE7qllrW57eLNef8z9A/168s.jpg", "https://s3-media0.fl.yelpcdn.com/photo/QzSeICGzuyst0SqBgAIvhw/60s.jpg"], "top_img": "https://s3-media0.fl.yelpcdn.com/bphoto/wsr91jDR80OwFkMUYlS5BA/o.jpg", "keywords": [], "authors": ["Robert W.", "Monica T.", "Dollyrose V.", "Mariza F.", "Chelsea V.", "Elle N.", "Vin T.", "Jash P.", "Bailey Z.", "Melissa G."], "canonical_link": "https://www.yelp.com/biz/museum-of-ice-cream-los-angeles-4", "title": "Museum Of Ice Cream", "meta_data": {"description": "693 reviews of Museum Of Ice Cream - CLOSED \"I have been to several of these pop up museums. The Ice Cream one was one of the first I went to and one of the better ones.  It's good specially if you are into Instagram and Social Media so you can…", "keywords": "Yelp,recommendation,San Francisco, bay area, local,business,review,friend,restaurant,dentist,doctor,salon,spa,shopping,store,share,community,massage,sushi,pizza,nails,New York,Los Angeles", "viewport": "width=1020", "application-name": "Yelp", "msapplication-TileImage": "https://s3-media0.fl.yelpcdn.com/assets/2/www/img/b8f6d9d556d5/ico/win8-tile.png", "msapplication-TileColor": "#c41200", "msapplication-starturl": "https://www.yelp.com/", "msapplication-navbutton-color": "#c41200", "msapplication-window": "width=1024;height=768", "msapplication-tooltip": "Go to Yelp.com", "msapplication-task": "name=Yelp Deals; action-uri=/search?find_desc=deals; icon-uri=https://s3-media0.fl.yelpcdn.com/assets/2/www/img/a6bbc59c7458/ico/favicon-16x16.ico", "apple-itunes-app": "app-id=284910350, app-argument=yelp:///biz/EFGZzNz3UPswWlWmzQrFYw?utm_campaign=default&utm_source=www", "al": {"ios": {"app_name": "Yelp", "app_store_id": 284910350, "url": "https://www.yelp.com/biz/museum-of-ice-cream-los-angeles-4?utm_campaign=biz_details&utm_medium=organic&utm_source=apple"}}, "fb": {"app_id": 97534753161}, "og": {"description": "Museums in Los Angeles, CA", "image": {"identifier": "https://s3-media0.fl.yelpcdn.com/bphoto/wsr91jDR80OwFkMUYlS5BA/o.jpg", "height": 1332, "width": 2000}, "site_name": "Yelp", "title": "Museum Of Ice Cream - CLOSED - Downtown - Los Angeles, CA", "type": "yelpyelp:business", "url": "https://www.yelp.com/biz/museum-of-ice-cream-los-angeles-4"}, "twitter": {"card": "summary", "site": "@yelp", "domain": "yelp.com", "app": {"name": {"iphone": "Yelp", "ipad": "Yelp", "googleplay": "Yelp"}, "id": {"iphone": "id284910350", "ipad": "id284910350", "googleplay": "com.yelp.android"}, "url": {"iphone": "yelp:///biz/EFGZzNz3UPswWlWmzQrFYw?utm_campaign=default&utm_source=twitter-card", "ipad": "yelp:///biz/EFGZzNz3UPswWlWmzQrFYw?utm_campaign=default&utm_source=twitter-card", "googleplay": "intent://yelp.com/biz/EFGZzNz3UPswWlWmzQrFYw?utm_source=twitter-card#Intent;scheme=http;package=com.yelp.android;end;"}}, "image": "https://s3-media0.fl.yelpcdn.com/bphoto/wsr91jDR80OwFkMUYlS5BA/258s.jpg"}, "yelp-biz-id": "EFGZzNz3UPswWlWmzQrFYw"}, "movies": [], "publish_date": null, "source": "https://www.yelp.com", "summary": ""}