{"url": "www.inquisitr.com/4535920/meghan-markle-has-easier-ride-with-prince-harrys-royal-family-than-her-own-regarding-future/", "text": "Meghan Markle is constantly being compared to Kate Middleton, but this isn’t much different than when Kate first arrived on the royal scene and was compared to a famous princess. Kate was compared to Princess Diana, so comparisons among royal watchers are nothing new. Reports that Meghan Markle was having a hard time winning the queen’s acceptance first surfaced when Prince Harry’s new girlfriend was discovered by the media. Today, it doesn’t look like the friction is coming from the royal brood, but rather from one of her very own family members.\n\nMeghan Markle did something refreshing and something a bit different than the usual royal protocol from decades past of keeping things under wraps. During a Vanity Fair interview, she had no qualms about making the revelation “We’re a couple. We’re in love” and offering up to the world just how happy she is with Harry, according to Fox News. She was so enthusiastic about her new love that the article was titled, “Meghan Markle, Wild About Harry.”\n\nIt has been seen in various reports on how the protocol that comes along with being royal dictates different aspects of a suitable spouse. In Meghan’s case, it was because she was previously married that the headlines suggested that the “Queen might not attend Prince Harry’s wedding,” like the one seen published in July from the U.K.’s Express.\n\nThen there were the “jealousy” headline rumors suggesting that Kate was “jealous” of Meghan. One such article was seen back in March from Celeb Dirty Laundry. They claimed that Kate may be jealous of Meghan’s “sexy confidence” on the red carpet, which was a rumor going around at the time in the media. Meghan appears to be able to weather the rumors until they finally disappear from the headlines.\n\nPrince Harry and Meghan Markle are reportedly 'as good as engaged' ???????? https://t.co/AZZedEbq1W pic.twitter.com/qaQ4JXYHxq — Glamour (@glamourmag) October 4, 2017\n\nToday, reports indicate that Meghan has had an easy time of winning her place among the royals, as her meetings with Kate, William, and the queen have been reported as going well, according to an article last month from Us Weekly. At one point during the young courtship of Harry and Meghan, the media was being rather nasty to Meghan and Prince Harry actually made a rare response to the press asking them to lay off. According to USA Today, Prince William also publicly backed his brother’s request.\n\nWhile Meghan is hitting it off with the royal family, it seems her “estranged half-sister” might not be in the celebrating mood. While the rest of the world appears to be celebrating Meghan and Harry being on the cusp of an official engagement, her half-sister has a few things that might add some friction to the situation.\n\nPrince Harry and girlfriend, actor Meghan Markle, seen holding hands in public for first time at Invictus Gameshttps://t.co/GSwbzWr2pZ pic.twitter.com/j3gcg4YPxs — BBC News (UK) (@BBCNews) September 25, 2017\n\nAccording to Fox News, Meghan’s half-sister’s name is Samantha Grant, “who is reportedly shopping around a tell-all memoir about growing up with Markle.” The book Grant is proposing to various publishers “includes a scathing assessment of the Hollywood star.” She is quoted as writing, “Hollywood has changed her. I think her ambition is to become a princess… The truth would kill her relationship with Prince Harry.”\n\nThe working title of the book is The Diary of Princess Pushy’s Sister, according to Page Six. According to Fox, Meghan wrote an essay for Elle Magazine about growing up biracial in 2016. Back then she wrote, “My dad is Caucasian and my mom is African American. I’m half black and half white…To describe something as being black and white means it is clearly defined. Yet when your ethnicity is black and white, the dichotomy is not that clear. In fact, it creates a grey area. Being biracial paints a blurred line that is equal parts staggering and illuminating.”\n\nPrince Harry and Meghan Markle broke with tradition this week, but where do you stand on the handholding debate? https://t.co/d1R0kTw9f0 pic.twitter.com/AZIr1U5o7G — British Vogue (@BritishVogue) September 30, 2017\n\nAccording to Page Six, Grant shares the same father as Meghan, but because she has a white mother, she is not biracial like her sister. In the book, she talks about what Meghan dealt with growing up and how it changed Grant’s life as well. Prince Harry and Prince William have had their share of tell-all books that have been penned about their mom. Their mom Princess Diana has not only been the topic of a few books but she’s been the topic of a few documentaries and movies as well. Grant claims, “the truth would kill her relationship with Prince Harry, ” but after what he’s gone through with the media regarding his mom, it might take more than a book to ruffle Harry.\n\n[Featured Image by KGC-22/Star Max/IPx/AP Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/10/Meghan-Markle-and-Prince-Harry.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/4663c9853f526626ef9a0979c644cf18?s=250&d=mm&r=g"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Roz Zurko"], "canonical_link": "https://www.inquisitr.com/4535920/meghan-markle-has-easier-ride-with-prince-harrys-royal-family-than-her-own-regarding-future/", "title": "Meghan Markle Has Easier Ride With Prince Harry’s Royal Family Than Her Own Regarding Future?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}