{"url": "en.wikipedia.org/wiki/Leslie_Jones_(comedian)", "text": "American comedian and actress\n\nAnnette \"Leslie\" Jones[1][2] (born September 7, 1967) is an American comedian and actress who was a cast member and writer on Saturday Night Live from 2014 to 2019. Jones has been a featured performer at the Just for Laughs festival in Montreal and the Aspen Comedy Festival. In 2010, her one-hour comedy special, Problem Child, was broadcast on Showtime. Jones starred in Ghostbusters (2016) as Patty Tolan. In 2017 and 2018, Jones was nominated for an Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series for her work on Saturday Night Live.\n\nEarly life [ edit ]\n\nAnnette Jones was born on September 7, 1967, in Memphis, Tennessee.[3] Her father was United States Army, and her family moved frequently.[4] Her family moved to Los Angeles, when her father took a job at Stevie Wonder's radio station, KJLH, as an electronics engineer.[3] Jones attended high school in Lynwood, California, where she also played basketball; her father suggested that she play the sport because she is six feet tall.[5]\n\nJones attended Chapman University on a basketball scholarship and transferred to Colorado State University when her coach Brian Berger left Chapman for Colorado State.[1][6][7] She intended to become a lawyer,[8] but changed her mind and changed her major a few times, including to business accounting and computer science, and ended up majoring in communications.[9] At Chapman, Jones became a radio DJ.[9] She was unsure of what she wanted to do and contemplated the possibility of a career playing basketball overseas.[8]\n\nShe had a brother, Rodney Keith Jones (1971–2009).[citation needed][10]\n\nCareer [ edit ]\n\nJones started to do stand-up comedy in college in 1987, when a friend signed her up for a \"Funniest Person on Campus\" contest.[4][8] After she won the contest, Jones left school and moved to Los Angeles.[8] She performed at regular clubs and worked at Roscoe's House of Chicken and Waffles and UPS[11] to make ends meet. Mother Love and Dave Chappelle encouraged her to move to New York City to hone her craft for two years, where she appeared on BET's ComicView before returning to Los Angeles.[9] She performed at The Comedy Store in West Hollywood, but received unfavorable reviews.[9] She opened for Jamie Foxx and was booed by the audience. Feeling she lacked experience, Jones stopped performing for three years.[9] Fearing that she would only ever be known in African American circles around 2010 she began to stop playing so called \"black clubs\"[12] One night Chris Rock saw her perform and gave her name to several of \"the biggest managers in comedy\" all of whom \"didn't get it.\"[13] Rock would eventually help Jones get a job at Saturday Night Live.[13]\n\nIn 2008, Jones was part of Katt Williams's It's Pimpin' Pimpin' tour.[4][14]\n\nNetflix signed Jones for a stand-up special slated for 2020.[15]\n\nSaturday Night Live [ edit ]\n\nIn December 2013, Saturday Night Live held a casting call to add at least one African-American woman to the show, and Jones auditioned. Prior to being asked to audition, Jones had criticized the show, saying that the show, and especially cast member Kenan Thompson, was \"not funny\".[16] Sasheer Zamata was added as a featured player, while Jones and LaKendra Tookes were hired as writers.[17] Jones appeared during the Weekend Update segment of the May 3, 2014 episode hosted by Andrew Garfield, where her jokes about her current dating problems and her potential effectiveness as a breeding slave were met with controversy.[6][18]\n\nJones appeared in the first and third episodes of the 40th season, hosted by Chris Pratt and Bill Hader, respectively. On October 20, 2014, Jones was promoted to the cast as a featured player, and made her official debut on the October 25, 2014 episode hosted by Jim Carrey. She became, at the age of 47, the oldest person to join the show as a cast member (surpassing Michael McKean and George Coe, who were 46 when they joined the show in 1994 and 1975, respectively).[19][20] Jones's addition marked the first time in SNL history that the show's cast included more than one African-American woman; in addition, the 40th season had the most African-American cast members to date.[21] Jones subsequently returned for Seasons 41, 42 (where she was promoted to Repertory Status), 43, and 44.\n\nIn 2017 and 2018, Jones was nominated for a Emmy Award for Outstanding Supporting Actress in a Comedy Series for her work on SNL.\n\nJones did not return to the 45th season, making the 44th season her last season.[22]\n\nFilm [ edit ]\n\nIn 2006, Jones appeared in Master P's movie Repos.\n\nIn 2014, Jones appeared in Chris Rock's directorial debut, Top Five; Rock has said a follow-up is in the works,[23] telling Complex Magazine, \"Some people really shine in Top Five. You might want to see a little more Leslie Jones.\"[24]\n\nIn 2015, Jones appeared in the Judd Apatow and Amy Schumer project, Trainwreck; reportedly Apatow and Schumer wrote a part specifically for Jones after seeing her turn in Top Five.[25]\n\nIn 2016, she starred in the reboot Ghostbusters as Patty Tolan, alongside Melissa McCarthy, Kristen Wiig, and Kate McKinnon.[6][26]\n\nJones is set to star in Coming 2 America alongside Tracy Morgan, Rick Ross, and KiKi Layne. The film is a sequel to Coming to America, starring Eddie Murphy.[27]\n\nOlympics [ edit ]\n\nDuring the 2016 olympic games in Rio, Jones[28] regularly live-tweeted events and posted videos of her reactions.[29] Enthusiasm for Jones's commentary grew, with articles appearing like The Huffington Post's \"Watching Leslie Jones Watch The Olympics Is Better Than The Actual Olympics\".[30] Television producer Mike Shoemaker, one of Jones's Twitter followers, posted on Twitter that his friend Jim Bell, NBC's executive producer of the network's Olympics coverage, should add Jones to NBC's team of commentators covering the Games; Bell responded on Twitter the next day asking Jones to join NBC in Rio. She accepted and flew to Rio, covering swimming, track and field, gymnastics, and beach volleyball for NBC.[31]\n\nJones reprised her duties at the 2018 Winter Olympics.[32]\n\nOther projects [ edit ]\n\nJones and fellow comedian Adam DeVine appeared in a 2016 ad campaign for Allstate Insurance, created by Leo Burnett Worldwide.[33]\n\nJones hosted the BET Awards on June 25, 2017.[34] This marked her hosting debut.\n\nIn 2018, Jones appeared in two advertisements for Amazon's Echo Spot.[35]\n\nSports fandom [ edit ]\n\nJones is a fan of the MLS team Seattle Sounders FC.[36]\n\nInfluences [ edit ]\n\nJones has cited as her comedic influences Eddie Murphy,[8] Richard Pryor,[4] Carol Burnett,[37] Lucille Ball,[37] John Ritter,[37] and Whoopi Goldberg.[4]\n\nOnline attacks [ edit ]\n\nFollowing the release of Ghostbusters, Jones became the target of racist attacks by numerous accounts on social networking site Twitter. Twitter responded by taking action against several users, resulting in the permanent Twitter suspension of user and Breitbart editor Milo Yiannopoulos, who had described her as \"barely literate\".[38]\n\nAfter continuing to receive racist comments, Jones left Twitter on July 18, 2016.[39] Jones appeared later in the week on Late Night with Seth Meyers, in which she described the ordeal and her meeting with Twitter CEO Jack Dorsey. Responding to Yiannopoulos's claim that he was targeted for being a \"gay conservative\", Jones stated, \"Free speech and hate speech [are] two different things\".[40]\n\nNearly a month later, Jones was again the subject of numerous online attacks. Her personal website was hacked, with its contents being replaced by photos of her driver's license and passport.[41] The site was changed to display alleged nude photographs of Jones, as well as a video tribute to Harambe, the Cincinnati Zoo gorilla killed in May 2016 (a reference to the racially charged gorilla remarks directed at Jones in the earlier attack). Jones' team took the website down shortly after it was hacked.[42]\n\nBoth incidents resulted in large outpourings of celebrity and fan support, via the hashtag \"#LoveForLeslieJ\", which trended on both Twitter and Instagram.[43] Paul Feig,[44] Gabourey Sidibe, Ellen DeGeneres, Sara Benincasa, Ava DuVernay, Hillary Clinton, Corey Taylor,[45] Katy Perry, Octavia Spencer, Anna Kendrick, Lena Dunham[46] and Loni Love expressed solidarity with Jones. Jones responded to the hacks on the October 22, 2016, episode of Saturday Night Live.[47]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/220px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/1200px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/1200px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Leslie_Jones_(comedian)", "title": "Leslie Jones (comedian)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/1200px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}