{"url": "https://people.com/tv/bethenny-frankel-ramona-singer-friendship-status-rhony/", "text": "Bethenny Frankel and Ramona Singer‘s feud fueled most of the action in season 9 of The Real Housewives of New York City — stemming from the moment Singer made the mistake of bringing up Frankel’s naked film past in the context of her 7-year-old daughter Bryn.\n\nFrom there, it was one fight after the next — each time Singer attempting to apologize only to dig a deeper and deeper hole for herself by insulting Frankel again and again.\n\nGet push notifications with news, features and more.\n\nFirst there was a chat in a restaurant during a group holiday party, where Singer attempted a more polite approach but got vicious when Frankel calmly told her “I don’t want to be schooled by you right now and I don’t like the way you’re speaking to me.” Then there was Singer’s Berkshires blowout — where she criticized everything from Frankel’s Skinnygirl empire to her relationship status to the real way she allegedly made her millions (sample: “You didn’t have any money until you f—–. You would date every guy for their f—— money”).\n\nIt only got worse when Frankel disinvited Singer from a group vacation — causing Singer to launch into an emotional tirade about her divorce. “My f—— heart was cut out, my legs, my arms,” Singer said, tearing up. “So don’t even tell me and try to compare your life to mine. Don’t. Don’t. Just don’t, Bethenny. Have more respect for me. Have more respect and more sympathy. It’s not always about you.”\n\nImage zoom Bethenny Frankel Bravo\n\nImage zoom Ramona Singer Bravo\n\nEventually the two would make a pact to drop the nasty comments. And during a tequila-filled trip to Mexico, the two would come to peace — having a heart-to-heart on pool floats while the Skinnygirl mogul skinny-dipped.\n\n“I’m f—ed up, okay? I’m f—ed up,” Singer said. “I’m a miserable person, I’m horrible, I’m a bad friend, I don’t know how to act. I am so sorry that I did what I did and I hurt you. I’ll never do that again. … I don’t want to be that person. I care about you and I don’t want to hurt you or anyone else I care about.”\n\n“That s— has to stop. You be a good friend. Who does that? Who acts like that?” Frankel told her in response. “I don’t want you to be that person. I know you don’t know. You’re not bad — you’re not an evil person. … I want you to be happy. I really do, I swear to God on my life I want you to be happy.”\n\nImage zoom Bethenny Frankel and Ramona Singer Bravo\n\nSo where does Frankel and Singer’s friendship stand now?\n\nOn Wednesday’s reunion part three, the two once again revisited their season-long battle. And after exchanging another round of blows, they appeared to settle back into a truce — even hugging at the end.\n\n“The thing was all season, I just wanted you to be out of my way,” Frankel told Singer. “I’m not angry at you — I knew you had such anxiety coming in here. I don’t feel anger towards you. But do I need to be your best friend? No.”\n\n“I don’t want to be close, but I don’t not not like you is where I am with you,” she said, quoting Singer’s iconic “I don’t not not like you” from earlier in the season. “I’m not angry with you, I honestly wish you happiness.”\n\nHer words resonated with Singer. “I feel it from you. I’m honestly happy we’re in this place. I really feel better,” she said, as host Andy Cohen pointed out the two weren’t in that good of a place. “At least [Bethenny’s] talking to me. She’s not icing me out. So for me, that’s good!”\n\nImage zoom Bethenny Frankel and Ramona Singer Bravo\n\nSinger spent a lot of time Wednesday apologizing for her actions — even admitting that she “cringed” when she watched back some of her arguments with the upcoming Shark Tank investor.\n\n“It was blind range,” she said of her behavior in the Berkshires. “I was so angry, it was blind range.”\n\nShe was also blind drunk too. “I had a few too many,” Singer admitted, balking down questions from Cohen that she was also on pills. “I wasn’t on pills, I was just drinking all day because being around her was making me nervous. I don’t take Xanax.”\n\n“Looking back, I looked like an a——. I don’t know what I was thinking the whole damn season,” Singer added. “I just lost my whole mojo for weeks on end because Bethenny was so upset with me — which I can understand in retrospect. But I just didn’t know how to make it right and it just got worse. And it was just a horrible moment in my life.”\n\nImage zoom Ramona Singer, Sonja Morgan, Dorinda Medley and Luann D’Agostino Bravo\n\nStill, despite “owning” her bad behavior, Singer remained steadfast that her original question about Frankel’s naked-film past was innocent.\n\n“My delivery sucked at that lunch. [But] it was not coming out of viciousness, it was not coming out of maliciousness,” Singer said, explaining that she had been sent the article from a friend a week before talking with Frankel about it.\n\n“My first concern in the back of my head was remembering that [former New York City Housewife] Alex McCord had a naked picture in one of the weeklies [in season 1],” Singer recalled. “And [my daughter Avery’s] school was upset, she was almost asked to leave. … I was like, ‘Oh my God, I hope everything’s okay with Bryn. I hope no one’s saying anything.’ ”\n\nImage zoom Bethenny Frankel, Andy Cohen, and Ramona Singer Bravo\n\nFROM PEN: Andy Cohen’s Pick For The Most Absurd Real Housewives’ Business Ever\n\nFrankel didn’t buy it. “The article brought up something that had already been in the press years ago and I wrote in a book had come out six weeks before,” she told Singer. “So when you came to that very intimate time to speak to me mother-to-mother in a very public restaurant and bring me this smoking gun, it wasn’t that it was the delivery. It was the content, it was the intention — it was malicious.”\n\n“I was going through a bad situation in my personal life and despite that, I didn’t come at you at all,” Frankel continued, looking back at their season of blows. “Not one time did I attack you. You attacked my entire career and insinuated I slept my way to I don’t know where, but I never attacked you not one time, Ramona. …You’ve been disgusting to me.”\n\nRHONY REWIND: Bethenny Frankel and Ramona Singer Fight on the Brooklyn Bridge\n\n\n\nThe two continued to go back and forth — Frankel bringing up past arguments (the Brooklyn Bridge!) and Singer maintaining that she was always a good friend (“I’ve been so there for you on so many levels”).\n\nBut in the end, none of that mattered as the two decided to put down their (metaphorical) guns and focus on moving on.\n\n‘Til next season …", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Framona-singer-bethenny-frankel-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fbethennyramonapoolrhony-1-2000.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Framona-singer-bethenny-frankel-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fbethenny-frankel-ramona-singer.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Frhony-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Frhony-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Frhony-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fbethenny-frankel-ramona-singer.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/bethenny-frankel-ramona-singer-friendship-status-rhony/", "title": "RHONY: Bethenny Frankel & Ramona Singer Hash It Out — Their Friendship Status Now", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bethenny Frankel,News,Ramona Singer,Real Housewives,Real Housewives of New York City,TV,TV Watch", "news_keywords": "Bethenny Frankel,News,Ramona Singer,Real Housewives,Real Housewives of New York City,TV,TV Watch", "description": "Bethenny Frankel and Ramona Singer's feud fueled most of the action in season 9 of The Real Housewives of New York City", "og": {"title": "Where Does Bethenny Frankel and Ramona Singer's Friendship Stand Now?", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bethenny-frankel-ramona-singer-friendship-status-rhony/", "description": "Bethenny Frankel&nbsp;and&nbsp;Ramona Singer‘s feud fueled most of the action in season 9 of&nbsp;The Real Housewives of New York City&nbsp;—&nbsp;stemming from the moment Singer made the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fbethenny-frankel-ramona-singer.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/tv/bethenny-frankel-ramona-singer-friendship-status-rhony/", "description": "Bethenny Frankel and Ramona Singer's feud fueled most of the action in season 9 of The Real Housewives of New York City", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fbethenny-frankel-ramona-singer.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bethenny-frankel-ramona-singer-friendship-status-rhony/", "title": "Where Does Bethenny Frankel and Ramona Singer's Friendship Stand Now?", "description": "Bethenny Frankel and Ramona Singer's feud fueled most of the action in season 9 of The Real Housewives of New York City", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fbethenny-frankel-ramona-singer.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}