{"url": "https://web.archive.org/web/20180110181248/https://www.forbes.com/sites/scottmendelson/2018/01/10/the-cruel-reason-michelle-williams-was-paid-1500x-less-than-mark-wahlberg/", "text": "Sony\n\nFile this one under “no good deed goes unpunished.” After sexual assault allegations came out concerning Kevin Spacey, director Ridley Scott took the unprecedented (and not likely to be repeated all that often, sorry Deadpool fans) step of reshooting a large chunk of his kidnapping drama All the Money in the World with Christopher Plummer playing J. Paul Getty. The lightning-fast reshoots added an additional $10 million to the budget, and thus the film remained in play as an Oscar contender. But now, even as the TriStar film struggles at the box office ($20m domestic thus far), and with its awards future in question, the film has been hit with another slightly more complicated scandal.\n\nAs first brought up yesterday by Women and Hollywood’s Melissa Silverstein and confirmed by USA Today late last night, supporting actor Mark Wahlberg negotiated an additional $1.5 million for the several days of reshoots. But lead actress Michelle Williams was paid just $1,000 for her reshoots. So, despite being the top-billed star (and potential Oscar nominee for her performance), Williams was essentially paid just 0.7% of what her male supporting co-star was paid. Is this an example of egregious gender discrimination/pay disparity in action? Well, yes and no. But the overreaching narrative is absolutely one that highlights said issues in the industry at large.\n\nFirst, a few things to note. A version of this story came out in The Washington Post way back in November of last year, yet it failed to get much traction. Sony distributed the film but did not produce the picture. The extra $10 million came from Imperative Entertainment. Both Wahlberg and Williams are represented by the same talent agency, so WME is probably going to have to play some spin/defense in the next few days. Williams and Scott both gave interviews in the run-up to the release exclaiming that they and the above-the-line actors (with the exception of Chris Plummer) essentially worked for free in order to salvage the prestige picture.\n\nAssuming all of this is true, then Michelle Williams and Ridley Scott agreed to work on reshoots sans much in the way of compensation while Wahlberg demanded more money for more shooting days. Whether or not Mark Wahlberg was public about his requests for additional compensation or made a behind-the-scenes deal and participated in the “for the love of the game” narrative, I can only speculate. But that Williams chose to participate in reshoots essentially for free does not make her a martyr, and Wahlberg’s requests to receive additional funds for additional work does not necessarily make him a villain. Lord knows we shouldn’t be against a professional getting overtime pay for overtime work.\n\nThe whole thing looks horrible, and that’s assuming the best version of events (as opposed to the likely one where all parties agreed to come back for free but Wahlberg negotiated in secret for an additional payday). At least some of the issue concerns representation. Talent agents are supposed to get the most money for their clients as part of their jobs. And, moreover, while it would be nice to have some kind of uniform standard for Hollywood paydays, at the end of the day studios don’t fund a lot of the films they distribute and thus can’t necessarily control who gets paid for what. That doesn't let them off the hook, but it is a little more complicated than \"Sony should cut Williams a check for $1.49 million!\"\n\nHere’s the $1.5 million question that goes to the heart of the matter. Without painting Williams as a victim quite yet, would she have felt confident asking for more money for more shooting days if she had felt entitled to it? If she honestly wanted to do the work for scale because she believed in the movie, then that was her right and her choice and I’m not comfortable passing judgment on her personal agency. It’s plausible that Williams worked pro-bono because she wanted her superb star performance to not be buried as a result of the Spacey association.\n\nBut if she was willing to work for scale at least partially because of that whole \"women who try to get what they deserve instead get penalized while men do likewise get what they want\" thing, well, that's not good. Moreover, at least one reason that Williams would have been willing to give up her time was that All the Money in the World is an outright star vehicle. Unlike Brokeback Mountain, Shutter Island or Manchester by the Sea, she’s not playing the love interest or supportive wife. While she does lots of solid indie work, this and Greatest Showman (as Hugh Jackman’s wife) are her first major studio gigs since Oz: The Great and Powerful (as James Franco’s love interest) five years ago.\n\nExplicit “He got $1 million but I got $500,000!” gender pay disparities notwithstanding, there are far fewer major studio leading roles/star vehicles for an actress (especially a woman of color, so please see Proud Mary this weekend whether it’s any good or not) than for an actor. For example, Michelle Williams and Ryan Gosling co-starred in the Oscar-nominated Blue Valentine in 2010. Since then, Gosling (a fine actor and allegedly a fine human being) has had at least half-a-dozen outright major studio star vehicles (Drive, Ides of March, Gangster Squad, La La Land, Blade Runner 2049, The Nice Guys, etc.) while Williams has had… uh… All the Money in the World.\n\nYou can argue that Williams doesn’t want to do big movies, but I think if Hollywood was making more movies like Patriots Day or The Nice Guys that had female leads instead of male leads, that actresses like Michelle Williams or Taraji P. Henson (cough-starring in Proud Mary, in theaters everywhere this Friday-cough) would be able to find more and better work outside of the indie (or television) scene. Speaking of Patriots Day, Mark Wahlberg, who is also quite good in all the Money in the World, has since 2010 had 15 starring roles from major studios. All the Money in the World is his first supporting gig since his Oscar-nominated turn in The Departed in late 2006.\n\nNow that’s no shade on Wahlberg, no matter how he negotiated his $1.5 million reshoots payday or whether he is kind to children and animals in his off-time. Wahlberg is a working actor with a long track record of opening major studio movies (Lone Survivor, Contraband, The Happening, Invincible, etc.) to relative success. While his star power has dwindled in the last few years, since the very notion of star power itself has taken a hit, he had a hell of a run from 1999 (Three Kings) to 2015 (Daddy’s Home). Moreover, Wahlberg is a working actor who has every right to request additional pay for additional work, and the financers can agree to his terms or not.\n\nYet, that track record at least partially derives from being a talented, handsome white guy in Hollywood. He will have no shortage of major lead roles between now and when he ages into a distinguished character actor whereby he may well win that Oscar for playing a dying professor/artist/businessman who rediscovers life via a theoretically platonic relationship with an attractive 23-year old woman. The cruel irony is that Mark Wahlberg could afford to walk away, which is why he was in a position to not have to work for cheap. For Forbes’ top-paid male actor, All the Money in the World was just another job.\n\nAnd that, I would argue, is the takeaway from this. Michelle Williams was willing to do overtime work for minimal pay at least partially because she wanted this Sony-released starring vehicle to see the light of day. And that desire at least partially stemmed from the utter lack of major studio vehicles of this nature available to someone like Williams as opposed to someone like Wahlberg. For the star of Certain Women, it was a rare chance to headline a year-end Oscar-y vehicle from a big studio. For the star of Deepwater Horizon, it was another solid job between the last big job and the next big job. By the way, Proud Mary opens from Screen Gems and Sony this Friday.", "images": ["https://web.archive.org/web/20180110181248im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F12%2Fall-the-money-in-the-world-dom-ATM_00848_r_rgb.jpg", "https://web.archive.org/web/20180110181248im_/https://specials-images.forbesimg.com/imageserve/59b90c9ad2ec4e5a8c9d58cf7a5c7bbf/400x400.jpg?fit=scale&background=000000", "https://web.archive.org/web/20180110181248im_/https://blogs-images.forbes.com/scottmendelson/files/2017/12/all-the-money-in-the-world-dom-ATM_00848_r_rgb.jpg?width=960", "https://web.archive.org/web/20180110181248im_/https://2.gravatar.com/avatar/5e0887272964be6b258946209a00ffa2?s=400&#038;d=mm&#038;r=g"], "top_img": "https://web.archive.org/web/20180110181248im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F12%2Fall-the-money-in-the-world-dom-ATM_00848_r_rgb.jpg", "keywords": [], "authors": ["Scott Mendelson"], "canonical_link": "https://web.archive.org/web/20180110181248/https://www.forbes.com/sites/scottmendelson/2018/01/10/the-cruel-reason-michelle-williams-was-paid-1500x-less-than-mark-wahlberg/", "title": "The Cruel Reason Michelle Williams Earned 0.07% Of Mark Wahlberg's Pay For 'All The Money In The World' Reshoots", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "The Cruel Reason Michelle Williams Earned 0.07% Of Mark Wahlberg's Pay For 'All The Money In The World' Reshoots", "image": "https://web.archive.org/web/20180110181248im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F12%2Fall-the-money-in-the-world-dom-ATM_00848_r_rgb.jpg", "updated_time": "2018-01-10T11:42:52-05:00", "url": "https://web.archive.org/web/20180110181248/https://www.forbes.com/sites/scottmendelson/2018/01/10/the-cruel-reason-michelle-williams-was-paid-1500x-less-than-mark-wahlberg/", "description": "For Michelle Williams, 'All The Money In The World' was a rare major studio leading role in an industry that gives male actors like Mark Wahlberg plentiful star vehicle opportunities.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "The Cruel Reason Michelle Williams Earned 0.07% Of Mark Wahlberg's Pay For 'All The Money In The World' Reshoots", "description": "For Michelle Williams, 'All The Money In The World' was a rare major studio leading role in an industry that gives male actors like Mark Wahlberg plentiful star vehicle opportunities.", "image": "https://web.archive.org/web/20180110181248im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F12%2Fall-the-money-in-the-world-dom-ATM_00848_r_rgb.jpg", "creator": "@scottmendelson"}, "description": "For Michelle Williams, 'All The Money In The World' was a rare major studio leading role in an industry that gives male actors like Mark Wahlberg plentiful star vehicle opportunities.", "author": "Scott Mendelson", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Scott Mendelson", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/2595-46920", "published": "2018-01-10", "modified": "2018-01-10"}}, "movies": [], "publish_date": 1515513600.0, "source": "https://web.archive.org", "summary": ""}