{"url": "www.redbookmag.com/life/news/a41597/george-clooney-amal-divorce/", "text": "Poor Amal Clooney has apparently been so bummed about the state of her marriage that she's been spending her nights wallowing with her closest confidantes: Johnnie Walker and Jose Cuervo.\n\nKidding, kidding. Her spirit of choice is vodka and she'd never be seen sipping Cuervo. Her hubby is an investor in Casamigos. But, according to reports in OK! magazine, the ever-lovely international human rights lawyer and general badass being, has been spotted kicking back cocktails with friends in London, telling them just how les mis her relationship is.\n\nSome source who was lucky enough to have an Amal sighting told OK! \"When she got tipsy, she talked a lot about her marriage and her life. It's pretty obvious that she's not very happy. She seemed relieved to be away from George.\"\n\nSure, this may have conceivably happened, but what woman doesn't blow off steam occasionally with her gal pals? IMHO that doesn't mean they're headed for divorce, as the tabloid suggests.\n\nAmal, who has shared 15 months of holy matrimony with the world's former most notorious bachelor, evidently bemoaned that she \"no longer has a life of her own.\" Okay, as any relationship expert will tell you, having your own identity is one of the keys to a thriving marriage, so if it's true, than we feel for her.\n\n\"She's living in his world now. Add that to the stress of trying to get pregnant, and the couple have been bickering lately.\" Stars. They're just like us.\n\nThough this is not the first time we've heard that Amal isn't exactly keen on George's lifestyle—evidently she thinks George's best mate, Rande Gerber and his wife Cindy Crawford, aren't up to her \"intellectual caliber,\" (ouch! Those insiders are harsh). She also hates how they encourage George's boozy ways.\n\nShe reportedly \"freaked\" after Cindy shared the tale of a drunk George hopping into bed with her after a rowdy night. Yeah, I'd be annoyed too if my husband stole the covers from a super model even if I was Amal, a certifiable Goddess.\n\nThe insider further claims that Amal was recently dropped as a legal counsel in a case she'd been working at furiously.\n\n\"It's a crushing blow for her. She fears she is not being taken seriously as a lawyer since marrying George,\" the source told OK!\n\nThese were amongst the hot topics overheard when she was seen \"crying and drinking like a fish.\"\n\nThe magazine concludes that the pair could be just weeks away from signing the divorce papers. Luckily, George knows a good lawyer.\n\nBad joke aside, here's what really matters. If they split, our lives won't change one bit, but Amal is changing lives. While papers are profiting on their relationship, Amal is starting scholarships so young Lebanese women can get better educations. And George does all types of philanthropic stuff, besides his tequila biz, which is charity enough for us, frankly. So that's our dose of daily perspective for ya. Now, back to more entertaining matters.", "images": ["https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x1024/landscape-1450827678-gettyimages-498133344.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x1024/landscape-1450827678-gettyimages-498133344.jpg?resize=1200:*", "keywords": [], "authors": ["Brie Schwartz", "Deputy Editor", "As Deputy Editor", "Brie Oversees Oprahmag.Com'S Lifestyle Content Including Beauty", "Style", "Health"], "canonical_link": "https://www.redbookmag.com/life/news/a41597/george-clooney-amal-divorce/", "title": "Apparently Amal Is Leaving George Clooney", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Redbook", "title": "Apparently Amal Is Leaving George Clooney", "description": "At least the description is colorful.", "url": "https://www.redbookmag.com/life/news/a41597/george-clooney-amal-divorce/", "image": {"identifier": "https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x1024/landscape-1450827678-gettyimages-498133344.jpg?resize=1200:*", "width": 1200, "height": 600}}, "article": {"publisher": "https://www.facebook.com/REDBOOK", "modified_time": "2017-10-16 07:05:00", "published_time": "2015-12-23 12:47:00", "section": "Life", "opinion": "false"}, "fb": {"pages": 28984400018}, "twitter": {"site": "@redbookmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x1024/landscape-1450827678-gettyimages-498133344.jpg?resize=640:*"}, "google-site-verification": "pxYubggO01HJx1UDQZHKjcy54bRW9HJUCPrYEQV4Ntk", "title": "Amal Is Reportedly Leaving George Clooney", "description": "At least the description is colorful.", "keywords": "george clooney, george clooney wife, how old is george clooney, amal alamuddin, amal", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x2048/square-1450827678-gettyimages-498133344.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Life,life,amal,george clooney", "sailthru.date": "2015-12-23T00:47:00Z", "sailthru.image.full": "https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x1024/landscape-1450827678-gettyimages-498133344.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/rbk.h-cdn.co/assets/15/52/2048x2048/square-1450827678-gettyimages-498133344.jpg", "sailthru.socialtitle": "Apparently Amal Is Leaving George Clooney", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1450846020.0, "source": "http://www.redbookmag.com", "summary": ""}