{"url": "http://time.com/money/5083915/hoda-kotb-salary-net-worth/", "text": "Longtime NBC anchor Hoda Kotb is potentially poised for a big payday after it was announced Tuesday that she would be replacing Matt Lauer as the co-host of the Today show.\n\nThe 53-year-old NBC correspondent, who has been co-hosting the Today show’s fourth hour with Kathie Lee Gifford since 2008, will now join Guthrie as host between 7 a.m. to 9 a.m. Kotb will also continue co-hosting with Gifford.\n\nKotb’s salary could get a big boost after her promotion. She has been filling in for Lauer since he was fired over sexual misconduct allegations in November. During Lauer’s tenure in the same role, he reportedly earned around $20 million a year, according to the New York Daily News, with his net worth estimated at $60 million.\n\nAn official from NBC did not respond to a request for comment about the salaries of Today show anchors. On Wednesday, some news outlets, including the Hollywood Reporter, reported Kotb’s salary could be up to $7 million a year — which is reportedly the same as Guthrie’s salary.\n\nWith Lauer’s ouster, Megan Kelly became NBC’s highest-paid anchor. She earns between $15 million and $20 million for her program, according to several media outlets. The former Fox News anchor now hosts Megyn Kelly Today in the mornings.\n\nKotb’s net worth is currently around $12 million, according to an Oct. 2016 report from GoBankingRates.com. Her Today show co-anchor Savannah Guthrie has a net worth of $2 million, according to that same report, but signed a new contract with NBC after that number was estimated. It’s possible her new contract includes a higher salary.\n\nKotb first joined NBC News in 1998 as a correspondent for “Dateline,” and began co-hosting the Today show’s fourth hour a decade later. During her tenure at NBC, Kotb regularly filled in on the Today show, and she served as co-anchor during the interim period after Lauer’s termination.\n\nOutside of her roles at NBC, Kotb is a New York Times bestselling author, with three books published on a range of topics including inspirational life stories as well as a detailed account of her battle with breast cancer back in 2007. She also penned a children’s book called I’ve Loved You Since Forever, which is coming out in March. Kotb said it’s inspired by her 11-month-old daughter Haley Joy, who she adopted in early 2017.\n\nKotb, who is dating financier Joel Schiffman, recently shared a sweet Instagram picture of them getting into the “Christmas spirit” with Haley Joy.\n\nKotb began her career in broadcasting as a news assistant with CBS in Egypt, and, several years later, served as an anchor and reporter for WWL-TV in New Orleans. Now a household name, Kotb has appeared as herself in a number of television shows, including 30 Rock, Law & Order: Special Victims Unit and Girlfriends’ Guide to Divorce.\n\nAs for Kotb’s new role at NBC, it appears her fellow Today show colleagues are excited for her to join them.\n\n“We are kicking off the year right, because Hoda is officially the co-anchor of Today,” Guthrie said during Tuesday morning’s broadcast. “This has to be the most popular decision NBC News has ever made, and I am so thrilled.”\n\nAl Roker also shared a “hearty” congratulations with Kotb Tuesday with a photo of the two of them and Guthrie in the anchor seat at 30 Rock.\n\n“I’m pinching myself,” Kotb said.", "images": ["https://moneydotcomvip.files.wordpress.com/2018/01/hoda-kotb-today-show.jpg?quality=85", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "http://time.com/img/navigation/subscribe-icon.svg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/01/hoda-kotb-today-show.jpg?quality=85", "keywords": [], "authors": ["Jennifer Calfas"], "canonical_link": "https://money.com/hoda-kotb-salary-net-worth/", "title": "Hoda Kotb Is Due for a Big Raise Now That She's Replacing Matt Lauer on the Today Show", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Media,onetime", "news_keywords": "hoda kotb, hoda kotb net worth, hoda kotb salary, hoda kotb daughter, how much does hoda kotb make a year, hoda kotb age, hoda hotb today show, matt lauer net worth, matt lauer salary, savannah guthrie hoda kotb", "description": "Longtime NBC anchor Hoda Kotb was promoted to co-anchor the Today show after Matt Lauer's ouster. Here's what we know about her new salary", "og": {"title": "Hoda Kotb Is Due for a Big Raise Now That She's Replacing Matt Lauer on the Today Show", "type": "article", "site_name": "Money", "url": "https://money.com/hoda-kotb-salary-net-worth/", "description": "Lauer reportedly made $20 million a year", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/01/hoda-kotb-today-show.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/hoda-kotb-salary-net-worth/", "description": "Longtime NBC anchor Hoda Kotb was promoted to co-anchor the Today show after Matt Lauer's ouster. Here's what we know about her new salary", "media": "https://moneydotcomvip.files.wordpress.com/2018/01/hoda-kotb-today-show.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/hoda-kotb-salary-net-worth/", "title": "Hoda Kotb Is Due for a Big Raise Now That She's Replacing Matt Lauer on the Today Show", "description": "Lauer reportedly made $20 million a year", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/01/hoda-kotb-today-show.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}