{"url": "https://people.com/music/steve-nicks-emotional-speech-tom-petty/", "text": "Stevie Nicks started to choke up as she gave a touching speech about her late friend Tom Petty during a pre-Grammys tribute event on Friday.\n\n“The loss of Tom Petty has just about broken my heart,” Nicks, 69, said at the MusiCares Person of the Year event honoring Fleetwood Mac at Radio City Music Hall in New York City.\n\nGet push notifications with news, features and more.\n\nImage zoom Kevin Mazur/Getty Images\n\n“He was not only a good man to go down the river with, as Johnny Cash said, he was a great father and he was a great friend,” she added, after noting that his daughter Adria Petty was in the audience. “He was one of my best friends. My heart will never get over this.”\n\nImage zoom Fleetwood Mac Matt Baron/REX/Shutterstock\n\nNicks also went on to reveal how after the ceremony last year — where Petty was the night’s honoree — the late singer spent a lot of time “talking to me about how important it was to him. And maybe he was talking about it because [he] was ill. He was not well.”\n\n“And he fought his way through that tour,” Nicks continued, referencing the 40th anniversary tour with the Heartbreakers that Petty embarked on in 2016, and finished just one week before he died on Oct. 2 of that year.\n\n“He should’ve canceled, and he should’ve just gone home and gone to the hospital. But not Tom. He was gonna go down that river. And so, God bless him, he finished his tour at the Hollywood Bowl. Three shows. And one week later he died — but he got down the river,” she added as she began to choke up. “So Tom, I know you’re standing next to me cause you always have been for so many years.”\n\nRELATED VIDEO: Tom Petty Died of an ‘Accidental Drug Overdose’, Family Confirms\n\nThe event was also attended by Harry Styles, Lorde, Imagine Dragons, Bill and Hillary Clinton and Miley Cyrus.\n\nPrevious winners at the pre-Grammys tribute event have included Sir Elton John, Bono, Paul McCartney, Bruce Springsteen, Barbra Streisand, Bob Dylan and Petty.\n\nImage zoom Miley Cyrus (left) and Stevie Nicks Kevin Mazur/Getty Images\n\nEarlier in January, it was revealed that Petty died of an accidental drug overdose.\n\nIn a statement posted on the late singer’s website, his family said the 66-year-old had been using a number of medications, including opioid pain medication fentanyl.\n\nPetty died of “multi-system organ failure” caused by “mixed drug toxicity,” according to the autopsy report released by the Los Angeles County Coroner. During an examination on Oct. 3, the medical examiner found fentanyl, oxycodone, temazepam, alprazolam, citalopram, acetylfentanyl and despropionyl fentanyl. Petty was also suffering from coronary artery atherosclerosis and emphysema.\n\n“Our family sat together this morning with the Medical Examiner – Coroner’s office and we were informed of their final analysis that Tom Petty passed away due to an accidental drug overdose as a result of taking a variety of medications,” Petty’s family said in a statement, signed by widow Dana and daughter Adria, 42.\n\nImage zoom Tom Petty Streeter Lecka/Getty\n\nPetty’s longtime manager previously released a statement at the time of the musician’s death explaining that Petty suffered cardiac arrest at his home in Malibu, California, on Oct. 2 and was taken to UCLA Medical Center but could not be revived.\n\n“Unfortunately Tom’s body suffered from many serious ailments including emphysema, knee problems and most significantly a fractured hip. On the day he died he was informed his hip had graduated to a full-on break and it is our feeling that the pain was simply unbearable and was the cause for his overuse of medication,” the family said in their January statement.\n\nRELATED: The Soundtrack of Our Lives: A Brief History of Tom Petty’s Songs in Movies and TV\n\n“We knew before the report was shared with us that he was prescribed various pain medications for a multitude of issues including fentanyl patches and we feel confident that this was, as the coroner found, an unfortunate accident,” the family continued.\n\n“As a family we recognize this report may spark a further discussion on the opioid crisis and we feel that it is a healthy and necessary discussion and we hope in some way this report can save lives. Many people who overdose begin with a legitimate injury or simply do not understand the potency and deadly nature of these medications,” the Petty family said.\n\nThey added, “On a positive note we now know for certain he went painlessly and beautifully exhausted after doing what he loved the most, for one last time, performing live with his unmatchable rock band for his loyal fans on the biggest tour of his 40 plus year career. He was extremely proud of that achievement in the days before he passed.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Ftom-petty-41.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-b-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ffleetwood-mac-b-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-1.jpg", "keywords": [], "authors": ["Ale Russian", "Maria Pasquini"], "canonical_link": "https://people.com/music/steve-nicks-emotional-speech-tom-petty/", "title": "Stevie Nicks Gives Emotional Speech Remembering Tom Petty: ‘He Was One of My Best Friends’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Grammy Awards,Miley Cyrus,Music News,News,Stevie Nicks,Tom Petty", "news_keywords": "Grammy Awards,Miley Cyrus,Music News,News,Stevie Nicks,Tom Petty", "description": "“The loss of Tom Petty has just about broken my heart,” Stevie Nicks said as she spoke about her late friend during a pre-Grammys tribute event", "og": {"title": "Stevie Nicks Gives Emotional Speech Remembering Tom Petty: ‘He Was One of My Best Friends’", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/steve-nicks-emotional-speech-tom-petty/", "description": "Stevie Nicks&nbsp;started to choke up as she gave a touching speech about her late friend Tom Petty during a pre-Grammys tribute event on Friday. “The&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/steve-nicks-emotional-speech-tom-petty/", "description": "“The loss of Tom Petty has just about broken my heart,” Stevie Nicks said as she spoke about her late friend during a pre-Grammys tribute event", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/steve-nicks-emotional-speech-tom-petty/", "title": "Stevie Nicks Gives Emotional Speech Remembering Tom Petty: ‘He Was One of My Best Friends’", "description": "“The loss of Tom Petty has just about broken my heart,” Stevie Nicks said as she spoke about her late friend during a pre-Grammys tribute event", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fstevie-nicks-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}