{"url": "www.billboard.com/articles/columns/pop/8458025/taylor-swift-reputation-tour-b-stage-songs-list", "text": "Taylor Swift performs onstage during the Reputation Stadium Tour at NRG Stadium on Sept. 29, 2018 in Houston, Texas.\n\nTaylor Swift's Reputation-heavy tour set list features almost all the songs from her latest album, plus many of her previous hit singles. But the show, which she debuted on May 8, also delivers a surprise song on each tour stop. Swift's nightly choices have run the gamut from fan favorite \"All Too Well\" to career throwback \"Teardrops on My Guitar.\"\n\nWhile most of Swift's performance is based on the main stage, she makes her way back to two smaller B-stages, giving more fans a chance to see her up close. There, she performs \"Shake It Off,\" \"Dancing With Our Hands Tied,\" \"Blank Space\" and \"Dress\" -- as well as the surprise song of the night on acoustic guitar.\n\nBelow, check out the list of all the special songs she's brought to the Reputation Tour B-stage. Luckily, Swifties in the crowd have been quick to upload clips of these rare live cuts.\n\n\"All Too Well\"\n\nGlendale, Ariz., May 8; Pasadena, Calif., May 19; Arlington, Texas, Oct. 6\n\nIt's no secret among Swift fans that the emotional Red stand-out \"All Too Well\" is widely cherished. What better surprise to sprinkle into the set list on the opening night of tour, then? \"I figured...I would play this song you seem to request more than the others,\" she said, introducing the beautiful tearjerker.\n\nA post shared by Simone (@simoneyybaloneyy) on May 9, 2018 at 12:38am PDT\n\n\"Wildest Dreams\"\n\nSanta Clara, Calif., May 11; Tokyo, Japan, Nov. 21\n\nSwift once performed \"Wildest Dreams\" acoustic at a Grammys event, and she brought that raw, impassioned version of the 1989 song to the Reputation Stadium Tour B-stage twice -- first in Santa Clara, then on the final night of tour in Tokyo.\n\nA bit of Wildest Dreams from the 1st night in Santa Clara #repTourSantaClara #TaylorSwift pic.twitter.com/FyUCIyww9i — Erica Love (@Erica_Love16) May 13, 2018\n\n\"The Best Day\"\n\nSanta Clara, Calif., May 12\n\nOn Mother's Day weekend, Swift gifted her mom -- and, apparently, tour opener Camila Cabello's mom -- with this touching ode to the mother-daughter memories they've made. The sweet Fearless track is one that is rarely performed live.\n\nA post shared by taylor swift fan page (@taylorswift_gorgeous13) on May 13, 2018 at 2:48pm PDT\n\n\"Red\"\n\nPasadena, Calif., May 18\n\nThe Rose Bowl served as inspiration for Swift's B-stage surprise on her first of two nights at the venue. \"Roses are red,\" she mused. Cue an acoustic take on \"Red,\" the title track off of her 2012 album.\n\n\"Holy Ground\"\n\nSeattle, Wash., May 22\n\n\"Holy Ground\" is all about romanticizing the time you've shared with someone -- and an excellent selection to surprise an audience full of longtime, loyal fans with. \"Tonight I'm gonna dance for all that we've been through,\" she sings. \"But I don't wanna dance if I'm not dancing with you.\"\n\n@taylorswift13 sang Holy Ground in front of me so close she smiled at me she saw my outfit, my heart sign and smiled. I made eye contact. Incredible night so glad I decided to get a seat by one of the b stages! pic.twitter.com/qqxGCxguIa — Sammi May/REP hope to hug Taylor one day (@FearlessSammi13) May 23, 2018\n\n\"Teardrops on My Guitar\"\n\nDenver, Colo., May 25\n\nSwift's second single, released over a decade ago in 2007, is one she admitted she hasn't played \"in 100 years.\" The singer-songwriter went back to basics with an acoustic performance of her song about unrequited high school love, and the crowd sang along to every sentimental word.\n\nA post shared by shelbi --??-- (@_shelbirenee) on May 26, 2018 at 12:49am PDT\n\n\"Our Song\"\n\nChicago, June 1\n\nKicking it back to country, Swift surprised her fans on the Chicago B-stage with \"Our Song,\" her third single off her debut album. Based on this clip, the classic from her canon had just about everyone singing along. Will she \"play it again\"?\n\n\"22\"\n\nChicago, June 2; Foxborough, Mass., July 26; Sydney, Australia, Nov. 2\n\nSwift's friend Martha Hunt says she's the one who suggested \"22\" as the surprise song on night two in Chicago, and Swift credited the enthusiastic crowd at her first night in Foxborough for her decision to perform it again. It's not every day that you get \"22\" acoustic, but Swifties got it three times so far on this tour, the most recent of which came during a rain-heavy performance in Sydney.\n\n\"I Knew You Were Trouble\"\n\nManchester, England, June 8\n\nIt's unlikely that the Manchester crowd of Swifties did not know the lyrics to \"I Knew You Were Trouble,\" but the pop star offered some advice anyway: \"Even if you don't know the words, it's kind of easy to remember this one part.\" She led them in a practice round of the post-chorus \"oh, oh!\" and went on to deliver an acoustic rendition of the frenetic tune.\n\n\"I Don't Wanna Live Forever\"\n\nManchester, England, June 9\n\nThose who attended the second Taylor Swift stadium show in Manchester were in for a treat: a rare live performance of \"I Don't Wanna Live Forever,\" Swift's 50 Shades duet with Zayn.\n\n\"Mean\"\n\nDublin, Ireland, June 15\n\nPlaying \"Mean\" live is a sure crowd-pleaser, and Swift did just that at the first of two headlining shows in Dublin. Although the song was a mainstay back in her days touring in support of Speak Now and Red, this date marked the debut of \"Mean\" seeing the Reputation Stadium Tour stage.\n\n\"How You Get the Girl\"\n\nDublin, Ireland, June 16\n\n\"If you want to sing along, that would be absolutely glorious,\" Swift encouraged the crowd at her second night at Croke Park. She then smiled her way through a rare, acoustic performance of the 1989 track.\n\n\"So It Goes...\"\n\nLondon, England, June 22\n\nReputation album track \"So It Goes...\" has been noticeably absent from this tour's set list, making Swift's surprise addition to her Wembley Stadium set all the more special. With this acoustic treat, she perhaps hinted at what the song sounded like when she first wrote it.\n\n\"Fifteen\"\n\nLondon, England, June 23\n\nJune 23 marked Swift's fifteenth show on the Reputation Stadium Tour, so what better song to play? The country-pop Fearless single was an early hit for her -- and based on the crowd's reaction, it's still holds a place in fans' hearts.\n\n\"Mine\"\n\nLouisville, Ky., June 30\n\nThe opening track of Speak Now wrapped the June leg of Swift's Reputation Stadium Tour. \"I haven't played this song in so many years, and you're singing it so loud,\" she beamed from the B-stage.\n\n\"Sparks Fly\"\n\nColumbus, Ohio, July 7\n\nKeeping in the tradition of Speak Now, Swift moved onto the pop-country album's second track at her next tour stop. The song, about a classic crush that's so clearly a \"bad idea,\" was written when the singer was a teenager but held its own in a 2018 Taylor Swift set list.\n\n\"State of Grace\"\n\nLandover, Md., July 10\n\nFor the first of two nights in Maryland, Swift harkened back to the \"golden age of something good and right and real\" and the acoustic guitar beginnings of \"State of Grace,\" the opening track on her Red album.\n\nState of Grace + lights ??-- pic.twitter.com/EgJKAnTX6q — reptourpics (@reptourpics) July 11, 2018\n\n\"Haunted\"\n\nLandover, Md., July 11\n\nThe second Reputation Tour set in Maryland delivered a rare, understated performance of \"Haunted,\" a Speak Now track that hasn't seen Swift's stage much since 2011/2012 -- back when she gave it a decidedly more dramatic treatment.\n\n\"Never Grow Up\"\n\nPhiladelphia, Pa., July 13\n\nBefore strumming the chords of \"Never Grow Up,\" Swift explained that she'd just gone back to visit the nearby farm where she had actually grown up. \"I got especially emotional when I walked into my old bedroom,\" she admitted. She hinted she'd be playing the song with picture of herself in her childhood room on Instagram earlier in the day, and the performance that night took on an especially sentimental tone.\n\n\"Treacherous\"\n\nPhiladelphia, Pa., July 14\n\nAfter some technical difficulties that temporarily left Swift stranded at the main stage rather than floating in her cage over the crowd to the B-stage, she bestowed fans with a highlight from her Red album.\n\n-- | Another clip of Taylor singing Treacherous as the surprise song #repTourPhilly (via @lysst_) pic.twitter.com/Vx0RBjKXra — Taylor Swift News (@TSwiftNZBU) July 15, 2018\n\n\"Babe\"\n\nCleveland, Ohio, July 17\n\nA concert in Cleveland brought Swift's live debut of \"Babe,\" the Red-era-turned-2018-country-single she penned (with Train's Pat Monahan) that got away -- er, was given away, to Sugarland for their latest album.\n\n\"Welcome to New York\"\n\nEast Rutherford, N.J., July 20\n\nIt was Swift's first show in New Jersey on this tour, but she gave a little shout-out to its neighbor New York with her ode to the loud sounds, bright lights and new beginnings that the big city brings.\n\nTwitter is going to ruin the quality, but here’s welcome to New York!@taylorswift13 @taylornation13 pic.twitter.com/2tqifzR42K — Bekah (@volcanicheartt) July 21, 2018\n\n\"Fearless\"\n\nEast Rutherford, N.J., July 21\n\nThere's somethin' bout the way a Taylor Swift show feels in the rain, or so they say. Singing in the rain, Swift happily performed the title track of her second album while dancing \"in a storm in my best dress, fearless.\"\n\nFearless in the rain is the most magical thing ? pic.twitter.com/IaD5r16dxA — taylor videos (@swiftvids_) July 22, 2018\n\n\"Enchanted\"\n\nEast Rutherford, N.J., July 22\n\nDuring her third night at MetLife Stadium, Swift left fans \"Enchanted\" as they sang along to her acoustic take on the Speak Now track. First released in 2010, the song has rarely seen the live stage since 2011, when she was on her tour in support of that album.\n\nThis night is sparkling, don't you let it go --? #repTourMetlifepic.twitter.com/pDEaDyBmxx — daniela -- (@InviernoDe1989) July 23, 2018\n\n\"Change\"\n\nFoxborough, Mass., July 27\n\nAt the second of three nights playing Gillette Stadium -- which is where Swift had her first-ever stadium concert, back on the Fearless Tour in 2010 -- the star of the show dedicated \"Change\" to a fan she'd met at her meet and greet. That fan had told the singer how much the song meant to her, and it just so happened that Swift had already been thinking of adding it into her set. The stars aligned on this Friday night as the crowd was treated to a song that hasn't been performed live in years.\n\n\"Ours\"\n\nFoxborough, Mass., July 28\n\nSwift whipped out another rarity as the surprise B-stage song for her third and final show at Gillette Stadium: \"Ours.\" This concert date marked her tenth time performing at the stadium, where she was also the first female to ever to headline three shows in a row.\n\n\"Out of the Woods\"\n\nToronto, Aug. 3\n\nFor its tour debut, Swift introduced an emotional second bridge to her acoustic performance of 1989 standout \"Out of the Woods.\" \"Remember when we hit the brakes too soon?\" she called out again. \"Twenty stitches in a hospital room. You started crying, I did too.\"\n\nher out of the woods vocals paid all my bills pic.twitter.com/LqZzCJoYF4 — SARAH ---- // taylor swift -- (@swiftismydrug) August 4, 2018\n\n\"Come Back... Be Here\"\n\nToronto, Aug. 4\n\nNot only did Toronto get a surprise \"Summer of 69\" duet between Swift and Bryan Adams, but the crowd also got what was seemingly the singer's first-ever live performance of \"Come Back... Be Here,\" an underrated Red album bonus track.\n\nSo if we stop with all the drama for one sec: SHE SANG SO IT GOES!!!!!!! SHE SANG COME BACK BE HERE CAN YOU EVEN BELIEVE THAT WE PRAYED for this one for YEARS plus she brought BRYAN ADAMS WE REALLY ARE BLESSED skajjs think about all the good things----------#comebackbehere pic.twitter.com/ryLf1BL8od — noa/ london night 1 (@swiftienoa) August 5, 2018\n\n\"A Place in This World\"\n\nPittsburgh, Pa., Aug. 7\n\nSwift surprised fans in her home state with a performance of her Pennsylvanian-written song “A Place in this World” -- a rare album cut from her 2006 debut album, Taylor Swift. This special throwback quickly become a favorite out of all the unexpected songs Swift has performed thus far.\n\nA place in this world -- it was absolutely amazing to watch her perform this so close to us @taylorswift13 @taylorswift13 #taylornation #taylorswift #reptourPittsburgh pic.twitter.com/UV5BFt1Kxb — Kelly Nicholson Reptour 8/7/18 -- (@Kelbe114) August 9, 2018\n\n\"This Love\"\n\nAtlanta, Ga., Aug. 10\n\nDuring the first of a two-night stint in Atlanta, Swift admitted it was the first time she'd ever performed an acoustic cut of \"This Love,\" which she once said was the one 1989 track she kept listening \"back to, over and over and over again.\" In the interview, the singer added, \"It's kind of like hypnotic in a way, and it kind of is somewhat romantic and wistful and relaxing.\"\n\nan acoustic version of this love is the best thing that’s ever happened to me pic.twitter.com/Lmcu3jP6v1 — crystal-- (@swiftsmicheIe) August 11, 2018\n\n\"The Lucky One\"\n\nAtlanta, Ga., Aug. 11\n\nIt was back to the era of Red at Swift's second show in Atlanta, where she played \"The Lucky One\" on the B-stage. The song, about the highs and lows of fame, hasn't been heard live recently, though it was a mainstay on the Red Tour.\n\nTaylor singing The Lucky One #repTourAtlanta @taylorswift13 you were amazing last night . ??---- pic.twitter.com/y2AEUstTZm — CelebSheep (@CelebSheep) August 12, 2018\n\n\"Invisible\"\n\nTampa, Fla., Aug. 14\n\nBringing \"Invisible\" to the stage in 2018 is about as unheard of as it gets from the canon of Taylor Swift. Not only is the song from the era of Swift's debut album, but it's a bonus track from the deluxe version of that album. She reportedly brought \"Invisible\" back to life on a Tuesday in August for a fan who told her the song helped him come out when he was a teenager.\n\ntaylor swift singing invisible in 2018 i’m so blessed pic.twitter.com/gFD0Qsanrc — taylor swift vocals (@tswiftvocals) August 15, 2018\n\n\"Breathe\"\n\nMiami, Fla., Aug. 18\n\n\"I'm 99 percent sure I've never played this song live,\" Swift admitted before performing \"Breathe,\" a deep cut from her Fearless album. The album recording of the country-pop ballad features vocals from Colbie Caillat, meaning this live solo surprise was a one-of-a-kind thing for fans to experience.\n\n\"Better Man\"\n\nNashville, Aug. 25\n\nSwift says she wanted \"Better Man\" to \"have its own moment,\" and it certainly did -- at the Grammys, the CMAs and at Nashville's Bridgestone Arena, where she treated the crowd to a rare solo performance of the beautiful song that was written by her, but recorded by country group Little Big Town.\n\nI wish you were a Better Man... #repTourNashville pic.twitter.com/NIYJLy1POU — Taylor Nation (@taylornation13) August 26, 2018\n\n\"Jump Then Fall\"\n\nDetroit, Mich., Aug. 28\n\nThe pop star unveiled the rare gem from the re-release of Fearless in Detroit, marking the first time she performed \"Jump Then Fall\" in eight years. Her delivery of the love song is just as bubbly and bouncy as ever before.\n\n\"Begin Again\"\n\nMinneapolis, Minn., Aug. 31\n\nIn another return to her country roots, Swift strummed a pretty \"Begin Again\" at the first of two nights at U.S. Bank Stadium, the tour stop where she played the closing track from her Red album for the first time in 2018.\n\nAug 31 2018\n\nRep Tour Minneapolis (Night 1). ? Begin Again. pic.twitter.com/aBWTRGN68e — bru -- (@wildest_dr) September 1, 2018\n\n\"Tied Together With a Smile\"\n\nMinneapolis, Minn., Sept. 1\n\nFor some reason Swift seemed surprised at the number of people in the crowd who knew the words to this \"really, really old\" song, found on her first album. \"One thing I have noticed in my life is you can never judge what somebody else is going through,even if they seem like they have it all together,\" she said while introducing the track that probably hasn't been played live in more than 10 years.\n\nTied together with a smile. One of my favorites!! #repTourMinneapolis #TaylorSwift pic.twitter.com/NHpFjYFmZU — Lisa C...yourself to a Taylor show | 08/31 & 09/01 (@creek22) September 2, 2018\n\n\"The Story of Us\"\n\nKansas City, Mo., Sept. 8\n\n\"There's a song that I haven't played since the Speak Now Tour,\" Swift teased just before thrilling her longtime fans with an acoustic rendition of \"The Story of Us,\" a song she wrote about an awkward run-in with an ex for 2010's Speak Now.\n\nTaylor Swift’s Story of Us throwback last night in Kansas City hitting me with A L L the feels ---- pic.twitter.com/hp22mFygIQ — Emily (@EmilyKae_) September 10, 2018\n\n\"Forever & Always\"\n\nIndianapolis, Ind., Sept. 15\n\nIn what amounted to a passion-filled sing-along, the country-turned-pop star offered the Fearless album track \"Forever & Always,\" a song she recalled writing around the age of 18, as her acoustic surprise on the B-stage in Indianapolis.\n\n\"Hey Stephen\"\n\nSt. Louis, Mo., Sept. 18\n\nSwift rarely performs this Fearless album oldie from 2008, but decided to throw it back as she took to the B-stage of her Reputation Tour stop in Missouri.\n\nI got a front row seat for “Hey, Stephen” and I cried so many happy tears. She really has been my inspiration since I was little, and I love her more than words can say. Thank you, Taylor -- #repTourSTL pic.twitter.com/cGnKTJyRsy — h -- (@vHannahGraycev) September 19, 2018\n\n\"Speak Now\"\n\nNew Orleans, Sept. 22\n\n\"I've never actually interrupted a wedding,\" Swift assured the crowd in New Orleans, teasing the next song on her set list, the title track of her 2010 album. Before bringing \"Speak Now\" to the B-stage that night, the pop star explained that many of her early songs were written about imaginary scenarios.\n\n-- | Taylor singing ‘Speak Now’ as the surprise song #repTourNOLA (via tanyacstipe on Insta) pic.twitter.com/iUZMPk3MA6 — Taylor Swift News (@TSwiftNZMedia) September 23, 2018\n\n\"Wonderland\"\n\nHouston, Texas, Sept. 29\n\n\"Wonderland\" is a track that appeared only on the deluxe version of Swift's 1989 album, and it's one that Swift hasn't performed live all that often. Still, she shouldn't have been surprised that her fans would be singing right along with her, loud and clear.\n\n@taylorswift13 SANG WONDERLAND LAST NIGHT AND IM HAVING MAJOR FOMO THAT I WAS NOT THERE TO WITNESS THIS MAJESTIC SONG LIVE ----‍??--‍??------?--------#RepTourHouston pic.twitter.com/b5NLzW91ze — Michelle (@MichelleOB13) September 30, 2018\n\n\"White Horse\"\n\nArlington, Texas, Oct. 5\n\nWatch the clip below and you'll see it's safe to say most of the crowd at this show knew the words to the Fearless classic \"White Horse,\" Swift's surprise acoustic song of the night. (Those at the show were lucky enough to get another treat on the main stage, too: Maren Morris joined the superstar for a duet of \"The Middle.\")\n\nSo taylor sang white horse last night -- pic.twitter.com/811EJZPVLy — It's Celeste 🙂 (@CelesteJade30) October 6, 2018\n\n\"I Knew You Were Trouble\"\n\nPerth, Australia, Oct. 19\n\nSwift harkened back to past times in Perth with a special acoustic performance of \"I Knew You Were Trouble,\" a song that was part of her Red Tour set list. The pop star played in the city back in 2013.\n\n\"I'm Only Me When I'm With You\"\n\nMelbourne, Australia, Oct. 26\n\n\"I wrote this song when I was 13 years old, and it was a bonus track on my first album,\" Swift said before launching into a performance of the track from her self-titled 2006 debut. The song is reportedly about her friend Abigail Anderson, and Swift later was a bridesmaid in her wedding.\n\nTaylor singing “I’m Only Me When I’m With You” on the b-stage! #repTourMelbourne pic.twitter.com/YViF9YWddl — Taylor Swift Updates (@TSwiftLAMedia) October 26, 2018\n\n\"Starlight\"\n\nBrisbane, Australia, Nov. 6\n\nSwift brought out \"Starlight\" -- from her 2012 AOTY-nominated Red -- on her third date in Australia. She has previously noted that the song was largely inspired by Ethel and Bobby Kennedy's young romance.\n\n\"Out of the Woods\"\n\nAuckland, New Zealand, Nov. 9\n\nCo-written by Jack Antonoff, \"Out of the Woods\" was the sixth official single from 1989 and later peaked at No. 18 on the Billboard Hot 100. Strumming away, Swift showcases her impressive vocal in the acoustic rendition of the track.\n\n\"I Know Places\"\n\nTokyo, Japan, Nov. 20\n\nTaking another cut from 1989, Swift most recently debuted \"I Know Places\" as the surprise b-stage track. The song addresses the difficulties of maintaining any sort of privacy in her relationships, especially with media outlets waiting at every corner.\n\nTaylor singing “I Know Places” as the surprise b-stage song #repTourTokyo\n\npic.twitter.com/nyvPjoIFKf — Taylor Swift Updates (@TSwiftLAMedia) November 20, 2018\n\nThis list will be updated as the Reputation Stadium Tour goes on.", "images": ["https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?4863e69cb9d656c61185", "https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/taylor-swift-reputation-tour-sept-29-2018-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg"], "top_img": "https://static.billboard.com/files/media/taylor-swift-reputation-tour-sept-29-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.billboard.com/articles/columns/pop/8458025/taylor-swift-reputation-tour-b-stage-songs-list", "title": "All the Surprise Songs Taylor Swift Has Performed On Her Reputation Stadium Tour B-Stage (So Far)", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-11-21T09:23:35-05:00", "published_time": "2018-11-20T14:16:28-05:00"}, "description": "Taylor Swift's Reputation Stadium Tour delivers a surprise song on each tour stop. Luckily, fans have been quick to upload clips of these rare live performances.", "og": {"description": "Taylor Swift's Reputation Stadium Tour delivers a surprise song on each tour stop. Luckily, fans have been quick to upload clips of these rare live performances.", "image": {"identifier": "https://static.billboard.com/files/media/taylor-swift-reputation-tour-sept-29-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Taylor Swift's Reputation Tour B-Stage: Songs She Has Surprised Fans With | Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/pop/8458025/taylor-swift-reputation-tour-b-stage-songs-list", "site_name": "Billboard"}, "title": "All the Surprise Songs Taylor Swift Has Performed On Her Reputation Stadium Tour B-Stage (So Far)", "twitter": {"card": "summary_large_image", "description": "Taylor Swift's Reputation Stadium Tour delivers a surprise song on each tour stop. Luckily, fans have been quick to upload clips of these rare live performances.", "image": "https://static.billboard.com/files/media/taylor-swift-reputation-tour-sept-29-2018-billboard-1548-1024x677.jpg", "title": "All the Surprise Songs Taylor Swift Has Performed On Her Reputation Stadium Tour B-Stage (So Far)", "site": "@billboard"}}, "movies": [], "publish_date": 1542741388.0, "source": "http://www.billboard.com", "summary": ""}