{"url": "https://people.com/royals/meghan-markle-thomas-doria-ragland-letter-not-speaking-letter/", "text": "On the outs with daughter Meghan Markle, Thomas Markle had hoped her mother Doria Ragland could shed some light on the situation, he said in a new interview with The Mail on Sunday.\n\n“I even hand-delivered a letter to Doria asking her why our daughter won’t speak to me,” Thomas, 74, told the publication.\n\nGet push notifications with news, features and more.\n\nWriting to Doria, 62, is one of several ways that Thomas has tried to connect with Meghan, 37.\n\n“I have sent several texts. Her number hasn’t changed and they haven’t bounced back,” he said of Meghan, who is expecting a baby with husband Prince Harry in the spring. “I’ve pleaded with her to pick up the phone. I wrote her a two-page letter and sent it by certified mail via her representative in Los Angeles. I asked her why she was believing the lies.”\n\nRELATED: Christmas at Kensington Palace! See the Stunning Tree Outside William, Kate, Harry & Meghan’s Home\n\nImage zoom Meghan Markle and mother Doria Ragland in 2015 Sylvain Gaboury/Patrick McMullan/Getty Images\n\nAccording to Thomas, Meghan and Harry, 34, have declined to get in touch. “I have made dozens of attempts to reach my daughter via text and letters, but she and Harry have put up a wall of silence,” he said.\n\n“I have been frozen out and I can’t stay silent,” he added.\n\nMeanwhile, his ex-wife has remained close with Meghan as their daughter settles into royal life six months after her wedding to Harry. In September, Doria tagged along when Meghan hosted a palace lunch for the first time, and she may also celebrate Christmas with the royal family after reportedly being invited by the Queen.\n\nAfter publicly wavering on the decision, Thomas did not attend Meghan’s wedding in May, citing heart problems. In his absence, Prince Charles stepped in and walked Meghan down the aisle after she “sadly” confirmed days before the nuptials that Thomas would not be attending the wedding as originally planned.\n\nThomas has since made controversial statements about his daughter, such as declaring that Meghan seemed “terrified” of her new duties in July and comparing the royal family to a “cult” in August. Also that month, Thomas admitted that he lied to Harry about staged paparazzi photos as the couple was preparing for their special day.\n\n“It was very wearing on her,” a source told PEOPLE in September of the family drama that preceded the nuptials. “It’s her private life.”\n\nImage zoom Meghan Markle and father Thomas Markle Max Mumby/Indigo/Getty Images; Good Morning Britain/ITV\n\nThomas suggested that the conflict has been wearing on him, too. “My life has been turned upside down since my daughter met Harry,” he told The Mail on Sunday. “Their treatment of me is harsh, hurtful and unforgiving. I’m being punished for things I didn’t say.”\n\nIn the new interview, Thomas asserted that he and Meghan had a good relationship before she became a duchess.\n\n“People are trying to rewrite history,” he told the outlet. “Meghan and I were as close as a father and daughter could be right up until her wedding to Harry. Then it all fell apart.”\n\nImage zoom Doria Ragland, Meghan Markle and Prince Harry BEN STANSALL/AFP/Getty\n\nHe pointed to the cards that Meghan used to send him. “I loved getting cards from Meghan,” he said. “She wrote me hundreds of little cards and notes through the years. Sometimes they were for special occasions, other times just little notes she would leave around the house. I’ve still got a Post-It Note on my fridge which says, ‘I love you Daddy.’ I see it every day. I got a card every Valentine’s Day.”\n\nThomas told The Mail on Sunday that “maybe” he will get to see Meghan again “some day.”\n\nThomas also spoke about his upcoming grandchild after saying in October that he considered Meghan’s pregnancy “overwhelming and joyful.”\n\n“If she would just speak to me, things could be different. I love Meghan very much,” he said. “I want her and Harry to have a beautiful, healthy baby and a great life.”\n\nHe touched on reports that Kate Middleton and Meghan have feuded, which Kensington Palace has denied. PEOPLE previously confirmed that Kate was “left in tears” following a fitting for her daughter Princess Charlotte‘s bridesmaid dress ahead of Meghan’s wedding.\n\nRELATED: Meghan Markle and Prince Harry Secretly Snuck in a Christmas Celebration to Their Royal Duties\n\nImage zoom Meghan Markle with father Thomas Markle when she was a baby Source: Meghan Markle/Instagram\n\nA source told veteran royals reporter Camilla Tominey of The Daily Telegraph, “Kate had only just given birth to Prince Louis and was feeling quite emotional” — though just what upset her is unclear. Several insiders have told PEOPLE that there was a notable amount of “stress” surrounding those involved in the wedding.\n\n“The Meghan I know was always sweet, kind, generous,” Thomas said. “She was always demanding but never rude.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fmeghan-markle-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fmeghan-markle-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fmegahn-markle-6.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fmeghan-thomas-markle-1-2000c-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmeghan-markle-15.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fmeghan-markle-2000.jpg", "keywords": [], "authors": ["Emily Zauzmer"], "canonical_link": "https://people.com/royals/meghan-markle-thomas-doria-ragland-letter-not-speaking-letter/", "title": "Thomas Markle Asked Why Meghan 'Won't Speak to Me'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "British Royals,Doria Ragland,Meghan Markle,News,Royal News", "news_keywords": "British Royals,Doria Ragland,Meghan Markle,News,Royal News", "description": "Thomas Markle tells The Mail on Sunday that he \"even hand-delivered a letter.\"", "og": {"title": "Thomas Markle Says He Wrote to Doria Ragland Asking Why Daughter Meghan 'Won't Speak to Me'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/royals/meghan-markle-thomas-doria-ragland-letter-not-speaking-letter/", "description": "On the outs with daughter&nbsp;Meghan Markle, Thomas Markle&nbsp;had hoped her mother Doria Ragland&nbsp;could shed some light on the situation, he said in a new interview&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fmeghan-markle-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/royals/meghan-markle-thomas-doria-ragland-letter-not-speaking-letter/", "description": "Thomas Markle tells The Mail on Sunday that he \"even hand-delivered a letter.\"", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fmeghan-markle-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/royals/meghan-markle-thomas-doria-ragland-letter-not-speaking-letter/", "title": "Thomas Markle Says He Wrote to Doria Ragland Asking Why Daughter Meghan 'Won't Speak to Me'", "description": "Thomas Markle tells The Mail on Sunday that he \"even hand-delivered a letter.\"", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fmeghan-markle-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}