{"url": "https://thegoldwater.com/news/30915-Clinton-Body-Count-Series-5-Woman-Set-to-Testify-Against-Clintons-Blown-Up-in-Home-Explosion", "text": "Photo credit: infowars.com\n\nNew Jersey couple dies in a home explosion. Caroline Paladino was apparently set to testify to Grand Jury against the Clintons this week..\n\nHouse explosion in New Jersey {Video below}\n\n<div style=\"width:100%;text-align:center;margin:0 auto;\"><iframe width=\"360\" height=\"202\" src=\"https://www.youtube.com/embed/XAOf4QDpnCU\" frameborder=\"0\" allowfullscreen></iframe></div>\n\nThe couple, John Paladino, 73, and Carole Paladino, 72, were the only people inside the home in Newfield, New Jersey when the blast occurred shortly after 6 a.m.\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Flames are seen burning where a New Jersey home exploded early Saturday morning. Two people were killed in the blast, officials said. The cause of the explosion is not currently known. <a href=\"https://t.co/GA3X6tGIjb\">https://t.co/GA3X6tGIjb</a> <a href=\"https://t.co/7wJt79kqte\">pic.twitter.com/7wJt79kqte</a></p>— ABC News (@ABC) <a href=\"https://twitter.com/ABC/status/1015662071638298625?ref_src=twsrc%5Etfw\">July 7, 2018</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nInvestigators have not revealed what caused the blast but have said they do not suspect any foul play.\n\nNeighbors said the couple had lived in their home for decades, and it was where they raised their children.\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Just your average run of the mill HOUSE EXPLOSION on a nice Saturday morning in NJ… <br><br>News7 link-> <a href=\"https://t.co/DwNz1Yiz7n\">https://t.co/DwNz1Yiz7n</a> <a href=\"https://t.co/zHunb4gjKQ\">pic.twitter.com/zHunb4gjKQ</a></p>— Rev. Scott Anthony (@ScottAnthonyUSA) <a href=\"https://twitter.com/ScottAnthonyUSA/status/1016125604737974272?ref_src=twsrc%5Etfw\">July 9, 2018</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Wow…another one to add to the long list of deaths associated with the Clinton Crime Syndicate. <a href=\"https://t.co/YEzOprrbih\">https://t.co/YEzOprrbih</a></p>— Lisa Mei Crowley (@LisaMei62) <a href=\"https://twitter.com/LisaMei62/status/1016132065287385089?ref_src=twsrc%5Etfw\">July 9, 2018</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nIt looks as though we have more lives to add to the Clinton body count.\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">I catalogued every death I could find if anyone is interested in looking further. More than 200 deaths related to Crooked Hillary and her husband. <a href=\"https://t.co/RdXVONVsZw\">https://t.co/RdXVONVsZw</a></p>— Robert Horan (@Robby12692) <a href=\"https://twitter.com/Robby12692/status/1015111895995609088?ref_src=twsrc%5Etfw\">July 6, 2018</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nThe expected testimony centered on a notorious pharmaceutical company who gave money to the Clinton Foundation in a bid to cover up their drug price gouging crimes.\n\nAccording to reports, ‘US Federal Grand Jury had been impaneled to hear testimony from witnesses presented before it by FBI investigators and/or US Attorneys’.\n\nOn July 7th, the report continues, a massive explosion occurred that obliterated a two-story house. The shock wave jolted people from their beds as much as a mile and a half away.\n\n‘As per standard protocol and procedures, this report details, SVR analysts, in their replying to the MoD’s request for information about this “event”, conducted a database search of the two persons named as having been killed in this explosion– Carole Paladino, age 72, and her husband John Paladino, age 73—with, and very surprisingly to them, a SVR database “target hit” on Carole Paladino being revealed as she had previously been identified by SVR analysts as being a “probable witness” against the Clinton Foundation.,\n\n‘Now deceased Carole Paladino was the lead school nurse for Millville Public Schools located in Cumberland County, New Jersey—and whose inclusion in the SVR’s database of “potential witnesses” against the Clinton Foundation was due to her being a “central identified and named figure” in the creation of a document titled “Training Protocols For The Emergency Administration Of Epinephrine” for the New Jersey Department of Education.’\n\n‘Epinephrine (also called adrenaline), this report explains, is a hormone used to treat anaphylaxis—that is a serious allergic reaction that is rapid in onset and may cause death—and whose administering of is done via a medical device known as an epinephrine auto-injector (EpiPen)—and that the Carole Paladino collaborated on report for its “emergency administration” led New Jersey to pass a law requiring all schools in their State, both public and private, to purchase it—and their passing another law allowing New Jersey school nurses to, also, use EpiPens without parental permission.’\n\n‘Whether knowingly, or not knowingly, Carole Paladino, by her being a “main target” person in the plot to force all New Jersey schools to purchase EpiPens, she became embroiled in one of the largest medical scams ever known in US history—that began when the American global generic and specialty pharmaceuticals company Mylan N.V. suddenly began funneling money to the Clinton Foundation—and that nearly immediately after which, saw Gayle Conelly Manchin take over as the head of the National Association of State Boards of Education—and who spearheaded an unprecedented effort that encouraged States to require schools to purchase medical devices that fight life-threatening allergic reactions—that, in turn, helped pave the way for Mylan N.V., maker of EpiPens, to develop a near monopoly in school nurses’ offices throughout the United States—with New Jersey is one of the 11 States drafting laws requiring epinephrine auto-injectors be bought by schools—and that the Obama-Clinton regime conspired with using their “EpiPen Law” that gave funding preference to States that did what Gayle Conelly Manchin told them to do.’\n\n‘Unbeknownst to the American people, this report notes, is that Gayle Conelly Manchin is the mother of Heather Bresch—who, in 2012, right after her mother took control of the National Association of State Boards of Education and began her campaign to force schools to buy EpiPens—became the CEO of EpiPen maker Mylan N.V.—with Heather Bresch, upon taking control, raising the price of EpiPens over 400% to $600 per dose and skyrocketing her personal worth to over $27 million—and whose “protection” for this vile plot was provided by her father, and Gayle Conelly Manchin’s husband, Democratic Party US Senator Joe Manchin.’\n\n‘To an even greater scandal-catastrophe awaiting Hillary Clinton, as it dwarfs too near insignificance her EpiPen one, this report further notes, is her “active and knowing” participation in the United States opioid crisis—that the Centers for Disease Control and Prevention warns whose drug overdoses attributed to in the US have increased by 13.3 percent from August 2016 to August 2017, and now total 67,344 deaths per year—nearly all of which were deliberately caused by Oxycontin-maker Purdue Pharma—who, after funneling tens-of-millions of dollars to the Clinton Foundation, saw the Obama-Clinton regime to a “blind eye” to their flooding of America with opioids—and as exampled by Democratic Party US Senator Joe Manchin’s home State of West Virginia being flooded with more than 780 million opioid pills, that roughly equals 433 pills for every man, woman, and child in his State.’\n\n‘This report, after describing the horrific opioid crisis in America, concludes with SVR analysts noting that this past week, also, provided an explanation as to why the FBI task force investigating Hillary Clinton and her Clinton Foundation has been increasing their electronic communications with the United States Attorney’s Office for the Eastern District of Tennessee—and that is due to a shocking court case currently underway in Knoxville, Tennessee—that was brought against the Clinton Foundation bribed pharmaceutical giant Purdue Pharma by Tennessee Attorney General Herbert H. Slatery III on behalf of the citizens of his State—and whose shocking to the conscious just released, by order of the court, documents stunningly reveal:\n\n“Purdue’s own records show company founders and executives pressed its sales team to push Tennessee doctors to prescribe deadly dosages of Oxycontin on a long-term basis while lying to doctors about the dangers.\n\nPurdue leaders lied to the medical community, politicians and the public not only about the dangers of Oxycontin but created a false narrative – that long-term use of opioids didn’t create addicts but instead caused “pseudo addictive” symptoms.\n\nThe groups sought to convince the public they had a right to opioids. Tennessee’s legislature was pushed by one of those advocacy groups to pass a law requiring doctors to prescribe opioids if a patient insisted.\n\nPurdue also used fake advocacy literature, such as pamphlets, videos, and social media, to convince the public that long-term use of opioids led to a higher “quality of life.”\n\nThe firm sent doctors fake literature with similar claims but added material on how Oxycontin – Purdue’s financial rainmaker – was better for patients than other opioids on the market.”\n\n<img src=\"https://media.8ch.net/file_store/b4a605f160e4e0f03903a232c185067ff24b83dd8a1f8b361f2be3dfc83dbdb3.jpeg\" style=\"max-height:640px;max-width:360px;\">\n\n<span style=\"margin-top:15px;rgba(42,51,6,0.7);font-size:12px;\">Credit:<a href=\"http://www.theeventchronicle.com/cabal-exposed/new-jersey-couple-set-to-testify-to-grand-jury-against-the-clintons-die-in-new-jersey-home-explosion-2/\"> The Event Chronicle </a></span\n\nAmerican nurse Carole Paladino (above) identified by SVR as being “probable witness” against Clinton\n\nFoundation\n\nRelated Coverage: <a href=\"http://thegoldwater.com/news/29430\"> Clinton Body Count Series: #1. How FBI Agent David Raynor Stabbed And Then Shot Himself </a>\n\nRelated Coverage: <a href=\"https://thegoldwater.com/news/29628\"> Clinton Body Count Series: #2. Who Killed Seth Rich? </a>\n\nRelated Coverage: <a href=\"https://thegoldwater.com/news/29923\"> Clinton Body Count Series: #3. John F Kennedy Jr. dared to run for the same Senate seat as Hillary! </a>\n\nRelated Coverage: <a href=\"https://thegoldwater.com/news/30536\"> Clinton Body Count Series: #4. Shawn Lucas Who Filed Fraud Case Against DNC and Hillary Found Dead! </a>\n\nRelated Sources:\n\nhttp://impiousdigest.com/us-federal-witness-due-to-testify-against-hillary-clinton-for-drug-crimes-killed-in-massive-explosion/; http://www.theeventchronicle.com/cabal-exposed/new-jersey-couple-set-to-testify-to-grand-jury-against-the-clintons-die-in-new-jersey-home-explosion-2/\n\nPermission to use the report, noted in this article, in its entirety is granted under the condition it is linked back to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n<b>By: Lexy </b>\n\n<b><i>On Twitter? Follow me:</i></b>\n\n<a href=\"https://www.twitter.com/PoliticallyRYT\">@PoliticallyRYT</a>\n\n<strong><span style=\"color:red;\">Have Information? Message me!</span></strong>", "images": ["https://thegoldwater.com/static/public/icons/social/rounded/youtube rounded.svg", "https://thegoldwater.com/static/images/tgw-site-title-white.png", "https://thegoldwater.com/static/public/icons/social/spreddit5.gif", "https://thegoldwater.com/static/public/icons/arrow_up.svg", "https://thegoldwater.com/static/public/icons/social/rounded/twitter rounded.svg", "https://thegoldwater.com/static/images/tgw-site-logo.png", "https://thegoldwater.com/static/public/icons/social/facebook.svg", "https://thegoldwater.com/static/media_thumb/7fa98ee6d441ccfcd1dc3bd31a741806eba254035110c8390f2ba6977f60f0f5.png", "https://thegoldwater.com/static/public/icons/social/rounded/medium rounded.svg", "https://thegoldwater.com/static/public/icons/social/pinterest.svg", "https://thegoldwater.com/static/public/icons/social/twitter.svg", "https://thegoldwater.com/static/public/icons/social/rounded/tumblr rounded.svg", "https://thegoldwater.com/static/media_medium/7fa98ee6d441ccfcd1dc3bd31a741806eba254035110c8390f2ba6977f60f0f5.png", "https://thegoldwater.com/static/public/icons/social/google plus.svg"], "top_img": "https://thegoldwater.com/static/media_thumb/7fa98ee6d441ccfcd1dc3bd31a741806eba254035110c8390f2ba6977f60f0f5.png", "keywords": [], "authors": [], "canonical_link": "https://thegoldwater.com/news/30915-Clinton-Body-Count-Series-5-Woman-Set-to-Testify-Against-Clintons-Blown-Up-in-Home-Explosion", "title": "Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "description": "The Goldwater - Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion", "twitter": {"card": "summary", "creator": "@TheGoldWaterUS", "site": "@TheGoldWaterUS", "domain": "https://thegoldwater.com", "url": "https://thegoldwater.com/news/30915-Clinton-Body-Count-Series-5-Woman-Set-to-Testify-Against-Clintons-Blown-Up-in-Home-Explosion", "title": "Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion", "image": {"src": "https://thegoldwater.com/static/media_thumb/7fa98ee6d441ccfcd1dc3bd31a741806eba254035110c8390f2ba6977f60f0f5.png"}, "description": "The Goldwater US - Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion"}, "og": {"type": "article", "title": "Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion", "url": "https://thegoldwater.com/news/30915-Clinton-Body-Count-Series-5-Woman-Set-to-Testify-Against-Clintons-Blown-Up-in-Home-Explosion", "site_name": "The Goldwater US", "image": "https://thegoldwater.com/static/media_thumb/7fa98ee6d441ccfcd1dc3bd31a741806eba254035110c8390f2ba6977f60f0f5.png", "description": "The Goldwater US - Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion", "locale": "en_US", "pubdate": "2018-07-11 03:39:45"}, "pubdate": "2018-07-11 03:39:45", "lastmod": "2018-07-17 13:33:23"}, "movies": [], "publish_date": null, "source": "https://thegoldwater.com", "summary": ""}