{"url": "mynewsla.com/sports/2015/07/16/caitlyn-jenner-honored-at-espy-awards/", "text": "Share this article:\n\nCaitlyn Jenner made a plea for respect for the transgender community as she accepted the Arthur Ashe Courage Award at the ESPY Awards.\n\n“This transition has been harder on me than anything I could imagine,” Jenner told the audience at the Microsoft Theater Wednesday night. “That’s the case for so many others besides me. For that reason alone trans people deserve something vital. They deserve your respect.”\n\nJenner, formerly known as 1976 Olympic decathlon champion Bruce Jenner, received the award to recognize “the courage to embrace a truth that had been hidden for years,” according to ESPN.\n\nBruce Jenner, who said he has long suffered from gender confusion and told ABC earlier this year that he identifies as a woman, was re-introduced to the world as Caitlyn Jenner on June 1 with a flashy photo spread and feature story in Vanity Fair magazine.\n\nLater that day, ESPN announced plans to give Jenner the Arthur Ashe Courage Award, which is presented “to individuals whose contributions transcend sports.”\n\n“Bruce has received many accolades over the years for being one of the greatest Olympians of our time but the ESPYs are honored to celebrate Bruce becoming Caitlyn,” ESPYs executive producer Maura Mandt said.\n\n“She has shown the courage to embrace a truth that had been hidden for years, and to embark on a journey that may not only give comfort to those facing similar circumstances, but can also help to educate people on the challenges that the transgender community faces.”\n\nPrevious recipients of the Arthur Ashe Courage Award include Muhammad Ali, Jim Valvano, Pat Tillman, Robin Roberts and Nelson Mandela. Michael Sam, the first openly gay player to be drafted by an NFL team, received the honor last year.\n\nThe selection of Jenner to receive the award has generated some criticism — notably from sportscaster Bob Costas, who dubbed the choice “crass exploitation.”\n\nSome critics suggested that the honor should have gone to Lauren Hill, who was diagnosed with an inoperable brain tumor but continued to pursue her dream of playing college basketball.\n\nThe Indiana native made the team at Mount St. Joseph University in Cincinnati and played in four games — while helping to raise more than $1 million for pediatric cancer research.\n\nHill died on April 10 at age 19.\n\nHours before the ESPYs ceremony, organizers announced in a statement to USA Today that Hill will be honored during the show — noting that the recognition had always been planned, but was not previously announced.\n\nThe ESPY Awards honor celebrities from sports and entertainment to recognize major sports achievements and salute “leading performers and performances.”\n\nGolden State Warriors guard Stephen Curry received the best male athlete award, beating a field that also included Cleveland Cavaliers forward LeBron James, Green Bay Packers quarterback Aaron Rodgers and Houston Texans defensive end J.J. Watt.\n\nMMA fighter Ronda Rousey received the best female athlete award over University of Connecticut basketball guard/forward Breanna Stewart, skiing star Lindsey Vonn and tennis champion Serena Williams.\n\nThe ESPYs ceremony were hosted by comedian/actor Joel McHale and televised on ABC.\n\nHere is the list of winners: Best Male Athlete\n\n— Stephen Curry, Golden State Warriors Best Female Athlete\n\n— Ronda Rousey, MMA Best Team\n\n— U.S. women’s national soccer team Best Championship Performance\n\n— LeBron James, Cleveland Cavaliers Best Breakthrough Athlete\n\n— Mo’ne Davis, Little League Baseball Best Record-Breaking Performance\n\n— Peyton Manning throws record-509th touchdown pass Best Upset\n\n— Mississippi over Alabama, college football Best Game\n\n— Super Bowl Best Play\n\n— Odell Beckham Jr. Best Coach/Manager\n\n— Steve Kerr, Golden State Warriors Best Comeback Athlete\n\n— Rob Gronkowski, New England Patriots Best International Athlete\n\n— Lionel Messi, Barcelona/Argentina Best NFL Player\n\n— Aaron Rodgers, Green Bay Packers Best MLB Player\n\n— Mike Trout, Los Angeles Angels of Anaheim Best NHL Player\n\n— Jonathan Toews, Chicago Blackhawks Best Driver\n\n— Kevin Harvick, NASCAR Best NBA Player\n\n— Stephen Curry, Golden State Warriors Best WNBA Player\n\n— Skylar Diggins, Tulsa Shock Best Fighter\n\n— Ronda Rousey, MMA Best Male Golfer\n\n— Jordan Spieth Best Female Golfer\n\n— Lydia Ko Best Male Tennis Player\n\n— Novak Djokovic Best Female Tennis Player\n\n— Serena Williams Best Male College Athlete\n\n— Marcus Mariota, Oregon football Best Female College Athlete\n\n— Missy Franklin, Cal swimming Best Male Action Sports Athlete\n\n— Ryan Dungey, motocross Best Female Action Sports Athlete\n\n— Kelly Clark, snowboarding Best Jockey\n\n— Victor Espinoza Best Male Athlete with a Disability\n\n— Krige Schabort, Triathlon Best Female Athlete with a Disability\n\n— Becca Meyers, swimming Best Bowler\n\n— Jason Belmonte Best MLS Player\n\n— Robbie Keane, Los Angeles Galaxy Special Awards Jimmy V Award for Perseverance\n\n— Devon and Leah Still Pat Tillman Award for Service\n\n— Danielle Green Best Moment\n\n— Lauren Hill Icon Award\n\n— Derek Jeter Arthur Ashe Award for Courage\n\n— Caitlyn Jenner\n\nCaitlyn Jenner: Becoming woman harder than anything was last modified: by\n\n>> Want to read more stories like this? Get our Free Daily Newsletters Here!\n\nFollow us:", "images": ["http://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.mynewsla_com,DomainId.56569", "https://mynewsla.com/wp-content/uploads/2017/06/drummer-suit2-232x150.jpg", "https://go.ezoic.net/utilcave_com/img/ezoic.png", "https://mynewsla.com/wp-content/uploads/2015/06/Jenner-640x360.png", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/reddit.png", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/rss.png", "https://mynewsla.com/wp-content/uploads/2017/07/MNLA_Banner_0005_optimized.jpg", "https://mynewsla.com/wp-content/uploads/2014/09/MyNewsLA_Logo_TEST6.png", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/mail.png", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/linkedin.png", "https://mynewsla.com/wp-content/uploads/2017/02/brady1-232x150.jpg", "http://pixel.quantserve.com/pixel/p-HSz-D9Br7TKYt.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=20015427&cv=2.0&cj=1", "https://mynewsla.com/wp-content/uploads/2017/10/MyNewsLA-Caitlyn-Jenner-232x150.jpg", "https://mynewsla.com/wp-content/uploads/2017/06/michelle-chance-232x150.jpg", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/facebook.png", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/pinterest.png", "https://mynewsla.com/wp-content/plugins/social-media-feather/synved-social/image/social/regular/48x48/twitter.png"], "top_img": "https://mynewsla.com/wp-content/uploads/2015/06/Jenner-640x360.png", "keywords": [], "authors": ["Debbie L. Sklar"], "canonical_link": "https://mynewsla.com/sports/2015/07/16/caitlyn-jenner-honored-at-espy-awards/", "title": "Caitlyn Jenner: Becoming woman harder than anything", "meta_data": {"viewport": "width=device-width", "google-site-verification": "icGkRsUSvrcw38w8ORla0DtiEaru5iJXh_VFH4S1N4c", "generator": "AMP for WP 0.9.98.21", "template": "Fearless - Modern, Clean, & Responsive WP Magazine 1.7.1", "description": "Caitlyn Jenner made a plea for respect for the transgender community as she accepted the Arthur Ashe Courage Award at the ESPY Awards.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Caitlyn Jenner: Becoming woman harder than anything - MyNewsLA.com", "description": "Caitlyn Jenner made a plea for respect for the transgender community as she accepted the Arthur Ashe Courage Award at the ESPY Awards.", "url": "https://mynewsla.com/sports/2015/07/16/caitlyn-jenner-honored-at-espy-awards/", "site_name": "MyNewsLA.com", "updated_time": "2015-07-16T14:09:52+00:00", "image": {"identifier": "https://mynewsla.com/wp-content/uploads/2015/06/Jenner-640x360.png", "secure_url": "https://mynewsla.com/wp-content/uploads/2015/06/Jenner-640x360.png", "width": 640, "height": 360}}, "article": {"tag": "ESPY awards", "section": "Sports", "published_time": "2015-07-16T13:19:22+00:00", "modified_time": "2015-07-16T14:09:52+00:00"}}, "movies": [], "publish_date": 1436976000.0, "source": "http://mynewsla.com", "summary": ""}