{"url": "www.vanityfair.com/news/2010/12/william-and-kate-201012", "text": "Now that it was clear that this was not just a university romance, aides at the Palace suddenly started paying attention to the middle-class girl who had so captured the prince’s imagination. Mindful of the mistakes that had been made with Diana, it was unanimously agreed that Kate should be introduced to royal life as quickly as possible. At William’s request, it was decided that Kate should be advised on how to cope with the intense media interest in her. He was determined that she should suffer none of the loneliness or isolation his mother had felt in the early days of her courtship with his father. Kate was given the support of the Prince of Wales’s press team and, when she was with William, her own protection officer. At a polo match she was spotted with a two-way radio in case she required backup. She received advice on how to handle the photographers who followed her about, which included watching footage of the late Princess of Wales to see how she had coped with the paparazzi. According to friends, Kate found it all fascinating if “a little creepy.”\n\nEven without a ring on her finger, Kate had become one of the world’s most photographed women, and she was surprisingly confident. Always impeccably dressed, she was advised never to talk to the press, but to politely smile at photographers, whom she handled with aplomb. She had recently taken a day job at the head office of the High Street store Jigsaw, where she was working as an accessories buyer, and she was looking forward to spending time with William over Christmas.\n\nWilliam had promised Kate he would join the Middletons to celebrate Hogmanay, the Scottish New Year, at a country estate called Jordanstone House, and Kate was eagerly awaiting his arrival. The 18th-century property, on the outskirts of Alyth, was set in snowy countryside. A Christmas tree twinkled in the grand drawing room, and with fires burning in every room, the setting could not have been more romantic. But at the last minute William had a change of heart and decided to stay with his own family instead. According to a source close to the family, he informed a tearful Kate during a late-night conversation on Boxing Day. For William it was no big deal, but for Kate the cancellation was a sign of something more sinister to come. She had good reason to be concerned. William had been having second thoughts and sat down with his father and his grandmother to have a frank discussion about his future with Kate. Both advised him not to hurry into anything.\n\nKate turned 25 on January 9, 2007. The day before, William had joined the Blues and Royals regiment of the Household Cavalry at Combermere Barracks, in Windsor, where he would be stationed until March. They had had a joint celebration at Highgrove before he reported for duty, but Kate was still reeling over the snub in Scotland. In the newspapers, however, the engagement rumor was gathering momentum once more. Kate’s birthday was preceded by an article written for The Spectator by Diana’s former private secretary Patrick Jephson in which he claimed that Kate was on her way to becoming a royal bride. Under the headline THE NEXT PEOPLE’S PRINCESS, the article was highly speculative, but there was no doubting the thrust—William was set to make Kate his wife, and her 25th birthday looked like a likely date for an announcement. The story snowballed, and by the morning of Kate’s birthday dozens of photographers were camped outside her house waiting for the “pre-engagement picture.” The rumors could not have been further from the truth—William had no plans to propose. Instead, he phoned Kate from the Combermere Barracks to apologize. William was furious that Kate’s birthday had been spoiled, and in an unprecedented statement he complained that she was being harassed and said he wanted “more than anything” for her to be left alone. For the first time Kate felt overwhelmed and desperately isolated. Usually she smiled brightly for the photographers, but now as she made her way to work in central London she looked as though she was about to crack under the pressure. Those close to the couple began to speak of doubts about their relationship. The Palace’s plans for a spring wedding were shredded as quickly as they had been drawn up, and the talk now, among their friends at least, was that an engagement was certainly not in the cards. William had started a two-and-a-half-month tank commander’s course at Bovington, and although the couple took a skiing trip to Zermatt with friends in March, he and Kate were spending less time together. He had warned her that his schedule was packed and he would have little time to visit her. She was upset when William came to London and went clubbing instead of seeing her. On one occasion he spent the night at Boujis flirting with another girl. William was with a group of friends when Tess Shepherd walked into the club. The petite blonde knew some of William’s circle, and before long she and William were on the dance floor, arms entwined.", "images": ["http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/master/w_2560%2Cc_limit/image.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg"], "top_img": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Katie Nicholl", "Katie Nichol"], "canonical_link": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012", "title": "Wills and the Real Girl", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Katie Nicholl", "copyright": "Copyright (c) Condé Nast 2020", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "id": "54cc225a0a5930502f5fb97b", "keywords": "royals,magazine,archive,kate middleton,prince william,society,royal watch", "news_keywords": "royals,magazine,archive,kate middleton,prince william,society,royal watch", "robots": "index, follow", "content-type": "article", "parsely-post-id": "54cc225a0a5930502f5fb97b", "parsely-metadata": "{\"description\":\"Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Wills and the Real Girl", "type": "article", "url": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Wills and the Real Girl"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "http://www.vanityfair.com", "summary": ""}