{"url": "https://www.vulture.com/2018/12/real-housewives-of-atlanta-recap-season-11-episode-7.html", "text": "The allure of Truth or Dare certainly wears off somewhere after 12th grade for most people. But these women (who are not in middle school) play way too much Truth or Dare. Someone needs to tell me if these women are all deeply attracted to each other. I wouldn’t be upset or confused. In fact, I would prefer it and understand it. Any time they’re left alone in an expensive bus or a lake house, they’re always trying to see each other’s titties. Listen, I’m not saying that I’m better than getting a glimpse at my friend’s titties, but they are like, always trying to see each other’s titties. Because if they want to see each other’s titties, they can stop manufacturing situations where they’re being “forced” into asking each other to have phone sex in front of each other or look at a titty. Just ask a friend. Ask a friend to suck their fingers. Maybe we’ll end up somewhere interesting, like a seven-person non-monogamous sexual relationship. I WOULD WATCH IT. I would definitely watch it over a bunch of grown women figuring out a trip. If I wanted to watch a bunch of black women over 30 arrange a trip, I WOULD JOIN AN ADULT CHAPTER OF DELTA SIGMA THETA, OKAY? Let’s get to it.\n\nPorsha starts the episode off by saying she’s keeping her pregnancy a secret. She’s also trying to get to know Dennis’s mom but shows up in a catsuit to The Original Hot Dog Factory. She’s going to spend an afternoon working with Dennis. Is this a thing? Going to your boyfriend’s job to hang out and work for an afternoon? I’ve had several unemployed ex-boyfriends so I guess when I went over to their houses, I was spending time at their place of business. Mama Gina keeps asking Porsha if there is anything she should know. Mama Gina knows. You just look at Mama Gina and know that she knows. She can smell the hormones shifting in Porsha’s body.\n\nEveryone is getting ready for NeNe’s couples’ trip, but everyone’s boyfriends and husbands keep suspiciously canceling. Dennis hurt his leg, it’s Todd’s birthday weekend, and Mike Hill just ain’t going.\n\nMeanwhile, Shamari is packing for the trip and she’s got her stylist pulling some outfit options. Unfortunately, one of those outfit options is a tiny denim vest to be paired with cut-offs. SHAMARI. That is not what everyone is looking for from you. She really enjoys a tight vest or vest-adjacent item of clothing. I think it’s her over-reliance on the vest that’s causing people trouble. Ronnie likes a pair of see-through, rhinestoned leggings. He smells them. Anyone else experience a full-body shudder?\n\nRonnie isn’t just sniffing booty, though — he’s there to sniff out crime. He noticed at the B00BZ & Bourbon Bonanza that Porsha gave them the cold shoulder. In case you forgot, Porsha and Shamari went to the same high school. Don’t worry if you have trouble remembering that, it’ll be mentioned no fewer than six times by Shamari this episode. Shamari’s internal desire this episode is to squash the beef between her and Porsha.\n\nThe ladies all convene at Kandi’s house to leave for their weekend after the trip has been converted into a girl’s trip. Gregg really wanted to go on this trip but he would have been the only guy. Porsha arrives at the house first and she instantly bonds with Ace. Her maternal instincts are kicking in early. Cynthia arrives and she’s finally got heels on. When Cynthia’s got a man, she turns up the hotness. Then Tanya arrives. I GOTTA WORRY ABOUT TANYA ON THIS TRIP? I don’t care what room she gets. Tanya needs to win me over immediately.\n\nGregg drops NeNe off and everyone gives them a standing ovation in the kitchen. Gregg says he wants them to learn something new about each other. I think that thing is going to be the color of each other’s areolas.\n\nDuring the game of Truth or Dare, between sucking on each other’s fingers, NeNe asks Porsha again if Dennis dated anyone on the trip or if anyone on the trip knows someone he dated. NeNe is just fishing for some drama. Kandi says that Dennis was dating someone pretty seriously up until about a month and a half ago. Porsha says that she’s been in a strictly monogamous relationship with Dennis for six months … but three months ago she was at Shamea’s birthday party with another dude. This is a real Eva-can’t-keep-track-of-the-lies situation. Porsha just needs to say, “I don’t care who he was with. He’s with me now. Anything beyond that is between him and his god.”\n\nNeNe’s spin on the age-old room-picking drama is a multi-step process that gets more confusing as each step is revealed. Each women picks a number, then they pick a name. Each name is assigned a number. The women then choose rooms in the order of their numbers, not for themselves but for whoever’s name they picked. It’s too much, but relatively drama-free. Marlo gives Tanya the bunk-bed room and that’s why I fucking love Marlo.\n\nIt’s time for dinner and Cynthia asks about the bachelorette party. Porsha says that she was invited. Um. Um. Uh-oh, Eva. Somehow Porsha was invited, but it was a secret, but also she didn’t know everyone who was there. Eva needs one of those things quarterbacks wear on their wrists to track plays, but for her lies. Then Porsha asks why NeNe wasn’t invited. Eva says she didn’t think NeNe would want to come. NeNe relishes the opportunity of turning down an invitation, so to rob her of that is almost as bad as not inviting her. Eva breaks down crying about how she doesn’t talk to NeNe every day but sees her as a big sister. I don’t like this.\n\nShamari then sets her sights on Porsha for saying she needed a makeover when Porsha isn’t the one who said it. Shamari is obviously trying her best to stir up some type of drama but she can’t keep her facts straight. Shamari is also pissed that Porsha acts like they aren’t friends and calls her out for not hugging her at the B00BZ & Bourbon Bash. Porsha says she wasn’t feeling her that day so she didn’t hug her and didn’t introduce her to Dennis. Well, fuck, you can’t argue with that.\n\nFinally, Marlo offers her services to give Shamari a makeover, and if next week doesn’t begin with a full-on makeover montage, I’m going to be pissed!", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/12/14/recaps/rhoa.w700.h700.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/12/14/recaps/rhoa.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/12/14/recaps/rhoa.w1200.h630.jpg", "keywords": [], "authors": ["Ali Barthwell"], "canonical_link": "https://www.vulture.com/2018/12/real-housewives-of-atlanta-recap-season-11-episode-7.html", "title": "The Real Housewives of Atlanta Recap: Truth or Dare", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Real Housewives of Atlanta Recap: Truth or Dare", "url": "https://www.vulture.com/2018/12/real-housewives-of-atlanta-recap-season-11-episode-7.html", "description": "Eva needs one of those things quarterbacks wear on their wrists to track plays, but for her lies.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/12/14/recaps/rhoa.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The Real Housewives of Atlanta Recap: Truth or Dare", "description": "Eva needs one of those things quarterbacks wear on their wrists to track plays, but for her lies.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/12/14/recaps/rhoa.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-12-17T10:09:50.710-05:00", "tag": "tv, tv recaps, overnights, recaps, the real housewives, the real housewives of atlanta, reality tv, bravo", "publisher": "https://www.facebook.com/Vulture"}, "description": "Eva needs one of those things quarterbacks wear on their wrists to track plays, but for her lies. A recap of Bravo’s Real Housewives of Atlanta, season eleven, episode seven, ‘Sisterhood of the Traveling Peaches.’", "sailthru.tags": "tv, tv recaps, overnights, recaps, the real housewives, the real housewives of atlanta, reality tv, bravo", "author": "Ali Barthwell", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1545059390.71, "source": "https://www.vulture.com", "summary": ""}