{"url": "https://www.bustle.com/p/emma-stones-comments-on-ryan-gosling-prove-that-the-co-stars-are-bffs-its-so-sweet-11482218", "text": "In the history of Hollywood, certain co-stars stand out as the most dynamic duos whose chemistry jumps out from the screen. Fred Astaire and Ginger Rogers, Richard Pryor and Gene Wilder, Katharine Hepburn and Spencer Tracy, Meg Ryan and Tom Hanks, and the more recent partnership of Emma Stone and Ryan Gosling. The last pair has starred together in three films, Crazy Stupid Love, Gangster Squad, and La La Land. Moviegoers can't get enough of the somewhat offbeat pair, and Emma Stone's recent comments on Ryan Gosling prove that the co-stars can't get enough of each other, either.\n\nAccording to Entertainment Tonight, Stone spoke about Gosling at Colorado's Telluride Film Festival during a Q&A on Sept. 1. \"I can’t even imagine what my life would be without Ryan,\" Stone said. The Battle of the Sexes star went on, saying, \"He’s so special. It makes me emotional. He’s so talented but he’s such a great person to work with because he’s so collaborative and excited about the process. He’s taught me a lot about being really generous.\" Stone continued to tell the audience about her \"dear, wonderful friend\" after an audience member asked about why the La La Land co-stars have so much chemistry. She said, \"The moment he walked into the audition of Crazy, Stupid, Love, we had an unspoken understanding of each other.\"\n\nIt probably won't come as a surprise to hear that fans have long-been obsessing over the duo who first stole everyone's hearts in Crazy Stupid Love. That movie included the unforgettable scene where Emma Stone's character freaked out over Ryan Gosling's glistening six-pack, and the iconic Dirty Dancing lift. With Stone's lovable awkwardness and Gosling's humble charm, it's no wonder that everyone wants to see the duo star in a fourth — and fifth, and sixth — movie together ASAP.\n\nSome fans even feel that the couple's lack of co-starring role from the year might ruin awards season. Twitter user @dailyemmastone wrote, \"Yeah heartbreak is horrible, but have you ever imagine an award season with emma stone and ryan gosling doing it separately... well it's about to happen.\" At least you can take heart in the fact that Stone and Gosling likely will at least see each other on some red carpets, since Gosling's starring role in the upcoming movie First Man is already drumming up Oscar buzz as is Stone's role in the upcoming release, The Favourite.\n\nEven though Stone and Gosling didn't star together in a new movie in time for the 2018 awards season, the duo very well could end up teaming up together in the future. After all, Gosling's admiration for Stone has long inspired fans to ship the onscreen pair. In 2011, Gosling told MTV, that Stone is \"everything, all the time,\" and then he revealed that Stone's casting in Crazy Stupid Love got him excited for his role. \"There's no one like her. As soon as she signed on for this movie, I knew it was going to be good,\" he added.\n\nNot only did Stone and Gosling make an impression on viewers in their first movie together, but they also left their co-star Steve Carell wanting more. According to E! News, Carrell spoke about Stone and Gosling at the 2017 at the Toronto International Film Festival. The Office star said, \"I hope the three of us get to work again together. They are, incidentally, two of the nicest people ever.\" At least Carrell got to reunite with Stone in 2017 with Battle of the Sexes, but fans still want to see Gosling reunite with Stone on the big screen at least one more time.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/17/e7523707-c6a1-47aa-9887-06a1391eb25a-2_disney_logo_29e79241_fbd045f0.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/16/97010b86-55b6-4027-8ae3-8bbc96a4f438-getty-1132368586.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/9/3/d5d0768d-081c-4767-9eec-8908fdb9a36e-getty-633856406.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/9/3/d5d0768d-081c-4767-9eec-8908fdb9a36e-getty-633856406.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/14/3268fb88-02c0-4d90-b2e8-dd4be4405c1b-getty-1190287543.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/bdb0f12d-3fc5-4f54-9148-62a9337bc4d5-getty-1199620322.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/9/3/d5d0768d-081c-4767-9eec-8908fdb9a36e-getty-633856406.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/emma-stones-comments-on-ryan-gosling-prove-that-the-co-stars-are-bffs-its-so-sweet-11482218", "title": "Emma Stone’s Comments On Ryan Gosling Prove That The Co-Stars Are BFFs & It’s So Sweet", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/emma-stones-comments-on-ryan-gosling-prove-that-the-co-stars-are-bffs-its-so-sweet-11482218", "type": "article", "title": "Emma Stone’s Comments About Ryan Gosling Will Have Fans Desperate For An Onscreen Reunion", "description": "In the history of Hollywood, certain co-stars stand out as the most dynamic duos whose chemistry jumps out from the screen. Fred Astaire and Ginger Rogers, Richard Pryor and Gene Wilder, Katharine Hepburn and Spencer Tracy, Meg Ryan and Tom Hanks,…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/9/3/d5d0768d-081c-4767-9eec-8908fdb9a36e-getty-633856406.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "In the history of Hollywood, certain co-stars stand out as the most dynamic duos whose chemistry jumps out from the screen. Fred Astaire and Ginger Rogers, Richard Pryor and Gene Wilder, Katharine Hepburn and Spencer Tracy, Meg Ryan and Tom Hanks,…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}