{"url": "https://www.inquisitr.com/4460285/kim-k-ready-for-baby-no-3-bff-says-more-kids-makes-sense-surrogate-hired/", "text": "Kim Kardashian clearly loves being a mother to her two little ones North and Saint, and despite a number of health issues during both pregnancies, and warnings from doctors that Kim should not have another child, the reality star is apparently determined to have the big family she has always wanted.\n\nKardashian has made her wishes to expand her family with Kanye known and the star’s best friend Simon Huck has stated that he is not surprised. The bff to Kim states that he knows that having more kids has always been what Kardashian wants and that her children have become her no.1 priority.\n\nE! News relays the words of Huck in regard to Kardashian’s plan to expand her family, stating “Her life has now become her kids. That is her No. 1 priority. So it makes sense that she would want to have a bigger family.”\n\nHuck goes on to admit that he is not aware of Kardashian’s plan fully to add a new little one to the Kardashian-West clan, but that he believes the mother of two has grown the most out the of famous family, adding “Kim as a mother, that I think has been the biggest transition.”\n\nThe publication reminds that in April Kim sought advice from doctors to determine if becoming pregnant again would be safe, and recently she and Kanye opted to hire a surrogate after Kim’s doctor advised not to get pregnant again.\n\nOn an episode of Keeping Up With The Kardashians the reality star admitted that hiring a surrogate is now her reality.\n\nEven with a life as public as hers, @KimKardashian still has a few unknown fun facts left. https://t.co/2TfJmtLBjf — Vogue Runway (@VogueRunway) August 25, 2017\n\n“After talking to Kanye, I think that I always knew that surrogacy was an option, but I didn’t think it was that realistic of an option. Now, I feel like that’s my reality,” Kim said when asked about surrogacy by older sister Kourtney.\n\nEeee! @KimKardashian has confirmed she and Kanye are “definitely trying” for baby number three! https://t.co/q4S40vj8Vn — Capital (@CapitalOfficial) August 19, 2017\n\nAt this point, Kardashian has reportedly found a surrogate, as TMZ noted, through an agency and she and Kanye determined that they would pay $45,000 for the procedure. The payment will be made in monthly installments of $4,500 and if multiple children result, the surrogate will be paid $5,000 for each additional child.\n\n[Featured Image By Mike Coppola/Getty Images]", "images": ["https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Kim-Kardashian-ready-for-third-baby.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/4460285/kim-k-ready-for-baby-no-3-bff-says-more-kids-makes-sense-surrogate-hired/", "title": "Kim K Ready For Baby No. 3, BFF Says More Kids ‘Makes Sense’ Surrogate Hired", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}