{"url": "https://www.washingtonpost.com/news/the-intersect/wp/2018/03/25/a-fake-photo-of-emma-gonzalez-went-viral-on-the-far-right-where-parkland-teens-are-villains/?utm_term=.a8127cdbabea", "text": "González, 18, has been at the flash point of this dynamic, appearing in newspapers, on magazine covers and in a prominent spot at the anchor rally in Washington, where her speech, which included a prolonged silence, lasted as long as the six minutes it took a gunman at her high school in Parkland, Fla., to kill 17 people on Valentine’s Day.\n\nAD\n\nGun-control advocates have held up González as a figurehead of the movement, splashing her trademark shaved head on T-shirts and viral images.\n\nAD\n\nThen, there is another viewpoint of her activism.\n\nA doctored animation of González tearing the U.S. Constitution in half circulated on social media during the rally, after it was lifted from a Teen Vogue story about teenage activists. In the real image, González is ripping apart a gun-range target.\n\nThe doctored image mushrooming across social media appeared to confirm the belief among Second Amendment absolutists that calls for stricter gun-control measures are transgressive, destroying the very foundation of the United States.\n\nAD\n\nThe animation bounced around conservative Twitter before it received a signal boost Saturday from actor Adam Baldwin.\n\nHe tweeted to a quarter of a million followers with a hashtag reading “#Vorwärts!” — the German word for “forward” and an apparent reference to the Hitler Youth, whose march song included the word.\n\nAD\n\nGab, the Twitter-like social network that is a popular refuge for the alt-right, tweeted the animation on Saturday to more than 100,000 followers, then hours later asserted it was “satire.” It racked up more than 1,200 retweets. The still images, looking more sophisticated than the glitchy animation, went further, appearing to be taken as legitimate by some conservative-minded Twitter users.\n\nAD\n\nThe pushback seems to have gained more traction than the original images, although that means the original images are also spread wider.\n\nDonald Moynihan, a professor at the University of Wisconsin at Madison, debunked the altered image, saying in a tweet: “Just a sample of what NRA supporters are doing to teenagers who survived a massacre (real picture on the right),” referencing a user named “Linda NRA Supporter” who posted the photo and whose account has since been suspended.\n\nAD\n\nJusty a sample of what NRA supporters are doing to teenagers who survived a massacre (real picture on the right). pic.twitter.com/czX7IHD8ur — Don Moynihan (@donmoyn) March 25, 2018\n\nMoynihan’s tweet keyed on an idea: Public moments by the Parkland students are being scrutinized and stretched to either bolster or tear down arguments on social media, built on the traditional debates made around the dinner table.\n\nAD\n\nGenerally, one form of criticism of González and fellow students such as David Hogg, 17, has focused on their ages.\n\nThey are too naive and young to grasp the extent of how money, politics and policy intersect, the argument goes. It was cemented in the right’s criticism of Hogg’s insistence that clear backpacks would infringe on civil rights.\n\nThe online effort to defuse Hogg has paid off. The first “top news” video that appears in a YouTube search for “David Hogg” is a takedown from conservative outlet the Blaze. “It’s hard to not just go after this kid,” host Pat Gray said in the video published Saturday, describing Hogg.\n\nAD\n\nOther elements of González have been used in an attempt to discredit her, online and off.\n\nAD\n\nFor instance, some in conservative circles have circulated images calling attention to a Cuban flag sewn to her jacket.\n\n“Emma Gonzales, wearing the flag of an authoritarian communist nation. Makes sense, they both hate an armed citizenry,” one meme shared on Reddit’s conservative page r/TheDonald. It was shared on social media through variations of the theme, including one by conservative commentator Andrew Wilkow. González’s father migrated from Cuba to the United States.\n\nAs The Post’s Samantha Schmidt reported, the flag came under attack Sunday from the campaign of Rep. Steve King (R-Iowa).\n\n“This is how you look when you claim Cuban heritage yet don’t speak Spanish and ignore the fact that your ancestors fled the island when the dictatorship turned Cuba into a prison camp, after removing all weapons from its citizens; hence their right to self defense,” said a post on King’s campaign page on Facebook. The post also included a photo of González at the podium Saturday.\n\nAD\n\nAD\n\nA self-identified conservative Parkland student also has been buttressed by the right, which thinks he identifies with its politics — a de facto foil to his classmates. Kyle Kashuv, 16, visited President Trump and five Republican U.S. senators just three weeks after the killings to offer alternatives in the debate.\n\n“The initial movement, in its purest form, was amazing. It got corrupted because now it’s represented as anti-gun and anti-NRA. ‘Boycott this, boycott that.’ It’s detracting from the actual discussions,” Kashuv told The Post’s Dan Zak about the work of his classmates.\n\nSince then, Kashuv has been an occasional guest on Fox News Channel, sometimes calling for middle ground with fellow classmates and among those who disagree in the debate. Kashuv has echoed critics on the right that a focus on law-enforcement failures, not gun laws, is the way forward.\n\nAD\n\nAD\n\nBut he has also targeted his classmates on the conservative media circuit.\n\nHogg’s comments at the rally were “egregious and inflammatory,” Kashuv said on Fox News on Saturday, and he has criticized Hogg numerous times on Twitter. On Sunday, Kashuv challenged classmate Cameron Kasky to a debate. His argument has been bolstered by the NRA, which has published videos decrying Hogg’s use of explicit language and suggesting his activist peers would be unknown if their classmates were still alive, saved by a gun-carrying officer.\n\nConservatives, who have often asserted that high school students have limited understanding and legitimacy in the gun debate, have taken a shine to the Parkland student.\n\nAD\n\n“You will include Kyle Kashuv in your story, yes?” Baldwin asked The Post in a direct message on Twitter.\n\nAD\n\nAbby Ohlheiser contributed to this report, which has been updated.", "images": ["https://www.washingtonpost.com/resizer/ztURgwlPSHjuPm2tBDef5ape2TY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4SMXCSWGQQZFVPFSAGPJEDHUC4.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/72f3d4da-482a-43b3-a5d7-2a8a93819de7.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/ztURgwlPSHjuPm2tBDef5ape2TY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4SMXCSWGQQZFVPFSAGPJEDHUC4.jpg", "keywords": [], "authors": ["Alex Horton", "General Assignment Reporter Covering National", "Breaking News"], "canonical_link": "https://www.washingtonpost.com/news/the-intersect/wp/2018/03/25/a-fake-photo-of-emma-gonzalez-went-viral-on-the-far-right-where-parkland-teens-are-villains/", "title": "A fake photo of Emma González went viral on the far right, where Parkland teens are villains", "meta_data": {"description": "The reaction to the March for Our Lives is exposing the starkly different ways the nation sees the Parkland students.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/the-intersect/wp/2018/03/25/a-fake-photo-of-emma-gonzalez-went-viral-on-the-far-right-where-parkland-teens-are-villains/", "image": "https://www.washingtonpost.com/resizer/ztURgwlPSHjuPm2tBDef5ape2TY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4SMXCSWGQQZFVPFSAGPJEDHUC4.jpg", "title": "A fake photo of Emma González went viral on the far right, where Parkland teens are villains", "description": "The reaction to the March for Our Lives is exposing the starkly different ways the nation sees the Parkland students."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "A fake photo of Emma González went viral on the far right, where Parkland teens are villains", "description": "The reaction to the March for Our Lives is exposing the starkly different ways the nation sees the Parkland students."}, "last_updated_date": "2019-04-28T18:14:41.790Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1521907200.0, "source": "https://www.washingtonpost.com", "summary": ""}