{"url": "www.thenational.ae/arts-culture/film/chadwick-boseman-why-black-panther-needed-african-accent-1.700499", "text": "Black Panther star Chadwick Boseman revealed Tuesday doubters had tried to convince him not to give the superhero an African accent — and how proud he was to prove them wrong.\n\nThe 41-year-old American stars in the titular role in the 18th movie in the Marvel Cinematic Universe — the first black superhero to get his own stand-alone movie.\n\n\"There was a time period where people would ask me questions about whether or not an audience could sit through a movie with a lead character that spoke with that accent,\" Boseman said of the east African inflection he gives the superhero — alias King T'Challa.\n\n\"I became adamant about the fact that it's not true,\" he added, stressing that none of the naysayers had come from Marvel itself.\n\n\"The intonations and melodies inside an African accent are just as classical as a British one or a European one.\n\nBoseman was speaking at a Beverly Hills news conference along with director Ryan Coogler, co-stars Michael B Jordan, Lupita Nyong'o and Danai Gurira and the rest of the cast the morning after Monday's glittering Hollywood premiere.\n\nThe actor got his break after a decade as an obscure television and indie film actor when Marvel came calling in 2014 with a lucrative five-picture deal to play Black Panther.\n\nHis appearance in Captain America: Civil War (2016) brought Boseman his first taste of real fame and his celebrity looks set to skyrocket when Black Panther opens on February 16, followed in May by Avengers: Infinity War.\n\nKing of Wakanda\n\nT'Challa, king and protector of the technologically advanced fictional African nation of Wakanda, has been characterised as the first black superhero, which is partly true.\n\nAround 30 black characters have donned the Lycra for the big screen since the early 1990s, including Marvel's Falcon (Anthony Mackie since 2014), Wesley Snipes's titular vampire hunter in Blade (1998) and Halle Berry's Kenyan princess Storm in four X-Men movies.\n\nA post shared by Marvel Studios (@marvelstudios) on Jan 9, 2018 at 10:00am PST\n\nThe Wakandan royal can claim to be the first black superhero to land a stand-alone movie in the MCU and the first in mainstream American comics, having been featured in The Fantastic Four in 1966.\n\nCritical and celebrity reactions to Black Panther after Monday's premiere were about as good as could be expected, with reviewers hailing the movie as \"iconic\" and \"astonishing.\"\n\nDonald Glover, who is due to star as Lando Calrissian in the upcoming Solo: A Star Wars Story, called it \"beautiful\" while Ant-Man director Peyton Reed said it was \"soulful, thoughtful and of the moment.\"\n\nMarvel Studios president Kevin Feige, who produces every MCU movie, agreed that the messages of the movie — which posits Wakanda taking in refugees and extending its culture and technology to poorer nations — were particularly topical, but added that most of the script was written 18 months ago.\n\nBadass Women of Wakanda\n\nCoogler and the producers came in for particular praise at the news conference for their decision to feature a clique of powerful female characters — dubbed \"the badass women of Wakanda\" front and centre.\n\n\"I was so pleased that this story … that it supported that. In African culture, they feel as if there is no king without a queen and this story, it highlights the queen, the warrior, the general, the young sister,\" said Angela Bassett, who plays T'Challa's mother Ramonda.\n\n\"I was so proud to have my daughter and my son there last night, because in their faces, in their spirit, they were feeling themselves. They stood taller after last night.\"\n\nA post shared by Marvel Studios (@marvelstudios) on Jan 12, 2018 at 9:02am PST\n\nGurira (The Walking Dead) spoke of her trepidation over having her head shaved to play Okoye, the head of Wakanda's Dora Milaje special forces, but how she saw it as \"subversive in the right way.\"\n\n\"In theory, it sounded amazing, and then the day came … It happened. Then you walk into the restroom to wash your hands, look up like, 'What the?'\n\n\"It took a few days … Then the pride started to grow, there's pride around it, and the embracing of this symbol of power and these women.\"\n\n________________\n\nRead more:\n\nThe stars coming to Middle East Film & Comic Con this year\n\nWatch: Official trailer drops for Avengers: Infinity War\n\nFrom Iron Man to Wonder Woman: The endless love affair with superhero movies\n\n________________", "images": ["http://www.thenational.ae/polopoly_fs/7.107!/file/placeholder.png", "http://www.thenational.ae/polopoly_fs/7.107!/file/prayer.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/3.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/4.png", "http://www.thenational.ae/image/policy:1.371:1548933886/logo-76.jpg?f=1x1&w=55&$p$f$w=7c74f24", "https://www.thenational.ae/image/policy:1.700498:1517384296/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9", "http://www.thenational.ae/polopoly_fs/3.378!/temperature.png", "http://www.thenational.ae/polopoly_fs/7.107!/file/temperature.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/1.png", "http://www.thenational.ae/polopoly_fs/3.381!/prayer.png", "http://www.thenational.ae/polopoly_fs/7.107!/file/footer-logo.svg", "http://www.thenational.ae/polopoly_fs/7.107!/file/homepage-logo.svg"], "top_img": "https://www.thenational.ae/image/policy:1.700498:1517384296/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9", "keywords": [], "authors": [], "canonical_link": "https://www.thenational.ae/arts-culture/film/chadwick-boseman-why-black-panther-needed-african-accent-1.700499", "title": "Chadwick Boseman: why 'Black Panther' needed African accent", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "creator": "Atex – http://www.atex.com", "application-name": "The National", "description": "Black Panther is the first Marvel movie that features a black superhero", "news_keywords": "arts, culture and entertainment,cinema,United States of America,Arts & Culture,Arts & Culture,Film, AFP,", "parsely-post-id": "1.700499", "google-site-verification": "zupZPvcJ4TjE2PUIBOr4ND8eWiJR95ArU4eLYC0FpCw", "og": {"title": "Chadwick Boseman: why 'Black Panther' needed African accent", "site_name": "The National", "url": "https://www.thenational.ae/arts-culture/film/chadwick-boseman-why-black-panther-needed-african-accent-1.700499", "description": "Black Panther is the first Marvel movie that features a black superhero", "type": "article", "image": "https://www.thenational.ae/polopoly_fs/7.107!/file/logo_big.png"}, "apple-mobile-web-app-title": "The National", "msapplication-TileImage": "/polopoly_fs/7.107!/file/logo-144.jpg", "msapplication-TileColor": "#0095da", "apple-itunes-app": "app-id=1281497691, app-argument=https://www.thenational.ae/arts-culture/film/chadwick-boseman-why-black-panther-needed-african-accent-1.700499", "pocket-site-verification": "e213738e8509de340a044fefa896b8", "twitter": {"card": "summary_large_image", "site": "@TheNationalUAE", "title": "Chadwick Boseman: why 'Black Panther' needed African accent", "image": "https://www.thenational.ae/image/policy:1.700498:1517384296/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9"}}, "movies": [], "publish_date": null, "source": "http://www.thenational.ae", "summary": ""}