{"url": "https://www.thewrap.com/wwe-diva-carmella-on-joining-total-divas-the-womens-revolution-in-wwe/", "text": "Carmella says it’s a great time for women in the WWE.\n\nThings are going well for the WWE Superstar, member of the “SmackDown” roster and winner of the inaugural women’s Money in the Bank ladder match. On Monday, the 29-year-old pro wrestler was named as one of the new cast members of “Total Divas,” joining the Bella Twins, Natalya, Naomi, Lana and Maryse on the hit E! reality series. (Nia Jax and Alexa Bliss are also joining the show for Season 7.)\n\nTheWrap talked with Carmella — who was a dancer for the New England Patriots and L.A. Lakers before signing with WWE — to talk about her new reality TV gig, the “women’s revolution” currently happening in the WWE, and what it means to be a role model for female fans.\n\nAlso Read: WWE Reveals New Cast of 'Total Divas,' Sets Premiere Date for 'Total Bellas' Season 2 (Video)\n\n“I am really excited, I can’t wait for the show to come out,” Carmella, whose real name is Leah Van Dale, told TheWrap. “I’m honored to be a part of ‘Total Divas’ and show the world who Carmella is, not only on ‘SmackDown Live’ but in real life.”\n\nTheWrap: Has joining the cast of “Total Divas” become a benchmark that WWE Divas now aspire to?\n\nCarmella: I am not sure it is something we aim for, but I am honored to be a part of it and show the world who Carmella is, not only on “SmackDown Live” but in real life.\n\nThis is a super exciting time for the women in the WWE, so I can’t wait for everyone to see the progress that the women have been making over the last few years. This year, there were two women’s matches on the card WrestleMania — it has come a long way and I am really excited for the fans to see what’s in store for the women now.\n\nWhy has there been such an explosion for women in the WWE?\n\nI think it was just time — the women have been working for so long and so hard. The fans helped a lot too as they demanded it, they knew what the women were capable of and started the whole women’s revolution hashtag on Twitter. That gave the Divas a chance. The women took it and ran with it and have been running with it ever since then. They are now on main event pay-per-views. I was in the very first Money in the Bank ladder match for women, and I won it! So it has been a wonderful whirlwind. It is a great time to be a woman in the WWE.\n\nAlso Read: WWE WrestleMania 33: 11 Things You Didn't See on TV\n\nDid you used to watch “Total Divas” before you were cast on it?\n\nI watched it before I was even signed by the WWE! I’ve been watching since the very first season, so for me to be a part of it now is crazy … it doesn’t even feel real.\n\nIs it hard having the cameras on you all the time, especially covering your personal life?\n\nIt was different at first, that’s for sure. How am I supposed to act, what am I supposed to do? When you sign up for a reality show, you have to put your personal life out there.\n\nBut I am excited to share my struggle with my relationship. I am dating another WWE Superstar, Big Cass, he is on “Raw” and I am on “SmackDown,” so we get to show the world our struggles as it’s like a long-distance relationship and we only see each other one-and-a-half days a week, sometimes less. I really want to show women that it is OK to have a career and put that — not necessarily first — but to put it out there. You can do it all. Is it going to be hard? Yes. Is it going to be worth it? Of course.\n\nAlso Read: WrestleMania 33: NFL Star Rob Gronkowski Jumps Into the Ring With Mojo Rawley in WWE Debut\n\nI don’t think most people know how hard WWE Superstars work, do you think that “Total Divas” is a good way to show that?\n\nIt is a great outlet for people to see what it takes to be in the WWE, but I don’t think it shows all of it. [The job] isn’t glamorous all the time by any means. There are a lot of perks, but viewers don’t see the late-night flights, the race to the rental car shuttle, the to drive to the hotel to get two hours sleep … you can only explain that so much.\n\nHave the Bella Twins helped pave the way for Divas and female WWE Superstars?\n\nI love the Bella Twins. The very first story I was involved in when I got called up to “SmackDown” was with Nikki Bella. When she came back at SummerSlam, it was my first pay per view match, I was just so excited and couldn’t believe she was going to be in the match, never mind that I got to do a story with her. She helped me out and I learned a lot from her. She is such a big name, so that definitely helps because all eyes are on these matches.\n\nAlso Read: WWE 'SmackDown Live' Commissioner Shane McMahon Walks Away From Helicopter Crash (Video)\n\nIs it hard to be the bad girl?\n\nNot at all, I love it. It’s so fun because the Carmella you see on “SmackDown Live” is so different to me. It’s great to be able to portray this character in a way that I never would in real life.\n\nWhat was the best piece of advice someone told you before going on a reality show?\n\nThat not everyone is going to like you, so you can’t act a certain way or portray yourself in a way to make them. Just go in and be yourself. Whether you like me, you hate me or you love to hate me … I don’t really care. I just go and be who I am as that’s all I know how to do.\n\nAlso Read: Stephanie McMahon, Mark Giordano Among Winners at ESPN Sports Humanitarian Awards\n\nAs it’s a really show, is there a lot of drama or conflict?\n\nI really think it is important especially at this time in the women’s revolution to show we’re not here to bring each other down, we’re here to bring each other up. There’s going to be inevitable drama with the travel, sometimes it gets to you and you forget what’s really important and why we’re all here. My role on the show so far from filming is trying to be the peacemaker and remind everyone what we’re doing here — we are making history, having great matches and moving forward with this women’s revolution. I just want to be champion, I want to make history. I am here, I am doing it and I want to make history.\n\n“Total Divas” returns to E! in the fall, in the mean time you catch Carmella Tuesdays on “SmackDown Live.”", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2017/06/WWE-Monday-Night-Raw-LaVar-and-Lonzo-Ball-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2014/05/SPORTS-100.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2016/07/Smackdown.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2017/07/WWE-Total-Divas-160x105.jpg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/07/Shane-McMahon-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE.jpg", "keywords": [], "authors": ["Debbie Emery", "Tony Maglio"], "canonical_link": "https://www.thewrap.com/wwe-diva-carmella-on-joining-total-divas-the-womens-revolution-in-wwe/", "title": "WWE Superstar Carmella on Joining 'Total Divas,' the 'Women's Revolution' in WWE", "meta_data": {"parsely-title": "‘Total Divas’ Star Carmella: WWE ‘Women’s Revolution’ Is Going Strong", "parsely-link": "https://www.thewrap.com/wwe-diva-carmella-on-joining-total-divas-the-womens-revolution-in-wwe/", "parsely-type": "post", "parsely-pub-date": "2017-07-25T14:12:17-07:00", "parsely-section": "tv", "parsely-author": "Debbie Emery", "parsely-tags": "brie-bella, carmella, nikki-bella, total-divas, wwe", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "\"It is a great time to be a woman in the WWE,\" the \"SmackDown Live\" Carmella star tells TheWrap", "news_keywords": "brie bella, carmella, nikki bella, total divas, wwe", "original-source": "https://www.thewrap.com/wwe-diva-carmella-on-joining-total-divas-the-womens-revolution-in-wwe/", "og": {"locale": "en_US", "type": "article", "title": "WWE Superstar Carmella on Joining 'Total Divas,' the 'Women's Revolution' in WWE", "description": "\"It is a great time to be a woman in the WWE,\" the \"SmackDown Live\" Carmella star tells TheWrap", "url": "https://www.thewrap.com/wwe-diva-carmella-on-joining-total-divas-the-womens-revolution-in-wwe/", "site_name": "TheWrap", "updated_time": "2017-07-26T00:42:34-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "https://www.facebook.com/thewrap/", "tag": "WWE", "section": "TV", "published_time": "2017-07-25T21:12:17-07:00", "modified_time": "2017-07-26T00:42:34-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "\"It is a great time to be a woman in the WWE,\" the \"SmackDown Live\" Carmella star tells TheWrap", "title": "WWE Superstar Carmella on Joining 'Total Divas,' the 'Women's Revolution' in WWE", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE.jpg", "creator": "@debemery"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘Total Divas’ Star Carmella: WWE ‘Women’s Revolution’ Is Going Strong", "sailthru.date": "2017-07-25T21:12:17+00:00", "sailthru.author": "Debbie Emery", "sailthru.tags": "wwe,nikki bella,total divas,brie bella,carmella", "sailthru.category": "tv,culture,sports", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2017/07/Carmella-WWE-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1501042337.0, "source": "https://www.thewrap.com", "summary": ""}