{"url": "https://en.wikipedia.org/wiki/Kim_Kardashian", "text": "American television and social media personality\n\nKimberly Kardashian West[2] (née Kimberly Noel Kardashian; born October 21, 1980) is an American media personality, model, businesswoman, socialite, and actress. Kardashian first gained media attention as a friend and stylist of Paris Hilton but received wider notice after a 2002 sex tape, Kim Kardashian, Superstar, with her then-boyfriend Ray J was released in 2007.[3] Later that year, she and her family began to appear in the E! reality television series Keeping Up with the Kardashians (2007–present). Its success soon led to the creation of spin-offs including Kourtney and Kim Take New York (2011–2012) and Kourtney and Kim Take Miami (2009–2013).\n\nKardashian has developed an online and social media presence, including hundreds of millions of followers on Twitter and Instagram.[4][5][6] She has released a variety of products tied to her name, including the 2014 mobile game Kim Kardashian: Hollywood, a variety of clothing and products, the 2015 photo book Selfish and her eponymous personal app. Her relationship with rapper Kanye West has also received significant media coverage; the couple married in 2014, and they have four children together.[7] As an actress, Kardashian has appeared in films such as Disaster Movie (2008), Deep in the Valley (2009) and Temptation: Confessions of a Marriage Counselor (2013).\n\nIn recent years, Kardashian has focused on her own businesses by founding KKW Beauty and KKW fragrance in 2017.[8] In 2019 she launched Skims which was previously called Kimono but the name was changed due to immediate backlash.[9] She has also become more politically active by lobbying president Donald Trump for prison reform and lobbying for Alice Marie Johnson to be granted clemency.[10] Kardashian is also planning to become a lawyer by doing a four-year law apprenticeship that is supervised by the law firm #cut50 at which Van Jones is a partner.[11][12]\n\nTime magazine included Kardashian on their list of 2015's 100 most influential people,[13] while Vogue described her in 2016 as a \"pop culture phenomenon.\"[14] Both critics and admirers have described her as exemplifying the notion of being famous for being famous.[15][16][17] She was reported to be the highest-paid reality television personality of 2015, with her estimated total earnings exceeding US$53 million.[18]\n\nEarly life\n\nKim Kardashian was born on October 21, 1980, in Los Angeles, California, the daughter of Robert and Kris (née Houghton).[19] She has an older sister, Kourtney, a younger sister, Khloé, and a younger brother, Rob.[20] Their mother is of Dutch, English, Irish, and Scottish ancestry,[21] while their father was a third-generation Armenian-American.[22] After their parents divorced in 1991, her mother married again that year, to Caitlyn Jenner,[A] the 1976 Summer Olympics decathlon winner.[23] Through their marriage, Kim Kardashian gained step-brothers Burton \"Burt\", Brandon, and Brody; step-sister Casey; and half-sisters Kendall and Kylie Jenner.[24]\n\nShe attended Marymount High School, a Roman Catholic all-girls school in Los Angeles.[25] In 1994, her father represented football player O. J. Simpson during his murder trial. Simpson is Kardashian's godfather.[26] Kardashian's father died in 2003 of cancer.[27] In her 20s, Kardashian was the close friend and stylist of socialite Paris Hilton, through whom she first garnered media attention.[4][28]\n\nCareer\n\nBeginnings (2003–2006)\n\nKardashian got her first stint in show-business as friend and stylist of Paris Hilton, appearing as guest on various episodes of the Hilton-starring reality television series The Simple Life, between 2003 and 2006.[29]\n\nBreakthrough with reality television (2006–2009)\n\nIn 2006, Kardashian entered the business world with her two sisters and opened the boutique shop D-A-S-H in Calabasas, California.[30] In February 2007, a sex tape made by Kardashian and Ray J in 2002 was leaked.[31][32] Kardashian filed a lawsuit against Vivid Entertainment, who distributed the film as Kim Kardashian, Superstar. She later dropped the suit and settled for a reported US$5 million, allowing Vivid to release the tape.[33][34] Several media outlets later criticized her and the family for using the sex tape's release as a publicity stunt to promote their upcoming reality show.[35][36]\n\nIn October 2007 Kardashian, in addition to her mother Kris Jenner, her step-parent Caitlyn Jenner, her siblings Kourtney, Khloé, and Rob Kardashian, and half-sisters Kendall and Kylie Jenner, began to appear in the reality television series Keeping Up with the Kardashians.[37] The series proved successful for E!, and has led to the creations of spin-offs including Kourtney and Kim Take New York and Kourtney and Kim Take Miami.[38] In one of the episodes, Kim discussed an offer from Playboy to appear nude in the magazine.[39] That December, Kardashian posed in a nude pictorial for Playboy.[40]\n\nIn 2008, she made her feature film debut in the disaster film spoof Disaster Movie, in which she appeared as a character named Lisa.[41][42] That same year, she was a participant on season seven of Dancing with the Stars, where she was partnered with Mark Ballas. Kardashian was the third contestant to be eliminated.[43] In January 2009, Kardashian made a cameo appearance during an episode of the sitcom How I Met Your Mother, in the episode \"Benefits\". In April, she released a workout DVD series through her television production company Kimsaprincess Productions, LLC which has seen the release of three successful workout videos, Fit in Your Jeans by Friday, with trainers Jennifer Galardi and Patrick Goudeau.[30][44][45] Kardashian played Elle in four episodes of the television series Beyond the Break.[46]\n\nKardashian became a guest host of WrestleMania XXIV and guest judge on America's Next Top Model in August of that year.[47] In September, Fusion Beauty and Seven Bar Foundation launched \"Kiss Away Poverty\", with Kardashian as the face of the campaign. For every LipFusion lipgloss sold, US$1 went to the Foundation to fund women entrepreneurs in the US.[48] The following month, she released her first fragrance self-titled \"Kim Kardashian\".[49][50] In December 2009, Kardashian made a guest star appearance on CBS's CSI: NY with Vanessa Minnillo.[51][52]\n\nEarly endorsements (2010–2013)\n\nIn 2010, Kardashian ventured into several new endorsement deals, including endorsing various food products for Carl's Jr.[53][54] In January 2010, she starred as Summa Eve in the film Deep in the Valley.[51] In April, Kardashian sparked controversy over the way she held a kitten for a photograph, holding it by the scruff of its neck.[55] With sisters Kourtney and Khloé, Kardashian is involved in the retail and fashion industries. They have launched several clothing collections and fragrances. Animal rights organization PETA criticized Kardashian for repeatedly wearing fur coats, and named her as one of the five worst people or organizations of 2010 when it came to animal welfare.[56] June saw Kardashian guest star with Khloé and Kourtney as themselves on the season three premiere episode of the series 90210.[57]\n\nOn July 1, 2010, the New York City branch of Madame Tussauds revealed a wax figure of Kardashian.[58] In November, Kardashian served as producer for The Spin Crowd, a reality television show about Command PR, a New York City public relations firm, run by Jonathan Cheban and Simon Huck. The show followed them as they settle into their new offices in Los Angeles. That month, she also appeared on season ten of The Apprentice.[59][60] Kim, Kourtney, and Khloé wrote an autobiography titled Kardashian Konfidential, which was released in stores on November 23, and appeared on New York Times's Best Seller List.[61]\n\nIn December 2010, Kardashian filmed a music video for a song titled \"Jam (Turn It Up)\". The video was directed by Hype Williams; Kanye West makes a cameo in the video.[62] Kardashian premiered the song during a New Year's Eve party at TAO Las Vegas on December 31, 2010.[63] The song was produced by The-Dream and Tricky Stewart. When asked if an album was in the works, Kardashian replied, \"There's no album in the works or anything—just one song we did for Kourtney and Kim Take New York, and a video Hype Williams directed, half of the proceeds we're giving away to a cancer foundation, because The-Dream's and one of my parents passed away from cancer. It's just all having fun—with a good cause\".[64] Jim Farber, writing for the Daily News, called the song a \"dead-brained piece of generic dance music, without a single distinguishing feature,\" and suggested that the single made Kardashian the \"worst singer in the reality TV universe.\"[65]\n\nThat month, the International Business Times reported that Kardashian's 2010 earnings were the highest among Hollywood-based reality stars, estimating them at $6 million.[66][67]\n\nIn April 2011, Kardashian released her third fragrance \"Gold\".[49] In March 2012, Kardashian debuted her fourth fragrance, titled \"True Reflection\", which she worked with the company Dress for Success to promote.[68] In April, E! renewed Keeping Up with the Kardashians for two additional seasons, in a deal reported to be worth $50 million.[69][70] In October 2012, Kardashian released her fifth fragrance, \"Glam\", which \"draws on the glamour of her Hollywood lifestyle\", and was made available through Debenhams.[71] In summer of 2012, Kardashian and her family filmed a music video in the Dominican Republic to Notorious B.I.G's song \"Hypnotize\".[72]\n\nIn the romantic drama Temptation: Confessions of a Marriage Counselor (2013), produced, written, and directed by Tyler Perry, Kardashian obtained the role of the co-worker of an ambitious therapist. While the film was a moderate box office success, with a worldwide gross of US$53.1 million,[73] critical response was negative and Kardashian won the Razzie Award for Worst Supporting Actress.\n\nFocus on social media (2014–present)\n\nKardashian in September 2014\n\nKardashian appeared on the cover, and in a pictorial in Paper's winter issue in 2014 photographed by Jean-Paul Goude.[74] On the cover, her nude buttocks are featured above the caption: \"Break the Internet\", which generated considerable comment in both social and traditional media.[75][76] The photos show Kardashian with her hair tied up in a bun, wearing only a pearl necklace, a pair of earrings and black satin gloves, and, on the cover, with her bare back facing the camera, holding a sequined gown below her bare, oiled-up buttocks, while smiling broadly at the camera.[77][78] A Time magazine writer commented that, unlike previous celebrities' nudes that represented the women's rebellion against repressed society and \"trying to tear down\" barriers, Kardashian's exhibition was \"just provocation and bluster, repeated images that seem to offer us some sort of truth or insight but are really just self serving. We want there to be something more, some reason or context, some great explanation that tells us what it is like to live in this very day and age, but there is not. Kim Kardashian's ass is nothing but an empty promise.\"[79] However, the stunt \"set a new benchmark\" in social media response,[80] and Paper's website received 15.9 million views in one day, compared with 25,000 views on an average day.[81][82]\n\nIn June 2014, Kardashian released a mobile game for iPhone and Android called Kim Kardashian: Hollywood. The objective of the game is to become a Hollywood star or starlet.[83] The game supports a free to play model, meaning the game is free to download, but charges for in-game items.[84] The game was a hit, earning US$1.6 million in its first five days of release.[84] In July, the game's developer Glu Mobile announced that the game was the fifth highest earning game in Apple's App Store.[84] Kardashian voiced the role of an alien in an episode of the adult animated series American Dad!, in season 11 (2014–15) in the episode titled \"Blagsnarst, A Love Story\" on September 21, 2014.[85][86] In May 2015, Kardashian released a portfolio book called Selfish, a 325-page collection of self-taken photos of herself.[87] In December 2015, Kardashian released an emoji pack for iOS devices called Kimoji.[88] The app was a best-seller, becoming one of the top 5 most bought apps that week.[88] In August 2015, Kardashian was the cover model for Vogue Spain.[89]\n\nAs of November 2016, as per CBC Marketplace and interviews with celebrity endorsement experts, Kim Kardashian was paid between $75,000 and $300,000 for each post that she made on Instagram, Facebook and Twitter endorsing beauty products like waist trainers, teeth whiteners as well as Coca-Cola and well known charities. Experts think that celebrities offer fake glimpses into their lives to make viewers fall for their advertising pitches, curated to look as though the viewer is catching them in a spontaneous moment when they are mostly staged.[90]\n\nIn June 2017 she launched her own beauty line, KKW Beauty and in November 2017 she launched her own fragrance line, KKW Fragrance.\n\nBy 2018, according to Business Insider, Kardashian was charging $720,000 per Instagram post. Even though engagement data indicates that her posts are worth slightly less,[91] she's regularly making headlines and this allows her to demand a premium above any calculated Instagram sponsored post price.\n\nKardashian made a cameo appearance in the heist film Ocean's 8, which was released on June 8, 2018.[92][93]\n\nIn 2019, Kardashian made waves at the Met Gala with her figure hugging corset-induced Thierry Mugler dress.[94][95]\n\nReception to product range\n\nIn June 2019, Kardashian launched a new range of shape wear called Kimono. Kardashian was heavily criticised over the name of the brand which critics argued disrespected Japanese culture and ignored the significance behind the traditional outfit. Following the launch of the range, the hashtag #KimOhNo began trending on Twitter and the mayor of Kyoto wrote to Kardashian to ask her to reconsider the trademark on Kimono. In response to public pressure, in July 2019, Kardashian announced that she would change the name.[96] However, Japanese trade minister Hiroshige Seko stated that he would still be dispatching patent officials for a meeting at the U.S. Patent and Trademark Office, and that Japan would keep an eye on the situation.[97] She later replaced the shapewear company to the name Skims.[98]\n\nPersonal life\n\nMarriages\n\nIn 2000, 19-year-old Kardashian eloped with music producer Damon Thomas.[99] Thomas filed for divorce in 2003. Kardashian later blamed their separation on physical and emotional abuse on his part[100] and said she was high on ecstasy during the ceremony.[101] Prior to the completion of her divorce, Kardashian began dating singer Ray J.[99]\n\nIn May 2011, Kardashian became engaged to NBA player Kris Humphries, then of the New Jersey Nets, whom she had been dating since October 2010.[102] They were married in a wedding ceremony on August 20 in Montecito, California.[103] Earlier that month, she had released her \"wedding fragrance\" called \"Kim Kardashian Love\" which coincided with her own wedding.[49][104] A two-part TV special showing the preparations and the wedding itself aired on E! in early October 2011, amidst what The Washington Post called a \"media blitz\" related to the wedding.[105] After 72 days of marriage, she filed for divorce from Humphries on October 31, citing irreconcilable differences.[106] Several news outlets surmised that Kardashian's marriage to Humphries was merely a publicity stunt to promote the Kardashian family's brand and their subsequent television ventures.[107] A man professing to be her former publicist, Jonathan Jaxson, also claimed that her short-lived marriage was indeed staged and a ploy to generate money. Kardashian filed suit against Jaxson, saying his claims were untrue, and subsequently settled the case that included an apology from Jaxson.[108] A widely circulated petition asking to remove all Kardashian-related programming from the air followed the split.[109] The divorce was subject to widespread media attention.[110]\n\nKardashian began dating rapper and longtime friend Kanye West in April 2012, while still legally married to Humphries.[111] Her divorce was finalized on June 3, 2013,[112] Kardashian and West became engaged on October 21, Kardashian's 33rd birthday,[113] and married on May 24, 2014, at Fort di Belvedere in Florence, Italy.[114] Her wedding dress was designed by Riccardo Tisci of Givenchy[115] with some guests' dresses designed by designer Michael Costello.[116] The couple's high status and respective careers have resulted in their relationship becoming subject to heavy media coverage; The New York Times referred to their marriage as \"a historic blizzard of celebrity.\"[7]\n\nReligion\n\nKim Kardashian is a Christian and has described herself as \"really religious\".[117] She was educated in Christian schools of both the Presbyterian and Roman Catholic traditions.[117] In October 2019 she was baptized in an Armenian Apostolic ceremony at the baptistery in the Etchmiadzin Cathedral complex and given the Armenian name Heghine (Հեղինե).[118][119]\n\nIn April 2015, Kardashian and West traveled to the Armenian Quarter of the Old City in Jerusalem to have their daughter North baptized in the Armenian Apostolic Church, one of the oldest denominations of Oriental Orthodox Christianity. The ceremony took place at the Cathedral of St. James.[120] Khloe Kardashian was appointed the godmother of North.[121] In October 2019, Kim baptized her three younger children at the baptistery in the Etchmiadzin Cathedral complex, Armenia's mother church.[122][123] Psalm was given the Armenian name Vardan, Chicago—Ashkhen and Saint—Grigor.[124]\n\nHealth and pregnancies\n\nKardashian and husband Kanye West have four children: daughter North (born June 15, 2013),[125] son Saint (born December 5, 2015),[126] daughter Chicago (born January 15, 2018),[127][128] and son Psalm (born May 9, 2019).[129][130][131]\n\nKardashian has been open about her difficult pregnancies. She suffered pre-eclampsia during her first pregnancy, which forced her to deliver at 34 weeks. She also suffered placenta accreta after delivery, eventually having to have surgery to remove the placenta and subsequent scar tissue.[132] After her second pregnancy, her doctors advised against trying to become pregnant again.[133] The couple's third and fourth child were born via surrogacy.\n\nKardashian began suffering from psoriasis at the age of 30.[134] She was diagnosed with carpal tunnel syndrome in late 2017.[135]\n\nWealth\n\nKardashian in Australia for the E! News: Red carpet and dinner in 2012\n\nIn May 2014, Kardashian was estimated to be worth US$45 million.[136] In 2015, Forbes reported she had \"made more this year than ever as her earnings nearly doubled to $53 million from 2014's $28 million\", and reported that she \"has monetized fame better than any other\".[137] Much of her income includes wholesale earnings of the Sears line, the Kardashian Kollection, which brought in $600 million in 2013 and the Kardashian Beauty cosmetics line, Kardashian-branded tanning products, the boutique-line DASH, as well as sponsored social media posts which are collectively worth $300,000-500,000 per post.[138][139] As of July 2018, Kardashian is worth US$350 million.[140] Combined with husband Kanye West's net worth of $160 million, their total household net worth is an estimated $510 million, making them one of the richest couples in the entertainment industry.[141] Kardashian does not receive alimony payments from either of her first two marriages.[142]\n\nAdvocacy\n\nDuring an interview with Caity Weaver of GQ for the July 2016 issue, Kardashian described herself as a Democrat, and declared support for Hillary Clinton in the 2016 US Presidential Election.[143]\n\nKardashian has expressed pride in her Armenian and Scottish ancestry.[144][145] She is not a citizen of either country and does not speak Armenian.[146] She has advocated for the recognition of the Armenian Genocide on numerous occasions and encouraged President Barack Obama and the United States government to consider its acknowledgement.[147][148][149] In April 2015, Kardashian traveled to Armenia with her husband, her sister Khloé, and her daughter North and visited the Armenian Genocide memorial Tsitsernakaberd in Yerevan.[150] In April 2016, Kardashian wrote an article on her website condemning The Wall Street Journal for running an advertisement denying the Armenian Genocide.[151] During her visit to Armenia in 2019, she stated that she \"talk[s] about it [the Armenian Genocide] with people internally at the White House.\" However, she added that \"haven’t had a private conversation\" with President Donald Trump about it.[152]\n\nKardashian has also worked in the area of prison reform, advocating for the commutation of the sentence of Chris Young and also of Alice Marie Johnson, a woman who received a life sentence for a first-time drug offense as the leader of a major cocaine ring in Tennessee[153][154][155] which was granted by President Donald Trump in June 2018.[156][157] Along with Van Jones and Jared Kushner, she was instrumental in persuading President Trump to support the First Step Act, which enacted major reforms in the US prison system. Van Jones later stated that without Kardashian, the act would have never passed because it would not have received the president's support. It was later passed by a great majority in the US Senate.[158][159][160] In April 2019, it was revealed in Vogue that Kardashian was studying to pass the bar exam; instead of attending law school, she is \"reading the law.\"[161]\n\nIn January 2017, she tweeted a table of statistics that went viral, highlighting statistics that show that gun violence in the United States kills 11,737 people annually while terrorism in the United States kills 14 people annually. In January 2018, the World Economic Forum awarded it the \"International Statistic of the Year\" for 2017.[162]\n\nOn a trip to Uganda in October 2018, she met with President Yoweri Museveni with her husband. They had a press conference, and Kanye talked about tourism in Uganda. They were criticized for meeting the Museveni due to his being a dictator and his recent crackdown on the opposition and the Ugandan LGBT community.[163][164][165]\n\nParis robbery\n\nOn October 2, 2016, while attending Paris Fashion Week, Kardashian was robbed at gunpoint in the apartment where she was staying. Five individuals, dressed as police officers, bound and gagged her, then stole $10 million worth of jewelry.[166] The thieves got in her residence by threatening the concierge. Once they accessed Kardashian's room, they held a gun to her head, tying her wrists and legs and wrapping duct tape around her mouth as a gag.[167] Kardashian, who was placed in the bathtub, was physically unharmed and reportedly begged for her life.[168][169][170] She managed to wriggle her hands free from the plastic ties around her wrists and scream for help. The thieves escaped.[171] On October 6, 2016, it was revealed that filming for the next season of Keeping up with the Kardashians had been placed \"on hold indefinitely\" after the robbery.[172] After the robbery was announced, several critics expressed skepticism about whether it was staged or not, with some even drawing comparison to Olympic swimmer Ryan Lochte's recent false robbery claim.[173][174] On October 10, 2016, video was released showing Kardashian immediately after the robbery, as police began conducting their investigation. In the video, she is seen using the cell phone that she had reported stolen, and did not have any of the markings she claimed from being bound by her captors, prompting more questions as to whether or not the events were staged.[175] In response, Kardashian filed lawsuits against several media outlets the following day, and secured a gag order to get the video removed from any articles due to it being part of an active police investigation.[176][177][178] On October 25, 2016, Kardashian dropped the lawsuit, prompting more criticism that the robbery was a ploy to generate media attention.[179][180] Production resumed on Keeping Up with the Kardashians on October 26.[181]\n\nFilmography\n\nAs herself\n\nAs actress\n\nAs producer\n\nIn music videos\n\nDiscography\n\nList of singles, with selected chart positions Title Year Peak chart\n\npositions Album US\n\n[205] US\n\nHeat.\n\n[206] \"Jam (Turn It Up)\" 2011 —[A] 21 Non-album single \"—\" denotes releases that did not chart or were not released in that territory.\n\nAwards and nominations\n\nTeen Choice Awards\n\nOther awards\n\nBibliography\n\nKardashian, Kim; Kardashian, Kourtney; Kardashian, Khloé (2010). Kardashian Konfidential . St. Martin's Press. ISBN 978-0-312-62807-9 .\n\nKardashian, Kim (2015). Kim Kardashian Selfish. Universe Publishing. ISBN 978-0789329202 .\n\nSee also\n\n^ Billboard Hot 100, but peaked at number 17 on the \"Jam (Turn It Up)\" did not enter theHot 100, but peaked at number 17 on the Bubbling Under Hot 100 chart.\n\nA ^ Jenner changed her name to Caitlyn due to gender transition in 2015.[219]\n\nB ^ Shared with Kourtney, Khloe, Rob and Kris\n\nC ^ Shared with Kourtney, Khloe, Rob and Kris\n\nD ^ Shared with Kourtney, Khloe, Rob and Kris\n\nE ^ With Kourtney, Khloe, Rob, Kris, Kendall, Kylie and Caitlyn (then Bruce)", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kim_Kardashian_West%2C_Parramatta_Westfield_Sydney_Australia_-_15035243919_%28cropped%29.jpg/170px-Kim_Kardashian_West%2C_Parramatta_Westfield_Sydney_Australia_-_15035243919_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/a/a0/Kim_Kardashian_2018_5.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/President_Trump_Meets_with_Sentencing_Commutation_Recipients_%2849624188912%29.jpg/220px-President_Trump_Meets_with_Sentencing_Commutation_Recipients_%2849624188912%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Kim_Kardashian_signature.svg/80px-Kim_Kardashian_signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Kim_Kardashian_2018_5.png/220px-Kim_Kardashian_2018_5.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Kim_Kardashian_2010.jpg/170px-Kim_Kardashian_2010.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Kim_Kardashian_5%2C_2012.jpg/170px-Kim_Kardashian_5%2C_2012.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Kim_Kardashian_2018_5.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kim_Kardashian", "title": "Kim Kardashian", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Kim_Kardashian_2018_5.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}