{"url": "www.dw.com/en/amal-and-george-clooney-welcome-twins/a-39139204", "text": "George and Amal Clooney are now parents, having welcomed their twins, a boy and a girl, on Tuesday.\n\n\"Ella, Alexander and Amal are all healthy, happy and doing fine,\" said their publicist Stan Rosenfield, who jokingly added that \"George is sedated and should recover in a few days.\"\n\nThe couple join a host of celebrity families with twins, including Angelina Jolie and Brad Pitt, Mariah Carey and Nick Cannon, Jennifer Lopez and Marc Anthony - and, very soon, Beyoncé and Jay Z.\n\nGeorge Clooney, the 56-year-old Oscar-winning actor, and Amal Alamuddin, a 39-year-old human rights lawyer, married in Italy in 2014 after meeting through a mutual friend. Ella and Alexander are their first children.\n\nSocial media users were quick to chime in on the couple's choice of traditional names, as opposed to the unusual names often chosen by celebrities.\n\nPhotos of the Clooney twins have not yet been released.\n\nThe next highly anticipated celebrity birth will be singer Beyoncé and rapper Jay Z's twins. Though they have not made their due date public, the birth is expected to take place imminently.\n\nClick through the gallery below for more celebrities with twins.\n\nStars with (or expecting) twins Two and two makes four For the longest time, George Clooney was Hollywood's most eligible bachelor - until he married Amal, a British-Lebanese lawyer, in 2014. Their twins, Ella and Alexander, were born on June 6. Their publicist quipped, Ella, Alexander and Amal are all healthy, happy and doing fine. George is sedated and should recover in a few days.\"\n\nStars with (or expecting) twins A mom again Madonna announced in February on Instagram that she has adopted twin sisters from Malawi, \"overjoyed that they are now part of our family.\" The 58-year-old US pop superstar has already adopted two children from the impoverished African country, David Banda and Mercy James. Her eldest daughter, Lourdes Leon (picture) is 20, and Rocco Ritchie is 16.\n\nStars with (or expecting) twins Little big sister Blue Ivy, 5, is still mama Beyonce and papa Jay-Z's one and only little princess. But she'll have to make room for two siblings soon: in February, Beyonce announced her pregnancy via Instagram - and the news went around the world.\n\nStars with (or expecting) twins Adopted and biological children The above snapshot of Angelina Jolie, Brad Pitt and their family was taken in happier times. Of their six children, Vivienne Marcheline and Knox Leon - born 2008 - are fraternal twins. In the meantime, \"Brangelina\" have divorced, but not without a messy custody battle.\n\nStars with (or expecting) twins Royal two-pack Royal celebrities also enjoy the double of twins: Danish Crown Prince Frederik and his wife Mary already had two children when a baby prince and princess made the family complete in 2011: the twins Vincent and Josephine, fourth and fifth in the line of succession.\n\nStars with (or expecting) twins Mom of multiples In 2004, Hollywood actress Julia Roberts had fraternal twins, Hazel Patricia and Phinnaeus Walter, called \"Finn.\" To give them and their younger brother a normal childhood, Roberts and her husband have successfully kept their children out of the spotlight.\n\nStars with (or expecting) twins A long wait US singer and actress Jennifer Lopez, 38 at the time, gave birth to twins: Emme Maribel - who looks just like her famous mom - and Maximilian David. They both turned nine in 2016. Author: Silke Wünsch (db)\n\n\n\nkbm/eg (AFP, AP)", "images": ["http://www.dw.com/image/53050349_301.jpg", "http://www.dw.com/image/17679573_303.jpg", "http://www.dw.com/image/53004773_301.jpg", "http://www.dw.com/image/52449903_301.jpg", "http://www.dw.com/image/47140846_301.png", "http://www.dw.com/image/46767803_301.jpg", "http://www.dw.com/image/37381392_303.jpg", "https://logs1242.xiti.com/hit.xiti?s=510544&s2=2&p=TOP+STORIES::Culture::Lifestyle::Amal+and+George+Clooney+welcome+twins&di=&an=&ac=&x1=1&x2=2&x3=39139204&x4=30526&x5=Amal+and+George+Clooney+welcome+twins&x6=&x7=http%3A%2F%2Fwww.dw.com%2Fen%2Famal-and-george-clooney-welcome-twins%2Fa-39139204&x8=&x9=20170607&x10=TOP+STORIES::Culture::Lifestyle&x13=1&x14=&x15=19990010&x16=null&x17=&x18=&x20=null", "http://www.dw.com/image/44742705_301.jpg", "http://www.dw.com/image/19492378_301.jpg", "http://www.dw.com/image/19564312_303.jpg", "http://www.dw.com/image/39136521_303.jpg", "https://www.dw.com/image/39136521_304.jpg", "http://www.dw.com/image/38850894_301.jpg", "https://www.facebook.com/tr?id=157204581336210&ev=PageView&noscript=1", "http://www.dw.com/cssi/dwlogo-print.gif", "http://www.dw.com/image/37273222_303.jpg", "http://www.dw.com/image/37490802_303.jpg", "http://www.dw.com/image/37385795_303.jpg", "http://www.dw.com/image/37385442_303.jpg"], "top_img": "https://www.dw.com/image/39136521_304.jpg", "keywords": [], "authors": ["Deutsche Welle", "Www.Dw.Com", "Author", "Silke Wünsch", "Db"], "canonical_link": "https://www.dw.com/en/amal-and-george-clooney-welcome-twins/a-39139204", "title": "Amal and George Clooney welcome twins", "meta_data": {"robots": "index, follow, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "revisit-after": "1 days", "publisher": "Deutsche Welle (www.dw.com)", "copyright": "© 2020 Deutsche Welle (www.dw.com)", "author": "Deutsche Welle (www.dw.com)", "apple-itunes-app": "app-id=498833085", "google-play-app": "app-id=com.idmedia.android.newsportal", "language": "en_GB", "fb": {"pages": 210354862357400, "admins": 100004135624835}, "keywords": "George Clooney,Amal Clooney,celebrities,children,lifestyle", "news_keywords": "George Clooney,Amal Clooney,celebrities,children,lifestyle", "description": "Ella and Alexander were born to the celebrity couple Tuesday morning - one of the most hotly anticipated births since the Jolie-Pitt twins. George Clooney was \"sedated,\" the couple joked, while mom and babies were fine.", "og": {"description": "Ella and Alexander were born to the celebrity couple Tuesday morning - one of the most hotly anticipated births since the Jolie-Pitt twins. George Clooney was \"sedated,\" the couple joked, while mom and babies were fine.", "url": "https://www.dw.com/en/amal-and-george-clooney-welcome-twins/a-39139204", "site_name": "DW.COM", "title": "Amal and George Clooney welcome twins | DW | 07.06.2017", "image": {"identifier": "https://www.dw.com/image/39136521_304.jpg", "width": 940, "height": 529}}, "twitter": {"card": "summary_large_image", "site": "@dwnews", "title": "Amal and George Clooney welcome twins", "image": "https://www.dw.com/image/39136521_401.jpg"}}, "movies": [], "publish_date": null, "source": "http://www.dw.com", "summary": ""}