{"url": "https://www.self.com/story/biggest-fitness-trends-of-2018", "text": "While there's no \"right\" way to get sweaty, there's no question that fitness trends can influence how people work out. And with the American College of Sports Medicine's annual survey, we're getting a look at what's going to be big this year. They've pinpointed the top fitness trends of 2018 to watch for, and chances are, if you haven't gotten in on any of them yet, you just might soon.\n\nPublished in the ACSM’s Health & Fitness Journal, more than 4,000 fitness professionals (including trainers, exercise physiologists, and fitness directors) gave their thoughts on the trends they think will be big in 2018. The survey respondents represented organizations including the American College of Sports Medicine, American Council on Exercise, National Council on Strength and Fitness, and The Cooper Institute. The responses were international, too, coming from 41 countries across the world and nearly every continent.\n\nIn the survey, the ACSM made an important distinction between a trend and a fad to the participants. While a trend was defined as “a general development or change in a situation or in the way that people are behaving,\" a fad was \"a fashion that is taken up with great enthusiasm for a brief period.\" (Shout-out to '80s Jazzercise and '90s Tae Bo.) For the purposes of this survey, the ACSM was interested in trends, which have more staying power. Survey respondents were asked to rank 40 potential fitness trends on a 10-point scale, where 1 was least likely to be a trend in 2018, and 10 was most likely to be a trend in 2018.\n\nHere are the top 10 fitness trends of 2018, according to the pros—and what you need to know about each one.\n\n1. High-Intensity Interval Training\n\nHigh-intensity interval training (or HIIT) took the top spot in this year's survey (it was also number one in 2014). A HIIT training session involves bursts of maximum-effort, very hard work (typically about 20 to 90 seconds), followed by a period of low-intensity recovery. The goal is to recover enough that you can go hard again during your next work interval. If you're a beginner, you might have longer rest intervals, or work intervals that are challenging but not at maximum effort.\n\nThe ACSM says HIIT workouts are typically 30 minutes or less, although they can be longer. But while they may be short, they definitely aren't sweet. As the name suggests, HIIT workouts are designed to be high intensity, and a major part of the appeal is that they're an incredibly efficient and effective way to get your cardio in and burn lots of calories (if that's something that matters to you) without requiring a ton of time.\n\nThat said, because they're so intense, you shouldn't be doing HIIT workouts every day. This can lead to overtraining and an increased risk of injury (which survey respondents expressed concerns about, according to the ACSM). Read more about how to correctly do HIIT workouts here.\n\n2. Group Training\n\nGroup training (or group fitness classes) didn't make the top 20 trends until 2017, but their popularity is rapidly rising. The ACSM defines group training as a workout for five or more people led by an instructor, designed to be motivational and effective for people of different fitness levels. This could be anything from trendy HIIT classes like OrangeTheory Fitness, to dance cardio classes, to old-school step classes at the YMCA.\n\nNo matter here are plenty of benefits of group fitness classes. They can be a great way to try a new workout or mix up your routine (many boutique fitness studios offer free or discounted first classes, as a bonus). There's also a social aspect—classes can be a fun way to sweat it out with friends or meet new people. Plus, when you sign up for a class, you're committing to your workout, which can help you stay on track with your routine.\n\n3. Wearable Technology\n\nActivity trackers, smart watches, and heart rate monitors are as popular as ever—if you're into seeing your workouts by the numbers, wearable technology can give you interesting feedback about how you move. Many estimate your steps, sleep, standing time, calories burned, and time spent working out.", "images": ["https://media.self.com/photos/57e1f1ac431d338e64f83ffa/1:1/w_90%2Cc_limit/alexa-tucker-1.jpg", "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/4:3/w_2560%2Cc_limit/hiit-workout-benefits.jpg", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/w_1280,c_limit/hiit-workout-benefits.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg"], "top_img": "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/w_1280,c_limit/hiit-workout-benefits.jpg", "keywords": [], "authors": ["Alexa Tucker", "Alexa Tucke"], "canonical_link": "https://www.self.com/story/biggest-fitness-trends-of-2018", "title": "The 10 Biggest Fitness Trends of 2018", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Alexa Tucker", "copyright": "Copyright (c) Condé Nast 2020", "description": "The  American College of Sports Medicine's annual survey found the top fitness trends of 2018, according to professionals. Here's what to watch for this year.", "id": "5a4ceee183ab3f54feacfc57", "keywords": "fitness,news,fitness trends,fitness news,acsm", "news_keywords": "fitness,news,fitness trends,fitness news,acsm", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a4ceee183ab3f54feacfc57", "parsely-metadata": "{\"description\":\"The  American College of Sports Medicine's annual survey found the top fitness trends of 2018, according to professionals. Here's what to watch for this year.\",\"image-16-9\":\"https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/16:9/w_1000,c_limit/hiit-workout-benefits.jpg\",\"image-1-1\":\"https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/1:1/w_1000,c_limit/hiit-workout-benefits.jpg\"}", "og": {"description": "Learn what these rising trends can do for you.", "image": "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/w_1280,c_limit/hiit-workout-benefits.jpg", "site_name": "SELF", "title": "The 10 Biggest Fitness Trends of 2018", "type": "article", "url": "https://www.self.com/story/biggest-fitness-trends-of-2018"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Learn what these rising trends can do for you.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/w_1280,c_limit/hiit-workout-benefits.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "The 10 Biggest Fitness Trends of 2018"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}