{"url": "https://abcnews.go.com/GMA/Culture/prince-harry-meghan-markles-royal-wedding/story?id=53312776", "text": "Everything you need to know about Prince Harry and Meghan Markle's royal wedding Harry and Markle will wed on May 19 at Windsor Castle.\n\n\u0097 -- Britain's biggest royal wedding in years -- the union of Prince Harry and Meghan Markle -- is finally here!\n\nThe couple’s May 19 wedding at St. George's Chapel will be a public affair, with TV cameras allowed inside the wedding ceremony and more than 2,000 members of the public invited to watch the carriage procession outside after the wedding.\n\nPrince Harry and Meghan Markle pose for photographers in the grounds of Kensington Palace in London, following the announcement of their engagement, Nov. 27, 2017. Matt Dunham/AP, FILE\n\nHere are all the details you need to know for Harry and Markle's wedding day.\n\nHow you can watch the wedding\n\nIn addition to the cameras inside St. George’s Chapel for the ceremony, the order of the service will be published online on Saturday so the public can follow along.\n\nCameras will also line the carriage procession route in Windsor.\n\nABC News and \"GMA\" will have special coverage from 5 to 10 a.m. ET live from Windsor, England.\n\n\"GMA\" co-anchor Robin Roberts and \"World News Tonight\" anchor David Muir, along with a team of reporters and royal experts, will have live updates and colorful commentary from Windsor and London.\n\nYou don't need a TV either. The five hours of special coverage will be available to stream on ABC News' digital platforms including, ABCNews.com and GoodMorningAmerica.com, mobile apps, social platforms and over-the-top (OTT) services.\n\nReady to throw a royal wedding viewing party? Click HERE for the ultimate guide.\n\nPrince Charles will walk Markle down the aisle\n\nPrince Charles will walk Markle from the quire, the area of St. George’s Chapel where the clergy and choir sit, to Harry. The procession in the nave, the central part of the church, will include Markle, the Dean of Windsor and Markle’s bridesmaids and page boys.\n\nMarkle originally asked her dad, Thomas Markle Sr., to walk her down the aisle but chose her soon-to-be father-in-law after her father became unable to attend the wedding.\n\nMarkle, 36, confirmed in a statement that her dad, who lives in Mexico, will not attend the wedding due to health concerns.\n\nWho's who in the wedding party\n\nMarkle will not have a maid of honor by her side, as she did not want to single out one of her close circle of friends, sources told ABC News.\n\nShe will though have bridesmaids and page boys, all children, by her side at her wedding.\n\nWilliam and Kate's children -- Prince George and Princess Charlotte -- will take center stage at the wedding as a page boy and bridesmaid, respectively.\n\nPrince William, Duke of Cambridge, Prince George, Catherine, Duchess of Cambridge and Princess Charlotte of Cambridge, before departing from Hamburg airport, July 21, 2017 in Hamburg, Germany. Karwai Tang/WireImage via Getty Images\n\nAlso joining Charlotte and George in the wedding party will be the three children of Markle's best friend, entrepreneur and style adviser Jessica Mulroney.\n\nIvy Mulroney, 4, will serve as a bridesmaid, while her older brothers, 7-year-old twins Brian and John Mulroney, will join George as page boys.\n\nAlso serving as a page boy will be Jasper Dyer, the 6-year-old son of Harry's mentor and close friend, Capt. Mark Dyer.\n\nJoining Charlotte and Ivy as bridesmaids will be two of Harry's goddaughters -- 3-year-old Florence van Cutsem and 2-year-old Zalie Warren -- and two of Markle's goddaughters, 7-year-old Rylan Litt and her 6-year-old sister, Remi Litt.\n\nWilliam will serve as best man on May 19, just as Harry served as best man at William and Kate's wedding in 2011.\n\nPrince William, Duke of Cambridge and Catherine, Duchess of Cambridge greet well-wishers next to members of their family on the balcony at Buckingham Palace on April 29, 2011 in London. George Pimentel/WireImage/Getty Images\n\nWho will design Markle's dress?\n\nA top contender for designing Markle's gown is the design duo behind Ralph & Russo.\n\nAustralian-born designers Tamara Ralph and Michael Russo drew the spotlight when Markle chose their jaw-dropping $75,000 gown for her engagement photos with Harry last December.\n\nOther possibilities for the coveted design assignment have included Christopher Bailey, the visionary behind the iconic British brand Burberry, British designer Stella McCartney, Canadian designer Erdem Moralioglu, and Roland Mouret, a close friend of Markle's.\n\nDesigner Roland Mouret and actress Meghan Markle attend the Roland Mouret private dinner at Corkin Gallery on April 28, 2016 in Toronto. George Pimentel/WireImage/Getty Images\n\nBritish designer Victoria Beckham, whose sweater Markle wore in her engagement photos with Harry, has denied she is creating Markle's dress.\n\n\"Sadly not, but I'm sure she will look incredible in whatever she wears,\" Beckham said on the April 12th episode of CBS' \"The Late Late Show With James Corden.\"\n\nMarkle had her first fitting with the unnamed designer in January at Kensington Palace, royal reporter Omid Scobie told ABC News at the time.\n\nMarkle's mom's important role\n\nMarkle’s mom, Doria Ragland, is expected to be the only member of her family attending the wedding. She will accompany Markle by car from her overnight location to Windsor Castle on the day of the wedding.\n\nMeghan Markle and mother Doria Ragland attend the Closing Ceremony on day 8 of the Invictus Games Toronto 2017 on Sept. 30, 2017 in Toronto. Samir Hussein/WireImage/Getty Images\n\nRagland, a Los Angeles-based yoga instructor and social worker, has spent the days before the wedding meeting Harry’s royal relatives and Harry and Markle’s closest friends in the U.K.\n\nFrom left, Britain's Queen Elizabeth II, Prince Charles, Camilla, Duchess of Cornwall, Prince William, Duke of Cambridge, and Catherine, Duchess of Cambridge attend a Commonwealth Day Service at Westminster Abbey in central London on March 12, 2018. In second row from left is Prince Harry and fiance Meghan Markle. POOL/Paul GroverPAUL GROVER/AFP/Getty Images\n\nPrincess Diana's sentimental influence\n\nPrincess Diana's memory will be kept alive at the wedding through the presence of her three siblings.\n\nLady Jane Fellowes, Diana's sister, will deliver the reading at the wedding.\n\nBoth Markle and Harry have said how important it is that Harry's late mother be included in their wedding.\n\nPrince Harry, center, with his mother, Diana, Princess of Wales and his brother Prince William, in September 1995. Anwar Hussein/Getty Images\n\n\"I think she would be over the moon, jumping up and down, so excited for me,\" Harry said when his engagement to Markle was announced. \"But then, as I said, [she] would've probably been best friends with Meghan.\"\n\nMarkle's engagement ring features two diamonds from Diana's personal collection.\n\n\"The little diamonds on either side are from my mother's jewelry collection to make sure that she's with us on this crazy journey together,\" Harry said in November.\n\nLocation, location, location\n\nHarry and Markle will wed at St. George’s Chapel on the grounds of Windsor Castle, about 22 miles outside of London.\n\nSt. George's Chapel is a smaller venue than Westminster Abbey, where Prince William and Kate tied the knot in 2011, and St. Paul's Cathedral, where Prince Charles and Diana wed in 1981.\n\nA general view shows St George's Chapel at Windsor Castle, west of London, on Feb. 11, 2018. Dominic Lipinski/AFP/Getty Images\n\nThe chapel, which can seat 800 people, is where Harry was baptized in 1984. It is also where Harry's father, Prince Charles, and Camilla, Duchess of Cornwall, held a service of prayer and dedication at the chapel in 2005 following their marriage at Guild Hall.\n\nThe last royal wedding to be held at St. George's Chapel was a decade ago, when Peter Phillips wed Autumn Kelly in May 2008, according to the chapel's website.\n\nWhere Harry and Markle will stay\n\nThe couple will stay at separate hotels on the eve of their wedding.\n\nHarry will be joined by his best man, William, at the Dorchester Collection's Coworth Park. Markle and her mother will stay at Cliveden House Hotel, on the National Trust's Cliveden Estate, according to Kensington Palace.\n\nWedding day lineup\n\nThe wedding will begin at noon local time, 7 a.m., ET, on May 19.\n\nThe Right Rev. David Conner, the dean of Windsor, will conduct the wedding service. The Most Rev. Justin Welby, the archbishop of Canterbury, who baptized and confirmed Markle, will officiate when the couple takes their marriage vows.\n\nThe Most Reverend Michael Bruce Curry, the 27th Presiding Bishop and Primate of The Episcopal Church, will give the address at the wedding.\n\nHarry and William will arrive by foot, entering through the chapel's west steps and walking past the crowds gathered outside the chapel on their way in.\n\nMarkle will also enter the chapel through the west steps, joined by some of the bridesmaids and page boys.\n\nFollowing the hour-long wedding ceremony, the couple will meet in the chapel's Horseshoe Cloisterwith with 200 representatives of charities for which Harry has served as patron.\n\nHarry and Markle plan to undertake a carriage procession that will start at St. George's Chapel, leave Windsor Castle via Castle Hill, continue along High Street through Windsor Town before returning to Windsor Castle on a route called the Long Walk.\n\nA view of the Long Walk at Windsor Castle, Berkshire, as storm Emma brought snow and winds to the area, March 1, 2018. Steve Parsons/PA Wire/PA Images\n\nThey will be waved off on their carriage ride by members of the Royal Family. The guests at the wedding service will observe the sendoff of the carriage procession.\n\nAfter the carriage procession, the newlyweds will attend a lunchtime reception, hosted by Queen Elizabeth, at St. George's Hall, where they will rejoin their wedding guests.\n\nIn the evening, a smaller group of 200 guests will attend a reception hosted by Harry’s father, Prince Charles, at Frogmore House.\n\nFrogmore House, also on the grounds of Windsor Castle, is the location Markle and Harry chose for their intimate engagement photos released by Kensington Palace in December.\n\nBoth receptions will be closed to the public but there may be a second glimpse of Markle and Harry when they depart Windsor Castle for Frogmore House in the evening.\n\nThe wedding cake's California connection\n\nHarry and Markle selected pastry chef Claire Ptak, owner of Violet Bakery in Hackney, East London, to design their wedding cake.\n\nPtak, like Markle, was raised in California before moving to London. Her bakery is notable for using seasonal and organic ingredients in cakes.\n\nPtak is creating a lemon elderflower cake with buttercream icing and fresh flowers as decorations, according to Kensington Palace.\n\nThe choice of a lemon elderflower cake is a departure from the royal tradition of serving British fruit cake on the wedding day.\n\nWilliam and Kate had two cakes on their wedding day in 2011, a traditional eight-tier fruit cake created by chef Fiona Cairns and a chocolate biscuit cake from a beloved Buckingham Palace recipe.\n\nSee the gilded wedding invitations\n\nRoughly 600 invitations to Harry and Markle's wedding have been issued, Kensington Palace announced in late March.\n\nInvitations for Prince Harry and Meghan Markle's wedding in May, after they have been printed at the workshop of Barnard and Westwood in London, March 22, 2018. Prince Harry and Meghan will get married at St George's Chapel in Windsor Castle on Saturday May 19, 2018. Victoria Jones/Pool via AP\n\nThe invitations are printed in gold and black on English card using American ink, a process that some saw as a nod to Markle's American roots.\n\nIssued “in the name of His Royal Highness The Prince of Wales,\" each invitation is accented with gilded edges and features The Three Feather Badge of The Prince of Wales, according to Kensington Palace. The names of invited guests were added by a calligraphy printer.\n\nLottie Small uses the die stamping press at the workshop of Barnard and Westwood in London, March 22, 2018. The company is printing the invitations for Prince Harry and Meghan Markle's upcoming wedding. Victoria Jones/Pool via AP\n\nThe invitations were produced by Barnard & Westwood, a London-based fine printers and bookbinders company that has been making royal invitations since 1985.\n\nThe man behind the camera\n\nHarry and Markle have selected Alexi Lubomirski to be the official photographer at their wedding.\n\nAlexi Lubomirski has been chosen by Prince Harry and Meghan Markle to be the official photographer at their wedding next month, April 13, 2018. PA Wire/AP\n\nLubomirski, a renowned portrait and fashion photographer, will take the official photographs at Windsor Castle following Harry and Markle's wedding at St George's Chapel.\n\nLubomirski is a former assistant to Mario Testino, who was a favorite photographer of Harry's mother, the late Princess Diana.\n\nHe was also selected by Harry and Markle to take their engagement photos at Frogmore House, Windsor, that were released by Kensington Palace in December.\n\nMarkle's favorite bloom in the wedding flowers\n\nThe wedding floral displays in St. George's Chapel will include white garden roses foxgloves and peonies, Markle’s favorite bloom, as well as local branches of beech, birch, and hornbeam.\n\nMarkle and Harry have chosen Philippa Craddock to design the flowers for both the church service at St. George’s Chapel and the wedding reception at St. George’s Hall hosted by Queen Elizabeth.\n\nCraddock, based in Fulham, is one of the most notable florists in London, with clients including Kensington Palace, Hampton Court Palace, Alexander McQueen, Christian Dior, the Victoria and Albert Museum and British Vogue.\n\nThe flowers -- which will also include locally-sourced foliage from areas around Windsor Castle -- will be donated to various charities after the wedding, according to Kensington Palace.\n\nThe soundtrack of the wedding\n\nHarry and Markle's wedding day will be illuminated by the sounds of a gospel choir, an organ, trumpets, a full orchestra, a soprano and a 19-year-old cellist who was personally asked by Markle.\n\n\"I was bowled over when Ms. Markle called me to ask if I would play during the ceremony,\" Sheku Kanneh-Mason said in a statement released by Kensington Palace. \"And of course I immediately said yes. What a privilege to be able to play the cello at such a wonderful event. I can’t wait!”\n\nThe music during the wedding ceremony will be under the direction of St. George's Chapel's director of music, James Vivian, and will also include the choir of St. George's Chapel, according to Kensington Palace.\n\nThe entire ceremony will also be recorded live and released on Decca Records, a U.K.-based records label. The album, which will include a collector's booklet, will go on sale around the world on May 25, according to Decca Records.\n\nHarry and Markle's horse-drawn royal carriage\n\nThe newlyweds will travel through Windsor Town and along the Long Walk in the Ascot Landau carriage.\n\nThe carriage, which will be pulled by Windsor Grey horses, is one of five Ascot Landaus used by the royal family. Two of the Ascot Landaus were used at William and Kate's 2011 wedding, including carrying Harry in his role as best man.\n\nThe most celeb-studded royal wedding to date?\n\nAmong the high-profile guests who could attend Harry and Markle's wedding are some of Markle's celebrity friends, including actress Priyanka Chopra and tennis star Serena Williams.\n\nIn these file photos, Serena Williams poses Feb. 28, 2016, Barack Obama speaks Oct. 19, 2017 and Priyanka Chopra is seen Feb. 9, 2018. Getty Images\n\nFormer President Barack Obama and Michelle Obama will not be at the wedding at Windsor Castle, despite speculation they would attend. It is unclear whether the Obamas received an invitation but declined to avoid a political distraction.\n\nMarkle and Harry decided against inviting political leaders from the U.K. and abroad to their wedding, meaning President Donald Trump and U.K. Prime Minister Theresa May will not attend.\n\nMarkle has though invited several members of the cast of \"Suits,\" the TV show she starred on for seven seasons, ABC News has learned. Also expected to attend the wedding ceremony is Elton John, one of Diana’s closest friends who has worked with Harry on AIDs policy.\n\nSingers Ed Sheeran and Rihanna and members of Coldplay, who have all actively supported Harry's charitable work, could also get invites.\n\nSpice Girls star Mel B said on a talk show in February that all five Spice Girls have been invited to Harry and Markle's wedding.\n\nThe Spice Girls perform during the closing ceremony of the London 2012 Olympic Games at the Olympic Stadium, Aug. 12, 2012. Stefan Wermuth/Reuters, FILE\n\nMel B declined to comment on whether the Spice Girls would perform on the big day, saying, \"You’re going to get me fired! Let’s not talk about it anymore! Let’s pretend that I never said that.”\n\nOther members of the girl band have since indicated they will not be performing.\n\nPrince William and Princess Kate invited Ellie Goulding to perform at their wedding reception in 2011.\n\nEveryday people will play a role\n\nHarry and Markle have invited 2,640 people onto the grounds of Windsor Castle to see the wedding carriage procession as it departs.\n\nMeghan Markle and Britain's Prince Harry are greeted by flag waving school children as they arrive to take part in an event for young women as part of International Women's Day in Birmingham, central England, March 8, 2018. Matt Dunham/AP\n\nMembers of the public were selected from different regions of the U.K. with a special emphasis on those who have served their community. The couple also invited 100 students from two local schools in Windsor that have a strong affiliation with Windsor Castle.\n\nHarry and Markle also extended invitations to 200 individuals who take part in charities and organizations for which Harry serves as royal patron.\n\nArmed Forces will play a role too\n\nMore than 250 members of the Armed Forces will provide ceremonial support at both the wedding and the carriage procession, according to the U.K. Ministry of Defense.\n\n\"Members of the Household Cavalry will form a staircase party at St George’s Chapel, Windsor Castle as part of the wedding,\" the statement reads. \"The State Trumpeters and a Captain’s Escort from the Household Cavalry will also provide ceremonial support.\"\n\nThe members will come from British Armed Forces units with a “special relationship” to Harry, a veteran. Harry served two tours of duty in Afghanistan and rose to the rank of Captain during his time in the military.\n\nIs Markle planning this all on her own?\n\nMarkle's best friend and stylist, Jessica Mulroney, is also a bridal planner and assisting Markle in the entire design and concept of the wedding party outfits and look for the reception.\n\nJessica Mulroney and actress Meghan Markle attend the World Vision event held at Lumas Gallery, March 22, 2016, in Toronto. George Pimentel/Getty Images\n\nMulroney is Canada’s best-known stylist who styled Markle during her seven-season run on the TV drama \"Suits,\" which films in Toronto.\n\nSince Markle's engagement to Harry, Mulroney helped select the dress and coat Markle wore on the day the couple's engagement was announced in November. Mulroney was also at Markle's side advising her on the gown and sweater Markle wore for her intimate engagement photos with Harry.\n\nMulroney is the wife of Ben Mulroney, whose father is a former prime minister of Canada. The two are one of Canada's best-known power couples and are often considered Canadian royalty in Toronto.\n\nWho is paying for this celebration?\n\nKensington Palace confirmed in a statement released after the couple’s engagement that Harry’s family would pay for the “core aspects of the wedding.”\n\n\"As was the case with the wedding of The Duke and Duchess of Cambridge, The Royal Family will pay for the core aspects of the wedding, such as the church service, the associated music, flowers, decorations, and the reception afterwards,” the statement read.\n\nMarkle is expected to pay for her wedding dress. Security costs for the wedding day will come at the expense of U.K. taxpayers.\n\nQueen Elizabeth gives handwritten, formal consent\n\nBuckingham Palace shared an image of the handwritten Instrument of Consent. According to the Succession to the Crown Act of 2013, the first six people in line to the throne must obtain the consent of the Queen before marrying.\n\nA design to the left of the text on the Instrument of Consent “incorporates a red dragon, the heraldic symbol of Wales, together with the U.K.'s floral emblems -- the rose, thistle and shamrock. It also features Prince Harry’s label, including three tiny red escallops from the Spencer family arms,\" according to Buckingham Palace.\n\nTo the right of the text is a rose, which is the national flower of the United States, and two golden poppies, the state flower of California where Markle was born. Between the flowers is the Welsh leek, together with Harry’s label. Beneath the label are olive branches, adopted from the Great Seal of the United States. The document also incorporates the coronet for Harry.\n\nThe honeymoon will be delayed\n\nHarry and Markle will delay their honeymoon and do a public engagement the week after the wedding.\n\nThe newlyweds will attend Prince Charles's 70th birthday patronage celebration at Buckingham Palace on May 22, just days after their wedding.\n\nMarkle and Harry will take a honeymoon sometime thereafter, before resuming a busy schedule of engagements for the rest of the year.\n\nThe couple will not do any public engagements between now and their wedding day.", "images": ["https://s.abcnews.com/images/GMA/PhotoIllustrationTreatment_16x9_PrinceHarry_MeghanMarkle_KS_051118_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/GMA/PhotoIllustrationTreatment_16x9_PrinceHarry_MeghanMarkle_KS_051118_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Katie Kindelan", "Carolyn Durand", "May", "Min Read"], "canonical_link": "https://goodmorningamerica.com/culture/story/prince-harry-meghan-markles-royal-wedding-53312776", "title": "Everything you need to know about Prince Harry and Meghan Markle's royal wedding", "meta_data": {"keywords": "Prince Harry, Meghan Markle, wedding, royals, London, prince william, princess kate", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Everything you need to know about Prince Harry and Meghan Markle's royal wedding", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/prince-harry-meghan-markles-royal-wedding-53312776", "title": "Everything you need to know about Prince Harry and Meghan Markle's royal wedding", "image": "https://s.abcnews.com/images/GMA/PhotoIllustrationTreatment_16x9_PrinceHarry_MeghanMarkle_KS_051118_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-05-18T17:12:00Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,53312776", "ipad": "abcnewsipad://link/story,53312776", "googleplay": "https://goodmorningamerica.com/culture/story/prince-harry-meghan-markles-royal-wedding-53312776"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Everything you need to know about Prince Harry and Meghan Markle's royal wedding", "url": "https://goodmorningamerica.com/culture/story/prince-harry-meghan-markles-royal-wedding-53312776", "image": {"identifier": "https://s.abcnews.com/images/GMA/PhotoIllustrationTreatment_16x9_PrinceHarry_MeghanMarkle_KS_051118_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,53312776", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,53312776", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/prince-harry-meghan-markles-royal-wedding-53312776", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/prince-harry-meghan-markles-royal-wedding-53312776"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}