{"url": "https://ir.jcpenney.com/news-events/press-releases/detail/331/jcpenney-teams-up-with-tracee-ellis-ross-for-sparkling", "text": "JCPENNEY TEAMS UP WITH TRACEE ELLIS ROSS FOR SPARKLING HOLIDAY CAPSULE COLLECTION\n\nPLANO, Texas - (Oct. 10, 2017) - This holiday season, JCPenney will be treating shoppers to an exclusive, limited-edition capsule collection created with award-winning actress and style icon Tracee Ellis Ross. Available at JCPenney in all stores and jcpenney.com beginning Nov. 12, Tracee Ellis Ross for JCPenney will inspire customers to embrace their joyful spirit with a collection of women's apparel, accessories and home décor items.\n\n\"We are thrilled to bring Tracee's style to life with her first-ever retail collection,\" said Jodie Johnson, senior vice president of women's apparel, jewelry, footwear and handbags for JCPenney. \"Known for her fresh, bold and confident looks, it's no wonder that women seek to emulate Tracee's style. Infused with her unique design aesthetic, the 'Tracee Ellis Ross for JCPenney' capsule collection offers an affordable selection of stylish and gift-able items that gives customers another reason to shop us this holiday season.\"\n\nRoss, a Golden Globe award winner and star of ABC's Black-ish, is known for her spirit in style, health and beauty. She's long been a lover of fashion, beginning with her early career working in the industry as a model and as a contributing fashion editor to Mirabella and New York magazines. Today, whether it's her perfectly curated red carpet looks or chic street style, the fashion world - and her millions of social media followers - have taken notice.\n\n\"It's been my lifelong dream to design a line of clothing to utilize my love of style and clothes and to create a collection accessible to everyone that empowers women to embrace their joyful spirit. Each piece is timeless and versatile, classic but with flavor. They can be mixed and matched to create elegant looks for everybody and every body. JCPenney was a wonderful partner for me as I designed this affordable collection because I truly believe that looking good does not have to cost a lot,\" said Tracee Ellis Ross. \"At the same time I thought why not expand the joy of getting dressed into a few beautiful home décor items? These pieces add a special touch when entertaining friends and loved ones this holiday season, giving some sparkle and joy.\"\n\nExuding Ross' glamour and femininity, Tracee Ellis Ross for JCPenney mixes sophisticated prints and silhouettes offering customers an assortment of sparkly and colorful dresses, trousers, jackets, sleepwear, athleisure pieces and more. Customers can shop an array of fun and elegant looks for any occasion, whether it's a sequin dress for a festive holiday party to a classic tuxedo jacket or a stretchy body con dress that easily goes from day to night or even pairing the collection's red robe coat and trousers for a perfect monochromatic head-to-toe look. Apparel items will be offered in sizes small to 3X, with prices ranging from $29 to $74 and can be accessorized with a selection of handbags, totes and scarves, ranging from $19 to $24. Sleepwear items will range from $17 to $34. Ross' holiday collection also extends to home accessories with a curated assortment of items including throw pillows, dessert dishes, high ball glasses and more, ranging from $12 to $19.\n\nAs an exclusive benefit, JCPenney Rewards members will be the first to know when the pink and gold sequin dresses from Tracee Ellis Ross for JCPenney are available for purchase on jcpenney.com before the full collection launches. Beginning Nov. 12, customers can find the Tracee Ellis Ross for JCPenney collection prominently displayed in a dedicated shop in store and online at jcp.com/TraceeEllisRoss.\n\nFor images, please visit www.jcpnewsroom.com.\n\nJCPenney Media Relations\n\n972-431-3400 or jcpnews@jcp.com\n\n@jcpnews\n\nAbout JCPenney:\n\nAbout JCPenney: J. C. Penney Company, Inc. (NYSE: JCP), one of the nation's largest apparel and home furnishings retailers, combines an expansive footprint of approximately 875 stores across the United States and Puerto Rico with a powerful e-commerce site, jcp.com, to connect with shoppers how, when and where they prefer to shop. At every customer touchpoint, she will get her Penney's worth of a broad assortment of products from an extensive portfolio of private, exclusive and national brands. Powering this shopping experience is the customer service and warrior spirit of over 100,000 associates across the globe, all driving toward the Company's three strategic priorities of strengthening private brands, becoming a world-class omnichannel retailer and increasing revenue per customer. For additional information, please visit jcp.com.\n\n###", "images": ["https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/investor-logo.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-icon-twitter.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-icon-instagram.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-icon-facebook.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-image.jpg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/icon-search.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/header-logo.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-icon-pinterest.svg", "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-icon-youtube.svg"], "top_img": "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-image.jpg", "keywords": [], "authors": [], "canonical_link": "https://ir.jcpenney.com/news-events/press-releases/detail/331/jcpenney-teams-up-with-tracee-ellis-ross-for-sparkling", "title": "JCPENNEY TEAMS UP WITH TRACEE ELLIS ROSS FOR SPARKLING HOLIDAY CAPSULE COLLECTION", "meta_data": {"og": {"site_name": "J. C. Penney Company, Inc.", "title": "JCPENNEY TEAMS UP WITH TRACEE ELLIS ROSS FOR SPARKLING HOLIDAY CAPSULE COLLECTION", "type": "website", "image": "https://d1io3yog0oux5.cloudfront.net/_a23091a201ca44a483378dc5b083aec5/jcp/files/theme/images/social-image.jpg", "url": "https://ir.jcpenney.com/news-events/press-releases/detail/331/jcpenney-teams-up-with-tracee-ellis-ross-for-sparkling"}, "twitter": {"card": "summary_large_image"}, "viewport": "initial-scale=1.0, width=device-width", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://ir.jcpenney.com", "summary": ""}