{"url": "http://liverampup.com/entertainment/william-levy-wife-gay-married.html", "text": "Mexican telenovela actor William Levy currently leads a fascinating family life with his longtime girlfriend and kids, but despite being seen as an inspiration for fathers and lovers, the Cuidado con el angel star has his own dark history.\n\nWilliam previously cheated on his wife-like partner multiple times and currently repents on his previous acts, but he still seems unable to make a lifetime commitment to his lover.\n\nCheated On Longtime Girlfriend; Secretly Dating Mexican Actresses\n\nWilliam's relationship with his model-girlfriend Elizabeth Gutiérrez goes way back to 2003. Crossing more than a decade together, the couple is currently the parents to two adorable kids; a son named Christoper and a daughter, Kailey.\n\nYou May Also Like:- Cree Summer Gushes Over Keeper Husband - Kids Are Add-Ons To Happiness\n\nConsidering their longtime dating, William and his wife-like-girlfriend are content with their relationship and children; however, this has not always been the case since William allegedly cheated on his girlfriend multiple times.\n\nWilliam, along with partner Elizabeth and children, Christopher and Kailey in May 2018 (Photo: William Levy's Instagram)\n\nIt was September 2014 when Ximena Navarrete, William's co-star from the Mexican telenovela La Tempestad, revealed that the two were secretly dating.\n\nXimena reportedly confessed her relationship to some of her closest friends and mentioned that she was madly in love with William. The revelation followed the rumors of the Mexican actor cheating on his longtime partner that initiated after the photos of him and Ximena hanging out in a Miami hotel surfaced the media.\n\nFollowing the incident, Elizabeth broke up with her boyfriend in December 2014.\n\nAlthough the pair didn't reveal the reason for their split, it was apparent that the trigger was William's adultery. The couple eventually got back together and resumed their romance until 2017 when another incident of William's past infidelity was disclosed.\n\nBut, that was hardly the end of William's cheating incident!\n\nEarlier in 2017, Mexican actress Jacqueline Bracamonte revealed that she had an affair with William after the starred together in a soap opera in 2009. She mentioned that William had lied to her about breaking up with Elizabeth and said that he was single at the time.\n\nJacqueline added that once she found out that her partner was in a relationship and had even fathered a child, she immediately broke up with him.\n\nEven though Elizabeth was shocked with her boyfriend's infidelity, she didn't break up with him as it was a thing of the past and William had vowed never to commit these transgressions again.\n\nA Happy Family Of Four\n\nCurrently, William is a total family man dedicating all his time and energy with his girlfriend and children.\n\nThe sweet family of four often plans different activities together. Back in August 2017, William's children and partner showed their unconditional love for him when they prepared a surprise birthday party for William. Similarly, William also adores his kids and have flaunted his love for them through social media on several occasions.\n\nHis first-born, Christopher is a prolific baseball player and may even take up a career in the sport.\n\nOn 6 March 2017, William shared an Instagram post in which he mentioned that Christopher had won a baseball championship playing for a local team named Clutch Miami and even expressed his concerns as a proud father.\n\nSimilarly, William's daughter, Kailey is the apple of his eye whom he considers to be his everything. On 6 March 2018, he posted a picture of his youngest kid and wished Kailey for her birthday.\n\nWilliam Levy's daughter Kailey in 2018 (Photo: William Levy's Instagram)\n\nWilliam shares a loving relationship with Elizabeth, but the two have not mentioned their intention of getting married. Although he proposed to her several years before in 2013 on Christmas Eve, the pair has not talked about their plans to getting married in the recent times.\n\nThis has left many many wondering if William ever intends to make Elizabeth his wife. With some even accusing him of secretly being gay due to his lack of commitment.\n\nOpen For Gay Roles; Gay In Real Life?\n\nWilliam, who is often called the \"Cuban Brad Pitt,\" revealed in a 2014 interview with Fox News Latino that he had grown tired of being portrayed as the muscular hunk and wanted to do some serious acting.\n\nHe even mentioned that he was open to playing gay roles if the character was profound and inspirational. When asked if he would perform as a gay man in a movie, William answered,\n\n\"I'll have to see. I'm not against that — not at all. But, it'll ultimately be up to the script and whether the character shows a depth of emotion and is inspirational.\"\n\nHowever, this doesn't mean that he is gay in real life. It would be absurd even to think that the who cheated on his partner with multiple women, would be secretly a gay man hiding in the closet.", "images": ["https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "https://liverampup.com/assets/mobile/images/logowhite.png", "data:image/gif;base64,R0lGODlhAQABAIAAAP///wAAACH5BAEAAAAALAAAAAABAAEAAAICRAEAOw==", "http://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.liverampup_com,DomainId.186710", "https://sb.scorecardresearch.com/p?c1=2&c2=20015427&cv=2.0&cj=1", "http://liverampup.com/assets/images/logo.png", "http://images.dmca.com/Badges/dmca_protected_sml_120f.png?ID=5d203f6f-5cbf-417d-8ba2-851319078ec2", "https://liverampup.com/low-images/uploads/celebrity/275_185_william-levy-wife.jpg"], "top_img": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "keywords": [], "authors": [], "canonical_link": "https://liverampup.com/entertainment/william-levy-wife-gay-married.html", "title": "William Levy Allegedly Cheated On Wife-Like Girlfriend; Gay Rumors True?", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "536407551181-sve2mt0ehbs2kf5299081e3b2sa75kcl.apps.googleusercontent.com": "536407551181-sve2mt0ehbs2kf5299081e3b2sa75kcl.apps.googleusercontent.com", "google-signin-client_id": "536407551181-sve2mt0ehbs2kf5299081e3b2sa75kcl.apps.googleusercontent.com", "description": "Find more about your favorite celebrity information, news and entertainment. Share it in your friend's circle and enjoy", "apple-mobile-web-app-title": "Liverampup.com", "fb": {"pages": 757224361044529}, "og": {"locale": "en_US", "site_name": "LIVERAMPUP", "type": "blog", "description": "Know All About William Levy's Allegedly Cheating Incident On Wife-Like Girlfriend. Learn About His Dating History And Whether His Gay Rumors Are True?", "title": "William Levy Allegedly Cheated On Wife-Like Girlfriend; Gay Rumors True?", "url": "https://liverampup.com/entertainment/william-levy-wife-gay-married.html", "article": {"published_time": "2018-08-19 06:54:59"}, "image": {"identifier": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "width": 1197, "height": 627}}, "twitter": {"card": "summary_large_image", "creator": "@LIVERAMPUP", "domain": "LIVERAMPUP", "site": "LIVERAMPUP", "description": "Know All About William Levy's Allegedly Cheating Incident On Wife-Like Girlfriend. Learn About His Dating History And Whether His Gay Rumors Are True?", "title": "William Levy Allegedly Cheated On Wife-Like Girlfriend; Gay Rumors True?", "image": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg"}, "p": {"domain_verify": "a4bb87e3ebd48c10b9a45c64b7976bc3"}, "pin": {"media": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "url": "https://liverampup.com/entertainment/william-levy-wife-gay-married.html"}, "publish_date": "19th August 2018 06:54:59 AM", "article": {"published_time": "2018-08-19T06:54:59+00:00", "modified_time": "2018-08-19T09:25:12+00:00"}}, "movies": [], "publish_date": 1534632899.0, "source": "http://liverampup.com", "summary": ""}