{"url": "https://www.usatoday.com/story/news/politics/2018/04/17/barbara-bush-dead-former-first-lady/518856002/", "text": "Former first lady Barbara Bush, the wife of one president and mother of another, died Tuesday after deciding to discontinue medical treatment for her declining health.\n\nFamily spokesman Jim McGrath announced her death on Twitter at 6:37 p.m. CT: \"A former first lady of the United States of America and relentless proponent of family literacy, Barbara Pierce Bush passed away Tuesday, April 17, 2018 at the age of 92.\"\n\nBush had made the decision to discontinue medical treatment for congestive heart failure and lung disease after consulting with her family and friends, McGrath announced Sunday. \"It will not surprise those who know her that Barbara Bush has been a rock in the face off her failing health, worrying not for herself – thanks to her abiding faith – but for others,\" he said.\n\nWith her iconic gray hair, quick wit and devotion to her husband of more than 70 years, she became the matriarch of one of the most influential political families of modern times.\n\nHer husband George H.W. Bush, the nation’s 41st president from 1989-93, is now 93 years old and struggling with a Parkinson’s-like disease that forces him to use a wheelchair and has made it difficult for him to speak.\n\nHer eldest son George W. Bush, now 71 and the nation's 43rd president, served two terms from 2001-09 and retired to Texas. His election made Barbara Bush the second woman in history to be both a wife and mother of presidents — and the only one who lived to see both of them serve.\n\n\"My dear mother has passed on at age 92,\" her president-son said in a statement. \"Laura, Barbara, Jenna, and I are sad, but our souls are settled because we know hers was.\"\n\n\"Barbara Bush was a fabulous first lady and a woman unlike any other who brought levity, love, and literacy to millions. To us, she was so much more. Mom kept us on our toes and kept us laughing until the end. I’m a lucky man that Barbara Bush was my mother,\" he said.\n\nObituary:Barbara Bush, former first lady and matriarch of Bush family, dies at 92\n\nAs recently as 2014, Bush was tied with Hillary Clinton as the most popular first lady of the past 25 years, an NBC News/Wall Street Journal poll found.\n\nThe Clintons remembered Bush Tuesday as a woman of \"grit and grace, brains and beauty.\"\n\n\"She was fierce and feisty in support of her family and friends, her country and her causes,\" former president Bill Clinton said in a statement. \"She showed us what an honest, vibrant, full life looks like. Hillary and I mourn her passing and bless her memory.\"\n\nThroughout a long life in the public eye, Bush was a fierce advocate for her husband and sons, including former Florida governor and presidential candidate Jeb Bush.\n\nShe also defended them against detractors, from those who criticized her husband's decision to raise taxes in 1990 to those who opposed her son's decision to go to war in Iraq in 2003.\n\nBush championed the issue of literacy before, during and after her White House years. She formed the Barbara Bush Foundation for Family Literacy to fund programs that teach parents in low-income families to read and pass on a love of reading to their children.\n\n\"If everyone could read and write, all the problems I worried about could be solved,\" she told USA TODAY in 2014. \"If you can't read, you can't do anything.\"\n\nPresident Trump called her \"an advocate for the American family.\"\n\n\"Amongst her greatest achievements was recognizing the importance of literacy as a fundamental family value that requires nurturing and protection,\" Trump said in a statement through the White House press office. \"She will be long remembered for her strong devotion to country and family, both of which she served unfailingly well \"\n\nHe ordered flags to be lowered to half-staff in her honor Saturday when Bush is to be buried at her husband's presidential library in College Station, Texas.\n\nVice President Mike Pence and his wife Karen sent their \"deepest sympathies,\" calling Bush \"a woman of unique strength and grace whose devotion to her family was an inspiration to every American.\"\n\nIn her own words:Barbara Bush, from political prognostication to 'rhymes with rich'\n\nHer nickname, \"the Silver Fox,\" hinted at both her grandmotherly image but also her behind-the-scenes power as an enforcer of family discipline.\n\n“It’s cliché, but not an exaggeration, to say Barbara Bush was the bulwark and foundation for the whole family,\" said Jeffrey Engel, a presidential historian at Southern Methodist University. \"She was the emotional core and the moral core. The family centered around her. The family may have worked through the achievements of the two President Bushes, but in a real sense it was built around her.\"\n\nShe was 63 years old when her husband became president — the second-oldest first lady in history.\n\nIn recent years, her health deteriorated along with her husband's. Both were hospitalized simultaneously – Mrs. Bush with \"fatigue and coughing\" – in the days leading up to President Trump's inauguration last year and were unable to attend.\n\nJust this month, the former first lady wrote about her husband in a note for the spring edition of Smith College's alumnae magazine.\n\n\"I am still old and still in love with the man I married 72 years ago,\" she wrote in the life updates section for the magazine.\n\nA love story:Barbara Bush was 'still in love with the man I married 72 years ago'\n\nBush also revealed her secret for a long life: medical attention.\n\n\"I have had great medical care and more operations than you would believe,\" she told the magazine. \"I'm not sure God will recognize me; I have so many new body parts!\"\n\nShe continued: \"Also, George Bush has given me the world. He is the best — thoughtful and loving.\"\n\nThe couple met at a Christmas dance in 1941, when Barbara Pierce was 16 and George Bush was 17. They got engaged right before he left to fight in World War II as a Navy pilot. After he returned on leave, she dropped out of Smith College, and the two married in January 1945.\n\nSmith College awarded Barbara Bush with an honorary degree in 1989.\n\nMore:Barbara Bush dies: President Trump and wife Melania praise former first lady\n\nMore:George W. Bush delivers clear rebuke, without mentioning Trump by name", "images": ["https://www.gannett-cdn.com/-mm-/659be58431a6906eec6b1b9d02dc699680841c40/c=0-261-2952-1929/local/-/media/2018/04/15/USATODAY/USATODAY/636594035965699051-Pol-Barbara-Bush-0322.jpg?width=2952&height=1668&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5772253104001_5772262246001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/659be58431a6906eec6b1b9d02dc699680841c40/c=0-261-2952-1929/local/-/media/2018/04/15/USATODAY/USATODAY/636594035965699051-Pol-Barbara-Bush-0322.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/659be58431a6906eec6b1b9d02dc699680841c40/c=0-261-2952-1929/local/-/media/2018/04/15/USATODAY/USATODAY/636594035965699051-Pol-Barbara-Bush-0322.jpg?width=2952&height=1668&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/news/politics/2018/04/17/barbara-bush-dead-former-first-lady/518856002/", "title": "Former first lady Barbara Bush, wife and mother of presidents, dead at 92", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Former first lady Barbara Bush, wife and mother of presidents, dead at 92", "description": "Former first lady Barbara Bush, the wife and mother of presidents, died at age 92 after discontinuing medical treatment for 'failing health.'", "url": "https://www.usatoday.com/story/news/politics/2018/04/17/barbara-bush-dead-former-first-lady/518856002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/659be58431a6906eec6b1b9d02dc699680841c40/c=0-261-2952-1929/local/-/media/2018/04/15/USATODAY/USATODAY/636594035965699051-Pol-Barbara-Bush-0322.jpg?width=2952&height=1668&fit=crop&format=pjpg&auto=webp", "width": 2952, "height": 1668}, "type": "article"}, "article": {"author": "Richard Wolf and Gregory Korte", "content_tier": "free", "opinion": "false"}, "description": "Former first lady Barbara Bush, the wife and mother of presidents, died at age 92 after discontinuing medical treatment for 'failing health.'", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/659be58431a6906eec6b1b9d02dc699680841c40/c=0-261-2952-1929/local/-/media/2018/04/15/USATODAY/USATODAY/636594035965699051-Pol-Barbara-Bush-0322.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Former first lady Barbara Bush, wife and mother of presidents, dead at 92", "description": "Former first lady Barbara Bush, the wife and mother of presidents, died at age 92 after discontinuing medical treatment for 'failing health.'"}}, "movies": [], "publish_date": 1523894400.0, "source": "https://www.usatoday.com", "summary": ""}