{"url": "https://en.wikipedia.org/wiki/Defenders_(comics)", "text": "Group of fictional characters in Marvel Universe\n\nThe Defenders are a set of fictional superhero groups with rotating membership appearing in American comic books published by Marvel Comics. They are usually presented as a \"non-team\" of individualistic \"outsiders\" who, in their prior adventures, are known for following their own agendas. The team often battle mystic and supernatural threats.\n\nIts original incarnation was led by Doctor Strange and included Hulk, Namor, and—eventually—Silver Surfer. They first appeared as the Defenders in Marvel Feature #1 (Dec. 1971).\n\nThe group had a rotating line-up from 1972 until 1986, with Dr. Strange and the Hulk being usually constant members along with a number of other mainstays such as Valkyrie, Nighthawk, Hellcat, Gargoyle, Beast, the Son of Satan and Luke Cage, and many temporary members. The publication was retitled near the end of the run as The New Defenders but featured none of the original members and only Valkyrie, Beast and the Gargoyle of the former long-term members. The concept was modified in the 1993–95 series Secret Defenders, in which Dr. Strange assembled different teams for each individual mission. The original team was reunited in a short-lived 2001 series by Kurt Busiek and Erik Larsen. In 2005 Marvel published a five-issue miniseries featuring the classic line-up by J.M. DeMatteis, Keith Giffen and Kevin Maguire. In December 2011 writer Matt Fraction and artist Terry Dodson launched a Defenders series with a mixture of classic and new members, which lasted for 12 issues.\n\nA TV miniseries titled The Defenders premiered in 2017 on Netflix, with the team consisting of Daredevil, Jessica Jones, Luke Cage and Iron Fist.\n\nPublication history [ edit ]\n\nMarvel Feature #1 (December 1971), featuring the first appearance of the team. Cover art by #1 (December 1971), featuring the first appearance of the team. Cover art by Neal Adams\n\nThe origin of the Defenders lies in two crossover story arcs by Roy Thomas prior to the official founding of the team. The first, in Doctor Strange #183 (November 1969), Sub-Mariner #22 (February 1970), and The Incredible Hulk #126 (April 1970) occurred due to the Dr. Strange series being canceled in the middle of a story arc, leaving Thomas no choice but to resolve the storyline in other series that he wrote.[1] In the story, Dr. Strange teams with Sub-Mariner and the Hulk to protect the Earth from invasion by Lovecraftian interplanar beings known as the Undying Ones and their leader, the Nameless One. Barbara Norriss, later the host of the Valkyrie, first appears in this story. In the second arc, featured in Sub-Mariner #34–35 (February–March 1971), Namor enlists the aid of the Silver Surfer and the Hulk to stop a potentially devastating weather control experiment, inadvertently freeing a small island nation from a dictator and facing the Avengers under the name of the \"Titans Three\".[1]\n\nThe Defenders first appeared as a feature in Marvel Feature #1 (December 1971),[2] where the founding members gather to battle the alien techno-wizard Yandroth and remain as a team afterward. Editor Stan Lee, wanting to write all of the Silver Surfer's stories personally, had asked other writers not to use the character, and suggested that Thomas use Doctor Strange instead. Thomas has also speculated that Lee came up with the team's name: \"The 'Defenders' is far too passive a name for my taste. I prefer more aggressive-sounding names like the 'Avengers' or the 'Invaders,' so Stan probably came up with that one.\"[1] Due to the popularity of their tryout in Marvel Feature, Marvel soon began publishing The Defenders with Steve Englehart writing and Sal Buscema penciling,[3] while Thomas moved into the editor's seat. Despite Lee's continuing edict on the use of the Silver Surfer, he approved Englehart's pitch to include the Silver Surfer in the story.[1]\n\nValkyrie was introduced to the team in issue #4 (February 1973).[4][5] Writer Steve Englehart has stated that he added the Valkyrie to the Defenders \"to provide some texture to the group.\"[6] Englehart wrote \"The Avengers–Defenders War\" crossover in The Avengers #116–118 (October–December 1973) and The Defenders #9–11 (October–December 1973),[7] leaving The Defenders afterwards because he \"didn't want to keep doing two team books at the same time.\"[1] Len Wein briefly wrote the series[8] and introduced such characters as Alpha the Ultimate Mutant[9] and the Wrecking Crew.[10] Wein also added Nighthawk to the cast because, in his words, doing so \"gave me a character to play with who didn't have a whole lot of previous history ... [a] character I could do anything I wanted to without worrying about how it would affect any other titles that character might appear in.\"[1] He later became the editor for several issues.\n\nSteve Gerber first worked on the characters in Giant-Size Defenders #3 (January 1975) and became the writer of the main title with issue #20 the following month.[11] He wrote the series until issue #41 (November 1976).[12] Part of Gerber's oeuvre was reviving forgotten characters; he brought back three pre-Marvel characters, the Headmen,[13] as well as the Guardians of the Galaxy.[14] The Defenders met Gerber's Howard the Duck in Marvel Treasury Edition #12 (1976).[15] In 2010, Comics Bulletin ranked Gerber and Sal Buscema's run on The Defenders first on its list of the \"Top 10 1970s Marvels\".[16] Buscema's long run ended with #41, and he was replaced by Keith Giffen.\n\nDue to Marvel's shuffling of editor-in-chiefs, a brief run by Gerry Conway abruptly ended in mid-production on issue #45. David Anthony Kraft and Roger Slifer volunteered to write the series, but issue #45 had no written plot, having been drawn by Giffen following a story conference with Conway. Kraft and Slifer were unable to contact either Conway or Giffen, and so had to puzzle out Conway's plot from the unscripted artwork.[1]\n\nDavid Anthony Kraft's run as writer[17] included \"The Scorpio Saga\" (issues #46, 48–50) and the \"Xenogenesis: Day of the Demons\" storyline (issues #58–60).[18] The \"Defenders for a Day\" storyline in issues #62–64 saw dozens of new applicants attempting to join the Defenders, as well as a number of villains attempting to present themselves as Defenders members in order to confuse the authorities and the public as they commit robberies. Kraft later recalled that reactions to the story's off-beat humor were polarized: \"readers were either wildly enthusiastic or absolutely and very utterly appalled.\"[19] Kraft and artist Ed Hannigan explained some of the Valykrie's backstory in The Defenders #66–68 (December 1978 – February 1979).[20][21][22] At Kraft's request, Hannigan helped write issue #67 but found that he could not handle both writing and artwork at once, and so transitioned to being just the series's writer with the following issue.[1]\n\nSteven Grant wrote a conclusion to Steve Gerber's Omega the Unknown series in two issues of The Defenders,[23][24][25] at the end of which most of the original series' characters were killed. While Gerber seemed unhappy with Grant's conclusion,[26] it nevertheless tied up the loose ends of the comic series, and is considered \"canon\" by Marvel.[27]\n\nWriter J. M. DeMatteis took over the series with issue #92. Coming from a background of writing eight-page horror shorts for DC Comics, DeMatteis found it a struggle to adapt to writing a 22-page superhero comic on a monthly basis.[28] He and Mark Gruenwald co-wrote The Defenders #107–109 (May–July 1982), which resolved remaining plot points from the Valkyrie story by Kraft and Hannigan published three years earlier.[29][30][31][32] While working on the series, DeMatteis developed a strong friendship with penciler Don Perlin,[28] who would draw the series for nearly half its run. Perlin later commented, \"It turned out to be a real fun book because you got a chance to draw almost every character Marvel had at one time or another.\"[1] He has also stated that Kim DeMulder, who inked issues #122-144 apart from a few fill-ins, is his preferred inker after himself.[33]\n\nThe New Defenders [ edit ]\n\nSuffering from creative burnout on the series, DeMatteis felt a change was needed.[28] As of issue #125, The Defenders was retitled to The New Defenders as the original four members (Doctor Strange, the Silver Surfer, the Hulk, and Namor) are forced to leave the team,[34] in response to an alien prophecy that states that these four, operating as a group, would be responsible for destroying the world. While The Beast reforms the team as an official super-hero team complete with government clearance.[35] The \"New Defenders\" concept provided a substantial boost to the series's sales, but left DeMatteis in a creative drought, as he realized in retrospect that \"...I created a book that was exactly the kind of the thing that I hated to write. I made it into a standard superhero team...\"[28]\n\nDeMatteis stayed on for only six issues of The New Defenders before turning it over to writer Peter Gillis, whose run was marked by shorter, more personal stories.[1] Gillis recounted, \"I had been working for a while at Marvel, and was constantly pumping for more work, and specifically a series of my own. So when I heard DeMatteis was leaving Defenders, I was in [editor] Carl Potts' office like a shot, and I got the gig.\"[1]\n\nThough the series remained a modest hit through the Gillis/Perlin run, it was cancelled to make room in Marvel's production schedule for the New Universe line.[1] Perlin recounted that Potts tried to soften the blow by telling him and Gillis the news while treating them to lunch at an Indian restaurant.[36] The final issue was The New Defenders #152.[37] In the final issue, several members (Gargoyle, Moondragon and Valkyrie), plus allies (Andromeda, Manslaughter, Interloper) seemingly die in battle with the Dragon of the Moon controlling Moondragon.[38] The remaining mutant members leave the team to join X-Factor. Gillis has claimed that killing off the other members of the group was a directive from the editorial staff to free up the surviving members for usage in X-Factor, pointing out that he shortly after revived several of these seemingly-deceased members[1] in issues of Solo Avengers, in Strange Tales vol. 2 #5–7, followed by issues #3–4 of the relaunched Doctor Strange, Sorcerer Supreme series.[39][40]\n\nThe Return of the Defenders [ edit ]\n\nIn 1990, the original trio reunited in The Incredible Hulk #370–371, in which it was revealed that the prophecy was a hoax. The originals then rejoined with the Silver Surfer in a story entitled The Return of the Defenders running in The Incredible Hulk Annual #18, Namor the Sub-Mariner Annual #2, Silver Surfer Annual #5, and Dr. Strange, Sorcerer Supreme Annual #2.\n\nSecret Defenders [ edit ]\n\nIn 1993, Marvel sought to revive the \"Defenders\" brand as \"The Secret Defenders\". The new team first appeared, unofficially, in Dr. Strange #50 and later Fantastic Four #374, before being officially introduced in Secret Defenders #1.[41][42] The series premise originally was that Doctor Strange would organize various teams of heroes for certain missions, with him as the leader. Members included Wolverine, Darkhawk, Spider-Woman, Spider-Man, Hulk, Ghost Rider, and others. This would last for the first several months of the title, before Doctor Strange was removed from the book, due to the character being reassigned to the \"Midnight Sons\" line at Marvel. After an arc where the supervillain Thanos organized a team of \"Secret Defenders\" for a mission,[43] leadership of the Secret Defenders passed to Doctor Druid[44] and the series itself abandoned the revolving door roster in favor of Druid and the Cognoscenti. The series was canceled with Secret Defenders #25.[45]\n\nReunion and The Order [ edit ]\n\nIn 2001–2002, the Defenders reunited in Defenders (vol. 2) #1–12 created by Kurt Busiek and Erik Larsen, immediately followed by The Order #1–6, in which Yandroth manipulated Gaea into \"cursing\" the primary four Defenders (Doctor Strange, the Sub-Mariner, the Hulk, and the Silver Surfer) so that they would be summoned to major crisis situations. These members were then mind controlled by Yandroth into forming the world-dominating \"Order\"; once the Order were freed from this control by their fellow heroes (including their teammates Hellcat, Nighthawk, and Valkyrie), the Defenders apparently disbanded. A fill-in issue set between these two series was published in 2011.\n\n2005 miniseries [ edit ]\n\nA Defenders five-issue miniseries debuted in July 2005, by Keith Giffen, J. M. DeMatteis, and Kevin Maguire (as a team, best known for their work on DC's Justice League franchise), featuring Doctor Strange attempting to reunite the original four Defenders to battle Dormammu and Umar. This series focuses mostly on humor[1] as the characters spend most of their time arguing with and criticizing one another. The series was later collected into both hardcover and trade paperback collections, entitled Defenders: Indefensible.\n\nThe Last Defenders [ edit ]\n\nIn 2008 Joe Casey wrote a new miniseries with a new line-up of Defenders as a result of the Super-Human Registration Act and the events of the Civil War.[46] Nighthawk wanted a team made up of previous Defenders such as Hellcat and Devil Slayer but Tony Stark (Iron Man) makes the decision to select other heroes for the team. The line-up is led by Nighthawk,[46] with Blazing Skull, Colossus, and She-Hulk as members. The Defenders are assigned to New Jersey under the Fifty State Initiative, because the proximity to New York City demands more experienced heroes than can just be recruited from the ranks of Camp Hammond. The team is disbanded for incompetence but Richmond eventually founds a team outside the Initiative with the Son of Satan, She-Hulk, Krang, and Nighthawk (S.H.I.E.L.D. agent Joaquin Pennyworth). The team reappears in the mini-series Vengeance (2011).\n\nThe Offenders [ edit ]\n\nIn the 2009 ongoing Hulk series (Issues 10–12), Red Hulk assembles a counter team of supervillains called the Offenders, which includes Baron Mordo, Terrax the Tamer, and Tiger Shark, and fights past versions of their enemies.[47][48]\n\nFear Itself: The Deep [ edit ]\n\nDuring the 2011 \"Fear Itself\" storyline, Doctor Strange forms a new version of the Defenders with Lyra (daughter of Hulk), Namor, Loa (a student of the X-Men), and the Silver Surfer to confront Attuma who has become Nerkkod, Breaker of Oceans. Many past Defenders appear in the last issue.[49][50]\n\n2011 series [ edit ]\n\nMarvel launched a new Defenders series in December 2011, written by Matt Fraction and drawn by Terry Dodson. The new book features Doctor Strange, Red She-Hulk, Namor, the Silver Surfer and Iron Fist. The new series follows the reunion of the Defenders in Fear Itself: The Deep.[51] During the battle against the Death Celestials the characters Black Cat, Nick Fury, and Ant-Man join the team. The series was cancelled at issue #12. Despite the prophecy supposedly being a hoax, the central storyline of the series involves a reunion of the original four Defenders setting off a chain of events leading to the destruction of the universe. In the final issue, Dr. Strange changes the past so that the reunion never happens, thus erasing all the events of the series.\n\nThe Fearless Defenders [ edit ]\n\nFebruary 2013 saw the debut of The Fearless Defenders, a series written by Cullen Bunn with artwork by Will Sliney. Bunn said that he had wanted to write the series, which centers on a new team of Valkyrior, led by Valkyrie and Misty Knight, after writing Fear Itself: The Fearless. It was suggested to him that it should run as a Defenders title, however Bunn explained that beyond the name there is \"little connection\" to the Defenders.[52]\n\n2017 series [ edit ]\n\nThe Defenders (2017) #1, with the team consisting of Iron Fist, Luke Cage, Jessica Jones and Daredevil. Art by #1, with the team consisting of Iron Fist, Luke Cage, Jessica Jones and Daredevil. Art by David Marquez\n\nIn August 2017, Marvel launched a new Defenders comic book series starring Daredevil, Jessica Jones, Luke Cage and Iron Fist, based on the Netflix incarnation of the team.[53]\n\nDuring the \"Secret Empire\" storyline, the Defenders were seen fighting the villains that were on a rampage for what happened in Pleasant Hill. They were defeated when Nitro exploded.[54]\n\nThe Best Defense [ edit ]\n\n2018 saw a new five part crossover storyline involving the \"Big Four\" members of the team. Published throughout December, the plot features separate issues all sub-titled \"The Best Defense\" in Immortal Hulk, Namor, Doctor Strange and Silver Surfer which culminates in a final issue under the banner of The Defenders. Announced on August 24, 2018, the creative teams were respectively:[55]\n\nImmortal Hulk written by Al Ewing and illustrated by Simone Di Meo\n\nwritten by Al Ewing and illustrated by Simone Di Meo Namor written by Chip Zdarsky and illustrated by Carlos Magno\n\nwritten by Chip Zdarsky and illustrated by Carlos Magno Doctor Strange written by Gerry Duggan and illustrated by Greg Smallwood\n\nwritten by Gerry Duggan and illustrated by Greg Smallwood Silver Surfer written and illustrated by Jason Latour\n\nwritten and illustrated by Jason Latour The Defenders written by Al Ewing and illustrated by Joe Bennet.\n\nMembership [ edit ]\n\nDefenders membership was fluid, yet a few members were relatively constant: the three founders (Doctor Strange, Namor the Sub-Mariner, and the Incredible Hulk), the Silver Surfer, Valkyrie, Nighthawk, Hellcat, and Gargoyle. Membership was clearer in the New Defenders era when the team was more formally organized.\n\nSecret Defenders [ edit ]\n\nThis group's composition was even more fluid than that of the original Defenders, but typically included either Doctor Strange or Doctor Druid as leader, joined by a custom selection of heroes chosen for the mission at hand.[42] At various times, War Machine, Darkhawk, Thunderstrike, Wolverine, the second Spider-Woman, Ant-Man, Iceman, Nomad, and many others were members. At the end of its existence, the group had a somewhat regular composition including Cadaver, Sepulchre, Joshua Pryce, and Doctor Druid.\n\nOther versions [ edit ]\n\nUltimate Marvel [ edit ]\n\nIn the Ultimate Marvel universe, the Defenders are a group of amateur vigilantes who dress up as superheroes. None of them have superpowers, although they claim to be experienced in crimefighting. Henry Pym is invited to join them, and he accepts, adopting a new identity, Ant-Man, to avoid the potential legal problems of using his growth serum, as it has become the official property of the government. Their members include Ultimate versions of Power Man, Hellcat, Nighthawk, Valkyrie, Black Knight, Son of Satan and Whiz-Kid.[56] The Ultimate Defenders are much more interested in becoming celebrities rather than actually stopping crimes or saving lives.\n\nSince The Ultimates vol. 3, Pym has rejoined the Ultimates, and the Valkyrie was rewritten as having powers and skills akin to her Earth-616 counterpart, along with expertise in sword fighting, some degree of enhanced strength, and training by Thor.[57]\n\nThe Defenders return in Ultimate Comics: New Ultimates #1 (May 2010) with the original members now possessing superhuman abilities that fit their namesakes. It's revealed that Loki gave them these powers (Valkyrie included), to steal Thor's enchanted hammer Mjolnir.[58]\n\n\"Age of Ultron\" [ edit ]\n\nFollowing Wolverine's murder of Hank Pym during the Age of Ultron to keep Ultron from being created, a splinter timeline called Earth-26111 is created. In the new timeline, the Defenders became the world's premier superhero team after the disbanding of the Avengers. The new Defenders line-up consisted of Doctor Strange, Captain America, Wolverine, Janet Van Dyne as Captain Marvel, Thing, Scott Summers as Cable, Hulk, and Star-Lord. The group is a resistance against Morgan le Fay who has conquered half of Earth.[59]\n\n\"Iron Man: Fatal Frontier\" [ edit ]\n\nIn the Iron Man: Fatal Frontier storyline taking place on Earth-10429, a version of the Defenders consisting of Captain America, the Hulk, and Thor encountered Rescue, this reality's version of Ho Yinsen. After a brief fight over a misunderstanding, Rescue joins up with the Defenders.[60]\n\nSecret Wars (2015) [ edit ]\n\nDuring the \"Secret Wars\" storyline, different versions of the Defenders are featured:\n\nIn other media [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nThe four founding members of the Defenders each play a role in Marvel: Ultimate Alliance . The Silver Surfer can be unlocked with a special code (available to those who pre-ordered the game through specific outlets) or by completing all Comic Book Missions. Both Doctor Strange and Namor are NPC-Striker characters in the GBA version. Doctor Strange is a playable character in most platforms. In all other versions, Bruce Banner originally only appears as an NPC character who aids the heroes in defusing a gamma bomb, though the Hulk was subsequently released as an optional downloadable playable character in the Xbox 360 version. Namor plays a prominent part in the storyline, when the player must assist in averting an uprising in Atlantis, rescuing Namor from the prison of air he has been trapped in and defeating the Atlanteans (now under control of renegades such as Attuma and Tiger Shark). The player can get a Defenders team bonus for using a team of Doctor Strange, Silver Surfer, Luke Cage, Iceman, or the downloadable Hulk or receive a team bonus of Secret Defenders by using Ghost Rider, Hulk, Silver Surfer, and Doctor Strange.\n\n. The Silver Surfer can be unlocked with a special code (available to those who pre-ordered the game through specific outlets) or by completing all Comic Book Missions. Both Doctor Strange and Namor are NPC-Striker characters in the GBA version. Doctor Strange is a playable character in most platforms. In all other versions, Bruce Banner originally only appears as an NPC character who aids the heroes in defusing a gamma bomb, though the Hulk was subsequently released as an optional downloadable playable character in the Xbox 360 version. Namor plays a prominent part in the storyline, when the player must assist in averting an uprising in Atlantis, rescuing Namor from the prison of air he has been trapped in and defeating the Atlanteans (now under control of renegades such as Attuma and Tiger Shark). The player can get a Defenders team bonus for using a team of Doctor Strange, Silver Surfer, Luke Cage, Iceman, or the downloadable Hulk or receive a team bonus of Secret Defenders by using Ghost Rider, Hulk, Silver Surfer, and Doctor Strange. The Defenders appear in Marvel Avengers Academy . It consists of Colleen Wing, Daredevil, Hellcat, Iron Fist, Jessica Jones, Luke Cage, and Misty Knight.\n\n. It consists of Colleen Wing, Daredevil, Hellcat, Iron Fist, Jessica Jones, Luke Cage, and Misty Knight. The Defenders appear in Marvel Ultimate Alliance 3: The Black Order with Dardevil, Luke Cage, Iron Fist and Elektra as playable characters and Jessica Jones as a non-playable character in the story.\n\nHomages [ edit ]\n\nCollected editions [ edit ]\n\nMarvel Masterworks Defenders [ edit ]\n\nTitle Material collected Year ISBN Volume 1 Sub-Mariner #34–35, Marvel Feature #1–3, The Defenders #1–6 2008 ISBN 978-0785130444 Volume 2 The Defenders #7–16, Giant-Size Defenders #1, The Avengers #115–118 2011 ISBN 978-0785142164 Volume 3 The Defenders #17–21, Giant-Size Defenders #2–4, Marvel Two-In-One #6–7 2012 ISBN 978-0785159612 Volume 4 The Defenders #22–30, Giant-Size Defenders #5, Marvel Super-Heroes #18 2014 ISBN 978-0785166276 Volume 5 The Defenders #31–41, The Defenders Annual #1, Marvel Treasury Edition #12 2015 ISBN 978-0785191827 Volume 6 The Defenders #42-57, material From FOOM #19 2018 ISBN 978-1302909581 Volume 7 The Defenders #58-75, material From Marvel Treaury Edition #16 2020 ISBN 978-1302922269\n\nEssential Defenders [ edit ]\n\nTitle Material collected Year ISBN Volume 1 The Defenders #1–14, Doctor Strange #183, Sub-Mariner #22, 34–35, The Incredible Hulk #126,\n\nMarvel Feature #1–3, and The Avengers #115–118 2005 ISBN 978-0785115472 Volume 2 The Defenders #15–30, Giant-Size Defenders #1–5, Marvel Two-in-One #6–7, Marvel Team-Up #33–35,\n\nand Marvel Treasury Edition #12 2006 ISBN 978-0785121503 Volume 3 The Defenders #31–60 and The Defenders Annual #1 2007 ISBN 978-0785126966 Volume 4 The Defenders #61–91 2008 ISBN 978-0785130611 Volume 5 The Defenders #92–106, Marvel Team-Up #101, 111, 116, Captain America #268 2010 ISBN 978-0785145370 Volume 6 The Defenders #107–124, The New Defenders #125, The Avengers Annual #11,\n\nMarvel Team-Up #119 2011 ISBN 978-0785157540 Volume 7 The New Defenders #126–139, Iceman #1–4, Beauty and the Beast #1–4 2013 ISBN 978-0785184058\n\nMarvel Epic collections [ edit ]\n\nTitle Volume Material collected Year ISBN The Defenders: The Six Fingered Hand 6 The Defenders #92-109; Marvel Team-Up #101;\n\nCaptain America #268 2016 ISBN 978-0785195993 The Defenders: Ashes To Ashes 7 The Defenders #110-125; Avengers Annual #11\n\n2017 ISBN 978-1302904289 The Defenders: The New Defenders 8 The Defenders #126–137; Iceman #1–4; Beauty and the Beast #1–4\n\n2018 ISBN 978-1302912031 The Defenders: The End Of All Songs 9 The Defenders #138–152; Gargoyle #1–4\n\n2019 ISBN 978-1302920708\n\nOther Volume One collected editions [ edit ]\n\nTitle Material collected Year ISBN The Defenders: Tournament of Heroes The Defenders #62-65 2012 Omega the Unknown Classic Omega the Unknown #1-10 and The Defenders #76-77 2006 978-0785120094 Avengers/Defenders War The Defenders #8–11 and The Avengers #115–118 2002 (TPB)\n\n2007 (HC) 978-0785108443 (TPB)\n\n978-0785127598 (HC) The New Defenders Volume 1 The Defenders #122–124 and The New Defenders #125–131 2012 978-0785162469\n\nThe Secret Defenders [ edit ]\n\nTitle Material collected Year ISBN Doctor Strange and the Secret Defenders Secret Defenders #1-11 2016 978-1302901080 Thanos: Cosmic Powers Secret Defenders #12-14, Cosmic Powers #1-6 2015 978-0785198178 Deadpool and the Secret Defenders Secret Defenders #15-25 2017 978-1302904173\n\nDefenders volume 3 [ edit ]\n\nTitle Material collected Year ISBN Defenders: Indefensible The Defenders (volume 3) #1-5 2006 (HC)\n\n2007 (TPB) ISBN 978-0785121527 (HC)\n\nISBN 978-0785117629 (TPB)\n\nThe Last Defenders [ edit ]\n\nTitle Material collected Year ISBN The Last Defenders The Last Defenders #1-6 2008 ISBN 978-0785125075\n\nThe Defenders by Matt Fraction (volume 4) [ edit ]\n\nTitle Material collected Year ISBN Volume 1 The Defenders vol. 4 #1–6, material from Point One #1, and Fear Itself #7 2012 ISBN 978-0785158516 Volume 2 The Defenders vol. 4 #7–12 2013 ISBN 978-0785158530\n\nThe Fearless Defenders [ edit ]\n\nTitle Material collected Year ISBN Volume One - Doom Maidens The Fearless Defenders #1-6 2013 ISBN 978-0785168485 Volume Two - The Most Fabulous Fighting Team of All The Fearless Defenders #7-12 2014 ISBN 978-0785168492\n\nThe Defenders by Brian Michael Bendis (volume 5) [ edit ]\n\nTitle Material collected Year ISBN Volume 1 - Diamonds Are Forever Defenders story from Free Comic Book Day 2017, The Defenders vol. 5 #1-6 2017 ISBN 978-1302916145 Volume 2 - Kingpins of New York The Defenders vol. 5 #7-11 2018 ISBN 978-1302907471\n\nThe Best Defense [ edit ]\n\nTitle Material collected Year ISBN The Best Defense The Immortal Hulk The Best Defense #1, Namor The Best Defense #1, The Silver Surfer The Best Defense #1, Doctor Strange The Best Defense #1, The Defenders The Best Defense #1 2019 ISBN 978-1302916145\n\nOther [ edit ]\n\nTitle Material collected Year ISBN Hulk, Vol. 3: Hulk No More (collects the \"Defenders vs. Offenders\" storyline) Hulk #10–12 plus #13 and #600 2009 (HC)\n\n2010 (TPB) ISBN 978-0785139836 (HC)\n\nISBN 978-0785140528 (TPB) The Incredible Hulk Epic Collection #19: Ghosts of the Past\n\n(contains The Return of the Defenders storyline) The Incredible Hulk #397-406, Annual #18-19; and material from: Namor the Sub-Mariner Annual #2;\n\nSilver Surfer Annual #5; Doctor Strange, Sorcerer Supreme Annual #2; Marvel Holiday Special #2 2015 ISBN 978-0785192992\n\n978-1302907464", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6f/The_Defenders_in_the_2017_series.jpg/220px-The_Defenders_in_the_2017_series.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/7/7b/Defenders-2017-Cover.jpg/170px-Defenders-2017-Cover.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/0/07/Marvel_Feature_1_%281971%29.jpg/170px-Marvel_Feature_1_%281971%29.jpg", "https://upload.wikimedia.org/wikipedia/en/a/a6/Defenders_%28Marvel_Comics_team%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a6/Defenders_%28Marvel_Comics_team%29.jpg/240px-Defenders_%28Marvel_Comics_team%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a6/Defenders_%28Marvel_Comics_team%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Defenders_(comics)", "title": "Defenders (comics)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/a6/Defenders_%28Marvel_Comics_team%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}