{"url": "https://en.wikipedia.org/wiki/Me_Too_movement", "text": "Not to be confused with MeTwo movement\n\n#MeToo does not redirect here due to technical restrictions\n\nA movement against sexual harassment and assault\n\nThe Me Too (or #MeToo) movement, with variations of related local or international names, is a movement against sexual harassment and sexual assault of women.[1][2][3] The phrase \"Me Too\" was initially used in this context on social media in 2006, on Myspace, by sexual harassment survivor and activist Tarana Burke.[4]\n\nSimilar to other social justice and empowerment movements based upon breaking silence, the purpose of \"Me Too\", as initially voiced by Burke as well as those who later adopted the tactic, is to empower women through empathy and solidarity through strength in numbers, especially young and vulnerable women, by visibly demonstrating how many women have survived sexual assault and harassment, especially in the workplace.[4][5][6]\n\nFollowing the exposure of the widespread sexual-abuse allegations against Harvey Weinstein in early October 2017,[7][8] the movement began to spread virally as a hashtag on social media.[6][9][10] On October 15, 2017, American actress Alyssa Milano posted on Twitter, \"If all the women who have been sexually harassed or assaulted wrote 'Me too' as a status, we might give people a sense of the magnitude of the problem,\" saying that she got the idea from a friend.[11][12][13][14] A number of high-profile posts and responses from American celebrities Gwyneth Paltrow,[15] Ashley Judd,[16] Jennifer Lawrence,[17] and Uma Thurman, among others, soon followed.[18]\n\nWidespread media coverage and discussion of sexual harassment, particularly in Hollywood, led to high-profile firings, as well as criticism and backlash.[19][20][21]\n\nAfter millions of people started using the phrase and hashtag in this manner in English, the expression began to spread to dozens of other languages. The scope has become somewhat broader with this expansion, however, and Burke has more recently referred to it as an international movement for justice for marginalized people in marginalized communities.[22]\n\nPurpose\n\nThe original purpose of \"Me Too\" as used by Tarana Burke in 2006 was to empower women through empathy, especially young and vulnerable women. In October 2017, Alyssa Milano encouraged using the phrase as a hashtag to help reveal the extent of problems with sexual harassment and assault by showing how many people have experienced these events themselves.[4][5]\n\nAfter millions of people started using the phrase, and it spread to dozens of other languages, the purpose changed and expanded, and as a result, it has come to mean different things to different people. Tarana Burke accepts the title of \"leader\" of the movement, but has stated that she considers herself more of a \"worker.\" Burke has stated that this movement has grown to include both men and women of all colors and ages, as it continues to support marginalized people in marginalized communities.[19][22] There have also been movements by men aimed at changing the culture through personal reflection and future action, including #IDidThat, #IHave, and #IWill.[23]\n\nAwareness and empathy\n\nAnalyses of the movement often point to the prevalence of sexual violence, which has been estimated by the World Health Organization to affect one-third of all women worldwide. A 2017 poll by ABC News and The Washington Post also found that 54% of American women report receiving \"unwanted and inappropriate\" sexual advances with 95% saying that such behavior usually goes unpunished. Others state that #MeToo underscores the need for men to intervene when they witness demeaning behavior.[24][25][26]\n\nBurke said that #MeToo declares sexual violence sufferers are not alone and should not be ashamed.[27] Burke says sexual violence is usually caused by someone the woman knows, so people should be educated from a young age that they have the right to say no to sexual contact from any person, even after repeated solicitations from an authority or spouse, and to report predatory behavior.[28] Burke advises men to talk to each other about consent, call out demeaning behavior when they see it and try to listen to victims when they tell their stories.[28]\n\nAlyssa Milano described the reach of #MeToo as helping society understand the \"magnitude of the problem\" and said, \"it's a standing in solidarity to all those who have been hurt.\"[29][30] She stated that the success of #MeToo will require men to take a stand against behavior that objectifies women.[31]\n\nPolicies and laws\n\nBurke has stated the current purpose of the movement is to give people the resources to have access to healing, and to advocate for changes to laws and policies. Burke has highlighted goals such as processing all untested rape kits, re-examining local school policies, improving the vetting of teachers, and updating sexual harassment policies.[32] She has called for all professionals who work with children to be fingerprinted and subjected to a background check before being cleared to start work. She advocates for sex education that teaches kids to report predatory behavior immediately.[28] Burke supports the #MeToo bill in the US Congress, which would remove the requirement that staffers of the federal government go through months of \"cooling off\" before being allowed to file a complaint against a Congressperson.[32]\n\nMilano states that a priority for #MeToo is changing the laws surrounding sexual harassment and assault, for example instituting protocols that give sufferers in all industries the ability to file complaints without retaliation. She supports legislation making it difficult for publicly traded companies to hide cover-up payments from their stockholders and would like to make it illegal for employers to require new workers to sign non-disclosure agreements as a condition of employment.[31] Gender analysts such as Anna North have stated that #MeToo should be addressed as a labor issue due to the economic disadvantages to reporting harassment. North suggested combating underlying power imbalances in some workplaces, for example by raising the tipped minimum wage, and embraces innovations like the \"portable panic buttons\" that are mandated for hotel employees in Seattle.[33]\n\nOthers have suggested that barriers to employment must be removed, such as the job requirement by some employers to sign non-disclosure agreements or other agreements that prevent an employee from talking about their employment publicly, or taking disputes (including sexual harassment claims) to arbitration rather than to legal proceedings. It's been suggested that legislation should be passed that bans these types of mandatory pre-employment agreements.[1]\n\nSome policy-based changes that have been suggested include increasing managerial oversight; creating clear internal reporting mechanisms; more effective and proactive disciplinary measures; creating a culture that encourages employees to be open about serious problems;[1] imposing financial penalties for companies that allow workers to remain in their position when they have repeatedly sexually harassed others; and forcing companies to pay huge fines or lose tax breaks if they decide to retain workers who are sexual harassers.[34]\n\nMedia coverage\n\nIn the coverage of #MeToo, there has been widespread discussion about the best ways to stop sexual harassment and abuse - for those who are currently being victimized at work, as well as those who are seeking justice for past abuse and trying to find ways to end what they see as a widespread culture of abuse. There is general agreement that a lack of effective reporting options is a major factor that drives unchecked sexual misconduct in the workplace.[35]\n\nFalse reports of sexual assault are very rare, but when they happen, they are put in the spotlight for the public to see. This can give the false impression that the majority of the reported sexual assaults are false. However, false reports of sexual assault only make up 2%–10% of the total number that are reported.[36][37] These figures do not take into account that the majority of victims do not report when they are assaulted or harassed. Misconceptions about false reports are one of the reasons why women are scared to report their experiences with sexual assault - because they are afraid that no one will believe them, that in the process they will have embarrassed and humiliated themselves, in addition to opening themselves up to retribution from the assailants.[38][39]\n\nIn France, a person who makes a sexual harassment complaint at work is reprimanded or fired 40% of the time, while the accused person is typically not investigated or punished.[40] In the United States, a 2016 report from the Equal Employment Opportunity Commission states that although 25–85% of women say they experience sexual harassment at work, few ever report the incidents, most commonly due to fear of reprisal.[35] There is evidence that in Japan, as few as 4% of rape victims report the crime, and the charges are dropped about half the time.[41][42]\n\nThere is a discussion on the best ways to handle whisper networks, or private lists of \"people to avoid\" that are shared unofficially in nearly every major institution or industry where sexual harassment is common due to power imbalances, including government, media, news, and academia. These lists have the stated purpose of warning other workers in the industry and are shared from person-to-person, on forums, in private social media groups, and via spreadsheets. However, it has been argued that these lists can become \"weaponized\" and be used to spread unsubstantiated gossip - an opinion which has been discussed widely in the media.[43]\n\nDefenders say the lists provide a way to warn other vulnerable people in the industry if worried about serious retribution from the abusers, especially if complaints have already been ignored. They say the lists help victims identify each other so they can speak out together and find safety in numbers.[43][44] Sometimes these lists are kept for other reasons. For example, a spreadsheet from the United Kingdom called \"High Libido MPs\" and dubbed \"the spreadsheet of shame\" was created by a group of male and female Parliamentary researchers, and contained a list of allegations against nearly 40 Conservative MPs in the British Parliament. It is also rumored that party whips (who are in charge of getting members of Parliament to commit to votes) maintain a \"black book\" that contains allegations against several lawmakers that can be used for blackmail.[45][46][47] When it is claimed a well-known person's sexual misconduct was an \"open secret\", these lists are often the source.[43] In the wake of #MeToo, several private whisper network lists have been leaked to the public.[43][44]\n\nIn India, a student gave her friends a list containing names of professors and academics in the Indian university system to be avoided. The list went viral after it was posted on social media.[48] In response to criticism in the media, the authors defended themselves by saying they were only trying to warn their friends, had confirmed every case, and several victims from the list were poor students who had already been punished or ignored when trying to come forward.[49][50] Moira Donegan, a New York City-based journalist, privately shared a crowd-sourced list of \"Shitty Media Men\" to avoid in publishing and journalism. When it was shared outside her private network, Donegan lost her job. Donegan stated it was unfair so few people had access to the list before it went public; for example, very few women of color received access (and therefore protection) from it. She pointed to her \"whiteness, health, education, and class\" that allowed her to take the risk of sharing the list and getting fired.[44]\n\nThe main problem with trying to protect more potential victims by publishing whisper networks is determining the best mechanism to verify allegations in a way that is fair to all parties.[51][52] Some suggestions have included strengthening labor unions in vulnerable industries so workers can report harassment directly to the union instead of to an employer. Another suggestion is to maintain industry hotlines which have the power to trigger third-party investigations.[51] Several apps have been developed which offer various ways to report sexual misconduct, and some of these apps also have the ability to connect victims who have reported the same person.[53]\n\nIssues with social norms\n\nIn the wake of #MeToo, many countries such as the U.S.,[54] India,[55] France,[56] China,[57] Japan,[41] and Italy,[58] have seen discussion in the media on whether cultural norms need to be changed for sexual harassment to be eradicated in the workplace.\n\nDr. John Launer of Health Education England stated leaders must be made aware of common \"mismatches of perceptions\" at work to reduce incidents where one person thinks they are flirting while the other person feels like they're being demeaned or harassed.[59] Reporter Anna North from Vox states one way to address #MeToo is teach children the basics of sex. North states the cultural notion that women do not enjoy sex leads men \"to believe that a lukewarm yes is all they're ever going to get\", referring to a 2017 study which found that men who believe women enjoy being forced into sex are \"more likely to perceive women as consenting\".[60] Alyssa Rosenberg of The Washington Post called for society to be careful of overreaching by \"being clear about what behavior is criminal, what behavior is legal but intolerable in a workplace, and what private intimate behavior is worthy of condemnation\" but not part of the workplace discussion. She says \"preserving the nuances\" is more inclusive and realistic.[61]\n\nProfessor Daniel Drezner stated that #MeToo laid the groundwork for two major cultural shifts. One is the acceptance that sexual harassment (not just sexual assault) is unacceptable in the workplace. The other is that when a powerful person is accused of sexual harassment, the reaction should be a presumption that the less powerful accuser is \"likely telling the truth, because the risks of going public are great.\" However, he states society is struggling with the speed at which change is being demanded.[62]\n\nReform and implementation\n\nAlthough #MeToo initially focused on adults, the message spread to students in K–12 schools where sexual abuse is common both in person and online.[63] MeTooK12 is a spin-off of #MeToo created in January 2018 by the group Stop Sexual Assault in Schools, founded by Joel Levin and Esther Warkov, aimed at stopping sexual abuse in education from kindergarten to high school.[64][65] #MeTooK12 was inspired in part by the removal of certain federal Title IX sexual misconduct guidelines.[66] There is evidence that sexual misconduct in K–12 education is dramatically underreported by both schools and students, because nearly 80% of public schools never report any incidents of harassment. A 2011 survey found 40% of boys and 56% of girls in grades 7–12 reported had experienced some type of negative sexual comment or sexual harassment in their lives.[64][66] Approximately 5% of K–12 sexual misconduct reports involved 5 or 6-year-old students. #MeTooK12 is meant to demonstrate the widespread prevalence of sexual misconduct towards children in school, and the need for increased training on Title IX policies, as only 18 states require people in education to receive training about what to do when a student or teacher is sexually abused.[65]\n\nRole of men\n\nThere has been discussion about what possible roles men may have in the #MeToo movement.[67][68][69] It has been noted that 1 in 6 men have experienced sexual abuse of some sort during their lives and often feel unable to talk about it.[70] Creator Tarana Burke and others have asked men to call out bad behavior when they see it,[68][69] or just spend time quietly listening.[19][71] Some men have expressed the desire to keep a greater distance from women since #MeToo went viral because they do not fully understand what actions might be considered inappropriate.[72][73] For the first few months after #MeToo started trending, many men expressed difficulty in participating in the conversation due to fear of negative consequences, citing examples of men who have been treated negatively after sharing their thoughts about #MeToo.[74]\n\nAuthor and former pick-up artist Michael Ellsberg encourages men to reflect on past behavior and examples of questionable sexual behavior, such as the viral story Cat Person, which is written from the perspective of a twenty-year-old woman who goes on a date with a much older man and ends up having an unpleasant sexual experience that was consensual but unwanted. Ellsberg has asked men to pledge to ensure women are mutually interested in initiating a sexual encounter and to slow down if there is ever doubt a woman wants to continue.[75][76]\n\nRelationship instructor Kasia Urbaniak said the movement is creating its own crisis around masculinity. \"There's a reflective questioning about whether they’re going to be next and if they’ve ever hurt a woman. There's a level of anger and frustration. If you’ve been doing something wrong but haven't been told, there's an incredible sense of betrayal and it’ll provoke a backlash. I think silence on both sides is incredibly dangerous.\" Urbaniak says she would like women to be allies of men and to be curious about their experience. \"In that alliance there's a lot more power and possibility than there is in men stepping aside and starting to stew.\"[77]\n\nIn August 2018, The New York Times detailed allegations that leading #MeToo figure Asia Argento sexually assaulted actor Jimmy Bennett.[78] The sexual assault allegedly took place in a California hotel room in 2013 when he was only two months past his 17th birthday and she was 37; the age of consent in that state is 18.[78] Bennett said when Argento came out against Harvey Weinstein, it stirred memories of his own experience. He imparted he had sought to resolve the matter privately, and had not spoken out sooner, \"because I was ashamed and afraid to be part of the public narrative.\"[79] In a statement provided to The Times, he said: \"I was underage when the event took place, and I tried to seek justice in a way that made sense to me at the time because I was not ready to deal with the ramifications of my story becoming public. At the time I believed there was still a stigma to being in the situation as a male in our society. I didn't think that people would understand the event that took place from the eyes of a teenage boy.\" Bennett said he would like to \"move past this event in my life,\" adding, \"today I choose to move forward, no longer in silence.\"[79] Argento, who quietly arranged a $380,000 nondisclosure settlement with Bennett in the months following her revelations regarding Weinstein, has denied the allegations.[80] Rose McGowan initially expressed support for Argento on and implored others to show restraint, tweeting, \"None of us know the truth of the situation and I'm sure more will be revealed. Be gentle.\" As one of the most vocal advocates of the Me Too movement, McGowan faced criticism on social media for her comments, which conflicted with the movement's message of believing survivors.[81] MeToo founder Tarana Burke responded the Asia Argento report, stating \"I’ve said repeatedly that the #metooMVMT is for all of us, including these brave young men who are now coming forward. Sexual violence is about power and privilege. That doesn't change if the perpetrator is your favorite actress, activist or professor of any gender.\"[3]\n\nTimeline\n\n2006 (Tarana Burke)\n\nTarana Burke, a social activist and community organizer, began using the phrase \"Me Too\" in 2006, on the Myspace social network[4] in order to promote \"empowerment through empathy\" among women of color who have been sexually abused.[14][82][83] Burke, who is creating a documentary titled Me Too, has said she was inspired to use the phrase after being unable to respond to a 13-year-old girl who confided to her that she had been sexually assaulted. Burke said she later wished she had simply told the girl: \"Me too\".[4][27]\n\n2015 (Ambra Gutierrez)\n\nIn 2015 The New York Times reported that Weinstein was questioned by police \"after a 22-year-old woman accused him of touching her inappropriately.\"[84] The woman, Italian model Ambra Gutierrez, cooperated with the New York City Police Department (NYPD) to obtain an audio recording where Weinstein admitted to having inappropriately touched her.[85] As the police investigation progressed and became public, tabloids published negative stories about Gutierrez that portrayed her as an opportunist.[86] American Media, publisher of the National Enquirer, allegedly agreed to help suppress the allegations by Gutierrez and Rose McGowan. Manhattan District Attorney Cyrus Vance Jr. decided not to file charges against Weinstein, citing insufficient evidence of criminal intent, against the advice of local police who considered the evidence sufficient.[87] The New York district attorney's office and the NYPD blamed each other for failing to bring charges.[87]\n\n2016: Russia and Ukraine (Anastasia Melnichenko)\n\nIn July 2016, a social media post by Ukrainian journalist Anastasia Melnichenko went viral. Thousands of women, and some men, in Russia and Ukraine began posting their personal stories of sexual harassment and assault on social media using the hashtag #IAmNotAfraidToSpeak (#яНеБоюсьСказати‬ in Ukrainian; #яНеБоюсьСказать in Russian).[88][89][90][91] Her original post in Ukrainian[92] was about a sexual harassment in family, on the streets, with ex-boyfriend, but not in the workspace. Also she updated her post with the words: \"Цей допис писала, лютуючи на коменти чоловіків під цим дописом: <...>. Тому і дозволила собі досить агресивний випад у бік чоловіків вкінці посту. Звісно ж, не хотіла образити хороших і адекватних. Як з*ясувалося, їх більше, ніж я думала.\" (\"I wrote this post, raging at the comments of men under this post: <...> That is why I let myself aggressive enough attack towards men at the end of the post. Of course, I did not want to offend good and adequate ones. As it turned out, there are more of them than I thought.\").\n\n2017 (Alyssa Milano)\n\nFollowing widespread exposure of accusations of predatory behavior by Harvey Weinstein, and her own blog post on the subject, on October 15, 2017, actress Alyssa Milano wrote: \"If you’ve been sexually harassed or assaulted write ‘me too’ as a reply to this tweet.\", and reposted the following phrase suggested by a friend: \"If all the women who have been sexually harassed or assaulted wrote ‘Me too.’ as a status, we might give people a sense of the magnitude of the problem.\",[12][11] encouraging spreading the phrase \"Me Too.\" to attempt to draw attention to sexual assault and harassment.[14][5] The next day, October 16, 2017, Milano wrote: \"I was just made aware of an earlier #MeToo movement, and the origin story is equal parts heartbreaking and inspiring\", providing the link to site of Ms. Burke.[4][27][93] Milano credits her identification with the Me Too movement to being personally affected by sexual harassment during a concert when she was 19.[94]\n\nSeveral hashtags related to sharing stories of workplace sexual harassment were in use before #MeToo, including #MyHarveyWeinstein, #WhatWereYouWearing (on March 12, 2014 there was a question on Twitter \"What Were You Wearing When You Were Assaulted?\" and there were answers what they wore;[95] there were posts with the #whatwereyouwearing as late as of 2010, not related to any kind of sexual harassment or workplace[96][97][98]), #SurvivorPrivilege (in June 2014 the #SurvivorPrivilege was about alleged lies of rape survivors to get privileges and denial of that by females, especially by students[99]) and #YouOkSis (on August 2, 2014 there was #YouOkSis about street harassment[100]).[101][102][103]\n\nImpact\n\nUS media and fashion industries\n\nThe phrase \"Me too\" was tweeted by Milano around noon on October 15, 2017, and had been used more than 200,000 times by the end of the day,[104] and tweeted more than 500,000 times by October 16.[105] On Facebook, the hashtag was used by more than 4.7 million people in 12 million posts during the first 24 hours.[27] The platform reported that 45% of users in the United States had a friend who had posted using the term.[106]\n\nTens of thousands of people, including hundreds of celebrities, replied with #MeToo stories.[107] Some men, such as actors Terry Crews[108] and James Van Der Beek,[109] have responded to the hashtag with their own experiences of harassment and abuse. Others have responded by acknowledging past behaviors against women, spawning the hashtag #HowIWillChange.[110]\n\nIn addition to Hollywood, \"Me Too\" declarations elicited discussion of sexual harassment and abuse in the music industry,[111] sciences,[112] academia,[113] and politics.[114]\n\nFeminist author Gloria Feldt stated in Time that many employers are being forced to make changes in response to #MeToo, for example examining gender-based pay differences and improving sexual harassment policies.[115] Others have noted there has been pressure on companies, specifically in the financial industry, to disclose diversity statistics[clarification needed].[116]\n\nIn January 2019, actress Emma Thompson pulled out of the production \"Luck\" based on the production company's decision to hire former Disney Chief Creative Officer John Lasseter. Lasseter had been accused of harassing women while at Disney.[117] Thompson wrote a letter in February 2019 to the American production company Skydance, to explain her reasons for leaving \"Luck\". Among others, Thompson stated: \"If a man has been touching women inappropriately for decades, why would a woman want to work for him if the only reason he’s not touching them inappropriately now is that it says in his contract that he must behave \"professionally\"?[118]\n\nThe 2019 rerelease of Toy Story 2 had a blooper scene during the credits removed due to sexual misconduct concerns.[119]\n\nChurches\n\nIn November 2017, the hashtag #ChurchToo was started by Emily Joy and Hannah Paasch on Twitter and began trending in response to #MeToo as a way to try to highlight and stop sexual abuse that happens in a church.[120][121] In early January 2018, about a hundred evangelical women also launched #SilenceIsNotSpiritual to call for changes to how sexual misconduct is dealt within the church.[122][123] #ChurchToo started spreading again virally later in January 2018 in response to a live-streamed video admission by Pastor Andy Savage to his church that he sexually assaulted a 17-year-old girl twenty years before as a youth pastor while driving her home, but then received applause by his church for admitting to the incident and asking for forgiveness. Pastor Andy Savage then resigned from his staff position at Highpoint Church and stepped away from ministry.[124][125][126] Many have argued that one of the biggest crises in the history of the Catholic Church is the current child sexual abuse that is being reported, according to Tom Inglis in his book Are the Irish Different?.[127]\n\nEducation\n\nThe University of California has been no stranger to sexual harassment, with substantial accusations reported yearly in the hundreds at all nine UC campuses, notably UC Berkeley, Davis, Irvine, Los Angeles, and San Diego.[128] However, a landmark event at the University of California, Irvine spearheaded the removal and reprimand of several campus officials and professors accused of sexual harassment and discrimination. In early July 2018, UC Irvine removed millionaire benefactor Francisco J. Ayala's name from its biology school, central science library, graduate fellowships, scholar programs, and endowed chairs after an internal investigation substantiated a number of sexual harassment claims. The results from the investigation were compiled in a 97-page report, which included testimony from victims enduring Ayala's harassment for 15 years.[129][130][131][132][133][134][135] His removal promptly sparked the removal of Professor Ron Carlson in August 2018, who had led the creative writing program at UC Irvine. He resigned after substantiated reports of sexual misconduct with an underage student were unearthed.[136] UC Irvine upon learning about the report accepted Professor Carlson's immediate resignation.[137] Four additional professors in the School of Biological Sciences at UC Irvine between June and August 2018 were put under sanctions or terminated for violating the UC Policy on Sexual Harassment[citation needed]. Several claims were also reviewed against Thomas A. Parham, former vice chancellor at UC Irvine and former president of the Association of Black Psychologists.[138]\n\nTo address harassment within scientific settings, BethAnn McLaughlin started the #MeTooSTEM movement and hashtag.[139] She called for the National Institutes of Health to cut funding to anyone who has been found guilty of harassment charges.[139][140] McLaughlin shared the MIT Media Lab Disobedience Award with Tarana Burke and Sherry Marts for her work on Me Too in STEM.[141][142]\n\nThere are still many places of education such as high schools, however, where legal intervention is not readily enforced for situations where sexual assault takes place. Pamela Y. Price in her book Directions in Sexual Harassment Law describes how \"a major argument for why [laws against] sexual harassment won't work in education is that issues of sexuality can't be regulated (similar to the debate in employment) or that adolescent behavior is too unpredictable to be legally controlled\" (Price 62).[143]\n\nFinance\n\nIt has been noted that, although the financial industry is known to have a wide prevalence of sexual harassment,[144] as of January 2018, there were no high-profile financial executives stepping down as the result of #MeToo allegations.[145] The first widely covered example of concrete consequences in finance was when two reporters, including Madison Marriage of the Financial Times, went undercover at a men-only Presidents Club event meant to raise money for children. Because women were not allowed to attend except as \"hostesses\" in tight, short black dresses with black underwear, Financial Times reporter Madison Marriage and another reporter got jobs as hostesses and documented widespread sexual misconduct. As a result, The Presidents Club was shut down.[145]\n\nIn March 2018, Morgan Stanley broker Douglas E. Greenberg was put on administrative leave after a New York Times story outlined harassment allegations by four women, including multiple arrests for the violation of restraining orders, and a threat to burn down an ex-girlfriend's house. It has been called the #MeToo moment of Portland's financial service industry.[146]\n\nOnly about a quarter of top positions are held by women at several major banks, and there is evidence there may be wide disparities in some financial institutions between how much men and women are paid on average.[116][relevant? – discuss]\n\nThe authors of a December 2018 Bloomberg News article on this topic interviewed more than thirty senior Wall Street executives and found that many are now more cautious about mentoring up and coming female executives because of the perceived risks involved. One said, \"If men avoid working or traveling with women alone, or stop mentoring women for fear of being accused of sexual harassment, those men are going to back out of a sexual harassment complaint and right into a sex discrimination complaint.\"[147]\n\nPolitics and government\n\nStatehouses in California, Illinois, Oregon, and Rhode Island responded to allegations of sexual harassment surfaced by the campaign,[148] and several women in politics spoke out about their experiences of sexual harassment, including United States Senators Heidi Heitkamp, Mazie Hirono, Claire McCaskill and Elizabeth Warren.[114] Congresswoman Jackie Speier has introduced a bill aimed at making sexual harassment complaints easier to report on Capitol Hill.[149] The accusations in the world of Spanish politics have also been published in the media,[150] and a series of allegations and research on MPs and political figures of (all major British political parties) regarding sexual impropriety became a nationwide scandal in 2017; this research was undertaken in the aftermath of the Weinstein scandal and the Me Too movement.[151][152][153]\n\nDetective Leslie Branch-Wise of the Denver Police Department spoke publicly for the first time in 2018 about experiencing sexual harassment by Denver Mayor Michael B. Hancock. The detective provided sexually suggestive text messages from Hancock sent to her while working for Hancock's security detail in 2012. After six years of keeping the secret, Detective Branch-Wise credited the Me Too movement as an inspiration to share her experience.[154]\n\nCongressman John Conyers was the first sitting United States politician to resign in the wake of #MeToo.[155][156][157] Later in 2019, Katie Hill resigned from Congress[158] due to an affair with a staffer after the House Ethics Committee opened an investigation into her conduct, stemming from these new rules.[159]\n\nME TOO bill in the US Congress\n\nJackie Speier proposed the Member and Employee Training and Oversight on Congress Act (ME TOO Congress Act) on November 15, 2017.[160] The full language of the bipartisan bill was revealed by the House on January 18, 2018 as an amendment to the Congressional Accountability Act of 1995.[161] The purpose of the bill is to change how the legislative branch of the U.S. federal government treats sexual harassment complaints. Under the old system, complaints regarding the legislative branch were channeled through the Office of Compliance, which required complete confidentially through the process and took months of counseling and mediation before a complaint could actually be filed. Any settlement payments were paid using federal taxes, and it was reported that within a decade, $15 million of tax money had been spent settling harassment and discrimination complaints. The bill would ensure future complaints could only take up to 180 days to be filed. The bill would also allow the staffers to transfer to a different department or otherwise work away from the presence of the alleged harasser without losing their jobs if they requested it. The bill would require Representatives and Senators to pay for their own harassment settlements. The Office of Compliance would no longer be allowed to keep settlements secret, and would be required to publicly publish the settlement amounts and the associated employing offices. For the first time, the same protections would also apply to unpaid workers, including pages, fellows and interns.[162][163][164]\n\nSilicon Valley\n\nIn the months preceding the NY Times story on Harvey Weinstein, Travis Kalanick (CEO of Uber at the time) came under fire for enabling a misogynist culture at the company, and having extensive knowledge of sexual harassment complaints at the company, while failing to do anything about them.[165] After an initial blog post by a former Uber Engineer detailed her experiences at the company, more employees came out with their own stories, as documented in a follow-up article by the NY Times in late February 2017. In it, they detail how they had notified senior management including Kalanick about incidents of sexual harassment, and that their complaints had gone ignored.[166] A few months later, in June 2017, Kalanick himself came under allegations of sexual harassment, as it was reported that he visited an escort bar in Seoul, bringing fellow female employees of the company along with him. [167] One of the female employees filed a complaint to Human Resources about how she felt forced to be there, and was very uncomfortable in that environment, where women were made to wear tags with numbers on them, as if in an auction. [168] Fresh allegations of sexual harassment at the company surfaced one year later, implicating Uber's Corporate Development Executive Cameron Poetzscher. The allegations made it clear that Uber was not taking this issue seriously enough. [169]\n\nOn October 25, 2018, the New York Times released a detailed report on the prior behavior of Andy Rubin at Google. The allegations cite that Google knew of a sexual misconduct claim against Rubin, and yet still decided to pay him a $90 million separation package at his departure from the company.[170]\n\nSports\n\nSoon after #MeToo started spreading in late 2017, several allegations from a 2016 Indianapolis Star article resurfaced in the gymnastic industry against former U.S. Gymnastics doctor Larry Nassar of Michigan State University. Nassar was called out via #MeToo for sexually assaulting gymnasts as young as 6 years old during \"treatments\".[171] Rachael Denhollander was the first to call him out.[172] Though nothing was done after the initial allegations came out in 2016, after more than 150 women came forward, Nassar was effectively sentenced to life in prison. The president of Michigan State University, Lou Anna Simon, resigned in the wake of the scandal.[171]\n\nAt around the same time, WNBA star Breanna Stewart publicly revealed that she had been a victim of child sexual abuse from age 9 to 11.[173]\n\nIn late November 2017, Lui Lai Yiu, a hurdler from Hong Kong, recounted in a Facebook post instances of having been sexually assaulted by her male coach when she was 14, sparking off mass controversy in Hong Kong.[174] Her coach was arrested in late January 2018,[175] but acquitted in mid-November 2018.[176]\n\nIn 1996, while attending the University of Tennessee, former American football player Peyton Manning was accused of sexual assault by trainer Jamie Ann Naughright after he pressed his genitals against Naughright's face during a foot examination. Manning claims that he was just pulling a prank by \"mooning\" another athlete in the room as Naughright bent over to examine him. Both Naughright and the other athlete deny Manning's story. Naughright settled with the university for $300,000 for its alleged failure in four incidents, and resigned from the school. She had initially made a list of 33 complaints about the school.[177] Naughright filed a defamation lawsuit against Peyton Manning and three other parties in 2002. Manning defamed her in a book he wrote with his father and author John Underwood. The lawsuit was settled after the court ruled there was sufficient evidence for it to be heard by a jury. Terms of the settlement were not disclosed due to confidentiality terms.[178][179]\n\nMedicine\n\nMeToo has encouraged discussion about sexual harassment in the medical field.[59][180][181] Research had indicated that among U.S. academic medical faculty members, about 30% of women and 4% of men have reported experiencing sexual harassment, and it has been noted that medical staff who complain often receive negative consequences to their careers.[69][181] Other evidence has indicated 60% of medical trainees and students experienced harassment or discrimination during training, though most do not report the incidents.[59]\n\nMusic\n\nSeveral prominent musicians have expressed support for the Me Too movement and have shared their own experiences of sexual assault and harassment.\n\nBefore the Me Too Movement, in 2017, Jessie Reyez released the song \"Gatekeeper\" about her experience of harassment by a famous producer, describing the conversations men in power have with young women working in the music industry.[182] This song inspired female artists in the music industry to speak up against sexual harassment, contributing to the start of the Me Too movement.[183]\n\nActress Alyssa Milano's activism for the Me Too movement began because she was harassed at the age of 19 during a concert.[184] On October 15, 2017, she started a viral twitter thread by tweeting \"If you’ve been sexually harassed or assaulted write ‘me too’ as a reply to this tweet.\" Musicians such as Sheryl Crow, Christina Perri and Lady Gaga responded and contributed their own personal experiences.[185]\n\nAmanda Palmer and songwriter Jasmine Power composed \"Mr. Weinstein Will See You Now\", a song that takes listeners through a story of a woman being invited to the office of a man in power.[186] A music video with an all-woman crew, cast and production team was released on the anniversary of the New York Times's reporting on sexual abuse allegations against Harvey Weinstein, with profits donated to #TimesUp, a movement against sexual harassment.[187]\n\nThe band Veruca Salt used the #MeToo hashtag to air allegations of sexual harassment against James Toback,[188] and singer-songwriter Alice Glass used the hashtag to share a history of alleged sexual assault and other abuses by former Crystal Castles bandmate Ethan Kath.[189][190]\n\nSinger Halsey wrote a poem, \"A Story Like Mine\", which she delivered at a 2018 Women's march in New York City. The poem describes incidents of sexual assault and violence throughout her life, including accompanying her best friend to Planned Parenthood after she had been raped and her personal experiences of sexual assault by neighbors and boyfriends.[191]\n\nAllegations against figures in the music industry\n\nIn January 2019, the Lifetime documentary Surviving R. Kelly aired, describing several women's accusations of sexual, emotional, mental, and physical abuse by singer R. Kelly. The documentary questioned the \"ecosystem\" that \"supports and enables\" powerful individuals in the music industry.[192] In February 2019, Kelly was arrested for 10 alleged counts of sexual abuse against four women, three of whom were minors at the time of the incidents.[193] His former wife Andrea Kelly has also accused him of domestic violence and filed a restraining order against him in 2005.[194]\n\nSinger Kesha has accused her former producer Dr. Luke of sexually, physically, and emotionally abusing her since the beginning of her music career.[195] Dr. Luke denied the allegations and a judge refused her request to be released from a contract with Sony Music due to the alleged abuse.[196] Kesha described her response to this experience in the song \"Praying\", which she performed at the 2018 Grammys. The song was seen as offering encouragement to sexual assault survivors that the world can improve.[197]\n\nA documentary was also instrumental in publicizing accusations in the case of late singer Michael Jackson. Child sexual abuse allegations against Jackson were renewed after the airing of the documentary Leaving Neverland in 2019. The documentary focuses on Wade Robson and James Safechuck and their interactions with Jackson, especially the sexual interactions they say they endured for years during their childhood.[198] Both had previously testified in Jackson's defense — Safechuck as a child during the 1993 investigation, Robson both as a child in 1993 and as a young adult in 2005.[199][200] In 2015, Robson's case against Jackson's estate was dismissed on the grounds that it was filed too late.[201][202][203] The documentary resulted in a backlash against Jackson and a reassessment of his legacy in some quarters, while other viewers dismissed it as one-sided, questioned its veracity and viewed it as unconvincing due to factual conflicts between the film and the 1993 and 2005 allegations against Jackson, and his acquittal at trial.[204]\n\nIn 2020, it was revealed that rape allegations were made against former Recording Academy President, Neil Portnow. [205]\n\nRemoval of music\n\nIn November 2018, Cleveland, Ohio radio station WDOK Star 102 announced that it had removed the song \"Baby, It's Cold Outside\" from its playlist because listeners felt that the lyrics were inappropriate. The station's host commented that \"in a world where #MeToo has finally given women the voice they deserve, the song has no place\".[206] The streaming service Spotify removed music by XXXTentacion and R. Kelly from Spotify-owned playlists after allegations of \"hateful conduct\",[183][207] but later reversed course due to the fact that the allegations against the artists were unproven.[208]\n\nSocial Justice and Journalism\n\nEventually, the Me Too Movement became analyzed under a journalistic viewpoint, as writers and editors pushed the movement into larger news networks and labor sectors.[clarification needed] Particularly, Sarah Lyons, who wrote \"Hands Off Pants On,\" illustrated the importance of allowing an open space for victims of sexual assault in the work place to heal.[209] Further, the article also revealed the creation of the campaign, \"UNITE HERE,\" which has a driving goal to protect women who felt threatened by sharing their stories and creating devices to stop assault before it happens.\n\nAnother scope that is critical to understand in order to lift up survivors of sexual violence is that of the legal system. In Sarah Jaffe's article, she analyzed victims thought the extent to which they are forced to follow through with police departments, and they (possibly) the court systems.[210] This path is currently struggling, and was constructed to fail those who need assistance the most.\n\nMilitary\n\nIn the wake of #MeToo, #MeTooMilitary came to be used by service men and women who were sexually assaulted or harassed while in the military,[211] appearing on social media in January 2018 the day after remarks by Oprah Winfrey at the Golden Globe Awards honoring female soldiers in the military \"whose names we'll never know\" who have suffered sexual assault and abuse in order to make things better for women today.[212]\n\nA report from the Pentagon indicated that 15,000 members of the military reported being sexually assaulted in the year 2016 and only 1 out of 3 people assaulted actually made a report.[213] Veteran Nichole Bowen-Crawford has said the rates have improved over the last decade, but the military still has a long way to go, and recommends that women veterans connect privately on social media to discuss sexual abuse in a safe environment.[212][214]\n\nThere was a \"#MeTooMilitary Stand Down\" protest, organized by Service Women's Action Network, which gathered at the Pentagon on January 8, 2018. The protest was endorsed by the U.S. Department of Defense, who stated that current service members were welcome to attend as long as they did not wear their uniform.[215][216][217] The protest supported the Military Justice Improvement Act, sponsored by Senator Kirsten Gillibrand, which would move \"the decision over whether to prosecute serious [sex] crimes to independent, trained, professional military prosecutors, while leaving uniquely military crimes within the chain of command\".[216]\n\nPornography\n\nThere have been discussions about how pornography is related to the emergence of the #MeToo movement, and what changes, if any, should be made to the porn industry in response.[218][219] The deaths of five female porn actresses during the first three months of 2018 inspired demands that workers in the industry be included as part of the #MeToo movement.[220] It has been pointed out that many women and men have been sexually assaulted on set.[221] Some high-profile pornographic performers have been accused of assault since the emergence of #MeToo, including James Deen and Ron Jeremy.[220][222][223] The porn industry has overall been publicly supportive of #MeToo, with the topics of harassment and bodily autonomy being addressed at the 2018 AVN Awards.[224] There have been calls for the industry to police itself better in the wake of #MeToo.[221] However, when gay actor Tegan Zayne accused fellow actor Topher DiMaggio of rape in a #MeToo post, and four other men came forward with their own allegations of sexual misconduct against DiMaggio, very little happened and there was no official investigation.[225]\n\nSeveral groups of Christians, conservative women, and radical feminists have argued that #MeToo demonstrates pornography causes women to be viewed as sexual objects and contributes to the prevalence of sexual harassment. As a result, these groups believe the production and consumption of pornography should be greatly restricted or made illegal.[218]\n\nOther social advocates and feminists have responded by pointing out that attempts to suppress pornography in the U.S. have historically never been effective at reducing consumption. They note that porn consumption in the U.S. is currently at what is likely the highest levels in history, but overall levels of sexual violence and rape are far lower today than when the anti-pornography movement in the U.S. first emerged during the 1960s. Additionally, many feminists argue that laws which make pornography illegal only further restrict women as far what they are and are not allowed to do with their bodies.[218]\n\nMany feminists have stated that pornography can be empowering or enjoyable for women and depicting female sexuality is not always objectification.[218][226] Others point out that a lot of porn is made by women and for women.[227] Award-winning porn actress and director Angela White says there is a \"large positive shift within the industry\" to more women directing and producing their own content and \"to represent women as powerful sexual beings.\"[220] Anti-porn activist Melissa Farley has said this ignores the \"choicelessness\" faced by many actresses in porn.[218] Liberal advocates argue that anti-pornography movements in the U.S. have historically never tried to increase choices for vulnerable adult performers, and taking away a person's right to act in porn may hurt them economically by reducing their choices. Many adult performers have stated that the social stigma surrounding their type of work is already a major barrier when they're seeking help, and making porn illegal would leave them few options if they are suffering from sexual abuse.[220]\n\nAs a result of #MeToo, many adult performers, sex worker advocates and feminists have called for greater protections for pornographic actresses, for example reducing social stigmas, mandating training courses that teach performers their rights, and providing access to independent hotlines where performers can report abuse. They argue that making porn illegal would only cause the production of porn to go underground where there are even fewer options for help. Some liberal activists have argued to compromise by raising the legal age of entry into adult entertainment from 18 to 21, which would prevent some of the most vulnerable women from being taken advantage of, while allowing adult women to still do what they want with their own bodies.[220]\n\nSome have pointed out that many young people who do not receive a sex education adopt ideas about sex and sexual roles from pornography, whose fantasy depictions of those behaviors are not accurate to life, as they are designed for purposes of adult entertainment, and not educating the public on the reality of sexual behavior.[228] Some areas of the United States teach birth-control methods only by abstinence from sex. In a 2015 article for the American Journal of Nursing David Carter noted that a study found that abstinence-based education was \"correlated with increases in teenage pregnancies and births\". Multiple people have voiced support for comprehensive sex education programs that encompass a wide range topics, which they state leave children more informed.[229] Several feminists have argued it is crucial to provide children with basic sex education before they are inevitably exposed to porn. Sex education can also effectively prepare children to identify and say no to unwanted sexual contact before it occurs, and gives parents an opportunity to teach children about consent.[230]\n\nAnimal Advocacy\n\nThe #MeToo movement has had an impact on the field of animal advocacy. For instance, on January 30, 2018, Politico published an article titled, \"Female Employees Allege Culture of Sexual Harassment at Humane Society: Two senior officials, including the CEO, have been investigated for incidents dating back over a decade.\"[231] The article concerned allegations against then- Humane Society of the United States CEO, Wayne Pacelle; and a well-known animal protection activist named Paul Shapiro.[231] Mr. Pacelle soon resigned.[232] Mr. Shapiro also soon left the Humane Society of the United States.[233] Both men have nonetheless continued to hold leadership positions either in, or adjacent to, the animal protection movement.[234][235]\n\nAstronomy\n\nThe #astroSH twitter tag was used to discuss sexual harassment in the field of Astronomy, and several scientists and professors resigned or were fired.[236][237][238][239]\n\nFinancial support\n\nIn May 2018, The New York Women's Foundation announced their Fund to Support the Me Too Movement and Allies, a $25M commitment over the next five years to provide funding and support survivors of sexual violence.[240]\n\nIn September 2018, CBS announced that it would be donating $20 million of former Chairman Les Moonves' severance to #MeToo. Moonves was forced to step down after numerous sexual misconduct accusations.[241][242]\n\nInternational response\n\nThe hashtag has trended in at least 85 countries,[243] including India, Pakistan, and the United Kingdom. Direct translations of #MeToo have been shared by Spanish speakers in South America and Europe and by Arabic speakers in Africa and the Middle East, while activists in France and Italy have developed hashtags to express the attitudes of the movement.[244] Communicating similar experiences and \"sharing feelings in some form of togetherness\" connects people and can lead to \"formation of a process of collective action\" (Castells).[245][246] The campaign has prompted survivors from around the world to share their stories, and name their perpetrators. The European Parliament convened a session directly in response to the Me Too campaign, after it gave rise to allegations of abuse in Parliament and in the European Union's offices in Brussels. Cecilia Malmström, the European Commissioner for Trade, specifically cited the hashtag as the reason the meeting had been convened.[247]\n\nAfghanistan\n\nThe #MeToo hashtag initially spread in Afghanistan where it is estimated about 90% of women experience sexual harassment in public, at school, or at work, but was quickly silenced when those who shared their stories started fearing for their life.[256][257] Less than 1% of police officers or military members are women, and sexual assault is often ignored by law enforcement and the military.[258] Rape threats and other types of harassment are common on Facebook and other social media in Afghanistan. Sharing stories of sexual abuse against higher-ranking men is especially dangerous for women in the country, and may result in the killing of the victim or her family members.[257] Some women are also punished or killed to by their own family for speaking out, to redeem their \"honor\" after being tarnished by rape.[257] Despite the risks, some notable people such as Sarienews journalist Maryam Mehtar, and presidential advisor Shaharzad Akbar have shared their own #MeToo stories on social media. Mehtar experienced extreme abuse and several death threats for sharing her story about being sexually harassed in public on a daily basis, and was publicly called a \"whore\" in an interview with The New York Times by Afghan writer Jalil Junbish. He also called the NYT reporter a whore in the same interview. He later denied making the comments.[258] Other women only share their first name or a fake name, and typically describe the story without naming the perpetrator for fear of reprisal.[258] Sexual harassment was first defined in Afghanistan in 2016, though there has been little effort made to enforce laws against it.[256] Rod Nordland and Fatima Faizi of The New York Times reported that a colonel in the Afghan Air Force was secretly and clearly videotaped sexually assaulting a subordinate in November 2017, and the video quickly went viral, but despite an alleged investigation, the colonel has not been formally accused of misconduct.[258] The Ministries of Interior and Communications set up a phone hotline to for women to call to report sexual misconduct from law enforcement officials, but a call to the line revealed the hotline will offer advice only about phone harassment, and stated if a person harasses you in person, to \"slap them\".[258]\n\nAustralia\n\nIn October 2017 reporter and journalist Tracey Spicer announced on Twitter that she was launching an investigation into reports of sexual harassment by powerful Australian men in the media in the wake of the Harvey Weinstein sexual abuse allegations and the rise in public awareness of the #MeToo movement. Earlier that same year, Spicer had released a memoir, The Good Girl Stripped Bare, where she wrote about her own experiences of sexual harassment in the work place.[259] Spicer later reported that she had received responses from 470 people about people in the industry, including Australian television presenter and producer Don Burke.[260] The extent of the claims against Burke were published by the Australian Broadcasting Corporation and The Sydney Morning Herald in a joint investigative piece on November 26, 2017, where it was reported that \"One name kept recurring – Don Burke.\"[261][262] Spicer, along with Kate McClymont, Lorna Knowles and Alison Branley, won the 2018 Walkley Awards in the print/text journalism and Television/Video Current Affairs Short (less than 20 minutes) categories for their investigation and on Australia Day in 2018, Spicer was appointed as a Member of the Order of Australia \"for significant service to the broadcast media as a journalist and television presenter, and as an ambassador for social welfare and charitable groups\".[263][264] Later that same year, Spicer and Melinda Schneider launched NOW Australia, a campaign aimed at helping connect people with legal support and counselling.[265]\n\nSince then the #MeToo movement has now expanded beyond Australian media and the Australian Human Rights Commission has launched an independent search into workplace sexual harassment that is the first of its kind in the world.[266]\n\nIt has been hypothesised by The Age that Australia's strict defamation laws make it difficult for more victims to come forward.[267] Yael Stone made an accusation against Geoffrey Rush[268][269] who then successfully sued her for defamation; this may have a chilling effect on the #MeToo movement due to the lack of protection for freedom of speech.[270]\n\nThe #MeToo movement was announced the winner of the 2019 Sydney Peace Prize. The award will be presented to Tarana Burke and Tracey Spicer on November 14, 2019.[271]\n\nBelgium\n\nIn May 2019, Julie Van Espen was the victim of a homicide in Antwerp. Her death has led to political protests against sexual violence. That month, over 15,000 people walked a 'silent march' in Antwerp for Van Espen. The hashtags '#enough', '#MeToo' and '#JulieVanEspen' were used by people on social media to command attention to the case, to raise awareness on sexual violence, and to address that the suspect of her murder had been convicted of rape twice before.[272]\n\nCanada\n\nÉric Salvail, accused of sexual harassment\n\nIn French-speaking parts of Canada, the campaign is done under the hashtag #MoiAussi.[273] A minister of Quebec, Hélène David, said she believed a global movement was in the works and we should salute this change.[274] It was reported that calls to rape and women's crisis centers have increased dramatically, up to 553% above normal levels,[275] since #MoiAussi started trending in October 2017, causing problems with staffing and budgeting.[276] Quebec has contributed $1 million to help support these crisis hotlines.[275] Hundreds of people marched to promote #MoiAussi at an event in Toronto in December 2017.[277] In the wake of #MoiAussi, a candidate for mayor of Plateau-Mont-Royal dropped out of the race in response to allegations of sexual misconduct from several women.[278] Montreal police set up a phone hotline for people who have been raped or harassed to call.[274] Radio and TV presenter Éric Salvail was accused by 11 people of either being sexually harassed, or witnessing harassment from Salvail.[274] He lost several endorsements and was suspended from most projects he was involved with.[279] Humorist Gilbert Rozon resigned from all his positions and tried to sell his company in the wake of several sexual misconduct allegations, including one from producer Julie Snyder, a class action lawsuit from several women, and a sexual assault report filed with the police.\n\nA newly popular hashtag, #EtMaintenant (#AndNow or Now What?) has started spreading as the \"second part\" to #MoiAussi to discuss what to do now that the magnitude of the problem with sexual misconduct in the workplace has been exposed. #EtMaintenant is represented by a yellow heart. It was unveiled on the show Tout le monde en parle in January 2018, with the stated purpose of determining which attitudes related to society, politics, institutions, and media need to be changed to ensure equity between all people.[280]\n\nCanadian Prime Minister Justin Trudeau has been a vocal advocate and supporter of the #MeToo movement. In a speech at the World Economic Forum in January 2018, Trudeau called for critical discussion on issues brought up by the #MeToo, Time's Up, and Women's March movements.[281] Trudeau has also advocated and acted upon a high standard set for himself and members of his government. Trudeau stated that he holds a \"zero tolerance for sexual assault, harassment or other forms of misconduct by his employees or caucus colleagues\".[282] As leader of the Liberal party, Trudeau initiated investigations on several members of parliament resulting in the dismissal of cabinet minister Kent Hehr, the resignation of MP Darshan Kang, and the suspension and later expulsion of MPs Scott Andrews and Massimo Pacetti.[283] In an interview, Trudeau explained that the zero tolerance standard applied to himself as well and stated, \"I've been very, very careful all my life to be thoughtful, to be respectful of people's space and people's headspace as well.\"[284]\n\nHowever, an editorial written in August 2000 resurfaced during his premiership regarding an alleged incident where an author accused Trudeau of groping a reporter and in July 2018 Trudeau publicly rejected the accusations.[285][286] The piece stated Trudeau provided a \"day-late\" apology to the reporter, saying, \"If I had known you were reporting for a national paper, I never would have been so forward.\"[287] On July 6 Trudeau stated there was no need to conduct an investigation into the allegations against him.[288]\n\nChile\n\nIn April–June 2018, female students marched around Chile and occupied universities in protest against sexual harassment.[289] Multiple actresses levelled accusations of Weinstein-like behaviour at telenovela director Herval Abreu in April and film director Nicolás López in June; both men have denied any wrongdoing.[290]\n\nChina\n\nOn Chinese social networks, hashtags #WoYeShi or #metoo are sometimes used to denote the #Metoo hashtag. Mi tu pronounced in Mandarin, meaning \"rice bunny\", is also used with a hashtag of #RiceBunny.[291]\n\nIn mainland China, the Chinese internet censorship service has slowed down the Chinese MeToo posts via censorship.[292] So far, the #MeToo debate appears to be limited to universities.[293]\n\nAn article appearing on the state-run China Daily newspaper states that sexual misconduct is rare in China due to superior education and culture has caused considerable Internet outrages.[294]\n\nA recent study from a pair of professors from City University of Hong Kong indicated that about 80% of working women in China have experienced sexual harassment at some point in their career,[250] and there were strong reactions of anger online following the report. The article has since been taken down.[295] Activist Feng Yuan points out that China does not have national laws prohibiting sexual harassment, and uses state media to encourage women to focus on family and stay home. New laws recently made it illegal for television programming to contain images of a women's cleavage, sexual acts outside of marriage, or any topics that present \"Western lifestyles\" in a positive light. #MeToo has received extreme governmental censorship online.[57][295]\n\nSophie Richardson, the Human Rights Watch director for China, stated the Chinese government regularly suppresses discussion of women's rights, for example an incident in 2015 where Li Tingting and four other activists were arrested when the government learned they planned to hand out stickers about preventing sexual harassment on public transportation.[295]\n\nIn Hong Kong, track and field athlete Vera Lui Lai-Yiu posted her case of sex abuse alongside #metoo on her Facebook fanpage on her 23rd birthday. She posted in response to a similar action by gymnast McKayla Maroney. Lui posted a picture of herself holding a piece of paper with the handwritten words \"#metoo lly\" (her initials).[296][297][298][299][300] In January 2018, student Zheng Xi publicly started a campaign against sexual harassment in response to #MeToo.[250]\n\nDr. Luo Xixi, an academic, revealed being sexually assaulted by a professor at Beihang University when she was in her 20s. Luo gathered extensive evidence from many women, including recordings, and presented it to the institution. She waited until the professor was already suspended before going public with the story. Her post was viewed over 3 million times within 24 hours. She said that #metoo gave her the courage to speak up. She is currently living in the US.[57]\n\nZhou Xiaoxuan, a 25-year-old screenwriter in Beijing, stated that the China Central Television host and anchor Zhu Jun assaulted her in his dressing room while she was an intern of his in 2014. When she went to the police, she was urged her to drop her report, telling her that her parents, who both work for government institutions, could lose their jobs. So for years, Ms. Zhou kept what had happened a secret, only known by herself, her parents, and some close friends. That was until one day, where she saw a \"#MeToo\" post, and decided to share her own story. Her intentions were to share with her friends that this happens to people close to themselves, but instead her post was shared rapidly over the Chinese internet, until the Chinese government intervened and banned state-run media from covering the story.[301]\n\nYue Xin, an undergraduate of Peking University in Beijing, led a campaign to uncover information regarding the alleged assault and subsequent suicide of Gao Yan, a student who was allegedly assaulted by former professor Shang Yang.[302] Peking University took measures to attempt to dissuade Yue from pursuing her investigation.[303][304] Yue Xin would eventually participate in the Jasic Incident.\n\nEthiopia\n\nAlyssa Milano specifically called for supporting the victims in Ethiopia in an interview with Rolling Stone.[31] In Ethiopia, up to 40% of students may have experienced sexual violence.[305] In November 2017, nine middle-school aged girls organized together and spoke out about an abusive teacher in their school, saying they got the idea from the \"Me Too\" movement. The teacher was dismissed and referred to law enforcement. UNICEF's Amanda Westfall said the teacher likely would have gotten away with it just a few years ago.[305]\n\nFrance\n\nVariants of the phrase trended in France,[104] especially #BalanceTonPorc (#DenounceYourPig),[273] which encouraged users to share the names of their alleged abusers.[306][307] #BalanceTonPorc was first used by Sandra Muller. She was requested to take down her tweet by two lawyers.[308] In France, 93% of complaints against criminal sexual harassment are dropped or never followed up on by law enforcement.[309] Prosecutions are extremely rare, and only 65 of 1,048 sexual harassment lawsuits from 2014 actually led to a conviction.[308] In 40% of workplace sexual violence cases, the person who makes the complaint is reprimanded or fired, while the accused person is typically not investigated or punished.[309] There is no French equivalent to the U.S. Equal Employment Opportunity Commission, which gives victims a place to report workplace sexual violence if the employer and/or law enforcement refuses to address the complaint.[309] Brigitte Macron, wife of French President Emmanuel Macron, expressed support for the #MeToo movement.[308][310]\n\nInitially the hashtag went viral, but there was an almost immediate media backlash.[311] Soon after, 100 high-profile French women, including actress Catherine Deneuve, former pornographic actress and radio host Brigitte Lahaie, art critic and author Catherine Millet, signed an open letter by Abnousse Shalmani which criticized the #MeToo / #BalanceTonPorc campaign. It was noted the letter is poorly edited with several typos and unclear or clumsy passages.[56][312]\n\nThe people who signed the letter, especially Deneuve and Millet, were criticized for saying men should have the \"right to pester\" women.[313] The letter also told people not to be bothered by small amounts of sexual harassment, for example men who rub against women on public transportation. The letter states women should \"consider it as the expression of a great sexual misery, or even as a nonevent\".[312] French politician Marlène Schiappa said some aspects of the letter were \"profoundly shocking\" and \"we have immense difficulty convincing young women that when a man rubs his genitals against a woman in the Métro without her consent, it is an act of sexual assault that can lead to three years in prison and a 75,000 euro fine.\"[308][312]\n\nA week after its publication, Deneuve issued a letter of clarification, and said although she still agrees with the spirit of the original letter, she wants to clarify that she does believe sexual harassment and assault are real problems, and apologized to all victims of unpleasant sexual acts who read the letter and felt hurt by it.[314][315]\n\nPolitical commentator Anastasia Colosimo said the movement to prevent sexual misconduct at work is more accepted by younger women in France because they take sexual freedom as a given, while older feminists are afraid #MeToo may hurt the sexual revolution.[56] Legal professional Marilyn Baldeck noted that when people are given \"concrete examples\" of sexual misconduct, they often \"change their minds and acknowledge how harmful some situations can be\".[312] French politician Sandrine Rousseau said that the #MeToo movement will continue because French women have been silenced for too long.[308] A petition aimed at President Emmanuel Macron demanded sexual harassment to be taken more seriously in France, and received more than 100,000 signatures in three days.[309]\n\nSinger Tom Connan said in an interview published by L'Obs that he had been the victim of sexual harassment and claimed that men (not only women) were also affected by the problem.[316]\n\nNousToutes\n\nIn 2018, 30,000 women marched in Paris with the #NousToutes, dressing in purple.[317][318]\n\nTens of thousand of men and women demonstrated on November 23, 2019 in more than 30 cities.[319]\n\nLigue du LOL\n\nIn February 2019 prominent male Parisian journalists were accused of forming a group, called the \"Ligue du LOL\", which – over a 10-year period – ran online harassment campaigns against feminists, female journalists, writers of colour and gay people. The group's founder, Vincent Glad [fr], was suspended by the daily newspaper Libération, whose own fact-checking unit broke the story.\n\nThe NGO SOS Racisme called for a judicial investigation.[320][321]\n\nGermany\n\nMeToo was not particularly popular in Germany until January 11, 2018, when it started trending after the Die Zeit weekly newspaper published reports about three German former actresses who alleged that award-winning TV director Dieter Wedel had committed sexual assault.[322][323] There have been official concerns about the alleged long-time coverup of Wedel's actions because most of his work was done through public broadcasting and received government money.[323] The report detailed a months-long investigation into the three allegations, and included 50 interviews.[322] Wedel has not responded to the allegations in Die Zeit, stating through a spokesperson he is in the hospital and having heart trouble.[323] Another high-profile German case concerned the former president of the Munich Academy of Music, Siegfried Mauser.[324] In a study of 2000 Germans conducted after the initial spread of #MeToo, it was found that 43% of women and 12% of men have experienced sexual harassment or abuse, most commonly inappropriate touching.[325]\n\nIran\n\nIn the Islamic Republic of Iran, Grand Ayatollah Ali Khamenei issued a message stating the \"disaster of countless sexual assaults on Western women – including incidents leading to #Metoo campaign\" can be solved with the Islamic solution of hijab.[326][327]\n\nIndia\n\nThe use of the #MeToo hashtag on social media spread quickly in India,[328][329] where sexual harassment is commonly referred to by the word 'eve-teasing', a term described as misleading, tame, and diluting the seriousness of the crime.[330] In response to #MeToo, there have been attempts to teach Indian women about workplace rights and safe reporting, as well as educate men about the scope of the problem.[328][331] Some have likened #MeToo to a 2012 social movement which followed a violent gang rape in New Delhi that later resulted in a woman's death, which caused the Indian government to institute harsher punishments for rape.[329][332][333] Others have suggested there was underlying public anger over a Delhi rape conviction that was overturned by Judge Ashutosh Kumar a month before against filmmaker and writer Mahmood Farooqui, ruling that a \"feeble\" no was not enough to revoke consent because it was typical for one partner to be less willing. The case is being appealed to the Supreme Court.[332][334] Activist Jasmeen Patheja, head of Blank Noise, stated #MeToo's power is in demonstrating India can no longer ignore the scope of the problem.[329] Kaimini Jaiswal, a lawyer at the Supreme Court of India, stressed the importance of teaching women how to read, especially in rural villages, because most women in these areas are illiterate and completely financially and emotionally dependent on a male relative.[333]\n\nBlogger Sheena Dabholkar's viral #MeToo tweet resulted in the boycott of Khodu Irani's popular Pune pub, High Spirits, by several well-known performers.[328][335][336] Several women mentioned Mahesh Murthy, which initiated a police case in January 2018.[248][337] The Trends Desk of The Indian Express wrote many Indian men are speaking up as a part of #MeToo, including discussions about consent and how some men are also abused.[338][339] Rina Chandran of Reuters said that #MeToo is ignoring the 600,000 women in India who are currently involuntary sex workers, and are typically poor, uneducated or lack a family.[340]\n\nThere were reports of mass sexual assaults during the 2018 new year's celebrations in Bangalore, which have been associated with #MeToo. The incidents were initially dismissed by the police until someone uploaded CCTV footage of the assaults to social media.[333] Home Minister G. Parameshwara, Abu Azmi, and other officials came under fire for stating \"western\" women's clothing and values were the cause of the rapes and that women's families should not allow them to go to parties or major celebrations.[333]\n\nSeveral lists of alleged rapists and harassers started spreading on social media in India, including \"The List\" which initially included the names of about sixty highly respected academic men. The List of Sexual Harassers in Academia (\"LoSHA\") was posted on October 24, 2017, by activist Inji Pennu and an Indian student in California named Raya Sarkar, who alleged they personally confirmed every incident.[341][342] This list has resulted in criticism against #MeToo because the allegations were unverified before they started spreading on social media. Some of the victims from the list have come forward to explain they were ignored, mistreated or retaliated against when they tried to pursue action.[343] Sarkar has defended The List, saying that she posted it only to warn her friends about professors and academics to avoid (mostly upper caste men), and had no idea it could become so popular.[342] A second list came out a week later that was made by women from a lower caste background and included more names, raising the total to around 70.[341]\n\nTwelve prominent Indian feminists dismissed The List in a formal letter, saying they understand that the justice system is typically tilted against victims, but unverified claims make things harder for the feminist movement.[341][344] Writers Rhea Dangwal and Namrata Gupta responded that most victims from the list were poor students who tried to go through official channels without success or recourse, while every single man on the list has the ability to defend himself socially and legally.[341]\n\nOn September 27, 2018, former actress Tanushree Dutta accused Nana Patekar of sexual harassment,[345] which was the catalyst of the \"Me Too\" movement in India. The accusation by Dutta stirred a row of accusations from many women in industries including media and politics.[346][347][348] In October 2018, the Minister of state for External Affairs, MJ Akbar was accused of sexual harassment by several female colleagues through the 'Me Too' Movement in India.[349]\n\nOn October 21, 2018, former music director Anu Malik was suspended from the jury panel of Indian Idol 2018, after facing multiple allegations of sexual harassment made through the movement.[350]\n\nIsrael\n\nIn Israel, the Hebrew hashtag גםאנחנו# (#UsToo) began trending on October 18, 2017, with a front page spread in the newspaper Yedioth Ahronoth.[273] Asi Levi said at the Ophir Award ceremony that unlike America, in Israel the status of those accused do not change.[351] A hashtag for men, #HowIWillChange, has also become popular.[352]\n\nPalestine\n\n#AnaKaman or وأنا كمان# (#MeToo) has also been used by Palestinian women from refugee camps.[353]\n\nItaly\n\nIn Italy, women posted stories of assault and harassment under the hashtag #QuellaVoltaChe, which translates literally as \"TheTimeThat\".[354][355] The phrase was launched by the journalist Giulia Blasi.[356] Italian journalist Simona Siri wrote in The Washington Post that the initially popular movement quickly died out in Italy. She stated that Italian politician and former Prime Minister Silvio Berlusconi, who is known for his role in wild parties (Bunga Bunga bacchanals) with underage women and prostitutes,[357][358] has contributed to a strong sexist culture with few female politicians in positions of power.[58] Movie directors Fausto Brizzi and Giuseppe Tornatore were accused of harassment by more than a dozen women but did not face any significant consequences or media scrutiny.[359][58]\n\nThe New York Times described the movement in Italy as \"Meh\" due to the lack of discussion. Laura Boldrini, the president of the lower house of Parliament, has declared that the movement cannot touch Italy because although there is much harassment, victims are often silenced and there's also a belief that \"in our country, there are no harassers\".[357] It has been reported that nearly 70% of female university students have been sexually harassed, and it is widely accepted that Italy is behind other countries when it comes to gender rights.[358] In response to #QuellaVoltaChe, one article from Libero was titled, \"First they put out, then they whine and pretend to regret it.\"[358]\n\nItalian Fabrizio Lombardo, an employee and friend of Harvey Weinstein, was widely covered by the media after he was accused of allegations that he aided Weinstein in sexually harassing Italian actress and former model Asia Argento, though he denies all wrongdoing.[360] Argento said of Italy, \"Nothing has changed\", and described her life after going public with the allegations as living a nightmare. She has made plans to leave Italy. Conservative TV news editor Alessandro Sallusti [it] criticized Argento for being an accomplice to Weinstein for not reporting him immediately, and several other public figures and politicians questioned her innocence.[357]\n\nThe Non Una di Meno group (Not One Woman Less), which is dedicated to stopping violence against women, wrote a letter in support of Argento and organised a protest in November 2017 where tens of thousands of people gathered in Rome.[358] Blogger Abbatto i muri (I Break Down Walls), journalist Ida Dominijanni, Cagne sciolte (literally, Loose Bitches), and author Michela Marzano also strongly supported Argento publicly.[358] Italian women's rights activist Lorella Zanardo has stated that it is taken for granted that women must give or sell their body in order to get high-profile positions in politics, film, and media.[357]\n\nMaria Elena Boschi, a politician who has created governmental initiatives aimed at teaching women it's okay to say no to sexual advances, has been targeted in the news and on social media for her support of the #QuellaVoltaChe movement.[356] She has been impersonated in several fake interviews where the actresses portray Boschi in unflattering ways.[357] There are also photoshopped images of Boschi that have been shared widely on social media, including a doctored image with her underwear showing during her swearing-in ceremony, which never occurred.[357][361] Francesca Puglisi, the chair of the Commission of Inquiry into Femicide in Italy, said that one woman is killed every two days on average by male violence, and the problem is severely under-reported, though she credited the #QuellaVoltaChe hashtag and the work by Boschi with making a positive difference.[362]\n\nArgento, herself, was accused of sexual misconduct in 2018 by actor Jimmy Bennett. Following this allegation, Argento was fired from her work on The X Factor Italy.[363]\n\nJapan\n\nIn Japan approximately 4% of rapes are reported in Japan due to social stigmas against sexual assault survivors, of which half of the criminal charges are dropped by prosecutors.[41] Many rape myths in Japanese culture typically hold women accountable for sexual assaults instead of the assaulter, creating an environment where even if victims come forward \"Japanese society wants them to stay silent.\"[41] Political Scientist Mari Miura argues that a lack of solidarity among women and the complicated, stigmatized and lengthy process of prosecuting rapists deters sexual assault survivors from speaking out.[364] In fact, the word \"rape\" is taboo in Japan, instead described with less threatening words like saying an underage victim was \"tricked,\" or a woman was \"violated\" thus contributing to a public lacking comprehensive understanding of the pervasiveness of the problem.[41] The legal age of consent in Japan is 13.[365] Women in Japan are regularly exposed to harassment from a young age,[366] for example, on public transportation[41] it is called chikan.[367] Prior to 2017, laws regarding the treatment of sexual assault had remained unchanged since 1907. It previously failed to consider oral and anal rape as assault. Despite the definition of assault being expanded in 2017, rape is criminalized and prosecutable under law only if there is clear evidence of physical force and resistance being involved in the act.[368]\n\nMultiple other authors and public figures have criticized what they saw as Japan's silence on the topic of sexual assault, such as Kyoko Nakajima, Mayumi Mori,[41] Kirsten King,Akiko Kobayashi,[369][370] Hakuo Au (née Haruka Ito).[371] BuzzFeed Japan writer Takumi Harimaya has stated that by sharing these stories, other victims of sexual assault and harassment can know they are not alone.[371] Another journalist, Keiko Kojima stated that the movement is necessary to let people know that it is okay to say no to sexual violence, including male victims. She further remarked that despite how it is attacked in Japanese media, that #MeToo is not an \"anti-man\" campaign and that it is simply about anti-violence and anti-harassment. Kojima also believes it is extremely important for men to call out behaviors in others such as sexual harassment or having sex with someone who is unconscious and that every person who is not committing sexual violence is part of the #MeToo movement, whether they are male or female.[367]\n\nAs part of the #MeToo movement, Shiori Itō went public alleging that she was raped by Noriyuki Yamaguchi, a prominent TV journalist and acquaintance of Japanese Prime Minister Shinzo Abe,[372] an admission she says was unthinkable for a woman to do in Japan. Yamaguchi rejects her accusations, and says that sex was consensual.[372] She said her experience with Japan's legal system showed her that victims of sex crimes were undermined and ignored. She called for the Japanese parliament to update Japan's laws regarding rape, which were over a century old. She explains how she could not get information on which hospital provides rape kits without going through a preliminary interview in person. When she went to the police, she was discouraged from filing a report, and informed her career would be ruined for no reason if she did this. She was told she did not act like a victim, and had to be interviewed by several officers, including one who made her reenact the rape with a dummy while he took pictures. Although they initially said they would arrest Yamaguchi, the case and charges were unexpectedly dropped. Itō then went to the media, but no one would take her story. When she spoke about the experience at a press conference, she made national news and immediately started receiving a negative backlash, hate mail, and threats.[41][373] She has been unsuccessful in her attempts to have criminal charges brought against Yamaguchi, but as of 2018 she was still pursuing a civil case against him, which he was defending.[372] After reflecting on her experience with reporting sexual assault, Itō notes that there \"is little concept of sexual consent in the law or in society\" which indicates a need for more education in schools especially given the prevalence of rape culture and power imbalances in Japanese society.[41] Itō further stated that the #MeToo Movement was small in Japan but that \"what’s happened in the United States and elsewhere has provided an opening in our media to discuss sexual harassment and assault here, and to raise awareness\".[41][374]\n\nIn 2018, Junichi Fukuda, a deputy finance minister in the Abe Administration, resigned after being accused of sexual harassment by his former subordinates and an anonymous TV Asahi reporter.[375][376] TV Asahi warned against their employee making this allegation and going public with the allegedly incriminating conversation between her and Fukuda. Fukuda was publicly defended by his boss, Finance Minister Aso Taro, who stated that Fukuda was unjustly reprimanded since sexual assault is not a punishable crime in Japan.[368] Aso Taro retained his job despite commenting that replacing female reporters with men should stop sexual harassment.[376]\n\nA former member of the Japanese idol group Niji no Conquistador pressed charges against Pixiv representative director, Hiroaki Nagata, for sexual harassment during her time with the group, motivated by the #MeToo movement.[377] Nagata resigned following the lawsuit.[378]\n\nAs a result of the severe culture of victim blaming, the slogan #WeToo was developed in conjunction with #MeToo. The slogan was launched in order to spur more women to openly support the feminist agenda of revealing the prevalence of sexual harassment and showing solidarity with victims. By replacing \"Me\" with \"We\", the slogan allowed women to contribute to the movement without having to speak of their own experience with sexual harassment, which is associated with the risk of receiving stigma, shame, and ostracization. The slogan was developed by Monica Fukuhara, who had first hand experience in the difficulty women in Japan face in regards to the fear of speaking of their experience with sexual assault.[379]\n\nAnother manifestation of the MeToo movement in Japan was the following development of the KuToo campaign. Based on the Japanese word \"kutsu\" for shoes and the word for pain \"kutsuu\", the campaign was launched in response to the corporate norm that expects women at the workplace to always wear high heels. Similarly, women are pressured to wear high heels when job hunting, so as to raise the prospects of finding a competitive position in a corporation. Founded and supported by writer Yumi Ishikawa, the campaign gained enough support to result in a petition being sent to labour ministry officials. Specifically, KuToo aims to prompt officials to create anti-sexual harassment and discrimination laws that will prohibit companies from restricting women from wearing anything other than high heels at the workplace.[380]\n\nKenya\n\nWhen #MeToo first went viral in October 2017, coverage was overshadowed in Kenya by a presidential election that was occurring the next week.[381] However, the #MeToo movement started slowly spreading in Kenya after the election was over.[381] In January 2018, it became especially popular after several new mothers alleged sexual misconduct at Kenyatta National Hospital, claiming that after giving birth they have been sexually assaulted when they went alone to breastfeed.[382] There were also allegations that children in the hospital have been sexually assaulted.[382] The hospital announced that the women were all lying, but in the future, women should stay together in groups in the hospital to prevent sexual assault. In response, hundreds of people protested in the streets of in Nairobi, Kenya, and an investigation was initiated by the health minister.[383]\n\nNepal\n\nFormer Mayor of Kathmandu, Keshav Sthapit has been accused of sexual harassment by two female office clerks of the Kathmandu Metropolitan Office, Rashmila Prajapati and Ujjwala Maharjan, as a part of the Me Too movement in Nepal.[384][385][386]\n\nNigeria\n\nCulture\n\nNigerian women and children get sexually assaulted every day and do not speak up about it due to fear of stigmatisation and prejudice.[387] Official silence seems to surround sexual abuse of women in Nigeria, with the police frequently not taking sexual abuse reports seriously.[388] As a result, men, who are often the perpetrators of sexual abuse go unchallenged, and unpunished owing to factors such as culture and popular beliefs.[388] The custom of victim blaming is evident in testimonies rape and sexual abuse survivors.[387] Nigerian cultures look down on the open discussions of sexual matters and desires.[388] A great deal of the pressure to remain silent stems from socio-cultural values, customs and expectations about what constitutes socially accepted behaviours.[389] Cultural socialisation recognises men as having a naturally stronger sexual drive, and speaks of women in terms of shame, lack of interest in sexual matters and as one to be conquered by a domineering man.[388] Nigerians are socially nurtured and fed by oppressive patriarchal subjectivities that try to instil a sense of what is normal: sexually-speaking.[389]\n\nRole of power and privilege\n\nThere is a factor of power influencing the slow growth of the movement in Nigeria. The country is a highly patriarchal society.[390] Women have complained of how unimaginable it is in the country to report cases of harassment.[391] Yet, sexual harassment is so prominent within the country that it is perceived as almost a right to men.[391]\n\nBrenda Uphopho case\n\nShe had been assaulted three times by three different men. The first incident took place at age five. At that time, she was too young to understand what happened until a similar incident occurred at age 18. She was at a party when a stranger forced her to have sex with him. Upon her refusal, he beat her up and raped her. Due to the stigma attached to being raped, she resorted to silence. The final experience took place at her workplace when her boss forcibly put his hand under her skirt. She still remained silent with the notion of not being believed and being judged by others. Realizing she could not remain silent and needing to make an impact, Uphopho currently works with her husband to break the \"culture of silence\" around abuse in Nigeria. They produced a play called Shattered which seeks to encourage victims of sexual abuse to speak up.[392]\n\nNorway\n\nIn Norway, under the hashtag #stilleforopptak (en. SilentforRecording), almost 600 actresses signed a petition and shared their stories through Aftenposten on November 16, 2017.[393] This also inspired dancers and musicians to create their own petitions, #nårdansenstopper (en. WhentheDanceStops) signed by 792 dancers,[394] and #nårmusikkenstilner (en. WhentheMusicQuiets) signed by over 1110 musicians.[395]\n\nTrond Giske, the deputy leader of the Norwegian Labour Party and a former cabinet minister in Norway, resigned from his political positions on January 7, 2018, after being accused of an extensive pattern of sexual assault and sexual harassment of young women, and of taking advantage of his political positions to make unwanted sexual advances.[396] The accusations came in the context of the Me Too debate and dominated Norwegian media for several weeks from December 2017.[397] Accusations towards the now former leader of the Norwegian Young Conservatives, Kristian Tonning Riise, also saw the light of day. In a Facebook post, Tonning Riise wrote: \"I have been confronted with the fact that members of the Norwegian Young Conservatives on several occasions have reacted to my behaviour.\"[398] It would later be revealed that the Conservative Party had received 15 alerts, whereas 10 of them regarded Tonning Riise.[399] Ulf Leirstein, Norwegian politician for the Progress Party and member of the Storting, had to take a break from office after it was discovered that he had shared pornographic images with a 14-year-old member of the Progress Party's Youth in addition to suggesting a threesome between him, a 30-year-old woman and a 15-year-old member of the Progress Party's Youth.[400]\n\nPakistan\n\nZainab rape-murder case\n\nAfter the death of 7-year-old Zainab Ansari in January 2018, who was raped and killed, there began a wave of declarations on Pakistan social media in #MeToo style.[383] Sexual assault against a minor in Pakistan will result in 14 to 20 years in prison and a fine of 1 millions rupees.[401][402][403][404] Sheema Kermani, a classical dancer, has been called the leader of the Pakistan #MeToo movement.[405] Former model Frieha Altaf and designer Maheem Khan shared stories of sexual abuse, and challenged Pakistan to be more proactive at stopping children from getting raped.[383]\n\nFilm industry\n\nProtests[406] marked the premieres of Teefa in Trouble in Karachi and Lahore by activists who boycotted the film over the sexual harassment allegations leveled against Ali Zafar by Meesha Shafi, as well as at least half a dozen other women, earlier in the year.[407] Zafar categorically denied the allegations and sued Shafi for defamation in the court where the case is ongoing.[408][409] On the other hand, Shafi had also filed a harassment case against Zafar, which, itself, is an ongoing investigation.[410]\n\nWith hashtags such as #BoycottAliZafar, #BoycottTeefainTrouble, and #TeefaisTrouble, a huge wave of activists built a momentum on social media ahead of the movie's premiere and subsequent screenings. A few major Pakistani media outlets outright ignored the demonstrations but other had to give in when protestors turned up at cinemas and police and other law enforcement agencies got involved.[411]\n\nZafar reportedly also had to avoid his grand arrival at the film's Karachi premiere and take a detour through the basement at Nueplex Cinemas in DHA, Karachi, in order to avoid the hoard of demonstrators who had gathered at the venue's main entrance.[412][413] During the protest, Feroze Khan, an actor and Zafar's friend, returned from inside the cinema in an attempt to sway the protestors by telling them to support \"Pakistani cinema\"; however, he was turned away owing to his stance, to which he responded by making obscene gestures.[414][415]\n\nReports had also emerged that the Nueplex Cinemas’ security manhandled some of the demonstrators and verbally abused multiple people at the protest.[416]\n\nProtestors again showed up at Lahore's CineStar for voice their anger and disappointment at both the promotion of the film of an alleged harasser and the celebrities pouring in to support him. The controversy deepened when, in one instance, the demonstrators asked Waleed Zaman, the creative director of women's clothing brand Kayseria, the reason why he was backing the film, to which Zaman responded by saying: \"We support sexual harassment of women.\"[417][418]\n\nZaman later posted and deleted multiple apologies on his social media accounts.\n\nAt yet another screening of the film at Nueplex Cinemas at Rashid Minhas Road, Karachi, protestors were allegedly held in the basement and beaten by the cinema's private security, with various media reports confirming the incident.[419][420] The demonstrators’ phones were also confiscated and the cinema's security allegedly tried to plant incriminating evidence in one of the protestors' bags in order to make their case appear stronger to police.[409] However, they were let go later after the arrival of Rangers personnel.\n\nStand-up comedy\n\nAt least four women leveled allegations of sexual misconduct against Junaid Akram, a prominent stand-up comedian and vlogger.[421] Most of the accusers were girls in their teens and early twenties. Akram, too, denied \"all allegations of sexual harassment and sexual misconduct\", labeled them \"false\", and announced that he intended to pursue legal actions as he had \"already met my legal team\".[422]\n\nAkram also clarified that his \"marital status is public information\".[423]\n\nCharity sector\n\nThe son of world-renowned late philanthropist Abdul Sattar Edhi, Faisal Edhi, who now heads the Edhi Foundation, was also accused of sexual misconduct by a former journalist,[422][424] who said the man \"grabbed my hand tightly and tried to kind of pull me back into the van\". Faisal Edhi has denied the claims.[425]\n\nPhilippines\n\nThe Me Too movement has slowly picked up in the Philippines. In the culture of the Philippines, shaming and victim blaming are still present and is often encouraged.[426] They are afraid to say #MeToo because people do not believe them. Stories finally were heard from after actress Saab Magalona retweeted Alyssa Milano's infamous quote.[427] The accusations revolved around the entertainment industry as one of the bands, Jensen and The Flips was being brought up and they acknowledged their mistakes and apologized for their misconduct.[427] Statistics from the Philippine Commission on Women from 2004 to 2013 revealed that only 629 cases had been recorded with the Philippine national police's Women and Children Protection Center.[427] This figure is believed to only be a fraction of the actual number of harassment offenses committed against women. While the movement has not been as big as in the U.S., other movements such as #BabaeAko have started as a result of #MeToo. #BabaeAko translates to \"I am a Woman\" and began in May after President Rodrigo Duterte declared that the next Chief Justice of Philippines could not be a woman.[428]\n\nSouth Korea\n\nIn South Korea, the Me Too movement started to", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Flag_of_the_Basque_Country.svg/23px-Flag_of_the_Basque_Country.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Flag_of_North_Macedonia.svg/23px-Flag_of_North_Macedonia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Sexual_orientation_-_4_symbols.svg/24px-Sexual_orientation_-_4_symbols.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Alyssa_Milano_2%2C_2011.jpg/170px-Alyssa_Milano_2%2C_2011.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Crystal_Clear_app_linneighborhood.svg/21px-Crystal_Clear_app_linneighborhood.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Jo_Min-gi_from_acrofan_cropped.jpg/170px-Jo_Min-gi_from_acrofan_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Flag_of_Pakistan.svg/23px-Flag_of_Pakistan.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Ambox_contradict.svg/40px-Ambox_contradict.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/21px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Flag_of_Kazakhstan.svg/23px-Flag_of_Kazakhstan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Flag_of_Catalonia.svg/23px-Flag_of_Catalonia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/17px-Woman-power_emblem.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/23px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/23px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/23px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Flag_of_Tunisia.svg/23px-Flag_of_Tunisia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/13px-Woman-power_emblem.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/US_Army_SHARP_Sexual_Harassment_and_Sexual_Assault_Prevention_Poster.jpg/170px-US_Army_SHARP_Sexual_Harassment_and_Sexual_Assault_Prevention_Poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Flag_of_the_Arab_League.svg/23px-Flag_of_the_Arab_League.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Flag_of_Iran.svg/23px-Flag_of_Iran.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/23px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Symbol_venus.svg/100px-Symbol_venus.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Social_sciences.svg/24px-Social_sciences.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/23px-Flag_of_South_Korea.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Flag_of_Galicia.svg/23px-Flag_of_Galicia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/%C3%89ric_Salvail.png/170px-%C3%89ric_Salvail.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Flag_of_the_Republic_of_China.svg/23px-Flag_of_the_Republic_of_China.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Me_Too_movement", "title": "Me Too movement", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}