{"url": "https://variety.com/2018/tv/features/queer-eye-emmys-reality-conversation-contenders-1202843269/", "text": "Among all of this season’s reboots, perhaps none engendered as much goodwill as the return of “Queer Eye.” The new Fab Five — Bobby Berk (interior design), Karamo Brown (culture), Tan France (style), Antoni Porowski (food), Jonathan Van Ness (grooming) — teamed up for a run of episodes that not only reflected their genuine camaraderie, but also brought a hefty dose of warmth, charm and authenticity to their makeovers.\n\nHow did you approach the update of “Queer Eye”?\n\nBobby Berk: One of the things we wanted to bring that the original show wasn’t able to was a look into our lives. Back in 2003, it was groundbreaking and controversial at the same time for gays to be on TV, but it was accepted because they kind of stayed in their lane. They were designers and hairdressers and cooks and it was kind of like “Oh that’s fine” but to be husbands and fathers — that wasn’t. One of the things we wanted people to know is that we’re just like other people. Karamo is a dad who gets texts from his kids saying, “Where’s dinner?” Just the fact that we’re just like everybody else is something we wanted people to see.\n\nKaramo Brown: We wanted to have fun and show the brotherhood and love we have for each other. There’s one [episode] where we get playful and are throwing glitter on each other. The original show made you feel good and allowed you to have fun — that was very important for us to keep. At the end of the day with everything that’s going on in our world why not just take a moment to have fun with five people who are your friends.\n\nBerk: In these days where every time you turn on your TV and you just get massively depressed or angry, we wanted to do TV that shows, “OK there’s going to be some hope for the world.” That is our biggest goal.\n\nWhat was the most challenging aspect of taking on the makeovers of straight guys in Georgia?\n\nJonathan Van Ness: One thing for me that was challenging was just breaking through the idea of what a metrosexual was. I liked talking through that with men and making ideas of gender and grooming feel more approachable. It’s not a scary and taboo subject. We wanted to do transformations and makeovers for them that really make sense in the long-term. Not just for transformation’s sake, but something they’re going to be able to re-create. I grew up watching so many makeover shows and makeover [segments] on morning TV. I always thought, “Why would we put that haircut on that woman who says she has no time? So we give her a shag that requires all this styling?” So just things like that were fun to go do in a better way.\n\nTan France: The thing I found that was difficult was that it wasn’t a new show where I could immediately find my own voice. I felt pressure because this is a legacy show. It was a massive show. I am stepping into the shoes of someone who is iconic [Carson Kressley]. That was difficult for the first few days; I was trying to find my own way. I’m so not Carson, I’m very different. That was difficult to me. And all these cameras pointing at you — those first few weeks I really struggled.\n\nIn episode “Below Average Joe,” top left, Jonathan Van Ness, Karamo Brown and Tan France update the look and attitude of stand-up Joe Gallois, second from left; “To Gay or Not Too Gay” featured AJ Brown, who came out on the show in an very emotional episode.\n\nCourtesy of Netflix\n\nAntoni Porowski: I came from the background of scripted [acting] where I had those confines and found safety in it. What I found daunting was the length of our scenes. There’s no action, there’s no cut. But what I actually learned was the comfort in that you get to have real conversations with these people. You know there’s a camera there. But some of these scenes would last two hours and be cut down to something really small. I think it’s a reminder to continue doing that going forward. There’s comfort in the freedom of just going with it, enjoying those pauses and not feeling like you have to push it all the time.\n\nFrance: The nice thing about our show, what gave me comfort, is that we are the people you see on the show and we’re the same with our family and friends. It makes it a lot easier to shoot it because we’re not playing caricatures of gay men.\n\nWas it ever hard for you to connect with your “heroes,” your makeover subjects?\n\nBerk: There was one where it was very hard for all of us to break through with him. It was like pulling teeth to get him to communicate with us. At the end we realized, “Oh he actually was taking all this in.” He wasn’t scared or shy. For the most part within an hour we’re connecting. When we walk in we shower these guys with love. It’s really hard for a person to not accept that. It’s hard for them to not want to soak that in, especially because a lot of them don’t really get a lot of that. It broke walls down really quick.\n\nBrown: There were people, obviously, where it was fish-out-of-water leading fish-out-of water. The Cory episode [episode 3, “Dega Don’t”] with a Southern white police officer. For me as an African-American living in the culture we’re living in — and as an alumnus of Marjory Stoneman Douglas High School in Parkland [Florida] where we’ve seen violence — it was hard because what [Cory] voted for in 2016 — that one vote represented for me so much. I wasn’t able to feel as comfortable with him as I was with the other heroes. But what this show did was allow us to have open, honest conversations. Now we could talk to each other about who we are and where we are. It gives me so much hope for our country. It gives me so much hope for us as a community. I think that was important for people to see around the world.\n\nPorowski: I think it’s interesting that you said, “what he voted for” and not who he voted for because having that conversation with him, it got down to concepts. It wasn’t just about the personalities.\n\nBrown: I think it’s important because it’s not really about who he voted for, it’s about what that represents.\n\n“We wanted to have fun and show the brotherhood and love we have for each other.”\n\nKaramo Brown\n\nDo you have any say in who gets picked as your makeover subjects?\n\nBerk: No way!\n\nBrown: Nooooo!\n\nPorowski: That’s a testament to the incredible casting people on this show. They really picked people who are super vulnerable, and very much ready and had a ton of compassion. They were people who were ready for change. They may have been stuck in certain ways, but were very receptive to what we came in with.\n\nFrance: It makes it a more authentic, real experience.\n\nBrown: All of us receive hundreds of messages on social media now. It has opened our eyes to the negative cultural norms that we’ve adapted to as a society and as a world. People are so thankful that we are tackling them and bringing them down. When you talk about toxic masculinity, when you talk about the way that men treat their wives or act as fathers or the way they seem themselves and their self-esteem — we’re trying to change that. We’re trying to get the world to see it’s not always about the outside, it’s about the inside. How can we really make lasting change in a person. That’s a bigger job than we were here for a week, we fixed their haircut and now we move on.\n\nBerk: One of the messages I’ve gotten in my DMs was from a pastor in the Midwest. He wanted to talk about the Bobby Camp episode (episode 5, “Camp Rules”). He said, “My entire life I have been taught and I have taught in my church that being gay is a choice and it is a sin. Hearing you talk on the show about how every day you prayed to God, cried to God, begged God to not make you gay — for the first time in my life I realized it was not choice. You were born that way. You have completely changed my entire opinion on homosexuality and the way I will preach to my church.” I’ve gotten multiple messages like that. I probably get 20 to 30 DMs a day from people who grew up in the Assemblies of God Church and how this episode has helped them.\n\nWhat surprised you most about your experience doing these first eight episodes?\n\nBerk: What surprised me the most was my boys (gestures to the others). How five complete strangers could instantly have this chemistry together. From the very first days of casting, with all these other people around, we found each other. I think that was my biggest surprise. I didn’t expect to barely even like the people, but it’s been great.\n\nJonathan Van Ness and Karamo Brown yuck it up while filming a makeover for a Georgia fireman.\n\nCourtesy of Netflix\n\nVan Ness: From the extreme political polarization that is everywhere, there’s so much suffering going on, so many people are really thirsty to feel good about something. So the outpouring of support has been surprising because I don’t think I realized how many different people from how many different places from how many different walks of life are really suffering. I just get these really long messages where you almost can’t respond because there aren’t words to put into perspective what this person is sharing with you. So it’s really an honor.\n\nPorowski: It’s happy and joyous when people stop you in the street and tell you their experience of watching the show, but it also kind of makes me a little sad because just to see that other extreme.\n\nVan Ness: I almost developed this part of myself that is a bit protective of how I see the world because if I let the weight of it get to me. There was a girl who had a hoodie made with my face on it. It was so sweet and I went from “that’s cute” to sobbing. She was so happy about it. If I think about things like that too much I might not leave the house.\n\nBrown: One moment we’re all really proud of in the show, there’s an episode [Episode 4, “To Gay or Not Too Gay”] with a young African-American man named AJ who comes out in the show. For us, this being the first time in the history of the show that five gay guys helped the hero of our show who is also gay — the emotional response we’ve gotten from that, from the LGBTQI people, but also from straight people saying how you helped me see this in a new light. That’s the one we get the most response to. People are very much inspired that this young man found the courage to come out and live his truth.\n\nPorowski: In his own way.\n\nBrown: What’s universal about his story is that tells all of us when you hide your true self a part of you dies, but when you decide to be open and let people see how amazing you are, you start to flourish. That young man is starting to flourish now. That’s the episode people cry the most on. So if you want a good cathartic cry, watch AJ. You’ll love it.\n\nFrance: I live in Utah. I have a lot of people around me who aren’t as open-minded, but want to know about the show. They just say, “It’s a gay show so I haven’t seen it.” But when I come to New York or L.A., it’s mostly straight men who stop me and say, “I love the show for X, Y Zed reason.” I think the fact there are so many straight men who are willing to watch is important. Because it’s not a gay show. It’s a show for everybody. Yes, it’s called “Queer Eye” and there are five gay men on it, but we’re also tackling real issues. The conversations we have on our show would be just as valid if they swapped us out with straight guys. What we do is important, not just because we’re a niche gay show. We’ve gotten past that.", "images": ["https://pmcvariety.files.wordpress.com/2018/06/queer-eye-variety-contenders-conversation.jpg?w=1000", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Ffeatures%2Fqueer-eye-emmys-reality-conversation-contenders-1202843269%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202843269&comment_count=13", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2018/06/queer-eye-netflix-2.jpg", "https://pmcvariety.files.wordpress.com/2018/06/queer-eye-netflix-episodes.jpg"], "top_img": "https://pmcvariety.files.wordpress.com/2018/06/queer-eye-variety-contenders-conversation.jpg?w=1000", "keywords": [], "authors": ["Cynthia Littleton"], "canonical_link": "https://variety.com/2018/tv/features/queer-eye-emmys-reality-conversation-contenders-1202843269/", "title": "‘Queer Eye’s’ Fab Five Reveal Complications in Connecting With Some Makeover Subjects", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Among all of this season’s reboots, perhaps none engendered as much goodwill as the return of “Queer Eye.” The new Fab Five — Bobby Berk (interior design), Karamo Brown (culture), Tan France (style), Antoni Porowski (food), Jonathan Van Ness (grooming) — teamed up for a run of episodes tha...", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202843269, "author": "Cynthia Littleton", "pmc-category": "Features", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-06-14T09:00:21"}, "pmc-tag": "Antoni Porowski,Bobby Berk,Emmys,Jonathan Van Ness,Karamo Brown,Queer Eye,Tan France", "title": "‘Queer Eye’s’ Fab Five Reveal Complications in Connecting With Some Makeover Subjects", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Queer Eye’s’ Fab Five Reveal Complications in Connecting With Some Makeover Subjects", "url": "https://variety.com/2018/tv/features/queer-eye-emmys-reality-conversation-contenders-1202843269/", "description": "Among all of this season’s reboots, perhaps none engendered as much goodwill as the return of “Queer Eye.” The new Fab Five — Bobby Berk (interior design), Karamo Brown (culture), Tan France (style…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/06/queer-eye-variety-contenders-conversation.jpg?w=1000", "width": 1000, "height": 563, "alt": "Queer Eye Variety Contenders Conversation"}, "locale": "en_US"}, "article": {"published_time": "2018-06-14T16:00:21+00:00", "modified_time": "2018-06-14T16:15:50+00:00"}, "twitter": {"creator": "@Variety_Cynthia", "site": "@variety", "text": {"title": "‘Queer Eye’s’ Fab Five Reveal Complications in Connecting With Some Makeover Subjects"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/06/queer-eye-variety-contenders-conversation.jpg?w=1000", "alt": "Queer Eye Variety Contenders Conversation"}, "card": "summary_large_image", "title": "‘Queer Eye’s’ Fab Five Reveal Complications in Connecting With Some Makeover Subjects", "description": "Among all of this season’s reboots, perhaps none engendered as much goodwill as the return of “Queer Eye.” The new Fab Five — Bobby Berk (interior design), Karamo Brown (culture), Tan France (style…"}, "author": "Cynthia Littleton", "content_type": "Article", "post_id": 1202843269, "title": "'Queer Eye's' Fab Five Reveal Complications in Connecting With Some Makeover Subjects", "published_at": "2018-06-14 09:00:21", "image": "https://pmcvariety.files.wordpress.com/2018/06/queer-eye-variety-contenders-conversation.jpg?w=1000", "comment_count": 13, "tags": "Tan France", "topics": "Features", "appeared_in_print": "No", "body": "Among all of this season’s reboots, perhaps none engendered as much goodwill as the return of “Queer Eye.” The new Fab Five — Bobby Berk (interior design), Karamo Brown (culture), Tan France (style), Antoni Porowski (food), Jonathan Van Ness (grooming) — teamed up for a run of episodes that not only reflected their genuine camaraderie, but also brought a hefty dose of warmth, charm and authenticity to their makeovers.\r\n\r\nHow did you approach the update of “Queer Eye”?\r\n\r\nBobby Berk: One of the things we wanted to bring that the original show wasn’t able to was a look into our lives. Back in 2003, it was groundbreaking and controversial at the same time for gays to be on TV, but it was accepted because they kind of stayed in their lane. They were designers and hairdressers and cooks and it was kind of like “Oh that’s fine” but to be husbands and fathers — that wasn’t. One of the things we wanted people to know is that we’re just like other people. Karamo is a dad who gets texts from his kids saying, “Where’s dinner?” Just the fact that we’re just like everybody else is something we wanted people to see.\r\n\r\nKaramo Brown: We wanted to have fun and show the brotherhood and love we have for each other. There’s one [episode] where we get playful and are throwing glitter on each other. The original show made you feel good and allowed you to have fun — that was very important for us to keep. At the end of the day with everything that’s going on in our world why not just take a moment to have fun with five people who are your friends.\r\n\r\nBerk: In these days where every time you turn on your TV and you just get massively depressed or angry, we wanted to do TV that shows, “OK there’s going to be some hope for the world.” That is our biggest goal.\r\n\r\nWhat was the most challenging aspect of taking on the makeovers of straight guys in Georgia? \r\n\r\nJonathan Van Ness: One thing for me that was challenging was just breaking through the idea of what a metrosexual was. I liked talking through that with men and making ideas of gender and grooming feel more approachable. It’s not a scary and taboo subject. We wanted to do transformations and makeovers for them that really make sense in the long-term. Not just for transformation’s sake, but something they’re going to be able to re-create. I grew up watching so many makeover shows and makeover [segments] on morning TV. I always thought, “Why would we put that haircut on that woman who says she has no time? So we give her a shag that requires all this styling?” So just things like that were fun to go do in a better way.\r\n\r\nTan France: The thing I found that was difficult was that it wasn’t a new show where I could immediately find my own voice. I felt pressure because this is a legacy show. It was a massive show. I am stepping into the shoes of someone who is iconic [Carson Kressley]. That was difficult for the first few days; I was trying to find my own way. I’m so not Carson, I’m very different. That was difficult to me. And all these cameras pointing at you — those first few weeks I really struggled.\r\n\r\n\r\n\r\n\r\n\r\n\r\nIn episode “Below Average Joe,” top left, Jonathan Van Ness, Karamo Brown and Tan France update the look and attitude of stand-up Joe Gallois, second from left; “To Gay or Not Too Gay” featured AJ Brown, who came out on the show in an very emotional episode.\r\nCourtesy of Netflix\r\n\r\n\r\n\r\nAntoni Porowski: I came from the background of scripted [acting] where I had those confines and found safety in it. What I found daunting was the length of our scenes. There’s no action, there’s no cut. But what I actually learned was the comfort in that you get to have real conversations with these people. You know there’s a camera there. But some of these scenes would last two hours and be cut down to something really small. I think it’s a reminder to continue doing that going forward. There’s comfort in the freedom of just going with it, enjoying those pauses and not feeling like you have to push it all the time.\r\n\r\nFrance: The nice thing about our show, what gave me comfort, is that we are the people you see on the show and we’re the same with our family and friends. It makes it a lot easier to shoot it because we’re not playing caricatures of gay men.\r\n\r\nWas it ever hard for you to connect with your “heroes,” your makeover subjects?\r\n\r\nBerk: There was one where it was very hard for all of us to break through with him. It was like pulling teeth to get him to communicate with us. At the end we realized, “Oh he actually was taking all this in.” He wasn’t scared or shy. For the most part within an hour we’re connecting. When we walk in we shower these guys with love.  It’s really hard for a person to not accept that. It’s hard for them to not want to soak that in, especially because a lot of them don’t really get a lot of that. It broke walls down really quick.\r\n\r\nBrown: There were people, obviously, where it was fish-out-of-water leading fish-out-of water. The Cory episode [episode 3, “Dega Don’t”] with a Southern white police officer. For me as an African-American living in the culture we’re living in — and as an alumnus of Marjory Stoneman Douglas High School in Parkland [Florida] where we’ve seen violence — it was hard because what [Cory] voted for in 2016 — that one vote represented for me so much. I wasn’t able to feel as comfortable with him as I was with the other heroes. But what this show did was allow us to have open, honest conversations. Now we could talk to each other about who we are and where we are. It gives me so much hope for our country. It gives me so much hope for us as a community. I think that was important for people to see around the world.\r\n\r\nPorowski: I think it’s interesting that you said, “what he voted for” and not who he voted for because having that conversation with him, it got down to concepts. It wasn’t just about the personalities.\r\n\r\nBrown: I think it’s important because it’s not really about who he voted for, it’s about what that represents.\r\n\"We wanted to have fun and show the brotherhood and love we have for each other.\"\r\nKaramo Brown\r\nDo you have any say in who gets picked as your makeover subjects? \r\n\r\nBerk: No way!\r\n\r\nBrown: Nooooo!\r\n\r\nPorowski: That’s a testament to the incredible casting people on this show. They really picked people who are super vulnerable, and very much ready and had a ton of compassion. They were people who were ready for change. They may have been stuck in certain ways, but were very receptive to what we came in with.\r\n\r\nFrance: It makes it a more authentic, real experience.\r\n\r\nBrown: All of us receive hundreds of messages on social media now. It has opened our eyes to the negative cultural norms that we’ve adapted to as a society and as a world. People are so thankful that we are tackling them and bringing them down. When you talk about toxic masculinity, when you talk about the way that men treat their wives or act as fathers or the way they seem themselves and their self-esteem — we’re trying to change that. We’re trying to get the world to see it’s not always about the outside, it’s about the inside. How can we really make lasting change in a person. That’s a bigger job than we were here for a week, we fixed their haircut and now we move on.\r\n\r\nBerk: One of the messages I’ve gotten in my DMs was from a pastor in the Midwest. He wanted to talk about the Bobby Camp episode (episode 5, “Camp Rules”). He said, “My entire life I have been taught and I have taught in my church that being gay is a choice and it is a sin. Hearing you talk on the show about how every day you prayed to God, cried to God, begged God to not make you gay — for the first time in my life I realized it was not choice. You were born that way. You have completely changed my entire opinion on homosexuality and the way I will preach to my church.” I’ve gotten multiple messages like that. I probably get 20 to 30 DMs a day from people who grew up in the Assemblies of God Church and how this episode has helped them.\r\n\r\nWhat surprised you most about your experience doing these first eight episodes?\r\n\r\nBerk: What surprised me the most was my boys (gestures to the others). How five complete strangers could instantly have this chemistry together. From the very first days of casting, with all these other people around, we found each other. I think that was my biggest surprise. I didn’t expect to barely even like the people, but it’s been great.\r\n\r\n\r\n\r\n\r\n\r\n\r\nJonathan Van Ness and Karamo Brown yuck it up while filming a makeover for a Georgia fireman.\r\nCourtesy of Netflix\r\n\r\n\r\n\r\nVan Ness: From the extreme political polarization that is everywhere, there’s so much suffering going on, so many people are really thirsty to feel good about something. So the outpouring of support has been surprising because I don’t think I realized how many different people from how many different places from how many different walks of life are really suffering. I just get these really long messages where you almost can’t respond because there aren’t words to put into perspective what this person is sharing with you. So it’s really an honor.\r\n\r\nPorowski: It’s happy and joyous when people stop you in the street and tell you their experience of watching the show, but it also kind of makes me a little sad because just to see that other extreme.\r\n\r\nVan Ness: I almost developed this part of myself that is a bit protective of how I see the world because if I let the weight of it get to me. There was a girl who had a hoodie made with my face on it. It was so sweet and I went from “that’s cute” to sobbing. She was so happy about it. If I think about things like that too much I might not leave the house.\r\n\r\nBrown: One moment we’re all really proud of in the show, there’s an episode [Episode 4, “To Gay or Not Too Gay”] with a young African-American man named AJ who comes out in the show. For us, this being the first time in the history of the show that five gay guys helped the hero of our show who is also gay — the emotional response we’ve gotten from that, from the LGBTQI people, but also from straight people saying how you helped me see this in a new light. That’s the one we get the most response to. People are very much inspired that this young man found the courage to come out and live his truth.\r\n\r\nPorowski: In his own way.\r\n\r\nBrown: What’s universal about his story is that tells all of us when you hide your true self a part of you dies, but when you decide to be open and let people see how amazing you are, you start to flourish. That young man is starting to flourish now. That’s the episode people cry the most on. So if you want a good cathartic cry, watch AJ. You’ll love it.\r\n\r\nFrance: I live in Utah. I have a lot of people around me who aren’t as open-minded, but want to know about the show. They just say, “It’s a gay show so I haven’t seen it.” But when I come to New York or L.A., it’s mostly straight men who stop me and say, “I love the show for X, Y Zed reason.” I think the fact there are so many straight men who are willing to watch is important. Because it’s not a gay show. It’s a show for everybody. Yes, it’s called “Queer Eye” and there are five gay men on it, but we’re also tackling real issues. The conversations we have on our show would be just as valid if they swapped us out with straight guys. What we do is important, not just because we’re a niche gay show. We’ve gotten past that.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1528992021.0, "source": "https://variety.com", "summary": ""}