{"url": "http://www.tampabay.com/opinion/columns/rep-ross-we-need-to-get-government-running-again/2145912", "text": "I came to Washington to fight for a smaller government and get spending under control, not shut the government down. In fact, I have repeatedly voted to fund the government in the last few days.\n\nThe shutdown isn't good for anyone in our community or our country. MacDill Air Force Base in Tampa has furloughed more than 1,500 employees, putting our national security at risk before Defense Secretary Chuck Hagel sent them back to work this week. Veterans in my district are facing a possible future suspension in claims processing. Tax refunds can't go out. Citrus growers can't access the E-Verify system to ensure work authorization is approved, which limits their hiring ability.\n\nUnfortunately, President Barack Obama and Senate Majority Leader Harry Reid have been unreasonable and unwilling to negotiate, which led to this government shutdown. We can end this if they would join us at the table and compromise, but Senate leaders and our president won't budge.\n\nI want to be clear: I have never supported Obamacare and have voted more than 40 times to defund it, delay it, or repeal it. I went a step further and introduced an amendment to the continuing resolution that would ensure that the full extent of Obamacare applies to members of Congress, the president, the vice president and staff. The House passed my amendment with bipartisan support. Unfortunately, the Democratic-controlled Senate hasn't passed any of these bills and refused to even vote on my amendment. We are badly mistaken to think there is any hope of the president eliminating his signature legislation, as awful as it is.\n\nShutting down the government has had zero impact on Obamacare. Unfortunately, some were led to believe that Obamacare would immediately cease if the government shut down. The reality is, however, that despite the government being shut down for multiple days, Obamacare continues to be implemented with all of its glitches and problems. That is because about 70 percent of Obamacare is funded through mandatory funding while the current funding battle only addresses discretionary funding — it doesn't even touch mandatory funding.\n\nSince its grand opening on Oct. 1, Obamacare has been an abject failure. Countless technical glitches have prevented enrollees from accessing the online exchanges, and there are endless reports of consumer sticker shock from the high cost of Obamacare insurance premiums. Americans deserve to know that Obamacare is a disaster. Yet these failures and many more have been overshadowed by the government shutdown and the debate over a continuing resolution that, by law, could never fully defund Obamacare.\n\nObamacare will fall under its own weight of complexities, costs and inconsistencies, all at the expense of the American people. The best way to repeal Obamacare is to let it take effect, point out its impact, win control of the Senate, and elect a president who will support its repeal.\n\nIn the few years since I was elected to Congress in 2010, we have achieved huge savings and taken monumental steps. For the first time since the Korean War, total federal spending has gone down for two years in a row. We need to continue to take steps forward, shedding off our \"excessive funding weight\" one pound at a time. That is why I would support a continuing resolution that funds the government at sequestration levels for one year.\n\nWe need to get the government running again and end this shutdown so that our communities can get back on their feet.\n\nRep. Dennis Ross, R-Lakeland, represents the 15th Congressional District that covers part of western Polk and eastern Hillsborough counties, including Brandon and the University of South Florida. He wrote this column exclusively for the Tampa Bay Times.", "images": ["https://www.tampabay.com/resizer/M5BGUbbLQhYV787De9WONsDPfIg=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/KNXW6JGKCII6TODGIBWI6S7HAY.jpg"], "top_img": "https://www.tampabay.com/resizer/M5BGUbbLQhYV787De9WONsDPfIg=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/KNXW6JGKCII6TODGIBWI6S7HAY.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.tampabay.com/opinion/columns/rep-ross-we-need-to-get-government-running-again/2145912/", "title": "Rep. Ross: We need to get government running again", "meta_data": {"twitter": {"card": "summary_large_image", "title": "Rep. Ross: We need to get government running again", "site": "TB_Times", "url": "https://tampabay.com/opinion/columns/rep-ross-we-need-to-get-government-running-again/2145912/", "image": "https://www.tampabay.com/resizer/M5BGUbbLQhYV787De9WONsDPfIg=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/KNXW6JGKCII6TODGIBWI6S7HAY.jpg"}, "og": {"image": "https://www.tampabay.com/resizer/M5BGUbbLQhYV787De9WONsDPfIg=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/KNXW6JGKCII6TODGIBWI6S7HAY.jpg", "type": "article", "title": "Rep. Ross: We need to get government running again", "site_name": "Tampa Bay Times", "url": "https://tampabay.com/opinion/columns/rep-ross-we-need-to-get-government-running-again/2145912/"}, "pageType": "article", "title": "Rep. Ross: We need to get government running again", "campaignData": "opinion:noadval", "viewport": "width=device-width, initial-scale=1", "application-name": "Florida's favorite paper, Tampa Bay's favorite local news site", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/pf/mstile-144x144.png", "msapplication-square70x70logo": "/pf/mstile-70x70.png", "msapplication-square150x150logo": "/pf/mstile-150x150.png", "msapplication-wide310x150logo": "/pf/mstile-310x150.png", "msapplication-square310x310logo": "/pf/mstile-310x310.png", "fb": {"app_id": 117591765631093, "pages": 9924394837}}, "movies": [], "publish_date": null, "source": "http://www.tampabay.com", "summary": ""}