{"url": "https://greysanatomy.fandom.com/wiki/Into_You_Like_a_Train", "text": "Into You Like a Train Season 2 Episode 6 A train crash brings many victims to the ER. Episode Information Airdate October 30, 2005 Written by Krista Vernoff Directed by Jeff Melman Episode Guide Previous Next Bring the Pain Something to Talk About\n\n“ In general, people can be categorized in one of two ways — those who love surprises and those who don't. I don't. I've never met a surgeon that enjoys a surprise, because as surgeons, we like to be in the know. We have to be in the know, because when we aren't, people die and lawsuits happen. Am I rambling? I think I'm rambling. Okay, so my point, actually, and I do have one, has nothing to do with surprises or death or lawsuits, or even surgeons. My point is this: whoever said \"What you don't know can’t hurt you\", was a complete and total moron. Because for most people I know, not knowing is the worst feeling in the world. Okay, fine. Maybe it's the second worst. As surgeons, there are so many things we have to know. We have to know we have what it takes. We have to know how to take care of our patients... and how to take care of each other. Eventually, we even have to figure out how to take care of ourselves. As surgeons we have to be in the know. But as human beings, sometimes it's better to stay in the dark, because in the dark there may be fear, but there's also hope. ” — Meredith Grey\n\nInto You Like a Train is the sixth episode of the second season and the 15th overall episode of Grey's Anatomy.\n\nContents show]\n\nShort Summary Edit\n\nA train crash brings in many patients to Seattle Grace, including Meredith, who is too drunk to work; while the rest of the interns face their own professional crashes as Cristina searches the entire hospital in search of a foot for the Chief; Izzie is unsure how to react around Addison and Meredith, George, Bailey, Derek, and Burke treat two strangers impaled on a pole, all the while, Meredith awaits Derek's decision.\n\nFull Summary Edit\n\nMeredith is seated at the bar talking to Joe. She asks him if she really asked Derek to choose her. Joe thinks it's romantic to which Meredith replies, \"It's not romantic, Joe. It's horrifying. Horror-movie horrifying. Carrie at the prom with the pig's blood, horrifying!\" Cristina and George are shooting darts several feet away with Izzie seated at a table beside them. Cristina wonders how long Meredith is going to wait. Izzie says it's getting hard to watch. Cristina says that now the situation is pathetic. Meredith hears her and drunkenly says, \"Who's pathetic? You who pretend to be my friends calling me pathetic behind my back, in front of my face. Why don't you just dump the pig's blood on me now and get it over with.\" She is losing hope that Derek is coming. All of the interns start getting pages and a man in the bar says to turn on the television. On the news, there is a train wreck. The train was bound for Vancouver and had over 300 passengers. Izzie complains that they just worked a thirty hour shift. George says he does not have clean underwear. Meredith starts to pick up her stuff and Joe tells her she can't leave, that she should at least have a cup of coffee. Cristina pokes her head in the door and calls her. Meredith tells Joe, \"Maybe it's for the best. Maybe I don't want to know.\" Joe does not agree.\n\nAmbulances pour in with patients from the train accident. The interns rush past and head into the hospital.\n\nDerek walks into the bar. He looks around for Meredith. Joe sees him and says, \"Dude, you're late.\" Derek gets a page.\n\nCristina, Alex, Izzie, George, and Meredith are in the elevator. Izzie looks at Alex puzzled and Meredith looks very drunk, she stumbles out of the elevator. George and Cristina are very excited at the possible procedures they will get to see and perform. Alex says to Izzie, \"I thought you weren't talking to me.\" They are all putting on the yellow protective gowns. Izzie tells him that she is rising above because it seems like he needs a friend after George's success in the elevator surgery. George accidentally hits Cristina's head with his elbow. Bailey walks up to them in a formal dress. They all look at her in a little bit of surprise. Meredith is just leaning against a wall staring into space. Bailey hands Alex her purse and tells him to get her shoes. She starts to put on a yellow gown and passes Meredith. Meredith says, \"Hello. I seem to be a little bit drunk. I was off duty.\" Bailey angrily replies, \"So was I. Anybody else half in the bottle?\". The rest of the interns say no. Bailey tells Meredith to stay out of the way for now and the other interns go with Bailey to get their assignments. She tells them to not make any mistakes because they are tired. Bailey pushes open a door and there are many injured people. Cristina happily says, \"I'm so not tired anymore.\" George says he's not either. Meredith sees Addison with a patient. Addison asks Bailey for an intern and assigns Izzie. Meredith is definitely not pleased at the sight of Addison. Nurse Tyler walks in and says to Meredith, \"Joe told me to tell you that McSteamy came looking for you.\" She corrects him and says McDreamy. Derek walks into the room and looks at Meredith. George asks Cristina if that means he picked Meredith. She says, \"If it does, I just lost 50 bucks.\" A paramedic runs in with an amputeed leg. Cristina says she wants that case. Richard walks in with the man missing a leg and Bailey assigns Cristina.\n\nChief sees Derek and tells him to clear him for surgery. There is a train wreck and they need everyone available. Derek asks him several questions about having headaches and dizziness. Richard says in a stern manner that he hasn't. Derek and Richard walk past Meredith, Derek nods at her. George comes over and asks what the nod meant. Meredith doesn't know. George asks out loud, \"Am I invisible?\" because he does not have a case yet.\n\nAlex comes in and gives Bailey her shoes. Meredith is leaning against the wall watching all of the commotion around her.\n\nOn a gurney, a man and a woman are wheeled past her. They have a metal pole through their torsos connecting them together.\n\nInside, the man and woman with a pole through them are being examined. Just outside the room, a paramedic is telling Burke and Bailey about the two patients. The man, in his early 50's named Tom, has a steady blood pressure. The woman, in her 20's named Bonnie, is doing significantly worse. Inside, a drunk Meredith looks at the pole in awe. The woman asks, \"Is the craziest thing you've ever seen?\" She says it is. Bailey looks at Meredith sternly. Bailey asks the paramedic how things were at the scene. The paramedic said there were not a lot of survivors then leaves. Burke tells Bailey to get X-rays and various labs done. Unfortunately, they cannot fit in the C.T. so they are going to \"go in blind\". Bonnie asks Burke and Bailey inside and ask if they are going to remove the pole soon, Tom amusingly adds that it is a \"touch uncomfortable\". Burke apologizes, they cannot remove it until they know how things are going internally. He says they will work as quickly as possible. Bonnie asks if anyone has a breath mint. They all look around at her and each other. She says that the mint is for her not for Tom. Bailey tells George to get them X-rays but to move them extremely carefully. Meredith says, \"You go, George\", before she, Alex, and Bailey leave the room. Alex looks at him with a scowl.\n\nBailey tells Alex to cover the E.R. while he gets over his new fear of scalpels. He leaves to do that. Meredith tells Bailey, \"That was mean, even for you.\" Bailey realizes that she is, in fact, drunk. She tells Meredith to give herself a banana bag I.V., not to talk to patients, and not to practice any medicine. Meredith thinks she should just go home. Bailey tells her she'll be sober in a few hours and if she, Bailey, cannot go home, no one can. She leaves Meredith and mumbles under her breath, \"Ten years of marriage and I didn't even get to finish my damn lobster.\"\n\nGeorge and several other physicians are wheeling Tom and Bonnie on their way for their tests. George asks them if there is anyone he can call. Tom says they called his wife from the ambulance, Bonnie's fiance was called and their significant others' are flying from Vancouver together. Tom says that normally his wife would be very upset that he's pressed up against another woman but he thinks he'll get a pass this time. George asks whether they travelled together. Bonnie says they just met and that Tom has very nice pores. Tom chuckles and notes how it is painful to laugh. There is a long line for X-rays. George calls the attention of another intern. He sees them and let's them go ahead. George clears his throat behind another intern, she sees and let's them pass despite having patients themselves.\n\nAddison and Izzie are with the pregnant woman, Brooke, involved in the train accident. The patient has burns along her neck extending down to her belly. Izzie stares at Addison. Addison sees from the corner of her eye and asks if Izzie needs something. Izzie says she doesn't. The woman has a contraction. Addison tells Izzie to book an O.R. because Brooke is in no condition to push and the baby is in distress. Addison will have to perform a C-section. Brooke asks if she can call a lawyer because she does not have a will and there's no father. Addison tells her there is not need for alarm and that there's time for her to make the necessary arrangements.\n\nIzzie walks past Alex giving a woman, Mary, stitches on her forehead. She has a friend, Yvonne, with her whose phone keeps ringing. She insists to everyone who calls that they're fine. She tells them a red neck tried to beat the train and the train hit his vehicle. Alex asks Mary if the stitches hurt or if anything else is in pain. He overhears more of Yvonne's conversation. Yvonne seems to be insensitive to the people who did not survive the wreck. Mary says the area around her stomach hurts because some luggage fell and hit her. There's a large bruise. Alex says they're going to get her X-rays just in case there are internal injuries. Yvonne sees them go and gets off the phone. She wonders where they are going. Alex tells her, Yvonne calls Alex a little boy because he does not look much older than her eldest son. She says, \"Are you sure you're a doctor?\" as her cell phone rings again. She holds her finger up then answers her phone. She tells the person that she and Mary are fine and starts on the red neck story again. They leave.\n\nIzzie walks past an area with a drawn curtain. She hears a woman say, \"Ow\", over and over again. Izzie draws the curtains back. It's Meredith. Izzie asks her what she's doing. Meredith says she's \"inserting her banana bag, which sounds vaguley dirty but it isn't.\" Izzie smiles and draws the curtains around them. Izzie offers to insert the banana bag for her. Meredith asks, \"So how's it going with Addison? Bad mood? Good mood? 'Yay my husband picked me mood'?\" Izzie replies, \"I think it's more of a 'I hate the smell of charred flesh' mood.\" Meredith says, \"Before you judge me, I know there was a train accident. People are very badly hurt. And that I'm a vapid narcissist when you mix me with alcohol. In case you were wondering, I know that.\" Izzie says, \"Well, for what it's worth, I take issue with her salmon colored scrubs. I mean what self respecting surgeon wears salmon colored scrubs?\" Meredith says, \"This is what I'm saying.\" They both smile and Izzie leaves.\n\nRichard and Derek are performing surgery on the man with a missing leg. Cristina is cleaning out the leg they are going to put back. Richard is pleased because it was a clean sever. The man will probably have full function of his leg eventually. On a tray, there are several pagers and one goes off. It is for Derek. Richard squints his eyes a bit. Derek asks if he's okay. Richard says he's fine and is only adjusting to the light. Derek says there's no shame in taking time off to recover. Richard tells him he's fine and that Derek should go because he is needed elsewhere. He tells them to page him if he's needed here. Richard tells Cristina she can help him when she's finished cleaning the wound. Cristina pauses for a few seconds. Chief if asks if it's clean. She says that it's clean. Richard takes offense because he thinks Cristina is there just to keep an eye on him. He gives her a short lecture then asks if they have a problem. She says they do. He gets the wrong idea. Cristina insists she's happy to be there assisting him but the leg she is cleaning is a left leg when the patient needs a right one. Richard tells her to find the right leg.\n\nGeorge, Bailey, Burke, and Meredith are inside as Derek walks in. George notes how the pole goes right through her spine. Derek sees Meredith's I.V. and asks what happened. She replies, \"Tequila.\" Bailey tells him that she's keeping an eye on her. Burke says the pole is on line with Tom's interior vena cava, while it is against Bonnie's aorta. They cannot remove the pole or else they will both bleed out. Burke suggests that they don't move the pole, that they move one of the patients so they can saw through it. George asks, \"Which would you move?\" Burke says that Bonnie's chance for survival is very slim because of the damage to her aorta, so moving her is the best choice so they can save Tom's life. Derek says it could go another way, that since Tom's more stable they could move him to give her a chance. Meredith says, \"So basically whoever you move doesn't stand a chance. So how do you choose? How do you decide who gets to live?\"\n\nBurke says they need to make a decision soon to have a chance at saving Tom and Bonnie. Derek says he wants to examine them before providing his input. Burke tells him to page him when he's through, then leaves. Derek starts to address Meredith as if to assign her something. Bailey interrupts and says Meredith needs a blood alcohol test before practicing any medicine. She says that she's totally fine, extends her arms and starts touching her nose with her index finger alternating arms. Bailey looks at Derek who then walks away. Meredith insists that she is fine. Bailey says, \"Regretting that last shooter about now, aren't you?\"\n\nCristina is rummaging through an ambulance as a paramedic approaches. She asks Cristina what she's doing. Cristina starts to talk about how the patient with an amputeed leg does not have the right leg to put back on. The paramedic takes offense because she did not bring in that patient and says that Cristina did not differentiate between paramedics. Cristina says she cannot straddle another giant ego, she's already \"doing the splits\". She gets off the ambulance and says she needs the right leg or else the chief of surgery is going to take away her \"pretty blue scrubs\". The paramedic says there were multiple decapitations in the dining car and that the guy can live without his leg. Cristina says, \"This is so not about the leg or the guy.\" She sarcastically thanks the paramedic for all that she does. Cristina walks back into the hospital.\n\nAlex is treating another patient, Jana, who happens to be pregnant. A few feet away is Yvonne on the phone again talking about the red neck. Alex draws the curtain around himself as if to block her out. Alex tells her she should have minimal scarring. Jana asks if her friend is okay, she was pregnant also but put into a different ambulance. Alex says if she's not there she's probably in maternity. The woman gets up so she can go see her friend. She says her baby is fine because it's kicking. Alex follows her.\n\nMeredith is seated in a wheelchair as George tries to draw her blood. Meredith says, \"Ow\", twice. She adds how he operated on a heart earlier so drawing blood should be no problem. He says he rocked the heart and that he's strung out on the scalpel. Meredith says there's nothing wrong with that. George smiles then gets a serious expression on his face. He asks if there's news about Derek. Meredith can't read him. George applauds her for even giving him a choice. He says that Derek is crazy if he doesn't pick Meredith. Cristina approaches them and hopes that they have seen a cleanly cut right leg. George says he hasn't. Meredith asks, \"How weird is this job?\" George whispers, \"Weird.\"\n\nAddison is standing next to Brooke's hospital bed as Jana comes in. They are happy to see one another. Alex comes in. Addison asks if Jana was on the train. Izzie comes into the room. Alex says she was on the train. Addison asks him whether he gave her the appropriate tests to ensure the health of the baby. She is upset that Jana is wandering around the hospital. Addison tells him to leave so he goes. Addison tells Izzie that it was very irresponsible even for an intern, then asks if Izzie disagrees. Izzie says, \"She wanted to see her friend. What was he supposed to do, tackle her?\" Addison tells Izzie to get Jana into a bed.\n\nDerek is examining Bonnie and Tom. He runs something against her foot and asks if she can feel it. She says that Derek is cute and cute doctors can call her by her first name. Derek does it again and asks if she can feel it. She says, \"Feel what?\", then realizes she doesn't. George comes into the room and gives Derek the lab results. He tells Tom to wiggle his toes. He is successful and Derek tells him so. Tom is very happy. Bonnie asks Derek if her toes are moving. George looks down at her foot. Her toes don't move but Derek tells her they did. She says, \"Yay me!\" Tom asks Derek if they are going to live through this. Bonnie says that it is a morose thing to say. Derek says they are going to do everything they can.\n\nCristina comes into the O.R. with a leg wrapped in a pink plastic bag. Richard says it's about time she arrived. Cristina apologizes but says she took the liberty of checking the wound herself. A scrub nurse shows the leg to Richard. There is red nail polish on the toes, the leg belongs to a woman. Chief looks at Cristina. She stutters a bit and says she'll go find the correct leg. She leaves quickly.\n\nGeorge and Derek are looking at X-rays as Bailey and Burke come in. Burke asks what the situation is. Derek says that Tom has better odds at surviving. Bailey tells George to tell O.R. 1 that they are coming. Burke adds that he should close the gallery, they don't need an audience for this procedure. George looks very sad. He says, \"She's cracking jokes. How do you tell someone she's going to be dead in a few minutes when she's sitting up, cracking jokes?\"\n\nMary is lying in bed and Yvonne is seated in a chair next to her. Yvonne asks Alex if they can get out of the hospital soon. Alex tells them labs and radiology are all backed up and Mary can't be discharged until they rule out internal injuries for Mary. Yvonne's cell phone rings again. With an attitude she tells the person that they're still at the hospital because the doctor, Alex, is useless. Alex looks at her disappointed then walks away past Cristina. Cristina is on the phone looking for the leg. She asks the person to sift through the carnage to look for the right leg. They hang up on her. Burke comes, apparently Cristina paged him. She says if she doesn't find the right leg then Richard is going to cut her from the program. She does not want to go back to Los Angeles because it's sunny every day. Burke just continues to look at her puzzled. Cristina says, \"You're my boyfriend! I mean, I know I don't have much experience with this kind of thing but, aren't boyfriends supposed to help in situations like this?\" Burke smiles but says that since they're on duty he can't be her boyfriend. She says, \"Okay, so when we're on duty I can have sex with someone else?\" In a very pleasant manner he says, \"Dr. Yang, I'm walking away now.\" Cristina says when she's kicked out of the program he'll probably rethink not helping her.\n\nAlex and Meredith are standing in a doorway and they are in the middle of a conversation. Alex is telling her about Addison calling him out in front of a patient. Meredith asks if she yelled. Alex says she didn't. After a pause he says, \"Fine, she's Satan's whore.\" Meredith asks if he yelled back to her. He says he didn't. Meredith says, \"Dude, you lost your mojo.\" Alex says, \"Excuse you.\" Meredith says she was trying to talk like one of the guys. Alex says, \"O'Malley plugs a hole with his finger and everyone walks around like he's some kind of hero. I have one off day..\" Meredith thinks he chickened out. Alex says he \"hesitated briefly.\" Meredith asks why he did not kiss Izzie. Alex says, \"And now I'm leaving.\" Before he has a chance, Cristina comes and says, \"It's not in the morgue. I've looked in the ambulances and the ER. How is one bloody hairy leg gonna destroy my career?\" She quickly leaves. Alex's lab results are ready. He gets them and starts to walk away. Meredith tells him she hopes he gets his mojo back because she finds him \"disturbing without it\". He hopes he finds it too. She hits the back of her head against the wall and says, \"Ow.\"\n\nDerek, George, and Bailey are with Tom and Bonnie. Derek is explaining that it is difficult because at the moment their bodies are in shock, which prevents them from feeling the pain of their injuries. Burke comes into the room. Bonnie says she didn't expect to walk out of there any time soon, after all, they have a metal pole going through their insides. She'd rather Derek says what he needs to say. He says that in order to operate on Tom, they need to be separated; that they would have to move her backwards off the pole. Tom asks if the doctors could just pull the pole out of both of them. Burke responds that doing so would cause them both to bleed too quickly because at its current position, the pole is plugging the wounds. When the pole is removed, the organs would shift. Bonnie, in a sad yet calm tone says, \"So, if you move me, I'll die?\" Derek says they'll do everything they can to save her. Tom says no, he thinks if anyone should be moved it's him. Burke tells him that his injuries are less extensive. Derek strokes Bonnies hand. Tom exclaims, \"It's not right. It's not right.\" Bonnie closes her eyes then says, \"Tom, it's not fair either way.\" He looks off into the distance. Bonnie asks if her fiance, Danny, is there yet. George says there are delays at the airport because of a storm. Bailey says they could wait but the longer they wait, the higher the risk of infection. Bonnie says it's better this way because Danny wouldn't understand, it would be too hard for him to grasp everything so quickly.\n\nAddison and Izzie are treating Brooke. Jana is seated in a wheel chair right by her side. Patricia comes into the room with two clip boards. She asks if someone asked for a notary. Brooke says she asked for a lawyer. Patricia says she could not get one at this time of night but the hospital's forms should take care of what she needs. She explains that Brooke's child would be placed into the custody of whoever she specifies in case of death or permanent vegetative state. Jana is confused and asks who is dying. Addison explains that there's some danger because of the trauma and the burns. Jana think it's ridiculous. Brooke says it's necessary, just in case, so that their son doesn't end up with her mother. Jana quickly and eagerly takes the clipboard from Patricia. Izzie asks how long they have been together. Brooke replies, \"Since third grade.\" Jana continues and explains that they aren't lovers but best friends, they wanted their children to grow up with two parents. They both used the same sperm donor making their children brother and sister. Jana's water breaks. They move into action.\n\nAlex tells Mary she has a broken rib, she'll need some pain killers but other than that she's fine. Yvonne is laying her head at the end of the bed as her phone rings again. Mary tells her to answer the phone. She tries to nudge her awake. Yvonne falls from the chair she is seated in. Mary is very concerned. Alex calls a code blue and asks for help. Alex and four others are trying to revive Yvonne. Yvonne has lost too much blood. Mary is confused because she doesn't see any blood. The nurse explains she was bleeding internally for hours. Alex says that Yvonne didn't say anything, that he didn't know. A nurse says that Yvonne is gone, she has a flat line. Mary refuses to believe it. Alex calls her time of death, 2:51, and leaves the room very upset.\n\nAddison introduces Jana to Dr. Hoffman who will take over delivering her baby. She walks back to Brooke and Izzie hands her Brooke's chart. Addison says they need to go to the operating room now. Brooke says they were supposed to give birth together. Jana tells Brooke that it's okay, she should go and enjoy her C-section and the drugs that go along with it. She says that her vagina is definitely not having fun. Brooke does not want Jana to be alone. Addison says that Izzie is a surgeon. Izzie says that it's all right and she'll stay. Addison looks pleased Izzie is willing to give up a surgery for the benefit of a patient. As Brooke is wheeled out, Jana tells her to stay alive. Brooke says, \"You too.\"\n\nAlex is angry at himself for the death of Yvonne. He yells, \"Damn it!\" then sits on a bench. A paramedic comes to him with the leg that Richard has been looking for. Alex thanks him and Alex looks very happy. He heads back into the hospital. Cristina walks in and starts to apologize to Richard for not being able to find the leg. She sees that they are operating. She asks if they found the leg. Alex turns to Cristina and says that he found it. Richard tells Cristina she missed out this time but they could probably use her help in the E.R. She looks at Alex with the deepest loathing.\n\nTom and Bonnie are being prepared for surgery. Bonnie quietly asks Tom if he believes in heaven. He says he does, then asks Bonnie if she does. Bonnie says that she wants to. Tom starts to say something. Bonnie starts to cry then says, \"Shhh. I know.\" She rubs his shoulder. He has tears in his eyes. Derek introduces them to the anesthesiologist. Bonnie asks if it is going to hurt. They say she won't feel a thing. She asks if Derek is the one who is going to talk to Danny. He smiles and says yes, then asks what she wants Derek to tell him. She starts whispering in his ear. Bailey, George, and Burke are scrubbing in for Bonnie and Tom's surgery. Bailey wonders aloud, \"Why do I feel like we're about to kill this girl?\" Meredith comes in and says that she is sober according to her labs then asks if she can scrub in. Burke tells her to do it quickly. Bailey and Burke go into the O.R. as Derek walks out and into the scrub room. Meredith sees him then looks at George, whispers his name as if to say 'Give us a minute.' George finishes washing his hands then goes into the O.R. Meredith and Derek greet each other. Derek says he went to the bar. Meredith says she heard. Derek looks at her then looks away. Meredith looks down as he asks if she took some aspirin to help with a hangover. He starts to wash his hands and Meredith says, \"Oh, you're staying with her.\" Derek is silent for a few moments then says, \"She's my wife.\" Bailey calls to Derek and says that Bonnie is crashing. He walks into the O.R. followed by Meredith. Derek asks what happened. They determine that the pole must have shifted. They start to move Bonnie off the pole. Burke tells George to hold the pole in place. They start to count \"One, two...\"\n\n\"...Three.\" Izzie is seated on Jana's bed holding her hand as Dr. Hoffman delivers her baby. Izzie counts again, \"One, two...\"\n\nAddison is operating on Brooke. Her baby is wedged under her ribs. They need to pull him out. Addison starts to count, \"One, two...\"\n\nBonnie is slid off the pole and placed on an operating table. They start to cut the excess pole with a saw. Tom is stable so they begin operating on Bonnie. Derek and Burke are working as quickly as they can on her with Meredith and Bailey retracting. Burke reaches inside and says that her aorta is shredded and she's bleeding out. Tom is losing pressure and so everyone, with the exception of Meredith, moves to work on him. Meredith yells, \"What about her? We can't just abandon her! We can't just abandon her!\" Meredith continues to work on Bonnie. Bailey and George both call her to work on Tom. Meredith continues saying they cannot abandon Bonnie, they have an obligation. Bailey walks over to her and says there was too much damage, there was nothing they could do. She says they have to let her go. Bailey calls her time of death, 3:49. Meredith remains by Bonnie's side.\n\nJana is laying in bed, her daughter is in her baby bed next to Jana's bed. Addison comes in and Izzie asks how Brooke is doing. Addison says she and her son are doing fine. They walk out into the hallway. Addison asks, \"So, have you made a decision yet, Dr. Stevens?\" Izzie is confused. She says, \"Whether or not you're going to hate me. You're Meredith's friend? I'm the wicked witch who came in and ruined her life and cheated on Doctor, wait, what is it that you guys call him?\" Izzie reluctantly answers, \"McDreamy.\" Addison asks if it embarrasses him. Izzie thinks it does. Addison says that by all rights Izzie should hate her, but she's staying in town for a while. Izzie looks down realizing that must mean Derek chose Addison. Addison says Izzie has a gift for her specialty and she has a lot she could teach Izzie if she wants to learn. She adds, \"So, when you decide how important it is for you to hate me, let me know.\" Addison walks away. Izzie sighs.\n\nDerek is with Bonnie's fiance, Danny. They are seated in the waiting room. Bailey is seated next to Derek. George and Meredith are standing several feet away within ear shot. Danny asks if Bonnie suffered. Derek says she was not in any pain. Derek continues, \"She asked me to tell you.. She wanted you to know that if love were enough, that if love were enough that she'd still be here with you.\" Meredith looks at them in sadness then walks away. George looks at her go.\n\nRichard and Alex follow the patient as he is being wheeled out. Richard compliments Alex on his fine work. He thanks Richard. Jana is in a rocking chair feeding her daughter. Addison lifts Brooke's son from his baby bed and holds him next to Brooke. Izzie has a big smile on her face as she holds his bottle.\n\nTom is asleep in bed. Burke tells his wife that Tom is doing fine. She gives him a hug.\n\nBailey and Derek are inside the elevator. Derek is obviously very distraught. Bailey senses it and pulls on the stop button. Derek walks to the back of the elevator and grasps the rail. He wipes his face then stands next to Bailey again. She asks if he's okay. He says he is. She pushes in the button. They both walk out.\n\nIzzie, Meredith, and George are seated on a bench. Alex puts on his white coat and opens the door to leave. Cristina walks in and glares at him. Cristina sits down next to Meredith who looks very sad.\n\nDerek and Addison walk out of the hospital. Addison links their arms together.\n\nMeredith, Cristina, Izzie, and George look very tired on the bench. The door opens, Meredith looks to see who it is. Bailey is at the door. She tells them to get cleaned up, they have to do rounds in five minutes. They all stand up and go to their lockers.\n\nCast Edit\n\nMeredith Grey\n\nCristina Yang\n\nIzzie Stevens\n\nAlex Karev\n\nGeorge O'Malley\n\nMiranda Bailey\n\nRichard Webber\n\nPreston Burke\n\nDerek Shepherd\n\nAddison Montgomery-Shepherd\n\nBonnie Crasnoff\n\nTom Maynard\n\nYvonne\n\nJana Watkins\n\nMary\n\nBrooke\n\nJoe\n\nPatricia Murphy\n\nNurse Tyler\n\nNurse Ginger\n\nIntern #2\n\nScrub Nurse\n\nDr. Hoffman\n\nParamedic Ray Sutera\n\nIntern #1\n\nAnesthesiologist\n\nStan the Paramedic\n\nLab Tech\n\nDanny\n\nNurse\n\nJill the Paramedic 1 of 31\n\nMain Cast Edit\n\nSpecial Guest Star Edit\n\nGuest Stars Edit\n\nFeaturing Edit\n\nMedical Notes Edit\n\nDiagnosis: Pregnancy Burns\n\n\n\nTreatment: Burn cream C-section delivery\n\n\n\nBrooke was pregnant when she got burned in the train crash. They applied burn cream, but while she was being treated, she went into labor, so they had to take her in for a c-section.\n\nWebber's Patient Edit\n\nDiagnosis: Traumatic amputation\n\n\n\nTreatment: Re-attachment\n\n\n\nWebber took a patient in who had sustained a traumatic leg amputation in the train accident. He discovered that the leg that had been brought into the OR with them was not the leg the patient had lost. They eventually found the correct leg and it was successfully re-attached.\n\nDiagnosis: Impalement injuries\n\n\n\nTreatment: Surgery\n\n\n\nBonnie came into the ER impaled on a pole which was also impaling Tom Maynard. Her spine was crushed by the pole and the pole was hitting her aorta. They evaluated the odds of survival for both of them and determined that Bonnie had almost no chance of survival either way, so they felt she should be the one moved off the pole, to give Tom the best chance of survival he could get. Further testing revealed that Bonnie had no sensation in her feet and couldn't move her toes. Her spine was completely severed. They presented their plan to both Tom and Bonnie, who reluctantly agreed to the surgery. Once they were anesthetized, the pole shifted and Bonnie crashed. They pulled her off the pole and cracked her chest, but her aorta was shredded, so they quickly realized she was a lost cause.\n\nDiagnosis: Impalement injuries\n\n\n\nTreatment: Surgery\n\n\n\nTom was brought into the ER after being impaled by a pole which was also impaling Bonnie Crasnoff. The pole was pressed up against his vena cava. They evaluated the odds of survival for both of them and determined that Bonnie had almost no chance of survival either way, so they felt she should be the one moved off the pole, to give Tom the best chance of survival he could get. Because Bonnie's odds were so slim, they presented their plan to both Tom and Bonnie, who reluctantly agreed to the surgery. Once they were anesthetized, the pole shifted and Bonnie crashed, so the pulled her off the pole and opened her chest. They quickly saw that she was a lost cause, so they went back to Tom and they were able to repair his injuries and save his life.\n\nDiagnosis: Facial laceration Broken rib\n\n\n\nTreatment: Stitches\n\n\n\nMary came into the ER after the train accident. She had some facial lacerations, which were stitched up in the ER. She also had pain in one side, so Alex ordered x-rays to make sure nothing was broken and she had no internal injuries. The x-ray showed a broken rib, so she was given pain meds.\n\nDiagnosis: Acute alcohol poisoning\n\n\n\nTreatment: Fluids\n\n\n\nBecause she was drunk, Meredith was ordered to connect herself to a banana bag to hydrate herself. However, she couldn't insert it into herself, so Izzie helped.\n\nDiagnosis: Laceration Pregnancy\n\n\n\nTreatment: Stitches Vaginal delivery\n\n\n\nJana had a cut stitched up in the ER before heading up to maternity. While she was there, she went into labor and gave birth.\n\nDiagnosis: Massive internal bleeding\n\n\n\nTreatment: Attempted resuscitation\n\n\n\nYvonne collapsed after hours in the ER because she'd been bleeding internally the whole time. Efforts to resuscitate her were unsuccessful.\n\nMusic Edit\n\nSong Performer Scene \"Blood and Peanut Butter\" B.C. Camplight Meredith is continuing to wait for Derek at Joe's bar.\n\nCristina, Izzie, and George talk about Meredith.\n\nThe doctors get paged and see a train crash on the TV.\n\nThey all go to the hospital.\n\nDerek arrives at the bar, but he is late.\n\nThe interns take the elevator to the ER. \"Back Where I Was\" The Hereafter Bonnie and Tom are talking to each other about heaven before their surgery.\n\nBonnie gives Derek a message for her fiancé.\n\nThe doctors all scrub in.\n\nDerek tells Meredith that he chose Addison. \"The City Lights\" Umbrellas Bonnie and Tom are separated.\n\nThey cut the pole apart and start working on Bonnie.\n\nBonnie has too much damage so they move onto Tom.\n\nMeredith tries to keep helping Bonnie, but Bailey calls time of death. \"Today Has Been Okay\" Emilíana Torrini Derek talks to Danny.\n\nRichard finishes his surgery.\n\nJana and Brooke bond with their newborns.\n\nBurke tells Tom's wife that he is going to be fine.\n\nBailey stops the elevator so Derek can cry.\n\nThe interns all sit in the locker room.\n\nDerek and Addison walk out of the hospital.\n\nBailey comes into the locker room and tells the interns to get ready for rounds.\n\n\"Blood and Peanut Butter\" - B.C. Camplight \"Back Where I Was\" - The Hereafter \"The City Lights\" - Umbrellas \"Today Has Been Okay\" - Emilíana Torrini\n\nNotes and Trivia Edit\n\nThis episode's title originated from the song Into You Like a Train , originally sung by The Psychedelic Furs .\n\n, originally sung by . This episode scored 16.67 million viewers.\n\nThe prep dates for this episode were July 22, 2005 to August 1, 2005.\n\nShooting for this episode was scheduled from August 2, 2005 to August 11, 2005.\n\nIt was originally titled You Oughta Know after the Alanis Morissette song.\n\nBonnie and Tom's characters were nicknamed \"Bonnie and Clyde\".\n\nThis episode marks the introduction of Paramedic Ray Sutera.\n\nThe season 2 DVD set includes an audio commentary for this episode by director Jeff Melman and writer Krista Vernoff.\n\nThe line where George wonders if he's invisible was ad-libbed by T.R. Knight.\n\nAlex refers to Addison as Satan's whore. The original script said bitch, but Justin Chambers felt like that was too generic for Alex, so Krista Vernoff had her assistants make up a list of non-generic alternatives. They then chose Satan's whore.\n\nAfter Bonnie's pulled off the pole and laid on a table, there was a huge pool of blood under the table to show that Bonnie was actually bleeding out, but ABC wouldn't allow the crew to show it in the episode.\n\nOriginally, Danny was supposed to cry upon hearing that Bonnie had died.\n\nGoof: The amount of liquid in the banana bag never changes.\n\nGallery Edit\n\nEpisode Stills Edit\n\nQuotes Edit\n\nMeredith: How do you choose which one gets to live?\n\nAddison: So, have you made a decision yet, Dr. Stevens? Izzie: I'm sorry? Addison: Whether or not you're going to hate me. You're Meredith's friend? I'm the wicked witch who came in and ruined her life and cheated on Doctor...wait, what is it that you guys call him? Izzie: Uh— McDreamy... Addison: Right. God, doesn’t that embarrass him? Izzie: Yeah, I think it does. Addison: So, when you decide how important it is for you to hate me... Let me know.\n\nCristina: There you are. I've been looking everywhere for you. Burke: What is it? Cristina: I need to find this man's leg. The chief is going to kick me out of the program if I don't. I cannot go back to Los Angeles. It's sunny there. Every day. (Burke smiles) You're my boyfriend! I mean, I know I don't have much experience with this kind of thing, but aren't boyfriends supposed to help in situations like this? Burke: Cristina, when we're on duty, I can't be your boyfriend. Cristina: Okay, so when we're on duty, I can have sex with someone else? Burke: Dr. Yang, I'm walking away now.\n\nGeorge: Is there any way to operate without separating them? Derek: No. George: But if we move the pole ... Bailey: They'll both bleed out. Burke: What if we don't move the pole? What if we move one of the patients off the pole to get the saw in there? Then we can hold the pole steady in the other one. Move it very slowly and repair the damage as we go. George: Who? Which would you move? Burke: With her aortic injuries, her chances of survival are extremely slim no matter what we do. But if we move her, we have a real shot of saving him. Derek: Well, I could argue since her injuries are so extensive, we should move him. Give her the best shot we can. Meredith: So basically, whoever you move doesn't stand a chance? So how do you choose? How do you decide who gets to live?\n\nBonnie: Dr. Shepherd, I don't know about Tom here, but I didn't expect to be walking out of here anytime soon, so if there's something you need to say, please just say it. Derek: Okay, Bonnie. In order to operate on Mr. Maynard, we have to separate you two. In order to do that, we have to move you backwards off the pole. Tom: Can't you just pull the pole out of both of us? Burke: No. If we did that, both of you would start bleeding very quickly. Too quickly. Right now, the pole is blocking your injuries. Once removed, your organs will shift. Bonnie: So if you move me off the pole, I'll die? Derek: We're going to do everything we can … Tom: No! No, if anyone has to go, it should be me, so you just move me … Burke: Mr. Maynard, your injuries are less extensive than Miss Crasnoff's. If we operate around the pole, you have a better chance of surviving. Tom: It's not right. It's not fair! Bonnie: Tom, it's not fair either way.\n\nBonnie: Do you believe in Heaven? Tom: Yes. Do you? Bonnie: I want to.\n\nDerek: Dr. Grey. Bailey: Dr. Grey needs to get herself a blood alcohol test before practicing any medicine tonight. Meredith: What? No, I'm totally fine. Look. Totally fine. Derek: Right, okay. Meredith: I'm fine! Bailey: Regretting that last shooter about now, aren't you?\n\nMeredith: You operated on a heart earlier, George. You'd think you could draw a little blood. George: I rocked that heart. Meredith: Yeah, you did!\n\nSee Also Edit\n\nA complete overview of this episode's crew can be found here.", "images": ["https://vignette.wikia.nocookie.net/greysanatomy/images/d/d5/%22Blood_and_Peanut_Butter%22_-_B.C._Camplight/revision/latest/scale-to-width-down/248?cb=20141109034014", "https://vignette.wikia.nocookie.net/greysanatomy/images/1/1e/%22Back_Where_I_Was%22_-_The_Hereafter/revision/latest/scale-to-width-down/248?cb=20141109034121", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/89/Wiki-wordmark.png/revision/latest?cb=20190621202210", "https://slot1-images.wikia.nocookie.net/__cb1586963839864/common/skins/common/images/magnify-clip.png", "https://vignette.wikia.nocookie.net/greysanatomy/images/6/6c/2x06-14.jpg/revision/latest/scale-to-width-down/209?cb=20150128101452", "https://vignette.wikia.nocookie.net/greysanatomy/images/0/08/2x06-7.jpg/revision/latest/scale-to-width-down/350?cb=20140207135341", "https://vignette.wikia.nocookie.net/greysanatomy/images/1/19/2x06-12.jpg/revision/latest/scale-to-width-down/209?cb=20140207135258", "https://vignette.wikia.nocookie.net/greysanatomy/images/f/f0/2x06-6.jpg/revision/latest/scale-to-width-down/209?cb=20140207135354", "https://vignette.wikia.nocookie.net/greysanatomy/images/0/08/2x06-7.jpg/revision/latest/scale-to-width-down/2000?cb=20140207135341", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/32/%22The_City_Lights%22_-_Umbrellas/revision/latest/scale-to-width-down/248?cb=20141109034205", "https://vignette.wikia.nocookie.net/greysanatomy/images/d/d2/2x06-2.jpg/revision/latest/scale-to-width-down/185?cb=20140207135421", "https://vignette.wikia.nocookie.net/greysanatomy/images/0/08/2x06-7.jpg/revision/latest/scale-to-width-down/209?cb=20140207135341", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/8a/2x06-3.jpg/revision/latest/scale-to-width-down/185?cb=20140207135414", "https://vignette.wikia.nocookie.net/greysanatomy/images/e/e1/2x06-1.jpg/revision/latest/scale-to-width-down/209?cb=20140207135434", "https://vignette.wikia.nocookie.net/greysanatomy/images/f/f8/2x06-11.jpg/revision/latest/scale-to-width-down/209?cb=20140207135309", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/greysanatomy/images/e/e3/%22Today_Has_Been_Okay%22_-_Emil%C3%ADana_Torrini/revision/latest/scale-to-width-down/248?cb=20141109034240", "https://vignette.wikia.nocookie.net/greysanatomy/images/1/15/2x06-5.jpg/revision/latest/scale-to-width-down/209?cb=20140207135402", "https://vignette.wikia.nocookie.net/greysanatomy/images/c/c8/2x06-13.jpg/revision/latest/scale-to-width-down/212?cb=20150128101400", "https://vignette.wikia.nocookie.net/greysanatomy/images/7/7f/2x06-4.jpg/revision/latest/scale-to-width-down/209?cb=20140207135408", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/3d/2x06-10.jpg/revision/latest/scale-to-width-down/209?cb=20140207135317", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/28/2x06-8.jpg/revision/latest/scale-to-width-down/209?cb=20140207135331", "https://vignette.wikia.nocookie.net/greysanatomy/images/a/a7/2x06-9.jpg/revision/latest/scale-to-width-down/209?cb=20140207135323"], "top_img": "https://vignette.wikia.nocookie.net/greysanatomy/images/0/08/2x06-7.jpg/revision/latest/scale-to-width-down/2000?cb=20140207135341", "keywords": [], "authors": [], "canonical_link": "https://greysanatomy.fandom.com/wiki/Into_You_Like_a_Train", "title": "Into You Like a Train", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Grey's Anatomy Universe Wiki,greysanatomy,Into You Like a Train,Bring the Pain,Krista Vernoff,Jeff Melman,Something to Talk About,Meredith Grey,Season 2 (Grey's Anatomy),Grey's Anatomy,Radiology,Ellen Pompeo,Sandra Oh", "description": "Into You Like a Train is the sixth episode of the second season and the 15th overall episode of Grey's Anatomy. A train crash brings in many patients to Seattle Grace, including Meredith, who is too drunk to work; while the rest of the interns face their own professional crashes as Cristina...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://greysanatomy.fandom.com/wiki/Into_You_Like_a_Train", "title": "Into You Like a Train | Grey's Anatomy Universe Wiki | Fandom", "description": "Into You Like a Train is the sixth episode of the second season and the 15th overall episode of Grey's Anatomy. A train crash brings in many patients to Seattle Grace, including Meredith, who is..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Grey's Anatomy Universe Wiki", "title": "Into You Like a Train", "description": "Into You Like a Train is the sixth episode of the second season and the 15th overall episode of Grey's Anatomy. A train crash brings in many patients to Seattle Grace, including Meredith, who is too drunk to work; while the rest of the interns face their own professional crashes as Cristina searches the entire hospital in search of a foot for the Chief; Izzie is unsure how to react around Addison and Meredith, George, Bailey, Derek, and Burke treat two strangers impaled on a pole, all the...", "url": "https://greysanatomy.fandom.com/wiki/Into_You_Like_a_Train", "image": "https://vignette.wikia.nocookie.net/greysanatomy/images/0/08/2x06-7.jpg/revision/latest/scale-to-width-down/2000?cb=20140207135341"}, "apple-itunes-app": "app-id=1002364550, app-arguments=https://greysanatomy.fandom.com/wiki/Into_You_Like_a_Train"}, "movies": [], "publish_date": null, "source": "https://greysanatomy.fandom.com", "summary": ""}