{"url": "https://www.buzzfeed.com/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl", "text": "Share On more Share On more\n\nThe CW\n\n1. Long before they played star-crossed lovers Dan and Serena, Penn Badgley and Blake Lively were home \\schooled together as children. 2. Lively and Penn also dated in real life from 2007 to 2010. 3. Penn Badgley was named after the tennis ball company Penn. 4. At age 12, before he got into acting, Badgley recorded a pop single (that was never released). 5. Taylor Momsen's first role at age 7 was as Cindy Lou Who in How the Grinch Stole Christmas. 6. One year later, at 8 years old, Momsen wrote a song called \"Blackout\" that was recorded and released by Heidi Montag many years later.\n\nThe CW\n\n7. Leighton Meester dyed her naturally blonde hair brunette before she even auditioned for the part of Blair. 8. The project was originally supposed to be a movie and Lindsay Lohan was slated to play Blair. 9. Serena's full name is Serena Celia van der Woodsen. The author of the book series is named Cecily von Ziegesar. 10. There's a Manga version of the Gossip Girl book series. 11. Ed Westwick, who plays Chuck, originally auditioned for the role of Nate. 12. Producers didn't want Ed Westwick for either role at first because they said he \"looked more like a serial killer than a romantic lead.\" 13. Ed Westwick's actual favorite movie is American Psycho.\n\nThe CW\n\n14. You can't actually sit on the steps of the Met. 15. Penn Badgley was about to quit acting when he got the role of Dan. He turned it down twice before he was convinced to take it. 16. Westwick, who is British, modeled Chuck Bass' American accent on the character Carlton Banks from The Fresh Prince of Bel-Air. 17. Blair is a Scorpio. Serena is a Leo. 18. In Season 2, Serena is shown to have a Myspace profile, where she posts photos of her trip to Buenos Aires. ( Her user name is ServdW.) 19. The exterior shots of the Humphrey loft are shot in Dumbo, but the pilot episodes mentions that they live in Williamsburg.\n\nThe CW\n\n20. The Humphrey's address, which is given as 455 Water St., is actually the address of a park in lower Manhattan. 21. At the beginning of the show, Serena and Chuck both live at 455 Madison Ave. (aka The Palace Hotel). 22. After they left the palace, the van der Woodsens moved to the Milan Condominium building at 300 East 55th St., which is a real building. 23. A Three-bedroom penthouse at the Milan Condominiums is listed for $6.8 million. 24. After the New York Magazine Reality Index (a recap that rated the accuracy of NYC locations and character behavior) pointed out the Dumbo-Williamsburg confusion, the producers responded that after the pilot, the Humphreys simply say they live in Brooklyn. 25. Though the Humphrey children are considered less popular and wealthy since they are from \"Brooklyn,\" the average price for real estate per square foot on both the Upper East Side and Dumbo is around $1,400.\n\nThe CW\n\n26. Many of the cast, crew, and writers read the Reality Index religiously, and things like Serena's notorious Cleavage Rhombus kept reappearing in the show. 27. Costume designers modeled Blair's look after Audrey Hepburn and Serena's after Sienna Miller and Kate Moss. 28. Mischa Barton was offered the role of Georgina Sparks but she turned it down. 29. Lily's name was originally going to be \"Darla,\" but the producers changed it at the last minute. 30. There was a rumor that Jenny was going to have a spin-off show when she went to boarding school, but instead Taylor Momsen left the show to pursue her music career.\n\nThe CW\n\n31. Katie Cassidy, who played Serena's nemesis and Nate's girlfriend Juliet Sharp, is the daughter of David Cassidy from The Partridge Family. 32. In the show, Chuck has a pet dog named Monkey. In the books, Chuck has an actual monkey for a pet. 33. Cecily von Zeigler liked all the silver-screen adaptations of her characters except Vanessa. In the book she is bald and wears all black. 34. Producers spent anywhere from $10,000 to $60,000 per day for filming locations in NYC. 35. Gossip Girl was one of the first shows whose DVR and iTunes numbers were higher than actual viewing numbers. 36. When the show was criticized by the Parent Television Council for being \"mind-blowingly inappropriate\" and \"every parent's nightmare,\" those phrases were used in promotional posters.\n\nThe CW\n\n37. Matthew Settle and Kelly Rutherford, who play Rufus and Lily, once dated in real life. 38. The failed pilot for a spin-off of Lily and her sister, which starred Brittany Snow as a younger Lily, would have also contained younger versions of characters from The O.C. (which was also produced by Stephanie Savage and Josh Schwartz), linking the two worlds. 39. Off screen, the worlds are linked: Leighton Meester is married to Adam Brody, who played Seth Cohen, in real life. 40. Zuzanna Szadkowski, who plays Blair's housekeeper Dorota, graduated from Barnard College; Blair went to Columbia (after transferring from NYU). 41. There was a mini-series of webisodes starring Szadkowski, called Chasing Dorota, about Dorota and her friendship with Nate's British housekeeper Jane and Chuck's Russian housekeeper Larussa. 42. The Empire Hotel that Chuck owned is a real hotel. 43. After fans swarmed the hotel, the bar at The Empire started serving Gossip Girl-themed cocktails, including an \"XOXO\" cocktail with secret ingredients that they'll never tell.\n\nThe CW\n\n44. Costume designer Eric Daman previously won an Emmy for his costume design on Sex and the City. 45. Since most fans couldn't afford to buy the high-end designer brands that the characters wore, Daman teamed up with Charlotte Russe to create a Gossip Girl-inspired line. 46. Blake Lively was fitted for Serena's wedding dress the day after her actual wedding to Ryan Reynolds. 47. Jan. 26 is officially \"Gossip Girl Day\" in New York, declared by then-Mayor Michael Bloomberg who visited the set and praised how it showcased the city. 48. William Baldwin, who played Serena's dad William, avoided meeting Lively until filming so they could easily portray a strained relationship. 49. A fan once snuck onto the set at the Waldorf-Astoria Hotel and was mistaken for an extra. 50. The location that was used for Constance Billard is actually the Museum of the City of New York.\n\nWarning: Major spoilers below. The CW", "images": ["https://img.buzzfeed.com/buzzfeed-static/static/2014-09/20/11/enhanced/webdr05/longform-original-30655-1411226002-4.jpg", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/20/11/enhanced/webdr04/longform-original-22553-1411227678-17.jpg", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/20/10/enhanced/webdr04/enhanced-31292-1411223408-9.jpg?downsize=700%3A%2A&output-quality=auto&output-format=auto&output-quality=auto&output-format=auto&downsize=360:*", "https://img.buzzfeed.com/buzzfeed-static/static/2014-11/25/14/campaign_images/webdr12/54-things-you-probably-didnt-know-about-gossip-gi-2-10648-1416943113-4_dblbig.jpg", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/20/11/enhanced/webdr11/longform-original-21575-1411226423-3.jpg", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/18/16/enhanced/webdr09/enhanced-buzz-wide-19862-1411071058-18.jpg?downsize=700%3A%2A&output-quality=auto&output-format=auto&output-quality=auto&output-format=auto&downsize=360:*", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/18/16/enhanced/webdr09/enhanced-buzz-20619-1411071092-9.jpg", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/18/16/enhanced/webdr11/enhanced-buzz-14541-1411071002-25.jpg", "https://www.facebook.com/tr?id=260954170738952&ev=PageView&noscript=1", "https://pixiedust.buzzfeed.com/v1.gif?source=buzz_web&platform=bpager&type=instrumentation&target=javascript&value=disabled", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/18/16/enhanced/webdr05/enhanced-buzz-30191-1411072378-18.jpg", "https://img.buzzfeed.com/buzzfeed-static/static/2019-05/1/11/user_images/buzzfeed-prod-web-01/jessicaprobus-v2-30974-1556724722-0_large.jpg?downsize=60:*&output-format=auto&output-quality=auto", "https://img.buzzfeed.com/buzzfeed-static/static/2014-09/20/11/enhanced/webdr08/longform-original-25174-1411226390-6.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://img.buzzfeed.com/buzzfeed-static/static/2014-11/25/14/campaign_images/webdr12/54-things-you-probably-didnt-know-about-gossip-gi-2-10648-1416943113-4_dblbig.jpg", "keywords": [], "authors": ["Buzzfeed Staff"], "canonical_link": "https://www.buzzfeed.com/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl", "title": "54 Things You Probably Didn't Know About \"Gossip Girl\"", "meta_data": {"copyright": "Copyright BuzzFeed, Inc. All rights reserved.", "viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "referrer": "unsafe-url", "bf": {"buzzid": 3450379, "userid": 1273705}, "description": "\"Hey Upper East Siders...\"", "title": "54 Things You Probably Didn't Know About \"Gossip Girl\"", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "BuzzFeed", "theme-color": "#ee3322", "robots": "all", "author": "Jessica Probus", "pin": {"media": "https://img.buzzfeed.com/buzzfeed-static/static/2014-11/25/14/campaign_images/webdr12/54-things-you-probably-didnt-know-about-gossip-gi-2-10648-1416943113-4_dblbig.jpg", "description": "54 Things You Probably Didn't Know About \"Gossip Girl\""}, "fb": {"smart_publish": {"robots": "noauto"}, "app_id": 862012947269736}, "article": {"tag": "trivia", "section": "Style", "publisher": "https://www.facebook.com/BuzzFeed", "content_tier": "free", "opinion": "false"}, "og": {"url": "https://www.buzzfeed.com/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl", "site_name": "BuzzFeed", "image": "https://img.buzzfeed.com/buzzfeed-static/static/2014-11/25/14/campaign_images/webdr12/54-things-you-probably-didnt-know-about-gossip-gi-2-10648-1416943113-4_dblbig.jpg", "title": "54 Things You Probably Didn't Know About \"Gossip Girl\"", "description": "\"Hey Upper East Siders...\"", "type": "article"}, "twitter": {"app": {"id": {"iphone": 352969997, "ipad": 352969997, "googleplay": "com.buzzfeed.android"}, "url": {"iphone": "buzzfeed://buzz/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl", "ipad": "buzzfeed://buzz/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl", "googleplay": "https://www.buzzfeed.com/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl"}}, "site": "@asis", "creator": "@jessiprobus", "url": "https://www.buzzfeed.com/jessicaprobus/things-you-probably-didnt-know-about-gossip-girl", "title": "54 Things You Probably Didn't Know About \"Gossip Girl\"", "description": "\"Hey Upper East Siders...\"", "card": "summary_large_image", "image": "https://img.buzzfeed.com/buzzfeed-static/static/2014-11/25/14/campaign_images/webdr12/54-things-you-probably-didnt-know-about-gossip-gi-2-10648-1416943113-4_dblbig.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.buzzfeed.com", "summary": ""}