{"url": "http://www.cmt.com/news/1774498/nick-jonas-confesses-lifetime-crush-on-shania-twain/", "text": "Right around the time Shania Twain signed her first record deal in Nashville, a fan was born.\n\nLiterally. Nick Jonas, of Jonas Brothers fame, wasn’t born until 1992, just a few months before Twain released her debut album.\n\nAs the years flew by for the budding pop star, he told Billboard, he started to develop quite a crush on Twain. Starting with the first song he ever heard of hers, which was released when he was 5.\n\nTwain’s “Don’t Be Stupid (You Know I Love You)” came out in 1997, and Jonas says, “I remember the country-pop feel of the song was unlike anything else out there at the time, and I became a lifelong fan in that moment.”\n\nAnd while he was still practically a baby, he heard Twain’s “You’re Still the One.” And that did it for him.\n\n“I got the chance to see Shania’s Vegas show, and when she performed this song onstage with a white horse at her side, it really sealed the deal for me: Shania Twain, lifetime crush,” Jonas admitted.\n\nThen when Jonas was at the ripe old age of 6, Twain released “That Don’t Impress Me Much.”\n\n“Shania was always so incredible at making iconic visuals for her music, as well as being cutting-edge production-wise. This video and song are, in a word, legendary,” he said.\n\nThen right around the time of Jonas’ 10th birthday, there was “I’m Gonna Getcha Good!” That 2002 instant hit was one that Jonas loved so much, he and his older brothers Kevin and Joe covered it when they started their own pop band. The Jonas Brothers even performed it at concerts after they became huge stars.\n\n\n\n“I played drums and sang my favorite part, the pre-chorus, so the rest of the time I could rock out,” he said of their early arrangement of the song.\n\nTo round out his list of his five favorite Twain tunes, Jonas chose “Forever and For Always,” released when Jonas was still just 10.\n\n“This song has been a major source of inspiration to me melodically. Back in the day, my brothers and I would warm up to this with our band, getting our harmonies locked in before the show,” he said.", "images": ["http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:391201?width=1200&height=675&.jpg", "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:391201?quality=0.8&format=jpg&width=480&height=270"], "top_img": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:391201?width=1200&height=675&.jpg", "keywords": [], "authors": ["Alison Bonaguro"], "canonical_link": "http://www.cmt.com/news/1774498/nick-jonas-confesses-lifetime-crush-on-shania-twain/", "title": "Nick Jonas Confesses “Lifetime Crush” on Shania Twain", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0", "reporting": {"beacon_url": "http://mb.mtvnservices.com/data/collect/v1/mb.gif", "beacon_topic": "cmt.com"}, "ao": {"mgid": "mgid:wordpress:post:articles.cmt.com:1774498"}, "og": {"site_name": "CMT News", "title": "Nick Jonas Confesses \"Lifetime Crush\" on Shania Twain", "url": "http://www.cmt.com/news/1774498/nick-jonas-confesses-lifetime-crush-on-shania-twain/", "image": {"identifier": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:391201?width=1200&height=675&.jpg", "width": 1440, "height": 810}, "type": "article", "description": "Right around the time Shania Twain moved to Nashville and signed her first record deal, a fan was born. His name is Nick Jonas."}, "twitter": {"description": "Right around the time Shania Twain moved to Nashville and signed her first record deal, a fan was born. His name is Nick Jonas.", "title": "Nick Jonas Confesses \"Lifetime Crush\" on Shania Twain", "image": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:391201?quality=0.8&format=jpg&width=500&height=375", "url": "http://www.cmt.com/news/1774498/nick-jonas-confesses-lifetime-crush-on-shania-twain/", "card": "summary_large_image"}, "description": "Pop Star Lists His Favorite Shania Songs", "thumbnail": "http://cmt.mtvnimages.com/uri/mgid:file:http:shared:cmt.com/news/uploads/sites/3/2016/10/Shania-Cropped-Approved-3-1475535787-300x285.jpg?quality=0.8&format=jpg"}, "movies": ["https://www.youtube.com/embed/GMafzG4IPdw?feature=oembed"], "publish_date": null, "source": "http://www.cmt.com", "summary": ""}