{"url": "www.thehollywoodgossip.com/2017/08/katy-perry-disastrous-vmas-hosting-has-american-idol-producers-i/", "text": "Folks who didn't watch the VMAs on Sunday because they were too busy watching relatives bone on Game of Thrones or escaping rising floodwaters, answer this: What did you hear, after-the-fact, about Katy Perry?\n\nKaty Perry was the host, and she was just ... not overwhelming. No huge controversies, sure, but not even Katy's terrible opening monologue was especially memorable.\n\nThat's a problem for Katy, but it might be an even bigger problem for American Idol producers, who are reportedly very concerned that they're paying $25 million to Katy Perry to be a judge only for her to flop.\n\nOn Sunday, I had friends over, and they mentioned that traffic was especially slow near my home.\n\nWhy? Because American Idol auditions were in town.\n\nYes, in case you've managed to forget, American Idol is coming back, like some archetypal horde that people thought had been defeated.\n\nThe biggest stir of publicity about it is Katy Perry's salary of $25 million.\n\nDon't get us wrong, she's a big-time celebrity who's hosted the Superbowl, which is probably what the American Idol producers and the network were thinking when they hired her.\n\nWhat they clearly weren't thinking about:\n\nOne, that Katy Perry was singing for her Superbowl Halftime show, which is very different from sitting at a table and talking and judging.\n\nTwo, that Katy Perry was pretty famously upstaged at that show by Left Shark. You didn't forget Left Shark, did you?\n\nWell now, RadarOnline is reporting that ABC higher ups and American Idol showrunners are worried that they made a mistake by hiring Katy Perry to be a judge.\n\nIt sounds like they're panicking, actually.\n\nRadarOnline's source reports that her lackluster hosting over the weekend is what has them so concerned.\n\n\"They are paying her $25 million and she was a total dud [on the VMAs].\"\n\nYou might be wondering how they didn't catch it earlier, right?\n\nHere's how:\n\n\"No one ever auditioned her for the new Idol job and they are freaking out that they hired someone who is terrible on live television.\"\n\nOh dear!\n\nUsually, if you get a job without applying for it (or auditioning, in this case), it's because someone who's seen your work up close before (maybe a coworker or a former boss) is either doing the hiring or has vouched for you.\n\nIt sounds like Katy was just offered the gig, sight unseen.\n\nABC had already had concerns, RadarOnline had previously reported, that Katy Perry might upstage contestants.\n\n(Like Mariah Carey)\n\nOr that she might just need to tone down ... not her look, but her very attention-grabbing personality.\n\n(As far as we can tell, that's not a euphemism for her boobs)\n\nJudges are supposed to evaluate contestants, not overshadow them.\n\nNow, though, it sounds like ABC and American Idol are afraid that Katy's just going to fall flat like she did at the VMAs.\n\nJust because someone is good at singing and performing doesn't mean that they're good at talking on camera.\n\nSimilarly, like, just because someone's great at giving interview or interviewing people doesn't mean that they have a dazzling singing voice or would make an amazing performer.\n\nThis should be a lesson to us all, we suppose: make sure that you hire the best and most highly recommended babysitter or dog-walker or whatever. Not just the one who happens to be hot.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--xtPsCui2--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497116481/katy-perry-crying.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--xtPsCui2--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497116481/katy-perry-crying.jpg", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2017/08/katy-perry-disastrous-vmas-hosting-has-american-idol-producers-i/", "title": "Katy Perry: Disastrous VMAs Hosting Has American Idol Producers in a PANIC!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/08/katy-perry-disastrous-vmas-hosting-has-american-idol-producers-i/", "title": "Katy Perry: Disastrous VMAs Hosting Has American Idol Producers in a PANIC!", "description": "Katy Perry didn't do a great job of hosting the VMAs, which reportedly has ABC and American Idol afraid that they're wasting $25 million on a dud judge.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--hdgCM346--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1503871456/demi-lovato-wears-black.jpg", "type": "image/jpeg", "width": 630, "height": 875}}, "article": {"published_time": "2017-08-29T14:14:33-04:00", "modified_time": "2017-08-29T14:12:30-04:00", "tag": "MTV Video Music Awards", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Katy Perry: Disastrous VMAs Hosting Has American Idol Producers in a PANIC!", "description": "Katy Perry didn't do a great job of hosting the VMAs, which reportedly has ABC and American Idol afraid that they're wasting $25 million on a dud judge.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--xtPsCui2--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497116481/katy-perry-crying.jpg"}}, "description": "Katy Perry didn't do a great job of hosting the VMAs, which reportedly has ABC and American Idol afraid that they're wasting $25 million..."}, "movies": [], "publish_date": 1504030473.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}