{"url": "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/", "text": "Who will get into a screaming match? Who will mend friendships? Who will walk off set first? The Real Housewives of Orange County reunion part II is full of surprises…\n\nAndy Cohen begins round II, I mean part II, by addressing the black cloud that lingered over Shannon the whole season. We find out that Shannon’s maiden name is actually “STORM,” so it’s all starting to make sense why she was such an emotional curmudgeon this season. Oh and because her ex-husband is a total troll. Shannon’s flashbacks are uncomfortable and we are all reminded of the infamous “Quiet Woman” event, which in Housewives history, is, in my opinion, a close second to Teresa’s table flip. Finally, “that one,” aka Peggy, speaks out. Yawn. Peggy still won’t apologize, which means she is like every other housewife on this show and it is clear that Shannon and Peggy will never make amends. Your loss, Peg.\n\nWhen reviewing Meghan’s reel of the season, the major focus is of course on her baby daughter, Aspen. She is adorable, which is miraculous, since I have yet to catch a smile out of Mr. Personality Jim. Frankly, I don’t know what Meghan sees in Jimmy besides his boat loads of cash, but hey, there’s a lid to every pot… Meghan announces that she is expecting baby #2 – a little boy, which is super exciting, yet the women react as if Meghan was getting her left foot amputated.\n\nBesides the baby talk, Andy also drudges up the Meghan vs. Kelly incident. You all remember. The women went back and forth accusing each other’s husbands of cheating or having boyfriends. It was messy and hilarious all at the same time since the majority of the action took place as the ladies were dressed up in drag. Kelly keeps claiming that she thought the fight with Meghan was “done,” but silly Kelly must’ve forgotten that Real Housewives “done,” doesn’t really mean DONE. Thank God Andy steps in when he realizes the mistresses, cheating, and tweeting issues will never be resolved. But did he have to change gears to Peggy?!\n\nPeggy, the “Armenian Alexis Bellino,” does her best to clear up her side of the season. Everyone was still very confused about Peggy’s cancer and her double mastectomy. All of this cancer bickering is giving me PTSD about Brooks. All joking aside, I do begin to understand Peggy’s point of view when she clarifies that she had just lost her father AND had her mastectomy right before the filming started for the season. She said she wasn’t looking for sympathy from these women, just support (and maybe a casserole?).\n\nNext on the agenda, the Iceland trip. The women were actually boozing nonstop on that trip and I don’t blame them-it was light out 24/7! Andy calls Vicki out right away for having a blanket over her head whilst getting wheeled out on the stretcher. Vicki claims she did that because she looked a mess, but I think she was just paying an homage to Michael Jackson because, why not?\n\nAndy continues being awesome by referring to Kelly as “Dr. Feel Good,” since she was essentially drugging Vicki the entire trip. It’s so obvious why Vicki didn’t feel good! The lady basically had a Xanax and sizzurp supplied by her drug dealer, Kelly. Of course the infamous casserole was brought up because this may have been the first time Vicki finally got what she has been COMPLAINING about season after season.\n\nUpon reliving the Viking dinner, everyone gets treated to more forced apologies and unnecessary drama. Peggy, the lady in red, decided to show up to the feast, but it doesn’t end well. Andy continues to pour salt in the wound for Peggy when he asks about the “my dad beating up your dad” line Kelly spewed at Peggy. Peggy was definitely ultra sensitive due to the recent death of her dad and Kelly is still trying to make it clear that she did not mean it in a malicious way by stating it was a “euphemism, a metaphor!” Someone get this girl an English teacher! The more I hear Peggy explain, the more I truly do begin to understand. She had legit issues going on and she was frustrated with the made up drama these women were creating.\n\nThe inevitable Tamra and Vicki fight and make-up segment gets highlighted by Andy. It’s like Groundhog Day. They fight. Then they drink and cry and become sisters. And now, it seems like they’re back on the hating each other kick. Tamra cannot get over the fact that Vicki continues to spread rumors that Tamra’s husband Eddie is gay and I don’t blame her. That’s a low move, even for Vicki. In the words of Tamra, “ya hang out with f***ing dogs, ya get fleas.” Vicki claims that she is not homophobic (in fact, she can probably join Lydia on her “rainbow”) and that Tamra’s angry words are “not a good look.” Tamra reacts and says the line of the century to Vicki—“NOTHING LOOKS GOOD ON YOU”—and then she basically drops the mic. Naturally, Vicki storms off because, yay, drama!\n\nI thought Vicki said she wasn’t going back onto the set, yet, here is she again, seated on the couch. That didn’t last long! Basically, Vicki is an attention seeking woman who would do anything for her 15 minutes of fame. Her promises are as empty as my wine bottle after watching this reunion. Andy really lays on the cheese factor by asking, “Is it too much to ask for a little hug?” The hug goes from Tamra and Vicki to Tamra, Vicki, and Shannon. I adore Shannon’s face as Vicki fake snots on her shoulder. I caught that eye roll, girl.\n\nIn the midst of the love fest, Shan suggests they go get some shots because that’s how you celebrate friendship. Lydia is basically over the moon that everyone is getting along and she doesn’t have to have a prayer session. Peggy is confused, as always, Kelly is just worried about making it to her Bumble date on time, and by God, Lucy and Ethel LIVE ON! The cheesiness continues as Vicki hops on over to the sofa right between Tamra and Shannon (coincidence or is Vicki already moving in on Tamra and Shannon’s friendship?). The hand holding, the job offerings, the best friend bracelets- it’s all too much. But as Andy puts it, “it’s a great place to leave” the reunion. Until next season…..SKÁL! (In Shannon’s voice, obvi).\n\nPhoto Credit: Bravo TV\n\nTELL US – WHAT ARE YOUR THOUGHTS ON THE RECAP, THE REUNION, AND THE RHOC SEASON 12?", "images": ["https://realityblurb.com/wp-content/uploads/2020/04/Camille-Grammer-and-Lisa-Rinna-plus-Denise-Richards-and-Lisa-Vanderpump-400x284.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/retina-pin2k-logo-1.png", "https://realityblurb.com/wp-content/uploads/2018/12/Heather-and-Dr-Terry-Dubrow-e1545704197710-400x279.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/julia-m-120x120.jpeg", "https://realityblurb.com/wp-content/uploads/2020/03/Melissa-Gorga-Getting-Her-Mail-Photos-3-400x250.jpg", "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/ https:/realityblurb.com/wp-content/uploads/2019/02/social-facebook-pink.png", "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/ https:/realityblurb.com/wp-content/uploads/2019/02/social-twitter-pink.png", "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/ https:/realityblurb.com/wp-content/uploads/2019/02/social-pinterest-pink.png", "https://realityblurb.com/wp-content/uploads/2019/11/Shiva-Safai-new-boyfriend-Niels-Houweling-plus-Mohamed-Hadid-e1574892714519-400x283.jpg", "https://realityblurb.com/wp-content/uploads/2020/04/RHONY-Recap-Luann-de-Lesseps-and-Sonja-Morgan-400x278.jpg", "https://realityblurb.com/wp-content/uploads/2019/11/RHONJ-Joe-Giudice-and-Teresa-Giudice-News-400x281.jpg", "https://realityblurb.com/wp-content/uploads/2020/04/Shahs-of-Sunset-Reza-Farahan-amd-Mercedes-MJ-Javid-400x286.jpg", "https://realityblurb.com/wp-content/uploads/2017/11/rhoc-season-12-reunion-Vicki-Gunvalson-Tamra-Judge-Shannon-Beador-hug.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/white-logo1.png", "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/ https:/realityblurb.com/wp-content/uploads/2019/02/social-instagram-pink.png", "https://realityblurb.com/wp-content/uploads/2016/02/blurb-logo-1@2x.png", "https://realityblurb.com/wp-content/uploads/2016/02/retina-pin2k-logo-1B.png", "https://realityblurb.com/wp-content/uploads/2019/12/Kenya-Moore-News-Update-e1577372761358-400x289.jpg", "https://realityblurb.com/wp-content/uploads/2019/06/Kathryn-Dennis-plus-Thomas-Ravenel-News-400x263.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/feed-logo.png"], "top_img": "https://realityblurb.com/wp-content/uploads/2017/11/rhoc-season-12-reunion-Vicki-Gunvalson-Tamra-Judge-Shannon-Beador-hug.jpg", "keywords": [], "authors": [], "canonical_link": "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/", "title": "The Real Housewives of Orange County Recap: Season 12 Reunion Part 2", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "theme-color": "#db0a5b", "og": {"type": "article", "title": "The Real Housewives of Orange County Recap: Season 12 Reunion Part 2", "description": "Who will get into a screaming match? Who will mend friendships? Who will walk off set first? The Real Housewives of Orange County reunion part II is full of surprises…    Andy Cohen begins round II, I", "image": {"identifier": "https://realityblurb.com/wp-content/uploads/2017/11/rhoc-season-12-reunion-Vicki-Gunvalson-Tamra-Judge-Shannon-Beador-hug.jpg", "width": 800, "height": 533}, "url": "https://realityblurb.com/2017/11/28/real-housewives-orange-county-recap-season-12-reunion-part-2/", "site_name": "Reality Blurb", "updated_time": "2017-12-09T21:10:02-06:00"}, "article": {"publisher": "https://www.facebook.com/realityblurb", "published_time": "2017-11-28T06:58:23-06:00", "modified_time": "2017-12-09T21:10:02-06:00"}, "twitter": {"card": "summary_large_image", "title": "The Real Housewives of Orange County Recap: Season 12 Reunion Part 2", "description": "Who will get into a screaming match? Who will mend friendships? Who will walk off set first? The Real Housewives of Orange County reunion part II is full of surprises…    Andy Cohen begins round II, I", "image": "https://realityblurb.com/wp-content/uploads/2017/11/rhoc-season-12-reunion-Vicki-Gunvalson-Tamra-Judge-Shannon-Beador-hug.jpg"}, "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "generator": "WordPress 5.3.2", "google-site-verification": "KLs5Ahl3S2IZ7ied-aRAdTdpzpk7JE8c7coRSP72Ob8", "msapplication-TileImage": "https://realityblurb.com/wp-content/uploads/2016/02/cropped-Image1-300x300.jpg"}, "movies": [], "publish_date": 1511798400.0, "source": "https://realityblurb.com", "summary": ""}