{"url": "variety.com/2018/film/reviews/a-star-is-born-review-lady-gaga-bradley-cooper-1202922858/", "text": "“A Star Is Born” is that thing we always yearn for but so rarely get to see: a transcendent Hollywood movie. It’s the fourth remake of a story that dates back to 1932, but this one has a look and vibe all its own — rapturous and swooning, but also delicate and intimate and luminous. It’s set in the present day, but in spirit it’s a sophisticated retro ’70s drama built around the uncanny flow of feeling that develops between the movie’s two stars: Bradley Cooper, who plays Jackson Maine, a hard-drinking, bad-ol’-boy redneck rock ‘n’ roller who is still hanging on as a popular attraction but has lost the lust for what he’s doing, and Lady Gaga, in her fetching and accomplished movie-star debut, as Ally, an ingenuous, fresh-faced singer-songwriter who becomes his lover and stage partner before rocketing on her own into the new pop stratosphere.\n\nShe takes off as he slowly crashes — that’s the soapy tragic “Star Is Born” concept. But what the movie does is to take this fabled melodramatic romantic seesaw and turn it into something indelibly heartfelt and revealing. Cooper directed the movie himself, working from a script he co-wrote with Eric Roth and Will Fetters, and to say that he does a good job would be to understate his accomplishment. As a filmmaker, Bradley Cooper gets right onto the high wire, staging scenes that take their time and play out with a shaggy intimacy that’s shorn of the usual “beats.” The new “Star Is Born” is a total emotional knockout, but it’s also a movie that gets you to believe, at every step, in the complicated rapture of the story it’s telling.\n\nThe 1976 version, starring Barbra Streisand and Kris Kristofferson, had some terrific cornball love songs, but they didn’t belong anywhere near the stadium-rock stage, and neither did Streisand, which is part of why the movie came off as borderline ludicrous. It seemed stranded, with a kind of campy sincere ineptitude, between three worlds: Old Hollywood, New Hollywood, and Barbra Streisand rock-princess fantasy.\n\nBut from the electrifying opening moments of the new version, in which Jackson, boozy and raw, with his sunburned squint and hard-bitten shit-kicker sexiness, takes the stage of a gigantic stadium and launches into a grinding slow rocker that sounds like “Victim of Love”-era Eagles as done by the Allman Brothers, the movie is thrillingly authentic. That’s no minor accomplishment. Hollywood almost never succeeds in nailing the rock world, but “A Star Is Born,” though a love story through and through, is the most lived-in rock ‘n’ roll movie since “Almost Famous.” And that absolute looks right, sounds right, feels right verisimilitude sets the stage for everything that follows.\n\nJackson, who looks to be in his mid-40s, has been around long enough that he now occupies a grey zone between legend and nostalgia. He can still fill an arena full of screaming fans, and his old hits have become classic-rock chestnuts, but his sound and persona have long slipped out of the zeitgeist. His whole outlaw look — the beard and rancher’s hat, the Kristofferson-meets-Skynyrd soused macho twinkle — mark him as a charismatic relic, and the grand irony is this: What that look, and sound, are all about is an era when rock ‘n’ roll strutted its “authenticity,” but now that he’s out of date, Jackson’s authenticity looks more than ever like a showbiz conceit, frozen in amber. It’s a part he’s playing, an image he’s working — and secretly struggling — to keep alive. He’s got a signature ballad that goes “Maybe it’s time to let the old ways die,” and when he wrote it (long ago), he probably didn’t know that he was talking about himself.\n\nIn the first of many telling jump cuts, the film leaps from his on-stage glory to Jackson slinking into the back of his car, weary and alone, grabbing the bottle of gin he’s got stashed there. He takes a guzzle, and Cooper, acting with his body, lets you feel just how much Jackson (between sickly coughs) needs the lifeblood of that drink. It’s what he believes in more than the show he’s just finished.\n\nHow do you play a drunk? We know, of course, that the answer is not to “play drunk,” but Cooper doesn’t just avoid the usual slurry shambling (though at key moments he does a little of that too, and it’s powerful). He brings off something I’ve rarely seen done this exquisitely: He plays blitzed, very functional and in his element, his smile and reflexes greased by the liquor. Jackson speaks in a deep, low, deliberate Southern-stud growl — a voice with real music in it, though one that lets you taste all the booze it’s marinated in.\n\nNeeding another drink, he has his driver drop him off at the first available bar, which turns out to be a roadside dive on drag-queen karaoke night. It’s not his scene, but he doesn’t mind. He’s the same celebrity everywhere he goes, so he’s in the perfect mood of lit-up contentment when she walks on stage.\n\nShe is Ally, the one non-drag performer of the night (she’s friends with all the queens there, so they let her sing for real). When she enters the room, the movie pulls off a neat trick. We’ve already seen Ally break up with her boyfriend over the phone, letting out a banshee wail in the process, and when she appears in heavy white-make up and pasted on half-circle eyebrows, her hair teased into a punked-out French pastry, then does a strutting-down-the-bar version of “La Vie en Rose” that she milks for every flourish of theatrical kitsch she can, we think, “Of course! How Gaga-netic!” Backstage after the show, Jackson gently pulls off one of Ally’s eyebrows and asks her out for a drink.\n\nBut when she emerges from the dressing room minus all the Gaga trappings, we’re shocked to see a young woman with softly falling straight brown hair and the sweetest of chiclet-tooth grins, and this is the movie’s way of saying: Ladies and gentlemen, meet Lady Gaga, actress. A character we haven’t seen before.\n\nAlly, make no mistake, has sass to spare (later that evening, when Jackson is confronted by a troublemaker at his favorite cop bar, she gives him a punch), but Gaga, in an ebullient and winningly direct performance, never lets her own star quality get in the way of the character. Or, rather, she lets us see that star quality is something that lives inside Ally but is still waiting to come out (the way it was in the young Streisand of “Funny Girl”). Ally works as a waitress and lives with her dad, the Sinatra-fixated passive-aggressive Teddy bear Lorenzo (Andrew Dice Clay) in a modest suburban neighborhood, and she and Jackson strike an unforced connection. He can let down his guard around her, and his wistful melancholy starts to seep out.\n\nCooper has made a jaggedly tender love story that is never over-the-top, an operatic movie that dares to be quiet. Ally has something that Jackson recognizes because he used to have it too: the songwriter’s passion, the drive to take your own story and turn it into a jukebox poem. They have a great conversation about her Roman nose — which plays, knowingly, off the prejudices of the music industry that Gaga confronted on her way up. Ally thinks her nose is too big (or so she’s been told), but Jackson thinks it’s beautiful — and, of course, he’s right.\n\nHe listens to a song she wrote, and can tell that she’s got the gift, so after wooing her to one of his concerts, he suddenly brings her onstage to sing that song with him. It’s called “Shallow,” and when their voices melt together on the line “We’re far from the shallow now,” we melt along with them, and when Ally suddenly sends the song into a higher register, you will feel tingles rippling through your body. It’s an absolutely ecstatic moment, because it’s about the fusion of these two voices and souls, about Jackson coming back to life, about Ally realizing her destiny, and about the audience’s rediscovery of what romance in a movie can still be: a volt to the heart.\n\nDoes Jackson want Ally to become a star? Sort of. He’s the one who makes it possible, but after a video of their live duet goes viral, she’s approached after a show by a rock manager, Dez (Rafi Gavron), who gives her the I-can-make-you-a-star rap. Immediately, we know where this is going: to a place Jackson is not going to like. The manager represents the dissolution of Jackson’s sway over Ally, something the movie views in contemporary feminist terms. In his dissolute-rocker way, Jackson is grounded in the old male establishment, a place where Ally can be a “girl singer.” What he doesn’t realize is that she’s going to embrace stardom on her own terms, and they aren’t his.\n\nRafi Gavron’s terrific performance as Rez, the tough-love manager, is a great example of what’s so compelling about the new “Star Is Born.” We’ve seen this character — slick, British, corporate — before, and he’s always played as an insidious pest who symbolizes the big sellout. But that’s not the way Gavron plays him. He makes Rez a smart and compelling straight shooter, and the movie never caricatures him as a sleaze.\n\nInstead, it flips our expectations. Ally gets plugged into the 21st-century pop machine — high-dazzle robotic choreography, a new glam look with flaming red hair, the whole media swirl, complete with meticulously timed rollout performance on “Saturday Night Live” — and we realize that the film is playing off Lady Gaga’s own rise. The fascination of this is that instead of satirizing Ally’s journey as some sort of plunge into synthetic marketing decadence, the movie says, in essence: This is the new landscape, same as the old landscape. Next to Jackson’s world, it looks “inauthentic” (and viewers of a certain age may automatically view it that way), but Jackson’s world probably looked inauthentic to the generation before it. The movie says that in pop (as in life), it’s always time for the old ways to die, and for the new ways to be born.\n\nThat’s what Jackson can’t handle, and it’s why he drinks. Cooper has a couple of scenes in which Jackson gets sloppy and nasty: he “affectionately” smears Ally’s face with cake, and when she’s taking a bath, and he’s really sozzled, he starts to rag on her and even drops the U-word (“ugly”), which shocks us. But it’s part of the power of “A Star Is Born” that their relationship is never one-note; it’s tender, sexy, angry, jealous, and sad, all at the same time. It’s a real love, and could have stayed that way except that Jackson is too broken. The movie lets us touch his damage, body and soul: the hearing loss accompanied by tinnitus (which we hear on the soundtrack), the sense that going through the motions of stardom for too long has ground him to a weary nub. Sam Elliott, with white hair, his mopey bluntness sharper than ever, plays Jackson’s older brother, Bobby, who has been his road manager for years (but has had it with cleaning up after Jackson’s messes), and the two actors give their fights, and embraces, a deeply rooted sense of the past. They got a raw deal growing up with a drunken father, and they’re still playing it out.\n\nThe best version of “A Star Is Born” has always been the 1954 George Cukor version: moody, purplish, extravagant, driven by Judy Garland’s self-dramatizing fever. The scene you remember best from it, apart from Garland singing “The Man That Got Away,” is James Mason’s demented drunken slap of Garland during the Academy Awards — one of the most outrageous moments in movie history. In the new “Star Is Born,” Bradley Cooper pays homage to that moment, in a scene set at the Grammys, and actually tops it in outrageousness, in sick-joke masochistic power. And he does it convincingly. That’s part of the magnetic pull of this version — it, too, is a romance heightened by the cruel mirror of showbiz. Yet it has a naked humanity that leaves you wowed. These two people, the rising star and the fading star, are locked in a love as true as it is torn, and by the end of the movie they’ve both become us. “A Star Is Born” is a reminder of the scrappy grand passion that movies are all about.\n\nRELATED VIDEO:", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pmcvariety.files.wordpress.com/2018/08/asib-06030r221-e1536072536291.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2018/08/asib-06030r221-e1536072536291.jpg?crop=2px%2C0px%2C998px%2C562px&resize=681%2C383", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Freviews%2Fa-star-is-born-review-lady-gaga-bradley-cooper-1202922858%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202922858&comment_count=87", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://pmcvariety.files.wordpress.com/2018/08/asib-06030r221-e1536072536291.jpg?w=1000", "keywords": [], "authors": ["Owen Gleiberman"], "canonical_link": "https://variety.com/2018/film/reviews/a-star-is-born-review-lady-gaga-bradley-cooper-1202922858/", "title": "Film Review: ‘A Star Is Born’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Bradley Cooper and Lady Gaga are stunning together in Cooper's rapturous rock 'n' roll remake of a romantic saga that never gets old.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202922858, "author": "Owen Gleiberman", "pmc-category": "Reviews", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-08-31T10:15:18"}, "pmc-tag": "A Star Is Born,Bradley Cooper,Lady Gaga,Venice Film Festival", "title": "Film Review: ‘A Star Is Born’", "pageclass": "article", "pmc-vertical": "film,music", "pmc-primary-category": "Reviews", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Film Review: ‘A Star Is Born’", "url": "https://variety.com/2018/film/reviews/a-star-is-born-review-lady-gaga-bradley-cooper-1202922858/", "description": "“A Star Is Born” is that thing we always yearn for but so rarely get to see: a transcendent Hollywood movie. It’s the fourth remake of a story that dates back to 1932, but this one has …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/08/asib-06030r221-e1536072536291.jpg?w=1000", "width": 1000, "height": 562}, "locale": "en_US"}, "article": {"published_time": "2018-08-31T17:15:18+00:00", "modified_time": "2019-07-06T09:27:54+00:00"}, "twitter": {"creator": "@OwenGleiberman", "site": "@variety", "text": {"title": "Film Review: ‘A Star Is Born’"}, "image": "https://pmcvariety.files.wordpress.com/2018/08/asib-06030r221-e1536072536291.jpg?w=1000", "card": "summary_large_image", "title": "Film Review: ‘A Star Is Born’", "description": "Bradley Cooper and Lady Gaga are stunning together in Cooper's rapturous rock 'n' roll remake of a romantic saga that never gets old."}, "author": "Owen Gleiberman", "content_type": "Article", "post_id": 1202922858, "title": "Film Review: 'A Star Is Born'", "published_at": "2018-08-31 10:15:18", "image": "https://pmcvariety.files.wordpress.com/2018/08/asib-06030r221-e1536072536291.jpg?w=1000", "comment_count": 87, "tags": "Venice Film Festival", "topics": "Reviews", "appeared_in_print": "No", "body": "\"A Star Is Born\" is that thing we always yearn for but so rarely get to see: a transcendent Hollywood movie. It’s the fourth remake of a story that dates back to 1932, but this one has a look and vibe all its own — rapturous and swooning, but also delicate and intimate and luminous. It’s set in the present day, but in spirit it’s a sophisticated retro '70s drama built around the uncanny flow of feeling that develops between the movie’s two stars: Bradley Cooper, who plays Jackson Maine, a hard-drinking, bad-ol'-boy redneck rock 'n' roller who is still hanging on as a popular attraction but has lost the lust for what he’s doing, and Lady Gaga, in her fetching and accomplished movie-star debut, as Ally, an ingenuous, fresh-faced singer-songwriter who becomes his lover and stage partner before rocketing on her own into the new pop stratosphere.\r\n\r\nShe takes off as he slowly crashes — that’s the soapy tragic \"Star Is Born\" concept. But what the movie does is to take this fabled melodramatic romantic seesaw and turn it into something indelibly heartfelt and revealing. Cooper directed the movie himself, working from a script he co-wrote with Eric Roth and Will Fetters, and to say that he does a good job would be to understate his accomplishment. As a filmmaker, Bradley Cooper gets right onto the high wire, staging scenes that take their time and play out with a shaggy intimacy that’s shorn of the usual \"beats.\" The new \"Star Is Born\" is \r\n\r\nThe 1976 version, starring Barbra Streisand and Kris Kristofferson, had some terrific cornball love songs, but they didn’t belong anywhere near the stadium-rock stage, and neither did Streisand, which is part of why the movie came off as borderline ludicrous. It seemed stranded, with a kind of campy sincere ineptitude, between three worlds: Old Hollywood, New Hollywood, and Barbra Streisand rock-princess fantasy.\r\n\r\nBut from the electrifying opening moments of the new version, in which Jackson, boozy and raw, with his sunburned squint and hard-bitten shit-kicker sexiness, takes the stage of a gigantic stadium and launches into a grinding slow rocker that sounds like \"Victim of Love\"-era Eagles as done by the Allman Brothers, the movie is thrillingly authentic. That’s no minor accomplishment. Hollywood almost never succeeds in nailing the rock world, but \"A Star Is Born,\" though a love story through and through, is the most lived-in rock ‘n’ roll movie since \"Almost Famous.\" And that absolute looks right, sounds right, feels right verisimilitude sets the stage for everything that follows.\r\n\r\nJackson, who looks to be in his mid-40s, has been around long enough that he now occupies a grey zone between legend and nostalgia. He can still fill an arena full of screaming fans, and his old hits have become classic-rock chestnuts, but his sound and persona have long slipped out of the zeitgeist. His whole outlaw look — the beard and rancher’s hat, the Kristofferson-meets-Skynyrd soused macho twinkle — mark him as a charismatic relic, and the grand irony is this: What that look, and sound, are all about is an era when rock 'n' roll strutted its \"authenticity,\" but now that he’s out of date, Jackson’s authenticity looks more than ever like a showbiz conceit, frozen in amber. It’s a part he’s playing, an image he’s working — and secretly struggling — to keep alive. He’s got a signature ballad that goes \"Maybe it’s time to let the old ways die,\" and when he wrote it (long ago), he probably didn’t know that he was talking about himself.\r\n\r\nIn the first of many telling jump cuts, the film leaps from his on-stage glory to Jackson slinking into the back of his car, weary and alone, grabbing the bottle of gin he’s got stashed there. He takes a guzzle, and Cooper, acting with his body, lets you feel just how much Jackson (between sickly coughs) needs the lifeblood of that drink. It’s what he believes in more than the show he’s just finished.\r\n\r\nHow do you play a drunk? We know, of course, that the answer is not to \"play drunk,\" but Cooper doesn’t just avoid the usual slurry shambling (though at key moments he does a little of that too, and it’s powerful). He brings off something I’ve rarely seen done this exquisitely: He plays blitzed, very functional and in his element, his smile and reflexes greased by the liquor. Jackson speaks in a deep, low, deliberate Southern-stud growl — a voice with real music in it, though one that lets you taste all the booze it’s marinated in.\r\n\r\nNeeding another drink, he has his driver drop him off at the first available bar, which turns out to be a roadside dive on drag-queen karaoke night. It’s not his scene, but he doesn’t mind. He’s the same celebrity everywhere he goes, so he’s in the perfect mood of lit-up contentment when she walks on stage.\r\n\r\nShe is Ally, the one non-drag performer of the night (she’s friends with all the queens there, so they let her sing for real). When she enters the room, the movie pulls off a neat trick. We’ve already seen Ally break up with her boyfriend over the phone, letting out a banshee wail in the process, and when she appears in heavy white-make up and pasted on half-circle eyebrows, her hair teased into a punked-out French pastry, then does a strutting-down-the-bar version of \"La Vie en Rose\" that she milks for every flourish of theatrical kitsch she can, we think, \"Of course! How Gaga-netic!\" Backstage after the show, Jackson gently pulls off one of Ally’s eyebrows and asks her out for a drink.\r\n\r\nBut when she emerges from the dressing room minus all the Gaga trappings, we’re shocked to see a young woman with softly falling straight brown hair and the sweetest of chiclet-tooth grins, and this is the movie’s way of saying: Ladies and gentlemen, meet Lady Gaga, actress. A character we haven’t seen before.\r\n\r\nAlly, make no mistake, has sass to spare (later that evening, when Jackson is confronted by a troublemaker at his favorite cop bar, she gives him a punch), but Gaga, in an ebullient and winningly direct performance, never lets her own star quality get in the way of the character. Or, rather, she lets us see that star quality is something that lives inside Ally but is still waiting to come out (the way it was in the young Streisand of \"Funny Girl\"). Ally works as a waitress and lives with her dad, the Sinatra-fixated passive-aggressive Teddy bear Lorenzo (Andrew Dice Clay) in a modest suburban neighborhood, and she and Jackson strike an unforced connection. He can let down his guard around her, and his wistful melancholy starts to seep out.\r\n\r\nCooper has made a jaggedly tender love story that is never over-the-top, an operatic movie that dares to be quiet. Ally has something that Jackson recognizes because he used to have it too: the songwriter’s passion, the drive to take your own story and turn it into a jukebox poem. They have a great conversation about her Roman nose — which plays, knowingly, off the prejudices of the music industry that Gaga confronted on her way up. Ally thinks her nose is too big (or so she’s been told), but Jackson thinks it’s beautiful — and, of course, he’s right.\r\n\r\nHe listens to a song she wrote, and can tell that she’s got the gift, so after wooing her to one of his concerts, he suddenly brings her onstage to sing that song with him. It’s called “Shallow,” and when their voices melt together on the line \"We’re far from the shallow now,\" we melt along with them, and when Ally suddenly sends the song into a higher register, you will feel tingles rippling through your body. It’s an absolutely ecstatic moment, because it’s about the fusion of these two voices and souls, about Jackson coming back to life, about Ally realizing her destiny, and about the audience’s rediscovery of what romance in a movie can still be: a volt to the heart.\r\n\r\nDoes Jackson want Ally to become a star? Sort of. He’s the one who makes it possible, but after a video of their live duet goes viral, she’s approached after a show by a rock manager, Dez (Rafi Gavron), who gives her the I-can-make-you-a-star rap. Immediately, we know where this is going: to a place Jackson is not going to like. The manager represents the dissolution of Jackson’s sway over Ally, something the movie views in contemporary feminist terms. In his dissolute-rocker way, Jackson is grounded in the old male establishment, a place where Ally can be a \"girl singer.\" What he doesn’t realize is that she’s going to embrace stardom on her own terms, and they aren’t his.\r\n\r\nRafi Gavron’s terrific performance as Rez, the tough-love manager, is a great example of what’s so compelling about the new \"Star Is Born.\" We’ve seen this character — slick, British, corporate — before, and he’s always played as an insidious pest who symbolizes the big sellout. But that’s not the way Gavron plays him. He makes Rez a smart and compelling straight shooter, and the movie never caricatures him as a sleaze.\r\n\r\nInstead, it flips our expectations. Ally gets plugged into the 21st-century pop machine — high-dazzle robotic choreography, a new glam look with flaming red hair, the whole media swirl, complete with meticulously timed rollout performance on \"Saturday Night Live\" — and we realize that the film is playing off Lady Gaga’s own rise. The fascination of this is that instead of satirizing Ally’s journey as some sort of plunge into synthetic marketing decadence, the movie says, in essence: This is the new landscape, same as the old landscape. Next to Jackson’s world, it looks \"inauthentic\" (and viewers of a certain age may automatically view it that way), but Jackson’s world probably looked inauthentic to the generation before it. The movie says that in pop (as in life), it’s always time for the old ways to die, and for the new ways to be born.\r\n\r\nThat’s what Jackson can’t handle, and it’s why he drinks. Cooper has a couple of scenes in which Jackson gets sloppy and nasty: he \"affectionately\" smears Ally’s face with cake, and when she’s taking a bath, and he’s really sozzled, he starts to rag on her and even drops the U-word (\"ugly\"), which shocks us. But it’s part of the power of \"A Star Is Born\" that their relationship is never one-note; it’s tender, sexy, angry, jealous, and sad, all at the same time. It’s a real love, and could have stayed that way except that Jackson is too broken. The movie lets us touch his damage, body and soul: the hearing loss accompanied by tinnitus (which we hear on the soundtrack), the sense that going through the motions of stardom for too long has ground him to a weary nub. Sam Elliott, with white hair, his mopey bluntness sharper than ever, plays Jackson’s older brother, Bobby, who has been his road manager for years (but has had it with cleaning up after Jackson’s messes), and the two actors give their fights, and embraces, a deeply rooted sense of the past. They got a raw deal growing up with a drunken father, and they’re still playing it out.\r\n\r\nThe best version of \"A Star Is Born\" has always been the 1954 George Cukor version: moody, purplish, extravagant, driven by Judy Garland’s self-dramatizing fever. The scene you remember best from it, apart from Garland singing \"The Man That Got Away,\" is James Mason’s demented drunken slap of Garland during the Academy Awards — one of the most outrageous moments in movie history. In the new \"Star Is Born,\" Bradley Cooper pays homage to that moment, in a scene set at the Grammys, and actually tops it in outrageousness, in sick-joke masochistic power. And he does it convincingly. That’s part of the magnetic pull of this version — it, too, is a romance heightened by the cruel mirror of showbiz. Yet it has a naked humanity that leaves you wowed. These two people, the rising star and the fading star, are locked in a love as true as it is torn, and by the end of the movie they've both become us. \"A Star Is Born\" is a reminder of the scrappy grand passion that movies are all about.\r\n\r\nRELATED VIDEO:", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1535735718.0, "source": "http://variety.com", "summary": ""}