{"url": "https://www.mercurynews.com/2017/05/04/nick-viall-reportedly-blames-chris-soules-and-peta-murgatroyd-for-his-dancing-with-the-stars-loss/", "text": "After Nick Viall and his pro partner Peta Murgatroyd were eliminated from “Dancing With the Stars” Monday night, he was clearly disappointed but his initial reaction seemed gracious.\n\nThe recent “Bachelor” star said the right things before the cameras, gushing about Murgatroyd and the whole “DWTS” experience, saying, “I had such an amazing time with Peta. She’s a fantastic partner; we had fun all the time.”\n\nBut behind the scenes it might have been a different story, with Viall reportedly attributing his failure to win enough votes from viewers to people and situations beyond his ballroom dance abiilty, according to the tabloid OK!\n\nViall felt that Murgatroyd, who gave birth earlier this year, didn’t give it her all. He also was telling other cast members that he thought he was facing backlash over the recent arrest of fellow “Bachelor” alum Chris Soules, a source told OK!\n\nSoules, who competed on Season 19 of “The Bachelor” in 2015, was arrested last week in connection with a truck crash in Iowa that killed a 66-year-old farmer. Soules has been charged with leaving the scene of a traffic fatality and is being investigated for possibly driving under the influence at the time of the crash.\n\n“He was not in a good mood after being eliminated and told cast members that he felt like Chris Soules’ incident had an impact on him,” an insider told OK! “Basically, he was blaming everyone else but himself.”\n\nThe OK! report didn’t mention that “Star Trek” legend William Shatner, a rabid, high-profile “Dancing WIth the Stars” fan, campaigned against Viall. Early in this season of the TV ballroom dance competition, Shatner took to Twitter to urge other viewers to vote Viall off the show.\n\nViall and Mugatroyd did an Argentine tango Monday night and received two nines and two eights from the judges, but it wasn’t enough to keep them in the competition.\n\nThe site Wellpaint said it looked like Murgatroyd put a lot into her performances with Viall — and her effort probably brought the two of them further in this highly competitive season than most fans expected.\n\nAfter Viall was eliminated, he called his loss a “bummer” before being asked about Soules, who was said to be a friend of his. He called it a “terrible situation.”\n\n“Obviously more than anything my heart goes out to the person who passed away and their family and I’m just praying for everyone involved,” he said, according to E! News.\n\nWhether Viall is bitter about the “Dancing With the Stars” exit, he has said that he’s ready to leave behind the world of reality TV for good.\n\n“My time in reality TV is probably done,” the 36-year-old told Life & Style Weekly. Instead he’s focused on launching a grooming line and spending more time with his “Bachelor” fiancee Vanessa Grimaldi.\n\n“Vanessa and I, we’re going to keep doing our thing,” he said. “Dancing’s over, that’s a bummer, but I’m really looking forward to the future and definitely spending more time with the business and Vanessa.”", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://www.mercurynews.com/wp-content/uploads/2017/05/viall.jpg?w=1024&h=838", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/04/146498_ejr_7569.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/05/viallvanessa.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "http://thumbnail.newsinc.com/32345478.sf.jpg", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/05/viall.jpg?w=1024&h=838", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/05/04/nick-viall-reportedly-blames-chris-soules-and-peta-murgatroyd-for-his-dancing-with-the-stars-loss/", "title": "Nick Viall reportedly blames Chris Soules and Peta Murgatroyd for his ‘Dancing With the Stars’ loss", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "While Nick Viall was gracious in his public statements about leaving 'Dancing With the Stars,' a report said he privately blamed Chris Soules and his pro partner Peta Murgatroyd for his loss.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Nick Viall reportedly blames Chris Soules and Peta Murgatroyd for his ‘Dancing With the Stars’ loss", "url": "https://www.mercurynews.com/2017/05/04/nick-viall-reportedly-blames-chris-soules-and-peta-murgatroyd-for-his-dancing-with-the-stars-loss/", "description": "While Nick Viall was gracious in his public statements about leaving ‘Dancing With the Stars,’ a report said he privately blamed Chris Soules and his pro partner Peta Murgatroyd for his…", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/05/viall.jpg?w=1024&h=838", "width": 1024, "height": 838}, "locale": "en_US"}, "article": {"published_time": "2017-05-04T15:41:40+00:00", "modified_time": "2017-05-05T00:52:34+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Nick Viall reportedly blames Chris Soules and Peta Murgatroyd for his ‘Dancing With the Stars’ loss"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/05/viall.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1493827200.0, "source": "https://www.mercurynews.com", "summary": ""}