{"url": "www.marthastewartweddings.com/635709/celebrity-reactions-to-royal-wedding", "text": "Image zoom Getty Images\n\nWhen it comes to Prince Harry and Meghan Markle's upcoming nuptials, celebrities really are just like us. A few Hollywood A-listers have started to make their royal wedding obsession known, starting with Charlize Theron.\n\nWhen an Entertainment Tonight reporter asked if she's been keeping up with the royal duo, she said, \"Oh my gosh, yes! I mean, everybody's excited about it, right? I think it's great.\" Theron's enthusiasm is personal-she famously spent an afternoon with Prince Harry during a charity polo event in 2011 (this connection led to false rumors that she'd received a royal wedding invite!). \"He's a great guy,\" she said of her friend. \"I don't know [Meghan Markle], but I know he has good taste, so I wish them the best…and I'll be watching!\"\n\nRELATED: 11 COMMONLY ASKED ROYAL WEDDING QUESTIONS-ANSWERED!\n\nTheron isn't the only celebrity to comment on the couple's upcoming union. Jason Sudeikis recently joked about knowing that the bride-to-be, who had a small role in his movie Horrible Bosses, would call Kensington Palace home someday. \"I saw it coming a mile away. I gotta be honest with you,\" he told Entertainment Tonight, of Markle's soon-to-be royal status. \"She was regal in that moment, and it seemed like she's only gotten better at it.\"\n\nComedy aside, Sudeikis revealed that Markle, who has since retired from acting, was a pleasure to work with. \"It was great. She was very sweet,\" he reflected. While he admitted that he probably won't be waking up at 7 a.m. on May 19 to watch his former co-star and her royal beau tie the knot, he did say that one member of his family will tune in. \"My mom will, I bet,\" he said.\n\nAnother fan of Markle's? Serena Williams, who was recently a bride herself. Entertainment Tonight just caught up with the tennis pro, and she shared her well wishes for the future spouse. \"I'm obviously super happy for her,\" the new mom shared. \"She's such a great girl and she is incredibly nice and I couldn't be happier for her.\" ET notes that Markle gushed about Williams on her now-deleted blog. \"She quickly became a confidante I would text when I was traveling, the friend I would rally around for her tennis matches, and the down to earth chick I was able to grab lunch with just a couple weeks ago in Toronto,\" she once wrote.\n\nSome stars are even turning to Markle for their own wedding inspiration! Cara Santana told Us Weekly that she's marrying \"across [the] pond.\" \"I'm taking a little cue from my old friend Meghan Markle,\" she explained. She's also certain that Markle's \"going to be a beautiful bride,\" and she'll \"be there in spirit\" by tuning in to watch the celebration on TV.\n\nAs if those fans aren't impressive enough, The Queen herself has spoken out. Helen Mirren (who famously played Queen Elizabeth II) is as enamored with Markle as the rest of them. \"I think she's been utterly gracious and elegant,\" she said in an Entertainment Tonight interview. \"I don't mean elegant in her clothes-of course she's elegant there, too. But elegant as a person.\" As for her view on the marriage? \"It will work wonderfully well,\" she predicted, stating that she's \"full of optimism.\"\n\nRELATED: A ROYAL EXPERT SHARES HIS PREDICTIONS FOR PRINCE HARRY AND MEGHAN MARKLE'S WEDDING\n\nFormer Spice Girl Mel B has been making royal wedding headlines ever since she suggested that she (and the rest of the '90s girl group) would be attending the nuptials. Though other band members have denied receiving an invite, Mel B hasn't stopped gushing about the duo. The reason? She and the prince go way back. \"We'd go over to their house and have peanut butter and jelly sandwiches,\" Mel B told Entertainment Tonight of her friendship with a young Harry. \"And we would have beans on toast.\" The singer connected with both of the princes after their father, Prince Charles, took them to the premier of Spice World.\n\nMel B might have history with Prince Harry, but former Suits actress Abigail Spencer feels the same way about the bride. \"I have known her for years before the show,\" Spencer said of meeting Meghan at an audition. \"We were born on the same day, hours apart, in the same year... she's a trusted friend and one of the most glorious people I have ever met.\" Spencer said that Markle is \"doing okay\" in the midst of wedding preparations-and that she already has her wedding present planned. \"I think what they would love is [for people] to donate to one of the charities that they are involved in,\" she said. \"That's where her heart is.\"\n\nAnother one of Markle's longtime friends, Priyanka Chopra (she's a confirmed royal wedding guest!), has also been vocal about the bride's dedication to activism-something, she says, makes her more than qualified for her royal role. \"I think she was born to be a global influencer and this has given her the opportunity to do that,\" Priyanka told Jenny McCarthy. \"I really feel like that's what she was born to do and I hope this gives her the opportunity do that.\" The Quantico actress revealed on the Rachael Ray Show, though, that Markle is still very much \"a girl's girl\" even with a royal wedding on the horizon, reported Entertainment Tonight. \"She still texts a lot, which is great!\" she explained, when asked about how the pals stay in touch.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2019%2F07%2F11210452%2Fwedding-guest-lindsey-william-wedding-dc-guests-bar-103039221_vert-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2019%2F07%2F11210526%2F2019-wedding-trends-trent-bailey-balloon-installations-lead-1218_vert-150x150.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20147'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2046&h=1071&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2017%2F11%2F12165840%2Fmeghan-markle-prince-harry-engaged-1117.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2019%2F07%2F11210422%2Fdiamonds-by-carat-intro-0718_vert-150x150.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2017%2F11%2F12165840%2Fmeghan-markle-prince-harry-engaged-1117.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2046&h=1071&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2017%2F11%2F12165840%2Fmeghan-markle-prince-harry-engaged-1117.jpg", "keywords": [], "authors": ["Sarah Schreiber"], "canonical_link": "https://www.marthastewartweddings.com/635709/celebrity-reactions-to-royal-wedding", "title": "Celebrities Are Just as Obsessed with the Royal Wedding as We Are", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "People, Fashion, Lifestyle, Entertainment, Cooking", "news_keywords": "People, Fashion, Lifestyle, Entertainment, Cooking", "description": "Charlize Theron just revealed that she's just as obsessed with the upcoming royal wedding as we are. Read on to discover what other celebrities, including Jason Sudeikis, Serena Williams, Cara Santana, and Helen Mirren are saying about Prince Harry and Meghan Markle's nuptials.", "og": {"title": "Celebrities Are Just as Obsessed with the Royal Wedding as We Are", "type": "article", "site_name": "Martha Stewart Weddings", "url": "https://www.marthastewartweddings.com/635709/celebrity-reactions-to-royal-wedding", "description": "No surprise here! It looks like everyone has royal wedding fever.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2046&h=1071&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2017%2F11%2F12165840%2Fmeghan-markle-prince-harry-engaged-1117.jpg", "width": 2046, "height": 1071}}, "pinterest": {"url": "https://www.marthastewartweddings.com/635709/celebrity-reactions-to-royal-wedding", "description": "Charlize Theron just revealed that she's just as obsessed with the upcoming royal wedding as we are. Read on to discover what other celebrities, including Jason Sudeikis, Serena Williams, Cara Santana, and Helen Mirren are saying about Prince Harry and Meghan Markle's nuptials.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2017%2F11%2F12165840%2Fmeghan-markle-prince-harry-engaged-1117.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://www.marthastewartweddings.com/635709/celebrity-reactions-to-royal-wedding", "title": "Celebrities Are Just as Obsessed with the Royal Wedding as We Are", "description": "Charlize Theron just revealed that she's just as obsessed with the upcoming royal wedding as we are. Read on to discover what other celebrities, including Jason Sudeikis, Serena Williams, Cara Santana, and Helen Mirren are saying about Prince Harry and Meghan Markle's nuptials.", "site": "@marthaweddings", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2046&h=1071&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F36%2F2017%2F11%2F12165840%2Fmeghan-markle-prince-harry-engaged-1117.jpg"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}}, "movies": [], "publish_date": null, "source": "http://www.marthastewartweddings.com", "summary": ""}