{"url": "https://www.bustle.com/p/what-is-jessica-capshaw-doing-after-greys-anatomy-arizona-fans-could-see-her-on-jane-the-virgin-9076530", "text": "Losing Arizona Robbins is a huge blow to the very fabric of Grey's Anatomy. The Season 14 finale will be Jessica Capshaw's last episode, and her iconic character that has withstood the test of time. Arizona's story definitely feels like it's been cut much too short of its true potential, but that just means Capshaw will be ready to take on even more new and exciting roles. So what is Jessica Capshaw doing after Grey's Anatomy?\n\nWhile it doesn't appear that she has any projects on the horizon just yet — at least as far as her IMDB page will divulge — she's already joking with some of TV's biggest names about what her next role will be. Capshaw tweeted to Jane The Virgin creator Jennie Urman in March, praising her work on that show, and Urman responded asking if she could write something for Capshaw next. \"From camp BFF's to comedy wranglers on television,\" Capshaw replied. \"YES PLEASE!\"\n\nSo, she's apparently open to new possibilities, and Capshaw's fans are eagerly awaiting whatever that next endeavor will be. \"I hope she finds something that makes her as happy and sunshine-y as [Grey's Anatomy] made her,\" Reddit user cattagatta wrote.\n\nTwitter is similarly buzzing with people calling for Arizona spinoffs and Capshaw leading roles.\n\nCapshaw hasn't really made a habit of juggling Grey's Anatomy with any other projects — she only has two other TV credits since joining the Grey's cast in 2009. But now that her schedule is less consumed by Grey's, she'll have time to take a look at what else the industry has to offer.\n\nShe's also got four children and a husband, whom she frequently features on her Instagram accounts, and she's proven that she's accustomed to having a lot on her plate. \"A lot of people, especially who are working moms, say it’s all about balance and trying to create a balance, and I respectfully disagree. I don’t know that any part of my day is ever balanced,\" Capshaw told Yahoo late last year. \"I don’t spend equal parts being mom or being a worker, being a wife, being an advocate, being a humanitarian, whatever it is that I am endeavoring to be.\"\n\nAs she mentioned, Capshaw is definitely an advocate — she's always sharing causes that are important to her, like ending gun violence and achieving pay equity. No matter where she goes from here, something tells me she'll be busy with something. And regardless of where her career goes, it's clear that her role as Arizona will always stay with her.\n\n\"I never would have imagined that I would be able to play a character that would feel like it does so much good, whether it’s people who feel like the character resonates with them and it makes their day a little easier to see themselves represented,\" she said in the same Yahoo interview. \"Or if it’s someone watching it who has someone in their life who is gay and they might have not understood it before and all of a sudden, they have another person or another thing to point to and say, ‘Oh that’s a different context.’ Being able to play a lesbian as a series regular on television has been enormously rewarding.\"\n\nThere's no denying Arizona has been a hugely inspiring figure on Grey's — she's wowed viewers with her passion for the tiny humans she's healed over the years, she remained resilient in the face of unimaginable hardship, and she was always a friend to those around her. The loss of both her and April will be hard, but it's far from the last we'll see of the actors behind them.", "images": ["https://imgix.bustle.com/uploads/image/2018/5/14/bf2cb37a-524b-4876-bcf0-956b6c1e138d-149228_3087.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/2/6c94a280-a101-44b0-81d8-dfdbd8a0ec54-154252_0794.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/8/6278aeea-0eb2-4325-8f2c-32eebd20b766-155070_0096.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/1df58b0f-7e97-4da7-b09c-01b0c86413a1-getty-1209315144.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/cb329524-dee2-4a00-8ec4-9662e0d787cb-155070_0114.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/14/bf2cb37a-524b-4876-bcf0-956b6c1e138d-149228_3087.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/14/bf2cb37a-524b-4876-bcf0-956b6c1e138d-149228_3087.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/what-is-jessica-capshaw-doing-after-greys-anatomy-arizona-fans-could-see-her-on-jane-the-virgin-9076530", "title": "What Is Jessica Capshaw Doing After 'Grey's Anatomy'? Arizona Fans Could See Her On 'Jane The Virgin'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/what-is-jessica-capshaw-doing-after-greys-anatomy-arizona-fans-could-see-her-on-jane-the-virgin-9076530", "type": "article", "title": "The 'Jane The Virgin' Creator Wants To Write A Role For 'Grey's' Star Jessica Capshaw", "description": "Losing Arizona Robbins is a huge blow to the very fabric of Grey's Anatomy. The Season 14 finale will be Jessica Capshaw's last episode, and her iconic character that has withstood the test of time. Arizona's story definitely feels like it's been…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/14/bf2cb37a-524b-4876-bcf0-956b6c1e138d-149228_3087.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Losing Arizona Robbins is a huge blow to the very fabric of Grey's Anatomy. The Season 14 finale will be Jessica Capshaw's last episode, and her iconic character that has withstood the test of time. Arizona's story definitely feels like it's been…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}