{"url": "https://www.washingtonpost.com/health/2018/09/05/gwyneth-paltrows-goop-touted-benefits-putting-jade-egg-your-vagina-now-it-must-pay/", "text": "For $66, one can buy a dark nephrite jade egg, which allegedly brings increased sexual energy and pleasure. Or, for $55, there is the “heart-activating” rose quartz egg, for those who want more positive energy and love. Until recently, a page on Goop's website promised that the eggs would “increase vaginal muscle tone, hormonal balance, and feminine energy in general.\"\n\nAD\n\nThose claims were, well, a stretch, with no grounding in real science, according to a consumer protection lawsuit filed by state prosecutors representing 10 California counties. On Wednesday, state officials and Goop announced that they had settled the suit, with Paltrow's company agreeing to pay $145,000 in civil penalties.\n\nAD\n\nSpecifically, the suit called out Goop's jade egg, its rose quartz egg and its “Inner Judge Flower Essence Blend” as products “whose advertised medical claims were not supported by competent and reliable science,” according to the Santa Clara County district attorney's office. For example, the flower essence blend had been marketed as a blend of essential oils that could ward off depression.\n\nAnd the jade eggs? They had developed a reputation — and a backlash — of their own. Last year, the Goop website published a Q&A with “beauty guru/healer/inspiration/friend Shiva Rose” touting the products under the headline “Jade Eggs for Your Yoni.” Rose described the use of the eggs as “an incredible, secret practice” by concubines in ancient Chinese temples.\n\nAD\n\n\"This practice is nearly as old as time — many find value in it, even if modern-day research hasn’t caught up yet (or the practice will never catch its attention),\" the page stated, simultaneously brushing off any critics and creating an aura of protective mysticism around the eggs. Further down in the Q&A, Rose recommends tips for maintaining a jade egg: “If you feel like it’s been drained of energy, recharge it in the full moon just the way you would a crystal.\"\n\nAD\n\nLast year, a California OB/GYN wrote a lengthy open letter to Paltrow, blasting the eggs and their purported benefits as “the biggest load of garbage I have read on your site since vaginal steaming.\"\n\n\"But hey, you aren’t one to let facts get in the way of profiting from snake oil,” Jen Gunter wrote. “The claim that they can balance hormones is, quite simply, biologically impossible. Pelvic floor exercises can help with incontinence and even give stronger orgasms for some women, but they cannot change hormones. As for female energy? I’m a gynecologist and I don’t know what that is!?\"\n\nGunter also warned that sleeping with a jade egg in one's vagina could lead to bacterial vaginosis or toxic shock syndrome — and that it was an equally bad idea to walk around with them inside.\n\nAD\n\n\"Overenthusiastic Kegel exercises or incorrectly done Kegel exercises are a cause of pelvic pain and pain with sex in my practice,” Gunter wrote. “Imagine how your biceps muscle (and then your shoulders and then your back) might feel if you walked around all day flexed holding a barbell? Right, now imagine your pelvic floor muscles doing this.\"\n\nAD\n\nIf Paltrow was moved by the professional medical advice, it wasn't reflected on Goop's website last year, which published a follow-up letter to the editor titled \"12 (More) Reasons to Start a Jade Egg Practice” that hit back at jade egg critics for “sexually shaming a woman for sharing her personal experience.\"\n\nA year later, the consumer protection lawsuit in California may have finally succeeded in persuading Goop to tone it down. Although the eggs are still available for sale on Goop's website, gone are the claims on the product pages themselves that they will balance hormones or regulate your menstrual cycles.\n\nAD\n\nAccording to California officials, those who purchased either of the eggs or the flower essence from Goop between Jan. 12 and Aug. 31 of last year are entitled to full refunds, if they contact customerservice@goop.com or 1-844-WTF-GOOP. (Yes, that is the real phone number.)\n\nAD\n\n“The health and money of Santa Clara County residents should never be put at risk by misleading advertising,” Santa Clara County District Attorney Jeff Rosen said in a statement. “We will vigilantly protect consumers against companies that promise health benefits without the support of good science … or any science.\"\n\nHowever, the Q&A with Rose and the letter to the editor recommending people start using jade eggs remain on Goop's website. Although not technically part of the product pages, the Q&A and other articles on Goop.com continue to claim that the eggs “cultivate sexual energy, clear chi pathways in the body, intensify femininity, and invigorate our life force. To name a few!” Disclaimers at the bottom of the articles, added before the settlement, states they are for informational purposes only and not intended to be a substitute for professional medical advice.\n\nAD\n\nAnd Goop maintained in a statement that the settlement does not indicate any liability on their part but, rather, an “honest disagreement” that the company wanted to settle “quickly and amicably.\"\n\nAD\n\n“Goop provides a forum for practitioners to present their views and experiences with various products like the jade egg. The law, though, sometimes views statements like this as advertising claims, which are subject to various legal requirements,” Goop chief financial officer Erica Moore said in a statement. “The [California Food, Drug and Medical Device Task Force] assisted us in applying those laws to the content we published, and we appreciate their guidance in this matter as we move from a pioneer in this space to an established wellness authority.\"\n\nThis isn't the first time Goop has drawn negative attention for dubious health claims about its serums, vitamins, crystals, “detox” regimens and other products. The nonprofit group Truth in Advertising has documented more than 50 examples of Goop claiming that the products it sells or promotes “can treat, cure, prevent, alleviate the symptoms of, or reduce the risk of developing a number of ailments, ranging from depression, anxiety, and insomnia, to infertility, uterine prolapse, and arthritis, just to name a few.\"\n\nAD\n\nAbout a third of those products — or simply their misleading claims — have since been taken down, the group reported.\n\nAD", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9deae4bf-86c8-4f49-8658-ce5f2f4b2a30.png&w=90&h=90", "https://www.washingtonpost.com/resizer/KeKOuQACDqWmhzjL2wdIztBNzpE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UOZE3NDOLYI6RNGY5L3Y2TCUJQ.jpg"], "top_img": "https://www.washingtonpost.com/resizer/KeKOuQACDqWmhzjL2wdIztBNzpE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UOZE3NDOLYI6RNGY5L3Y2TCUJQ.jpg", "keywords": [], "authors": ["Amy B Wang", "National Politics Reporter Covering Presidential Campaigns"], "canonical_link": "https://www.washingtonpost.com/health/2018/09/05/gwyneth-paltrows-goop-touted-benefits-putting-jade-egg-your-vagina-now-it-must-pay/", "title": "Gwyneth Paltrow’s Goop touted the ‘benefits’ of putting a jade egg in your vagina. Now it must pay.", "meta_data": {"description": "Paltrow's \"lifestyle brand\" must pay $145,000 in penalties as part of the settlement.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/health/2018/09/05/gwyneth-paltrows-goop-touted-benefits-putting-jade-egg-your-vagina-now-it-must-pay/", "image": "https://www.washingtonpost.com/resizer/KeKOuQACDqWmhzjL2wdIztBNzpE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UOZE3NDOLYI6RNGY5L3Y2TCUJQ.jpg", "title": "Gwyneth Paltrow’s Goop touted the ‘benefits’ of putting a jade egg in your vagina. Now it must pay.", "description": "Paltrow's \"lifestyle brand\" must pay $145,000 in penalties as part of the settlement."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Gwyneth Paltrow’s Goop touted the ‘benefits’ of putting a jade egg in your vagina. Now it must pay.", "description": "Paltrow's \"lifestyle brand\" must pay $145,000 in penalties as part of the settlement."}, "last_updated_date": "2018-10-23T18:31:06.714Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1536076800.0, "source": "https://www.washingtonpost.com", "summary": ""}