{"url": "https://www.inquisitr.com/4117935/second-wives-club-e-reality-show-sued-by-husband-claiming-fakery-hollywood-cast-premieres-may-4-video/", "text": "When the 1992 novel called The First Wives Club by Olivia Goldsmith hit bookshelves, it was such a success that it was turned into a 1996 comedy film. The book and movie were similar to the unique situation of “starter wives” like Justine Musk, the ex-wife of Elon Musk, as reported by Marie Claire. Wives who are in the club of first wives have unique issues, sometimes commiserating over being replaced for a “younger model,” with their ex-husbands supposedly “upgrading” as if to a McMansion. Now those women who the men have run to have their own little club, aptly named the Second Wives Club.\n\nOn E!, there’s a new show displaying the Hollywood-based Second Wives Club, even if all of the women featured on Second Wives Club aren’t really all wives, nor are they all “second” wives. Some of them are wife No. 3 or wife No. 5, not wife No. 2. With the brand new Second Wives Club series set to air on Thursday, May 4, at 9 p.m. ET/8 p.m. CT, the following preview videos have been released, giving a snippet of what to expect.\n\nAlthough some of the women featured in the Second Wives Club reality TV show might have plenty of material items, or at least pretend they do, the mansions, haute couture wardrobes, champagne fridges inside of luxury cars and more don’t mean they are all leading happy lives, as seen in the below E! trailer for the Second Wives Club released recently.\n\nAs reported by the Daily Mail, it has taken some time for the Second Wives Club to come to fruition.\n\nThe Second Wives Club began filming in 2015, and since that time has undergone a title change and then gone back to the Second Wives Club title. The show has even experienced lawsuit threats over one marriage featured in the Second Wives Club.\n\nThe stars of the Second Wives Club are Tania Mehra, Morisa Surrey, Shawna Craig, Shiva Safai, Katie Cazorla and Veronika Obeng. Cazorla is pictured above, showing off her manicure and fancy rings.\n\nMohammed Hadid's fiancee stars in first trailer of Second Wives Club https://t.co/RsDTjSBPJ8 via @DailyMailCeleb — Brightly (@Brightly5) March 24, 2017\n\nSafai’s fiance is 68-year-old Mohamed Hadid, who has been married two times before. One of those famous ex-wives of Hadid was Yolanda Hadid of Real Housewives Of Beverly Hills fame. Mohamed is 32 years older than Safai.\n\nBronzed⚡️ A post shared by shivasafai (@shivasafai) on Apr 1, 2017 at 2:25pm PDT\n\nShiva brags about the luxurious life the women of the Second Wives Club live in the trailers.\n\n“The luxury of the life we live is amazing. We have amazing homes. I’m not sure how many bedrooms, but I really think we have 11…I think.”\n\nShiva reminds her husband-to-be, when he asked what he can do to make her happy, that he can let her know when exactly they are going to get married.\n\n“You could let me know if we’re ever going to get married?”\n\nThe women of the Second Wives Club at times express their fears, knowing that second wives can be replaced with third wives and so on. As witnessed through the series, some of the women are in the process of going through a divorce whilst others are enjoying being second wives.\n\nThe Second Wives Club features Veronika Obeng, who is married to Dr. Michael K. Obeng, a Los Angeles plastic surgeon who wasn’t very happy that his third wife appeared on the Second Wives Club. Dr. Michael Obeng sued E! as the reality TV show was filmed and Veronika filed for divorce in 2016. According to Dr. Obeng’s lawsuit, the Second Wives Club featured fake situations and forced participants to get into fake disputes.\n\n“[The Second Wives Club] constantly staged Plaintiff in artificial situations and demanded Plaintiff to engage in conflicts that were often fraudulent and deceptive.”\n\nShawna Craig is wife No. 5 for Lorenzo Lamas, and is featured on the show.\n\nMorisa Surrey is another member of the Second Wives Club, with the new mother married to Dr. Mark Surrey.\n\n[Featured Image by Frederick M. Brown/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/04/second-wives-club.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/7a18db45c9405ae51d93642e54fd02be?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Paula Mooney"], "canonical_link": "https://www.inquisitr.com/4117935/second-wives-club-e-reality-show-sued-by-husband-claiming-fakery-hollywood-cast-premieres-may-4-video/", "title": "‘Second Wives Club’ E! Reality Show Sued By Husband Claiming Fakery: Hollywood Cast Premieres May 4 [Video]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/CsFkwhCwF8M?feature=oembed", "https://www.youtube.com/embed/AB3WWgDtzr0?feature=oembed"], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}