{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/02/hoda-kotb-replaces-matt-lauer-on-today-and-makes-history-in-the-process/", "text": "NBC News Chairman Andy Lack announced the news, which means that, for the first time, “Today” is led by female hosts.\n\nsavannah and hoda - historic and so deserved\n\n\n\none more step in what i believe will the hallmark of the 21 century\n\n\n\nwomen hv full parity — Tom Brokaw (@tombrokaw) January 2, 2018\n\n“I’m pinching myself,” Kotb said to Guthrie on air. “There’s no one I’d rather be sitting next to in 2018 than you.”\n\nLauer’s departure came amid an avalanche of reports on sexual misconduct allegations against high-profile men in entertainment and media. Kotb took over the co-anchoring duties on Nov. 29, hours after Lack had dismissed Lauer for “inappropriate sexual behavior.” At the time, the NBC News chairman said in a memo that the company had received a “detailed complaint” that represented “a clear violation of our company’s standards.”\n\nAD\n\nAD\n\n“While it is the first complaint about his behavior in the over twenty years he’s been at NBC News, we were also presented with reason to believe this may not have been an isolated incident,” Lack added.\n\nHours later, Variety published a report detailing allegations by multiple women that Lauer had sexually harassed them in the workplace.\n\n“Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed,” the former TV host said in a statement.\n\nSuddenly, NBC News was without its high-profile co-anchor. But Kotb and Guthrie have shown that “Today” didn’t need Lauer for ratings. “Today” beat rival “Good Morning America” on ABC for weeks after his firing.\n\n“Over the past several weeks, Hoda has seamlessly stepped into the co-anchor role alongside Savannah, and the two have quickly hit the ground running,” Lack wrote in his Tuesday memo, CNN reported. “They have an undeniable connection with each other and most importantly, with viewers, a hallmark of ‘Today.’ ”\n\nKotb’s promotion could help repair some of the optics damage done by Lauer. The staffing news was met with praise from broadcast journalists and others.\n\nAD\n\nAD\n\nCongrats to Hoda! This is a moment for women. https://t.co/rLNXoNz24o — Ana Cabrera (@AnaCabrera) January 2, 2018\n\nCongratulations @hodakotb! Looking forward to you lighting up my morning in a brand new way. ❤️ — Mindy Kaling (@mindykaling) January 2, 2018\n\nKotb’s journalistic credentials run deep. She started out as a broadcast journalist in New Orleans and Fort Myers, and joined NBC News in 1998 as a “Dateline” correspondent.\n\nSince 2008, Kotb has hosted the 10 a.m. hour of “Today” alongside Kathie Lee Gifford, which she’ll continue to do.\n\nWith news of Kotb’s promotion comes questions about gender pay parity: Will she be compensated similarly as Lauer, who reportedly had a four-year, $20 million contract?\n\nThese are incredibly profitable hours for TV networks, and there’s a lot of pressure to present a dynamic hosting team with plenty of on-air chemistry. “Today,” in particular, attempts to project the image that its on-air personalities are essentially a family.\n\nAD\n\n“Today” won’t be the first morning show with female co-anchors; Diane Sawyer and Robin Roberts co-hosted “Good Morning America” from 2006 to 2009. George Stephanopoulos replaced Sawyer when she retired.\n\nAD\n\n“CBS This Morning” still hasn’t named a permanent replacement for Charlie Rose, who was fired in November over allegations of sexual misconduct detailed in a Washington Post report. (Rose apologized for “inappropriate behavior” but said that not “all of these allegations are accurate.”) Other CBS News staffers have filled in, joining hosts Gayle King and Norah O’Donnell.\n\nBut, by and large, men have been dominant presences on morning shows, even as their audiences are dominated by women. Perhaps as the conversation about sexism and representation continues to build steam, more and more women will see themselves reflected on their TV screens.\n\nAD\n\nCorrection: An earlier version of this story erroneously attributed some of Guthrie’s past job positions to Kotb.\n\nRead more:", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/5bd13033-50c2-4ef3-a231-2f9d3ef43dcc.png&w=90&h=90", "https://www.washingtonpost.com/resizer/PPLAI6lLTi6b6TiDPGJ6mW-Jmuw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VH3MXARLWA25VBCG2ZPBCCKGMI.jpg"], "top_img": "https://www.washingtonpost.com/resizer/PPLAI6lLTi6b6TiDPGJ6mW-Jmuw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VH3MXARLWA25VBCG2ZPBCCKGMI.jpg", "keywords": [], "authors": ["Elahe Izadi", "Pop Culture Writer"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/02/hoda-kotb-replaces-matt-lauer-on-today-and-makes-history-in-the-process/", "title": "Hoda Kotb replaces Matt Lauer on ‘Today,’ and makes history in the process", "meta_data": {"description": "She joins Savannah Guthrie as a permanent co-host — meaning the NBC News show for the first time is led by an all-women anchor team.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/02/hoda-kotb-replaces-matt-lauer-on-today-and-makes-history-in-the-process/", "image": "https://www.washingtonpost.com/resizer/PPLAI6lLTi6b6TiDPGJ6mW-Jmuw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VH3MXARLWA25VBCG2ZPBCCKGMI.jpg", "title": "Hoda Kotb replaces Matt Lauer on ‘Today,’ and makes history in the process", "description": "She joins Savannah Guthrie as a permanent co-host — meaning the NBC News show for the first time is led by an all-women anchor team."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Hoda Kotb replaces Matt Lauer on ‘Today,’ and makes history in the process", "description": "She joins Savannah Guthrie as a permanent co-host — meaning the NBC News show for the first time is led by an all-women anchor team."}, "last_updated_date": "2018-02-26T00:21:40.326Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1514822400.0, "source": "https://www.washingtonpost.com", "summary": ""}