{"url": "https://mylittlecorneroflife.com/2016/06/20/dirty-dancing-did-baby-and-johnny-stay-together/", "text": "There are few movies that I absolutely adore but, if I had to name one, I’d have to say that “Dirty Dancing”, 1987 with Patrick Swayze and Jennifer Grey has to be my all time favourite. Having watched the movie several dozen times, I know the lines before they are said and often quote them during opportunistic moments to be comical.\n\nFor those of you who know the movie, I’m sure that you have the same question that most of us were left with…\n\n“What happened after that final night at Kellerman’s? Did Baby and Johnny stay together or did they go their own separate ways?”\n\nWhile it could have gone either way, I think the majority of us wanted to believe that Baby and Johnny did continue on after that and ended up happily wed with babes on their knees and adoring grandparents by the babies’ sides.\n\nThe other way it could have gone could have been that it was simply what it appeared to be…a “summer romance” that ended or faded away shortly after that Labour Day Weekend where Johnny went back to dancing or into the trade of painting and plastering and Baby went to college then, into the Peace Corps, Daddy still loving her.\n\nThere’s really 2 reasons why it might have been left open ended like this.\n\nThe first and most likely reason is that the writers and producers decided to take artistic license and leave it up to the viewer’s imaginations thus, making it whatever the viewer wanted it to be. Nice way to please everyone, isn’t it?\n\nThe second reason might have more to do with the idea that if they left it open ended, there was room for a potential future sequel where fans of the movie could catch up with Johnny and Baby to find out whether they were together or had drifted apart and were coming back together again.\n\nEither way, there was the possibility that everyone could be pleased.\n\nFrankly, I always held the ending that Johnny and Baby did continue their romance beyond that summer. That’s just my imagination, of course but then again, this was a fictional piece from someone else’s imagination.\n\nWhat I didn’t know until about an hour prior to writing this piece was that there was an ending that gave up that answer. They chose to leave it on the cutting room floor for likely the reasons that I have given above.\n\nTo watch this deleted scene with the answer, WATCH HERE.\n\nEnding this here as there will never be a sequel done to Dirty Dancing with Patrick Swayze since he had sadly passed away in Sept. of 2009 with Pancreatic Cancer, I will leave all Dirty Dancing Fans with this famous and probably the best, most beloved and remembered scene in the entire movie, filled with symbolism and romance that still sweeps women’s hearts away….THE FINAL DANCE SCENE TO “DIRTY DANCING”.", "images": ["https://0.gravatar.com/avatar/cfac4954d4e7613470c0426a33cb3b1f?s=80&d=identicon&r=PG", "https://2.gravatar.com/avatar/5144bdc6253f340827cb4e0b4be60fa7?s=80&d=identicon&r=PG", "https://s-ssl.wordpress.com/wp-includes/images/rss.png?m=1354137473h", "https://1.gravatar.com/avatar/49173a0a1b9b7034d845822fd5c32329?s=80&d=identicon&r=PG", "https://pixel.wp.com/b.gif?v=noscript", "https://0.gravatar.com/avatar/cbbd95094a858d0ee3ce28581872a89a?s=80&d=identicon&r=PG", "https://0.gravatar.com/avatar/fa9d5122892dc50d9d4544480906fa83?s=80&d=identicon&r=PG", "https://2.gravatar.com/avatar/e210f75b59caed4cd1373949c1135abc?s=80&d=identicon&r=PG", "https://mylittlecorneroflife.files.wordpress.com/2016/06/dirtydancing4-lg.jpg?w=736", "https://2.gravatar.com/avatar/81bcadd727ff2a66170435114924aefb?s=80&d=identicon&r=PG", "https://1.gravatar.com/avatar/d91423fb386a83b19e4d08871876ab63?s=80&d=identicon&r=PG", "https://1.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=25&d=identicon&forcedefault=y&r=PG", "https://mylittlecorneroflife.files.wordpress.com/2016/06/dirtydancing4-lg.jpg?w=1400&h=9999", "https://1.gravatar.com/avatar/d91423fb386a83b19e4d08871876ab63?s=90&d=identicon&r=PG", "https://mylittlecorneroflife.files.wordpress.com/2016/06/dirtydancing4-lg.jpg"], "top_img": "https://mylittlecorneroflife.files.wordpress.com/2016/06/dirtydancing4-lg.jpg", "keywords": [], "authors": ["View All Posts Ponderinglifetoo", "I'M A Wife", "Mother", "Artist", "Photographer", "Bookkeeper.", "I Love Writing Out My Thoughts In Journals But", "Am Finding My Way To Sharing These With Others Now."], "canonical_link": "https://mylittlecorneroflife.com/2016/06/20/dirty-dancing-did-baby-and-johnny-stay-together/", "title": "Dirty Dancing: Did “Baby” and Johnny Stay Together?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress.com", "og": {"type": "article", "title": "Dirty Dancing: Did “Baby” and Johnny Stay Together?", "url": "https://mylittlecorneroflife.com/2016/06/20/dirty-dancing-did-baby-and-johnny-stay-together/", "description": "There are few movies that I absolutely adore but, if I had to name one, I’d have to say that “Dirty Dancing”, 1987 with Patrick Swayze and Jennifer Grey has to be my all time favo…", "site_name": "My Little Corner of Life", "image": {"identifier": "https://mylittlecorneroflife.files.wordpress.com/2016/06/dirtydancing4-lg.jpg", "width": 900, "height": 604}, "locale": "en_US"}, "article": {"published_time": "2016-06-20T04:15:24+00:00", "modified_time": "2016-06-20T04:15:24+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"creator": "@ponderinglifeto", "site": "@ponderinglifeto", "text": {"title": "Dirty Dancing: Did “Baby” and Johnny Stay Together?"}, "card": "summary"}, "theme-color": "#cccccc", "application-name": "My Little Corner of Life", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Changing lives or life changing information especially when it comes to inspiration and opinion advice.", "msapplication-task": "name=WordPress.com Forums;action-uri=http://forums.wordpress.com/;icon-uri=https://s1.wp.com/i/favicon.ico", "description": "There are few movies that I absolutely adore but, if I had to name one, I'd have to say that \"Dirty Dancing\", 1987 with Patrick Swayze and Jennifer Grey has to be my all time favourite.  Having watched the movie several dozen times, I know the lines before they are said and often quote them…"}, "movies": [], "publish_date": 1466352000.0, "source": "https://mylittlecorneroflife.com", "summary": ""}