{"url": "www.howardstern.com/show/2017/7/25/robert-pattinson-nearly-being-fired-twilight-his-current-love-life-and-stealing-porn-kid/", "text": "Before Robert Pattinson was a world-famous Hollywood actor he was just a kid living in London, attending school with his mates. But on Tuesday’s Stern Show, Rob came clean to Howard about getting expelled from classes after he was caught shoplifting dirty magazines in his youth.\n\n“I’ve never actually said this before,” Rob said with a laugh. “I was, like, stealing porno magazines and selling them at school.”\n\nThe X-rated mags fetched Rob a pretty penny, too. “I would sell it for like 20 pounds … like 30 bucks,” he told Howard.\n\nWhile he started out swiping just one or two magazines from the store at a time, Rob then tried to up his haul. “I got so cocky that I would take the entire rack,” he admitted. That’s when he got noticed by a store employee who caught him with a backpack full of porn and gave Rob the option of having him call the cops or call his parents. Begrudgingly, Rob told him to call his parents. However, the store clerk also ratted Rob out to his school, hence why he was expelled.\n\nPrior to pilfering porno, Rob said he used to steal candy, especially wearable candy bracelets that he told Howard he used to be “obsessed” with.\n\n“I liked stealing things a lot,” Rob said. “You can definitely get high off it.”\n\n“Gary, do me a favor — make sure nothing’s missing from the green room,” Howard joked.\n\nNow on the straight and narrow, the only thing Rob steals is audience’s hearts. Pattinson became a household name after five turns as Edward Cullen in the “Twilight” films, but on Tuesday he told Howard how close he came to actually getting fired from the famous movie franchise. According to Rob, he wanted his young vampire character to be much more brooding than the film’s producers who requested he lighten up a bit whenever cameras were rolling.\n\n“I remember the producers giving me a copy of the book,” Rob told Howard. “Every single instance where my character smiled and stuff, they’d highlighted.”\n\nRob said he then took his own highlighter to the book and underlined each and every time his character frowned or showed emotion. His agent was eventually flown in to have a frank conversation with Rob and explain if he didn’t change his character’s attitude, he might be out of a job. He told Howard he returned to set with a smile on his face.\n\n“I was probably going a little bit too miserable so there was some kind of compromise made,” Rob said.\n\nEven though he’s been deemed the Sexiest Man Alive by multiple publications throughout the years, Rob told Howard he prefers to keep his shirt on, especially while on a movie set. He joked about “Twilight” director Catherine Hardwicke even telling him to cover up while shooting the first film.\n\n“I took it off and she told me to put it back on again,” Rob said.\n\nHe’s also all but ruled out starring in a superhero franchise due to the dedication needed in the gym in order to achieve the ripped body expected of a caped crime fighter. “I don’t understand how people do it, at all,” Rob said with a laugh of actors who work out nonstop.\n\nRob is playing just about the opposite of a superhero in his new movie “Good Time” which tells the story of a bank robbery gone wrong. The movie is set in New York and Howard was impressed in Pattinson's ability to shed his English accent for a thick Queens dialect.\n\n“I was just hanging out in New York for ages,” Rob explained to Howard. He even tried out his accent while in character at a Yonkers auto body shop, just to test its authenticity.\n\nAccents have never been an issue for Rob, who said he used to always walk into auditions speaking like an American rather than a Brit in an effort to convince casting directors he was right for a part. He would go so far as to lie and say he was from Denver before launching into an accent from another region in the U.S.\n\n“The only thing that anyone could see me as [being in] was period dramas,” Rob said of auditioning with his English accent intact. As an American, though, he was able to land many of the roles he wanted.\n\nHoward asked Rob about his current relationship with singer-songwriter FKA Twigs. The two have been together for nearly three years but Rob revealed many in “Twilight” nation have a problem with him dating her, some going so far as to make racist remarks online about her.\n\n“They get so addicted to kind of just wanting to cause hurt and pain on someone,” Rob said of internet trolls. “It’s a faceless enemy.”\n\nMany a woman would consider falling in love with Rob a dream come true, but he made it clear there are plenty of disadvantages to dating him: crazed fans, limited privacy, and a hectic schedule.\n\n“They may think they want to have a relationship with you, but if they start having a relationship with you they actually realize, like, ‘Oh, this is not what I want at all,’” Rob said. “It actually kind of narrows things down.”\n\nSee Robert Pattinson in “Good Time” opening in New York and Los Angeles Aug. 11, in theaters everywhere Aug. 25.", "images": ["https://d1o0agh0cxj49r.cloudfront.net/static/site/img/logo.png", "https://d1o0agh0cxj49r.cloudfront.net/static/site/img/HS-Footer-Logos.png", "https://d1o0agh0cxj49r.cloudfront.net/static/site/img/logo.white.png", "https://d1o0agh0cxj49r.cloudfront.net/photos/2017/07/25/55-41582-rob-pattinson-studio-072517-promo-full-hss-1501006677.jpg"], "top_img": "https://d1o0agh0cxj49r.cloudfront.net/photos/2017/07/25/55-41582-rob-pattinson-studio-072517-promo-full-hss-1501006677.jpg", "keywords": [], "authors": ["July"], "canonical_link": "https://www.howardstern.com/show/2017/7/25/robert-pattinson-nearly-being-fired-twilight-his-current-love-life-and-stealing-porn-kid/", "title": "Robert Pattinson on Nearly Being Fired From ‘Twilight,’ His Current Love Life, and Stealing as a Kid", "meta_data": {"title": "Robert Pattinson on Nearly Being Fired From ‘Twilight,’ His Current Love Life, and Stealing as a Kid", "description": "Hollywood actor comes clean to Howard about getting caught red-handed with dirty magazines", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=yes", "og": {"title": "Robert Pattinson on Nearly Being Fired From ‘Twilight,’ His Current Love Life, and Stealing as a Kid", "description": "Hollywood actor comes clean to Howard about getting caught red-handed with dirty magazines", "type": "website", "image": "https://d1o0agh0cxj49r.cloudfront.net/photos/2017/07/25/55-41582-rob-pattinson-studio-072517-promo-full-hss-1501006677.jpg", "url": "https://www.howardstern.com/show/2017/7/25/robert-pattinson-nearly-being-fired-twilight-his-current-love-life-and-stealing-porn-kid/", "site_name": "Howard Stern"}, "fb": {"pages": 215428201914198}, "twitter": {"card": "summary", "site": "@sternshow", "title": "Robert Pattinson on Nearly Being Fired From ‘Twilight,’ His Current Love Life, and Stealing as a Kid", "description": "Hollywood actor comes clean to Howard about getting caught red-handed with dirty magazines", "image": "https://d1o0agh0cxj49r.cloudfront.net/photos/2017/07/25/55-41582-rob-pattinson-studio-072517-promo-full-hss-1501006677.jpg"}}, "movies": ["https://www.youtube.com/embed/Snk6mGGKH4M?rel=0&wmode=opaque", "https://www.youtube.com/embed/NrB28374Ggo?rel=0&wmode=opaque", "https://www.youtube.com/embed/Vct9CyAp4LE?rel=0&wmode=opaque"], "publish_date": 1500912000.0, "source": "http://www.howardstern.com", "summary": ""}