{"url": "https://www.slashfilm.com/solo-firing/", "text": "Solo: A Star Wars Story has had a bumpy rode to the big screen. The film was close to completion under directors Phil Lord and Chris Miller. Then, Lucasfilm fired the duo and brought in Ron Howard to both finish and reshoot a large portion of the film. A new piece details the process behind the Solo firing of Lord and Miller and the hiring of Howard.\n\nThe ever-expanding Star Wars franchise made headlines when Lucasfilm gave Solo directors Phil Lord and Chris Miller the axe after months of filming. Rumors abounded that the 21 Jump Street directors had clashed with Lucasfilm President Kathleen Kennedy. Reports also stated Lord and Miller were stunned to “find that they were not being granted freedom to run the production in the manner that they were accustomed to.”\n\nNow, a detailed piece from Entertainment Weekly breaks this down and explains the inside story behind Lord and Miller being fired and Ron Howard being brought in to finish the film.\n\nLord and Miller\n\n“I think both Chris and Phil are enormously talented and incredibly funny,” Kathleen Kennedy tells EW. But apparently, they weren’t talented or funny enough to deliver the type of Han Solo film Lucasfilm was looking for.\n\nPer the EW piece, Lord and Miller took an experimental approach to Solo: A Star Wars Story. The filmmakers were open to improvisation. Improvisation isn’t discouraged in the Star Wars franchise, yet Lord and Miller’s approach was allegedly slowing things down. Kathleen Kennedy explains:\n\n“I think these guys are hilarious, but they come from a background of animation and sketch comedy and when you are making these movies you can do that and there’s plenty of room for improvisation, we do that all the time, but it has to be inside of a highly structured process or you can’t get the work done and you can’t move the armies of people to anticipate and have things ready. So, it literally came down to process. Just getting it done.”\n\nThis squares with the statement Lord and Miller released after they left the production:\n\n“Unfortunately, our vision and process weren’t aligned with our partners on this project. We normally aren’t fans of the phrase ‘creative differences’ but for once this cliché is true. We are really proud of the amazing and world-class work of our cast and crew.”\n\n“I think everybody went in with really good intentions and our approach to making the movie was different than theirs,” Lord said later (via Vulture). “That was a really big gap to bridge, and it proved to be too big…Sometimes people break up, and it’s really sad, and it’s really disappointing, but it happens and we learned a lot from our collaborators and we’re better filmmakers for it.”\n\nRon Howard\n\nLucasfilm announced Ron Howard would take over Solo two days after the news of Lord and Miller’s firing broke. Howard isn’t the most inspired choice, but he’s a pro who knows how to get a film done on time. The director told EW he was slightly hesitant about taking the gig, not wanting to step on Lord and Miller’s toes:\n\n“I know Chris and Phil. They’re incredibly talented guys…But when I learned that this change was happening, it just came in a moment where I was working on lots of new projects for Imagine, and I had not planned to direct anything last year. So then this came my way…I was reluctant, but I also began to feel that I could help.”\n\nHoward is a big Star Wars fan, and ultimately the job was too good to pass up. So how much of the final film is Howard’s, and how much belongs to Lord and Miller? Opinions differ. Co-star Thandie Newton said, “[Lord and Miller’s work is] work is everywhere in it. Ninety percent of my stuff is with them. And it certainly wasn’t about, ‘Oh we have to start again and do it all over.” Meanwhile, Newton’s co-star Paul Bettany claims that Howard “reshot a lot more than was originally intended.”\n\nWe may never know the true answer. Howard deliberately dances around the issue in the EW piece:\n\n“I don’t really want to explain it. I don’t really want to be specific about that because, again, I don’t even want that to matter to fans. I could understand why you’d ask, and some might even be curious, but look, everybody who has been involved in this has done nothing but love what this movie could be, and that’s been the vibe around it. I think audiences are gonna feel that love and excitement.”\n\nHoward does add:”Phil and Chris’s fingerprints are all over the movie, given how much they put into it and the time they put into it. I hope fans won’t even think about how the movie was made. They should just lose themselves in it.”\n\nGeorge Lucas\n\nEven if most of the final footage in Solo was shot by Howard, he had a little help from a very familiar Star Wars face: George Lucas. Per EW, Lucas visited Howard’s set and offered advice on a scene. “[George Lucas] had intended to just kind of stop by and say hi, and he stayed five hours,” Kennedy tells EW. “There’s even one little moment in a scene that — I can’t tell you what, sorry — but in the scene on the Millennium Falcon where George said, ‘Why doesn’t Han just do this.’…Ron happened to be by the monitor and not inside the Falcon and he goes, ‘Oh that’s a great idea,’ and ran in and said, ‘George wants us to do this.’”\n\nSolo: A Star Wars Story opens on May 25, 2018.", "images": ["https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Solo-firing-700x300.jpg", "https://www.slashfilm.com/siteimages/pm-comments.jpg", "https://d13ezvd6yrslxm.cloudfront.net/authors/49.jpg", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/young-han-solo-cast.jpg", "https://sstatic1.histats.com/0.gif?1648144&101", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/young-han-solo-cast-700x393.jpg", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/ron-howard-1-700x394.jpg", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/geroge-lucas-solo-700x300.jpg"], "top_img": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/young-han-solo-cast.jpg", "keywords": [], "authors": ["Chris Evangelista"], "canonical_link": "https://www.slashfilm.com/solo-firing/", "title": "‘Solo’ Firing Explained: Why Lucasfilm Replaced Lord and Miller With Ron Howard", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 254451208349115}, "description": "New details have emerged about the controversial Solo firing. Here's why Lucasfilm ultimately decided to replace Lord and Miller with director Ron Howard on the new Star Wars spin-off film.", "news_keywords": "george-lucas, kathleen-kennedy, lord and miller, ron-howard, solo: a star wars story, movies, film, tv", "original-source": "https://www.slashfilm.com/solo-firing/", "og": {"locale": "en_US", "type": "article", "title": "'Solo' Firing Explained: Why Lucasfilm Replaced Lord and Miller With Ron Howard", "description": "New details have emerged about the controversial Solo firing. Here's why Lucasfilm ultimately decided to replace Lord and Miller with director Ron Howard on the new Star Wars spin-off film.", "url": "https://www.slashfilm.com/solo-firing/", "site_name": "/Film", "updated_time": "2018-02-09T11:04:29-07:00", "image": {"identifier": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/young-han-solo-cast.jpg", "secure_url": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/young-han-solo-cast.jpg", "width": 970, "height": 545, "alt": "lord and miller solo"}}, "article": {"publisher": "https://www.facebook.com/slashfilm", "tag": "Solo: A Star Wars Story", "section": "LucasFilm", "published_time": "2018-02-09T11:30:01-07:00", "modified_time": "2018-02-09T11:04:29-07:00"}, "twitter": {"card": "summary_large_image", "description": "New details have emerged about the controversial Solo firing. Here's why Lucasfilm ultimately decided to replace Lord and Miller with director Ron Howard on the new Star Wars spin-off film.", "title": "'Solo' Firing Explained: Why Lucasfilm Replaced Lord and Miller With Ron Howard", "site": "@slashfilm", "image": "http://www.slashfilm.com/wp/wp-content/images/young-han-solo-cast.jpg", "creator": "@cevangelista413"}, "msapplication-TileImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/cropped-ZZ46A5EC75-270x270.jpg"}, "movies": [], "publish_date": 1518201001.0, "source": "https://www.slashfilm.com", "summary": ""}