{"url": "https://nypost.com/2018/03/17/prince-harry-and-meghan-markle-watch-the-crown-at-home/", "text": "In her new book “Harry: Life, Loss, and Love,” author and royal expert KATIE NICHOLL paints a portrait of the redheaded prince, who will marry American actress Meghan Markle on May 19 at St. George’s Chapel, Windsor Castle. In this excerpt, Nicholl gives readers an inside look at the royal relationship, from the fabulous to the delightfully down-to-earth . . .\n\nAs the year 2016 came to a close, knowing that they would be spending Christmas apart and that Harry had a break from official engagements, Meghan flew to London in early December. There was much excitement when they were spotted shopping for a Christmas tree at Pines and Needles, a pop-up stall in South London, where they were given a bunch of mistletoe by staff who said that the couple had left holding hands and were “making each other laugh.” According to tree seller Zaqia Crawford, who recognized the pair, they were “just like any other couple.”\n\nThe store’s owner, Sam Lyle, told the Daily Mail: “They were completely charming together and unaware that our jaws had hit the floor.” In their astonishment, no one at the store took a picture. On Dec. 14, they were finally photographed walking hand in hand through London’s Shaftesbury Avenue in matching beanie hats and overcoats.\n\nHarry had booked tickets to see “The Curious Incident of the Dog in the Night-Time” at the Gielgud Theatre and as they walked down one of the busiest streets in the capital, they couldn’t have looked more relaxed in each other’s company. By this point, Meghan was such a regular at Kensington Palace that she was waved in and out of the wrought-iron gates without the need to show a security pass, and until now they conducted most of their romance in the privacy of Nottingham Cottage, one of the smallest buildings on the palace grounds. Occasionally they went to Harry’s favorite pubs, such as the Brown Cow and the Sands End. There they were safe and would never be photographed, but Harry also wanted to show Meghan the capital.\n\nThey had managed to sneak in a matinee of his favorite show, “The Lion King,” but Harry knew that it would only be a matter of time before someone got a picture, and according to his friends he was relieved when they were eventually photographed together.\n\nHarry and Meghan were in constant touch over the holidays, speaking regularly on FaceTime, and it was only a matter of weeks before the actress was back in London. They had agreed to spend the New Year together and after seeing in 2017, Harry took her to Norway to see the northern lights. Ever since visiting the country as part of his training for his walk in the Arctic, he had vowed to return. According to one of Harry’s friends: “I was with Harry when he saw the lights for the first time in 2011. He promised he’d come back with someone special.” Harry’s friend Inge [Solheim], who is from Norway, planned a very special few days for them.\n\nHe sorted their flights and arranged for them to spend several nights in a glass-topped luxury teepee in the middle of nowhere so that they could fall asleep under the stars. He knew that keeping the trip top-secret was the priority.\n\nThe pair flew on a commercial airline to Tromso, and from there Inge arranged for them to be taken to a lodge in the Arctic Circle. They hired snowmobiles and went whale watching and trekking in search of polar bears. It was an unforgettable few days, and the press only found out about the romantic getaway once Harry and Meghan were back in Britain. There were rumors Harry was in Norway because one of the cabin staff on the airline tweeted that he was on board, but Inge knew how to hide the couple away and they were never found.\n\nIt seemed as though Meghan had slipped seamlessly into her new life as a royal girlfriend.\n\nShe was so at home at Nottingham Cottage that she had a wardrobe of clothes in Harry’s closet and had flown several more suitcases of belongings over. She referred to Kensington Palace as “home,” and there were reports in the press that she had unofficially moved in with Harry. She had certainly transformed Nottingham Cottage, tastefully adding some feminine touches to the bachelor décor, including fresh flowers, organic cookbooks and her favorite Le Labo Santal 26 scented candles. An accomplished cook, Meghan loved to make extravagant dinners for Harry, and they enjoyed staying in and eating her delicious homemade meals and watching films and TV shows like “The Crown” on Netflix.\n\nMeghan’s green lifestyle was also beginning to rub off on Harry, much to the amusement of his friends. Her routine involves starting most days with a yoga workout and drinking green juices and since he had started seeing Meghan, Harry was taking better care of himself. He smoked less, drank less and had lost weight, which might have been down to Meghan cleaning out his cupboards, throwing away any junk food and stocking up instead on healthy juices.\n\nHarry wanted to be in the best possible shape for Meghan and had started going to the gym regularly and following a healthy eating regimen. He was friends with a leading London nutritionist, Gabriela Peacock, who is close to his cousins Princesses Beatrice and Eugenie and counts singer James Blunt and soprano Katherine Jenkins among her clients.\n\nAccording to one of his friends, Harry tried out Gabriela’s range of supplements as part of his new health kick. “Harry went through a bit of a health overhaul after meeting Meghan. He really started watching what he ate and became more health conscious and started taking supplements,” according to a friend. Harry looked fitter than he had in years even if he was still sporting the beard he had grown while in the military and which the queen disliked.\n\nThe early part of the new year was a quiet period in terms of royal duties, and Harry filled his days going to the gym and spending precious time with Meghan. He was focused on the Heads Together campaign, which had been announced as the official charity for the London Marathon. It was William, Kate and Harry’s biggest joint initiative: Kate focused on mental health in schools, William concentrated his efforts on male suicide and Harry turned his attention to the servicemen and women who were suffering post-traumatic stress. Since getting involved with the campaign, Harry had been far more open about his own life, telling footballer Rio Ferdinand, who had recently lost his wife, Rebecca, to cancer, that he regretted not speaking about his mother’s death sooner. “I really regret not ever talking about it . . . for the first 28 years of my life,” Harry said. It was a rare unguarded moment and showed a sensitive and vulnerable side not really seen until now.\n\nMeanwhile, Meghan traveled to Delhi and Mumbai with World Vision Canada to back a campaign promoting better health and hygiene for young women. In a passionate piece in Time magazine, she wrote about how Indian girls and women were being stigmatized and missing out on an education because of menstruation. Like Harry, she wasn’t going to shy away from gritty issues and stigmas that divided society. It was one of the things that bonded them.\n\nIn May 2017, against a stunning Jamaican sunset, Harry wrapped Meghan in his arms and kissed her. It had been two weeks since they had last been together, and both had been looking forward to his best friend Tom Inskip’s wedding. Harry had arrived on the island via a scheduled flight, while Meghan flew in on a private jet loaned by a friend. The wedding was a three-day celebration, and Harry had splashed out on a luxury oceanfront villa at the Round Hill Resort in Montego Bay, not far from where Meghan had married [ex-husband and film producer] Trevor Engelson six years before.\n\nThrilled to be together again, the couple spent much of their time tucked away in their villa, which had its own infinity pool and butler on call. At the wedding service, Meghan had a reserved seat next to Harry in one of the front rows, and according to one guest she mingled confidently while Harry was busy ushering people to their seats. In her flowing designer sundress and shades, she fitted in with the well-heeled crowd and already knew most of Harry’s inner circle. Helpfully, she also got along well with Tom’s bride, Lara, who, like many of Harry’s friends, felt that Meghan was a positive influence on him.\n\nAt the reception that night, Harry barely left Meghan’s side. He was on his best behavior, not drinking too much and even limiting his beloved Marlboro Lights. Tom was as surprised as everyone else at the new Harry. Having partied around the world, from Croatia to Vegas, he and Harry were partners in crime, but Harry gave the tequila shots a miss, saying he wanted to remember the night and enjoy it. That wasn’t to say he didn’t have fun, and at one point he was dancing so enthusiastically to a Michael Jackson song with Meghan that he accidentally crashed into a waiter and sent a tray of drinks flying. At the end of the night there was a slow dance and after Harry escorted Meghan onto the dance floor for a final twirl, the couple politely excused themselves just after 1 a.m.\n\nHarry was convinced he had met “the one.” At 32, he was the same age as his father when he married Lady Diana Spencer. His brother, meanwhile, was already married and a father at the same point in his life.\n\nAccording to former royal chef Darren McGrady, who cooked for William and Harry when they were young boys living at Kensington Palace, “I remember Diana once told Harry and William, ‘Do what your heart tells you.’ She wanted them to follow their hearts, and I think that’s exactly what Harry’s doing.”\n\nExcerpted with permission from “Harry: Life, Loss, and Love” (Hachette Books) by Katie Nicholl, out Tuesday.", "images": ["https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=1111", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://thenypost.files.wordpress.com/2020/02/knewz_300x250.png", "https://thenypost.files.wordpress.com/2020/04/mani-kit-feature.jpg?quality=90&strip=all&w=300&h=200&crop=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0"], "top_img": "https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=1111", "keywords": [], "authors": ["March"], "canonical_link": "https://nypost.com/2018/03/17/prince-harry-and-meghan-markle-watch-the-crown-at-home/", "title": "The night Prince Harry knew he'd met 'the one'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "In her new book “Harry: Life, Loss, and Love,” author and royal expert KATIE NICHOLL paints a portrait of the redheaded prince, who will marry American...", "generator": "WordPress.com", "og": {"type": "article", "title": "The night Prince Harry knew he'd met 'the one'", "url": "https://nypost.com/2018/03/17/prince-harry-and-meghan-markle-watch-the-crown-at-home/", "description": "In her new book “Harry: Life, Loss, and Love,” author and royal expert KATIE NICHOLL paints a portrait of the redheaded prince, who will marry American actress Meghan Markle on May 19 at St. George…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=1111", "secure_url": "https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=1111"}, "locale": "en_US"}, "article": {"published_time": "2018-03-17T13:02:22+00:00", "modified_time": "2018-03-17T16:20:37+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "The night Prince Harry knew he'd met 'the one'"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2018/03/britain_royal_wedding.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "The night Prince Harry knew he'd met 'the one'", "description": "In her new book “Harry: Life, Loss, and Love,” author and royal expert KATIE NICHOLL paints a portrait of the redheaded prince, who will marry American actress Meghan Markle on May 19 at St."}, "fb": {"pages": 225343690812937}, "nypost-section": "News", "parsely-metadata": "{\"post_id\":\"nypost-12327485\"}", "keywords": "News,meghan markle,prince harry,the royals", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": [], "publish_date": 1521216000.0, "source": "https://nypost.com", "summary": ""}