{"url": "people.com/politics/caitlyn-jenner-very-proud-kim-kardashian-meeting-donald-trump/", "text": "Image zoom Source: Caitlyn Jenner/Instagram\n\nCaitlyn Jenner is “very proud” of Kim Kardashian West for her conversations with President Donald Trump that led to the pardon of Alice Marie Johnson, the 62-year-old great-grandmother who was incarcerated for 22 years over a first-time nonviolent drug offense.\n\nIn a sit-down interview with Variety published on Tuesday, Jenner spoke out about her former step-daughter’s foray into politics, which began with a phone call from Trump and culminated in a meeting between the two at the White House in May.\n\nGet push notifications with news, features and more.\n\n“I thought they did the right thing,” Jenner, 68, told the trade magazine of the mother of three, whom she has not spoken to in years. “I was very proud of her.”\n\nJenner herself is “very politically involved” and has been busy working to shape policy in the Trump administration, though more so behind the scenes.\n\n“I don’t do a lot of media. I don’t want to be seen everywhere,” she said. “Nobody really knows it. I do it very quietly because I have been so criticized by the liberal side of the media. I can get more things done if I don’t stick my nose into everything publicly.”\n\nImage zoom Caitlyn Jenner and Donald Trump Jon Kopaloff/WireImage; Evan Vucci/AP/REX/Shutterstock\n\nRELATED: Where Caitlyn Jenner Stands with Every Woman in the Kardashian Family\n\nA long outspoken Republican, Jenner voted for Trump in the 2016 election on what she thought was a promise of continued progress for LGBTQ rights.\n\n“On the economics side, I’m very conservative. I believe in limited government, I believe in lower taxes, I believe in less regulations, I want a thriving economy, I want Americans to be able to succeed,” Jenner said. “But socially, I’m much more progressive. We have to get them to be more progressive with social issues. It’s their biggest problem.”\n\nBut since Trump’s election, there’s been an attempt to roll back rights — including Trump’s failed attempt to stop transgender people from enrolling in the military and his move to lift federal protections for transgender students that would guarantee their freedom to use public school bathrooms and locker rooms matching their chosen gender identity.\n\n“I honestly don’t know what happened when he got in there,” Jenner remarked. “It was extraordinarily disappointing.”\n\nThough she hasn’t spoken to Trump since his election (despite publicly asking the president to call her), Jenner explained that she regularly makes trips to Washington, D.C. and has had long meetings with roughly 50 members of the House and Senate and many members of Trump’s White House directly.\n\n“I met with Paul Ryan. I’ve met with just about everybody. Publicly, they aren’t supportive of transgender rights. … I’ve never had anybody not be nice to my face,” she said, telling Variety that the conversations were confidential but often included “invasive questions about her body and genitalia.”\n\n“I think it’s a good thing that I’m on the Republican side because I’ve got an in,” she said. “Has this administration set us backwards? Absolutely. And every time they’ve done it, I’ve fought it. …. I fight those types of wars. I fight the equality wars. I do it all very quietly. We’re going to be okay in the end.”\n\nShe added: “What’s going on in Washington D.C. is just disgraceful. The hate, the media, all the things that are going on there. … [Trump’s] not been doing a very good job, but it’s not over yet.”\n\nRELATED VIDEO: PEOPLE Writer Natasha Stoynoff Breaks Silence, Accuses Donald Trump of Sexual Attack\n\n\n\nBecause Jenner’s advocacy for transgender rights on Capitol Hill has been mostly behind the scenes, many members of the LGBTQ community have felt frustrated that she hasn’t been using her celebrity and influence to help.\n\nThat criticism has caused Jenner to feel isolation from her own community. “I’ve felt it big time, and it hurts,” she said. “Sometimes this community can be really tough.”\n\n“No matter what you say or do, they think you don’t get it because you’re this kind of white, privileged person,” Jenner confessed, disputing any notion that she isn’t an advocate. “I haven’t turned my back on anybody. … We need hard-core legislation, laws on the book of equality. It’s going to take some time, but we’re working on it.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fcaitlyn-jenner-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fcaitlyn-trump-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fcaitlyn-jenner-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fcaitlyn-jenner-1.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/politics/caitlyn-jenner-very-proud-kim-kardashian-meeting-donald-trump/", "title": "Caitlyn Jenner ‘Very Proud’ of Kim Kardashian for Meeting with Trump", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Caitlyn Jenner,Donald Trump,Kim Kardashian,News,TV", "news_keywords": "Caitlyn Jenner,Donald Trump,Kim Kardashian,News,TV", "description": "In a sit-down with Variety published on Tuesday, Caitlyn Jenner spoke out about her former step-daughter's foray into politics and meeting with President Donald Trump", "og": {"title": "Caitlyn Jenner 'Very Proud' of Kim Kardashian for Meeting with President Trump: 'I Thought They Did the Right Thing'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/politics/caitlyn-jenner-very-proud-kim-kardashian-meeting-donald-trump/", "description": "Caitlyn Jenner&nbsp;is “very proud” of&nbsp;Kim Kardashian West&nbsp;for her conversations with President Donald Trump that led to the pardon of&nbsp;Alice Marie Johnson, the 62-year-old great-grandmother who&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fcaitlyn-jenner-1.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/politics/caitlyn-jenner-very-proud-kim-kardashian-meeting-donald-trump/", "description": "In a sit-down with Variety published on Tuesday, Caitlyn Jenner spoke out about her former step-daughter's foray into politics and meeting with President Donald Trump", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fcaitlyn-jenner-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/politics/caitlyn-jenner-very-proud-kim-kardashian-meeting-donald-trump/", "title": "Caitlyn Jenner 'Very Proud' of Kim Kardashian for Meeting with President Trump: 'I Thought They Did the Right Thing'", "description": "In a sit-down with Variety published on Tuesday, Caitlyn Jenner spoke out about her former step-daughter's foray into politics and meeting with President Donald Trump", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fcaitlyn-jenner-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}