{"url": "www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/17/meghan-markle-and-prince-harry-wedding-drama-faq-all-the-gossip-you-really-want-to-know/", "text": "What’s up with Meghan’s dad?\n\nThomas Markle Sr., 73, used to work as a TV lighting director and cinematographer and has since retired to Mexico. Much has been made of Meghan’s relationship with her dad, as he and her mom divorced when Meghan was 6. Thomas has never met Harry, but they’ve reportedly spoken by phone. An “insider” recently told People magazine, “Like any father-daughter relationship, there have been ups and downs over the years. But they are in a good place now.”\n\nAD\n\nAD\n\nThen it gets confusing. In early May, Meghan’s half-brother (more about him later) sent a nasty letter to Harry, imploring him not to marry Meghan and calling it “the biggest mistake in wedding history.” The letter, obtained by In Touch magazine, claimed Meghan’s father had not received an invitation to the wedding. However, the palace released a statement at the time confirming that Thomas would walk his daughter down the aisle. So that was weird.\n\nHowever, things fell apart this week when it was revealed that Thomas Sr. had been working with the paparazzi to stage photos of himself: Reading a book on Great Britain, getting fitted for a suit, etc. This did not go over well, as the palace had chastised the media for badgering him. On Monday, Thomas told TMZ that he regretted the photos, saying they were “stupid and hammy,” and said he would not be attending the wedding because of a recent heart attack. A day later, he changed his mind and said he would love to go. Then, he contacted TMZ once more to say that he had to undergo heart surgery on Wednesday, and he would officially not be attending.\n\nEarly in the week, the palace sidestepped commenting on this mess, as a spokesperson simply said, “This is a deeply personal moment for Ms. Markle in the days before her wedding. She and Prince Harry ask again for understanding and respect to be extended to Mr. Markle in this difficult situation.”\n\nOn Thursday, Markle finally weighed in: “Sadly, my father will not be attending our wedding. I have always cared for my father and hope he can be given the space he needs to focus on his health. I would like to thank everyone who has offered generous messages of support. Please know how much Harry and I look forward to sharing our special day with you on Saturday.”\n\nAnd what’s up with her half-sister?\n\nAD\n\nAD\n\nSamantha Markle, 53, is Thomas Sr.’s daughter from his first marriage and lives in Florida with her three kids. She made headlines early in Meghan and Harry’s relationship when it was reported she was penning a tell-all memoir called “The Diary of Princess Pushy’s Sister.” (The two reportedly haven’t spoken in years.) Samantha also trashed her half-sister in interviews, calling her a “shallow social climber” only interested in fame. Later, she changed her tune, saying Meghan was “absolutely lovely.”\n\nSo guess who wasn’t invited to the wedding? Plus, Samantha admitted this week she was the one who persuaded their father to take those staged pictures, thinking it would help improve his image. This earned her a dressing-down from TV host Piers Morgan, who called her a “little vulture.”\n\nWhy did Meghan’s half-brother write such a cruel letter to Harry?\n\nAD\n\nAD\n\nIt’s unclear — maybe Thomas Jr., 50 (Thomas Sr.’s son from his first marriage) was upset that he was left off the wedding guest list? “Meghan Markle is obviously not the right woman for you,” he wrote to Harry, adding his half-sister was a “jaded, shallow, conceited woman that will make a joke of you and the royal family heritage.” Thomas Jr. later appeared to regret this, as he gave a follow-up letter to In Touch in which he begged Meghan for a wedding invitation, trying to guilt her with the line, “We are all still family.” We’re guessing that it did not work.\n\nHowever, Thomas Jr.’s ex-wife, Tracy, and their sons, Tyler and Thomas, did not let that deter them — they recently landed in London, where they’ll be acting as wedding correspondents for “Good Morning Britain.”\n\nWhat about her mom?\n\n\n\nAD\n\nDoria Ragland, 61, is a yoga instructor and social worker. Meghan is her only child, and they’re extremely close. Before the engagement, she met Harry, who proclaimed her “amazing.” Tabloids reported that Doria, who lives in Los Angeles, recently quit her job at a mental health clinic. (Hmmm, could she be moving out of the country sometime in the future?) It has been speculated that Doria could walk her daughter down the aisle. (Update: Prince Charles is actually going to do it.) Either way, she arrived in London earlier this week to spend time with Meghan and meet the royal family.\n\nAD\n\nIs her ex-husband really producing a TV show based on their relationship?\n\nMeghan married film producer Trevor Engelson in 2011; they split two years later. In September 2017, Deadline reported that Engelson was shopping a fictional TV comedy with the description: “Divorce is hard. Sharing custody is harder. Sharing custody with the British Royal family when your wife marries a prince, in the unforgiving spotlight of London’s tabloid media, is next level.” Hmmm. The idea was apparently sparked when Engelson and another producer were talking about what could have happened if he and Meghan had kids.\n\nAD\n\nHowever, the Sun recently reported that Engelson, after being persuaded by Meghan and some mutual friends, has put the project on hold — for now.\n\nIs there any drama on Harry’s side of the family?\n\nHave you seen “The Crown”? You have? Good. That’s probably all the intense Windsor drama you’re going to get. Because Harry and Meghan limited the size of their guest list — it still includes 600 people, so everyone can chill — some distant relatives who were invited to William’s wedding were not invited to Harry’s. The royals are trained in remaining tight-lipped about most drama, of course, so we don’t know whether these minor snubs have caused any problems.\n\nAD\n\nAD\n\nWhat’s up with those rumors about Meghan and Kate feuding?\n\nMeghan’s eloquence and openness have earned her comparisons to Harry’s late mother, Princess Diana, often called the “People’s Princess.” Several tabloids report Kate is jealous of this comparison and Meghan’s overall popularity with the family and public.\n\nBut some rumors are simply rumors, friends, as Meghan and Kate have shown no signs of fighting — in public, at least. They both attended a Royal Foundation event with their significant others in February, during which the foursome were asked whether they ever disagree.\n\nWilliam replied, “Ohhh, yes,” according to Vanity Fair. Harry elaborated: “I think it’s really good we have got four different personalities and we all have that same passion to make a difference. We have different opinions and they work really well [together].” He then noted that they are all “stuck together for the rest of our lives,” to which Meghan added, “Togetherness at its finest.”\n\nWhat roles will William and Kate have in the wedding?\n\nAD\n\nAD\n\nA few months after William said his younger brother had not yet asked him to be his best man — “It could be a sensitive subject,” he joked on a radio show — Kensington Palace announced that William would, in fact, return the favor that Harry did for him in 2011. Kate probably won’t have a formal role during the ceremony, according to a Vanity Fair source who said Meghan and Harry “just want Kate to be able to enjoy the day and not worry about anything.” William and Kate’s older children, George and Charlotte, will be in the wedding party, while young Louis will stay at home.\n\nAre Harry’s exes invited to the wedding?\n\nProbably! Harry is said to be on good terms with Cressida Bonas, whom he dated for two years, and Chelsy Davy, whom he dated on-and-off for seven. There’s also precedent: Several of William’s exes attended his wedding, and Prince Charles’s then-ex-girlfriend — now his wife, Duchess Camilla — attended his to Diana.\n\nAD\n\nAD\n\nWhich celebrities will be there?\n\nNever forget that before she ascended to royalty, Meghan was a mere Hollywood celebrity. Several actors from “Suits,” the USA network legal drama that propelled her to fame, are expected to attend the ceremony: Gabriel Macht, Patrick J. Adams, Sarah Rafferty, Gina Torres and Rick Hoffman. All five Spice Girls — British royalty in their own right — likely will, too, along with Meghan’s pals Priyanka Chopra and Serena Williams. Despite their friendship with Harry, Barack and Michelle Obama will not be present.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9624aab6-2742-4553-9ae0-96a331f3e138.png&w=90&h=90", "https://www.washingtonpost.com/resizer/3I0h-IIxoX-DQhxcbobE90MhrsE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BZEEX5FKTUYTBHXUNLUB7V7XHA.jpg"], "top_img": "https://www.washingtonpost.com/resizer/3I0h-IIxoX-DQhxcbobE90MhrsE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BZEEX5FKTUYTBHXUNLUB7V7XHA.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture", "Sonia Rao", "Pop Culture Reporter"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/17/meghan-markle-and-prince-harry-wedding-drama-faq-all-the-gossip-you-really-want-to-know/", "title": "Meghan Markle and Prince Harry wedding drama FAQ: All the gossip you really want to know", "meta_data": {"description": "Yes, Harry's ex-girlfriends will probably be in attendance.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/17/meghan-markle-and-prince-harry-wedding-drama-faq-all-the-gossip-you-really-want-to-know/", "image": "https://www.washingtonpost.com/resizer/3I0h-IIxoX-DQhxcbobE90MhrsE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BZEEX5FKTUYTBHXUNLUB7V7XHA.jpg", "title": "Meghan Markle and Prince Harry wedding drama FAQ: All the gossip you really want to know", "description": "Yes, Harry's ex-girlfriends will probably be in attendance."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Meghan Markle and Prince Harry wedding drama FAQ: All the gossip you really want to know", "description": "Yes, Harry's ex-girlfriends will probably be in attendance."}, "last_updated_date": "2018-05-18T21:12:59.471Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1526486400.0, "source": "http://www.washingtonpost.com", "summary": ""}