{"url": "https://en.wikipedia.org/wiki/The_Song_in_Your_Heart", "text": "20th episode of the sixth season of Once Upon a Time\n\n\"The Song in Your Heart\" is the 20th and penultimate episode from season six of the American fantasy drama series Once Upon a Time. This episode first aired on May 7, 2017. Billed as a musical episode, it marks a departure from the typical dramatic elements featured in the series. In this outing, Emma and Hook prepare for their wedding, but Fiona is preparing a plot that will begin the Final Battle. In a scene that takes place in the past, Snow and David make a wish that results in the entire Enchanted Forest breaking out in song.\n\nPlot [ edit ]\n\nOpening sequence [ edit ]\n\nAn orchestra is shown in the Forest, playing the theme song of the series.\n\nEvent chronology [ edit ]\n\nThe Storybrooke events take place after the current events of \"The Black Fairy\", and in 1991 after \"Tougher Than the Rest\"; the flashback events in the Enchanted Forest occur after the pilot episode and before \"The Stranger\"; and the events in Oz occur prior to \"Heart of Gold.\"\n\nIn the characters' pasts [ edit ]\n\n1991, Land Without Magic [ edit ]\n\nAt a group children's home in Minnesota, Emma records herself singing, only to have another girl interrupt her, reminding Emma that she will always be an orphan.\n\nBefore the First Curse, Enchanted Forest, and the Land of Oz [ edit ]\n\nAfter talking with Rumplestiltskin in the castle dungeon, Snow makes a wish that her future daughter will be happy and safe before the Curse takes place. The next day, the wish comes true: Snow and David break into song and realize that they can defeat Regina through the power of music (\"Powerful Magic\"). The wish also affects Regina, who notices that the entire forest is singing (\"The Queen Sings\") and makes a plan to destroy everyone's happiness (\"Love Doesn't Stand a Chance\").\n\nMeanwhile, David and Snow visit a tavern to enlist Hook to help them search for Regina. Hook refuses their offer of gold and explains that revenge on Rumplestiltskin is all that he desires (\"Revenge Is Gonna Be Mine\"). Regina visits Rumplestiltskin, who is not affected by the wish, at his cell. Regina asks for his help in erasing the wish, but he refuses, telling her that he would rather gouge out his eyes with a rusty fork than sing. He then tells her to figure out a way in order to prove herself.[clarification needed] In Oz, Zelena spies on their conversation and believes that Rumplestiltskin might come to regret choosing Regina over her. She prepares a spell for Regina to end the Singing Spell, which she will take credit for (\"Wicked Always Wins\").\n\nSnow and David confront Regina, and the Singing Spell seems to make Regina's magic ineffective against the Charmings (\"Charmings vs. Evil Queen\"), but Regina uses a magic box she had found (which contains Zelena's spell) to stop them from singing and sends them back to their castle. Upon their return, the Blue Fairy appears to Snow and David and informs them that the power of song was never meant to be used to defeat the Evil Queen, instead placing it in Emma's heart, where the Power of Song will help her win a major battle one day. The Blue Fairy tells them that Emma won't be alone.\n\nIn Storybrooke [ edit ]\n\nAs the wedding approaches, Emma is unable to decide on a dress, so Snow brings over the dress she wore at her wedding, which she found at the Pawn Shop. But just moments before Emma tries on the gown, it immediately turns black; they are surprised to see Fiona appear, having thought that Gold had killed her. Fiona demands that Emma turn over her heart, then taunts Emma about believing herself to be orphan, saying that she is still \"weak\" and hasn't really \"grown up,\" adding that \"[she's] still just the lonely little girl [she] always [was].\" Fiona lets the women know that she plans to use an enormous amount of Black Fairy Dust to unleash another Dark Curse on Storybrooke at 6:00 PM, the same time as Emma and Hook's wedding. When they check the clock tower at Fiona's suggestion, they discover that Fiona had brought enough Black Fairy Dust to curse Storybrooke more than ten times over.\n\nThis prompts Regina and Zelena to come up with a plan to stop Fiona from crashing the wedding, while Emma informs Hook of her decision to face the Black Fairy before the wedding, and says goodbye in case she dies. Hook confronts Gold at the Pawn Shop for lying to everyone about Fiona. When Gold refuses to apologize, saying that he did it for the good of his family, Hook uses Dreamshade on Gold to knock him out, hoping to buy time for Emma to defeat Fiona. Fiona appears, prompting Hook to flee. At the Sheriff's station, Emma gets a sign of encouragement from Henry, but when Henry finds the recording of her singing, Emma says that it's nothing.\n\nHours later, Zelena helps Regina remember how to isolate the part of the potion that stops time, which they hope can buy them more time to stop Fiona. Unfortunately, just as they are about to enact the spell, Gold uses it on Emma's family. Emma goes to confront Fiona at the Mayor's office, but Fiona holds Emma's family hostage, save for Henry, along with Regina, Zelena, and Hook. Fiona taunts Emma by playing her the song from her childhood, which reminds her of a time when she was alone. Henry, upset that Emma has decided to turn over her heart to Fiona, throws his book in disgust, only to discover a page in the book that reveals that Emma's heart was gifted with the magic of song, placed there by The Blue Fairy. When Emma meets with Fiona, she rips out her heart but she cannot crush it. Henry rushes in to stop his mother, telling her that she has a song in her heart, which suddenly emboldens Emma as her music starts to strengthen her (\"Emma's Theme\"). This causes Fiona to try to kill Emma with a blast of Dark Magic, but she fails. Emma then uses her magic to free everyone. As Henry restores Emma's heart, Fiona tells her that they will still face each other in the Final Battle, and that it will be worse than anything she can possibly imagine.\n\nThe wedding commences on a rooftop overlooking Storybrooke. With Archie serving as their ordained minister, everyone watches Emma and Hook exchange vows and wedding rings. The residents then celebrate with a dance and festivities (\"A Happy Beginning\"), only to see the Black Fairy's Curse erupt from the face of the Clock Tower at the stroke of 6:00 PM, with black tendrils streaming out and engulfing Storybrooke. As Emma watches, she tells a worried Hook: \"...wherever we end up, we're going to win.\"\n\nCultural references [ edit ]\n\nLyrics from \"The Queen Sings,\" specifically ones sung by Grumpy and Geppetto, reference the Disney films Snow White and the Seven Dwarfs and Pinocchio.\n\nEmma's wedding dress is inspired by Grace Kelly's wedding dress.[citation needed]\n\nProduction [ edit ]\n\nThis musical episode was conceived during the series' third season, but according to show runner Jane Espenson, it was too expensive at the time.[1] The producers revisited the idea in July 2016 after receiving feedback and requests from viewers.\n\nPaul Becker, who was brought on board as the choreographer for the episode, confirmed the episode on his Instagram account on February 9, 2017.[2] Most of the cast did the recording first, with the choreography done afterwards, so the playback could blend in with the scenes. During the final day of shooting, Colin O'Donoghue injured his foot while performing his number.[3]\n\nThe idea for Emma's wedding dress was inspired by Jennifer Morrison's fascination with Grace Kelly's wedding dress from 1956, which Morrison suggested to costume designer Eduardo Castro.[citation needed] In addition, both Morrison and O'Donoghue suggested that the wedding have a vintage feel, similar to black and white film musicals, while O'Donoghue had a say on the wedding ring. The suit he wore in the scene was a last-minute idea from Edward Kitsis, using a jacket created by Burberry. There were also discussions about the location of the wedding scene, but given weather conditions, they decided on a rooftop setting.[citation needed]\n\nA special screening of the episode, followed by a question and answer session with executive producers and available cast, happened on May 2, 2017, at the Frank G. Wells Theater on the Walt Disney Studio Lot at Burbank, California.[4]\n\nCasting [ edit ]\n\nEmilie de Ravin is credited but does not appear in this episode.\n\nJakob Davies, who played Pinocchio as a recurring guest star, had to relinquish the role in this episode to his younger brother Jack; the character is supposed to remain a boy as part of the continuity, and the producers wanted \"to keep Pinocchio in the family\".[5]\n\nMusic [ edit ]\n\nOnce Upon a Time: The Musical Episode Soundtrack album by Various Artists Released May 5, 2017 ( ) Genre Soundtrack Length 19 : 33 Label Walt Disney Records Producer Alan Zachary & Michael Weiner\n\nThe episode features eight songs:\n\nThe music featured in this episode has been available for download on iTunes since May 5, 2017. All songs were produced by Alan Zachary and Michael Weiner.[6][7]\n\nOnce Upon a Time: The Musical Episode No. Title Writer(s) Performer Length 1. \"Powerful Magic\" Alan Zachary and Michael Weiner Ginnifer Goodwin, Josh Dallas 3:04 2. \"The Queen Sings\" Alan Zachary and Michael Weiner Lana Parrilla, Giancarlo Esposito, Lee Arenberg, Tony Amendola, Beverley Elliott, Ginnifer Goodwin, Josh Dallas 1:36 3. \"Love Don't Stand a Chance\" Alan Zachary and Michael Weiner Lana Parrilla 2:34 4. \"Revenge is Going to Be Mine\" Alan Zachary and Michael Weiner Colin O'Donoghue, Christopher Gauthier, Chorus (Pirates) 2:34 5. \"Wicked Always Wins\" Alan Zachary and Michael Weiner Rebecca Mader 3:11 6. \"Charmings vs. Evil Queen\" Alan Zachary and Michael Weiner Ginnifer Goodwin, Josh Dallas, Lana Parrilla 1:47 7. \"Emma's Theme\" Mark Isham, Alan Zachary and Michael Weiner Jennifer Morrison 2:28 8. \"A Happy Beginning\" Mark Isham, Alan Zachary and Michael Weiner Jennifer Morrison, Colin O'Donoghue, Ginnifer Goodwin, Josh Dallas, Lana Parrilla, Rebecca Mader, Jared S. Gilmore, Chorus 2:51 Total length: 19:33\n\nChart (2017) Peak\n\nposition UK Compilations (OCC)[8] 32 UK Soundtrack Albums (OCC)[9] 8 US Billboard 200[10] 116 US Soundtrack Albums (Billboard)[11] 11\n\nReception [ edit ]\n\nChristine Laskodi of TV Fanatic gave the episode full marks: 5.0 out of 5.0[12] Entertainment Weekly gave the episode an A.[13]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Song_in_Your_Heart", "title": "The Song in Your Heart", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}