{"url": "https://www.bustle.com/p/all-the-signs-that-peter-will-be-the-next-bachelor-because-its-his-literal-destiny-70642", "text": "Wisconsin is known for cheeses that get better with time, and, on The Bachelor franchise it's known for men who do the same. (Nick Viall anyone?) This season, Peter Kraus is a clear fan favorite on The Bachelorette. If social media is any indication of popularity, Peter has won the hearts of Bachelor Nation members everywhere. But, though Peter's been a frontrunner on Rachel's season since the beginning, this competition is tough. There is a chance he doesn't end up engaged to her at the end of all this. But, if that happens, all hope isn't lost. There are so many signs that Peter could be the next Bachelor.\n\nProducers love to keep fans guessing as to who the next lead is, pretty much right up until the show starts filming. Sometimes production pulls a fast one and fans end up with a surprising choice like controversial Bachelor Nick Viall. However, most recent seasons have seen The Bachelorette fan favorite become the next leading man. (Ben Higgins and Sean Lowe are great examples of this.)\n\nShow creator Mike Fleiss recently asked fans on Twitter who they want to see as the next Bachelor. Many came forward to vote for Peter. Of course, Peter could end up engaged to Rachel, or start dating someone off the show, or even be deemed not right for the role. Still, many clues point to Peter as the next Bachelor.\n\nHe's A Fan Favorite\n\nFor everyone from former Bachelor contestants to regular ole' Bachelor watchers, Peter is clearly on everyone's radar. Many of the live tweets during The Bachelorette are about how perfect Peter is. When he's on the screen, he receives a sea of supportive tweets and GIFs. While this doesn't automatically make him the next Bachelor, it certainly helps his campaign. The show wants a Bachelor who fans are excited about, someone people will root for. And, at the moment, everyone seems to be rooting for Peter.\n\nHe's Got Those Bachelor Looks\n\nI'm pretty sure abs are a requirement for being the Bachelor. Creepy shower b-roll shots are a must for any Bachelor season and abs make those shots so much better. The Bachelor needs to be able to make ladies swoon, fight with each other, and act a bit kooky for television. I'm pretty certain Peter has the ability to do just that. With a sculpted body, a chiseled face, and an adorable gap between the teeth, Peter certainly qualifies as good looking.\n\nHe's Into Wholesome Family Fun\n\nDespite being filled with steamy hot tub makeout sessions, The Bachelor airs at 8 p.m. on ABC and is family prime time viewing. So, it's no wonder that Sean Lowe was an overwhelmingly popular Bachelor, being both family oriented and down to earth. Peter is a good ole' Wisconsin boy, an involved uncle, and pretty digestible for a Bachelor Nation audience.\n\nHe's Age Appropriate\n\nThere are many things about The Bachelor that are difficult to buy into. Folks who have known each other for only a few weeks are expected to consider an engagement. While I understand you form a connection quickly, committing to spend forever takes time. It's even harder to believe a guy in his mid-twenties is about to jump into that kind of commitment after only a few months. Peter is 31, a much more believable age of a man who wants to tie the knot and start a family.\n\nHe's Seems Genuine About Finding Love\n\nPeter has been open about his hesitations on The Bachelorette. The process is fast and he won't propose unless he's ready to. This honesty is refreshing in a show that often leads to engaged couples who split not long after. Peter's honesty makes his desire to find love somehow feel more genuine. He's looking for the one and isn't going to proclaim he's in love unless he really is. A genuine lead is always preferable over a performative one.\n\nHe Has An Established Life\n\nPeter had a modeling career. He now owns and works for Worth Personal Training, a personal training and bootcamp facility. Peter isn't banking his career on making money selling tea on Instagram. He's an established business owner and has a life set up in Wisconsin. Part of why Rachel has been such a wonderful Bachelorette is that she has a fulfilling career and life outside the show. It makes her a more dynamic lead to watch — and she seems more sure of herself and the decisions she's making.\n\nIt's His Destiny\n\nAs Peter revealed on Instagram, in his high school yearbook he predicted that he would be on The Bachelor. While high school Peter had a funky goatee and an interesting fashion sense, he was also clearly a fortune teller. His life was leading to roses and televised love since he was 17.\n\nIf Rachel and Peter don't end up sporting Neil Lane bling, there is a high chance that Peter will be the next Bachelor. It's written in the stars — or at least written in his high school yearbook.", "images": ["https://imgix.bustle.com/uploads/image/2017/7/17/5b589010-b8a8-44cb-b1e9-5568315c6c78-peter.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/3/30/0b25196e-02f4-4fa4-b08b-60057b11c7d1-cu-headshot-3.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/7/17/5b589010-b8a8-44cb-b1e9-5568315c6c78-peter.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/14/09b0f102-16c3-4c00-b942-0728fc2f091f-getty-1158663894.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/13/1cde12c7-94ab-45d0-ac18-a5e766797635-getty-1195502798.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/20/c328eadf-9ae0-4257-99eb-e601f708c458-getty-916296824.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/7/17/5b589010-b8a8-44cb-b1e9-5568315c6c78-peter.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/all-the-signs-that-peter-will-be-the-next-bachelor-because-its-his-literal-destiny-70642", "title": "All The Signs That Peter Will Be The Next 'Bachelor,' Because It's His Literal Destiny", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/all-the-signs-that-peter-will-be-the-next-bachelor-because-its-his-literal-destiny-70642", "type": "article", "title": "All The Signs That Peter Will Be The Bachelor", "description": "Wisconsin is known for cheeses that get better with time, and, on The Bachelor franchise it's known for men who do the same. (Nick Viall anyone?) This season, Peter Kraus is a clear fan favorite on The Bachelorette. If social media is any indication…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/7/17/5b589010-b8a8-44cb-b1e9-5568315c6c78-peter.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Wisconsin is known for cheeses that get better with time, and, on The Bachelor franchise it's known for men who do the same. (Nick Viall anyone?) This season, Peter Kraus is a clear fan favorite on The Bachelorette. If social media is any indication…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}