{"url": "https://www.hollywoodreporter.com/news/louis-cks-movie-premiere-canceled-advance-ny-times-story-1056585", "text": "The 'I Love You, Daddy' screening was abruptly axed just hours before it was set to take place.\n\nThe New York premiere of Louis C.K.'s upcoming film, I Love You, Daddy, set for Thursday, has been canceled. Reps for the premiere, due to take place at the Paris Theatre, initially cited \"unexpected circumstances.\"\n\nA source tells The Hollywood Reporter that a New York Times story on the comedian is about to break, and the premiere was canceled in case it is damaging. Additionally, Louis C.K.'s planned appearance on CBS' The Late Show With Stephen Colbert was also canceled, with William H. Macy taking his place.\n\n(After this story was originally published, The New York Times published an article by investigative reporter Jodi Kanter, who co-bylined the Oct. 5 Harvey Weinstein story, that included five women accusing C.K. of sexual misconduct. The comedian's publicist, Lewis Kay, responded to the Times: \"Louis is not going to answer any questions.\"\n\nThe film's distributor The Orchard released a second statement following the publication of the Times story: \"In light of the allegations concerning Louis C.K. referenced in today’s New York Times, we are canceling tonight’s premiere of I Love You, Daddy. There is never a place for the behavior detailed in these allegations. As a result, we are giving careful consideration to the timing and release of the film and continuing to review the situation.\" On Friday, the distributor said it would not be moving forward with the release of the movie, which was set to open in select theaters on Nov. 17, and C.K. released a statement confirming the claims.)\n\nLouis C.K. wrote, directed and stars in I Love You, Daddy. The comedy-drama tells the story of a successful TV writer-producer who attempts to stop his 17-year-old daughter's (Chloe Grace Moretz) growing admiration and relationship with a 68-year-old filmmaker (John Malkovich). The film also stars Pamela Adlon, Rose Byrne, Charlie Day, Edie Falco and Helen Hunt.\n\nC.K. shot the film entirely in secret last June. He also financed the project and edited it as well. Dave Becky of 3 Arts produced the film alongside C.K., Vernon Chatman, Ryan Cunningham and John Skidmore. Tony Hernandez executive produced.\n\nThe film generated controversy following its premiere at the Toronto International Film Festival in September. TIFF programmers had screened it and given I Love You, Daddy a world premiere after C.K. surprised Toronto organizers, letting them know the film existed.\n\nControversial dialogue appears throughout the film, including the use of the N-word by C.K.'s character and multiple jokes about child rape. C.K. previously defended the inappropriate content to THR. \"We're depicting oxygen-rich people who live in these beautiful apartments and offices saying whatever they want,\" he said. \"Folks say shit to each other. You can't think about the audience when you're making the thing. If you do, you're not giving them something that came out of your gut. You'll be making something that you're like, 'Is this OK for you?'\"\n\nThe film pays homage to the cinematic work of Woody Allen, particularly the 1979 film Manhattan. In the Allen film, a 17-year-old girl (Mariel Hemingway) begins a romantic relationship with a 42-year-old man played by Allen.\n\nA common criticism of I Love You, Daddy is that the film parallels the long-standing sexual abuse allegations against Allen. \"We're at the bleeding edge of 'That's not OK to do now,' but those people are still around,\" C.K. said about dealing with the controversial topics in the film. \"That's a very interesting line to be on.\"\n\nNov. 9, 11:55 a.m. Updated to include details from the published New York Times report.\n\nNov. 9, 1:00 p.m. This story has been updated to include The Orchard's second statement.\n\nNov. 10, 7:15 a.m. Updated to include The Orchard dropping I Love You, Daddy.\n\nNov. 10, 11 a.m. Updated with C.K. statement.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/09/iloveyoudaddy_02-h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2017/09/iloveyoudaddy_02-h_2017.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/09/iloveyoudaddy_02-h_2017.jpg", "keywords": [], "authors": ["Katherine Schaffstall", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/louis-cks-movie-premiere-canceled-advance-ny-times-story-1056585", "title": "Louis C.K.'s Movie Premiere Canceled in Advance of N.Y. Times Story", "meta_data": {"viewport": "width=device-width", "description": "The 'I Love You, Daddy' screening was abruptly axed just hours before it was set to take place.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/louis-cks-movie-premiere-canceled-advance-ny-times-story-1056585", "domain": "https://www.hollywoodreporter.com/", "title": "Louis C.K.'s Movie Premiere Canceled in Advance of N.Y. Times Story", "description": "The 'I Love You, Daddy' screening was abruptly axed just hours before it was set to take place.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/09/iloveyoudaddy_02-h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Louis C.K.'s Movie Premiere Canceled in Advance of N.Y. Times Story", "description": "The 'I Love You, Daddy' screening was abruptly axed just hours before it was set to take place.", "url": "https://www.hollywoodreporter.com/news/louis-cks-movie-premiere-canceled-advance-ny-times-story-1056585", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/09/iloveyoudaddy_02-h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Louis C.K.'s Movie Premiere Canceled in Advance of N.Y. Times Story", "sailthru.description": "The 'I Love You, Daddy' screening was abruptly axed just hours before it was set to take place.", "sailthru.author": "Katherine Schaffstall", "sailthru.vertical": "Movies", "sailthru.date": "2017-11-09 09:44:43", "sailthru.tags": "Movies,Television,Culture,Louis C.K.,I Love You Daddy,nsfs"}, "movies": [], "publish_date": 1510191883.0, "source": "https://www.hollywoodreporter.com", "summary": ""}