{"url": "https://www.thewrap.com/kristen-bell-ted-danson-good-place/", "text": "This story about Kristen Bell, Ted Danson and “The Good Place” first appeared in the Comedy/Drama/Actors issue of TheWrap’s Emmy magazine.\n\nHeaven or hell? Devil or angel? And does it even matter?\n\nNBC’s delightful comedy series “The Good Place” started out as a vision of paradise, albeit a rather odd and completely secular paradise; it ended its first season with the show-shattering reveal that our human characters had actually been spending their time in a radical new version of hell designed to get them to torture each other rather than leaving that job to the pros.\n\nAnd in Season 2, the show from “Parks and Recreation” creator Mike Schur kept upending itself in the most delicious of ways.\n\nThis is a show that can make hell kind of charming and give a fun, cuddly twist to the afterlife. Kristen Bell somehow makes us root for a woman whose self-obsession knows no bounds but who’s smarter and maybe even nicer than she lets on. Ted Danson was a scene stealer even in the first season as a human-torturing demon who had to hide his true nature from the other characters and from the audience.\n\n(Granted, words like demon may not be appropriate for an altogether nonreligious and bureaucratic afterworld; he’s middle management at best, and not very good at his job of torturing humans.)\n\nAlso Read: 'Good Place' Creator Mike Schur Confirms Exactly Where Eleanor and the Gang Are in Season 3\n\nOn a break early in the filming of Season 3, Bell and Danson discussed the pleasures and challenges of a show that delights in blowing up its own premise over and over. (Warning: spoilers ahead.)\n\nSeason 2 must have been a real kick for you, Ted, because you finally got to…\n\nTED DANSON Be who I am. Yeah, it was really fun. And it was easier to find the funny, because funny usually is this kind of triangular thing between you, another character and the audience. But I had no relationship to the audience in Season 1. They never saw me in a private moment, or I would have been twirling my mustache.\n\nWould you have taken the part without the knowledge that eventually you were going to get to show who this guy really is?\n\nDANSON Oh, I would have done it. I signed on before I saw a script. I knew that Kristen was likely going to do it. I then listened to Mike Schur empty his mind for an hour and tell me everything he knew about the show and the twist. And I really signed up for Mike Schur.\n\nKRISTEN BELL He can tell a story with detail that is frightening, like a computer. “Here’s what I want to do in Episode 9, and it’s a callback to Episode 6…” And I’m like, “You haven’t even written the pilot, bro! Slow down!”\n\nDANSON Is this the first job you’ve taken when you haven’t read a script?\n\nBELL Yeah. Wow. Yeah. We were sold on the idea, with the twist, and with his commitment to cliff-hangers and pulling the rug out from under people. I just thought, “What a goal. Let him try, I’d love to be a part of it.”\n\nAlso Read: Kristen Bell Says 'Good Place' Set Really Is a Good Place - Thanks to 'No Jerks' Policy (Video)\n\nI feel as if Ted needed to know the twist to play his part, but you didn’t.\n\nDANSON But she needed to know in order to take the part.\n\nBELL Well, yes and no. Mike is an unparalleled collaborator, and I think he had respect enough for me to say, “I would like you to know what you’re signing up for.” So he opened the whole kimono that day.\n\nWas it frustrating to hide who this guy was, Ted?\n\nDANSON I don’t know about frustrating, because I had my hands full just trying to fulfill the script. But watching it, I would go, “You’re either doing a really good job, Ted, or that’s some of the worst acting I’ve ever seen.” And I couldn’t quite make up my mind.\n\nBELL Around Episode 8 of the first season, my husband [Dax Shepard] said, “I love your show, but my one critique is that Ted is just wildly underused. He’s just kind of one-note.” And I didn’t tell him the twist, because I can keep a secret.\n\nDANSON [Silently mouths] I can’t.\n\nAlso Read: 'The Good Place' Stars Ted Danson and Kristen Bell Portraits (Exclusive Photos)\n\nBELL I couldn’t tell him that there was a very specific reason you’ve never seen Michael on camera by himself, that all those choices were leading up to something wonderful.\n\nDANSON It was hard.\n\nBELL Keeping the secret?\n\nDANSON No, that was easy, because I didn’t. But I didn’t know how to be funny.\n\nBELL I don’t think you realize how funny it is when you’re bumbling.\n\nDANSON I don’t.\n\nBELL It’s pretty cute.\n\nAlso Read: 'The Good Place' Star D'Arcy Carden Teases Season 3 Surprises: 'Whew, Baby!' (Video)\n\nSo Kristen, were you looking forward to working with the unleashed Ted Danson in Season 2?\n\nBELL Big time. That terrifying cackle he gave at the end of Season 1, I was like, “What is in store?”\n\nWhat’s in store is that Michael changes — he starts the season torturing humans and ends as something of a guardian angel.\n\nDANSON Well, he’s madly in love with humans. And I think he recognizes that Eleanor’s way smarter than he is.\n\nBELL I agree.\n\nDANSON He watches her change and still be doomed. And if you can change in the afterlife, you should be able to garner points or something. The system sucks, and it just seems horribly unfair to him that people he’s grown to love don’t stand a chance to be in the Good Place.\n\nAs a viewer, I have no idea where the show is going in Season 3. You blew up the premise at the end of Season 1, then took the setting for both seasons and stuck it in a museum on hell. The humans are back on Earth, but for how long?\n\nDANSON Nice try, thinking you can get us to tell you something about Season 3. Not me.\n\nBELL It’s impossible not to say at the end of each of our seasons, “Where on Earth are they going to put us?” No pun intended. “What is going to happen, how could we possibly raise the stakes?” But they figure it out. They are given a problem in that writers room and they figure it out. I don’t even know how they do it, but it’s fascinating what they do.\n\nAlso Read: Kristen Bell Says 'Good Place' Set Really Is a Good Place - Thanks to 'No Jerks' Policy (Video)\n\nKristen, when you were on TheWrap’s comedy actors panel, you talked about how we’re in a time where we need heroes who are good — that we’re not looking for Walter White or Tony Soprano anymore. Do you think this is a show for its time?\n\nBELL I do. I think that when your reality is comfortable, you can be entertained by something uncomfortable. When your reality is more uncomfortable, I think you want to see people fighting for good. You want to see something relatable: “Oh, those people are in a crazy/s—ty situation as well, and they’re figuring it out, and they have hope and drive.”\n\nI think that’s why our show has been successful, because people enjoy that these characters are fighting for goodness amidst all their bumbling complexities and idiotic behavior.\n\nDANSON When I think about Mike Schur, one of the things I think about is that he’s a decent man. And I think to talk about decency and ethics and consequences and do it with a 9-year-old’s fart sense of humor and magical visual effects, it’s just brilliant.\n\nWas the morality of it, for lack of a better word, one of the reasons you were interested?\n\nDANSON I don’t think I got it until I started watching the shows and would see Eleanor wrap up a little moral to our story. It took me a while to get it. You must have gotten it faster.\n\nBELL For sure. In that love fest with Mike in our first meeting, I realized that he, too, has long been preoccupied with what it means to be a good person. I felt a connection with him.\n\nAlso Read: Ryan Hansen Trolls 'Veronica Mars' Fans, Dupes Kristen Bell Into Saving His YouTube Red Show (Video)\n\nSo you have that preoccupation as well?\n\nBELL Oh, yeah. It began as your regular old therapeutic codependency. I wanted to please people, and I want to be liked, and I’m afraid to disappoint people. And in learning how to manage that a little bit more, and figure out how to be good to myself with self-care and boundaries, I realized that a lot of my codependency was things that I really enjoyed, and some of it wasn’t codependency at all. It was just who I wanted to be.\n\nThere is a part that recognizes that good behavior makes me feel good. Who knows if there will ever be a reward, but the reward of feeling good is enough for me right now.\n\nTed, was it as much fun for you as it was for the audience when you showed up as a bartender in a scene late in Season 2?\n\nDANSON No! I hate getting behind a bar. It took me a year on “Cheers” to not be embarrassed or shy. I was so not a bar person or a confident Romeo. I was a backwards, shy kind of kid. Took me almost a year to get that Sam Malone relief-pitcher, bartender arrogance. So having stopped that, I seriously have anxiety stepping behind a bar. It was a great scene, but I was so uncomfortable.\n\nAlso Read: Kristen Bell Knows How 'The Good Place' Ultimately Ends\n\nHad you two met before this series?\n\nBELL We had. My husband and I had just watched the first season of “Damages,” which is so good. Ted plays Arthur Frobisher, and we were so obsessed with it that for that year or two, we changed our alias to get mail to Holly and Arthur Frobisher.\n\nThen I booked this movie called “Big Miracle,” which Ted was also in. And I met him for the first time in Alaska in this lobby of the hotel. And I said, “Hello, Mr. Danson, my name is Kristen Bell. I don’t want to freak you out, but I do want to let you know that I am checked into this hotel as Holly Frobisher.” And he was like, “Oh, OK. Very nice to meet you.” I realized in retrospect that was maybe not a good opener.\n\nDANSON Captain Cook.\n\nBELL It was the Captain Cook Hotel. Did it freak you out when I told you I was checked in as Mrs. Frobisher?\n\nDANSON Well, maybe.\n\nBELL Did you, like, tell the ADs to keep me away?\n\nDANSON No. And now that I know you and Dax, I can see how much fun you must have had doing it.\n\nBELL Oh, we loved it.\n\nAlso Read: Natalie Morales to Reunite With 'Parks and Recreation' Co-Creator Mike Schur for 'Abby's'\n\nI hear you took Ted to his first escape room, and I’m wondering if there will be a second.\n\nDANSON No. No f—ing way.\n\nBELL Shut up! There will be a second escape room. First of all, if Mary [Steenburgen, Danson’s wife] and I have anything to say about it, there will be.\n\nDANSON Mary is dying to go again.\n\nBELL I should have done more research, so this one is on me. I should have realized that this was an escape room where A, they split your group up, which is already no fun, and B, they turn off the lights, so it’s pitch black. You are given flashlights, and Ted just sat down on the little twin bed that was in the room and handed Dax his flashlight…\n\nDANSON And just stretched out.\n\nBELL Meanwhile, Mary was killing it on our side. She was an amazing detective.\n\nDANSON It wasn’t just that the lights were out and I like to take naps. It’s also that I was with the guys, and the guys are meant to relax. If I’m around women, I’m up and interested. If it’s the guys, I’m gonna stretch out. There’s no one to impress.\n\nAlso Read: How the 2018 Emmys Actor and Actress Hopefuls Beat Hollywood's Expectations (Video)\n\nGetting back to your show, do you have any ideas of how you’d like things to end for your characters?\n\nDANSON I can guarantee that whatever I could possibly imagine would fall so short of whatever comes out of Mike’s noggin.\n\nBELL Ditto. Yeah. We know our place, and we’re so happy to live here.\n\nIt’s a good place?\n\nBELL Exactly. I have no problem leaving the heavy lifting up to them.\n\nRead more of TheWrap’s Comedy/Drama/Actors Emmy issue here.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2018/06/Jennifer-Bassey-1-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-1.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2018/06/Kristen-Bell-1.jpg", "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2018/05/GROUP_-1-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2018/06/Kristen-Bell-3.jpg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/uploads/2018/06/EmmyWrap-Good-Place-cover-Ted-Danson-Kristen-Bell.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2018/06/The-Good-Place-1.jpg", "https://www.thewrap.com/wp-content/uploads/2013/09/EmmyAward.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2018/06/cover_spread_opener.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2018/06/Versace-4-160x105.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place.jpg", "keywords": [], "authors": ["Steve Pond", "Matt Donnelly", "Reid Nakamura"], "canonical_link": "https://www.thewrap.com/kristen-bell-ted-danson-good-place/", "title": "Kristen Bell and Ted Danson Dish on ‘The Good Place’ and Their Real-Life Bad Places", "meta_data": {"parsely-title": "Kristen Bell and Ted Danson Dish on ‘The Good Place’ and Their Real-Life Bad Places", "parsely-link": "https://www.thewrap.com/kristen-bell-ted-danson-good-place/", "parsely-type": "post", "parsely-pub-date": "2018-06-20T09:00:44-07:00", "parsely-section": "awards", "parsely-author": "Steve Pond", "parsely-tags": "awards, emmy_awards, emmys, kristen_bell, mike_schur, ted_danson, the-good-place, wrap-magazine", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "TheWrap Emmy magazine: Hint: Don't take The Good Place star Ted Danson to an escape room, the way Kristen Bell recently did", "news_keywords": "awards, emmy awards, emmys, kristen bell, mike schur, ted danson, the good place, wrap magazine", "original-source": "https://www.thewrap.com/kristen-bell-ted-danson-good-place/", "og": {"locale": "en_US", "type": "article", "title": "Kristen Bell and Ted Danson Dish on 'The Good Place' and Their Real-Life Bad Places", "description": "TheWrap Emmy magazine: Hint: Don't take The Good Place star Ted Danson to an escape room, the way Kristen Bell recently did", "url": "https://www.thewrap.com/kristen-bell-ted-danson-good-place/", "site_name": "TheWrap", "updated_time": "2018-06-20T15:56:50-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "https://www.facebook.com/steve.pond.399?ref=tn_tnmn", "tag": "wrap magazine", "section": "Awards", "published_time": "2018-06-20T16:00:44-07:00", "modified_time": "2018-06-20T15:56:50-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "TheWrap Emmy magazine: Hint: Don't take The Good Place star Ted Danson to an escape room, the way Kristen Bell recently did", "title": "Kristen Bell and Ted Danson Dish on 'The Good Place' and Their Real-Life Bad Places", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place.jpg", "creator": "@stevepond"}, "generator": "WooFramework 6.2.0", "sailthru.title": "Kristen Bell and Ted Danson Dish on ‘The Good Place’ and Their Real-Life Bad Places", "sailthru.date": "2018-06-20T16:00:44+00:00", "sailthru.author": "Steve Pond", "sailthru.tags": "emmys,kristen bell,emmy awards,ted danson,mike schur,awards,wrap magazine,the good place", "sailthru.category": "awards,tv,steve pond,emmys,wrap magazine", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/06/Ted-Danson-Kristen-Bell-The-Good-Place-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1529535644.0, "source": "https://www.thewrap.com", "summary": ""}