{"url": "https://www.vulture.com/2017/08/im-too-sexy-taylor-swift-new-song-explained.html", "text": "Taylor and “I’m Too Sexy” is the latest example of artists preempting lawsuits post–”Blurred Lines.”\n\nIt’s impossible to miss: From the moment Taylor Swift exclaims “ooh!” and barrels into the taunting titular chorus of her new single, “Look What You Made Me Do,” the words to another song reflexively start to roll off the tongue. “I’m too sexy for my shirt, so sexy it hurts,” you might accidentally sing instead, with a strut. Where the hell did that come from? This isn’t a mind game: Taylor’s first single off Reputation does actually contain rhythmic elements from Right Said Fred’s 1991 hit parody of every guy known to take gym-mirror selfies.\n\nBut rather than give a nod to the song’s origins with a sample, all three members who wrote the British Europop guilty pleasure — Fred Fairbrass, Richard Fairbrass, and Rob Manzoli — are each credited as co-songwriters on Taylor’s song. With such recognition, Swift and the song’s producer, Jack Antonoff, are acknowledging that their use of “I’m Too Sexy” is more than a sample — it’s a full, unexpected interpolation that, up until recently, might not have translated to any compensation for the artists who came up with the original.\n\nRight Said Fred are shocked, too. The three members weren’t even aware of Taylor’s interest in tinkering with “I’m Too Sexy” until two days ago, and none of them got to listen to the finished product until today, with the rest of the world. Fred Fairbrass tells Vulture that, not long ago, Swift, Antonoff, and their publishers reached out to Right Said Fred’s publishing company, Spirit Music Group, and asked for permission to interpolate the song. (Meaning Swift and Antonoff incorporated an original recording of “I’m Too Sexy” into their mix, rather than use the original masters.) But it was unbeknownst to the band that the woman making the request was the Taylor Swift. “We trust our publisher to know what we agree and don’t agree to,” Fairbrass says, so he and his bandmates never thought to ask. Meanwhile, their publishers negotiated on the band’s behalf, though Fairbrass isn’t sure whose idea it was to make them co-songwriters versus clearing a sample.\n\nCall it the “Blurred Lines” precedent. Since Robin Thicke and Pharrell lost the 2015 copyright lawsuit over their song after a jury found the two artists lifted more than just a “vibe” from Marvin Gaye’s “Got to Give It Up,” several artists have taken the preemptive measure of handing out co-credits to avoid similar plagiarism accusations. Since then, Sam Smith, Bruno Mars, and Mark Ronson have all had to give credit to artists whose songs it appeared they borrowed too much from after being sued. But a more recent example — Ed Sheeran sharing credit with TLC’s “No Scrubs” songwriters on “Shape of You” before anyone suspicious of a resemblance could file a lawsuit — better represents the new industry standard Swift and Antonoff appear to be following. However, in the same breath, the song also contains an uncredited sample of Peaches’s “Operate.” (Vulture has reached out to Peaches for comment.)\n\n“Look What You Made Me Do” isn’t the first time Right Said Fred has been asked to consent to another artist using “I’m Too Sexy” — they say they’ve also been illegally sampled on more underground club mixes than they can count — but it is one of the few times they’ve been compensated so handsomely, and they wish that were the norm. “Songwriters are the life blood of the industry. Artists and writers of all varying degrees of success should be treated fairly,” Fairbrass says. “How Taylor and her team have treated us should be commended. Time and again we see artists go ahead with clearly stolen ideas, but we’ve been treated fairly.” Fairbrass won’t reveal the percentage of the band’s co-writing credit or how much they’ve been paid, but they are expecting to see a considerable sales boost: “It will affect our royalty stream, we’re very aware of that. We’ve seen bumps in our royalties when the song is used in a movie or a commercial, but this is going to be of a different level,” he says. “But we’re an independent band, we’ve paid for everything since we started; we’ve never had a major record deal. So, for us, this is cash flow that will fund our successes and our failures.”\n\nLast year, “I’m Too Sexy” celebrated 25 years of camp glory, but Fairbrass never expected one of the most powerful figures in music to repurpose it now. “Longevity for all artists is quite difficult, and to have a song last 26 years later and to get this profile is very rare. Our first gig was with Suicide; we’ve been playing a very long time,” he says. According to Fairbrass, the band are content knowing their song has been paired with a song as equally “cynical” as the original — and by an artist whose work has been treated with legitimacy: “To have a big artist like Taylor Swift now give your song the thumbs up is amazing.”", "images": ["https://pyxis.nymag.com/v1/imgs/fe8/e8d/b3a3a18e7193e5dfe0e3cc5d0a5d9fcc55-27-taylor-iamtoosexy.1x.rsocial.w1200.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/08/27/27-taylor-iamtoosexy.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/fe8/e8d/b3a3a18e7193e5dfe0e3cc5d0a5d9fcc55-27-taylor-iamtoosexy.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Dee Lockett"], "canonical_link": "https://www.vulture.com/2017/08/im-too-sexy-taylor-swift-new-song-explained.html", "title": "How ‘I’m Too Sexy’ Ended Up in Taylor Swift’s ‘Look What You Made Me Do’", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "How ‘I’m Too Sexy’ Ended Up in Taylor Swift’s ‘Look What You Made Me Do’", "url": "https://www.vulture.com/2017/08/im-too-sexy-taylor-swift-new-song-explained.html", "description": "Right Said Fred didn’t know Taylor Swift wanted to use their song until two days ago.", "image": "https://pyxis.nymag.com/v1/imgs/fe8/e8d/b3a3a18e7193e5dfe0e3cc5d0a5d9fcc55-27-taylor-iamtoosexy.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "How ‘I’m Too Sexy’ Ended Up in Taylor Swift’s New Song", "description": "Right Said Fred didn’t know Taylor Swift wanted to use their song until two days ago.", "image": "https://pyxis.nymag.com/v1/imgs/fe8/e8d/b3a3a18e7193e5dfe0e3cc5d0a5d9fcc55-27-taylor-iamtoosexy.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-08-25T18:45:45.242-04:00", "tag": "taylor swift, i'm too sexy, right said fred, look what you made me do, music, music copyrights", "publisher": "https://www.facebook.com/Vulture"}, "description": "Right Said Fred explain how “I’m Too Sexy” ended up in Taylor Swift’s “Look What You Made Me Do.”", "sailthru.tags": "taylor swift, i'm too sexy, right said fred, look what you made me do, music, music copyrights", "author": "Dee Lockett", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1503701145.242, "source": "https://www.vulture.com", "summary": ""}