{"url": "people.com/tv/scott-disick-sofia-richie-breakup-timeline/", "text": "Forget keeping up with the Kardashians — can you keep up with Scott Disick and Sofia Richie?\n\nAlmost a year after they first sparked romance rumors, Sofia, 19, pulled the plug on her relationship with Disick, 35, amid allegations that the father of three cheated on her. But days later, Disick denied they had ever broken up.\n\nGet push notifications with news, features and more.\n\nFrom their first flirtations to their recent split, here’s a complete timeline of their relationship.\n\nSummer Love\n\nDisick was first seen cuddling with the daughter of Lionel Richie aboard a yacht in Cannes in May 2017, when she was 18. At the time, Sofia denied any romance, tweeting, “Just so everyone can get their panties out of their a—es, Scott and I are just homies,” adding the hashtag #relax.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nImage zoom Romain Maurice/Getty Images for Haute Living\n\nWhat Happens in Vegas\n\nDespite her tweet, the two were seen leaving Nobu in Malibu arm-in-arm together the following month.\n\nThe very next day, Sofia joined the self-proclaimed “lord” in Las Vegas for a late dinner at Stack restaurant along with a group of friends.\n\nImage zoom SplashNews\n\n‘Inseparable’\n\nThings started to heat up in September, when sources told PEOPLE the two had grown closer.\n\n“Since returning to L.A., Scott and Sofia are inseparable,” said the source. “They are spending every day together. Sofia seems smitten.”\n\n“It’s obvious she looks up to Scott,” said another source. “She constantly giggles around him. They are very flirty. Scott takes care of her, opens the car door and pays for everything.”\n\nInstagram Official\n\nThe two made things official on Instagram days later, when videos surfaced of the two sharing a kiss and receiving a “congratulations” cake during a trip to Miami.\n\nImage zoom Alec Monopoly/Instagram\n\nImage zoom Scott Disick/Instagram\n\nAround the World\n\nThe two grew closer as they began to travel together, taking more trips to Miami, then Mexico and later Milan.\n\nA source close to Disick told PEOPLE at the time that Sofia had begun calling Disick her “boyfriend,” adding, “She thinks he’s the best.”\n\nAnd it appeared the feeling was mutual: “Scott likes having her around,” added the source. “She isn’t a wild party animal.”\n\nImage zoom Splash News\n\nImage zoom Sofia Richie/Instagram\n\nWhile the two seemed to be happy together, one person had their reservations: Richie patriarch Lionel. A source close to the singer told PEOPLE in October that Lionel “thinks Scott is the worst person she could ever see and that he raised her better than that.”\n\n“He thinks she should have more respect for herself as a young woman,” the source continued. “Lionel knows Scott’s playboy ways and he doesn’t want to see his daughter get hurt.”\n\nImage zoom Rob Latour/Variety/REX/Shutterstock\n\nFizzling Out?\n\nBy November, a source told PEOPLE the romance had begun to “fizzle”.\n\n“They’re starting to argue more, and it’s bothering Sofia,” the source said. “She thought he would be more serious about their relationship and is finding herself to be more frustrated with him as time goes on. Everything everyone has been telling her to look out for, she’s now starting to see for herself. It’s really upsetting for her, but she is trying to work through it.”\n\nBut the tensions in the relationship didn’t seem to last long, with the couple being spotted on vacation in Mexico days later.\n\nLater that month, the model opened up about her relationship on the red carpet at the SAG-AFTRA Foundation Patron of the Artists Awards in Beverly Hills, telling E! News that her father had been “very supportive” of their relationship.\n\n“I am into her business and she’s trying to keep me out of her business,” added Lionel, 68.\n\n“He’s been very cool. He’s very supportive, whatever that means,” Sofia said as Lionel jokingly pointed a gun-shaped hand gesture at his head.\n\nOfficial Debut\n\nDisick and Sofia made their official debut as a couple in December at a party for DuJour magazine, arriving together at the Confidante Hotel in Miami.\n\nAlthough Sofia posed solo on the red carpet, the lovebirds were seen “chatting and kissing throughout the night,” sources told PEOPLE.\n\nImage zoom Andrew Toth/Getty\n\nThe couple coordinating their looks — she in a body-hugging, long-sleeved black mini dress and he in black pants and a black button-down exposing his chest.\n\nThe two also made an appearance at Art Basel, where they were followed by a camera crew that filmed their every move, including their PDA.\n\nAn onlooker told PEOPLE that the couple was affectionate throughout the night, sharing cell phones to take photos. The onlooker added Sofia even placed Disick’s phone in his back pocket before giving him a “sweet kiss on the cheek.”\n\nFirst Christmas\n\nThe lovebirds went on to celebrate their first Christmas season together, with Sofia getting into the holiday spirit by dancing around the kitchen to Lionel’s 1983 classic “All Night Long (All Night)” while dressed in some Santa-themed sleepwear — minus the pants. (She paired the top with some white briefs and matching cozy socks.)\n\nRELATED VIDEO: Sofia Richie and Scott Disick Kick Off Their Christmas Weekend Together\n\nShe put on the routine for her boyfriend, who shared her dance moves on his Instagram stories, labeling the video simply, “Night.”\n\nBut Disick later flew solo at the annual Christmas Eve party hosted by his ex Kourtney Kardashian‘s mom Kris Jenner.\n\nHitting the Slopes\n\nThe pair was spotted in Aspen, Colorado in late December, after sharing several photos of themselves boarding a private jet together.\n\n“I’m on a whole new year vibe,” Disick captioned a picture of him and Richie cozied up together before take off.\n\nDate Night\n\nImage zoom BACKGRID\n\nAfter ringing in the new year with a romantic trip to Aspen, Colorado, the couple was spotted leaving Toscana after a dinner date in Los Angeles in early January. The two held hands as they left the restaurant, wearing coordinating black and white outfits, with Richie showing off her abs in a crop top.\n\nThrowing Shade\n\nOn Jan. 27, Kendall Jenner left a pointed comment on a photo shared by a fan account of Disick riding in a car with Sofia and the children he shares with ex Kourtney: sons Reign, 3, Mason, 8, and daughter Penelope, 5½.\n\n“Awww Scott and his kids,” wrote Kendall, shading the couple’s age gap.\n\n“You could tell that the kids don’t know Sofia well because they weren’t holding her hand. Instead, they all stayed close to Scott,” a source told PEOPLE of the dinner. “It was a short dinner. Scott and Sofia were not affectionate. The kids seemed fine with her, but all sat close to Scott. He helped them at dinner and with potty breaks.”\n\nThe source added, “Sofia acted like Scott’s friend and you could tell she was trying a gentle approach to get his kids’ approval.”\n\nAt the time, a source also told PEOPLE that Kourtney, 39, didn’t react positively to the news at first.\n\n“Like most people, she thinks Sofia is way too young for him and doesn’t get it,” said the insider.\n\nCoordinating Couple\n\nImage zoom MEGA\n\nDespite Kendall’s subtle shade, the couple showed no signs of slowing down the romance.\n\nOn Feb. 8, they enjoyed a date night out at Nobu in Malibu wearing matching camouflage ensembles. Richie sported a slouchy top, baggy camouflage pants and crisp white Reebok sneakers, while Disick opted for an camo hoodie, black pants and white sneakers that matched his girlfriend’s.\n\nPuppy Love\n\nImage zoom Sofia Richie/Instagram\n\nAt the Issey Miyake Launch Party at Milk Studios in Los Angeles on Feb. 22, Sofia told PEOPLE exclusively about how her boyfriend came up with the name for her new wiener dog, gifted to her by Disick.\n\n“Her name’s [Hershela],” she said, not specifying the exact spelling. “My boyfriend named her … I kind of just ran with it. It made me laugh. I liked Hershey and he liked Hershela, so it was like a middle ground.”\n\n“He wanted the dog for a while, but he ended up surprising me with it,” she added.\n\nFamily Vacations\n\nThe following month, Sofia and Disick hit another milestone in their relationship: In late March, they took a vacation with his three kids, flying to Cabo San Lucas via private jet, where they stayed at the luxury Chilean Bay resort & residences.\n\nA source told PEOPLE they were “having fun in the sun” and spent time “swimming in the pools and enjoying the resort.”\n\nRomantic Gestures\n\nIn late April, Sofia took to Instagram to show off Disick’s latest romantic gesture, sharing a photo of him posing on a bed with rose petals in the shape of a heart.\n\nBirthday Boy\n\nTo celebrate Disick’s 35th birthday on May 26, the couple flew to St. Barts with his three kids.\n\nRELATED: Scott Disick Gets Birthday Foot Massage from Girlfriend Sofia Richie: ‘Could Be Worse’\n\nSofia wished her man a happy birthday with a photo of the two getting cozy in the water. Later that evening, she shared a photo on her Instagram story of them sharing a kiss on the lips.\n\n“Happy birthday babe! Thank you for being you,” she captioned the post. “Love you.”\n\nImage zoom Sofia Richie/Instagram\n\nWhile the two were vacationing, a source told PEOPLE that Kourtney had begun to warm up to the relationship.\n\n“It helps that Kourtney now trusts Sofia,” said the insider. “The kids are allowed to spend time with her. Sofia likes having them and helps Scott. So far, the kids are giving Kourtney good reports about Sofia.”\n\nRELATED: Scott Disick Has ‘Come to Terms’ with the Fact that Kourtney Kardashian Has Moved on: Source\n\n“Sofia has shown over and over again that she is willing to stay with Scott even when things are not great — but Scott is doing well lately,” added the source.\n\nIt’s Over\n\nThings took a turn last week when Disick was spotted looking flirty with a mystery woman at Kanye West‘s Ye listening party in Jackson Hole, Wyoming, on Thursday night. Disick reportedly told guests that he and Richie were no longer together, according to TMZ.\n\nOver the weekend, a source confirmed to PEOPLE that Sofia had called it quits.\n\n“Sofia broke up with Scott,” said the insider, adding that Disick’s “old issues” contributed to the split.\n\n“When Scott drinks, he is a sloppy mess and fools around,” said the source.\n\nA second source added that Disick “cheated on her, and she confronted him.”\n\nAs for how Disick is dealing with the break up?\n\n“Scott seems fine,” said the first source. “He even thinks she might change her mind. He isn’t really taking it seriously.”\n\nThe second source also speculated that “it’s likely not totally over.”\n\n“They’ve broken up multiple times since they started dating and always ended up back together,” said the insider. “No one would be surprised if they’re out again together in a few days or weeks.”\n\nMoving Out\n\nAlthough multiple insiders said there’s a good chance for a reconciliation, one source confirmed to PEOPLE that Sofia moved out of Disick’s house after the breakup to stay with her dad, music icon Lionel Richie.\n\n“She has been living at Lionel’s house for the past couple of days,” said the source. “She is looking for her own place.”\n\nAs for how Sofia is adjusting to the breakup? “She seems to be doing okay,” added the insider. “She is surrounding herself with girlfriends and keeping busy.”\n\nNot So Fast\n\nBy Monday, the duo appeared to have reconciled and were spotted leaving beachside eatery Nobu in Malibu before hitting up a grocery store together.\n\nImage zoom BENS / BACKGRID\n\nImage zoom Scott Disick/Instagram\n\nDisick also publicly denied that the two had ever split, posting a screenshot on his Instagram story of a TMZ headline that read: “Sofia Richie & Scott Disick Still Together.”\n\n“We had no idea we even broke up but thanks for thinking of us,” he captioned the post.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fscott-disick1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fsofia-richie-scott-disick-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fsofia-richie-a.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fnicole-richie-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Flionel-nicole-richie-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fdisick-richie-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fscott-disick-sofia-richie-4-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fsofia-richie-scott-disick-2-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fscott-disick-c.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fsofia.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1422&h=745&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fscott-disick-sofia-richie-4-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fscott-disick1-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fscott-disick-b1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fdisick-richie-1-2000-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fsofia-richie2-2.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1422&h=745&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fscott-disick-sofia-richie-4-2000.jpg", "keywords": [], "authors": ["Alexia Fernandez", "Aurelie Corinthios"], "canonical_link": "https://people.com/tv/scott-disick-sofia-richie-breakup-timeline/", "title": "Scott Disick & Sofia Richie Break Up — Then Get Back Together: Inside Their Roller Coaster Romance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Breakups,Kardashians,Kourtney Kardashian,News,Scott Disick,Sofia Richie,TV", "news_keywords": "Breakups,Kardashians,Kourtney Kardashian,News,Scott Disick,Sofia Richie,TV", "description": "Sofia Richie, 19, and Scott Disick, 35, were first linked in May 2017", "og": {"title": "Scott Disick & Sofia Richie Break Up — Then Get Back Together: Inside Their Roller Coaster Romance", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/scott-disick-sofia-richie-breakup-timeline/", "description": "Forget keeping up with the Kardashians — can you keep up with&nbsp;Scott Disick and Sofia Richie? Almost a year after they first sparked romance rumors,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1422&h=745&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fscott-disick-sofia-richie-4-2000.jpg", "width": 1422, "height": 745}}, "pinterest": {"url": "https://people.com/tv/scott-disick-sofia-richie-breakup-timeline/", "description": "Sofia Richie, 19, and Scott Disick, 35, were first linked in May 2017", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fscott-disick-sofia-richie-4-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/scott-disick-sofia-richie-breakup-timeline/", "title": "Scott Disick & Sofia Richie Break Up — Then Get Back Together: Inside Their Roller Coaster Romance", "description": "Sofia Richie, 19, and Scott Disick, 35, were first linked in May 2017", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1422&h=745&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fscott-disick-sofia-richie-4-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}