{"url": "https://people.com/music/taylor-swift-ready-for-it-music-video-easter-eggs/", "text": "Swifties weren’t ready for it, but the newly released music video for “…Ready for It?” contains specific Easter eggs and could be validating some popular fan theories. Let the games begin!\n\nIn the anime-inspired visual, Taylor Swift plays with themes seen in sci-fi films such as Tron and Blade Runner as well as Ghost in the Shell, specifically Major Motoko’s cyborg shell. A little bit of the video game franchise Final Fantasy, perhaps?\n\nGet push notifications with news, features and more.\n\nAnd the latest Joseph Kahn-directed footage even contains follow-up references originally made in the “Look What You Made Me Do” video as well as her past music videos. (Proof that the old Taylor Swift is alive and well!)\n\n1. Shout-outs to Boyfriend Joe Alwyn\n\nLook closely in the opening scenes and you’ll find the number 89 – a nod to her birth year and album title, 1989. And what’s that 91 in yellow? It could be Alwyn’s birth year: 1991.\n\nAfter all, she does sing: “Knew he was a killer/ First time that I saw him.” Alwyn’s first-ever movie was last year’s Billy Lynn’s Long Halftime Walk, in which he starred as a U.S. soldier stricken with PTSD after a deadly firefight during the Iraq war.\n\nAnother shout-out to Alwyn: The name “Joseph” is in Chinese calligraphy at 0:28. Or could it be for the director?\n\n2. The Snake Is Back\n\nDon’t think the snake references are gone! Swift slyly included “Year of the Snake” (蛇年) in Chinese calligraphy seen in one of the alleyways (at 0:22).\n\nSwift has been embracing the snake image and using it to promote her new music, most prominently in “Look What You Made Me Do,” with a CGI snake. In addition, she’ is selling slithering merchandise in support of her upcoming Reputation album.\n\nAnd remember her feud with Kim Kardashian West? The reality star previously banned commenters from using the snake emoji on her Instagram, and instead was flooded with the reptile in the comment sections.\n\n3. Secret Messages Hiding on the Walls\n\nThe star sends messages to her Swifties with affirmations on the wall as well as her favorite number, 13.\n\nThere’s even a reference to the latest single off of Reputation: “Gorgeous.”\n\n4. Breaking Free from the Media’s Perception\n\nThe glass box that cyborg Taylor is trapped in could be how Swift sees herself against the media.\n\nA possible meaning to the “…Ready for It?” music video: Taylor is the only person to defeat Taylor.\n\n5. Calvin Harris\n\nAll those luminescent lightning bolts could be to refresh everyone’s memory about her songwriting collaboration with ex-boyfriend Harris for the 2016 single with Rihanna “This Is What You Came For.” The lightning bolts are clear references to the single’s cover art and the line, “lighting strikes every time you move” and that color scheme is definitely similar.\n\nAnd remember Nils Sjöberg? Swifties think the singer’s cyborg (cy-berg) getup could possibly be a nod to the pseudonym Swift used for writing credit on “This Is What You Came For.”\n\nKahn also joked about the fake name on Twitter Thursday, writing: “Nils Sjöbot.”\n\n6. Old and New Taylor\n\nThough in “…Ready for It?” it’s clear that Swift is battling herself, there are references to her old music videos.\n\nSwift has collaborated with Kahn for “Blank Space,” “Wildest Dreams” and “Look What You Made Me Do.” Fans noticed similarities in some of the poses from “…Ready for It” in two of Kahn’s past Swift videos: “Out of the Woods” and “Bad Blood.”\n\nIn addition, “Bad Blood” and “…Ready for It?” both featured futuristic themes throughout the videos with similar choreography.\n\n7. White Horse\n\nKeeping with the theory that Swift has revisited many of her past music videos, the Grammy winner also features a white horse, a possible hint to her 2008 track “White Horse” off the Fearless album.\n\nAlso Swift rode a white stallion in her “Blank Space” video.\n\n8. Gold Plane from “Look What You Made Me Do”\n\nObservant fans found in one scene, Swift stands on what resembles a platform that reads “burn all the witches” in spray paint that resembles the plane from the “Look What You Made Me Do” video.\n\n9. Makeup\n\nSwift’s makeup, specifically the winged eyeliner is very similar to that of her “Blank Space” character. And the red lipstick is back too!\n\nImage zoom\n\nReputation drops Nov. 10 and is available for preorder now.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Ftaylor-swift-ready-forit-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Ftaylor-swift-ready-forit-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Ftaylor-swift-ready-forit-3.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/music/taylor-swift-ready-for-it-music-video-easter-eggs/", "title": "All the Easter Eggs in Taylor Swift’s New Video for ‘…Ready for It?'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Calvin Harris,Joe Alwyn,Music News,News,Reputation,Taylor Swift", "news_keywords": "Calvin Harris,Joe Alwyn,Music News,News,Reputation,Taylor Swift", "description": "\"...Ready for It?\" contains specific Easter eggs and could be validating some popular fan theories", "og": {"title": "All the Easter Eggs in Taylor Swift’s New Video for ‘…Ready for It?'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/taylor-swift-ready-for-it-music-video-easter-eggs/", "description": "Swifties weren’t ready for it, but the newly released music video for “…Ready for It?” contains specific Easter eggs and could be validating some popular&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Ftaylor-swift-ready-forit-3.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/taylor-swift-ready-for-it-music-video-easter-eggs/", "description": "\"...Ready for It?\" contains specific Easter eggs and could be validating some popular fan theories", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Ftaylor-swift-ready-forit-3.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/taylor-swift-ready-for-it-music-video-easter-eggs/", "title": "All the Easter Eggs in Taylor Swift’s New Video for ‘…Ready for It?'", "description": "\"...Ready for It?\" contains specific Easter eggs and could be validating some popular fan theories", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Ftaylor-swift-ready-forit-3.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/wIft-t-MQuE"], "publish_date": null, "source": "https://people.com", "summary": ""}