{"url": "https://www.bustle.com/p/wells-adams-just-took-sarah-hyland-on-the-most-bachelor-style-date-ever-5550232", "text": "A birthday date isn't done right unless it involves a private helicopter... said anyone who's ever been on The Bachelor. Wells Adams took girlfriend Sarah Hyland on a helicopter ride for her 27th birthday celebration and it's a cuteness overload fans can't handle. Since competing for JoJo Fletcher's heart on Season 11 of The Bachelorette and appearing on Bachelor in Paradise, the radio host has clearly been trained well (no pun intended) when it comes to impressing the ladies. Basically, Wells Adams is The Bachelor personified.\n\nOn Friday, the reality TV star posted a photo of himself with his Modern Family girlfriend in front of a helicopter (which they took to Catalina, an island off of LA). As if the photo wasn't extravagant enough, the caption is what will really put their shippers over the edge:\n\n\"Top 5 ways helicopters are like Sarah: 1. They make you feel like you're floating. 2. Every moment with them is an adventure. 3. They make you feel like you're falling, in the best way.4. They defy gravity. 5. They are really fucking coolHappy birthday @sarahhyland. You're my favorite thing. Everyday should feel this good. Thanks @vineyardvines for helping out with this amazing date!\"\n\nOne fan wrote, \"Why is he so perfect,\" and another commented, \"No way this is real life.\" Instagram is definitely here for this couple. And until now, their romance has seemed pretty relatable, but The Bachelor in Adams had to come out sooner or later.\n\nSince publicly celebrating their romance over the last few weeks, all eyes have been on Hyland and Adams' every move. Seriously, people were stoked that the couple happened to be wearing \"matching\" plaid button-downs during the plane date (which weren't really matching, for the record).\n\nAnd in Hollywood, are celebrities really dating if they don't go to a professional basketball game together to be truly seen? It's not likely. Which is why these two took their love court side to watch a LA Lakers game together a few days before Hyland's birthday. The date led to this photo, which Adams is very proud exists:\n\nA lot of their fans can catch the action on Hyland's Instagram story, where she likes to frequently post behind-the-scene snippets of their time together. Plus, there was that one time Hyland live-streamed one of their dates, when they shopped, played around, and cuddled up next to a fireplace watching TV with Adams' dog.\n\nWhile most fans seem to approve of the new couple, there are obviously some trolls out there who will have their say. On Nov. 13, the actor posted a photo of herself and Adams lying shirtless in bed with his dog and the caption: \"Two more reasons to smile again.\" After getting backlash on the internet telling her to \"keep [her] sexual life private,\" Hyland took to Twitter to defend herself in a lengthy explanation consisting of multiple screenshots. \"I do want my privacy... This time is different,\" she wrote. \"It’s special. And I will share what I [deem] ‘appropriate’ on social media because I still want you all to be updated.\"\n\nAfter fans speculated their romance (since they had coordinating Stranger Things Halloween costumes), the two made it Instagram official with respective posts on Nov. 5. Adams posted a photo of the two kissing and Hyland posted one of them goofing around with the caption: \"He puts up with me.\" Within the next few days, Adams was watching Hyland perform and Hyland wore a \"W\" necklace.\n\nAlthough the romance seems to be yet another product of Hollywood matchmaking, Hyland and Adams were apparently fans of each other long before they met. In July 2016, Hyland shamelessly tweeted about Adams and how attractive she found him when he was on The Bachelorette. In August, 2017, Adams tweeted at Hyland, flirtatiously asking her to give him a hand as bartender on BiP. It's unclear how they ultimately ended up meeting, but does it really matter at this point? Hopefully Adams will contonue giving the crowd what it wants: more Bachelor-style dates, pronto.", "images": ["https://imgix.bustle.com/uploads/image/2017/11/25/3ceae745-5099-46f1-a085-47b4fac1ffd0-screen-shot-2017-11-24-at-44707-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2017/11/25/3ceae745-5099-46f1-a085-47b4fac1ffd0-screen-shot-2017-11-24-at-44707-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/2942276e-7f98-4e0d-9e78-fffb077dd2ed-getty-1167464598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/14/09b0f102-16c3-4c00-b942-0728fc2f091f-getty-1158663894.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/20/c328eadf-9ae0-4257-99eb-e601f708c458-getty-916296824.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/2/deb56653-5001-4dc5-8221-5f4faa452a84-getty-1150607041.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/image/2017/11/25/3ceae745-5099-46f1-a085-47b4fac1ffd0-screen-shot-2017-11-24-at-44707-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/wells-adams-just-took-sarah-hyland-on-the-most-bachelor-style-date-ever-5550232", "title": "Wells Adams Just Took Sarah Hyland On The Most Bachelor-Style Date Ever", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/wells-adams-just-took-sarah-hyland-on-the-most-bachelor-style-date-ever-5550232", "type": "article", "title": "Wells Adams Just Took Sarah Hyland On The Most Bachelor-Style Date", "description": "A birthday date isn't done right unless it involves a private helicopter... said anyone who's ever been on The Bachelor. Wells Adams took girlfriend Sarah Hyland on a helicopter ride for her 27th birthday celebration and it's a cuteness overload…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/11/25/3ceae745-5099-46f1-a085-47b4fac1ffd0-screen-shot-2017-11-24-at-44707-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "A birthday date isn't done right unless it involves a private helicopter... said anyone who's ever been on The Bachelor. Wells Adams took girlfriend Sarah Hyland on a helicopter ride for her 27th birthday celebration and it's a cuteness overload…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}