{"url": "https://www.washingtonpost.com/news/reliable-source/wp/2018/01/01/chrissy-teigen-fights-back-after-twitter-user-drags-model-into-the-false-pizzagate-conspiracy-theory/", "text": "The discredited Pizzagate conspiracy theory is based on the belief that leaked emails from Clinton’s presidential campaign chairman John Podesta prove the existence of a child exploitation ring that uses D.C. pizza restaurant Comet Ping Pong as their operating base. As a Washington Post report noted, in the fall of 2016, far-right talk-show host Alex Jones “repeatedly suggested that Clinton was involved in a child sex ring and that her campaign chairman, John Podesta, indulged in satanic rituals. … Over the next couple of days, the wild accusations against Clinton gradually merged with a new raft of allegations stemming from WikiLeaks’ release of Podesta’s emails. Those emails showed that Podesta occasionally dined at Comet Ping Pong.”\n\nAD\n\nAD\n\nIn December 2016, Edgar Maddison Welch, a man who believed the viral Internet rumor, opened fire in the restaurant in Washington. Welch has since pleaded guilty and apologized for his actions, as has Jones, who posted a video on his Infowars website that said neither Comet Ping Pong nor its owner had anything to do with human trafficking.\n\nPizzagate believers claim that many high-profile Democrats and the Hollywood elite are secret members of this society. Teigen, an outspoken critic of President Trump and his administration, often shares her opinions on social media and has been blocked by the president on Twitter.\n\nThe images that sparked Crokin’s accusations are of baby Luna showing off her Halloween looks, which included a hot dog and “Alice in Wonderland” costume. On Snapchat, the social media platform on which she shared the pictures, Teigen’s username contains a pizza emoji. Crokin claimed the emoji, along with the Alice costume, proved a link between Teigen and the secret society, as some believers claim the Lewis Carroll novel makes connections to pedophilia.\n\nAD\n\nAD\n\n“Chrissy Teigen’s daughter dressed as a hot dog, Alice in Wonderland & a pineapple but note the [pizza] emoji! #followthewhiterabbit #Qanon #TheStorm,” Crokin tweeted, along with images of Luna.\n\nTeigen fired back at the claims, retweeting the thread while adding: “Alright. I debated saying something about this but I’m pretty disturbed over here. The fact that there are people with these…thoughts…is really scary.”\n\nTeigen complained in a follow-up tweet about Twitter’s verification of Crokin. “Thank you, Twitter, for verifying somebody who is esentially accusing me (with pictures of my daughter) of child abuse and pedophilia to their 50,000 followers,” Teigen wrote.\n\nAD\n\nThank you, Twitter, for verifying somebody who is esentially accusing me (with pictures of my daughter) of child abuse and pedophilia to their 50,000 followers. — christine teigen (@chrissyteigen) December 30, 2017\n\nCrokin responded: “Chrissy you run in circle with people who rape, torture & traffic kids. This is a fact, I expose sex trafficking for a living.” Teigen’s response? “Anyone know any good lawyers?”\n\nAD\n\nA few hours later, Crokin tweeted that Teigen’s efforts to delegitimize her accuser had proved somewhat successful: Twitter employed its controversial policy of removing an account verification. “Twitter just unverified my account thanks to Chrissy Teigen,” Crokin said. “That’s OK cuz I care more about saving kids than I do about a blue checkmark!”\n\nTeigen’s husband, singer John Legend, chimed in late Saturday night, with a tweet directed at Crokin: “You need to take my family’s name out of your mouth before you get sued.”\n\nAD\n\nYou need to take my family’s name out of your mouth before you get sued. https://t.co/bPTwiBAs97 — John Legend (@johnlegend) December 31, 2017\n\nThough Teigen and Legend appear to have since moved on — Teigen tweeted Sunday night that she’d “muted, blocked, and gone private to let these people further dig their holes while leaving me in peace” — their experience prompted support from another Clinton: Chelsea.\n\n“Chrissy, sending you & beautiful Luna a huge hug,” Clinton said. “It is awful & never ok when people threaten or demean any child.”\n\nAD\n\nClinton claimed she has been the target of many human trafficking claims since the Pizzagate conspiracy took off. “I’ve lost count of the Twitter accounts who’ve threatened Charlotte with #FGM [female genital mutilation],” Clinton said, referring to her toddler daughter. “While I never bother to report threats against me, I now report every one against her.”\n\nAD", "images": ["https://www.washingtonpost.com/resizer/Yr7AWjHWZyukNFNOF6OSkuVwllc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NUVF2F6SYA26NE476GZ6OUHKQM.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/O2HDBGRGJM2OZAIW62K4EOIE3U.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/b884f3d2-9773-4528-93b9-fd83f73999f5.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/Yr7AWjHWZyukNFNOF6OSkuVwllc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NUVF2F6SYA26NE476GZ6OUHKQM.jpg", "keywords": [], "authors": ["Sarah Polus", "Reporter", "Editorial Aide For Reliable Source"], "canonical_link": "https://www.washingtonpost.com/news/reliable-source/wp/2018/01/01/chrissy-teigen-fights-back-after-twitter-user-drags-model-into-the-false-pizzagate-conspiracy-theory/", "title": "Chrissy Teigen fights back after Twitter user drags her into the false ‘Pizzagate’ conspiracy theory", "meta_data": {"description": "The outspoken Trump critic found herself the target of a discredited anti-Clinton, child sex ring claim.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/reliable-source/wp/2018/01/01/chrissy-teigen-fights-back-after-twitter-user-drags-model-into-the-false-pizzagate-conspiracy-theory/", "image": "https://www.washingtonpost.com/resizer/Yr7AWjHWZyukNFNOF6OSkuVwllc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NUVF2F6SYA26NE476GZ6OUHKQM.jpg", "title": "Chrissy Teigen fights back after Twitter user drags her into the false ‘Pizzagate’ conspiracy theory", "description": "The outspoken Trump critic found herself the target of a discredited anti-Clinton, child sex ring claim."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Chrissy Teigen fights back after Twitter user drags her into the false ‘Pizzagate’ conspiracy theory", "description": "The outspoken Trump critic found herself the target of a discredited anti-Clinton, child sex ring claim."}, "last_updated_date": "2019-04-26T21:36:47.289Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1514736000.0, "source": "https://www.washingtonpost.com", "summary": ""}