{"url": "https://people.com/crime/allison-mack-arrest-nxivm-suspends-operations/", "text": "Controversial self-help group Nxivm has suspended operations following the high-profile arrests of Smallville actress Allison Mack and group co-founder Keith Raniere on sex trafficking and forced labor charges.\n\nAccording to a message posted on Nxivm’s website, “we are suspending all Nxivm/ESP enrollment, curriculum and events until further notice.”\n\nGet push notifications with news, features and more.\n\nThe message was posted sometime after Mack’s April arrest, but it was not clear exactly when.\n\nThe message continues: “While we are disappointed by the interruption of our operations, we believe it is warranted by the extraordinary circumstances facing the company at this time. We continue to believe in the value and importance of our work and look forward to resuming our efforts when these allegations are resolved.”\n\nNxivm, which has not responded to numerous requests for comment from PEOPLE on the allegations against Mack and Rainere, has been described by at least one former member as a “cult.”\n\nMack was charged with sex trafficking, sex trafficking conspiracy and forced labor conspiracy. The actress, best known for her years-long role as Chloe Sullivan on The WB’s Smallville, is facing a minimum sentence of 15 years in prison if convicted on all of her charges.\n\nRaniere faces the same charges and potential prison sentence. Both he and Mack have pleaded not guilty.\n\nFederal investigators have accused Mack of recruiting women into a sub-group of NXIVM purported to be a female mentorship group to address their weaknesses but was actually a group created by Raniere that allegedly took advantage of women sexually.\n\n“The victims were then exploited, both sexually and for their labor, to the defendants’ benefit,” Richard P. Donoghue, U.S. Attorney for the Eastern District of New York, alleged in a statement issued at the time of Mack’s arrest.\n\nImage zoom Allison Mack Matt Baron/BEI/REX/Shutterstock\n\nNxivm is based out of Albany, New York, and has been the subject of scrutiny from both law enforcement and journalists as it came under fire from Dynasty actress Catherine Oxenberg, whose estranged daughter, India, joined the group in 2011.\n\nOxenberg first opened up to PEOPLE last year about how she believed India had been “brainwashed” by Nxivm.\n\n• Want to keep up with the latest crime coverage? Click here to get breaking crime news, ongoing trial coverage and details of intriguing unsolved cases in the True Crime Newsletter.\n\nIn the fall, India posted on Facebook that she was “absolutely fine, great actually [and] I would never put myself or the people I love into any danger.”\n\nFor the past two decades, an estimated 16,000 people have paid as much as $3,400 for an executive coaching workshop offered by Nxivm, which promises to take participants on a journey of personal discovery and development, according to previous PEOPLE reports.\n\nThe criminal complaint against Raniere — known as “Vanguard” to his followers — alleged that he encouraged the formation of a secretive subgroup within Nxivm called “Dominus Obsequious Sororium,” (DOS) in which women were coerced into serving as sex slaves to their male masters.\n\nImage zoom Keith Raniere\n\nThe complaint, which was previously obtained by PEOPLE, outlines how authorities believe the women were forced to turn over “collateral” — or potentially-damaging personal information or materials, such as nude photographs, with which they later could be blackmailed.\n\nThe women allegedly victimized by Mack allegedly believed their “collateral” would be released if they did not engage in sexual activity with Raniere, the statement on Mack’s arrest alleges.\n\nIt was the scandal that rocked America’s most storied political family and changed the course of presidential history. PEOPLE‘s first-ever podcast, Cover-Up, dives into the Chappaquiddick scandal and attempts to piece together what happened in the hours after Ted Kennedy’s car went over a narrow wooden bridge, killing his passenger, Mary Jo Kopechne. Subscribe now on Apple Podcasts, Spotify, Google Play or wherever podcasts are available.\n\nThe complaint against Raniere additionally alleges the women were branded with Raniere’s initials, as he “alone forms the top of the pyramid as the highest master.”\n\nA cauterizing pen was used to make the permanent marks near each person’s pubic region, the complaint alleges.\n\nIn statements previously posted to Nxivm’s website, Raniere said all involved in DOS were consenting adults and that Nxivm was not involved in what he called a “sorority.”\n\nIn the fall, the group denounced a New York Times article about them as “a criminal product of criminal minds.”\n\nMack and Raniere are scheduled to stand trial on Oct. 1.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fallison-mack.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fkeith-raniere.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1368&h=716&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fallison-mack.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1368&h=716&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fallison-mack.jpg", "keywords": [], "authors": ["Chris Harris"], "canonical_link": "https://people.com/crime/allison-mack-arrest-nxivm-suspends-operations/", "title": "Controversial Group Nxivm Suspends Operations After Allison Mack's Sex Trafficking Arrest", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Crime News,News", "news_keywords": "Crime News,News", "description": "The upstate New York-based self-help group has come under fire in recent years, and its founder was arrested by federal authorities in March", "og": {"title": "Controversial Group Nxivm Suspends Operations After Allison Mack's Sex Trafficking Arrest", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/crime/allison-mack-arrest-nxivm-suspends-operations/", "description": "Controversial self-help group Nxivm has suspended operations following the&nbsp;high-profile arrests of Smallville actress Allison Mack and group co-founder Keith Raniere on sex trafficking and forced&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1368&h=716&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fallison-mack.jpg", "width": 1368, "height": 716}}, "pinterest": {"url": "https://people.com/crime/allison-mack-arrest-nxivm-suspends-operations/", "description": "The upstate New York-based self-help group has come under fire in recent years, and its founder was arrested by federal authorities in March", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fallison-mack.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/crime/allison-mack-arrest-nxivm-suspends-operations/", "title": "Controversial Group Nxivm Suspends Operations After Allison Mack's Sex Trafficking Arrest", "description": "The upstate New York-based self-help group has come under fire in recent years, and its founder was arrested by federal authorities in March", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1368&h=716&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fallison-mack.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}