{"url": "www.bustle.com/p/is-lady-gaga-engaged-she-christian-carino-are-definitely-serious-8010475", "text": "You may have heard rumors awhile back that Lady Gaga was getting serious with her boyfriend, Christian Carino. So, is Lady Gaga engaged to him? According to a November 2017 Us Weekly report, yes — but that wasn't the end of the story. A source told the publication that they got engaged over the summer of 2017, but there weren't any immediate wedding plans due to Gaga's health issues with fibromyalgia. At the time of the report, Bustle reached out to the singer's rep and to Carino for comment, but didn't receive a response.\n\nHowever, following Us Weekly's engagement report, Gossip Cop reported that Gaga and Carino were not engaged. A rep for the singer reportedly told Gossip Cop that engagement rumors were \"untrue\".\n\nWhatever the case, there's no denying they've been pretty good at keeping their relationship under the radar and mostly staying out of the spotlight. In February 2017, Us Weekly reported that Gaga and Carino were dating after he was spotted kissing her on the cheek before her Super Bowl LI halftime performance on Feb. 5. Carino is an agent with the Creative Artists Agency and, yes, he is also Gaga's agent. At the time of the dating rumors, Bustle reached out to both Gaga and Carino, but didn't receive an immediate response.\n\nAlso in February, Ryan Seacrest asked about the 31-year-old musician's love life during her On Air With Ryan Seacrest appearance. He asked if she was dating anyone who she was seen with at the Super Bowl. To that she responded, \"I don't know. You know I don't talk about my love life, Ryan!\" She then blushed and added, \"I'm really red. I'm really red and it doesn't go with my outfit.\"\n\nShe might not talk about her love life publicly, but that didn't stop Gaga from gushing about Carino in September 2017. While performing at New York's Citi Field, Page Six reported that Gaga briefly opened about him with concertgoers attending her Joanne world tour. \"When I went backstage, Christian was by the stairs making sure I was OK,\" she reportedly said and then added, \"The best part about being in love with someone is having them there to catch you if you fall.\"\n\nIt wasn't until Oct. 22, 2017 that the \"Million Reasons\" singer made things Instagram official with Carino. She posted a photo of herself with her man on her Instagram Story. As you can see above, well, it's a gorgeous pic and you can tell just how head over heels they are for one another. Are they from The Notebook? Who else is getting some serious Allie and Noah vibes?\n\nFollowing the engagement rumors from last November, Us Weekly also reported that things were so serious between the couple that Carino reportedly has a tattoo of Gaga's face on his arm. The reported tattoo is inked under the agent's shoulder, which shows Gaga's face and her sporting high, long pigtails. A source reportedly confirmed to the publication that the tattoo, which you can see below, is very much real; although they haven't spoken about the tattto themselves.\n\nNeither Gaga nor Carino have confirmed that they are engaged and the Us Weekly report that they were came out Nov. 1 with no further announcements following. Whether they are or aren't engaged — and it's sounding like maybe not quite yet — they clearly have deep feelings for each other and are happy and that's all that matters.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/7f8de711-e6d7-41da-9b99-1bdb99d96a9f-getty-1187273504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/bab84c2f-300c-42c9-a7b4-b3ff6ce066dc-getty-1192972154.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/24/b04e2a4d-a838-476f-9656-3e3f80fe6914-getty-844187332.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/1/24/b04e2a4d-a838-476f-9656-3e3f80fe6914-getty-844187332.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/10/1a647a57-e12b-432f-bfbc-c72e4905587a-thth_103_portraits_01423r220200403-3458-1e1brpe.jpeg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/15/8feb9158-e1b8-420e-952c-a847f4994e90-getty-1187049088.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/24/b04e2a4d-a838-476f-9656-3e3f80fe6914-getty-844187332.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/is-lady-gaga-engaged-she-christian-carino-are-definitely-serious-8010475", "title": "Is Lady Gaga Engaged? She & Christian Carino Are Definitely Serious", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/is-lady-gaga-engaged-she-christian-carino-are-definitely-serious-8010475", "type": "article", "title": "Here’s Lady Gaga’s Current Status With Her Guy", "description": "You may have heard rumors awhile back that Lady Gaga was getting serious with her boyfriend, Christian Carino. So, is Lady Gaga engaged to him? According to a November 2017 Us Weekly report, yes — but that wasn't the end of the story. A source told…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/24/b04e2a4d-a838-476f-9656-3e3f80fe6914-getty-844187332.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "You may have heard rumors awhile back that Lady Gaga was getting serious with her boyfriend, Christian Carino. So, is Lady Gaga engaged to him? According to a November 2017 Us Weekly report, yes — but that wasn't the end of the story. A source told…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}