{"url": "https://www.seventeen.com/celebrity/celebrity-couples/a19747317/khloe-kardashian-tristan-thompson-relationship-timeline/", "text": "Khloé Kardashian and Tristan Thompson's relationship was like a car crash you couldn't turn away from. At first, it was so nice to see Khloe so happy. Fans watched her struggle in her former relationship with basketball player Lamar Odom, and it really seemed that Khloe was due in the karma department. When the two got together, they were inseparable. But then allegations of Tristan's cheating broke out all over the internet. And it didn't stop there.\n\nCheating scandal after cheating scandal kept threatening to break up the relationship, but baby True held them together. Then, the scandal to end all scandals occurred and Khloé couldn't take it anymore, Tristan hooking up with Kylie Jenner's BFF Jordyn Woods was too far. Now, the relationship is over, but they still have a child together, and it does look like they're trying to make things work for the sake of True. Keep up with their complicated co-parenting adventure, and refresh your memory on their relationship with the timeline below. Even though things might be tricky, we love Koko and fans everywhere have stuck by her side through it all.\n\nJune 27, 2019:\n\nThough Khloé and Tristan may have broken up months ago, they are now closer than ever...literally, because Tristan just bought a house right outside of Khloé's neighborhood!\n\nAccording to Us Weekly, the basketball player recently purchased a $6.5 million dollar mansion in Encino, California, which has seven bedrooms, eight baths, a pool, spa, AND an outdoor kitchen...wow.\n\n\n\nThe kicker? The new pad is just a 25-minute drive from his ex's house. Tristan assumedly bought the house due to its proximity to his 14-month-old daughter, but it's unclear what Khloé thinks about her ex's new location.\n\nJune 12, 2019:\n\nKhloé is not here to get dragged into Tristan Thompson's latest drama that includes ANOTHER cheating scandal. On her Instagram story, Khloé set the record straight when it came to the start of their relationship. Some fans had begun to question Tristan again when it was revealed that his ex-girlfriend said that she was cheated on when Tristan started to date Khloé.\n\n\"After going on some dates, Tristan told me that he had an ex that was pregnant. Obviously, I was reluctant about us continuing to date or start a relationship,\" she wrote. \"He pleaded with me that the relationship was over long before we met.\"\n\nShe even revealed that she had his friends, lawyer, and mother say that he was no longer with his ex before she got with him.\n\n\"This is my truth! The truth that I believed and trusted. If for any reason this is NOT in fact the truth, I am so completely and utterly sorry that TRISTAN and his inner circle would lie on something like this,\" she wrote on another slide. \"Truthfully, from the deepest parts of my soul I am sorry! I'm sorry for any pain that has been created either way. No woman deserves to go through anything like this!\"\n\nMay 31, 2019:\n\nKoko is known for getting cryptic on her Instagram account, so fans weren't necessarily shocked when she posted this seemingly shady post: \"Your loyalty might have kept you in some situations that common sense should've talked you out of. That's just the kind of person you are.\" While we all know Khloe is loyal AF, we can't help but wonder who it is she's actually talking about. Is this post meant for Tristan Thompson and her old ex Lamar Odom?\n\nBoth guys cheated on her and, despite their infidelity, she stayed true to the very end. Fans are wondering, though, if this is actually all about Tristan. Afterall, she'll be re-living their breakup in Sunday's episode of Keeping Up with the Kardashians. Khloé debates her fealty to Tristan in a clip, saying \"I don't feel like I have an answer. Like, okay, I'm going to be with Tristan forever, or I'm going to break up with him... I still feel like, god, when will I ever know?\"\n\nMay 9, 2019:\n\nThe most awkward part of Keeping Up with The Kardashians is the fact that it rehashes drama that occurred months ago. It's even more awkward when things transpire between the event and the airing like say, Jordyn Woods kisses Khloé's boyfriend and then a video of Khloé praising the 21-year-old becomes completely cringeworthy. Well, get excited, because that's exactly what's going down on this week's ep of KUWTK!\n\nIn the episode, we see a party celebrating the launch of Kylie's cosmetic collab with her former BFF Jordyn. Everyone is in a great mood at the party, especially Khloé, who decides to say a few words. \" And Jordyn, for you to be turning 21, I've known you forever, and I'm so proud of you and the woman you have grown into and you're growing into,\" Khloé says. \"And to see you guys just stick together and be best friends through thick and thin, it's such a blessing. Congratulations on everything and this'll be a huge success!\"\n\nIt's a sweet sentiment, of course, but awkward af considering everything that has gone down since. Well, just think. As hard as that speech is for us to watch, it must be one million times worse for Khloé.\n\nCheck Out Kylie and Jordyn's Cosmetic Collab! Jordyn Palette | Kylie X Jordyn Kylie Cosmetics℠ | By Kylie Jenner kyliecosmetics.com $45.00 SHOP NOW WOODS | Matte Lipstick Kylie Cosmetics℠ | By Kylie Jenner kyliecosmetics.com $17.00 SHOP NOW Highlighter Quad Palette | Kylie X Jordyn Kylie Cosmetics℠ | By Kylie Jenner kyliecosmetics.com $40.00 SHOP NOW Partner In Crime | High Gloss Kylie Cosmetics℠ | By Kylie Jenner kyliecosmetics.com $16.00 SHOP NOW\n\nApril 16, 2019:\n\nWe've got more news from True's first birthday party, and considering the video that surfaced of Khloé straight up ignoring Tristan at the event (see below), it's pretty much what you would expect.\n\nAccording to People, there \"was never a question\" as to whether Tristan would be invited or not, but she was still \"nervous about having him there.\" Khloé even had to ask her family members, who are known for speaking their minds, to \"behave and leave Tristan alone.\"\n\nAll in all, the party went well, probably because aside from a few pictures together with True, they \"had very little interaction.\"\n\nDespite there extremely rocky past, \"it's super important to Khloé that True spends as much time with Tristan as possible,\" People's source said. Khloé wants True to have a great relationship with Tristan.\"\n\nApril 14, 2019:\n\nOf course, Tristan was in attendance for his daughter's first birthday, but that doesn't mean Khloé had to give him the time of day. Women around the world cheered when Khloé hardcore gave her ex the cold shoulder at True's party, as documented on Instagram.\n\nIn the video you can see that while Tristan is trying to get True, Khloé is too busy paying attention to literally everyone else. Khloé didn't get too petty, however. She did let Tristan have his moment with his daughter and hold her while they sang happy birthday.\n\nIt's good to see that things are amicable with them, but Khloé is still treating Tristan exactly how he deserves to be treated 💁🏻.\n\n\n\nMarch 14, 2019:\n\nKhloé and Tristan may no longer be together, but they will forever be connected thanks to baby True. Unfortunately, while Khloé is constantly showing her daughter lots of love, it seems like Tristan has been pretty hands off ever since the break up.\n\n\"Khloé is getting extremely upset with Tristan because he isn’t really making any effort to be involved in their daughter True’s life,\" a source told Us Weekly. While Khloé understands that Tristan has a busy schedule and is on the road a lot, she feels like he \"has moved on\" from True. According to the source, \"Tristan’s attitude seems to be, ‘I will see True when I see her.’\"\n\nObviously, Khloé is not happy about this, and with True's first birthday coming up, we will have to wait and see if Tristan is involved or not. While I'm sure Khloé wants True's father to be there, \"she can't see how he can be around her family at a party, though. Everyone is just too upset with him,\" said People. I mean...can you blame them?\n\nMarch 1, 2019:\n\nFollowing Jordyn's tell all interview on Red Table Talk where she claimed that nothing happened between her and Tristan aside from a peck on her way out the door, Khloé took to Twitter to call her out.\n\n\"Why are you lying @jordynwoods ??\" she wrote. \"If you’re going to try and save yourself by going public, INSTEAD OF CALLING ME PRIVATELY TO APOLOGIZE FIRST, at least be HONEST about your story. BTW, You ARE the reason my family broke up!\"\n\nWhy are you lying @jordynwoods ?? If you’re going to try and save yourself by going public, INSTEAD OF CALLING ME PRIVATELY TO APOLOGIZE FIRST, at least be HONEST about your story. BTW, You ARE the reason my family broke up! — Khloé (@khloekardashian) March 1, 2019\n\nObviously many were confused. Why was Khloé attacking Jordyn so publicly when Tristan was just as responsible (if not more if you believe Jordyn's side of the story). Well, Khloé had a response to that too.\n\n\"Tristan is equally to blame but Tristan is the father of my child,\" she said. \"Regardless of what he does to me I won’t do that to my daughter. He has been addressing this situation PRIVATELY. If Tristan were to lie publicly about what conspired, then yes I would address him publicly as well.\"\n\nIt's unclear what Tristan's side of the story involves and why Khloé seems to be believing him over Jordyn. We will have to wait and hope that Jada Pinkett Smith sits down with the two of them next.\n\nFebruary 27, 2019:\n\nWhile Khloé hasn't officially confirmed or denied the alleged cheating incident between Tristan and Jordyn, her social media activity speaks for itself. Two tweets that she \"liked\" on Twitter are extremely revealing, with one even seemingly confirming that the hook up occurred.\n\nBoth tweets are in reference to Jordyn's upcoming appearance on the Facebook show Red Table Talk, where she will most likely discuss her side of what occurred. In a response to a tweet that said, \"Jordyn deserves a win,\" one Twitter user wrote, \"She slept with Khloé's baby daddy, and they haven't even publicly said ONE bad thing about her, just unfollowed her, so how is that the Kardashians fault? Jordyn smeared her OWN name!\"\n\nThe other tweet that Khloé liked is in response to the video of Jordyn at the Red Table Talk studio. \"I really don’t understand the point of this,\" @aussiedashdoll wrote. \"There’s no way she can justify what she did.\"\n\nSources said that the Kardashian's aren't happy with Jordyn's decision to go on the talk show, especially because it means she will be breaking the NDA that prohibits her from talking about the famous fam. Khloé's liked tweets about the situation not only prove that the KarJenners are angry, but it also might prove that the still alleged cheating scandal did, in fact, occur.\n\nThis also comes as Tristan is reportedly \"trying to make amends\" with Khloé. \"Tristan has been telling Khloé that he feels bad and that they have a kid together and that he disrespected her as the mother of his child,\" a source told People. Of course, this is the same guy who was apparently very indifferent when the scandal initially broke, according to Us Weekly, so it's hard to believe anything that guy says these days.\n\nFebruary 26, 2019:\n\nKhloé made a bold statement when she posted some gorgeous pics on IG just a week after the news broke that Tristan allegedly cheated on her with Jordyn Woods. The photos featured her, Kourtney, and Kendall rocking some sexy outfits. Khloé herself was in a diamond bodysuit and, let me tell you, she looked fierce.\n\nWell, apparently Tristan Thompson agreed that the pic was H-O-T, because he gave it a \"like\" on Insta and obviously, people were NOT happy.\n\nUGH. Tristan liked Khloé’s new IG photos & yes, I’m annoyed 😐😐 pic.twitter.com/lm4kds7LbH — Jamie Primeau (@jamieprimeau) February 26, 2019\n\nThen, things got even more interesting. When I went to go double check that like (you know, journalistic integrity and what not), it was no longer there! Meaning Tristan took back is like! Which may be even shadier than liking it to begin with.\n\nInstagram\n\nVery shady Mr. Thompson...But, then again, should we really expect anything else from him?\n\nFebruary 20, 2019:\n\nGet ready, cause it's been a wild couple of hours. After news that Tristan was up partying in L.A., new reports saying that he hooked up with Kylie Jenner's BFF, Jordyn Woods started to circulate the internet.\n\nWhile no one has outright confirmed that this is what really happened, Khloé seems to be hinting that it's all true. Tristan has reportedly admitted to the whole thing and it seems like things between him and Khloé are officially over.\n\nKhloé has given Tristan plenty of chances, but this one has clearly gone too far for her to be able to forgive him.\n\nA source told Us Weekly, \"Tristan isn’t too worried about not seeing True, or Khloé establishing new rules when it comes to coparenting. He honestly doesn’t really care and was over it. He was never trying to win Khloé back.\"\n\nYIKES! They have since hinted that the news is real, but have still kept it under wraps. It'll definitely be interesting to see what happens when one of them finally speaks out. We'll all be waiting for that tea.\n\nFebruary 19, 2019:\n\nKhloé and Tristan have been in a long distance relationship for months, with Tristan living in Cleveland for his NBA team while Khloé is taking care of True in LA. So, when Tristan visited LA, you would think he would see Khloé, right?\n\nWhile we don't know exactly how he spent his whole trip to LA, we do know how he spent his Saturday night. According to the Daily Mail, Tristan partied until the early hours of the morning in West Hollywood. While out on the town, the basketball player was reportedly \"being flirty, hitting up girls.\" Meanwhile, Khloé was nowhere to be found.\n\nIt is, of course, possible that Tristan visited Khloé and his daughter on this trip to LA, but there is no evidence of it on social media, which is surprising consider how much Khloé usually shares. A reunion between daughter and father would have made for some great Insta story content.\n\nAll of this comes amid rumors that Tristan and Khloé have finally called it quits, and while nothing is officially confirmed, their breakup is seeming like more and more of a given.\n\nFebruary 14, 2019:\n\nSo, the world is still pretty confused about Khloé and Tristan's relationship status, and his V-Day gift to her didn't really help clear anything up. The basketball player sent Khloé a gorgeous floral display for the romantic holiday, which she shared on her Instagram story.\n\nInstagram\n\nYes, it is super sweet, but Khloé showed off the gift among the dozens of other treats that she got from her family and various brands, not really singling it out in any special way. She also captioned the pic, \"Daddy and baby True,\" which makes me think that that's all she thinks of him these days. Not in a romantic way, but as True's dad. That's it.\n\nThe two didn't celebrate the holifay together either. Khloé seemed to spend all day with True, opening gifts and enjoying some V-Day treats, while Tristan was most likely in Cleveland (he had a home game the day before). So, while their Valentine's Day celebration (or lack there of) definitely doesn't clear anything up regarding their relationship status, I'm taking it as a sign that things aren't going well.\n\nFebruary 13, 2019:\n\nRemember Tristan Thompson? It may have been awhile since you last heard that name so let me refresh your memory. He is the father of Khloé's baby, True, and he allegedly cheated on Khloé literally days before True was born. While Khloé and Tristan have spent the last ten months working on their relationship since the scandal, he has been MIA recently, so has the pair officially broken up?\n\nAccording to People, Khloé \"rarely talks about\" Tristan, which obviously isn't a sign that things are going well. \"Khloé and True are happy in Los Angeles,\" a source told the site. \"They spend very little time in Cleveland, where Tristan is. She very much acts like a single mom.\"\n\nWhen Khloé celebrated True's ten-month birthday, Tristan was nowhere to be found. In fact, the two haven't been seen together in a month.\n\nKhloé seemingly is doing just fine without Tristan these days. \"Her whole life is True,\" the source told People. She also just got a gorgeous new haircut, which is the telltale sign of a breakup, if you ask me.\n\nJanuary 16, 2019:\n\n\n\nIt seems like the Kardashian sisters are divided over whether or not Khloé should've stayed with Tristan Thompson after his cheating scandal.\n\nWhile playing Plead the Fifth on Watch What Happens Live, Kourtney was asked whether or not she would've stayed with Tristan Thompson if she were in Khloé's shoes. Instead of pleading the fifth, Kourtney revealed that she would've stayed with him and Kim opened up about how she doesn't agree with her decision.\n\n\"From seeing everything that happened. It's so easy and quick to be like, 'Oh my god, leave him. Leave him.' It's so much harder to stay and have the whole public think you're an idiot for staying,\" Kim said.\n\nAndy Cohen and Khloé started laughing since it seemed like Kim was calling her an idiot. Talk about AWKWARD. Check out the clip below:\n\nJanuary 2, 2019:\n\nNew year, same drama. Khloé Kardashian and Tristan Thompson are back for another complicated 365 days of cheating scandals, dramatic Instagram story quotes, and lots of baby pics. The couple rang in the New Year together at a party in Cleveland, and there was a fair share of evidence showing them having a good time.\n\nInstagram\n\nOf course, it wasn't all love and laughs for this complicated couple. The Shade Room recently posted a video of Khloé grinding on Tristan on the dance floor, while Tristan straight up gives her the cold shoulder. Of course, Khloé was not happy and the whole exchange is super awkward.\n\nSo, there's a really good chance that Tristan just didn't see Khloé (because who could deny her, did you see how good she looked??), but of course it's Khloé and Tristan so fans always assume the worst.\n\nIn the rest of the pics from the night, the pair seemed to be having a good time, so maybe we assume should best intentions on Tristan's part?\n\nHere's to what hopefully is a drama-free year for the couple!\n\nDecember 24, 2018:\n\nWhile True Thompson and Khloé Kardashian stole the show in matching outfits at the annual Kardashian Jenner Christmas Eve party this year, Tristan was nowhere to be found. Don't worry, though, because there's actually a totally reasonable explanation for why he missed the party.\n\nAccording to E! News, Tristan \"doesn't have a lot of flexibility\" when it comes to his basketball schedule. He had a game on the 23rd and 26th, which didn't leave a lot of time to head to LA for the party.\n\nWhile Khloé could have spent Christmas in Ohio with Tristan, it was important for her to be with family for the holidays, especially after she missed Thanksgiving in LA to be with him.\n\n\"There was nothing more special than seeing True with her cousins on Christmas morning,\" a source told E!. \"There was no way she was going to miss the family Christmas Eve party and being a part of opening presents all together on Christmas morning.\"\n\nDecember 7, 2018:\n\nThings between Tristan and Khloé are MUCH better these days, so much so that Khloé is even considering getting pregnant again with the basketball player.\n\n\"Now that she's a mom, Khloe's never been happier,\" a source told Entertainment Tonight. \"She has wanted this baby more than anything and motherhood has proven to be even more incredible than she imagined.\"\n\nApparently the couple is in \"such a good place now\" after spending Thanksgiving together last month. \"Her relationship with Tristan is so good,\" said the source. \"They made it through some really dark times, but she's happy that she gave him a second chance because he's stepped up and is not only an amazing father to True, but he's been such a rock for Khloé. They're really just so in love.\"\n\nThey're doing so well, that Khloé wants to start trying for a second kid. Getting pregnant with True wasn't easy and Khloé is \"aware it may take some time again,\" so she doesn't want to wait too long.\n\nIn other Kardashian news, Kylie is also interested in having baby number two with her bae, Travis Scott.\n\n\"Kylie and Travis are going to wait until he's finished his [Astroworld] tour before trying for another baby,\" ET's source said. \"They want to have another child soon so it's close in age to Stormi, but they do not want to do this while he's busy on the road.\"\n\nSince their first kids were born just months apart, and seem to have a close relationship, the sisters are apparently excited about the prospect of getting pregnant together again.\n\n\"Kylie and Khloe would love to be pregnant together again. And it seems like the timing could work out that way,\" said the source. \"It was a real bonding experience for them, but more importantly, it’s been amazing for their daughters to be so close in age. There are so many kids/grandkids in that family, that's really where the family's attention is. It's all about the next generation.\"\n\nNovember 26, 2018:\n\nKhloé and Tristan had a quiet Thanksgiving together, as she joined him in Ohio for the big holiday. While many fans were questioning why Khloé decided to not be with her sisters for Thanksgiving dinner, she quickly shut down the haters down with a couple of tweets.\n\nY’all are reaching now. I’ve spent the past 3years in Cleveland for Thanksgiving. Not sure why people are trying to create drama between my family and I. My sisters and I are perfectly fine thank you! All of their families were able to travel but TT being in season, he can not — Khloé (@khloekardashian) November 24, 2018\n\nThe truth is never as fun as some story some of you like to create. So here we goooooooooooo!! Happy Thanksgiving I guess lol — Khloé (@khloekardashian) November 24, 2018\n\nKhloé also had to defend her sister Kendall on Friday night after she booed Tristan during a basketball game, where she was cheering on the Philadelphia 76ers' with Ben Simmons.\n\nA fan called out Khloe for her being okay with Kendall booing him during the game, but still supporting Tristan after he cheated on her.\n\nWhat he did was fucked up and disgusting. What you’re watching is over seven months old. We have gone through countless hours of help. My sister was watching HER man Play against my man… So of course she’s going to heckle the opposing team. Why are you confused? — Khloé (@khloekardashian) November 25, 2018\n\nDespite what people believed to be a shady interaction between Kendall and Tristan, the two of them were all smiles when they saw each other at the game.\n\nMitchell Leff Getty Images\n\nThe Cleveland Caveliers ended up winning the game, so it's safe to say that the two of them are even now.\n\nNovember 18, 2018:\n\nKeeping Up with the Kardashian's retell of True's birth confirmed what we already knew: that the baby's delivery, which occurred just days after it was revealed that Tristan had cheated of Khloé, was awkward af.\n\nNot only were there some savage moments from Khloe's sisters (Tristan saying \"girls change your life,\" with Kourt responding, \"we can only pray.\" AMEN), but there was also so much tension.\n\ngiphy\n\nAfter the ep aired, Khloé shared a pic from the occasion on her Instagram story, and you can feel the awkwardness in the photo, let me tell you.\n\nInstagram\n\n\"This is one of the most awkward photos I have seen in a long time,\" she wrote about the pic. \"You can feel the tension lol but it makes me laugh for some reason. I am definitely one of those people that when I am uncomfortable I nervously laugh. Welcome to my labor lol.\"\n\nWe're glad she can laugh about it, because all we can manage is a cringe.\n\nNovember 15, 2018:\n\nForget what you heard because Khloé and Tristan are reportedly doing very well despite breakup rumors. A source told TMZ that the couple is \"still together and going strong.\" According to the site, Khloé hasn't been in Cleveland because she's filming a new season of Keeping Up With The Kardashians, and then she wanted to stay with her family this past week amid the California fires.\n\nThe reality star will be heading to Ohio soon, however. She plans to spend Thanksgiving with Tristan and True in Cleveland as a family.\n\nThis all comes as the cheating episodes of KUWTK are airing on TV, episodes which Tristan refused to watch. But hey, if they're doing better, why relive the past?\n\nNovember 7, 2018:\n\nWhile Tristan Thompson seemed to have no issue cheating on Khloé Kardashian when she was nine-months pregnant back in April, he has not interest in reliving the experience through Keeping Up with the Kardashians.\n\nAccording to Us Weekly, when Khloé asked Tristan if he wanted to watch the KUWTK episode that addressed the cheating scandal, \"the response was a firm no.\" Apparently while Khloé already screened the ep before it aired, she wanted to watch it live with her boyfriend.\n\nTristan has a lot of other things to worry about. A source close to him told Us that \"he is focused on basketball, and the Cavaliers are struggling this season.\" Watching the episode would only create further distractions, and \"there wasn't any need for that.\" Of course, he could have not cheated on her in the first place, then this issue wouldn't exist at all.\n\n\n\nOctober 29, 2018:\n\nKhloé and Tristan seem to be back on good terms after Khloé's recent vacation with Kim and their kids.\n\nThe two of them returned from their big trip to Bali and Khloé had a very special surprise waiting for her at home when she got back. Tristan got her some special balloons to welcome her back and Khloe was super excited to share them on her Instagram story\n\nInstagram\n\nSoon after, she posted another photo of a quote that seemed to be hinting at a reconciliation.\n\nInstagram\n\n\"Please stop overthinking life like you have an answer to every feeling or rituation. That's not how life works We figure it all out by just living, by f*cking up, by missing an. opportunity, by seeking advice and not taking it. We learn what's important and what isn't. Sometimes we have no f*cking idea what to do and it's scary but it's okay. Always trust your gut and know that everything will work out exactly the way it is supposed to be. It always does. Relax, we were never in control anyway.\"\n\nOctober 23, 2018:\n\nSix months after Tristan's first cheating scandal, which occurred just a few days before the birth of their child, True Thompson, Khloé finally \"seems over Tristan,\" according to People.\n\nThis feeling has manifested itself in her move to Cleveland, which she hasn't rescheduled, despite postponing it three weeks ago. \"It doesn’t seem to bother her that she isn’t with Tristan in Cleveland,\" said People's source. \"She seems to know what she wants in her life right now. And it definitely doesn’t seem like she wants to be with Tristan.\"\n\nAs far as their future, however, Khloé hasn't yet made a decision. \"Khloé isn’t saying that she and Tristan split. It seems she hasn’t decided yet what she wants to do about their relationship,\" the source said. \"And she seems fine about this.\"\n\n\n\nOctober 6, 2018:\n\n\n\nAfter a week of posting emotional Instagrams amid new rumors that Tristan Thompson is once again cheating, Khloé Kardashian has postponed her move to Cleveland. Khloé was planning on returning to Ohio to live with Tristan as the basketball season begins, but, according to People, this is no longer the case.\n\n\"It’s of course difficult to trust someone 100 percent who cheated days before he was about to become a dad,\" said People's source. \"Khloé still struggles with this sometimes. She wants to move back to Cleveland, but she isn’t sure what date she is [going]. The move is postponed for now. She seems very upset about leaving her family. She had the best summer in L.A.\"\n\nAll of this is happening as Keeping Up with the Kardashians is preparing to air the original cheating scandal, which occurred about six months ago, right before True Thompson was born. This has caused Khloé to become \"overwhelmed and exhausted,\" according to the source.\n\n\"Khloé has every reason to occasionally feel [that way],” they added. \"She’s a new mom, a first-time mom, and her TV show is currently replaying one of the most emotional times in her life. It’s a lot.\"\n\nSeptember 27, 2018:\n\n\n\nIt seems like we're about to get a lot more info on the Tristan cheating scandal and how Khloé's family reacted to the original news back in April. In a mid-season preview for Keeping Up with the Kardashians, Kim Kardashian is seen saying, \"They have another video of him.\" While we don't know for sure that she's referring to Tristan, the promo then switches to a pic of Khloé, who looks less than happy. So, we can assume Kim means the paparazzi got another vid of Tristan with a random girl.\n\n\"Unfollowed,\" says Kim, and we know she did, actually unfollow him on Instagram. \"I hate him. Sorry, not sorry.\" Khloé, on the other hand, seems more calm as she prepares to give birth to her baby, True. “The things I can control, I have to be able to control,\" she says.\n\nWe can't wait for the second half of KUWTK to see what Khloé's family thought about everything that went down with Tristan, though we already know they don't think too highly of him.\n\nSeptember 26, 2018:\n\nTristan Thompson was, once again, spotted getting very close to not-Khloé at a club in LA recently. According to Us Weekly, \"Tristan and a girl were chatting and flirting throughout the night. They were very touchy-feely. He had his hand on her butt.\"\n\nKhloé, who will be moving back to Cleveland when basketball season kicks off, is apparently unbothered by the allegation. A source says that she believes Tristan, who promised to \"never betray her again.\"\n\nHer family, however, is not on the same page. \"Everyone is flabbergasted, but her family has learned to keep their opinions quiet,\" said a source. \"People underestimate the threshold of what she’ll put up with for love.\"\n\nSeptember 19, 2018: It looks like LA will be losing a Kardashian. Khloe plans to move back to Cleveland with Tristan for basketball season, which is about to start up again soon. While it's good to see that the couple will still be together while Tristan plays for the Cleveland Cavaliers, a source told People that the move will be hard on Khloe.\n\n\"He has games in October. They are all moving back to Cleveland, and it’s hard for Khloé. She will really miss Kris and her sisters,\" they told People.\n\nDespite the big move, the source said that they plan to make frequent visits back to LA to try to keep the family together.\n\n\"It’s not going to be easy for her,\" the source told People. \"But she is committed to keeping her family together. And Tristan has shown that he is committed to Khloe, so Khloe will make it work.\"\n\nWhile Khloe plans to make the big move, it looks like another Kardashian is staying put.\n\nKim doesn't plan to move to Chicago with Kanye, despite the fact that he recently announced that he will be moving back there soon.\n\n\"Kim plans on spending more time in Chicago, but she isn’t moving there full-time,\" a source told People.\n\nThe source also told People that Kim believes that a move wouldn't make sense for the kids right now and that it's likely that Kanye will change his mind and move back to LA soon.\n\n\"She will be supportive of Kanye’s plans and they do have a house in Chicago too. Kanye has a tendency though to change his mind quickly, so she is just going along with his plans because it makes him happy,\" the source said. \"Next week, something else might make him happier.\"\n\nAugust 1, 2018: Despite rumors that the couple aren't doing so well, Tristan and Khloe seem to be doing just fine. Tristan even commented on Khloe's Instagram featuring pink and blue beach waves and the caption, \"take me please.\"\n\nTristan adorably responded to her photo by asking her, \"where do you want to go my love?\" While Khloe hasn't yet responded to the comment, her fans have been having a field day responding back to Tristan and reminding him of his cheating scandal.\n\n\n\nLooks like her fans aren't ready to forgive Tristan just yet, even though they are clearly trying to make it work.\n\nJuly 25, 2018: It looks like not everything is what it seems between Khloe and Tristan. The couple seem to be having trouble together and it looks like Tristan is the one that wants out of the relationship.\n\n“Khloé and Tristan are still not fully OK,” a source told US Weekly. “They act like they are when they’re in front of others, but it’s all a show at this point.”\n\n\n\nAccording to US Weekly, Tristan has stopped going to couples therapy with Khloe and has openly shared that he wants to move back to Cleveland.\n\n“Tristan is feeling trapped in a bad relationship,” another source said. “He’s no longer going with Khloe for sessions. He just didn’t feel it was helping to discuss s**t that happened months ago.”\n\nJuly 11, 2018: Tristan just couldn't wait to share a dance with baby True and, luckily for us, Khloe was right there to film the beautiful moment.\n\nKhloe shared the video on her on Snapchat of the two sharing a father-daughter dance together. Khloe can be heard laughing in the background while watching them. Check out the adorable video below:\n\nJune 20, 2018: While Khloe and Tristan haven't been completely open about the cheating scandal that almost ruined their relationship, a source told UsWeekly that it will be addressed in the next season of Keeping Up With the Kardashians.\n\n\"They always discuss real life things on the show. They’ve never ignored a topic,\" a source told Us Weekly. \"It will definitely be brought up, but they don’t know how much. They can film hours about it, but in the end, Khloe is one of the executive producers and will have final say on what actually makes air.\"\n\nThe source also says that Tristan is upset that it will be talked about on the show, but Khloe has assured him that it will only be a small part of the season.\n\nJune 19, 2018: The Kardashian clan has officially forgiven Tristan for cheating on Khloe and he is planning to move to Los Angeles for the summer.\n\nAccording to Entertainment Tonight, Tristan is currently staying over Khloe's house in Los Angeles in an effort to work on their relationship.\n\n“[Tristan] has a home in L.A. too, but the plan is to live together as a family at Khloe’s home as they continue to work on their relationship,” a source told Entertainment Tonight. “Everyone is back on board -- friends, family and Khloe have all forgiven him and are giving him this second chance -- and so far it’s been working for them.”\n\n\n\nKhloe and Tristan have been spending a lot of time together in Los Angeles. They recently went on a date night with sister Kendall Jenner and her rumored boyfriend, Ben Simmons, and they were seen together at a McDonald's drive-thru.\n\nJune 18, 2018: Looks like Tristan is in the City of Angels as he was spotted hanging out with Khloe at Dave Chappelle's private friends and family only private show, taking a night off from being with baby True. E! News also reports that Kendall and her rumored boyfriend, Ben Simmons, also joined them. Later, they moved to Poppy nightclub, where they also met up with Kris and Corey Gamble, according to Entertainment Tonight .Despite them now being in Los Angeles together, there's still no word on whether Tristan will be moving in or if he is just visiting for now.\n\nJune 17, 2018: On Father's Day, Khloe and baby True traveled from Cleveland to Los Angeles after the end of NBA season. Kylie and Stormi decided to give them a very special welcome back home with a teddy bear and balloons that said, \"welcome home, Khloe and True. Stormi and Kylie - we love you.\"\n\nAccording to E! News, the Kardashian family are very happy to see Khloe back in LA and that they'll see more of True.\n\n\"The whole family is thrilled that Khloe is home and that they will get to be close by and an every day part of True's life. They made it a big celebration and welcome home for her.\"\n\nE! News also reported that Father's Day was going to be a rough day for Khloe and she specifically wanted to spend it with her sisters.\n\nTristan also took to Instagram to give a shout out to his two children for Father's Day with two new necklaces with their names on them.\n\nThere's no word if Tristan will be moving out to Los Angeles to be with Khloe and True, but with the end of basketball season, it's likely that he will also make the big move soon.\n\nJune 13, 2018: Khloe shares a cute pic of her baby girl to celebrate her 2-month birthday. The photo is caption: \"Baby True.\" What a cutie!\n\nKhloe shared the first video of True (complete with a fun IG filter) for her 1-month birthday. If it continues like this, we'll have to set an alarm for the 12th of every month so that we can be sure to catch of new glance of Koko's cutie.\n\nKoko's pic of True comes right after sister Kylie swore off sharing pictures of her baby, Stormi. After receiving some negative comments about Stormi on Instagram, Kylie decided that she's not here for the trolls.\n\nAn insider told People:\n\n“Kylie felt so protective of her baby when she was pregnant. This is why she didn’t share any bump pictures while she was pregnant. After Stormi was born, Kylie was the proudest mom.”\n\n“She couldn’t wait to show off Stormi to her fans. She posted pictures, because she was so excited to be a mom. Unfortunately, social media is a crazy place. People have been making nasty comments.\"\n\n“Kylie is shocked and doesn’t want her daughter’s pictures to be a part of something negative. She might reconsider in the future, but for now, she won’t post any more photos of Stormi’s face.”\n\nJune 7, 2018: Don't get it twisted: Just because Khloe seems to be back on with Tristan doesn't mean her family in on board. A source told People that Tristan will be returning to Cali with Khloe (and baby True in tow), but that the Kardashians aren't thrilled about it. Apparently, they are still \"very unhappy\" with him. “It will be interesting to see how they will treat him. Although Khloé defends him and her reasons to stay with him, her family feels she deserves much better,” the source told the outlet.\n\n\n\nJune 4, 2018: Khloe and True are moving back to Los Angeles, according to a very reliable source, momager Kris Jenner. \"We go back and forth,\" Kris told E! News when asked how often she saw Khloe (who is currently in Cleveland). \"I FaceTime with her every day. So that's a lot of fun.... She'll be home soon.\"\n\nJune 3, 2018: Some Koko fans are not loving the star's decision to stay with Tristan, and they are letting it be KNOWN. One person tweeted at the celeb, saying: “A year from now @khloekardashian will be over all of this and feeling salty for her super passive IG posts. She’s just in the stage of ‘but I love him!’ Until then let her pretend he’s changed and they’ll be a happy family. #WednesdayWisdom.”\n\nDamn. Well, if this fan thought her tweet would just evaporate into the inter-ether, she was damn wrong. Khloé shot back,“Babe that’s not wisdom at all because you’re assuming you know who I’m talking about and you’re assuming you know my feelings. Assuming anything is anything but wisdom.\"\n\nTouché.\n\nMay 31, 2018: In case you were wondering how Kanye felt about Tristan's cheating scandal, well, now you know. Kanye hosted a listening party for his new album \"Ye\" in Wyoming, and people immediately picked up on a reference to Tristan's cheating scandal in one of the songs.\n\n\n\n\"All these thots on Christian Mingle / That’s what almost got Tristan single / If you don’t ball like him or Kobe / Guarantee that bitch gon’ leave you,\" he says.\n\n\n\nFans were shook, to say the least.\n\nMay 30, 2018: Sounds like Tristan is throwing himself a bit of a pity party. A source told Us Weekly that Tristan is \"completely emotionally and physically exhausted from the cheating allegations and of course the playoffs.\" Ok, yes, the playoffs are a big deal, but is he seriously complaining about the drama that he started?! Unbelievable.\n\n\n\nBut that's not all we have to report on this drama-filled day. Khloe took to Twitter and clapped back at a woman who shared some pretty judge #WednesdayWisdom, concerning the cheating scandal.\n\n\"A year from now @khloekardashian will be over all of this and feeling salty for her super passive IG posts. She’s just in the stage of “but I love him!” Until then let her pretend he’s changed and they’ll be a happy family. #WednesdayWisdom,\" the Twitter user wrote.\n\n\n\nKhloe responded, \"Babe that’s not wisdom at all because you’re assuming you know who I’m talking about and you’re assuming you know my feelings. Assuming anything is anything but wisdom.\"\n\nMay 15, 2018: Khloe gets real about who truly thought of the adorable name True for her baby girl. “My grandma MJ suggested True,\" the star wrote on her app. \"She told me it was my great-grandfather’s first name and my grandfather’s middle name. It stuck with me for my entire pregnancy and was the only one I couldn’t get out of my head.” So cute!\n\n\n\nMay 14, 2018: Khloe (kind of, sort of) made her first statement regarding Tristan's cheating scandal. On her Instagram stories, she published the quote, \"It's all about who you look for in a crowded room. That's where your heart belongs.\" Khloe has posted quotes on Instagram before, but this one seems pretty intentional.\n\nMay 13, 2018: Looks like Khloe had a really good first Mother's Day! In case you missed it, she took to Snapchat and posted a cute pic of her True in honor of the holiday.\n\nOn her Instagram stories, she shared pics of a beautiful flower arrangement and \"KOKO\" balloons, which you can see, below. Now, the question is, who sent those gifts?! Was it Tristan Thompson or someone from the family, like Kris Jenner?\n\nInstagram\n\nInstagram\n\nInstagram\n\nMay 12, 2018: Khloe finally introduced her daughter True to the world with a super cute video on Instagram. In the video, True is rocking a floral Snapchat filter and batting her adorable eyes at the camera. \"Happy One Month True,\" Khloe wrote.\n\nInteresting enough, some fans think True looks a lot like her cousin, Stormi Webster (a.k.a. Kylie Jenner's daughter). Do you see the resemblance?\n\nMay 11, 2018: Ever since True's birth, fans have been anxiously awaiting the first pic of Khloe's darling baby girl. And that day has finally come... though it seems like it may have happened by accident!\n\nKhloe posted a few quick selfies on Snapchat. In them, she looks glam as hell, lying on her bed and rocking a camo sweatshirt. But, if you look at the corner of the image, you can spot baby True's tiny little hand.\n\nSnapchat\n\nTrue seems to be wearing a light pink and white onesie. And she just looks oh-so-cozy on her mama's chest. So precious.\n\nMay 10, 2018: Apparently, Tristan blocked Khloe's sister Kim on social media after she addressed the cheating scandal during an episode of The Ellen Degeneres Show.\n\n\n\n\"Like, I don’t even know how to describe it other than it’s just so f*cked up,\" she said at the time. \"We really were rooting for Khloé. And we still are. She’s so strong and she’s doing the best she can. It’s a really sad situation all over.\"\n\nSince then, she has appeared on Live With Kelly and Ryan. Naturally, Ryan Seacrest wanted to hear her thoughts on all the drama, and so he asked, \"Is there any part of you that roots for Khloe and Tristan?\"\n\nShe responded, \"OK, last time I went on TV and I answered some questions about her I got blocked on social media—and not from Khloe. So, I'm going to...yes, I'm always rooting for her. I'm always rooting for love. I'm always rooting for families.\"\n\nInteresting answer, Kim. Very interesting.\n\nAlso, details about what went down in the delivery room continue to come to light. Apparently, before baby True broke through with her cry, someone else had a breakdown in the hospital room.\n\n\"Khloé has completely forgiven Tristan for cheating on her, and it really wasn’t hard for her to do because he literally broke down crying in her hospital room after she had given birth to True,\" a source tells Us Weekly. \"Tristan was absolutely devastated that he had hurt and betrayed Khloé. Adding to the grief, was of course the timing of when it all came out, the days before she gave birth.\"\n\nAnd it sounds like Tristan doesn't think that getting caught was necessarily a bad thing. \"Khloé has always said that everything happens for a reason, but absolutely loves Tristan,\" the source says. \"He actually told Khloé he was relieved that it had come out, and that he thinks subconsciously he wanted to get caught.\" The source went on to say that he \"knew there were paparazzi taking pics of him in New York City, but that didn’t stop him from taking a woman back to his hotel.\"\n\n\n\nMay 9, 2018: Tristan finally opened up about his daughter True while on the basketball podcast Road Trippin. He revealed that she has green eyes and was born 21-inches long. Later on, he explained the difference between raising his first-born, Prince, and True.\n\n\n\n“I think with a girl, you’re just so much more emotionally like… with a boy, it’s just like, ‘Hey man, you’ll be all right man. Stop crying,'” he explained. “But [with True], it’s like, ‘True, it’s gonna be okay. You know, we’re right here. Daddy’s here to feed you. It’s me! Look, yeah!’ It’s way different, but it’s fun, though. It changes you.”\n\n\n\nFor the record, there's a lot of good that can come from parents letting their sons express a range of emotions, but looks like Tristan has a different perspective on that.\n\nMay 8, 2018: According to TMZ, Khloe and Tristan go out to see an afternoon movie together at a theater a few miles outside of Cleveland. The outlet says that they looked \"very much like a couple again.\" They were seen buying snacks in the theater lobby, and leaving in the same car after.\n\nThis movie outing comes at the same time that reports about how Khloe's family feels about the whole situation start to surface. According to TMZ, the Kardashians are \"outraged\" over Tristan's cheating scandal. However, they hope Khloe will remain civil with Tristan for True's sake. \"We're told the family privately feels they may never forgive Tristan, but they're not going to attempt to torpedo the relationship,\" the site wrote. Well, let's hope everyone can keep the peace.\n\n\n\nMay 7, 2018: Some fans thought Khloe naming her daughter True was ironic given Tristan's cheating scandal, but a source told Us Weekly Khloe and Tristan had picked their baby girl's name way before the news broke.\n\n\n\n“True had already been picked for a while,” the source said. “She went into labor not even knowing the full scope of the cheating so the option of changing her name wasn’t even brought up. It’s too much for one person to deal with during the crazy time.”\n\n\n\nThe source added, “A lot of people thought she’d change the name and were waiting to send her gifts. Everything that Khloe bought during her pregnancy was already monogrammed True.”\n\n\n\nMay 5, 2018: According to E! News, Khloe reportedly attended Tristan Thompson's basketball game, in which the Cleveland Cavaliers played against the Toronto Raptors. An eyewitness told the outlet Khloe arrived a little bit into the first quarter but stayed until the end. Throughout the game, she was cheering, clapping, and interacting with the fans around her. And as you might expect, she looked fabulous AF.\n\n\n\n\"She had her hair done and red lipstick on. She wore black aviators inside the whole game, only taking them off once to powder her face,\" the source said.\n\nMay 4, 2018: According to Us Weekly, Khloe and Tristan are “fully back together.” An insider told the site that Khloe has seen all of the photos and videos of Tristan with other woman. Yet, she's still in love with him.\n\nThe insider also said Khloe feels “the whole world is against Tristan.” The Kardashian-Jenner family might the exception to that claim, but only for Khloe's sake.\n\n“Those around Khloé are trying to be as supportive to her as they can. It’s hard because if everyone distances themselves from Tristan, they’ll risk losing Khloé,” the source said. “Luckily there’s this buffer time. She always planned to stay in Cleveland the first three months. Now with Tristan in the playoffs for possibly another month, no decision needs to be made right now.”\n\n\n\nMay 2, 2018: Reports say Khloe disabled Instagram comments on every pic that includes Tristan. If you haven't noticed, you can see for yourself, below.\n\nInstagram\n\nHowever, the comments section on the photos that don't include Tristan have stayed the same.\n\nInstagram\n\nAlthough it's not clear when Khloe disabled the comments, it's probably safe to assume the change was made because of Tristan's cheating scandal. Many fans have been defending Khloe, but it's likely she wanted to keep the drama away from her feed. Meanwhile, fans are still posting hateful messages on Tristan's Instagram account.\n\n\n\nApril 29, 2018: Tristan finally broke his social media silence, but failed to address any of the cheating allegations. Instead, he celebrated his team's victory over the Indiana Pacers in an Instagram post. In the caption, he wrote, \"\"WHAT AN ATMOSPHERE IN THE Q!! GREAT WIN #OnToTheNextOne.\" Meanwhile, people defended Khloe Kardashian in the comments section.\n\n\n\n\"KHLOE BETTER BE ON TO THE NEXT ONE TOO 👋🏼,\" one fan wrote.\n\nApril 24, 2018: Entertainment Tonight reports that an exclusive source says that Khloe is \"not in a bubble of denial. She knows what's going on and is still trying to process it, but so far, she's managed to move past it and look forward.\"\n\nThe source says that five women have come forward with cheating allegations. Some claim they had months-long affairs with Tristan and one woman even said she slept with him the night before Khloe's baby shower.\n\n\n\nEven with these reports, the insider says Khloe is set to stay put in Ohio... at least for now.\n\n\"Khloe is very settled in Cleveland right now and is planning on staying another few weeks to a month at least. Of course, that could change, especially since every day there seems to be more stories out about Tristan.\"\n\n\n\nApril 19, 2018: According to People, Tristan left Cleveland and made his way to Indianapolis, where he and his team (the Cleveland Cavaliers) will play against the Indiana Pacers in the NBA playoffs. This is reportedly the first time Tristan has left Cleveland since Khloe gave birth to their daughter, True.\n\nAlthough Khloe and her newborn daughter remain in Ohio, they will reportedly head to L.A. once they receive doctors' approval to fly. Given Tristan's recent cheating scandal, the move seems only natural.\n\nApril 16, 2018: In a super pink Instagram post, Khloe announced that her and Tristan's baby girl was named True Thompson. So cute!\n\n\n\n\"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE. Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True!,\" she wrote.\n\nApril 12, 2018: Khloe gives birth to her and Tristan's baby girl. TMZ and E! News confirm the delivery with a source close to the couple. Kris and Kim reportedly flew to Cleveland to be by KoKo's side during the labor. ET reported that Kourtney and best friend, Malika Haqq, were in the delivery room when Khloe gave birth. Khloe reportedly arrived at the hospital on Wednesday night. Whether Tristan was present in the delivery room or not has yet to be confirmed, though TMZ also reported today that Kardashian would allow him in the delivery room with her.\n\nET's source says that Tristan has been \"apologetic and begging for forgiveness\" since the scandal.\n\nApril 11, 2018: Tristan Thompson is accused of cheating on Khloe Kardashian after videos of him getting intimate with several different women hit the web. First, the NBA player was spotted kissing a woman at a rooftop bar called PH-D in Manhattan. The woman is believed to be Instagram model Lani Blair. Footage obtained by TMZ also shows Tristan arriving at his hotel, after leaving the bar, with a mystery woman.\n\nTMZ\n\nThen, surveillance footage from October 2017 (when Khloe was three months pregnant) is released. It shows Tristan getting cozy with two women at a club outside of Washington D.C.\n\nThough neither Khloe Kardashian nor Tristan Thompson have commented on his alleged cheating, Page Six reports Khloe \"went absolutely ballistic\" on Tristan when she found out. She was “devastated when she saw the pictures of Tristan with that girl, she went absolutely ballistic at him,\" a source close to the Kardasian family reportedly said. \"She is not only hurt, she is humiliated and worried for their child. How could he do this, and so publicly, when their baby daughter could arrive within a week?”\n\n\n\nApril 9, 2018: According to a report by TMZ, Khloe Kardashian is in Cleveland waiting to go into labor with boyfriend Tristan Thompson by her side.\n\nMarch 15, 2018: Fans wonder if Khloe and Tristan's baby will keep up with the Kardashian tradition of having a \"K\" first name. After Twitter tosses the question back and forth, Khloe decides to weigh in. \"I think im going with a T,\" she writes.\n\nMarch 11, 2018: Khloe and Tristan throw a very pink baby shower to celebrate their first daughter. According to People, the shower was sponsored by Amazon Baby Registry at the Hotel Bel-Air in Los Angeles.\n\nIn a sweet Instagram post, Khloe writes...\n\n\"💕 Where do I even begin?!?! How do I even begin to give thanks and praise to ALL of the people who took part in helping create the most incredible baby shower? @jeffleatham and his ENTIRE team and @mindyweiss and her ENTIRE team, THANK YOU for creating the most magical memories I get to keep for the rest of my life!!! WOW, is truly all I can say! They say “love is in the details”, I couldn’t agree more! Look at all the LOVE! From my mommy’s hand written Baby Thompson sign to each and every flower placed. Love was involved! I wish I could post every single picture! I’m still dreaming 💕\"\n\nMarch 9, 2018: It's reported that Kris Jenner and Khloe Kardashian are spotted shopping for baby gear at Petit Tresor and Couture Kids. Kris reportedly pays a whopping $8,000 for all the nursery items.\n\n\n\nMarch 4, 2018: On the season finale of Keeping Up With the Kardashians, Kylie Jenner helps reveal that Khloe is having a girl! Khloe has her gynecologist give Kylie the news first, and then Kylie calls Khloe to tell her that a baby girl is on the way. Khloe is shocked (she thought she was having a boy).\n\nFebruary 16, 2018: According to a report by Us Weekly, Tristan Thompson was not acting like someone with a pregnant girlfriend during NBA All-Star weekend. Apparently, he had an \"inappropriate encounter\" with not one, but TWO women.\n\nThompson was seen \"getting cozy\" with models Jasmine Rose and Maya Nova James out February 16, according to the report.\n\n\"Two girls were hanging out with Tristan and his crew, some other basketball players and Canadian friends, at Avenue in L.A. during All-Star Weekend,\" a source told Us Weekly. \"The girls were at his table and Tristan was paying more attention to one of them, but he wasn't all over her. These girls are models and were in a fashion show for Angel Brinks that weekend and are shooting a show with her.\"\n\nThings didn't get really inappropriate until later on when the group went to a bar called Lavoo Lounge. \"It was the group of guys and the two girls,\" the source revealed. \"Tristan wasn't kissing on the girls, but he had his arms around and on the one that looks more like Khloé, Jasmine. Tristan was flirting with her and didn't look or act like someone who had a pregnant girlfriend. The flirting and body language were definitely inappropriate for someone in a serious relationship expecting a baby.\"\n\nJanuary 5, 2018: Khloe sits down with Jimmy Kimmel to talk about how she found out she was pregnant. \"Tristan kept saying 'You're pregnant' and I was like: 'Be quiet. I'm not pregnant,'\" Khloé says. \"I was nauseous, not feeling well and then he had to leave the country and I took a pregnancy test. I was like screaming. It's so weird and surreal.\"\n\nJanuary 4, 2018: Khloe makes her first interview appearance baring the bump on the Ellen DeGeneres Show. She talks about why she wanted to keep the pregnant private for as long as she did. \"I just wanted to do something myself and write something that was heartfelt for me,\" she said about her super emotional Instagram announcement.\n\nJanuary 2, 2017: Khloe poses with boyfriend and Tristan Thompson to celebrate the six month mark in her pregnancy. She captioned the photo \"Mom and Dad.\" Khloe stuns in a ruched black LBD and Tristan wears a classy tux.\n\nDecember 21, 2017: With her big sisters by her side, Khloe has reportedly felt prepared to take on motherhood. \"Kourtney Kardashian and Kim Kardashian have been giving her a lot of pregnancy tips and Khloe calls them for every little question she has,\" a source shared with E! News.\n\n\n\nDecember 20, 2017: Khloe confirms her pregnancy in an emotional Instagram post that features a black and white photo of her pregnant belly. The photo also features a massive diamond ring that Khloe wears on THAT finger. Fans start to speculate that the two may be engaged.\n\nSeptember 26, 2017: Multiple outlets report that Khloé is pregnant.\n\nSeptember 24, 2017: On the KUWTK 10th anniversary special, Khloe can't help but restate that her relationship with Tristan is \"serious.\"\n\nJuly 11, 2017: Khloé and Tristan share a BTS video from a sweet workout session. She rocks a bright purple workout sports bra with matching leggings and shoes with a black baseball cap.\n\nJune 27, 2017: Tristan arranges a surprise party for Khloé's 33rd birthday. He also takes to IG, saying, \"Happy bday my love, this picture right here sums up how wild, crazy and how much we love each other. Let's continue to build more memories and cherish them with each other.\"\n\nKhloe is clearly thrilled with the surprise birthday celebration. \"Im so lucky and blessed! Thank you so much baby!!!\" Khloé tweeted. \"You treat me like a queen!\"\n\n\n\nJune 11, 2017: On the season-13 finale of KUWTK, Khloé talks about whether she and Tristan are ready for kids or not. \"Tristan and I definitely talk about starting a family,\" she says. \"He wants to have, like, 5 or 6 kids with me, and that's lovely...Now, knowing I'm not on birth control, it's scary. That's like a really big step.\"\n\n\n\nApril 11, 2017: Khloe sits down for a telling interview with ES Magazine during which she says she has \"never been in this type of love\" and \"yes, [she] would\" marry Tristan if he proposed to her. \"I would love to have a family,\" she says. \"We’ve talked about it … I know for a fact that he would be an impeccable father.\" (He has a child with ex girlfriend Jordan Craig). \"I definitely want to be a mom. But I don’t put the pressure on it. It’s not like, 'The clock is ticking.' I feel in my soul it will happen.\"\n\n\n\nMarch 14, 2017: Khloe throws Tristan a gold-themed 26th birthday. She rocks an LBD and big hoop earrings for the occasion. Tristan shower up to party in a floral tee and backwards baseball cap. Khloe writes on IG: \"To the happiest of birthdays my love!\"\n\n\n\nMarch 12, 2017: The season-13 premiere of Keeping Up With the Kardashians shows a nervous but excited Khloé introducing Tristan to her family.\n\n\n\nFebruary 19, 2017: E! News reports that the couple went zip-linging in Jamaica.\n\n\n\nJanuary 12, 2017: Khloé tells Extra that she hopes Tristan is her forever love.\n\n\"I mean, I think that’s why we are in relationships — to find the One,\" she says. \"And, I mean, I am in love with him. I think he’s, like, the best. And yeah, so I hope so. Only time will tell.\"\n\nJanuary 11, 2017: Khloé tells James Corden that she and Tristan have told each other \"I love you.\"\n\n\n\nDecember 25, 2016: Tristan sends out his version of an IG holiday card, wishing everyone a happy holiday using a pic of him and Khloe.\n\n\n\nNovember 3, 2016: Khloe appears on the Jimmy Kimmel show where she says that she visits Cleveland often to be with her boyfriend. \"I actually really like it,\" she says. \"I like having my routine and being a little more under the radar.\"\n\n\n\nSeptember 15-18, 2016: Khloe and Tristan meet up in Miami, where they rock out at Kanye West's \"Saint Pablo\" tour and party it up at Flo Rida's birthday at club LIV. They pose for photos, and a friend takes over Khloé's snapchat and posts video of the two of them kissing.\n\n\n\nAt this time, momager Kris Jenner tells Us Weekly, \"They are really cute. She's having a good time. He seems like a really nice guy. I think just with any relationship, just in life, I think it's about chemistry and about values.\"\n\n\n\nSeptember 3, 2016: The couple spends Labor Day weekend in Cabo San Lucas, according to US Weekly.\n\n\n\nSeptember 2, 2016: It all began when TMZ reports that Khloé Kardashian and Cleveland Cavaliers player Tristan Thompson \"have been spending some serious quality time together recently.\" The two were spotted leaving a nightclub called Bootsy Bellows where they seemed to be enjoying each other's company.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.917xw:0.338xh;0.0353xw,0.0556xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-12-26-at-11-42-30-am-1545842625.png?crop=0.772xw:0.521xh;0.178xw,0.0108xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.917xw:0.338xh;0.0353xw,0.0556xh&resize=1200:*", "keywords": [], "authors": ["Alison Caporimo", "Tamara Fuentes", "Carolyn Twersky", "Digital Deputy Editor", "As The Digital Deputy Editor Of Seventeen", "I Help Our Site Director Oversee Content On The Site", "Across All Of Our Social Media Platforms.", "Entertainment Editor", "Tamara Fuentes Is The Entertainment Editor For Seventeen", "Covers Celebrity News"], "canonical_link": "https://www.seventeen.com/celebrity/celebrity-couples/a19747317/khloe-kardashian-tristan-thompson-relationship-timeline/", "title": "Khloe Kardashian and Tristan Thompson Relationship Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Tristan Thompson Reportedly Just Bought a House RIGHT By Khloé Kardashian's Home", "description": "Get ready for more drama...", "url": "https://www.seventeen.com/celebrity/celebrity-couples/a19747317/khloe-kardashian-tristan-thompson-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.917xw:0.338xh;0.0353xw,0.0556xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2019-06-27 03:05:58", "published_time": "2019-06-27 03:05:00", "section": "Celeb Couples", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.917xw:0.338xh;0.0353xw,0.0556xh&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "Khloe Kardashian and Tristan Thompson Relationship Timeline - Tristan Khloe Cheating Scandal Explained", "description": "Learn the details of every moment of Khloé Kardashian and Tristan Thompson's relationship with this timeline from when they first met to the numerous cheating rumors.", "keywords": "Khloe kardashian, tristan thompson, khloe kardashian tristan thompson, khloe kardashian tristan thompson relationship, khloe kardashian tristan thompson pregnant, khloe kardashian tristan thompson baby, khloe kardashian tristan thompson dating, khloe kardashian tristan thompson cheating, tristan thompson khloe kardashian age difference, jordyn woods tristan thompson,", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.654xw:0.483xh;0.175xw,0.0284xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,celebrity-couples", "sailthru.date": "2019-06-27T15:05:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.917xw:0.338xh;0.0353xw,0.0556xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/khloe-kardashian-tristan-thompson-1523906375.jpg?crop=0.654xw:0.483xh;0.175xw,0.0284xh", "sailthru.socialtitle": "Tristan Thompson Reportedly Just Bought a House RIGHT By Khloé Kardashian's Home", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1561575900.0, "source": "https://www.seventeen.com", "summary": ""}