{"url": "https://io9.gizmodo.com/why-you-should-read-the-american-gods-novel-before-watc-1794638929", "text": "Months ago, I waffled over whether to re-read American Gods before the TV show started airing. Did I want to experience the show as its own unique thing or should I go back to the book and reacquaint myself with the plot? The decision to go back to Neil Gaiman’s modern fantasy epic won out and I feel like I made the right choice, one that will change the way I watch the series.\n\nAdvertisement\n\nBased on what I’ve seen of the upcoming American Gods TV show, the main difference between the series and the award-winning 2001 novel it’s based on will be one of tonal approach. Both things tell the same story, where an ex-con named Shadow acts as bodyguard to older con man Wednesday as the latter prepares for a reckoning between old and new gods, but the color gradients feel different.\n\n\n\nThe TV adaptation of American Gods glimmers more brightly than the book. It’s not in the art direction or color choices so much as the self-consciously askew aesthetic of the show, which presents a fictional landscape where celestial energies are still flowing through the world. They show up in sharp neon contrast to the mundanity that we know. There’s a puckish playfulness in the performances, special effects, and shot angles that make the Starz series vibrate on a radiant wavelength.\n\nAdvertisement\n\nRevisiting the book while encountering the show makes the original text feel like it’s done up in a somber, more nuanced palette. Gaiman’s 2001 novel wears its intentions on its lapel like a boutonniere flower and is more of a character piece concerned with sketching out Shadow’s reactions to the long, strange trips he gets sent on. American Gods’ journey is one that happens through texts and traditions and Shadow’s arc throughout the book has him meeting deities and culture heroes who have been long forgotten. The book shows that we lose important pieces of the past when society moves on to worship new phenomena.\n\nOne thing the show won’t be able to do is seductively evoke an encyclopedic knowledge of myth and literature the way Gaiman does in the book. It’s long been a snarky compliment that Gaiman writes so he can show off what he’s read and American Gods teems with tangents and asides concerned with mythological ephemera from cultures all over the world. This signature practice rarely comes across as self-indulgent, though, because Gaiman makes it clear why he’s telling you about piskies, djinn, or thunderbirds. You might need to wait several hundred pages for the payoff, but the trust he asks for is earned.\n\n\n\nThe book clearly means to be a sweeping consideration of the metaphysics of the polyglot American soul, talking about what it means to believe in a higher power, move to a new land, and how the latter act impacts the former. There’s a cycle that American Gods investigates in an appropriately itinerant fashion: native people were here on this continent, other people came—either by free will or in bondage—and then displaced them in horrific ways. The migration patterns and available levels of agency for various groups changed over the centuries, but it was a constant that these different peoples had faith systems and folkways that they bought with them. In highlighting the different textures and bracing similarities of the small towns, big cities and dangerous dreamscapes that Shadow moves through, Gaiman illuminates the promise and threat of the idea that America is a place where anything can happen.\n\n\n\nAdvertisement\n\nHaving just finished re-reading the 750-page, author’s preferred version of American Gods, I’m thinking that there’s no way that the show will be able to touch on everything Gaiman accomplishes in the novel. Book passages do get used almost verbatim in the show, but the audience’s demands on the two forms of entertainment are so different that changes have to happen. But I like knowing where the book went and seeing where the show will diverge. I already prefer the TV version of Laura and Technical Boy to their book counterparts because they feel more aligned to the current cultural moment.\n\nThat kind of cross-media change isn’t a new paradigm, but the effect here winds up making the book’s very existence even more mythological. Now the novel is itself a metaphorical story that’s being built upon and re-interpreted for a new age, like the myths that Gaiman builds on. American Gods is a meta-myth that’s getting a new layer laid on top of it, an exceedingly appropriate fate for a book about what happens to gods as the times and places change.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rjkqakulm7a6llv2ypzt.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rjkqakulm7a6llv2ypzt.jpg", "keywords": [], "authors": [], "canonical_link": "https://io9.gizmodo.com/why-you-should-read-the-american-gods-novel-before-watc-1794638929", "title": "Why You Should Read the American Gods Novel Before Watching the TV Show", "meta_data": {"google-site-verification": "Y4KzRYvFDIszZROrGQfpcKGpEMqT5ncYtgHhRW8D7P0", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eh1hvjxamru5z6aobgwc.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/eh1hvjxamru5z6aobgwc.png", "keywords": "American gods, Neil Gaiman, Starz, TV, Books, io9", "news_keywords": "American gods, Neil Gaiman, Starz, TV, Books, io9", "twitter": {"url": "https://io9.gizmodo.com/why-you-should-read-the-american-gods-novel-before-watc-1794638929", "card": "summary_large_image", "site": "@io9", "title": "Why You Should Read the American Gods Novel Before Watching the TV Show", "description": "Months ago, I waffled over whether to re-read American Gods before the TV show started airing. Did I want to experience the show as its own unique thing or should I go back to the book and reacquaint myself with the plot? The decision to go back to Neil Gaiman’s modern fantasy epic won out and I feel like I made the right choice, one that will change the way I watch the series.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rjkqakulm7a6llv2ypzt.jpg"}, "description": "Months ago, I waffled over whether to re-read American Gods before the TV show started airing. Did I want to experience the show as its own unique thing or should I go back to the book and reacquaint myself with the plot? The decision to go back to Neil Gaiman’s modern fantasy epic won out and I feel like I made the right choice, one that will change the way I watch the series.", "og": {"title": "Why You Should Read the American Gods Novel Before Watching the TV Show", "type": "article", "url": "https://io9.gizmodo.com/why-you-should-read-the-american-gods-novel-before-watc-1794638929", "description": "Months ago, I waffled over whether to re-read American Gods before the TV show started airing. Did I want to experience the show as its own unique thing or should I go back to the book and reacquaint myself with the plot? The decision to go back to Neil Gaiman’s modern fantasy epic won out and I feel like I made the right choice, one that will change the way I watch the series.", "locale": "en_US", "site_name": "io9", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rjkqakulm7a6llv2ypzt.jpg"}, "fb": {"app_id": 44615671688}}, "movies": [], "publish_date": null, "source": "https://io9.gizmodo.com", "summary": ""}