{"url": "https://www.thedailybeast.com/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending", "text": "“Our show’s never been about the traditional, tidy wrap-up.”\n\nThat’s what Lena Dunham had to say to The Daily Beast about why Sunday night’s series finale of Girls focused not on the entire cast, but on only Hannah and Allison Williams’s Marnie raising Hannah’s baby—named Grover!—together in the country.\n\nNow that the show has officially wrapped its groundbreaking, award-winning, zeitgeist-seizing six-season run on HBO, Dunham and Girls’s co-showrunner and executive producer Jenni Konner, who also directed Sunday’s finale, hopped on the phone together to talk about the last episode, the show’s legacy, and baby names. (“It like had to be something that wasn’t, like, far-out celebrity baby name, but it also couldn’t be a generic name,” Konner says about the name Grover. “She knew he had to be the only one in the class with that name.”)\n\nThe last episode of Girls flashes forward five months to Hannah and Marnie co-parenting Grover together. Hannah is struggling to bond with her son, can’t get him to breastfeed, and is breaking down over the anxiety of it all. Marnie, in her Type A way, picks up all the slack, which overwhelms her to the point that she calls Hannah’s mom, Becky Ann Baker’s Loreen, to come give Hannah a wake-up call.\n\nAmid Hannah ignoring Grover’s crying, napping all day, and wandering the streets with no shoes or pants on—of course—Loreen tells her, “You made the choice to have this child, and guess what? It’s the first one you can’t take back.”\n\nAs for the all-important final shot, of which there was much speculation about going in to Sunday night, particularly in terms of what music would play, it’s of Hannah’s reaction after Grover finally latches onto her breast, after which she starts singing Tracy Chapman to herself. “Jenni was like, ‘I wonder if anyone’s guess is ‘Fast Car’ lightly mumbled,’” Dunham laughs.\n\nSo with the finale finally having aired, here’s our conversation with Dunham and Konner about the choices made, why last week’s penultimate episode purposefully felt like more of a series finale, whether they ever considered Hannah having an abortion, and how think piece culture affected the end of the show.\n\nYou named the baby Grover.\n\nJenni and Lena, in unison: We diiiiid!\n\nI imagine there’s a certain amount of pressure in naming Hannah’s baby. Why Grover?\n\nJenni: Lena literally showed up one day and walked into the writer’s room and was like, “His name is Grover.” And we were all like, “Yeah that sounds about right.”\n\nLena: We did not have a baby name list. We were just like, “That seems like what she would name her baby.”\n\nJenni: It like had to be something that wasn’t, like, far-out celebrity baby name, but it also couldn’t be a generic name. She knew he had to be the only one in the class with that name.\n\nI would venture he’ll be the only Grover Horvath.\n\nLena: It couldn’t be trendy but it also couldn’t freak you out.\n\nJenni: The truth is that when we shot Riz [Ahmed], we went back to that. That was a little improv on the day where it was, “What if it’s his idea?”\n\nLena: Jenni walked into that little funny set we had for his hotel room, and was like, “Let’s try a version where he says Grover would be a great name for the baby.” It’s funny, I don’t think we even told Riz that was the baby’s eventual name. Jenni just fed him that line and he did it. I only told him recently that the baby’s name was Grover and he was like, “She took my suggestion!?”\n\n[Jenni cracks up]\n\nJenni: The great part, too, is that Lena just realized—this wasn’t in our minds when we did it—that she bets he got it from Sesame Street.\n\nLena: There’s no way that guy knows the name Grover from anything else. He’s definitely not talking about Grover Cleveland.\n\nA lot of people thought last week’s episode could have worked as a series finale in its own right. What was behind the decision to focus the last half-hour on Hannah and the baby?\n\nJenni: We had a lot of story we wanted to tell. Judd was like, “Why don’t you make a finale that’s a finale, like a satisfying ‘here’s where everybody ends up,’” but we didn’t want to skip the part where Hannah becomes a mother. Like, how unfair to spend this whole season wondering what kind of mother Hannah would be and then never show it?\n\nLena: Also, our show’s never been about the traditional, tidy wrap-up. We wanted to be able to enjoy that beautiful musical montage moment [from last week’s episode] that’s given us chills and so many other people chills. But we’re also ending the way we’ve always ended everything, which is just like without a massive and clean conclusion.\n\nIt does feel appropriate.\n\nLena: We really felt like we got the best of both worlds and it was really fun because Nisha Ganatra, a director we love but had never worked with came and did episode nine and lent a very different feeling to it, and had the vision for the Hannah moving vs. party intercutting. And then Jenni got to come in and do an off-kilter but totally committed version of the energy that our show traditionally has.\n\nSome TV creators have an ending in mind as early as when they pitch a show. At what point did you realize that this is how you wanted the series to end, with Hannah having her baby and confronting motherhood?\n\nJenni: I have to say Lena’s been talking about it for a long time.\n\nLena: I said something about it pretty early, I think sometime between seasons one and two. I mean Jenni and I started talking about endings the night we premiered at SXSW. We were at a hotel in Austin, hotel rooms upstairs and downstairs from each other but obviously talking on our cell phones. We basically talked until we fell asleep about what would become of every character, what the rest of her life would look like, how she would die, and I feel like somewhere in that conversation we said something like, “Who would be the first person to have a baby?” And we were like, “Maybe it’s Hannah.” It always felt oddly natural to us, and it’s really been an interesting litmus test. We’ve gotten some beautiful emails from women who have chosen or not chosen, who have been forced into single motherhood for various reasons.\n\nJenni: Really moving.\n\nLena: And I’ve gotten some really moving emails from women who got pregnant and not chosen to have it. Last week I got a donation in my name to Planned Parenthood with a letter from a woman who said she chose to have an abortion, but that watching Hannah’s journey had made her feel more confident in her own decision. And, like, that’s the kind of thing that you can’t believe how lucky you are when you can spur anyone to think or feel that way. Then there’s definitely been the people who have been like, “This women could never have a baby, she’s going to drop it on its head, what the hell are you doing?” Probably one of my favorite lines of Jenni’s of all time is when I said there are a lot of people who would be worse mothers than Hannah, and Jenni said, “Yeah, like anyone on any Showtime show.” It was a great Showtime inside baseball joke.\n\nI think there were people who were surprised when the pregnancy storyline was introduced that it wasn’t used to make a statement about abortion. Was that a route you ever considered?\n\nJenni: I mean we’ve tackled abortion, you know? It would have been such a weird move, in my opinion, to, this late in our series, write that she gets pregnant and has an abortion. She’s right on that line of it could happen or it couldn’t happen, and the fact that Joshua [Patrick Wilson’s character] assumes it’s going to happen is very offensive to her. I think what’s interesting about the growth of these characters is that the second episode of the show is Jessa’s pregnant and there’s not a conversation for a second whether she would keep it or not.\n\nLena: Not at all.\n\nJenni: It’s not in the realm of possibility.\n\nLena: Mimi Rose had an abortion and we didn’t even know she was pregnant.\n\nJenni: Now we get to a place where it’s a few years later and it becomes a conversation, and that seemed like a really interesting idea of growth to us.\n\nLena: Completely. Plus I was like, you can not like our storyline but you certainly can’t come for my and Jenni’s pro-choice bona fides.\n\nThe line that lingered with me most from the finale was when Hannah’s mom says, “You made the choice to have this child, and guess what? It’s the first one you can’t take back.”\n\nJenni: I think that line is what the entire finale is about. Here’s this girl who’s been accused by everyone in the world—in her world, in the world of viewers, everyone—of being narcissistic so constantly. She’s a girl who quits a job she doesn’t like and leaves a relationship she doesn’t like. This is the first thing she can’t take back. We’re saying to you: this is it. This is Hannah with high stakes. Now we’re showing you high stakes.\n\nLena: I remember right before I made Tiny Furniture I very spontaneously quit a job as a hostess.\n\nJenni: Which we see in the movie!\n\nLena: Yep! My dad yells at me, like, “This is so irresponsible. If you had a baby or anyone depending on you, you wouldn’t be allowed to just go around quitting jobs!” And I remember looking and going, “Yeah! But I don’t!” It was this moment where I was like, I don’t, and I’m going to keep quitting things as long as I can. I’m gonna take all the naps I want and quit all the things I want. And this is the moment when Hannah can’t take all the naps she wants and quit all the things she wants. She truly can’t anymore.\n\nThere was a lot of curiosity about what song would play over the credits of the final episode, to the point that articles were written speculating about it.\n\nJenni: I know! We’ve been seeing all these articles. I was like, I hope no one turns it off too fast because you can hardly hear the song.\n\nLena: Jenni was like, “I wonder if anyone’s guess is ‘Fast Car’ lightly mumbled.”\n\nHow did you land on “‘Fast Car’ lightly mumbled?”\n\nJenni: This is a Judd thing. We decided not to use really almost any music through the episode, so that’s scary and unusual for us. I knew I wanted to hear Allison singing “Fast Car.” That was just a fantasy of mine, so we did it there. We were trying to figure out how to do the end and Judd said, “What if it’s just Hannah kind of mumble-humming ‘Fast Car’ in this weird way?” We called her up. She recorded it on her phone, sent it to us, and it was absolute perfection. We didn’t even change it for the final mix.\n\nDo you think the microscope the show has been under throughout its run and the culture of think pieces surrounding it influenced how you wrapped the show up at all?\n\nJenni: I mean it had to have seeped in, because we’re not made of wood. But I do think that this is an idea that we had so early on that we weren’t in think piece territory quite yet, and the internet bombardment either. I’ve always said I’d rather have people loving or hating than yawning. We’re really lucky that we go that, and especially this season that people cared so much, like with the Matthew Rhys episode, writing so much about it. And caring so much about last week’s penultimate episode. As much as we were not trying to cater to people, it feels really heavenly to have people understand what we’re trying to do and really appreciating it. It’s been a nice thing to go out with so much positivity.\n\nLena: The thing I was going to say about the think piece aspect is that I think we did a really successful job of in some ways cocooning ourselves. We made really intentional choices to seclude ourselves and we always had our work to return to in this really beautiful, private way. That really sustained me and made it feel possible to make choices outside of what the internet might be demanding. By the way, the internet is such a terrible psycho beast, where they want to tell you what to do but if you actually did what they told you to do, the bullies would then call you a weakling because you did what they told you to do.\n\nWe’re talking on Friday evening. How are you spending the airing of the finale Sunday night?\n\nJenni: We’re in separate cities. Lena and Allison and her parents are going to watch it. I don’t know what I’m going to do. Maybe I’ll watch it with Judd.\n\nLena: Not being with Jenni is super weird, and I would be on her sofa in two seconds. But we have to be in different cities right now. Being with Allison will be really special and emotional. She’s basically crying already and has already asked what I want to eat, two extremely Allison qualities. I think there will be a lot of texting Jenni pictures of whatever my face is doing.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1494008926/articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending/170414-fallon-girls-tease_bgey5e", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494008926/articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending/170414-fallon-girls-tease_bgey5e", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779074/author/Kevin-Fallon.jpg", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494008926/articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending/170414-fallon-girls-tease_bgey5e", "keywords": [], "authors": ["Kevin Fallon", "Senior Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending", "title": "‘Girls’ Series Finale: Lena Dunham and Jenni Konner Explain That Surprise Ending", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "‘Girls’ Series Finale: Lena Dunham and Jenni Konner Explain That Surprise Ending", "keywords": "Television", "og": {"title": "‘Girls’ Series Finale: Lena Dunham and Jenni Konner Explain That Surprise Ending", "description": "Lena Dunham and co-showrunner Jenni Konner discuss the untraditional ‘Girls’ finale, the episode’s unexpected last scene, and the show’s legacy. SPOILER ALERT!", "url": "https://www.thedailybeast.com/articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494008926/articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending/170414-fallon-girls-tease_bgey5e"}, "description": "Lena Dunham and co-showrunner Jenni Konner discuss the untraditional ‘Girls’ finale, the episode’s unexpected last scene, and the show’s legacy. SPOILER ALERT!", "authors": "Kevin Fallon", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-04-17T03:30:00.000Z", "author": "https://www.thedailybeast.com/authors/kevin-fallon"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@kpfallon", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1494008926/articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending/170414-fallon-girls-tease_bgey5e"}, "sailthru.date": "2017-04-17T03:30:00.000Z", "sailthru.expire_date": "2017-05-01T03:30:00.000Z", "publicationDate": 201704170330, "parsely-page": "{\"author\":\"Kevin Fallon\",\"link\":\"https://www.thedailybeast.com/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"THE END\"},\"post_id\":\"articles/2017/04/16/girls-series-finale-lena-dunham-and-jenni-konner-explain-that-surprise-ending\",\"pub_date\":\"2017-04-17T03:30:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Television\",\"typeArticle\"],\"title\":\"‘Girls’ Series Finale: Lena Dunham and Jenni Konner Explain That Surprise Ending\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/ZiA7c9j8KDA?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1492399800.0, "source": "https://www.thedailybeast.com", "summary": ""}