{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-evan-bass-carly-waddell-tv-wedding-scandal-1029765", "text": "Evan Bass and Carly Waddell's wedding, filmed during a halt in production, airs on Tuesday. The pair talk to THR about \"the absurdity of going on TV to fall in love.\"\n\nParadise is back and so is one of Bachelor Nation’s favorite couples — but it didn't always look that way.\n\nBachelor in Paradise alums Evan Bass and Carly Waddell are set tie the knot on ABC Tuesday when the fourth season returns for the second half of its two-night premiere. The two chose to say “I do” in Mexico, returning to the beaches where they first fell in love on last year's Paradise. Chris Harrison officiated their intimate ceremony at the Vidanta Nuevo Vallarta resort near Puerto Vallarta in June.\n\nBut the state of their televised wedding hit a snag when production on the series shut down. After a June 4 sexual encounter between two castmembers who had been drinking, Corinne Olympios and DeMario Jackson, a producer filed a misconduct allegation and studio Warner Bros. Television suspended filming on June 11 to investigate. Filming eventually resumed two weeks later, but Bass and Waddell's nuptials took place June 17, when the fate of the season was still up in the air.\n\nBass and Waddell now tell The Hollywood Reporter that the fate of their wedding, however, was never a question.\n\n\"We were always going to get married,\" Bass tells THR of the ceremony happening amid the investigation. \"Obviously if production was shut down, then it wouldn’t have aired, but the most important thing for us was to get married in Paradise.”\n\nBass, 34, and Waddell, 31, met and got engaged during the summer of 2016 on the third season of Paradise. Bass, an erectile dysfunction specialist, was introduced to viewers on JoJo Fletcher's season of The Bachelorette. Waddell, a singer-songwriter on Chris Soules' season of The Bachelor, also appeared on the previous season of Paradise.\n\nNow, the couple remains one of a handful of success stories to emerge from the franchise — and they now have their first child on the way.\n\nWhen they returned to Mexico amid the summer saga, they both had to block out the production shutdown to keep their TV fairytale going. “We were sort of in that wedding glow,” Bass explains. “It felt like we were in a bubble. It was all about the wedding. I think everyone was super respectful of the fact that this was our big day. It was all about us.”\n\nWaddell, who wore a dress by Israeli designer Idan Cohen, shared her favorite moment: Bass’ face when he first saw her walking down the aisle. “His jaw was on the floor.”\n\nBass added, “It felt so full-circle. A year earlier Carly was puking a few hundred feet away from where we were getting married on our first date.” The pair sealed the deal with a set of Neil Lane rings.\n\nOther Bachelor franchise alums present at the ceremony helped to ensure that the behind-the-scenes drama didn't tarnish their big day. \"Nobody wanted to bother us with stuff that would take us away from our wedding,\" Bass says. Wells Adams, who is the bartender on the current season and appeared on their cycle of Paradise, was one of Bass’ groomsman and texted him during the shutdown to offer his support: “Wells was like, ‘I don’t care man. I’m there.’”\n\nThe morning of their wedding, Bass published a column on THR pleading with ABC to not cancel the show. With the investigation still ongoing, WBTV and ABC were unable to offer any details on if the show would return.\n\nLooking back, Bass admitted that there was doubt in his mind that he pushed aside about whether filming on the show — and potentially the series — would ever resume. “I felt through sheer willpower that I could make it come back to life,\" he now says. \"I trust everyone that’s a part of the show. I felt like we knew it would come back.\"\n\nIn the wake of the season four investigation, the amount of alcohol consumed on set became a hot topic. As a result of the controversy, Paradise kept tabs on the cast's drinking when they returned to set — something Harrison will discuss with the cast, also on Tuesday's episode. Though new Paradise drinking rules were later put in place, the newlyweds said alcohol wasn't an issue during their wedding. “No one drank that much. It wasn’t like a crazy affair,” Bass says, while Waddell says she didn't even have time to drink at her own wedding.\n\n\"Paradise is a great parody of life,\" says Bass. \"I love the fact that it sort of illuminates the absurdity of going on TV to fall in love. It’s very American. We’re ridiculous, but it’s awesome.”\n\nAnd he still disagrees that Paradise is \"a drunk hookup show,\" something both Harrison and ABC reality chief Robert Mills echoed to THR earlier this week. \"There’s sexuality on the show,\" Bass says. \"The parts that are shown are sort of the fun, wild parts, but there’s so much more that happens, like the hours that we spend with a potential significant other. People don’t really drink that much. The show was more about relationships and discovering yourself.”\n\nWaddell adds, “We’re so excited to watch the season. The show has such a dear place in our hearts.”\n\nWaddell, now 13.5 weeks pregnant, says their baby is the size of a peach. The pair, who are due around Valentine's Day, are calling it a \"love child\" and will find out the sex of the baby in a week or so.\n\n\"We’re out of our minds with excitement,\" she says.\n\n\"The Bachelor producers are some of our greatest friends now,\" she adds. \"We were texting them pictures of our ultrasound, that’s how close we’ve become.\"\n\nDuring the wedding, all three of Bass' sons from a previous relationship spoke. Waddell described 16-year-old son Nathan's speech as being incredible because he called Carly \"Mom.\" \"He’s an introvert so him getting up at all and saying the things he did meant so much to us,\" she says.\n\nAs for the rest of the Paradise season — which returns to \"being Paradise\" after addressing the shutdown in the first two weeks — Bass and Waddell say they are ready to pass the torch.\n\n\"There’s going to be another couple this season that takes our place,\" says Bass, whose advice to making it as a couple is to ignore the negativity. \"You can’t let the haters affect your relationship,\" he adds. \"There’s no way it doesn’t affect you, but you have to work through that together. It’s crazy how one person’s tweet affects you.\"\n\nWaddell adds, \"Just be real and be honest.\"", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2011/06/abc_logo_2011_a_p.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2016/01/screen_shot_2016-01-13_at_10.16.11_am.png", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2018/12/colton_from_the_bachelor_-_publicity_-_h_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2019/05/hannah_brown_square.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/2017/08/147003_5725_-_h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/08/147003_5725_-_h_2017.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/08/147003_5725_-_h_2017.jpg", "keywords": [], "authors": ["Christina Schoellkopf", "Christina.Schoellkopf Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-evan-bass-carly-waddell-tv-wedding-scandal-1029765", "title": "'Bachelor in Paradise' Newlyweds on Getting Married During the ABC Show's Shutdown", "meta_data": {"viewport": "width=device-width", "description": "\"Paradise is a great parody of life,\" says Bass. \"I love the fact that it sort of illuminates the absurdity of going to TV to fall in love.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-evan-bass-carly-waddell-tv-wedding-scandal-1029765", "domain": "https://www.hollywoodreporter.com/", "title": "'Bachelor in Paradise' Newlyweds on Getting Married During the ABC Show's Shutdown", "description": "Evan Bass and Carly Waddell's wedding, filmed during a halt in production, airs on Tuesday. The pair talk to THR about \"the absurdity of going on TV to fall in love.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/08/147003_5725_-_h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Bachelor in Paradise' Newlyweds on Getting Married During the ABC Show's Shutdown", "description": "Evan Bass and Carly Waddell's wedding, filmed during a halt in production, airs on Tuesday. The pair talk to THR about \"the absurdity of going on TV to fall in love.\"", "url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-evan-bass-carly-waddell-tv-wedding-scandal-1029765", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/08/147003_5725_-_h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Bachelor in Paradise' Newlyweds on Getting Married During the ABC Show's Shutdown", "sailthru.description": "Evan Bass and Carly Waddell's wedding, filmed during a halt in production, airs on Tuesday. The pair talk to THR about \"the absurdity of going on TV to fall in love.\"", "sailthru.author": "Christina Schoellkopf", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-08-15 11:31:41", "sailthru.tags": "Live Feed, Television, ABC, Bachelor In Paradise, The Bachelor, The Bachelorette"}, "movies": [], "publish_date": 1502767901.0, "source": "https://www.hollywoodreporter.com", "summary": ""}