{"url": "http://www.walkoffame.com/selena-quintanilla", "text": "Selena Quintanilla\n\nHollywood Chamber Of Commerce Honors Selena Quintanilla\n\n‘The Queen Of Tejano Music’ Posthumously With a Star on the Walk of Fame\n\nWatch below the star ceremony as the Hollywood Chamber honors the late Selena\n\nThe Hollywood Chamber of Commerce proudly honored the late Selena Quintanilla with the 2,622nd star on the Hollywood Walk of Fame, Friday, November 3, 2017 at 6:30 p.m. The star was dedicated in the category of Recording at 1750 N. Vine Street in front of the historic Capitol Records Building.\n\n“Since day one of Selena’s selection into the Walk of Fame, not a day went by that we were not asked by fans when Selena would get her star. This day has come and fans from around the world will rejoice in her well-deserved honor,” stated Ana Martinez, Producer of the Walk of Fame ceremonies. “The Hollywood Walk of Fame honor is the only award which fans can share with their favorite icons. Without a doubt Selena’s star will be experienced by millions of her loyal fans for years to come!”\n\nHelping Emcee and Hollywood Chamber President/CEO Leron Gubler to unveil the star were guest speakers Mayor of Los Angeles, Eric Garcetti, Victor González, President of Universal Music Latin Entertainment and actress/director Eva Longoria. Accepting the star was Selena’s sister Suzette Quintanilla. Also at the event were the Quintanilla family and Selena’s widower, musician Chris Perez.\n\nA record was broken the night of Selena’s star ceremony. The crowd in attendance was at an astonishing 4,500 fans, surpassing the 4,000 fans that came to the star ceremony of mariachi singer, Vicente Fernandez.\n\nThe Hollywood Chamber of Commerce which administers the popular star ceremonies encourages people who are unable to attend and fans around the world to watch the event live exclusively on www.walkoffame.com.\n\nSelena Quintanilla was a singer/songwriter. Her contributions to music made her one of the most celebrated Mexican-American entertainers of the late 20th century. Her music, style and influence is as current today as when she was alive – a true institution for the ages. She was named Billboard Magazine’s \"Top Latin artist of the '90s\", the \"Best selling Latin artist of the decade\" and in 2016 charted as the 2016 “Top Latin Album of the Year, Female Artist” – her legacy lives in her music and family. While alive, Selena was regarded by the media and adoring fans as the “Tejano Madonna” for her cutting-edge look, style and dance moves. Today, she ranks among the most influential Latin artists of all time and is credited for catapulting the Texas sound into the mainstream national market.\n\nBorn on April 16, 1971 in Lake Jackson, Texas, Selena was the youngest child of the Quintanilla family. She debuted in the music scene in 1980 as the lead of the family band “Selena y Los Dinos” with her siblings A.B. Quintanilla and Suzette Quintanilla. Not only did Selena make record breaking music, but she broke all barriers of a male-dominated music industry. Her popularity exploded after she won the Female Vocalist of the Year in the 1986 Tejano Music Awards – a feat she would repeat nine consecutive years. Selena began recording professionally in 1982 and in 1989 she signed with the newly-formed Los Angeles record label EMI Latin and released her first of five record setting albums. Some of her most popular songs include: Bidi, Bidi Bom Bom, Dreaming of You, No Me Queda Mas, Amor Prohibido andComo La Flor.\n\nAside from her significant contributions to music and culture, Selena was active across her community as she donated time and money to many local and national civic causes – a tradition that continues today through the work of The Selena Foundation. In the mid-1980s, Coca-Cola appointed her its Hispanic ambassador and spokesperson. Her community engagement and the impact of her loss was so great, that two weeks after her death, George W. Bush — then governor of Texas — declared her birthday “Selena Day” in Texas.\n\nOn March 31, 1995, Selena passed away tragically and her passing made shocking global headlines. Her posthumous crossover album, Dreaming of You (1995), debuted atop the Billboard 200, making Selena the first Latin artist to accomplish this feat. In 1997, Warner Bros. Pictures released Selena, a film about her life and career, starring Jennifer Lopez as Selena. As of 2015, Selena has sold over 65-million albums worldwide.\n\nOn October 17, Google launched a video Doodle to celebrate Selena. The video Doodle explored the story of her life set to one of the most iconic songs: Bidi Bidi Bom Bom. The date also specifically marked the date of Selena’s first studio album release with Capitol EMI (self-titled “Selena”). The Doodle ran in 18 countries for 24 hours starting at midnight local time( except the US, where launch began at 9 p.m. on October 16/12 EST on October 17). Google partnered with the Quintanilla family to digitize for the first time and launch a Google Arts & Culture Exhibit on that same day.\n\n★★★\n\nABOUT THE HOLLYWOOD WALK OF FAME www.WalkOfFame.com\n\nThe Hollywood Walk of Fame is an internationally-recognized Hollywood icon. With approximately 24 star ceremonies annually broadcast around the world, the constant reinforcement provided to the public has made the Walk of Fame a top visitor attraction. The Hollywood Chamber of Commerce continues to add stars on the Walk of Fame as the representative of the City of Los Angeles. The Walk of Fame is a tribute to all of those who worked diligently to develop the concept and to maintain this world-class tourist attraction. The Walk of Fame is open to the public. No paid admission or assigned seating at star ceremonies.It is understood that the cost of installing a star on the Walk of Fame upon approval is $40,000 and the sponsor of the nominee accepts the responsibility for arranging for payment to the Hollywood Historic Trust, a 501(c)3 charitable foundation. The funds are used to pay for the creation/installation of the star and ceremony, as well as maintenance of the Walk of Fame. Download the official app for iPhones and Android devices at http://officialhollywoodwalkoffameapp.com\n\nFor more than 96 years, the Hollywood Chamber of Commerce has provided leadership, business development resources, networking, and government affairs programs and services to keep the Hollywood business and residential communities safe, relevant and economically vital. Jeff Zarrinnam, is the Chair of the Hollywood Chamber of Commerce Board of Directors 2017-18, and Leron Gubler is the President/CEO of the Hollywood Chamber of Commerce. For more information please visit www.hollywoodchamber.net.\n\nThe Hollywood Walk of Fame and the Hollywood Sign are registered trademarks of the Hollywood Chamber of Commerce.\n\n★\n\n#hollywoodwalkoffame #wofstargirl #walkoffame.com\n\nWe're on Facebook too! Like us at Hollywood Walk of Fame\n\nFind your favorite star on the Hollywood Walk of Fame", "images": ["https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/WoF-Favicon-32.png", "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2020/03/selena-quintanilla-star-2540.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E", "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/WoF-Logo-Final-400X221.png", "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/themes/brooklyn-child/profile/selena-quintanilla.jpg"], "top_img": "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/WoF-Favicon-32.png", "keywords": [], "authors": [], "canonical_link": "https://walkoffame.com/selena-quintanilla/", "title": "Hollywood Walk of Fame", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Selena Quintanilla - Hollywood Walk of Fame", "description": "Hollywood Chamber Of Commerce Honors Selena Quintanilla ‘The Queen Of Tejano Music’ Posthumously With a Star on the Walk of Fame Watch below the star ceremony as the Hollywood Chamber honors the late Selena The Hollywood Chamber of Commerce proudly honored the late Selena Quintanilla with the 2,622nd star on the Hollywood Walk of Fame, …", "url": "https://walkoffame.com/selena-quintanilla/", "site_name": "Hollywood Walk of Fame"}, "article": {"section": "Motion Pictures", "published_time": "2019-10-25T08:22:27+00:00"}, "twitter": {"card": "summary_large_image", "description": "Hollywood Chamber Of Commerce Honors Selena Quintanilla ‘The Queen Of Tejano Music’ Posthumously With a Star on the Walk of Fame Watch below the star ceremony as the Hollywood Chamber honors the late Selena The Hollywood Chamber of Commerce proudly honored the late Selena Quintanilla with the 2,622nd star on the Hollywood Walk of Fame, […]", "title": "Selena Quintanilla - Hollywood Walk of Fame"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": ["https://www.youtube.com/embed/nPAb1lZArQA"], "publish_date": 1571991747.0, "source": "http://www.walkoffame.com", "summary": ""}