{"url": "https://www.cosmopolitan.com/entertainment/celebs/a15336680/maia-alex-shibutani-olympic-ice-dancing-siblings-interview/", "text": "Maia and Alex Shibutani are not only considered to be major contenders for ice dancing gold at the PyeongChang Olympics, but they are also expected to do it having virtually spent no time apart over the past, IDK, 24 years. Ahead of the Games, the siblings spoke to Cosmopolitan.com about what really lies within that picture-perfect brother-sister relationship, movie dates (with each other), and how they hope to to make an impact beyond the rink.\n\n\n\nIs there a common assumption people make about you guys when they hear you spend all this time together?\n\nMaia Shibutani: People think that it’s really cool! They [do] wonder how siblings are able to work together so closely and get along, though.\n\nAlex Shibutani: Yes, people think it’s really cool because we think it’s really cool! Our parents raised us to care a lot about each other — we’re lucky that we have an awesome relationship.\n\n[But] sibling rivalry often gets brought up; you can care about your sibling and care about your family but, to the extent that we spend life together, people presume it does… occasionally present challenges.\n\nM: People tend to [say] either “wow, it must be amazing” or “oh, that must be so hard.” With any relationship when you’re working toward a goal with a teammate, there are days where it’s great and there are days it’s challenging, but the strength in our team is the way we work through that. We’re just really grateful to have been on this journey together.\n\nRuben Chamorro\n\nWhat don’t people ask you about very often that you wish you could talk more about?\n\nA: I think because we are such a strong team and so in sync on the ice, there's the perception that we’re literally always the same in life and that we have the same interests. We are different people! We are!\n\nAlex, when you say “different,” what specifically do you mean?\n\nA: We have some [different] interests outside of skating, which is great. It’s nice to be able to pursue other things. Skating is our priority; being the best ice dance team we can be is really important to us, yes, but we have different personalities! Maia is definitely more organized than I am, which is great. As evidenced by the fact that she's been the point person for scheduling this interview... we never would’ve talked if it were me! With me, I don’t know. My ego is what sets me apart.\n\nM: Alex is really charismatic and he brings a lot of great energy to whatever he’s doing. He works so hard. But as far as different interests, for example, Alex follows sports more closely than I do.\n\nA: Yeah. Interest-wise, we both to love see movies. Not separately, actually. We’ll go together just because that’s a fun way for us to relax and unwind with a bag of popcorn.\n\nWhat does it look like to have a relationship — any kind of relationship — with someone competing at such a high level?\n\nA: On a day-to-day basis, we’re each other’s best friends and we spend a lot of time together, sort of out of necessity [given] how much our training demands and how much we’re pushing each ourselves —\n\nM: And we’re really lucky we have a teammate who truly understands everything you’re going through, because you’re reaching for the same goal.\n\nA: Our coaches are our friends. Not to sound so pathetic, but our dogs are our friends. We have two Maltese dogs, one named Lily, the other’s named Pom — he’s named after one the main character in of our favorite movies, Kung Fu Panda. A lot of our non-skating friends we don’t, unfortunately, get to see very often, but we have a lot of friends on the U.S. Olympic team from our travels. On the relationship thing, it’s tough. There’s not a lot of time! Maia and I have an hour, maybe two, every so often to fit in a movie, but relationships outside of what we’re doing right now are very challenging and difficult.\n\nThat’s not to say we wouldn’t be interested in personal lives, it’s just… Right now, my [most important] relationship is with skating and trying to be the best skater I can be — and it's the same thing for Maia. It’s just complicated. It's not that it can’t be done, but there’s a lot of other things that we have to focus on.\n\nBroadcasting is a natural progression for some people in their lives after skating. Given your YouTube success, do you ever think about that?\n\nA: I think that it’s [an interesting prospect]. It would be nice, whenever the time comes for us to retire from skating, to be able to continue to perform in some way. We don’t have acting experience, per se [both laugh], but we did appear on the Nickelodeon show Nicky, Ricky, Dicky & Dawn a year-and-a-half ago. We played ourselves.\n\nM: We grew up watching all those sitcoms, so to actually be on one was really cool.\n\nA: We're skaters right now [but] we have some experience with hosting things. We hosted a series produced by Team USA where we talked about different Olympic and Paralympic sports, and that was fun because we were able to help write the scripts — we were able to inject a lot of our own humor and try to make it a fun watch. It was also our first time reading off a prompter!\n\nM: And a huge honor to be chosen to explain the Olympic and Paralympic sports to an audience.\n\nA: I think one of the things we enjoy about the Olympic movement is how much it’s affected our lives. The Olympics are so much more than just us. The values of the Olympics — strength, friendships, respect — are things we care a lot about and I think they apply beyond sports. So we’ve done some ambassador work as Sports Envoys and we’re doing a program with Team USA and the PyeongChang organizing committee where we’ve been mentoring kids in a middle school in South Korea.\n\nM: That’s one of the great things about social media and technology in general. No matter where you are, you’re able to learn something or connect to another part of the world.\n\nRuben Chamorro\n\nWill you meet the kids at the Games?\n\nM: Yes! It’s one of the things we’re most looking forward to [in PyeongChang], because the communication has only been through Skype so far. Their energy is really incredible.\n\nI assume that medaling is a primary goal, but you’ve spoken about the lack of diversity, specifically in team ice dancing. What else are you hoping to accomplish in that realm?\n\nA: It’s not something we talk about very often, because there is a strong presence in Asia in singles-skating. But there isn’t a history of Asian success in ice dance. There aren’t very many Asian ice dance teams currently either. Part of that is the way the sport originated — we looked to Kristi Yamaguchi and Michelle Kwan as figure skating role models. We didn’t really have that.\n\nNow, this is the first time the Winter Olympics are going to be back in Asia since 1998 in Nagano. It's a really huge opportunity for us to get exposure for our sport and inspire people around the world, Asian or not. And it’s not even if you’re interested in skating — diversity, representation, and equality are [in the news currently] and I’m very glad they're being discussed, because [they are] issues that still need to be tackled.\n\nBut for us, I don’t feel like we feel extra pressure — the goal is to have our best performances, and medal! And we know that if we continue to be ourselves, we will be representing ourselves and our country and anyone who looks to up to us. It will be an amazing and incredible honor to be at the Games and to inspire anyone.\n\nMeet all 14 Members of Team USA's Figure Skating Squad\n\n19 Fascinating Things You Didn't Know About Figure Skating Costumes\n\n11 Things to Know About Madison Chock and Evan Bates, Team USA's Ice Dancing Love Birds\n\n12 Things to Know About Madison Hubbell and Zach Donahue, Team USA's Ice Dancing Exes\n\nFollow Tess on Twitter.\n\nSenior Video Producer: Jason Ikeler\n\nVideographer: Josh Archer\n\nVideo Edited by: Gigi Pena\n\nTo learn more, visit teamusa.org. The Winter Olympics will air live, starting Feb 8th.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mai-alex-shibutani-1515004416.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Tess Koman", "Senior Editor", "Tess Koman Covers Breaking", "Food", "News", "Opinion Pieces", "Features On Larger Happenings In The Food World."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a15336680/maia-alex-shibutani-olympic-ice-dancing-siblings-interview/", "title": "Olympic Ice Dancers Maia & Alex Shibutani on What It's Really, Truly Like to Compete With Your Sibling", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Olympic Ice Dancers Maia & Alex Shibutani on What It's Really, Truly Like to Compete With Your Sibling", "description": "\"We are different people! We are!\"", "url": "https://www.cosmopolitan.com/entertainment/celebs/a15336680/maia-alex-shibutani-olympic-ice-dancing-siblings-interview/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-03-16 05:16:36", "published_time": "2018-01-30 08:46:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Maia and Alex Shibutani Talk 2018 Olympic Games - Ice Dancer Siblings Interview", "description": "An interview with Team USA's ice dancing superstars Maia and Alex Shibutani ahead of the Olympics 2018.", "keywords": "maia and alex shibutani, maia and alex shibutani figure skating, maia and alex shibutani olympics, maia and alex shibutani team usa, olympics 2018, winter olympics, Pyeongchang olympics, maia and alex shibutani ice dancing, figure skating, olympics 2018, winter olympics, team usa, Pyeongchang olympics", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "long-form-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs", "sailthru.date": "2018-01-30T20:46:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/winter-olympics-lead-1516213365.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Olympic Ice Dancers Maia & Alex Shibutani on What It's Really, Truly Like to Compete With Your Sibling", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1517273160.0, "source": "https://www.cosmopolitan.com", "summary": ""}