{"url": "https://en.wikipedia.org/wiki/Matthew_Morrison", "text": "American actor, dancer, and singer-songwriter\n\nNot to be confused with Matthew Morison\n\nMatthew James Morrison (born October 30, 1978)[1] is an American actor, dancer, and singer-songwriter. Morrison is known for starring in multiple Broadway and Off-Broadway productions, including his portrayal of Link Larkin in Hairspray on Broadway, and for his role as Will Schuester on the Fox television show Glee (2009–2015). Morrison is signed with Adam Levine's 222 Records and received a Tony Award nomination for his featured role as Fabrizio Nacarelli in the musical The Light in the Piazza. From March 2015 to January 2016, Morrison starred in the lead role of J.M. Barrie in the Broadway production of Finding Neverland.\n\nEarly life [ edit ]\n\nMorrison was born in Fort Ord, California, the son of Mary Louise (Fraser) and Thomas Morrison.[2] Morrison was raised in Chico, California, and has Scottish and English ancestry.[3][4] He was part of the Collaborative Arts Project 21 (CAP21) and the Orange County High School of the Arts, while at the Los Alamitos High School campus. While in high school, Morrison did a musical with actress Jodie Sweetin. He attended New York University's Tisch School of the Arts for two years before dropping out and joining the Broadway adaptation of Footloose.[5]\n\nBy freshman year of college, Morrison already was a regular performer on Broadway.[citation needed]\n\nCareer [ edit ]\n\nMorrison's career began when he made his musical theatre debut on Broadway in the musical version of Footloose, followed by a revival of The Rocky Horror Show in 2002. Morrison's big break came, however, when Morrison landed the role of Link Larkin in the Broadway production of John Waters', Hairspray. After performing in the role for some time, Morrison started working in television, guest-starring on shows such as Ghost Whisperer, Numbers, CSI: Miami and Hack. Morrison also had small roles in films such as Marci X, Primary Colors, Music and Lyrics, and Simply Funk. Morrison followed up these performances by performing the role of Sir Harry in the ABC-TV production of Once Upon a Mattress, starring Tracey Ullman, Zooey Deschanel and Carol Burnett.\n\nIn 2001, Morrison was recruited to complete the quartet for the band LMNT. Morrison was replaced instead by Jonas Persch by the time its first album was released. Morrison commented in an interview about his experience in the boy band by remarking, \"It was the worst year of my life. You know when you're a performer and you're out there on stage and you're embarrassed that you're doing something wrong. It was pretty bad.\" Matthew Morrison also was a member of Buena Park Youth theater, located at Buena Park[6]\n\nMorrison starred in the original cast of the musical Hairspray as Link Larkin from its opening in 2002 through January 2004.[7] In 2005 Morrison changed gears, playing the role of Fabrizio Nacarelli in Adam Guettel's The Light in the Piazza.[7] Morrison was nominated for a Tony Award for his performance.[8] He left the show on August 28, 2005.[8]\n\nMorrison joined the cast of the CBS soap opera, As the World Turns, as Adam Munson on October 24, 2006,[9] but left abruptly soon after due to a \"scheduling conflict,\" last airing on the soap on November 27. Morrison appeared in a benefit performance celebrating Andrew Lippa, and the 25th Anniversary of the performing troupe 'The Kids in the Hall' at the Orange County Performing Arts Center in Costa Mesa, California in December 2006. The performance benefited The California Conservatory of the Arts, a non-profit arts education organization focusing on pre-professional training for young students, grades six through twelve, in Orange County, California.\n\nHe earned a Drama Desk Nomination for his role in the Off Broadway show 10 Million Miles which ran at the Atlantic Theater Company in 2007. That same year he appeared in two films: Dan in Real Life, followed by Music and Lyrics as Cora Corman's manager. In 2008, he played Lieutenant Cable in a Lincoln Center production of the musical South Pacific. He left the production at the end of 2008 and in early 2009 returned to California to shoot the first season of Glee.[10]\n\nMorrison played Will Schuester in the Fox Broadcasting television series Glee, which had its television preview on May 19, 2009. Schuester is a high school Spanish (later History) teacher who takes on the task of restoring the school's glee club to its former glory. He made his directorial debut with the third season's ninth episode.\n\nIn addition on January 14, 2010, it was announced that Morrison signed a solo record deal with Mercury Records. His first studio album was released on May 10, 2011. Morrison duets with Elton John on \"a medley of 'Mona Lisas and Madhatters' going into 'Rocket Man'\".[11] His first single, \"Summer Rain\", premiered on Ryan Seacrest's website on February 28, 2011.[12] Additionally, a duet of \"Over the Rainbow\" with Gwyneth Paltrow appears on the self-titled album.[13] On June 16, 2010, Morrison joined Leona Lewis—appearing at London's O2 Arena as part of her world tour—for a one-off performance to sing \"Over the Rainbow\". Morrison was on the cover of the June 2011 issue of MetroSource.\n\nIn March 2012, Morrison was featured in a performance of Dustin Lance Black's play, 8—a staged reenactment of the federal trial that overturned California's Prop 8 ban on same-sex marriage—as Paul Katami.[14] The production was held at the Wilshire Ebell Theatre and broadcast on YouTube to raise money for the American Foundation for Equal Rights.[15][16]\n\nA Morrison concert at Connecticut's Bushnell Center was recorded by PBS and scheduled to air in the second quarter of 2013.[17] On April 28, 2013, Morrison made his first major appearance[citation needed] in the United Kingdom as a guest performer at the 2013 Laurence Olivier Awards at the Royal Opera House in London. On June 4, 2013, 222 Records released Morrison's second studio album, Where It All Began.[18] July 7, 2016, Matthew appeared alongside Megan Hilty in a summer evening of Broadway and other songs with The New York Pops at the Forest Hills Stadium in Forest Hills, Queens.[19]\n\nMorrison returned to Broadway as J.M. Barrie in the new musical, Finding Neverland, which opened in April 2015.[20]\n\nSince 2019, Morrison has been a \"dance captain\" on BBC One's The Greatest Dancer alongside Cheryl, Oti Mabuse and in the second season, Todrick Hall too.[21] In the second half of 2019, he portrayed Trevor in the ninth season of the FX horror anthology television series American Horror Story.[citation needed]\n\nDiscography [ edit ]\n\nStudio albums [ edit ]\n\nEPs [ edit ]\n\nTitle Details Peak chart\n\npositions US\n\nAUS\n\nUK\n\nA Classic Christmas Release date: November 19, 2013\n\nLabel: 222 Records\n\nFormats: music download — — — \"—\" denotes releases that did not chart\n\nSingles [ edit ]\n\nNotes [ edit ]\n\n^ Billboard Hot 100, but peaked at number twenty-four on the Bubbling Under Hot 100 Singles chart.[28] \"Still Got Tonight\" did not enter theHot 100, but peaked at number twenty-four on the Bubbling Under Hot 100 Singles chart.\n\nTheatre [ edit ]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nPersonal life [ edit ]\n\nMorrison became engaged to actress Chrishell Stause on December 9, 2006.[29] Their relationship later ended.\n\nIn 2011, Morrison began dating Renee Puente.[30] On June 27, 2013, Elton John helped Morrison announce that Morrison and Puente were engaged.[31] Morrison and Puente were married on October 18, 2014, at a private home on the island of Maui.[32] On May 16, 2017, it was revealed on his personal Instagram account that he and Puente were expecting their first child.[33] Their son was born in 2017.[34]\n\nAwards and nominations [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Matthew_Morrison_Peabody_2010_%28cropped%29.jpg/1200px-Matthew_Morrison_Peabody_2010_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Jane_Lynch_%26_Matthew_Morrison.jpg/220px-Jane_Lynch_%26_Matthew_Morrison.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Morrison%2C_New_York_CD_Release.JPG/175px-Morrison%2C_New_York_CD_Release.JPG", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Matthew_Morrison_Peabody_2010_%28cropped%29.jpg/220px-Matthew_Morrison_Peabody_2010_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Glee_Matthew-Morrison-with_The_Nortes_of_Hollywood.jpg/220px-Glee_Matthew-Morrison-with_The_Nortes_of_Hollywood.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Matthew_Morrison_Peabody_2010_%28cropped%29.jpg/1200px-Matthew_Morrison_Peabody_2010_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Matthew_Morrison", "title": "Matthew Morrison", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Matthew_Morrison_Peabody_2010_%28cropped%29.jpg/1200px-Matthew_Morrison_Peabody_2010_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}