{"url": "heavy.com/entertainment/2017/09/demi-lovato-sexuality-lesbian-dating-girlfriend-rumors-lyrics-photos/", "text": "Demi Lovato has sparked rumors of a new romance with Lauren Abedini, a Los Angeles-based DJ who goes by the stage name Kittens. According to Page Six, Lovato was spotted holding hands with Abedini in Disneyland over the weekend, causing fans and media outlets to speculate whether they could be dating.\n\nThis is only the latest speculation surrounding Lovato’s love life, as the pop singer has never officially confirmed her sexuality– despite alluding to her being bisexual in her song lyrics.\n\nHere’s what you need to know about Demi Lovato’s sexuality:\n\n1. Fans Have Supported the Rumors Involving Lauren Abedini\n\ngood morning to demi lovato and her possible girlfriend and no one else pic.twitter.com/ZrDKzhVBBD — kenny (@broadwaysdarlin) September 11, 2017\n\nWhile there’s yet to be any confirmation from Lovato or Abedini’s representatives as to whether they’re dating, fans on social media have been eager to voice their support.\n\n“Demi Lovato spotted with her rumored new girlfriend Lauren Abedini; a DJ, Producer, charity runner, and feminist!” wrote the Lovato fan account Demipedia. Another humorously tweeted”The good news is that Demi Lovato has a girlfriend. The bad news is that it isn’t me.”\n\nDemi Lovato spotted with her rumored new girlfriend Lauren Abedini; a DJ, Producer, charity runner, and feminist! pic.twitter.com/0DEPobohgt — demipedia (@ddlovatopedia) September 11, 2017\n\nOthers snapped photos of Lovato and Abedini during their Disneyland trip, with one user posting a comparison of the singer with her ex Wilmer Valderrama and Abedini and joking that she’s made “a big upgrade.”\n\nCheck out this post and the rest of Twitter’s reactions below.\n\nmiss demi lovato had the biggest upgrade i've ever seen pic.twitter.com/brbZs8igJW — lindsey (@cryingwithmila) September 11, 2017\n\nThe thought of Demi Lovato having a girlfriend is possible the greatest thing to enter my head — keels (@keeley_cjd) September 11, 2017\n\nThe good news is that Demi Lovato has a girlfriend. The bad news is that it isn't me. — ste(screeching into the wilderness)ph (@stphfrndz) September 11, 2017\n\n2. She’s Had Relationships With Several Male Celebrities\n\nLovato, like most notable celebrities, have dated other people in the industry. According to Pop Sugar, she dated The Cab frontman Alex DeLeon from 2008-09, and later based the breakup song “Catch Me” on him. Lovato also had brief flings with Trace Cyrus (Miley’s older brother) in 2009 and Joe Jonas, her self-proclaimed “BFF,” in 2010.\n\nHer most notable relationship to date, however, has been with Valderrama, whom she dated from from 2010 to 2016. In an interview with Latina magazine, Lovato discussed what attracted her to the That 70’s Show actor:\n\nWhen I dated white guys, it wasn’t as passionate as my relationship with Wilmer. Maybe that’s just Wilmer. But I do believe that Latin people are just more expressive, more passionate with their emotions. He’s very manly, and he can be stubborn like Latino men can, but he’s protective and he cares so much and loves so hard. I’ve been blessed enough to have him in my life, and not just as my man, but also my best friend.\n\nSince her breakup from Valderrama, Lovato’s been seen with MMA fighter Guilherme “Bomba” Vasconcelos and Abedini.\n\n3. Ruby Rose Claims that She & Lovato ‘Hooked Up’ in 2013\n\nDemi Lovato Lesbian Hookup with Australian DJ?Australian DJ Ruby Rose claims to have had a fling with Demi Lovato! http://bit.ly/SubClevverNews – Subscribe Now! Is Demi Lovato's new Glee role imitating real life- OMG?! This is ClevverNews. X Factor judge Demi Lovato has been caught in the line of fire from an Australian DJ named Ruby Rose who says she slept with Demi. And the timing of this new report is quite ironic. Just Thursday Demi made her debut on Fox's show Glee as a lesbian named Dani and even shared a smooch with Santana, played by Naya Rivera. So who is Ruby Rose? A cute blonde 27-year-old DJ. The rumors started flying when Ruby tweeted October 6th that she was taking a break from social media after being attacked by Demi's friends. Ruby tweeted, \"Think ill take a few days off social media whilst @ddlovato's friends attack me for being a 'scorned ex-lover' get over it!! I liked the hair\". What does that even mean, she only likes girls for their hair? And that's impressive if she's an ex-lover and we are just now finding out about it. And Ruby wasn't done there she then posted on Instagram, \"the only person demi has slept with that didn't sell on naked photos of her\". So where are these other naked photos? Did we miss something? Of course there has been no response from Demi just yet, but her fans are apparently unhappy by these rumors. Next, Ruby posted on Twitter, \"What just happened to me on [Instagram] wasn't very nice and I retaliated because I stood up for myself. It's all sorted now Back to business…\" According to RadarOnline their friendship goes back to 2011 when Ruby tweeted, \"On a plus side I met Demi Lovato today at lunch and she is just magnificent.\" Lovatics, what do you make of all this? Do you think Ruby was looking for some attention or are her claims true? I'm Misty Kingma thanks for hanging out with me here on ClevverNews. http://Twitter.com/ClevverNews – Follow Us! http://Twitter.com/ – Send a Tweet! http://Facebook.com/ClevverNews – Like Us! http://Clevver.com – Visit our site! 2013-10-09T02:20:28.000Z\n\nIn 2013, model and actress Ruby Rose turned heads when she tweeted that she had a lesbian tryst with Lovato. “I’m like the one person demi has slept with that didn’t sell on naked photos of her so eff off,” Rose tweeted out. She went on to say “Think ill take a few days off social media whilst @ddlovato’s friends attack me for being a ‘scorned ex-lover’ get over it! I liked the hair.”\n\nFurthermore, a source for Life & Style said that Rose and Lovato dated for two years while the singer took a break from her relationship with Valderrama.\n\nLovato addressed these claims in a 2015 interview with Complex magazine. “Rumours are rumours, and people are going to spread them,” she said. “You can believe what you want, but no, I was not in a relationship with her. By the way, love is fluid.”\n\nThe singer added “Whether there’s been rumours with one specific person or not, that’s all that matters. Humans are humans, and when you connect with somebody on a spiritual level it doesn’t matter. I don’t want people to ever look at the past or rumours or anything and try to figure me out.”\n\n4. She Won the GLAAD Vanguard Award for Promoting LGBTQ Equality\n\nDemi Lovato Gives Shout-Outs to Nick Jonas & Wilmer Valderrama | GLAAD Media Awards 2016Demi Lovato goes a bit off script to hilariously admit that she has a bigger dick than Nick Jonas and then sweetly gives a shout-out to her love, Wilmer Valderrama, while she accepts the GLAAD Vanguard award. Don't miss the 27th Annual GLAAD Media Awards on Monday, April 4th at 10/9c on Logo! SUBSCRIBE: http://logo.to/ZirLXq LogoTV's Official Site: http://logo.to/ZiqDCY Download the LogoTV App: http://logo.to/1eKBVCy Logo TV celebrates one-of-a-kind personalities, unconventional stories and discovering what's next. From hit series like RuPaul's Drag Race, to legendary movies and sitcoms The Golden Girls, AbFab, Will&Grace and Roseanne, Logo TV provides an entertainment experience outside the boundaries of what's expected. Entertaining a savvy audience of gay trendsetters and straight friends who are ahead of the curve, Logo TV is BEYOND! Connect with Logo TV: Like Logo TV: http://logo.to/11flg1H Follow Logo TV: http://logo.to/ZiqUGe Gif Logo TV: http://logo.to/Zir0xk Pin Logo TV: http://logo.to/Ziraov Vine Logo TV: http://logo.to/1oO0zbW Google+ Logo TV: http://logo.to/1hgMLad Instagram LogoTV: http://logo.to/13cDCTS Logo TV on TVTag: http://logo.to/Zir5Bg Check-in with Logo TV: http://logo.to/Zirdk5 – LogoTV http://www.youtube.com/logotv 2016-04-03T15:36:10.000Z\n\nWhile Lovato may be keeping her personal life under wraps, she has made no effort to hide her support for the LGBTQ community. The singer has been so supportive, in fact, that she was given the GLAAD Vanguard Award in 2016, which, according to the GLAAD website, is “presented to media professionals who have made a significant difference in promoting equality and acceptance.”\n\nThe award was given to her by close friend and former Camp Rock co-star Nick Jonas. “Demi Lovato has consistently used her platform as a successful artist to send messages of acceptance and support to LGBT people everywhere,” said GLAAD President & CEO Sarah Kate Ellis. “She is an extraordinary ally who is committed to helping young people embrace who they are and live the lives they love.”\n\nDuring her acceptance speech, Lovato said “You should always love yourself for who you are,” she said. “The skin that you are in, whether you identify with it and are afraid to tell people, just go for it. You can do it!” Watch the full speech above.\n\n5. She Said She’s Not ‘Denying’ or ‘Confirming’ Her Sexuality\n\nDemi Lovato Talks About Sexual Fluidity | Full Interview | Alan Carr: Chatty ManDemi Lovato pops into the studio to try her hand at dubsmash against stars such as Tom Hardy, she also chats about her newest musical ventures and sexual fluidity! Subscribe for more videos and classic moments from Chatty Man – https://www.youtube.com/user/OfficialChattyMan Watch Alan Carr: Chatty Man on Channel 4, Thursdays at 10pm, or CATCH UP on All 4: http://www.channel4.com/programmes/alan-carr-chatty-man/on-demand #DemiLavato #AlanCarr 2017-07-19T16:30:01.000Z\n\nLovato’s 2015 single “Cool for the Summer” had many fans wondering whether or not this was her coy way of speaking on her sexuality.\n\nThe lyrics “Tell me what you want, what you like, it’s ok / I’m a little curious, too” and “Got a taste for the cherry / I just need to take a bite” were taken as an admission that she had at least experimented with women in the past.\n\nDemi Lovato – Cool for the Summer (Official Video)Demi’s album CONFIDENT available now! http://smarturl.it/dls2 Amazon http://smarturl.it/dlams2 Google Play http://smarturl.it/dlgps2 Stream http://smarturl.it/dlsts2?IQid=V Facebook http://facebook.com/demilovato Twitter http://twitter.com/ddlovato Instagram http://instagram.com/ddlovato Tumblr http://demilovato.tumblr.com Official site http://demilovato.com http://vevo.ly/b4JQfI Vevo x Demi Lovato https://goo.gl/QfR9Wa Demi Lovato – Audio Snippet Videos https://goo.gl/ZosRJp Subscribe for more https://goo.gl/qRsogB Best of Demi Lovato: https://goo.gl/SmqS1T Subscribe here: https://goo.gl/qRsogB 2015-07-23T15:00:03.000Z\n\nIn an interview with British late-night host Alan Carr, Lovato continued to play coy about her lyrics. “I’m not confirming and I’m definitely not denying,” she quipped with a smile.\n\n“All of my songs are based off of personal experiences. I don’t think there’s anything wrong with experimentation at all.” Carr joked that he “experimented once and it stuck,” leading Lovato to retort:”Hey, I didn’t say it didn’t stick either.”", "images": ["https://heavyeditorial.files.wordpress.com/2017/09/taylor-swift-joe-alwyn.jpg?quality=65&strip=all&w=150&h=100&crop=1", "https://2.gravatar.com/avatar/bf922f581d064252c8ce95fd95bd5c4c?s=71&d=https%3A%2F%2F2.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D71&r=PG", "https://sb.scorecardresearch.com/p?c1=2&c2=20567959cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://heavyeditorial.files.wordpress.com/2017/09/gettyimages-510457560.jpg?quality=65&strip=all&w=766&h=531", "https://heavyeditorial.files.wordpress.com/2017/09/gettyimages-843897514.jpg?quality=65&strip=all&w=780", "https://certify.alexametrics.com/atrk.gif?account=lfktn1QolK10vg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://heavyeditorial.files.wordpress.com/2017/09/gettyimages-843897514.jpg?quality=65&strip=all&w=780", "keywords": [], "authors": ["Danilo Castro"], "canonical_link": "https://heavy.com/entertainment/2017/09/demi-lovato-sexuality-lesbian-dating-girlfriend-rumors-lyrics-photos/", "title": "Demi Lovato’s Sexuality: 5 Fast Facts You Need to Know", "meta_data": {"google-site-verification": "nfPVut3DNEWv3BaV0stQ8yOV3TeBg_TWFdQzQYaG8Qs", "robots": "noodp, noydir", "HandheldFriendly": "True", "MobileOptimized": 360, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "msapplication-TileColor": "#121212", "theme-color": "#121212", "description": "Demi Lovato is rumored to be dating Los Angeles DJ Lauren Abedini. Learn more about Lovato's relationship history and her sexuality here.", "news_keywords": "Demi Lovato, Demi Lovato dating, Demi Lovato girlfriend, Demi Lovato sexuality", "keywords": "demi lovato, demi lovato dating, demi lovato girlfriend, demi lovato sexuality", "msvalidate.01": "D36F6DC077CF4906C4E074037A94917B", "generator": "WordPress.com", "author": "Danilo Castro", "twitter": {"url": "https://heavy.com/entertainment/2017/09/demi-lovato-sexuality-lesbian-dating-girlfriend-rumors-lyrics-photos", "card": "summary", "site": "@heavysan", "creator": "@heavysan"}, "fb": {"admins": 1041016861, "app_id": 1103740676351644}, "article": {"publisher": "https://www.facebook.com/heavycom", "published_time": "2017-09-11T22:39:52+00:00", "modified_time": "2017-09-11T22:48:26+00:00", "author": "https://heavy.com/author/danilocastro213/", "section": "Entertainment", "tag": "Wilmer Valderrama"}, "og": {"image": {"identifier": "https://heavyeditorial.files.wordpress.com/2017/09/gettyimages-843897514.jpg?quality=65&strip=all", "width": 780, "height": 440}, "site_name": "Heavy.com", "type": "article", "locale": "en_US", "url": "https://heavy.com/entertainment/2017/09/demi-lovato-sexuality-lesbian-dating-girlfriend-rumors-lyrics-photos/", "title": "Demi Lovato’s Sexuality: 5 Fast Facts You Need to Know", "description": "Demi Lovato is rumored to be dating Los Angeles DJ Lauren Abedini. Learn more about Lovato's relationship history and her sexuality here."}, "application-name": "Heavy.com", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Breaking News, Sports, Entertainment, TV, Tech, Gaming & Health.", "msapplication-task": "name=Subscribe;action-uri=https://heavy.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/6e68a7d5b8fce58735ab84f887ee5981?s=16", "ir-site-verification-token": 268982007}, "movies": [], "publish_date": 1505169592.0, "source": "http://heavy.com", "summary": ""}