{"url": "https://www.theringer.com/2017/6/9/16038326/sopranos-finale-influence-10-years-later-d0571c03f088", "text": "It’s easy to forget, but plenty happens in the final episode of The Sopranos: Someone gets shot in the head in broad daylight. An aimless and depressed A.J. decides to join the Army — in the middle of the war in Afghanistan, no less — only for Tony and Carmela to bribe him with a “development executive” role on a Tony-financed movie. And in a scene that delivers the pathos we’d expect from a beloved and long-lived series saying its goodbyes, Tony comes to terms with the extent of Uncle Junior’s dementia.\n\nYet almost none of these moments made a lasting impression, because none of them drove the show’s audience into as much of a collective frenzy as what came next: nothing. More specifically, 10 seconds of pitch-black silence that blindsided us to the point of wondering if our TVs were malfunctioning. Within hours, theories proliferated (what was with the bathroom guy?), blog posts raged (what a cop-out!), and all the while, the creative team kept their mouths firmly sealed — an omertá creator David Chase still hasn’t broken. Ten years later this Saturday, we’re still feeling the aftershocks. Just as The Sopranos revolutionized our idea of what a great TV series can be, “Made in America” revolutionized our idea of how a great TV series can end.\n\nThe television finale has always been a tricky gambit; a series’ end is a chance to deliver on the one thing TV is expressly designed not to provide: conclusiveness. Television’s goal is to keep going, and its writers will renege on any number of plot developments to meet that goal. Characters can come back from the dead, or reappear in flashbacks, or return for a check-in after being written off; one season’s long-teased romantic payoff can be the next’s beleaguered relationship. Series finales, meanwhile, fight against TV’s every impulse; they are the end of the road, so to speak.\n\nPrior to The Sopranos, finales could shock and surprise, but they always did so in fairly specific, limited ways. There was the infamous “it was all a dream!” maneuver, the instant cliché codified by the one-two punch of the ninth season of Dallas in 1986 and St. Elsewhere two years later; this option was jaw-dropping in the moment, but at the expense of cheapening everything the audience had spent months or years investing in. There was the meta grace note: The Cosby Show breaking the fourth wall by panning out to the studio audience, and Newhart retroactively framing itself not just as a dream, but the dream of its star’s last lead sitcom role. And there was Seinfeld’s misanthropic middle finger: sending the central quartet to prison. Sometimes, a show just ran out of source material, as in M*A*S*H’s self-explanatory “Goodbye, Farewell, and Amen” — the war ends, so the characters say … goodbye, farewell, and amen. At more than 100 million viewers, M*A*S*H remains the most-viewed series finale in history, and one of the more textbook examples of how to revisit a series’ highlights while closing up shop.\n\nAll those finales conditioned viewers to have certain requirements (self-congratulation, bow-tying for each major character and plot) for a satisfying farewell. “Made in America” proceeded to disregard all of them — or more accurately, to come close enough to tease the possibility of a more traditional close before yanking it away with a single cut to black. Upon rewatch, the ramp-up to the abrupt silence is as unbearably tense as it was in 2007. If Tony wasn’t headed toward something explosive, why the cutaways to all the other diner customers, as if to implicate them? Why does the camera linger on Meadow’s amateur parallel parking job? Why drop a music cue as pointedly ironic as Journey’s “Don’t Stop Believin’,” epic and inspiring in contrast to a scene that was presumably meant to be the opposite? Sure, the episode ends with an anticlimax — but that anticlimax manages to land with heart-stopping force.\n\nBut tension alone doesn’t explain why “Is Tony dead or isn’t he?” so dominated, and continues to dominate, the discussion surrounding The Sopranos’ ending. A scumbag who’s killed or alienated everyone of real importance to him outside of his nuclear family, Tony Soprano spent six seasons evading the fate most mass-market fiction delivers the wicked. In one last casual shrugging off of TV’s once-bedrock rules, “Made in America” confirmed we’d never see Tony truly suffer for his sins — at least onscreen. It made sense in context: Why wouldn’t the show that confronted us with a protagonist murdering a man with his bare hands in its fifth-ever episode continue to push the limits of what we find acceptable, even appealing, in its final moments? But to float the idea of karma at long last coming for the crime boss of Northern Jersey and then give him a free pass seemed unthinkable, and so a sizable plurality of viewers has refused to acknowledge it. Tony had to be dead, and the only question was how; hence the 16 million-plus Google results for “man in Members Only jacket,” and the theorizing over jacket man’s motivation (as if Tony Soprano’s killer would need any), or the endless accusations that the cut to black was somehow a dodge. All Chase gave the masses to go on was that everything we needed to know was “all there” in the episode itself.\n\nChase’s commitment to keeping his open ending open — foreshadowed, in retrospect, by the still-missing Russian from “Pine Barrens” — led to a brand-new kind of finale: one with no ending at all. Instead of wrapping the series up in a neat and orderly fashion, The Sopranos flabbergasted viewers by declining to even try. This was the series’ latest — and perhaps greatest — innovation. Tony was a mobster unlike any we’d seen before, forcing fans to confront what it meant to romanticize a criminal, but he was still a mobster, and one explicitly positioned in the lineage of pop culture mobsters past. (Sil’s Godfather impression!) “Made in America” had no precedent to tweak. Relinquishing a now-or-never shot at resolution for sustained ambiguity remains The Sopranos’ most radical move among many.\n\nConsequently, the “Made in America”–inspired finale has become as much a signifier of a prestige series as the antihero, the dream sequence, and other Sopranos staples — both in terms of the actual way series end, and also the way audiences anticipate and dissect those endings. Mad Men, The Sopranos’ literal successor (the show premiered just a month after The Sopranos wrapped) as well as its spiritual one (The Sopranos was writer-producer Matthew Weiner’s bridge from CBS sitcoms to cable dramas) continued what “Made in America” started. That series ends with a shot that’s less jarring but equally ambiguous — a cut from Don Draper’s enigmatic smile at a seaside meditation retreat far from Madison Avenue to the classic Coca-Cola ad he may or may not have subsequently created. The happy ending instantly curdled into an ambivalent one, a rapid pivot audiences felt more prepared to accept and comprehend thanks to its predecessor. In a pre–“Made in America” world, I doubt we would have been so quick to pick up on the Coke ad as evidence Don had turned his enlightenment into yet another consumer product. But in a world where The Sopranos’ vacuum was intentional, Mad Men’s commercial could be part of a show. And just this month, The Leftovers inspired a fresh round of argument over the deliberately unanswered question of whether heroine Nora Durst had actually solved the mystery of the Sudden Departure or just made up a convenient fiction.\n\nBeyond its influence on subsequent finales, though, “Made in America” changed how we think about finales. Never again will we bring the same expectations into a final chapter that Sopranos viewers did when they turned on their sets 10 years ago. Choosing surprise over closure is now considered a feature, not a bug; it’s now widely accepted that a lack of resolution isn’t mutually exclusive with a lack of satisfaction. And finales are now held up as much against The Sopranos’ ability to keep us on our toes as M*A*S*H’s ability to tie up loose ends.\n\nWhile “Made in America” has its imitators, none have matched its force or impact by so totally rearranging our understanding of what TV is obligated to give us. The Sopranos will always have the competitive advantage of working without precedent where its successors now operate in a TV landscape in which violence, sex, and, yes, mystery are now normalized. More than that, The Sopranos came up with an ending just as murky and disorienting as the 85 hours that led up to it. Rather than betray its ethos by bowing to convention, The Sopranos went out on its own terms.\n\nDisclosure: HBO is an initial investor in The Ringer.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/42P23udpKCc_d4kB0JAkxUGyLy8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901189/1_FKx9AlhGjA_OAyd26-KxNg.0.gif", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs"], "top_img": "https://cdn.vox-cdn.com/thumbor/42P23udpKCc_d4kB0JAkxUGyLy8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901189/1_FKx9AlhGjA_OAyd26-KxNg.0.gif", "keywords": [], "authors": ["Alison Herman", "Liz Kelly", "Kate Halliwell", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "Jun"], "canonical_link": "https://www.theringer.com/2017/6/9/16038326/sopranos-finale-influence-10-years-later-d0571c03f088", "title": "Ten Years Later, the ‘Sopranos’ Finale Is Still Revolutionary", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2017-06-09T08:30:15-04:00", "modified_time": "2017-06-09T08:30:15-04:00"}, "author": "Alison Herman", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "The Journey song. The Members Only Jacket. The diner. A decade on, \"Made in America\" remains the most influential series-ender in TV history.", "og": {"description": "The Journey song. The Members Only Jacket. The diner. A decade on, \"Made in America\" remains the most influential series-ender in TV history.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/42P23udpKCc_d4kB0JAkxUGyLy8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901189/1_FKx9AlhGjA_OAyd26-KxNg.0.gif", "alt": "(HBO)", "height": 900, "width": 1600}, "site_name": "The Ringer", "title": "Ten Years Later, the ‘Sopranos’ Finale Is Still Revolutionary", "type": "article", "url": "https://www.theringer.com/2017/6/9/16038326/sopranos-finale-influence-10-years-later-d0571c03f088"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/2017/6/9/16038326/sopranos-finale-influence-10-years-later-d0571c03f088", "title": "Ten Years Later, the ‘Sopranos’ Finale Is Still Revolutionary", "description": "The Journey song. The Members Only Jacket. The diner. A decade on, \"Made in America\" remains the most influential series-ender in TV history.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/42P23udpKCc_d4kB0JAkxUGyLy8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901189/1_FKx9AlhGjA_OAyd26-KxNg.0.gif", "alt": "(HBO)"}, "site": "ringer"}, "sailthru.title": "Ten Years Later, the ‘Sopranos’ Finale Is Still Revolutionary", "sailthru.tags": "general,the-ringer,front-page,tv", "sailthru.description": "The Journey song. The Members Only Jacket. The diner. A decade on, \"Made in America\" remains the most influential series-ender in TV history.", "sailthru.date": "2017-06-09T08:30:15-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/42P23udpKCc_d4kB0JAkxUGyLy8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901189/1_FKx9AlhGjA_OAyd26-KxNg.0.gif", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/HfBg7ix-o9r52a0SE7ly6U2-QIE=/500x0:2500x2000/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/55901189/1_FKx9AlhGjA_OAyd26-KxNg.0.gif", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1496937600.0, "source": "https://www.theringer.com", "summary": ""}