{"url": "https://www.vanityfair.com/style/2017/10/jennifer-lopez-alex-rodriguez-cover-story", "text": "He says he decided to do like Rocky Balboa, to try to make the team “as a broken-down 40-year-old that didn’t have a lot of allies.” And he succeeded, finishing the season with 33 home runs. “I did that at 40 and 100 percent clean, and no one can take that away from me,” he says. “It told me everything about who I was.” When he retired, he agreed to stay on as an adviser to Yankee owner Hal Steinbrenner and as a mentor to younger players. “From where I came from, that honor is like hitting 800,” he says.\n\nThis, to Lopez, was a reveal. “The most impressive thing to me was how he did pick himself up and take that opportunity to make himself a better person,” she says. “The hardest times prove who you are. That’s what I love and admire the most about Alex. He doesn’t let anything beat him. He just comes back stronger.”\n\nEach believes that if they had been single when they met, 12 years ago, the relationship wouldn’t have worked. “We had to grow and discover ourselves first,” she says. But it also works for another reason. As Goldsmith-Thomas says, “They weren’t afraid to dream, and they are still dreaming, both of them.”\n\nThe next night, Lopez is performing her smash show All I Have in Las Vegas. Onstage, she moves seamlessly from the best kind of sexy—with a sense of humor—to a festive Latin-inspired segment, to an utterly moving testimonial to her children, in which she sings Lee Ann Womack’s “I Hope You Dance.” She’s an incandescent performer, partly because, as Remini says, “there is nothing Jennifer does that she does half-assed. When she is in a project, she is in it, devouring it.”\n\n“A-Rod’s in the house,” someone from the audience yells. She laughs. Yes, A-Rod is in the house. Although he’s seen the show many times, he’s still watching every detail. He nudges me, pointing out a middle-aged woman in a pink pantsuit dancing ecstatically to “Jenny from the Block.” Then he points out a gay couple in the front row practically swooning after one gets to touch Lopez’s feet. During a segment that’s all New York, with Lopez in a sequined baseball jersey, he nudges me again. “If you look closely, you’ll see what number she’s wearing on her jersey,” he says. It’s 13, his Yankee number.\n\nHe says, “We are very much twins.” She says, “I understand him in a way that I don’t think anyone else could.”\n\nEarlier that day, she and Rodriguez were in Los Angeles at the premiere event for this season’s Shark Tank, in which Rodriguez will be the first Latino shark. At a panel where the sharks discussed the show, the investor and Dallas Mavericks owner Mark Cuban says, “A lot of us were pleasantly surprised that when Alex came in, he knew his stuff cold.”\n\nDuring the red-carpet interviews, Lopez, who is impossibly glamorous in a floor-length tweed coat and aviator sunglasses, hangs at the back of the crowd. “Does it feel weird to be in the background?” I ask. “Noooo,” she says. “I like it. Because I’m out there enough. Some people, it wouldn’t work—they can’t stand not being the one in the spotlight. But not us.”\n\nBack in Business\n\nTheir story is also a merger of business empires. Lopez, who back in 2002—way before everyone else was becoming an entrepreneur—launched her fragrance Glow by J.Lo, now has a big portfolio of business interests, which range from her production company to sprawling property holdings. Rodriguez seems to slot right into her world.\n\nFrom a young age, he sought out mentors who could help him build a business that would one day replace his baseball income. During his suspension year, he took investing classes at Columbia and marketing classes at the University of Miami. Today, A-Rod Corp is an investment firm focused on a broad array of industries, including real estate, sports and wellness, media, and entertainment. “I don’t have your traditional formal education,” he says. “Mine comes through reading and passion and grit and collecting a lot of information from my mentors. I’ve never been afraid to say, ‘I don’t know. Can you explain that to me?’\n\nThat’s echoed by hedge-fund billionaire Marc Lasry, who has invested with Rodriguez for the last decade. “What’s interesting about Alex is that he’s a sponge,” Lasry says. “He really wants to learn.” Another mentor of sorts is Mary Callahan Erdoes, the C.E.O. of J.P. Morgan Asset & Wealth Management, who met Rodriguez around the time that Lasry did. “You might be expecting something different,” she says. “But from the first day, he had his notebook out. He’s incredibly curious and serious. There’s no nonsense and no pomp and circumstance.” That’s true to this day, Erdoes says, whether he’s attending a JPMorgan-hosted conference on Brexit or a meeting with a hedge-fund manager. “He sits in the front of the room with his notebook out and his hand up, asking questions,” she says.", "images": ["https://media.vanityfair.com/photos/59f3639540dfcc68ac21c0d4/master/w_2560%2Cc_limit/jlo-arod-cover-1217-ss01.jpg", "https://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/59f3639540dfcc68ac21c0d3/master/w_1600%2Cc_limit/jlo-arod-cover-1217-ss02.jpg", "https://media.vanityfair.com/photos/59f73e5225b7a40d71fd1688/master/w_1600%2Cc_limit/jlo-arod-cover-1217.jpg", "https://media.vanityfair.com/photos/59f3639616ff751cf425ef2c/master/w_1600%2Cc_limit/jlo-arod-cover-1217-ss05.jpg", "https://media.vanityfair.com/photos/59f363955ba52f25246815cd/master/w_1600%2Cc_limit/jlo-arod-cover-1217-ss03.jpg", "https://media.vanityfair.com/photos/59f3639525b7a40d71fd1638/master/w_1600%2Cc_limit/jlo-arod-cover-1217-ss04.jpg", "https://media.vanityfair.com/photos/59f36396ddf784604d17e8eb/master/w_1600%2Cc_limit/jlo-arod-cover-1217-ss06.jpg", "https://media.vanityfair.com/photos/59f73e545ba52f252468160b/16:9/w_1280,c_limit/t-jlo-arod-cover-1217.jpg", "https://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg"], "top_img": "https://media.vanityfair.com/photos/59f73e545ba52f252468160b/16:9/w_1280,c_limit/t-jlo-arod-cover-1217.jpg", "keywords": [], "authors": ["Bethany Mclean", "Bethany Mclea", "Mario Testin", "Jessica Dieh"], "canonical_link": "https://www.vanityfair.com/style/2017/10/jennifer-lopez-alex-rodriguez-cover-story", "title": "J-Rod! Jennifer Lopez and Alex Rodriguez on Love, Beauty, and Redemption", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Bethany McLean", "copyright": "Copyright (c) Condé Nast 2020", "description": "Despite the surreal fame—and baggage—carried by Jennifer Lopez and Alex Rodriguez, their relationship makes perfect sense. Both started from modest backgrounds, hit the big time fast, and had to battle their own demons to survive. The new couple discuss everything from their nerve-racking first date to the “reveals” that forged their bond.", "id": "59e8e27eeda945122f155f70", "keywords": "celebrity,jennifer lopez,alex rodriguez,cover story,cover", "news_keywords": "celebrity,jennifer lopez,alex rodriguez,cover story,cover", "robots": "index, follow", "content-type": "article", "parsely-post-id": "59e8e27eeda945122f155f70", "parsely-metadata": "{\"description\":\"Despite the surreal fame—and baggage—carried by Jennifer Lopez and Alex Rodriguez, their relationship makes perfect sense. Both started from modest backgrounds, hit the big time fast, and had to battle their own demons to survive. The new couple discuss everything from their nerve-racking first date to the “reveals” that forged their bond.\",\"image-16-9\":\"https://media.vanityfair.com/photos/59f73e545ba52f252468160b/16:9/w_1000,c_limit/t-jlo-arod-cover-1217.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/59f73e545ba52f252468160b/1:1/w_1000,c_limit/t-jlo-arod-cover-1217.jpg\"}", "og": {"description": "Despite the surreal fame—and baggage—carried by Jennifer Lopez and Alex Rodriguez, their relationship makes perfect sense. Both started from modest backgrounds, hit the big time fast, and had to battle their own demons to survive. The new couple discuss everything from their nerve-racking first date to the “reveals” that forged their bond.", "image": "https://media.vanityfair.com/photos/59f73e545ba52f252468160b/16:9/w_1280,c_limit/t-jlo-arod-cover-1217.jpg", "site_name": "Vanity Fair", "title": "J-Rod! Jennifer Lopez and Alex Rodriguez on Love, Beauty, and Redemption", "type": "article", "url": "https://www.vanityfair.com/style/2017/10/jennifer-lopez-alex-rodriguez-cover-story"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Despite the surreal fame—and baggage—carried by Jennifer Lopez and Alex Rodriguez, their relationship makes perfect sense. Both started from modest backgrounds, hit the big time fast, and had to battle their own demons to survive. The new couple discuss everything from their nerve-racking first date to the “reveals” that forged their bond.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/59f73e545ba52f252468160b/16:9/w_1280,c_limit/t-jlo-arod-cover-1217.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "J-Rod! Jennifer Lopez and Alex Rodriguez on Love, Beauty, and Redemption"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}