{"url": "http://www.lady-first.me/article/jessica-biel-motherhood-informed-my-role-in-the-sinner,13382.html", "text": "Jessica Biel says motherhood helped prepare her for her role in 'The Sinner'.\n\nThe 35-year-old actress plays Cora Tannetti, a mother who murders a man she doesn't know and can't recall why she did it, and she says having two-year-old son Silas Randall informed her partly about the role.\n\nShe said: \"Easier in the sense that I truly understand what it means to have a child, what the history of that looks like. You know, the actual process of it. And then what it means to be a parent.\n\n\"So playing a person who commits a crime like this and then has to really deal with the repercussions of how does that look like for her family unit - that I really understand and I feel very connected to that idea.\"\n\nAnd Jessica was sold on the role the minute she realised how \"psychologically complicated\" her character is.\n\nShe added to E! News: \"I think the book initially was so interesting, so compelling. And this particular character, who is so psychologically complicated, that's what you dream of when you're sitting at home like, 'Oh, what would I love to do?' Someone that is terrifying ... all of these things wrapped up in this project for me.\"\n\nMeanwhile, Jessica previously admitted she is \"worried\" about her son following in her footsteps.\n\nShe said: \"I don't know if it's a fear. He's constantly surrounded by music and the arts, so it's a very good possibility that he's going to be interested in those things.\n\n\"I obviously worry because you'd never want your kid to feel rejection the way you sometimes feel in the business, or feel that they're being compared to someone else or have to look a certain way. Those pressures exist.\n\n\"So more than the art itself, it's the surrounding elements that as a parent, you'd be worried for your kid. You'd want them to be supported and happy, and not criticised. But that's the nature of the beast, really.\"", "images": ["https://img.lady-first.me/frimage/c67460f3e604354362737089c2a17b5d_md.jpg", "https://img.lady-first.me/frimage/e89261ebe707725d357827fae9ca89f5_md.jpg", "https://img.lady-first.me/frimage/73879c9314e3014aa8a26f76211efccf.jpg", "https://www.lady-first.me/images/favicon.ico"], "top_img": "https://www.lady-first.me/images/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Jessica Biel: Motherhood informed my role in The Sinner", "meta_data": {"og": {"site_name": "LadyFirst", "title": "Jessica Biel: Motherhood informed my role in The Sinner", "description": "Jessica Biel: Motherhood informed my role in The Sinner", "type": "article"}, "twitter": {"title": "Jessica Biel: Motherhood informed my role in The Sinner", "description": "Jessica Biel: Motherhood informed my role in The Sinner"}, "description": "Jessica Biel: Motherhood informed my role in The Sinner", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.lady-first.me", "summary": ""}