{"url": "http://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "text": "'The Royle Family makes me properly laugh': Stacey Dooley's lockdown TV The documentary maker reveals how Ricky Tomlinson and co remind her of her childhood, and why the stars of Netflix’s Tiger King are just as bad as each otherI’m really antisocial, so just sitting on the sofa and having a cup of tea is my idea of heaven. I’m trying to politely decline all the Zoom offers that are being thrown my way and I’ve been watching lots of TV instead.In terms of total escapism, something I’ve been going back to is my favourite sitcom: The Royl Read more\n\nNo reopening in sight for US cinemas after federal guidelines issued Guidelines issued at coronavirus briefing describe a phased return to activity for venues – but contain no specified timeframe• Coronavirus and culture – a list of major cancellations\n\n• Coronavirus – latest updates\n\n• See all our coronavirus coverageUS cinemas are no nearer reopening despite the publication of federal guidelines by Donald Trump at a coronavirus briefing on Thursday.The guidelines specifically mentioned movie theatres as among the types of venue th Read more\n\nNo conferring! Take our devilishly hard University Challenge quiz Are you a brainbox like Brandon, or even half as wise as Wang? Ahead of Monday’s final, pit your wits against our truly tricky questions, as compiled by the show’s question settersIn which present-day country is the ancient kingdom of Sheba, whose queen visited King Solomon?OmanYemenSaudi Arabia Which Latin-derived philosophical term was popularised by Ivan Turgenev’s 1862 novel Fathers and Sons, where it was used to describe the crude scientism espoused by the character Bazaro Read more\n\nToo Hot to Handle review – 'chaste' Love Island is disgustingly bingeable Bronzed hedonists, a tropical island, a cash prize. We’ve seen it all before ... but Netflix’s new series ups the drama with a dubious, socially-distanced twist. Good luck trying to abstainBy now, we’re used to this: rotating shots of crashing waves on sunny beaches, slow-motion poolside workouts, cameras lingering on pecs and bikinis. Too Hot to Handle (Netflix) is the natural culmination of years of reality TV shows. It is Love Island, trimmed to its leanest and meanest, and Read more\n\nJohnny Depp and Jeff Beck announce album with cover of John Lennon's Isolation Hollywood actor adds to list of starry musical projects as he awaits restart of libel case against the Sun newspaperJohnny Depp has announced his latest musical project, an album made with 75-year-old blues-rock guitarist Jeff Beck.Announcing the collaboration with a cover of John Lennon’s song Isolation, Beck said: “Given all the hard days and true ‘isolation’ that people are going through in these challenging times, we decided now might be the right time to let you all Read more\n\nMy top tip for coping with coronavirus anxiety? Watch Jonathan Creek Alan Davies’s self-assured amateur sleuth and Caroline Quentin’s feminist writer take us back to a happy golden age of bad haircuts, landlines and denimDuring two weeks of social isolation, I discovered the best antidote to coronavirus anxiety I’ve found so far: Jonathan Creek.For those unfamiliar with the 1990s murder mystery show, Jonathan Creek follows the adventures of the eponymous magician’s consultant (Alan Davies), who – for the first few series at least &nd Read more\n\nHome review – designs take on a grander purpose without Kevin McCloud From a balmy Mediterranean greenhouse in snowy Sweden to an incredible transforming Hong Kong apartment – this series celebrates visionary home-buildingLet us deal with the most immediate and valid concern when presented with a new series entitled Home (Apple+ TV) that promises an in-depth look at the different and architecturally interesting ways various people of vision have chosen to build and live in theirs. Namely: is it Grand Designs with knobs on?The answer, I am very happy to tell Read more\n\n'It's like Serial for crisps' – podcasts of the week Is there a Walkers-gate scandal deep at the heart of the British snack business? Plus: Tiger King fandom lives on The Walkers Switch\n\nIf you can remember Walkers switching the colours of their salt and vinegar and cheese and onion crisps, you’re not alone. But the brand insists it never happened. Is it a false memory? This podcast from Lauren Peters and Augustine Cerf investigates the issue forensically. They believe you deserve to know the truth, so explore fan theories, a possible Tory pl Read more", "images": ["https://img.newslocker.com/2020/04/17/205220583_725.jpg", "https://img.newslocker.com/2020/04/17/205256796_350.jpg", "https://img.newslocker.com/2020/04/16/205195883_350.jpg", "https://img.newslocker.com/2020/04/16/205184086_350.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/04/17/205244723_725.jpg", "https://img.newslocker.com/2020/04/17/205201748_350.jpg", "https://img.newslocker.com/2020/04/17/205238328_725.jpg", "https://img.newslocker.com/2020/04/16/205186259_350.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/04/17/205205848_350.jpg", "https://img.newslocker.com/2020/04/18/205310433_350.jpg", "https://img.newslocker.com/2020/04/17/205228833_350.jpg", "https://img.newslocker.com/2020/04/17/205233224_725.jpg", "https://img.newslocker.com/2020/04/17/205220584_350.jpg", "https://img.newslocker.com/2020/04/16/205186258_350.jpg", "https://img.newslocker.com/2020/04/17/205241873_350.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img.newslocker.com/2020/04/17/205236702_725.jpg", "https://img.newslocker.com/2020/04/17/205222200_350.jpg", "http://www.newslocker.com/images/rss.png", "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/newslocker-cube.png", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img.newslocker.com/2020/04/17/205235556_350.jpg", "https://img.newslocker.com/2020/04/17/205222199_350.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/04/17/205279245_350.jpg", "https://img.newslocker.com/2020/04/17/205264323_350.jpg", "https://img.newslocker.com/2020/04/17/205257778_725.jpg", "https://img.newslocker.com/2020/04/17/205255351_725.jpg", "https://img.newslocker.com/2020/04/17/205228832_350.jpg", "https://img.newslocker.com/2020/04/16/205186257_350.jpg", "https://img.newslocker.com/2020/04/16/205189320_350.jpg", "https://img.newslocker.com/2020/04/16/205184290_725.jpg", "https://img.newslocker.com/2020/04/17/205250734_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob", "meta_data": {"description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "og": {"title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob - Cinema, Theater & TV news - NewsLocker", "description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "type": "website", "url": "https://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1498831200.0, "source": "http://www.newslocker.com", "summary": ""}