{"url": "www.bustle.com/p/ariana-grande-shut-down-pregnancy-rumors-in-a-series-of-hilarious-tweets-9558457", "text": "Talk about making lemonade from lemons. Ariana Grande is responding to pregnancy rumors on Twitter and she's truly living her best life while doing so. On Wednesday, June 20, a MediaTakeOut report claimed that Grande and Pete Davidson were expecting a baby, according to an \"anonymous entertainment insider.\" On Thursday night, Grande joined Ariantors to make fun of the ridiculous rumors and reveal where she stands when it comes to actually having kids one day.\n\nThe MediaTakeOut story further reports that Grande pushed her new album release date from July to August to be in line with a surprise \"pregnancy reveal\" at the MTV Video Music Awards on August 20. On Wednesday, Grande revealed Sweetener's release date (August 17) and shared new audio from the track \"The Light Is Coming.\" Earlier in the week, Grande revealed there's an interlude named \"Pete,\" obviously titled after her new fiancé.\n\nFrom the quick engagement and album release date, fans started speculating about Grande's possible pregnancy on social media. On Thursday night, however, two Arianators posted respective tweets poking fun at the rumors and Grande responded to the long threads the tweets created, multiple times. One tweet says, \"ariana is pregnant again are we shocked.\" The other tweet reads, “aRiAnNA Is PreGnNanT“ with a photo of Grande rolling her eyes.\n\nIt seems the opportunity to dive in and have fun with them was just too good for Grande to pass up. If the tabloids were correct, Grande would've been pregnant, like, 80 times by now.\n\nShe really just found the whole thing so comical.\n\nAnd although she's ruling out pregnancy right now, she's still excited about it for the future. Grande tweeted things like the egg emoji and the hashtag #fertilequeen, teasing fans about having kids down the line.\n\nMeanwhile, Davidson is having a little fun of his own with his engagement news heard 'round the world. Earlier in the week, the SNL star visited The Tonight Show With Jimmy Fallon for the first time, where he confirmed the engagement. Fallon poked fun at Davidson, saying, \"Now you know that you didn't have to get engaged to Ariana Grande to come on our show.\" Davidson replied, \"But I did, though.\" He gave thumbs up and continued, \"I feel like I won a contest. It's f*cking lit, Jimmy.\"\n\nAfter, he talked about all the new attention he's getting from strangers for proposing to Grande. \"It's so funny walking down the street, 'cause dudes are walking by,\" he said, \"and they're like [tips hat].\" He hilariously compared the experience to the infamous tip-of-the-hat Nike ad when Derek Jeter retired.\n\nOn the same day, TMZ reported that Davidson and Grande moved into an NYC apartment. The five-bedroom, 4,000 square foot Chelsea pad reportedly costed $16 million and is in a luxury complex with a sky-lit pool and private IMAX theater. The weekend prior, Grande teased their move by posting a photo of SpongeBob SquarePants on her Instagram story, writing, \"Us in our new apartment with no furniture, 1 speaker and red vines.\"\n\nThe pair obviously has so much going on right now and it would be a lot to think a pregnancy could thrown into the mix. They got engaged in mid-June seemingly after just a few weeks of dating. Further, Grande's hard at work in the weeks leading up to her big album release. Not to mention, the two have been thriving while spending time dressing up in Harry Potter robes together. The whirlwind romance may have seemed to have happened over night, but that doesn't mean a pregnancy will too — at least not yet.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/9/18095bba-0961-4b71-b9a9-2aee8da87cc7-getty-1198910351.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/22/05e34364-371b-4f0a-9a31-71f862ec0c08-ariana-pete-1-1-copy.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/6/22/87687b2a-21be-46f2-8c06-f708a27efe6b-something-new-cta-all-articles.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/22/05e34364-371b-4f0a-9a31-71f862ec0c08-ariana-pete-1-1-copy.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/15/2d21ebe8-9f96-4fc8-a8bc-d244baa6bbcb-getty-529590044.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/a41169d3-216a-40c1-9f39-4fc22f6eb609-screen-shot-2020-04-06-at-122953-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/bdb0f12d-3fc5-4f54-9148-62a9337bc4d5-getty-1199620322.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/22/05e34364-371b-4f0a-9a31-71f862ec0c08-ariana-pete-1-1-copy.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/ariana-grande-shut-down-pregnancy-rumors-in-a-series-of-hilarious-tweets-9558457", "title": "Ariana Grande Shut Down Pregnancy Rumors In A Series Of Hilarious Tweets", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/ariana-grande-shut-down-pregnancy-rumors-in-a-series-of-hilarious-tweets-9558457", "type": "article", "title": "Ariana Grande Just Addressed Those Pregnancy Rumors In A Series Of Hilarious Tweets", "description": "Talk about making lemonade from lemons. Ariana Grande is responding to pregnancy rumors on Twitter and she's truly living her best life while doing so. On Wednesday, June 20, a MediaTakeOut report claimed that Grande and Pete Davidson were expecting…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/22/05e34364-371b-4f0a-9a31-71f862ec0c08-ariana-pete-1-1-copy.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Talk about making lemonade from lemons. Ariana Grande is responding to pregnancy rumors on Twitter and she's truly living her best life while doing so. On Wednesday, June 20, a MediaTakeOut report claimed that Grande and Pete Davidson were expecting…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}