{"url": "https://thinkprogress.org/set-it-up-director-on-diverse-casting-hiring-women-and-filming-while-very-pregnant-86c60e848f7f/", "text": "Were you one of the many, many people — technically countless, because much like the formula for Coca-Cola or Taylor Swift’s political persuasion, Netflix’s viewing numbers are not for the masses to discover — who, charmed by a delightful trailer and clamoring to escape the all-consuming horror and drudgery of everyday life in 2018, found yourself whiling away a summer day watching Netflix’s original romantic comedy, Set it Up?\n\nFor those who have yet to indulge in streaming’s sleeper hit of the summer: Kirsten (Lucy Liu) and Rick (Taye Diggs) are the high-powered bosses of put-upon assistants Harper (Zoey Deutch) and Charlie (Glen Powell), exhausted twenty-somethings who dream of one day actually getting out of the office while it’s still daylight and pursuing their passions: He yearns to be a present boyfriend for his model girlfriend, she has fantasies of becoming a journalist, starting with writing an article she’s only drafted in her mind. So the underlings pull a Parent Trap (Harper thinks they’re Cyrano-ing; she is incorrect), utilizing their scarily-thorough intel and total control over their bosses’ lives to matchmake their managers. As genre requires, the hijinksers become the hijinksed, the right people find love, the wrong people get caught, and everyone lives to strive another day — all to a peppy, sunny soundtrack.\n\nThere’s snappy banter, revelations about purpose and meaning and love, and kissing on the jumbrotron…and it’s great. It’s stuffed with delicious, supporting turns from comedy-land favorites: Tituss Burgess from Unbreakable Kimmy Schmidt, Pete Davidson of SNL (and BDE) fame, Search Party‘s Meredith Hagner. It is a sip of lemonade in this swampiest of summers, a much-needed break from breaking news.\n\nAnd it was directed by Claire Scanlon, a veteran of TV comedy (Brooklyn Nine-Nine, Unbreakable Kimmy Schmidt, Black-ish, Fresh off the Boat, The Office, the buzziest episode of the new season of GLOW) making her feature film debut. Which would be an exciting feat no matter what but is an especially impressive one when you learns he shot Set it Up while she was eight months pregnant.\n\nAdvertisement\n\nScanlon spoke with ThinkProgress about disclosing her pregnancy to the Netflix powers-that-be (easier than you might expect), hiring so many women behind the scenes (also easier than you might expect), and casting people of color as leads, supporting characters, and extras (harder than you’d think).\n\nI read that you gave birth something like a month after you finished shooting.\n\nNot even! Our last day of production was July 1 and I gave birth to Nicholas on July 29.\n\nOkay, so talk me through that timeline. Did you know that filming would coincide with the end of your pregnancy? When plans for this movie got underway, did you even know you’d be pregnant?\n\nAdvertisement\n\nI was pregnant when we met with Matt Brodie [Netflix’s head of original film] and Netflix. He didn’t know I was pregnant, but I did! My first daughter, I was pregnant with while directing Last Man on Earth. I knew I could direct pregnant. I’m one of those lucky people where I knew it wouldn’t wear me down. Knowing that, I just kind of kept it to myself.\n\nWhen Netflix said they actually wanted to do [Set it Up] and then they meant it, [that was when] we told them I was pregnant.\n\n“When we would [say], ‘this is a diverse casting situation,’ people would still just send us white people. You have to be like, no, it’s not just trying to be politically correct. We mean it.”\n\nWhat did that conversation entail? Were you nervous at all going into it?\n\nI think it was a very perfunctory conversation producers had with him. Like, “Oh, by the way, Claire’s pregnant.” Because you have to be insured in general, as an above-the-line person. I had to get a doctor’s visit. Actors have to do it, too. They just let Matt Brodie know I was pregnant, and he didn’t care. And then he came to visit set at one point. I think it was the second of two visits, and I was very pregnant for both. I went from seven-and-a-half to nine months over the course of the shoot. I was showing. And he was like, “Oh, she’s REALLY pregnant!” But he’d been watching the dailies and everything was coming in fine. It was not ever an issue.\n\nDirector Claire Scanlon attends the \"Set It Up\" New York Screening at AMC Lincoln Square Theater on June 12, 2018 in New York City. CREDIT: Nicholas Hunt/WireImage\n\nTalk to me about hiring all these women on your crew. Because one thing that sticks out to me, just scrolling through that IMDB, is the number of women in high-level positions. It’s not just you at the top, surrounded by a bunch of men.\n\nWe started in April 2017. We were in New York. So we started with, who’s available in the city and who can come?\n\nAnd right off the bat, I talked to the line producer, Carrie Fix. She really loved the script and wanted to do it. She was immediately hired after we had a phone conversation. One of her closest friends was a location manager, and happens to be a woman, Sascha Springer, and so that was easy. We have a great working relationship already.\n\nAdvertisement\n\nI had a phone interview with Jane Musky, who was the production designer on When Harry Met Sally… and when you’re doing your first feature romantic comedy, you want to have some good luck — some When Harry Met Sally… fairy dust. Anything that touched that movie, I wanted to be near. She was great, and she went above and beyond on her job. She was so experienced and knew New York backward and forward. I could go to her and say, “I’m stressed about this, what do you think?” She was a great confidant and a great mentor.\n\nJuliet [Berman, producer] Katie [Silberman, screenwriter] were obviously involved in the project before I came on. The costume designer, Rebecca Hofherr, was Lucy [Liu]’s costume designer on Elementary. We all have our favorite Lucy outfit in the movie. The clothes are so good. Rebecca [Hofher, costume designer] was great, too.\n\nIt’s funny to hear you describe it this way, because this sounds exactly like the same, “Oh, I just hired my friend who I knew would be great” logic that you always hear from straight white dudes when they are explaining why they don’t hire women and people of color. That it’s not malice, racism, sexism, or any intentional exclusion; they’re just working within their existing networks.\n\nIt is! It’s the exact same thing, which is why it’s so great I was in a position to hire people. Because that is how it works!\n\nComing from television, showrunners have the best intentions. But in TV, the writer is king. You’re being vulnerable. Writing is a very scary thing, and when you’re putting your ideas out there, you want your close friends around. I get why people are like, I just want to hire my friends, they’re not going to laugh at me. I work in comedy, and someone making fun of you is a killer of confidence and of comedy. And I totally get that.\n\nBut I also see it breeds — I don’t want to say “incest,” but it means you’re not breaking out of your group. Which is dumb, because having new, fresh points of view can enhance your show.\n\nWhat are the tropes of the rom-com that you love and wanted to maintain, and what is the stuff that you thought, hmm, that hasn’t aged well, let’s ditch it?\n\nFrankly, I’m probably not the rom-com lover that Katie is. I’m a comedy lover. I have nothing on Mindy Kaling — although I did cut her pilot [for The Mindy Project], which was an homage to all the great moments in rom-com history. From Mindy, I know what a rom-com lover is, and knowing Mindy, I can’t hold a candle to her. She is the kind of person who sits home and will watch all of them in a go.\n\nI like comedy, so I would say I air on the side of the rom-com that has more com than rom, and I feel like that’s what Set it Up is. It’s not like there’s a ton of romance in this movie. Aside from the pizza scene, it’s not super romantic. Which I think, when they come, makes them more delightful, because it’s more earned, and it’s not too melodramatic.\n\n“We can all relate to making an ass out of ourselves, and to quiet moments of loneliness or sadness.”\n\nI feel like that genre can sometimes be melodramatic, and I find that off-putting. It disengages me as a viewer. Especially if you use music or nostalgia for a certain song in a very heavy-handed way to evoke emotions in the person that’s watching the movie that you haven’t earned on-screen with your actors, that’s another trope I would try to avoid.\n\nThe ones I love are the ones from the ’30s and ’40s. The witty dialogue, the pacing, and the women were on par with the men always, if not ahead of them. And not because the men were dumb dads or boyfriends; it’s that the women were that smart. Like His Girl Friday, Bringing Up Baby, even though Katharine Hepburn is ditzy in that movie, she knows what she wants. The Philadelphia Story, It Happened One Night. Those are all such good movies, and they’re clever.\n\nIt’s interesting how some of the movies that are older — as you say, from the 1930s and the 1940s — have actually aged better than some of these movies from the 1990s. In My Best Friend’s Wedding, the age of their marriage pact, when they’re like, “If we haven’t found love by now, we are HOPELESS and are doomed to wed one another,” is thirty!\n\nIt’s so funny because in When Harry Met Sally…, when her ex is getting married and she’s crying up a storm, and she’s like “I’M GONNA BE FORTY!” And he’s like, “When?” and she goes, “Someday!” because she’s 32.\n\nWhat do you think a rom-com needs to keep grounded so people stay with your story, and what can just abide by that rom-com, pie-in-the-sky fantasy logic?\n\nThis isn’t just unique to rom-coms but I think if you have a character that makes you laugh — if I’m reading a script and the lead character does something ridiculous that I don’t see coming and they make me laugh, and there’s something quirky and charming — and then on the heels of that, I see their vulnerability. I always use the example of Michael Scott from The Office. He’s ridiculous, I laugh at him, and then I see how his mom screened his phone calls, or how kids in school made fun of him, that was so painfully vulnerable. And after that, I embraced the idea that he was trying to make his coworkers his family.\n\nComedy and then vulnerability: When you get that perfect balance, I’m in for the ride. I’m ready to go on any journey with that character. We can all relate to that. We can all relate to making an ass out of ourselves, and to quiet moments of loneliness or sadness.\n\nOne of the reactions I’ve heard from people who loved this movie was this note of, as diverse as the greater cast is, the leads are still straight white people. I heard a lot of, “I would watch the movie that’s about Taye Diggs and Lucy Liu.” That we still seem to be a ways from having the mainstream rom-com that centers people of color and puts white people in the supporting roles. I’d love to hear more about the casting process from you. Were any decisions influenced by a sense that audiences wouldn’t be open to this movie if those roles were reversed, that the stars needed to be white?\n\nAbsolutely not. And by the way, the script didn’t just go with white people. It wasn’t just Zoey [Deutch] and Glen [Powell]. We had open minds with all the characters. And none of the parts were written for any ethnicity. I pushed very hard for the diversity you see in the film.\n\nTaye Diggs and Lucy Liu in Set It Up. CREDIT: Netflix\n\nI think it’s a very representative cast for New York City. I, too, have watched a lot of rom-coms shot in New York, and I wasn’t able to get through all of them. To your earlier question of, when is it good to be grounded, when is it pie in the sky, some of them I had to turn off because, where is it in New York City that all the people in the background are white? It just didn’t feel real. It didn’t feel grounded.\n\nWe were always open to Harper and Charlie being diverse characters as well, With Meredith Tucker, our casting director, when we would tell people, “this is a diverse casting situation,” people would still just send us white people. You have to be like, no, it’s not just trying to be politically correct. We mean it.\n\nWow that’s illuminating, to hear that people didn’t take you at your word that you wanted to see non-white actors.\n\nYeah, it’s disappointing. Look, it’s not unique to me. I couldn’t even say the names of those particular people. But we had to say, we really mean it.\n\nI’ve read studies on background actors and the lack of diversity in that area of film — something that doesn’t get as much attention as above-the-line casting — and it’s true, it really does pull you out of the movie!\n\nLike, where is that? Where in New York are you? Is it just some exclusive white mens’ club? I guess on Wall Street, it’s possible.\n\nHow do you feel about having your first feature film debut this on Netflix and not in theaters?\n\nI’m 100 percent sure more people saw the movie because of Netflix, because it’s this international audience. We went into Netflix and they could say that in the Philippines and Brazil, audiences are really into romance and will love this movie. So they already knew, let’s go hard in these countries.\n\n“I should be really careful how to say this. Everyone has an interesting story to tell. But it’s been heavily weighted on the white man side, and I’d rather watch ‘Insecure’ than ‘Last Man Standing.'”\n\nI think for a first feature, it’s been great [to not] have the pressure of the big box office weekend. It could open and build, versus it all depends on those first two days. That’s insane! There’s so much stuff out there. This was initially at MGM and Emilia Clarke was supposed to play Harper, and due to MGM moving slowly, we lost her to Game of Thrones, and I’m not sad. Because I think Netflix really backs the creative team. They didn’t give us many notes at all. I get to do it and it [if it failed] it would be me, my failure, not everyone else giving me notes. This is my movie. I’m very proud of this movie.\n\nI don’t know if you’ve Googled yourself recently, but almost all these headlines about you basically say: CLAIRE IS SAVING THE ROM-COM. What do you make of those ‘death of the romantic comedy ‘ stories. Are people not interested in the genre anymore? Did the genre abandon a still-interested audience?\n\nI think the audience is there and it always has been, Studios topped making the rom-com because it became financially difficult to market, when we had big expensive stars and the stories become more and more formulaic. I think it all comes down tot he writing. Katie wrote a great script. The characters are delightful, goofy, lovable. It’s the story, stupid! You always kind of come back to that.\n\nI think that rom-coms just started getting more and more vapid and formulaic, and relying on those tropes. And then it’s like when you are eating that bag of chips, you’re not really sated, and you feel like crap afterwards. That was the experience with some of those rom-coms, and people stopped watching them. But Netflix is privy to what people are watching, and they’re watching rom-coms in droves, again and again and again. That’s how they knew it was this market. It’s not a mystery. People are always wanting this stuff.\n\nMaybe the studios couldn’t figure out a way to do this and find a space amid comic book movies and theme park movies, and they kind of gave up. but there’s a vacuum. I’m a 46-year-old woman and I’d say that there’s not that many movies that I’d want to see, or if you’re a 46 year-old-man who doesn’t want to see comic book movies. Not to knock on comic books, but they’re the only genres. That and Jurassic Park and Star Wars. And there’s so much more stories to tell!\n\nIt’s slim pickings out there.\n\nI should be really careful how to say this. Everyone has an interesting story to tell. But it’s been heavily weighted on the white man side, and I’d rather watch Insecure than Last Man Standing. You know what I mean? One person has had nothing but a pulpit, and the other person has never had a pulpit. I want to see that story. I don’t want to see another white guy struggling in Brooklyn story. “Oh, woe is me, struggling because I was white and born in Brooklyn.” Go away! I want to see Issa Rae.\n\nThe movie I am most excited to see is Crazy Rich Asians. I think that that’s the new normal. And I can promise you that’s the new normal, because Ali Wong and Randall Park are shooting this new [Netflix] movie, Always Be My Maybe.\n\nI always like to talk about the diversity of the cast and the diversity of the background, even. I just think that there’s lots of stories to tell.", "images": ["https://archive.thinkprogress.org/uploads/2018/07/setitup.jpg?w=1420&h=946&crop=1"], "top_img": "https://archive.thinkprogress.org/uploads/2018/07/setitup.jpg?w=1420&h=946&crop=1", "keywords": [], "authors": [], "canonical_link": "https://archive.thinkprogress.org/set-it-up-director-on-diverse-casting-hiring-women-and-filming-while-very-pregnant-86c60e848f7f/", "title": "How to make the sleeper hit of the summer without even showing your movie in theaters", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"pages": 200137333331078, "smart_publish": {"robots": "auto"}}, "generator": "WordPress 5.3.2", "ia": {"markup_url": "https://archive.thinkprogress.org/set-it-up-director-on-diverse-casting-hiring-women-and-filming-while-very-pregnant-86c60e848f7f/?ia_markup=1"}, "og": {"title": "How to make the sleeper hit of the summer without even showing your movie in theaters", "url": "https://archive.thinkprogress.org/set-it-up-director-on-diverse-casting-hiring-women-and-filming-while-very-pregnant-86c60e848f7f/", "type": "article", "description": "Talking to Claire Scanlon about making a Netflix original rom-com while (very) pregnant.", "image": {"identifier": "https://archive.thinkprogress.org/uploads/2018/07/setitup.jpg?w=1420&h=946&crop=1", "url": "https://archive.thinkprogress.org/uploads/2018/07/setitup.jpg?w=1420&h=946&crop=1", "width": 1420, "height": 946}}, "twitter": {"card": "summary_large_image", "title": "How to make the sleeper hit of the summer without even showing your movie in theaters", "site": "@thinkprogress", "description": "Talking to Claire Scanlon about making a Netflix original rom-com while (very) pregnant.", "image": "https://archive.thinkprogress.org/uploads/2018/07/setitup.jpg?w=1420&h=946&crop=1", "creator": "@Jessicagolds"}, "article": {"publisher": "https://www.facebook.com/ThinkProgress", "author": "https://facebook.com/goldsteinjessica"}, "msapplication-TileImage": "https://archive.thinkprogress.org/uploads/2018/04/cropped-favicon-512.png?w=270"}, "movies": ["https://www.youtube.com/embed/X-eRc9PF3TU?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/mgqHjFn1gaw?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": null, "source": "https://thinkprogress.org", "summary": ""}