{"url": "www.look.co.uk/news/margot-robbie-career-husband-604909", "text": "Her acting career coudn't be going any better, but behind closed doors, is Margot's personal life under strain?\n\nMargot Robbie should be on cloud nine, right?\n\nShe’s just been nominated for a Best Actress Oscar for her role in I, Tonya (a film that also scooped three Golden Globes nominations and one win), every stylist and make-up artist on the planet wants to work with her, and there are major rumours she could become the new face of Chanel (having worn the designer at both the Golden Globes and the 90th Annual Academy Awards Nominee Luncheon).\n\nYep, 2018 looks good on Margot. But huge career success aside, we’ve heard there’s trouble brewing at home, with tensions rising between Margot, 27, and her British husband Tom Ackerley, 28.\n\n‘Everything is going brilliantly in her career, but Margot’s personal life is less than satisfactory,’ explains a friend. ‘She’s at her wit’s end. She’s getting all the attention at the moment–and Tom is so proud to be at her side – but it’s obviously difficult with Margot’s star power on the rise.\n\n‘This season, she’s busier and more in-demand than any other, which has impacted on their couple time. Of course, it’s only natural that they would want more time together. There has been a few disagreements, and he wants Margot to speak up for him in public, as a way of showing people that he matters to her.’\n\nWe’ve heard that Tom is being mega-supportive of Margot’s big career achievements, and while the actress has said the pair ‘don’t really fight’, it seems they’ve been bickering over where to live long-term.\n\nMargot has previously said their future children would be raised Down Under, and also revealed that Tom ‘[doesn’t know] why anyone would leave Australia’.\n\nBut, with her career going from strength to strength, sources claim the actress doesn’t want to move just yet.\n\n‘They’re in this for the long haul and they love each other wants very much,’ reveals a friend.\n\n‘But Tom wants to keep their time in Hollywood to a minimum, believing that it’s a toxic place with people willing them to fail. Margot is at the height of her career and, yes, she and Tom did talk about moving back to the UK or Australia, but now she wants to spend more time in LA and enjoy the ride while she can.\n\n‘The word is that she wants him to be more understanding about the demands of her career. And that she wants him to toughen up and ignore the pessimists, who seem to want to tear them apart.\n\n‘It’s an exciting time for Margot, her bank account is soaring – she’s currently estimated to be worth $12million – but I, Tonya alone is netting another $10million.\n\n‘Plus, she’s signed on to a bunch of other money-spinning films and projects, with beauty ranges and fashion deals galore also in the works. She and Tom clearly love each other, but lately it’s been push and pull between them.\n\nI don’t think she thought it would be this hard – she wishes she’d had prior warning.’\n\nWith what is looking to be a very big and exciting year for Margot, we hope she and Tom sort this all out ASAP…\n\nFor more celebrity news, check out this week’s issue of LOOK.", "images": ["https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2018/02/margot-tom-920x690.jpg", "https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2018/02/margot-tom.jpg", "https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/57/2016/10/look-logo-footer.svg", "https://www.look.co.uk/wp-content/themes/simba-theme/assets/images/placeholder.png"], "top_img": "https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2018/02/margot-tom.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.look.co.uk/news/margot-robbie-career-husband-604909", "title": "Margot Robbie Is ‘Torn’ Between Her Career And Husband Tom Ackerley", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Her acting career coudn't be going any better, but behind closed doors, is Margot's personal life under strain?", "og": {"locale": "en_US", "type": "article", "title": "Margot Robbie Is 'Torn' Between Her Career And Husband Tom Ackerley - Look Magazine", "description": "Her acting career coudn't be going any better, but behind closed doors, is Margot's personal life under strain?", "url": "https://www.look.co.uk/news/margot-robbie-career-husband-604909", "site_name": "Look Magazine", "image": {"identifier": "https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2018/02/margot-tom.jpg", "secure_url": "https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2018/02/margot-tom.jpg", "width": 1000, "height": 750}}, "article": {"section": "News", "published_time": "2018-02-20T14:46:09+00:00"}, "twitter": {"card": "summary", "description": "Her acting career coudn't be going any better, but behind closed doors, is Margot's personal life under strain?", "title": "Margot Robbie Is 'Torn' Between Her Career And Husband Tom Ackerley - Look Magazine", "image": "https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2018/02/margot-tom.jpg"}, "fb": {"pages": 7693705627}, "msapplication-TileImage": "https://img.ti-media.net/wp/prod/wp-content/uploads/sites/57/2016/10/cropped-look-icon-300x300.png"}, "movies": [], "publish_date": 1519137969.0, "source": "http://www.look.co.uk", "summary": ""}