{"url": "en.wikipedia.org/wiki/Reese_Witherspoon", "text": "\"Laura Witherspoon\" redirects here. For other uses, see Witherspoon (surname)\n\nAmerican film and television actress and producer\n\nLaura Jeanne Reese Witherspoon (born March 22, 1976) is an American actress, producer, and entrepreneur. The recipient of several accolades, including an Academy Award and a Primetime Emmy Award, she is among the highest-paid actresses in the world, as of 2019. Time magazine named her one of the 100 most influential people in the world in 2006 and 2015, and Forbes listed her among the World's 100 Most Powerful Women in 2019.\n\nBorn in New Orleans, Louisiana, and raised in Nashville, Tennessee, Witherspoon began her career as a teenager, making her screen debut in The Man in the Moon (1991). Following a leading role opposite Mark Wahlberg in Fear (1996), her breakthrough came in 1999 with a supporting role in Cruel Intentions and for her portrayal of Tracy Flick in the black comedy Election. She achieved wider recognition with her role as Elle Woods in the comedy Legally Blonde (2001) and its 2003 sequel, and for her starring role in the romantic comedy Sweet Home Alabama (2002). In 2005, her portrayal of June Carter Cash in the biographical musical film Walk the Line garnered critical acclaim and won her the Academy Award for Best Actress.\n\nFollowing a career downturn, during which her sole commercial success was the romantic drama Water for Elephants (2011), Witherspoon made her career comeback when she produced the thriller Gone Girl and the drama Wild (both 2014), under her production company Hello Sunshine. She also starred as Cheryl Strayed in the latter, for which she received a second nomination for the Academy Award for Best Actress. Witherspoon ventured into television by producing and starring in the HBO drama series Big Little Lies (2017–2019), the Apple TV+ drama series The Morning Show (2019), and the Hulu miniseries Little Fires Everywhere (2020). For the first of these, she won the Primetime Emmy Award for Outstanding Limited Series.\n\nWitherspoon also owns a clothing company Draper James, and she is actively involved in children's and women's advocacy organizations. She serves on the board of the Children's Defense Fund (CDF) and was named Global Ambassador of Avon Products in 2007, serving as honorary chair of the charitable Avon Foundation. She received a star on the Hollywood Walk of Fame in 2010.\n\nEarly life\n\nWitherspoon was born on March 22, 1976[1] at Southern Baptist Hospital, in New Orleans, Louisiana, while her father, John Draper Witherspoon, was a student at Tulane University medical school.[2][3] Witherspoon was born in Georgia and served as a lieutenant in the United States Army Reserve.[4][5] He was in private practice as an otolaryngologist until 2012.[6] Her mother, Mary Elizabeth \"Betty\" Witherspoon (née Reese), is from Harriman, Tennessee. Betty Witherspoon earned three degrees in total, including a Ph.D in education. She became a professor of nursing[7] at Vanderbilt University.[8] Witherspoon has claimed descent from Scottish-born John Witherspoon, who signed the United States Declaration of Independence;[9][10] however, this claim has not been verified by the Society of the Descendants of the Signers of the Declaration of Independence genealogists.[11] Her parents are still legally married, although they separated in 1996.[12]\n\nWitherspoon was raised as an Episcopalian, and has said she is proud of the \"definitive Southern upbringing\" which she received. She said that it gave her \"a sense of family and tradition\" and taught her about \"being conscientious about people's feelings, being polite, being responsible and never taking for granted what you have in your life\".[13][14][15] At the age of seven, Witherspoon was selected as a model for a florist's television advertisements, which motivated her to take acting lessons.[16] At age eleven, she took first place in the Ten-State Talent Fair.[16] Witherspoon received high grades in school,[16] loved reading, and considered herself \"a big dork who read loads of books\".[3] On mentioning her love for books, she said, \"I get crazy in a bookstore. It makes my heart beat hard because I want to buy everything.\"[17] She has been described as a \"multi-achiever\" and was given the nickname \"Little Type A\" by her parents.[18][19] Witherspoon attended middle school at Harding Academy and graduated from the all-girls' Harpeth Hall School in Nashville, during which time she was a cheerleader.[20][13] She later attended Stanford University as an English literature major,[21] but left the school prior to completing her studies to pursue an acting career.[13]\n\nActing career\n\nWitherspoon has cited actresses Jodie Foster, Meryl Streep, Holly Hunter, Susan Sarandon, Frances McDormand, Debra Winger, Diane Ladd, Julia Roberts, Nicole Kidman, Jennifer Aniston, Goldie Hawn, Sally Field, Sigourney Weaver, Lucille Ball, Carole Lombard, Judy Holliday, Gena Rowlands, and actors Tom Hanks, Jack Nicholson, and Michael Keaton as influences on her acting.[16][17][22][23][24][25] Her favorite films are Splendor in the Grass, Waiting for Guffman, Broadcast News, Raising Arizona, and Overboard.[23][26][27][28]\n\n1991–1998: Career beginnings\n\nIn 1991, Witherspoon attended an open casting call for The Man in the Moon, intending to audition as a bit player;[13] she was instead cast for the lead role of Dani Trant, a 14-year-old country girl who falls in love for the first time with her 17-year-old neighbor. According to The Guardian, her performance made an early impression.[29] On her performance, Roger Ebert commented, \"Her first kiss is one of the most perfect little scenes I've ever seen in a movie.\"[16] For this role, Witherspoon was nominated for the Young Artist Award Best Young Actress.[30] Later that year, she made her television debut role in Wildflower with Patricia Arquette.[4][9] In 1992, Witherspoon appeared in the TV movie Desperate Choices: To Save My Child, portraying a critically ill young girl.[4]\n\nIn 1993, she played a young wife in the CBS miniseries Return to Lonesome Dove, Nonnie Parker in the Disney film A Far Off Place and had a minor role in Jack the Bear, which garnered her the Young Artist Award for Best Youth Actress Co-star.[4][31] The next year, Witherspoon had another leading role as Wendy Pfister in the 1994 film S.F.W., directed by Jefery Levy.[32] In 1996, Witherspoon starred in two major films: the thriller Fear alongside Mark Wahlberg,[33][34] as Nicole Walker, a teenage girl who starts dating a man with obsessive tendencies, and the black-comedy thriller Freeway, alongside Kiefer Sutherland and Brooke Shields, where she held the lead role.[35] Her character in Freeway, Vanessa Lutz, is a poor girl living in Los Angeles, who encounters a serial killer on the way to her grandmother's home in Stockton.[13] The film received positive reviews from the press. Among them was the San Francisco Chronicle, with Mick LaSalle commenting, \"Witherspoon, who does a Texas accent, is dazzling, utterly believable in one extreme situation after the other.\"[36] Witherspoon's performance won her the Best Actress Award at the Cognac Police Film Festival and helped establish her as a rising star.[13][37] The making of the film also gave Witherspoon significant acting experience; as she said, \"Once I overcame the hurdle of that movie – which scared me to death – I felt like I could try anything.\"[21]\n\nIn 1998, Witherspoon had major roles in three movies: Overnight Delivery, Pleasantville and Twilight.[9][38] In Pleasantville, she starred with Tobey Maguire in a tale about 1990s teenage siblings who are magically transported into the setting of a 1950s television series. She portrayed Jennifer, the sister of Maguire's character who is mainly concerned about appearances, relationships and popularity. Her performance received good reviews and garnered her the Young Hollywood Award for Best Female Breakthrough Performance.[39] Director Gary Ross applauded her efforts saying, \"she commits to a character so completely and she understands comedy\".[21]\n\n1999–2000: Breakthrough and rise to prominence\n\nIn 1999, Witherspoon starred alongside Alessandro Nivola in the drama thriller Best Laid Plans; she played Lissa, a woman who schemes with her lover Nick to escape a small dead-end town.[4] Also that year co-starred with Sarah Michelle Gellar and Ryan Phillippe in the drama film Cruel Intentions, a modern take on the 18th-century French novel Les Liaisons Dangereuses. The San Francisco Chronicle praised her performance as Annette Hargrove: \"Witherspoon is especially good in the least flashy role, and even when called upon to make a series of cute devilish faces, she pulls it off.\"[40] She also appeared in a music video by Marcy Playground for the film's soundtrack. The film became a box office success and a cult classic.\n\nNext came perhaps Witherspoon's career-defining role: starring with Matthew Broderick in Election, based on Tom Perrotta's novel;[4] for her portrayal of Tracy Flick, she received vast critical acclaim and won the Best Actress Award from the National Society of Film Critics and the Online Film Critics Society, a first Golden Globe nomination and an Independent Spirit Award nomination.[41][42] Witherspoon also received a rank on the list of 100 Greatest Film Performances of All Time by Premiere.[43] Director Alexander Payne said of her, \"She's got that quality that men find attractive, while women would like to be her friend. But that's just the foundation. Nobody else is as funny or brings such charm to things. She can do anything.\"[14]\n\nIn spite of her success with Election, Witherspoon noted in an interview that she struggled to find work after completing the film due to typecasting.[44] Analyzing the reasons behind her difficulty to find work, Witherspoon commented, \"I think because the character I played was so extreme and sort of shrewish—people thought that was who I was, rather than me going in and creating a part. I would audition for things and I'd always be the second choice—studios never wanted to hire me and I wasn't losing the parts to big box office actresses but to ones who I guess people felt differently about.\"[5] In 2000, Witherspoon played a supporting role in American Psycho as Patrick Bateman's trophy girlfriend, and made a cameo appearance in Little Nicky as the mother of the Antichrist.[38] She also guest starred in season six of Friends as Rachel Green's sister Jill.[45]\n\n2001–2006: Worldwide recognition\n\nThe 2001 film Legally Blonde marked a turning point in Witherspoon's career; she starred as Elle Woods, a fashion-merchandising major who decides to become a law student in order to follow her ex-boyfriend to Harvard Law School. Witherspoon said about the role, \"When I read Legally Blonde, I was like, 'She's from Beverly Hills, she's rich, she's in a sorority. She has a great boyfriend. Oh yeah, she gets dumped. Who cares? I still hate her.' So we had to make sure she was the kind of person you just can't hate.\"[14] Legally Blonde was a box-office hit, grossing US$96 million domestically.[46] Witherspoon's performance earned her praise from critics as the press began referring to her as \"the new Meg Ryan\".[47] Roger Ebert commented, \"Witherspoon effortlessly animated this material with sunshine and quick wit\",[48] and Salon.com noted that \"she [Witherspoon] delineates Elle's character beautifully\".[49] Meanwhile, the Seattle Post-Intelligencer concluded, \"Witherspoon is a talented comedian who can perk up a scene just by marching in full of pep and drive and she powers this modest little comedy almost single-handedly.\"[50] For her work, Witherspoon garnered her second Golden Globe Best Actress nomination and an MTV Movie Award for Best Comedic Performance.\n\nIn 2002, after the success of Legally Blonde, Witherspoon starred in several roles, such as Greta Wolfcastle in The Simpsons episode \"The Bart Wants What It Wants\", and as Cecily in the comedy The Importance of Being Earnest, a film adaptation of Oscar Wilde's play in which she received a Teen Choice Award nomination.[51][52] Later that year, she starred with Josh Lucas and Patrick Dempsey in Andy Tennant's film Sweet Home Alabama, where she played Melanie Carmichael, a young fashion designer who intends to marry a New York politician but must return to Alabama to divorce her childhood sweetheart, from whom she has been separated for seven years. Witherspoon regarded this as a \"personal role\" in that it reminded her of experiences she had when she moved from her hometown Nashville to Los Angeles.[53] The movie became Witherspoon's biggest live-action box office hit, earning over $35 million in the opening weekend and grossing over $127 million in the U.S.[46][54] Despite the commercial success, critics gave Sweet Home Alabama negative reviews. It was called \"a romantic comedy so rote, dull and predictable\" by The Miami Herald,[55] and the press widely agreed that Witherspoon was the only reason the movie attracted such a large audience.[56][57] When describing Witherspoon's role in the movie, The Christian Science Monitor concluded, \"She is not the movie's main attraction, she is its only attraction.\"[58]\n\nIn 2003, Witherspoon followed up the success of Legally Blonde by starring in the sequel Legally Blonde 2: Red, White & Blonde. Elle Woods has become a Harvard-educated lawyer who is determined to protect animals from cosmetics industry science tests. The sequel was not as financially successful as the first film and it generated mostly negative reviews. USA Today considered the movie \"plodding, unfunny and almost cringe-worthy\", but also noted that \"Reese Witherspoon still does a fine job portraying the fair-haired lovable brainiac, but her top-notch comic timing is wasted on the humorless dialogue.\"[59] Meanwhile, Salon.com concluded that the sequel \"calcifies everything that was enjoyable about the first movie\".[60] Despite being panned by critics, the sequel took in over $39 million in its first five days in the U.S. box office charts and eventually grossed $90 million in the US.[61] Witherspoon received a $15 million paycheck for the role—a starting point to make her consistently one of Hollywood's highest-paid actresses from 2002 until 2010.[14][62]\n\nIn 2004, Witherspoon starred in Vanity Fair, adapted from the 19th-century classic novel Vanity Fair and directed by Mira Nair. Her character, Becky Sharp, is a poor woman with a ruthless determination to find fortune and establish herself a position in society. Witherspoon was carefully costumed to conceal that during the filming she was pregnant with her second child.[63] This pregnancy was not a hindrance to her work as Witherspoon believed the gestation had in fact helped her portrayal of Sharp's character: \"I love the luminosity that pregnancy brings, I love the fleshiness, I love the ample bosom—it gave me much more to play with\", she said.[64][65] The film and Witherspoon's portrayal of Sharp received mixed reviews, as The Hollywood Reporter wrote, \"Nair's cast is splendid. Witherspoon does justice to the juicy role by giving the part more buoyancy than naughtiness.\"[66] At the same time, The Charlotte Observer called her work \"an excellent performance that's soft around the edges\" and the Los Angeles Times concluded that Becky is \"a role Reese Witherspoon was born to play\".[67][68] However, LA Weekly wrote \"[Witherspoon] ends up conveying so little of what's at once appalling and perversely attractive about the would-be mistress of Vanity Fair\" and states that it may have to do with Witherspoon's vanity, \"with an Oscar-less young star's need to be loved more than anyone could conceivably love the \"real\" Becky Sharp.\".[69] Others have stated she was miscast.[70]\n\nIn late 2004, Witherspoon began working alongside Mark Ruffalo on the romantic comedy Just Like Heaven. Her character, Elizabeth Masterson, is an ambitious young doctor who gets into a car accident on her way to a blind date and is left in a coma; her spirit returns to her old apartment where she later finds true love.[71]\n\nEarlier that year Witherspoon was chosen to portray June Carter Cash, the second wife of country music singer-songwriter Johnny Cash (Joaquin Phoenix), in Walk the Line. She never had the chance to meet Carter Cash, as Witherspoon was filming Vanity Fair at the time the singer died.[5] Witherspoon performed her own vocals in the film and her songs had to be performed in front of a live audience, she was so worried about needing to perform live that she asked her lawyer to terminate the film contract.[72] \"That was the most challenging part of the role,\" she later recalled in an interview. \"I'd never sung professionally.\"[73] Subsequently, she had to spend six months learning how to sing for the role, including from the help of vocal coach Roger Love.[72][74][75] Witherspoon's portrayal of Carter Cash was well received by critics, and Roger Ebert wrote that her performance added \"boundless energy\" to the movie.[76] She won several awards for her performance, including the Golden Globe Award, the Screen Actors Guild, the BAFTA and the Academy Award for Best Actress in a Lead Role. Besides critical success in the movie industry, Witherspoon and Phoenix received a nomination for \"collaborative video of the year\" from the CMT Music Awards.[77][78] Witherspoon expressed her passion for the movie: \"I really like in this film that it is realistic and portrays sort of a real marriage, a real relationship where there are forbidden thoughts and fallibility. And it is about compassion in the long haul, not just the short easy solutions to problems.\"[79] She also stated that she believed Carter Cash was a woman ahead of her time: \"I think the really remarkable thing about her character is that she did all of these things that we sort of see as normal things in the 1950s when it wasn't really acceptable for a woman to be married and divorced twice and have two different children by two different husbands and travel around in a car full of very famous musicians all by herself. She didn't try to comply to social convention, so I think that makes her a very modern woman.\"[79]\n\nWitherspoon's first post-Oscar role came in the modern-day fairy tale Penelope, as Annie, the best friend of Penelope (Christina Ricci), a girl who has a curse in her family. The film was produced by her company Type A Films, with filming commencing in March 2006, immediately following Witherspoon's Oscar win for Walk the Line.[80] Although the movie premiered at the 2006 Toronto International Film Festival,[72][81] the final release date of Penelope was delayed twice before an eventual February 2008 release.[82][83]\n\n2007–2012: Career decline\n\nFollowing her critical success with Walk the Line, Witherspoon admits to spending several years \"kind of floundering career-wise\". Reflecting on this period of time in a December 2014 interview, Witherspoon attributed it to her separation from her first husband in October 2006 and their subsequent divorce, stating that she spent \"a few years just trying to feel better. You know, you can't really be very creative when you feel like your brain is scrambled eggs.\" She claims that she \"wasn't making things I was passionate about. I was just kind of working, you know. And it was really clear that audiences weren't responding to anything I was putting out there.\"[84]\n\nThis period of Witherspoon's career began with the filming of the abduction thriller Rendition in November 2006. In the film, she plays Isabella El-Ibrahim, the pregnant wife of a bombing suspect. The film was released in October 2007 and marked Witherspoon's first appearance in theaters since the 2005 release of Walk the Line.[85] The movie received mostly mixed reviews and was generally considered a disappointment at the Toronto International Film Festival.[86] Witherspoon's performance was also criticized: \"Reese Witherspoon is surprisingly lifeless\", Claudia Puig of USA Today wrote. \"She customarily injects energy and spirit into her parts, but here, her performance feels tamped down.\"[87]\n\nWitherspoon was also the announcer of the Playhouse Disney block on Disney Channel, from March 31, 2007 to February 14, 2011.\n\nIn December 2007, Witherspoon began working with Vince Vaughn, filming the holiday comedy Four Christmases, a story about a couple who must spend their Christmas Day trying to visit all four of their divorced parents.[88] The film was released in November 2008. Despite being panned by critics, the movie became a box office success, earning more than $120 million domestically and $157 million worldwide.[89] In 2009, Witherspoon voiced Susan Murphy, lead character in DreamWorks' computer-animated film Monsters vs. Aliens, released in March 2009, becoming her biggest hit at the time.[90] She also co-produced the Legally Blonde spin-off Legally Blondes, starring Milly and Becky Rosso.[91]\n\nWater for Elephants in May 2011 Witherspoon at the premiere ofin May 2011\n\nHowever, Witherspoon did not appear in a live-action film for two years after the 2008 release of Four Christmases. She told Entertainment Weekly that the \"break\" was unplanned, stating that, \"I just didn't read anything I liked... There are a lot of really, really, really big movies about robots and things—and there's not a part for a 34-year-old woman in a robot movie.\"[92] Witherspoon returned with three films released in 2010, 2011 and 2012, all centered on her as a woman caught in a love triangle between two men. In a 2012 interview with MTV, Witherspoon jokingly referred to this trio of films as her \"love triangle period\".[93]\n\nThe first film was James L. Brooks' romantic comedy How Do You Know[94][95][96] which starred Witherspoon as a former national softball player who struggles to choose between a baseball-star boyfriend (Owen Wilson) and a business executive being investigated for white-collar crime (Paul Rudd). The movie was filmed in Philadelphia and Washington, D.C. during the summer and fall of 2009[97][98][99] and released on December 17, 2010. The movie was both a critical and box office failure. Despite a budget of more than $100 million the film earned only $7.6 million in its opening weekend, leading the Los Angeles Times to call it \"one of the year's biggest flops\".[100] The movie earned mainly negative reviews from critics, scoring 35% on Rotten Tomatoes with 111 reviews as of late December 2010.[101]\n\nWitherspoon's second love-triangle movie was the film adaptation of the 1930s circus drama Water for Elephants. She began circus training in March 2010 for her role as Marlena, a glamorous performer stuck in a marriage to a volatile husband (Christoph Waltz) but intrigued by the circus' new veterinarian (Robert Pattinson).[102] The movie was filmed between late May and early August 2010[103][104] in various locations in Tennessee, Georgia, and California. It was released on April 22, 2011[105] and received mixed critical reviews.[106]\n\nIn September 2010, Witherspoon began principal photography in Vancouver for the third and final love-triangle film, This Means War, a 20th Century Fox spy comedy directed by McG in which Witherspoon's character is at the center of a battle between best friends (played by Chris Pine and Tom Hardy) who are both in love with her. The film had a \"sneak-peek\" release on Valentine's Day, before fully opening on February 17, 2012.[107][108][109][110][111] The film was panned by critics (with a 25% Rotten Tomatoes rating),[112] and fared poorly at the box office, taking fifth place on its opening weekend with sales of $17.6 million. The New York Times remarked that this \"extended the box office cold streak for the Oscar-winning Ms. Witherspoon\".[113]\n\n2013–2016: Resurgence and professional expansion\n\nWitherspoon's subsequent films signaled a departure from the love-triangle theme. In September 2011, a year after beginning work on This Means War, she filmed a small role in Jeff Nichols's coming-of-age drama Mud in Arkansas, playing Juniper, the former girlfriend of a fugitive (Matthew McConaughey), who enlists two local boys to help him evade capture and rekindle his romance with her.[114][115] Mud premiered in May 2012 in competition for the Palme d'Or at the Cannes Film Festival, but did not win.[116][117] Following its American debut at the Sundance Film Festival on January 19, 2013,[118] the film had a limited release in select North American theaters on April 26, 2013.[119][120]\n\nWitherspoon next starred in Devil's Knot, which was directed by Atom Egoyan, and based on the true crime book of the same name, examining the controversial case of the West Memphis Three. Like Mud, the film is set in Arkansas. Witherspoon played Pam Hobbs, the mother of one of three young murder victims. In an interview subsequent to her casting in the film, Egoyan noted that although the role requires \"an emotionally loaded journey,\" he \"met with Reese, and... talked at length about the project, and she's eager to take on the challenge.\"[121] The movie was shot in Georgia in June and July 2012.[122][123][124] Witherspoon was pregnant with her third child during filming.[125][126] The film's world premiere was held on September 8, 2013 at the Toronto International Film Festival.[127][128] It was then released in selected American theaters on May 9, 2014.[129]\n\nIn April 2013, Witherspoon began production in Atlanta on Canadian director Philippe Falardeau's film The Good Lie. It is based on real-life events, about a brash American woman assigned to help four young Sudanese refugees (known as Lost Boys of Sudan) who win a lottery for relocation to the U.S.[130][131] It was released on October 3, 2014.[132]\n\nWitherspoon shot a small role in Inherent Vice (2014), an adaptation of Thomas Pynchon's novel, in Pasadena, California in summer 2013.[133][134]\n\nIn 2012, Witherspoon started the production company Pacific Standard. The goal of the company was to produce movies with strong female lead roles, as she said that she was tired of seeing only movies with a strictly male focus being produced. Through the company, Witherspoon served as a producer in the film adaptation of Gillian Flynn's novel Gone Girl,[135] though she did not star.[136][137] Indeed, Witherspoon and her producing partner \"had little to do with the production of Gone Girl\",[138] leaving it to director David Fincher while focusing their efforts on another adaptation produced via Pacific Standard, that of Cheryl Strayed's memoir Wild, which began production in fall 2013 on the same day as Gone Girl.[139] Witherspoon starred in the project, portraying Strayed herself on her 1,000-mile (1,600 km) hike along the Pacific Crest Trail.[140] Wild was released in December 2014 to critical acclaim;[141] Michael Phillips of Chicago Tribune wrote in his review, \"Witherspoon does the least acting of her career, and it works. Calmly yet restlessly, she brings to life Strayed's longings, her states of grief and desire and her wary optimism.\"[142] Wild was promoted as Witherspoon's primary \"comeback\" vehicle following her previous career slump,[143][144] and she earned her second Academy Award nomination for the role.[145]\n\nIn May 2014, Witherspoon began production in Louisiana on Hot Pursuit, a comedy in which she plays a police officer trying to protect a drug lord's widow (Sofía Vergara).[146] The movie was released on May 8, 2015.[147] In 2016, she had a voice role in the animated film Sing, as well as serving as a major performer on the film's soundtrack. The movie became Witherspoon's biggest hit, being the first to make over $200 million domestically and $600 million worldwide.[148]\n\n2017–present: Success with television ventures\n\nIn January 2016, Witherspoon began filming her first television project since Return To Lonesome Dove, the seven-part miniseries adaptation of the Liane Moriarty bestseller, Big Little Lies. She produced the miniseries, along with her co-star, Nicole Kidman, and the show's director, Jean-Marc Vallée, her second project under his direction. The series premiered on February 19, 2017 on HBO and finished on April 2.[149][150] Witherspoon has garnered critical acclaim for her performance, with TV Line proclaiming her as \"Performer of the Week\" of February 26 to March 4. The Washington Post compared her performance to her previous work in Election and Legally Blonde.[151][152]\n\nIn November 2016, Witherspoon began production on the romantic comedy Home Again, the directorial debut of filmmaker Nancy Meyers' daughter, Hallie Meyers-Shyer, which was released on September 8, 2017.[153] A few months later, she began filming Disney's A Wrinkle in Time, the film adaptation of Madeleine L'Engle's classic novel of the same name, where she plays Mrs. Whatsit. The film was released in March 2018, co-stars Oprah Winfrey and Mindy Kaling, and is directed by Ava DuVernay.[154]\n\nIn July 2018, Witherspoon began hosting the talk show Shine On with Reese on DirecTV. The show is a one-on-one interview between Witherspoon and a female guest focussing on how the guest achieved her dreams. Like Big Little Lies, the show is produced by her production company Hello Sunshine. The show marks Witherspoon's first unscripted role in television.[155] In December 2017, HBO renewed Big Little Lies for a second season making the series a regular drama series series instead of a miniseries. The second season adds Meryl Streep to the main cast and premiered in June 2019.[156]\n\nWitherspoon currently produces and stars in the Apple TV+ drama series The Morning Show alongside Jennifer Aniston and Steve Carell.[157] The Morning Show has received a two-season order from Apple with the first season premiering in November 2019.[158] Witherspoon was nominated for a Golden Globe Award for Best Actress – Television Series Drama and a Golden Globe Award for Best Television Series – Drama for her work in the series.[159] Season two of The Morning Show is set to premiere later in 2020.[160] Witherspoon also serves as an executive producer on the Apple TV+ drama series Truth Be Told starring Octavia Spencer which premiered in December 2019 and was renewed for a second season in March 2020.[161][162][163]\n\nFurthermore, Witherspoon currently stars and serves as an executive producer on the Hulu drama miniseries Little Fires Everywhere opposite Kerry Washington, the televised adaption of Celeste Ng's 2017 novel of the same name.[164][165]\n\nUpcoming projects\n\nIn addition to starring and producing television shows for her own, Witherspoon will serve as executive producer on six television series all at six different networks including Apple TV+, Hulu, Amazon Prime Video, ABC, Starz and Netflix. Witherspoon will only star in Hulu's Little Fires Everywhere and will serve as an executive producer on all six shows.[166][167][168][169][170][171][172]\n\nWitherspoon is also attached as a producer on three films including A White Lie set to star Zendaya for TriStar Pictures, a documentary about Martina Navratilova, and Pyros a sci-fi drama for Netflix directing by Simon Kinberg. Witherspoon is also set to star in Pyros. [173][174][175]\n\nOther ventures\n\nProduction work\n\nWitherspoon owned a production company called Type A Films, which the media believed was a moniker honoring her childhood nickname \"Little Miss Type A\".[18][176] However, when asked about the company by Interview magazine, she clarified the name's origin: \"... people think I named it after myself... It was actually an in-joke with my family because at [age] 7 I understood complicated medical terms, such as the difference between type A and type B personalities. But I just wished I'd named the company Dogfood Films or Fork or something. You carry that baggage all your life.\"[5] In March 2012, Witherspoon merged Type A Films with producer Bruna Papandrea's Make Movies banner to create a new production company entitled Pacific Standard.[177] In 2016, Witherspoon and Papandrea split up, with Witherspoon gaining full control over the company.[178]\n\nIn November 2016, Witherspoon and Otter Media formed Hello Sunshine, a joint venture focused on telling female-driven stories on film, TV and digital platforms.[179] Pacific Standard has become a subsidiary of Hello Sunshine.\n\nOther activities\n\nFrom 2007 to 2011, Witherspoon was the announcer of Playhouse Disney and was featured in various promos, bumpers and commercials.\n\nIn 2013, Witherspoon recorded a cover of the classic Frank Sinatra and Nancy Sinatra duet, \"Somethin' Stupid\" with Michael Bublé for his 2013 album, To Be Loved.[180]\n\nIn May 2015, Witherspoon launched Draper James, a retail brand with a focus on fashion, accessories and home décor inspired by the American South. The brand is named after Witherspoon's grandparents, Dorothea Draper and William James Witherspoon, who are said to be her greatest influences. Some of the products are being manufactured and designed in-house, and the brand launched direct to consumers online before opening its first brick and mortar store in fall 2015 in Witherspoon's hometown of Nashville, Tennessee.[181]\n\nIn October 2016, Witherspoon announced that she would be writing her first book.[182] In April 2018, Witherspoon announced her first book Whiskey in a Teacup. The book is a lifestyle book inspired by Witherspoon's southern upbringing and was released on September 18, 2018.[183]\n\nIn March 2017, Witherspoon became the storyteller-in-chief for Elizabeth Arden, Inc.. There, she will be helping the company to shape the brand's narrative through advertising campaigns and marketing programs. Of her involvement, Witherspoon states that she is \"excited to work as a creative partner alongside the Elizabeth Arden team, producing content that celebrates the spirit of the brand, highlighting female-centric stories that illustrate women's true life experiences which unite us all\".[184]\n\nIn 2018, Witherspoon joined approximately 300 other actresses, agents, writers and other entertainment employees in creating the Time's Up initiative, which seeks to counteract sexual harassment in the workplace.[185]\n\nPhilanthropy\n\nWitherspoon is actively involved in children's and women's advocacy organizations. She is a longtime supporter of Save the Children, an organization that helps provide children around the world with education, health care and emergency aid.[186] She also serves on the board of the Children's Defense Fund, a child advocacy and research group.[186] In 2006, she was among a group of actresses who went to New Orleans, Louisiana in a CDF project to publicize the needs of Hurricane Katrina victims.[187] During this trip, she helped open the city's first Freedom School, as she met and talked with the children.[188] Witherspoon later called this an experience that she would never forget.[188]\n\nIn 2007, Witherspoon made her first move into the world of endorsements, as she signed a multi-year agreement to serve as the first Global Ambassador of cosmetic company Avon Products.[186][189] She acts as a spokeswoman for Avon's cosmetic products and serves as the honorary chair of the Avon Foundation, a charitable organization that supports women and focuses on breast cancer research and the prevention of domestic violence.[190][191] Witherspoon is also committed to participating in cosmetics product development and appearing in commercial advertisements.[190] Explaining her motives for joining the foundation, she said, \"As a woman and a mother I care deeply about the well being of other women and children throughout the world and through the years, I have always looked for opportunities to make a difference.\"[190]\n\nIn 2020, amidst the corona virus pandemic, Witherspoon announced the \"Draper James Loves Teachers\" initiative, offering free dresses from the clothing collection to teachers.[192]\n\nPersonal life\n\nWitherspoon met actor Ryan Phillippe at her 21st birthday party in March 1997.[193] They became engaged in December 1998[194] and married near Charleston, South Carolina, on June 5, 1999, at Old Wide Awake Plantation.[195][196][197] They have two children together, a daughter, Ava Elizabeth Phillippe, born on September 9, 1999,[198][199] and a son, Deacon Reese Phillippe, born in October 2003.[195] In October 2006, Witherspoon and Phillippe announced their separation.[200]\n\nIn early February 2010, it was reported that Witherspoon was dating Jim Toth,[201][202][203] a talent agent and co-head of motion picture talent at Creative Artists Agency, where Witherspoon is a client.[204] Witherspoon and Toth announced their engagement in December 2010,[205] and married on March 26, 2011, in Ojai, California, at Libbey Ranch,[206] Witherspoon's country estate, which she later sold.[207][208] The couple have a son together, Tennessee James, who was born in September 2012.[209]\n\nIn 2013, Witherspoon was arrested and charged with disorderly conduct after her husband was pulled over for suspicion of drunk driving. She later pleaded no contest to obstruction and was required to pay court costs.[210]\n\nIn the media\n\nWalk the Line in 2005 Witherspoon being interviewed at the premiere ofin 2005\n\nWitherspoon hosted Saturday Night Live on September 29, 2001, the first episode to air after the September 11 attacks.[211] In 2005, she was ranked No. 5 in Teen People magazine's list of most powerful young Hollywood actors.[212] In 2006, Witherspoon was listed among the Time 100.[213] Her featured article was written by Luke Wilson.[214] In the same year, she was selected as one of the \"100 Sexiest Women In The World\" by the readers of FHM.[215] Witherspoon has been featured four times in the annual \"100 Most Beautiful\" issues of People magazine.[216] Witherspoon has appeared on the annual Celebrity 100 list by Forbes magazine in 2006 and 2007, at No. 75 and No. 80, respectively.[217][218] Forbes also put her on the top ten Trustworthy Celebrities list.[219] She was listed among CEOWorld Magazine's Top Accomplished Women Entertainers.[220]\n\nIn 2007, she was selected by People and the entertainment news program Access Hollywood as one of the year's best-dressed female stars. She was also the announcer of the Playhouse Disney block on Disney Channel from 2007 to 2011.[221][222] The yellow dress she wore to that year's Golden Globe Awards was widely acclaimed.[223] A study conducted by E-Poll Market Research showed that Witherspoon was the most likable female celebrity of 2007.[224] That same year, Witherspoon established herself as the highest-paid actress in the American film industry, earning $15 to $20 million per film.[225][226] In recent years, however, her appearance in a number of movies that fared badly at the box office caused a turnabout in her status, and she has been noted as one of the most overpaid actors in Hollywood in 2011, 2012 and 2013.[227][228][229] In April 2011, Witherspoon ranked 3rd on the 22nd annual People's Most Beautiful issue.[230] In 2010, Witherspoon received a star on the Hollywood Walk of Fame at 6262 Hollywood Blvd.[231]\n\nIn June 2013, Witherspoon filed suit against Marketing Advantages International Inc., claiming it used her name and image extensively in jewelry advertising without her permission, both throughout the United States and internationally. In December 2015, while Witherspoon's trademark claims to her name were rejected, for she had not established secondary meaning to her full name, that she did not claim \"emotional distress\" and the \"photos and facts were generally known by the public and the photos were taken in public with Plaintiff's consent\", the court ruled that she could proceed with her right of publicity claims against a number of defendants.[232][233][234] Two months later, Witherspoon withdrew her lawsuit, having \"come to private agreements with the various defendants, including Centerbrook Sales, Fragrance Hut, Gemvara, and others\".[235] In the wake of the Harvey Weinstein sexual abuse allegations, Witherspoon revealed that she had been sexually assaulted by a director at the age of 16 and has had \"multiple experiences of harassment and sexual assault\" throughout her career.[236]\n\nIn 2015, Witherspoon made her second appearance among the Time 100, with her featured article being written by Mindy Kaling.[237] The same year, she was awarded, by a unanimous vote from the committee, the American Cinematheque for being \"a perfect example of an actress flourishing in today's world\" and \"an active and successful movie producer who is moving her career forward both behind and in front of the camera\".[238][239][240] According to an article published by Forbes in 2017, Witherspoon is said to have $198 million-plus career earnings, which made her the top-paid primetime Emmy nominee that year.[241] In 2019, Forbes listed her among the World's 100 Most Powerful Women.[242]\n\nWorks and publications\n\nWitherspoon, Reese (2018). Whiskey in a Teacup. Touchstone. ISBN 978-1501166273 .\n\nAccolades\n\nWitherspoon has won numerous awards, including the BAFTA Award and the Oscar for Best Actress for her performance in Walk the Line in 2005.[77] In 2015, she received another nomination in the category for her performance in Wild.[243]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Reese_Witherspoon2_2005.jpg/220px-Reese_Witherspoon2_2005.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/220px-Reese_Witherspoon_at_TIFF_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Reese_Witherspoon_2011%2C_2.jpg/170px-Reese_Witherspoon_2011%2C_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Reese_Witherspoon_Cannes_2012.jpg/170px-Reese_Witherspoon_Cannes_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Reese_Witherspoon_2005.jpg/170px-Reese_Witherspoon_2005.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Reese_Witherspoon_2012.jpg/170px-Reese_Witherspoon_2012.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/1200px-Reese_Witherspoon_at_TIFF_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/1200px-Reese_Witherspoon_at_TIFF_2014.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Reese_Witherspoon", "title": "Reese Witherspoon", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/1200px-Reese_Witherspoon_at_TIFF_2014.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}