{"url": "https://www.romper.com/p/cardi-b-showed-ellen-degeneres-how-she-got-pregnant-the-results-are-hilarious-8857802", "text": "Cardi B is killing it right now. Her new album, Invasion of Privacy, is topping the charts, her songs are insanely popular, and she had a knockout performance at the music festival, Coachella, last weekend. Not to mention, on top of all of this, Cardi B has done all of this while being pregnant. All of the current love surrounding Cardi B has fans dying to know more about her pregnancy. But in case fans were wondering how she ended up with a baby in her belly, during a recent appearance on The Ellen Show, Cardi B showed Ellen DeGeneres how she got pregnant and the results could not be any more hilarious.\n\nIt's probably a fact that most Cardi B fans know the answer to the question \"Where do babies come from?\" and are typically the ones being asked that question by younger generations. But people are always curious about the lives of their favorite celebrities — and although the answer to the question might be obvious, inquisitive minds might want to know how Cardi B got pregnant, like DeGeneres herself.\n\nAfter performing at Coachella last weekend, Cardi B put on an impressive show, which fans got to see in person and on the Coachella YouTube livestream. While Cardi B's \"suggestive\" dance moves during her set were hardly shocking, according to E! News, the rapper joked with DeGeneres that they were the reason behind her soon to be new addition with her fiancé, rapper Offset. \"I was just trying to show the world how I got pregnant,\" Cardi B said. \"Like that! Like that! That's how it happened.\"\n\nWatching a video from her Coachella set last weekend gives you a good idea about what she was referring to when she told DeGeneres that her dancing got her pregnant.\n\nChad on YouTube\n\nSure, her dance moves might have contributed to her pregnancy but watching her Coachella performance isn't a look behind Cardi B's closed doors with Offset. Still, her performance is worth watching, if only to see how powerful Cardi B is at this stage in her pregnancy. Cardi B has confirmed that she is due in July, according to People, which almost puts her in her third trimester.\n\nCardi B is going to do this kind of dancing all over again on Sunday, during her repeat performance during Coachella weekend two. And this time, Cardi B is hoping that her dance moves will help speed the baby's arrival along. Cardi B said, during her appearance on The Ellen Show, according to E! News:\n\nThey say the more you move, the easier it will come out. You know what I'm sayin'? And I'm like, \"Come out fast!\"\n\nKevin Winter/Getty Images Entertainment/Getty Images\n\nCardi B is a little right on that one. There is no scientific backing to prove that dancing or eating spicy foods will help the baby come out faster, according to Women's Health, but research has shown that physical activity was a common labor trigger amongst the majority women who were surveyed in one 2014 study — and dancing is considered to be physical activity. But unfortunately for Cardi B, it's likely that her upcoming performances will cause her baby to come out sooner than her due date.\n\nStill, that means she will have plenty of time to enjoy her pregnancy before the baby's arrival — including enjoying those pregnancy cravings. During her appearance on The Ellen Show, Cardi B told DeGeneres that she does indeed have pregnancy cravings, although \"everything depends\" on how she's feeling. \"Like, this whole week I've been eating ice cream, ice cream, ice cream,\" Cardi B said, according to E! News. \"And then, like, I I like, everything lemon-ish.\"\n\nFrom her cravings to her dance moves, it is clear that Cardi B's pregnancy isn't getting in the way of her doing anything — including performing at Coachella.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/2b4b42d3-4475-4d32-af08-89bbe2575aa3-getty-1200433192.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/4/20/c3946494-fb56-4ae9-99b9-6bdbd797a5bd-getty-946717560.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/6/15155e54-1e2c-439c-870e-2ae9587ae2e8-getty-1169525359.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.romper.com/uploads/getty/2018/4/20/70ac5df3-b998-4f8a-9af9-25416f5a75fc-getty-946746094.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/4/20/c3946494-fb56-4ae9-99b9-6bdbd797a5bd-getty-946717560.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/20/c3946494-fb56-4ae9-99b9-6bdbd797a5bd-getty-946717560.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/cardi-b-showed-ellen-degeneres-how-she-got-pregnant-the-results-are-hilarious-8857802", "title": "Cardi B Showed Ellen DeGeneres How She Got Pregnant & The Results Are Hilarious", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/cardi-b-showed-ellen-degeneres-how-she-got-pregnant-the-results-are-hilarious-8857802", "type": "article", "title": "Cardi B Showed Ellen DeGeneres How She Got Pregnant & It's Hilarious", "description": "Cardi B is killing it right now. Her new album, Invasion of Privacy, is topping the charts, her songs are insanely popular, and she had a knockout performance at the music festival, Coachella, last weekend. Not to mention, on top of all of this,…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/20/c3946494-fb56-4ae9-99b9-6bdbd797a5bd-getty-946717560.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "Cardi B is killing it right now. Her new album, Invasion of Privacy, is topping the charts, her songs are insanely popular, and she had a knockout performance at the music festival, Coachella, last weekend. Not to mention, on top of all of this,…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}