{"url": "http://www.madeformums.com/news-and-gossip/whitney-port-pregnancy-body-struggle/42869.html", "text": "Being pregnant is, of course, a blessing disguised as a growing bump ?\n\nAdvertisement\n\nBut that’s not to say it’s always an easy thing to go through. There are challenges – some are physical, some are emotional, and some are a little bit of everything.\n\nFormer The Hills star Whitney Port, currently in her 3rd trimester, knows all too well that there are tribulations to tackle when it comes to expecting.\n\nFor her, a lot of it’s do with her body image, and how “uncomfortable” she feels with her changing body, and how that’s left her feeling desperately unattractive to her husband of 2 years, Tim Rosenman.\n\n“So ready for this pregnancy to be over,” Whitney told the LadyGang podcast in a recent interview.\n\n“It is so not for me! It’s not. I feel so uncomfortable with my body that I can’t get into the mood. Like, I can’t feel sexy.”\n\nThe 32-year-old also confessed that she and Tim stopped having sex “once the belly really started happening”.\n\n“I think if I was one of those pregnant women that loved it and was confident, then he’d be into it. I think I’ve turned him off of it because I’m like, ‘Don’t look!’\n\n“I’ll even not say anything and he’ll see me getting undressed and be like, ‘I’m not looking, I’m not looking!'”\n\n?\n\nWe have to say, we feel for Whitney and appreciate her honesty on this one.\n\nEven though it goes without saying that she looks lovely, it’s really all about how you feel inside.\n\nWe write a lot about embracing our pregnancy tums and post-baby bods (which we definitely endorse, btw), but even we have to admit it’s sometimes easier said than done, right?\n\nEspecially when you couple that feeling of missing your pre-pregnancy figure with a rough ride of nausea and other classic preg symptoms, something Whitney explained on Instagram made her feel even more ‘gross’.\n\nBut, though Whitney’s parked her sex life until after her baby’s born, she did take to Instagram to open up about the journey she’s gone on with her new figure.\n\nAnd how she’s finally starting to come to terms with the way her burgeoning bump looks…\n\n“Boy, am I growing! In every direction! At first, I must be honest, I had a very hard time coming to terms with my changing body.\n\n“I had always prided myself on being healthy from the inside out and it was difficult not labelling my pregnant body “fat”.\n\n“But as time has gone on, I have come to appreciate what my body is ACTUALLY doing. Don’t get me wrong, I still look at myself in the mirror every day in disbelief about the fact that my boobs are now triple Ds or that when I look down, I can’t see my feet, etc.\n\n“But I remind myself I’m growing a gift and this gift needs room to grow. Just as we all do.”\n\n?\n\nHave your say\n\nWhen you were pregnant, did you ever feel the same way as Whitney and struggle with your body image? Or did you feel comfortable and attractive during your pregnancy?\n\nWe’d love to hear your stories, either way, on Facebook or in the comments below\n\nImages: Instagram/Whitney Port\n\nRead more:\n\n", "images": ["https://images.immediate.co.uk/production/volatile/sites/28/2019/02/cropped-MFM-Logo-2x-f9d4146-3dfada4.png?quality=90&resize=379,87", "https://images.immediate.co.uk/production/volatile/sites/28/2019/02/whitney-port-pregnancy-body-struggle_178914-bd21e17.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/28/2019/04/cropped-mfm-logo-1-0f10cc8-d5caa0f.png?quality=90&resize=260,173"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/28/2019/02/whitney-port-pregnancy-body-struggle_178914-bd21e17.jpg?quality=90&resize=620,413", "keywords": [], "authors": ["Elizabeth Atkin"], "canonical_link": "https://www.madeformums.com/news/whitney-port-pregnancy-body-struggle/", "title": "Whitney Port gets honest about her pregnancy body struggle", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Whitney Port 'unattractive and 'uncomfortable' with pregnant body", "og": {"site_name": "MadeForMums", "title": "Whitney Port gets honest about her pregnancy body struggle", "url": "https://www.madeformums.com/news/whitney-port-pregnancy-body-struggle/", "image": "https://images.immediate.co.uk/production/volatile/sites/28/2019/02/whitney-port-pregnancy-body-struggle_178914-bd21e17.jpg?quality=90&resize=620,413", "description": "The Hills and The City star opens up about how unattractive and uncomfortable she feels with a bump...", "type": "article"}, "twitter": {"title": "Whitney Port gets honest about her pregnancy body struggle", "card": "summary_large_image", "site": "@MadeForMums", "creator": "@MadeForMums", "image": "https://images.immediate.co.uk/production/volatile/sites/28/2019/02/whitney-port-pregnancy-body-struggle_178914-bd21e17.jpg?quality=90&resize=620,413", "description": "The Hills and The City star opens up about how unattractive and uncomfortable she feels with a bump..."}, "google-site-verification": "hQ0aJxIOQHFYnNfw5SZgjUxqI6i3QfznnEmLhScbQJM", "description": "The City alum, 32, admits she can't face sex with husband Tim Rosenman while she has a bump", "robots": "index,follow", "msapplication-TileImage": "https://images.immediate.co.uk/production/volatile/sites/28/2018/10/cbyu3-85ic1-33e699d.png?quality=90&resize=270,270"}, "movies": [], "publish_date": null, "source": "http://www.madeformums.com", "summary": ""}