{"url": "https://www.hollywoodreporter.com/news/stars-wear-anti-gun-violence-pins-at-oscars-sources-say-1089937", "text": "The pins are being distributed by Michael Bloomberg's advocacy group.\n\nMichael Bloomberg's New York-based gun-control advocacy group Everytown for Gun Safety has created an anti-gun-violence pin for celebrities to wear to the Oscars on Sunday, sources tell The Hollywood Reporter.\n\nSince the Parkland, Florida, high school massacre that left 17 dead last month, thousands of young people have called upon the organization to support their efforts to advocate for more stringent gun-control laws and other public-safety issues.\n\nAccording to one Hollywood stylist, the pins have been sent to The Wall Group and other key Hollywood agencies to dole out prior to the red carpet.\n\nThe pins will likely display #NeverAgain, the rallying slogan for the movement. Everytown for Gun Safety has not yet responded to THR's request for confirmation.\n\nTime's Up pins, which were first worn at the Golden Globes in January, are also expected to be worn on the red carpet in support of the legal defense fund that assists those fighting sexual harassment.\n\nEarlier this week, Gucci announced that it would join Oprah Winfrey, George and Amal Clooney, Jeffrey and Marilyn Katzenberg and Steven Spielberg and Kate Capshaw in contributing $500,000 to support the \"March for Our Lives\" anti-gun-violence rally to be held in Washington, D.C., on March 24.\n\nWhile it's not uncommon for stars to wear pins supporting organizations like the ACLU, Planned Parenthood or GLAAD (especially following the 2016 election and President Donald Trump's subsequent immigration ban), the buzz about not only gun violence and sexual harassment but equal pay and other gender issues is bound to make this year's red carpet especially political. In 2018, it's not enough to sport an itty-bitty ribbon.\n\nSome stars — notably Jennifer Lawrence — have admitted that they are unsure about whether or not they will speak to E! red carpet host Ryan Seacrest following the sexual misconduct allegations against him by a former stylist. At the Golden Globes, stars like Deborah Messing and Eva Longoria also called out the network — while on air with E! host Giuliana Rancic — for not paying former host Catt Sadler as much as her male co-host, Jason Kennedy. (Sadler resigned at the end of last year after she learned about the pay gap.)\n\nAlso at the Golden Globes, several stars swapped their significant others for women's rights and LGBTQ advocates who used their turn on the red carpet to speak about the causes they represented. Time will tell if A-listers will be escorted by anti-gun-violence activists or women's rights activists on the Oscars red carpet as well.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2018/03/screen_shot_2018-03-03_at_9.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/03/screen_shot_2018-03-03_at_9.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2019/06/ingrid.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/03/screen_shot_2018-03-03_at_9.jpg", "keywords": [], "authors": ["Ingrid Schmidt", "Ingrid.Schmidt Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/stars-wear-anti-gun-violence-pins-at-oscars-sources-say-1089937", "title": "Stars to Wear Anti-Gun-Violence Pin at Oscars, Sources Say", "meta_data": {"viewport": "width=device-width", "description": "The pins are being distributed by Michael Bloomberg's advocacy group.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/stars-wear-anti-gun-violence-pins-at-oscars-sources-say-1089937", "domain": "https://www.hollywoodreporter.com/", "title": "Stars to Wear Anti-Gun-Violence Pin at Oscars, Sources Say", "description": "The pins are being distributed by Michael Bloomberg's advocacy group.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/03/screen_shot_2018-03-03_at_9.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Stars to Wear Anti-Gun-Violence Pin at Oscars, Sources Say", "description": "The pins are being distributed by Michael Bloomberg's advocacy group.", "url": "https://www.hollywoodreporter.com/news/stars-wear-anti-gun-violence-pins-at-oscars-sources-say-1089937", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/03/screen_shot_2018-03-03_at_9.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Stars to Wear Anti-Gun-Violence Pin at Oscars, Sources Say", "sailthru.description": "The pins are being distributed by Michael Bloomberg's advocacy group.", "sailthru.author": "Ingrid Schmidt", "sailthru.vertical": "Style", "sailthru.date": "2018-03-01 13:41:19", "sailthru.tags": "Style,Oscars,Oscars 2018"}, "movies": [], "publish_date": 1519882879.0, "source": "https://www.hollywoodreporter.com", "summary": ""}