{"url": "https://www.etonline.com/john-cena-and-nikki-bella-end-engagement-all-the-signs-they-were-headed-for-a-split-100442", "text": "Fans were heartbroken on Sunday when John Cena and Nikki Bella announced their breakup after six years together.\n\nThe pro wrestling couple revealed they were splitting and calling off their wedding in a social media statement. ET has learned that the two were just three weeks away from tying the knot on May 5.\n\n“After much contemplation and 6 years of being together Nikki Bella and John Cena announced today their decision to separate as a couple,” the statement read on Bella's Instagram account. “While this decision was a difficult one, we continue to have a great deal of love and respect for one another. We ask that you respect our privacy during this time in our lives.”\n\nCena, 40, and Bella, 34, got engaged last April after the pair won the mixed tag team match at WrestleMania 33 in Orlando, Florida.\n\n\"I have been waiting so long to ask you this,\" Cena told Bella during the emotional moment, presenting her with a huge diamond ring. \"Stephanie Nicole Garcia-Colace, will you marry me?\"\n\nThough throughout their relationship, there have been signs that the two were dealing with serious issues regarding their future together. Read on for a few of those moments before their breakup.\n\n1. Cena has repeatedly said he never wanted to get married again or have kids.\n\nCena was previously married to his high school sweetheart, Elizabeth Huberdeau, though they divorced in 2012 after marrying in 2009. Since then, the wrestler had been vocal about not wanting to tie the knot again. In an episode of Bella's E! reality show with her sister Brie Bella, Total Bellas, he revealed that he had Bella sign a 75-page agreement before they could even move in together.\n\nIn a 2013 episode of Total Bellas, Bella told Cena that she wanted to be a mother, but he bluntly told her that he didn't want to have children.\n\n“I’m going to choose my words carefully,” Cena replied. “I can’t give you that.”\n\nIn 2014, he reiterated the point during yet another episode.\n\n“I’ve told you I don’t want to get married and I don’t want to have kids, and you do want to get married and you do want to have kids,\" he said. \"I feel like there’s a time bomb over my head.”\n\nIn an interview with Rolling Stone in 2016, Cena revealed that he and Bella have been in therapy over the issue.\n\n\"Look, I know I cannot handle raising a child,\" he told the magazine. \"It's like with the dog. My biggest thing to Nicole about the dog was: Love dogs, but I can't contribute to taking care of one. I don't have the time. And just because everyone else is happy with children doesn't mean that's how I have to live.\"\n\n\"I've been upfront about this,\" he continued. \"I just have things I need to get done. It's not negotiable. We've been to therapy over it. I don't think it will ever be over with. I'm stubborn as f**k and extremely selfish as well. I don't want kids, I don't want marriage. That's me just saying, 'Hey, this is my life and this is how I'm going to live.'\"\n\n\n\n2. The couple has wanted to call off their wedding before.\n\nDuring a season three episode of Total Bellas, the couple got into a pretty serious disagreement.\n\n\"So we really want to call this off?\" a distraught Bella asked Cena, as the two talked about their future together.\n\nCena later said during his appearance on the Today show that he was the one who \"caved\" when it came to working out the argument.\n\n“I can generalize it in saying in relationships you have points of disagreement and it was a point of disagreement where it seemed like we couldn’t get past it,” he explained to Hoda Kotb and Kathie Lee Gifford. “We got past it, and we’re back on.”\n\nIn March, Cena opened up to ET at the 2018 Kids' Choice Awards about their relationship struggles that have played out on Total Bellas.\n\n\"It's a weird thing that our relationship is public for the world to know, [but] what a good takeaway for the folks at home -- relationships are tough,\" Cena said. \"It's hard work, and a lot of times, it has to do with looking at yourself.\"\n\n\"'OK, there's a problem. Am I causing it? I kind of am. I'm being way too selfish here. We need to talk about this,' and that leads to a lot of conversations,\" he continued. \"Sometimes people don't want to have those conversations.\"\n\n3. Cena and Bella had a hard time making time for one another.\n\nDuring an episode of Total Bellas last September, Bella's sister Brie told her that she doesn't consider Cena \"family\" because he didn't attend their functions.\n\n“I just feel like, when it comes to family, John’s never in the picture,” Brie said. “Like, he’s always gone.”\n\n“My man is part of this family, and I’m pretty much like his wife…” Nikki fired back.\n\n“But you’re not his wife,” Brie cut her off, adding that she didn't want her daughter referring to Cena as an uncle.\n\n“You’re gonna be sad about that one day,” Nikki noted.\n\n“Why?” Brie responded. “It’s not like she’s ever going to meet him.”\n\nCena admitted to ET in December at the Ferdinand premiere that it was hard for him and his then-fiancee to spend time together. Because of flight complications, Bella wasn't able to attend the premiere at the time.\n\n\"We don't get too much time with each other, and it's kind of a way for us to steal a date out of our schedule, so I was looking forward to seeing her,\" he told ET. \"I haven't seen her in a few weeks. I've been going around the world and she's been busy as well.”\n\n“I think the gift we both long for is time with each other, so it's both of us consciously carving out a few days to just have the company of each other,” he continued.\n\nIn March, during his appearance on The Tonight Show Starring Jimmy Fallon, Cena admitted he didn't know when the two were getting married.\n\n“I was able to let Nicole plan the bachelorette party and she just finished that,” he revealed. “And now I’m just kind of on standby to know when it is and where it is, and I’ll be there.”\n\nOn Monday, Cena appeared to address the breakup on Twitter.\n\n\"Hardship, loss, and humility are extremely difficult waters to navigate,\" he tweeted. \"But perseverance thru them builds a strength to withstand anything life throws your way.\"\n\nFor more on the split, watch the video below:\n\nJohn Cena and Nikki Bella Split After 6 Years Together This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nJohn Cena and Nikki Bella Split After 6 Years Together\n\nJohn Cena Responds to Dwayne Johnson's Threat and Their 'Real Rivalry'\n\nJohn Cena Reveals He Made Nikki Bella Sign a 'Crazy Agreement' Before They Moved in Together\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-11/eto_news_daily_pete_ariana_110118.jpg?h=c673cd1c&itok=-NOJ0JS3", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/john_cena_nikki_bella_gettyimages-683449026_1280_0.jpg?h=c673cd1c&itok=_Opcen5V"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/john_cena_nikki_bella_gettyimages-683449026_1280_0.jpg?h=c673cd1c&itok=_Opcen5V", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/john-cena-and-nikki-bella-end-engagement-all-the-signs-they-were-headed-for-a-split-100442", "title": "John Cena and Nikki Bella End Engagement: All the Signs They Were Headed for a Split", "meta_data": {"article": {"opinion": "false"}, "title": "John Cena and Nikki Bella End Engagement: All the Signs They Were Headed for a Split | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/john-cena-and-nikki-bella-end-engagement-all-the-signs-they-were-headed-for-a-split-100442", "title": "John Cena and Nikki Bella End Engagement: All the Signs They Were Headed for a Split", "description": "Fans were heartbroken on Sunday when John Cena and Nikki Bella announced their breakup after six years together.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/john_cena_nikki_bella_gettyimages-683449026_1280_0.jpg?h=c673cd1c&itok=_Opcen5V", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Fans were heartbroken on Sunday when John Cena and Nikki Bella announced their breakup after six years together.", "title": "John Cena and Nikki Bella End Engagement: All the Signs They Were Headed for a Split", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno‍", "url": "https://www.etonline.com/john-cena-and-nikki-bella-end-engagement-all-the-signs-they-were-headed-for-a-split-100442", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/john_cena_nikki_bella_gettyimages-683449026_1280_0.jpg?h=c673cd1c&itok=_Opcen5V"}, "description": "Fans were heartbroken on Sunday when John Cena and Nikki Bella announced their breakup after six years together.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, John Cena, Nikki Bella", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/0HjzJfjtCAU?feature=oembed", "https://www.youtube.com/embed/phIRhaXzbmk?feature=oembed", "https://www.youtube.com/embed/mBoNT54NRPE?feature=oembed", "https://www.youtube.com/embed/opJvBfIwklg?feature=oembed", "https://www.youtube.com/embed/skNaVWK-G4w?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}