{"url": "https://www.washingtonpost.com/news/true-crime/wp/2017/08/01/they-trashed-their-wedding-photographer-over-a-125-fee-so-a-jury-told-them-to-pay-her-1-million/", "text": "Their photographer was withholding the images, they told NBC affiliate KXAS in January 2015, and was demanding an extra $150 when they’d already paid thousands.\n\n“It’s heartbreaking, because, you know, these are our memories,” Neely Moldovan said.\n\nAnd many agreed.\n\n“Wedding photographer holds couple’s pictures hostage,” blared the Daily Mail a few days later.\n\nAD\n\nThe Moldovans’ sympathizers descended on photographer Andrea Polito’s review pages, calling her a scam artist, or worse.\n\nHer reputation was ruined, her business dried up and she closed her studio.\n\nAD\n\nAnd then the story changed.\n\nPolito sued the Moldovans, claiming all they ever had to do to get their glossies was fill out a form, choose options for their wedding album and pay a small charge they had long known about.\n\nThe photographer showed the court emails in which she and her employees tried to appease the couple — even as the Moldovans were calling reporters, whipping up a furor on social media and plugging their newfound fame to fans of Neely Moldovan’s beauty blog, Polito said.\n\nAD\n\nOn Friday, a jury in Dallas decided that the tale of the ransomed wedding photos was not heartbreaking, and not even true.\n\nIn fact, the jurors concluded, the accusations amounted to malicious defamation, for which the Moldovans should pay the photographer more than $1 million in damages.\n\nThe Moldovans can still challenge the verdict, which appeared to leave the couple in shock.\n\nAD\n\nNeely Moldovan did not mention it in her latest blog posts, which concerned post-pregnancy pore troubles and her August goals (“Plan a trip to Houston,” “Focus on Pinterest growth,” “Have 2 dates with Andrew”).\n\nBut a public relations agency claiming to represent the couple emailed a statement in which the Moldovans expressed their shock:\n\nAD\n\nWe are stunned. We did what consumer advocates say to do: When you are wronged, you fight back. We were unhappy with a situation, so we complained like anyone would. This court decision tells consumers not to speak up for fear of fat legal bills and painful judgments. If this is the cost of standing up for what’s right, we should have given in to start with. But we hope to prevail in the end. We’d love nothing more than to put this behind us and focus on raising our 5-month-old child.\n\nPolito, who hopes the jury’s decision will help her rebuild a ruined career, was happy to share her version of the saga with The Washington Post.\n\nAfter more than a decade in the wedding photography business, she said, her studio was booked every weekend, months in advance, with couples from the poshest parts of Dallas and its suburbs.\n\nWhen the future Mrs. Moldovan opened an order in early 2014, she struck Polito as a friendly, fairly typical client — “A 30 Something Dallas Lifestyle and Beauty Blogger,” as Moldovan describes herself on her website.\n\nShe and Polito worked out a schedule for engagement, rehearsal and wedding shoots in the months ahead.\n\nAD\n\nAD\n\nAfterward, Polito said, she warned her studio manager: “She’s a blogger. Make sure everything looks perfect.”\n\nPhotographers from the studio shot the wedding ceremony that October, and the studio sent the couple proofs the next month, according to court records.\n\n“She posted those all over social media,” Polito said.\n\nAnd then Neely Moldovan began asking when she could have high-resolution versions of the photos.\n\nPolito said her studio, like many, withholds high-res images until the entire wedding package is completed, culminating in the delivery of a custom wedding album, usually months after the wedding.\n\nOtherwise, Polito said, “photographers will hand over the images and the bride disappears.”\n\nAD\n\nHer studio explained as much to Neely Moldovan, she said, and asked her to fill out a form with her album options.\n\nAD\n\nBut November and December went by. Then New Year’s.\n\nOne week into 2015, the newlywed told her Twitter followers about the travails of choosing her photos.\n\n“I’m finally getting around to filling this out,” she wrote to the studio the same day. “Do we pay extra for a cover?”\n\nYes, she did. Having already paid the studio thousands, Moldovan was not happy about this.\n\n“She basically didn’t read her paperwork or contract,” Polito said. “She just couldn’t understand why she couldn’t have her high-res images. It’s in bold in our contract.”\n\nA string of explanatory emails between the couple and the studio unfolded over the following days.\n\nAD\n\nIn the midst of this, Polito’s lawyers argued in court, Andrew and Neely Moldovan began emailing reporters across Dallas and beyond — promoting a looming news story to their friends and fans.\n\nAD\n\n“I’m going apes‑‑‑ on our photographer,” Andrew Moldovan texted a friend on Jan. 12, 2015, according to transcripts Polito’s lawyer shared with The Post. “We want our f‑‑‑ing wedding album, which we already paid for.”\n\n“We are hoping that our story makes the news and completely ruins her business,” Neely Moldovan wrote to someone the same day, according to court records.\n\nPolito knew nothing about this, she said, until her studio manager texted her a screenshot of Neely Moldovan’s latest Instagram post: “No big deal NBC in our apt.”\n\nAD\n\nAlthough she declined to appear on camera, Polito sent the local NBC reporter a page-long email: about albums and album covers, contracts, schedules and “a-la-carte items” the Moldovans had yet to pay for.\n\nAlmost none of that email appeared in the station’s first January broadcast, which focused on the Moldovans, their empty picture frames and memories held “hostage,” as the reporter put it, over a $150 album cover fee, which he said “the contract doesn’t mention anything about.”\n\nAD\n\nThen, the station released a follow-up report a few days later, with many more details and a story not nearly so simple.\n\nThe NBC affiliate described months of conversation between the Moldovans and the studio. The minimum cost of an album cover was actually $125, and a wedding expert who had blasted Polito in the station’s first segment was now defending her after learning more about the case.\n\nAD\n\nBut it didn’t make much difference. “The damage had already been done,” Polito told The Post.\n\nThe Moldovans’ story was picked up across the United States and overseas.\n\nMeanwhile, court records show, Neely and Andrew Moldovan were busy on social media, advancing the “hostage” narrative.\n\n“Blatantly steals money from you all while holding your pictures ransom,” a user named Andrew wrote in a review of the Moldovans’ wedding shoot. The couple told the NBC station that people were impersonating them online, although Polito’s lawyers would argue otherwise in court.\n\nAD\n\n“She’s done this to over 22 brides that have come forward,” Neely Moldovan wrote, according to a screenshot shared by Polito’s lawyer.\n\nAnd in another message: “Pretty sure her business is done.”\n\nSo it was, Polito said.\n\nThe photographer had built her business — including a studio in downtown Dallas, with employees and contractors — largely on word of mouth, she told The Post.\n\n“They can’t refer a bride when this is going on,” she said.\n\nShe told the court that only two clients were willing to sign with her after news stories ran, and she had to shut her studio down and start living off savings.\n\nHer lawyers hired an analyst who estimated that she had lost hundreds of thousands of dollars in profit by the time her 2015 lawsuit went to trial last week in Dallas County district court.\n\nThe trial had been long delayed. Accused of conspiracy, defamation and disparagement, the Moldovans tried to have the suit tossed and argued that Polito could not cite a single case of lost business, let alone prove that the couple had lied.\n\nAD\n\nA lawyer for the Moldovans declined to comment on the case.\n\nBut a judge let the case go forward. And on Friday, the jury sided with Polito, whose complaint described the couple as “dead set in their pursuit of publicity and public shaming.”\n\nAfter an afternoon of deliberation, a majority of jurors agreed that the Moldovans had defamed and disparaged Polito and her studio, and conspired to do so. The total price to make good was just over $1 million.\n\nIt’s not certain that Polito will ever see the money. Her lawyer, Dave Wishnew, said he expects the couple to challenge the verdict before a judge orders them to pay.\n\nBut for Polito, who said she hasn’t shot an event in years and has drained her savings and retirement accounts since the Moldovans took their complaints international, the verdict is vindication enough.\n\n“For two-and-a-half years I walked around my daughter’s school feeling ashamed and embarrassed,” she said. “They know I’ve won now.”\n\nThis post, originally published Aug. 1, has been updated with a statement sent by a public relations firm that says it is representing the Moldovans.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/af059975-28c8-4691-aa32-82c8154c18e0.png&w=90&h=90", "https://www.washingtonpost.com/resizer/RcfdaZucLbyVwt_vHJPzufY6nSE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PXVCFDF4PYZI3E4WRTF3ZGVZZM.jpg"], "top_img": "https://www.washingtonpost.com/resizer/RcfdaZucLbyVwt_vHJPzufY6nSE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PXVCFDF4PYZI3E4WRTF3ZGVZZM.jpg", "keywords": [], "authors": ["Avi Selk"], "canonical_link": "https://www.washingtonpost.com/news/true-crime/wp/2017/08/01/they-trashed-their-wedding-photographer-over-a-125-fee-so-a-jury-told-them-to-pay-her-1-million/", "title": "They trashed their wedding photographer over a $125 fee, so a jury told them to pay her $1 million", "meta_data": {"description": "After being forced out of business, the Texas photographer convinced a jury that a professional beauty blogger and her new husband had conspired to destroy her reputation.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/true-crime/wp/2017/08/01/they-trashed-their-wedding-photographer-over-a-125-fee-so-a-jury-told-them-to-pay-her-1-million/", "image": "https://www.washingtonpost.com/resizer/RcfdaZucLbyVwt_vHJPzufY6nSE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PXVCFDF4PYZI3E4WRTF3ZGVZZM.jpg", "title": "They trashed their wedding photographer over a $125 fee, so a jury told them to pay her $1 million", "description": "After being forced out of business, the Texas photographer convinced a jury that a professional beauty blogger and her new husband had conspired to destroy her reputation."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "They trashed their wedding photographer over a $125 fee, so a jury told them to pay her $1 million", "description": "After being forced out of business, the Texas photographer convinced a jury that a professional beauty blogger and her new husband had conspired to destroy her reputation."}, "last_updated_date": "2019-04-01T00:20:55.876Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1501516800.0, "source": "https://www.washingtonpost.com", "summary": ""}