{"url": "https://en.wikipedia.org/wiki/Felicity_Smoak", "text": "Felicity Smoak is a fictional character appearing in comics published by DC Comics. Her first appearance was in The Fury of Firestorm #23 (May 1984), created by writer Gerry Conway and artist Rafael Kayanan.[1] She was originally the manager of a computer software firm who opposed the superhero Firestorm because of his recklessness, eventually becoming the second wife of Edward Raymond and stepmother to Ronnie Raymond, one-half of the integrated dual identity of the superhero.[2]\n\nA re-imagined Felicity Smoak was portrayed by Emily Bett Rickards, featured in the television series Arrow and its extended universe of shows, collectively known as the Arrowverse. An I.T. genius and graduate from MIT, Felicity works alongside vigilante Oliver Queen/Green Arrow to help protect Star City (formerly Starling City), later operating under the alias Overwatch. The pair also become romantically involved, and eventually marry with Felicity giving birth to their daughter Mia Smoak. This interpretation of the character was placed at number 15 in a list of 50 Favorite Female Characters, in a poll of Hollywood professionals conducted by The Hollywood Reporter in 2016.[3]\n\nA similar version of Felicity was introduced as the New 52 incarnation of the character in Green Arrow (vol. 5) #35.[4]\n\nFictional character biography [ edit ]\n\nThe Fury of Firestorm [ edit ]\n\nThe Fury of Firestorm. Felicity Smoak in\n\nPortrayed as the supervisor of a New York computer software firm in her 1984 debut appearance,[5] Firestorm first encounters her in the course of one of his battles with a villain, where he inadvertently magnetizes and effectively destroys several of the computers storing the software programs in development. This results in millions of dollars in property damage, which threatens to ruin the software firm and leads to a heated confrontation between Felicity and Firestorm where she threatened to organize a class action lawsuit against him. Felicity would make recurring appearance, often taking an adversarial role against Firestorm and making a point of explaining what the collateral damage of his battles cost her and other civilians. On one occasion, a frustrated Firestorm lashes out against Felicity's confrontational behavior by using his molecular transmutation powers to transform her clothes to soap suds, a tactic he previously used on the supervillain Plastique. Humiliated from being rendered nude in public, Felicity retaliates by filing a lawsuit against him.\n\nAt some point, Felicity develops a romantic relationship with Ed Raymond. She has no idea that Ed's son Ronnie is the other half of Firestorm. When Ronald discovers that Felicity is seeing his father, he is uncertain how to treat her due to their past interactions. Over time, Felicity and Ed fall deeply in love and are married. After the wedding Felicity learns the truth about Ronnie's secret dual identity, but by this point she had forgiven him for his past transgressions, although she would still insist on reminding him about the importance of using his superpowers in a responsible manner.[6]\n\nThe New 52 [ edit ]\n\nDC Comics rebooted its comic properties in 2011 as part of a relaunch entitled The New 52, which led to the character of Felicity Smoak being brought back in a fashion similar to the version seen on Arrow.[7] The New 52 version of Felicity Smoak is introduced in 2014 in Green Arrow #35, the first issue of that book to be written by Arrow showrunner Andrew Kreisberg. In #35,[8] she is introduced in an end-of-issue cliffhanger as an assassin out to kill Oliver, but quickly explains that while she is a hacker-for-hire who has \"done questionable things\" in her past, \"leading a hero to his death isn't one of them\", explaining she did not know her target was the Green Arrow when she accepted the job. After proving her hacker credentials by explaining to him that she knows his secret identity, as well as highly specific details from his superhero, personal, professional and family lives, she offers to become a part of his team out of a desire to help him save the city. Surmising that whoever hired her to kill Oliver has extremely evil plans, she teams up with Green Arrow to track down her client's other target, a woman named Mia Dearden, who they soon discover is being pursued by the deadly archer Merlyn.\n\nLater in the same storyline, Felicity is arrested and placed in a Supermax facility for her many cybercrimes, where she shares a cell with Cheetah; it is established that Felicity had once been hired to dox Cheetah, putting the villain and her loved ones in added danger. Oliver saves her from Cheetah with some help from Steve Trevor of A.R.G.U.S. Ultimately, Oliver saves Mia from the man pursuing her and her father John King. Oliver also exposes him as a murderer who used bribery and corruption to control Seattle. Felicity is then invited by Trevor to join A.R.G.U.S., but appears to reject his offer in favor of working with Oliver.\n\nAlternate versions [ edit ]\n\nDC Bombshells [ edit ]\n\nIn an alternate history version of World War II depicted in DC Comics Bombshells, a young Felicity and her family were evicted from their house in Gotham City by their landlord because they violated the law by taking care of some relatives, who have fled the horrors of Europe. The landlord tries to take some of their personal belongings, justifying as taking back rent. Felicity argues with him, saying she won't turn her back to her own family. Fortunately, a team of Batgirls come to the rescue, saving the Smoak family and all their belongings. Felicity and her family are later moved to a safe house by the young heroines.[9] Smoak eventually joins the Batgirls and dons a costume herself.[10]\n\nFelicity also appears in the continuation series Bombshells:United set in the United States in 1943.[11] Now thirteen years old, she travels with fellow Batgirl Alysia Yeoh to Hawaii, where the pair discover Black Canary.[12] Felicity uses her technical skills and knowledge to help trace the source of mysterious radio signals that are acting as a means of mind control. In order to fully analyze the source of the signal, Felicity locks herself in the radio tower, exposing her to the mind control. She is able to write the location down and show it to the waiting Frankie Charles before succumbing to its effects.[13] Felicity and the other victims of the mind control signal are freed by Black Canary and Bumblebee following the defeat of Granny Goodness.[14]\n\nIn other media [ edit ]\n\nArrowverse [ edit ]\n\nA reimagined Felicity Smoak appears in the television series Arrow, itself a reimagining of the Green Arrow mythos, portrayed by Emily Bett Rickards. The character is portrayed as an I.T. genius, being a skilled hacker and computer expert, with a degree from M.I.T. The character joins Oliver Queen on his vigilante mission, and later founds her own company \"Smoak Technologies\", as well as beginning a romantic relationship with Oliver which eventually leads to their marriage and the birth of their daughter Mia Smoak. She was originally introduced in the third episode of season one, \"Lone Gunman\", as a one-off character,[15] Due to the positive reaction both from Stephen Amell[16] and from Warner Brothers producer Peter Roth,[17][18] the character was made recurring in season one. From season two onwards, she became part of the main cast.[19] The character also makes appearances in Arrow spin-offs The Flash,[20] Legends of Tomorrow[21] and Vixen.[22] She also appears in a season three episode of the Earth-38 set series Supergirl, during the Arrowverse crossover event \"Crisis on Earth-X\".[23] Rickards left Arrow at the end of its seventh season.[24] but will return as a guest star for the Arrow's series finale, scheduled to air in 2020.[25]\n\nPrint media [ edit ]\n\nFelicity features in the digital tie-in comics to the Arrowverse series, Arrow Season 2.5,[26] Flash Season Zero[27] and in \"Smoak Signals\" parts 1 and 2.[28][29] She is one of the four protagonists of the two tie-in comics produced to accompany the Arrowverse crossover event Crisis on Infinite Earths, released in December 2019 and January 2020 respectively.[30] She is also one of the protagonists in the Arrowverse tie-in novels, Arrow: Vengeance, written by Oscar Balderrama and Lauren Certo,[31] The Flash: The Haunting of Barry Allen written by Susan and Clay Griffith,[32] and its sequel Arrow: A Generation of Vipers[33] as well as Arrow: Fatal Legacies, co-authored by Marc Guggenheim and James R. Tuck.[34]\n\nWeb series [ edit ]\n\nFelicity (again portrayed by Rickards) features in the promotional tie-in web series for Arrow, entitled Blood Rush.[35] Rickards also provided the voice for the character on seasons one and two of the Arrowverse web-series Vixen,[22] which debuted in 2015 and 2016 respectively, on CW Seed.\n\nVideo games [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/82/Felicity_Smoak_%28Fury_of_Firestorm%29.jpg/170px-Felicity_Smoak_%28Fury_of_Firestorm%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/5/57/Felicity_Smoak_%28The_New_52%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/57/Felicity_Smoak_%28The_New_52%29.jpg/250px-Felicity_Smoak_%28The_New_52%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/3/3e/Felicity_Smoak_%28Arrow%29.jpg/220px-Felicity_Smoak_%28Arrow%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b8/Felicity_Smoak_%28DC_Bombshells%29.jpg/100px-Felicity_Smoak_%28DC_Bombshells%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/57/Felicity_Smoak_%28The_New_52%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Felicity_Smoak", "title": "Felicity Smoak", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/57/Felicity_Smoak_%28The_New_52%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}