{"url": "https://www.etonline.com/the-bachelor-women-tell-all-krystals-nsfw-comments-revealed-plus-6-other-shocking-revelations-97091", "text": "The women told all -- and so did Arie Luyendyk Jr.\n\nSunday's special episode of The Bachelor: Women Tell All rehashed all the drama from Arie's season, with a few unseen moments added in for good measure.\n\nFrom Krystal's NSFW comments about Arie and the women (whoa, girl!) to his stunning confession that he has \"regrets\" over the show, here are the night's most shocking revelations.\n\nKrystal Called Arie a 'Needled**k'\n\n'Bachelor' Villain Krystal Nielson: Arie Encouraged Me! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nWondering what that bleeped-out word was that had the women's mouths wide open? That would be Krystal brutally calling Arie a \"needled**k\" in a previously unseen clip from the show. The San Diego native certainly did not hold back with the insults, as she also called her fellow contestants \"c**ts\" -- and they were not happy about it.\n\nAs for Arie's reaction? Scroll down to find out.\n\nKrystal's Baby Talk Came From 'Losing Her Voice'\n\nFans were quick to take note that the combative Krystal they witnessed on Women Tell All had a much different voice from the raspy, baby-like tone she displayed on the show -- as so did the women on the special.\n\nAfter spending what felt like an eternity in the hot seat, Krystal was finally asked by Olivia why her voice sounded completely different, but her answer didn't exactly add up. \"I lost my voice before going on the show,\" she said.\n\n\"You were on the show for six weeks!\" host Chris Harrison exclaimed. Thank you, Chris!\n\nArie Questioned Whether He Had 'Made a Mistake' After Sending Tia Home\n\nSPOILER: 'Bachelor' Star Tia Booth on Whether She Has Any Regrets After 'Devastating' Exit This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nThis one came courtesy of Harrison, who in an attempt to console a teary-eyed Tia, revealed that Arie struggled with his decision to let her go after hometowns. \"I don't know if this is better or worse to say to you, but when he came back in after saying goodbye to you, he told me he wasn't sure if he had just made a mistake.\"\n\n\"That's gutwrenching -- absolutely gutwrenching,\" Tia replied.\n\nThe Women are Not Happy With How Arie Ends the Season\n\nWATCH: 'Bachelor' Arie Luyendyk Jr. Confronted By Caroline Over His Final Choice on 'Women Tell All' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nWe had the clip days before Women Tell All aired, but it didn't make Caroline's confrontation any less dramatic.\n\n\"I know what you did, and I don't know how you could do that,\" she hissed at Arie, as the women reacted with both signs of shock and nods of solidarity. \"I just really don't understand it, but I really hope you found what you're looking for.\"\n\n\"I think that will play out in the weeks to come,\" Arie tried to explain before Caroline cut him off.\n\n\"You don't need to answer me,\" she coldly insisted. \"I just needed to say that.\"\n\nArie Has 'Regrets'\n\nThe Bachelor had a lot to say to the women when he came out, and after issuing apologies to Bekah and Tia, he admitted that he wished his season would have played out differently.\n\n\"I have regrets,\" he confessed, saying that he would have done \"a lot of things\" differently if he could have. \"You do just lead with your heart and do what your instinct tells you... It's hard to look back.\"\n\nBekah Really Did Go to a Marijuana Farm -- and She Might Be Headed to Bachelor in Paradise\n\n'Bachelor' Contestant Bekah Martinez Responds to Her Own Missing Persons Report This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nAfter making headlines for being on a missing persons list while she was appearing on The Bachelor, Bekah set the record straight for Harrison, revealing exactly what happened. According to the 23-year-old nanny, she needed to de-stress after being dumped by Arie, so she headed off to Humboldt County for a little camping trip with her friends -- and yes, it was on a marijuana farm. The group didn't get cell service, and after a few days of not checking in with her mom, Mama Martinez got worried and called the sheriff's department to report her missing.\n\nBekah, of course, made it home and safe and sound, but she might not be home for too much longer. \"By the way, I'm just giving you a head's up. There's a good chance she's going to be missing for about two weeks this summer, because, hopefully, she'll be in Mexico on Bachelor in Paradise,\" Harrison told Bekah's mom on the phone.\n\n\"That's her worst nightmare, by the way,\" Bekah laughed.\n\nArie Shut Krystal DOWN\n\nAfter what we can only imagine was hours of being confronted by the women, Krystal took the first opportunity to talk face to face with Arie, inviting herself into the hot seat. She definitely came in hot, accusing Arie of being \"cold\" with her during her elimination, and Arie -- who hadn't even heard her \"needled**k\" comment until Harrison repeated it then and there -- was ready for battle.\n\n\"Looking back now, I feel like it was pretty appropriate,\" Arie said of their breakup. \"It just sucks to see how you actually were compared to how you were with me. I feel like there was a whole other side to you that I didn't see until I watched it back.\"\n\n\"I feel like maybe I dragged it on way longer than I should have,\" he continued, adding that finally seeing her below-the-belt comments \"shows a real side to you.\"\n\nThe women chanted for Harrison to \"play the clip,\" but Arie had heard enough. \"It's frustrating to see that side,\" he insisted.\n\nThe Bachelor is back to its normal time on Monday at 8 p.m. ET/PT on ABC for what leads up to \"truly the most dramatic ending in Bachelor history.\"\n\nSee more on the show in the video below.\n\nRELATED CONTENT:\n\n'Bachelor' Arie Luyendyk Jr. Takes a Dig at the Ladies of 'Women Tell All'\n\nThink 'Bachelor' Arie Luyendyk Jr. Is Boring? ABC Exec Responds to Critics (Exclusive)\n\n'Bachelor Winter Games' Produces 4 Couples: Why Was the Series So Successful?\n\n'The Bachelor' Preview Hints Arie Luyendyk Jr. Says 'I Love You' to Three Women This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/peter_madison_gettyimages-1206495953_1280.jpg?h=c673cd1c&itok=KXkKlwfc", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/krystalbachelor_1280.jpg?h=c673cd1c&itok=A35lWCbE", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/krystalbachelor_1280.jpg?h=c673cd1c&itok=A35lWCbE", "keywords": [], "authors": ["Jennifer Drysdale"], "canonical_link": "https://www.etonline.com/the-bachelor-women-tell-all-krystals-nsfw-comments-revealed-plus-6-other-shocking-revelations-97091", "title": "'The Bachelor: Women Tell All': Krystal's NSFW Comments Revealed, Plus 6 Other Shocking Revelations", "meta_data": {"article": {"opinion": "false"}, "title": "'The Bachelor: Women Tell All': Krystal's NSFW Comments Revealed, Plus 6 Other Shocking Revelations | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/the-bachelor-women-tell-all-krystals-nsfw-comments-revealed-plus-6-other-shocking-revelations-97091", "title": "'The Bachelor: Women Tell All': Krystal's NSFW Comments Revealed, Plus 6 Other Shocking Revelations", "description": "The women told all -- and so did Arie Luyendyk Jr. -- on Sunday's reunion special.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/krystalbachelor_1280.jpg?h=c673cd1c&itok=A35lWCbE", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The women told all -- and so did Arie Luyendyk Jr. -- on Sunday's reunion special.", "title": "'The Bachelor: Women Tell All': Krystal's NSFW Comments Revealed, Plus 6 Other Shocking Revelations", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jennifer Drysdale‍", "url": "https://www.etonline.com/the-bachelor-women-tell-all-krystals-nsfw-comments-revealed-plus-6-other-shocking-revelations-97091", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/krystalbachelor_1280.jpg?h=c673cd1c&itok=A35lWCbE"}, "description": "The women told all -- and so did Arie Luyendyk Jr. -- on Sunday's reunion special.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, The Bachelor, Arie Luyendyk Jr., Roses and Rose", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}