{"url": "https://www.mercurynews.com/2018/02/07/richard-pryor-and-marlon-brando-slept-together-pryors-widow-says-it-was-the-70s/", "text": "The fact that Marlon Brando’s numerous sex partners over his lifetime included men is nothing new. Various posthumous biographies have mentioned his bisexuality, and Brando himself was quoted in one of those biographies as saying he had “homosexual experiences.”\n\n“Like a large number of men, I too have had homosexual experiences and am not ashamed,” Brando was quoted in “Marlon Brando, the Only Contender,” according to the New York Daily News.\n\nThe late Richard Pryor also would not be ashamed of the fact that he and Brando enjoyed one of those experiences, Pryor’s widow Jennifer Pryor told TMZ Wednesday.\n\nThe Brando-Pryor hookup first came to light in Quincy Jones’ candid and wide-ranging interview published Wednesday in Vulture. The legendary music producer said he and Brando were longtime friends. So he said he was aware that the Academy Award-winning actor, who embodied a certain male ideal in “A Streetcar Named Desire” and “On the Waterfront,” liked to have sex — lots of sex.\n\nJones added that Brando’s partners included other prominent artists and entertainers including James Baldwin, Marvin Gaye — and Richard Pryor. When the Vulture writer asked if Brando really slept with these men, Jones laughingly said, “Come on, man. He did not give a (expletive).”\n\nJennifer Pryor, the comedy legend’s fourth and final wife, said her husband was similarly inclined to have sex with lots of different partners, female or male.\n\nThis was especially true in 1970s — after he emerged from the Berkeley counter-culture to enjoy mainstream success in comedy, on TV and in films.\n\nOne of those partners was Brando, she said about her husband, who died in 2005.\n\n“It was the ’70s!” Jennifer Pryor said. “Drugs were still good, especially quaaludes. If you did enough cocaine, (have sex) with a radiator and send it flowers in the morning.”\n\nShe didn’t specify when this hookup with Brando occurred, whether it was as the actor regained his stardom during “The Godfather” and “Last Tango in Paris” years — or in the later 1970s when the actor seemed to just enjoy raking in money and phoning in performances in films like “Superman,” while putting on weight. Brando died in 2004.\n\nMost of all, Jennifer Pryor told TMZ that Pryor wouldn’t have been ashamed about the liaison, given that he was always open about his bisexuality with friends. His sexual orientation also was documented in Scott Saul’s biography “Laughter Along the Path to Oblivion: Becoming Richard Pryor,” the New York Times reported.", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2018/02/richardpryor1977.jpg?w=1024&h=696", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/03/brandotango.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/08/ap_910927046.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/02/richardpryor1977.jpg?w=1024&h=696", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/02/07/richard-pryor-and-marlon-brando-slept-together-pryors-widow-says-it-was-the-70s/", "title": "Did Richard Pryor and Marlon Brando hook up? Pryor’s widow says ‘It was the ’70s!’", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Both Quincy Jones and Richard Pryor's widow revealed Wednesday that the comedy legend and Marlon Brando had a sexual encounter sometime in the 1970s.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Did Richard Pryor and Marlon Brando hook up? Pryor’s widow says ‘It was the ’70s!’", "url": "https://www.mercurynews.com/2018/02/07/richard-pryor-and-marlon-brando-slept-together-pryors-widow-says-it-was-the-70s/", "description": "Both Quincy Jones and Richard Pryor’s widow revealed Wednesday that the comedy legend and Marlon Brando had a sexual encounter and that neither would have been ashamed.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/02/richardpryor1977.jpg?w=1024&h=696", "width": 1024, "height": 696}, "locale": "en_US"}, "article": {"published_time": "2018-02-07T22:53:15+00:00", "modified_time": "2018-02-08T12:12:31+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Did Richard Pryor and Marlon Brando hook up? Pryor’s widow says ‘It was the ’70s!’"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/02/richardpryor1977.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1517932800.0, "source": "https://www.mercurynews.com", "summary": ""}