{"url": "en.wikipedia.org/wiki/Emma_Stone", "text": "American actress\n\nEmily Jean \"Emma\" Stone (born November 6, 1988) is an American actress. The recipient of numerous accolades, including an Academy Award and a Golden Globe Award, she was the world's highest-paid actress in 2017. Stone has appeared in Forbes Celebrity 100 in 2013 and in 2017, she was featured by Time as one of the 100 most influential people in the world.\n\nBorn and raised in Scottsdale, Arizona, Stone began acting as a child, in a theater production of The Wind in the Willows in 2000. As a teenager, she relocated to Los Angeles with her mother and made her television debut in In Search of the New Partridge Family (2004), a reality show that produced only an unsold pilot. After small television roles, she made her film debut in Superbad (2007), and received positive media attention for her role in Zombieland (2009). The 2010 teen comedy Easy A was Stone's first starring role, earning her nominations for the BAFTA Rising Star Award and a Golden Globe Award for Best Actress. This breakthrough was followed with further success in the romantic comedy Crazy, Stupid, Love (2011) and the drama The Help (2011).\n\nStone gained wider recognition as Gwen Stacy in the 2012 superhero film The Amazing Spider-Man, and its 2014 sequel. She was nominated for the Academy Award for Best Supporting Actress for playing a recovering drug addict in the black comedy Birdman (2014), and her Broadway debut came in a revival of the musical Cabaret (2014–2015). She won the Academy Award for Best Actress for playing an aspiring actress in the romantic musical La La Land (2016). Stone portrayed Billie Jean King in the biographical sports film Battle of the Sexes (2017) and Abigail Masham in the historical comedy-drama The Favourite (2018), receiving a third Academy Award nomination for the latter. She has since starred in the Netflix dark comedy miniseries Maniac (2018) and the comedy sequel Zombieland: Double Tap (2019).\n\nEarly life\n\nEmily Jean Stone was born on November 6, 1988, in Scottsdale, Arizona, to Krista Jean Stone (née Yeager), a homemaker, and Jeffrey Charles Stone, the founder and CEO of a general-contracting company.[1][2] Stone lived on the grounds of the Camelback Inn resort from the age of 12 to 15.[3][4] She has a younger brother, Spencer.[5] Her paternal grandfather, Conrad Ostberg Sten, was from a Swedish family that anglicized their surname to \"Stone\" when they immigrated to the United States through Ellis Island. She also has German, English, Scottish, and Irish ancestry.[6]\n\nAs an infant, Stone had baby colic and cried frequently; she consequently developed nodules and calluses on her vocal cords while she was a child.[7] Stone has described herself as having been \"loud\" and \"bossy\" while growing up.[8] She was educated at Sequoya Elementary School and attended Cocopah Middle School for the sixth grade. Although she did not like school, she has stated that her controlling nature meant that \"I made sure I got all As\".[9] Stone suffered panic attacks as a child,[10] which she says caused a decline in her social skills.[11] She underwent therapy but states that it was her participation in local theater plays that helped cure the attacks.[10]\n\nThe first time I had a panic attack I was sitting in my friend's house, and I thought the house was burning down. I called my mom and she brought me home, and for the next three years it just would not stop. I would go to the nurse at lunch most days and just wring my hands. I would ask my mom to tell me exactly how the day was going to be, then ask again 30 seconds later. I just needed to know that no one was going to die and nothing was going to change. Stone, The Wall Street Journal, June 2015[10]\n\nStone started acting at age four;[4] she wanted a career in sketch comedy initially, but shifted her focus toward musical theater, and took voice lessons for several years.[12] Her acting debut, at the age of 11, came in a stage production of The Wind in the Willows, playing the part of Otter.[13] The actress was homeschooled for two years, during which time she appeared in sixteen productions at Phoenix's Valley Youth Theatre—including The Princess and the Pea, Alice's Adventures in Wonderland, and Joseph and the Amazing Technicolor Dreamcoat[1]—and performed with the theater's improvisational comedy troupe.[14] Around this time, she traveled to Los Angeles and auditioned unsuccessfully for a role in Nickelodeon's All That.[15] Her parents later sent her for private acting lessons with a local acting coach, who had worked at the William Morris Agency in the 1970s.[2]\n\nStone attended Xavier College Preparatory‍—‌an all-girl Catholic high school‍—‌as a freshman, but dropped out after one semester to become an actress.[1] She prepared a PowerPoint presentation for her parents titled \"Project Hollywood\" (featuring Madonna's 2003 song \"Hollywood\") to convince them to let her move to California to pursue an acting career.[12] In January 2004, she moved with her mother to an apartment in Los Angeles. She recalls: \"I went up for every single show on the Disney Channel and auditioned to play the daughter on every single sitcom\", adding, \"I ended up getting none.\"[4] Between auditions for roles, she enrolled in online high-school classes, and worked part-time at a dog-treat bakery.[2][10]\n\nCareer\n\nEarly career (2004–2008)\n\nWhen Stone registered for the Screen Actors Guild, the name \"Emily Stone\" was already taken. She initially chose to go by \"Riley Stone\", but after guest-starring in the NBC drama Medium and the Fox sitcom Malcolm in the Middle, she decided that she was more comfortable with \"Emma\".[15][16] She chose to use \"Emma\" in honor of Emma Bunton of the Spice Girls.[17] She made her television debut as Laurie Partridge on the VH1 talent competition reality show In Search of the New Partridge Family (2004). The resulting show, retitled The New Partridge Family (2004), remained an unsold pilot.[18] She followed this with a guest appearance in Louis C.K.'s HBO series Lucky Louie.[10] She auditioned to star as Claire Bennet in the NBC science fiction drama Heroes (2007) but was unsuccessful and later called this her \"rock bottom\" experience.[2] In April 2007, she played Violet Trimble in the Fox action drama Drive, but the show was canceled after seven episodes.[1]\n\nStone made her feature film debut in Greg Mottola's comedy Superbad (2007), co-starring Michael Cera and Jonah Hill. The film tells the story of two high school students who go through a series of comic misadventures after they plan to buy alcohol for a party. To play the role of Hill's romantic interest, she dyed her hair red.[19] A reviewer for The Hollywood Reporter found her \"appealing\", but felt that her role was poorly written.[20] Stone has described the experience of acting in her first film as \"amazing ... [but] very different than other experiences I've had since then\".[21] The film was a commercial success, and earned her the Young Hollywood Award for Exciting New Face.[22][23]\n\nThe following year, Stone starred in the comedy The Rocker (2008) playing Amelia Stone, the \"straight face\" bass guitarist in a band; she learned to play the bass for the role.[24] The actress, who describes herself as \"a big smiler and laugher\", has admitted that she found it difficult portraying a character whose personality traits were so different from her own. The film, and her performance, received negative reviews from critics and was a commercial failure.[25][26] Her next release, the romantic comedy The House Bunny, performed better at the box-office, becoming a moderate commercial success.[27] The film sees her play the president of a sorority, and perform a cover version of the Waitresses' 1982 song \"I Know What Boys Like\".[28] Reviews for the film were generally negative,[29] though she was praised for her supporting role,[30] and TV Guide's Ken Fox wrote of Stone that: \"She's positively incandescent, lighting up a movie that would be pretty dim without her.\"[31]\n\nBreakthrough (2009–2011)\n\nZombieland world premiere in 2009 Stone at theworld premiere in 2009\n\nStone appeared in three films released in 2009. The first of these was opposite Matthew McConaughey, Jennifer Garner and Michael Douglas in Mark Waters' Ghosts of Girlfriends Past. Loosely based on Charles Dickens' 1843 novella A Christmas Carol, the romantic comedy has her playing a ghost who haunts her former boyfriend. Critical reaction to the film was negative, though it was a modest commercial success.[32][33] Her most financially profitable venture that year was Ruben Fleischer's $102.3 million-grossing horror comedy film Zombieland,[34] in which she features alongside Jesse Eisenberg, Woody Harrelson and Abigail Breslin. In the film, she appeared as a con artist and survivor of a zombie apocalypse, in a role which Empire's Chris Hewitt found to be \"somewhat underwritten\".[35] In a more positive review, the critic for The Daily Telegraph wrote: \"[T]he hugely promising Stone ... [is] a tough cookie who projects the aura of being wiser than her years.\"[36] Stone's third release in 2009 was Kieran and Michelle Mulroney's Paper Man, a comedy-drama which disappointed critics.[37]\n\nStone provided the voice of an Australian Shepherd in Marmaduke (2010), a comedy from director Tom Dey, which is based on Brad Anderson's long-running comic strip of the same name.[38] Her breakthrough came the same year with a starring role in Easy A, a teen comedy directed by Will Gluck.[39][40] Partially based on Nathaniel Hawthorne's 1850 historical romance novel The Scarlet Letter, the film tells the story of Olive Penderghast (Stone), a high school student who becomes embroiled in a comic sex scandal after a false rumor circulates that she is sexually promiscuous. Stone read the script before the project was optioned for production, and pursued it with her manager while production details were being finalized. She found the script \"so different and unique from anything I'd read before\", saying that it was \"funny and sweet\". When Stone discovered that the film had begun production, she met with Gluck, expressing her enthusiasm for the project. A few months later, the audition process started and she met again with Gluck, becoming one of the first actresses to audition.[41] The film received positive critical reviews, and Stone's performance was considered its prime asset.[42] Anna Smith of Time Out commented: \"Stone gives a terrific performance, her knowing drawl implying intellect and indifference with underlying warmth.\"[43] With a total box office of $75 million, the film was a commercial success.[44] Stone was nominated for a BAFTA Rising Star Award and a Golden Globe Award for Best Actress in a Musical or Comedy, and won the MTV Movie Award for Best Comedic Performance.[45]\n\nIn October 2010, Stone hosted an episode of NBC's late-night sketch comedy Saturday Night Live; her appearances included a sketch playing off her resemblance to Lindsay Lohan.[46] Stone described it as \"the greatest week of my life\".[4][47] She hosted it again in 2011, appeared in an episode in 2014, and in its 40th anniversary special in 2015.[48] A brief appearance in the sex comedy Friends with Benefits (2011) reunited her with Gluck.[49] She followed this with a supporting role in Glenn Ficarra and John Requa's romantic comedy Crazy, Stupid, Love (2011) alongside Steve Carell, Ryan Gosling and Julianne Moore. The film features her as a law school graduate, and the love interest of Gosling's character. Despite finding \"some inevitable collapses into convention\" in the film, Drew McWeeny of HitFix wrote that Stone \"ties the whole film together\".[50] At the 2012 Teen Choice Awards, she won the Choice Movie Actress – Comedy award for her performance in the film.[51] Crazy, Stupid, Love was a box office success, grossing $142.9 million worldwide with a production budget of $50 million.[52]\n\nDisillusioned at being typecast as the \"sarcastic interest of the guy\", Stone co-starred with Viola Davis in Tate Taylor's period drama The Help (2011), a film she found to be challenging.[53] The film is based on Kathryn Stockett's 2009 novel of the same name and is set in 1960s Jackson, Mississippi. She met with Taylor to express a desire to work in the film. Taylor has said: \"Emma was completely awkward and dorky, with her raspy voice, and she sat down and we got a little intoxicated and had a blast, and I just thought, 'God! God! This is Skeeter.\"[54] She was cast as Eugenia \"Skeeter\" Phelan, an aspiring writer learning about the lives of the African-American maids. In preparation for the part, she trained to speak in a Southern dialect; she also educated herself on the Civil Rights Movement through literature and film.[55] With a worldwide gross of $216 million against a budget of $25 million, The Help became Stone's most commercially successful film to that point.[56] The film, and her performance, received positive reviews from critics.[57] Writing for Empire, Anna Smith thought that Stone was \"well-meaning and hugely likable\" despite finding flaws in the character.[58] The film was nominated for an Academy Award for Best Picture,[59] and won Best Ensemble Cast from the Women Film Critics Circle and the Broadcast Film Critics Association.[60][61]\n\nThe Amazing Spider-Man, Birdman, and Broadway (2012–2015)\n\nStone declined a role in the action comedy film 21 Jump Street after signing on to Marc Webb's 2012 film The Amazing Spider-Man, a reboot of Sam Raimi's Spider-Man series.[62][63] She portrayed Gwen Stacy, the love interest of the title character (played by Andrew Garfield).[64] Stone returned to a blond hair color for the role, having dyed it red previously.[65][66] She told The Vancouver Sun that she felt responsible to educate herself about Spider-Man and admitted that she had not read the comics: \"My experience was with the Sam Raimi movies ... I always assumed that Mary Jane was his first love\",[67] adding that she was only familiar with Stacy's character from Bryce Dallas Howard's portrayal in Spider-Man 3.[68][69] The Amazing Spider-Man was a commercial success and was the seventh highest-grossing film of 2012 with global revenues of $757.9 million.[70] Entertainment Weekly's Lisa Schwarzbaum found Stone \"irresistible\",[71] and Ian Freer of Empire magazine was particularly impressed with Stone's and Garfield's performances.[72] At the annual People's Choice Awards ceremony, she was nominated for three awards, including Favorite Movie Actress.[73] Later that year, Stone voiced a role in the crime-based video game, Sleeping Dogs, which earned her a Spike Video Game Award for Best Performance by a Human Female.[74]\n\nStone began 2013 with a voice role in DreamWorks' The Croods, an animated feature nominated for an Academy Award for Best Animated Feature.[75] This followed with an appearance in Movie 43, an anthology film which consists of sixteen short stories—she played the title role in the segment entitled \"Veronica\".[76] The actress collaborated with Ryan Gosling and Sean Penn in Ruben Fleischer's Gangster Squad (2013), a crime thriller set in Los Angeles during the 1940s.[77] The New York Times' A. O. Scott dismissed the film as \"a hectic jumble of fedoras and zoot suits\", but praised her pairing with Gosling.[78] Stone expressed a desire to work with Gosling on more projects.[79]\n\nStone at WonderCon in 2012\n\nIn 2014, Stone reprised the role of Gwen Stacy in The Amazing Spider-Man 2. In an interview with Total Film, the actress explained that her character was not dependent on the film's protagonist. \"She saves him more than he saves her. She's incredibly helpful to Spider-Man ... He's the muscle, she's the brains.\"[80] Her performance was well received by critics;[81] an Empire reviewer praised her for standing out in the film: \"Stone is the Heath Ledger of this series, doing something unexpected with an easily dismissed supporting character.\"[82] The role earned her the Favorite Movie Actress award at the 2015 Kids' Choice Awards.[83] Later that year, Stone took on a role in Woody Allen's romantic comedy Magic in the Moonlight, a modest commercial success.[84] A. O. Scott criticized her role, and pairing with Colin Firth, describing it as \"the kind of pedantic nonsense that is meant to signify superior intellect\".[85]\n\nThe black comedy-drama Birdman, from director Alejandro González Iñárritu, was Stone's final film release in 2014. Co-starring Michael Keaton and Edward Norton, the film features her in the role of Sam Thomson, the recovering-addict daughter of actor Riggan Thomson (Keaton), who becomes his assistant. Iñárritu created the character based on his experience with his daughter.[86] Birdman was critically acclaimed,[87] and was the most successful film at the 87th Academy Awards; it was nominated for nine awards, winning four, including Best Picture.[88] The Movie Network considered it one of Stone's best performances to date and Robbie Collin of The Daily Telegraph was impressed with a monologue she delivers, which he thought was \"like a knitting needle to the gut\".[89][90] She received numerous accolades for her portrayal, including nominations for an Academy, a BAFTA, a Golden Globe, a Screen Actors Guild, and a Critics' Choice Movie award for Best Supporting Actress.[91]\n\nFrom November 2014 to February 2015, Stone starred in a revival of the Broadway musical Cabaret as Sally Bowles, taking over the role from Michelle Williams.[92] Considering it to be \"the most nerve-racking thing ever\", Stone told the Entertainment Weekly magazine that she listened to a French radio station to mentally prepare herself for the role.[93][94] Variety's Marilyn Stasio was critical of her singing and found her performance \"a bit narrow as an emotional platform, but a smart choice for her acting skills, the perfect fit for her sharp intelligence and kinetic energy.\"[95] Both of Stone's 2015 films‍—‌the romantic comedy-drama Aloha, and the mystery drama Irrational Man‍—‌were critical and commercial failures, and her roles were panned by critics.[84][96] In Cameron Crowe's Aloha, she took on the role of an air force pilot alongside Bradley Cooper, and in the Woody Allen-directed Irrational Man, she portrayed the romantic interest of Joaquin Phoenix's character, a philosophy professor. The former was controversial for whitewashing the cast, as Stone's character was meant to be of Asian, Hawaiian, and Swedish descent; Stone later regretted the project, acknowledging whitewashing as a widespread problem in Hollywood.[97] Despite the criticism, she was nominated for Choice Movie Actress – Comedy at the 2015 Teen Choice Awards.[98] Stone also appeared in the music video for Win Butler's single \"Anna\".[99]\n\nLa La Land and beyond (2016–present)\n\nDuring her Cabaret show, Stone met director Damien Chazelle, who, impressed with her performance, cast her in his musical comedy-drama La La Land.[100] The project, which marked her third collaboration with Gosling, featured Stone as Mia Dolan, an aspiring actress living in Los Angeles.[101] Stone borrowed several real-life experiences for her character, and in preparation, watched The Umbrellas of Cherbourg and films of Fred Astaire and Ginger Rogers.[102][103] For the musical's soundtrack, she recorded six songs.[a] La La Land served as the opening film at the 2016 Venice Film Festival, and received highly positive reviews.[105] Besides being Stone's highest-rated film on the review aggregator Rotten Tomatoes,[106] the film was successful at the box office, earning over $440 million against its $30 million budget.[107] Writing for The Guardian, Peter Bradshaw reviewed, \"Stone has never been better: superbly smart, witty, vulnerable, her huge doe eyes radiating intelligence even, or especially, when they are filling with tears.\"[108] Stone received an Academy, BAFTA, Golden Globe and a SAG Award for Best Actress.[109]\n\nManiac in 2018 Stone at an event forin 2018\n\nStone's sole film release of 2017 was the sports drama Battle of the Sexes, based on the 1973 eponymous match between tennis players Billie Jean King (Stone) and Bobby Riggs (Steve Carell). In preparation, Stone met with King, watched old footage and interviews of her, trained with a dialect coach to speak in King's accent, and drank high-calorie protein shakes to gain 15 pounds (6.8 kg).[110][111] The film premiered to positive reviews at the 2017 Toronto International Film Festival, and certain critics considered Stone's performance to be the best of her career.[112] Benjamin Lee of The Guardian praised her for playing against type, and credited her for being \"strong\" and \"convincing\" in the part.[113] Even so, the film earned less than its $25 million budget.[114] Stone received her fourth Golden Globe nomination for it, and attended the ceremony with King.[115]\n\nIn 2018, Stone and Rachel Weisz starred as Abigail Masham and Sarah Churchill, two cousins fighting for the affection of Queen Anne (Olivia Colman), in Yorgos Lanthimos's historical comedy-drama The Favourite. Stone found it challenging being an American among a British cast, and had difficulty in mastering the accent.[116] The film premiered at the 75th Venice International Film Festival in August.[117] Michael Nordine of IndieWire praised Stone for taking on a bold role after La La Land, and termed the three leading ladies \"a majestic triumvirate in a period piece that's as tragic as it is hilarious.\"[118] For The Favourite, Stone received her fifth Golden Globe nomination and third Oscar nomination.[119][120] That September, she featured in and served as an executive producer for the Netflix dark comedy miniseries Maniac, co-starring Jonah Hill and directed by Cary Fukunaga. Stone and Hill played two strangers, Annie Landsberg and Owen Milgrim, whose lives are transformed due to a mysterious pharmaceutical trial. An admirer of Fukunaga's work, Stone agreed to the project without reading the script.[121] Lucy Mangan of The Guardian praised Stone and Hill for playing against type and for delivering career-best performances;[122] Judy Berman of Time was similarly impressed with their growth as actors since Superbad and took note of the complexity in their performances.[123] In the same year, Stone appeared alongside Paul McCartney in a music video for his song \"Who Cares\".[124]\n\nStone reprised her role of Wichita in Zombieland: Double Tap (2019), which received mixed reviews and grossed $122 million worldwide.[125][126] She will next star in Cruella, a live-action spin-off of One Hundred and One Dalmatians, in which she will portray Cruella de Vil (originally played by Glenn Close in the 1996 adaptation).[127][128] She is also set to return as the voice of Eep in the sequel to The Croods and to star in the drama Love May Fail, based on Matthew Quick's 2015 novel.[129][130][131]\n\nPersonal life\n\nStone moved from Los Angeles to Greenwich Village, New York City, in 2009.[12] In 2016, she moved back to Los Angeles.[10] Despite frequent media coverage, the actress has refused to speak about her private life. Concerned with living a \"normal\" life, she has said that she finds little value in media attention.[132] She has expressed her fondness for her profession,[10] and has cited actress Diane Keaton as an influence, who is (in Stone's words) \"one of the most covered-up actresses of all time\". She has also named actress and singer-songwriter Marion Cotillard as one of her inspirations.[2]\n\nStone has a close relationship with her family.[2] She says: \"I am blessed with a great family and great people around me that would be able to kick me in the shins if I ever for one minute got lost up in the clouds. I've been really lucky in that sense.\"[133] During the production of The Amazing Spider-Man in 2010, Stone dated co-star Andrew Garfield.[134] Their relationship was reported in the media, with various speculations. The couple refused to talk about it publicly, though they made several appearances together. In 2014, on an occasion in New York, Stone and Garfield encouraged paparazzi to visit websites that spread awareness of causes such as autism.[135] In 2015, they were reported to have broken up.[136][137] Since 2017, Stone has been in a romantic relationship with Saturday Night Live segment director Dave McCary.[138] They became engaged in December 2019.[139]\n\nAccording to Stone, she suffers from asthma, which she discovered after having difficulty breathing while filming Easy A.[140] Her mother was diagnosed with triple-negative breast cancer and was cured in 2008.[141] Stone and her mother celebrated by getting tattoos of birds' feet, designed by Paul McCartney, a reference to the Beatles' \"Blackbird\", which is a song she and her mother love.[142] She appeared in a Revlon campaign that promoted breast cancer awareness.[143] In 2011, the actress featured in a collaborative video between Star Wars and Stand Up to Cancer, which aimed to raise funds for cancer research.[144] Two years later, she attended an event by Gilda's Club, an organization working for a similar purpose.[145] From 2012 to 2014, she hosted the Entertainment Industry Foundation's Revlon Run/Walk, which helps fight women's cancer.[146]\n\nStone, alongside three other celebrities, was present at the 2012 Nickelodeon HALO Awards, a television special that profiled five teenagers who are \"Helping And Leading Others\" (HALO).[147] She attended the 2014 Earth Hour, a worldwide movement for the planet organized by the World Wide Fund for Nature.[148] In 2015, she was part of a fundraising event in support of the Motion Picture & Television Fund, which helps people in the television and film industry with limited or no resources.[149] In 2018, she collaborated with 300 women in Hollywood to set up the Time's Up initiative to protect women from harassment and discrimination.[150]\n\nMedia image\n\nSeveral media publications consider Stone one of her generation's most talented actresses.[153][154][155] Commenting on her performance in The Help, Kirk Honeycutt of The Hollywood Reporter called her \"one of our very best young actresses\".[156] She is known for starring both in high-profile, mainstream productions and in low-budget independent films. Time's Daniel D'Addario describes the latter as \"substantive risk\" and adds that taking on a role in them provides her an opportunity to \"try something new and to get credibility\".[157] Analyzing her on-screen persona, Jessica Kiang of Indiewire noted that Stone \"usually [plays] the approachable, down-to-earth, girl-next-door type, [and] in person she demonstrates many of those qualities too, along with an absolute refusal to take herself too seriously.\"[158]\n\nAs her career in Hollywood films has developed, Stone has become a successful and popular actress.[159] In 2008, she topped Saturday Night Magazine's Top 20 Rising Stars Under 30 and was included in a similar list compiled by Moviefone.[160][161] LoveFilm placed her on their list of 2010 Top 20 Actresses Under 30, and her performance in Easy A was included in Time's Top 10 Everything of 2010.[162][163] She appeared in the 2013 Celebrity 100, a compilation of the 100 most powerful people in the world, as selected annually by Forbes. The magazine reported that she had earned $16 million from June 2012 to June 2013.[164] That same year, she was ranked first in the magazine's Top 10 Best Value Stars.[165] In 2015, Forbes published that she had become one of the highest-paid actresses with earnings of $6.5 million.[166] The magazine would rank her as the world's highest-paid actress two years later with yearly earnings of $26 million.[167] In 2017, she was featured by Time as one of the 100 most influential people in the world.[168]\n\nStone has been described as a style icon‍—‌the media cites her hair, eyes, and husky voice as her trademarks.[151][152] Vogue credits the actress for her \"sophisticated, perfectly put-together looks\", writing that \"her charisma, both on-screen and off-, has charmed many.\"[169] In 2009, she featured in AskMen's Top 99 Women, FHM's 100 Sexiest Women in the World, and Maxim magazine's Hot 100;[133][170] the latter also placed her on the list on three other occasions‍—‌2010, 2011, and 2014.[171] She continued to be featured in AskMen's annual beauty lists from 2010 to 2015, ranking among the top forty each year.[172] In 2011, she appeared in Victoria's Secret's list of What is Sexy? as the Sexiest Actress.[173] She was mentioned in several other media outlet lists that year, including People magazine's 100 Most Beautiful Women, each of FHM's and FHM Australia's 100 Sexiest Women in the World, and Men's Health magazine's 100 Hottest Women.[174] She ranked sixth on Empire's list of the 100 Sexiest Movie Stars in 2013.[175] Stone was named the best dressed woman of 2012 by Vogue magazine and was featured in similar listings by Glamour in 2013 and 2015, and People in 2014.[176][177] In 2017, Buzznet named her one of the world's most beautiful women.[178]\n\nWorks and accolades\n\nAccording to the review aggregator site Rotten Tomatoes and the box-office site Box Office Mojo, Stone's most critically acclaimed and commercially successful films are Superbad (2007), Zombieland (2009), Easy A (2010), Crazy, Stupid, Love (2011), The Help (2011), The Amazing Spider-Man (2012), The Amazing Spider-Man 2 (2014), Birdman (2014), La La Land (2016), Battle of the Sexes (2017), and The Favourite (2018).[106][179]\n\nStone has been nominated for three Academy Awards: Best Supporting Actress for Birdman and The Favourite, and Best Actress for La La Land; and four British Academy Film Awards: BAFTA Rising Star Award, Best Supporting Actress for Birdman and The Favourite, and Best Actress in a Leading Role for La La Land. She won the Best Actress award at both ceremonies for La La Land.[45][91][109] Stone also won Best Actress in a Comedy or Musical at the 74th Golden Globe Awards, Outstanding Performance by a Female Actor in a Leading Role at the 23rd Screen Actors Guild Awards and Volpi Cup for Best Actress at Venice Film Festival for her role in La La Land.[109][180][181]\n\nSee also\n\nNotes", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/39/EmmaStoneSept09.jpg/220px-EmmaStoneSept09.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Emma_Stone_%2830498079137%29_%28cropped%29.jpg/220px-Emma_Stone_%2830498079137%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/24px-Flag_of_New_York_City.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Emma_Stone_2011_2.jpg/200px-Emma_Stone_2011_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Ballerina-icon.jpg/17px-Ballerina-icon.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e0/WPVG_icon_2016.svg/21px-WPVG_icon_2016.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/ValleyYouthTheatre.jpg/220px-ValleyYouthTheatre.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Emma_Stone%2C_Andrew_Garfield_2014_%28cropped%29.jpg/220px-Emma_Stone%2C_Andrew_Garfield_2014_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg/220px-Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/9/9a/Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Emma_Stone_by_Gage_Skidmore.jpg/180px-Emma_Stone_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Emma_Stone_Signature.svg/150px-Emma_Stone_Signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Emma_Stone", "title": "Emma Stone", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}