{"url": "www.politico.com/story/2017/09/22/full-statement-john-mccain-on-voting-no-on-graham-cassidy-243030", "text": "\"I would consider supporting legislation similar to that offered by my friends Senators Graham and Cassidy were it the product of extensive hearings, debate and amendment. But that has not been the case,\" Sen. John McCain said in a statement. | Jacquelyn Martin/AP Full statement: John McCain to vote no on Graham-Cassidy health care bill\n\nHere's Sen. John McCain's full statement on not supporting Sens. Lindsey Graham and Bill Cassidy's Obamacare repeal bill, issued Sept. 22, 2017.\n\nAs I have repeatedly stressed, health care reform legislation ought to be the product of regular order in the Senate. Committees of jurisdiction should mark up legislation with input from all committee members, and send their bill to the floor for debate and amendment. That is the only way we might achieve bipartisan consensus on lasting reform, without which a policy that affects one-fifth of our economy and every single American family will be subject to reversal with every change of administration and congressional majority.\n\nAdvertisement\n\nI would consider supporting legislation similar to that offered by my friends Senators Graham and Cassidy were it the product of extensive hearings, debate and amendment. But that has not been the case. Instead, the specter of September 30th budget reconciliation deadline has hung over this entire process.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nWe should not be content to pass health care legislation on a party-line basis, as Democrats did when they rammed Obamacare through Congress in 2009. If we do so, our success could be as short-lived as theirs when the political winds shift, as they regularly do. The issue is too important, and too many lives are at risk, for us to leave the American people guessing from one election to the next whether and how they will acquire health insurance. A bill of this impact requires a bipartisan approach.\n\nSenators Alexander and Murray have been negotiating in good faith to fix some of the problems with Obamacare. But I fear that the prospect of one last attempt at a strictly Republican bill has left the impression that their efforts cannot succeed. I hope they will resume their work should this last attempt at a partisan solution fail.\n\nI cannot in good conscience vote for the Graham-Cassidy proposal. I believe we could do better working together, Republicans and Democrats, and have not yet really tried. Nor could I support it without knowing how much it will cost, how it will effect insurance premiums, and how many people will be helped or hurt by it. Without a full CBO score, which won't be available by the end of the month, we won't have reliable answers to any of those questions.\n\nI take no pleasure in announcing my opposition. Far from it. The bill's authors are my dear friends, and I think the world of them. I know they are acting consistently with their beliefs and sense of what is best for the country. So am I.\n\nI hope that in the months ahead, we can join with colleagues on both sides of the aisle to arrive at a compromise solution that is acceptable to most of us, and serves the interests of Americans as best we can.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://static.politico.com/d1/d8/3dec710b498196d5457f24537b6e/170922-john-mccain.jpg", "https://static.politico.com/dims4/default/b411a73/2147483647/resize/1160x%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd1%2Fd8%2F3dec710b498196d5457f24537b6e%2F170922-john-mccain.jpg"], "top_img": "https://static.politico.com/d1/d8/3dec710b498196d5457f24537b6e/170922-john-mccain.jpg", "keywords": [], "authors": ["Burgess Everett", "Politico Staff", "Seung Min Kim"], "canonical_link": "https://www.politico.com/story/2017/09/22/full-statement-john-mccain-on-voting-no-on-graham-cassidy-243030", "title": "Full statement: John McCain to vote no on Graham-Cassidy health care bill", "meta_data": {"article": {"opinion": "false"}, "og": {"title": "Full statement: John McCain to vote no on Graham-Cassidy health care bill", "description": "&quot;I take no pleasure in announcing my opposition,&quot; he writes.", "type": "article", "url": "https://www.politico.com/story/2017/09/22/full-statement-john-mccain-on-voting-no-on-graham-cassidy-243030", "image": "https://static.politico.com/d1/d8/3dec710b498196d5457f24537b6e/170922-john-mccain.jpg", "fb_appid": 114037015331397, "site_name": "POLITICO"}, "description": "&quot;I take no pleasure in announcing my opposition,&quot; he writes.", "viewport": "width=device-width, initial-scale=1", "theme-color": "#dc0228", "fb": {"pages": 62317591679}, "twitter": {"card": "summary_large_image", "site": "@politico", "creator": "@politico"}, "host": "www.politico.com", "build": "release/cge-ghana c9cdd63 2020-04-15T19:31:28Z"}, "movies": [], "publish_date": 1506009600.0, "source": "http://www.politico.com", "summary": ""}