{"url": "https://en.wikipedia.org/wiki/What_Up_with_That", "text": "This article is about the SNL sketch. For other topics, see What's Up with That (disambiguation)\n\n\"What Up with That?\" is a recurring sketch on the NBC television series Saturday Night Live which first aired in 2009. It stars Kenan Thompson as Diondre Cole,[1] host of a talk show on BET. Supporting characters include Taran Killam as the show's announcer (originally Will Forte), Vanessa Bayer (originally Jenny Slate) and Cecily Strong (originally Nasim Pedrad) as backup singers/dancers Pippa and Piper, respectively, Fred Armisen as Giuseppe, a Kenny G-like saxophone player, and Jason Sudeikis as Vance, an overzealous track-suit-wearing backup dancer.[2] The sketch has incorporated unannounced cameo appearances by a number of celebrities.[3][4] In addition to this, cast members frequently play roles adding to the chaos during Cole's performances, such as Paul Brittain and Abby Elliott's dancing performances as Vili Fualaau and Mary Kay Letourneau, a student and teacher who made news for their sexual relationship.[5]\n\nFormat [ edit ]\n\nThe show opens with Cole singing the show's lengthy theme song, \"What Up with That\". Cole welcomes the viewers to the show but his introduction to the show's topic generally leads into a reprise of the theme song. Once the reprise is finished, he then introduces the show's three guests, the third always being Bill Hader playing Fleetwood Mac guitarist Lindsey Buckingham. As soon as the first guest begins talking, Cole echoes their comments in a sing-song manner (often disrupting them), eventually leaping back up to begin singing the theme song yet again. In this manner, the multiple theme song performances completely take up the show's time, and the other two guests do not get to speak (although Robin Williams did have a couple of lines in the December 4, 2010 episode,[6] as well as Kate Upton in the February 18, 2012 episode), including Lindsey Buckingham, who, according to Cole, has attended dozens of times without getting interviewed but still remains a good sport.\n\nIn the May 14, 2011 episode, both the Bill Hader impersonation and the real Lindsey Buckingham appeared. The opening guest was that week's SNL musical guest, Paul Simon, who opened his interview by complaining about how Diondre invites Buckingham each week, but never gives him a chance to talk. While Hader's impersonation had no lines once again, the real Buckingham played guitar and spoke up for him.\n\nIn a backstage clip from the show on February 18, 2012, Cole lets Buckingham (Hader) list the US Presidents and their birthdays. This marked the first time that Hader's Buckingham ever received an opportunity to speak.\n\nIn the December 15, 2012, episode, Samuel L. Jackson said \"fuck\" and \"bullshit\" on the live broadcast, prompting Cole to respond with \"Come on, Sam...that costs money.\"[7]\n\nReception [ edit ]\n\nThe skit has received mixed reviews. Television web site Hitfix applauded Thompson's performance, stating that it works because he can actually sing.[8] However, Entertainment Weekly suggested that the skit was getting old over time, asking: \"How many more times can they fall back on this one?\"[9] Rolling Stone would go on to name the sketch as a breakout moment for Thompson. [10]\n\nInternally, among the writers of the sketch there was worry that the bit would not work with Bryan Tucker noting that if was feared that the sketch \"might be too random and silly.\" The night of its premiere, though, Tucker noted that \"After the sketch was over, everyone stopped working and lined the backstage hallway to give Kenan a high-five or a pat on the back\" and that they were \"treating the moment like it was a high school football game, and the home team had just won.\" [11]\n\nEpisodes [ edit ]\n\nIn addition to these sketches, Kenan Thompson as Diondre Cole, Jason Sudeikis as the backup dancer, and Fred Armisen as the saxophonist appeared in the monologue of the April 17, 2010 episode hosted by Ryan Phillippe in which various SNL characters question why MacGruber has a movie yet they do not.[18]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/What_Up_with_That", "title": "What Up with That", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}