{"url": "https://www.etonline.com/sophia-bush-gets-real-about-leaving-chicago-pd-it-was-my-dream-job-and-i-was-miserable-92932", "text": "Fans were left saddened and a bit confused when Sophia Bush left Chicago PD at the end of the show's fourth season.\n\nThe 35-year-old actress has yet to directly address why she exited the hit NBC drama, and she's still not ready to fully reveal her decision. She did, however, give a little insight into her decision to step away from her role as Detective Erin Lindsay during an appearance on this week's episode of Refinery29's UnStyled podcast.\n\n\"I don't have to give everyone the specific breakdown of exactly why I left until I'm ready to do that. But, the overarching theme for me was that I landed my dream job. I landed this job that, since I was 20 years old and trying to become an actor, I said I wanted,\" she explained. \"And aspects of it, don't get me wrong, were wonderful. But, I realized... by the end of the second season I couldn't do that job anymore.\"\n\nQuitting a dream job is never easy, and Bush did not leave hers hastily. In fact, she gave her bosses on the Dick Wolf-produced show plenty of time, sitting down with them between filming the third and fourth seasons.\n\n\"I said, ‘Here's where we are. Here's everything you're aware of. Here's how I'm coming to you today. If something really drastic doesn't change, I'm leaving at the end of the year.' Because I understand how the business works and how women are treated,\" Bush recalled. \"I said, ‘I'm not giving you two weeks notice and I'm not coming in here throwing s**t and breaking lamps and saying I'm never coming back. I'm giving you 23 episodes notice. I'm giving you that much time. So there will be no conversation in which I was hysterical, emotional, in which I was being a quote irrational female or whatever you want to put on it. I'm literally sitting in front of you like cool as a cucumber. If this has to be, like, a big swinging dick competition, I promise you I will win. But know this now: If we're not having a very different conversation by Christmas, then you know with 100 percent certainty in December that come the end of April, I'm leaving.'\" The One Tree Hill alum admitted that the conversation was \"so liberating.\" \"I immediately felt like these steel anvils had been pulled off my chest. And it was then that I realized I had been drowning, and it was then that I knew just how miserable I was going to work every day,\" she said. Despite the love she still has for her fellow cast members and the crew and how close she had grown to many of them, Bush knew she had to leave her TV family. \"What you start to realize is that, like, if your house was burning down, you wouldn't hang out inside because your brother was in there and you loved him. You'd be like, ‘Yo, I love you. Let's get out of this house!'\" she said of her though process. \"...Not to put it on anybody else, but for me, it felt like I was trapped in a burning building. I was just so unhappy and it was my dream job and I was miserable and I had to go.\" Though some of the fan reactions she received were harsh, she still has not given in to their demands to reveal why she left the show, saying, \"I had to respect myself in a situation where I didn’t feel respected.\" Since leaving Chicago PD, Bush has inked a talent and development deal with 20th Century Fox TV. When she shared the news to Instagram in October, fans continued to berate her about the exit. Though she didn't respond to all of their comments, she did send her love to the ones making positive statements, and even directly responded to one she felt disrespected her, writing, \"I have never stated why I left... In the same way I don't appreciate or stand for people being demeaned or belittled in the world, I am no longer willing to be demeaned, called names, or accused of ruining people's lives in my pursuit of happiness and fulfillment.\"\n\nNext up for Bush? That TV deal, plus continuing to focus on her biggest passions, advocacy and social work, which she is very open about on social media.\n\n\"When I talk about that stuff, people go nuts about it, because they can't process that I'm a social liberal, that I believe in equality for all, that I believe we should smash the patriarchy and systemic racism and actually make healthcare more easily accessible than weaponry,\" she told the podcast hosts. \"As they like to call me a 'libtard,' or a coastal elite, they're so shocked to find out that I've been a sharp shooter since I was 12 years old.\"\n\nRELATED CONTENT:\n\nSophia Bush Dishes on First Onscreen Kiss Ever With Ryan Reynolds\n\n'One Tree Hill' Cast & Crew Issue Statement on EP's Alleged 'Traumatizing' Behavior\n\nEXCLUSIVE: Sophia Bush Is 'So Proud' of Political Protesters: 'I Have a Lot of Hope'\n\nSophia Bush Reveals She's Not Looking for 'The One,' Opens Up About Marriage to Chad Michael Murray This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-01/1280_sophia_bush_01282017_632967374.jpg?itok=sHNKxEC2", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-12/gettyimages-1074564214.jpg?h=8e24ee96&itok=_1CuPn72"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-01/1280_sophia_bush_01282017_632967374.jpg?itok=sHNKxEC2", "keywords": [], "authors": ["Emily Krauser"], "canonical_link": "https://www.etonline.com/sophia-bush-gets-real-about-leaving-chicago-pd-it-was-my-dream-job-and-i-was-miserable-92932", "title": "Sophia Bush Gets Real About Leaving 'Chicago PD': 'It Was My Dream Job and I Was Miserable'", "meta_data": {"article": {"opinion": "false"}, "title": "Sophia Bush Gets Real About Leaving 'Chicago PD': 'It Was My Dream Job and I Was Miserable' | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/sophia-bush-gets-real-about-leaving-chicago-pd-it-was-my-dream-job-and-i-was-miserable-92932", "title": "Sophia Bush Gets Real About Leaving 'Chicago PD': 'It Was My Dream Job and I Was Miserable'", "description": "The 'One Tree Hill' alum opened during this week's episode of Refinery29's UnStyled podcast.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-01/1280_sophia_bush_01282017_632967374.jpg?itok=sHNKxEC2", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 'One Tree Hill' alum opened during this week's episode of Refinery29's UnStyled podcast.", "title": "Sophia Bush Gets Real About Leaving 'Chicago PD': 'It Was My Dream Job and I Was Miserable'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Emily Krauser‍", "url": "https://www.etonline.com/sophia-bush-gets-real-about-leaving-chicago-pd-it-was-my-dream-job-and-i-was-miserable-92932", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-01/1280_sophia_bush_01282017_632967374.jpg?itok=sHNKxEC2"}, "description": "The 'One Tree Hill' alum opened during this week's episode of Refinery29's UnStyled podcast.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, TV, Sophia Bush, Chicago PD", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}