{"url": "https://en.wikipedia.org/wiki/Dana_Scully", "text": "Dana Katherine Scully is a fictional character in the Fox science fiction-supernatural television series The X-Files, played by Gillian Anderson. Scully is an FBI agent and a medical doctor (M.D.), partnered with fellow Special Agent Fox Mulder for the first seven, and the tenth and eleventh seasons, and with John Doggett in the eighth and ninth seasons. In the television series, they work out of a cramped basement office at FBI headquarters in Washington, D.C. to investigate unsolved cases labeled \"X-Files\". In 2002, Scully left government employment, and in 2008 she began working as a surgeon in Our Lady of Sorrows, a private Catholic hospital – where she stayed for seven years, until rejoining the FBI. In contrast to Mulder's credulous \"believer\" character, Scully is the skeptic for the first seven seasons, choosing to base her beliefs on what science can prove. She later on becomes a \"believer\" after Mulder's abduction at the end of season seven.\n\nScully has appeared in all but five episodes of The X-Files, and in the 20th Century Fox films The X-Files, released in 1998, and The X-Files: I Want to Believe, released ten years later. The episodes she does not appear in are \"3\", \"Zero Sum\", \"Unusual Suspects\" and \"Travelers\" plus \"The Gift\" (excluding archive footage). The eleventh season marked Anderson's final time portraying the character.[1]\n\nBackground [ edit ]\n\nDana Katherine Scully was born on February 23, 1964 in Annapolis, Maryland, to William (Don S. Davis) and Margaret Scully (Sheila Larken), into a close-knit Catholic family with Irish ancestry.[2][3] She has an older brother, Bill Jr., an older sister, Melissa, and a younger brother, Charles, who is never seen on the show except in flashbacks.[4] Scully's father was a navy captain, who died of a heart attack in early January 1994.[5] Dana Scully grew up in Annapolis, Maryland and later in San Diego, California. As a young girl, Scully's favorite book was Moby-Dick and she came to nickname her father \"Ahab\" from the book, and in return, he called her \"Starbuck\". Due to this, she named her dog Queequeg.[6]\n\nScully attended the University of Maryland, and in 1986 received a Bachelor of Science degree in physics. Her undergraduate thesis was titled Einstein's Twin Paradox: A New Interpretation.[7] Just out of medical school at Stanford University she was recruited by the FBI; she accepted the agency's offer of employment because she felt she could distinguish herself there. After two years in the bureau, Division Chief Scott Blevins assigned her to work with agent Fox Mulder.\n\nStorylines [ edit ]\n\nUpon being partnered with Mulder, Scully maintained her medical skills by acting as a forensic pathologist, often performing or consulting on autopsies of victims on X-Files cases.[8]\n\nIn season two, Scully was kidnapped by an ex-FBI agent turned mental patient named Duane Barry,[9] and then taken from Barry by a military covert operation that were working with the alien conspirators,[10] but was later returned.[3] In season three she found out that a super hi-tech microchip has been implanted in the back of her neck. After having it removed, she developed cancer in the fourth season[11] and was hospitalized after the cancer became terminal. She was saved after Mulder broke into the Department of Defense to retrieve another chip to be implanted back into her neck. At the time, Scully was also undergoing experimental medical treatments and was having a dramatic renewal of her faith.[12]\n\nScully was pronounced infertile during the fifth season. In the season five episode \"Emily\", Scully discovers that she unknowingly mothered a daughter during her abduction (in season 2). Her daughter Emily was adopted by another family. Emily died shortly afterwards, and they were unable to further investigate after Emily's body went missing. In the seventh season finale, \"Requiem\", Scully mysteriously became pregnant.[13] The child, named William, after her own father, as well as Mulder's father, was born at the end of the eighth season.[14] The show did not initially reveal the cause of Scully's pregnancy, but later episodes and movies would see Mulder and Scully call William \"our son\"; the pair had unsuccessfully tried for a child through in vitro fertilization. Around this time, Mulder was fired from the FBI by Deputy Director Alvin Kersh,[15] and Scully left the field to teach forensics at Quantico.[16] William was given up for adoption during the end of the ninth season after Scully felt she could no longer provide the safety that William needed.[17] William was a \"miracle child\", of some importance to the alien conspirators. He demonstrated extraordinary powers, including telekinesis.[18]\n\nIn The X-Files: I Want to Believe she is shown working as a medical doctor at the Our Lady of Sorrows, a private Catholic hospital in Virginia. Early on in the film Scully is contacted by the FBI who are looking for Fox Mulder in the hope that he will assist them with the investigation of a missing FBI agent. In exchange for his help the charges against him will be dropped. Unlike Mulder, Scully was apparently not considered a fugitive by the FBI. However, she did continue to maintain her romantic relationship with Mulder throughout the six years that he was on the run from the American government. In the movie, they are shown to be living together in a secluded house.[19]\n\nIn the first episode of season 10, \"My Struggle\" (2016), it is shown that Scully is still working as a doctor for Our Lady of Sorrows hospital, now performing surgeries on children with severe birth defects. It is revealed that Scully has extraterrestrial DNA, as the test that she performs on herself confirms. After the FBI reopens the X-Files, fourteen years after their closure, she rejoins the bureau.[20] In \"Mulder and Scully Meet the Were-Monster\", Scully jokes that she often enters dangerous situations alone due to the immortality she obtained during \"Tithonus\", which was first referenced in \"Clyde Bruckman's Final Repose\". At the end of \"Mulder and Scully Meet the Were-Monster\", Scully steals a dog from an animal control center, named Daggoo, which is named after yet another character from Moby-Dick.[21] In \"Home Again\" Dana's mother, Margaret Scully, dies after suffering a heart attack.[22] In the show's tenth season finale, \"My Struggle II\", Scully is in a race against time to save humankind, creating a vaccine from her own extraterrestrial DNA.[23]\n\nCharacterization [ edit ]\n\nThroughout the series, her Catholic faith served as a cornerstone, although a contradiction to her otherwise rigid skepticism of the paranormal.[24] Due to her career in science and medicine, she drifted from her Catholic Christian upbringing but remained somewhat entrenched in her religious beliefs. Scully almost always wears a gold cross necklace, given to her by her mother as a Christmas present when she was fifteen. When she was abducted by Duane Barry, a self-proclaimed alien abductee,[10] it was the only item left behind in Barry's getaway car. Mulder wore it as a talisman of her until Scully miraculously reappeared in a Washington, D.C. hospital.[25] After she recovered from the trauma of her abduction, he returned the cross to her.[3]\n\nThe abduction visibly tested the limits of her faith — Mulder believes that Scully was taken aboard an alien spaceship and was subjected to tests. However, because of Scully's skepticism, she believes she was kidnapped by men and subjected to tests, not aliens. She believes she could have been brought there by Barry, and she began to exhibit symptoms of post-traumatic stress disorder on a case involving a murdering fetishist named Donnie Pfaster.[26] This psychological re-victimization continued after Pfaster escaped from prison five years later and again attempted to kill her in her home, ending only after she fatally shot him. She struggled with what motivated her actions to kill Pfaster, and questioned whether it was God compelling her to kill him, or \"something else\".[27]\n\nSometime after her recovery from cancer, Scully began to regularly attend Mass again. At the request of Father McCue, Scully got involved in a case concerning a paraplegic girl who was found dead in a kneeling position with her palms outstretched and eye sockets charred. After Scully discovered the girl was part of a set of quadruplets and two more were murdered, Father McCue shared with her the story of the seraphim and the nephilim, which Scully interpreted as a possible explanation for the deformations and deaths of the girls. Scully continued to have visions of Emily, and when the last girl died, Scully believed she was returning the girl to God. Upon her return to Washington D.C., she went to confession to gain peace of mind and acceptance for Emily's death.[28] In confession she regretted her decision of letting the girl go. This suggests Scully had doubts about her faith.\n\nIn the sixth-season episode \"Milagro\", Agent Scully's vulnerability is exposed. In this episode, the murderer takes the victim's heart out. The suspect, a writer named Phillip Padgett, has a particular interest in Scully and is fascinated by her beauty and personality. When she goes to a church to observe a painting, the writer is there and talks to her about the Sacred Heart of Jesus. During the conversation he says she visits the church because she likes art, but not as place of worship. Scully doesn't say otherwise and later she says to Agent Mulder the writer told her her life story. All this suggests that Scully isn't a devout Roman Catholic, although she attempted to approach again the Catholic community and the Catholic faith to which she was devout in her youth, after handling the strange case presented in \"Revelations\" and also after dealing with life-threatening cancer during the fourth season.\n\nRelationships [ edit ]\n\nWhile in medical school, she carried on an affair with her married instructor, Dr. Daniel Waterston who may have been the \"college boyfriend\" mentioned in \"Trust No 1\". It is never indicated in the show whether or not the relationship became sexual. According to Anderson in the episode's audio commentary, Scully came very close to having an affair with the married Waterston but left before she could break up his marriage. The end of her relationship with Waterston came about following her decision to go into the FBI.[29] After her entrance to the FBI's Academy at Quantico, Scully began a year-long relationship with her Academy instructor, Jack Willis, with whom she shared a birthday.[4]\n\nTowards the end of the series, her previously platonic friendship with partner Fox Mulder developed into a romantic relationship. When Mulder was injured in a boat crash, he awakened in a hospital and told Scully that he loved her.[30] In the season six episode \"How the Ghosts Stole Christmas\", a ghost that seems to know the inner workings of Scully's mind suggests that her source of intimacy for Mulder comes from her desire to always prove him wrong.[31] By the end of the sixth season, Mulder and Scully were increasingly shown enjoying more light-hearted activities together, such as practicing baseball,[32] using FBI funds for a \"night out\" during a movie premiere,[33] and watching a movie at Mulder's apartment.[34] In the season seven episode \"all things\", Scully is shown getting dressed in Mulder's bathroom, while Mulder sleeps, apparently naked, in the bedroom.[29] In \"Trust No 1\" a man reveals to Scully that he works for a \"new\" Syndicate like-organization, and his job requires him and a few other colleagues to spy on her around the clock. Due to this he knows intimate details of Scully's personal life, right down to her \"natural hair color\" (Titian, as later confirmed by Chris Carter).[35] It is suggested by this man that Scully ultimately initiated a sexual relationship with Mulder, as he remarked that he was very surprised when she invited Mulder \"into her bed\".[36] The last scene of the series finale featured Mulder and Scully holding each other on a bed, facing an uncertain future together in love.[37]\n\nIn the film, The X-Files: I Want to Believe, which takes place six years later, Mulder and Scully are still in a relationship. Scully was concerned that Mulder's continuing pursuit of the unknown was taking its toll on their relationship and they could not be together if he couldn't \"escape the darkness\". However, the film ends with the couple sharing a passionate kiss, and in the \"secret ending\" after the majority of the credits, a happily smiling Scully is seen in a small rowboat with Mulder, both clad in swimwear, in a tropical sea, having taken him up on his offer to run away together.[19] In the tenth season it is revealed that Scully and Mulder are no longer a couple, as she chose to leave him.[20] At the end of the Season, Scully gets a vision, that at the beginning of season eleven is revealed to have come from her son, William. Over the course of season eleven, Scully and Mulder search for William. Skinner learns from the Smoking Man, that the Smoking Man, who is Mulder's father, also artificially impregnated Scully, and thus is William's father as well. In the third episode of the eleventh season, \"Plus One\", Scully and Mulder are intimate again. In the season 11 finale, \"My Struggle IV\", she reveals to Mulder that she is pregnant with his child.\n\nConceptual history [ edit ]\n\nAnderson at the 2008 WonderCon\n\nChris Carter named Scully after his favorite sportscaster, Vin Scully of the Los Angeles Dodgers.[38] John Doggett was likewise named after Vin Scully's longtime broadcasting partner, Jerry Doggett.[39] Scully's character was also inspired by Jodie Foster's portrayal of Clarice Starling in the film The Silence of the Lambs.[40] Scully was a known name in UFO lore. In 1950 the less than credible Behind the Flying Saucers was published, written by Variety columnist Frank Scully. The name Scully was also used in 1976 film All the President's Men, an obvious inspiration for the show, in a list of names who work for the Committee for the Re-Election of the President.\n\nThe casting for Scully caused a conflict between Carter and the Fox network. Carter had chosen 24-year-old Gillian Anderson, whom Carter felt was perfect for the role.[41] Of her audition, Carter said, \"she came in and read the part with a seriousness and intensity that I knew the Scully character had to have and I knew [...] she was the right person for the part\".[42] However, Fox executives had wanted a more glamorous \"bombshell\" for the part (in a 2008 interview Anderson stated that Pamela Anderson had actually been the network's first choice),[43] hoping that this would lead to the series involving a romantic element. This led Carter to insist that he did not want the roles of Mulder and Scully to become romantically involved.[41] Carter decided Scully would be the skeptic to play against established stereotypes; typically on television the quality was attributed to a male.[42] Because Duchovny was much taller than Anderson, during scenes where Mulder and Scully stand or walk next to each other Anderson stood on \"the Gilly-Board\", an apple box named after her.[44]\n\nScully appears in every episode of the ten-season series with the exceptions of \"3\", \"Zero Sum\", \"Unusual Suspects\" and \"Travelers\". She has appeared outside The X-Files on numerous occasions, the most notable being in the Millennium (also created by Chris Carter) episode \"Lamentation,\" in which the main character, Frank Black, visits the FBI Academy in Quantico, Virginia, and Mulder and Scully are briefly seen descending a stairway. In fact, they are Duchovny and Anderson's stand-ins.\n\nAn animated version of Scully, which featured the voice acting of Anderson, would appear on season 8 of The Simpsons, in the episode \"The Springfield Files\", as well as Canadian animated series Eek! The Cat, on the episode \"Eek Space 9\". The animated television series ReBoot featured characters Fax Modem and Data Nully, obvious spoofs of Mulder and Scully, in the episode \"Trust No One\". Anderson provided her voice work for the episode, but co-star Duchovny declined.\n\nReception [ edit ]\n\nA fan cosplaying as Agent Scully\n\n\"I love it when women come up to me and tell me I'm a positive influence on their lives and the lives of their young daughters. That's a great feeling.\" — Gillian Anderson talking about the reaction to Dana Scully from female fans.[45]\n\nAnderson won many awards for her portrayal of Special Agent Scully during the ten seasons of The X-Files, including an Emmy for Outstanding Lead Actress in a Drama Series in 1997,[46] a Golden Globe for Best Actress in a Television Drama Series in 1997,[47] two SAG Awards for Outstanding Performance by a Female Actor in a Drama Series in 1996 and 1997[48][49] and a Saturn Award for Best Actress on Television in 1997. In total, Anderson received for the role, four Emmy nominations,[50] four Golden Globe nominations,[51] nine SAG nominations[52] and eight Saturn nominations.[52]\n\nFilm critic Scott Mendelson, writing in The Huffington Post, cited Scully as an example of strong female characters on television, calling her \"one of the most iconic characters in the science-fiction genre\".[53] Radio Times's Laura Pledger also named her as a strong TV woman, placing her at #1.[54] Rebecca Traister of Salon.com opined that Scully had a better character arc than Mulder. She wrote, \"The very fact that her character was such a hard sell made her repeated brushes with the supernatural all the more powerful. Mulder's desire to believe was so expansive, his credulity so flexible, that it's not as though he was ever going to have either shaken from him. But Scully's surety was solid, stable, rigid; every time she saw something she thought she'd never see, we saw it crack, sparks fly from it. She was forced to question herself, grow, change\".[55] She praised her for being more \"rational, resilient, [and] mature\" than her partner and for their mature relationship.[55] In a review of \"Irresistible\", Emily VanDerWerff of The A.V. Club wrote that it was a cliché to put Scully in danger, as \"Scully is [the show's] heart, and any time she's in danger, it feels like the show itself is about to be stabbed through the heart\".[56]\n\nThe character of Scully has become something of a sci-fi heroine due to her intelligence and resilience, frequently appearing on lists of important female science fiction characters, such as Total Sci-Fi Online's list of The 25 Women Who Shook Sci-Fi, where she came in fourth.[57] TV Squad named her the thirteenth greatest woman on television,[58] while the site also listed her among the most memorable female science fiction television characters.[59] She is also often cited as being an unlikely sex symbol, frequently being included in lists of sexy TV characters.[60][61] She was listed in AfterEllen.com's Top 50 Favorite Female TV Characters.[62] The pairing Mulder/Scully was ranked number 15 on Sleuth Channel's poll of America's Top Sleuths.[63]\n\nAngelica Jade Bastién of Vulture emphasized the importance of Scully's character in popular culture by listing all the strong female characters she inspired or may have influenced in some aspects, including: Temperance \"Bones\" Brennan of Bones, Peggy Carter of Agent Carter, Veronica Mars of Veronica Mars, Olivia Moore of iZombie, Dr. Maura Isles of Rizzoli & Isles, Olivia Benson of Law and Order: SVU, Joan Watson of Elementary, Sydney Bristow of Alias, Abbie Mills of Sleepy Hollow, Zoë Washburne of Firefly, Stella Gibson (another character portrayed by Anderson) of The Fall and Olivia Dunham of Fringe. Jade Bastién wrote: \"Do all the characters Scully has influenced live up to her? Definitely not. Gillian Anderson's performance and her chemistry with David Duchovny aren't exactly elements that can be replicated. But these characters prove that Scully isn't only the heart of The X-Files, but also the character who had the most profound influence on popular culture\".[64]\n\nIndiewire's Liz Shannon Miller ranked Scully as the #1 most important character of The X-Files, writing: \"Scully's legacy is so important in so many ways, from giving us the gift of Gillian Anderson's acting, to inspiring an entire generation of young women to pursue careers in STEM. Intelligent, loyal, flawed and brave, Scully was the show's beating heart and saving grace even in its lowest years. As Chris Carter himself has said: 'It's Scully's show'.\"[65]\n\n\"The Scully Effect\" [ edit ]\n\nThe character is believed to have initiated a phenomenon referred to as \"The Scully Effect\"; as the medical doctor and the FBI Special Agent inspired many young women to pursue careers in science, medicine and law enforcement, and as a result brought a perceptible increase in the number of women in those fields.[66][67] At the 2013 San Diego Comic-Con International, Anderson noted that she has long been aware of \"The Scully Effect\" and stated: \"We got a lot of letters all the time, and I was told quite frequently by girls who were going into the medical world or the science world or the FBI world or other worlds that I reigned, that they were pursuing those pursuits because of the character of Scully. And I said, 'Yay!'\"[68] Anne Simon, a biology professor and a science adviser for the series recalls: \"I asked my Intro Bio class back then how many of them were influenced by the character of Scully on The X-Files to go into science and half of the hands in the room went up. That's huge! That was saying that the show was really having an effect.\"[69] \"The Scully Effect\" remains a subject of academic inquiry.[70]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/29px-Dragon-149393.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/25px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/X-Files_Dana_Scully_Cosplay.jpg/150px-X-Files_Dana_Scully_Cosplay.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/7/7c/Scully2016.png/220px-Scully2016.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/30px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/GillianAndersonByIdoCarmelWonderCon2008.jpg/175px-GillianAndersonByIdoCarmelWonderCon2008.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/30px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/7/7c/Scully2016.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/7c/Scully2016.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dana_Scully", "title": "Dana Scully", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/7c/Scully2016.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}