{"url": "https://en.wikipedia.org/wiki/Richard_Simmons", "text": "For other people named Richard Simmons, see Richard Simmons (disambiguation)\n\nMilton Teagle \"Richard\" Simmons (born July 12, 1948) is a retired American fitness instructor, actor, and video producer[1] known for his eccentric, flamboyant, and energetic personality. He has promoted weight-loss programs, most prominently through his Sweatin' to the Oldies line of aerobics videos.\n\nSimmons began his weight-loss career by opening a gym called Slimmons in Beverly Hills, California, catering to the overweight, and he became widely known through exposure on television and through the popularity of his consumer products. He is often parodied and was a frequent guest of late night television and radio talk shows, such as the Late Show with David Letterman and The Howard Stern Show.\n\nSimmons continued to promote health and exercise through a decades-long career, and later broadened his activities to include political activism – such as in 2008 in support of a bill mandating non-competitive physical education in public schools as a part of the No Child Left Behind Act.[2][3]\n\nBy March 2016, after his not having made any major public appearances since February 2014, speculation and expressions of concern about his well-being began to surface in the media.[4][5] Both Simmons and his publicist have said the concerns were unwarranted and that he is simply choosing to be less publicly visible.[6]\n\nEarly life [ edit ]\n\nMilton Teagle Simmons was born in New Orleans, Louisiana, on July 12, 1948,[1] to Leonard Douglas Simmons Sr. and Shirley May (née Satin). He was born to \"show business parents\" and raised in the French Quarter of New Orleans. He has one older brother named Leonard Jr.[7] His father was raised Methodist and worked as a master of ceremonies and later in thrift stores. His mother was Russian Jewish and was a traveling fan dancer and later a store cosmetics saleswoman.[8]\n\nSimmons later converted to Catholicism and attended Cor Jesu High School, known today as Brother Martin High School.[9][10][11] He attended the University of Louisiana at Lafayette before graduating from Florida State University with a BA in Art.[12]\n\nHe became obese during his early childhood and adolescence.[13] He began overeating and becoming overweight as early as the age of 4 or earlier, and by the age of 5, he knew it was perceived negatively.[13] At the age of 15, he weighed 182 pounds (83 kg). As a young man, he considered being a priest.[14][15] As a young adult art student, he had appeared among the \"freak show\" characters in the Fellini films Satyricon (1968) and The Clowns (1970), and he eventually reached a peak of 268 pounds (122 kg).[16][13][17]\n\nIn an interview with the Tampa Bay Times, Simmons explained he adopted the name Richard after an uncle who paid for his college tuition.[15] His first job in New Orleans was as a child, selling pralines at Leah's Pralines.[14]\n\nCareer [ edit ]\n\nFitness career [ edit ]\n\nUpon moving to Los Angeles in the 1970s, he worked as the Maître d'hotel at Derek's, a restaurant in Beverly Hills.[8]:157 He developed an interest in fitness. Exercise studios of the day favored the already fit customer, so there was little help for those who needed to gain fitness from an otherwise unhealthy state. He established gyms, and his interest in fitness helped him lose 123 lb (56 kg).\n\nSimmons later opened his own exercise studio, originally called \"The Anatomy Asylum\", where emphasis was placed on healthy eating in proper portions and enjoyable exercise in a supportive atmosphere. The business originally included a salad bar restaurant called Ruffage, the name a pun on the word roughage (dietary fiber), though it was eventually removed as the focus of the Asylum shifted solely to exercise.[18] Later renamed \"Slimmons\", the establishment continued operations in Beverly Hills, and Simmons taught motivational classes and aerobics throughout the week.[19] Slimmons closed in November 2016.[20]\n\nIn 2010 Simmons said he had kept off his own 100+ pound (45 kg) weight loss for 42 years, had been helping others lose weight for 35 years, and that in the course of his fitness career he had helped humanity lose approximately 12 million pounds (5.5 million kg).[21] Simmons used the web as a method of outreach by running his own membership-based website, and also has official pages on numerous social networking sites such as Facebook, Twitter, MySpace, and YouTube.[22]\n\nIn media [ edit ]\n\nSimmons began to draw media attention due to the success of his health club that began with him on Real People, where he was shown at work. He introduced customers whom he had helped to lose weight. He later had guest roles on the celebrity game shows Battlestars, Body Language, Super Password, Win, Lose or Draw, Match Game (ABC), Price Is Right, $25,000 Pyramid and Hollywood Squares (syndicated), and Nickelodeon's Figure It Out.[citation needed]\n\nPositive viewer reactions landed Simmons a recurring role as himself in General Hospital over a 4-year period.[1][23] This, as well as being in shopping malls, where he taught exercise classes, led to further media attention. In the early 1980s, Simmons hosted two shows – Slim Cookin and the Emmy Award-winning talk show The Richard Simmons Show, in which he focused on personal health, fitness, exercise, and healthy cooking. The Richard Simmons Show drew thousands of exercise enthusiasts, including SAG/AFTRA actress Lucrecia Sarita Russo, who reportedly transported an entire bus filled with women from Pam's Figure Tique for a lively workout on the show.[citation needed]\n\nIn 1998 Simmons voiced the \"Boone\" character in Rudolph the Red-Nosed Reindeer: The Movie.\n\nSimmons has been featured as himself on numerous television series, including Whose Line Is It Anyway?, CHiPs, Saturday Night Live, The Larry Sanders Show, and on an episode of Arrested Development titled \"Bringing Up Buster.\" In 1999 he hosted a short-lived television series titled DreamMaker. In 2007 he filmed a pledge drive special for PBS titled Love Yourself and Win.\n\nHe has been featured in television advertisements for Sprint, Yoplait, and Herbal Essence Shampoos. In late 2007 he was in a \"This is SportsCenter\" commercial on ESPN as the show's \"conditioning coach\". In Canada Simmons was in an advertisement for Simmons mattresses. The mattress company hired the exercise celebrity because of the similarity in name, and for his appeal to the company's target audience of women over 35.[citation needed] Beyond this, there is no further business partnership between the two.\n\nIn the Rocko's Modern Life episode \"No Pain, No Gain\", Simmons lent his voice to an exercise trainer bearing his animated likeness, leading a class filled with large anthropomorphic animals.\n\nFrom 2006 to 2008 he hosted a radio show on Sirius Stars (Sirius Satellite Radio channel 102) titled Lighten Up with Richard Simmons.[24][25]\n\nPersonal life [ edit ]\n\nSimmons in 2007\n\nPersonality [ edit ]\n\nSimmons is noted for his energetic and motivational demeanor, an attribute he uses to help encourage people to lose weight. His high energy level is always featured in his workout videos. His trademark attire is candy-striped Dolphin shorts and tank tops decorated with Swarovski crystals.[15][33]\n\nSimmons is known for interacting at a personal level with people using his products. This began by personally answering fan mail he received as a cast member of General Hospital. As of 2008, he personally answered emails and letters and made hundreds of phone calls each week to those seeking his help.[34][needs update]\n\nHe claims to have few friends, saying, \"I don't have a lot to offer to one person. I have a lot to offer to a lot of people.\" Aside from his three Dalmatians and two maids, Simmons lives alone in Beverly Hills, California.[34] While his sexual orientation has been the subject of much speculation, he has never publicly discussed his sexuality.[35][36][37][38][39]\n\nIn a 2012 interview with Men's Health, he had this to say:\n\nWhen the king gets depressed, he doesn't call for his wife or the cook. He turns to the little man with the pointed hat and says to the court jester \"make me laugh\". And I am that court jester. Richard Simmons, Men's Health[40]\n\nHurricane Katrina response [ edit ]\n\nIn September 2005, Simmons was on Entertainment Tonight to discuss the effects of Hurricane Katrina on his family in his hometown of New Orleans, and his involvement in aiding those affected by the hurricane. On August 29, 2006, Simmons was on Your World with Neil Cavuto while making a return visit to New Orleans one year after the flooding, a visit he repeated on March 2, 2007, now talking about his recent trip to Washington, D.C., to promote and raise awareness about The Strengthening Physical Education Act of 2007 (H.R. 1224).[citation needed]\n\nRetreat from public life [ edit ]\n\nSimmons has not made any major public appearances since 2014, and stopped appearing in public at all in February of that year. In March 2016, speculation began that he was being held hostage by his housekeeper.[4][5]\n\nIn response, on March 14, Simmons gave an audio interview on the Today Show, denying the rumors.[6] In November, the Simmons fitness gym closed, without any public announcement from Simmons.[20] In February 2017, the podcast Missing Richard Simmons launched, investigating why Simmons left public life so suddenly.[41]\n\nIn March 2017, LAPD detectives visited Simmons' home to conduct a welfare check, issuing a statement that Simmons is \"perfectly fine\" and that \"right now he is doing what he wants to do and it is his business.\"[42] On April 19, 2017, following a hospitalization for severe indigestion, Simmons made his first public comment in over a year, posting on Facebook a photo of himself and the message \"I'm not 'missing', just a little under the weather\".[43] However, the picture that was included in the post was from as far back as 2013, leading to speculation that the person who posted the message might not actually have been Simmons.[44][45][46]\n\nIn May 2017, Simmons sued the National Enquirer, Radar Online and American Media, Inc. for libel and false claims that he was undergoing gender reassignment.[47] In September 2017, Simmons lost the lawsuit, and was ordered to pay the defendants' attorney's fees. The judge ruled that \"because courts have long held that a misidentification of certain immutable characteristics do not naturally tend to injure one's reputation, even if there is sizeable portion of the population who hold prejudices against those characteristics, misidentification of a person as transgender is not actionable defamation absent special damages.\"[48][dead link]\n\nIn June 2018, Simmons sued a Los Angeles private investigator, claiming that he had placed a tracking device over a year earlier on the only vehicle Simmons used for transportation, noting that such tracking is in violation of California law.[49] In July 2018, Simmons amended the suit, alleging that the investigator had been hired by In Touch Weekly, and prosecutors filed a criminal complaint.[50]\n\nPrint and other media [ edit ]\n\nBooks [ edit ] Never Say Diet [51]\n\nNever Say Diet Cookbook [52]\n\nThe Better Body Book [53]\n\nDeal-A-Meal Cookbook [54]\n\nReach for Fitness: A Special Book of Exercises for the Physically Challenged [55]\n\nRichard Simmons' Never Give Up: Inspirations, Reflections, Stories of Hope [56]\n\nFarewell to Fat [57]\n\nSweetie Pie: The Richard Simmons Private Collection of Dazzling Desserts [58]\n\nStill Hungry After All These Years: My Story [8]\n\nThe Food Mover Cookbook [59]\n\nCookin' on Broadway [60]\n\nSteam Away the Pounds[61] Audio [ edit ] Analog compact cassette [ edit ] Project Me (six tape set) [62]\n\n(six tape set) Take a Walk [63]\n\nTake a Hike [64]\n\nSweatin' and Sharin With Richard Simmons & Friends [65]\n\nWalk Across America [66]\n\nColors of Your Life (single tape) [67]\n\n(single tape) Colors of Your Life (six tape set) [68]\n\n(six tape set) Secrets of the Winners (single tape) [69]\n\n(single tape) Take a Classical Walk\n\nWalkin' on Broadway\n\nWalk Around the World\n\nNever Give Up: Inspirations, Reflections, Stories of Hope (book on tape, read by Simmons)[70] Compact disc [ edit ] Richard Picks the Hits, Volume 1\n\nRichard Picks the Hits, Volume 2\n\nCountry Cardio\n\nOh Happy Day [71]\n\nFitness Fiesta\n\nWicked Workout [72]\n\nBig Screen Burn\n\nShimmy Into Shape\n\nIn the Mood to Lose\n\nClassical Chillout Vinyl record [ edit ] Reach (Elektra Records, 1983) Singles [ edit ] This Time (Elektra Records, 45 rpm 1983) Digital compact cassette [ edit ] Colors of Your Life (single tape) (Goodtimes Entertainment, BASF 90 Min. 1998) Visual media [ edit ] DVD [ edit ] \"Richard Simmons Project H.O.P.E. - Health, Optimism, Passion, Energy\"\n\nRichard Simmons and the Silver Foxes [73]\n\nDisco Sweat [74]\n\n60's Blast Off\n\n80's Blast Off\n\nBlast and Tone\n\nSuperSweatin': Party Off the Pounds\n\nSuperTonin': Totally Tonin\n\nSuperTonin': Totally Tonin' with Toning Rings\n\nSit Tight\n\nSweatin' to the Oldies [75]\n\nSweatin' to the Oldies 2 [76]\n\nSweatin' to the Oldies 3 [77]\n\nSweatin' to the Oldies 4 [78]\n\nSweatin' to the Oldies 5 [79]\n\nLove Yourself and Win\n\nBoogie Down the Pounds\n\nTonin' to the Oldies Video cassette [ edit ] Everyday with Richard Simmons\n\nThe Stomach Formula\n\nGet Started\n\nReach for Fitness - A Special Video of Exercises for the Physically Challenged [80]\n\nDeal Your Way to Health\n\nRichard Simmons and the Silver Foxes\n\nSweatin' to the Oldies\n\nSweatin' to the Oldies 2\n\nSweatin' to the Oldies 3 [81]\n\nSweat and Shout (also sold as Sweatin to the Oldies 4 )\n\n(also sold as ) Day By Day (Volumes 1–12)\n\n(Volumes 1–12) Pump and Sweat\n\nStep and Sweat\n\nTone and Sweat\n\nFarewell to Fat [82]\n\nDisco Sweat\n\nStretchin' to the Classics\n\nDance Your Pants Off!\n\nTonin' Uptown\n\nTonin' Downtown\n\nGroovin' In The House\n\nThe Ab Formula\n\nNo Ifs Ands or Butts\n\nLove to Stretch\n\nBlast Off\n\nBroadway Sweat [83]\n\nTone Up On Broadway\n\nBroadway Blast Off\n\nPlatinum Sweat\n\nSit Tight\n\nLatin Blast Off (also marketed as Sudar Mucho )\n\n(also marketed as ) Mega Mix Blast Off\n\nMega Mix 2 Blast Off\n\nDisco Blast Off\n\n60's Blast Off\n\n80's Blast Off\n\nBlast and Tone YouTube [ edit ] Fit to Fly\n\nHair Do (Official Music Video)[84]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Richard_Simmons_2007-08-15.jpg/220px-Richard_Simmons_2007-08-15.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/0/02/RichardSimmonsSept2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/RichardSimmonsSept2011.jpg/220px-RichardSimmonsSept2011.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/02/RichardSimmonsSept2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Richard_Simmons", "title": "Richard Simmons", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/02/RichardSimmonsSept2011.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}