{"url": "https://people.com/tv/luann-de-lesseps-tom-dagostino-relationship-amicable/", "text": "Luann de Lesseps is opening up about her recent divorce from ex-husband Tom D’Agostino — and the “last straw” that led to their split.\n\n“When you love somebody, you have your blinders on,” de Lesseps, 52, says in a PEOPLE exclusive clip of Wednesday’s episode of The Wendy Williams Show.\n\nGet push notifications with news, features and more.\n\n“You fall hard quick, and I’m a very strong person, as a lot of you know, I’m pretty resilient, and so I thought I could handle it until the point where I couldn’t handle it anymore,” she says.\n\nAfter nearly eight months of marriage, de Lesseps announced in early August that she and D’Agostino — who had been a bachelor up until marrying the Real Housewives of New York City star — were divorcing. Throughout their whirlwind romance, de Lesseps defended D’Agostino against numerous cheating allegations, including being caught by a friend of costar Bethenny Frankel’s kissing a mysterious blonde at The Regency Hotel the day before his engagement party.\n\nThe former couple was set up by fellow Housewife Dorinda Medley, who “decided to make a match” when she noticed they were both single. Similar to her marriage to first husband Count Alexandre DeLesseps, to whom she was married 17 years and shares two children, de Lesseps thought that quickly falling for someone was “how it worked.”\n\n“We got engaged after three months and then we got married a year after, so I thought, plenty of time, because I got married two weeks after I met my first husband and it lasted 17 years, so I thought, you know, this is how it works,” she explains.\n\nWATCH: Take a Look at Some of the Highlights of Luann de Lesseps & Tom D’Agostino Jr.’s Wedding\n\n“He’s 50 years old, he never asked anyone to marry him, so I thought I was different. I know he loved me — that’s not the issue and I know he went into it just like I did with a big heart and a lot of love. And then he just couldn’t give up his bachelor kind of lifestyle. And that didn’t work for me,” she tells host Wendy Williams.\n\nOf “the last straw” in their short-lived marriage, de Lesseps says it was a combination of things: “just between the women, the press, him going out, me getting phone calls, pictures of him at the same bars where he frequents all the time, which I asked him not to go to.”\n\n“It just kept happening and I got to a certain point where I got totally fed up. I couldn’t do it anymore — I just couldn’t do it anymore,” de Lesseps says. “I was unhappy, and I think he was unhappy, too.”\n\nSince their split, de Lesseps reveals that she saw D’Agostino, 50, at a party: “We said hello. It’s amicable.”\n\nWATCH: Why Luann de Lesseps Won’t Delete Tom D’Agostino Pictures\n\nAlthough the pair has since gone their separate ways, de Lesseps cherishes the memories she shared with D’Agostino.\n\n“I don’t live with regrets. I mean, it was a part of my life that I was in love,” she tells Williams of not choosing to erase photos of her and D’Agostino that were previously shared on social media. “It’s better to not have pain and suffering and be unhappy.”\n\n“It was a beautiful wedding. It was his birthday, it was gorgeous,” she says of her Dec. 31 lavish nuptials with D’Agostino. “I don’t take the pictures down. I’m not that kind of person. I don’t live in the past. It’s a part of my life and that’s how I live. I live adventurously, I live with love and I’m not afraid to love either. I’m not afraid to take chances and live my life.”\n\nThe Wendy Williams Show airs weekdays (check your local listings).", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1030&h=539&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fluann-tom-dagostino-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1030&h=539&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fluann-tom-dagostino-2000.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/luann-de-lesseps-tom-dagostino-relationship-amicable/", "title": "Luann de Lesseps Says Relationship with Ex Tom D'Agostino Is Amicable", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Divorce,Exclusive,Luann de Lesseps,News,Real Housewives of New York City,TV,Wendy Williams", "news_keywords": "Divorce,Exclusive,Luann de Lesseps,News,Real Housewives of New York City,TV,Wendy Williams", "description": "\"I have been defending Tom for the past two years and I feel like Wonder Woman,\" Luann de Lesseps said on The Wendy Williams Show of defending ex-husband Tom D'Agostino against past cheating allegations", "og": {"title": "Luann de Lesseps Says Saw Ex-Husband Tom D'Agostino at a Party: Our Relationship Is 'Amicable'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/luann-de-lesseps-tom-dagostino-relationship-amicable/", "description": "Luann de Lesseps is opening up about her recent divorce from ex-husband Tom D’Agostino — and the “last straw” that led to their split. “When&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1030&h=539&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fluann-tom-dagostino-2000.jpg", "width": 1030, "height": 539}}, "pinterest": {"url": "https://people.com/tv/luann-de-lesseps-tom-dagostino-relationship-amicable/", "description": "\"I have been defending Tom for the past two years and I feel like Wonder Woman,\" Luann de Lesseps said on The Wendy Williams Show of defending ex-husband Tom D'Agostino against past cheating allegations", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fluann-tom-dagostino-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/luann-de-lesseps-tom-dagostino-relationship-amicable/", "title": "Luann de Lesseps Says Saw Ex-Husband Tom D'Agostino at a Party: Our Relationship Is 'Amicable'", "description": "\"I have been defending Tom for the past two years and I feel like Wonder Woman,\" Luann de Lesseps said on The Wendy Williams Show of defending ex-husband Tom D'Agostino against past cheating allegations", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1030&h=539&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fluann-tom-dagostino-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}