{"url": "https://www.thehollywoodgossip.com/2018/01/khloe-kardashian-im-happier-than-ive-ever-been-sorry-lamar/", "text": "If you've seen or heard anything from Khloe Kardashian lately, you've probably noticed one thing ...\n\nWell, a couple of things. There's no denying that baby bump these days!\n\nBut besides the pregnancy -- though we're sure the pregnancy is a big part of it -- she's really just seemed so happy and peaceful, hasn't she?\n\nLike after so many ups and downs, she's finally settled in a place where she wants to be in life.\n\nIt's so nice to see.\n\nAnd if you weren't near tears over the beautiful turnaround of Khloe Kardashian's life already, well, let her break it all down for you in this lengthy but super touching Instagram post she made today!\n\nFor her photo, she shared an older photo of herself along with a much more recent one -- her \"revenge body\":\n\nIn the caption, she wrote \"Sometimes it's hard for me to post these transformation posts only because I can't imagine my life being this unhealthy again.\"\n\nTo clarify, she added that \"Never would I ever consider myself fat, but I would consider myself unhealthy mentally/physically and not knowing my true value. Mind, body and soul.\"\n\nAww, KoKo.\n\n\"For me,\" she wrote, \"my transformation started from within. I needed to heal myself from the inside out.\"\n\n\"Once I started putting myself first, everything started falling into place. My life transformed a few years ago when I made the decision to stop existing and start living.\"\n\nA few years ago, of course, is when she split from Lamar Odom and began focusing hard on her fitness.\n\nShe's said many times that she began going to the gym as a way to deal with everything that was going on with Lamar -- his downward spiral began while they were still together.\n\nIt must have been tough for her to file for divorce and take care of herself when so many people were convinced that they were soulmates, destined to be together forever.\n\nBut, as she explained, \"I decided when I was ready regardless of what anybody else was saying about me. Regardless of the pressures. I had to do this on my terms or I knew it wouldn't last.\"\n\n\"It's ok to take the control back,\" she advised her followers. \"Choose your life. Don't let anybody else decide for you!\"\n\n\"We are no victims to life but we can become victims and prisoners to the people that we choose to surround ourselves with if we allow them to break us and consume us.\"\n\nAnyone else loving this motivational speaker side of Khloe? Because we are kind of living for it.\n\n\"Never be afraid to put yourself first!\" she preached. \"Never choose comfort over your own well-being! Never forget that fate loves the fearless!\"\n\n\"Today's wisdom was yesterday's pain. Tomorrow's happiness is today's bravery! I am so proud of myself for being stronger than I've ever been -- mind body and soul.\"\n\nAnd she should be -- we still don't know all that went on with her marriage to Lamar, but just considering what we do know, it's amazing that she's been able to pull herself up like this.\n\nWe all saw how deeply she loved him, and we also saw how deeply he betrayed her. She definitely should be proud of her strength.\n\nKhloe also wrote that she's \"even prouder of myself that I've been able to maintain a healthy lifestyle for so many years. I broke that cycle and I'm happier than I have ever been!\"\n\n\"You can do this!! Start from within and nothing can stop you,\" she finished. \"Elevate yourself -- mind body and soul.\"\n\nIt's no wonder why so many people refer to her as the best Kardashian, huh?", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--wguHp7PS--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1512135847/khloe-kardashian-poses-with-arms-crossed.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--wguHp7PS--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1512135847/khloe-kardashian-poses-with-arms-crossed.png", "keywords": [], "authors": ["Emily Trainham"], "canonical_link": "https://www.thehollywoodgossip.com/2018/01/khloe-kardashian-im-happier-than-ive-ever-been-sorry-lamar/", "title": "Khloe Kardashian: I'm Happier Than I've Ever Been! Sorry, Lamar!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/01/khloe-kardashian-im-happier-than-ive-ever-been-sorry-lamar/", "title": "Khloe Kardashian: I'm Happier Than I've Ever Been! Sorry, Lamar!", "description": "Khloe Kardashian just shared a touching message about how much she's transformed over the past few years ... you go, girl!", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--dvlbUBv_--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1513810901/khloe-kardashian-baby-bump.png", "type": "image/png", "width": 630, "height": 674}}, "article": {"published_time": "2018-01-07T18:44:58-05:00", "modified_time": "2018-01-07T21:05:03-05:00", "tag": "Khloe Kardashian", "author": "Emily Trainham"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Khloe Kardashian: I'm Happier Than I've Ever Been! Sorry, Lamar!", "description": "Khloe Kardashian just shared a touching message about how much she's transformed over the past few years ... you go, girl!", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--wguHp7PS--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1512135847/khloe-kardashian-poses-with-arms-crossed.png"}}, "description": "Khloe Kardashian just shared a touching message about how much she's transformed over the past few years ... you go, girl!"}, "movies": [], "publish_date": 1515368698.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}