{"url": "https://www.bustle.com/articles/42369-will-kate-walsh-ever-return-to-greys-anatomy-shes-starring-in-bad-judge-but-grey-sloan", "text": "Kate Walsh stars as Rebecca Wright, the eponymous hot mess adjudicator on NBC's new sitcom Bad Judge , premiering this Thursday night... but some of us are still waiting to see the actress pop up on another of our favorite shows. Those hoping Walsh would return to Grey's Anatomy once Private Practice ended its six-season run on ABC were sadly disappointed when Addison Montgomery didn't immediately strut through the doors of Grey Sloan Memorial Hospital. Instead, she recurred in the first season of FX's crime anthology series Fargo as Gina Hess, a widowed trophy wife. And now she's joining her former Grey's costar Katherine Heigl in headlining her own show on the Peacock network. (Heigl stars in the drama State Of Affairs, premiering Nov. 17.)\n\nWhen Addison left Seattle for her own L.A.-based spinoff, Walsh still made a habit of dropping by Grey's once per season, including in Season 7's musical event, \"Song Beneath The Song.\" But the last time Addison was seen in Grey Sloan Memorial was in the Season 8 parallel universe episode \"If/Then,\" where her character merely appeared as a manifestation of Derek's alternate reality. In the two-and-a-half seasons since then, there's been a conspicuous lack of red hair around the hospital.\n\nSo should we officially give up hope of ever seeing Dr. Montgomery bickering with Derek and healing babies again? Not so fast. While it seems unlikely that Walsh will ever return to Grey's as a series regular, further guest appearances aren't out of the question. In 2012 the actress told E! that she's always open to returning to her old stomping grounds, schedule permitting, saying \"Of course. I'm open to anything. I'm ready for my next chapter, but never close the door.\"\n\nFans got excited last year when showrunner Shonda Rhimes dropped hints in the run-up to Season 10 that she was interested in revisiting Addison's story, telling The Hollywood Reporter, \"I would love to see Addison back at Seattle Grace at some point for a visit. I've said a million times that before the show ends its run, Addison has got to put on her shoes and scrub cap and come scrub in at the hospital. That's a given for me.\" Obviously, the neonatal surgeon didn't end up making it onto the show that season, but with Grey's Anatomy still going strong in its second decade, there's still plenty of time to check in with her before the curtain goes down.\n\nThere is at least one hopeful sign pointing to an imminent Walsh appearance. At the same time Rhimes was teasing us with Addison possibilities, she was also thinking about incorporating Derek's sister Amelia (Caterina Scorsone), who had been a regular on Private Practice in Seasons 4-6, into Grey Sloan Memorial. \"Amelia is Derek's sister, and I'm going to want to see that happen at some point as well,\" the executive producer told The Hollywood Reporter. Interestingly, Scorsone just joined Grey's as a series regular for Season 11, which goes to show that Rhimes is very good at getting what she wants.\n\nIf Rhimes was able to work her magic on Scorsone, surely she can convince Walsh to return to Grey's as well. I know it's terrible to hope for any show to fail, but the idea of a swift Bad Judge cancellation paving the way for Addison returning to Grey's full-time is too good to resist. She would arrive just in time for the Meredith/Derek drama that's about to go down this season, and what can stir up a troubled marriage more than a beautiful ex-wife?!\n\nImages: thecampusconnect; weheartit", "images": ["https://imgix.bustle.com/rehost/2016/9/13/03d1038c-b788-480a-b287-0a91e5dfa94d.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/9/13/03d1038c-b788-480a-b287-0a91e5dfa94d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/03d1038c-b788-480a-b287-0a91e5dfa94d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/42369-will-kate-walsh-ever-return-to-greys-anatomy-shes-starring-in-bad-judge-but-grey-sloan", "title": "Will Kate Walsh Ever Return To 'Grey's Anatomy'? She's Starring in 'Bad Judge,' But Grey Sloan Needs Her", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/42369-will-kate-walsh-ever-return-to-greys-anatomy-shes-starring-in-bad-judge-but-grey-sloan", "type": "article", "title": "Will Addison Ever Return To 'Grey's Anatomy'?", "description": "Kate Walsh stars as Rebecca Wright, the eponymous hot mess adjudicator on NBC's new sitcom  Bad Judge , premiering this Thursday night... but some of us are still waiting to see the actress pop up on another of our favorite shows. Those hoping Walsh…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/03d1038c-b788-480a-b287-0a91e5dfa94d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Kate Walsh stars as Rebecca Wright, the eponymous hot mess adjudicator on NBC's new sitcom  Bad Judge , premiering this Thursday night... but some of us are still waiting to see the actress pop up on another of our favorite shows. Those hoping Walsh…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}