{"url": "http://www.eternallifestyle.com/living/secrets-will-grace-never-knew/", "text": "When Will and Grace hit television screens, it instantly became a hit. Now with is anticipated return, fans are eagerly waiting to find out what the cast have been up to since the end of the finale. But what if we told you there are things from the show that you never knew…. Sean Hayes threw the pilot script in the trash A casting agent sent Hayes the script after seeing him in Billy’s Hollywood Screen Kiss, but he didn’t actually like it. “I’d only been at Sundance two days, and I would have had to buy my own plane ticket [to L.A.] just to audition. So I tossed it, thinking there’d be 10,000 more sitcoms.”\n\nA classic comedy duo is born All four of Will & Grace’s main characters were introduced in the first episode, but Jack and Karen don’t actually meet until the second. Their chemistry was not always what it seemed on our TV screens. They didn’t get along at first which caused some tension during filming.\n\nJohn Barrowman was almost Will The Arrow actor was originally chosen for the role of Will Truman, but wasn’t cast because the series’ producers thought he acted “too straight.” “They said I was too straight to play the part. That was supposing that all gay men act in the same way, which isn’t true anyway. I was just being myself,” said Barrowman.\n\nGrace’s Elizabeth Taylor connection Grace’s middle name is Elizabeth after Elizabeth Taylor. Of course Debbie Reynolds, who played Grace’s mother, had a Taylor connection of her own. Did you know? Her husband, Eddie Fisher, actually left Reynolds for Liz. Hot gossip don’t you think?\n\nMegan Mullally’s other job offer Mullally was offered both the role of Karen Walker and the role of Carrie on The King of Queens, which eventually went to Leah Remini. She decided to choose the role of Karen over Carrie by flipping a coin. She said she wanted both roles but didn’t think she would do both justice and wanted to make one of them her sole purpose. She was happy deep down that Karen was the one chosen.\n\nStraight Will and Grace The original idea pitched by co-creators Max Mutchnick and David Kohan was about a straight couple and the Will and Grace characters were the supporting roles. NBC liked the gay guy-straight woman relationship better and that was it, from then on Will & Grace was born, and aren’t we glad.\n\nThe Cher doll The Cher doll that Jack owned is a whopping $60,000 prototype from Mattel. Mutchnick currently owns it. “Will & Grace” producer Tim Kaiser spoke in an interview, “It was just a natural fit… It (Jack’s affection for Cher) is a thread that is running through the show already.” More than 22 million people tuned in to watch the Cher doll make her national television debut.\n\nMaking Emmys history Will & Grace is one of only three shows in all of television history in which all of the lead actors were awarded with Emmys. (The other winners are All in the Family and The Golden Girls). Over its eight-year successful stint, Will & Grace won a total of 16 Emmys. We cannot wait to see what the new season has in store for us.\n\nWill’s lost partner You may not remember, that several characters who appeared in the pilot were in fact later cut. This included Will’s straight law partner, Andy Felner. “After seeing the strength of their foursome in action, the producers knew that Andy and company were unnecessary,” stated Jim Colucci in Will & Grace: Fabulously Uncensored.\n\nDeclined, declined, APPROVED! The cast never really improvised during filming, but on a favorite episode of The Rosie O’Donnell Show Debra Messing revealed that Mullally came up with the bit where Jack slides a credit card through Karen’s cleavage and rear. The comical onscreen friendship between these two often brought improv moments that the directors kept in.\n\nThe origin of Rosario’s name Karen’s maid, Rosario, is named after Mutchnick’s real-life housekeeper. The idea for the character came from her, and he even used real life scenarios from his own experiences to add to the show. We love Rosario and hope that she features in the new episodes.\n\nA Birds reunion Veronica Cartwright played Jack’s mother and Suzanne Pleshette played Karen’s mom, but the two were not to meet for the first time on the show. They had in fact worked together many years before in Alfred Hitchcock’s The Birds. (Cartwright played a student in the avian thriller and Pleshette was the teacher, Annie Hayworth.) They had great worth ethic together and the producers wanted them both immediately for the characters.\n\nHow they landed Elton John Eric McCormack actually went to high school with Elton John’s husband, David Furnish, and they both performed in stage productions with each other. After Will & Grace’s first season, McCormack and his wife were invited to Elton John’s Oscars party and he was able to reconnect with his old school pal. He sent tapes of the show to John, who loved the show so much, that he wanted to do a cameo.\n\nBeverly Leslie played by Joan Collins? Karen’s archenemy, Beverly Leslie, was played by Leslie Jordan. We don’t know about you but we absolutely loved these scenes. Originally it was supposed to be played Joan Collins. But Collins refused to have her wig torn off in Beverly’s first appearance, so they cast Jordan. We are glad they did.\n\nThe inspiration for Will and Grace Co-creator Max Mutchnick’s real life Grace is voiceover agent Janet Eisenberg. The two dated in high school and moved to New York together after college. Series co-creator David Kohan had known Eisenberg since childhood and became friends with Mutchnick when he began dating her.\n\nWho is the “Moody Guy” painting? There are a lot of different theories regarding the painting that hangs near Will’s fireplace. “It’s a friend of a friend’s painting” the production designer Glenda Rovello has said. Some have questioned that maybe its a painting of Eric McCormack himself, but NBC stated it’s a copy of “an original, unsigned oil painting.” Set Decorator Melinda Ritz hired a collector to search out male-themed artworks for use in Will’s apartment and she chose the painting image because of its uncanny resemblance to McCormack.\n\nWhere the title Will & Grace came from The inspiration for the title was inspired by a quote by Jewish theologian Martin Buber’s I and Thou: “You need the will to pursue a relationship with God, and the grace to receive it.” The quote speaks about two complementary elements of faith, and the writers thought it worked well with the show’s two complementary leads. They were right about that.\n\nWill & Grace: Live! The show’s Season Eight premiere, was filmed live, adding to the amazing comedic affect. Mullally is in a scooter in this scene because she hurt her ankle dancing in her house. The writers had to come up with a funny way of allowing her not to have to stand up in the scene, and this was perfect.\n\nYou get a car! You get a car! After the raging and somewhat unexpected success of the first season, Messing, McCormack, Hayes and Mullally were given matching Porches. McCormack decided to auction off his car in 2008 and give the proceeds to Project Angel Food. That is a lovely deed.\n\nSo many celebrities The series was known for its high-profile guest stars. A total of 166 celebrities were featured on the show. Who was your favorite? Everyone from Madonna, to Ellen Degeneres, Britney Spears, Sharon Stone, Demi Moore and so many amazing faces, featured in hilarious scenes that just made the comedy unparalleled.\n\nSean Hayes’ favorite guest Matt Damon was Hayes’ favorite celebrity co-star. In the Season Four episode “A Chorus Lie, the Oscar winner played Owen, who’s competing against Jack for a spot in New York’s Gay Men’s Chorus, but is secretly straight and just wants to e a part of the chorus’ exciting trip to Europe. Hayes praised Damon as “really willing to go for it.”\n\nKaren: The Musical After the series ended, Mullally contemplated starring in a Broadway musical as Karen Walker. The idea was scrapped once NBC got into negotiations for syndication rights for the show. Personally, we would have loved to have seen Karen on the big stage strutting her stuff and wearing a feather boa.\n\nNow let the music play! A soundtrack for the show was released in 2004. It features gay classics like “I Will Survive,” “Got to Be Real,” and “Gypsies, Tramps and Thieves,” with lines from the show remixed into a dance song. We don’t know about you, but it is still sitting on our shelves with our other CD’s, we may have to whip it out for old times sake, it was a cracking cd.\n\nSean Hayes had an unusual pre-taping ritual When the cast was on Oprah, they revealed that Hayes had to go to the bathroom before the taping of each and every episode . “Before each show I have a PSP. Not a Sony Playstation. I have a pre-show poop. Because I get a nervous stomach,” he confessed. Added Mullally, “And we cannot start the show until he has had his poop. So we check in!”\n\nIron Man-on-Man Robert Downey Jr. was originally approached to play the part of Will’s Season Three sportscaster boyfriend, Matt. Downey turned down the role and Patrick Dempsey was cast instead. Both great choices, we have to say we did really enjoy Dempsey’s character.\n\nFilming after 9/11 On Sept. 19, 2001 the cast was filming the Season Four episode, “Bed, Bath and Beyond.” Emotions were still extremely high following the terrorist attacks the week before, so after taping Mutchnick and Kohan asked the audience to stay and Mullally sang “Smile (Though Your Heart Is Breaking)” to everyone on set. “I remember Debra and so many other people crying—there wasn’t a dry eye in the house,” said Shelley Morrison (Rosario). “It was incredible. And it gave all of us the release we really needed.”\n\nThe real-life Rob and Ellen Will and Grace’s straight couple friends, the ones who were also game night victims, Rob and Ellen are in fact named after the writing duo Ellen Idelson and Rob Lotterstein, who Mutchnick and Kohan worked with on HBO’s Dream On. We bet they were honored to have been the idea.\n\nThe Zelman Gallery The Zelman Gallery, where Grace’s water bra leaks everywhere in the famous “Das Boob” episode, is named after Messing’s husband, Daniel Zelman. This is such a funny episode, and is true comedy gold. Did you see this episode? We hope more antics like this happen in the new season.\n\nOh baby, baby! How cool is this, Britney Spears’ choreographers actually came on set to teach Hayes and Messing the “Oops! I Did It Again” dance routine. Messing apparently took a while to learn the routine, while Hayes picked it up straight away. We can imagine this to be very true. We wish we could get her real choreographers to teach it to us. We loved this episode, bring on more like it.\n\nHidden cameos Celebrity makeup artist Kevyn Aucoin has a starring cameo in the restaurant scene with Cher. He’s sitting in a booth in the background. Aucoin actually died two years later from kidney failure, so this episode will forever honor and remember him. Cher was a great celebrity guest on the show, and actually wants to return again, so watch this space.", "images": ["https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02104405/will-and-grace-1479760224.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02095155/GettyImages-138416643-1-1491490123-1024x683.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02104544/GettyImages-453822814-1497466890-1024x798.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02110226/GettyImages-140843312-1497464458-1024x683.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02101103/GettyImages-3239825-1488752197-1024x787.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02101637/7a3f976b96b30dcc214ed2f6442b8287-grace-quotes-funny-people.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02103002/GettyImages-138414983-1498155324-1024x683.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02113125/When-Jack-Grace-Knew-Britney-Spears-OopsI-Did-Again-Dance-Heart.gif", "https://www.eternallifestyle.com/wp-content/themes/unified/images/logo_footer.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/07180018/giphy.gif", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02101248/leah-remini-1497457503-1.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02112407/GettyImages-138446696-1497464904-1024x683.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02103251/birds-1497466074.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02110648/636203448990452870-D04-Will-Grace-finale-18-.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02111017/will-and-grace-soundtrack-1497463324-1022x1024.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02104159/GettyImages-140719392-1497466343-1024x683.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08101432/Screen-Shot-2018-01-08-at-10.13.57-AM-1024x684.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02100846/eric-mccormack-will-and-grace-1-1024x576.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02101433/will-and-grace-1497561596-1024x663.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02111306/464005417.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02105726/15159__kevin_l.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02105844/GettyImages-141235325-1484937780-1024x691.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02112141/Rob_ellen_pilot.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02113249/GettyImages-140721206-1497468494-1024x683.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02105357/Will__Grace_-_Alive_and_Schticking_screenshot.jpg", "https://www.facebook.com/tr?id=382791848977127&ev=PageView&noscript=1", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02105011/will-and-grace-1.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02103449/GettyImages-141328631-1-1498154487-1024x683.jpg", "http://trc.taboola.com/1021215/log/3/unip?en=page_view", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02095803/GettyImages-141194772-1497465801-1024x668.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02101928/Golden-Girls-Emmys-620x330-1497990471.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02102640/hqdefault.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08100654/Screen-Shot-2018-01-08-at-10.05.25-AM.png", "https://www.eternallifestyle.com/wp-content/themes/unified/images/logo_v2.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02111802/GettyImages-141226937-1498238497-1024x691.jpg"], "top_img": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02095803/GettyImages-141194772-1497465801-1024x668.jpg", "keywords": [], "authors": ["Hollie Rowson-Dilks", "Jennifer Hall", "Elizabeth Bartov", "Becca Bridges", "Brandon Strauss", "Sandra Moore"], "canonical_link": "https://www.eternallifestyle.com/living/secrets-will-grace-never-knew/", "title": "Secrets From “Will & Grace” You Never Knew", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "Secrets From “Will & Grace” You Never Knew | EternalLifestyle", "description": "When Will and Grace hit television screens, it instantly became a hit. Now with is anticipated return, fans are eagerly waiting to find out what the cast have been up to since the end of the finale. But what if we told you there are things from the show that you never knew…. A casting …", "url": "https://www.eternallifestyle.com/living/secrets-will-grace-never-knew/", "site_name": "EternalLifestyle", "updated_time": "2018-01-08T13:05:51+00:00", "image": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08101432/Screen-Shot-2018-01-08-at-10.13.57-AM-1024x684.png"}, "article": {"section": "Living", "published_time": "2018-01-02T11:40:53+00:00", "modified_time": "2018-01-08T13:05:51+00:00"}, "twitter": {"card": "summary", "description": "When Will and Grace hit television screens, it instantly became a hit. Now with is anticipated return, fans are eagerly waiting to find out what the cast have been up to since the end of the finale. But what if we told you there are things from the show that you never knew…. A casting […]", "title": "Secrets From “Will & Grace” You Never Knew | EternalLifestyle", "image": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/02095803/GettyImages-141194772-1497465801-1024x668.jpg"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1514893253.0, "source": "http://www.eternallifestyle.com", "summary": ""}