{"url": "https://web.archive.org/web/20171009023311/https://www.forbes.com/sites/natalierobehmed/2017/10/08/harvey-weinstein-fired-from-the-weinstein-company/", "text": "Following a Thursday New York Times report that detailed decades of sexual harassment allegations, Harvey Weinstein has been fired from the production company and distributor he cofounded, The Weinstein Company board said in a statement released Sunday.\n\n\"In light of new information about misconduct by Harvey Weinstein that has emerged in the past few days, the directors of The Weinstein Company have determined, and have informed Harvey Weinstein, that his employment with The Weinstein Company is terminated, effective immediately,\" the statement read.\n\nWith Harvey Weinstein Out, The Weinstein Company Faces Serious Business Challenges\n\nThe Times' investigation reported that Weinstein, 65, has reached at least eight settlements with women over allegations including sexual harassment and unwanted physical contact. Among those agreements was a reported $100,000 previously undisclosed settlement with actor Rose McGowan in 1997 following an incident in a hotel room during the Sundance Film Festival.\n\nThe article alleged a pattern of abuse of power, in which Weinstein repeatedly invited aspiring actresses to meet him in luxury hotel rooms. The report included allegations from eight women that Weinstein appeared naked or only partially clothed, asking for a massage or initiating one himself, or requiring them to be present while he bathed.\n\nIn a statement to The Times on Thursday, Weinstein said he would be taking leave from the company; the board announced he was on an indefinite leave of absence on Friday night. But a new sexual harassment allegation emerged late Friday, in which a news reporter alleged Weinstein masturbated in front of her a decade ago.\n\nAccording to allegations reported by HuffPost, in 2007 Weinstein invited a woman to meet with him privately in a Cuban-themed restaurant, Cafe Socialista, in Manhattan, before exposing himself and masturbating in front of her. The woman, Lauren Sivan, was a reporter at local cable channel Long Island 12 in New York at the time; she is currently an anchor for a Los Angeles-based Fox TV station. Sivan and a Fox TV representative did not respond to a request for comment.\n\nEven with Weinstein out, The Weinstein Company faces a very tough road ahead. So far, four of the nine members of its all-male board have resigned since the accusations were made public. Milwaukee Bucks co-owner Marc Lasry, Technicolor deputy CEO Tim Sarnoff and Ziff Capital Partners financier Dirk Ziff reportedly resigned from the board on Friday. Hedge fund billionaire Paul Tudor Jones resigned on Saturday, according to a representative.\n\nNow under the leadership of Harvey's brother and co-chairman, Bob Weinstein, and COO, David Glasser, the company is launching an internal investigation into the investigation, which could be very costly.\n\n\"These investigations, if done thoroughly, can be extremely expensive, in the range of $20 million to $40 million, given that the allegations span three decades, two continents, and involve potentially dozens of individuals,\" said Debra Katz, a partner with Katz, Marshall & Banks, who has worked on similar cases.\n\nIt's unclear whether the privately-held company is currently profitable or how much cash on hand it has to handle such expenses, but any new financing will be difficult to secure.\n\n\"It's going to be much more expensive to raise money for projects, whether it's debt or equity, and it'll be more difficult to attract high level projects for now,\" said Hal Vogel, a longtime media analyst and founder of Vogel Capital Management, to Forbes.\n\nIn recent years, the company had been investing further in television, releasing and distributing fewer movies as it sought to build its TV division in the hopes of selling it. But any potential sale, which was first touted in 2014 and seemingly rekindled this year, now faces an uncertain future.\n\nThe Weinstein brothers hold a 42% stake in the company. A representative for The Weinstein Comment did not comment on whether Harvey's termination impacted his holding.\n\nWeinstein has been among Hollywood's most powerful producers for decades. Since founding Miramax with Bob and selling the venture to Disney in 1993 for $80 million, the duo continued to operate it--and won Best Picture Academy Awards for Shakespeare In Love (1999) and Chicago (2002). The duo started The Weinstein Company in 2005 with some $1 billion raised from outsider investment.\n\nThough the company has been known for awards show success, its star has faded in recent years amid a string of box office misses and increased competition from streaming services in recent years.\n\nRead more:\n\nHarvey Weinstein Accused Of Sexual Harassment Spanning Decades\n\nWith Harvey Weinstein Out, The Weinstein Company Faces Serious Business Challenges\n\nWill Hollywood Forgive Harvey Weinstein?\n\nThe Weinstein Company Launches Investigation Into Sexual Harassment Allegations", "images": ["https://web.archive.org/web/20171009023311im_/https://secure.gravatar.com/avatar/b9a998b1640ca3fc91f91423dcfb703e?s=62&d=mm&r=g", "https://web.archive.org/web/20171009023311im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fnatalierobehmed%2Ffiles%2F2015%2F04%2Fx2-e1429540094248-1940x1090.jpg", "https://web.archive.org/web/20171009023311im_/https://blogs-images.forbes.com/natalierobehmed/files/2015/04/x2-e1429540094248-1940x1090.jpg?width=960"], "top_img": "https://web.archive.org/web/20171009023311im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fnatalierobehmed%2Ffiles%2F2015%2F04%2Fx2-e1429540094248-1940x1090.jpg", "keywords": [], "authors": ["Natalie Robehmed"], "canonical_link": "https://web.archive.org/web/20171009023311/https://www.forbes.com/sites/natalierobehmed/2017/10/08/harvey-weinstein-fired-from-the-weinstein-company/", "title": "Harvey Weinstein Fired From The Weinstein Company", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Harvey Weinstein Fired From The Weinstein Company", "image": "https://web.archive.org/web/20171009023311im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fnatalierobehmed%2Ffiles%2F2015%2F04%2Fx2-e1429540094248-1940x1090.jpg", "updated_time": "2017-10-08T21:01:27-04:00", "url": "https://web.archive.org/web/20171009023311/https://www.forbes.com/sites/natalierobehmed/2017/10/08/harvey-weinstein-fired-from-the-weinstein-company/", "description": "Producer Harvey Weinstein has been fired from the mini-major movie production company and distributor he cofounded following a New York Times report that detailed decades of sexual harassment allegations.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Harvey Weinstein Fired From The Weinstein Company", "description": "Producer Harvey Weinstein has been fired from the mini-major movie production company and distributor he cofounded following a New York Times report that detailed decades of sexual harassment allegations.", "image": "https://web.archive.org/web/20171009023311im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fnatalierobehmed%2Ffiles%2F2015%2F04%2Fx2-e1429540094248-1940x1090.jpg", "creator": "@natalierobehmed"}, "description": "Producer Harvey Weinstein has been fired from the mini-major movie production company and distributor he cofounded following a New York Times report that detailed decades of sexual harassment allegations.", "author": "Natalie Robehmed", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Natalie Robehmed", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/1968-14736", "published": "2017-10-08", "modified": "2017-10-09"}}, "movies": [], "publish_date": 1507392000.0, "source": "https://web.archive.org", "summary": ""}