{"url": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "text": "Taylor Swift hasn't spoken much about Joe Alwyn publicly, but they’re definitely a very committed couple that have been together for nearly three years.\n\nSwift has been purposely quiet about her relationship with Alwyn. The paparazzi photo ops of her Hiddleswift days and the coupley Instagram pics she’d post with Calvin Harris are nowhere to be found. In fact, Swift largely uses her social media for promoting her work and sharing photos of her other loves: cats Olivia, Meredith, and Benjamin.\n\nStill, we’ve managed to eke out a few details of Swift and Alwyn’s relationship. And in 2020, they've been more public about their love than ever before. Here’s a timeline of their coupledom.\n\nMay 2, 2016: They meet at the Met Gala (probably).\n\nNobody knows for sure when Taylor and Joe first met. But sleuths have determined that the song “Dress” on her 2017 album Reputation might refer to their first meeting.\n\nThe lyrics in question: “Flashback to when you met me, your buzzed cut and my hair bleached.” Swift’s hair was, indeed, bleached at the Met Gala, and Alwyn’s hair was buzzed.\n\nNeilson Barnard Getty Images\n\nSwift was still dating Calvin Harris. This Met Gala is also the night she met Tom Hiddleston and danced goofily with him in a video that went viral, and later sparked the rebound heard ‘round the world . It was an eventful night for Tay.\n\nOct. 12, 2016: Swift and Alwyn attend the same Kings of Leon concert.\n\nA month after breaking up with Hiddleston, Swift went to a Kings of Leon show with her friends. Online sleuths have since determined that Alwyn was at the show, too.\n\nNov. 12, 2016: Swift attends Alwyn’s movie screening.\n\nSwift and a gaggle of squad members went to the premiere of Alwyn’s film, Billy Lynn’s Long Halftime Walk. If she and Alwyn were dating at this point, it was so under the radar that press coverage of the premiere didn’t even mention his name. It’s not clear if he was in attendance.\n\nAlwyn at the photo call for Billy Lynn’s Long Halftime Walk. Kris Connor Getty Images\n\nMay 16, 2017: Reports emerge that they’re dating.\n\nA source close to the pair told The Sun that Swift and Alwyn’s romance had been together for a few months, and that their friends and families were in on it:\n\n“This isn’t a new couple alert or a secret relationship - the only people this has been a secret to is the media because all of us, Taylor and Joe’s closest friends and their families, were aware they have been together for several months and have known each other for a longtime.\n\n“After her 1989 tour and all the attention Taylor received, she learned she had to be more protective of her personal life and she and Joe decided early on to keep their private life private.”\n\nJune 5, 2017: They’re caught by the paparazzi in Nashville.\n\nThe paparazzi finally caught the couple in action : sitting on a balcony in Nashville, where Alwyn was allegedly meeting Swift’s parents for the first time.\n\nJuly 25, 2017: They’re caught again, this time in New York.\n\nHoodies pulled tight over their faces, the couple were caught leaving Swift’s apartment.\n\nSwift and Alwyn seemed desperate to go incognito in these pics .\n\nOct. 20, 2017: Swift tells fans her new single “Gorgeous” is about Alwyn.\n\nSwift hosted a “secret” listening session for her new album, Reputation. She allegedly told fans the single “Gorgeous” is about Alwyn.\n\n\"Basically Taylor made us all promise that if anyone made any accusations of who this song is about, we tell them it is 100 percent about her angel boyfriend of one year,” a fan wrote on Tumblr. “This isn't a secret. She wanted us to tell people.\"\n\nOct. 27, 2017: Ed Sheeran spills the beans on Alwyn.\n\nOn the heels of Swift’s revelation that “Gorgeous” is about Alwyn, her bestie Ed Sheeran was asked about Alwyn on a British radio show.\n\n\"He's really nice\", he said . \"Really, really friendly, really good dude.\"\n\nDec. 11, 2017: The couple is spotted *gasp* snuggling during an Ed Sheeran performance.\n\nMomentarily letting their guard down, Swift and Alwyn engaged in some honest-to-god PDA while Ed Sheeran performed at iHeartRadio’s Jingle Bell Ball in New York City.\n\n“THEY LITERALLY SLOW DANCED TO ALL EDS SONGS WITH THEIR ARMS AROUND ONE ANOTHER AND JUST KEPT LOOKING AT EACH OTHER AND KISSING,” a fan tweeted, according to EW .\n\nMay 8, 2018: They post coordinating cactus photos to Instagram.\n\nBoth Alwyn and Swift posted photos of themselves, solo, standing next to the same cactus.\n\nAlwyn later said they didn’t even realize the photos coordinated.\n\n\"I didn't even think of that until I was in New York and someone else mentioned it,\" he said, according to ET . \"It wasn't purposeful at all!\"\n\nThis is the closest we’ve come to an “Instagram-official” moment for the couple.\n\nSept. 19, 2018: Alwyn talks about Swift for the first time — but only to say he doesn’t want to talk about her.\n\n“I’m aware people want to know about that side of things,” he said to British Vogue. “I think we have been successfully very private and that has now sunk in for people…but I really prefer to talk about work.”\n\nOct. 18, 2018: Alwyn speaks very, very briefly about Swift’s newfound political activism.\n\nIn early October, Swift finally waded into the political world to endorse two Tennessee congressional candidates, after a career-long silence.\n\nA few days later, an interviewer asked Alwyn how he felt about Swift’s post.\n\n“I think it’s great, and I think it’s important,” he said, before uncomfortably shuffling away.\n\nNov. 23, 2018: Swift acknowledges Alwyn’s existence on social media.\n\nAfter two years of knowing him, Swift finally posted something about Alwyn — or at least, his work — on Instagram.\n\nIt was a clipped trailer for his new movie, The Favourite, with a caption calling the film “phenomenal” and imploring her followers to go see it. She tagged the movie’s account, plus Alwyn’s and Nicholas Hoult’s.\n\nNov. 25, 2018: Alwyn reiterates that he’d like to keep his private life private.\n\nIn an interview with GQ , he skirts around the topic of Taylor, saying, “Someone’s private life is, by definition, private. No one is obliged to share their personal life.”\n\nHe also declined to name a favorite Swift song. “I’m just not even going to go into that side of the world,” he said .\n\nDec. 7, 2018: Alwyn opens up a teeny bit about their relationship.\n\nJust to mix things up, Alwyn provided a tiny kernel of information about his relationship with Swift, before saying he didn’t want to talk about it.\n\nEsquire asked him if he sought out any guidance from friends when he started dating Swift.\n\n“I didn’t seek out advice on that,” he said. “Because I know what I feel about it. I think there’s a very clear line as to what somebody should share, or feel like they have to share, and what they don’t want to and shouldn’t have to.”\n\nDec. 11, 2018: Swift attends Alwyn’s movie premiere in London.\n\nSwift popped up at the Cineworld Leicester premiere of Mary Queen of Scots as well as an after-party.\n\nOther than that, the couple has stayed mum — but with awards season coming up and Alwyn appearing in two Oscar-bait films (The Favourite and Mary Queen of Scots), they might just make their red carpet debut any minute.\n\nJan. 6, 2019: Swift and Alwyn attend the Golden Globes (separately).\n\nAlwyn attended the awards show for his nominated film The Favourite and Swift presented Best Original Score and Best Original Song during the Golden Globes. Although they didn't walk the red carpet together, an Us Weekly source claimed the two got quite flirty while she was onstage.\n\n\"While Taylor presented, Joe watched the teleprompter near him and smiled and (his Favourite costar) Nicholas Hoult patted him on the back,\" the source said. \"After Gaga walked on stage, Joe shifted his gaze to the stage near Taylor.\" The insider added, \"She was smiling at him while she walked off the stage. She looked over her shoulder and gave a sassy cute little smile at his table's direction.\"\n\nHandout Getty Images\n\nFeb. 10, 2019: Swift and Alwyn step out at a BAFTAS after party.\n\nSwift skipped the Grammy Awards in favor of attending a BAFTAs after party with her beau. Clad in a pale blue Stella McCartney gown, Swift gave off major Cinderella vibes alongside Alwyn. The two were even photographed walking together hand-in-hand. (A rare occurrence for this secretive duo!)\n\nGOR Getty Images\n\nMarch 2019\n\nAs Swift continued filming the big screen version of Cats in London, reports swirled that getting engaged to Alwyn was not far off. \"Taylor's friends are all talking about a proposal and how she really wants to marry Joe,\" an Us Weekly source shared. \"He's her dream guy.\"\n\nA People source echoed those sentiments, saying, \"Taylor really got lucky to meet Joe, and she is the first one to say it. Joe really is one of a kind.\"\n\nMay 2019\n\nSwift and Alwyn ate breakfast at Café de Flore and then took a stroll through the city of Paris in a rare public outing.\n\nLater in the month, the couple made it a double date with similarly private pair Robert Pattinson and Suki Waterhouse. Per an Us Weekly onlooker, the four low-key celebs dined at San Vicente Bungalows in Hollywood, spending the night laughing and talking.\n\nJuly 2019\n\nIn the lead-up to the release of Swift's seventh studio album, don't expect too many sad love songs on the track list. It appears that Alwyn and Swift are stronger than ever, liking each other's dual career-focused Instagrams on July 23.\n\nAugust 2019\n\nAhead of the August 23 release of her album Lover, Swift already revealed to fans that new music would address her current relationship...in so many words. During a YouTube Live she explained, \"It’s a really romantic album, but it really celebrates love in all its complexity. Not just flowers and sunshine but the patchwork emotions that go into any love you feel.\"\n\nOnce the album dropped, fans began dissecting every song for hidden clues about the couple. Some were even convinced the songs \"Lover\" and \"Paper Rings\" were Swift's big marriage reveal.\n\nSwift continued to avoid talking about Alwyn in interviews. While speaking to The Guardian about why she wouldn't speak on her relationship, she said, “I’ve learned that if I do, people think it’s up for discussion, and our relationship isn’t up for discussion,” she said with a laugh. “If you and I were having a glass of wine right now, we’d be talking about it—but it’s just that it goes out into the world. That’s where the boundary is, and that’s where my life has become manageable. I really want to keep it feeling manageable.”\n\nShortly after a People source gave an update on the relationship saying, “Joe’s personality is great for Taylor. He is very calm and always very supportive. He’s sympathetic and understanding and supports her speaking out about things that she doesn’t agree with.”\n\nEven her inner circle likes Joe, the source added: “There’s something refreshing and different about their relationship. Joe makes Taylor very happy, and it’s hard to picture her not spending the rest of her life with him. Her family loves him. He seems older than he is and is a fantastic guy.”\n\nAs for future comment from either party regarding the romance? The source says it's unlikely: “Joe loves acting but doesn’t want to be a celebrity,\" the source said. \"They both agree that for their relationship to keep working, they want to keep things more quiet. She’s the happiest she’s ever been.”\n\nSeptember 2019\n\nThe two were photographed boarding Swift's private plane after a low-key trip to her beach house in Watch Hill, Rhode Island.\n\nOctober 5, 2019\n\nIn a rare sighting for the couple, Alwyn and Swift were seen holding hands after the singer's Saturday Night Live performances. They headed to New York's Zuma in New York for the show’s after party.\n\nJackson Lee Getty Images\n\nNovember 2019\n\nSwift celebrated Thanksgiving in London with Alwyn, according to E!, but not before hosting a splashy American Friendsgiving with friends including Gigi Hadid, Antoni Porowski, and Martha Hunt.\n\nInstagram\n\nEarly December 2019\n\nUs Weekly and E! both ran reports early in the month stating things between the couple are still going well. “Taylor has had a tough year and Joe has been a rock for her,” a source told Us. “They are still going very strong.”\n\nMeanwhile, E! reported that,\"Taylor has been spending a lot of down time in London,\" per a source. \"She doesn't go out much other than to take a walk with Joe or go to the local pub. They spend a lot of time with Joe's family and friends. All weekend they had people come over or they went to family members' homes.\"\n\nFurther proving the couple is doing just fine, Swift shared a photo of her Vogue UK cover on Instagram, which Alwyn liked right away.\n\nDecember 16, 2019\n\nAlwyn was on hand to subtly support Swift at the NYC premiere of her new movie, Cats.\n\nJose Perez/Bauer-Griffin Getty Images\n\nDecember 26, 2019\n\nAfter spending Thanksgiving together, E! reported that Swift spent her Christmas holiday in London, too. \"Taylor spent the holidays in England with Joe,\" a source told the outlet. \"She was there for the week leading up to Christmas and spent time with Joe's family and friends. Some of Taylor's family also flew in from Nashville to spend time with them.\"\n\nAs for what life looks like for the couple in London? An insider told E!,\"Taylor has been spending a lot of down time in London. She doesn't go out much other than to take a walk with Joe or go to the local pub. They spend a lot of time with Joe's family and friends. All weekend they had people come over or they went to family members homes.\"\n\nJanuary 1, 2020\n\nAlwyn and Swift rang in New Year's Eve with a concert in the Maldives. Although neither party revealed the travel plans themselves, singer Matthew Crane posted the news himself on Instagram. \"So I can now finally reveal who I sung to on New Year's Eve in the Maldives, probably the most notable Pop Star at the moment, the one and only @taylorswift and @joe.alwyn,\" he wrote on his Instagram. \"They were both so friendly and kind to me when I performed, they even gave me a standing ovation and complimented on my voice. It was truly an honor and an experience that I will never forget. 🎤🎶\"\n\nJanuary 5, 2020\n\nThe couple had their most public outing to date at the 2020 Golden Globes, where Swift was a presenter and nominee for Best Original Song - Motion Picture for her and Andrew Lloyd Webber's new original song for Cats, \"Beautiful Ghosts.\" While they didn't walk the red carpet together, onlookers captured Swift and Alwyn taking their seats next to each other inside the ballroom:\n\nTaylor Swift has arrived to her table at the #GoldenGlobes. pic.twitter.com/FWbJvm5J1b — Ramin Setoodeh (@RaminSetoodeh) January 6, 2020\n\nE! also tweeted out a photo of the pair sitting side-by-side, Alwyn in a tux and Swift in an Etro gown:\n\nNext, the couple of more than three years was spotted at the Golden Globes CAA after party. A source told E! that Swift (in a a sparkly navy Alexandre Vauthier dress) wasn't afraid to show PDA with Alwyn. \"They looked inseparable and really in love,\" the source noted. \"Taylor had her arm on Joe, and she leaned in to kiss him several times.\"\n\nJanuary 31, 2020\n\nWith the release of Swift's documentary Miss Americana, came new insight into her romance with Alwyn. She spoke vaguely about why she fell for Alwyn in the fall of 2016, after her Kim Kardashian Snapchat drama had tarnished her reputation. “I felt alone, I felt really bitter,” she explained. “I felt sort of like a wounded animal lashing out. I figured I had to reset everything. I had to reconstruct an entire belief system for my own personal sanity. I also was falling in love with someone who had a wonderfully normal, balanced life.”\n\n\n\nSwift also revealed why she and Alwyn chose to keep their relationship quiet. \"We decided together we wanted our relationship to be private,\" she said. “Even though it [Swift's public image in 2016] was really horrible, I was happy. But I wasn’t happy in the way I was trained to be happy. It was happiness without anyone else’s input. We were just…happy.”\n\nThose searching for Alwyn appearances won't find much. He kissed her hand in the car at one point and hugged her backstage after a performance of \"Getaway Car\" on tour. Swift also serenaded Alwyn with a song believed to be about him from her album Reputation. She sang the song \"Call It What You Want\" to him while he filmed her. She mouthed the words \"I love you\" to him, and when she sang the lyric, \"at least I did one thing right.\"\n\nFebruary 12, 2020\n\nJust before Valentine's Day, Swift and Alwyn got close in the audience of the NME Awards in London. An audience member spotted Swift, sporting a two-tone Monse short suit, and Alwyn kiss and hug when she was announced the winner of Best Solo Act.\n\nTaylor winner of Best Solo Act in the World annonced, the hug I’m dying #NMEAwards2020 pic.twitter.com/yaOKMjXiSF — sophie 🌶 (@getlowsoph) February 13, 2020\n\nFebruary 23, 2020\n\nFor Alwyn's 29th birthday, Swift joined her beau, along with Ed Sheeran and his wife Cherry Seaborn for a celebration in London. The foursome and a few other friends hung out at restaurant Bob Bob Richard in Soho, per E! News. \"They had fun drinking champagne at the table by pushing a button that says 'Press for Champagne' and having it immediately dispensed,\" a restaurant source told E!. \"They were there for several hours enjoying the night.\"\n\nMarch 24, 2020\n\nAn Us Weekly source gave an update last month on marriage talks between Alwyn and Swift. “[They] have talked about their future and marriage,” a source told the outlet. “They don’t have a set deadline in place, but they’re very much in love.” The source added, “Taylor considers Joe one of the only safe constants in her life. He has always been a huge support and stuck by her.”\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "keywords": [], "authors": ["Molly Mulshine", "Savannah Walsh", "Molly Mulshine Is A Writer", "Performer Living In New York City Way Of The Jersey Shore.", "Editorial Fellow", "Savannah Walsh Is An Editorial Fellow At Elle.Com."], "canonical_link": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "title": "A Complete Timeline of Taylor Swift and Joe Alwyn's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "A Complete Timeline of Taylor Swift and Joe Alwyn's Relationship", "description": "Swift has been uncharacteristically quiet about her relationship with Alwyn, but they're going more public in 2020.", "url": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2020-04-17 10:42:05", "published_time": "2020-04-17 10:14:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Taylor Swift and Joe Alwyn's Relationship Complete Timeline", "description": "Taylor Swift has never spoken about Joe Alwyn publicly, but they’re apparently a couple — and they’ve been together for anywhere from one to two years. Here’s a timeline of their coupledom.", "keywords": "Joe Alwyn, Taylor Swift, Taylor joe, taylor swift and joe alwyn, taylor swift joe alwyn relationship", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,taylor swift and joe alwyn,Taylor joe,joe alwyn,Taylor Swift", "sailthru.date": "2020-04-17T22:14:00Z", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg", "sailthru.socialtitle": "A Complete Timeline of Taylor Swift and Joe Alwyn's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1587089640.0, "source": "https://www.elle.com", "summary": ""}