{"url": "https://www.inc.com/andrew-griffiths/maybe-its-time-to-get-yourself-an-accountability-coach.html", "text": "We all have those nagging voices in the back of our head reminding us of the things we wanted to do, or were supposed to do, but we simply didn't get around to them. Not getting them done really starts to frustrate us, but we don't seem to get an closer to completing the projects or tasks.\n\nOften they are things we have wanted to get done for age but some reason we are no closer today than we were a year ago. It might be losing some weight, stopping a nasty habit, exercising more, doing more business development, upgrading your website, writing a book, getting your accounts in order and so on. For most of us the list of things we want to do but aren't getting done tends to be a long one.\n\nIf you can relate, perhaps it's time to get yourself an accountability coach. A person who you hold yourself accountable to each week for getting things done, meeting your deadlines and achieving the goals you set yourself. It is a little more structured than that, but that is the general principle.\n\nI coach people to write business books. One client that I recently took on simply wanted me to call him once a week, to ensure that he had reached the writing target he set for himself for the week. His reasoning was that he had been trying to write a book for 10 years with no result. Having someone like me calling him once a week and holding him accountable was enough incentive to get it done. After a month, his book was half done and completed in two.\n\nAnother client of mine, an accountant and business advisor, was struggling with business development for his firm. He had plenty of great ideas, but not a lot of motivation to implement these ideas. He started to use an accountability coach in New Zealand and this guy was tough.\n\nThere were no excuses for missing the weekly accountability call and if you came along without getting everything done that you had promised to from the last call - look out. Now this kind of tough loving may not be for everyone, but those of us who need it, kind of already know that we need it.\n\nFrom my experience for this kind of coaching to work there are a number of considerations that will help.\n\nFirstly you need to have a very specific and very simple process to follow. \"You commit to getting this done by this date\" - no excuses. You need to know exactly what it is you are trying to achieve, the coach helps you to chunk it down and get it done.\n\nYou need to set up a day and a time each week for your accountability call. This needs to be a very high priority, with death being the only acceptable excuse for missing the call (and even death is questionable).\n\nIt is a great idea to keep a track of what you actually get done each week. Do up a simple spreadsheet or journal staying 'this week I achieved...........'. This will be an impressive list in a few months, but most importantly it is the payoff for the work you put in.\n\nBe clear about the ramifications of not meeting your weekly goals. This is a tough one, but you need to work this out with your accountability coach. What happens if you don't meet your weekly goals? I have one client who pays me a penalty fee (which I give to charity but he doesn't know that) when he fails to meet his goals. Tough love I know, but it was his idea. He knows himself very well, particularly his weaknesses.\n\nAccountability is all about setting new and more productive habits. Going to the gym for the first time after a sabbatical of a few years is very tough. We crawl out, barely able to walk, knowing full well that the real pain will come in the next few days. But after a few weeks we are breathing easier, lifting more weights, able to run around a Zumba class like a professional. It is wonderful.\n\nThe same principle applies when it comes to working with an accountability coach. At first it is tough, we tend to push back, get everything done the night before the call, tell white lies and so on, but in time we feel better about it. We plan our week better and we actually start to look forward to the call because it is a great weekly way to measure progress.\n\nMy prediction is that we will see a lot of accountability coaches springing up and offering a weekly nagging service. Is it a good service? Absolutely. As much as the concept of paying people to hold us accountable is somewhat strange, there is no doubt that it gets results.\n\nThe opinions expressed here by Inc.com columnists are their own, not those of Inc.com.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=6916907&c4=https://www.inc.com/", "https://grunerandjahr.112.2o7.net/b/ss/gjinccomprod/1/H.24.1--NS/0", "https://www.incimages.com/uploaded_files/image/970x450/getty_200218557-001_2000200020009280421_108843.jpg", "https://www.incimages.com/uploaded_files/image/100x100/AndrewGriffiths-2-800x800_28532.jpg", "https://www.incimages.com/inc-logo-black.png"], "top_img": "https://www.incimages.com/uploaded_files/image/970x450/getty_200218557-001_2000200020009280421_108843.jpg", "keywords": [], "authors": ["Serial Entrepreneur", "The Opinions Expressed Here Inc.Com Columnists Are Their Own", "Not Those Of Inc.Com."], "canonical_link": "https://www.inc.com/andrew-griffiths/maybe-its-time-to-get-yourself-an-accountability-coach.html", "title": "Maybe It's Time to Get Yourself an Accountability Coach?", "meta_data": {"title": "Maybe It's Time to Get Yourself an Accountability Coach?", "description": "As scary as it might sound...", "syndication-source": "https://www.inc.com/andrew-griffiths/maybe-its-time-to-get-yourself-an-accountability-coach.html", "og": {"title": "Maybe It's Time to Get Yourself an Accountability Coach?", "description": "As scary as it might sound...", "type": "article", "url": "https://www.inc.com/andrew-griffiths/maybe-its-time-to-get-yourself-an-accountability-coach.html", "image": "https://www.incimages.com/uploaded_files/image/970x450/getty_200218557-001_2000200020009280421_108843.jpg", "site_name": "Inc.com"}, "twitter": {"card": "summary_large_image", "image": "https://www.incimages.com/uploaded_files/image/1940x900/getty_200218557-001_2000200020009280421_108843.jpg", "site": "@Inc", "creator": "@AGauthor", "url": "https://www.inc.com/andrew-griffiths/maybe-its-time-to-get-yourself-an-accountability-coach.html", "title": "Maybe It's Time to Get Yourself an Accountability Coach?", "description": "As scary as it might sound..."}, "fb": {"app_id": 139291179414843}, "article": {"published_time": "2016-09-08 09:30:00", "section": "Strategy", "author": "Andrew Griffiths"}, "robots": "noarchive", "viewport": "initial-scale=1, maximum-scale=1, user-scalable=no, width=device-width height=device-height", "format-detection": "telephone=no"}, "movies": [], "publish_date": 1473298200.0, "source": "https://www.inc.com", "summary": ""}