{"url": "https://www.theringer.com/tv/2018/3/7/17092352/assassination-gianni-versace-finale", "text": "American Crime Story: The People v. O.J. Simpson was an impossible act to follow. The Emmy-winning event series found a singular subject in the O.J. Simpson trial, in many ways the flash point of modern celebrity. The series also ran in the run-up to the 2016 election, when age-old American rifts from cultural misogyny to media sensationalism were once again under a harsh national spotlight. But like many of Ryan Murphy’s critically acclaimed shows, American Crime Story was announced as an anthology series—and with the successful first season of an anthology comes a promise the more traditional miniseries never has to make good on: a worthy follow-up.\n\nAfter the planned second season—on Hurricane Katrina and its aftermath—hit some production snags, a very different story kicked off in January. American Crime Story: The Assassination of Gianni Versace had all the makings of a semi-sequel that would fit comfortably within the mood of O.J. (At the very least, the Italian fashion designer’s shocking death seemed to fit much more comfortably in Murphy’s wheelhouse than storm-stricken New Orleans.) Like O.J., Assassination focused on a high-profile case from the ’90s, recent enough to survive in the collective consciousness but long enough ago for a fictionalized account to add a new perspective. Like O.J., Assassination delved into the experience of an identity group marginalized by the American mainstream. And like O.J., Assassination saw Murphy hand over writing and the majority of directing duties to collaborators, allowing him to concentrate on his primary talents of casting and big-picture curating.\n\nYet the interpretation writer Tom Rob Smith delivered represents a stark departure from the bedrock principles of Murphy’s blockbuster appeal. Versace is straight-faced where Murphy’s house style is smirking, sorrowful where his oeuvre leans dramedic. Watching one disturbed individual’s vanity, entitlement, and megalomania claim life after life makes for an excruciating marathon of violence and pain, rarely leavened by the campy humor that runs throughout Murphy’s other work. For those who tuned in expecting even a typical Murphy production, not another career peak, Versace’s tone required a learning curve too steep for many to climb.\n\nPredictably, the numbers have borne out the disparity between O.J.’s addictive spiral — and Glee’s ironic sniping, and American Horror Story’s diva-centric gore — and Versace’s mournful dirge. Versace debuted to 5.5 million viewers, fewer than half of O.J.’s extraordinary 12 million. That drop-off is partly explained by the more obscure nature of Versace’s subject; most casual onlookers, like Smith himself before he began his research, are probably unaware that Versace’s death was the culmination of a string of killings, not an isolated event. (And compared with O.J. Simpson, what isn’t obscure?) But Versace’s viewership has continued to trend downward as the season goes on, with the live audience sometimes dipping under 1 million. American Crime Story’s second installment has also lagged behind in the more nebulous, though still palpable, arena of cultural relevance. Initial critical reception was admiring, though not rapturous; in the following weeks, the conversation around the show has remained within the confines of fact-checking recaps.\n\nHeading into the final stretch of both Versace and Murphy’s decade-plus residency at FX, it’s time to explicitly acknowledge the subtext of Versace’s relatively muted response. The Assassination of Gianni Versace is not the new The People v. O.J. Simpson; given its challenging form, lesser-known inspiration, and the sky-high expectations set by its predecessor, it’s unlikely it was ever going to be. Besides, Versace’s popular shortcomings are inextricable from its creative risks. By crafting a true-crime story to evade many of the genre’s ethical pitfalls, Murphy and Smith have delivered a season of television that stands apart from the recent wave of ripped-from-the-headlines adaptations—and largely unable to capitalize on it.\n\nThe first and most significant roadblock for viewers excited to learn more about The Assassination of Gianni Versace was that the season’s title turned out to be something of a misnomer. Assassination is as much about the other four victims of 27-year-old spree killer Andrew Cunanan (Darren Criss) as it is about Versace (Edgar Ramirez), whose shooting on the steps of his Miami Beach mansion occurs in Assassination’s first scene. The plot then winds, reverse-chronologically, through the violent unraveling of Cunanan’s life, with Versace sparingly deployed as contrast rather than subject. But Cunanan isn’t truly Assassination’s subject, either: a triptych of midseason chapters—“A Random Killing,” “House by the Lake,” and “Don’t Ask, Don’t Tell”—functioned more like stand-alone biopics of Cunanan’s less famous casualties than part of a larger narrative about the murderer himself.\n\nUnder Versace’s dreamlike, counterintuitive logic, the more screen time a character gets, the less the audience is allowed into their inner lives. In fewer than 50 minutes, Judith Light is able to shape grieving widow Marilyn Miglin into a self-made woman as vulnerable as she is ferocious; Smith’s script for her spotlight episode, Versace’s third, paints a complete portrait of Marilyn’s complicated, loving partnership with her closeted husband, Lee (Mike Farrell). The same holds for Jeff Trail (Finn Wittrock), whose contradictory identities—to the United States military, if not Jeff himself—as a soldier and a gay man are negotiated and renegotiated within a single hour. David Madson (Cody Fern) gets a spotlight that visibly works to ensure he’s not just remembered, but remembered as more than a footnote to Cunanan’s story, or even Versace’s. Each victim is quickly and convincingly developed into a complete person with hang-ups to work through and attributes to mourn.\n\nVersace himself, meanwhile, is idealized to the point of abstraction. One of the first images Versace presents of its namesake is his corpse sprawled, Pietà -like, across the lap of his longtime partner, Antonio D’Amico. The religious parallels hardly stop there. Versace died, Smith posits, for the sins of a homophobic culture that was unable to fully accept an openly gay creative genius. The designer is a martyr, but martyrdom can be antithetical to full humanity.\n\nNo one on Versace comes across as more of an enigma, however, than the titular assassin. Such are the hazards of depicting a pathological liar, given to acts of fabulism so extreme they almost dare Cunanan’s audience to call his bluff. And dubious though it would have been, Cunanan never lived to tell his side of the story; eight days after Versace’s murder, the fugitive killed himself on a Miami houseboat, leaving his precise motivations and rationale a mystery.\n\nSmith adds to these inherent challenges by intentionally obscuring Cunanan’s background—and along with it, any temptation to excuse Cunanan’s behavior or dilute his responsibility. A common criticism of true crime is how vulnerable its storytellers are to the seductive intrigue of the criminal. Villains are almost always more interesting than heroes, a truism that becomes fraught when the characters inhabiting those roles are based on actual people. Serial’s Sarah Koenig and The Jinx’s Andrew Jarecki both had an obvious and uncomfortable rapport with their subjects; I, Tonya all but erased the woman whose assault the movie supposedly litigated. The Assassination of Gianni Versace takes no such risk. Andrew, not Jeff Trail, is relegated to the margins. Andrew, not David Madson, is kept at arm’s length. Cunanan is no anti-hero; he’s borderline inhuman.\n\nUnfortunately, breaking the link between main character and protagonist creates as many problems as it solves. Conceptually subversive as they might be, when consumed in real time, Versace’s structural choices make for a confounding and even alienating viewing experience with a vacuum at its center. There’s a reason so many shows give in to the temptation of valorizing their monsters: It’s hard to get an audience on board with spending hours on hours, week after week with a person who has no redeeming qualities, however fascinating their pathology or sympathetic their supporting cast.\n\nComing from a franchise, and a creator, that promises all the sex and violence of tabloid fare sans network censors, Versace is almost shockingly cerebral. The themes are heady and high-minded—the damage wrought by homophobia on and within the gay men community; how the closet can manifest as ignorance as well as oppression—with a meditative rollout to match. In the binge-watching era, such a protracted, patient rollout can prove fatal; I’m not sure I myself would have stuck with Versace long enough to reap its rewards if FX hadn’t made the majority of the season available to critics in advance.\n\nMany true-crime stories start with a well-known event and purport to uncover some new angle. Versace is working with events much of its demographic isn’t aware happened in the first place, assuming the mantle of educating as well as storytelling. In bringing the Cunanan victims into focus at Cunanan’s own expense, Smith and Murphy have made a trade-off between moral clarity and entertainment value. I’ve found their gamble has paid off, even if the swap isn’t one every viewer has been willing to make. Taking on a sociopath’s point of view may put a series in a compromised position as an adaptation of true events. It may also be essential for a show to succeed as entertainment.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/thumbor/sW_IfnuK4F54LNY6fDhOX-v_EY8=/0x0:3000x2000/1200x800/filters:focal(1226x377:1706x857)/cdn.vox-cdn.com/uploads/chorus_image/image/58944019/versace_alison_FX_ringer.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/thumbor/DU5FTUR27KgvTDrNcuXj9tj3RIc=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10377743/versace_alison_FX_ringer.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs"], "top_img": "https://cdn.vox-cdn.com/thumbor/DU5FTUR27KgvTDrNcuXj9tj3RIc=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10377743/versace_alison_FX_ringer.jpg", "keywords": [], "authors": ["Alison Herman", "Liz Kelly", "Kate Halliwell", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "Mar"], "canonical_link": "https://www.theringer.com/tv/2018/3/7/17092352/assassination-gianni-versace-finale", "title": "Why Didn’t ‘The Assassination of Gianni Versace’ Catch On?", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2018-03-07T14:14:48-05:00", "modified_time": "2018-03-07T14:14:48-05:00"}, "author": "Alison Herman", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "‘American Crime Story: The People v. O.J. Simpson’ is a tough act to follow—but Ryan Murphy’s latest installment has lagged for other reasons. It’s a shame.", "og": {"description": "‘American Crime Story: The People v. O.J. Simpson’ is a tough act to follow—but Ryan Murphy’s latest installment has lagged for other reasons. It’s a shame.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/DU5FTUR27KgvTDrNcuXj9tj3RIc=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10377743/versace_alison_FX_ringer.jpg", "alt": "Andrew Cunanan and Gianni Versace", "height": 630, "width": 1200}, "site_name": "The Ringer", "title": "Why Didn’t ‘The Assassination of Gianni Versace’ Catch On?", "type": "article", "url": "https://www.theringer.com/tv/2018/3/7/17092352/assassination-gianni-versace-finale"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/tv/2018/3/7/17092352/assassination-gianni-versace-finale", "title": "Why Didn’t ‘The Assassination of Gianni Versace’ Catch On?", "description": "‘American Crime Story: The People v. O.J. Simpson’ is a tough act to follow—but Ryan Murphy’s latest installment has lagged for other reasons. It’s a shame.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/K7DZVJ6ZTy7F5G7nvQCHJ9CdXIo=/0x0:3000x1500/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/10377743/versace_alison_FX_ringer.jpg", "alt": "Andrew Cunanan and Gianni Versace"}, "site": "ringer"}, "sailthru.title": "Why Didn’t ‘The Assassination of Gianni Versace’ Catch On?", "sailthru.tags": "general,the-ringer,front-page,tv,pop-culture", "sailthru.description": "‘American Crime Story: The People v. O.J. Simpson’ is a tough act to follow—but Ryan Murphy’s latest installment has lagged for other reasons. It’s a shame.", "sailthru.date": "2018-03-07T14:14:48-05:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/ONNGW1tp6GVOfcYJKga5c-lXwGw=/0x0:3000x1688/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/58944017/versace_alison_FX_ringer.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/O6IwRgRdmTFbdmpGj2c1405AS2s=/466x0:2466x2000/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/58944017/versace_alison_FX_ringer.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1520352000.0, "source": "https://www.theringer.com", "summary": ""}