{"url": "https://www.essence.com/news/tidal-sending-supplies-puerto-rico/", "text": "READ MORE LESS\n\nTIDAL is contributing to the Hurricane Maria relief effort in a major way.\n\nAnnounced yesterday, the music streaming platform is partnering with New York Governor Andrew Cuomo’s Empire State Relief and Recovery Effort to fill a 200,000-pound cargo plane with the items Puerto Rico residents desperately need.\n\nSupplies will be collected at 19 drop off locations across New York State, with the goal of sending the first plane to the battered region on October 7. Entertainers and other celebs are also chipping in to help with the effort.\n\nIn addition to TIDAL’s efforts in Puerto Rico, Jay Z has pledged that all net proceeds from his annual TIDAL X concert will go to aid victims of Hurricanes Harvey, Irma, and Maria, as well as the recent earthquakes in Mexico. This year’s concert, titled TIDAL X BROOKLYN, is taking place on October 17th at the Barclay’s Center in Brooklyn. Angie Martinez will host the star-studded affair, which will feature a star-studded line up of performers including DJ Khaled, Jennifer Lopez, Chris Brown, Remy Ma, Vic Mensa, Cardi B and Jay Z himself, among many others. Angie Martinez will host the event, with special guest appearances by Rosie Perez and Lin Manuel Miranda, both of whom boast Puerto Rican roots.\n\nSee below for NYC-based donation drop-off locations. Sites will be opened from 9 a.m. to 6 p.m. daily. All items must be unopened and in their original packaging. Those interested in donating outside of the New York area can visit Tidal.com/PuertoRico to make a monetary donation.\n\nCapital Region Empire State Plaza Main Concourse, Albany\n\nCentral New York Senator John J. Hughes State Office Building 333 E. Washington Street, Syracuse\n\nFinger Lakes State Police Zone Station 1155 Scottsville Road, Suite 400 Rochester\n\nLong Island Perry B. Duryea State Office Building 250 Veterans Memorial Highway, Hauppauge\n\nMid-Hudson Valley Yonkers Armory 2 Quincy Place, Yonkers\n\nMohawk Valley Utica State Office Building 207 Genesee Street, Utica\n\nNew York City Jacob K. Javits Center 655 W. 34th Street, New York\n\nShirley A. Chisholm State Office Building 55 Hanson Place, Brooklyn\n\nJamaica Street Armory 93-05 168th Street, Queens\n\nRoberto Clemente State Park 301 West Tremont Ave, Bronx\n\nDepartment of Motor Vehicles 696 E Fordham Road, Bronx\n\nSouthern Tier Binghamton Armory 85 West End Avenue, Binghamton\n\nWestern New York Connecticut Street Armory 184 Connecticut Street, Buffalo", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.essence.com/wp-content/uploads/2020/02/rgb-TAG-Registered-80px.png", "https://www.essence.com/wp-content/uploads/2017/09/1506722092/TIDAL-900x600.jpg"], "top_img": "https://www.essence.com/wp-content/uploads/2017/09/1506722092/TIDAL-900x600.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.essence.com/news/tidal-sending-supplies-puerto-rico/", "title": "TIDAL Sending Supplies To Puerto Rico Amid Hurricane Recovery Efforts", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "TIDAL is chartering a plane to send 200,000 pounds of much-needed supplies to Puerto Rico in the wake of Hurricane Maria recovery efforts.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "<p>TIDAL Is Sending 200,000 Pounds Of Much-Needed Supplies To The People Of Puerto Rico</p>", "description": "TIDAL is chartering a plane to send 200,000 pounds of much-needed supplies to Puerto Rico in the wake of Hurricane Maria recovery efforts.", "url": "https://www.essence.com/news/tidal-sending-supplies-puerto-rico/", "site_name": "Essence", "image": {"identifier": "https://www.essence.com/wp-content/uploads/2017/09/1506722092/TIDAL-900x600.jpg", "secure_url": "https://www.essence.com/wp-content/uploads/2017/09/1506722092/TIDAL-900x600.jpg"}}, "article": {"publisher": "https://www.facebook.com/essence"}, "fb": {"app_id": 2453509358209265}, "twitter": {"card": "summary_large_image", "description": "TIDAL is chartering a plane to send 200,000 pounds of much-needed supplies to Puerto Rico in the wake of Hurricane Maria recovery efforts.", "title": "<p>TIDAL Is Sending 200,000 Pounds Of Much-Needed Supplies To The People Of Puerto Rico</p>", "site": "@essence", "creator": "@essence"}, "generator": "WordPress 5.3.2", "wp-parsely_version": "2.0", "msapplication-TileImage": "https://www.essence.com/wp-content/uploads/2018/04/cropped-essence-fav-icon-270x270.png"}, "movies": [], "publish_date": null, "source": "https://www.essence.com", "summary": ""}