{"url": "https://www.etonline.com/ariana-grande-calls-relationship-with-mac-miller-toxic-addresses-his-sobriety-102887", "text": "Ariana Grande responded to a fan on Wednesday who appeared to blame the singer for rapper Mac Miller's recent arrest on a charge of DUI.\n\nGrande and Miller split earlier this month after nearly two years of dating, and a source told ET that she's now \"casually dating\" Saturday Night Live star Pete Davidson.\n\n\"Mac Miller totalling his G wagon and getting a DUI after Ariana Grande dumped him for another dude after he poured his heart out on a ten song album to her called the divine feminine is just the most heartbreaking thing happening in Hollywood,\" the Twitter user wrote.\n\nGrande replied with a lengthy response, calling her relationship with the rapper \"toxic.\" She also claimed she dealt with issues relating to Miller's sobriety throughout their relationship.\n\n\"How absurd you minimize female self-respect and self-worth by saying someone should stay in a toxic relationship because he wrote an album about them, which btw isn't the case (just Cinderealla is ab me),\" Grande tweeted. \"I am not a babysitter or a mother and no woman should feel that they need to be. I have cared for him and tried to support his sobriety & prayed for his balance for years (and always will of course) but shaming/blaming women for a man's inability to keep his sh** together is a very major problem.\"\n\n\"Let's please stop doing that,\" she continued. \"Of course I didn't share how hard or scary it was while it was happening but it was. I will continue to pray from the bottom of my heart that he figures it all out and that any other woman in this position does as well.\"\n\nAn official for the Los Angeles Police Department told ET last Thursday that 26-year-old Miller was the driver involved in a traffic collision with a power pole at 12:50 a.m. that morning in the San Fernando Valley in California. According to the official, Miller and his two passengers fled the scene on foot. A short time later, Miller was arrested without incident at 1:50 a.m. for a misdemeanor DUI.\n\nMiller has talked openly about his sobriety in the past. He's credited producer Rick Rubin for helping him get sober in 2015, though in an April 2017 interview, he said he was now \"living regularly.\"\n\n\"I’ve spent a good time very sober and now I’m just, like, living regularly I think it’s important,\" he told W magazine. \"I don’t believe in absolute anything, but I think not sharing that type of information, because it becomes like, 'Oh he’s sober, oh he’s not, oh he has a beer, oh my god.' I just realized some things are important to just keep for yourself. That was a learning experience. But it was important to let everyone know that I wasn’t doing f**king crazy amounts of hard drugs. That was good to get out there.\"\n\nUp until Grande's tweet on Wednesday, the exes appeared to have an extremely amicable breakup. After news of the split broke, 24-year-old Grande took to her Instagram Stories to share a sweet message about Miller.\n\n\"Hi! This is one of my best friends in the whole world and favorite people on the planet Malcolm McCormick,\" she wrote, referring to Miller's legal name. \"I respect and adore him endlessly and am grateful to have him in my life in any form, at all times regardless of how our relationship changes or what the universe holds for each of us!\"\n\n\"Unconditional love is not selfish,\" she continued. \"It is wanting the best for that person even if at the moment, it's not you. I cant wait to know and support you forever and I'm so proud of you!!\"\n\nA source previously told ET that the couple had been on the rocks for “a while” prior to their split shortly after the Coachella Music Festival in April. The source also added that Grande's relationship with 24-year-old Davidson is “new,\" and that the singer is “is in a very good place and very happy right now.”\n\nWatch below:\n\nAriana Grande and 'SNL' Star Pete Davidson are 'Casually Dating' Following Mac Miller Split This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nAriana Grande Offers Love and Support to Manchester One Year After Tragic Bombing\n\nAriana Grande Is ‘Casually Dating’ 'SNL' Star Pete Davidson Following Mac Miller Split, Source Says\n\nAriana Grande Wows in First TV Performance Since Mac Miller Breakup at 2018 Billboard Music Awards", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=QfaRyKIK"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/ariana-grande-calls-relationship-with-mac-miller-toxic-addresses-his-sobriety-102887", "title": "Ariana Grande Calls Relationship With Mac Miller 'Toxic,' Addresses His Sobriety", "meta_data": {"article": {"opinion": "false"}, "title": "Ariana Grande Calls Relationship With Mac Miller 'Toxic,' Addresses His Sobriety | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/ariana-grande-calls-relationship-with-mac-miller-toxic-addresses-his-sobriety-102887", "title": "Ariana Grande Calls Relationship With Mac Miller 'Toxic,' Addresses His Sobriety", "description": "Ariana Grande responded to a fan on Wednesday who appeared to blame the singer for rapper Mac Miller's recent arrest on a charge of DUI.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Ariana Grande responded to a fan on Wednesday who appeared to blame the singer for rapper Mac Miller's recent arrest on a charge of DUI.", "title": "Ariana Grande Calls Relationship With Mac Miller 'Toxic,' Addresses His Sobriety", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno‍", "url": "https://www.etonline.com/ariana-grande-calls-relationship-with-mac-miller-toxic-addresses-his-sobriety-102887", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV"}, "description": "Ariana Grande responded to a fan on Wednesday who appeared to blame the singer for rapper Mac Miller's recent arrest on a charge of DUI.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Ariana Grande, Mac Miller", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}