{"url": "https://www.hollywoodreporter.com/news/christopher-plummer-reveals-how-he-shot-all-money-world-just-9-days-1068726", "text": "The actor, who replaced Kevin Spacey in the film, explains how Ridley Scott approached him to take on the role, what his reaction was and how he prepped to play J. Paul Getty.\n\nNot only did Christopher Plummer replace Kevin Spacey in Ridley Scott’s finished film All the Money in the World, he also nabbed a surprise Golden Globe nomination less than two weeks after portraying J. Paul Getty for the Sony film, in theaters Dec. 25.\n\nFrom his home in Connecticut, Plummer spent a bit of his birthday with The Hollywood Reporter to talk shooting all his scenes in just nine days, opting not to watch any of Spacey’s footage and continually challenging himself at 88 years old: “I’m not pushing up the daisies just yet.”\n\nHow did Scott approach you?\n\nI was about to go to Florida for a vacation when all of this happened. I met Ridley in New York; he flew all the way from London. I’ve always been a fan of Ridley and wanted to work with him. I thought, \"My God, here’s an incredible chance.\" We talked for a few minutes. He obviously has an extraordinary sense of humor, and that endeared him to me immediately. I told him, “Listen, I have to go home and read the script,” which I did. I kind of knew I was going to do it even if I hated the script. I had a feeling. It was almost insane, so I thought. \"Great, let’s try it!\" Then I forgot about Florida and lying out in the sun and all that.\n\nWhat surprised you most about the script, once you did read it?\n\nWell, I’m always surprised when a film script is well-written and literate! (Laughs.) I grab on to that. I think the writer captured this sort of eccentric recluse very well. It was very intriguing. There’s a huge amount of color in the part, lots of variety.\n\nWhat did you know about the Getty family beforehand?\n\nWell, not very much. I was living in London during the late ‘60s and ‘70s. And I had met Paul at a couple parties — that was all there was in those days, just party after party. But I didn’t get to know him or anything; I didn’t really know him at all. I just knew that the man was an extraordinarily rich chap with feelers all over the world and had made an absolute fortune.\n\nHow did you go about portraying J. Paul Getty so quickly?\n\nI hadn’t researched him very well — in fact, no one had researched the old man very well. I really followed the script and Ridley’s suggestions, which weren’t many because there wasn't much time. So I had to invent certain things instinctively on my own; I just relied on my own imagination of what the man must’ve been. A strange creature, he was. And the photographs — without imitation, I tried to just get a little bit of his likeness. We don’t look unlike each other, there wasn’t a huge amount of [makeup]. They pushed my ears forward because he had big ears that sort of flapped. That was rather painful, I have to say, when they put something to press them forward all the time. But it did wonders, because it made me look much more like him. The suits, the costumes, everything helped.\n\nYou've portrayed real-life figures before, including Rudyard Kipling, Mike Wallace and Leo Tolstoy. What’s your strategy?\n\nThe thing I learned very much is to try and look and move like the creature you’re playing, and try to get their voice if you can, but don’t over-makeup or do too many tricks because then it looks like an imitation. You should be accurate half the time and induce your own personality to come through. There are two of you, always: When I played Mike Wallace, there was Mike Wallace and then there was me playing Mike Wallace. Otherwise it’s a cheap imitation.\n\nWhat was the toughest part of this role?\n\nLearning all those lines! They got easier and easier. I did the most difficult scenes first, which on paper looked scary as hell but it’s actually the best way to capture it and do it right away, so you either fail miserably or you’ve got it. That was the choice that was on the schedule, and I welcomed it when I realized we’d get rid of the hard stuff first — all the sensitive parts of the creature, and the long, rather involved speeches that he makes. It wasn’t so hard, and I got to know the creature better myself. It sort of reminds me a bit of the theater, where you do the whole evening on memory, so it wasn't too uncomfortable. And then I got into a rhythm, and thought, wow, what an ideal way to work! I could do King Lear in nine days! I sort thought I was becoming a nine-day wonder!\n\nDid you feel pressure given the very public and unprecedented situation?\n\nI only felt the natural pressure of doing it all in that short a time. I am still ambitious at my age, and I take risks. And so does Ridley, which is why I admire him so much. It’s incredible — I’m nearly 90. I’m 88 today, it’s my birthday! Every 20 years, one seems to get a new career. It’s very satisfying. I’m not pushing up the daisies just yet. It was a scary and fun experience — both. It was a great adventure and a great pleasure for me, and really an honor to work with Ridley, and the wonderful Michelle Williams, whom I absolutely adore as an actress. I had never met her before but I’m an enormous fan. And Mark Wahlberg who is so good. They both gave up all their time to come back and shoot all their stuff with me, and they were just delightful to work with. The whole thing was an absolute wonderful, rosy pleasure. I can’t say a word against it.\n\nScott offered to let you see the footage with Spacey in the role, but you declined. Why?\n\nIt doesn’t do an actor any good to watch someone else. When you take over a part in the theater, it’s better that you don’t go and see it first so you’re not influenced in any way, the role comes from you. I saw some of the kidnapping stuff, which I thought was very well done, but that’s all I saw. Bits and pieces that didn’t involve J. Paul Getty at all. I hadn't seen the trailer [with Spacey] either.\n\nYou shot all your scenes in nine days. Did you feel rushed?\n\nNo, because we created our own pace. And Ridley covered it so wonderfully with his cameras that nobody waited; we did it very quickly. Ridley is so quick in shoots — he only does one or two takes because he covers it so well with cameras. He knows exactly how to cut a picture. He’s the best of the old-fashioned kind of directors who really knew the cut version of a picture before they even walked onto the set. Hitchcock is a perfect example, and it was all worked out long before anyone said a word. In a sense, Ridley is the same. He’s got modern ideas, of course, and a huge imagination. I think he actually cut in his hotel room because we had to work so quickly.\n\nWhat advice would you give to another actor who might be in your situation in the future?\n\nJust learn your lines, for crying out loud, as quickly as you possibly can. And stay off the booze for the first three days at least, so you have a clear mind. (Laughs.)\n\nHow does it feel to get the Golden Globe nomination?\n\nI was home when I got the call. I was really very surprised because I haven’t even seen the movie yet! I don’t know what I’m doing at all! I was very pleasantly surprised, of course, but my God, it’s hard to digest when you’ve got all the other things to digest. I’m gonna see it at the [Dec. 18] premiere. And then I guess I’ll have to try to take a vacation again, won’t I? Then someone will call me and say, \"Somebody fell off a building, you better replace him!\"\n\nA version of this story first appeared in the Dec. 18 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/08/2psfljou_400x400.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2017/12/kevin_spacey_and_christopher_plummer_-_split_-_publicity_-__h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/2017/12/kevin_spacey_and_christopher_plummer_-_split_-_publicity_-__h_2017.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/12/kevin_spacey_and_christopher_plummer_-_split_-_publicity_-__h_2017.jpg", "keywords": [], "authors": ["Ashley Lee", "Ashley.Lee Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/christopher-plummer-reveals-how-he-shot-all-money-world-just-9-days-1068726", "title": "Christopher Plummer Reveals How He Shot 'All the Money in the World' in Just 9 Days", "meta_data": {"viewport": "width=device-width", "description": "The actor, who replaced Kevin Spacey in the film, explains how Ridley Scott approached him to take on the role, what his reaction was and how he prepped to play J. Paul Getty.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/christopher-plummer-reveals-how-he-shot-all-money-world-just-9-days-1068726", "domain": "https://www.hollywoodreporter.com/", "title": "Christopher Plummer Reveals How He Shot 'All the Money in the World' in Just 9 Days", "description": "The actor, who replaced Kevin Spacey in the film, explains how Ridley Scott approached him to take on the role, what his reaction was and how he prepped to play J. Paul Getty.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/12/kevin_spacey_and_christopher_plummer_-_split_-_publicity_-__h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Christopher Plummer Reveals How He Shot 'All the Money in the World' in Just 9 Days", "description": "The actor, who replaced Kevin Spacey in the film, explains how Ridley Scott approached him to take on the role, what his reaction was and how he prepped to play J. Paul Getty.", "url": "https://www.hollywoodreporter.com/news/christopher-plummer-reveals-how-he-shot-all-money-world-just-9-days-1068726", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/12/kevin_spacey_and_christopher_plummer_-_split_-_publicity_-__h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Christopher Plummer Reveals How He Shot 'All the Money in the World' in Just 9 Days", "sailthru.description": "The actor, who replaced Kevin Spacey in the film, explains how Ridley Scott approached him to take on the role, what his reaction was and how he prepped to play J. Paul Getty.", "sailthru.author": "Ashley Lee", "sailthru.vertical": "Movies", "sailthru.date": "2017-12-18 07:00:00", "sailthru.tags": "Movies,Christopher Plummer,Kevin Spacey,All the Money in the World"}, "movies": [], "publish_date": 1513551600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}