{"url": "https://www.bustle.com/p/all-the-kardashians-responses-to-kylie-jenners-pregnancy-rumors-prove-theyre-great-at-playing-coy-7812321", "text": "If you're a Kardashian-Jenner fan, then you were probably disappointed by Kylie Jenner's absence from the family Christmas card, and you may be wondering whether she's already given birth to a child. The whole thing has been so secretive, and when you look at all the Kardashian-Jenners' responses to Kylie's pregnancy rumors, the famous family tends to avoid the topic like the plague — which only makes fans wonder even more about the youngest member's rumored baby-to-be.\n\nIt's surprising, since the family is known for sharing details about their personal lives with fans, including their pregnancies. Kourtney Kardashian had her deliveries featured as part of their show, Keeping Up with the Kardashians (executive producers: Kris Jenner); Kim Kardashian (who is expecting her third child with Kanye West via surrogate) has been open about her difficult pregnancies; and Khloé Kardashian recently confirmed via social media that she's expecting a child with her boyfriend, Tristan Thompson. Prior to the pregnancy reports, Kylie was also quite open with her fans, and even had her own spin-off show, Life of Kylie (senior story producer: Janelle Couture). It should be said, though, that she's in absolutely no way obligated to comment on whether or not she is pregnant; it's just interesting how secretive she's been lately.\n\nCase in point: Here's how all of the Kardashian-Jenners have handled being asked about Kylie's rumored pregnancy.\n\nKim Goes To Extreme Lengths To Avoid The Topic\n\nTheEllenShow on YouTube\n\nKim has done a number of interviews recently, and every time she is asked about Kylie, she refuses to comment on the pregnancy rumors. When asked during an appearance on The Ellen DeGeneres Show (series director: Liz Patrick) last November, Kim explained why she wouldn't specifically address whether or not her sister was expecting. \"There's so much that goes on that we respect each other's right to speak for ourselves,\" she said. \"So I will speak about myself, and hopefully, they can come on and address whatever rumors you might have.\" (The \"they\" was referring to Kylie and Khloé, since Khloé had yet to confirm her own pregnancy at the time.)\n\nThen, while onThe Late Late Show with James Corden, Kim participated in a game called \"Spill Your Guts Or Fill Your Guts.\" When asked about her sisters' pregnancies, she chose to drink a sardine smoothie instead of answering.\n\nThe Late Late Show with James Corden on YouTube\n\nTalk about going to extreme lengths to avoid answering a question.\n\nKris Jenner May Have Dropped A Big Hint\n\nLIVEKellyandRyan on YouTube\n\nWhen news first broke about Kylie's pregnancy, Kris Jenner told The Hollywood Reporter, \"It wouldn't be the family if something didn't happen every single day,\" but didn't address the pregnancy rumors specifically. Shortly thereafter, during an episode of Live With Kelly & Ryan, Ryan Seacrest texted Kris about the rumors and told the studio audience, \"Kris says Kylie's not confirming anything. That's the news from the family this morning. Kylie is not confirming anything.\"\n\nIn mid-November, Kris dropped a hint about Kylie's rumored pregnancy on Instagram when she shared the above photo with a caption that read, \"Thank you for a collection for every one of my grandchildren.\"\n\nAs you can see there are nine pajama sets in the pic, however, Kris currently only has six grandchildren. When you count Kim's and Khloé's future children that totals eight, so Kris' suggestion that she needs nine pajama sets for \"every one\" of her grandkids clearly hints someone else in the family is also expecting.\n\nKhloé Acts Confused On Ellen\n\nTheEllenShow on YouTube\n\nIn a recent appearance on The Ellen DeGeneres Show, Khloé was also grilled by DeGeneres about Kylie's rumored pregnancy. DeGeneres attempted to trick Khloé by asking if Kylie was craving things yet. But Khloé replied seemingly confused, asking, \"what do you mean?\" When questioned about Kylie's absence from the Christmas card, Khloé took a note out of Kim's book by saying, \"Um, I don't know. You gotta ask Kylie. Why don't you get Kylie on the show.\"\n\nKylie Cosmetics on YouTube\n\nThat wasn't the first time however, that Khloé spoke about babies in the family. A few months ago, she appeared alongside Kylie in video for Kylie Cosmetic where she and Kylie joked that they \"have so many babies.\"\n\nCaitlyn Jenner May Have Hinted That She Knew\n\nBack when it was first reported that Kylie was pregnant, Caitlyn Jenner's reps reportedly told the Daily Mail that she had heard the news, which seemed almost like a subtle confirmation at the time. \"All I can tell you is that it was some time ago,\" her rep reportedly told the publication. However, the quote was quickly dismissed by the family.\n\nAccording to Bravo's the Daily Dish, Caitlyn's rep dismissed the Daily Mail's quote, saying, \"Caitlyn has not given a statement to anyone about this matter.\"\n\nTravis Scott's Interview With Billboard\n\nAlthough he's not technically a Kardashian-Jenner, rapper Travis Scott is rumored to be the father of Kylie's child, and when asked in interviews about his relationship with the lip kit mogul Scott was similarly mysterious. Recently he was asked by Billboard magazine whether or not he had spoken to his own father about becoming a father, and Scott replied, \"Uh... for what?\"\n\nThen, when pressed about Kylie's pregnancy, Scott said, \"I don’t want to talk about that. They’re just guesses. Let them keep fishing.\"\n\nKourtney & Kendall Joking Around With Ellen\n\nTheEllenShow on YouTube\n\nFor the Halloween 2017 episode of her show, DeGeneres dressed up as a pregnant Karla Kardashian. \"This season all the Kardashians are having babies,\" the talk show host joked. She then said that Kourtney was pregnant, and Kourtney walked out and addressed DeGeneres insisting that she was spreading gossip. Kourtney said,\n\n\"Stop making up rumors like you know all of our secrets.\"\n\nAfter DeGeneres insisting that Kendall was pregnant, the model then walked on stage to explain that she wasn't pregnant either. However, neither addressed the speculation surrounding Kylie directly, though Kourtney's use of \"our\" could account for other family members.\n\nDue to all of the mystery, and the fact that none of the Kardashian-Jenners will comment one way or another on Kylie's rumored pregnancy, it's understandable that fans have pretty much gone wild with speculation — including the newest conspiracy theory that says Kylie has already had a baby. But for now, you'll just have to continue guessing, as she still has yet to make any official comment.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/524f5e1d-2c9d-4f80-9ca8-84c34bffd783-getty-451431999.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/b0dfbc93-8b69-424e-9350-ae1e7312ed6e-getty-1209737023.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/3/194ae6f8-bcef-4f14-b94e-ad8aa42bad93-getty-1181741946.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/6/45169534-54ab-4881-9809-fe877c6b24c1-getty-486236882.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/4/143448e3-4aad-4671-9733-857842778d0d-getty-1094888054.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/6/45169534-54ab-4881-9809-fe877c6b24c1-getty-486236882.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/6/45169534-54ab-4881-9809-fe877c6b24c1-getty-486236882.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/all-the-kardashians-responses-to-kylie-jenners-pregnancy-rumors-prove-theyre-great-at-playing-coy-7812321", "title": "All The Kardashians' Responses To Kylie Jenner's Pregnancy Rumors Prove They're Great At Playing Coy", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/all-the-kardashians-responses-to-kylie-jenners-pregnancy-rumors-prove-theyre-great-at-playing-coy-7812321", "type": "article", "title": "Here Are All The Kardashian-Jenners' Responses To Kylie's Pregnancy Rumors So Far", "description": "If you're a Kardashian-Jenner fan, then you were probably disappointed by Kylie Jenner's absence from the family Christmas card, and you may be wondering whether she's already given birth to a child. The whole thing has been so secretive, and when…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/6/45169534-54ab-4881-9809-fe877c6b24c1-getty-486236882.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "If you're a Kardashian-Jenner fan, then you were probably disappointed by Kylie Jenner's absence from the family Christmas card, and you may be wondering whether she's already given birth to a child. The whole thing has been so secretive, and when…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}