{"url": "https://www.inquisitr.com/5202729/teen-mom-ogs-maci-bookout-looks-to-have-a-baby-bump-in-new-instagram-photo/", "text": "Maci Bookout is facing new rumors, which suggest the Teen Mom OG star is expecting her fourth child.\n\nDays ago, Celebrity Insider shared a report with readers in which they mentioned a recent photo post made by Bookout on Instagram. In the photo, as the outlet noted, Bookout was standing next to her husband, Taylor McKinney, and looking to be sporting a baby bump.\n\nAs fans can see in the photo shared below, Bookout looked to be round in her midsection as she held her husband’s hand and placed her other hand halfway into her pocket.\n\nAccording to Celebrity Insider, Maci Bookout was caught photoshopping her midsection weeks ago while celebrating Halloween with her family and never addressed why she did so. She’s also shared a couple of images in which a baby bump was possibly on display.\n\nAfter Bookout shared her most recent suspicious photo, fans began commenting on the post with questions about her potential pregnancy.\n\n“Is that a baby bump?” one person asked.\n\n“When are you due?” asked another.\n\nMaci Bookout has remained completely silent in regard to the online rumors regarding her alleged baby bump but over the past several months, she’s made it clear that she is not at all opposed to expanding her family with husband Taylor McKinney.\n\nIn September, during an interview with Us Weekly magazine, Maci Bookout confirmed she and her husband Taylor McKinney are planning to adopt at some point in the future.\n\n“We are definitely still wanting to adopt. We don’t really have, like, a timeframe or, like, an exact answer,” she said months ago. “I feel like when we know to start the process, we will start it, but for now we’re happy with where we’re at.”\n\nBookout and McKinney currently share two children, 3-year-old Jayde and 2-year-old Maverick, and Bookout is also mom to 10-year-old Bentley, who she shares with former boyfriend Ryan Edwards.\n\n“Jayde and Maverick are just Jayde and Maverick. They’re gonna be – Oh god, I feel bad for the world. Maverick got his first haircut – had to say bye to the man bun. Sad about that, but I mean, really they’re a trip,” Bookout gushed.\n\nAs for a future pregnancy, Bookout hasn’t said a whole lot, other than she’s open to the idea if it was what her husband wanted.\n\nTo see more of Maci Bookout and her family, tune into new episodes of Teen Mom OG Season 8, which air this and every Monday night at 9 p.m. on MTV.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/12/Maci-Bookout-Pregnancy-Rumors.png", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/5202729/teen-mom-ogs-maci-bookout-looks-to-have-a-baby-bump-in-new-instagram-photo/", "title": "‘Teen Mom OG’ Star Maci Bookout Looks To Have A Baby Bump In New Instagram Photo", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}