{"url": "www.goodhousekeeping.com/beauty/fashion/a20976927/princess-diana-jewelry/", "text": "A dazzling aquamarine ring at the royal wedding reception last month was just the start. Now that Meghan Markle is officially part of the royal family, the most memorable jewels belonging to Diana, Princess of Wales may leave the vault more frequently, according to jewelry expert Ella Kay of The Court Jeweller.\n\n\n\nShe theorizes that Prince Harry's newly married status may spur the reappearance of many beloved pieces not seen in years, not only on the new Duchess of Sussex but also her sister-in-law the Duchess of Cambridge (a.k.a. Kate Middleton). Many of the dazzling diamonds and enormous sapphires in their mother-in-law's collection have remained hidden in the decades after her death in 1997.\n\n\"The royal wills are all sealed,\" Kay explains to GoodHousekeeping.com. \"They're not made public so we don’t know who exactly got what or what happened to it.\" Some of the borrowed items like the Queen Mary's Lover's Knot tiara apparently went back to the Queen, who's since loaned it back out to the Duchess of Cambridge.\n\nHowever, other pieces — like Kate's sapphire engagement ring and the diamonds in Meghan's — signal that her sons, Prince William and Prince Harry, may have had a special plan when it came to sharing the estate.\n\nThe Duchess of Sussex wore an aquamarine ring formerly belonging to Diana, Princess of Wales at her wedding reception on May 19, 2018. Getty Images\n\n\"It wouldn't surprise me if they kept back the lion's share of jewelry until both of the princes were married so that they could split it,\" Kay explains. \"Harry hadn't needed it so far but I can imagine them saying, 'We don't want Kate to start wearing it all' because there would be nothing left [for Harry's wife].\"\n\nWaiting for both brothers to wed and then dividing the jewels would give each spouse a sizable collection all their own — potentially more suited to their tastes, too. The duchesses have already worn a few of these pieces.\n\nThe Duchess of Cambridge wore pearl earrings frequently seen on Princess Diana to a reception dinner in Stockholm, Sweden on January 30, 2019. Getty Images\n\nMeghan slipped on an enormous aquamarine cocktail ring previously worn by Diana for her late-night wedding reception at Frogmore House, and Kate dazzled in a pair of her drop pearl earrings back in January.\n\nLots more jewels wait in the wings though: glittering emeralds, an entire suite of sapphires from a Saudi prince ... The priceless gems mostly came as gifts from her in-laws and other monarchies from across the globe. Kay is really hoping for one piece in particular to make a reappearance though.\n\n\"The one that I cannot wait to see back — or that I'm hoping will be worn — is a sapphire cluster with diamonds all around it like Kate's engagement ring, but it's the size of an egg,\" she says. \"The Queen Mother gave it to her as a wedding gift. It was originally a brooch but Diana set it in a pearl choker.\"\n\nPrincess Diana arrives at the Serpentine Gallery in London wearing a gown by Christina Stambolian and the Queen Mother's sapphire brooch in June 1994. Getty Images\n\nThat's the same necklace the Princess of Wales wore with her \"revenge dress,\" amongst other occasions even after her divorce. The style may look a little dated now, so it's possible that Meghan or Kate would get a little crafty just like Diana and make it into something new. The royals have a history of repurposing gems into new styles — just take a look at Meghan's convertible wedding tiara!\n\nWhile the public remains in the dark for now about what happened to these priceless jewels, don't be surprised if more start popping up soon. There's certainly more than enough to go around.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=1xw:1xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Caroline Picard", "Health Editor", "Caroline Is The Health Editor At Goodhousekeeping.Com Covering Nutrition", "Fitness", "Wellness", "Other Lifestyle News."], "canonical_link": "https://www.goodhousekeeping.com/beauty/fashion/a20976927/princess-diana-jewelry/", "title": "Why Princess Diana’s Jewelry Might Start Appearing in Public More", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Good Housekeeping", "title": "Why Princess Diana’s Jewelry Might Start Appearing in Public More", "description": "Meghan's aquamarine ring was just the start.", "url": "https://www.goodhousekeeping.com/beauty/fashion/a20976927/princess-diana-jewelry/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 119423528138309, "pages": 40241492597}, "article": {"publisher": "https://www.facebook.com/GOODHOUSEKEEPING", "modified_time": "2018-06-01 03:59:03", "published_time": "2018-05-31 08:34:00", "section": "Fashion", "opinion": "false"}, "twitter": {"site": "@goodhousemag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "Cyrrih2f3Dh884Dysa4Fuafe2UewzpbR6gnQipgICss", "title": "What Happened to Princess Diana’s Jewelry - Kate Middleton and Meghan Markle to Wear Royal Jewels", "description": "Princess Diana's jewelry may appear in public more on Kate Middleton and Meghan Markle now that Prince William and Prince Harry are both married.", "keywords": "princess diana, meghan markle, kate middleton, princess diana tiara, prince william, prince harry, meghan markle engagement ring, princess diana aquamarine ring, tiara,", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty,beauty,fashion", "sailthru.date": "2018-05-31T20:34:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princess-diana-jewelry-1527791166.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Why Princess Diana’s Jewelry Might Start Appearing in Public More", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1527726840.0, "source": "http://www.goodhousekeeping.com", "summary": ""}