{"url": "https://www.hollywoodreporter.com/news/princes-death-hollywood-mourns-legendary-886479", "text": "Lenny Kravitz, Madonna, Shonda Rhimes, Justin Timberlake, Chris Rock and more expressed their sadness on social media.\n\nAs authorities investigate the cause of Prince's death on Thursday, the entertainment industry mourned the icon's passing.\n\nCelebrities responded with disbelief and sadness. \"I can't. I just can not. #Prince\" wrote Shonda Rhimes. \"I'm crushed,\" wrote Samuel L. Jackson, saying it was a \"massive loss for us all.\" Chris Rock, Justin Timberlake, Whoopi Goldberg, Madonna and Lenny Kravitz also grieved Prince publicly.\n\n\"I'm blown away and may he rest in peace. Music has lost one of its greatest icons,\" Charlie Murphy, a close friend of the artist, told The Hollywood Reporter.\n\n\"I was so shocked and heart broken to hear about the loss of my mentor, Prince,\" Carmen Electra said in a statement. \"The world has lost a truly incredible spirit and musical genius. What a blessing it is to be one of the chosen ones who had the chance to work so closely with him. He gave me my name, he believed in me, and he has inspired an entire generation. I will always love him…. 'Sometimes it Snows in April.'\"\n\nSometimes it Snows in April This is a picture of a poster that I got at one of his shows. I've seen him so many times but never ever enough. A photo posted by Fred Armisen (@sordociego) on Apr 21, 2016 at 11:10am PDT\n\n\"This is truly devastating news. The greatest performer I have ever seen. A true genius... Rest in peace you purple warrior.\" #Prince #RIP — Elton John (@eltonofficial) April 22, 2016\n\nI'm Sad Beyond Belief About\n\nPrince.... This Has Been a\n\nFrightening Time .... SO MANY\n\nLOSSES ....SO MANY GREAT\n\nPPL JUSTGONE — Cher (@cher) April 22, 2016\n\nWoke up to the atrocious news. Prince was a modern Mozart. Watched him play any song that came to mind for 4 hours straight once. Damn. — josh groban (@joshgroban) April 22, 2016\n\nPrince you're one of my Heroes and no one can tell me otherwise, not even you. I'm so fortunate to have witnessed your greatness. Your music will live on forever and ever and will always have a special place in my heart. Thank You. A photo posted by Bruno Mars (@brunomars) on Apr 21, 2016 at 5:11pm PDT\n\nI can’t believe it, I’m in total shock. So many wonderful memories,\n\nI will miss him. #Prince — Lionel Richie (@LionelRichie) April 21, 2016\n\nToday is a very sad day. His music rearranged me... he will forever be my #1. pic.twitter.com/EnC5XWUiYt — Halle Berry (@halleberry) April 21, 2016\n\nabout Prince, one of the greatest artists has left us today. I'll miss my friend, his advice&great humor.Thank you for your magical music. — Cyndi Lauper (@cyndilauper) April 21, 2016\n\nStill shocked. One of the most talented artists ever. He made the world a funkier place. #RIPPrince pic.twitter.com/7As1OFgven — Robert Trujillo (@RobertTrujillo) April 21, 2016\n\nSaddened by Prince's death. Proud to have seen in the New Year with him. He seemed fine and played brilliantly funky music. — Paul McCartney (@PaulMcCartney) April 21, 2016\n\nGod bless this creative giant. Thanks Prince. Love X Paul — Paul McCartney (@PaulMcCartney) April 21, 2016\n\nPrince was a gift and a genius. He showed us that we have no limits. His music left me forever changed. https://t.co/AbZc3AGxny — Alicia Keys (@aliciakeys) April 21, 2016\n\nYou will be missed, Prince. [image: Brian Bolland's Prince cover from DC's Piranha Press imprint circa Dec. 1991] pic.twitter.com/UnQqCqQxPr — DC Comics (@DCComics) April 21, 2016\n\nGod bless prince we will all miss him I still have my Purple whistle. I will blow it tonight peace and love — #RingoStarr (@ringostarrmusic) April 21, 2016\n\nR.I.P PRINCE, another icon gone to soon — SHAQ (@SHAQ) April 21, 2016\n\nI'm Crushed!! UK news reporting Prince Is Dead?! For Real?! Massive Loss for us all! What a Genius! Speechless. — Samuel L. Jackson (@SamuelLJackson) April 21, 2016\n\nI can't. I just can not. #Prince — shonda rhimes (@shondarhimes) April 21, 2016\n\nI Miss My Brother. Prince Was A Funny Cat. Great Sense Of Humor. A photo posted by Spike Lee (@officialspikelee) on Apr 21, 2016 at 10:18am PDT\n\n\"Dearly beloved\n\nWe are gathered here today\n\n2 get through this thing called Life...\"\n\n-Prince — Lin-Manuel Miranda (@Lin_Manuel) April 21, 2016\n\nOmg..... RIP Prince.... — Demi Lovato (@ddlovato) April 21, 2016\n\nOh my god I can’t believe that Prince has died…he was a great great talent…RIP — Billy Idol (@BillyIdol) April 21, 2016\n\nAnd just like that...the world lost a lot of magic Rest in peace Prince! Thanks for giving us so much... — Katy Perry (@katyperry) April 21, 2016\n\nI loved this Man. Too soon. Can't comprehend it but it's unfortunately true. Heaven is yours. RIP #Prince #RIPPrince pic.twitter.com/EH8paEvn75 — MC Hammer (@MCHammer) April 21, 2016\n\nPrince was brilliant and larger than life. What a sad day. — Ellen DeGeneres (@TheEllenShow) April 21, 2016\n\nIn Minneapolis right now...and it's raining...\n\n\n\nPrince... — Lupe Fiasco (@LupeFiasco) April 21, 2016\n\nPRINCE, sad to say, has passed on!!! He was a Giant. My deep condolences go out to his family, friends and fans. — Gene Simmons (@genesimmons) April 21, 2016\n\nThe Artist. #RIP Rest in Power A photo posted by Nick Cannon (@nickcannon) on Apr 21, 2016 at 10:19am PDT\n\nShocked that @prince has died at only 57. Such a talent to have died so young #RIPPrince — Joan Collins (@Joancollinsdbe) April 21, 2016\n\nNot Prince — Ne-Yo (@NeYoCompound) April 21, 2016\n\nPrince? Say it isn't so... — Russell Crowe (@russellcrowe) April 21, 2016\n\nWhat a sad day today! Terribly sorry to hear that #Prince has passed! What an incredible talent we've lost! Another one going to soon! #ripprince A photo posted by La Toya jackson (@officiallatoyajackson) on Apr 21, 2016 at 10:28am PDT\n\nToday is the worst day ever. Prince R.I.P I am crying! — Boy George (@BoyGeorge) April 21, 2016\n\nU wanna learn what a great song is? Go listen to every fucking song on Purple Rain. Then listen. To Nothing Compares 2 U. RIP Prince. Fuck. — Diane Warren (@Diane_Warren) April 21, 2016\n\nThis is what it sounds like when doves cry.. Prince R.I.P.\n\nCondolences to his family & 2 us all — Whoopi Goldberg (@WhoopiGoldberg) April 21, 2016\n\nRest in power, Prince. — Russell Simmons (@UncleRUSH) April 21, 2016\n\nI'm stunned & so saddened to hear about the passing of Prince. He changed it all!!!! The true definition of talent!! pic.twitter.com/Ni17GvPu67 — Billy Ray Cyrus (@billyraycyrus) April 21, 2016\n\nNumb. Stunned. This can't be real. — Justin Timberlake (@jtimberlake) April 21, 2016\n\nThis is so heartbreaking I had this Prince pic drawn on my wall years ago because his music inspired so many R.I.Ppic.twitter.com/60msa6hm3I — Missy Elliott (@MissyElliott) April 21, 2016\n\nI LOVED him, the world LOVED him. Now he's at peace with his Father. Rest in power, @prince, my brother. pic.twitter.com/ZN6cc3WWuF — Chaka Khan (@ChakaKhan) April 21, 2016\n\nHeartbroken to hear Prince has died. Hope he's found his world of never ending happiness/You can always see the sun, day or night. #RIP — Amy Klobuchar (@amyklobuchar) April 21, 2016\n\nRIP to @prince…a true artist in every sense of the word. Gone way too soon. — Quincy Jones (@QuincyDJones) April 21, 2016\n\nI'm so sad we've lost @prince the legend,the master,a musical juggernaut that knew no boundaries.He left indelible footprints in music.RIP — Gloria Estefan (@GloriaEstefan) April 21, 2016\n\nPrince was a true innovator and a singular artist. His music and influence will live on for generations. Rest in peace. — Tim Cook (@tim_cook) April 21, 2016\n\nOne of the greatest Super Bowl Halftime performances of all-time. #RIPPrince https://t.co/B6aHzYUCoG — NFL (@NFL) April 21, 2016\n\nPlease say this is not true you were a genius I never missed a show .I love you #Prince Rogers Nelson R.I.P pic.twitter.com/xTOVkdlC6O — Naomi Campbell (@NaomiCampbell) April 21, 2016\n\nI am really not right over this. RIP #Prince this is devastating. — Laverne Cox (@Lavernecox) April 21, 2016\n\nThank you Prince. All my thoughts & prayers are with all your loved ones. https://t.co/JT52sKlJBJ — Chelsea Clinton (@ChelseaClinton) April 21, 2016\n\nMy musical brother... My friend... The one who showed me the possibilities within myself, changed everything, and kept his integrity until the end, is gone. I am heartbroken. A photo posted by Lenny Kravitz (@lennykravitz) on Apr 21, 2016 at 10:52am PDT\n\nDoves will cry tonight. We celebrate you brother and this thing called Life. Godspeed to the great Afterparty. #Prince — The Jacksons (@Jacksons) April 21, 2016\n\nHe Changed The World!! A True Visionary. What a loss. I'm Devastated. A photo posted by Madonna (@madonna) on Apr 21, 2016 at 11:17am PDT\n\nI met Prince on numerous occasions. He was an amazing talent and wonderful guy. He will be greatly missed! — Donald J. Trump (@realDonaldTrump) April 22, 2016\n\nTommy Mottola\n\n\"It’s easy to toss around the word ‘iconic’, but Prince truly epitomized the word to the very core of his being. Lots of big stars have made waves nationally and internationally, but Prince by far was the most groundbreaking more than anyone…from his music, to his concerts — to even the way he entered a room, always surrounded with that magical air of superstardom, mystique, and genius. Bringing together film and music with Purple Rain was a glimpse into the future of not only the music industry, but the entire media and entertainment industry. When you saw Prince, you never knew what you were going to get, but you always knew it was going to be greatness and something spectacular. He is loved and will be deeply missed forever. The world is experiencing a tremendous loss today.\"\n\nNew Girl Executive Producers\n\nWe are all so deeply saddened to hear about the passing of this hero of ours - and so grateful to have had the opportunity to meet him and to have him on our show. It's something we will remember forever. Our thoughts go out to his family. We are among the millions of people who will truly miss the brilliant Artist.\n\nFrank Ocean\n\n\"I’M NOT EVEN GONNA SAY REST IN PEACE BECAUSE IT’S BIGGER THAN DEATH. I NEVER MET THE MAN (I WAS TOO NERVOUS THE ONE TIME I SAW HIM) AND I NEVER SAW HIM PLAY LIVE, REGRETTABLY. I ONLY KNOW THE LEGENDS I’VE HEARD FROM FOLKS AND WHAT I’VE HEARD AND SEEN FROM HIS DEEP CATALOG OF PROPELLANT, FEARLESS, VIRTUOSIC WORK. MY ASSESSMENT IS THAT HE LEARNED EARLY ON HOW LITTLE VALUE TO ASSIGN TO SOMEONE ELSE’S OPINION OF YOU.. AN INFECTIOUS SENTIMENT THAT SEEMED SOAKED INTO HIS CLOTHES, HIS HAIR, HIS WALK, HIS GUITAR AND HIS PRIMAL SCREAM. HE WROTE MY FAVORITE SONG OF ALL TIME, ‘WHEN YOU WERE MINE’. IT’S A SIMPLE SONG WITH A SIMPLE MELODY THAT MAKES YOU WISH YOU THOUGHT OF IT FIRST, EVEN THOUGH YOU NEVER WOULD HAVE - A FLIRTATIOUS BRAND OF GENIUS THAT FEELS APPROACHABLE. HE WAS A STRAIGHT BLACK MAN WHO PLAYED HIS FIRST TELEVISED SET IN BIKINI BOTTOMS AND KNEE HIGH HEELED BOOTS, EPIC. HE MADE ME FEEL MORE COMFORTABLE WITH HOW I IDENTIFY SEXUALLY SIMPLY BY HIS DISPLAY OF FREEDOM FROM AND IRREVERENCE FOR OBVIOUSLY ARCHAIC IDEAS LIKE GENDER CONFORMITY ETC. HE MOVED ME TO BE MORE DARING AND INTUITIVE WITH MY OWN WORK BY HIS DEMONSTRATION - HIS DENIAL OF THE PREVAILING MODEL…HIS FIGHT FOR HIS INTELLECTUAL PROPERTY - ‘SLAVE’ WRITTEN ACROSS THE FOREHEAD, NAME CHANGED TO A SYMBOL… AN ALL OUT REBELLION AGAINST EXPLOITATION. A VANGUARD AND GENIUS BY EVERY METRIC I KNOW OF WHO AFFECTED MANY IN A WAY THAT WILL OUTRUN OBLIVION FOR A LONG WHILE. I’M PROUD TO BE A PRINCE FAN(STAN) FOR LIFE.\"\n\nHillary Clinton\n\n\"I came out of an event in Hartford, Connecticut, and people told me, and I was so stunned,\" she said. \"You think of him as being almost eternal. I mean he was a bigger-than-life personality, he was not only a songwriter and a singer but literally a one-man band. He was such a great showman. I just was so, so sad. And I just want everybody to spend some time reflecting on this American original. He was so extraordinary.\"\n\nPatti LaBelle\n\n\"I am deeply saddened by Prince's untimely passing. Not only was he a dear friend to me, but an inspiration. His talent, artistry and influence are unparalleled and there will never be another like Prince! The world has suffered a great loss! May he rest in everlasting peace.\"\n\nR. Kelly\n\n\"My thoughts are the same as everybody else's thoughts; First, I'm stunned and then just sad over the thing,\" Kelly told Billboard shortly after the news broke. \"I'm just shocked, man. I'm still stunned about the whole situation, man.\"\n\nBob Seger\n\n\"It's so sad. He was way too young. And he was kind of an athlete, such a great performer. You wouldn't expect it. ... He was just an off-the-charts talent -- instruments, songwriting, singing, performing, producing. You name it, he could do everything. My son loves [Trent] Reznor, and I told him, 'Before there was Reznor, there was Prince.' And of course I've heard stories that James Brown did that stuff, too; He would play drums, bass, could do just about it all. So it was kind of a progression. It's unusual to have somebody be that talented on so many instruments and yet still be a really good producer, songwriter — everything. ...It's a damn shame, it really is. I know he had greatness still ahead of him. I'm just glad he was around. He was a gift to music.\"\n\nDonatella Versace\n\n\"I am crying. All my memories are coming back to me. He was one of my closest friends. I will always remember when he rented a club, only for him and me. We listened to his music and spoke about the young generation. The young people were so important to Prince. They have to follow the example he set, to believe in their heart, respect their own soul and never trade their own individuality. It is what made Prince outstanding and relevant forever. I will always love him.\"\n\nCameron Strang, Chairman and CEO, Warner Bros. Records\n\nToday, we lost one of the most revolutionary talents of our time. Prince’s untimely passing is deeply shocking, reminding us that unique artists who chart their own course and move culture are precious few and irreplaceable. He leapt onto the scene in 1978 and it didn’t take the world long to realize that pop music had changed forever. He played the studio like an instrument and shattered the definition of live performance. He defined a new kind of superstardom, with a transformative impact not just on music, but on video, film, and style. Prince was the epitome of cool and mystery - an inspirational soul who created his own universe by bringing together different genres, races and cultures with a purity of sound and spirit unlike any other. His visionary gifts as a songwriter, vocalist, musician, performer and producer placed him in a league all his own. We are honored to have had Prince as a member of the Warner Bros. Records family during two eras of his astonishing career. We express our deepest condolences to everyone who loved him and join his family, friends and legion of fans in mourning his loss.\n\nCarmen Electra\n\n\"I was so shocked and heart broken to hear about the loss of my mentor, Prince. The world has lost a truly incredible spirit and musical genius. What a blessing it is to be one of the chosen ones who had the chance to work so closely with him. He gave me my name, he believed in me, and he has inspired an entire generation. I will always love him…. “Sometimes it Snows in April.\"\n\nGeorge Miller\n\n\"We used one of his songs in 'Happy Feet'. We wanted to change two words of his lyrics to suit the penguins. He asked to see the movie. As it finished he picked up his guitar and said he wanted to write a song for us. It arrived completed soon after. As I was about to listen to it for the first time I thought 'what if I don't like it?'. How do I tell this legendary figure his song doesn't fit? A few seconds in I began to smile. By the end I was dancing. It was perfect. A true genius and a true gentleman. He called me 'mister' I wanted to call him 'your majesty'. Such an astonishing loss.\"\n\nAlbert Magnoli, Writer, Director and Editor of Purple Rain\n\n\"The news of Prince’s sudden and unexpected passing is very difficult to process. He was my creative partner and friend. We shared tremendous times together during and after the making of Purple Rain. I know his fans are devastated. I know his music meant so very much to so many people. He was a good man, complicated and diligent, and like men of his caliber, he always demanded from himself and others the very best. Travel well, friend, wherever your next journey takes you.\"", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2016/04/gettyimages-52457873-h_2016.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/2016/04/gettyimages-52457873-h_2016.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2016/04/gettyimages-52457873-h_2016.jpg", "keywords": [], "authors": ["Thr Staff", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/princes-death-hollywood-mourns-legendary-886479", "title": "Hollywood Pays Tribute to Legendary Artist Prince", "meta_data": {"viewport": "width=device-width", "description": "Lenny Kravitz, Madonna, Shonda Rhimes, Justin Timberlake, Chris Rock and more expressed their sadness on social media.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/princes-death-hollywood-mourns-legendary-886479", "domain": "https://www.hollywoodreporter.com/", "title": "Hollywood Pays Tribute to Legendary Artist Prince", "description": "Lenny Kravitz, Madonna, Shonda Rhimes, Justin Timberlake, Chris Rock and more expressed their sadness on social media.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2016/04/gettyimages-52457873-h_2016.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Hollywood Pays Tribute to Legendary Artist Prince", "description": "Lenny Kravitz, Madonna, Shonda Rhimes, Justin Timberlake, Chris Rock and more expressed their sadness on social media.", "url": "https://www.hollywoodreporter.com/news/princes-death-hollywood-mourns-legendary-886479", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2016/04/gettyimages-52457873-h_2016.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Hollywood Pays Tribute to Legendary Artist Prince", "sailthru.description": "Lenny Kravitz, Madonna, Shonda Rhimes, Justin Timberlake, Chris Rock and more expressed their sadness on social media.", "sailthru.author": "THR Staff", "sailthru.vertical": "Music", "sailthru.date": "2016-04-21 10:26:48", "sailthru.tags": "Music,Culture,Prince,Obituaries"}, "movies": [], "publish_date": 1461205608.0, "source": "https://www.hollywoodreporter.com", "summary": ""}