{"url": "heavy.com/news/2016/09/angelina-jolie-lesbian-lover-girlfriend-jenny-shimizu-divorce-brad-pitt/", "text": "Chi dimentica è complice. Angelina + Jenny Shimizu 1996 pic.twitter.com/KuDB7LwmzA — Andrea Ant (@_Andrea_Ant) September 20, 2016\n\nAngelina Jolie’s third marriage, to actor Brad Pitt, now appears to be over — but there was an earlier relationship in her life that the superstar said could have led to yet another marriage, this one to a woman. For several years in the 1990s and early 2000s, Jolie was heavily involved in a lesbian romance with model and actress Jenny Shimizu. Shimizu is an out lesbian and Jolie has acknowledged her own bisexuality.\n\nHere’s what you need to know about the 49-year-old San Jose, California, native Shimizu, Jolie’s former girlfriend.\n\n1. The Couple Met On The Set of the 1996 Teen Drama “Foxfire”\n\nEven though Jolie would be married in March of 1996 to her first husband, British actor Jonny Lee Miller, she described meeting Shimizu during the casting process of Foxfire — a melodrama about five teen girls who take revenge on their sexual abuser — as such a powerful experience that she was certain the Japanese-American actress had stolen her lead role as “Legs Sadovsky.”\n\nThe young Jolie said it was love at first sight with Shimizu.\n\nangelina jolie and jenny shimizu appreciation post pic.twitter.com/ALmJzZlbrp — sporty spice (@themermaidwitch) September 20, 2016\n\n“I fell in love with her the first second I saw her,” Jolie said in a 1997 interview with Girlfriends magazine. “Actually, I saw when she was being cast in Foxfire, and I thought she had just read for my part. I thought I was going to lose the job. I said to myself, ‘Oh, my God, that’s Legs.’ She’s great. We had a lot of fun.”\n\nIn fact, she told Girlfriends, “I probably would have married Jenny Shimizu if I hadn’t married my [first] husband.”\n\nMany years later, Jolie told TV interviewer Barbara Walters that her sexual feelings for Shimizu surprised even herself.\n\n“[I was] surprised when I suddenly found myself having these feelings I always had for men, but for a woman,” the superstar told Walters. “And wanting to kiss her and wanting to touch her.”\n\nShimizu, for her part, has touted her own ability to “take care of [Angelina’s] sexual needs.”\n\nTheir lesbian relationship continued throughout Jolie’s three-year marriage to Miller, possibly contributing to their 1999 divorce, as well as afterward even as Jolie became involved with other men, according to The New York Daily News. Jolie was married to actor Billy Bob Thornton in 2000, after just two months of dating.\n\n2. Shimizu Was Reportedly Arrested For An Incident With A Previous Girlfriend\n\nPersonajes del Cine Venezolano: MACU (María Luisa Mosquera) de \"Macu, la mujer del policía\" (1987) de @solveighoo pic.twitter.com/Db1EpuQKrI — Elba Poleo (@Sabitariana) May 5, 2016\n\nIn February of 2016, the celebrity gossip site Radar Online reported that it had uncovered court documents from a 1996 incident in which Shimizu was charged with assaulting actress María Luisa Mosquera, who was Shimizu’s live-in girlfriend at the time she met Jolie.\n\nAccording to the Radar report, Shimizu was initially charged in November of 1996 with assault with a deadly weapon, stemming from an alleged incident between her and Mosquera, who starred in the 1987 Venezuelan thriller, Macu, The Policeman’s Woman.\n\nShimizu was required to post $20,000 bail and then another $80,000 bail after a December complaint against her, alleging that she made criminal threats against Mosquera and and assaulting her with a firearm, Radar cited the documents as saying. Early in 1997, she pleaded guilty to misdemeanor charges of “possession of a weapon with intent to assault and felony inflicting visible injury on a cohabitant or spouse.”\n\nShimizu was ordered to undergo a year of domestic violence counseling and pay a $200 fine, according to the Radar report. She spent a day in jail as well, the report said.\n\n3. Shimizu Has a Reported Net Worth of $2 Million\n\nA successful model in her own right, Shimizu’s picture has been snapped by such top fashion photographers as Bruce Weber, Richard Avedon, and Michel Comte and she has appeared in advertisements for high-end fashion designer labels, including Donna Karan, Jean Paul Gaultier, Thierry Mueller and the fragrance CK One. She also appeared as a judge on the Bravo network reality fashion competition show, Make Me a Supermodel.\n\nAccording to the site Celebrity Net Worth, all of this work for Shimizu has resulted in considerable financial success and an asset sheet totaling an estimated $2 million. Of course, that is literally 1/100th of the $200 million that her former girlfriend Jolie is reportedly worth.\n\nOther models apart of the heroin chic and \"dirty realism\" 90s movement of Calvin Klein include Jenny Shimizu pic.twitter.com/d382WKQuY4 — bald headed (@femmeminem) June 23, 2016\n\nAll of her modeling success has come despite the fact that Shimizu, who grew up mainly in Santa Maria, California, stands just five feet, seven inches tall. That’s a full inch shorter than the minimum height required by many major modeling agencies, which demand models between five-foot-eight and five-foot-11 inches tall.\n\n4. Shimizu Claims That She Was Once Madonna’s “Secret Booty Call”\n\nFBP: When Madonna dated Jenny Shimizu – the reason why Angelina Jolie hated Madonna. pic.twitter.com/KELdL36Ujv — The Queen (@Amen_Madonna) February 16, 2014\n\nAccording to an article by the LGBT site Pink News, Shimizu was planning a “kiss and tell” autobiography — which apparently was never completed, or at least never published — in which she would dish dirt on some of her lesbian relationships with famous celebrities. And while Jolie has spoken openly of her affair with Shimizu, another of the model’s lovers, the iconic pop star Madonna, has not.\n\nNonetheless, Shimizu claims that she happily served as Madonna’s “sex slave.”\n\n“I was her secret ‘booty call’ available any time of the day or night for secret sex sessions,” Shimizu has claimed in an interview, adding that Madonna would, she said, pay for her to fly to any part of the world that Madonna happened to be, in order to engage in steamy sexual encounters.\n\njenny shimizu hanging out wi madonna #bimbowatch pic.twitter.com/DxJZrMmZ7x — Bimbo Movie Bash (@BimboMovieBash) August 30, 2016\n\nIn a more public relationship with an actress, Shimizu also dated Ione Skye, best known as John Cusack’s co-star in the 1989 teen-flick classic, Say Anything. According to the Pink News report, Skye ditched her then-husband, Beastie Boys rapper Adam “Ad Rock” Horowitz, to take up with Shimizu.\n\n5. Shimizu Married Michelle Harper in 2014, But Jolie Didn’t Make the Wedding\n\nIn September of 2014, just a couple of weeks after Jolie married Pitt, Shimizu also got married — to fashion guru and “brand consultant” Michelle Harper.\n\nBut though Shimizu invited her famous ex-girlfriend to the private ceremony, Jolie took a pass on showing up.\n\n“Angie and I have so much history. And now that she and Brad are married, I figured it couldn’t hurt to invite her even though I knew she was probably too busy with her own life to come,” Shimizu reportedly said at the time. “It’s not like I wanted her to walk me down the aisle or anything, but it would have been a really cool thing if she’d come.”\n\nUnlike many of Shimizu’s previous lovers and girlfriends, the now-38-year-old Harper was not world-famous. The New York Times described her as a “woman of mystery.” But Harper, who was once a fixture on the New York club scene using the nickname “Cutie Pie,” told the Times that she is simply a businesswoman.\n\n“The No. 1 thing I get labeled quite often is socialite,” Harper told the paper. “And I’m not. I’m a hard-working girl who may be dressed and out a lot and outspoken, but I’m not in some bubble. There’s no money tree shaking down on me.”\n\nBut Shimizu’s marriage did not stop Twitter speculation that she and Jolie would get back together, now that Jolie is divorcing Pitt.", "images": ["https://heavyeditorial.files.wordpress.com/2016/09/pjimage-1-e1474386381542.jpg?quality=65&strip=all&w=150&h=100&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=20567959cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://heavyeditorial.files.wordpress.com/2016/09/angelina-jolie-lesbian-lover-bisexual-divorce-jonny-lee-miller-brad-pitt-jenny-shimizu-wife.jpg?quality=65&strip=all&w=778", "https://heavyeditorial.files.wordpress.com/2016/09/gettyimages-496019968-e1474383001798.jpg?quality=65&strip=all&w=150&h=100&crop=1", "https://heavyeditorial.files.wordpress.com/2016/09/angelina-jolie-lesbian-lover-bisexual-divorce-jonny-lee-miller-brad-pitt-jenny-shimizu-wife-ione-skye.jpg?quality=65&strip=all&w=780&h=550", "https://2.gravatar.com/avatar/22c96b1e2152b58518db441b85b53fa3?s=71&d=https%3A%2F%2F2.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D71&r=PG", "https://certify.alexametrics.com/atrk.gif?account=lfktn1QolK10vg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://heavyeditorial.files.wordpress.com/2016/09/angelina-jolie-marriages-jonny-lee-miller-first-husband-past-how-many-times-married-divorce-jonny-lee-miller-wife1.jpg?quality=65&strip=all&w=150&h=100&crop=1", "https://heavyeditorial.files.wordpress.com/2016/09/angelina-jolie-lesbian-lover-bisexual-divorce-jonny-lee-miller-brad-pitt-jenny-shimizu-wife-michelle-harper.jpg?quality=65&strip=all&w=780&h=452"], "top_img": "https://heavyeditorial.files.wordpress.com/2016/09/angelina-jolie-lesbian-lover-bisexual-divorce-jonny-lee-miller-brad-pitt-jenny-shimizu-wife.jpg?quality=65&strip=all&w=778", "keywords": [], "authors": ["Jonathan Vankin"], "canonical_link": "https://heavy.com/news/2016/09/angelina-jolie-lesbian-lover-girlfriend-jenny-shimizu-divorce-brad-pitt/", "title": "Jenny Shimizu, Angelina Jolie’s Ex-Girlfriend: 5 Facts", "meta_data": {"google-site-verification": "nfPVut3DNEWv3BaV0stQ8yOV3TeBg_TWFdQzQYaG8Qs", "robots": "noodp, noydir", "HandheldFriendly": "True", "MobileOptimized": 360, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "msapplication-TileColor": "#121212", "theme-color": "#121212", "description": "Angelina Jolie took a lesbian lover in the 1990s, actress and model Jenny Shimizu, after Jolie was divorced from Jonny Lee Miller.", "news_keywords": "Angelina Jolie lesbian lover, Angelina Jolie bisexual, Angelina Jolie divorce, Jonny Lee Miller, Brad Pitt, Jenny Shimizu, Jenny Shimizu wife", "keywords": "angelina jolie lesbian lover, angelina jolie bisexual, angelina jolie divorce, jonny lee miller, brad pitt, jenny shimizu, jenny shimizu wife", "msvalidate.01": "D36F6DC077CF4906C4E074037A94917B", "generator": "WordPress.com", "author": "Jonathan Vankin", "twitter": {"url": "https://heavy.com/news/2016/09/angelina-jolie-lesbian-lover-girlfriend-jenny-shimizu-divorce-brad-pitt", "card": "summary", "site": "@heavysan", "creator": "@heavysan"}, "fb": {"admins": 1041016861, "app_id": 1103740676351644}, "article": {"publisher": "https://www.facebook.com/heavycom", "published_time": "2016-09-20T21:56:21+00:00", "modified_time": "2016-09-20T22:59:43+00:00", "author": "https://heavy.com/author/jonvankin/", "section": "News", "tag": "Jonny Lee Miller"}, "og": {"image": {"identifier": "https://heavyeditorial.files.wordpress.com/2016/09/angelina-jolie-lesbian-lover-bisexual-divorce-jonny-lee-miller-brad-pitt-jenny-shimizu-wife.jpg?quality=65&strip=all", "width": 778, "height": 440}, "site_name": "Heavy.com", "type": "article", "locale": "en_US", "url": "https://heavy.com/news/2016/09/angelina-jolie-lesbian-lover-girlfriend-jenny-shimizu-divorce-brad-pitt/", "title": "Jenny Shimizu, Angelina Jolie’s Ex-Girlfriend : 5 Fast Facts You Need To Know", "description": "Angelina Jolie, who is bisexual, dated actress-model Jenny Shimizu in the 1990s. Shimizu also dated Madonna."}, "application-name": "Heavy.com", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Breaking News, Sports, Entertainment, TV, Tech, Gaming & Health.", "msapplication-task": "name=Subscribe;action-uri=https://heavy.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/6e68a7d5b8fce58735ab84f887ee5981?s=16", "ir-site-verification-token": 268982007}, "movies": [], "publish_date": 1474408581.0, "source": "http://heavy.com", "summary": ""}