{"url": "https://www.bustle.com/p/sterling-k-browns-golden-globes-speech-was-so-so-moving-just-like-everything-else-he-does-7814990", "text": "The Golden Globes are known for switching things up compared to other award shows, but that wasn't the case when Sterling K. Brown won the Golden Globe for Best Performance by an Actor In A Television Series - Drama for his role as Randall Pearson on This Is Us. Brown beat out Jason Bateman for Ozark, Freddie Highmore for The Good Doctor, Bob Odenkirk — Better Call Saul, and Liev Schreiber for Ray Donovan. And just like Brown doesn't disappoint week to week on This Is Us, he's also proving himself a force to be reckoned with when it comes to awards show speeches.\n\nBrown was the most obvious choice to win the Best Actor in a TV Drama award, considering in September, he won the Emmy Award for Outstanding Lead Actor in a Drama Series. That win made Brown the first black man to take home the award in 19 years. That said, it wouldn't have been a huge surprise if the Globes had chosen a wild card. As Entertainment Weekly noted in their predictions, \"The HFPA loves to honor members of the freshman class,\" which made EW think Highmore was going to win. TV Guide also predicted a win for Highmore, explaining that the category was a \"toss-up\" between him and Brown, but that a win for Highmore on The Good Doctor would be a shout-out to the new show. Meanwhile, TIME predicted Brown's win, noting that he was a sure bet and that the \"HFPA overlooked him last year when he was nominated for The People v. O.J. Simpson.\"\n\nBrown gave a funny and emotional speech when he won his Emmy, but it also got a lot of attention because he was cut off before he was finished speaking. Now, Brown has made up for that with his Golden Globes' speech, only four months later. This win was also a historic one for the actor; it made him the first black TV drama actor winner.\n\nHe started the speech by simply saying, \"Oprah...\" I mean, she was right there in the audience, after all, and who wouldn't be stunned by the Oprah Winfrey? He soon continued on, though, and made a reference to his Emmy's speech being cut off when he said, \"I don't want to run out of time, so let me thank my wife.”\n\nBrown then went on to thank his kids — \"I will take you to school in the morning, I promise,\" he told them — as well as NBC and his co-stars. But then, things took a more serious turn when he began to thank This Is Us creator Dan Fogelman.\n\nBrown first talked about how he has benefitted from \"colorblind casting\" throughout his career in parts where they would just \"throw a brother in this role.\" But what he appreciates about playing Randall, the character Fogelman created, is that it isn't colorblind at all.\n\n\"Dan Fogelman, you wrote a role for a black man that could only be played by a black man,\" Brown said. \"And so, what I appreciate so much about this thing is I am being seen for who I am. I am being appreciated for who I am. And it makes it that much more difficult to dismiss me or to dismiss anybody who looks like me. So thank you, Dan. Thank you, Hollywood Foreign Press.\"\n\nIn addition to Brown's nomination for This Is Us, the show was also nominated in two other categories: Best TV Drama Series, which it lost to The Handmaid's Tale; and Best Supporting Actress in a Series, Miniseries, or Motion Picture for TV for Chrissy Metz, who plays Randall's sister, Kate, on the series, and who lost out to Laura Dern for Big Little Lies.", "images": ["https://imgix.bustle.com/uploads/getty/2018/1/8/5f6d5677-dcd3-4223-a792-126cad2cad0c-getty-902328164.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/a0c20f01-67af-4bfe-ae91-db67a37e5b8a-getty-1142135670.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/060a47f5-6a46-41c6-b963-760894135871-getty-966471954.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/18/c137de9e-5273-41dd-9e8c-ae59ff8e04a9-getty-1077926024.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/1/8/5f6d5677-dcd3-4223-a792-126cad2cad0c-getty-902328164.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/17/d6cdd3c0-5d03-437e-9e67-25d6f21b901f-getty-1206512433.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/8/5f6d5677-dcd3-4223-a792-126cad2cad0c-getty-902328164.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/sterling-k-browns-golden-globes-speech-was-so-so-moving-just-like-everything-else-he-does-7814990", "title": "Sterling K. Brown’s Golden Globes Speech Was So, So Moving — Just Like Everything Else He Does", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/sterling-k-browns-golden-globes-speech-was-so-so-moving-just-like-everything-else-he-does-7814990", "type": "article", "title": "Sterling K. Brown's Golden Globes Win Is Also A History-Making Moment", "description": "The Golden Globes are known for switching things up compared to other award shows, but that wasn't the case when Sterling K. Brown won the Golden Globe for Best Performance by an Actor In A Television Series - Drama for his role as Randall Pearson…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/8/5f6d5677-dcd3-4223-a792-126cad2cad0c-getty-902328164.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The Golden Globes are known for switching things up compared to other award shows, but that wasn't the case when Sterling K. Brown won the Golden Globe for Best Performance by an Actor In A Television Series - Drama for his role as Randall Pearson…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}