{"url": "https://en.wikipedia.org/wiki/Young_Sheldon", "text": "American television sitcom\n\nYoung Sheldon is an American comedy television series on CBS created by Chuck Lorre and Steven Molaro. The series is a spin-off prequel to The Big Bang Theory and begins with the character Sheldon Cooper at the age of nine, living with his family in East Texas and going to high school. Iain Armitage stars as young Sheldon, alongside Zoe Perry, Lance Barber, Montana Jordan, Raegan Revord, and Annie Potts. Jim Parsons, who portrays the adult Sheldon Cooper on The Big Bang Theory, narrates the series and serves as an executive producer.\n\nDevelopment of the prequel series began in November 2016, from an initial idea that Parsons passed along to The Big Bang Theory producers. The following March, Armitage and Perry were cast, and the series was ordered by CBS. The series premiered as a special preview on September 25, 2017, and two days later, CBS picked up the series for a full season of 22 episodes. From November 2, 2017, new episodes began airing weekly. In January 2018, CBS renewed the series for a second season which premiered on September 24, 2018, and in February 2019, for a third and fourth season, with the third season having premiered on September 26, 2019.\n\nPremise [ edit ]\n\nThe series takes place in the late 1980s and early 1990s; and follows Sheldon Cooper as a young boy attending high school in the fictional town of Medford, Texas, aged nine in the first season[1] as he tries to fit into the world around him while his family and friends attempt to deal with his unique intellectual capabilities and social challenges.[1]\n\nIn the series premiere, adult Sheldon states that \"nobody I knew in East Texas in 1989 cared about Newtonian physics\".[3][a]\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nIain Armitage as Sheldon Cooper, a child prodigy with a \"once-in-a-generation mind capable of advanced mathematics and science\". While well-versed in all types of math and science, he is shown to prefer theoretical physics, stating that he decided to pursue the field around the same time as the show began. While academically gifted, Sheldon lacks a full understanding of social cues and behaviors, in addition to having a sense of superiority over everyone around him due to his intelligence. Sheldon is prone to traveling his own path even if he gets into trouble along the way. Nevertheless, Sheldon has proven to love his family and almost always has his heart in the right place. [4] He is age 9 in the first season and age 10 in the second. [5]\n\nHe is age 9 in the first season and age 10 in the second. Zoe Perry as Mary Cooper, Sheldon's mother. She is very protective and patient with Sheldon but also struggles to understand him at times. She is a devout Christian and so has friction with Sheldon's atheism and derision of Christianity. Nevertheless, she deeply loves her son and wants to protect him for as long as she can. [4]\n\nLance Barber as George Cooper Sr. , Sheldon's father and the head football coach at Medford High. George does not share Sheldon's intellect, sometimes leading others, especially Meemaw, to doubt him being Sheldon's father. However, he is often the voice of reason for Sheldon. Though he may struggle with understanding his intellectually gifted son, he is a loving father and has defended Sheldon on multiple occasions, earning Sheldon's love and appreciation. [1]\n\n, Sheldon's father and the head football coach at Medford High. George does not share Sheldon's intellect, sometimes leading others, especially Meemaw, to doubt him being Sheldon's father. However, he is often the voice of reason for Sheldon. Though he may struggle with understanding his intellectually gifted son, he is a loving father and has defended Sheldon on multiple occasions, earning Sheldon's love and appreciation. Montana Jordan as George \"Georgie\" Cooper Jr. , Sheldon's older brother. Georgie detests Sheldon and never hesitates to bully him. He is not very intelligent and so is mocked and teased by the rest of the family, particularly Sheldon and Meemaw. While he is outwardly confident in himself, Georgie hides deep insecurities over feeling inferior to his genius brother and thus copes by trying to belittle Sheldon's intelligence in any way he can. He attends Medford High with Sheldon and plays on the football team. [1]\n\n, Sheldon's older brother. Georgie detests Sheldon and never hesitates to bully him. He is not very intelligent and so is mocked and teased by the rest of the family, particularly Sheldon and Meemaw. While he is outwardly confident in himself, Georgie hides deep insecurities over feeling inferior to his genius brother and thus copes by trying to belittle Sheldon's intelligence in any way he can. He attends Medford High with Sheldon and plays on the football team. Raegan Revord as Missy Cooper, Sheldon's fraternal twin sister. She teases Sheldon along with Georgie but not as much. She does not share Sheldon's intelligence but is very perceptive. She does not always get along with Sheldon, but she finds in her twin brother a solid confidant and has admitted to not feeling as whole without him. [1] In episode 21 of season one, she asks her father to call her Melissa, implying that Missy is a nickname.\n\nIn episode 21 of season one, she asks her father to call her Melissa, implying that Missy is a nickname. Jim Parsons as the voice of adult Sheldon Cooper, who provides the perspective of an adult looking back at his childhood. [1]\n\nAnnie Potts as Constance \"Connie\" Tucker, Sheldon, Missy, and Georgie's grandmother, whom they refer to as \"Meemaw\". She is very close with Mary and her grandchildren but does not think highly of George and often jokes about him. She is the most patient and understanding of Sheldon's quirks and advises Mary to trust that Sheldon will find his way. [6]\n\nMatt Hobby as Pastor Jeff (season 3; recurring seasons 1–2),[7] the upbeat pastor at the Cooper family's church. Like Mary, he has friction with Sheldon's atheism, but he often challenges Sheldon to explore their line of thought through logic exercises. He was originally given the last name Hodgkins, but it was changed to Difford as of the episode \"Seven Deadly Sins and a Small Carl Sagan\".\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired Rank Avg. viewers\n\n(millions) First aired Last aired 1 22 September 25, 2017 ( ) May 10, 2018 ( 2018-05-10 ) 6 16.30[13] 2 22 September 24, 2018 ( ) May 16, 2019 ( 2019-05-16 ) 5 14.37[14] 3 TBA September 26, 2019 ( ) TBA TBA TBA\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn November 2016, it was reported that CBS was in negotiations to create a spin-off of The Big Bang Theory centered on Sheldon Cooper as a young boy. The prequel series, described as \"a Malcolm in the Middle-esque single-camera family comedy\" would be executive produced by The Big Bang Theory co-creator Chuck Lorre and producer Steven Molaro, with The Big Bang Theory co-creator Bill Prady expected to be involved in some capacity, and intended to air in the 2017–18 season alongside The Big Bang Theory.[15][16] The initial idea for the series came from Jim Parsons (who portrays the older Sheldon on The Big Bang Theory), who passed it along to The Big Bang Theory producers.[4] On March 13, 2017, CBS ordered the spin-off Young Sheldon series, which was created by Lorre and Molaro. Jon Favreau directed and executive produced the pilot. Parsons, Lorre, Molaro and Todd Spiewak also serve as executive producers on the series, for Chuck Lorre Productions, Inc. in association with Warner Bros. Television.[1] On September 27, 2017, CBS picked up the series for a full season of 22 episodes.[17] On January 6, 2018, the show was renewed for a second season.[18] The second season premiered on September 24, 2018.[19] On February 22, 2019, CBS renewed the series for both a third and a fourth season.[20] The third season premiered on September 26, 2019.[21] On March 13, 2020, Warner Bros. Television shut down production on the series due to the 2019–20 coronavirus pandemic.[22]\n\nCasting [ edit ]\n\nIn early March 2017, Iain Armitage was cast as the younger Sheldon, as well as Zoe Perry as his mother, Mary Cooper. Perry is the real-life daughter of Laurie Metcalf, who portrays Mary Cooper on The Big Bang Theory.[4] Lance Barber stars as George Cooper Sr., Sheldon's father; he had previously appeared in one episode of The Big Bang Theory.[23] Raegan Revord stars as Missy Cooper, Sheldon's twin sister; Revord getting the part only after repeatedly asking her mother to be allowed to read for the role.[24] Also starring Montana Jordan as George Cooper Jr., Sheldon's older brother. Jim Parsons reprises his role as adult Sheldon Cooper, as narrator for the series. In July 2017, Annie Potts was cast as Meemaw, Sheldon's grandmother.[6]\n\nOverlap with the parent series [ edit ]\n\nIn most cases different actors are used to portray a given character in the two series, to account for the age difference. Jim Parsons is a notable exception in that he appears in both series as the same character, though in this series his appearance is limited to voice only. Bob Newhart appears as Professor Proton in both series; with the appearance in this series the character is made to look younger. Iain Armitage (Sheldon), Lance Barber (George), and Montana Jordan (Georgie) make a guest appearance in the parent series in a scene in which a VHS tape recorded decades earlier is played.[25] There are other actors who appear in both series but as different characters. This includes Barber, who had another guest appearance in the parent series as a different character.[26] Elon Musk makes cameo appearances as himself in both series.[27][28]\n\nThe second-season finale episode aired immediately following the one-hour series finale of the parent series. In a tribute to the parent series finale, several references are made to the parent series in the Young Sheldon episode. The references are both general to the entire parent series, as well as to the series finale in particular. In one scene in the Young Sheldon episode, Sheldon promises his father that when he wins the Nobel Prize, Sheldon will mention him in his acceptance speech. In the parent series finale, Sheldon wins the Nobel Prize. In another scene in the Young Sheldon episode, Nobel Prize winners are announced out over a montage showing the main characters from the parent series Leonard, Penny, Raj, Howard, Bernadette and Amy as children. Following the montage, adult Sheldon says that he was wrong about feeling at the moment of the Nobel prize announcement that he would be all alone for the rest of his life.[29]\n\nTitle sequence [ edit ]\n\nThe show's title sequence is played to the song \"Mighty Little Man\" by Steve Burns. The song is the first track in Burns' 2003 album Songs for Dustmites.[30] Season 3 changed the title sequence to include the entire Cooper family.[31]\n\nRelease [ edit ]\n\nYoung Sheldon began airing weekly episodes on CBS from November 2, 2017, after The Big Bang Theory. It premiered as a special preview on September 25, 2017.\n\nReception [ edit ]\n\nRatings [ edit ]\n\nSeason Timeslot (ET) Episodes First aired Last aired TV season Viewership\n\nrank Avg. viewers\n\n(millions) Avg. 18–49\n\nrating Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Thursday 8.30 p.m.[b] 22 September 25, 2017 ( ) 17.21[32] May 10, 2018 ( 2018-05-10 ) 12.44[33] 2017–18 6 16.30[13] 3.3[13] 2 22 September 24, 2018 ( ) 10.58[34] May 16, 2019 ( 2019-05-16 ) 13.60[35] 2018–19 5 14.37[14] 2.6[14] 3 Thursday 8.00 p.m.[36] TBA September 26, 2019 ( ) 8.24[37] TBA TBD 2019–20 TBD TBD TBD\n\nCritical reception [ edit ]\n\nThe review aggregator website Rotten Tomatoes reported a 76% approval rating with an average rating of 6.61/10 based on 45 reviews. The website's consensus reads, \"Young Sheldon's appealing cast and relatable themes bring a fresh—and overall enjoyable—perspective to its central character's familiar story.\"[38] Metacritic, which uses a weighted average, assigned a score of 63 out of 100 based on 25 critics, indicating \"generally favorable reviews\".[39]\n\nAwards and nominations [ edit ]\n\nHome media [ edit ]\n\nThe first season of Young Sheldon was released on DVD and Blu-ray by Warner Bros. on September 4, 2018.[43][44] Similarly, the second season was released on DVD and Blu-ray on September 3, 2019.[45]\n\nNotes [ edit ]\n\n^ Dr. Sturgis and Dr. Linkletter, two college physics professors who teach the classes in which Sheldon enrolls, are not introduced until Season 1 Episode 19 and Season 2 Episode 13 respectively. ^ Both seasons premiered on a Monday, with all the other episodes in the respective seasons broadcasting at the designated time slot.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/Young_Sheldon_title_card.png/250px-Young_Sheldon_title_card.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Young_Sheldon", "title": "Young Sheldon", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}