{"url": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_The_Weeknd", "text": "Abel Tesfaye, known by his stage name The Weeknd, is a Canadian singer, songwriter and record producer. He rose to prominence following the release of his critically acclaimed mixtape House of Balloons, which was nominated for The Canadian Polaris Prize. After signing with the Republic Records in 2012, he released his debut studio album, Kiss Land the following year to positive reviews. In 2015, he won the Grammy Award for Best Urban Contemporary Album and Best R&B Performance for his second album, Beauty Behind the Madness. He has received a total of 80 awards out of 200 nominations. In 2018, Abel also won another Grammy for Best Urban Contemporary Album.\n\nAcademy Awards [ edit ]\n\nThe Weeknd was nominated for an Academy Award for Best Original Song in 2016 for his song Earned It for the Fifty Shades of Grey: Original Motion Picture Soundtrack, but lost to the British vocalist Sam Smith, who won for his Spectre theme song \"Writing's on the Wall\".\n\nAmerican Music Awards [ edit ]\n\nLatin American Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2017 Himself Favorite Crossover Artist Nominated [6]\n\nARIA Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 Himself Best International Artist Nominated [7]\n\nASCAP Awards [ edit ]\n\nRhythm and Soul Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"Earned It\" Top R&B/Hip-Hop Song Won [8] \"The Hills\" Award Winning R&B/Hip-Hop and Rap songs Won\n\nAscap Pop Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2017 \"In the Night\" Award Winning Songs Won [9] \"Starboy\" (featuring Daft Punk) Won\n\nBillboard Awards [ edit ]\n\nBillboard Music Awards [ edit ]\n\nThe Weeknd has won 9 awards out of 37 nominations.\n\nBillboard Latin Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 Himself Crossover Artist of the Year Nominated [14]\n\nBillboard Touring Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 The Weeknd Breakthrough Nominated [15][16]\n\nBillboard Power 100 [ edit ]\n\nYear Nominee / work Award Result Ref. 2017 The Weeknd Power Artists Won [17]\n\nBlack Reel Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"Earned It\" Outstanding Original Song Nominated [18]\n\nBBC Awards [ edit ]\n\nBBC Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2015 Himself International Artist of the Year Nominated [19] \"Can't Feel My Face\" Song of the Year Nominated\n\nSound of... [ edit ]\n\nYear Nominee / work Award Result Ref. 2013 The Weeknd Sound of... 2013 Nominated [20]\n\nBET Awards [ edit ]\n\nBRIT Awards [ edit ]\n\nCanadian Radio Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"Can't Feel My Face\" SOCAN Song of the Year Won [28] Himself Fans' Choice Won\n\nCanada's Walk of Fame [ edit ]\n\nFirst awarded in 2010, the Allan Slaight Award, named after the leading figure in the Canadian radio industry, is awarded to a young Canadian for \"making a positive impact in the fields of music, film, literature, visual or performing arts, sports, innovation or philanthropy.\" Recipients receive an honorarium of $10,000 from the Slaight Foundation, but are not considered inductees of the Walk of Fame.\n\nYear Nominee / work Award Result Ref. 2014 Himself Allan Slaight Award Won [29]\n\nECHO Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 Himself Best International Newcomer Nominated [30] Beauty Behind the Madness Best International Hip Hop/Urban Album Nominated\n\nGAFFA Awards [ edit ]\n\nGAFFA Awards (Denmark) [ edit ]\n\nDelivered since 1991, the GAFFA Awards are a Danish award that rewards popular music by the magazine of the same name.\n\nYear Nominee / work Award Result Ref. 2015 Himself Best Foreign Male Act Won [31]\n\nGAFFA Awards (Sweden) [ edit ]\n\nDelivered since 2010, the GAFFA Awards (Swedish: GAFFA Priset) are a Swedish award, offered by the magazine of the same name, that honors popular music.\n\nGrammy Awards [ edit ]\n\nThe Weeknd has won 3 awards from 10 nominations.[36]\n\nGuinness World Records [ edit ]\n\nThe Guinness World Records is a reference book published annually, containing a collection of world records.[37] The Weeknd currently holds two records.\n\nYear Nominated work Category Result Notes Ref. 2017 Beauty Behind the Madness Most Streamed Album on Spotify in One Year Won 60 million unique listeners on Spotify between Dec 1, 2014 and Dec 1 2015 [38] Himself Most Consecutive Weeks in the Top 10 of Billboard's Hot 100 by a Solo Male Artist Won 45 consecutive weeks on Top 10 between March 7, 2015 and January 9, 2016 for singles Earned It. Can't Feel My Face and The Hills\n\niHeartRadio Awards [ edit ]\n\niHeartRadio MMVAs [ edit ]\n\nThe Weeknd has 5 awards from 17 nominations.\n\niHeartRadio Music Awards [ edit ]\n\nInnovator Awards [ edit ]\n\nThe Innovator Awards is an annual award ceremony held by WSJ. Magazine, that honors pioneering talents for their groundbreaking accomplishments in their respective disciplines.\n\nYear Nominee / work Award Result Ref. 2016 The Weeknd Music Innovator Won [48]\n\nInternational Dance Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"Can't Feel My Face\" Best Commercial/Pop Dance Track Nominated [49] Best R&B/Urban Dance Track Won \"The Hills\" Nominated Himself Best Breakthrough Artist Nominated\n\nInternational Online Cinema Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"Earned it\" Best Original Song Nominated [50]\n\nJuno Awards [ edit ]\n\nMTV Awards [ edit ]\n\nMTV Video Music Awards [ edit ]\n\nThe Weeknd has 11 nominations.\n\nMTV Europe Music Awards [ edit ]\n\nMTV Video Music Awards Japan [ edit ]\n\nmtvU Woodie Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2012 The Weeknd Breaking Woodie Nominated [70] 2013 FOMO Woodie Won [71]\n\nO Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2012 \"Wicked Games\" Too Much Ass for TV Won [72] The Weeknd Best Web-born Artist Won\n\nMOBO Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2015 Beauty Behind the Madness Best International Album Nominated [73]\n\nNAACP Awards [ edit ]\n\nNAACP Image Awards [ edit ]\n\nNickelodeon Awards [ edit ]\n\nNickelodeon Kids' Choice Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 Himself Favorite Male Singer Nominated [75] \"Can't Feel My Face\" Favorite Song of the Year Nominated 2017 Himself Favorite Male Singer Nominated [76]\n\nNME Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"Can't Feel My Face\" Best Track Nominated [77] 2017 The Weeknd International Male Artist Nominated [78]\n\nNRJ Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2015 The Weeknd International Breakthrough of the Year Nominated [79] 2016 International Male Artist of the Year Nominated [80] 2017 Nominated [81] Honor Award Won I Feel It Coming (featuring Daft Punk) International Song of the Year Nominated\n\nPeople's Choice Awards [ edit ]\n\nPolaris Music Prize [ edit ]\n\nSiriusXM Indies Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2012 The Weeknd Artist of the Year Won [88] 2013 Nominated [89] Soul/R&B Artist of the Year Won 2014 Artist of the Year Nominated [90] Must Follow Artist of The Year Nominated Kiss Land Album of the Year Nominated \"Live For\" (feat. Drake) Collaboration of the Year Nominated 2015 The Weeknd Songwriter of the Year Nominated [91] Artist of The Year Won [92]\n\nSOCAN Music Awards [ edit ]\n\nThe Society of Composers, Authors and Music Publishers of Canada (SOCAN) is a non-profit organization that recognizes its members for their various accomplishments in the field of music.[93]\n\nSoul Train Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2015 \"Earned It\" Video of the Year Nominated [104] Song of the Year Nominated The Ashford & Simpson Songwriter's Award Nominated Beauty Behind the Madness Album of the Year Won Himself Best R&B/Soul Male Artist Won 2016 Nominated [105] 2017 Nominated [106] Starboy Album/Mixtape Of The Year Nominated\n\nTeen Choice Awards [ edit ]\n\nUK Music Video Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2017 Himself Best Artist Nominated [110] False Alarm Best Pop Video - International Nominated Best Visual Effects in a Video Nominated Vevo Presents: The Weeknd, False Alarm Best Live Session Nominated\n\nWebby Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 \"In The Night\" Best Music Video Won [111]\n\nYouTube Music Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2015 The Weeknd 50 artists to watch Won [112]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/FEQ_July_2018_The_Weeknd_%2844778856382%29_%28cropped%29.jpg/200px-FEQ_July_2018_The_Weeknd_%2844778856382%29_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/b/b8/FEQ_July_2018_The_Weeknd_%2844778856382%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b8/FEQ_July_2018_The_Weeknd_%2844778856382%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_The_Weeknd", "title": "List of awards and nominations received by The Weeknd", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/b/b8/FEQ_July_2018_The_Weeknd_%2844778856382%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}