{"url": "https://www.etonline.com/melissa-schuman-tearfully-addresses-nick-carter-rape-allegations-i-want-inspire-other-victims-91950", "text": "Former pop singer Melissa Schuman says she's forgiven Nick Carter weeks after going public with allegations that the Backstreet Boys star raped her.\n\nSchuman recently sat down for an episode of The Dr. Oz Show -- which will air on Friday -- where she shared a message for Carter and explained what motivated her to come forward with her allegations in the first place.\n\n\"I forgive you,\" Schuman, 33, said, directing her remarks toward Carter. \"I don’t want anything from you. I wish you only the best. I don’t want your money. I didn’t do this to hurt you or your family. I did this for me, because I needed this healing.\"\n\n\"I also came forward because I want to inspire other victims, other people who have been assaulted to come forward and know that they have a voice,\" she added in this sneak peek at the upcoming episode.\n\nSchuman -- who was a member of the early 2000s girl group Dream -- came forward with allegations in a post on her personal blog earlier this month, in which she claimed that Carter raped her when she was 18 years old and he was 22.\n\nAfter the post was picked up by media outlets, Carter denied the allegations.\n\n\"I am shocked and saddened by Ms. Schuman’s accusations. Melissa never expressed to me while we were together or at any time since that anything we did was not consensual,\" Carter said in a statement released to ET. \"We went on to record a song and perform together, and I was always respectful and supportive of Melissa both personally and professionally. This is the first that I am hearing about these accusations, nearly two decades later. It is contrary to my nature and everything I hold dear to intentionally cause someone discomfort or harm.\"\n\nWhile speaking with Dr. Oz, Schuman claimed that she originally considered pressing charges against the popular boy band member, but was allegedly warned about the ramifications of coming forward.\n\n\"I’d actually confided in my manager at that time about pressing charges. And I was told that he had the most powerful litigator in the country and that I didn’t have the money to pay for an attorney to essentially defend me, if he were to come after me,\" she said.\n\nThe former singer further claimed that her manager told her, \"'Everyone’s going to call you fame hungry, [and say] that you're trying to use this to better yourself or get your name out there and at this point there’s nothing we can do.\"\n\nSchuman said in the post that she was invited over to Carter's house during a day off from filming a made-for-TV movie they were co-starring in -- 2004's The Hallow. She claimed that after arriving at his apartment with her roommate, they listened to the singer's new music before he allegedly brought her into the bathroom, where she claimed they started kissing.\n\nSchuman alleged that Carter started unbuttoning her pants, disregarding her objections before allegedly performing oral sex on her. She claimed he then demanded she perform oral sex on him, writing, \"My thought was the only way to get out was to get him to finish what he had started.\"\n\nSchuman stated that Carter then took her to the bedroom, where she alleges he raped her.\n\nShe further wrote that she didn't tell anyone about the alleged encounter for years, and even sang a duet with Carter before losing interest in a career as a recording artist.\n\n\"I feel I have an obligation now to come forward with the hope and intention to inspire and encourage other victims to tell their story. We are stronger in numbers,\" Schuman concluded her post.\n\nSchuman's sit-down interview on The Dr. Oz Show airs Friday. Check here for local listings.\n\nCarter is one of dozens of high-profile celebrities who have been accused of sexual misconduct in the past two months. Earlier this week, longtime Today show host Matt Lauer was fired by NBC for alleged \"inappropriate workplace behavior.\"\n\nHours after his termination was announced, a report published by Variety included multiple unnamed women who accused the veteran TV news personality of sexual harassment. Watch the video below for the latest on the scandal surrounding the veteran TV newsman.\n\nRELATED CONTENT:\n\nNEWS: Nick Carter Accused of Sexual Assault by Dream's Melissa Schuman\n\nNEWS: Nick Carter Is 'Shocked and Saddened' by Sexual Assault Allegations\n\nWATCH: More Matt Lauer Sexual Harassment Accusations Surface After 'Today' Show Firing\n\nWATCH: Matt Lauer's Alleged Sexual Misconduct Occurred at 2014 Sochi Olympics, Source Says He's 'Remorseful'", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-11/melissa_schuman_nick_carter_inset_2pic_gettyimages.jpg?h=c673cd1c&itok=QR8G42UT", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-11/melissa_schuman_nick_carter_inset_2pic_gettyimages.jpg?h=c673cd1c&itok=eowOe6Ze", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-11/melissa_schuman_nick_carter_inset_2pic_gettyimages.jpg?h=c673cd1c&itok=QR8G42UT", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/melissa-schuman-tearfully-addresses-nick-carter-rape-allegations-i-want-inspire-other-victims-91950", "title": "Melissa Schuman Tearfully Addresses Nick Carter Rape Allegations: 'I Want to Inspire Other Victims'", "meta_data": {"article": {"opinion": "false"}, "title": "Melissa Schuman Tearfully Addresses Nick Carter Rape Allegations: 'I Want to Inspire Other Victims' | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/melissa-schuman-tearfully-addresses-nick-carter-rape-allegations-i-want-inspire-other-victims-91950", "title": "Melissa Schuman Tearfully Addresses Nick Carter Rape Allegations: 'I Want to Inspire Other Victims'", "description": "The former teen pop singer opened up to Dr. Oz about her accusations against the Backstreet Boys singer and said she had a message of forgiveness.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-11/melissa_schuman_nick_carter_inset_2pic_gettyimages.jpg?h=c673cd1c&itok=QR8G42UT", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The former teen pop singer opened up to Dr. Oz about her accusations against the Backstreet Boys singer and said she had a message of forgiveness.", "title": "Melissa Schuman Tearfully Addresses Nick Carter Rape Allegations: 'I Want to Inspire Other Victims'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/melissa-schuman-tearfully-addresses-nick-carter-rape-allegations-i-want-inspire-other-victims-91950", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-11/melissa_schuman_nick_carter_inset_2pic_gettyimages.jpg?h=c673cd1c&itok=QR8G42UT"}, "description": "The former teen pop singer opened up to Dr. Oz about her accusations against the Backstreet Boys singer and said she had a message of forgiveness.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Nick Carter, Melissa Schuman", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/p-8GP2m9vOc?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}