{"url": "https://popculture.com/celebrity/2017/12/11/della-reese-memorial-held-former-co-star-roma-downey-reveals/", "text": "The life of Della Reese was remembered during a memorial service on Saturday. Her Touched by an Angel co-star Roma Downey said the service was a celebration of her life with \"love and laughter and tears.\"\n\nA post shared by Roma Downey? (@romadowney) on Dec 9, 2017 at 3:09pm PST\n\nDowney posted a picture of the memorial service's program.\n\n\"We just gave Della a beautiful send off. She would have loved it,\" Downey wrote. \"We celebrated her life with love and laughter and tears, great stories and fond memories with music and prayer and beautiful uplifting readings from the Bible (Psalm 27 and John 3.16).\"\n\nShe called it a \"a loving memorial fitting for the beloved star she was and a joyful celebration of her wonderful life well lived.\"\n\nReese died on Nov. 19 at age 86 at her California home.\n\n\"God speed sweet Della Reese. We will love you forever and we will never forget you,\" Downey said in a statement. \"You touched all of our lives with your courage and talent and faith and goodness and wisdom and your generosity and your loving heart and your beautiful amazing voice. Thank you for walking this way with us. May you Rest In Peace forever.\"\n\nReese was born in Detroit and began her career in showbusiness as a singer, scoring a hit with \"Don't You Know.\" She began an acting career in the 1960s and had her own talk show in 1969 and 1970.\n\nAfter a near-fatal aneurysm in 1979, she became an ordained minister. She was nominated for two Emmys and a Golden Globe for Touched by an Angel, which ran from 1994 to 2003 on CBS.\n\n\"She was a mother to me and I had the privilege of working with her side by side for so many years on Touched by an Angel,\" Downey said in a statement on Nov. 20. \"I know heaven has a brand new angel this day. Della Reese will be forever in our hearts. Rest In Peace, sweet angel. We love you.\"", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2017/12/11/della-reese-memorial-held-former-co-star-roma-downey-reveals/", "title": "Della Reese Memorial Held, Former Co-Star Roma Downey Reveals", "meta_data": {"description": "The life of Della Reese was remembered during a memorial service on Saturday. Her Touched by an Angel co-star Roma Downey said the service was a celebration of her life with 'love and laughter and tears.'  A post shared by Roma Downey🦋 (@romadowney) on Dec 9, 2017 at 3:09pm PST  Downey posted a [...]", "keywords": "Della Reese,Celebrity Deaths", "news_keywords": "Della Reese,Celebrity Deaths", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "dsl89", "title": "Della Reese Memorial Held, Former Co-Star Roma Downey Reveals", "description": "The life of Della Reese was remembered during a memorial service on Saturday. Her Touched by an [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Della Reese Memorial Held, Former Co-Star Roma Downey Reveals", "type": "article", "url": "https://popculture.com/celebrity/2017/12/11/della-reese-memorial-held-former-co-star-roma-downey-reveals/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "The life of Della Reese was remembered during a memorial service on Saturday. Her Touched by an [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1512921600.0, "source": "https://popculture.com", "summary": ""}