{"url": "dlisted.com/tag/justin_theroux/page/2/", "text": "Category: Justin Theroux\n\nJustin Theroux And Laura Harrier Have Been Seen Hanging Out Again 0 Justin Theroux has been linked to so many people since his split from Jennifer Aniston. If there was an unofficial Justin Theroux Rebound Bingo game, someone would have at least four corners and a line by now. Most recently though, he declined to comment on whether he was with Emma Stone or Selena Gomez or Petra Collins by telling the New York Times: “Is this the part where I coyly raise an eyebrow and not answer the question?” He might not be saying who he’s coyly raising any of his body parts around, but we can once again look at the clues and wildly speculate. People points out that 47-year-old Justin was spotted yesterday in Paris, France with Spider-Man: Homecoming actress, 28-year-old Laura Harrier. Justin Theroux Steps Out with Spider-Man Actress Laura Harrier in Paris https://t.co/EjUMA9idvc — People (@people) October 2, 2018 Before you go thinking: “Come on, plenty of guys in their late-40s wander aimlessly around the romantic streets of Paris in Autumn with their late-20s female friends,” this isn’t new. Justin and Laura were rumored to be casually hanging out in France earlier this summer. At the time, Laura denied anything was going on by telling Elle: “We all work together for [Louis Vuitton] and have become friends.” Reps for Justin and Laura declined People’s request for a comment, so we don’t know for sure. But if they are dating, then I wish them the best, especially Laura. Normally an almost 20-year age difference would cause the older person to struggle to relate to the younger person. But Justin prides himself on being that hipster that knows everything before everyone else, so this might be the first time the younger person feels out of touch. “Oh my god, you don’t know what reverse-pecan water is?? That’s so cute.” Pic: Wenn.com SHARE\n\nJennifer Aniston Is Not Sad, Miserable Or Heartbroken 5 Seen above looking like she’s taking one quirky shit, Jennifer Aniston is on the cover InStyle’s September issue, and inside she talks to her friend/Jimmy Kimmel Live! co-head writer/Jimmy Kimmel’s wife Molly McNearney to promote her movie Dumplin, where she plays a former beauty queen. Molly and Aniston met through Justin Theroux, and have stayed friends even after she split up with the living and breathing pair of black meggings. Aniston and Molly don’t talk about Justin, but they do talk about how the tabloids and bloggers (for why is everybody looking at me?) continue to paint her as a human pile of uncooked cookie dough who squirts out lonely tears from her crying holes as she clutches her Baby Alive doll while staring at the window and waiting for the stork to bring her a real-life baby of her own. Again, Jen is FINE. She’s not heartbroken and wishes bitches would keep their magnifying glasses out of her womb. Continue reading SHARE", "images": ["http://pixel.quantserve.com/pixel/p-ejSXfyZMwcbnr.gif", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/wenn32046586.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/wenn33864561.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/wenn35344415.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/themes/dlisted_44/img/dlistedbw.png", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/ElleCoverAniston-1.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/anistoninstyle2018.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/themes/dlisted_44/img/dlisted.png", "http://dlisted.com/favicon.ico?v=1", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/wenn32304693.jpg"], "top_img": "http://dlisted.com/favicon.ico?v=1", "keywords": [], "authors": ["J Harvey", "Michael K"], "canonical_link": "https://dlisted.com/tag/justin_theroux/", "title": "Be Very Afraid", "meta_data": {"google-site-verification": "wtgaXQuvduR_ynbFXYU1BBBEM-yaIh4zid2J5aq9r5Q", "og": {"locale": "en_US", "site_name": "Dlisted", "title": "Justin Theroux", "url": "https://dlisted.com/tag/justin_theroux/", "type": "article", "description": "Be Very Afraid"}, "fb": {"app_id": 662132140485214}, "description": "Dlisted | Be Very Afraid | Page 2", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://dlisted.com", "summary": ""}