{"url": "www.hollywoodreporter.com/features/steven-spielberg-meryl-streep-trump-news-why-post-had-be-made-i-know-is-scared-1064361", "text": "As Spielberg unleashes the story of Washington Post publisher Katharine Graham, the director and his female collaborators sit down with THR to discuss the current political climate, their own media diets (Streep reads the Times and Drudge) and the urgency of the Pentagon Papers story at a time when women and the press are under attack: \"This was the only year to make this film.\"\n\n\"We are on the way to something better,\" says Meryl Streep of the recent \"earthquake\" of harassment claims and female empowerment that has upended Hollywood, which many view as a direct response to the Trump administration. Certainly, the regime loomed large for Steven Spielberg when he first read The Post. \"I realized this was the only year to make this film,\" says the director, who tapped Streep to star as Washington Post publisher Katharine Graham despite the fact that he had only collaborated with her once before — for a single day of voice work on 2000's A.I. Artificial Intelligence. \"Most of the time we talked about how his property was haunted and did I know anybody who did exorcisms?\" recalls Streep. \"And of course, I did. I got him a priest.\"\n\nThe $50 million-plus Post tells the story of how Graham gave the green light to her editor Ben Bradlee (Tom Hanks) to report on the Pentagon Papers in 1971. (The New York Times had broken the story on the report, which revealed that America was losing the Vietnam War, but a court had ruled it couldn't publish more about the top-secret documents.) Graham now faced a terrible dilemma: Go ahead with the Post's article and risk imprisonment or withhold and silence the truth. Nearly half a century after she made her momentous choice, Graham's tale is at last told (she was infamously excluded from the 1976 Watergate drama All the President's Men).\n\nOn Nov. 28, THR gathered Spielberg, 70, and some of the key women who worked on the film (first-time screenwriter Liz Hannah, 31; producer and former Sony chief Amy Pascal, 59; Streep, 62; and the director's longtime producer Kristie Macosko Krieger, 47) in his offices on the Universal lot for a wide-ranging discussion about the Fox picture (which opens Dec. 22) and the issues it raises. \"This is why she was different,\" says Pascal of Graham. \"She owned [The Post]. The world changes when women own things, not when they work for men.\"\n\nThis film came together on very short notice. Why?\n\nSTEVEN SPIELBERG I read the script without any intention of telling the story myself or of committing to a production while in the middle of [another one,] Ready Player One, which was only half sane. But I was really curious about the subject matter. Ben Bradlee was my neighbor for years in East Hampton. He and his wife, Sally [Quinn], and Nora Ephron and [her husband] Nick Pileggi would come over and we would have these soirees. When I finished Liz's script, I thought this was an idea that felt more like 2017 than 1971 — I could not believe the similarities between today and what happened with the Nixon administration against their avowed enemies The New York Times and The Washington Post. I realized this was the only year to make this film.\n\nKRISTIE MACOSKO KRIEGER He said, \"If I can't make it this year, I'm not making it.\"\n\nSPIELBERG My first reaction [reading it] was I got scared — which is good for me because fear is my fuel. The more frightened I become of something, the more I have to work through it. This was a topic that was scaring everybody I know on my side of the [political] street — and quite rightly.\n\nWhat are they scared of?\n\nSPIELBERG That we've lost the majority of good listeners, that our conversations have turned into skirmishes. We live in an area where we don't know a lot of red-state voters. Well, I know a lot because I have friends and family in other parts of this country, and so at dinner-table conversations outside of California, I'm completely mute or I get into these huge rows. The gray and the blue have become the blue and the red. And it is as vast a chasm as our nation faced before the Civil War. I've never seen anything like it.\n\nMERYL STREEP We don’' know where north is. People disagree on what actual facts are. Whether this table is really a table.\n\nLIZ HANNAH We need to see each other. We need to look each other in the eye and know you're not a villain, you are not evil.\n\nDo you trust the media today?\n\nSTREEP Broadly? All of it? No.\n\nSPIELBERG I'm not going to go on record saying which media I trust; I'm just saying, obviously, there is media that you would imagine I would not trust. (Laughter.) Obviously, there is media you would take for granted I trust, and you would be right.\n\nSTREEP You trust but verify. We get betrayed.\n\nHave you been deceived by anything you've read?\n\nSTREEP Absolutely. I thought of one in my private life, which I don't wish to talk about. It involves people who are not at the table — but yes. In my political reading, I read The New York Times, The Washington Post and The Guardian. I check in on Politico, Axios and Drudge, and I go to Fox often to see the manipulation.\n\nAMY PASCAL Now everybody has their own news programs and things that they read and, except for Meryl, nobody reads the other sides. But everybody believes in the First Amendment.\n\nSTREEP Sort of. We all give lip service to it.\n\nPASCAL I think the other side thinks they believe in it, too.\n\nDoes the First Amendment allow Edward Snowden or Julian Assange to release those documents?\n\nSPIELBERG If it is not a crime.\n\nSTREEP It has to deal with motive, and I am unclear as to the motive and associations of Julian Assange. Snowden — I'm probably not qualified to say this because I haven't read so deeply into this — but if people were killed and compromised as a result of his action, he has to be held accountable. But he is owed his day in court.\n\nPASCAL Daniel Ellsberg [who leaked the Pentagon Papers] would say yes. We did not speak about Assange, but he would say yes about Snowden. He thought that what he did was brave.\n\nSPIELBERG He told me that, too. But you have to understand something Katharine Graham kept pressing everybody about: Will the publication of the papers lead to any American injuries or deaths in the Vietnam War?\n\nSTREEP Do you think she would have hesitated had somebody said [it would]?\n\nSPIELBERG I do.\n\nLiz, when you started to work on this, were you interested in the issues the film raised or specifically Katharine Graham?\n\nHANNAH I was always interested in those issues. I grew up in a very politically interested family. My parents were both artists, and then one of them became a social worker at some point. But they were very active in the 60s. I grew up in a household that loved Kennedy and Martin Luther King Jr. and Malcolm X, [but] I don't think they were partisan. It's a patriotic sort of household that I grew up in.\n\nSPIELBERG I was raised the same way.\n\nHANNAH [But] the issues she was going through at that time are relevant to any woman of any age in any decade.\n\nDuring your research, what most surprised you about Graham?\n\nHANNAH Her honesty. Her openness.\n\nSPIELBERG Her self-deprecation.\n\nSTREEP My image of her was as her full-blown Athena self. That's how I thought of her. And when I went into the book [Graham's memoir, Personal History] and read about the constant, nagging insecurity [and feeling] that \"I don't belong in this room, my opinion doesn't matter,\" that was fascinating. And, to the extent that it's encouraged by the landscape in which we grow up as women, her guile surprised me.\n\nDo you identify with her?\n\nSTREEP I couldn't fit in her shoes.\n\nBut the insecurity, the guile?\n\nSTREEP Oh, yes. She was my mother's age exactly, and I lived at the time when all these things were upended, and it was the beginning of this great shake-up [that led to] where we are right now. And we are on the way to something more, further, better. This is an earthquake.\n\nSPIELBERG Absolutely. There is only one way to go.\n\nDid you ever meet her?\n\nSTREEP I never met her. I met Ben Bradlee. I had dinner with him once, and Sally Quinn, with Nora Ephron and my mother and Jack Nicholson. And Sen. [Bill] Bradley, whom I sat next to. I said to him, \"Gosh, don't you miss basketball? Do you ever play anymore?\" He said, \"When you stop making movies, do you want to do community theater?\"\n\nWould you miss acting if you stopped?\n\nSTREEP I stop acting all the time, and I resolve that that's it. And then [in a monster voice] it drags me back. I always want to quit.\n\nSteven, what was Bradlee like?\n\nSPIELBERG I'm in the business of working with very charismatic actors, and Ben was right up there in the highest echelons. The only other person that reminded me of Ben — as a performer who was not in the entertainment industry — was the former head of Time Warner, Steven J. Ross.\n\nPASCAL He was the greatest.\n\nSPIELBERG One look from Steve Ross, and you told him [everything]. \"I'm putty in your hands.\" Bradlee kept that newsroom together. He took tremendous risks [but didn't speak about them]. He never talked to me about his experiences in World War II until he saw Saving Private Ryan. That was the first time he opened up to me about the ship he commanded as a 22-year-old captain in the South Pacific — just what it was like to have so many lives depending on [his] instant decisions. He had a tremendous love for all the young ensigns who worked for him. And he equated that with running a newsroom.\n\nDid you identify with that?\n\nSPIELBERG Very much. That's why we had a lot of common ground.\n\nDid you meet Graham?\n\nSPIELBERG I did. Same time, when Private Ryan came out. I was doing press in D.C., and David Geffen said, \"I want you to meet my friend Kay Graham.\" And he physically took me to The Washington Post, went up to Katharine's office and then left, and Katharine and I had a wonderful 90-minute lunch together, just the two of us. I wanted to ask her a gazillion questions, but she had ink in her veins, and all she did was ask me questions.\n\nWould you have had the courage to print the Pentagon Papers?\n\nSTREEP I don't know. I think you only confront your courage in the moment that it's asked of you.\n\nSPIELBERG I don't think as an actor you have to identify with the character you're playing. You just need to find relevant and metaphoric comparisons to the person you're playing. I always find it a bit of a fallacy that actors have to be who they play.\n\nSTREEP Yeah, thank God. If you're playing Lady Macbeth.\n\nDid anybody say anything particularly insightful about her?\n\nSTREEP Yes. But I can't [say]. I promised I wouldn't. Pretty much with every real person whom I have played, there has been something I've discovered that is so wild — by wild, I mean out of the expectation. Just like when I put chocolate in my chili or coffee, or whatever I happen to find in the kitchen. It's the extra weird thing. You know it, but nobody else does, and that helps.\n\nAmy, your father worked with Daniel Ellsberg.\n\nPASCAL He did. I won't tell you about the swinging parties that Ellsberg and his wife had, which my parents used to go to. They were quite wild in the '70s. But the amazing thing about Graham — maybe I'm speaking for myself — she stayed insecure forever. It's like real life, right? Nobody changes. You have your demons, you have them till you die. And yet you do brave things with all of your insecurity and your shame.\n\nIs there one particularly brave thing you've done in your own life?\n\nPASCAL No. (Laughter.)\n\nSPIELBERG Nothing?\n\nPASCAL I'll tell you one thing. I was talking to Meryl, and we were having coffee, and suddenly I said, \"Can you believe what [Graham] went through?\" And Meryl said, \"Really? Amy!\" I mean, it's what we all face, every day.\n\nSTREEP This is adorable, that this is a revelation to you.\n\nPASCAL That scene in the boardroom where she can't get the words out, and then somebody else says them, and then they're like, \"Right.\" How many times have I been in that fucking meeting? And they all worked for me!\n\nDo you still experience the same level of misogyny?\n\nMACOSKO KRIEGER No. But I've worked for Steven Spielberg for 20 years.\n\nSPIELBERG She works for me so she's misogyny-proof. (Laughter.)\n\nHANNAH That's going on the business card.\n\nPASCAL But Steven loves women, and he always has.\n\nSPIELBERG I had a strong mom. If a man at a dinner party walked right past her for a group of men, my mom would walk over and say: \"What you just did was very rude. I want you to apologize.\" And that was in 1957. I never considered my mom a primary caregiver. I considered my mom to be almost a sibling. But a strong one.\n\nIs that good or bad?\n\nSPIELBERG That's really good. I'm the only one that called my mom \"Mom.\" I have three younger sisters. They called her by her first name, Lee. How often does that happen in a household? I only called her \"Mom\" because I thought she had earned it.\n\nOf the women you've worked with, has any shifted your thinking?\n\nSPIELBERG Kathy Kennedy, when we first started working together. She started off as my secretary — you're putting it in the context of 1978.\n\nPASCAL I was a secretary.\n\nSPIELBERG Basically, I was a little bit of a hothead, impatient, and I would be hard on my crew — loving to my cast but tough on my crew. And about 15 days into shooting E.T., she pulled me into her office and sat me down in a chair and gave me the bollocking of my life. Because she did not like the way I was talking to the crew. She didn't care for my impatience, she didn't care for my sharpness. She said, \"This is unacceptable behavior,\" and I hadn't heard that since a teacher in school or my own mom — and that was a big shift in my life. I became mindful because somebody I trusted and respected had called me out.\n\nMACOSKO KRIEGER Kathy taught me how to work hard. She was always the first person on set, the last person to leave. There was no job beneath her, no job above her.\n\nAfter working for Steven for 20 years, is there anything you would have done differently?\n\nMACOSKO KRIEGER I would have probably had a family sooner.\n\nSPIELBERG (Gasps.) Oh wow.\n\nMACOSKO KRIEGER Sorry.\n\nSPIELBERG I would never stop you from having a family.\n\nMACOSKO KRIEGER But if you work for Steven Spielberg —\n\nPASCAL You don't want to miss anything.\n\nMACOSKO KRIEGER I started working for him when I was 27. I thought, \"I'm going to turn around and be 35 and I'm going to be single.\" And at 36 I got married; I had my son, and I was able to bring him to work. Steven allowed for that because Steven creates a family.\n\nSPIELBERG I even tried putting a daycare center in here. MCA thought there was too much liability involved. So they made us shut it down. It was a shame.\n\nLiz, did your worldview in any way change on this picture?\n\nPASCAL She had no worldview before! She's 30 years old!\n\nHANNAH Well, I was an infant, as she may have told you. Amy and Steven like to talk about how young I am all the time.\n\nSPIELBERG Don't worry, when I first started directing, I looked 13.\n\nHANNAH The learning experience ended up being how to be a human and have a job at the same time, working with people who have lives and families and things that are important to them outside of being on set.\n\nMeryl, who has most shifted your thinking?\n\nSTREEP My thinking shifts every five seconds. That's the point of being an actor: You shift your weight and try to see as much as you can. I don't have a fixed sense of myself. I know my loves, my beliefs. I have people that I wish the world still had in it.\n\nPASCAL Oh, God, me too.\n\nSTREEP Nora Ephron, Mike Nichols, Carrie Fisher, Sam Cohn. (Wistful:) John Cazale ...\n\nDid you spend any time at The Washington Post?\n\nSPIELBERG Meryl, Tom [Hanks], and Kristie and Amy and I, we sat down quietly in the Post during its 10 o'clock meeting. Things have really changed: Back in the old days of linotype and real inked paper, there was only one meeting, and then there would be a meeting for the late edition. But now, because everything goes online, there are meetings every couple of hours, because news is breaking every couple of minutes. And we got to sit in the very earliest meeting to see how they would put the first edition together.\n\nSTREEP They talked in code. So we wouldn't understand!\n\nSPIELBERG There were several things that we weren't meant to hear, so they didn't speak in a layman's language. And all we wanted to do was find out what they were really talking about. And Sally Quinn gave us some wonderful Ben-isms.\n\nLike what?\n\nSPIELBERG Ben's favorite word was \"retromingent.\" It means a creature that pisses backward. And Ben used to love giving the middle finger to everybody in the newsroom. And Sally said, when a story was really percolating, Ben would just turn to everybody and say, \"My God, the fun!\"\n\nSTREEP And he would also say, \"No gloating.\"\n\nIs there one person in the media today you particularly admire?\n\nSPIELBERG I like Don Lemon. I like Rachel Maddow.\n\nHANNAH The bravery Anderson Cooper has, to go into war zones, is pretty admirable.\n\nSPIELBERG Yeah and I adore and follow Christiane Amanpour.\n\nSTREEP And Maggie Haberman. I tend to trust the women.\n\nPASCAL Ain't that funny.\n\nAmy, what have you learned about the media from being married to a journalist, Bernard Weinraub?\n\nPASCAL Everything is personal.\n\nSTREEP Totally!\n\nPASCAL That is what I have learned. The way stories are written, the words that are chosen. It's completely subjective. Even the people that I admire. It is 100 percent subjective.\n\nSTREEP Your husband did a profile of me for The New York Times Magazine years ago, and he asked me why I moved to California, which I did for about five years, with the kids. I explained to him that I made this decision because I could be home at night for dinner with four kids. And he didn't really believe me! He thought that I had made a decision to lighten up and make comedies. He didn't believe that I made this decision based on having so many kids.\n\nPASCAL That wouldn't be his view. He couldn't believe that.\n\nSTREEP [But] he was wonderful, and it was a wonderful profile.\n\nAmy, you went through your own media firestorm at Sony, when North Korea hacked your emails. Did your view of the media change?\n\nPASCAL No, no, no. Not at all. I knew what the world was like. People have lives. People have jobs, they have children.\n\nIf Trump sees this movie, what would you like him to take from it?\n\nPASCAL I think he'll like the movie. I think he thinks he believes in the same things we do.\n\nMACOSKO KRIEGER The truth is always important.\n\nSPIELBERG The truth is ready to make a comeback.\n\nThis story appears in the Dec. 6 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/12/thr_splash_spielberg.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/12/thr_splash_spielberg.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/12/thr_splash_spielberg.jpg", "keywords": [], "authors": ["Stephen Galloway"], "canonical_link": "https://www.hollywoodreporter.com/features/steven-spielberg-meryl-streep-trump-news-why-post-had-be-made-i-know-is-scared-1064361", "title": "Steven Spielberg and Meryl Streep on Trump, News and Why 'The Post' Had to Be Made Now: \"Everyone I Know Is Scared\"", "meta_data": {"viewport": "width=device-width", "description": "As Spielberg unleashes the story of Washington Post publisher Katharine Graham, the director and his female collaborators sit down with THR to discuss the current political climate, their own media diets (Streep reads the Times and Drudge) and the urgency of the Pentagon Papers story at a time when women and the press are under attack: \"This was the only year to make this film.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/features/steven-spielberg-meryl-streep-trump-news-why-post-had-be-made-i-know-is-scared-1064361", "domain": "https://www.hollywoodreporter.com/", "title": "Steven Spielberg and Meryl Streep on Trump, News and Why 'The Post' Had to Be Made Now: \"Everyone I Know Is Scared\"", "description": "As Spielberg unleashes the story of Washington Post publisher Katharine Graham, the director and his female collaborators sit down with THR to discuss the current political climate, their own media diets (Streep reads the Times and Drudge) and the urgency of the Pentagon Papers story at a time when women and the press are under attack: \"This was the only year to make this film.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/12/thr_splash_spielberg.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Steven Spielberg and Meryl Streep on Trump, News and Why 'The Post' Had to Be Made Now: \"Everyone I Know Is Scared\"", "description": "As Spielberg unleashes the story of Washington Post publisher Katharine Graham, the director and his female collaborators sit down with THR to discuss the current political climate, their own media diets (Streep reads the Times and Drudge) and the urgency of the Pentagon Papers story at a time when women and the press are under attack: \"This was the only year to make this film.\"", "url": "https://www.hollywoodreporter.com/features/steven-spielberg-meryl-streep-trump-news-why-post-had-be-made-i-know-is-scared-1064361", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/12/thr_splash_spielberg.jpg", "width": 1500, "height": 844, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Steven Spielberg and Meryl Streep on Trump, News and Why 'The Post' Had to Be Made Now: \"Everyone I Know Is Scared\"", "sailthru.description": "As Spielberg unleashes the story of Washington Post publisher Katharine Graham, the director and his female collaborators sit down with THR to discuss the current political climate, their own media diets (Streep reads the Times and Drudge) and the urgency of the Pentagon Papers story at a time when women and the press are under attack: \"This was the only year to make this film.\"", "sailthru.author": "Stephen Galloway", "sailthru.vertical": "Movies", "sailthru.date": "2017-12-05 05:00:00", "sailthru.tags": "Movies,Meryl Streep,Steven Spielberg,The Post,THR Cover Story"}, "movies": [], "publish_date": 1512421200.0, "source": "http://www.hollywoodreporter.com", "summary": ""}