{"url": "https://variety.com/2017/tv/features/this-is-us-justin-hartley-season-2-interview-addiction-jacks-death-1202614001/", "text": "SPOILER ALERT: Do not read if you have not yet watched “Number One,” the eighth episode of the second season of “This Is Us.”\n\nOn “This Is Us,” Kevin Pearson (Justin Hartley) has been on a downward spiral for the past few episodes — struggling with his addiction to pills triggered by an old knee injury. In “Number One,” when he visited his high school for the retirement of his jersey number, he hit a new low. He slept with an old classmate-turned-doctor and stole a sheet off her prescription pad — and then lost his father’s necklace, his symbol of hope.\n\n“I wanted to make sure that we told a story that was honest and true, especially because this is something that people deal with a lot,” Hartley tells Variety. “It’s very dangerous. You can lose your wealth, you can lose your friends, you can lose your trust, you can lose your dignity, you can lose everything. We didn’t want to just tell a drug story real quick and then just wrap it up in a bow.”\n\nHere, Hartley talks with Variety about whether Kevin’s breakdown in “Number One” is his true rock bottom, whether he’ll be able to help Kate, and how his father’s death plays into all of his issues.\n\nKevin was clearly in pain, and a couple of times actually verbalized that, and yet no one could really see him through his celebrity. What were the conversations around why that happened?\n\nSome of the things we came to were just that people just assume that you’re OK. I’ve actually done it — I’ve been on the other end of it where something will happen and it’s catastrophic, and you’re sitting there like, “What the hell? How did this happen out of nowhere?” But then you go replay it, and you realize, “Oh my God, my friend was doing this and I wasn’t paying attention.” The next thing you know he’s in the hospital, and it wasn’t all of a sudden but for whatever reason, I was choosing to think he was OK. And I think part of Kevin’s thing that he goes through is that he had football when he was a kid, he was popular in high school, he’s an actor, he has money, he has friends — I put that in quotes — he had Sophie, everybody likes him. So people just assume he’s always OK. He’s always making jokes, he’s charming.\n\nDo you feel like this episode was Kevin’s rock bottom? Is he ready to get better now?\n\nI hope so. I think something’s got to give. This episode meant so much to me because I know what it means to carry the weight of a relationship on your shoulders and be like, “As long as that person is kicking and breathing and in my life, there’s a chance there will be closure, there’s a chance that something might happen.” And then when he loses that necklace, it was like all hope was lost. So hopefully that’s his rock bottom, because I think sometimes you need that to realize where the hell they are.\n\nAt the end, it seems like he finally wants to ask for help from Randall (Sterling K. Brown), but he’s met with another family tragedy in Kate’s (Chrissy Metz) miscarriage.\n\nAnd how interesting is that that Kevin and Randall have this very difficult relationship [but] he actually goes back to get help from Randall? How close Kate and Kevin are, it’s interesting that he goes to Randall. He doesn’t have his dad, and I think if his dad was there he’d obviously go to him, but he knows Randall will be there for him. But when he gets there, it’s like, “This is not about you, man. We can’t do this right now.” So he is self-aware enough to realize there’s a bigger story here — which is also kind of heartbreaking, as well, because he needs help right now, and he’s not really in a position to get it. It’s tough.\n\nDo you think Kevin has been aware of the parallels between his addiction and his father’s?\n\nThe injury happened, and I think there was a moment where he didn’t want to take the medication for fear that he would go down that path. I don’t think he just took it and thought, “Well, whatever.” I think he is aware of the gene in the family, that they’re all addicts, more than anyone else. He sees what Kate goes through and what his dad went through, and he’s aware that he has that in him. And so, when he finally chooses to take the medication, I think it was just because the pain was legitimately too much, and he didn’t want to fail at anything, and he was going to go to whatever lengths to succeed at this one thing and that it would be fine [because] he only needed it for a second. But of course that’s not how that stuff works. And I think once he was in that state of being high and drunk and depressed and alone, he just kept shoveling crap on top of himself. He was the one inflicting pain on himself, and he’s not capable of dealing with it. And once he was in that state of f–ked up, I don’t think much was going through his head about drawing the parallels, it was just, “How can I feel sorry for myself and inflict as much pain because I deserve it?” It was just a self-loathing, awful place.\n\nThat being said, he didn’t spiral down a completely dark rabbit hole of partying with teenagers.\n\nWell, he’s not a criminal! He’s got morals, he’s not a bad person.\n\nBut sometimes when you’re that messed up, you’re not thinking clearly and you do reprehensible things.\n\nYeah, and one of the things that happens with Kevin is that I think he’s aware of the fact that he doesn’t really want to bring anyone else down there with him. That’s a kid — she’s probably 18 in the show, but that’s a child, and he’s 37 years old. And also, he’s not in a position where he’s trying to have company. The whole Charlotte thing happened, in my mind, because he’s smart enough to realize that she’s a doctor and has access to something that he needs. I think that was a calculated move on his part.\n\nKevin didn’t fully break down and ask for help until he realized he lost his father’s necklace. So do you feel like he won’t be able to truly fix the other things in his life until he finally deals with his father’s death?\n\nI think so. It’s not only his father’s death, it’s how he died and the whole Miguel thing and the rift that he had with his mom. It’s all of that combined. I think it’s all together. I think the knee will heal on its own, and I think he can kick this drug habit that he has for a while, but at the root of it, eventually he’s going to have to go down that path and deal with his father’s death or otherwise it’s a slippery slope and like a record that just keeps repeating. He had to deal with the fact that that necklace and whatever it symbolized to him meant so much to him. It was the last physical object he had of his father, and he never got any closure of his relationship with his father. And you start to see what he was going through with his father when he died — and they weren’t in a good place. He carries that around with him, and I think that necklace that he wore was the promise of a better day.\n\nHow will the show shed more light on how Jack died in the next few episodes?\n\nWe’ve seen it with Kate, we’ve seen her kind of admit that she feels responsible for her father’s death, and I think what you see as the show goes on is they all have that guilt that they carry. You can blame yourself for anything — you can blame yourself for things that might not be your fault. And I think everybody involved carries a lot of guilt, especially for Kevin because as you see in [this] episode, in that moment in time, he was not nice to [Jack]; he was a little prick. But at the same time, I see both sides of the story. He was embarrassed. His father told him certain things, and he sees his father in a certain way and thinks, “This guy doesn’t make mistakes, and I’m going to be just like him,” and that’s not at all what it was. He’s got some anger and resentment toward his father, and he’s at that age where all of your anger and resentment comes to the surface anyway. It’s kind of a perfect storm.\n\nWere you operating under the assumption that the necklace came from Jack’s brother and that Kevin even knows his father has a brother?\n\nIt’s difficult because this show is constantly changing. When you think you know something, something else will happen, and you’re like “OK,” and that’s the nature of the show. I choose to operate under the assumption that yeah, I do know, but I also know he doesn’t talk about it. But I could be totally wrong, by the way. I could find out that Kevin doesn’t know. What we do know, what he says, is that he was given it at a time when he was lost and had no direction and felt like he had no purpose. So, that story will be told.\n\n“This Is Us” airs Tuesdays at 9 p.m. on NBC.", "images": ["https://pmcvariety.files.wordpress.com/2017/11/this-is-us1.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Ffeatures%2Fthis-is-us-justin-hartley-season-2-interview-addiction-jacks-death-1202614001%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202614001&comment_count=2", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/11/this-is-us1.jpg?w=1000", "keywords": [], "authors": ["Danielle Turchiano"], "canonical_link": "https://variety.com/2017/tv/features/this-is-us-justin-hartley-season-2-interview-addiction-jacks-death-1202614001/", "title": "‘This Is Us’: Justin Hartley on Kevin’s Addiction, Jack’s Death and the Necklace (SPOILERS)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"This Is Us\" star Justin Hartley talks about Kevin's rock bottom, guilt over his father's death, and diving into an addiction storyline.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202614001, "author": "Danielle Turchiano", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-11-14T19:00:02"}, "pmc-tag": "Justin Hartley,This Is Us", "title": "‘This Is Us’: Justin Hartley on Kevin’s Addiction, Jack’s Death and the Necklace (SPOILERS)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘This Is Us’: Justin Hartley on Kevin’s Addiction, Jack’s Death and the Necklace (SPOILERS)", "url": "https://variety.com/2017/tv/features/this-is-us-justin-hartley-season-2-interview-addiction-jacks-death-1202614001/", "description": "SPOILER ALERT: Do not read if you have not yet watched “Number One,” the eighth episode of the second season of “This Is Us.” On “This Is Us,” Kevin Pearson (Jus…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/this-is-us1.jpg?w=1000", "width": 1000, "height": 563, "alt": "This Is Us Season 2"}, "locale": "en_US"}, "article": {"published_time": "2017-11-15T03:00:02+00:00", "modified_time": "2017-11-15T03:00:03+00:00"}, "twitter": {"creator": "@https://twitter.com/danielletbd", "site": "@variety", "text": {"title": "‘This Is Us’: Justin Hartley on Kevin’s Addiction, Jack’s Death and the Necklace (SPOILERS)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/this-is-us1.jpg?w=1000", "alt": "This Is Us Season 2"}, "card": "summary_large_image", "title": "‘This Is Us’: Justin Hartley on Kevin’s Addiction, Jack’s Death and the Necklace (SPOILERS)", "description": "\"This Is Us\" star Justin Hartley talks about Kevin's rock bottom, guilt over his father's death, and diving into an addiction storyline."}, "author": "Danielle Turchiano", "content_type": "Article", "post_id": 1202614001, "title": "'This Is Us': Justin Hartley on Kevin's Addiction, Jack's Death and the Necklace (SPOILERS)", "published_at": "2017-11-14 19:00:02", "image": "https://pmcvariety.files.wordpress.com/2017/11/this-is-us1.jpg?w=1000", "comment_count": 2, "tags": "This Is Us", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read if you have not yet watched \"Number One,\" the eighth episode of the second season of \"This Is Us.\"\r\n\r\nOn \"This Is Us,\" Kevin Pearson (Justin Hartley) has been on a downward spiral for the past few episodes — struggling with his addiction to pills triggered by an old knee injury. In \"Number One,\" when he visited his high school for the retirement of his jersey number, he hit a new low. He slept with an old classmate-turned-doctor and stole a sheet off her prescription pad — and then lost his father's necklace, his symbol of hope.\r\n\r\n\"I wanted to make sure that we told a story that was honest and true, especially because this is something that people deal with a lot,\" Hartley tells Variety. \"It's very dangerous. You can lose your wealth, you can lose your friends, you can lose your trust, you can lose your dignity, you can lose everything. We didn't want to just tell a drug story real quick and then just wrap it up in a bow.\"\r\n\r\nHere, Hartley talks with Variety about whether Kevin's breakdown in \"Number One\" is his true rock bottom, whether he'll be able to help Kate, and how his father's death plays into all of his issues.\r\n\r\n\r\n\r\nKevin was clearly in pain, and a couple of times actually verbalized that, and yet no one could really see him through his celebrity. What were the conversations around why that happened?\r\n\r\nSome of the things we came to were just that people just assume that you're OK. I've actually done it — I've been on the other end of it where something will happen and it's catastrophic, and you're sitting there like, \"What the hell? How did this happen out of nowhere?\" But then you go replay it, and you realize, \"Oh my God, my friend was doing this and I wasn't paying attention.\" The next thing you know he's in the hospital, and it wasn't all of a sudden but for whatever reason, I was choosing to think he was OK. And I think part of Kevin's thing that he goes through is that he had football when he was a kid, he was popular in high school, he's an actor, he has money, he has friends — I put that in quotes — he had Sophie, everybody likes him. So people just assume he's always OK. He's always making jokes, he's charming.\r\n\r\nDo you feel like this episode was Kevin's rock bottom? Is he ready to get better now?\r\n\r\nI hope so. I think something's got to give. This episode meant so much to me because I know what it means to carry the weight of a relationship on your shoulders and be like, \"As long as that person is kicking and breathing and in my life, there's a chance there will be closure, there's a chance that something might happen.\" And then when he loses that necklace, it was like all hope was lost. So hopefully that's his rock bottom, because I think sometimes you need that to realize where the hell they are.\r\n\r\nAt the end, it seems like he finally wants to ask for help from Randall (Sterling K. Brown), but he's met with another family tragedy in Kate's (Chrissy Metz) miscarriage. \r\n\r\nAnd how interesting is that that Kevin and Randall have this very difficult relationship [but] he actually goes back to get help from Randall? How close Kate and Kevin are, it's interesting that he goes to Randall. He doesn't have his dad, and I think if his dad was there he'd obviously go to him, but he knows Randall will be there for him. But when he gets there, it's like, \"This is not about you, man. We can't do this right now.\" So he is self-aware enough to realize there's a bigger story here — which is also kind of heartbreaking, as well, because he needs help right now, and he's not really in a position to get it. It's tough.\r\n\r\nDo you think Kevin has been aware of the parallels between his addiction and his father's?\r\n\r\nThe injury happened, and I think there was a moment where he didn't want to take the medication for fear that he would go down that path. I don't think he just took it and thought, \"Well, whatever.\" I think he is aware of the gene in the family, that they're all addicts, more than anyone else. He sees what Kate goes through and what his dad went through, and he's aware that he has that in him. And so, when he finally chooses to take the medication, I think it was just because the pain was legitimately too much, and he didn't want to fail at anything, and he was going to go to whatever lengths to succeed at this one thing and that it would be fine [because] he only needed it for a second. But of course that's not how that stuff works. And I think once he was in that state of being high and drunk and depressed and alone, he just kept shoveling crap on top of himself. He was the one inflicting pain on himself, and he's not capable of dealing with it. And once he was in that state of f--ked up, I don't think much was going through his head about drawing the parallels, it was just, \"How can I feel sorry for myself and inflict as much pain because I deserve it?\" It was just a self-loathing, awful place.\r\n\r\nThat being said, he didn't spiral down a completely dark rabbit hole of partying with teenagers. \r\n\r\nWell, he's not a criminal! He's got morals, he's not a bad person.\r\n\r\nBut sometimes when you're that messed up, you're not thinking clearly and you do reprehensible things.\r\n\r\nYeah, and one of the things that happens with Kevin is that I think he's aware of the fact that he doesn't really want to bring anyone else down there with him. That's a kid — she's probably 18 in the show, but that's a child, and he's 37 years old. And also, he's not in a position where he's trying to have company. The whole Charlotte thing happened, in my mind, because he's smart enough to realize that she's a doctor and has access to something that he needs. I think that was a calculated move on his part.\r\n\r\nKevin didn't fully break down and ask for help until he realized he lost his father's necklace. So do you feel like he won't be able to truly fix the other things in his life until he finally deals with his father's death?\r\n\r\nI think so. It's not only his father's death, it's how he died and the whole Miguel thing and the rift that he had with his mom. It's all of that combined. I think it's all together. I think the knee will heal on its own, and I think he can kick this drug habit that he has for a while, but at the root of it, eventually he's going to have to go down that path and deal with his father's death  or otherwise it's a slippery slope and like a record that just keeps repeating. He had to deal with the fact that that necklace and whatever it symbolized to him meant so much to him. It was the last physical object he had of his father, and he never got any closure of his relationship with his father. And you start to see what he was going through with his father when he died — and they weren't in a good place. He carries that around with him, and I think that necklace that he wore was the promise of a better day.\r\n\r\nHow will the show shed more light on how Jack died in the next few episodes?\r\n\r\nWe've seen it with Kate, we've seen her kind of admit that she feels responsible for her father's death, and I think what you see as the show goes on is they all have that guilt that they carry. You can blame yourself for anything — you can blame yourself for things that might not be your fault. And I think everybody involved carries a lot of guilt, especially for Kevin because as you see in [this] episode, in that moment in time, he was not nice to [Jack]; he was a little prick. But at the same time, I see both sides of the story. He was embarrassed. His father told him certain things, and he sees his father in a certain way and thinks, \"This guy doesn't make mistakes, and I'm going to be just like him,\" and that's not at all what it was. He's got some anger and resentment toward his father, and he's at that age where all of your anger and resentment comes to the surface anyway. It's kind of a perfect storm.\r\n\r\nWere you operating under the assumption that the necklace came from Jack's brother and that Kevin even knows his father has a brother?\r\n\r\nIt's difficult because this show is constantly changing. When you think you know something, something else will happen, and you're like \"OK,\" and that's the nature of the show. I choose to operate under the assumption that yeah, I do know, but I also know he doesn't talk about it. But I could be totally wrong, by the way. I could find out that Kevin doesn't know. What we do know, what he says, is that he was given it at a time when he was lost and had no direction and felt like he had no purpose. So, that story will be told.\r\n\r\n\"This Is Us\" airs Tuesdays at 9 p.m. on NBC.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1510714802.0, "source": "https://variety.com", "summary": ""}