{"url": "https://www.theguardian.com/music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker", "text": "In the final scenes of Chris Brown: Welcome to My Life, a 2017 documentary about the R&B singer, Brown exits a Los Angeles courthouse. It is March of 2015 and a judge has just ended Brown’s six-year probation. The artist – his hot pink hair serving as a pop star counterbalance to his tailored suit – is thrilled.\n\n“No more problems. No issues. Nothing. We’re great,” Brown says to the camera while a van carries him away from the courthouse. “I don’t even know what to say right now. Probably just going to go to the house and play with my daughter and figure it out from there.”\n\nComing at the end of the documentary, this scene is a framed as a redemptive, course-correcting moment for Brown, whose legal troubles began in 2009 when he pleaded guilty to felony assault charges after beating his then girlfriend Rihanna.\n\nThe problem with R Kelly: how the star is finally facing the music Read more\n\nBut despite the movie’s feelgood finale, there would be more legal trouble for Brown down the road. A lot of it. The latest allegation was announced last week in a lawsuit alleging an incident at Brown’s house in which a woman was lured to his residence during a drug-fueled party and barricaded in a room with Brown, Lowell Grissom Jr – an LA rapper who goes by Young Lo – and several other women. Pornography was put on the television and the plaintiff was allegedly forced to perform oral sex on Grissom and another woman. When she was allowed to leave the room, she was allegedly raped by Grissom, who then returned her phone and let her leave the house. (The LAPD confirmed to the New York Times that there is an open investigation regarding the incident.) Identified as Jane Doe, the plaintiff is being represented by famed women’s rights attorney Gloria Allred, who also represents several of Bill Cosby’s accusers.\n\n“This is one of the most horrific sexual assault cases that I have ever seen, and our client Jane Doe has been severely traumatized by what she was forced to suffer,” Allred said in a press conference in Los Angeles on 9 May. Mark Geragos, Brown’s lawyer since 2009, denied the allegations to TMZ. Brown himself is not accused of sexual assault.\n\nThe alleged incident happened in February 2017, two years after Brown’s redemptive drive away from the LA courthouse and four months before the release of Welcome to My Life. The star-studded documentary features interviews with Usher, Mary J Blige, Jamie Foxx, Mike Tyson, Jennifer Lopez, DJ Khaled, Rita Ora, Brown’s mother, other family members and Brown himself. This cast examines the consequences of Brown becoming an overnight phenomenon at age 15, his singular talents and how his career trajectory – along with his mental, physical and emotional health – were affected by the infamous Rihanna incident, which haunted him even as his career rebounded.\n\nThe film’s implication is that Brown, who witnessed the domestic abuse of his mother by his stepfather as a child, was not equipped to handle the intense public backlash and media scrutiny and thus entered a spiral of violent outbursts and drug use that was difficult for him to break free from, despite his sincere regrets.\n\n“It’s a life lesson for all of us because it’s affected all of us,” Usher says in the film. “If you truly do love Chris Brown, then you’ve felt everything that’s gone on with him.”\n\nThe movie is a compelling, highly intimate piece of PR that serves its purpose in the sense that it – if perhaps by leaving out certain elements – presents Brown as a sympathetic figure who is profoundly sorry for his actions. That might be true, but the past nine years have also demonstrated Brown has both demons he can’t seem to shake and talents that carry him forward despite his almost constant legal issues.\n\nFacebook Twitter Pinterest Chris Brown and Rihanna in 2013. Photograph: Christopher Polk/Getty Images for NARAS\n\nBorn in Virginia in 1989, Brown was discovered when talent scouts came to a gas station owned by his father. Within months, Brown was recording demos in New York and signed to Jive shortly thereafter. His eponymous 2005 debut album entered the Billboard 200 at number two and delivered the hits Run It! and Gimme That. In 2007, Brown toured as an opener for Beyoncé, appeared in an episode of MTV’s My Super Sweet 16 (retitled Chris Brown: My Super 18) and delivered his second album, Exclusive. The LP included the smashes Kiss Kiss and Wall to Wall, both undeniably effective tracks demonstrating his agility in fusing R&B with the era’s auto-tuned strain of pop-leaning hip-hop. Brown’s breakout moment came at the 2007 MTV Video Music Awards when he performed a medley of his hits in tandem with choreography that earned him comparisons to his idol, Michael Jackson. (It helped that he did a brief interlude to Billie Jean.) The performance featured a cameo from Rihanna, who strutted onstage for a verse of her own megahit Umbrella. While the pair had been quiet about their relationship, the chemistry was palpable.\n\nThis love story crumbled a year and a half later, after a brutal argument inside Brown’s rented Lamborghini on the night before the 2009 Grammy Awards. (The fight began after Rihanna discovered a text from a woman Brown had been in a sexual relationship with.) A police report of the incident stated Brown hit Rihanna’s head against the car window, punched and choked her, bit her ear and threatened to kill her. Both were scheduled to perform the next day at the Grammys. Both cancelled. The photo of Rihanna’s battered face was unavoidable in the news.\n\nBrown’s formerly pristine public image imploded overnight. He says that after the incident he considered suicide and didn’t leave his house for three months. “Words cannot begin to express how sorry and saddened I am over what transpired,” he said at a March 2009 hearing. He pled guilty to a felony assault charge three months later, with his plea deal including five years probation and 1,400 hours of community service and a domestic abuse program. A report obtained by CNN during sentencing revealed two previous incidents of domestic violence between Brown and Rihanna, one in Europe and one during a trip to her native Barbados.\n\n“I felt like he made that mistake because he needed help,” Rihanna, who showed up to several of Brown’s hearings, said during this period.\n\nInitially, Brown seemed to be on a swift path out of the legal system. At his first probation hearing, the judge commended him for the community service and counseling he had completed and allowed him to leave the country for concerts. His next three hearings were also positive, and the judge eventually removed the order preventing Brown from having contact with Rihanna. They started seeing each other off and on again during this time.\n\nBut angry outbursts began defining Brown’s image. During a March 2011 appearance on Good Morning America, he became so enraged by host Robin Roberts questioning him about Rihanna that he went to his dressing room, punched a window until it cracked, then walked into the street shirtless. He was on the show to promote his album FAME – which Brown said stood for both “forgiving all my enemies” and “fans are my everything” – which won the 2012 Grammy for best R&B album.\n\nFour months later, Brown and his entourage got into a fight with Drake and his entourage at a New York club, reportedly after Brown sent Drake a bottle of champagne and Drake (who had been seeing Rihanna), sent a note back that read, “I’m fucking the love of your life.” In January 2013, Brown was accused of punching and threatening to shoot singer Frank Ocean at a Los Angeles recording studio. The following month he totaled his Porsche after being chased by paparazzi. Brown was then accused of punching a woman at a nightclub. (No charges were filed after any of these incidents.)\n\nThe drama continued in October of 2013 when Brown and his bodyguard were accused of assaulting a man in Washington DC after the man stepped into a photo Brown was taking with a fan. Brown spent the night in jail after allegedly punching the man in the face and entered rehab shortly thereafter, although he was asked to leave after reportedly smashing the window of his mom’s car after a therapy session.\n\nHe went to another rehab facility, where the staff reported improved behavior after a switch in his medication. (This same year Brown was diagnosed with bipolar II, a disorder characterized by depressive and hypomanic episodes.) In March 2014, he went to jail on a probation violation after being kicked out of rehab (Brown says it was a set up) and was ordered to serve 131 days in county jail. Here, Brown spent a lot of time in solitary confinement to avoid being singled out by other prisoners. He got an early release on 2 June 2014, kissed the ground outside the jail and went directly to Burger King.\n\nBut the problems didn’t stop, with the next two years characterized by a series of violent altercations in which Brown allegedly punched several people. He was not allowed to travel to Canada, Australia and New Zealand, and was arrested in August 2016 after a nine-hour standoff with police at his home in LA after a woman called 911 at 3am claiming Brown had threatened her with a gun. The outcome of that case remains unknown.\n\nFacebook Twitter Pinterest Chris Brown performing in 2016. Photograph: Bryan Steffy/Getty Images\n\nIn June 2017, the same month as his documentary was released, a judge granted a restraining order against Brown to Karrueche Tran, his on-and-off girlfriend of the past seven years. The model alleged that Brown texted her threats including “Bitch I will beat the shit out of you” and “I promise you I will make your life hell”. (Tran had broken up with Brown in March of 2015 after finding out he had fathered a daughter, Royalty, while they were briefly separated.) It was during this period that Billboard published an investigative piece alleging Brown had developed serious addictions to cocaine, MDMA, marijuana, Xanax and lean. (Brown disputed the story in a now deleted Instagram post.) The party at Brown’s house at which Jane Doe was allegedly assaulted was in February 2017, during the period Billboard indicated was characterized by Brown’s heavy drug use.\n\nThrough all of these incidents, Brown has made music, much of it very well received. After FAME came 2012’s Fortune. This was followed by 2014’s X, which went platinum and featured guests including Usher, Tyga, Lil Wayne, Rick Ross, Akon, Jhene Aiko, Nicki Minaj and R Kelly. 2015’s Royalty was named after his newborn, while 2017’s Heartbreak on a Full Moon made headlines for containing 45 tracks and clocking in at over two hours. Reviews characterized the album as indulgent but said it had diamonds in the rough. Brown is currently touring behind Heartbreak on a Full Moon, playing dates extending into August.\n\nAt the end of Welcome to My Life, Usher wishes Brown “a journey back to a conversation about music and a conversation about artistry”. While Brown’s musical output remains generally well-received, the primary conversation about the 28-year-old artist is a violent, self-fulfilling prophesy.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Chris+Brown%2CMusic%2CCulture%2CR%26B%2CDomestic+violence", "https://i.guim.co.uk/img/media/8aac28c34fdce2b8c020d0d960e90158d4df1153/0_113_2674_1604/master/2674.jpg?width=300&quality=85&auto=format&fit=max&s=a72ce0aca5154eefa2389e5414a63ef7", "https://i.guim.co.uk/img/media/8aac28c34fdce2b8c020d0d960e90158d4df1153/0_113_2674_1604/master/2674.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d4e95a5e1192a49f980c3213e5eb570", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://i.guim.co.uk/img/media/bab34eb47952ffd568f0de3b866532d8f48ba12f/0_179_7740_4646/master/7740.jpg?width=300&quality=85&auto=format&fit=max&s=6072ebdd65156008b412972f156bf4ab", "https://i.guim.co.uk/img/media/b68db3ec3668d56e75e3a9afa864f90b5d616a67/0_78_2970_1781/master/2970.jpg?width=300&quality=85&auto=format&fit=max&s=9f1dafbcdf109aff55e16f1c0a6eb8ca"], "top_img": "https://i.guim.co.uk/img/media/8aac28c34fdce2b8c020d0d960e90158d4df1153/0_113_2674_1604/master/2674.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d4e95a5e1192a49f980c3213e5eb570", "keywords": [], "authors": ["Katie Bain"], "canonical_link": "https://www.theguardian.com/music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker", "title": "Chris Brown: the downfall of the disgraced R&B hit-maker", "meta_data": {"description": "A new set of legal issues for the singer join almost a decade’s worth of allegations that might finally derail his career", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Katie Bain", "thumbnail": "https://i.guim.co.uk/img/media/8aac28c34fdce2b8c020d0d960e90158d4df1153/0_113_2674_1604/master/2674.jpg?width=620&quality=85&auto=format&fit=max&s=e548b090c1754666a7e95da597cbc1e8", "keywords": "Chris Brown,Music,Culture,R&B,Domestic violence", "news_keywords": "Chris Brown,Music,Culture,R&B,Domestic violence", "og": {"url": "http://www.theguardian.com/music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker", "image": "https://i.guim.co.uk/img/media/8aac28c34fdce2b8c020d0d960e90158d4df1153/0_113_2674_1604/master/2674.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d4e95a5e1192a49f980c3213e5eb570", "description": "A new set of legal issues for the singer join almost a decade’s worth of allegations that might finally derail his career", "type": "article", "title": "Chris Brown: the downfall of the disgraced R&B hit-maker", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/katie-bain", "publisher": "https://www.facebook.com/theguardian", "section": "Music", "published_time": "2018-05-14T16:09:38.000Z", "tag": "Chris Brown,Music,Culture,R&B,Domestic violence", "modified_time": "2018-05-14T19:01:11.000Z"}, "al": {"ios": {"url": "gnmguardian://music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker", "iphone": "gnmguardian://music/2018/may/14/chris-brown-the-downfall-of-the-disgraced-rb-hit-maker?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/8aac28c34fdce2b8c020d0d960e90158d4df1153/0_113_2674_1604/master/2674.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=6f704aa134f0004ce9fe3e0d029bb7db", "site": "@guardian", "card": "summary_large_image", "creator": "@bainofyrexstnce", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/BlCmrRdMsKk?wmode=opaque"], "publish_date": 1526227200.0, "source": "https://www.theguardian.com", "summary": ""}