{"url": "https://www.thedailybeast.com/oscar-isaac-on-the-pain-of-losing-carrie-fisher-and-anti-latino-hysteria-in-the-age-of-trump", "text": "Oscar Isaac in the role of painter Paul Gauguin is trouble you see coming from a mile away—the kind you live to regret falling for anyway.\n\nHe’s a holier-than-thou painting bro with a “slightly misanthropic” streak (Isaac’s generous wording), eyes glinting with disgust in his first close-up. Pipe in one hand, book in another, dressed all black save for an elegant red scarf, he slams a table and shames the Impressionists gathered around him: “They call themselves artists but behave like bureaucrats,” he huffs after a theatrical exit. “Each of them is a little tyrant.”\n\nFrom a few tables away, another painter, Vincent van Gogh, watches in awe. He runs into the street after Gauguin like a puppy dog.\n\nWithin a year, a reluctant Gauguin would move in with van Gogh in a small town in the south of France, in the hope of fostering an artists’ retreat away from stifling Paris. Eight emotionally turbulent weeks later, van Gogh would lop off his left ear with a razor, distraught that his dearest friend planned to leave him for good. He enclosed the bloody cartilage in wrapping marked “remember me,” intending to have it delivered to Gauguin by a frightened brothel madam as a bizarre mea culpa. The two never spoke again.\n\nOr so the last two years of Vincent van Gogh’s life unspool in Julian Schnabel’s At Eternity’s Gate, itself a kind of lush, post-Impressionistic memoir of the Dutchman’s tormented time in Arles, France. (Not to mention artistically fruitful time: Van Gogh churned out 200 paintings and 100 watercolors and sketches before the ear fiasco landed him in an insane asylum.)\n\nIsaac plays Gauguin like an irresistibly bad boyfriend, a bemused air of condescension at times wafting straight into the audience: “Why’re you being so dramatic?” he scoffs directly into the camera, inflicting a first-person sensation of van Gogh’s insult and pain.\n\nYet in the painter’s artistic restlessness, Isaac, 39, sees himself: “That desire to want to do something new, to want to push the boundaries, to not just settle for the same old thing and get so caught up with the minutia of what everyone thinks is fashionable in the moment.” He talks about “staying true to your own idea of what’s great.” He talks about “finding something honest.”\n\nFrom another actor, the sentiment might border on banal. But Oscar Isaac—Guatemalan-born, Juilliard-trained and, in his four years since breaking through as film’s most promising new leading man, christened superlatives from “this generation’s Al Pacino” to the “best dang actor of his generation”—might really have reason to mean what he says. He’s crawling out the other end of a life-altering two years, one that’s encompassed personal highs, like getting married and becoming a father, and an acutely painful low: losing a parent.\n\nHe basked in another Star Wars premiere, mined Hamlet for every dimension of human experience, and weathered the worst notices of his career with Life Itself. Through it all, he says, he’s spent a lot of time in his head—reevaluating who he is, what he wants, and what matters most.\n\nRight now, he’s aiming for a year-long break from work, his first in a decade, after wrapping next December’s Star Wars: Episode IX. “I’m excited to, like Gauguin, kind of step away from the whole thing for a bit and focus on things that are a bit more real and that matter to me,” he says.\n\nUntil then, he’s just trying “to keep moving forward as positively as I can,” easing into an altered reality. “You’re just never the same,” he says quietly. “On a cellular level, you’re a completely different person.”\n\nWhen we talk, Isaac is in New York for one day to promote and attend the New York Film Festival premiere of At Eternity’s Gate. Then it’s back on a plane to London, where Pinewood Studios and Star Wars await.\n\nEpisode IX, the last of Disney’s new Skywalker trilogy, will see Isaac reprise the role of dashing Resistance pilot Poe Dameron, whose close relationship with Carrie Fisher’s General Leia evokes joy but also melancholy after Fisher’s untimely passing.\n\nEach film was planned in part as a celebration and send-off to each of the original trilogy’s most beloved heroes: in The Force Awakens, Han Solo (Harrison Ford); in The Last Jedi, Luke Skywalker (Mark Hamill); Fisher, meanwhile, had hoped to save Leia’s spotlight for last but passed unexpectedly long before filming began. Director J.J. Abrams, returning to close the trilogy he opened with Episode VII, has since said that unseen footage of Fisher from that previous film will ensure the General appears, however briefly.\n\nFor his part, Isaac promises the still-untitled ninth film will pay appropriate homage to Leia—and to Fisher’s sense of fun. “The story deals with that quite a bit,” he says. “It’s a strange thing to be on the set and to be speaking of Leia and having Carrie not be around. There’s definitely some pain in that.” Still, he says, compared to the first two installments, “there’s a looseness and an energy to the way that we’re shooting this that feels very different.”\n\n“It’s been really fun being back with J.J., with all of us working in a really close way. I just feel like there’s an element of almost senioritis, you know?” he laughs. “Since everything just feels way looser and people aren’t taking it quite as seriously, but still just having a lot of fun. I think that that energy is gonna translate to a really great movie.”\n\nFisher’s absence is felt keenly on set, Isaac says. As if to reassure us both, however, he reiterates: “It deals with the amazing character that Carrie created in a really beautiful way.”\n\nTwo months after Fisher’s death, Isaac’s mother, Eugenia, passed away after an illness. A month after that, the actor married his girlfriend, the Danish documentarian Elvira Lind. Another month later, the couple welcomed their first son, named Eugene to honor the little boy’s grandmother. Work offered a way for a reeling Isaac to process.\n\nThere was his earth-shaking run at Hamlet, in which Isaac starred as the titular prince in mourning at New York’s Public Theater. And then there was writer-director Dan Fogelman’s Life Itself, a film met with reviews that near-unanimously recoiled from its “cheesy,” “overwrought” structure, filled with what one critic called the genuine emotion of “a damage-control ExxonMobil commercial.”\n\nThe reaction surprised Isaac. “I thought it was some of my strongest work,” he says. “Especially at that moment in my life. This guy is dealing with grief and, for me, it was a really honest way of trying to understand those emotions and to create a character who was also going through just incomprehensible grief.” He’s proud of the performance—and, in a strange way, heartened by the sour critical response.\n\n“To be honest,” he says brightly, “there was something really comforting about it.” That the work “for me, meant something and for others, didn’t at all, it just made the whole thing not matter so much in a great way.”\n\n“I was able to explore something and come out the other end and feel like I grew as an actor,” he explains. “That matters to me a lot. And the response to that, you know, it’s interesting of course, but it was a great example for me of how it really doesn’t dictate how I then feel about what I did.”\n\nHe thinks for a moment of performances and projects that, conversely, embarrassed him—ones that to his shock, boasted “really great notices” in the end. “You just never know, you know? It’s completely out of my control.”\n\nIsaac is an encouraging listener in conversation, doling out interested yeahs and uh-huhs, and often warm, self-deprecating laughter. When I broach a particularly personal subject, he seems to sit up—somehow, suddenly more present. It’s about his last name.\n\nÓscar Isaac Hernández Estrada dropped both surnames before enrolling at Juilliard in 2001. He’d run into several Óscar Hernándezes at auditions by that point, and taken note of the stereotypes casting directors seemed to have in mind for them—gangsters, drug dealers, and the like. So he made a change, not unlike many actors do.\n\n“ I think for a lot of immigrants, the idea is that you don’t always just want to be thought of as other. ”\n\nWhether Óscar Hernández might have had a crack at the astonishingly diverse roles Oscar Isaac has inhabited, we’ll never know. But given Hollywood’s limiting tendencies, it is less likely he’d have played an English king for Ridley Scott in 2010’s Robin Hood, four years before his breakthrough role as a cantankerous folk singer in Joel and Ethan Coen’s Inside Llewyn Davis. He was an Armenian genocide survivor in last year’s The Promise, an Israeli secret agent in August’s Operation Finale, and now, he’s the Frenchman Paul Gauguin.\n\nStar Wars’ Poe Dameron, meanwhile, or the mysterious tech billionaire in Alex Garland’s Ex Machina, or the army commando in his second Garland mind-twist, Annihilation, specify no ethnicities at all. It’s the dream: to be hailed as a great actor, period. Not a “great Latino actor” first. To be seen for your talent, and as “other” rarely at all.\n\nThere’s a crawl space between those distinctions, though, where another anxiety lives. The one that makes you wonder: Am I “representing” as loudly as I should? Am I obliged to at all? If I don’t, what does that make me? Isaac listens attentively. Then for several unbroken minutes, talks it out with himself.\n\nHe rewinds to yesterday, when he boarded a plane from London on which an air steward addressed him repeatedly as “señor,” unbidden. “It was just a little weird. So I started calling him ‘señor’ as well. I was like, thank you, señor!” Isaac recalls, cracking up. “But then at the same time, I had that thought. I was like, but no, I should really, you know, be proud of being a señor, I guess?”\n\n“I think for a lot of immigrants, the idea is that you don’t always just want to be thought of as other. Like, I don’t want him to be just calling me ‘señor.’ Why?” he asks, more of the steward than himself. “Because I look like I do, so I’m not a mystery anymore? It did bring up all those kinds of questions.”\n\nHe grew up in the United States, he explains; his family came over from Guatemala City when Isaac was 5 months old. “I’m most definitely Latino. That’s who I am. But at the same time, for an actor it’s like, I want to be hired not because of what I can represent, but because of what I can create, how I can transform, and the power of what I create.”\n\nStill, Isaac exists in the year 2018 with the rest of us. “I’m not an idiot,” he adds. “And I know that we live in a politically charged time. There’s so much terrible language, particularly right now, being used against Latinos as a kind of political weapon.” He recognizes, too, the necessity “for people to see people that look like them, because that’s a very inspiring thing.”\n\nAs a kid, Isaac looked up to Raúl Juliá, the Puerto Rican-born actor and Broadway star whose breakthrough movie role came as Gomez Addams of the ’90s Addams Family films. “But I looked up to him particularly because he was a Latino that wasn’t being pigeonholed just in Latino parts,” Isaac adds.\n\n“I do think there is a separation between the artist and the art form, between a craftsperson and the craft.” For himself, he calls it “that double thing,” as apt a term as any for that peculiar tension: “Like yes, I am who I am, I came from where I come from. But my interest isn’t just in showing people stuff about myself, because I don’t find me to be all that interesting.”\n\n“What is more interesting to me is the work that I’m able to do, and all that time that I spent learning how to do Shakespeare and how to break down plays and try to create a character and do accents,” he says. “That, for me, is what’s fun.”\n\nBut it’s always that “double thing”—reconciling two pulls and finding a way not to get torn up. He wants American Latinos “to know, to be proud that there is someone from there that is out and doing work and being recognized not just for being a Latino that’s been able to do that.” On the other hand, he’s “just like any artist who’s out there doing something. I feel like that’s…” He pauses. “That’s also something to be proud of, you know?”\n\nIsaac’s focus lands on me again. “And I think for you too, you’re a writer and that’s what you do. You’re a journalist. Your identity is also part of that, but I think that you want the work to stand on its own, too.”\n\nHis older sister, Nicole, is “an incredible scientist. She’s at the forefront of climate change and particularly how it affects Latino communities and low-income areas. And she is a Latina scientist, but she’s a scientist, you know? She’s a great scientist without the qualifier of where she’s from. And that’s also very important.”\n\nPaul Gauguin’s life after van Gogh’s death by gunshot at 37 revealed more repugnant depths than his dick-ish insensitivity.\n\nHe defected from Paris again, this time to the South Pacific, determined to break from the staid art scene once and for all. He “married” three adolescent brides, two of them 14 years old and the other 13, infecting each girl with syphilis and settling into a private compound he dubbed Maison de Jouir, or “House of Orgasms.” “Pretty gnarly, nasty stuff,” Isaac concedes, though he withholds judgment of the man in his performance onscreen.\n\nTo do so might have made his Gauguin—alluring, haughty, insufferable, brilliant—“not quite as complex.” Opposite Willem Dafoe’s divinely wounded depiction of van Gogh, however, he found room to play. “It was interesting to ask, well, what’s the kind of person that would feel that he’s entitled to do those kinds of things?” The man onscreen is an asshole, to be sure, but hardly paints the word “sociopath” onto a canvas. He’s simply human: “I think that anyone has at least the capacity to do” what Gauguin did, Isaac reasons.\n\nThe actor has had more than one reason to think on a person’s capacity to do terrible things in the last year. Two men he’s worked with—his Show Me a Hero director, Paul Haggis, and X-Men: Apocalypse helmer Bryan Singer—were both accused of sexual assault in the last year, part of a torrent of unmasked misconduct Hollywood’s Me Too movement brought to national attention.\n\n“It’s a tricky thing,” Isaac says, “because you get offered jobs all the time and, I guess, what’s required now? What kind of background checks can someone do beforehand? There isn’t a ton.” (Just ask Olivia Munn.) “Especially as an actor, to make sure that the people you’re working with, surrounding yourself with, haven’t done something in their past that I guess will make you seem somehow like you’re propping up bad behavior.”\n\nCarefully, he expresses reservations about the phenomenon of the last year. “People don’t feel like they’re getting justice through any kind of legal system, so they take it to the streets,” he ventures. “It’s basically street justice. You have no other option. And what happens when you take it to the streets is that damage occurs, and sometimes people get taken down, things get destroyed that you feel like maybe shouldn’t have.”\n\n“But some of it had to happen, and hopefully now there’ll be more of a system in place to take these things seriously,” he says. “It seems like it is starting to happen more, but then you see things like, how can this person get away with it? How can that person? It just boggles the mind.”\n\nHe pulls back again, remembering what’s out of his control.\n\nTomorrow, he’ll be back in an X-Wing suit, as Poe struggles to accept the same truth. In a year, he’ll be home in New York with his wife and young son, focusing on matters more “real” than Hollywood, its artists, and its art. Whatever he chooses whenever he returns, he’ll be ready—for the critics, the questions, for this new reality.\n\n“All I can do is just do what means something to me,” he says. “You just have to find something honest.” One expects he will.", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1491366997/author/Melissa-Leon.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1542694242/181116-leon-oscar-isaac-tease_hzbfvn", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1542694242/181116-leon-oscar-isaac-tease_hzbfvn"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1542694242/181116-leon-oscar-isaac-tease_hzbfvn", "keywords": [], "authors": ["Melissa Leon", "Entertainment Editor"], "canonical_link": "https://www.thedailybeast.com/oscar-isaac-on-the-pain-of-losing-carrie-fisher-and-anti-latino-hysteria-in-the-age-of-trump", "title": "Oscar Isaac on the ‘Pain’ of Losing Carrie Fisher and Anti-Latino Hysteria in the Age of Trump", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Oscar Isaac on the ‘Pain’ of Losing Carrie Fisher and Anti-Latino Hysteria in the Age of Trump", "keywords": "Art, Carrie Fisher, Star Wars, Hispanic and Latino Americans, Vincent van Gogh, J.J. Abrams", "og": {"title": "Oscar Isaac on the ‘Pain’ of Losing Carrie Fisher and Anti-Latino Hysteria", "description": "The Golden Globe-winning ‘Star Wars’ actor opens up to Melissa Leon about playing artist Paul Gauguin in the new film ‘At Eternity’s Gate,’ his Latino heritage, and much more.", "url": "https://www.thedailybeast.com/oscar-isaac-on-the-pain-of-losing-carrie-fisher-and-anti-latino-hysteria-in-the-age-of-trump", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1542694242/181116-leon-oscar-isaac-tease_hzbfvn"}, "description": "The Golden Globe-winning ‘Star Wars’ actor opens up to Melissa Leon about playing artist Paul Gauguin in the new film ‘At Eternity’s Gate,’ his Latino heritage, and much more.", "authors": "Melissa Leon", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2018-11-20T09:55:48.000Z", "author": "https://www.thedailybeast.com/authors/melissa-leon"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@MelissaHLeon", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1542694242/181116-leon-oscar-isaac-tease_hzbfvn"}, "sailthru.date": "2018-11-20T09:55:48.000Z", "sailthru.expire_date": "2018-12-04T09:55:48.000Z", "publicationDate": 201811200955, "parsely-page": "{\"author\":\"Melissa Leon\",\"link\":\"https://www.thedailybeast.com/oscar-isaac-on-the-pain-of-losing-carrie-fisher-and-anti-latino-hysteria-in-the-age-of-trump\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"EXPRESS YOURSELF\"},\"post_id\":\"oscar-isaac-on-the-pain-of-losing-carrie-fisher-and-anti-latino-hysteria-in-the-age-of-trump\",\"pub_date\":\"2018-11-20T09:55:48+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Art\",\"Carrie Fisher\",\"Star Wars\",\"Hispanic and Latino Americans\",\"Vincent van Gogh\",\"J.J. Abrams\",\"typeArticle\"],\"title\":\"Oscar Isaac on the ‘Pain’ of Losing Carrie Fisher and Anti-Latino Hysteria in the Age of Trump\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/T77PDm3e1iE?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1542707748.0, "source": "https://www.thedailybeast.com", "summary": ""}