{"url": "secondnexus.com/entertainment/kourtney-kardashian-baby-four-pregnancy/", "text": "Kourtney Kardashian may be at it again. In recent weeks, both Kim Kardashian and her younger sister, Kylie Jenner have welcomed new baby girls after super secret pregnancies. Add in the fact that middle-sister Khloe is also pregnant and expecting her first child in early April, according to her Twitter, and the Kardashian clan couldn’t be happier. Still, you’ve heard the saying ‘when it rains it pours.’ Sure enough, ENews’ sneak peeks of the newest episode airing this Sunday, February 25 show Kourtney dishing to her sisters about a potential little cousin for brand new babies, Chicago and Stormi. So, straight up: Is Kourtney Kardashian pregnant? Is she really going to freeze her eggs?\n\nWhile there are no confirmations at this point that Kourtney Kardashian is pregnant, Kourtney’s own words suggest she’s got baby number four on her mind. And we know KUWTK crews film episodes several weeks to months before they air. Spoiler videos for this Sunday’s episode, “Trimester Trouble,” reveal Kourtney’s plan to freeze her eggs as “insurance,” that she can have a fourth child in the future. So will we know at the end of this episode if Kourtney's going to freeze her eggs?\n\nKourtney also revealed that she uses an IUD as birth control with her current boyfriend, model, Younes Bendjima, 24. Adding, however, that she wouldn’t mind taking it out if her partner wanted children in the near term. It seems that the Kardashian women are on a pregnancy roll. But what about the boys, or should we say, Kardashian Kastoffs?\n\nKardashian Exes Talk Babies and New Boyfriends\n\nKhloe’s ex-husband, Lamar Odom discloses in a not-yet-aired interview with Access Hollywood, that he’s happy for Khloe about her pregnancy with new boyfriend, Cavaliers player, Tristan Thompson. Lamar can be heard saying that, “it couldn’t happen to a better person,” US Magazine reports. Still, he admits hearing the bombshell Khloe divulged in the season 13 finale, that she was only “fake trying” to get pregnant while she was married to him, was “hurtful.”\n\nSimilarly, Kylie’s famous on-again-off-again ex-boyfriend, Tyga had good things to say about Kylie and her new baby. He told radio interviewer, DJ Akademiks that, “there’s no bad blood, no problems.” And while the 28-year-old rapper didn’t comment on Stormi specifically during this interview, he did admit that he and Kylie still “communicate.\" And that did nothing to squash internet rumors that Tyga may be the biological father of the 20-year-old cosmetics mogul’s new daughter.\n\nAnd what about Kourtney’s ex and baby-daddy, Scott Disick? The man who got Kourtney Kardashian pregnant three times in the past is plenty busy hitting the town with new girlfriend, 19-year-old Sophia Richie, younger daughter of Lionel Richie. And on the Rob Kardashian front, there’s not much news yet. Momager Kris’s only son, Rob, has not found love again. At least not after his much-publicized breakup with Blac Chyna, the mother of one-year-old Dream Kardashian. But with all these new babies on the scene, who has time to date?", "images": ["https://assets.rbl.ms/18212635/2000x.png", "https://assets.rbl.ms/21104600/2000x.png", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjA0MTUyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0MDEwMzA2OX0.2hofFVszVQHj0KJzzCvagQok06hOs_FuYK8ZKTRZGBg/img.jpg?width=980", "https://assets.rbl.ms/16950974/2000x.png", "https://assets.rbl.ms/21180304/2000x.png"], "top_img": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjA0MTUyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0MDEwMzA2OX0.2hofFVszVQHj0KJzzCvagQok06hOs_FuYK8ZKTRZGBg/img.jpg?width=980", "keywords": [], "authors": ["Second Nexus Editorial", "Evan Brechtel"], "canonical_link": "https://secondnexus.com/kourtney-kardashian-baby-four-pregnancy", "title": "Is Kourtney Kardashian Pregnant or Planning for a New Baby Too?", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@", "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjA0MTUyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0MDEwMzA2OX0.2hofFVszVQHj0KJzzCvagQok06hOs_FuYK8ZKTRZGBg/img.jpg?width=980"}, "fb": {"app_id": 194454967689857, "pages": 651833651535152}, "og": {"type": "article", "url": "https://secondnexus.com/kourtney-kardashian-baby-four-pregnancy", "site_name": "Second Nexus", "image": {"identifier": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjA0MTUyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0MDEwMzA2OX0.2hofFVszVQHj0KJzzCvagQok06hOs_FuYK8ZKTRZGBg/img.jpg?width=980", "width": 980, "height": 2000}, "title": "Is Kourtney Kardashian Pregnant or Planning for a New Baby Too?", "description": "Kourtney Kardashian may be at it again. In recent weeks, both Kim Kardashian and her younger sister, Kylie Jenner have welcomed new baby girls after super secret pregnancies. Add in the fact that middle-sister Khloe is also pregnant and expecting her first child in early April, according to her Twit..."}, "referrer": "always", "theme-color": "#647187", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "article": {"published_time": "2018-02-26T00:00:25+00:00", "modified_time": "2019-12-01T22:09:46+00:00", "author": "https://www.facebook.com/651833651535152"}, "keywords": "Kourtney Kardashian", "description": "Kourtney Kardashian may be at it again. In recent weeks, both Kim Kardashian and her younger sister, Kylie Jenner have welcomed new baby girls after super secret pregnancies. Add in the fact that middle-sister Khloe is also pregnant and expecting her first child in early April, according to her Twit...", "google-site-verification": "D8Vdu7GeWF-BFCa-e72dm1r5DTluFVcJ8NG1IoEeLuo"}, "movies": [], "publish_date": 1519603225.0, "source": "http://secondnexus.com", "summary": ""}