{"url": "http://abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623&page=3", "text": "March 13, 2011 \u0097 -- (BEGIN VIDEO CLIP) AMANPOUR (voice-over): This week, \"Target Libya.\" Missile strikes begin.\n\nOBAMA: Our consensus was strong, and our resolve is clear. The people of Libya must be protected.\n\nAMANPOUR: Another war front opens for the United States. The world unleashes all necessary measures to stop Libyan leader Moammar Gadhafi. His son, Saif, speaks to \"This Week\" in a worldwide exclusive. What next for Moammar Gadhafi, the Libyan people, for the United States military? How does it end?\n\nThen, disaster in the Pacific. Nuclear nightmare scenario in Japan. How prepared is the United States? Could it happen here? Libya and Japan, two crises with major consequences for the United States.\n\n(END VIDEO CLIP)\n\nANNOUNCER: Live from the Newseum in Washington, D.C., \"This Week\" with Christiane Amanpour, \"Target Libya,\" starts right now.\n\nAMANPOUR: As we begin our broadcast, the United States is at war in a third Muslim country, Libya. We'll take you there live in just a moment. ABC's team of correspondents is covering every angle of this story. I will have an exclusive interview with Moammar Gadhafi's son and close adviser, Saif al-Islam. And I'll be joined here in the studio by Admiral Mike Mullen, chairman of the Joint Chiefs of Staff, to discuss what's being called Operation Odyssey Dawn.\n\nBut first, the latest headlines in this fast-moving story. A defiant Moammar Gadhafi is promising a long war, one day after the United States and a broad international coalition launched military strikes on his country. British and American ships and submarines fired 112 cruise missiles at more than 20 targets on the coast.\n\nAmerican B-2 bombers took out a Libyan airfield, all part of the largest Western military intervention in the Arab world since the start of the Iraq war. The show of force is designed to impose a no- fly zone to prevent the Libyan strongman from firing on his own people.\n\nSunday, Tripoli shook with the sound of explosions and anti- aircraft fire. Libyan state television reported that 48 people had been killed.\n\nBut today, in a phone call to state television, Gadhafi said Libyans stand ready to fight what he calls \"crusaders.\" This is a fight, he says, that he will win.\n\n(BEGIN VIDEO CLIP)\n\nM. GADHAFI (through translator): You are not capable of a prolonged -- for a prolonged war in Libya. We consider ourselves ready for a long war. Be aware of that. We're not retreating anywhere, because this is our land. This is where we're staying. Then you're going to return defeated.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Joining me on the line from Tripoli in Libya, Saif al- Islam, Colonel Gadhafi's second son and close adviser.\n\nSaif, thank you for joining me. Can you tell me right now, where are you? And what is happening there right now?\n\nGADHAFI: You know, we are in Tripoli, as you know. But yesterday, we were surprised that -- you know, the Americans and the British and the French attacked Libya, attacked five cities, terrorized people, and (inaudible) children, women were so afraid yesterday, heavy bombing everywhere. So it was a big surprise that, finally, President Obama -- we thought he's a good man and friend of Arab world -- is bombing Libya.\n\nAMANPOUR: Saif, President Obama very explicitly gave your father an ultimatum and said cease fire, stop, and this won't happen. He then had to say that the attacks continue and the United States cannot sit idly by while a leader says that there will be no mercy. Why did your father continue the attacks in Benghazi? Why didn't he have a cease fire?\n\nGADHAFI: First of all, our people went to Benghazi to liberate Benghazi from the gangsters and the armed militia. So if you -- if the Americans want to -- want to help the Libyan people in Benghazi, so go to Benghazi and liberate Benghazi from the militia and the terrorists. So do it.\n\nAMANPOUR: My question, though, is, there is now missile strikes and an air attack against Libya. Will Colonel Gadhafi step down? Will he step aside?\n\nGADHAFI: Step aside why? I mean, to step -- again, there's a big misunderstanding. The whole country is united against the armed militia and the terrorists. You asked -- simply, the Americans and other Western countries, you are supporting the terrorists and the armed militia. That's it.\n\nAMANPOUR: Saif, will there be Libyan retaliation against, let's say, commercial flights around the Mediterranean or other targets?\n\nGADHAFI: No, this is not our target. Our target is how to help our people in Libya, especially in Benghazi. Believe me, they are living a nightmare, a nightmare, really, a nightmare. They have no freedom, nothing under the rule of the armed militia.\n\nSo we urge the Americans either to go there themselves and help our people there or let the Libyan people help their brothers in Benghazi. But believe me, one day, you wake up and you will find out that you were supporting the wrong people. And you are being a big mistake with supporting those people. It's like the WMD in Iraq. It's another story.\n\nAMANPOUR: Saif al-Islam, thank you very much, indeed, for joining us from Tripoli.\n\nGADHAFI: Thank you.\n\nAMANPOUR: So that's the view from the Gadhafis in Tripoli. Let's go to eastern Libya, the rebel stronghold where ABC's Alexander Marquardt joins us live.\n\nSo what is the mood there where you are?\n\nMARQUARDT: Good morning, Christiane. We are in Tubruq, in eastern Libya, where an opposition spokesman told us this morning that morale is sky high. They've been pleading for military intervention for weeks. They now feel that there's a level playing field, that the rebels will be able to push the Gadhafi forces out of the east, away from cities like Ajdabiya and Benghazi that have seen heavy fighting over the last few days. Eventually, they want to make their way to Tripoli, where they plan to oust Gadhafi.\n\nWe spoke with people on the streets. They're understandably very happy, thanking the coalition for what they've done, specifically France and the U.K., for introducing the resolution at the U.N. They believe that this intervention will lead to victory and eventually to a free Libya.\n\nBut with this change in tide comes a period of insurgency. The opposition spokesman said that this is the scary part, because of how illogical Gadhafi is and because of -- because of what he calls his thirst for blood.\n\nChristiane?\n\nAMANPOUR: Alex, thanks.\n\nAnd now let's go to the capital Tripoli, again. That could soon be ground zero in this conflict. Moammar Gadhafi is there, and so is the BBC's Allan Little, who joins us now live.\n\nSo, Allan, you heard from the Gadhafis. You heard the mood in Benghazi. What do you think is the next move in Tripoli? And how are they portraying it there?\n\nLITTLE: Well, fighting talk from Colonel Gadhafi, as from his son, Saif, largely for domestic consumption. It's not hard to go around the city and find people willing to echo those sentiments, diehard devotees of Colonel Gadhafi saying that -- people saying they're willing to die along with him if it comes to that.\n\nThere's no doubting the sincerity of those people, I think, and the passion with which they speak. Their devotion then seems to get more intense the more isolated he becomes from the world. The question is, how representative is that voice? No other voice can make itself heard here in the prevailing atmosphere in which patriotism for Libya is fused with devotion to the person of Gadhafi himself.\n\nWhat are those hundreds of thousands, if not millions of people who do not take part in those demonstrations of devotion, really feel and think in the silence of their own heads? What is the real sentiment of Tripoli? That is simply impossible in this atmosphere to gauge.\n\nAMANPOUR: Allan, thank you so much.\n\nAnd, of course, the leaders of Britain, France, and President Obama is keeping a close tab on the unfolding situation. ABC's Jake Tapper is live at the White House.\n\nAnd, Jake, what from the White House is the end game here? What's the perspective from there?\n\nTAPPER: Good morning, Christiane. President Obama is in Brazil. But you talked on a very, very difficult question for the White House, because it's been the position of President Obama that there should be regime change in Libya, since March 3rd, when Obama said that Gadhafi has to go.\n\nBut that is not the goal of this military operation. The goal of this military operation officially is to impose a no-fly zone and to protect civilians. Gadhafi stepping down is not part of it.\n\nSo what I would expect is that you will see more efforts internationally to arm the Libyan rebels so that they will take into their own hands the goal of toppling Gadhafi. But that is not officially the goal of this military operation, so it's a delicate dance for President Obama as he attempts to make this military operation even more international than previous U.S. military operations.\n\nAs you know, as we've talked about, there's been a huge effort by the White House to make this seem as though the United States is not playing a leading role, even though, of course, we have 11 ships in the Mediterranean, five of which were firing Tomahawk missiles. There, of course, are other nations participating in the military operation, France, the U.K., and others coming in the coming days, but right now, the U.S. is taking a major leadership role, although the Obama administration wants to make this seem as though it is the world against Gadhafi, not Obama and the U.S. against Gadhafi, Christiane.\n\nAMANPOUR: Jake, just very quickly, do you think the U.S. will arm the rebels?\n\nTAPPER: I think it's a distinct possibility that the U.S. will be part of an international effort to do so. I would doubt very much that the U.S. would do so on its own.\n\nAMANPOUR: Jake, all right.\n\nAnd let's go now to Martha Raddatz. The U.S. is pledging, as Jake said, to step back to a support role after the initial phase. Martha, you're there. You're covering the military. Is that happening? Do you think it's realistic to go into a support role? It's obviously very unusual in these kinds of military interventions. RADDATZ: It's certainly unusual for the U.S. And right now, a U.S. general is in charge of the operation, General Carter Ham. And you have an admiral, Admiral Scott -- or Sam Locklear, who is on a ship. And he is the tactical commander, meaning he is coordinating all of these air strikes.\n\nBut in a few days, the hope is, the U.S. hopes that General Carter Ham can turn over his responsibility to one of the coalition members. That is the plan right now. I don't think they know who that will be.\n\nBut in this initial phase, the U.S. does have unique capabilities, as the president keeps saying. You had stealth bombers going in there. You had the B-2 bombers going in there. You had these Tomahawk missiles on the ships. So the U.S. felt it had to take the lead role in this phase.\n\nAnd this phase is, of course, to wipe out Gadhafi's air defenses. The next phase will be the no-fly zone. I do think the U.S. will be involved in that somewhat and will have fighters involved in that, but the bulk of the no-fly zone will be flown by British pilots, French pilots, and other allies.\n\nAMANPOUR: Martha, thank you so much.\n\nAnd joining me next, Admiral Mike Mullen, chairman of the Joint Chiefs of Staff. And we'll put that to him. I'll ask him how the missions will work, when it will end, and whether it can succeed at all if Moammar Gadhafi remains in power.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: Welcome back.\n\nThough his son sounded subdued, Moammar Gadhafi himself was sounding undaunted this morning. He says his supporters are armed and prepared to fight, and he's pledging that this will be, quote, \"a long war.\"\n\nJoining me now, chairman of the Joint Chiefs of Staff, Admiral Mike Mullen.\n\nThank you for joining us.\n\nMULLEN: Good morning.\n\nAMANPOUR: Is the United States leading this? Or is it in a supporting role?\n\nMULLEN: Well, actually, the French were the first ones in yesterday, in terms of starting to establish the no-fly zone. The United States is taking the lead in terms of the coalition. General Carter Ham, U.S. commander of U.S. AFRICOM, is actually the commander right now. And we look to, in the next few days, transition that to a coalition leadership.\n\nAMANPOUR: So the U.S. will pull back?\n\nMULLEN: The U.S. will essentially take a supporting role, providing unique capabilities, certainly in terms of things like jamming, things like...\n\nAMANPOUR: But not bombing and flying over?\n\nMULLEN: No -- well, certainly, the -- we'll be in transition. I mean, effectively, Christiane, what's happened in the last 24 hours is the no-fly zone has been put -- has essentially started to have its effects. We've got aircraft over Benghazi right now. We have that for 24/7. He hasn't flown any aircraft in the last two days. So the initial part of the operation and the idea of getting a no-fly zone in place is...\n\nAMANPOUR: Is successful?\n\nMULLEN: Well, it has been successful so far.\n\nAMANPOUR: So will it be a long war, as Colonel Gadhafi pledges?\n\nMULLEN: Well, we're very focused on the limited objectives that the president has given us and actually the international coalition has given us, in terms of providing the no-fly zone so that he cannot attack his own people, to avoid any kind of humanitarian massacre, if you will, and to provide for the humanitarian corridors, humanitarian support of the Libyan people.\n\nAMANPOUR: So you say a limited objective, but we've heard from the president, we've heard from the secretary of state, Gadhafi has to go. Is that the military objective?\n\nMULLEN: Well, the military objective is -- is as I just described it, in terms of -- the mission is very clear right now. It's to focus on getting this no-fly zone in place and to support the U.N. objectives of no humanitarian crisis and humanitarian support, protecting Libyan civilians.\n\nAMANPOUR: So it's possible that we could have, like Iraq, a 12- year no-fly zone with the strongman still in place?\n\nMULLEN: Well, again, I think circumstances will drive where this goes in the future. I wouldn't speculate in terms of length at this particular point in time. It's had a pretty significant effect very early in terms of our ability to address his forces -- to attack his forces on the ground, which we did yesterday outside Benghazi, and get the no-fly zone stood up.\n\nAMANPOUR: What about other countries, such as Bahrain, such as Yemen? If the United States military is attacking to protect civilians in Libya, why not in Bahrain and Yemen?\n\nMULLEN: Well, I think, first of all, just back to Libya, a very important part of this has been the Arab League vote to establish a no-fly zone and the -- the partners -- the coalition partners that are coming into play with respect to Libya.\n\nAMANPOUR: Correct. But what's the logic?\n\nMULLEN: In terms of...\n\nAMANPOUR: Of other people being -- civilians being killed in other countries where the U.S. has an interest?\n\nMULLEN: Well, I think -- I think we have to -- to be very careful to treat every country differently. Certainly, there's a tremendous change going on right now throughout the Middle East, including in Bahrain. And Bahrain is a much different -- in a much different situation than Libya.\n\nWe haven't had a relationship with Libya for a long, long time. The Bahrainis and that country has been a critical ally for decades. So we're working very hard to support a peaceful resolution there, as tragic as it has been, and we certainly decry the violence which has occurred in Bahrain. I just think the approach there needs to be different. AMANPOUR: Do you think the Libyans have the wherewithal to retaliate against the United States or its allies in the region or here?\n\nMULLEN: I don't think -- from a military standpoint, certainly, they have some capability. And -- and yet, at least if I were to take the first 24 hours or so, they've -- they've not been a very effective force.\n\nPart of what you do when you go into this is you assume they have a fairly significant capability or the capability they have is good until proven otherwise. We've taken out their air defense. We've actually stopped -- attacked -- we've attacked some of their forces on the ground in the vicinity of Benghazi. And yesterday they were on the march to Benghazi. They were lobbing rockets and mortars in Benghazi...\n\nAMANPOUR: So Benghazi is safe?\n\nMULLEN: Well, Benghazi -- they're no longer marching there. I wouldn't describe Benghazi as safe at this particular point in time.\n\nAMANPOUR: But even though you say you have to assume that they have some kind of capability, realistically, do you think Gadhafi can attack civilian aircraft targets and will do?\n\nMULLEN: Well, he still has -- from what I've seen this morning, he still has some surface-to-air capability, where he could attack an aircraft, including one of ours. We haven't seen large-scale indications of that after the action yesterday. He clearly has the ability to continue to attack his own people, and then we're very focused on that, and -- and trying to ensure that his military forces don't do that.\n\nAMANPOUR: Mustard gas stockpiles, is that a problem?\n\nMULLEN: Very closely monitored, and I haven't seen it as a problem thus far.\n\nAMANPOUR: Admiral Mullen, thank you very much, indeed, for joining us.\n\nMULLEN: Thank you, Christiane.\n\nAMANPOUR: And we're covering the unfolding events in Libya from all angles this morning. Up next, I'll speak with a leader of the opposition movement who until recently worked for Gadhafi himself. He joins me with unique insight into the Libyan strongman.\n\nAnd later, will a new war abroad bring a new threat here in the United States? Could Gadhafi retaliate on American soil? I'll put that question to the former homeland security secretary, Michael Chertoff.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nH. CLINTON: The world will not sit idly by while more innocent civilians are killed. We are standing with the people of Libya, and we will not waver in our efforts to protect them.\n\n(END VIDEO CLIP)\n\nAMANPOUR: So, as you heard his son, Saif, tell us, Moammar Gadhafi remains in Tripoli, presumably hunkered down. His Tripoli compound is reportedly filled with hundreds of supporters, including women and children. Could they make up a human shield, a possible last line of defense for the embattled leader?\n\nUntil just weeks ago, Ali Suleiman Aujali was Gadhafi's voice in the United States, the Libyan ambassador to this country. But Aujali has turned against Gadhafi and is now a leading voice of the opposition. He joins me here at the Newseum in Washington.\n\nAnd from New York, a man whose country led the call for air strikes we're seeing right now, France's ambassador to the United Nations, Gerard Araud.\n\nGentlemen, welcome, both, to this program.\n\nAUJALI: Thank you.\n\nAMANPOUR: Let me ask you first, former Ambassador Aujali, what is in the mind of Gadhafi right now? This is a man you know, you served. Under this threat, will he fold?\n\nAUJALI: I think there is one thing in the mind of Gadhafi, that he will not step down at all. He will fight until the end.\n\nAMANPOUR: So everything that his son is telling us, that he's telling us is not just bravado?\n\nAUJALI: Yeah.\n\nAMANPOUR: He will fight?\n\nAUJALI: He will fight. He will fight. He has no other choice. He has no shelter to go. And this is his -- his attitude. He will never give up. ARAUD: Yes.\n\nAMANPOUR: So how will this end?\n\nAUJALI: Well, the end -- now I think there is a good chance after the air strikes, after the revolutionaries being protected by -- from the Gadhafi hitting, I think now they'll start marching to the -- to the east. And we have to -- we have to break the siege against Tripoli. If Tripoli...\n\nAMANPOUR: So you're hoping that the rebels will keep marching on to the capital...\n\nAUJALI: Of course. Of course. Of course.\n\nAMANPOUR: ... and take on Gadhafi himself?\n\nAUJALI: Of course. Yeah, we have to open the road, you know, to Gadhafi's -- where he's staying.\n\nAMANPOUR: Let me ask you, Ambassador Araud. This is pretty much an extraordinary situation. There is a military intervention, and France is the country that has led it and that has really brought the United States to this situation. You're listening to the ambassador here, Aujali. Why is it that France took that decision?\n\nARAUD: Well, I think it was, first, I guess, a moral and human reaction. It was impossible to consider a victory of Gadhafi and Gadhafi taking Benghazi. He was himself saying what will happen. He was saying that they -- they will search house by house. He was referring to rivers of blood. It was simply totally impossible to -- to accept it.\n\nYou have also to consider that, for us, Libya, the Maghreb, it's a bit like you, Central America and Cuba. In human and geographic terms, it's very close to -- to my country.\n\nAMANPOUR: Well, then let me ask you, though. Now, then, are you on the side of the rebels? Is this the -- you know, making the rebels win, is that the aim of this current military operation?\n\nARAUD: We -- we do consider France as recognized -- the committee of Benghazi as the representative of the Libyan people. We simply want the Libyan people able to express their -- their will.\n\nAMANPOUR: Well, let me ask you, Mr. Aujali. You've heard Admiral Mullen clearly said the mission is to protect the citizens of Benghazi and -- and Libya and to open up humanitarian ability for them, not to take out Gadhafi, not to support the opposition. What do you understand by this resolution?\n\nAUJALI: I understand the mission is to protect the Libyan civilians, not only Benghazi. Protection of the Libyan civilian only achieved by one goal, that Gadhafi is not there, not only by stop his airplanes striking the people. The dangers is Gadhafi himself.\n\nAMANPOUR: So you understand, this military action is aimed to get rid of Gadhafi?\n\nAUJALI: Of course. If this is not the mission, then they would just hit some airplane -- shot the airplanes down and then leave was this madman, killing his people without mercy. This is...\n\nAMANPOUR: Well, let me ask you, Ambassador Araud. Is that the aim? Is that what the United States, France, and Britain have signed up to, to get rid of Colonel Gadhafi?\n\nARAUD: We want the Libyan people to be able to express their will, I've said, which -- and we consider that it means that Gadhafi has to go.\n\nAMANPOUR: Are you concerned -- are you concerned that there will be retaliation? You've taken on this -- this military intervention. He has threatened retaliation against France, Britain, the United States, or at least their interests. Are you worried?\n\nARAUD: You know, when you enter a military intervention, it's never risk-free. So we have to be careful and to consider all the dangers. But, also, we know that Gadhafi is prone to empty rhetoric.\n\nAMANPOUR: All right. Let me ask you one final question, Ambassador Aujali. This is designed to divide and conquer, to get Gadhafi's people away from him. You defected. Do you think that others around him will defect?\n\nAUJALI: Believe me, the people who are around him, especially the ministers, if they have a chance to defect, they will do it now, now, now. But he kept them -- he's keeping them in the Bab al-Azizia. They have no place to go...\n\nAMANPOUR: In his compound?\n\nAUJALI: In his compound. Then he's using them as a -- as a human shelter, also. But if they have a chance, they will defect. For example, I give you example, if you have some time. Then -- I have a friend of mine who was appointed the ambassador to Geneva. He's a young man, first time he's been appointed the head of mission. And when he left Tripoli with his credential, he just resigned.\n\nAMANPOUR: All right. Well, we'll see what happens, whether the people around Gadhafi turn against him. Ambassador Araud in New York, thank you for joining us.\n\nAmbassador Aujali, thank you for joining us.\n\nAnd when we return, the big question: How -- now that the U.S. has struck at Libya, will Libya strike back? I'll discuss that with a high-powered roundtable that includes the former chair of the House Intelligence Committee and an architect of the war in Iraq.\n\nAnd later, we turn to the week's other major story, danger and devastation in Japan, as that country struggles to avert a full-scale nuclear meltdown. I'll ask former Energy Secretary Bill Richardson and former Homeland Secretary Chief Michael Chertoff whether America is prepared to manage such a catastrophe.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Actions have consequences, and the writ of the international community must be enforced. Today we are part of a broad coalition, we are answering the calls of a threatened people, and we are acting in the interests of the United States and the world.\n\n(END VIDEO CLIP)\n\nAMANPOUR: President Obama right there -- excuse me -- explaining why American missiles and allied air strikes are now raining down on Libya, emphasizing that this is a broad international effort. As noteworthy as what the president said yesterday is what he left out, namely, his recent declaration that Libyan leader Moammar Gadhafi must go.\n\nThis is a momentous time in America's relations with the Arab world. And joining he today to discuss its far-reaching implications, ABC's George Will, former Congresswoman Jane Harman, who chaired the House Intelligence Committee, Paul Wolfowitz, former deputy secretary of defense under George W. Bush and a mastermind of the war in Iraq, and Robin Wright of the U.S. Institute of Peace, author of \"Rock the Casbah: Rage and Rebellion Across the Islamic World.\"\n\nThank you all for joining me. And let me ask you first, George, do you think that this was the right thing to do?\n\nWILL: I do not. We have intervened in a tribal society in a civil war. And we have taken sides in that civil war on behalf of people we do not know or understand for the purpose -- not avowed, but inexorably our purpose -- of creating a political vacuum by decapitating that government. Into that vacuum, what will flow? We do not know and cannot know.\n\nAMANPOUR: Paul Wolfowitz, you disagree with George?\n\nWOLFOWITZ: I do. I think that what we have prevented, for one thing, is a bloodbath in Benghazi, which would have stained our reputation throughout the Arab world, at a time when our reputation really matters. And I understand George's hesitations, but it would seem to me, if you follow those hesitations, you say, it's better to keep this devil that we know than the unknown, and I don't see how any unknown could be worse than the devil who is in Tripoli right now. AMANPOUR: Except wouldn't you say the hesitation -- you can trace it right back to your operation in Iraq, that, you know, it caused such a pendulum swing against trying to intervene because of the chaos that was unleashed.\n\nWOLFOWITZ: We have paid the price of intervention. Sometimes we've paid the price of nonintervention, in Bosnia, for example. One of the things that makes the situation so unique is the monstrous quality of the Tripoli regime, the monstrous quality of Gadhafi and his sons. And I know, you know, people say, well, what about Bahrain? What about Yemen? This is a totally different case, where a man is actually slaughtering his own people, has no regard for his own people. He uses mercenaries to kill them. It is a unique case, and it's being watched throughout the Arab world.\n\nAMANPOUR: Well, let me ask you, former congresswoman. You sat on the Intelligence Committee. You -- I mean, this question about why Libya and not Bahrain or -- or Yemen, American allies, is that a valid distinction to make?\n\nHARMAN: I think it is. First, let me salute the life and service of Warren Christopher, a dear friend from California, who died yesterday and say how honored I am now to be president and CEO of the Woodrow Wilson Center, succeeding Lee Hamilton, and working with scholars like Robin and Aaron David Miller and others.\n\nI think we have to see this in a broader context. I just watched your Mike Mullen interview, where he said we -- we view each of these countries individually. We need a strategic narrative.\n\nAnd as I look at this, from my experience being in Congress when we did nothing in Rwanda, which Bill Clinton said was his biggest mistake, when we intervened in -- in Bosnia, did a no-fly zone, which didn't prevent the -- the massacre at Srebrenica, when we -- when Congress acted in Afghanistan, the authorization to use military force is still in effect, and then we took our eye off the ball, when we went into Iraq, I voted for that, because I believed the intelligence, which turned out to be wrong, I see lessons to be learned, and I'm not sure we're learning all the lessons.\n\nAs I look at it, the biggest threats to the United States, to our homeland security, are Yemen and some of the Al Qaida and other terror cells in Pakistan. Going into Libya has a moral objective, and I strongly agree with that. And I also think that Hillary Clinton and Susan Rice, who were strong proponents of what we're doing here, are great public servants.\n\nBut we have to understand that just a no-fly zone here may not cause regime change. And if we have a cornered Moammar Gadhafi -- who is not a rational actor -- and he uses mustard gas against his people, how have we...\n\nAMANPOUR: Well, actually -- Admiral Mullen...\n\nHARMAN: ... how have we prevented that?\n\nAMANPOUR: Admiral Mullen said that there wasn't a huge amount of threat there.\n\nHARMAN: There are two tons of liquefied mustard gas in Libya.\n\nAMANPOUR: Yeah, but he said he hasn't seen any movement of that.\n\nHARMAN: Not yet. We've only been there for 24 hours.\n\nAMANPOUR: Do you think it's a threat?\n\nHARMAN: I worry about that. I mean, we can't take out mustard gas by air. If we blow it up, we disperse it. And I worry about a guy who's going to fight to the end -- and that's what we just heard from the former ambassador -- and is not a rational actor, doing things like that, putting human shields around all the obvious targets, including his own -- his own living quarters, and taking Westerners as hostages and possibly engaging in terror acts and going down with as much bloodshed as possible.\n\nAMANPOUR: Well, let me ask you. You've interviewed him; I've interviewed him. A lot of people have. Is he the crazy man that Representative Harman talks about? Or is he going to either fold or be turned on by his own people?\n\nWRIGHT: He could prolong this for a very long time. This is not a man who plays by international rules, nor is he a man who thinks like even many of his counterparts in the Arab world, and that's why I think you've seen a great deal of unity in the Arab world against him. This is someone that everyone in Africa, in the Arab world...\n\nAMANPOUR: Which is really unusual, to have such a big Arab coalition against a fellow Arab leader.\n\nWRIGHT: And we haven't had one like this since the Iraq war back in 1990-1991. And that's what's, in fact, given the international community the legs. Without that, we probably would not be engaged.\n\nBut this is a very different kind of war. This is a country that's the size of Alaska with a population smaller than New York City. And so when we talk about the -- the kind of scenarios down the road, this is -- you know, most of the cities are along the coastal strip -- that it may not be as complicated as a place like Iraq was. This is -- you know, there are obvious targets and obvious sequence of places that either side will go. But there is mission gap between saying we want regime change and we're in there militarily for humanitarian. And that's where the problem is.\n\nAMANPOUR: Should it be regime change?\n\nWOLFOWITZ: Look, I think one of the most important pieces that's missing here is our connection with this transitional national council in Benghazi. They are -- they have representatives from all over the country. They seem to be setting up rules that are respectable rules.\n\nAMANPOUR: Really? Are you convinced about that? Who are they?\n\nWOLFOWITZ: Well, I'm not convinced. Well, I think we should have people in there so we really know better who they are. And we ought to be thinking of them as a leading edge here. I think it's been right to get an international coalition out in front and not make this all American, but most of all, it's a Libyan fight. What's been amazing over the last month is how brave the Libyan people have been. And I think -- across the whole country. this is not just a tribal thing in the east.\n\nAMANPOUR: But -- but when it comes, then, to lessons learned, what happens then with a Bahrain or a Yemen? I mean, isn't this a double standard?\n\nWOLFOWITZ: Look, excuse me: Libya is a separate case all by itself. You cannot...\n\nAMANPOUR: It is or it isn't.\n\nWOLFOWITZ: No, no, you can't -- you can't compare the regime in Bahrain or even the regime in Sana'a to Gadhafi. But, yes, there is a certain -- there's something in common here, which is that regimes that don't represent their people are not only wrong, they're ultimately unstable. And I think what we should be working for in Bahrain, what we should be working for in Yemen are governments that are much more representative of their people so that we can work with them better. But they're not -- it's absolutely wrong to compare what's happening there with what Gadhafi is -- is doing and has been doing for 40 years.\n\nWILL: There is no limiting principle in what we've done. If we are to protect people who are under assault, then where people are under assault in Bahrain, we are logically -- not only logically committed to help them, we are inciting them to rise in expectation. The mission creep here began, Paul, before the mission began, because we had a means not suited to the end. The means is a no-fly zone. That will not affect the end, which is obviously regime change.\n\nWRIGHT: Look, Yemen and Bahrain have the same problem that we do in Libya. Forty-five people were killed by the regime in Yemen, peaceful protests on Friday. You have the same thing in Bahrain.\n\nThis is -- the Obama administration has been responding very slowly at the outset to this kind of colossal transformation in the Arab world, and it's finally begun to kind of -- in response to what's happened in Tunisia, then in Egypt, and now in Libya, but it -- to develop a strategy, but it doesn't have a policy across the region that is consistent. And I think it's going to catch us at some point.\n\nHARMAN: Two points. I agree with that. We don't have a security narrative across the world. And we absolutely need that, because these countries are connected to each other. One fruit vendor who immolates himself in the boonies in Tunisia has set off a firestorm, an earthquake -- let's use Japan as the metaphor -- across the region.\n\nTwo points about this. One, Congress. The leaders of Congress were briefed last Friday at the -- in the Situation Room. Many were part of the recess and weren't there. That is not, by my lights, briefing Congress. Congress needs to be called back and discuss this and authorize or limit...\n\nAMANPOUR: Isn't it too late?\n\nHARMAN: ... the mission. No, I think the president is lawfully acting under his emergency powers as commander-in-chief and the U.N. resolution. And we didn't ask Congress to approve Bosnia. But I think Congress needs to act.\n\nThe other thing is, this is a zero-sum game militarily. We are stretched to the limit. And the assets we put into Libya we are taking away from somewhere else. And it's not just warships, people, and money. It's brain cells.\n\nAMANPOUR: All right. Let me then ask you -- since you've just said that, last lightning round then. Is this, as the president said, in the U.S. national interest?\n\nWILL: It is not worth war.\n\nAMANPOUR: U.S. national interest?\n\nHARMAN: It is not as direct a threat to us as Yemen and Pakistan.\n\nAMANPOUR: U.S. national interests?\n\nWOLFOWITZ: I think, if Gadhafi were to survive, it would be very much against American interest, very seriously so.\n\nWRIGHT: We were within 24 hours probably of losing Benghazi, which would have been losing Libya. So you have to ask yourself, how important is Libya to the broader scheme of things? And it had become the new model. After peaceful transitions in Egypt and Tunisia, you began to see a new model in Libya and the use of force, and that's where it became dangerous.\n\nAMANPOUR: So within 24 hours, was it a desperation move, then?\n\nWRIGHT: I think that we were very close to the point of not being able to intervene at all, because it would have become Gadhafi's baby -- his country again.\n\nAMANPOUR: Well, certainly everybody is going to be watching this and keeping a very close eye. Thank you all very much, indeed.\n\nAnd when we return, the other story making global headlines this week, the disaster in the Pacific. The nuclear crisis in Japan raises a disturbing question: What if it happened here? Could it? Is the United States prepared to respond to a full-scale nuclear meltdown? I'll ask the man who coordinated the federal response to a host of national disasters, former Homeland Security Chief Michael Chertoff. He'll join me. And so will Bill Richardson, who's grappled with issues of nuclear safety as diplomat, energy secretary, and governor of New Mexico. I'll ask them whether the U.S. should be ready for a possible terrorist attack sponsored by Moammar Gadhafi.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: In Japan today, workers at the Fukushima nuclear power plant are struggling to contain radiation, as fears of contamination spread across the country. Officials abandoned a plan to release more radioactive gasses into the air to relieve pressure at the crippled reactor. And the government announced the plant itself would be scrapped once the emergency is resolved.\n\nAnd this troubling news: Higher than normal levels of radiation has been found in spinach and milk. That's been detected from farms about 90 miles from the reactor.\n\nThe harrowing images we've seen day after day have many Americans asking one question: Could it happen here?\n\nThere are 104 nuclear reactors scattered around the country in some 31 states. At least a dozen are in areas at moderate to high risk of an earthquake. So what happens if a natural disaster sets off a catastrophic domino effect here in America? Is the government prepared to respond?\n\nJoining me now to answer that question, Michael Chertoff, who served as secretary of homeland security in the Bush administration, and he's also chairman of the Chertoff Group. And with us, Bill Richardson, who wears many hats. He was Bill Clinton's energy secretary and ambassador to the United Nations and most recently served as governor of New Mexico.\n\nGentlemen, thank you very much, indeed, for joining us.\n\nJust before we get to the crucial issue of Japan and nuclear energy, let me ask you regarding Gadhafi's threats and the possibility of terrorism. Your job was to protect the homeland here. Do you think there's an increased risk now with this military activity over Libya?\n\nCHERTOFF: I think you have to assume there's an increased risk in the sense that Gadhafi is a proven terrorist, and it's wise to assume that he's got the intent at some point to do something to retaliate.\n\nBut I think his capability has been much degraded. For one thing, we have raised the level of our protection and our security over the years. I think his capability in the U.S. is not that great. If this operates today as it did when I was in office, we already have unfolded a plan to track all of his operatives in the United States and to make sure they're not in a position to do something. So...\n\nAMANPOUR: So you're really prepared here for that?\n\nCHERTOFF: I think we are prepared for this, but, again, the important thing is to continue to watch him not only here in the U.S., but look at American interests overseas, including people who are traveling or people who may be living overseas, as well.\n\nAMANPOUR: I mean, his son said, no, that's not our target, when I asked him about retaliation. I mean...\n\nCHERTOFF: Well, you know, he's like a cornered rat. And a cornered rat will do whatever it has to do in order to defend itself or to strike back. So while right now my suspicion is they have their hands full, it's certainly something -- it's prudent to consider that he may seek to divert attention or even to push back by striking someplace else.\n\nBut, again, his capability now is not what it was 10 years ago. And more importantly, we've got a much more robust security apparatus.\n\nAMANPOUR: And, Governor Richardson, do you think that the U.S. is more at risk?\n\nRICHARDSON: Well, I don't want to be an alarmist. And I agree with what the secretary said. But he's a very unpredictable -- he's almost a wild man right now. He's cornered. My concern is, does he have any chemical weapons? I am concerned about these mustard gas reports.\n\nAMANPOUR: We asked Admiral Mullen about that.\n\nRICHARDSON: No, I know what he said, but my concern is, there are some allegations that he was directly responsible for Lockerbie. My concern is, Americans in the Mediterranean flying I think should be extra cautious.\n\nI don't want to be an alarmist, but when a man is cornered who is desperate, who wants to cling on to power, who sees his base narrowing, who is attacked, could be capable, as he has in the past, very horrendous things.\n\nAMANPOUR: Let's turn to the other major, major story, this potential cataclysmic meltdown. Is there -- is the United States totally prepared to handle something like that? Could that happen here?\n\nCHERTOFF: Well, let's -- let's define what we mean by handle. If you had a -- an earthquake that resulted in serious damage, devastating damage to a nuclear power plant -- and I'm saying that that would happen -- it would be a very ugly situation.\n\nThe critical issue would be to evacuate people in a timely fashion. Now, as part of the process of putting these plans in and as part of our general planning process, we have worked to develop evacuation plans. But make no mistake: They have to be drilled. They have to be exercised. And if that hasn't been done, it's going to become a challenge.\n\nAMANPOUR: Has it been done?\n\nCHERTOFF: Well, I think it varies. I mean, if you look at California, they tend to be very good about the process of preparation. Other states may not be quite as intense about it.\n\nThe thing to remember is this, though: No matter how good you are, it's going to be very difficult. And the way to minimize the difficulty is to have people be self-reliant, to have them well prepared, to make sure they're educated so they can take their own actions to get out of the way if, in fact, it looks like we're going to have a problem.\n\nAMANPOUR: And, Governor, you were governor of New Mexico when Secretary Chertoff was in office. To your mind, is the federal government prepared if it happened somewhere near your state?\n\nRICHARDSON: Well, I can tell you that states generally are not prepared. And so we rely on the federal government. And -- and I believe the secretary's right. The federal government has to lead.\n\nI think the big message here is -- from -- from the Japanese crisis is that we're looking at what happened in the oil spill, what happened with the mining disaster in West Virginia, the pipeline explosion. We have to look at the safety, cost, environmental risks of all our energy production. And I think the message with the nuclear reactors in Japan is that we should look at all our 104 reactors in the United States for their safety and preparedness within NRC.\n\nAMANPOUR: And when you were governor -- you were saying the states aren't prepared -- but did you believe that the federal government was prepared?\n\nRICHARDSON: Well, I think this tragedy in Japan indicates that we need to be better prepared, that...\n\nAMANPOUR: So is that a yes or a no?\n\nCHERTOFF: Well, I think -- I think, again, Christiane, you have to have a realistic expectation. I think the federal government is -- has a general plan for catastrophic incidents. I think there are capabilities that could be deployed.\n\nBut recognizing, the initial hours after any kind of catastrophe, the government is not going to rescue everybody. That's not possible. And part of what I used to say and what Secretary Napolitano is saying is, preparation begins at the home and at the business level.\n\nAnd that means, if you're in an area which is earthquake-prone, you've got to have a plan in place to evacuate if necessary, or you've got to know how to shelter yourself. Now, there's going to be a big exercise in May, in the central part of the country, the New Madrid earthquake fault, which we put in process several years ago. And that's a great opportunity for communities to take a -- a second look at their plans and make sure they're really serious and well-prepared.\n\nAMANPOUR: So what scares you most as a former governor and having to rely on the federal government for this kind of rescue?\n\nRICHARDSON: Well, first of all, we need to have evacuation plans. I don't think we have adequate ones around the country.\n\nSecondly, we have to look at licensing of new nuclear power plants. The president wants to proceed with 20 in the next decade. We want to have loan guarantees. But I think we have to have a timeout on nuclear power.\n\nAMANPOUR: So is that -- a timeout?\n\nRICHARDSON: A timeout, not -- not a moratorium, a timeout, review the safety and cost of all these plants, with the new licensing plants. Let's look at those that are being proposed in earthquake- prone areas. Let's look at those that are in seismic -- where there's intensive seismic material.\n\nAnd then, lastly, look at the ones -- and there's about a third of our nuclear plants that have some of this Japanese technology that obviously has not worked. And I think internationally we have to have some leadership in the whole range of the coolants in these reactors, the spent fuel. We have to look at ways that the international community, the international atomic energy commission looks at ways that there can be standardized safety procedures.\n\nAMANPOUR: Do you think there needs to be a timeout?\n\nCHERTOFF: Well, I -- I agree with Bill, we need to obviously look at the lessons learned from what's happened in Japan. But what I would caution against is overreacting, even to this catastrophic event.\n\nYou know, we had a problem with BP in the gulf, and the reaction was, we can't drill in the gulf. We have problems with other forms of energy, and people say, well, we shouldn't do that.\n\nWell, you know, at the end of the day, if we don't use coal, oil, natural gas, or nuclear, we're going to be sitting around the fire trying to warm ourselves like we did eons ago.\n\nSo we're going to have to manage risk. That doesn't mean guaranteeing against any -- it means having in place ways to mitigate problems. And that's where I think the lessons of Japan can be very, very helpful.\n\nRICHARDSON: And I think the lesson, also, for America is, we have to look at renewable energy, natural gas, clean sources, but reassess our entire safety procedures when it comes to our fossil fuels. When it -- look what happened in -- in the gulf. Look what happened in these mining disasters. A new conversation about safety, cost, and environmental risk of our energy production.\n\nAMANPOUR: A new conversation, indeed. Thank you both very much for joining us. Secretary Chertoff, Governor Richardson, thank you for coming in.\n\nAnd we'll have a final thought when we come back. Stay with us.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: A week ago, I was in Japan. This program was broadcast out of there after we were covering the aftermath of the terrible earthquake and tsunami. And with me, a team of ABC correspondents, reporting on all the aspects of the unfolding tragedy, including the nuclear accident.\n\nWhen we returned to the United States, we gathered to discuss the stories that we all didn't get a chance to report on the air. And you can find that conversation at abcnews.com, where you can always get the latest developments on Japan and Libya. And, of course, \"World News with David Muir\" will have a full wrap of the day's events. And ABC will have all the news across all the platforms.\n\nThank you for watching \"This Week,\" and I'll see you again next Sunday.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "http://abcnews.go.com/ThisWeek/week-transcript-target-libya/null"], "top_img": "http://abcnews.go.com/ThisWeek/week-transcript-target-libya/null", "keywords": [], "authors": ["Abc News", "March", "Min Read"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623", "title": "'This Week' Transcript: Target Libya", "meta_data": {"description": "Transcript of 'This Week' special, Target Libya", "keywords": "this week, christiane amanpour, libya, mullen", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Target Libya", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623", "title": "'This Week' Transcript: Target Libya", "description": "Transcript of 'This Week' special, Target Libya", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2011-03-27T18:08:13Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,13178623", "ipad": "abcnewsipad://link/story,13178623", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Target Libya", "description": "Transcript of 'This Week' special, Target Libya", "url": "https://abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,13178623", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,13178623", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-target-libya/story?id=13178623"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}