{"url": "http://time.com/money/5084724/golden-globes-2018-live-free/", "text": "The 75th Golden Globe awards kick off on Sunday, Jan. 7, honoring the makers behind our favorite television shows and movies of the last year.\n\nLate Night‘s Seth Meyers will host the event, joining a roster of presenters that has previously included Jimmy Fallon, Tina Fey, Amy Poehler and Ricky Gervais.\n\nUp for multiple awards are Guillermo del Toro’s The Shape of Water, Greta Gerwig’s Lady Bird and, on the TV side, Feud: Bette and Joan, This Is Us and The Handmaid’s Tale.\n\nHere’s a guide to how you can watch the 2018 Golden Globes, starting at 8 p.m. EST (5 p.m. PST) on NBC, including free streaming options.\n\nNBC or NBC.com\n\nTo watch the 2018 Golden Globes live, tune in to NBC or use a cable log-in to sign in to NBC.com or the NBC app, where for the first time you can livestream the show held at the Beverly Hilton Hotel in California.\n\nStreaming services and devices\n\nCord-cutters who still want to watch the Golden Globes live, whether it’s for the acceptance speeches or gags, can catch the awards ceremony through several streaming services and devices, including Sling TV, Hulu Live TV, DirecTV Now, YouTube TV, Century Link Stream and Fubo TV in markets where local channels like NBC are offered.\n\nCustomers who subscribe to Sling Blue can access NBC in Chicago, Boston, New York, San Francisco-Oakland, San Jose, Los Angeles, Philadelphia, Dallas-Fort Worth, Washington D.C., Miami-Fort Lauderdale, San Diego and Hartford-New Haven, according to a spokesperson for the service.\n\nSling TV first-timers can try a 7-day free trial of the streaming service.\n\nIndoor antenna\n\nIf streaming services or cable log-ins don’t work, an indoor antenna is a good alternative to watch the 2018 Golden Globes live. Most antennas should pick up NBC since it is a broadcast network.\n\nFailing the three options above, the best course of action would be to live-stream the red carpet coverage, which will broadcast on Facebook from 6 to 8 p.m. EST. Or, you can forget about the awards entirely, and catch up on this year’s Golden Globes nominees instead.", "images": ["https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2018/01/golden-globes-streaming.jpg?quality=85", "http://time.com/img/navigation/subscribe-icon.svg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/01/golden-globes-streaming.jpg?quality=85", "keywords": [], "authors": ["Mahita Gajanan"], "canonical_link": "https://money.com/golden-globes-2018-live-free/", "title": "How to Watch the 2018 Golden Globes for Free", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "onetime,Television", "news_keywords": "golden globe awards, 75th golden globe awards, golden globes 2018, golden globes 2018 live, how to watch golden globes 2018, golden globes 2018 livestream, what time do the golden globes start, channel for golden globes, golden globes 2018 watch online, golden globes live", "description": "Want to watch the 2018 Golden Globe awards, hosted by Seth Meyers, but don't have cable? Here's how to watch online for free", "og": {"title": "How to Watch the 2018 Golden Globes for Free", "type": "article", "site_name": "Money", "url": "https://money.com/golden-globes-2018-live-free/", "description": "Seth Meyers is hosting", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/01/golden-globes-streaming.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/golden-globes-2018-live-free/", "description": "Want to watch the 2018 Golden Globe awards, hosted by Seth Meyers, but don't have cable? Here's how to watch online for free", "media": "https://moneydotcomvip.files.wordpress.com/2018/01/golden-globes-streaming.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/golden-globes-2018-live-free/", "title": "How to Watch the 2018 Golden Globes for Free", "description": "Seth Meyers is hosting", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/01/golden-globes-streaming.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}