{"url": "https://www.vibe.com/2018/04/cardi-b-sister-reveal-baby-gender", "text": "Singer Ceybil Jefferies who found success in genres like house music and R&B in the 1990s with hits like \"So Special\" and \"Old Times Sake,\" has passed away after being diagnosed with coronavirus.\n\nBorn Sybil Jefferies, the Brooklyn native's death was confirmed by friends on social media and renowned producer Salaam Remi on Friday (April 10). Jefferies was signed to Atlantic Records in the 90s and made a name for herself as a powerful vocalist in house music with the release of her debut album Let Music Take Control in 1991. Her breakout single \"So Special\" was a bonafide hit as well as \"Open Your Heart\" which landed in the Top 20 of Billboard's Dance Clubs Chart the same year.\n\nReinvention was something Jefferies engaged frequently as she changed her stage name several times. In an effort not to be confused with other vocalists like \"Don't Make Me Over\" singer Sybil, Jefferies toyed with her stage name and released singles from her album under monikers like Ceybil, Sybil Jefferies (her government name) and Ceybil Jeffries (without the second \"e\").\n\nAfter the release of \"Open Your Heart,\" Jefferies parted with Atlantic in 1993 and signed a deal with Scotti Brothers label as Sable Jefferies. Her first single \"Friends (For Old Time Sake)\" was largely removed from her house roots and planted in New Jack Swing.\n\nAs a fan page pointed out, her image also changed with the times as she sported a more laid back tomboy aura made popular by artists like Xscape, TLC and the late singer Aaliyah. It also seemed to work in her favor. \"Friends (For Old Time Sake)\" was renamed \"Old Times' Sake\" and placed on the Above The Rim soundtrack in 1994. Her new moniker Sweet Sable was also introduced to the masses.\n\n\"Old Times' Sake\" reached No. 15 on the Billboard R&B Charts and also found success on the Billboard's Bubbling Under Hot 100 Chart at No. 2 after Doug E. Fresh's \"Freaks.\"\n\nWhile working with both Street Life Records and Scotti Brothers, she released the album, Old Times Sake with other supporting singles like \"Tonight\" and \"Love Thang\"–both charting on the Billboard R&B charts. \"Love Thang\" was also a hit on the defunct Hot Dance Breakdowns Chart beating Usher's \"Think Of You\" for the top spot. Her new music was an early indicator of R&B's perfect marriage with hip-hop and would go on to inspire the format of R&B artists collaborating with hip-hop acts to this day. She would also work alongside future icons like the late Guru and MC Lyte.\n\nShe didn't completely abandon her house days as she teamed up with Dutch artists Deep House Zone for \"It's Gonna Be Alright\" under her old moniker Ceybil Jefferies. The 1996 track brought her back to the Hot Dance Play chart at No. 20.\n\nRefusing to keep herself in a box, Jefferies released two versions of \"I'll Never Go Back,\" in 1996. One was a sultry R&B slow jam and the other, a harmonious ballad. Sadly, her third album Love On My Mind was shelved.\n\nJefferies continued to release music into the 2000s but her health began to decline. She was diagnosed with neurosarcoidosis, an inflammatory disease that affects multiple organs in the body, but mostly the lungs making it difficult to breathe. Jefferies also lost her vision to the disease.\n\nIn an unearthed video from Video Music Box in August 2012, her family held a fundraiser to help with medical bills but also to celebrate her music. At the event, Jefferies sang to fans, inspiring others and her family. \"Her vision might be gone, but her spirits are so high,\" her sister Angie told Video Music Box.\n\n\"She always has an encouraging word to say to somebody and our mother raised us that way. It's not over till it's over. We believe that God is the greatest power and we will not be defeated by anything that happens in our life.\"\n\nWhile her career was short, Sweet Sable left an impact on house and R&B music with her standout vocals and versatility.\n\nSee tributes to the singer below.\n\nView this post on Instagram\n\nRestInPeaceTo.SweetSable... ThisWasTheJam!! We are losing so many people daily right now. Pls #StayYoAssInTheHouse\n\nA post shared by SaLaAMReMi (@salaamremi) on Apr 11, 2020 at 10:01am PDT\n\nIn memory of Ceybil Jefferies aka Sweet Sable a true NYC Underground & New Jersey House Music Diva & Legend. Rest well mama. We love you & miss you Vidclip produced by Adrianne Ladybug Brown https://t.co/vVIUgtZgut\n\n— Underground For Life (@BlackUndergrnd) April 11, 2020\n\nRIP Sweet Sable\n\nThis rang off for many a summer https://t.co/VDDTLtkpIK\n\n— Children of Zeus (@ChildrenOfZeus) April 11, 2020\n\n#SweetSable Rest well. Your talent will live on in your music! You have to be a person of a certain age to know! #OldTimesSake #CeybilJefferies pic.twitter.com/cBMZrEPLfN\n\n— Ray D. (@crazeerayzee) April 11, 2020\n\nBrooklyn lost another precious gem yesterday. Rest in love Ceybil Jefferies aka Sweet Sable. Thank you for these two timeless jams. “Love So Special” in particular is a track I never stopped playing since its release… https://t.co/Q3Nr6UhaAo\n\n— THEREALDJSPINNA (@djspinna) April 11, 2020\n\nSad Sweet Sable Passed away the other day... Rest In Peace. Here’s an RnB Classic she did for the “Above the Rim” Soundtrackhttps://t.co/311yGrsrmI\n\n— Soothe&Groove (@SootheAndGroove) April 12, 2020\n\nRest In Peace Sweet Sable! pic.twitter.com/GTRbryBkXB\n\n— dai (@RadicalNightt_) April 12, 2020", "images": ["https://static.vibe.com/files/2018/04/cardi-b-explains-why-concealed-pregnancy-saturday-night-live-1523279632-640x4271-1523294614-compressed.jpg", "https://www.vibe.com/assets/images/logo/white.svg?0cd0b31e24683c892ef3", "https://static.vibe.com/files/2020/04/dr-dre-marvin-gaye-film-1529417603-768x432-1586443551-650x366.jpg", "https://static.vibe.com/files/2020/04/sid-tipton-look-both-ways-premiere-1-copy-1587154525-e1587154609881-240x135.jpg", "https://static.vibe.com/files/2020/04/GettyImages-519921395-1586800746-compressed.jpg", "https://static.vibe.com/files/2020/04/the-clark-sisters-lifetime-cast-viewers-1587065706-e1587066161772-300x169.jpg", "https://static.vibe.com/files/2020/04/pop-smoke-documentary-in-the-works-1-1587155425-240x135.jpg", "https://static.vibe.com/files/2020/04/kelly-rowland-coffee-music-video-1587167209-e1587167261519-240x135.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.vibe.com/files/2020/04/GettyImages-519921395-1586800746-327x480.jpg"], "top_img": "https://static.vibe.com/files/2018/04/cardi-b-explains-why-concealed-pregnancy-saturday-night-live-1523279632-640x4271-1523294614-compressed.jpg", "keywords": [], "authors": ["Sierra Brown"], "canonical_link": "https://www.vibe.com/2018/04/cardi-b-sister-reveal-baby-gender", "title": "Did Cardi B’s Sister Accidentally Give A Gender Reveal?", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-04-09T13:25:54-04:00", "published_time": "2018-04-09T13:25:54-04:00"}, "description": "Before deleting her Instagram post which identified the gender of Cardi B's baby, Hennessy", "og": {"description": "Before deleting her Instagram post which identified the gender of Cardi B's baby, Hennessy", "image": {"identifier": "https://static.vibe.com/files/2018/04/cardi-b-explains-why-concealed-pregnancy-saturday-night-live-1523279632-640x4271-1523294614-compressed.jpg", "height": 427, "width": 640}, "title": "Did Cardi B’s Sister Accidentally Give A Gender Reveal?", "type": "article", "url": "https://www.vibe.com/2018/04/cardi-b-sister-reveal-baby-gender", "site_name": "Vibe"}, "twitter": {"card": "summary", "description": "Before deleting her Instagram post which identified the gender of Cardi B's baby, Hennessy", "image": "https://static.vibe.com/files/2018/04/cardi-b-explains-why-concealed-pregnancy-saturday-night-live-1523279632-640x4271-1523294614-compressed.jpg", "title": "Did Cardi B’s Sister Accidentally Give A Gender Reveal?", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1523294754.0, "source": "https://www.vibe.com", "summary": ""}