{"url": "https://en.wikipedia.org/wiki/Ellen_DeGeneres", "text": "American comedian, television host, actress, and producer\n\nEllen Lee DeGeneres ( də-JEN-ər-əs; born January 26, 1958)[2] is an American comedian, television host, actress, writer, and producer. She starred in the sitcom Ellen from 1994 to 1998 and has hosted her syndicated TV talk show, The Ellen DeGeneres Show, since 2003.\n\nHer stand-up career started in the early 1980s and included a 1986 appearance on The Tonight Show Starring Johnny Carson. As a film actress, DeGeneres starred in Mr. Wrong (1996), EDtv (1999), and The Love Letter (1999), and provided the voice of Dory in the Pixar animated films Finding Nemo (2003) and Finding Dory (2016); for Nemo, she was awarded the Saturn Award for Best Supporting Actress, the first time an actress won a Saturn Award for a voice performance. In 2010, she was a judge on American Idol for its ninth season.\n\nShe starred in two television sitcoms, Ellen from 1994 to 1998 and The Ellen Show from 2001 to 2002. During the fourth season of Ellen in 1997, she came out as a lesbian in an appearance on The Oprah Winfrey Show. Her character, Ellen Morgan, also came out to a therapist played by Winfrey, and the series went on to explore various LGBT issues, including the coming-out process. In 2008, she married her longtime girlfriend Portia de Rossi.\n\nDeGeneres has hosted the Academy Awards, Grammy Awards, and the Primetime Emmys. She has authored four books and started her own record company, Eleveneleven, as well as a production company, A Very Good Production. She also launched a lifestyle brand, ED Ellen DeGeneres, which comprises a collection of apparel, accessories, home, baby, and pet items.[3] She has won 30 Emmys, 20 People's Choice Awards (more than any other person),[4] and numerous other awards for her work and charitable efforts. In 2016, she received the Presidential Medal of Freedom.[5] On January 5, 2020, DeGeneres won the Golden Globes Carol Burnett Lifetime Achievement Award.[6]\n\nEarly life and education\n\nDeGeneres was born and raised in Metairie, Louisiana, to Elizabeth Jane (née Pfeffer, born 1930), a speech therapist, and Elliott Everett DeGeneres (1925–2018), an insurance agent.[7][2][8] She has one brother, Vance, a musician and producer. She is of French, English, German, and Irish descent. She was raised as a Christian Scientist.[9] In 1973, her parents filed for separation and were divorced the following year.[9] Shortly after, Ellen's mother married Roy Gruessendorf, a salesman. Betty Jane and Ellen moved with Gruessendorf from the New Orleans area to Atlanta, Texas. Vance stayed with his father.\n\nWhen she was 15 or 16 years old, she was molested by her stepfather.[10] DeGeneres graduated from Atlanta High School in May 1976, after completing her first years of high school at Grace King High School in Metairie, Louisiana. She moved back to New Orleans to attend the University of New Orleans, where she majored in communication studies. After one semester, she left school to do clerical work in a law firm with a cousin, Laura Gillen. Her early jobs included working at J. C. Penney,[11] and being a waitress at TGI Fridays and another restaurant, a house painter, a hostess, and a bartender. She relates much of her childhood and career experiences in her comedic work.\n\nStand-up comedy\n\nDeGeneres started performing stand-up comedy at small clubs and coffee houses. By 1981, she was the emcee at Clyde's Comedy Club in New Orleans. DeGeneres cites Woody Allen and Steve Martin as her main influences at this time.[12] In the early 1980s she began to tour nationally, and in 1984 she was named Showtime's funniest person in America.[13]\n\nIn 2018, DeGeneres appeared in a new stand up special, Relatable, for Netflix after 15 years not performing stand-up comedy.[14][15]\n\nFilm career\n\nEllen's work in the late 1980s and early 1990s included the film Coneheads. DeGeneres starred in a series of films for a show named Ellen's Energy Adventure, which is part of the Universe of Energy attraction and pavilion at Walt Disney World's Epcot. The film also featured Bill Nye, Alex Trebek, Michael Richards, and Jamie Lee Curtis. The show revolved around DeGeneres' falling asleep and finding herself in an energy-themed version of Jeopardy!, playing against an old rival, portrayed by Curtis, and Albert Einstein. The next film had DeGeneres co-hosting an educational look at energy with Nye. The ride first opened on September 15, 1996, as Ellen's Energy Crisis, but was quickly given the more positive-sounding name Ellen's Energy Adventure.\n\nTelevision career\n\nDeGeneres at the Governor's Ball after the 46th Annual Emmy Awards telecast, September 1994\n\nDeGeneres' first regular TV role was in a short-lived Fox sitcom called Open House. She played the role of Margo Van Meter, an office worker at the Juan Verde Real Estate company. The show co-starred Alison LaPlaca and Mary Page Keller. In 1992, producers Neal Marlens and Carol Black cast DeGeneres in their sitcom Laurie Hill, in the role of Nurse Nancy MacIntyre. The series was canceled after only four episodes, but Marlens and Black were so impressed with DeGeneres' performance that they soon cast her in their next ABC pilot, These Friends of Mine, which they co-created with David S. Rosenthal.\n\nDeGeneres at the Emmy Awards, September 1997\n\nDeGeneres' comedy career became the basis of the sitcom Ellen, named These Friends of Mine during its first season. The ABC show was popular in its first few seasons due in part to DeGeneres' style of observational humor; it was often referred to as a \"female Seinfeld.\"[16]\n\nEllen reached its height of popularity in April 1997, when DeGeneres came out as a lesbian on The Oprah Winfrey Show. Her character on the sitcom also came out of the closet to her therapist, played by Oprah Winfrey.[17] The coming-out episode, titled \"The Puppy Episode\", was one of the highest-rated episodes of the show. The series returned for a fifth season but experienced falling ratings due to ABC's cutting back on promoting the show.[citation needed] It was believed that The Walt Disney Company, ABC's parent owner, had become uncomfortable with the subject matter depicted on the show now that DeGeneres' character was openly gay.[citation needed] In May 1998, Ellen was canceled. DeGeneres returned to stand-up comedy and later re-established herself as a successful talk show host.\n\nDeGeneres returned to television in 2001 with a new CBS sitcom, The Ellen Show, which was cancelled after 13 episodes.\n\nIn September 2003, DeGeneres launched a daytime television talk show, The Ellen DeGeneres Show. One of several celebrity-hosted talk shows surfacing at the beginning of that season, including those of Sharon Osbourne and Rita Rudner, her show has consistently risen in the Nielsen ratings and received widespread critical praise. It was nominated for 11 Daytime Emmy Awards in its first season, winning four, including Best Talk Show. The show has won 25 Emmy Awards for its first three seasons on the air. DeGeneres is known for her dancing and singing with the audience at the beginning of the show and during commercial breaks. She often gives away free prizes and trips to be in her show's studio audience with the help of her sponsors.\n\nDeGeneres celebrated her thirty-year class reunion by flying her graduating class to California to be guests on her show in February 2006. She presented Atlanta High School with a surprise gift of a new electronic LED marquee sign. In May 2006, DeGeneres made a surprise appearance at the Tulane University commencement in New Orleans. Following George H. W. Bush and Bill Clinton to the podium, she came out in a bathrobe and furry slippers. \"They told me everyone would be wearing robes,\" she said. Ellen then went on to make another commencement speech at Tulane in 2009.[18]\n\nThe show broadcast for a week from Universal Studios Orlando in March 2007. Skits included DeGeneres going on the Hulk Roller Coaster Ride[19] and the Jaws Boat Ride.[20] In May 2007, DeGeneres was placed on bed rest due to a torn ligament in her back. She continued hosting her show from a hospital bed, tended to by a nurse, explaining \"the show must go on, as they say.\" Guests sat in hospital beds as well.[21] On May 1, 2009, DeGeneres celebrated her 1000th episode, featuring celebrity guests such as Oprah Winfrey, Justin Timberlake, and Paris Hilton, among others.[22] Jennifer Aniston and Justin Timberlake surprised DeGeneres on her 2,000th show in December 2015.[23]\n\nOn September 9, 2009, it was confirmed that DeGeneres would replace Paula Abdul as a judge of the ninth season of American Idol. Her role started after the contestant auditions, at the beginning of \"Hollywood Week\".[24][25] It is reported that DeGeneres also signed a contract to be a judge on the show for at least five seasons.[26] She made her American Idol debut on February 9, 2010. However, on July 29, 2010, DeGeneres and Fox executives announced that the comedian would be leaving American Idol after one season. In a statement, DeGeneres said that the series \"didn't feel like the right fit for me\".[27]\n\nStarting in the 2017-2018 television season DeGeneres began hosting the game show Ellen's Game of Games on NBC which is based, and expands on games played on her talk show. The series had a preview episode on December 18, 2017 with regular episodes beginning the following January.[28]\n\nAward shows\n\nDeGeneres received wide exposure on November 4, 2001, when she hosted the televised broadcast of the Emmy Awards. Presented after two cancellations due to network concerns that a lavish ceremony following the September 11 attacks would appear insensitive, the show required a more somber tone that would also allow viewers to temporarily forget the tragedy. DeGeneres received several standing ovations for her performance that evening, which included the line: \"What would bug the Taliban more than seeing a gay woman in a suit surrounded by Jews?\"[29]\n\nIn August 2005, DeGeneres hosted the 2005 Primetime Emmy Awards ceremony held on September 18, 2005. This was three weeks after Hurricane Katrina, making it the second time she hosted the Emmys following a national tragedy. She also hosted the Grammy Awards in 1996 and in 1997.\n\nOn September 7, 2006, DeGeneres was selected to host the 79th Academy Awards ceremony, which took place on February 25, 2007.[30] This makes her the first openly gay person to have hosted the event.[31] During the Awards show, DeGeneres said, \"What a wonderful night, such diversity in the room, in a year when there's been so many negative things said about people's race, religion, and sexual orientation. And I want to put this out there: If there weren't blacks, Jews and gays, there would be no Oscars, or anyone named Oscar, when you think about that.\"[32] Reviews of her hosting gig were positive, with one saying, \"DeGeneres rocked, as she never forgot that she wasn't just there to entertain the Oscar nominees but also to tickle the audience at home.\"[33] Regis Philbin said in an interview that \"the only complaint was there's not enough Ellen.\"\n\nDeGeneres was nominated for an Emmy Award as host of the Academy Awards broadcast.[34] On August 2, 2013, it was announced that DeGeneres would host the Academy Awards on March 2, 2014, for the second time.[35]\n\nA selfie orchestrated by 86th Academy Awards host Ellen DeGeneres during the broadcast is the second-most retweeted tweet ever.[36][37] DeGeneres said she wanted to homage Meryl Streep's record 17 Oscar nominations by setting a new record with her, and invited other Oscar celebrities to join them. The resulting photo of twelve celebrities broke the previous retweet record within forty minutes and was retweeted over 1.8 million times in the first hour.[38][39][40] By the end of the ceremony it had been retweeted over 2 million times, less than 24 hours later, it had been retweeted over 2.8 million times.[37][38] As of May 2017 , it has been retweeted over 3.4 million times.[37] The group selfie effort was parodied by Lego and Matt Groening with The Simpsons.[41][42] It beat the previous record, which was held by Barack Obama, following his victory in the 2012 presidential election.[40][43][44]\n\nOther ventures\n\nED Ellen DeGeneres\n\nEllen launched her lifestyle brand under the name ED by Ellen in the summer of 2015.[45] After her initial collections, the brand name then changed to ED Ellen DeGeneres to incorporate the licensed arm of her brand.[46] The collection includes apparel, shoes, accessories, pet, baby and home items. DeGeneres' dog collection at PetSmart was launched in February 2017,[47] and a cat line was introduced later that year.[48]\n\nIn November 2017, the brand launched a collection to benefit Ellen's #BeKindToElephants campaign featuring a tee and baby one piece, donating 100% of the proceeds to the David Sheldrick Wildlife Trust.[49] Then, DeGeneres created a line with her brand to benefit the newly created Ellen DeGeneres Wildlife Fund,[50] a member of the Digit Fund, to launch a line of tees and footwear to help gorillas.[51]\n\nVoice acting\n\nDeGeneres lent her voice to the role of Dory, a friendly fish with short-term memory loss, in the 2003 animated Disney/Pixar film Finding Nemo.[52] The film's director, Andrew Stanton, said that he chose Ellen because she changed the subject five times before one sentence had finished on her show.[53] For her performance as Dory, DeGeneres won the Saturn Award from the Academy of Science Fiction, Fantasy & Horror Films for Best Supporting Actress; Favorite Voice from an Animated Movie from the Nickelodeon Kids' Choice Awards; and the Annie Award from the International Animated Film Association, for Outstanding Voice Acting. She was also nominated for a Chicago Film Critics Association Award in the Best Supporting Actress category. She also provided the voice of the dog in the prologue of the Eddie Murphy feature film Dr. Dolittle. Her win of the Saturn Award marked the first and only time the Academy of Science Fiction, Fantasy & Horror Films has given the acting award for a voice performance.\n\nShe reprised the role of Dory from Finding Nemo in the 2016 sequel, Finding Dory.\n\nCommercial spokesperson\n\nIn November 2004, DeGeneres appeared, dancing, in an ad campaign for American Express. Her most recent American Express commercial, a two-minute black-and-white spot in which she works with animals, debuted in November 2006 and was created by Ogilvy & Mather. In 2007, the commercial won the Emmy Award for Outstanding Commercial.\n\nDeGeneres began working with CoverGirl Cosmetics in September 2008, for which she has been criticized, as her animal-friendly values clash with Procter and Gamble's (the maker of CoverGirl Cosmetics) animal testing.[54] Her face became the focus of CoverGirl advertisements starting in January 2009. The beauty campaign was DeGeneres' first.[55]\n\nOn December 3, 2011, DeGeneres headlined the third annual \"Change Begins Within\" gala for the David Lynch Foundation held at the Los Angeles County Museum of Art.[56][57]\n\nIn spring 2012, DeGeneres became the spokesperson for J. C. Penney in a tour and advertising campaign.[11]\n\nDeGeneres represents a line of products on QVC, a home shopping network. Her line of home products, initialized as E.D., for Ellen DeGeneres, began being offered on QVC on October 24, 2014, under the name E.D. on Air.[58]\n\nOn September 4, 2018, TCL, announced its extension as the Official TV of The Ellen DeGeneres Show for a fifth consecutive season.[59]\n\nOn August 15, 2018, it was announced that DeGeneres would partner with Walmart to launch a fashion collection under the brand name EV1, a low-cost alternative to her ED Ellen DeGeneres product.[60] The collection officially launched on September 10, 2018 with price points under $30.[61]\n\nEleveneleven\n\nOn May 26, 2010, DeGeneres announced on her show that she was starting her own record label entitled \"eleveneleven\". She explained her choice of name, claiming that she often sees the number 11:11 when looking at her clocks, that she found Greyson on the 11th, and that the singer's soccer jersey has the number 11.[62] She mentioned that she had been looking for videos of performances on YouTube to start her label. The first act she signed to the label is Greyson Chance.[63]\n\nInfluences\n\nDeGeneres lists among her comedic influences Woody Allen, Lucille Ball, Carol Burnett, Steve Martin, and Bob Newhart.[64]\n\nPersonal life\n\nForbes estimated DeGeneres' 2018 earnings at US$87.5 million,[65] making her the 15th highest-paid entertainer in the world.[66] In 2015, she was named the 50th most powerful woman in the world by Forbes[67] and number two on the World Pride Power list.[68] As of August 2, 2018, DeGeneres has more than 76 million followers on Twitter and 55.8 million followers on Instagram, making her the seventh most followed user on Twitter and the 28th most followed user on Instagram.\n\nShe is a fan of the National Football League and has shown particular support for the New Orleans Saints and the Green Bay Packers.[69][70] In 2011, she attended a Saints practice dressed as Packers Hall of Famer Don Hutson.[71]\n\nIn October 2019, DeGeneres attended an NFL game between the Green Bay Packers and the Dallas Cowboys at the invitation of Cowboys owner Jerry Jones. While at the game, she was seated next to former American president George W. Bush.[72] Her apparently friendly interactions with Bush, captured by stadium cameras, attracted criticism due to his and his administration's opposition to same-sex marriage and his responsibility for the War in Iraq and the associated torture and civilian deaths.[73][74] In response to the criticism, DeGeneres explained her friendship with Bush in a monologue on her show.[75] During the segment, DeGeneres indicated she believes that personal relationships should transcend political differences, comparing her friendship with Bush to her friendship with individuals who wear fur, a practice she does not condone.[76] A version of the monologue, altered to include images depicting victims of American torture and civilians displaced by the War in Iraq behind DeGeneres, was later distributed over social media.[77]\n\nSexual orientation and relationships\n\nPortia de Rossi and DeGeneres in September 2012\n\nIn 1997, DeGeneres came out as lesbian. The disclosure of her sexual orientation sparked intense interest by American tabloids.[78] The contentiousness of the media coverage stunted DeGeneres' professional career and left her \"mired in depression\".[78][79] In her book Love, Ellen, DeGeneres' mother, Betty DeGeneres describes being initially shocked when her daughter came out, but she has since become one of her strongest supporters; she is also an active member of Parents & Friends of Lesbians and Gays (PFLAG) and spokesperson for the Human Rights Campaign's Coming Out Project.\n\nThe same year she came out, DeGeneres started a romantic relationship with actress Anne Heche that lasted until August 2000.[80] From 2000 to 2004, DeGeneres maintained a close affair with actress/director/photographer Alexandra Hedison.[81] The couple appeared on the cover of The Advocate after their separation had already been announced to the media.[82]\n\nSince 2004, DeGeneres has had a relationship with Portia de Rossi.[83] After the overturn of the same-sex marriage ban in California, DeGeneres and de Rossi were engaged, and married in August 2008, at their home in Beverly Hills, California, where they live with their four dogs and three cats.[84][85] The passage of Proposition 8 cast doubt on the legal status of their marriage, but a subsequent California Supreme Court judgment validated it because it occurred before November 4, 2008.[86][87][88] On August 6, 2010, de Rossi filed a petition to legally change her name to Portia Lee James DeGeneres.[89] The petition was granted on September 23, 2010.[90]\n\nAnimal rights and veganism\n\nEllen previously described herself as a vegan and \"big animal lover\".[91][92] De Rossi, too, is a vegan.[92] Ellen co-ordinated a vegan outreach website titled 'Going Vegan with Ellen'.[93] She intended to open a vegan tapas bar, Bokado, in Los Angeles, but plans fell through.[94]\n\nThe site for The Ellen DeGeneres Show contains a section called \"Going Vegan With Ellen\", in which she promotes \"Meatless Mondays\" and features vegan recipes.[95] She has several times invited Humane Society of the United States CEO Wayne Pacelle to speak on her show about the organization's efforts in animal protection legislation. In 2009, PETA named her their \"Woman of the Year.\"[96] In April 2013, she donated $25,000 to stop Ag-Gag anti-whistleblower legislation in Tennessee, which would prohibit undercover investigators from recording footage of animal abuse on farms.[97] In 2019, DeGeneres served as campaign ambassador to Farm Sanctuary's Adopt-A-Turkey Project in 2010, asking people to start \"a new tradition by adopting a turkey instead of eating one\" at Thanksgiving.[98]\n\nEllen has always had a place in her heart for the endangered gorillas. Her wife, Portia De Rossi, surprised her on her own talk show with a gift called The Ellen Fund. The Ellen Fund was a campus back where the gorillas were located to help out these animals since she is inspired my Dian Fossey's work.\n\nHumanitarianism\n\nIn November 2011, Secretary of State Hillary Clinton named her a special envoy for Global AIDS Awareness.[99] On December 3, 2011, DeGeneres opened the show at the David Lynch Foundation's 3rd annual \"Change Begins Within\" gala at the Los Angeles County Museum of Art to raise funds to bring Transcendental Meditation to at-risk populations suffering from epidemic levels of chronic stress and stress-related disorders. She says: \"TM is the only time I have that stillness… it gives me this peaceful feeling, and I love it so much. I can't say enough good things about it. All the benefits that you can achieve from sitting still and going within—it really is a beautiful experience. David Lynch is such a wonderful man to start this foundation to help people.\"[100][101]\n\nIn November 2017, it was announced that President Donald Trump would begin allowing the importation of elephant trophies from Africa. DeGeneres, an animal activist, created a hashtag campaign in partnership with her brand, ED Ellen DeGeneres, to donate to the David Sheldrick Wildlife Trust. DeGeneres also created a T-shirt with her brand whose proceeds also go to the organization.[102]\n\nIn January 2018, for Ellen's 60th birthday, Ellen's wife, Portia de Rossi, gifted Ellen a permanent gorilla home in Rwanda built in her namesake for the Digit Fund.[103] This gift was part of a new arm of the Digit Fund now called the \"Ellen DeGeneres Wildlife Fund.\"[104]\n\nFilmography\n\nFilm\n\nTelevision\n\nAs executive producer\n\nVideo games\n\nYear Title Role Notes 1996 9: The Last Resort The Octopus Lady Voice 2003 Finding Nemo Dory 2013 Heads Up! Herself 2016 Disney Infinity 3.0 Dory\n\nMusic videos\n\nDiscography\n\nAlbums\n\nYear Title Formats 1996 Taste This Enhanced CD/Download\n\nAudiobooks\n\nYear Title Formats 2003 The Funny Thing Is... CD/Download 2011 Seriously...I'm Kidding CD/Download\n\nPodcasts\n\nYear Title Formats 2017 Making Gay History Podcast episode; audio recording from 2001\n\nAwards and honors\n\nBibliography", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/EllenDeGeneres1997Emmies.jpg/220px-EllenDeGeneres1997Emmies.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Ellen_DeGeneres_2011.jpg/220px-Ellen_DeGeneres_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Ellen_DeGeneres_2.jpg/220px-Ellen_DeGeneres_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Flag_of_California.svg/24px-Flag_of_California.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/21px-SMirC-laugh.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Ellen_DeGeneres_%282004%29.jpg/220px-Ellen_DeGeneres_%282004%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Ellen_DeGeneres_Signature.svg/128px-Ellen_DeGeneres_Signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/b/b8/Ellen_DeGeneres_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/PortiadeRossiEllenDeGeneresHWOFSept2012.jpg/220px-PortiadeRossiEllenDeGeneresHWOFSept2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Books-aj.svg_aj_ashton_01.svg/24px-Books-aj.svg_aj_ashton_01.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Ellen_DeGeneres_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ellen_DeGeneres", "title": "Ellen DeGeneres", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Ellen_DeGeneres_2011.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}