{"url": "https://www.etonline.com/matt-damon-says-he-and-ben-affleck-knew-about-harvey-weinstein-allegedly-sexually-harassing-gwyneth", "text": "Matt Damon says that while working with Harvey Weinstein on several films, he found the Hollywood movie mogul to be both a \"bully\" and a \"womanizer.\"\n\nWhile the 47-year-old actor has claimed that he was unaware of the accusations of sexual assault and harassment against Weinstein by numerous women, he had heard about his alleged indecent behavior toward Gwyneth Paltrow.\n\nPaltrow dated Damon's best friend, Ben Affleck, after the alleged incident occurred and also co-starred with Damon in the 1999 movie The Talented Mr. Ripley, which Weinstein produced.\n\n\"I knew the story about Gwyneth from Ben because he was with her after Brad [Pitt],\" Damon confessed during an interview with Good Morning America's Michael Strahan, which aired on Monday. \"But I was working with Gwyneth and Harvey on Ripley.\"\n\n\"He didn't do it out in the open.\" - Matt Damon on Harvey Weinstein: https://t.co/fBSMwurc1Apic.twitter.com/oj1xEPTapz — Good Morning America (@GMA) October 23, 2017\n\nDamon says he never \"talked to Gwyneth\" about the alleged encounter with Weinstein. \"Ben told me, but I knew that they had come to whatever agreement or understanding they had come to,\" he explained. \"She had handled it and she was the first lady of Miramax and he treated her incredibly respectfully always.\"\n\nMORE: Matt Damon Denies Trying to Kill 2004 Story on Harvey Weinstein, Says He Never Witnessed Alleged Harassment\n\nWeinstein was instrumental in jump-starting Damon's career when his company at the time, Miramax, distributed his and Affleck's movie, Good Will Hunting, which earned them both Oscars.\n\n\"I was there at the height of his power and what you knew back then, you had to spend about five minutes with him to know he was a bully, he was intimidating -- that was his legend,\" Damon recalled. \"So when people say everybody knew, yeah I knew, I knew he was an a**hole. He was proud of that.\"\n\n\"I knew he was a womanizer. I wouldn't want to be married to the guy, but that's not my business really,\" he added. \"But this level of criminal sexual predation is not something that I ever thought was going on. Absolutely not.\"\n\nMORE: Ben Affleck Slams Harvey Weinstein Amid Sexual Harassment Allegations -- But Rose McGowan Claims He Knew\n\nIn an earlier interview with The Wrap, Damon further insisted that he had no idea of the sexual harassment and assault allegations against Weinstein.\n\n\"Everybody's saying we all knew. That's not true,\" he said. \"If there was ever an event that I was at and Harvey was doing this kind of thing and I didn’t see it, then I am so deeply sorry, because I would have stopped it.\"\n\nMORE: Here's Why Brad Pitt Worked With Harvey Weinstein After Alleged Incident With Then-Girlfriend Gwyneth Paltrow\n\nGeorge Clooney -- Damon's frequent co-star and director of his upcoming movie, Suburbicon -- also told ET that Weinstein had alluded to him that he was having affairs with women that weren't his wife.\n\n\"Harvey would talk about women that he'd, you know, gone out with,\" he said. \"I didn't really necessarily believe that ‘cause to believe that would believe bad things about actresses that I know and like, and I didn't really buy into that.\"\n\nThe 56-year-old actor said that it's his hope that all the women who have come forward about Weinstein's alleged despicable behavior will further spur others to tell their stories.\n\nMORE: Jennifer Lawrence, George Clooney and More Speak Out Against Harvey Weinstein's 'Indefensible' Actions\n\n“We have to make sure that now there has to be something good that’s gonna come out of all of this,\" he insisted. \"The thing that’s good that could come out of this is that women feel safer in talking about these situations, and in doing so, that it makes it much harder for men who would behave like this to do it, [knowing] that they'll get outed.\"\n\nCheck out more of ET's interview with Clooney, including him talking about his wife Amal's own experience with sexual harassment in the workplace:", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-961235858.jpg?h=fbc58516&itok=5b3I9AKf", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/damon_paltrow_123434089_0.jpg?h=aa7203f2&itok=9DX9aFHc", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2018-12/megyn_kelly_gettyimages-1053390462_1280.jpg?h=c673cd1c&itok=GkyEoz-G"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/damon_paltrow_123434089_0.jpg?h=aa7203f2&itok=9DX9aFHc", "keywords": [], "authors": ["Jackie Willis"], "canonical_link": "https://www.etonline.com/matt-damon-says-he-and-ben-affleck-knew-about-harvey-weinstein-allegedly-sexually-harassing-gwyneth", "title": "Matt Damon Says He and Ben Affleck Knew About Harvey Weinstein Allegedly Sexually Harassing Gwyneth Paltrow", "meta_data": {"article": {"opinion": "false"}, "title": "Matt Damon Says He and Ben Affleck Knew About Harvey Weinstein Allegedly Sexually Harassing Gwyneth Paltrow | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/matt-damon-says-he-and-ben-affleck-knew-about-harvey-weinstein-allegedly-sexually-harassing-gwyneth", "title": "Matt Damon Says He and Ben Affleck Knew About Harvey Weinstein Allegedly Sexually Harassing Gwyneth Paltrow", "description": "In an earlier statement, the 47-year-old actor claimed he was not aware of the movie mogul's alleged mistreatment of women.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/damon_paltrow_123434089_0.jpg?h=aa7203f2&itok=9DX9aFHc", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "In an earlier statement, the 47-year-old actor claimed he was not aware of the movie mogul's alleged mistreatment of women.", "title": "Matt Damon Says He and Ben Affleck Knew About Harvey Weinstein Allegedly Sexually Harassing Gwyneth Paltrow", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jackie Willis‍", "url": "https://www.etonline.com/matt-damon-says-he-and-ben-affleck-knew-about-harvey-weinstein-allegedly-sexually-harassing-gwyneth", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/damon_paltrow_123434089_0.jpg?h=aa7203f2&itok=9DX9aFHc"}, "description": "In an earlier statement, the 47-year-old actor claimed he was not aware of the movie mogul's alleged mistreatment of women.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Harvey Weinstein, Matt Damon, Gwyneth Paltrow, Ben Affleck", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}