{"url": "https://www.rollingstone.com/culture/culture-news/woody-allen-harvey-weinstein-thing-is-very-sad-for-everybody-125485/", "text": "UPDATE: Woody Allen has clarified his comments on Harvey Weinstein after originally stating, “”The whole Harvey Weinstein thing is very sad for everybody involved.” “When I said I felt sad for Harvey Weinstein, I thought it was clear the meaning was because he is a sad, sick man,” Allen said (Via Variety). “I was surprised it was treated differently. Lest there be any ambiguity, this statement clarifies my intention and feelings.”\n\nWoody Allen addressed the “very sad” Harvey Weinstein sexual assault scandal in a new interview where the filmmaker admitted that he was unaware of the severity of the claims against the producer.\n\n“No one ever came to me or told me horror stories with any real seriousness,” Allen told the BBC. “And they wouldn’t, because you are not interested in it. You are interested in making your movie. But you do hear a million fanciful rumors all the time. And some turn out to be true and some, many, are just stories about this actress or that actor.”\n\nThe director and the producer have a long business relationship: Allen-directed films like Mighty Aphrodite and Bullets Over Broadway were distributed through Weinstein’s Miramax, while The Weinstein Company co-produced Allen’s Vicki Christina Barcelona.\n\nMira Sorvino, who won a Best Supporting Actress Oscar for her role in Mighty Aphrodite, recently opened up about her own experience with Weinstein, an encounter that resulted in “many sleepless nights.”\n\n“The whole Harvey Weinstein thing is very sad for everybody involved,” Allen said. “Tragic for the poor women that were involved, sad for Harvey that [his] life is so messed up. There’s no winners in that, it’s just very, very sad and tragic for those poor women that had to go through that.”\n\nAllen, who has similarly faced allegations of sexual abuse – including accusations levied by his son Ronan Farrow, who penned the New Yorker‘s expose into Weinstein – also voiced concern that the aftermath of the Weinstein scandal would result in “a witch hunt atmosphere” in Hollywood and beyond.\n\n“You also don’t want it to lead to a witch hunt atmosphere, a Salem atmosphere, where every guy in an office who winks at a woman is suddenly having to call a lawyer to defend himself. That’s not right either,” Allen said. “But sure, you hope that something like this could be transformed into a benefit for people rather than just a sad or tragic situation.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-82178360-31046737-2289-490a-a452-7e5363ae9956.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Fwoody-allen-harvey-weinstein-thing-is-very-sad-for-everybody-125485%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=125485", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-82178360-31046737-2289-490a-a452-7e5363ae9956.jpg", "keywords": [], "authors": ["Daniel Kreps", "Daniel Kreps'S Most Recent Stories", "Apollonia Kotero Slams Sheila E. Over Prince Tribute", "Lemon Cake", "See Kesha S Intimate", "Resentment", "Performance On", "Fallon", "San Diego Comic-Con Canceled Due To The Coronavirus", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/woody-allen-harvey-weinstein-thing-is-very-sad-for-everybody-125485/", "title": "Woody Allen: ‘Harvey Weinstein Thing Is Very Sad for Everybody’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Woody Allen addressed the \"very sad\" Harvey Weinstein sexual assault scandal in a new interview.", "news_keywords": "Harvey Weinstein, sexual misconduct, Woody Allen", "og": {"type": "article", "title": "Woody Allen: 'Harvey Weinstein Thing Is Very Sad for Everybody'", "url": "https://www.rollingstone.com/culture/culture-news/woody-allen-harvey-weinstein-thing-is-very-sad-for-everybody-125485/", "description": "“You also don’t want it to lead to a witch hunt atmosphere,” director says of scandal’s aftermath", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-82178360-31046737-2289-490a-a452-7e5363ae9956.jpg", "width": 1024, "height": 808, "alt": "D"}, "locale": "en_US"}, "article": {"published_time": "2017-10-15T19:53:00+00:00", "modified_time": "2018-06-25T14:49:53+00:00"}, "twitter": {"text": {"title": "Woody Allen: 'Harvey Weinstein Thing Is Very Sad for Everybody'"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-82178360-31046737-2289-490a-a452-7e5363ae9956.jpg?w=1024", "alt": "D"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Woody Allen: ‘Harvey Weinstein Thing Is Very Sad for Everybody’", "description": "Woody Allen addressed the \"very sad\" Harvey Weinstein sexual assault scandal in a new interview."}, "generator": "WordPress 5.4", "author": "Daniel Kreps", "content_type": "Article", "post_id": 125485, "title": "Woody Allen: 'Harvey Weinstein Thing Is Very Sad for Everybody'", "published_at": "2017-10-15 19:53:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-82178360-31046737-2289-490a-a452-7e5363ae9956.jpg?w=1024", "comment_count": 0, "tags": "Woody Allen", "topics": "Culture News", "body": "UPDATE: Woody Allen has clarified his comments on Harvey Weinstein after originally stating, \"\"The whole Harvey Weinstein thing is very sad for everybody involved.\" \"When I said I felt sad for Harvey Weinstein, I thought it was clear the meaning was because he is a sad, sick man,\" Allen said (Via Variety). \"I was surprised it was treated differently. Lest there be any ambiguity, this statement clarifies my intention and feelings.\"Woody Allen addressed the \"very sad\" Harvey Weinstein sexual assault scandal in a new interview where the filmmaker admitted that he was unaware of the severity of the claims against the producer.\"No one ever came to me or told me horror stories with any real seriousness,\" Allen told the BBC. \"And they wouldn't, because you are not interested in it. You are interested in making your movie. But you do hear a million fanciful rumors all the time. And some turn out to be true and some, many, are just stories about this actress or that actor.\" The director and the producer have a long business relationship: Allen-directed films like Mighty Aphrodite and Bullets Over Broadway were distributed through Weinstein's Miramax, while The Weinstein Company co-produced Allen's Vicki Christina Barcelona. Mira Sorvino, who won a Best Supporting Actress Oscar for her role in Mighty Aphrodite, recently opened up about her own experience with Weinstein, an encounter that resulted in \"many sleepless nights.\" \"The whole Harvey Weinstein thing is very sad for everybody involved,\" Allen said. \"Tragic for the poor women that were involved, sad for Harvey that [his] life is so messed up. There's no winners in that, it's just very, very sad and tragic for those poor women that had to go through that.\"Allen, who has similarly faced allegations of sexual abuse – including accusations levied by his son Ronan Farrow, who penned the New Yorker's expose into Weinstein – also voiced concern that the aftermath of the Weinstein scandal would result in \"a witch hunt atmosphere\" in Hollywood and beyond.\"You also don't want it to lead to a witch hunt atmosphere, a Salem atmosphere, where every guy in an office who winks at a woman is suddenly having to call a lawyer to defend himself. That's not right either,\" Allen said. \"But sure, you hope that something like this could be transformed into a benefit for people rather than just a sad or tragic situation.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1508097180.0, "source": "https://www.rollingstone.com", "summary": ""}