{"url": "en.wikipedia.org/wiki/Gotti_(2018_film)", "text": "2018 crime film directed by Kevin Connolly\n\nFor the 1996 film of the same name, see Gotti (1996 film)\n\nGotti is a 2018 American biographical crime film about New York City mobster John Gotti, directed by Kevin Connolly, and written by Lem Dobbs and Leo Rossi. It stars John Travolta as Gotti, alongside Travolta's real-life wife Kelly Preston as Gotti's wife Victoria.\n\nFirst announced in 2010, the film languished in development hell for several years with numerous directors and actors, including Barry Levinson and Al Pacino, attached at various points. Principal photography finally began in July 2016 in Cincinnati, Ohio and concluded in Brooklyn, New York in February 2017.\n\nThe film was originally set to be released in the United States on December 15, 2017, but, just two weeks prior, Lionsgate, the slated distributor, sold the film back to its producers and studio, delaying its release.[6] On March 12, 2018,[7] its new release date was announced for June 15, 2018 by Vertical Entertainment and MoviePass Ventures, after premiering at the 2018 Cannes Film Festival.\n\nGotti was both a critical and commercial failure. It grossed just $6 million against a production budget of $10 million, and was universally panned by critics, who lamented the writing, aesthetics and performances, although its use of makeup received some praise.[8] It is one of the few films to hold an approval rating of 0% on the website Rotten Tomatoes.[9][10][11] At the 39th Golden Raspberry Awards, the film was nominated for six Razzies, including Worst Picture and Worst Actor for Travolta.\n\nPlot [ edit ]\n\nMob boss John Gotti reflects on his three-decade reign of crime in New York City. In 1972, he is tasked by Neil Dellacroce, underboss to the Gambino crime family, to kill James McBratney, who is believed responsible for the kidnapping and murder of boss Carlo Gambino’s nephew. Killing McBratney at a bar, Gotti becomes a “made man”.\n\nDecades later in the 1990s, Gotti is incarcerated at the United States Medical Center for Federal Prisoners in Springfield, Missouri, having been diagnosed with throat cancer. He meets with his son, John “Junior”, who is considering a plea bargain.\n\nIn 1972, After the McBratney hit, he is identified in the murder and sentenced to four years at Green Haven, but leaves on medical furloughs to conduct further criminal business, including another hit. Gotti is paroled from Lewisburg in 1974 after serving two years and joins his wife, Victoria, and children at their new home in Howard Beach, Queens. By 1979, Gotti operates out of the Bergin Hunt and Fish Club with friend Angelo Ruggiero. Junior enters the New York Military Academy but hopes to follow in his father’s footsteps. Despite Dellacroce’s counsel and the assurances of Frank DeCicco, Gotti is mistrustful of Anthony Casso. In 1980, Gotti’s 12-year-old son Frank is struck and killed by a neighbor’s car. The neighbor later disappears, and the only witness to his abduction is intimidated into silence.\n\nBy 1985, the Gambino organization has come under scrutiny, and Gotti doubts Paul Castellano’s leadership. Junior instigates a bar brawl that leaves a man dead, infuriating Gotti. The Gambino family faces further scrutiny when the government releases the embarrassing Ruggerio tapes, caught on FBI wiretap. Gotti escapes criminal charges, but the prosecution announces that his associate, Wilfred Johnson, is an informant; although Gotti agrees to give him a “pass”, Johnson is later killed. Gotti learns that Castellano plans to reorganize the Gambino family and possibly break up Gotti’s crew. Dying of cancer, Dellacroce helps Gotti secure the approval of the Five Families to eliminate Castellano, who fails to attend Dellacroce’s funeral.\n\nOn December 16, 1985, Gotti has Castellano and his bodyguard gunned down, and is named the new head of the Gambino family, capturing the attention of the press and the public as “the real-life Godfather”. Vincent Gigante plots with Casso to eliminate Gotti, and DiCicco is killed by a car bomb that Ruggerio believes was meant for Gotti. Casso survives an unsanctioned hit, tracking down the assassin and torturing him into revealing he was sent by Ruggerio. Gotti settles the matter with Gigante, and casts Ruggerio out of his crew.\n\nEscaping prosecution for the third time, Gotti is nicknamed “the Teflon don” by the press. Ruggiero dies of cancer in 1989. Becoming a made man, Junior is married in 1990. On trial in 1992 for the fourth time, Gotti is charged with Castellano’s murder; Sammy Gravano testifies against him, and Gotti is sentenced to life in prison. Junior assumes control as the organization is targeted by rivals and several members are killed, and is himself taken into custody in 1998.\n\nGotti dies on June 10, 2002. Junior chooses to leave his criminal life behind for the sake of his family, and after five trials in 37 months, he goes free.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nDevelopment history [ edit ]\n\nIn September 2010, Fiore Films announced that it had secured the rights from Gotti Jr. to produce a film about his life.[12] The film, tentatively titled Gotti: In the Shadow of My Father, was to be directed by Barry Levinson, who eventually left the project. Nick Cassavetes and Joe Johnston were then also attached at different points to direct, as were Al Pacino, Lindsay Lohan and Ben Foster to star in various roles.[13] Joe Pesci was cast as Angelo Ruggiero early in development and gained 30 pounds in order to properly portray him. After having his salary cut and being recast as Lucchese underboss Anthony Casso, he sued Fiore Films for $3 million; the case was settled out of court.[14][15] Chazz Palminteri, who had played Paul Castellano in the TNT made-for-TV film Boss of Bosses, was also initially cast to reprise Gotti's predecessor.[16]\n\nCasting [ edit ]\n\nOn September 8, 2015, it was announced that the project was moving forward with Kevin Connolly as director.[17] Emmett/Furla/Oasis Films, Fiore Films and Herrick Entertainment would be financing the film, with Lionsgate Premiere handling the domestic distribution rights.[17]\n\nOn July 27, 2016, the complete cast for the film was announced. It included Kelly Preston as Gotti's daughter Victoria; Stacy Keach as Aniello Dellacroce, the underboss of the Gambino crime family who mentored Gotti; Pruitt Taylor Vince as Angelo Ruggiero, a deferential friend of Gotti; Spencer Lofranco as John Gotti Jr., Gotti's son; William DeMeo as Sammy Gravano, Gotti's right-hand man who later became an FBI informant and helped them in bringing down Gotti; Leo Rossi as Bartholomew \"Bobby\" Boriello, Gotti's enforcer; Victor Gojcaj as Father Murphy, with Tyler Jon Olson and Megan Leonard.[18]\n\nFilming [ edit ]\n\nPrincipal photography on the film began in Cincinnati, Ohio, on July 25, 2016, with locations including Springfield Township. The locations were staged to resemble setting of the film, New York City.[19][20] Filming also took place on Jonfred Court in Finneytown, and Indian Hill.[20][21] Filming was also done at Butler County Jail.[22]\n\nThe film's shooting was previously scheduled to take place in New York City, because of its setting there, but it was relocated to Cincinnati. One reason to relocate was Ohio's revised Motion Picture Tax Credit to benefit films' creators.[23] Filming for some scenes took place in Brooklyn on February 21, 2017, concluding principal photography.[24]\n\nRelease [ edit ]\n\nThe film was originally set to be released in a limited release and through video on demand on December 15, 2017, through Lionsgate Premiere. Producers began seeking a new distributor in order for the film to receive a wide theatrical release, as opposed to the original release it was initially intended to have, with Lionsgate selling the film back to the producers and studio.[25][26] On March 12, 2018, Connolly announced that the film would be released on June 15, 2018.[27] On April 12, 2018, it was announced Vertical Entertainment was the film's new distributor.[2] On April 25, 2018, it was announced that MoviePass Ventures, a subsidiary of MoviePass, acquired an equity stake in the film and will participate in the revenue generated from the film.[28][29] The film premiered at the 2018 Cannes Film Festival on May 15, 2018.[1]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nGotti grossed $4.3 million in the United States, and $1.8 million in other territories, for a worldwide total of $6.1 million, against a production budget of $10 million.[5]\n\nGotti began its limited release in 503 theaters and was projected to make $1–2 million in its opening weekend. It made $105,000 from Thursday night previews at 350 theaters and a total of $1.7 million in its opening weekend, finishing 12th.[13] According to their own reports, MoviePass accounted for 40% of tickets sold, leading one independent studio head to tell Deadline Hollywood: \"It used to be in distribution, we'd all gossip whether a studio was buying tickets to their own movie to goose their opening. But in the case of MoviePass, there's no secret: They're literally buying the tickets to their own movie!\"[30] In its second weekend the film dropped 53% and made $812,000, finishing 12th.[31]\n\nCritical response [ edit ]\n\nGotti was not screened in advance for critics,[32] but the Cannes premiere was attended by reviewers from IndieWire and The Hollywood Reporter, who both gave the film negative reviews.[33] On review aggregator website Rotten Tomatoes, with 55 reviews, the film has a rare approval rating of 0% – meaning no favorable reviews whatsoever – receiving an average rating of 2.06/10. The website's critical consensus reads, \"Fuhgeddaboudit.\"[34] On Metacritic, the film has a weighted average score of 24 out of 100, based on reviews from 16 critics, indicating \"generally unfavorable reviews\".[35]\n\nJordan Mintzer of The Hollywood Reporter gave the film a negative review, writing: \"... it's not only that the film is pretty terrible: poorly written, devoid of tension, ridiculous in spots and just plain dull in others. But the fact that it mostly portrays John Gotti as a loving family man and altogether likable guy, and his son John Gotti Jr. as a victim of government persecution, may be a first in the history of the genre.\"[4] The New York Post's Johnny Oleksinski called the film \"the worst mob movie of all-time\" and wrote, \"... the long-awaited biopic about the Gambino crime boss' rise from made man to top dog, took four directors, 44 producers and eight years to make. It shows. The finished product belongs in a cement bucket at the bottom of the river.\"[36] Writing for Rolling Stone, Peter Travers gave the film one out of four stars and said, \"Insane testimonials from Gotti supporters at the end are as close as this [film] will ever get to good reviews.\"[37]\n\nRotten Tomatoes controversy [ edit ]\n\nObservers were quick to note a large disparity on Rotten Tomatoes, between the audience approval score of 80% and the 0% critics' score during the film's opening weekend.[38][39][40][41][42] As of December 30, 2019 , the audience score was down 34 points to a score of 47%.[34]\n\nOn June 19, Dan Murrell of Screen Junkies noted that the disparity \"made no sense\" and suspected vote manipulation on behalf of the studio.[39] Accusations against the production studio and marketing team increased after the release of a marketing push suspected to be trying to hit back at the critics. The campaign proclaimed to consumers to ignore the \"... trolls behind a keyboard\",[42] and \"Audiences loved Gotti but critics don't want you to see it... The question is why??? Trust the people and see it for yourself!\"[38][41][39][40] Observers also noted the abnormally high number of reviews, 7,000, compared to other films that did better at the box office that weekend, such as Incredibles 2 which logged 7,600 reviews and grossed 105 times more than Gotti.[39][41]\n\nRotten Tomatoes staff issued a statement stating they didn't find any evidence of tampering and that \"All of the ratings and reviews were left by active accounts.\"[42] As of June 19, 32 of the 54 written reviews were found to be from first-time reviewers on the site, who had also only left a review for Gotti itself, and 45 of the accounts were created the same month.[39] Many of the accounts also wrote a review for American Animals, which along with Gotti are the only films to be owned by MoviePass through its company MoviePass Ventures,[39][41] which was responsible for 40% of tickets sold.[30] Jim Vorel of Paste suggested this was done to try to prop up MoviePass's \"unlimited movies\" business model.[39]\n\nAccolades [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/7/79/Gotti_movie_poster.jpg", "http://upload.wikimedia.org/wikipedia/en/7/79/Gotti_movie_poster.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/79/Gotti_movie_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gotti_(2018_film)", "title": "Gotti (2018 film)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/79/Gotti_movie_poster.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}