{"url": "https://www.usatoday.com/story/life/entertainthis/2018/06/13/pixar-movies-definitively-ranked-including-incredibles-toy-story-finding-nemo/694733002/", "text": "Is there a single movie studio whose films elicit more of an emotional response than Pixar? Just seeing the name above an animated film is enough to get fans' hearts beating and emotions running. When you see a Pixar film, you know you're probably going to leave in tears, happy or sad.\n\nWednesday marks the 10th anniversary of \"Up,\" the exhilarating adventure about a widower who flies off to South America, assisted by a bunch of helium balloons and a young stowaway. In honor of the occasion, we ranked all 20 Pixar movies, definitively. Feel free to disagree, but then you’d be wrong.\n\n20. 'Cars 2'\n\nOh, \"Cars 2.\" What to say about you? You were the movie that made us lose confidence in Pixar, ever so briefly. We get why you exist, we do, but we’d prefer to pretend otherwise.\n\n19. 'Cars 3'\n\nWhat the third installment in the \"Cars\" franchise has going for it mostly is that it's not \"Cars 2.\" Despite adding a laundry list of talent to the voice cast (Kerry Washington, Nathan Fillion, Armie Hammer and Chris Cooper), it's mostly just a slightly less disappointing \"Cars\" film.\n\n18. 'The Good Dinosaur'\n\n\"The Good Dinosaur\" doesn't have a lot in its story that you haven't seen before. Once you get past the initial gimmick — the meteor that took out the dinosaurs whizzed right by and the dinos have evolved into a talking, farming, herding society — the plot is a pretty simplistic one. It doesn't feel nearly sophisticated enough for Pixar.\n\n17. 'Cars'\n\nThe \"Cars\" sequels have unfortunately tarnished the memory of the original a little bit. While the 2006 movie isn’t bad, it just doesn't bowl you over the way many Pixar films do. There’s a lot here that worked, from the voice performances to the sense of humor, but it was inevitably just fine.\n\n16. 'Monsters University'\n\n\"Monsters, Inc.\" has one of the best endings of a Pixar film, so it was a good thing the studio didn’t try to give it a sequel. The prequel they gave it instead — which seemed to be aimed squarely at the kids who saw the original and were maybe in college at this point, something they did much more successfully with \"Toy Story 3\" — was missing the sense of wonder and themes about childhood that made the original so great. College is too impure for Pixar.\n\n15. 'Brave'\n\n\"Brave\" had so much potential and gave the studio its first female protagonist, but it just couldn't click. Maybe it was the structure of the story (which literally featured our heroine moving back and forth instead of moving forward), or the subpar humor, or the blatant but failed attempts at feminism. (When Merida claims she’ll be shooting for her own hand at the archery ceremony, it rings false.) But the lesson is that fairy tales are strictly Disney's game. Leave Pixar the inanimate objects with emotions.\n\n14. 'A Bug’s Life'\n\nReally the only thing \"A Bug’s Life\" has going against it is that it’s not one of those cross-generational movies that appeals as much to parents as it does to their kids. \"Bug's Life\" is just a kids' movie, about bugs. And it's not trying to be anything more than that.\n\n13. 'Incredibles 2'\n\nPixar's latest picks up mere seconds after the original finished, but arrived 14 years after that movie blew audiences away in theaters. Superhero cinema has dominated the box office since then, and writer/director Brad Bird's visual style and humor feel less novel. But it's still an extremely entertaining ride that manages to re-create many of the familial themes that made the first one great.\n\n12. 'Ratatouille'\n\n\"Ratatouille\" is one of Pixar’s most earnest films, turning something most people are scared of/disgusted by, a rat, into a most charming and adorable hero. Pair that with one of the studio's best characters, food critic Anton Ego (voiced by the inimitable Peter O’Toole), and this is a big-budget movie that manages to feel as intimate as a Parisian dinner. It’s a testament to how great their other films have been that this is so far down the list.\n\n11. 'Finding Dory'\n\nAnother of Pixar's sequels more than a decade after the original film, \"Dory\" manages to recapture the themes of family and loneliness while spinning the story forward in a surprising way. The film takes Ellen DeGeneres' forgetful fish Dory, who was a sweet punchline, and gives depth and context to her disability.\n\n10. 'Coco'\n\nMusical, magical and visually splendid, Pixar's adventure in the Land of the Dead was a sumptuous and emotional experience that found a new way for the studio to examine loss and grief, its most common themes.\n\n9. 'Inside Out'\n\n\"Inside Out\" has a lot going for it: striking animation and a story designed to make you cry. But what keeps the madcap adventure going are the voice performances from Amy Poehler and Phyllis Smith (Phyllis from \"The Office\") as Joy and Sadness, respectively. So much of the movie rests on believing these two characters are emotions that also have emotions, and Poehler and Smith pull it off flawlessly.\n\n8. 'Monsters, Inc.'\n\nIt’s easy to forget that \"Monsters, Inc.\" is essentially a John Goodman/Billy Crystal buddy comedy about two guys who work at a power plant. The fact that this same movie is also about childhood, loss of innocence, what we're truly afraid of and the nature of good and evil is the “Pixar” of it all.\n\n7. 'Toy Story 2'\n\nAll three \"Toy Story\"films are about growing up and growing apart, but none so mournfully as the second installment, which introduces Jessie (Joan Cusack), a toy whose owner has grown up and moved on. It was able to keep the essential theme of \"Toy Story\" but also expand on the universe in an appropriate way, which is what all sequels should do.\n\n6. 'Toy Story 3'\n\nPerhaps the most millennial movie that Pixar has ever made, \"Toy Story 3\" finds Andy (John Morris) getting ready for college, like so many of the kids who saw the original film in theaters. \"Toy Story 3\" is about that life transition, but it also confronts the inevitability of death (yes, we're talking about that scene where they hold hands, and, yes, we're outright sobbing right now), heady stuff for a kids’ movie but it miraculously works.\n\n5. 'Finding Nemo'\n\nThe sea tale of an overprotective father searching for his lost son is one of Pixar’s most overt stories meant for both parents and kids, but it never lets the sentiment overpower the comedy.\n\n4. 'Toy Story'\n\n(Almost) nothing beats the original. \"Toy Story\" was a revolutionary film in 1995 in more ways that one, and decade and a half later, we're still thinking about it. The movie put Pixar on the map, it pioneered computer animation and it featured all the ingredients we have come to know and love in so many of the Pixar movies that followed: emotional storytelling, action sequences, insights on the human condition, all-star voice cast and protagonists you never would have thought of yourself. It was hard to top, but eventually they did.\n\n3. 'The Incredibles'\n\n\"The Incredibles\" is a movie about identities. Sure, it's about a family of superheroes who happen to have secret identities, but it's also about a middle-age couple trying to figure out who they are in their second act of life and about two kids trying to figure out what growing up means. It's also got some cool action sequences.\n\n2. 'WALL-E'\n\nWhen you’re going to tell a story that is so harsh on humanity, it helps to have a protagonist as innocent and (literally) wide-eyed as WALL-E, the trash-compacting robot left all alone on a destroyed planet Earth. In between how cute he is watching \"Hello, Dolly!\" and putting bras on his eyes, there’s a devastating critique on the world as we know it, and yet it’s still a very enjoyable movie for children (and plenty of adults).\n\n1. 'Up'\n\nThe haters may say that, minus the heartbreaking opener, there isn’t a whole lot to this movie. And they’d be right. But that’s exactly why this movie is so powerful and why it tops this list. This is the essential Pixar movie: It’s made up of a lot of disparate pieces that shouldn’t fit together, except for their emotion. Imagine pitching this story: Who wants to see a movie about an old man, an outcast kid, a talking dog and another old man who's a villain? This movie shouldn't have worked. But it did.", "images": ["https://www.gannett-cdn.com/-mm-/41b8c0790b508f25ee2b491632341cb515e25da8/c=0-0-3364-1900/local/-/media/2015/11/24/USATODAY/USATODAY/635839769111568995-UP-PIXAR-02.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2019/05/21/USAT/83c8beb6-a3d3-466f-9b3f-9341562608ba-VPC_TOY_STORY_4_TRAILER_THUMB.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/41b8c0790b508f25ee2b491632341cb515e25da8/c=0-0-3364-1900/local/-/media/2015/11/24/USATODAY/USATODAY/635839769111568995-UP-PIXAR-02.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2018/06/13/pixar-movies-definitively-ranked-including-incredibles-toy-story-finding-nemo/694733002/", "title": "'Up' turns 10! The definitive ranking of all 20 Pixar movies", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "'Up' turns 10! The definitive ranking of all 20 Pixar movies", "description": "Happy 10th anniversary, 'Up'! From the heights of 'Up' to the lows of 'Cars 2,' we rank all 20 Pixar films from worst to best.", "url": "https://www.usatoday.com/story/life/entertainthis/2018/06/13/pixar-movies-definitively-ranked-including-incredibles-toy-story-finding-nemo/694733002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/41b8c0790b508f25ee2b491632341cb515e25da8/c=0-0-3364-1900/local/-/media/2015/11/24/USATODAY/USATODAY/635839769111568995-UP-PIXAR-02.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Kelly Lawler", "content_tier": "free", "opinion": "false"}, "description": "Happy 10th anniversary, 'Up'! From the heights of 'Up' to the lows of 'Cars 2,' we rank all 20 Pixar films from worst to best.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/41b8c0790b508f25ee2b491632341cb515e25da8/c=0-0-3364-1900/local/-/media/2015/11/24/USATODAY/USATODAY/635839769111568995-UP-PIXAR-02.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "'Up' turns 10! The definitive ranking of all 20 Pixar movies", "description": "Happy 10th anniversary, 'Up'! From the heights of 'Up' to the lows of 'Cars 2,' we rank all 20 Pixar films from worst to best."}}, "movies": [], "publish_date": 1528819200.0, "source": "https://www.usatoday.com", "summary": ""}