{"url": "https://www.elle.com/uk/life-and-culture/culture/news/a40104/jennifer-lawrence-why-she-didnt-sue-nude-photo-leak-scandal/", "text": "Jennifer Lawrence is renowned for stellar roles in Hollywood blockbusters such as X Men: First Class, Passengers, and her Oscar-winning performance in the 2013 hit Silver Linings Playbook.\n\nHowever, in 2014, the then 27-year-old was caught up in the devastating 4chan hacking scandal, resulting in her name being splashed across media headlines and the Internet discussing her nude body, rather than her body of work.\n\nIn the months that followed the incident, the star denounced the hack as a 'sex crime' and a 'flagrant violation of privacy'.\n\nIn 2017, Chicago hacker Edward Majerczyk was sentenced to nine months in prison for illegally accessing email belonging to more than 300 people, including those of celebrities.\n\nPascal Le Segretain Getty Images\n\nOpening up about the gross invasion of privacy on several occasions over the years, the actress had said that she continues to feel the effects of being exposed to the world.\n\nHere is everything Jennifer Lawrence has ever said on the hacking scandal:\n\nComing to terms with the leak\n\nIn an interview with Scott Feinberg on The Hollywood Reporter's Awards Chatter Podcast in November 2017, the actress opened up about the leak, admitting that she still hadn't come to terms with what happened.\n\n'When the hacking thing happened—it was so unbelievably violating that you can't even put into words. I think that I am still actually processing,' she explained.\n\nStephane Cardinale - Corbis Getty Images\n\n'I feel like I got gangbanged by the f*cking planet. There was not one person in the world that is not capable of seeing these intimate photos of me.'\n\n'You could just be at a barbecue and someone could just pull it up on their phone.'\n\nThe Hunger Games star revealed that several women had contacted her about bringing a lawsuit against technology company Apple which later revealed hackers hadn't penetrated its systems, as was widely believed, rather targeted 'names, passwords and security questions'.\n\nI think that I am still actually processing\n\nDespite the leak, the star decided not to sue the tech giant.\n\n'None of that was going to bring me peace and none of that was going to bring my nude body back to me and Nick [Holt], the person they were intended for,' she explained.\n\nJennifer Lawrence and then-boyfriend Nicholas Holt | ELLE UK Getty Images\n\nDuring the interview, Lawrence recalled a time when someone came up to her following the incident and described her as a role model for young women, forcing her to run to the toilets and burst into tears.\n\n'I feel like I got gangbanged by the f*cking planet\n\n'I felt like an impostor or I felt like I can't believe someone still feels that way,' she admitted.\n\nTouching on the Harvey Weinstein sexual assault and harassment scandal which came to light a month prior, the star described the film producer as a 'paternal' figure in her career.\n\nGetty Images\n\n'Then with Harvey Weinstein, it was bizarre. I heard that he was a dog but he was always almost paternal to me,' she shared.\n\n'He was never inappropriate with me. I thought we had a nice relationship where when he acted like an asshole, I called him an asshole. I actually think the word I used was a sadistic monster, but it was just never of that nature so that was really shocking.'\n\nWhen he acted like an asshole, I called him an asshole\n\nWhile several A-listers including the likes of Rose McGowan, Gwyneth Paltrow, Natalie Portman and Angelina Jolie have spoken up about the sexual misconduct they've endured during their careers, the Californian star admitted: 'I have never had a man use his power to sexually abuse me.'\n\nFeeling sexually violated\n\nIn an interview with Oprah Winfrey for The Hollywood Reporter in December 2017, the star said that the hack made her ‘afraid’ of going nude in a film.\n\n‘I just thought, “I'll never do that again. I'll never share that part of myself ever since it got shared against my will”,’ she told the presenter.\n\nThe Passengers actress added that she would rather have been burgled than having photos of her nude body shared online.\n\nJamie McCarthy Getty Images\n\n‘I would much prefer my whole house to have been invaded,’ she admitted.\n\n‘That's what's so scary about electronic (things). I have such fear with my phone and my computer and electronics.\n\nI would much prefer my whole house to have been invaded\n\n‘It's taking somebody's intellectual property but also my body.\n\n‘It was violating on a sexual level.’\n\nGoing nude on camera for the first time\n\nIn March 2018, the actress defended her decision to do a nude scene in her spy film, Red Sparrow, in which she plays a Russian ballerina-turned assassin. The film marked the first time the star went nude for a role and was admittedly something she says ‘scared the hell’ out of her.\n\n‘I tried to do the movie without nudity but realised it just wouldn’t be right to put the character through something that I, myself, am not willing to go through,’ Lawrence told Vanity Fair.\n\n“My biggest fear was that people would say, “Oh, how can you complain about the hack if you’re going to get nude anyway?”’ Lawrence added.\n\nThe 29-year-old explained that it was her decision to go nude – no one else’s. ‘I got something back that was taken from me, and it also felt normal,’ she explained.\n\nLawrence continued, stating that working with the film’s director Francis Lawrence, with whom she filmed the Hunger Games franchise, helped her feel at ease on set during some of the more uncomfortable moments while nude on the set of the spy film.\n\n‘He looked me right in the eyes like I had clothes on and then all of a sudden I was like, “Oh, okay it’s just like I have clothes on”,’ she told the magazine. ‘Everybody here is professional. You’re still at work. One look just made me comfortable. It didn’t make me feel naked.’", "images": ["https://hips.hearstapps.com/elleuk.cdnds.net/16/24/1600x800/landscape-1465854559-jenifer-lawrence-wedding.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-513018622-1569320312.jpg?crop=1.00xw:0.718xh;0,0.0229xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.900xw:0.676xh;0.100xw,0.112xh&resize=1200:*", "https://www.elle.com/sites/elle/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.900xw:0.676xh;0.100xw,0.112xh&resize=1200:*", "keywords": [], "authors": ["Katie O'Malley"], "canonical_link": "https://www.elle.com/uk/life-and-culture/culture/news/a40104/jennifer-lawrence-why-she-didnt-sue-nude-photo-leak-scandal/", "title": "Everything Jennifer Lawrence Has Ever Said About Her Nude Photo Leak Scandal", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Everything Jennifer Lawrence Has Ever Said About Her Nude Photo Leak Scandal", "description": "'You could just be at a barbecue and someone could just pull it up on their phone'", "url": "http://www.elleuk.com/life-and-culture/culture/news/a40104/jennifer-lawrence-why-she-didnt-sue-nude-photo-leak-scandal/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.900xw:0.676xh;0.100xw,0.112xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 201742389861242}, "article": {"publisher": "https://www.facebook.com/ELLEuk", "modified_time": "2019-09-26 04:54:36", "published_time": "2019-09-24 11:00:00", "section": "Culture", "opinion": "false"}, "twitter": {"site": "@ELLEUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.900xw:0.676xh;0.100xw,0.112xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Jennifer Lawrence Explains Why She Didn't Sue Over Nude Photo Leak Scandal", "description": "Jennifer Lawrence has opened up about how she felt following her nude photo hacking in 2014 on several occasions over the years.", "keywords": "Jennifer Lawrence, Nude Photo Leak Scandal, Jennifer Lawrence actress, Jennifer Lawrence boyfriend, Jennifer Lawrence relationship, Jennifer Lawrence and Harvey Weinstein", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.668xw:1.00xh;0.257xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Life + Culture,life-and-culture,culture,jennifer lawrence", "sailthru.date": "2019-09-24T11:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.900xw:0.676xh;0.100xw,0.112xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153778824.jpg?crop=0.668xw:1.00xh;0.257xw,0", "sailthru.socialtitle": "Everything Jennifer Lawrence Has Ever Said About Her Nude Photo Leak Scandal", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1569294000.0, "source": "https://www.elle.com", "summary": ""}