{"url": "https://web.archive.org/web/20190721151853/https://heightline.com/miguel-angel-silvestre-bio-gay-girlfriend/", "text": "Miguel Angel Silvestre is a Spanish actor and voice actor. After doing a number of series and films in his home country, the Spanish hunk got exposed to the international audience on the globe-trotting Netflix original series Sense8. On the series, Silvestre starred as Lito Rodríguez, a closeted TV star cohabiting with his boyfriend in Mexico city.\n\nSense8 was well-received both by fans and critics and got a Primetime Emmy Award nomination for Outstanding Cinematography for a Single-Camera Series. After 2 successful seasons, Netflix announced that the series would not be renewed for a 3rd season.\n\nUnlike the fans of Sense8 who found it had to get over the cancellation of the series, Miguel Angel Silvestre quickly moved on and landed himself a role on another Netflix series Narcos. Joining the Narcos cast for the season 3, the Spanish hunk further imprinted on the memories of TV viewers. Silvestre also voiced the character El Primero, a bullfighter in the 2017 comedy drama Ferdinand based on the children’s book The Story of Ferdinand.\n\nSee Also: Alessandra Torresani Biography, TV Shows, Quick Facts and Family\n\nBio\n\nMiguel Angel Silvestre Rambla was born on April 6, 1982, in Castellón, a city in the Valencian community of Spain. He started out as a Tennis player and even went professional. Unfortunately, he discovered that he didn’t have enough talent to make it really big as a professional tennis player and therefore decided to quit.\n\nHe proceeded to study physical therapy at the University of Spain. In the course of his study, his aunt who was a theatre director introduced him to the world of performing arts. He then chose to study drama, dance and theatre. Miguel Angel Silvestre then relocated to the Spanish capital city, Madrid where he got featured in small plays. In 2002, he participated in the Mister Castelló pageant which he won, a testament to his good looks.\n\nSilvestre landed his first feature on TV in 2004 on one episode of the Spanish sitcom Mis adorables vecinos and made his movie debut a year after. His first big feature was on the Spanish soap opera Velvet, which had English subtitles on Netflix. The talented Spanish actor became known in the US for his role in the 2013 Spanish comedic film I’m So Excited (original Spanish title Los amantes pasajeros) as well as his portrayal of Lírico in the 2011 horror movie Verbo.\n\nMiguel Angel Silvestre got his breakout role in 2015 when he landed the lead in the Netflix hit sci-fi series Sense8. Starring in Sense8 gave the Spanish-born actor a broad exposure to the English-speaking audience. He has also appeared in such television series as Motivos Personales and Velvet.\n\nIs He Married? Wife and Family\n\nAfter charming millions of fans around the world with his stellar performances, many are interested to know if Miguel Angel Silvestre is married. Is he taken? Well, there is good news because, at the moment, Miguel Angel Silvestre is not married to anyone. The Sense8 star has had quite a number of long-lasting relationships, however, none had ever led him as far as the altar. In some quarters, the talented actor is adjudged to be the most eligible bachelor in Spain.\n\nIn the absence of any wife or kids, Miguel Angel Silvestre’s claim to a family would be his parents. His mother María Lidón and father Miguel Angel Silvestre both live in Spain and he visits them pretty often.\n\nGirlfriend, Is he Gay?\n\nThe talented Spanish actor had some intense gay scenes in the popular series Sense8. This had many fans wondering if Miguel Angel Silvestre is gay. Well, the Spanish heartthrob is actually straight. However, he is quite accepting of the LGBT community, coming from a family with a number of gay people himself.\n\nMiguel Angel Silvestre currently has no woman in his life. His last known relationship was with Spanish model and actress Albania Sagarra. Their relationship began in early 2017 and before the end of that year, they called it quits. Prior to Albania, Miguel Angel Silvestre was in a relationship with another Spanish television actress, Blanca Suarez. His relationship with Suarez lasted between 2011 and 2014, pretty long.\n\nBefore his romance with Blanca Suarez, the Spanish hunk had dated Belén López, another actress from his home country. Their relationship lasted between 2005 and 2010. He sure loves his Spanish ladies!\n\nSee Also: Sofia Vergara Son, Husband, Net Worth, Family And Plastic Surgery\n\nFacts About Miguel Angel Silvestre", "images": ["https://web.archive.org/web/20190721151853im_/https://images.dmca.com/Badges/_dmca_premi_badge_4.png?ID=fdb65fc6-af63-4791-bfb9-e3620d5a2604", "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre.jpg", "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre-01.jpg", "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre-640x426.jpg", "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/miguel-angel-silvestre-and-former-girlfriend.jpg", "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/heightline.-logo.png"], "top_img": "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20190721151853/https://heightline.com/miguel-angel-silvestre-bio-gay-girlfriend/", "title": "Miguel Angel Silvestre Bio, Gay, Girlfriend, Married, Wife, Family, Facts", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": {"identifier": "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre.jpg", "secure_url": "https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre.jpg", "width": 1024, "height": 681}, "locale": "en_US", "type": "article", "title": "Miguel Angel Silvestre Bio, Gay, Girlfriend, Married, Wife, Family, Facts", "description": "Miguel Angel Silvestre is a Spanish actor and voice actor.He won the Mister Castelló pageant in 2002 after which he featured in a number of series and films in his home country. He got exposed to the international audience in 2015. Here's how that happened.", "url": "https://web.archive.org/web/20190721151853/https://heightline.com/miguel-angel-silvestre-bio-gay-girlfriend/", "site_name": "Heightline - Celebrity Biographies, Height, Weight, Bios of Famous People", "updated_time": "2018-03-05T21:24:45+00:00"}, "description": "Miguel Angel Silvestre is a Spanish actor and voice actor.He won the Mister Castelló pageant in 2002 after which he featured in a number of series and films in his home country. He got exposed to the international audience in 2015. Here's how that happened.", "article": {"section": "Actors", "published_time": "2018-03-06T03:01:24+00:00", "modified_time": "2018-03-05T21:24:45+00:00"}, "twitter": {"card": "summary", "description": "Miguel Angel Silvestre is a Spanish actor and voice actor.He won the Mister Castelló pageant in 2002 after which he featured in a number of series and films in his home country. He got exposed to the international audience in 2015. Here's how that happened.", "title": "Miguel Angel Silvestre Bio, Gay, Girlfriend, Married, Wife, Family, Facts", "image": "https://web.archive.org/web/20190721151853im_/https://heightline.com/wp-content/uploads/Miguel-Angel-Silvestre.jpg"}, "ahrefs-site-verification": "91f07342d9124b6525702cd86729d5dd6bb1e6c5e3332258e008f1ba6c1e5807"}, "movies": [], "publish_date": 1520305284.0, "source": "https://web.archive.org", "summary": ""}