{"url": "http://trolls.wikia.com/wiki/King_Peppy", "text": "“ No Troll left behind! „ ~ King Peppy\n\nPeppy is the former king of the Pop Trolls, Poppy’s father and a supporting character in Trolls, its sequel Trolls World Tour, and its subsequent series Trolls: The Beat Goes On!.\n\nContents show]\n\nAppearance\n\nKing Peppy is a orange troll that has pink hair with grey streaks in it. He has a yellow nose, a green hug time bracelet and possibly brown eyes. He also has a pink vest which has grey streaks in it too. He wears a green and blue waistcoat and he also wears green trousers. In one scene though he is spotted wearing only his White Boxers.\n\nHe often carries a walking stick which helps him walk, but doubles as a mic.\n\nPersonality\n\nAccording to the Trolls DVD extra, he was originally going to be a crazy old man by the time the current Trolls storyline had begun, not even able to recognise when people were talking about him. This idea was dropped in favour of him being a wise teacher to Poppy. Some scenes of him as the senile old man still remain in the movie despite the rewrite of his character.\n\nKing Peppy is shown as a wise teacher in Trolls: The Beat Goes On! and has sage advice on things. Though he has his eccentric side as well. For example in the episode Royal Review, he gives his daughter a frowny face in the primary vote to teach her a lesson, though he isn't clear what the lesson was himself. As he stated \"I'm old, I do what I want\".\n\nRelationships\n\nPrincess Poppy is the daughter of King Peppy. King Peppy gets anxious and worried when Princess Poppy tells him that she would be going on a journey to find her friends and tries to stop her, however Princess Poppy does not listen.\n\nH.U.G.G.\n\nIn Trolls: The Beat Goes On! Season 6 episode Hug Fest, Peppy joined with his former band H.U.G.G. which consists of Sky Toronto, Mags Gumdrop and Dr. Moonbloom.\n\nSkills & Abilities\n\nHe has most normal Troll abilities.\n\nDue to his ageing body, he has physical restrictions.\n\nLeadership\n\nAs a leader, Peppy was known for his strength of body and mind, matched by his determination and will to carry on. While how long his reign was is unknown as that information is unavailable, he was the King who successfully saved his people from Trollstice under the oath of \"no Troll left behind!\" on the day his daughter Princess Poppy was set to be devoured by King Gristle Jr.. It was also his duty to make new holidays and \"Funsgiving\" is named as one of those holidays he declared.\n\nPeppys as a leader is to protect him people no matter what, but often he relies on the \"run and hide\" tactic, running and hiding from danger rather then face it.\n\nMusic\n\nPeppy was a member of H.U.G.G. in the Season 6 episode Hug Fest as a lead singer.\n\nWhen he was King of the Pop trolls, it was his sworn duty to protect his music, including the pink string of Pop.\n\nAdventurer\n\nIt has been mentioned in Trolls: The Beat Goes On! that in his youth Peppy was highly adventurous and went on many great adventures, though few details of these adventures are known.\n\nTeaching\n\nWhen he was leader it would have been his duty to teach young Trolls about being a Troll. Now retired, he extends his knowledge to try and help his daughter with sage old advice. However, he hasn't necessarily revealed everything he knows to her, as evidence by his neglecting of telling her about other tribes until Queen Barb became a threat.\n\nHistory\n\nPre-Trolls\n\nPeppy became King some time before the Storyline, the circumstances of his rise to the throne is unknown and it is unknown who was before him or how he became King.\n\nAt some point in the past, either during or before his reign the Bergens came along after one of them ate a member of his Tribe. They built over time Bergen Town and started a tradition of once a year gathering around The Troll Tree to taste happiness. While it is unknown the death toll and numbers lost to the annual event, as only Grandma Rosiepuff had ever been named as one of their presumed victims.\n\nPeppy was determined to free his people and 20 years before the main events of Trolls. On the last Trollstice, when his daughter Princess Poppy was due to be eaten by Prince Gristle, he freed the Trolls from Bergen Town and lead them to freedom.\n\nThey rebuilt their civilization deep within the forest away from the town. Despite the re-build, most of the previous culture of their Tribe had been lost and Peppy was the only one to remember the existence of other Tribes. Life would slowly return to normal for the Trolls and Peppy focused on rising his daughter and help rebuild what the Trolls had lost to the Bergens.\n\nTrolls\n\n20 years later Princess Poppy threw a party to celebrate her father's efforts. However, the loud party attracted the Bergen Chef who took The Snack Pack save Poppy. King Peppy, being too old to fight the Bergens, wanted to run away but Poppy insisted she went after her friends. Peppy tried to stop his daughter, but he refused much to his dismay.\n\nHe and the other Trolls hid in Branch's Survival Bunker (much to his dismay) while she went off to save her friends.\n\nLater he hears his daughter's cowbell playind causing the other trolls and him to come out of higing, only to find Creek was the one playing it and as a consequence be captured by the Bergens lead by Chef.\n\nAt the Bergen Castle, the entire Troll village is thrown into a pot where he and Poppy are reunited. Poppy however is sad as her attempts to save her friends lead to the entire village being captured. She looses her color and becomes gray, then the entire village including Peppy looses theirs. Branch manages to bring back Poppy's colors using song which causes the other Trolls to get theirs back.\n\nBridget, a Bergen that Poppy had befriended during her rescue attempt sets the Trolls free and they make a bid for Troll Village. Poppy goes back to save Bridget as she had sacrificed herself for their sake.\n\nPoppy manages to convince the Bergens not to eat the Trolls by showing them they can be happy without eating Trolls. At the end of the movie, he steps down as ruler and crowns his daughter Queen Poppy.\n\nTrolls World Tour\n\nKing Peppy appears when Queen Barb's bat Debbie delivers a letter to Queen Poppy. Peppy tries to throw the letter off as nothing special. He finally reveals the existence of the other Tribes to her and explains the other Tribes are nothing like their own tribe. He reveals they are not \"Trolls\" but rather \"Pop Trolls\". After accidentally causing panic among the other Trolls by saying how the other Troll Tribes don't even understand \"Hammertime\" he breaks down to a small group consisting of Poppy and The Snack Pack.\n\nHere he fully explains that the Troll Tribes split after a row over the Strings and shows Poppy their Pop String which controls all their music. Peppy then explains he has prepared for this event for years and plans to run and hide, with Branch on helping him. He and Poppy have a argument over what to do with Peppy using the \"Father\" card against her \"Queen\" card in the row and arguing that he knows best when she argues he is judging someone he doesn't know.\n\nPoppy snuck off later then night without Peppy and the rest knowing, taking with her the Pop String as she thought Barb wanted to unite the Troll Tribes again.\n\nPeppy, along with the rest of the Pop Troll were later captured when Barb raided Pop Village destroying the village in the process. Only a few members of the Tribe were spared as they had hidden away. Peppy and the rest of the Tribe were taken to Volcano Rock City to witness Barb's victory after gathering all the Strings to play the Ultimate Power Cord.\n\nPeppy and the Funk Twins Prince D and Prince Cooper were pushed to the front to bare witness to the victory of Barb. Barb reveals all the leaders of each tribe she has taken prisoner with his own daughter Poppy in a hanging cage, to which she labels Pop as \"worst of all\". Barb then goes to transform Poppy into a Rock Zombie, but Branch interferes. As a consequence, Branch is transformed instead.\n\nPeppy can only watch as each leader is converted into a Rock Zombie before intention is turned back to his daughter Poppy. Poppy does attempt to escape, but Rock Zombie Branch is used to grab her and hold he in place. Poppy appears to have been converted, which Peppy looks on with horror over, so Barb hands her the guitar that holds the strings, with the intent that Poppy be the one to convert her father and the Funk Twins. But Poppy turns on Barb having used gumdrops to block out the impact of the Rock String and thus spared her the full conversion to a Rock Zombie.\n\nPoppy smashes the Guitar to stop Barb but destroys all music in the process. The Trolls turn grey as they loose their music. This does not last long as the Trolls realise they can make music without the Strings now.\n\nAfter Just Sing ends, Peppy and Poppy settle their differences on their earlier row. Peppy takes the moment to take pride in raising a strong and independent daughter proclaiming himself a \"genius\" parent as he drives into the crowd to crowd surf. He is later seen interacting with King Thrash at the end credits.\n\nMerchandise\n\nOfficial Website\n\nKing Peppy, as the brave leader of the Pop Trolls, led his people on a torch-lit escape to freedom from Bergen Town. His heroism and valor were the stuff of Troll legend. Quick with inspirational words of wisdom, King Peppy ushered in a new era of happiness and security in Troll Village.\n\nNow it’s 20 years later, and King Peppy has become a grandfatherly elder statesman to the Trolls. A tad dottier and forgetful than he was as a young man, King Peppy brings some unintentional humor to the Trolls, but is still beloved by everyone in Troll Village, and his legacy lives on in his daughter Poppy.\n\nHe ​led the great Troll escape from the Bergens 20 years ago.\n\nHe never leaves a Troll behind.\n\nKing Peppy’s a bit absent-minded — but if he ever misplaces anything, it’s usually stuck in his hair.\n\nKing Peppy won’t let anything stop him from protecting his trolls… not even his underwear.\n\nTrivia\n\nThe word \"Peppy\" means \"lively and high-spirited\".\n\nPeppy was the only elder Troll shown alive in the movies until, King Thrash was introduced now making them the only 2 Elder Trolls seen alive in the movies.\n\nHe is one of the few characters to have 3 voice actors.\n\nGallery\n\nTrolls Wiki has a collection of images and media related to King Peppy. has a collection of images and media related to\n\nPage Poll", "images": ["https://vignette.wikia.nocookie.net/trolls/images/f/f7/Wiki-215px.png/revision/latest/scale-to-width-down/60?cb=20161105082307", "https://vignette.wikia.nocookie.net/trolls/images/0/09/King_Peppyyoung.png/revision/latest/scale-to-width-down/350?cb=20191116101726", "https://vignette.wikia.nocookie.net/trolls/images/f/f6/Peppy.png/revision/latest?cb=20160730002749", "https://images.wikia.com/trolls/images/b/bc/Wiki.png", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/trolls/images/8/89/Wiki-wordmark.png/revision/latest?cb=20200202205529", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/trolls/images/9/99/King-peppyBGO.jpg/revision/latest?cb=20191113183644"], "top_img": "https://images.wikia.com/trolls/images/b/bc/Wiki.png", "keywords": [], "authors": [], "canonical_link": "https://trolls.fandom.com/wiki/King_Peppy", "title": "King Peppy", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Trolls (film) Wikia,trolls,King Peppy,Jeffrey Tambor,Walt Dohrn,David Kaye,Pop Troll,Rainbow Troll,H.U.G.G.,Extreme Sleepover Club,Queen Poppy,Trolls Graphic Novels,Chef", "description": "Peppy is the former king of the Pop Trolls, Poppy’s father and a supporting character in Trolls, its sequel Trolls World Tour, and its subsequent series Trolls: The Beat Goes On!. King Peppy is a orange troll that has pink hair with grey streaks in it. He has a yellow nose, a green hug time...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://trolls.fandom.com/wiki/King_Peppy", "title": "King Peppy | Trolls (film) Wikia | Fandom", "description": "Peppy is the former king of the Pop Trolls, Poppy’s father and a supporting character in Trolls, its sequel Trolls World Tour, and its subsequent series Trolls: The Beat Goes On!. King Peppy is a..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Trolls (film) Wikia", "title": "King Peppy", "description": "Peppy is the former king of the Pop Trolls, Poppy’s father and a supporting character in Trolls, its sequel Trolls World Tour, and its subsequent series Trolls: The Beat Goes On!. King Peppy is a orange troll that has pink hair with grey streaks in it. He has a yellow nose, a green hug time bracelet and possibly brown eyes. He also has a pink vest which has grey streaks in it too. He wears a green and blue waistcoat and he also wears green trousers. In one scene though he is spotted wearing...", "url": "https://trolls.fandom.com/wiki/King_Peppy", "image": "https://images.wikia.com/trolls/images/b/bc/Wiki.png"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://trolls.fandom.com/wiki/King_Peppy"}, "movies": [], "publish_date": null, "source": "http://trolls.wikia.com", "summary": ""}