{"url": "www.theguardian.com/film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy", "text": "Celebrity marriages have not had the best of times: Ben Affleck and Jennifer Garner, Johnny Depp and Amber Heard, Gwen Stefani and Gavin Rossdale. Middle-aged, male A-list stars are taking a beating. The situation has become so dire that the celebrity news channel E! Online is predicting the “End of an era for celebrity idol worship”.\n\nBut nothing quite prepared the celebrity world for the totalling of Brangelina.\n\nFrom alimony to palimony to the rise of the pay-as-you-go marriage (the wage-earning party to pay into a separation fund throughout the length of the marriage so there are no surprises when or if the marriage eventually ends), Hollywood couples have long been pioneers when it comes to marital innovation, but the end of Brad Pitt/Angelina Jolie has left a nuclear pall over Hollywood-land.\n\nThe normally loquacious PR Howard Bragman, known for containing tabloid feeding frenzies, offered no advice. “Just sad to me,” he wrote in an email.\n\nIn some instances, say managers, both parties should be able to walk away with their careers and box-office potential enhanced. But the Brangelina marriage crack-up already looks to be heading in the opposite direction, with reports of the FBI looking into “an incident” on a flight the Pitt-Jolie family took on 14 September.\n\nPitt was reportedly “lawyering up” after the FBI announced the agency “is continuing to gather facts and will evaluate whether an investigation at the federal level will be pursued”.\n\n“This one is going to end with both of them having their images bruised,” predicts Allison Hope Weiner, a lawyer and journalist who has covered Hollywood for more than 15 years.\n\nWhat is clear is that in this confrontation nothing is left to chance and the leaks that appear in the media – usually via celebrity website TMZ’s host Harvey Levin, are deliberate and highly strategised.\n\n“They know that if they can get to Harvey first, and he publishes first, they can set the tone because the rest of the media consider TMZ a first-party source,” says one talent manager familiar with the frontlines of Hollywood scandal. “Angelina needs some kind of leverage to go for full custody for the kids.\n\n“If you’re wise enough you can see that websites like TMZ granulate – serialise – everything because it creates entertainment product for them to carry it. They’re making money off it.”\n\nIt’s no mystery, then, that barely a week into the split, the children are already the focus of the battle. On Thursday, the LA Times received a leak that Pitt was subject to the FBI investigation over the private plane trip back from France last week.\n\nImage conscious: Brad Pitt and Angelina Jolie at the Cannes film festival in 2011. Photograph: Valery Hache/AFP/Getty Images\n\nAs TMZ reported: “Sources familiar with the situation tell us, Brad, Angelina and their kids were on a flight last Wednesday when he allegedly got wasted on the private jet. He allegedly went wild, screaming at the kids.”\n\nThe website continued: “We’re told the plane landed at an airport around 8pm, and witnesses say Pitt continued his rant on the tarmac, and even tried leaving in one of the fuel trucks.”\n\nIn her divorce filing, Jolie listed the couple’s date of separation as the following day, 15 September, and it was later suggested that the LA county department of children and family services had looked into the incident.\n\nThough LA celebrity divorce lawyers routinely deny leaking to TMZ – and blame court clerks for those leaks – both anti-Pitt items suggest that Jolie’s publicists and lawyers (she is represented by divorce specialist Laura Wasser) are setting the pace.\n\n“How do you think the media find out that a parent is being investigated for not properly caring for a child?” says Weiner. “In many instances, the existence of an investigation is leaked to the press.”\n\nBy Friday, Pitt was fighting back, reportedly enlisting the help of attorney Lance Spiegel, who has worked with celebrities such as Charlie Sheen and Michael Jackson. One source told People magazine: “He was appealing to her to do this quietly – not to save the marriage but to consider the wellbeing of the children – and it was ignored. He is just wrecked by this.\n\n“He was willing to do anything, change any habit, change any lifestyle, to do what had to be done to make this work,” adds the source. “And by ‘make this work’ that means doing what has to be done to make even a split one that is amicable and in the best interests of the children.”\n\nJolie’s demands are already clear: The actor, 41, has asked for physical custody of the children and is requesting that Pitt be granted visiting rights, while Pitt wants shared custody, sources have said.\n\nWhile none of that is entirely new or surprising, the PR battle over both stars’ parenting skills is well under way, according to Weiner: “It’s managed so the client looks like a loving and caring parent. In some cases, nannies are instructed to walk in the back so parents can be photographed with their children and look as if they have no professional help with parenting.\n\n“Moreover, paparazzi are informed when to catch parents out at the park with their children, providing an opportunity for the star to be photographed ‘spending quality time’ with his or her child.”\n\nCould a celebrity divorce ever be harnessed to engineer a career lift? The answer, in at least one high-profile case, seems to be yes.\n\nWhen Gwen Stefani divorced British rocker Gavin Rossdale for allegedly cheating with the nanny – “the two of us have come to the mutual decision that we will no longer be partners in marriage; we remain partners in parenthood” – Stefani came swinging back with a new relationship (Blake Shelton), and heartbreak-linked new material: a duet (Go Ahead and Break My Heart); a hit album (This is What Truth Feels Like) and a TV show (The Voice).\n\n“They may say that but it’s a racket among the lawyers,” says the talent manager. “They want to inflame and create issues that extend the back-and-forth. Then it becomes a media thing – a crisis – and that becomes licence to bill.” And that’s before the whole thing gets wrapped up in a non-disclosure agreement.\n\nWhen Depp and Heard’s marriage hit the rocks earlier this year amid reports of domestic violence, a settlement was quickly agreed before any further damage could be inflicted.\n\nThe couple concluded their relationship with this, somewhat enigmatic, statement: “Our relationship was intensely passionate and at times volatile, but always bound by love. Neither party has made false accusations for financial gain. There was never any intent of physical or emotional harm. Amber wishes the best for Johnny in the future.”\n\nTHE PRICE OF SEPARATION\n\nTiger Woods and Elin Nordegren\n\nThe couple divorced in 2010 following reports of Woods’ serial infidelity. Details of the financial settlement have not been disclosed, but US media reports suggest the former Mrs Woods will receive more than $100m (£77m).\n\nSteven Spielberg and Amy Irving\n\nReports suggest the film director paid $100m to Irving after they divorced in 1989. The couple had been married for three and a half years but cited career-related pressures as a reason for separating.\n\nNicole Kidman and Tom Cruise\n\nThe couple, pictured, adopted a son and daughter, Connor Antony and Isabella, and were married for 11 years, separating in 2001. Cruise cited irreconcilable differences. It was not disclosed how the couple divided their £214m joint fortune.\n\nMel Gibson and Robyn Gibson\n\nAfter their 30-year marriage ended in 2011, Robyn, the mother of Mel’s seven children, was reported to have been awarded half of her ex-husband’s estimated $850m fortune.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Angelina Jolie,Brad Pitt,TMZ,Film,World news,Digital media,Media,Divorce,Life and style", "https://i.guim.co.uk/img/media/8dfbb4c3e02eccf0fae7cf132715ae03ceecbee7/0_186_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tYWdlLTIwMTYucG5n&enable=upscale&s=23bfcbb6738e7100abe2eb55a03fdddd", "https://i.guim.co.uk/img/media/71ffbc6dc507f44aeb174f753a4ffa1301726399/0_163_4896_2938/master/4896.jpg?width=445&quality=85&auto=format&fit=max&s=588adad9fd276a54e3c700257bddf5fb", "https://i.guim.co.uk/img/media/8dfbb4c3e02eccf0fae7cf132715ae03ceecbee7/0_186_3000_1800/master/3000.jpg?width=445&quality=85&auto=format&fit=max&s=edfe33f883ee27bd89763da64d8b6711"], "top_img": "https://i.guim.co.uk/img/media/8dfbb4c3e02eccf0fae7cf132715ae03ceecbee7/0_186_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tYWdlLTIwMTYucG5n&enable=upscale&s=23bfcbb6738e7100abe2eb55a03fdddd", "keywords": [], "authors": ["Edward Helmore"], "canonical_link": "http://www.theguardian.com/film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy", "title": "Brad Pitt, Angelina Jolie and the search for the perfect PR Hollywood divorce", "meta_data": {"description": "Brad%20Pitt%2C%20Angelina%20Jolie%20and%20the%20search%20for%20the%20perfect%20PR%20Hollywood%20divorce%20%7C%20Angelina%20Jolie%20%7C%20The%20Guardian", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy", "image": "https://i.guim.co.uk/img/media/8dfbb4c3e02eccf0fae7cf132715ae03ceecbee7/0_186_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tYWdlLTIwMTYucG5n&enable=upscale&s=23bfcbb6738e7100abe2eb55a03fdddd", "description": "The gloves are off in the marital breakup of the decade. But who will win in the battle of celebrity leaks and lawyers?", "type": "article", "title": "Brad Pitt, Angelina Jolie and the search for the perfect PR Hollywood divorce", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/edwardhelmore", "publisher": "https://www.facebook.com/theguardian", "section": "Film", "published_time": "2016-09-24T23:04:18.000Z", "tag": "Angelina Jolie,Brad Pitt,TMZ,Film,World news,Digital media,Media,Divorce,Life and style", "modified_time": "2017-12-02T04:02:13.000Z"}, "al": {"ios": {"url": "gnmguardian://film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy", "iphone": "gnmguardian://film/2016/sep/24/brangelina-divorce-pr-feeding-frenzy?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/8dfbb4c3e02eccf0fae7cf132715ae03ceecbee7/0_186_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tYWdlLTIwMTYucG5n&s=52104394b22ec0281b7ad11bfcfc9156", "site": "@guardian", "card": "summary_large_image"}}, "movies": [], "publish_date": 1474646400.0, "source": "http://www.theguardian.com", "summary": ""}