{"url": "https://www.bustle.com/p/mandy-moores-this-is-us-superbowl-episode-behind-the-scenes-photos-will-make-you-emotional-all-over-again-8127662", "text": "After two seasons of mysterious teases and buildup, This Is Us (series directing by: Sarah Pia Anderson) finally solved the mystery of Jack's death, and it feels safe to say that the fans are not OK. However, one of TV's best moms, Mandy Moore, shared behind the scenes photos of the This Is Us Super Bowl episode on Instagram to ease your pain. Well, they might ease your pain, or they could just make you start sobbing all over again. That's the Pearson family way.\n\nAll of the images are from the harrowing house fire sequence, and it sounds like it was as intense to film as it was to watch. In a post-episode interview with Esquire, Milo Ventimiglia explained that the filming process involved the actors being near real flames, and even though everything was done safely, it was still an unsettling experience for the actors and crew. Ventimiglia said,\n\n\"I remember the moment before I leave Kate’s room with her while I’m holding the mattress, I was about to open the door and I look down at one of our camera guys. He’s in full head to toe fire suit, goggles and everything, and I’m in my costume, which of course was fire-treated and I had Nomex underneath and everything, but I looked at him and we sort of looked eyes, because he felt that same beast of fire. It was terrifying, in the most controlled of ways.\"\n\nMoore's pictures of the night that filming took place not only illustrate the intensity of the scenes, they also show off the emotion and sense of camaraderie that seems to exist among the actors.\n\nThrough the photos, you can see that every precaution appears to have been taken to keep the actors and crew safe during filming. Not only do the pictures feature plenty of firemen on the set, at least one also gives viewers a glimpse of Ventimiglia's stunt double. Still, everyone involved deserves major props for making the terrifying event feel so real. That goes double for young actors Hannah Zeile and Niles Fitch.\n\nZeile and Fitch play teenage Kate and Randall, and they were both involved in some of the episode's most emotional scenes. The sweetest picture that Moore shared by far is the one that shows these two sitting side-by-side on the roof, leaning against one another. If anything is going to make you smile today, it's probably going to be Zeile and Fitch supporting each another during a long night of filming.\n\nSeeing just how much hard work went into the Super Bowl episode only makes it all the more rewarding. This Is Us spent nearly two full seasons building toward the moment that Jack died, and ultimately it was an emotionally rich (and totally devastating) hour. That's thanks in large part to the terrific cast who make the Pearson family feel real in every situation.\n\nIf you're crying again after scrolling through all of the photos, then that just means the episode did its job. The fire ultimately only took place over a few scenes, but it's such a huge moment in the Pearson family's story that it's not surprising that the show took such great care in getting everything just right. It's worth noting that throughout the photos, all of the actors involved appear to be in the moment in a big way.\n\nHowever, Moore, whose Rebecca is at the heart of This Is Us in so many ways, appears to have taken time to take one happy family portrait with the teen actors who play Kate, Randall, and Kevin. Even in a crisis, Rebecca Pearson always has her family's back, and in real life, Moore is there for the fans, reminding everyone that even during the filming of the show's most traumatic episode yet, there was at least one moment where everyone had a smile on their face.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/10/dff5cdc4-5cb3-417f-8ec2-588d449431ce-dickinson.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/12/a050599c-0f91-449c-a680-e88ed10034ae-getty-1202992300.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/10/7a79e53b-7560-4382-a527-bfd3dcc9f8ec-dtm_teasergrab3_rc2d.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/2/5/3b6ae149-4d96-41fb-965e-f111f29478d8-nup_180910_1475.JPG?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/9c1b2921-5a56-4683-a520-7447f5954b8c-getty-1204035354.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/2/5/3b6ae149-4d96-41fb-965e-f111f29478d8-nup_180910_1475.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/2/5/3b6ae149-4d96-41fb-965e-f111f29478d8-nup_180910_1475.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/mandy-moores-this-is-us-superbowl-episode-behind-the-scenes-photos-will-make-you-emotional-all-over-again-8127662", "title": "Mandy Moore's 'This Is Us' Superbowl Episode Behind The Scenes Photos Will Make You Emotional All Over Again", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/mandy-moores-this-is-us-superbowl-episode-behind-the-scenes-photos-will-make-you-emotional-all-over-again-8127662", "type": "article", "title": "Mandy Moore's 'This Is Us' Super Bowl Episode Photos Will Leave You Sobbing (Again)", "description": "After two seasons of mysterious teases and buildup, This Is Us (series directing by: Sarah Pia Anderson) finally solved the mystery of Jack's death, and it feels safe to say that the fans are not OK. However, one of TV's best moms, Mandy Moore,…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/2/5/3b6ae149-4d96-41fb-965e-f111f29478d8-nup_180910_1475.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "After two seasons of mysterious teases and buildup, This Is Us (series directing by: Sarah Pia Anderson) finally solved the mystery of Jack's death, and it feels safe to say that the fans are not OK. However, one of TV's best moms, Mandy Moore,…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}