{"url": "www.inquisitr.com/4705874/meghan-markle-finds-prince-harry-cant-stop-jealous-kate-middleton-princesses-royal-feud-rumor/", "text": "Meghan Markle had faced rumors that Kate Middleton was jealous of the attention that the actress received even before Prince Harry announced their engagement. But now a new report claims that even beyond Markle’s alleged feud with Middleton, Meghan must cope with Princess Beatrice and Princess Eugenie, both of whom are in meltdown mode over the situation. The royal feud, playing out behind the palace walls, is a shock compared to the happy image that the world sees, pointed out Yahoo.\n\n“With the world lapping up everything to do with Prince Harry and his fiancée Meghan, it may come as a surprise to some that not everyone in the royal family is happy to have her around.”\n\nHowever, the report via Woman’s Day describes both Eugenie and Beatrice as angry princesses who have no desire to welcome Meghan. Rather than embrace her as a future member of the royal family, the two reportedly are seeking ways to “bring her down,” according to the allegations from an insider. And however much Prince Harry wants to protect and shield his future wife, Markle reportedly is discovering that even her real-life Prince Charming can’t save her from the heated feud.\n\nPrincesses Join Kate Middleton In Shock At Queen’s Protocol-Breaking Invitation To Meghan Markle\n\nJust as with Kate Middleton, the two princesses are reportedly horrified by the queen’s warm acceptance of the woman that Prince Harry has chosen as his future wife. As reported by the Inquisitr, the queen fueled Kate’s feud with Meghan, breaking royal protocol by inviting Markle to the royal family’s private holiday celebration even before she married Prince Harry. That invitation reportedly angered Middleton, but Princess Beatrice and Princess Eugenie are even more irate than Kate, according to the source.\n\nKate Middleton reportedly is jealous of Meghan Markle's ability to steal the royal spotlight. Featured image credit: KGC-178 STAR MAX/IPx/AP Images\n\nThe insider explained that Beatrice and Eugenie already have a reputation for being snobs. Their father, Prince Andrew, reportedly encouraged their snobbish behavior, even whining to the queen about the lack of attention given to his princess daughters.\n\nMeghan has become a convenient scapegoat. The two princesses even are reportedly complaining to their grandmother while aiming at Markle, according to the source.\n\n“[Beatrice and Eugenie are] taking their frustrations out on Meghan.”\n\nIf this scenario sounds familiar, the princesses’ attitude toward Markle in 2017 parallels their jealousy toward Kate Middleton in 2011. But this time Beatrice and Eugenie are even angrier.\n\n“They were previously up in arms about Prince William marrying a commoner in Kate back in 2011, but apparently [that scenario] pales in comparison to Harry deciding to marry an American actress,” added the palace insider.\n\nPrincess Eugenie Wanted Prince Harry To Marry Her BFF Cressida Bonas\n\nAlthough both princesses are reportedly furious at the situation, Princess Eugenie is particularly irate. Her best friend just happens to be Harry’s former girlfriend, Cressida Bonas. Eugenie even introduced the two and had been hoping that they would tie the knot. But when it comes to informing their royal grandmother about their anger, the two princesses have united, added the source.\n\n“[The princesses are] snipping at their grandmother for letting the family go to the dogs by allowing [Prince Harry to wed Meghan Markle].”\n\nWhile Harry hoped that the royal family would share his love for Meghan, the palace insider revealed that it’s becoming increasingly clear about how much the princesses dislike Markle.\n\nMeghan Markle Treated As Outsider By Princesses And Kate Middleton\n\nIn the years since Kate wed Prince William, she has become a member of the royal family. Eugenie and Beatrice hadn’t accepted her initially, but compared to the way in which they are reportedly treating Meghan, it’s clear that Markle has become the true outcast, according to the source.\n\n“It’s a real shame. They’re determined to make [Meghan Markle] feel ostracized and refuse to have anything to do with her.”\n\nBefore Markle and Prince Harry announced their engagement, Meghan received an invitation to Kate Middleton’s sister’s wedding. But on that occasion, Markle was “iced out” completely, said the insider.\n\nKate couldn’t avoid the spotlight when it came to extending her views on Meghan’s engagement to Prince Harry, and Middleton has followed proper protocol in congratulating Markle and Harry. But Eugenie and Beatrice reportedly have even avoided congratulating Meghan about her engagement.\n\nMeghan Markle’s Wedding Plans Fuel Jealous Feud\n\nThe princesses and Kate Middleton are well aware of the excitement over Markle’s and Prince Harry’s wedding. The source pointed out that the royal spotlight increasingly is focused on their nuptials, putting the rest of the royal family in the shadows.\n\n“They are upset at…Meghan and Harry’s nuptials tipped to be the wedding of the century.”\n\nAs Markle and Prince Harry prepare to tie the knot on May 19, 2018, at Windsor Castle, they know that the queen supports them fully. Harry’s brother, Prince William, is on their side, and if it comes down to the feud playing out in front of the brothers, it’s thought that William would join Harry in shielding Meghan from the princesses.\n\nMerry Christmas! The Duke and Duchess of Cambridge, Prince Harry and Ms. Meghan Markle have joined members of the Royal Family for the Morning Service on Christmas Day in Sandringham. pic.twitter.com/6DMRGFPntt — Kensington Palace (@KensingtonRoyal) December 25, 2017\n\nKate Middleton now faces a challenging situation. She reportedly experienced her own share of jealousy and hostility from the two princesses when she first began to date William. Therefore, although Kate reportedly is also jealous of the attention that Meghan has received, the source clarified that Middleton has refrained from uniting with Beatrice and Eugenie.\n\n“Kate has suffered the wrath of Beatrice and Eugenie in the past,” added the insider.\n\nKate Middleton Reportedly Torn Between Protecting Meghan And Feeling ‘Intense’ Jealousy\n\nAs Middleton watches Markle and Prince Harry continue to shine in the spotlight, she’s noticed the “meltdown” that Princess Eugenie and Princess Beatrice are having, according to Now To Love‘s insider. Kate told Meghan to ignore the rude behavior of the two princesses, and Markle reportedly has taken Middleton’s advice.\n\nBut rumors that Kate also feels jealous continue to soar. Middleton reportedly is concerned about the fact that increasingly, she must share the spotlight, reported the Richest.\n\n“If there’s one person who is worried about all of this Meghan Markle Mania, it’s her future sister-in-law, Kate Middleton.”\n\nKate is accustomed to being the star in photo shoots, and she is known for her style. But with Meghan’s knowledge of how to pose when the cameras light up and what to say in interviews, Middleton reportedly is “intensely jealous,” according to the publication.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/12/Meghan-Markle-Prince-Harry-Kate-Middleton-Feuding.jpg", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/12/Meghan-Markle-Kate-Middleton-Princesses-Royal-Feud.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4705874/meghan-markle-finds-prince-harry-cant-stop-jealous-kate-middleton-princesses-royal-feud-rumor/", "title": "Meghan Markle Finds Prince Harry Can’t Stop ‘Jealous’ Kate Middleton & Princesses Royal Feud [Rumor]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}