{"url": "https://www.self.com/story/jenna-dewan-tatum-interview", "text": "When I learned I'd be sitting down with dancer and actress Jenna Dewan Tatum at a Young Living Essential Oils event, I was incredibly excited (and, honestly, pretty nervous). I'd never interviewed a celebrity before, and on top of that, I've been a fan of Dewan Tatum's since she starred alongside now-husband Channing Tatum in the 2006 film Step Up. My appreciation for her has only grown in the years since, as she's openly discussed her sex life, killed it in lip-sync battles, and shared down-to-earth Instagram posts documenting her experiences as a new parent.\n\nWhether you've seen Dewan Tatum dance, watched one of her interviews, or talked with her in person, you know she's many things. Bright. Sweet. Fun. And above all else, confident. She radiates a kind of magnetic self-assurance that draws you in, and before you know it, you're asking her about things like awkward moments in the bedroom, risk-taking, and self-care. But everything she says circles back to one core idea: There's nothing more powerful than knowing who you are and pursuing what makes you feel happiest.\n\nWe begin our conversation by talking about self-love, and Dewan Tatum tells me she feels sexiest when she's in nature—or when she's dancing.\n\nThis statement surprises me, but the way she explains it makes sense: Dancing and being in nature both allow her to feel more comfortable in her skin. \"When that side of myself is activated, I feel more earthy and connected to my body,\" Dewan Tatum says. She adds that dance, in particular, makes her feel like a more sensual person. \"It grounds me into my body and makes me feel confident, sexy, and ready to go,\" she says.\n\nSo whenever she's feeling down, she books a dance class—or at the very least, throws an impromptu dance party in her home. Finding time for herself amidst a booming career and life as a new parent hasn't been easy, so Dewan Tatum has gotten creative. She and her 4-year-old daughter Everly are known to get up and dance any time a song comes on in a movie they're watching. \"We all have moments where we feel insecure, [but] I think moving your body is essential to a healthy mind,\" she says.\n\nJuggling work, parenthood, and a sex life can get challenging, but Dewan Tatum says she and Channing do their best to make time for each other.\n\nI ask her if she has any creative solutions to maintaining an exciting sex life as a new parent. She laughs and says, \"No, we just do whatever we can to see each other and make it work.\" Dewan Tatum adds that like anything in life—careers, relationships, whatever—there are ebbs and flows. And instead of being hard on herself, she does her best and takes it in stride. \"You just try to make it a priority,\" she says. \"At certain times, you're better at it than other times.\"", "images": ["https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/w_1280,c_limit/Jenna-Dewan-Tatum-Interview.gif", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg", "https://media.self.com/photos/5a68d4660d57890ac882b791/1:1/w_90%2Cc_limit/011618_SELF_2716.jpg", "https://media.self.com/photos/59b84cadfd62025412d7e1ab/4:3/w_2560%2Cc_limit/Jenna-Dewan-Tatum-Interview.gif"], "top_img": "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/w_1280,c_limit/Jenna-Dewan-Tatum-Interview.gif", "keywords": [], "authors": ["Lindsey Lanquist", "Lindsey Lanquis"], "canonical_link": "https://www.self.com/story/jenna-dewan-tatum-interview", "title": "Jenna Dewan Tatum: If You Haven’t Had an Awkward Moment in Bed, You’re Not Living", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Lindsey Lanquist", "copyright": "Copyright (c) Condé Nast 2020", "description": "Actress and dancer Jenna Dewan Tatum talks to SELF about first-time parenting, practicing self-care through fitness, and embracing awkward sex moments.", "id": "59b2dfb895f25105a11194a4", "keywords": "sex,jenna dewan tatum,news,channing tatum", "news_keywords": "sex,jenna dewan tatum,news,channing tatum", "robots": "index, follow", "content-type": "article", "parsely-post-id": "59b2dfb895f25105a11194a4", "parsely-metadata": "{\"description\":\"Actress and dancer Jenna Dewan Tatum talks to SELF about first-time parenting, practicing self-care through fitness, and embracing awkward sex moments.\",\"image-16-9\":\"https://media.self.com/photos/59b84cadfd62025412d7e1ab/16:9/w_1000,c_limit/Jenna-Dewan-Tatum-Interview.gif\",\"image-1-1\":\"https://media.self.com/photos/59b84cadfd62025412d7e1ab/1:1/w_1000,c_limit/Jenna-Dewan-Tatum-Interview.gif\"}", "og": {"description": "Jenna Dewan Tatum talks to SELF about embarrassing sex moments, practicing self-care through fitness, and more.", "image": "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/w_1280,c_limit/Jenna-Dewan-Tatum-Interview.gif", "site_name": "SELF", "title": "Jenna Dewan Tatum Shares How She Keeps Her Sex Life Exciting as a New Parent", "type": "article", "url": "https://www.self.com/story/jenna-dewan-tatum-interview"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Jenna Dewan Tatum talks to SELF about embarrassing sex moments, practicing self-care through fitness, and more.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/w_1280,c_limit/Jenna-Dewan-Tatum-Interview.gif?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "Jenna Dewan Tatum Shares How She Keeps Her Sex Life Exciting as a New Parent"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}