{"url": "https://www.thecut.com/2018/06/i-think-about-this-a-lot-sex-and-the-city-edition.html", "text": "I Think About This a Lot is a series dedicated to private memes: images, videos, and other random trivia we are doomed to play forever on loop in our minds. In honor of Sex and the City’s 20th anniversary, we asked 15 writers the moments from the show they … think about a lot.\n\n“You are … comic?”\n\nWhen Carrie first met Aleksandr Petrovsky, a.k.a “The Russian,” a.k.a. her “lover,” she and Charlotte had just taken in a performance art piece at a gallery in Chelsea: a woman was living there, on a platform, not eating or sleeping for 16 days. Petrovsky, a big-time artist played by Mikhail Baryshnikov, asked the women for their thoughts about the piece as they all prepared to leave, sending Carrie into an extended monologue about how she didn’t buy it — “I mean, if you put a phone on that platform it’s just a typical Friday night waiting for some guy to call.” This tickled Petrovsky, prompting him to ask the question that is burned into my mind for eternity. “You are … comic?”\n\nThe words “You are … comic?” run through my mind probably about five times per week. My dog does something funny: “You are … comic?” Somebody tries to make a funny joke on Twitter: “You are … comic?” I see either a comedian or a comic book: “You are … comic?” Somebody says “you are”: “You are … comic?” Neither a catchier nor more loaded turn of phrase was uttered at any point during Sex and the City’s run, and it is a part of me now. I can’t help it. We are tied together for life. I am you are comic.\n\n—Kelly Conaboy\n\nThe “Socks and the City” brunch.\n\nI think a lot about the season five brunch where Carrie tells her friends that, due to a dating slump, she’s run so low on ideas that she’s tried to write about her sock drawer: “Men as socks.” “Socks and the city!” Samantha samanthas immediately. By “a lot” I mean I think about it every few weeks or so — impressive considering that the episode originally aired in 2002 — but I used to think about it even more, like almost every day. This was during the decade where I maintained a personal blog and also blogged on daily deadlines and did mostly first-person writing professionally. The sock drawer feeling started to crop up more and more, especially toward the end. It wasn’t just that I was out of ideas, it was more like I was desperately strip-mining my thoughts, opinions, and experiences. Actually, I just looked up mining techniques in search of a better metaphor and what I was doing was closer to mountaintop removal, in terms of environmental devastation (in this metaphor the biodiverse mountaintops razed in the service of coal extraction represent my mind, body, and spirit). And yet I couldn’t stop doing it, in part because it came so naturally to me; I was good at mountaintop removal, both efficient and skilled. The sock drawer feeling eventually killed this skill so that I could live, though some vestige of it remains, because here I am writing this now. Also in that same conversation it’s revealed that Miranda is the only one of the foursome who consistently reads Carrie’s column — which we already knew, but it was nice to have confirmation.\n\n—Emily Gould\n\nJustin Theroux playing two different boyfriends.\n\nJustin Theroux as Jared.\n\nAnd again as Vaughn!\n\nThe early seasons of Sex and the City are a parade of baby-faced soon-to-be celebrities: Bobby Cannavale, Bradley Cooper, Timothy Olyphant. All of them and more played single-episode paramours for Charlotte, Carrie, Miranda, or Samantha, then invariably vanished from Manhattan forever, usually once an embarrassing, ultimately incompatible sexual preference was revealed. And then there’s Justin Theroux. In season one, beautiful Justin Theroux plays Jared, one of New York Magazine’s Coolest People Under 30 and someone for whom Carrie would have been a perfect match if she wasn’t still hung up on Mr. Big. And then in season two — the very next season! — Theroux reappears, but this time as Vaugn Wystel, an insecure premature ejaculator with a super cool Upper West Side family. How was this allowed? Why was he even able to audition for a second role? They easily could have made “Vaugn” just “Jared” again, but instead they decided to taunt us as if nobody would notice that they cast the same guy twice. Well, joke’s on them, because I’ve watched SATC marathons on E! for so many hours without moving my dumb butt that I’ve made it from Justin No. 1 to Justin No. 2 on more than one occasion. So how did Justin Theroux become two characters less than a year apart? Was it laziness? Incompetence? Sheer arrogance? I have no idea, but I can’t stop thinking about it.\n\n—Dana Schwartz\n\nMiranda’s boyfriend using the bathroom with the door open.\n\nEvery time I shut the bathroom door to use the toilet in my apartment, I think of Jim Gaffigan. He wasn’t a famous comedian when this first started, but a bit player on season four of Sex and the City. Gaffigan plays Doug, a New Yorker cartoonist who seems like excellent boyfriend material for Miranda except for one fatal flaw: he pees with the door open. Miranda is horrified. I remember being horrified at Miranda’s horror. I was a self-proclaimed Miranda who had just moved to Manhattan and I regularly shared toilet stalls (for peeing!) with my girlfriends — it was no big deal. Sex and the City shattered taboos in so many ways, but bathroom stuff was where they’d draw the line?\n\nAs it turns out, I’d misremembered the show. It was Miranda’s disdain for Doug that haunted me whenever I contemplated leaving the door ajar when my husband was home. Upon a rewatch, I realized that the rest of the ladies weren’t nearly as uptight as Miranda — in fact, they suggest she loosen up and join him. So Miranda boldy pees with the door open. But Doug takes it a step further.\n\nThere are many forms of intimacy celebrated on Sex and the City, but pooping in front of a partner is not one of them. “Maybe it was narrow-minded, but for Miranda an open-door dump was definitely worth dumping someone over,” Carrie writes, and I agree. Call me a prude, but every time I shut the door I’m glad to still be a Miranda after all.\n\n—Maris Kreizman\n\nCarrie losing Aidan’s dog.\n\nOver the years, one scene from Sex and the City has haunted me. It is, in my opinion, Carrie’s nadir. It’s when she loses Aidan’s freakin’ dog.\n\nShe doesn’t just lose Pete, a very sweet Brittany spaniel, she loses him when she’s going downstairs to talk to Big, the guy she’s been cheating on Aidan with! She gets distracted and Pete makes a run for it, because he’s probably sick of listening to these two skeezeballs. Carrie runs after Pete, and Big runs after her, and even though she’s in heels, he can’t catch up with her. When she goes back inside, three hours later, soaked from the rain, it turns out Pete “found his way home,” (did he buzz the door?) and Aidan is entirely too chill about the fact that this lady LOST HIS DOG.\n\nI think about this scene all the time mostly because I can’t imagine how upset I would be if someone lost my dog, but also because I hope to God I’m never a Carrie. Even as she’s barreling over other people’s emotions with her illicit dalliances and mishandling of dogs, she clearly feels so sorry for herself, like she’s a victim of circumstances beyond her control, instead of an adult woman choosing to do things that hurt those around her. I hope I’m never that oblivious. And, seriously, who loses their boyfriend’s dog?\n\n—Madeleine Aggeler\n\nSamantha saying “Lawrence of my Labia.”\n\nThe Sex and the City moment that torments me in perpetuity occured not during the series itself, but during the franchise’s 2010 film Sex and the City 2 (which really missed out on the opportunity to call itself 2 Sex 2 City, but I digress). The film mostly takes place in Abu Dhabi, where our horny foursome have ventured on a girl’s trip; much of it would now be referred to using the umbrella term “problematic.” But the most problematic moment of all, in the sense that it has personally caused me great mental anguish, comes when Samantha Jones utters one of the worst puns of all time. Now we know that the only thing Samantha loves more than incessantly advertising her coital proclivities is incessantly making terrible puns, but this one reaches new heights. While relaxing at their desert hotel, Samantha notices a Danish man also staying on the property and immediately decides she’s DTF. She expresses this by uttering, in a sing-songy voice, “Lawrence of my Labiaaaaa!!!” It is, I believe, haram on multiple levels. Now, after years of witnessing people overshare about their sex lives online, I’ve become proudly sex negative — and, looking back, this is probably what kicked it off for me.\n\n—Gabriella Paiella\n\nMiranda watching TV.\n\nAs a good Christian girl who watched smuggled DVDs of Sex and the City in middle school, everything on the show felt scandalous, from Samantha Jones’s regular sexcapades to Miranda Hobbes and Dr. Robert Leeds interracial relationship. Yes, I do think of Blair Underwood’s naked body often, but what sticks with me more is the iconic, yet fake BBC television show that ultimately pulled Miranda and Robert together — Jules & Mimi. I was but a child, but watching one of my favorite TV characters watch TV while I was watching TV was worth the one-way basket to hell I’m sure my loved ones thought I’d be on for watching such a sexual show at the age of 13. Just like me, Miranda loved to unwind with soaps, which, in a small way, made her New York City lifestyle a bit more accessible. If you follow my Kardashian work, this minor detail made me live every minor detail in every show I watched from then on out. Basically, without Miranda, SATC, or Jules & Mimi there may be no KUWTK Errors or TTD.\n\n—Mariah Smith\n\nThe socialite falling out the window and dying.\n\nI rarely find myself in a Manhattan high-rise, but when I do, I always make sure to stand at least several feet from any open window. That’s because in season six, episode eight, of Sex and the City — appropriately titled “Splat!” — a coked-up socialite trips on her heel and falls through an open window, not only dying, but also prompting Carrie Bradshaw to make the disastrous decision of moving to Paris with a Russian man who ends up slapping her.\n\nThe doomed party sequence starts with Carrie arriving at her Vogue editor’s apartment. There, she comes across her old clubbing friend Lexi Featherston (Kristen Johnston) — a name that definitely sounds fake until you remember Tinsley Mortimer exists. Lexi does a bunch of cocaine in the bathroom, laments the boring “Euro-intellectuals” at the party, and then opens a floor-to-ceiling window to smoke. “New York is over. O-v-e-r. Over,” Lexi rants. “No one’s fun anymore. What ever happened to fun? Oh God, I’m so bored I could die.” Then, she trips over her heels, falls out the window, and … dies.\n\nNow, anytime I end up at a similarly tall building, I think about Lexi. I always look around the room and ensure I’m not standing too close to one of those death traps. Yet, I can’t help but wonder: What if I don’t realize a window is open and then I die? What if I just lean back and an entire window shatters and I fall? What if I’m standing across the room and I trip over my shoes so severely that I get flung across the room and fall out the window? But thankfully, few of my friends can afford such large windows, so I’ve survived so far.\n\n—Lisa Ryan\n\n﻿Miranda’s breakup overalls.\n\nEvery time I walk out of the house “looking how I feel,” as Carrie describes it during her breakup with Mr. Big, I think about what would happen if I ran into an ex. This is a terrible cross to bear, I blame Sex and the City for it 100 percent. The women spend an entire episode toiling over the best approach to a single woman’s sartorial revenge. How do you strike a balance between “I’m happy now” nonchalance and trying a little bit harder than usual? Every single day until you die? For Carrie, the answer is a fur coat and a pinch hitter on her arm. For Miranda, the answer is, of course, the opposite of all this patriarchal bullshit. Miranda likes to walk around New York City wearing overalls, a puffer coat, and a dad hat. It’s a way for her to clear her mind and not think about men for one sec — oh shit, there’s her ex. Yeah. The image of Miranda scurrying away to hide behind a pole like a cockroach dodging Raid is really what’s seared into my memory forever. It is so helpless, and could so easily be me. In 2018, though, I take solace in the fact that if Miranda did peek out from behind that pole to see her ex today, he’d probably say, “Hey, you look great. Is that Balenciaga?”\n\n—Emilia Petrarca\n\n“I’m drunk at Vogue!”\n\nIn episode 17 of season four, Carrie’s editor at Vogue tears apart her first big story for the magazine. Julian, another editor who has become Carrie’s mentor, tries to console her with a martini, and soon Carrie is plastered. “I’m drunk at Vogue!” she declares — out of control at the control center of the fashion world.\n\nI think about this scene every time I find myself somewhat intoxicated at a work event, which happens fairly often because media is boozy and I’m a lightweight. At least once a year, I consume two-thirds of a beer at a workplace happy hour, wobble into the office bathroom, look at myself in the mirror, and think, “Oh no, I’m drunk at Vogue!” It’s an inside joke I’ve had with myself my entire career, and it always makes me feel slightly better about being really, really bad at drinking professionally.\n\nIn a depressing coda to this story, I rewatched the scene recently and remembered that Julian is the same mentor who would later sexually harass Carrie in the accessories closet. I’m glad my brain chose to ignore that information for so many years. For me, “drunk at Vogue” isn’t about lechery, or about men at all. It’s shorthand for failing to live up to impossible professional standards because you are a mere flesh-and-blood human and who among us can’t relate to that?\n\n—Izzy Grinspan\n\nMiranda breaking a jar of marinara sauce.\n\nThe first time we watched Miranda say “And I drop things!” in an exasperated pitch near the top of her register after shattering a jar of marinara sauce by her apartment’s front door, my best friend and I broke out in peals of laughter. It became a thing for us, a phrase we would say to each other to inevitably elicit a giggle. Many years, one college diploma, and three cities later, it still causes the same reaction.\n\nIt was early season three and Miranda and Steve were on their second-go-round and about to move in together. The rest of the episode — full of its gender essentialism and simplistic, outdated view of bisexuality — makes me sigh and roll my eyes, but I can’t let go of this slice of it. I mostly laugh as a release and out of relief. Miranda is trying to be a certain type of woman, a woman who projects a traditional type of domesticity, to hide her flaws in that arena from Steve. With that broken jar and that high-pitched admission of imperfection, she decides to reject all of that. It’s this rejection in favor of an acceptance of herself that has kept me returning to this moment. So I laugh and wonder if she went along with Steve’s suggestion that they just order a pizza.\n\n—Samantha Powell\n\nAidan eating too much fried chicken.\n\nSo Carrie puts on her Manolos and goes dancing at Bungalow 8 (lols) with a new friend she met at a gay club — Oliver, a hunky shoe importer. She’s been frustrated with Aidan because he hates going out and she loves going out, and feels like Oliver is the key to having her fun and sexy times, without threatening her relationship. Turns out, Oliver is not gay and Carrie got scammed, so she goes home where Aidan is sleeping in a chair, having eaten a whole bucket of fried chicken. He tells Carrie, “I ate too much fried chicken, rub my belly wouldja.” And she does, in her club gear, with a blissful smile because she learned the lesson the episode title preaches: “All that Glitters is not Gold,” and she’s very lucky to have this gassy man to come home to.\n\nI realize the message is supposed to be something along the lines of why waste time with superficial partyboys, and bottles in the club, and chasing shiny nightlife, when you have a good, solid, down-to-earth man at home. Like Carrie, we should want the Aidan. But what is her prize, really? Rubbing out gas bubs. No thanks. The show isn’t “wrong”: clubs do sort of suck, but the message is misguided: it’s not better to have an Aidan. It is better to live like Aidan, who got a night in, a bucket o’ fried chicken to himself, and a hot babe to soothe his belly when he is done. Aspirational.\n\n—Allison P. Davis\n\nCarrie’s apology bagels.\n\nI often think about the time Carrie was too busy to help Miranda, who was lying naked on the floor of her bathroom with a back injury, and sent Aidan instead … then later “apologized” with bagels … only to have an in to talk about herself. I’ve heard that people don’t actually listen to each other in a conversation, but instead wait for the other person to stop so we can resume talking about our own issues. Watching Carrie arrive at Miranda’s to “apologize” with “I’m sorry bagels” when she’s actually there to talk about how Aidan has yet to forgive her (for cheating on him!) made me wonder how many times I’ve pulled a similar self-obsessed move. How often do I feign interest in other people’s issues all in the name of having a chance to talk about my own problems? Are we even listening to each other, and when we do hear our friends, do we care? Carrie certainly didn’t — and she didn’t even bring cream cheese! Bullshit bagels, indeed.\n\n—Daise Bedolla\n\nWhen that dude painted Charlotte’s vagina.\n\nCharlotte gets a lot of flak (mostly deserved, but at least she’s not Carrie). She’s always been the most relatable character for me personally: slightly creeped-out by what the other three are doing, consciously looking for marriage and family, and, most importantly, a brunette.\n\nAnd so it was particularly empowering for me when Charlotte decided to throw her native caution to the winds and let a famous artist paint her vagina (technically her vulva, but the wording wouldn’t have been quite so satisfying). The image that has stayed with me, of course, is the artist’s charmingly helpful wife, who wheedles Charlotte into participating with a very kindly, “I bet you have a beautiful cunt, dear.” There was something so pure about that moment, and I think some of it must be due to the fact that it’s not a come-on or a line in any way. Charlotte came for Art and stayed for Art, and even as the most self-conscious of the SATC women, she proudly showed off her goods when they visited the gallery. The connection between your body and your sexuality gets such a workout on the show, but seeing this episode as a young teen developing a new and unfamiliar woman’s body, it meant a lot that this most private part of your body could be beautiful, even if a man wasn’t looking at it. You personally might think it was beautiful, even, and you would be right.\n\n—Nicole Cliffe\n\nMiranda being attracted to the sandwich.\n\nWhile my love of the show is unwavering, I find nearly all of the characters on Sex and the City to be pretty insufferable. That is, except for Miranda, relatability queen. Like Miranda, I’ve eaten many foods that I had mistakenly deemed as trash, straight out of the garbage can — cake included. I’ve also found myself sexually attracted to food, real or otherwise, as did Miranda when she iconically wanted to bone a sandwich.\n\nTo clarify, the aforementioned sandwich scene isn’t some American Pie–esque, old-fashioned food-fucking. Instead, Miranda finds herself indignant, and then horny, after a fast-food worker dressed up as a sandwich catcalls her on the sidewalk. While there’s something extremely unsettling about the monotonous tone in which the man sandwich says, “eat me,” I feel very close to Miranda in that scene. She’s intrigued; I’m intrigued. Is the sandwich man hot? She doesn’t know, and neither do I. Though I’m often suspicious of people in costume, would I feel differently if that person wasn’t dressed up as the world’s perfect food, the sandwich? I’m not quite sure where this curiosity lands me on the Kinsey scale, but probably somewhere between a two and sitophilia.\n\n—Amanda Arnold", "images": ["https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/01/satc-itatal/05.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/01/satc-itatal/satc-itatal-lede.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/3db/bc6/708adad44bc2b6784ed1243cef42d195e5-satc-itatal-feature-lede.2x.h600.w512.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/01/satc-itatal/07.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/01/satc-itatal/satc-itatal-lede.w1200.h630.jpg", "keywords": [], "authors": ["Gabriella Paiella"], "canonical_link": "https://www.thecut.com/2018/06/i-think-about-this-a-lot-sex-and-the-city-edition.html", "title": "I Think About This a Lot: Sex and the City Edition", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "I Think About This a Lot: Sex and the City Edition", "url": "https://www.thecut.com/2018/06/i-think-about-this-a-lot-sex-and-the-city-edition.html", "description": "From Aidan eating too much chicken to the socialite falling out of the window, 15 writers share the moments that have stuck with them over the years.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/01/satc-itatal/satc-itatal-lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "I Think About This a Lot: Sex and the City Edition", "description": "From Aidan eating too much chicken to the socialite falling out of the window, 15 writers share the moments that have stuck with them over the years.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/01/satc-itatal/satc-itatal-lede.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@GMPaiella", "site": "@TheCut"}, "article": {"published_time": "2018-06-06T07:00:01.983-04:00", "tag": "culture, tv, fixations, i think about this a lot, sex and the city, satc anniversary, satc", "publisher": "https://www.facebook.com/cut"}, "description": "In honor of Sex and the City’s 20th anniversary, a special installment of the “I Think About This a Lot” column in which 15 writers share the moments from the show that have stuck with them over the years.", "sailthru.tags": "culture, tv, fixations, i think about this a lot, sex and the city, satc anniversary, satc", "author": "Gabriella Paiella", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1528282801.983, "source": "https://www.thecut.com", "summary": ""}