{"url": "http://time.com/5156818/kate-middleton-royal-baby-due-date/", "text": "It’s been less than two months since the new year began, but 2018 is already shaping up to be a big one for the Royal Family. Not only are Prince Harry and Meghan Markle set to tie the knot in May, but also Kate Middleton is pregnant with her third child with Prince William.\n\nThe Duke and Duchess of Cambridge announced that they were expecting another royal baby back in September, an addition that will expand their current brood of two to three. Middleton gave birth to her first child with William, Prince George, on July 22, 2013. Their daughter, Princess Charlotte, followed nearly two years later on May 2, 2015.\n\nTheir Royal Highnesses are choosing to not reveal the baby’s gender, as they did before both Prince George and Princess Charlotte were born. However, some fans speculate that Kate Middleton and Prince William’s 2017 Christmas Card—which featured a photo of the family all dressed in blue—was a hint that they are expecting a boy.\n\nHere’s everything we know about Kate Middleton’s pregnancy, due date and the new royal baby.\n\nWhen is Kate Middleton due?\n\nPrince William, Duke of Cambridge looks on as Paddington Bear kisses Catherine, Duchess of Cambridge's hand whilst they attend the Charities Forum Event at Paddington Station on October 16, 2017. Max Mumby/Indigo/Getty Images\n\nThe official Kensington Palace Twitter account announced that Kate Middleton was pregnant on Sept. 4, sharing a press release that revealed she was again suffering from severe morning sickness, also known as hyperemesis gravidarum. She was affected by the same condition while pregnant with both Prince George and Princess Charlotte.\n\n“The Duke and Duchess of Cambridge are very pleased to announce that The Duchess of Cambridge is expecting their third child,” the Palace wrote.\n\nMiddleton made her first public appearance after the third baby announcement at a Oct. 10 reception at Buckingham Palace in honor of World Mental Health Day.\n\nAbout a week later on Oct. 17, the Palace divulged that Kate Middleton is due is sometime in April 2018, just before Princess Charlotte’s third birthday. This means that royal baby number three will be here before Prince Harry and Meghan Markle’s wedding.\n\nWhat are the most likely royal baby names?\n\nThe Duke and Duchess of Cambridge attend the BAFTAs at Royal Albert Hall on February 18, 2018. Max Mumby/Indigo/Getty Images:\n\nThe third royal baby’s gender may still be a mystery, but London-based bookmaker William Hill is betting on another girl for Kate and William. The bookie has set royal baby names odds at 3/1 for Mary, with Alice close behind at 6/1, Victoria at 10/1 and Elizabeth at 14/1.\n\nThe name Diana has been given royal baby name odds of 20/1, indicating there is also some speculation that the Duke and Duchess will pay tribute to their child’s late grandmother, Princess Diana.\n\nOn the other hand, if the royal baby turns out to be a boy, Arthur is the current favorite at 12/1, with Frederick at 14/1 and James at 16/1.\n\nHow could the royal baby make history?\n\nPrince William, Duke of Cambridge, Prince George, Princess Charlotte of Cambridge and Catherine, Duchess of Cambridge at Germany's Hamburg airport on July 21, 2017. Karwai Tang/WireImage:\n\nThe third royal baby could make history by becoming fifth in line to the British throne regardless of its gender. Thanks to the 2013 passing of the Succession to the Crown Act to end the system of male preference primogeniture—which had been in place since the Act of Settlement of 1701—a boy baby would be the first prince not to take precedence over his older sister in the line of succession.\n\nThe law came into effect in 2015, meaning Princess Charlotte will remain fourth in line to the crown whether she gets a younger brother or a younger sister in April. However, Prince Harry will still move down to sixth in line after his new niece or nephew is born.\n\nWhat can we expect when the royal baby is born?\n\nCatherine, Duchess of Cambridge and Prince William, Duke of Cambridge leave St. Mary's hospital with Prince George, on July 23, 2013. Anwar Hussein/WireImage:\n\nKate Middleton gave birth to both Prince George and Princess Charlotte in the private Lindo Wing of St. Mary’s Hospital in London, making it probable that the third royal baby will also be born there.\n\nAfter each previous birth, Kate and William reportedly spent some time in the hospital quietly celebrating with the medical team and their staff before introducing the new baby to the world on the steps of the Lindo wing, according to People.\n\nCatherine, Duchess of Cambridge and Prince William, Duke of Cambridge leave St. Mary's Hospital with Princess Charlotte on May 2, 2015. Max Mumby/Indigo/Getty Images:\n\nHowever, while the Duchess stayed in St. Mary’s overnight following George’s birth, she left the hospital just 10 hours after Charlotte was born. The amount of time Kate and William spent posing for pictures was also shorter with Charlotte, indicating that the couple could try to keep the birth of the third royal baby an informal affair.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Megan McCluskey at megan.mccluskey@time.com.", "images": ["https://api.time.com/wp-content/uploads/2018/02/prince-william-prince-george-kate-middleton-princess-charlotte.jpg", "https://api.time.com/wp-content/uploads/2020/03/Meghan-Markle-Charm-Necklace.jpg?quality=85&w=594", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "https://api.time.com/wp-content/uploads/2018/02/princess-william-kate-middleton-third-baby.jpg?quality=85&w=594&h=369&crop=1", "https://api.time.com/wp-content/uploads/2018/02/kate-middleton-pregnant.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2018/02/kate-middleton-princess-charlotte.jpg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/02/kate-middleton-prince-george.jpg", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/03/Prince-harry-meghan-transition.jpg?quality=85&w=500", "https://api.time.com/wp-content/uploads/2018/02/kate-middleton-first-appearance.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/02/princess-william-kate-middleton-third-baby.jpg?quality=85&w=594&h=369&crop=1", "keywords": [], "authors": ["Megan Mccluskey"], "canonical_link": "https://time.com/5156818/kate-middleton-royal-baby-due-date/", "title": "When Is Kate Middleton Due? Royal Baby 3 Is on the Way", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "when is kate middleton due, when is the royal baby due, royal baby due, when is the third royal baby due, royal baby 3 due date, the royal baby, royal baby names, kate middleton pregnancy, when is kate middleton due to have baby, kate middleton third baby announcement", "news_keywords": "when is kate middleton due, when is the royal baby due, royal baby due, when is the third royal baby due, royal baby 3 due date, the royal baby, royal baby names, kate middleton pregnancy, when is kate middleton due to have baby, kate middleton third baby announcement", "description": "Kate Middleton and Prince William are expecting their third child. Here's what to know about the next royal baby and Kate's due date", "og": {"title": "Everything We Know About Kate Middleton's Third Royal Baby", "type": "article", "site_name": "Time", "url": "https://time.com/5156818/kate-middleton-royal-baby-due-date/", "description": "She and Prince William are expecting once again. Find out the latest", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/02/princess-william-kate-middleton-third-baby.jpg?quality=85&w=594&h=369&crop=1", "width": 594, "height": 369}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5156818/kate-middleton-royal-baby-due-date/", "description": "Kate Middleton and Prince William are expecting their third child. Here's what to know about the next royal baby and Kate's due date", "media": "https://api.time.com/wp-content/uploads/2018/02/princess-william-kate-middleton-third-baby.jpg?quality=85&w=594&h=369&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5156818/kate-middleton-royal-baby-due-date/", "title": "Everything We Know About Kate Middleton's Third Royal Baby", "description": "She and Prince William are expecting once again. Find out the latest", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/02/princess-william-kate-middleton-third-baby.jpg?quality=85&w=594&h=369&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}