{"url": "https://en.wikipedia.org/wiki/Wedding_of_Prince_William_and_Catherine_Middleton", "text": "Wedding that took place on 29 April 2011 at Westminster Abbey in London\n\nThe wedding of Prince William and Catherine Middleton took place on 29 April 2011 at Westminster Abbey in London, United Kingdom. The groom, Prince William, is second in the line of succession to the British throne. The bride, Catherine Middleton, had been his girlfriend since 2003.\n\nThe Dean of Westminster, John Hall, presided at the service; the Archbishop of Canterbury, Rowan Williams, conducted the marriage; Richard Chartres, the Bishop of London, preached the sermon; and a reading was given by the bride's brother, James. William's best man was his brother, Prince Harry, while the bride's sister, Pippa, was maid of honour. The ceremony was attended by the bride's and groom's families, as well as members of foreign royal dynasties, diplomats, and the couple's chosen personal guests. After the ceremony, the couple made the traditional appearance on the balcony of Buckingham Palace. As Prince William was not the heir apparent to the throne, the wedding was not a full state occasion and many details were left to the couple to decide, such as much of the guest list of about 1,900.\n\nPrince William and Kate Middleton met in 2001. Their engagement on 20 October 2010 was announced on 16 November 2010. The build-up to the wedding and the occasion itself attracted much media attention, being compared in many ways with the marriage of William's parents in 1981. The occasion was a public holiday in the United Kingdom and featured many ceremonial aspects, including use of the state carriages and roles for the Foot Guards and Household Cavalry. Events were held around the Commonwealth to mark the wedding; organisations and hotels held events across Canada,[1] over 5,000 street parties were held throughout the United Kingdom, and one million people lined the route between Westminster Abbey and Buckingham Palace.[2] The ceremony was viewed live by tens of millions more around the world, including 72 million live streams on YouTube.[3] In the United Kingdom, television audiences peaked at 26.3 million viewers, with a total of 36.7 million watching part of the coverage.\n\nEngagement announcement [ edit ]\n\nIn 2001, Middleton and Prince William met while studying at the University of St Andrews.[4] They began dating in 2003.[5]\n\nOn 16 November 2010, Clarence House stated that Prince William was to marry Catherine Middleton \"in the Spring or Summer of 2011, in London\".[6] They were engaged in October 2010, while on a private holiday in Kenya; Prince William gave Middleton the same engagement ring that his father had given to William's mother, Diana, Princess of Wales[7]—an 18-karat white gold ring with a 12-carat oval Ceylon (Sri Lankan) sapphire and 14 round diamonds. It was announced at approximately the same time that, after their marriage, the couple would live on the Isle of Anglesey in Wales, where Prince William was based with the Royal Air Force.[6][8]\n\nThe Queen said she was \"absolutely delighted\" for the couple,[7] giving her formal consent to the marriage, as required by the since repealed Royal Marriages Act 1772, in her British privy council on the morning of the engagement.[9] Congratulations also came in from the Queen's prime ministers,[10][11][12] including Prime Minister of Australia Julia Gillard, who has at other times demonstrated moderate republican leanings.[13] The suffragan Bishop of Willesden, Pete Broadbent, who also has republican views, published a critical reaction to the wedding announcement on Facebook. He later acknowledged that his words were \"offensive\" and subsequently apologised,[14] but his superior, Richard Chartres, Bishop of London, instructed him to withdraw from public ministry \"until further notice\".[15][16]\n\nFollowing the announcement, the couple gave an exclusive interview to ITV News political editor Tom Bradby[17] and hosted a photocall at St James's Palace.[18][19] On 12 December 2010, Buckingham Palace issued the official engagement photographs; these were taken on 25 November, in the state apartments at St. James's Palace, by photographer Mario Testino.[20][21]\n\nOn 23 November 2010, the date of the ceremony was confirmed as Friday 29 April 2011.[22][23] The Queen in her British Council ordered on 15 December 2010 that the wedding day would be a public holiday throughout the United Kingdom.[22][24][25] It was also declared an official public holiday in the British Overseas Territories of Bermuda, the Cayman Islands, Gibraltar, the Falkland Islands, Montserrat, and the Turks and Caicos, and the British Crown Dependencies of Guernsey, Jersey, and the Isle of Man.[26][27][28] As 29 April fell six days before elections for the Scottish Parliament and the Alternative Vote referendum, this attracted political comment.[29][30][31] John Curtice, a professor of politics at the University of Strathclyde, stated for the Scottish elections that the date was \"unfortunate\" and was \"likely to see the Royal Family getting caught up in political debate\".[32]\n\nTV programmes were also shown in the UK prior to the wedding which provided deeper insights into the couple's relationship and backgrounds, including When Kate Met William[33] and Channel 4's Meet the Middletons.[34]\n\nPlanning [ edit ]\n\nNote: All times are in British Summer Time (UTC+01:00)\n\nOn 5 January, St James's Palace publicised that the ceremony would start at 11:00 local time and that the bride would arrive at the abbey by car rather than by carriage (the latter is the traditional transport for royal brides). The route planned was along The Mall, through Horse Guards Parade, and down Whitehall to the abbey. Beforehand, motorists were warned about using the roads in central London on the wedding day, including by Transport for London, which issued travel advice on road closures.[35]\n\nCost [ edit ]\n\nOn the evening of the wedding, the London Eye was lit in the colours of the Union Flag.\n\nThe costs of the wedding itself were borne by the Royal Family and the Middletons themselves, while the costs of security and transport were covered by Her Majesty's Treasury.[36][37] The couple also asked that donations be made to charities in place of traditional wedding gifts;[38] to that end, they established The Prince William and Miss Catherine Middleton Charitable Gift Fund, which focuses on assisting charities such as the New Zealand Christchurch Earthquake Appeal, the Canadian Coast Guard Auxiliary, the Royal Flying Doctor Service, and the Zoological Society of London.[39]\n\nThe overall price of the event was reportedly £23.7 million.[40] The Australian newspaper Herald Sun estimated A$32 million for security and A$800,000 for flowers. Estimates of the cost to the economy of extra public holidays, such as that allowed for the wedding, vary between £1.2 billion and £6 billion.[41] The British government tourist authority VisitBritain predicted the wedding would trigger a tourism boom that would last several years, eventually pulling in an additional 4 million visitors and generating £2 billion.[42] However, VisitBritain's head of research and forecasting, David Edwards, suggested to colleagues two days after the engagement was announced that the evidence points to royal weddings having a negative impact on inbound tourism. He noted that the number of visitors to Britain was down significantly in July 1981, when Prince Charles and Diana were married, from the same period in other years, and also July 1986, when Prince Andrew and Sarah Ferguson were married, was down from July 1985.[43]\n\nGuest list [ edit ]\n\nOn 16 and 17 February, three sets of guest lists were sent out in the name of the Queen. Many guests or their successors in office, who were invited to the wedding of Charles, Prince of Wales, and Lady Diana Spencer were not invited to William's wedding. The first list, consisting of about 1,900 people, attended the ceremony in the abbey; the second list of approximately 600 people were invited to the luncheon reception at Buckingham Palace, hosted by the Queen; and the final list, of about 300 names, was for the evening dinner hosted by the Prince of Wales.[44]\n\nMore than half of the guests to attend the wedding itself were family and friends of the couple, though there was a significant number of Commonwealth leaders (including the governors-general who represent the Queen in Commonwealth realms other than the UK, prime ministers of the Commonwealth realms, and heads of government of other Commonwealth countries), members of religious organisations, the diplomatic corps, several military officials, members of the British Royal Household, members of foreign royal families, and representatives of William's charities and others with whom William has worked on official business. Although St James's Palace declined to publish the names of those invited, a breakdown of guests was published by category; the list made no mention of foreign heads of state.[44] The invitation of Seán Cardinal Brady, Primate of All Ireland, to the event, and its acceptance, were described as \"unprecedented\" by a spokesman for Ireland's Catholic bishops. The spokesman attributed the invitation to Cardinal Brady's contribution to the Northern Ireland peace process.[45]\n\nRoute [ edit ]\n\nRoute of the groom to and of the bride and groom from the ceremony at Westminster Abbey\n\nThe route of the groom and his party to the ceremony went between Buckingham Palace and Westminster Abbey, by The Mall, passing Clarence House, by Horse Guards Road, Horse Guards Parade, through Horse Guards Arch, Whitehall, the south side of Parliament Square, and Broad Sanctuary.[46] After the ceremony, the bridal couple returned along the same route by carriage.[47]\n\nAt 6.00 am, roads in and around the processional route were closed to traffic. From 8.15 am, the main congregation, governors-general, prime ministers of Commonwealth realms, and diplomats all arrived at the abbey. Princes William and Harry, who had stayed at Clarence House,[48] left for the ceremony at 10.10 am in a Bentley State Limousine and arrived at 10.18 am, followed by representatives of foreign royal families, the Middleton family, and, lastly, the Royal Family (the Prince of Wales and the Duchess of Cornwall; the Princess Royal and Vice Admiral Timothy Laurence; the Duke of York, Princess Beatrice, and Princess Eugenie; and the Earl and Countess of Wessex). The Queen and the Duke of Edinburgh were the last members of the Royal Family to leave Buckingham Palace, as is tradition, arriving at the abbey for 10.48 am.[49] The bridal party, who had spent the night at the Goring Hotel,[50] left for the ceremony in the former number one state Rolls-Royce Phantom VI at 10.52 am,[51] in time for the service to begin at 11.00 am.\n\nThe service finished at 12.15 pm, after which the newly married couple travelled to Buckingham Palace in a procession consisting of other Royal Family members, the parents of the groom and bride, and the best man and the bridesmaids. At 1.25 pm, the couple appeared on the balcony of Buckingham Palace to watch a flypast of an Avro Lancaster bomber, a Supermarine Spitfire fighter, and a Hawker Hurricane fighter aircraft from the Battle of Britain Memorial Flight, followed by two Typhoons from RAF Coningsby and two Tornado GR4s from RAF Leuchars in a flat diamond formation.[52][53]\n\nCeremony [ edit ]\n\nVenue [ edit ]\n\nWestminster Abbey has been the venue for coronations and some royal weddings.\n\nWestminster Abbey, founded in AD 960, has a particular status and is known as a Royal Peculiar.[54] Although the abbey has been the traditional location for coronations since 1066, not until the 20th century did it become the church of choice for royal weddings; prior to 1918, most royal weddings took place in the royal chapels, such as the Chapel Royal at St James's Palace and St George's Chapel, Windsor Castle.[55] The abbey, which has a usual seating capacity of 2000,[56] has been the venue for most royal weddings in the last century, including those of William's grandparents (the present Queen Elizabeth II and Prince Philip) in 1947, William's great-aunt Princess Margaret in 1960, William's first cousin twice removed Princess Alexandra in 1963, William's aunt Princess Anne in 1973, and William's uncle Prince Andrew in 1986.[57] A prominent decorative addition inside the abbey for the ceremony was an avenue of 20-foot tall trees, six field maple and two hornbeams, arranged on either side of the main aisle.[58]\n\nMenu [ edit ]\n\nThe menu for the Royal wedding breakfast remained a secret for several years until a copy of the menu was sold at auction. South Uist salmon, Lyme Bay crab and Hebridean langoustines were served as appetizers, followed by North Highland organic lamb with spring vegetables, English asparagus and Jersey Royal potatoes. The lamb came from Prince Charles' organic farm.[59] There were three desserts: Berkshire honey ice cream, sherry trifle and chocolate parfait with a glass of Rose champagne.[60]\n\nThe main cake was an eight-tier fruit cake decorated with Lamberth piping.[59][61] At the Prince's request, chocolate biscuit cake was prepared as a groom's cake. This icebox cake is a favorite tea cake of the Prince, his late mother Princess Diana and Queen Elizabeth II.[62][63][64][65][66][67]\n\nBridal party [ edit ]\n\nIn a break with royal tradition, the groom had a best man—his brother, Prince Harry—rather than a supporter, while the bride chose her sister, Pippa, as maid of honour. There were four bridesmaids and two page boys:[68][69] Lady Louise Windsor, the seven-year-old daughter of the Earl and Countess of Wessex; Margarita Armstrong-Jones, the eight-year-old daughter of Viscount and Viscountess Linley; Grace van Cutsem, the three-year-old daughter of the couple's friend, Hugh van Cutsem; Eliza Lopes, the three-year-old granddaughter of the Duchess of Cornwall; William Lowther-Pinkerton, the ten-year-old son of William's private secretary, Major Jamie Lowther-Pinkerton; and Tom Pettifer, the eight-year-old son of Princes William and Harry's former nanny, \"Tiggy\" Pettifer.\n\nWedding attire [ edit ]\n\nBride [ edit ]\n\nDuchess of Cambridge in bridal gown\n\nThe bridal dress, designed by the London-based designer Sarah Burton at Alexander McQueen,[70] was made of satin and featured an overlaid lace bodice and appliqued skirt. The lace bodice incorporated machine-made lace, sourced from manufacturers in France and Britain. Floral motifs were cut from lengths of these and then appliquéd by hand onto silk net (tulle) by workers from the Royal School of Needlework. The ivory gown of white satin gazar with overall lace applique work with floral detail, the full skirt with box pleats, the back leading to a 9 ft train. The lace bodice with V-neck line and long sleeves. The lace detail incorporating the rose, thistle, daffodil and shamrock.[71] The dress had a series of lace motifs including a rose, thistle, daffodil and shamrock to represent England, Scotland, Wales and Northern Ireland.[72] The veil was held in place by a Cartier Scroll Tiara, made in 1936 and lent to her by the Queen. It was purchased by the Queen's father, the future King George VI, for his wife Elizabeth three weeks before his accession. Princess Elizabeth (now Queen Elizabeth II) received the tiara from her mother on her 18th birthday. In order to avoid her tiara falling off, as had happened for Lady Diana Spencer while wearing a Spencer family tiara during her 1981 wedding to the Prince of Wales, Catherine's stylists \"backcombed the top [of her hair] to create a foundation for the tiara to sit around, then did a tiny plait in the middle and sewed it on.\"[73]\n\nFor the customary bridal themes of \"Something old, something new, something borrowed, something blue\", Middleton's gown had lace appointments (the \"old\"), diamond earrings given by her parents (the \"new\"), the Queen's tiara (the \"borrowed\"), and a blue ribbon sewn into the bodice (the \"blue\").[74] The shoes were also from Alexander McQueen[75] and had a lace pattern matching the dress with appliques made by the Royal School of Needlework.[76]\n\nThe bride's shield-shaped wired bouquet, designed by Derek Connolly, contained myrtle, Lily of the Valley, Sweet William and hyacinth.[74]\n\nMiddleton's hair was styled in loose curls for the occasion by hair dresser James Pryce of the Richard Ward Salon.[73][77] She received private make-up lessons from Arabella Preston[77][78] and the entire bridal party received \"makeup artistry assistance\" from Bobbi Brown make-up artist Hannah Martin prior to the event, but ultimately Middleton did her own makeup for the occasion.[79] The look was described as a \"soft smokey eye\" with pink lips and cheeks.[77][80] Her nails were painted by manicurist Marina Sandoval in a mixture of two polishes: a \"barely there pink\" and a \"sheer beige\" to complement her skin tone and gown.[81]\n\nBridal attendants [ edit ]\n\nMaid-of-honour Pippa Middleton also wore a gown by Sarah Burton of Alexander McQueen. It has been described as being made of \"heavy, ivory satin-based crepe, with a cowl front and with the same button detail and lace trims as the Bride's dress.\"[82][83] Like her sister, she received \"makeup artistry assistance\" from Bobbi Brown make-up artist Hannah Martin, but it is unclear who actually put on her makeup for the wedding day.[79] Her hair was loosely curled in a half-up, half-down style by the Richard Ward Salon[73] with a deep side part and a hairpiece made of ivy and lily of the valley to match Catherine's bouquet.[77]\n\nThe young bridesmaids wore dresses designed by Nicki Macfarlane, handmade with the help of Macfarlane's daughter Charlotte, in their homes at Wiltshire and Kent.[82][84] The gowns echoed the bride's dress and were made with the same fabrics and button detail along the back.[82][84] They were described as having a \"ballerina-length, full, box pleated skirt\" and were hand finished with English Cluny lace.[82][85] Their ivy and lily-of-the-valley hair wreaths were influenced by Catherine's mother Carole's headdress at her 1981 wedding to Michael Middleton.[82][84]\n\nAll of the bridesmaids wore satin Mary Jane style shoes with a Swarovski crystal buckle designed by Devon-based Rainbow Club.[82][85] Their flowers were designed and made by Shane Connolly and replicated the flowers in Catherine's bouquet: lily-of-the-valley, sweet William, and hyacinth.[82][85]\n\nThe pageboys' outfits were designed by Kashket and Partners[86] in the style worn by a \"Foot Guard officer at the time of the Regency (the 1820s)\" with an insignia from the Irish Guards, whose Colonel is Prince William.[82] The tunics are red with gold piping and have Irish shamrocks on the collars. The Pages wore a gold and crimson sash (with tassel) around their waists, as is tradition for officers in the Irish Guards when in the presence of a member of the Royal Family.[82]\n\nGroom and best man [ edit ]\n\nPrince William in uniform\n\nPrince William wore an Irish Guards mounted officer's uniform in Guard of Honour Order with a forage cap, rather than the bearskin hat.[87][88] As a serving Royal Air Force flight lieutenant who also held the equivalent Royal Navy rank of lieutenant and army rank of captain in the Blues and Royals, William could have chosen to wear the uniform of any of these junior officer ranks. However, as he had been appointed colonel of the Irish Guards on 10 February 2011, he opted instead to wear the full dress uniform of that regiment.[89] As a Knight of the Order of the Garter, he wore the order's star and blue riband, to which were affixed his RAF wings and Golden Jubilee Medal.[90] William did not wear a sword in the church.[90]\n\nPrince Harry wore the uniform of a captain of the Blues and Royals (Royal Horse Guards and 1st Dragoons), with a forage cap. He wore aiguillettes, a cross-belt and gold waist belt with sword slings, but no sword. He wore the wings of the Army Air Corps and Golden Jubilee and Afghanistan Campaign medals.[90]\n\nDesigner Russell Kashket worked with the Princes to address concerns they had with the outfits. One such concern was the heat of the Abbey, so the designers used special material to absorb the heat while still achieving the desired look. Further, military dress uniforms do not traditionally have pockets, but the palace requested that some sort of compartment be added to Harry's outfit so that Catherine's wedding ring would not be lost.[86][91]\n\nWedding service [ edit ]\n\nThe order of service chosen by the bridal couple was the Series One form which is virtually identical with that of the 1928 Prayer Book.[92] The Dean of Westminster, John Hall, officiated for most of the service, with Rowan Williams, the Archbishop of Canterbury, as celebrant of the marriage and Richard Chartres, the Bishop of London, preaching the sermon.[93] It has long been traditional for the Archbishop of Canterbury, the Church of England's most senior bishop, to officiate at the weddings of England's monarchs and future monarchs.[94] Chartres is a close friend of the Prince of Wales and confirmed both Prince William and Kate Middleton.[95]\n\nThe service commenced with the procession of the Queen, Prince Philip and the clergy. Shortly after, Middleton arrived with the party of maid of honour and junior attendants. As the choir sang \"I was glad\", an anthem by Sir Hubert Parry composed in 1902 for the coronation of King Edward VII, the bride made her three-and-a-half-minute procession through the nave and choir on her father's arm, to meet Prince William.[96] The service proceeded with the formal service and congregational singing of three well known hymns, fanfares, anthems, organ and orchestral music.\n\nIn the marriage vows, the couple promised to \"love, comfort, honour and keep\" each other. This was sealed by the exchange of a single ring.[97]\n\nThe lesson, read by the bride's brother, James Middleton, was from the Epistle to the Romans (Chapter 12, verses 1–2 and 9–18) and is an exhortation to live a righteous and peaceful life.[98]\n\nThe sermon, preached by the Bishop of London, commenced with a quotation from Catherine of Siena whose feast day it was. The bishop urged the couple to live selflessly, each remembering the needs of each other and seeking to transform each other by love rather than seeking to reform. He ended the sermon with a prayer composed by the couple themselves:[93][99][100]\n\nGod our Father, we thank you for our families; for the love that we share and for the joy of our marriage. In the busyness of each day keep our eyes fixed on what is real and important in life and help us to be generous with our time and love and energy. Strengthened by our union help us to serve and comfort those who suffer. We ask this in the Spirit of Jesus Christ. Amen.\n\nThe service continued with prayers and exhortations by the dean and archbishop. A newly composed choral anthem was sung by the choir. After the signing of the registers, William and Catherine walked down the aisle, pausing briefly to bow and curtsey to the Queen. They were followed in procession by other members of the bridal party, and their families, being joined at the door by the two youngest bridesmaids.[52]\n\nOn leaving Westminster Abbey, to the pealing of bells, they passed through a guard of honour of individually selected men and women from the various services, and were greeted by cheers from the crowds. The bridal couple entered the 1902 State Landau drawn by four white horses with postilions and attendant footmen, and guarded by a mounted escort of the Life Guard. A similar open carriage carried the rest of the bridal party, escorted by the Blues and Royals. The Queen and other members of the Royal Family followed in coaches drawn by the Queen's Cleveland Bay horses, and in state cars.[52]\n\nMusic [ edit ]\n\nThe couple return from the abbey to the Palace in the 1902 State Landau\n\nTwo choirs, one orchestra and a fanfare ensemble played the music for the service. These were the Westminster Abbey Choir, the Chapel Royal Choir, the London Chamber Orchestra and a fanfare ensemble from the Central Band of the Royal Air Force.[101] The choirs were directed by James O’Donnell, organist and Master of the Choristers at Westminster Abbey. The abbey's sub-organist, Robert Quinney, played the organ. The organist, choir master and composer at the Chapel Royal is Andrew Gant. The London Chamber Orchestra was conducted by Christopher Warren-Green, who is its music director and principal conductor. The fanfares were performed under the direction of Wing Commander Duncan Stubbs.[102]\n\nThe bride processed down the aisle to the anthem \"I was glad\", written by Sir Charles Hubert Hastings Parry, from Psalm 122. It was composed for the crowning of Prince William's great-great-great grandfather, Edward VII, at Westminster Abbey in 1902.[103]\n\nThree congregational hymns were sung during the service. The first was \"Guide me, O Thou Great Redeemer\" sung to the tune \"Cwm Rhondda\". The hymn, originally written in Welsh by 18th-century Methodist preacher William Williams, had been sung at the funeral of Diana, Princess of Wales.[104] The words to their second hymn, \"Love Divine, All Loves Excelling\", were by Charles Wesley and its tune – Blaenwern – was composed by William Penfro Rowlands, during the 1904–1905 Welsh Revival. This hymn was sung at the Prince of Wales's 2005 marriage to the Duchess of Cornwall.[104] The third hymn was \"Jerusalem\", based on the poem by William Blake and set to music by Sir Charles Hubert Hastings Parry.[104]\n\nChoral compositions featured in the service were Parry's Blest Pair of Sirens (a setting of an ode by John Milton) during the signing of the register, Paul Mealor's Ubi Caritas et Amor as the motet and a specially commissioned anthem, \"This is the day which the Lord hath made\" consisting of words chosen from the Psalms, by John Rutter.[105][106]\n\nFanfare ensemble leader Wing Commander Duncan Stubbs's own composition, Valiant and Brave, was performed as the royal couple signed the wedding registers.[101] Preux et audacieux (which translates from French as \"Valiant and Brave\") is the motto of 22 Squadron, in which Prince William was serving as a search and rescue pilot at RAF Valley in North Wales.[107] The fanfare led into the recessional music, the orchestral march \"Crown Imperial\" by William Walton, composed for the coronation of George VI and which was also performed at Charles and Diana's wedding.[108]\n\nThe music performed before the service included two instrumental pieces by Sir Peter Maxwell Davies (\"Veni Creator Spiritus\" and \"Farewell to Stromness\") as well as with works by J.S. Bach, Benjamin Britten, Frederick Delius, Edward Elgar, Gerald Finzi, Charles Villiers Stanford, Ralph Vaughan Williams and Percy Whitlock.[105]\n\nThe bells of Westminster Abbey rang a full peal as the newly married couple and guests left the church. The ten bells rang a peal called \"Spliced Surprise Royal\", consisting of 5,040 changes, that took more than three hours to complete. They were rung by the volunteers of the Westminster Abbey Company of Ringers, under the direction of David Hilling.[109]\n\nWedding ring [ edit ]\n\nThe wedding ring of Catherine is made from Welsh gold.[110][111] The ring was created by the royal warrant holder Wartski, a company with roots in Bangor, Gwynedd, north Wales.[112] Since 1923, it has been a tradition in the Royal Family to use Welsh gold for the wedding ring of the bride.[113] This ring was made from a small amount of gold that had been kept in the royal vaults since it was presented to Queen Elizabeth II. It was mined from the Clogau Gold Mine in the mountains of North Wales. The Clogau Gold Mine had its heyday in the late nineteenth century, was abandoned in the early twentieth century, was reopened in 1992 and finally closed in 1998.[114] The Queen had \"given a piece of the gold that has been in the family for many years to Prince William as a gift,\" a palace source stated.[113] Prince William chose not to receive a wedding ring at the ceremony.[111]\n\nTitle upon marriage [ edit ]\n\nOn the morning of the wedding, it was announced that William was to be created Duke of Cambridge, Earl of Strathearn, and Baron Carrickfergus,[115] with Catherine becoming Her Royal Highness The Duchess of Cambridge after the wedding.[116] This is in line with the practice of granting titles upon marriage to royal princes who did not already have one (for example, Prince Andrew was created Duke of York when he married in 1986).[117] Strathearn is close to St Andrews, Fife, in Scotland, where the couple met as students, and Carrickfergus is in Northern Ireland. Combined with his existing titular link with Wales, William's collective titles link him to each of the four countries in the United Kingdom.[116][119]\n\nFamily celebrations [ edit ]\n\nThe Queen hosted a lunchtime reception at Buckingham Palace,[93][120] starting after the arrival of the married couple's carriage. It was a private gathering for guests drawn from the congregation who represent the couple's official and private lives. During the reception, at which the Official Harpist to the Prince of Wales, Claire Jones, performed,[102] the couple made an appearance on the balcony on the east (main) front of Buckingham Palace, where they shared a kiss.[121] Jones played a gold leaf harp known as \"Prince of Wales\" presented to Prince Charles in 2006 by Italian-American harp maker Salvi Harps.[122]\n\nAt 3.35 pm, William drove his new wife back up the Mall for the short distance to Clarence House, his then official London residence. The car, a blue, two seat Aston Martin DB6 Volante (MkII convertible) that had been given to Prince Charles by the Queen as a 21st birthday present, was decorated in the customary newlywed style by the best man and friends; the rear number plate read \"JU5T WED\".[123] The Prince had changed into a Blues and Royals captain's frock coat also made by Kashket;[124] his wife was still wearing her wedding dress. In a surprise organised by RAF Wattisham, the car was shadowed by a yellow Sea King helicopter flying the RAF Ensign from its winch cable, marking William's service as a pilot with the RAF Search and Rescue Force.[125]\n\nIn the evening, the Prince of Wales gave a private dinner, followed by dancing, at Buckingham Palace for the couple and their close friends and family.[46][126] For the evening reception, the Duchess of Cambridge wore a strapless dress by Sarah Burton which \"featured a circle skirt and diamante detailing\".[127] She also wore a white shrug and let her hair down.[128] The singer-songwriter Ellie Goulding performed at the event, singing her rendition of \"Your Song\" for the couple's first dance. The singer also performed her hit single \"Starry Eyed\" for the assembled guests. The event ended at 3 am, with a small fireworks display in the palace grounds.[129]\n\nThe wedding cake had a strong British floral theme, using elements of the Joseph Lambeth technique. It was an eight-tiered traditional fruit cake decorated with sugar paste flowers. The cake designer Fiona Cairns based in Fleckney, Leicestershire was chosen in February 2011 to create the wedding cake. Additionally, McVitie's created a groom's cake from chocolate biscuit for the reception at Buckingham Palace. The chocolate biscuit cake was made from a Royal Family recipe and was specially requested by Prince William.[46][130]\n\nThe wedding bouquet was returned to Westminster Abbey and placed on the Tomb of The Unknown Warrior by a royal official, after the photographs had been taken. This followed the tradition started by Prince William's great grandmother, Lady Elizabeth Bowes-Lyon, after her marriage to the Duke of York in 1923.[131][132] The formal portraits were taken by Hugo Burnand at Buckingham Palace following the ceremony.[133]\n\nPublic celebration [ edit ]\n\nOfficial merchandise, coins, and stamps [ edit ]\n\nPrince William and Catherine Middleton personally approved an official range of china (including handmade plates, cups, and pill boxes) to be made for the Royal Collection and sold as souvenirs from December 2010 on.[134] The items are decorated with the intertwined initials of the couple under the prince's coronet and include the wording \"To celebrate the marriage of Prince William of Wales and Catherine Middleton 29 April 2011.\"[135] The Lord Chamberlain's office approved a longer list of memorabilia, including official mugs, plates, biscuit tins, and porcelain pill pots. The document also clarified the use of William's coat of arms and pictures of the couple on such items. Initially, the Palace refused to sanction official tea towels, which, along with aprons, T-shirts and cushions, were deemed \"in poor taste\".[136] However, the restriction on tea towels, though not the other items, was later reversed. Sales of merchandising were expected to reach £44 million.[135]\n\nTo mark the engagement of William and Catherine, the Royal Mint produced an official Alderney £5 engagement coin, showing the couple in profile,[137] as well as an official UK£5 coin for the wedding.[138] The Royal Australian Mint issued a series of circulation and collectable coins designed by Stuart Devlin.[139] The Royal Canadian Mint released a series of coins and Canada Post issued a stamp,[140] approved by Clarence House, in commemoration of the wedding.[141] On 21 April, a set of commemorative postage stamps, featuring the couple's official engagement photographs, was issued by Royal Mail.[142]\n\nBroadcasting [ edit ]\n\nThe wedding was widely broadcast on television, internet, and radio, in more than 180 countries.[143] ITV,[144] BBC,[145] and CNN covered the ceremony and associated events live through the combined pool of footage from the BBC, Sky, and ITN to help cover the overall cost.[146] In North America, which is five to nine hours behind British Summer Time, the wedding occurred during the time usually taken up by network breakfast television programmes, which expanded their normal length to allow for full coverage. NBC's Today began coverage at 4 am Eastern Time, and along with MSNBC, partnered with ITV.[147][148] ABC partnered with BBC,[149] CBS has its own live London affiliates,[150] and Fox and Fox News Channel partnered with their sister network Sky News.[151] The CBC[152] and CTV had live coverage.[153] Cable networks and radio also had live coverage.[154] In Mexico, the wedding aired on Televisa and TV Azteca; all television stations in Mexico carrying the ceremony stayed on the air during the late night hours instead of normally signing off. The ABC also took the BBC feed in Australia, in addition to pay TV channel UKTV. Coverage was also provided on the Seven Network, Nine Network and Network Ten. The ABC had planned to produce alternative commentary with The Chaser, but in response to these plans, the BBC barred the use of its footage for such a purpose, on orders from Clarence House.[155] The royal wedding was also streamed live online on YouTube via the British Monarchy's official The Royal Channel.[156]\n\nAn April 2011 poll of 2,000 British adults found that 35% of the public intended to watch the wedding on television while an equal proportion planned to ignore the event altogether.[157] According to their reported plans, women were more than twice as likely (47%) to watch the event as men (23%).[158] Early estimates following the ceremony indicated an estimated 24.5 million people in the United Kingdom watched the wedding on either BBC One or ITV, giving those channels a 99.4% share of the terrestrial television audience as the service began,[159] with the BBC's Live royal wedding website having 9 million hits, estimating over half the British population watched the wedding.\n\nThe viewing figures for the event have been the subject of much speculation, with Culture Secretary Jeremy Hunt estimating that 2 billion people would watch the wedding.[160] Following the event, this figure was duly reported by the media,[161][162] but was criticised by some news outlets for being inaccurate and unfounded.[163][164] Estimated figures include a peak audience of 26.3 million viewers and a total of 36.7 million watching at least some part of the wedding coverage in the UK,[165] while in the United States, the wedding drew an average audience of 22.8 million, with over 60 million tuning in at some point to watch some of the coverage.[166] In India, a reported 42.1 million viewers tuned in,[167] 9.9 million viewers in Germany,[168] 9.6 million viewers in France,[168] 5.22 million viewers watched the event in Canada with twelve million tuning in at some point,[169] five million in Australia,[170] and one million was expected in China,[171] for an audience of 122 million to 176 million viewers, drawing from a total population pool of 3.126 billion (approximately 45% of the world's population). Other reported figures put the global audience at 162 million viewers.[172] In addition to the television audiences, the ceremony attracted 72 million live streams and a reach of 101 million streams on YouTube across 188 countries.[173] With its 72 million streams, the wedding has been listed in the 2012 Guinness Book of World Records for the record of \"Most Live Streams for a Single Event\", beating out the Michael Jackson memorial service in 2009.[174] It has been suggested that the \"two billion\" figure is exaggerated,[175] and that there are too many gaps in the worldwide TV measuring system to accurately audit global audience figures.[176]\n\nPower demand on the UK National Grid [ edit ]\n\nIn the UK, the National Grid reported a huge surge in demand for power after the service, equivalent to one million kettles being boiled, when the royal couple returned to Buckingham Palace.[177] Viewership of the wedding was recorded by electricity use in Ontario, where, at the approximate moment Middleton arrived at Westminster Abbey, the Independent Electricity System Operator recorded a 300 megawatt drop in electricity use, which was attributed to \"people going about their normal morning routines [stopping] whatever they were doing, rather than make breakfast or shower, and watch the TV\".[178]\n\nPublic response [ edit ]\n\nThere were about 5,500 applications to hold royal wedding street parties across England and Wales, including 850 in London, one of which was hosted by Prime Minister David Cameron in Downing Street for charity workers and local children.[179] The anti-monarchy campaign group Republic held an alternative street party in Holborn.[180] The event had initially been blocked by Camden Council after businesses raised concerns about loss of trade.[181]\n\nA number of ceremonies and parties were held at places which had an intimate connection with the couple. In Scotland, about 2,000 people attended a party at the University of St Andrews, where the royal couple first met. Hundreds of people watched the ceremony on a big screen in Edinburgh's Festival Square.[182] Welsh celebrations were led by Anglesey, where Prince William was a search and rescue pilot and where the couple resided after the wedding. 2,600 people gathered to watch the event on big screens there, and around 200 street parties were organised throughout the rest of the country, including over 50 in Cardiff.[183]\n\nThe international Peace Bridge across the Niagara River between the United States and Canada at Buffalo, New York, and Fort Erie, Ontario, and operated in part by an Ontario Crown corporation, was lit in red, blue and gold, the colours of the royal coat of arms.[184]\n\nCriticism and scepticism stemmed from the belief that, at a time of recession and rising unemployment in the UK, millions of pounds in tax funds were used for the wedding's security. The costs of the wedding itself were paid for by the Royal Family and the Middletons.[185][186][187] Emma Boon, campaign director for the taxpayers union TaxPayers' Alliance, expressed distaste for the lavish cost of the wedding and noted, \"Of course it should be an event for the whole nation to celebrate, but ordinary taxpayers should not be left with a bill fit for a king.\" Graham Smith, current Campaign Manager of Republic, also spoke out on the taxpayer's responsibility for the wedding.[188]\n\nCharitable fund [ edit ]\n\nIn March 2011, William and Catherine set up a gift fund held by The Foundation of Prince William and Prince Harry to allow well-wishers who wanted to give them a wedding gift to donate money to charities with which they were involved, incorporating the armed forces, children, the elderly, art, sport and conservation.[189][190]\n\nThe fund supported a total of 26 named organisations:\n\nTributes outside the Commonwealth [ edit ]\n\nIn the United States, the Empire State Building in New York City was lit in red, white, and blue, the colours of the Union Flag at sunset on 29 April to mark the wedding.[219]\n\nPolicing [ edit ]\n\nThe wedding had been subject to threats of violence and disruption. In February, security agencies, including MI5, identified \"dissident Irish republican groups\" as possible threats.[220] The group Muslims Against Crusades abandoned a planned protest.[221] The English Defence League vowed to hold a counter-demonstration and promised 50 to 100 EDL members at each railway station in central London to block Muslim extremists in a \"ring of steel\".[222]\n\nSecurity operations and arrests [ edit ]\n\nSixty people arrested at the TUC rally on the March for the Alternative had bail conditions that prevented them entering central London over the wedding period.[223]\n\nOn 28 April 2011, political activist Chris Knight and two others were arrested by Scotland Yard \"on suspicion of conspiracy to cause public nuisance and breach of the peace\". The three were planning a mock execution of Prince Andrew with a home-made guillotine in central London to coincide with the wedding. The guillotine was workable, but lacked a blade.[224][225]\n\nOn the day of the wedding, the Metropolitan Police Service made \"pre-emptive\" moves, applying blanket stop-and-search powers and arresting 52 people, including 13 arrested at Charing Cross station in possession of anti-monarchy placards and \"climbing equipment\".[226] Five people, three of whom wearing zombie make-up, were arrested \"on suspicion of planning a breach of the peace\" when they entered a branch of Starbucks. At a peaceful protest in Soho Square, a man was arrested by plain clothes police. Chief Inspector John Dale claimed \"He had articles on him to cause criminal damage\".[226][227] Police described the overall security operation as an \"amazing success\".[228][229] 8 of the arrested appealed to the European Court of Human Rights that their arrests were unlawful, however their claims were rejected.\n\nIn Scotland, twenty-one people were arrested at an unofficial \"street party\" in Kelvingrove Park, Glasgow which saw \"completely unacceptable levels\" of drunkenness, according to Strathclyde Police.[230] A taxi driver died on 10 May from injuries sustained when his cab was struck by a police van attending the Kelvingrove incident.[231]\n\nHoneymoon [ edit ]\n\nDespite reports that the couple would leave for their honeymoon the day after their wedding,[232][233] Prince William immediately returned to his work as a search-and-rescue pilot, and the couple did not depart until 9 May, ten days after their wedding.[234] The location of the honeymoon was initially kept secret. Although the press speculated that they might be headed to locations such as South America, Jordan, and Kenya,[232] the couple ultimately decided to honeymoon for 10 days on a secluded villa on a private island in the Seychelles.[234] On the morning of 21 May, a spokesman for St. James's Palace announced that the couple had returned to the United Kingdom.[235][236] The length of the honeymoon was limited by William's RAF duties and the couple's official scheduled tour to Canada and the United States.[234][237]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg/240px-All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Car_Marriage_Kate_Middleton_and_her_father.jpg/150px-Car_Marriage_Kate_Middleton_and_her_father.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Royal_Wedding_of_HRH_Prince_William_of_Wales_and_Catherine_Middleton_MOD_45152612.jpg/220px-Royal_Wedding_of_HRH_Prince_William_of_Wales_and_Catherine_Middleton_MOD_45152612.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Kate_Middleton_in_bridal_gown.jpg/150px-Kate_Middleton_in_bridal_gown.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg/1200px-All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Royal_Wedding_London_Eye.jpg/220px-Royal_Wedding_London_Eye.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Royal_Wedding_route_London_2011.svg/220px-Royal_Wedding_route_London_2011.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Royal_Carriage_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg/220px-Royal_Carriage_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Crown_of_Saint_Edward_Heraldry.svg/30px-Crown_of_Saint_Edward_Heraldry.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Coat_of_Arms_of_William%2C_Duke_of_Cambridge.svg/120px-Coat_of_Arms_of_William%2C_Duke_of_Cambridge.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Coat_of_Arms_of_Catherine%2C_Duchess_of_Cambridge.svg/120px-Coat_of_Arms_of_Catherine%2C_Duchess_of_Cambridge.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/William_in_uniform.jpg/150px-William_in_uniform.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/William_and_Harry_enroute_to_the_abbey.jpg/150px-William_and_Harry_enroute_to_the_abbey.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Flypast_-London%2C_England-29April2011.jpg/220px-Flypast_-London%2C_England-29April2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/The_royal_family_on_the_balcony.jpg/220px-The_royal_family_on_the_balcony.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Royal_wedding_Regent_Street.jpg/220px-Royal_wedding_Regent_Street.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Westminster_Abbey_London_900px.jpg/170px-Westminster_Abbey_London_900px.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/4.28.11NickDixonByLuigiNovi3.jpg/220px-4.28.11NickDixonByLuigiNovi3.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg/1200px-All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wedding_of_Prince_William_and_Catherine_Middleton", "title": "Wedding of Prince William and Catherine Middleton", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg/1200px-All_smiles_Wedding_of_Prince_William_of_Wales_and_Kate_Middleton.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}