{"url": "en.wikipedia.org/wiki/Pretty_Woman", "text": "Not to be confused with Pretty Lady (disambiguation)\n\n1990 romantic movie directed by Garry Marshall\n\nPretty Woman is a 1990 American romantic comedy film directed by Garry Marshall, from a screenplay by J. F. Lawton. The film stars Richard Gere and Julia Roberts, and features Héctor Elizondo, Ralph Bellamy (in his final performance), Laura San Giacomo, and Jason Alexander in supporting roles.[1] The film's story centers on down-on-her-luck Hollywood sex worker Vivian Ward, who is hired by Edward Lewis, a wealthy businessman, to be his escort for several business and social functions, and their developing relationship over the course of her week-long stay with him. The film’s title Pretty Woman is based on \"Oh, Pretty Woman\", written and sung by Roy Orbison. It is the first film on-screen collaboration between Gere and Roberts.\n\nOriginally intended to be a dark cautionary tale about class and sex work in Los Angeles, the film was re-conceived as a romantic comedy with a large budget. It was widely successful at the box office and was the third-highest-grossing film of 1990. The film saw the highest number of ticket sales in the US ever for a romantic comedy,[2] with Box Office Mojo listing it as the number-one romantic comedy by the highest estimated domestic tickets sold at 42,176,400, slightly ahead of My Big Fat Greek Wedding (2002) at 41,419,500 tickets.[3] The film received mixed reviews, though Roberts received a Golden Globe Award and a nomination for the Academy Award for Best Actress for her performance. In addition, screenwriter J. F. Lawton was nominated for a Writers Guild Award and a BAFTA Award.\n\nPlot [ edit ]\n\nHigh-powered businessman Edward Lewis is dumped by his girlfriend during an unpleasant phone call wherein he asked her to escort him during his business trip; she has finally had enough of being treated solely as his \"beck and call girl.\" Edward is a corporate raider from New York, who buys companies that are in financial trouble and tears them down piece by piece. Leaving a business party in the Hollywood Hills, he takes his lawyer's Lotus Esprit sports car and accidentally ends up on Hollywood Boulevard in the city's red-light district, where he encounters prostitute Vivian Ward. As he is having difficulties driving the car, she gets in and guides him to the Regent Beverly Wilshire Hotel, where he is staying. It becomes clear that Vivian knows more about the Lotus than he does, and he lets her drive. Vivian charges Lewis $20 for the ride, and they separate. She goes to a bus stop, where he finds her and offers to hire her for the night; the next day, he asks Vivian to play the role his girlfriend has refused, offering her $3000 to stay with him for the next six days as well as to buy her a new, more acceptable wardrobe. That evening, going to a business dinner, Edward is visibly moved by Vivian's transformation brought about by the helpful manager of the hotel and begins seeing Vivian in a different light. He begins to open up to her, revealing details about his personal and business lives.\n\nEdward takes Vivian to a polo match in hopes of networking for his business deal. His attorney, Phillip, suspects Vivian is a corporate spy, and Edward tells him how they truly met. Phillip later approaches Vivian, suggesting they do business once her work with Edward is finished. Insulted, and furious that Edward has revealed their secret, Vivian wants to end the arrangement. Edward apologizes and admits to feeling jealous of a business associate – whom she had met at the previous night's dinner – to whom Vivian paid attention at the match. Vivian's straightforward personality is rubbing off on Edward, and he finds himself acting in unaccustomed ways. Clearly growing involved, Edward takes Vivian by private jet to see La Traviata at the San Francisco Opera. Vivian is moved to tears by the story of the prostitute who falls in love with a rich man. She breaks her \"no kissing on the mouth\" rule and they have sex; in the afterglow, believing Edward is asleep, Vivian admits she loves him, and as she drifts off, Edward opens his eyes. Edward offers to put her up in an apartment so she can be off the streets. Hurt, she refuses and says this is not the \"fairy tale\" she dreamed of as a child, in which a knight on a white horse rescues her.\n\nMeeting with the tycoon whose shipbuilding company he is in the process of raiding, Edward changes his mind. His time with Vivian has shown him a different way of looking at life, and he suggests he and the tycoon work together to save the company rather than tearing it apart and selling off the pieces. Phillip, furious at losing so much money, goes to the hotel to confront Edward but finds only Vivian. Blaming her for the change in Edward, he attempts to rape her. Edward arrives, wrestles Philip off her, punches him in the face, and throws him out of the room.\n\nWith his business in L.A. complete, Edward asks Vivian to stay one more night with him, but because she wants to, not because he's paying her. She refuses. Edward re-thinks his life, and as he's leaving for the airport to return to New York, he instead has the hotel chauffeur detour to Vivian's apartment building, where he leaps from the white limousine's sun roof and \"rescues her\", overcoming his extreme fear of heights to ascend her fire escape. Edward asks, \"So what happens after he climbed up the tower and rescues her?\" Vivian responds, \"She rescues him right back.\" Vivian and Edward kiss.\n\nCast [ edit ]\n\nCast notes:\n\nPretty Woman was Hank Azaria's first film speaking role.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe film was initially conceived as a dark drama about sex work in Los Angeles in the 1980s.[4] The relationship between Vivian and Edward also originally involved controversial themes, including Vivian being addicted to drugs; part of the deal was that she had to stay off cocaine for a week. Edward eventually throws her out of his car and drives off. The original script by J.F. Lawton, called 3000,[5] ended with Vivian and her sex-worker friend on the bus to Disneyland.[4] Producer Laura Ziskin considered these elements detrimental to a sympathetic portrayal of Vivian, and they were removed or assigned to Kit. The deleted scenes have been found, and some were included on the DVD released for the film's 15th anniversary.[4] In one, Vivian tells Edward, \"I could just pop ya good and be on my way\", indicating her lack of interest in \"pillow talk\". In another, she is confronted by drug dealers, then rescued by Edward.\n\nThough inspired by such films as Wall Street and The Last Detail,[5] the film bears a resemblance to Pygmalion myths: particularly George Bernard Shaw's play of the same name, which also formed the basis for the Broadway musical My Fair Lady. It was Walt Disney Studios then-president Jeffrey Katzenberg who insisted the film be re-written as a modern-day fairy tale and love story, as opposed to the original dark drama. It was pitched to Touchstone Pictures and re-written as a romantic comedy.[6] The title 3000 was changed because Disney executives thought it sounded like a title for a science fiction film.[7]\n\nThe film is one of two movies that triggered a resurgence of romantic comedy in Hollywood, the other being When Harry Met Sally.... Following this film's success, Roberts became the romantic comedy queen of the 1990s.\n\nCasting [ edit ]\n\nCasting of the film was a rather lengthy process. Marshall had initially considered Christopher Reeve, Daniel Day-Lewis, Kevin Kline, and Denzel Washington for the role of Edward, and Al Pacino and Burt Reynolds turned it down.[8] Pacino went as far as doing a casting reading with Roberts before rejecting the part.[9] Gere initially refused but when he met with Roberts, she persuaded him and he eventually agreed to play Lewis.[10] He reportedly started off much more active in his role; but Garry Marshall took him aside and said \"No, no, no, Richard. In this movie, one of you moves and one of you does not. Guess which one you are?\"[11] Julia Roberts was not the first choice for the role of Vivian, and was not wanted by Disney. Many other actresses were considered. Marshall originally envisioned Karen Allen for the role; when she declined, auditions went to many better-known actresses of the time including Molly Ringwald,[12] who turned it down because she felt uncomfortable playing a sex worker.[citation needed] Winona Ryder auditioned, but was turned down because Marshall felt she was \"too young\". Jennifer Connelly was also dismissed for the same reason.[4] Emily Lloyd turned it down as it conflicted with her shooting for the film Mermaids.[13]\n\nMeg Ryan, who was a top choice of Marshall's, turned it down as well. According to a note written by Marshall, Mary Steenburgen was also among the first choices. Diane Lane came very close to being cast (the script was much darker at the time); they had gone as far as costume fittings, but due to scheduling conflicts she could not accept. Michelle Pfeiffer turned the role down, saying she did not like the script's \"tone.\"[14] Daryl Hannah was also considered, but believed the role was \"degrading to women\".[14] Valeria Golino declined, doubting it would work with her thick Italian accent.[citation needed] And Jennifer Jason Leigh had auditioned.[15] When all the other actresses turned down the role, 21-year-old Julia Roberts, a relative unknown, with only the sleeper hit Mystic Pizza (1988) and the yet-to-be-released Steel Magnolias (1989) to her credit, won the role of Vivian. Her performance made her a star. J.F. Lawton, writer of the original screenplay, has suggested that the film was ultimately given a happy ending because of the chemistry of Gere and Roberts.[5]\n\nVeteran actor Ralph Bellamy, who plays James Morse, appears in his final acting performance before his death in 1991.\n\nFilming [ edit ]\n\nThe film's budget was substantial, at $14 million, so producers could shoot in many locations.[4] Most filming took place in Los Angeles, California, specifically in Beverly Hills, and inside soundstages at Walt Disney Studios in Burbank. The escargot restaurant the \"Voltaire\" was shot at the restaurant \"Rex,\" now called \"Cicada\". Scenes set in the Beverly Wilshire Hotel lobby were shot at the Ambassador Hotel in Los Angeles. Filming commenced on July 24, 1989, but was immediately plagued by problems. These included Ferrari and Porsche declining the product placement opportunity for the car Edward drove, neither firm wishing to be associated with sex workers.[4] Lotus Cars saw the placement value, and supplied a Silver 1989.5 Esprit SE (which was later sold).[16]\n\nShooting was a generally pleasant, easy-going experience, as the budget was broad and the shooting schedule was not tight.[4] While shooting the scene where Vivian is lying down on the floor of Edward's penthouse, watching reruns of I Love Lucy, Garry Marshall had to tickle Roberts' feet (out of camera range) to get her to laugh. The scene in which Gere playfully snaps the lid of a jewelry case on her fingers was improvised, and her surprised laugh was genuine. The red dress Vivian wears to the opera has been listed among the most unforgettable dresses of all time.[17]\n\nDuring the scene in which Roberts sang to a Prince song in the bathtub, slid down and submerged her head under the bubbles; she emerged to find the crew had left except for the cameraman, who captured the moment on film. In the love scene, she was so stressed that a vein became noticeable on her forehead and had to be massaged by Marshall and Gere. She also developed a case of hives, and calamine lotion was used to soothe her skin until filming resumed.[4] The filming was completed on November 30.[18]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nIn its opening weekend, the film was at number one at the box office, grossing $11,280,591 and averaging $8,513 per theater.[19] Despite dropping to number two in its second weekend, it grossed more with $12,471,670.[19] It was number one at the box office for four non-consecutive weeks, and in the Top 10 for 16 weeks.[19] It has grossed $178,406,268 in the United States and $285,000,000 in other countries for a total worldwide gross of $463,406,268.[3] It was also the fourth highest-grossing film of the year in the United States[20] and the third highest-grossing worldwide.[21] The film remains Disney's highest-grossing R-rated release ever.[22]\n\nCritical response [ edit ]\n\nOn review aggregator Rotten Tomatoes the film holds an approval rating of 62% based on 66 reviews, with an average rating of 5.8/10. The website's critical consensus states, \"Pretty Woman may be a yuppie fantasy, but the film's slick comedy, soundtrack, and casting can overcome misgivings.\"[23] On Metacritic, which assigns a normalized rating to reviews, the film has a weighted average score of 51 out of 100, based on 18 critics, indicating \"mixed or average reviews.\"[24] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.[25]\n\nOwen Gleiberman of Entertainment Weekly gave the film a D, saying it \"starts out as a neo-Pygmalion comedy\" and with \"its tough-hooker heroine, it can work as a feminist version of an upscale princess fantasy.\" Gleiberman also said it \"pretends to be about how love transcends money,\" but \"is really obsessed with status symbols.\"[26] On its twentieth anniversary, Gleiberman wrote another article, saying that while he felt he was right, he would have given it a B today.[27] Carina Chocano of The New York Times said the movie \"wasn't a love story, it was a money story. Its logic depended on a disconnect between character and narrative, between image and meaning, between money and value, and that made it not cluelessly traditional but thoroughly postmodern.\"[28]\n\nAccolades [ edit ]\n\nAwards\n\nNominations\n\nIt ranks on #21 in AFI's 100 Years... 100 Passions.\n\nMusic [ edit ]\n\nThe film is noted for its musical selections. The hugely successful soundtrack features the song \"Oh, Pretty Woman\" by Roy Orbison, which inspired its title. Roxette's \"It Must Have Been Love\" reached No. 1 on the Billboard Hot 100 in June 1990. The soundtrack also features \"King of Wishful Thinking\" by Go West, \"Show Me Your Soul\" by Red Hot Chili Peppers, \"No Explanation\" by Peter Cetera, \"Wild Women Do\" by Natalie Cole and \"Fallen\" by Lauren Wood. The soundtrack went on to be certified triple platinum by the RIAA.[29]\n\nThe opera featured in the film is La Traviata, which also served as inspiration for its plot. The highly dramatic aria fragment that is repeated is the end of \"Dammi tu forza!\" (\"Give me strength!\"), from the opera. Roberts sings the song \"Kiss\" by Prince while she is in the tub and Gere's character is on the phone. Background music is composed by James Newton Howard. The piano piece Gere's character plays in the hotel lobby was actually composed and performed by him. Entitled \"He Sleeps/Love Theme\", this piano composition is inspired by Bruce Springsteen's \"Racing in the Street\".\n\nSoundtrack [ edit ]\n\nPretty Woman Soundtrack album by Various Artists Released March 13, 1990 Recorded 1964, 1988–1989 Genre Pop\n\nRock Length 43 : 36 Label EMI Producer Various artists Singles from Pretty Woman\n\nReleased: February 14, 1990\n\nReleased: 1990\n\nReleased: 20 May 1990\n\nProfessional ratings Review scores Source Rating AllMusic link\n\nThe soundtrack was released on March 13, 1990 by EMI.[30][31]\n\nCertifications [ edit ]\n\nMusical adaptation [ edit ]\n\nA stage musical adaptation of the film opened on Broadway on July 20, 2018 in previews, officially on August 16 at the Nederlander Theatre.[41] This follows an out-of-town tryout at the Oriental Theatre in Chicago, which will run from March 13 to April 15, 2018. The musical has music and lyrics by Bryan Adams and Jim Vallance; the late Garry Marshall and J.F. Lawton wrote the book; and Jerry Mitchell is the director and choreographer.[42] The Chicago and Broadway casts featured Samantha Barks, in her Broadway debut as Vivian and Steve Kazee as Edward. Barks finished her run as Vivian on 21 July 2019 and was replaced by Jillian Mueller the following evening, with Brennin Hunt, of ‘Rent’ fame, assuming the role of Edward.[42] Orfeh portrayed Kit, and Jason Danieley played Philip Stuckey. Eric Anderson portrayed the role of Mr. Thompson and Kingsley Leggs played the role of James Morse.[41]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Pretty_Woman", "title": "Pretty Woman", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}