{"url": "www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "text": "Miranda Kerr was 18, just out of high school, a girl from the Australian countryside curious about what the rest of the world had to offer, when she first visited New Zealand. Along with a close friend from Gunnedah, the pastoral town where she grew up, Kerr set out to experience what for many is the draw of New Zealand: to escape and explore, to get a little lost and, in the process, get a little found. They slept in a tent. Swam in natural hot springs. Hiked terrain so raw and depopulated and expansive it felt as if they were the first humans to discover it. Kerr didn’t know it at the time, but her life would change significantly in the years that followed, thanks largely to her enviable genetic gifts: the long pale legs, the shimmering doe eyes and, most famously, the pert, dimpled cheeks that have made her one of the highest paid, most recognizable models in the world. Modeling, for Kerr, has been its own sort of adventure, one she will be the first to acknowledge as a stroke of good fortune not to be taken for granted. “Still, that backpacking trip, just having that freedom, was one of the best times in my life,” Kerr recently reflected. “Ever since, I’ve wanted to get back to New Zealand.”\n\nFor seven months, beginning last December, Kerr, 29, got her wish. She spent the majority of her nonworking time in Wellington, New Zealand’s capital, where her husband, Orlando Bloom, was filming “The Hobbit,” Peter Jackson’s two-part prequel to the epic “The Lord of the Rings” trilogy, the films that first made Bloom a star a decade ago. Wellington — or “Wellywood,” as it’s been christened since Jackson set up his studio empire in the suburb of Miramar — is one of the most remote capitals on the planet: some 28 hours by plane from London, 23 from New York, 15 from Los Angeles, 14 hours from Hong Kong and Tokyo. Of the city’s many charms — its burgeoning restaurant scene, its absurdly picturesque scenery, the mellow Kiwi hospitality you experience everywhere you go — it is Wellington’s physical isolation that makes it such a singular place. During the week I spent in the city, no matter what I was doing, even something as simple as sitting at a cafe sipping a flat white (New Zealand’s richer version of a latte), I felt a palpable remove from the ways and rhythms of the rest of the world. (Being on the other side of the international date line helps.) So while much of Wellington could be compared to, say, Portland, Ore., or Seattle, there is the added seduction of being pleasantly unmoored, able to take in the pleasure of civilization while existing outside of it.\n\nThe circumstances of Kerr’s stay in Wellington were, of course, quite different from her initial visit. She is now the mother of a cherubic young son, Flynn, 19 months, and the tent of her teen years was replaced by an airy, seaside mansion where every window looks out on Wellington Harbour. (The house, lent to the couple by one of the film’s producers, happens to be where Bloom celebrated his 22nd birthday while filming “TLOTR.”) If she wanted to run an errand, or head to an afternoon Pilates class, a production assistant gave her a ride. Sweet perks, no question. And yet, to hear Kerr tell it, the life she and Bloom carved out in Wellington was in many ways a reminder of what existence was like before she became a celebrity, a kind of geographic escape hatch from the scrutiny of tabloids and the curious eyes of strangers. When they first arrived, for instance, they took a road trip that was reminiscent of her earlier journey: aimlessly driving around the countryside, out of reach and out of touch. “We didn’t camp because Flynn’s still a little young for that,” Kerr told me. “But it was just the three of us, nothing to do except be with each other in this shockingly beautiful place.”\n\nKerr and I were having this conversation at Wellington’s Botanic Garden, a sprawling expanse of lush floral curiosities, manicured lawns and shaded labyrinthine walkways offering some of the most extraordinary views of the city. It was hard to imagine that this was the same woman who, a few months earlier, had walked the runway in a $2.5 million bra while Maroon 5 performed at the Victoria’s Secret fashion show; here, in raw-denim jeans and a loose navy sweater, she seemed no different from the other health-conscious young mothers who made up most of the gardens’ visitors. Kerr had come from the set of “The Hobbit,” which she visited most days with Flynn when Bloom, who was reprising his role as the bow-wielding elf Legolas, was working. “There’s a cafeteria where everyone eats lunch, and they’re all in full makeup,” Kerr said. “So you see these poor Orcs” — the demonic goblin soldiers of the film — “trying to eat without ruining their costumes. For Orlando, it’s easier. He just has the blond wig and the pointy ears.”", "images": ["https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "https://static01.nyt.com/images/2012/08/19/t-magazine/19well-kerr/19well-kerr-jumbo.jpg?quality=75&auto=webp&disable=upscale"], "top_img": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "keywords": [], "authors": ["David Amsden"], "canonical_link": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "title": "Kerr Goes Kiwi", "meta_data": {"article": {"published": "2012-08-17T13:00:08.000Z", "modified": "2012-08-23T18:39:40.000Z", "section": "T Magazine", "tag": "New Zealand", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 100000001686367, "nyt_uri": "nyt://article/5196debf-df92-568a-88e5-0f6dc9f353c8", "pubp_event_id": "pubp://event/ab728b125063428ead3db8d8b007f155", "description": "To cap off an extended stay in New Zealand with her family, Miranda Kerr gives Wellington a whirl in fall’s white shirts and strappy flats. And this time her movie-star husband is behind the camera.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "byl": "By David Amsden", "thumbnail": "https://static01.nyt.com/images/2012/08/19/t-magazine/19well-kerr/19well-kerr-thumbStandard.jpg", "news_keywords": "Miranda Kerr,Models,New Zealand", "pdate": 20120817, "og": {"url": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "type": "article", "title": "Kerr Goes Kiwi", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "description": "To cap off an extended stay in New Zealand with her family, Miranda Kerr gives Wellington a whirl in fall’s white shirts and strappy flats. And this time her movie-star husband is behind the camera."}, "twitter": {"url": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "title": "Kerr Goes Kiwi", "description": "To cap off an extended stay in New Zealand with her family, Miranda Kerr gives Wellington a whirl in fall’s white shirts and strappy flats. And this time her movie-star husband is behind the camera.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/5196debf-df92-568a-88e5-0f6dc9f353c8"}}, "site": "@nytimes"}, "CG": "t-magazine", "PT": "article", "PST": "News", "url": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/5196debf-df92-568a-88e5-0f6dc9f353c8", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1345132800.0, "source": "http://www.nytimes.com", "summary": ""}