{"url": "https://www.hollywoodreporter.com/heat-vision/zack-snyder-steps-down-justice-league-deal-family-tragedy-1006455", "text": "Stepping in to shepherd the movie through post and the shooting of some additional scenes will be Joss Whedon, the Avengers filmmaker and creator of Buffy the Vampire Slayer. With Whedon's help, the movie is still on track for its Nov. 17 release date.\n\nSnyder’s daughter Autumn Snyder died by suicide in March at age 20. Her death has been kept private, with only a small inner circle aware of what happened, even as the movie was put on a two-week break for the Snyders to deal with the immediate effects of the tragedy. Zack Snyder says he initially was eager to return to the film, which stars Ben Affleck, Gal Gadot, Jason Momoa and Ezra Miller.\n\n“In my mind, I thought it was a cathartic thing to go back to work, to just bury myself and see if that was the way through it,” said an emotional Snyder in an interview Monday in his office on the Warner Bros. lot, with Deborah sitting by his side. “The demands of this job are pretty intense. It is all-consuming. And in the last two months, I’ve come to the realization … I’ve decided to take a step back from the movie to be with my family, be with my kids, who really need me. They are all having a hard time. I’m having a hard time.”\n\nThe studio is fully behind the move. “What they are going through is unimaginable, and my heart — our hearts — go out to them,\" says Warner Bros. Pictures president Toby Emmerich.\n\nOne of the first things the studio floated was the possibility of pushing back the release date of the movie, but the Snyders decided against that. Warners also extended Snyder's first-look deal to give him time to work on other planned projects when he returns to work.\n\nSnyder, after screening a rough cut of Justice League for fellow filmmakers and friends, wanted to add additional scenes, so he brought Whedon on board to write them. But as he prepared to shoot the scenes in England, Snyder realized it was not the time to leave home. “The directing is minimal and it has to adhere to the style and tone and the template that Zack set,” says Emmerich. “We’re not introducing any new characters. It’s the same characters in some new scenes. He’s handing the baton to Joss, but the course has really been set by Zack. I still believe that despite this tragedy, we’ll still end up with a great movie.”\n\nThis isn’t the first time that Warner Bros. has had to deal with the unthinkable affecting a high-profile DC movie. In 2008, Heath Ledger passed away after shooting had wrapped for The Dark Knight but prior to the movie being finished and released. The tragedy put the studio and filmmaker Christopher Nolan in a very delicate position of balancing mourning with the demands of releasing a tentpole.\n\nThe internet and comic book movie fans being what they are, Snyder already is anticipating what some DC loyalists may think.\n\n“Here’s the thing, I never planned to make this public,” he says. “I thought it would just be in the family, a private matter, our private sorrow that we would deal with. When it became obvious that I need to take a break, I knew there would be narratives created on the internet. They’ll do what they do. The truth is … I’m past caring about that kind of thing now.”\n\nThe death of Autumn, Zack's daughter from his first marriage, to Denise Snyder (in addition to Autumn, he and Deborah have been raising seven kids and step-kids), has brought a new perspective and a new focus for him. “I want the movie to be amazing, and I’m a fan, but that all pales pretty quickly in comparison,\" he says. “I know the fans are going to be worried about the movie, but there are seven other kids that need me. In the end, it’s just a movie. It’s a great movie. But it’s just a movie.\"\n\nAutumn, who was attending Sarah Lawrence College, loved “to write, to write, to write,” says Deborah. Their daughter had written a sci-fi fantasy novel in the first person. It featured a character who was an outsider and who had trouble fitting in.\n\nDeborah is holding on to the thought that she was the first person her daughter gave the book to read, even now as the story takes on a new meaning under the circumstances. “You’re hearing her voice,” Deborah says, fighting back tears.\n\nThe Snyders would like to some day see that manuscript published, with the proceeds going to a charity. “In the end, she didn’t make it, but her character does, and I think there would be something cathartic for people,” says Zack.\n\nThe thought of his daughter’s writing prompts Zack to recall another memory. Autumn had a quote that she included in everything she wrote. (“Every. Single. Thing,” chuckles Zack.) It’s from author Chuck Palahniuk: “We all die. The goal isn't to live forever, the goal is to create something that will.”\n\n“Maybe this helps,” says Zack.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/block_landscape_450_253/2020/01/star_trek_voyager_9-h_2020.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/homepage-icons/heat-vision.svg?abfebfb5f298762e7c71", "https://assets.hollywoodreporter.com/assets/1576792252/images/blogs/promoflag-thr-latest-news.png?abfebfb5f298762e7c71", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-grey.png?abfebfb5f298762e7c71", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://assets.hollywoodreporter.com/assets/1576792252/images/homepage-icons/heat-vision-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/05/zack_snyder_deborah_snyder_.jpg", "https://cdn1.thr.com/sites/default/files/2017/05/zack_snyder_deborah_snyder_.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/block_landscape_450_253/2020/04/hikari_molly_smith_metzler__cover_art_of_dan_and_sam_split-h_2020.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/05/zack_snyder_deborah_snyder_.jpg", "keywords": [], "authors": ["Borys Kit", "Phil Pirrello", "Richard New", "Graeme Mcmillan", "Ryan Parker", "Lesley Goldberg", "Katie Kilkenny", "Sheri Linden", "Ashley Cullins"], "canonical_link": "https://www.hollywoodreporter.com/heat-vision/zack-snyder-steps-down-justice-league-deal-family-tragedy-1006455", "title": "Zack Snyder Steps Down From 'Justice League' to Deal With Family Tragedy", "meta_data": {"viewport": "width=device-width", "description": "The filmmaker's daughter died by suicide in March, prompting him to take a break from work and hire Joss Whedon to finish the Warner Bros. superhero pic: \"I’ve decided to take a step back from the movie to be with my family, be with my kids, who really need me.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/heat-vision/zack-snyder-steps-down-justice-league-deal-family-tragedy-1006455", "domain": "https://www.hollywoodreporter.com/", "title": "Zack Snyder Steps Down From 'Justice League' to Deal With Family Tragedy", "description": "The filmmaker's daughter died by suicide in March, prompting him to take a break from work and hire Joss Whedon to finish the Warner Bros. superhero pic: \"I’ve decided to take a step back from the movie to be with my family, be with my kids, who really need me.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/05/zack_snyder_deborah_snyder_.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Zack Snyder Steps Down From 'Justice League' to Deal With Family Tragedy", "description": "The filmmaker's daughter died by suicide in March, prompting him to take a break from work and hire Joss Whedon to finish the Warner Bros. superhero pic: \"I’ve decided to take a step back from the movie to be with my family, be with my kids, who really need me.\"", "url": "https://www.hollywoodreporter.com/heat-vision/zack-snyder-steps-down-justice-league-deal-family-tragedy-1006455", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/05/zack_snyder_deborah_snyder_.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Zack Snyder Steps Down From 'Justice League' to Deal With Family Tragedy", "sailthru.description": "The filmmaker's daughter died by suicide in March, prompting him to take a break from work and hire Joss Whedon to finish the Warner Bros. superhero pic: \"I’ve decided to take a step back from the movie to be with my family, be with my kids, who really need me.\"", "sailthru.author": "Borys Kit", "sailthru.channel": "Heat Vision", "sailthru.vertical": "Heat Vision", "sailthru.date": "2017-05-22 14:51:53", "sailthru.tags": "Heat Vision, Movies, Zack Snyder, Justice League"}, "movies": [], "publish_date": 1495435913.0, "source": "https://www.hollywoodreporter.com", "summary": ""}