{"url": "https://en.wikipedia.org/wiki/Wedding_dress_of_Catherine_Middleton", "text": "English designer Sarah Burton, creative director of the luxury fashion house Alexander McQueen, designed the bridal gown worn by Catherine Middleton at her wedding to Prince William on 29 April 2011.[1]\n\nThe dress and its maker were not formally announced until the bride stepped from her car to enter Westminster Abbey just prior to the service.[2] Noted for its design, symbolism, and expected influence on Western bridal gown trends, the dress was widely anticipated and generated much comment in the media. Replicas of the dress were produced and sold, and the original dress was on display at Buckingham Palace from 23 July 2011 until 3 October 2011 during the annual summer exhibition.\n\nPre-wedding speculation [ edit ]\n\nBefore the day, there was much speculation as to what Middleton would choose for her dress. On 6 March, The Sunday Times reported on speculation that Middleton had chosen McQueen designer Sarah Burton. Their report stated: \"A fashion source said that the dress will be a combination of Middleton's own design ideas and Burton's deep knowledge and understanding of high fashion.\" The label and Burton both denied any involvement.[3] Burton's work came to the notice of Middleton in 2005 when she attended the wedding of Tom Parker Bowles, the son of Camilla, Duchess of Cornwall. Burton had designed the bridal gown for his bride, fashion journalist Sara Buys.[4] Also suggested were Phillipa Lepley, Victoria Beckham,[5] Sophie Cranston's Libelula,[6][7] Jasper Conran,[8][9] Elizabeth Emanuel,[10] Daniella Issa Helayel,[8] Marchesa by Keren Craig and Georgina Chapman,[5] Stella McCartney,[5] Bruce Oldfield,[9][10][11] and Catherine Walker.[10]\n\nBurton emerged as the odds-on favourite to create the dress amongst bookmakers, so much so that the English bookmaker William Hill stopped taking wagers weeks before the event. David Emanuel, co-designer of the wedding dress of Diana, Princess of Wales, commented to the Canadian fashion journalist Jeanne Beker that \"McQueen is owned by Gucci, an Italian company. If Kate's gone that route, it would be the first time a British-owned house wasn't chosen. And the Italians would have a field day with that.\"[12]\n\nAccording to Joanna Marschner, Senior Curator of the Historic Royal Palaces, \"the dresses have had to grow as the media expectation has grown. Television cameras in Westminster Abbey have meant that those dresses are going to have to live up to those venues and indeed be of a design excellence to bear infinite scrutiny.\"[8]\n\nDesign [ edit ]\n\nA replica of the dress outside a shop in Belfast\n\nOfficial statements noted that Middleton wished to combine tradition and modernity, \"with the artistic vision that characterises Alexander McQueen's work.\" She and Burton worked closely together in formulating the dress design.[13]\n\nThe British tabloid News of the World reported that to maintain secrecy, the embroiderers at the Royal School of Needlework were initially told that the dress was intended to be used in a television costume drama and that cost was no object.[14] As a result, it had been widely reported that the dress cost £250,000,[14][15] although a Clarence House spokesperson dismissed that claim.[16]\n\nThe ivory satin bodice was padded slightly at the hips and narrowed at the waist, and was inspired by the Victorian tradition of corsetry that is a particular Alexander McQueen hallmark.[17] The bodice incorporated floral motifs cut from machine-made lace, which were then appliquéd on to silk net (tulle) by workers from the Royal School of Needlework, based at Hampton Court Palace. On the back were 58 buttons of gazar and organza, which fasten by means of rouleau loops. The skirt, underskirt trim and bridal train (which measured 270 cm—110in) also incorporated lace appliquéd in a similar manner. The main body of the dress was made in ivory and white satin gazar, using UK fabrics which had been specially sourced by Sarah Burton, with a long, full skirt designed to echo an opening flower, with soft pleats which unfolded to the floor, forming a Victorian-style semi-bustle at the back, and finishing in a short train measuring just under three metres in length.[18] To partially fulfill the 'something blue' portion of the British wedding tradition, a blue ribbon was sewn inside the dress. The design for the bodice of the dress featuring lace in the style of the 19th century was the 'something old'.[19]\n\nThe British press showed considerable interest in the lace used in the wedding dress, but their published reports[20][21][22] are at variance with available documentation, and suggest that they were briefed with common incorrect or misleading information. The facts about the lace are as follows. The effect achieved by the design of the bodice is similar to that of the decorated nets that were popular in the late 19th century, typified by the Limerick and Carrickmacross laces of Ireland. For the latter, machine-made net is used as a basis on which floral and other designs are created by various hand-needlework techniques. The press release from the Royal School of Needlework[23] states that the technique used in Catherine's wedding dress \"was influenced by\" traditional Carrickmacross lace technique. However, the technique itself was a completely different and modern device: floral motifs were cut out of lengths of lace produced on large 19th-century machines and stitched to machine net.[24] Three companies are known to have produced lace for the dress: Sophie Hallette[25] and Solstiss[26] in France, and the Cluny Lace Company in Ilkeston, Derbyshire.[27] The majority of the dress is made using the Solstiss lace, specifically the skirt and train. The styles of machine lace go by the names \"English Cluny\" and \"Chantilly\", but should not be confused with the older hand-made bobbin laces of the same names. The lace was not specially commissioned for the dress, but chosen from stock patterns (what was formerly known only as Sophie Hallette's \"950264\" is now known as \"Kate's lace\", however, this lace was only used for the bodice of the dress, the skirt and train are made of the Solstiss lace. Grace Kelly's wedding dress was also made from lace by Solstiss, a French company. All the companies involved are known to produce the highest quality of couture lace.[28]) and hence the floral motifs available were those present in the patterns. Although roses and perhaps shamrocks may be discerned on the bodice, the many reports of daffodils and thistles needed to complete a British quartet seem to be embroidery of the truth rather than of the dress.\n\nReception and influence [ edit ]\n\nThe dress generated much comment in the media from fashion experts and was very well received. It was noted that the design was largely traditional and inspired by dresses from the 1950s. Karl Lagerfeld wrote \"the dress is classic and goes very well in the Westminster decor. It almost reminds me of Elizabeth's wedding, the royal weddings in the [19]50s. The proportion of the train is good. The lace is very pretty. I like the veil a lot.\"[29] Antonio Marras, of Kenzo, stated, \"the choice of the label and the style of the dress was a very clever mix between edgy fashion and tradition — all in a very British way. You could see references to Grace Kelly[30] or Queen Elizabeth's dresses, but in a simpler, more modern way.\"[29] It was noted that the lace bodice of Middleton's dress echoed that worn by Grace Kelly for her marriage to Rainier III, Prince of Monaco, in 1956.[2] Comparisons were also drawn with Princess Margaret's wedding dress. Mark Badgley of Badgley Mischka wrote that \"it's the kind of gown that will stand the test of time. Not all gowns do. Any bride across the world will want to wear it. It's got a touch of vintage, a classic 1950s ball gown, so timeless that her daughter would look gorgeous in this gown 30 years from now.\"[31] Meanwhile, Oscar de la Renta stated that it was \"a very traditional dress for a very traditional wedding...not ostentatious. There was not 50 meters of train, and it was not overembroidered. It was just a very traditional dress for a ravishing girl who doesn't need a lot.\"[31]\n\nComparisons were also made to the dress worn by Prince William's mother, Lady Diana Spencer. Vera Wang said \"Diana's dress had a sense of innocence, whimsy, almost storybook romance. In contrast Catherine's gown was about way more than simply the dress. Sarah Burton channelled a new take on classicism for a modern-day bride who will one day be queen.\"[31] Diana's wedding dress maker, Elizabeth Emanuel, has suggested: \"Exactly as it happened in 1981, there are going to be people watching as she walks down the aisle with their sketch pads, with the machinists and pattern cutters all ready and waiting. By the next morning you'll see copies in High Street.\"[13] Emanuel says the dress would fit many body shapes.[32]\n\nChinese replica of the dress offered for sale to the public four weeks after the Royal Wedding\n\nThere were many suggestions that the style of the dress would influence wedding fashion for the next few years. Alison McGill, the editor-in-chief of Weddingbells Magazine: \"I think her choice to wear long sleeves signals a big goodbye to strapless wedding gowns.\"[33] Meanwhile, Veronica Di Santo-Abramowicz, of the Toronto-based Ines Di Santo label opined \"Kate's dress will influence so much of the bridal style that we will see over the next few years. It always happens that when a person of royalty or high stature gets married, this sets trends for several years. For example, Diana's gown and Carolyn Bessette's gown are two noteworthy brides that come to mind.\"[34]\n\nOne British firm's replica, commissioned by The Times as a contest prize, was completed less than five hours after Middleton began her car ride to the Abbey. The firm received numerous inquiries within a day, but expressed that it would have to consult lawyers before replicas could be sold.[35] New Zealand couturist Jane Yeh worked through the night after the wedding to create another copy of the dress.[36] Chinese dressmakers told news reporters they expected to have knock-offs of the dress available one week from the event; one expressed frustration that it was not leaked in advance so that they could have stock prepared earlier. Another suggested a £70 to £90 retail price.[37]\n\nThe choice of a dress from the fashion house of Alexander McQueen, who had committed suicide in 2010, led Hubert de Givenchy to state \"It's a lovely thought, a nice tribute.\"[29]\n\nThe dress along with other items pertaining to the Royal Wedding were exhibited at Buckingham Palace from 23 July 2011 until 3 October 2011.[38][39] The method of displaying the dress and tiara (on a headless mannequin lit by white lighting) was reported to have been described as \"horrid\" by the Queen during a private tour of the exhibition with the Duchess of Cambridge in July 2011.[38] A microphone overheard the Queen remarking to the Duchess \"It's made to look very creepy\" while Catherine responded that it had a \"3D effect\".[40] The dress helped attract a record number of visitors to Buckingham Palace in the summer months of 2011. It was also reported to have helped raise around ten million pounds towards Middleton's own charity fund as well as the Royal Collection.[41]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Kate_Middleton_Royal_Dress_Replica_-_Full_Front.jpg/200px-Kate_Middleton_Royal_Dress_Replica_-_Full_Front.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/32px-BathingSuit1920s.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/William_and_Kate_wedding.jpg/220px-William_and_Kate_wedding.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Coat_of_Arms_of_Catherine%2C_Duchess_of_Cambridge.svg/120px-Coat_of_Arms_of_Catherine%2C_Duchess_of_Cambridge.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/4/4f/William_and_Kate_wedding.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Kate_Middleton_dress_replica.jpg/300px-Kate_Middleton_dress_replica.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/4f/William_and_Kate_wedding.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wedding_dress_of_Catherine_Middleton", "title": "Wedding dress of Catherine Middleton", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/4/4f/William_and_Kate_wedding.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}