{"url": "www.gq.com/story/chris-pratt-cover-story", "text": "When I arrive at the house in the Hollywood Hills that Chris Pratt shares with his wife, the comic actress Anna Faris, and their 2 1/2-year-old son, Jack, Pratt has just returned from a long early-morning bike ride. He is getting in shape for three forthcoming movies and also preparing for a triathlon in a few weeks’ time, something he was talked into by a good friend, a Navy Seal whom he met while making Zero Dark Thirty. This is the sort of thing you might expect from the new Chris Pratt—the one who posts six-pack selfies on Instagram, the one whose last movie, Guardians of the Galaxy, grossed nearly $800 million worldwide and re-invented him from a bumbling, chubby sitcom sidekick into everyone’s favorite new movie star (a status he hopes to bolster with this month’s Jurassic World). In other words, the one who has undergone a parallel physical and professional transformation without obvious precedent in Hollywood.\n\nPratt’s road here, to this career and this body, has been unlikely and meandering. When he first auditioned for movies in his early twenties he would try out for all kinds of roles, but he soon fell into the first of the two stereotypical parts that would fill up his next decade. \"Typically, I was getting typecast as the bad boyfriend. The boyfriend of the girl who you hope ends up with the guy you like. That was my bread and butter for a long time,\" he says. He’s had a quick shower and has lit a cigar—some combination of late-morning pleasure and character prep for his next movie, The Magnificent Seven. \"Looking back, I think I know why. Physically, I looked like an asshole.\"\n\nWhat do you mean?\n\n\"I looked like the guy—like Johnny in The Karate Kid, you know?\"\n\nSlowly he worked to at least make these roles funnier. \"I always had thought my strongest ability was improvisational comedy,\" he says. \"I was always adding stuff to scenes and the directors would be like, ’Come on, man, no, don’t do that.’ And then that stuff would make the cut. And I was like, ’I knew it! I knew I was funnier than that stupid fucking director, and he didn’t know what the fuck he was talking about! I knew it!’ \"\n\nSoon Pratt was actually being cast for his comic instincts. And with the greater emphasis on comedy came a gradual physical transformation, one that became unavoidably apparent to him as he watched himself on-screen early in the second season of Parks and Recreation. \"I saw myself and I thought, ’Wow, I’m getting fat.’ And then immediately I was like, ’This is the funniest...’ I was making myself laugh. I was: ’That’s where it’s at. There’s no one doing that. No one being like a super-confident dumb fat guy.’ So I started.\" He told the showrunner that he wanted to get even larger, and was enthusiastically encouraged to do so. \"So I just got fatter,\" he says, \"and the laughs kept coming, and it was funnier and funnier. And in that moment I was like, ’Oh great, I found my niche—this is paying better than the asshole-boyfriend parts.’ \"\n\nIf you read or watch the interviews Chris Pratt did in the comedy years, he played the part of the happy plump man to perfection. But he may just have been fooling us and fooling himself at the same time. \"I’m sure I was the first guy in line to buy that line of bullshit,\" he says now. \"I also understood that there was value to it—my comedic nature understood the irony of a super-happy fat sweaty guy who is completely confident and accepting of who he was. That’s fascinating to people. I mean, I was never as big as Chris Farley, but you look at Chris Farley—that’s what made him so magical. Because other people look just like him, and they’re like, ’Why is this guy not crippled with self-doubt? Fuck, that’s awesome. I wish I could feel that way.’ Well, I don’t think Chris Farley did feel that way. I think he killed himself with drugs and alcohol and buried himself in an addiction to hide the fact that he didn’t feel what he was projecting on the outside. I think that’s often the case with comedians.\"\n\nIn the past year or two, Pratt, who turns 36 this month, has become more candid about casting those years in a less joyful light, explaining that the highlights of his days were the eating and drinking but that the rest wasn’t so good, that he felt physically and mentally sluggish and \"didn’t feel too great about who I was.\"\n\nHe nods when I bring this up and elaborates. \"My bones ached, I had cardiovascular issues, I was unhealthy, I was feeling rotten.\"\n\nSo for instance, would you openly discuss with your wife, say: \"I wish my body wasn’t like this—I don’t want to be like this\"?\n\n\"Yeah. But she was so okay with it. Probably in many ways preferred me that way.\"\n\nWhy?\n\n\"I think I was outwardly having more fun. I was more fun to be around, probably. That image that I was casting, to convince people that I was okay, was a really fun person to hang around. Now I have less fun. I focus more. She doesn’t get to cook for me the way she used to.\" He laughs. \"I was like a great pet fat guy.\"\n\nDoes she actively complain that you’re less fun?\n\n\"No, she understands and she just supports me regardless. I think that part of her is hedging her bets that one day I’ll be fat again, and she’ll say, ’Remember, honey, I always told you I preferred you this way.’ She’s probably just playing the long game.\"\n\n\n\n\n\n1 / 14 Chevron Chevron Subtle—not costumey—epaulets make this shirt special. _Shirt, $108, by Banana Republic Tie, $150, by Alexander Olch Tie bar, $15, by The Tie Bar Pants, $790, by Louis Vuitton_ Location (throughout), The Station Joshua Tree, California\n\nAn aside about nudity: What were you like as a young kid?\n\n\"Obnoxious. I was obnoxious, really hyperactive, disruptive...but also Dad was very, very strict, so if I got yelled at, I would stay silent for a long period of time. I was really sensitive. I cried a lot. I was a crybaby for a long time. And kind of perverted. I was like a little perv.\"\n\nIn what way?\n\n\"I was a jokester, I had a dirty mind, and a dirty sense of humor. And I was naked a lot. I was naked all the time. It was just recently, in the last few years since I’ve become an adult, that I’ve learned to keep my clothes on. And even then, I really haven’t. I got yelled at by NBC for getting naked. [While filming multiple takes of a Parks and Recreation scene in which he was supposed to shock Amy Poehler by being naked in a doorway, in one take he did it for real.] I got suspended from the track team in high school for getting naked on the track bus. I was always getting naked. I thought it was hilarious. I didn’t understand how somebody could be so offended by me just taking my junk out.\"\n\nDid NBC explain it to you?\n\n\"They did—they sent me a letter. HR sent me a letter. Someone obviously must have complained about it or something. I guess now that I don’t work for them, I can make fun of it, but part of the letter was saying, like, ’Also, don’t mock this. Just so we’re clear, you’re being reprimanded, and don’t go around talking about how this is funny.’ [It was] the take they fucking used, by the way, that made the air, and was hilarious, so I was totally right, but apparently if you want to get naked there’s certain protocols you have to take to prevent people from being offended—you have to give them the opportunity to not see it. But that’s how I was in high school, too. I remember walking into the coach’s office with just a sock on. Not on my feet. And I was like, ’Hey, Coach, can I talk to you?’ And they were like, ’Jesus, God!’ \" He grins. \"I liked making people feel uncomfortable.\"\n\nGuardians of the Galaxy was the making of Pratt, but however effortless it may have seemed on-screen, the movie’s deft combination of action and comedy, sincerity and levity, didn’t come easily.\n\n\"[Guardians director] James Gunn had a hard time working with me for about the first half of the movie,\" Pratt explains. \"He’ll say—and I wouldn’t want to be quoted [sounding like I was] saying this about myself—I’m a much more cerebral person than you may expect. You may see this guy who’s sort of like goofy and funny and doesn’t give two shits, but really I’m thinking a lot, in my head below the surface.\" Too much, in fact, so that sometimes Pratt would lose track of the natural instincts Gunn had liked. \"It’s a little bit like a Venus flytrap,\" says Pratt. \"If you stick your finger in and it closes, it takes like a week to open back up. So he had a hard time working with me because he’d tell me something, or I’d do something, and the next thing you know he couldn’t get me back to where I started originally.\"", "images": ["https://media.gq.com/photos/55833e2309f0bee564416d35/master/w_1600%2Cc_limit/copilot-style-201506-1431444034253_chris-pratt-gq-june-2015-02.jpg", "http://www.gq.com/verso/static/gq/assets/logo-reverse.2fe772617ee3b7f2fc81c9f7237c17495b42eaee.svg", "http://www.gq.com/verso/static/gq/assets/logo-header.d739eb0c2af2cf500d0c7ebecd1d6597474e69aa.svg", "https://media.gq.com/photos/561c0bcbe8a83977119f8384/4:3/w_800%2Ch_600%2Cc_limit/Screen%252520Shot%2525202015-10-12%252520at%2525203.33.54%252520PM.png", "https://media.gq.com/photos/5643ab193cc8fcfe0e1a09b0/1:1/w_90%2Cc_limit/Typewriter-2.jpg", "https://media.gq.com/photos/564b5985fc144926178b300c/4:3/w_800%2Ch_600%2Cc_limit/amy-schumer-obama-gift.jpg", "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_2560%2Cc_limit/0615-GQ-FECP02-01.jpg", "https://media.gq.com/photos/564276266ff00fb522b0741b/3:2/w_775%2Cc_limit/obama-tout.jpg", "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg", "https://media.gq.com/photos/55833e253655c24c6c95f1a8/master/w_1600%2Cc_limit/copilot-style-201506-1431444034254_chris-pratt-gq-june-2015-03.jpg", "https://media.gq.com/photos/5582c953e52bc4b477a9d88c/master/w_1600%2Cc_limit/entertainment-2015-06-chris-pratt-june-cover-409.jpg", "https://media.gq.com/photos/55833e213655c24c6c95f1a4/master/w_1600%2Cc_limit/copilot-style-201506-1431444034252_chris-pratt-gq-june-2015-01.jpg"], "top_img": "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg", "keywords": [], "authors": ["Chris Heath", "Chris Heat", "Bill Simmons", "Nicole Silverberg", "The Editors Of Gq"], "canonical_link": "https://www.gq.com/story/chris-pratt-cover-story", "title": "Chris Pratt Cover Story: From Dadbod Sidekick to Rock-Hard Hero", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Chris Heath", "copyright": "Copyright (c) Condé Nast 2020", "description": "The ripped star of Jurassic World reflects on what became of his pudgier, goofier self", "id": "5582c9541177d66d68d589fa", "keywords": "culture,celebrities,chris pratt,entertainment,movies + tv,jurassic park,tv,movies", "news_keywords": "culture,celebrities,chris pratt,entertainment,movies + tv,jurassic park,tv,movies", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5582c9541177d66d68d589fa", "parsely-metadata": "{\"description\":\"The ripped star of Jurassic World reflects on what became of his pudgier, goofier self\",\"image-16-9\":\"https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1000,c_limit/0615-GQ-FECP02-01.jpg\",\"image-1-1\":\"https://media.gq.com/photos/5592cf226abb7583307c4c13/1:1/w_1000,c_limit/0615-GQ-FECP02-01.jpg\"}", "og": {"description": "The ripped star of Jurassic World reflects on what became of his pudgier, goofier self", "image": "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg", "site_name": "GQ", "title": "Chris Pratt Cover Story: From Dadbod Sidekick to Rock-Hard Hero", "type": "article", "url": "https://www.gq.com/story/chris-pratt-cover-story"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@gqmagazine", "description": "The ripped star of Jurassic World reflects on what became of his pudgier, goofier self", "domain": "https://www.gq.com", "image": {"src": "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg?mbid=social_retweet"}, "site": "@gqmagazine", "title": "Chris Pratt Cover Story: From Dadbod Sidekick to Rock-Hard Hero"}, "fb": {"app_id": 606963029328755, "pages": 7962048097}}, "movies": [], "publish_date": null, "source": "http://www.gq.com", "summary": ""}