{"url": "https://web.archive.org/web/20100215141959/http://republicanleader.house.gov:80/News/DocumentSingle.aspx?DocumentID=170154", "text": "As Dems’ “Stimulus” Anniversary Nears, Americans Ask: “Where are the Jobs?”\n\nWashington, Feb 12 - As the one year anniversary of the Democrats’ trillion-dollar “stimulus” spending program approaches next Wednesday, it’s fitting to compare the results of the “stimulus” to the rhetoric that the President and Democratic leaders used to sell their spending plan - and see how their promises match up with reality.\n\n\n\nWhen Democrats rushed their massive 1,100 page, “stimulus” through Congress last year, they promised that unemployment would not rise above eight percent and that job creation would begin “almost immediately”. But nearly one year later, more than three million more Americans have lost their jobs, the deficit is set to hit a record shattering $1.6 trillion, and Administration reports on how many jobs were “saved or created” have been “riddled with inaccuracies and contradictions,” noted USA Today.\n\n\n\nBy the metrics the Democrats themselves set, the “stimulus” hasn’t worked – it’s chock-full of wasteful government spending that’s funneled money to Congressional districts that don’t exist and claims of jobs “saved or created” were so exaggerated that the Administration quietly abandoned the metric at the end of last year.\n\n\n\nPoll after poll confirms that an overwhelming majority of Americans oppose the “stimulus” program. In fact, a CBS/New York Times poll released yesterday found that “ just 6 percent of Americans think it has created jobs .” Any wonder that a CNN survey reported that “3 of 4 Americans say much of stimulus money wasted.”\n\n\n\nSo where is all the “stimulus” money going? Here are just a few real-world examples:\n\n\n\nreported last month that:\n\n\n\nAnd if that wasteful spending wasn’t bad enough, the Associated Press reported last month that:\n\n“A federal spending surge of more than $20 billion for roads and bridges in President Barack Obama’s first stimulus has had no effect on local unemployment rates...An Associated Press analysis of stimulus spending found that it didn’t matter if a lot of money was spent on highways or none at all: Local unemployment rates rose and fell regardless. And the stimulus spending only barely helped the beleaguered construction industry, the analysis showed....\n\n\n\n“Even within the construction industry, which stood to benefit most from transportation money, the AP’s analysis found there was nearly no connection between stimulus money and the number of construction workers hired or fired since Congress passed the recovery program. The effect was so small, one economist compared it to trying to move the Empire State Building by pushing against it.”\n\n", "images": ["https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/img/image03.jpg", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/img/image06.jpg", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/img/image07.jpg", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/UploadedFiles/1.jpg", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/News/UploadedFiles/bulb.jpg", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/images/transpix.gif", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/img/image05.jpg", "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/UploadedFiles/2.jpg"], "top_img": "https://web.archive.org/web/20100215141959im_/http://republicanleader.house.gov/img/image03.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "As Dems’ “Stimulus” Anniversary Nears, Americans Ask: “Where are the Jobs?”", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}