{"url": "https://www.elitedaily.com/p/kanye-wests-reaction-to-kim-kardashians-paris-robbery-is-really-really-sad-8957992", "text": "It’s been well over a year since Kim Kardashian was robbed at gunpoint in her Paris hotel room. The violent attack, which happened on Oct. 3, 2016, took an emotional and psychological toll on Kardashian and her family. Even her husband Kanye West is still grappling with the after-effects of the incident. While he wasn’t with his wife at the moment the robbery happened, Kanye West’s reaction to Kim Kardashian’s Paris robbery is quite sad and really speaks to the depth of his love for her.\n\nIn an all-new interview with radio personality Charlamagne tha God, West spoke at length about a variety of topics, including his mental health, therapy, Twitter, and Kardashian’s robbery.\n\nIn the interview, West talked about feeling hopeless in light of his wife’s Paris misfortune:\n\nYou're feeling, like, helpless, like what can you do? … I went to Paris on that trip to protect her. Not protect her physically, but to just go and help her with her looks because she's in Paris. So I'm like, 'Let me put my eye on it personally.'\n\nThe famed rapper left to be at his wife’s side in the middle of a set during the Meadows Music and Arts Festival in New York. He cited a “family emergency” at the time and promptly took his leave.\n\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\n\nDuring his interview with Charlamagne tha God, West also talked about how Kardashian’s assailants plotted against her and waited for him to be out the picture:\n\nOne of the things she said that she heard was they were coming to rob her and they had to wait until I had left. The people had been strategizing and scheming on that for a long time. So when she probably got to Paris by herself, they were like 'This is our chance.' The next thing you know, I get off the flight the next day, and they were like, 'Oh, OK, we gotta like fall back.' And then when I left a couple days later — I almost stayed — I hear, my friend comes up to me and says 'Your wife was robbed.'\n\nIt sounds as if West feels a bit of regret about not staying by Kardashian’s side during that trip, which is super sad. Ultimately, the whole ordeal isn’t West’s fault, but that he still feels the sting of it really shows how much the incident impacted him.\n\nKardashian herself has been exceptionally outspoken about the incident, often relaying the details of the robbery for talk shows, interviews, and social media. In an Instagram post from March 2017, Kardashian shared a few words ahead of an episode of Keeping Up With the Kardashians that revolved around the robbery:\n\nTonight's episode is going to be very tough for me. However, I thought it was important to share this story through my eyes & not in an interview where my own words could be twisted. I have always shared so much & I'm not going to hold back when this was probably one of the most life changing experiences for me. I would never wish this experience upon anyone, but have learned some valuable lessons & feel so blessed to be safe home with my babies & husband. To my friends, family, and loved ones I can't thank you enough for being there when I needed you the most. To the French police, thank you for your incredible hard work.\n\nAlthough the violent robbery had a profound effect on West and Kardashian, it seems that they’ve really pulled through and are stronger than ever. Kardashian has frequently said that she’s a better person because of what happened. And there’s absolutely no doubt that her relationship with West and her children is strengthened because of that.\n\nThe road to healing after such a traumatic event is long, but Kardashian and West are well on their way.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/7c585711-1e53-4baf-9577-fbb76da42ec5-getty-1043857742.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/5/1/1e2f75e1-e87a-4f33-aa61-42814ea42e35-getty-597560444.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/fa7b860b-a00d-495b-a51d-bc1aa651007a-getty-1189601393.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/0b309ce1-1d9c-4d09-88b8-c3c937db183e-getty-1206937594.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/1/1e2f75e1-e87a-4f33-aa61-42814ea42e35-getty-597560444.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/getty/2018/5/1/b30a677b-b5b2-4141-8818-f1ff31c4fd0c-getty-599438124.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/1/1e2f75e1-e87a-4f33-aa61-42814ea42e35-getty-597560444.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kanye-wests-reaction-to-kim-kardashians-paris-robbery-is-really-really-sad-8957992", "title": "Kanye West's Reaction To Kim Kardashian's Paris Robbery Is Really, Really Sad", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kanye-wests-reaction-to-kim-kardashians-paris-robbery-is-really-really-sad-8957992", "type": "article", "title": "Kanye West Opened Up About When Kim Kardashian Was Robbed & It's So Sad", "description": "It’s been well over a year since Kim Kardashian was robbed at gunpoint in her Paris hotel room. The violent attack, which happened on Oct. 3, 2016, took an emotional and psychological toll on Kardashian and her family. Even her husband Kanye West is…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/1/1e2f75e1-e87a-4f33-aa61-42814ea42e35-getty-597560444.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "It’s been well over a year since Kim Kardashian was robbed at gunpoint in her Paris hotel room. The violent attack, which happened on Oct. 3, 2016, took an emotional and psychological toll on Kardashian and her family. Even her husband Kanye West is…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}