{"url": "www.inquisitr.com/4767404/angelina-jolie-reportedly-has-secret-plan-to-woo-thor-star-chris-hemsworth-rumors/", "text": "Angelina Jolie reportedly has her eyes set on a new man a year and a half after her divorce from Brad Pitt. The Mr. And Mrs. Smith actress is apparently crushing hard on hunky actor Chris Hemsworth and is pushing a “secret plan” to get his attention.\n\nIn a recent report by Radar Online, it has been alleged that the 42-year-old A-list actress is keen on getting close to the 34-year-old Australian heartthrob. Apparently, Jolie has devised a secret plan to woo Hemsworth and is hoping to make it happen soon.\n\nAccording to the outlet, Angelina Jolie has been “begging” her team to cast her in a movie alongside Chris Hemsworth. A source revealed that the Maleficent star is a big fan of the actor and his action-filled movies.\n\nThe same source added that Jolie is already gearing up to return to the big screen and would love to work on another action flick, with the Avengers star as her leading man.\n\nAlthough the two celebrities will undoubtedly make a good pairing for a film, there were claims that “the whole thing is pretty fishy.” Apparently, Angelina Jolie is planning to use the opportunity to get close to Chris Hemsworth.\n\nAngelina Jolie reportedly has a crush on Chris Hemsworth. Featured image credit: Christopher Polk Getty Images\n\n“It hasn’t gone unnoticed that Angie swoons whenever she’s in Chris’ presence, and there’s growing talk she’s using this as a way of getting closer to him,” the source claimed.\n\nPreviously, the Daily Mail reported that Angelina Jolie and Chris Hemsworth were seated together at the Golden Globes, sparking various speculations. During the event, the Salt actress appeared comfortable sitting next to the actor, who many claimed resembles her ex-husband Brad Pitt.\n\nViewers do a double take as Angelina Jolie beams next to Brad Pitt look-alike Chris Hemsworth at #GoldenGlobes https://t.co/XBvUnpsQrg — Daily Mail Celebrity (@DailyMailCeleb) January 8, 2018\n\nShortly after the photos made their way online, the Snow White And Huntsman actor laughed off rumors that something special is going on between them. He even pointed out the fact that there were other people sitting with them at the table, including Thor: Ragnarok director Taika Waititi and the actress’ son Pax, 14.\n\n“See, you’ve done what the internet has done, which is you’ve cropped out my real ‘date’.”\n\nChris Hemsworth reveals he's a big fan of Angelina Jolie. Featured image credit: Jamie McCarthy Getty Images\n\nThe actor also reiterated that he and his wife have always been a big fan of the actress, before joking that his wife may be more threatened by Waititi.\n\nChris Hemsworth and his wife, Elsa Pataky, tied the knot on December 10, 2010. They share three children — India Rose, 5, and twins Tristan and Sasha, 3.\n\nMeanwhile, Angelina Jolie and Brad Pitt share six kids — Shiloh, Maddox, Vivienne, Pax, Zahara, and Knox.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/02/Chris-Hemsworth.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Angelina-Jolie.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Angelina-Jolie-Chris-Hemsworth-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/d4beb6dae76d06be0ac3ac9fccf03064?s=250&d=mm&r=g"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Van Bermudez"], "canonical_link": "https://www.inquisitr.com/4767404/angelina-jolie-reportedly-has-secret-plan-to-woo-thor-star-chris-hemsworth-rumors/", "title": "Angelina Jolie Reportedly Has ‘Secret Plan’ To Woo ‘Thor’ Star Chris Hemsworth [Rumors]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}