{"url": "www.usatoday.com/story/news/politics/2017/08/15/donald-trump-returns-new-york-city-first-time-president-wasnt-joyful-homecoming/568752001/", "text": "Corrections & Clarifications: A previous version of the story included a tweet from a parody account claiming to Jill Biden.\n\nNEW YORK CITY – President Trump's argument Tuesday that left wing groups were just as violent as the white supremacists who staged a demonstration in Charlottesville set off a firestorm of criticism from members of his own party – and raised questions about his personal views of racial tensions in the country.\n\nJust one day after Trump sought to tamp down on controversy by condemning white supremacists for their role in racially motivated clashes in the Virginia city, the president appeared to return to his highly criticized initial response that many sides were to blame for the weekend violence.\n\n\"What about the alt-left that came charging at the, as you say, alt-right?\" Trump told reporters in a chaotic impromptu press conference at Trump Tower. \"Do they have any semblance of guilt? What about the fact they came charging with clubs in their hands?\"\n\nTrump said he couldn't make a condemnation of hate groups earlier because he didn't \"know all the facts\" about an alleged white nationalist who crashed a car into a crowd of protesters, killing one person and wounded 19 others.\n\n\"I wanted to make sure, unlike most politicians, that what I said was correct,\" Trump said from Trump Tower in New York, after an event that was intended to be devoted to a new infrastructure executive order.\n\nTrump has been especially quick to denounce previous terrorist attacks, including those taking place overseas. Yet he was notably reticent to pinpoint the blame for one on Saturday that involved white supremacists – a point his critics on both sides of the aisle continued to hammer.\n\n\"We must be clear. White supremacy is repulsive. This bigotry is counter to all this country stands for. There can be no moral ambiguity,” said House Speaker Paul Ryan, R-Wis.\n\nHouse Democratic Leader Nancy Pelosi, D-Calif. added: \"There is only one side to be on when a white supremacist mob brutalizes and murders in America.”\n\nSeveral lawmakers were dismayed the president appeared to equate white supremacists with their opponents. Rep. Ileana Ros-Lehtinen, R-Fla., tweeted: \"Blaming 'both sides' for #Charlottesville?! No. Back to relativism when dealing with KKK, Nazi sympathizers, white supremacists? Just no.\"\n\nAnother Republican, Rep. Charlie Dent from Pennsylvania, said Trump \"must stop the moral equivalency! AGAIN.\"\n\nOver the weekend, Trump faced heavy criticism from both Republicans and Democrats for chiding \"many sides\" for their role in the violence in Charlottesville on Saturday, a statement many regarded as tepid toward racists.\n\nA full two days later, on Monday, Trump at the White House directly condemned the KKK, neo-Nazis and white supremacists and announced the Justice Department would open up a civil rights investigation into the driver of the car that killed Charlottesville resident Heather Heyer.\n\nYet on Tuesday, amid questions about whether Trump meant the words behind his most recent scripted statement, the president called his initial response \"fine\" and blamed the press for being dishonest in its coverage.\n\n\"There was no way of making a correct statement that early,\" he said at one point. \"I had to see the facts. Unlike a lot of reporters – I didn't know (prominent white supremacist) David Duke was there. I wanted to see the facts.\"\n\nFor his part, former KKK leader Duke tweeted a thank you to the president after his statement Tuesday – for condemning \"the leftist terrorists\" in Black Lives Matter and Antifa.\n\nTrump also said \"not all of those people\" who attended the demonstration were not racist or neo-Nazi, but only wanted to protest the city's plans to remove the Robert E. Lee statue.\n\nThat statement also drew catcalls from Republicans. \"If you're showing up to a Klan rally, you're probably a racist or a bigot,\" said Rep. Will Hurd, R-Tex., said on CNN.\n\nAnd Sen. Marco Rubio, R-Fla., tweeted that \"the organizers of events\" that led to the Charlottesville terror attack \"are 100% to blame.\"\n\nThe white supremacists, Rubio tweeted, are \"adherents of an evil ideology which argues certain people are inferior because of race, ethnicity or nation of origin.... When (there's an) entire movement built on anger and hatred towards people different than you, it justifies and ultimately leads to violence against them.\"\n\nRubio offered a direct message to Trump: \"Mr. President, you can't allow #WhiteSupremacists to share only part of blame... (they) will see being assigned only 50% of blame as a win. We can not allow this old evil to be resurrected.\"\n\nMore:Trump distances himself from strategist Steve Bannon in wake of Charlottesville violence\n\nFormer KKK leader David Duke loved Trump's news conference comments\n\nTwitter melts down in response to Trump comments\n\nThe president was slated to only discuss infrastructure during his appearances, but took questions from reporters for more than 15 minutes, most of them about Charlottesville. Some aides looked dismayed as he answered more questions.\n\nDuring a rollicking, impromptu news conference in which Trump and reporters frequently argued and interrupted each other, the president also:\n\nQuestioned moves by local government to remove Confederate statues and monuments from public places\n\nTrump openly wondered whether tributes to George Washington and Thomas Jefferson are at risk because they were slave owners. \"You really do have to ask yourself, where does it stop?\" Trump said. On the other hand, Trump said local governments are free to make their own decisions on these issues.\n\nRefused to say whether he thought the \"alt-left\" were as bad as the white supremacists who organized a demonstration in defense of the Robert E. Lee statue\n\n\"You had a group on one side that was bad and you had a group on the other side that was also very violent,\" Trump said. While Trump said he condemned neo-Nazis, he said \"not all of those people\" at the rally were neo-Nazis or white supremacists \"by any stretch.\"\n\nThe Anti-Defamation League disputed Trump's comments, tweeting that \"comparisons between white supremacists & counter protesters are beyond the pale.\"\n\nDistanced himself from chief strategist Steve Bannon, whose role has been in the spotlight after the Charlottesville violence\n\nTrump cast the former chief executive of his 2016 campaign as a late-comer to his cadre of advisers and expressed uncertainty about his fate at the White House. “Mr. Bannon came on very late,\" Trump told reporters. \"I like him, he’s a good man, he is not a racist, I can tell you that. But we’ll see what happens with Mr. Bannon.\"\n\nRefused to answer a question on why self-proclaimed Nazis say they support him\n\n\"They don't,\" Trump responded.\n\nSaid he had a plan to the nation's racial divide\n\nThat plan involves creating more – and better – jobs.\n\nMore:Charlottesville aftermath: Protests flare up again across U.S.\n\nTrump order seeks to speed up infrastructure projects, but advocates say it will waste tax dollars\n\nTrump says CEOs leaving manufacturing council 'not taking their jobs seriously'\n\nTrump's retweet storm: A Pizzagate conspiracy theorist, a train hitting CNN, and accusations of fascism\n\nTrump's remarks left many on Twitter expressing concerns he is too soft on racists and bigots.\n\nThe news conference capped a day in which Trump returned to his residence in the gold-leaf comfort of Trump Tower for the first time since he took office in January – but it hasn't been a particularly joyful homecoming.\n\nAmid rush hour, after the rain, protestors returned to Fifth Avenue with bullhorns and placards in hand to protest Trump's views of race, immigration, and other issues. \"New York hates you,\" read one sign. Police placed a protest area about a block-and-a-half from Trump Tower.\n\nTrump huddled with staff and signed an executive order on infrastructure Tuesday – at a podium affixed with the presidential seal in front of the elevator bank – that did little to change the conversation.\n\nThe infrastructure announcement – intended to streamline the permitting process for infrastructure projects – is part of Trump's ongoing effort to try and toll back federal regulations that he says undermine economic development. Many of the targeted regulations involve environmental restrictions.\n\nYet even as Trump heralded the order as a way to promote jobs, business leaders within his circle appeared to be more focused on the president's response to Charlottesville.\n\nSo far, five senior leaders from president's business council have stepped down amid criticism that Trump was too slow to directly condemn violence involving white supremacists.\n\nAfter his press conference, another member of his council – Richard Trumka, president of the The American Federation of Labor and Congress of Industrial Organizations – announced he would step down. \"I cannot sit on a council for a President that tolerates bigotry and domestic terrorism; I resign, effective immediately,\" tweeted Trumka.\n\nActivists are continuing to pressure remaining members to follow suit.\n\n\"No adviser committed to the bipartisan American traditions of government can possibly believe he or she is being effective at this point,\" tweeted Lawrence Summers, a former high-level economic adviser to Democratic presidents Bill Clinton and Barack Obama.\n\nYet Trump has done little to stem the controversy. Hours after making a formal statement Monday denouncing those who perpetuate racially-motivated attacks, Trump returned Monday night to a usual line of criticism: the press. \"Made additional remarks on Charlottesville and realize once again that the #Fake News Media will never be satisfied...truly bad people!\"\n\nTrump stirred up more Twitter trouble after that. In the leadup to his press conference Tuesday, he retweeted a prominent figure from the alt-right who pushed the \"Pizzagate\" and Seth Rich conspiracy theories, who questioned why there was no similar outrage over violence in Chicago.\n\nHe tweeted then retweeted and deleted a post that included the cartoon of a train – the \"Trump train\" running over a CNN reporter, an image that drew criticism in the wake of the deadly car ramming incident in Virginia.\n\nSteady rain in midtown Manhattan kept away many protesters Tuesday – as did a heavy security perimeter that included a line of white sanitation trucks parked along Fifth Avenue, flanking the entrance to Trump Tower.\n\nTrump is expected to return to his 17-day working vacation at his golf club in Beminster, N.J., on Wednesday.", "images": ["https://www.gannett-cdn.com/-mm-/4479cfab0c72d83538db71a0516440d955520c7f/c=0-77-3165-1865/local/-/media/2017/08/15/USATODAY/USATODAY/636384109195187896-AP-TRUMP-93089889.JPG?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5542141202001_5542134230001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/4479cfab0c72d83538db71a0516440d955520c7f/c=0-77-3165-1865/local/-/media/2017/08/15/USATODAY/USATODAY/636384109195187896-AP-TRUMP-93089889.JPG?width=3165&height=1788&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/4479cfab0c72d83538db71a0516440d955520c7f/c=0-77-3165-1865/local/-/media/2017/08/15/USATODAY/USATODAY/636384109195187896-AP-TRUMP-93089889.JPG?width=3165&height=1788&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/news/politics/2017/08/15/donald-trump-returns-new-york-city-first-time-president-wasnt-joyful-homecoming/568752001/", "title": "Trump's assertion left wing protesters just as violent as white supremacists in Charlottesville sets off firestorm", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Trump's assertion left wing protesters just as violent as white supremacists in Charlottesville sets off firestorm", "description": "\"I wanted to make sure, unlike most politicians, that what I said was correct,\" Trump said.", "url": "https://www.usatoday.com/story/news/politics/2017/08/15/donald-trump-returns-new-york-city-first-time-president-wasnt-joyful-homecoming/568752001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/4479cfab0c72d83538db71a0516440d955520c7f/c=0-77-3165-1865/local/-/media/2017/08/15/USATODAY/USATODAY/636384109195187896-AP-TRUMP-93089889.JPG?width=3165&height=1788&fit=crop&format=pjpg&auto=webp", "width": 3165, "height": 1788}, "type": "article"}, "article": {"author": "David Jackson", "content_tier": "free", "opinion": "false"}, "description": "\"I wanted to make sure, unlike most politicians, that what I said was correct,\" Trump said.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/4479cfab0c72d83538db71a0516440d955520c7f/c=0-77-3165-1865/local/-/media/2017/08/15/USATODAY/USATODAY/636384109195187896-AP-TRUMP-93089889.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Trump's assertion left wing protesters just as violent as white supremacists in Charlottesville sets off firestorm", "description": "\"I wanted to make sure, unlike most politicians, that what I said was correct,\" Trump said."}}, "movies": [], "publish_date": 1502726400.0, "source": "http://www.usatoday.com", "summary": ""}