{"url": "https://www.nhsinform.scot/illnesses-and-conditions/infections-and-poisoning/norovirus", "text": "Norovirus causes diarrhoea and vomiting and is one of the most common stomach bugs in the UK. It's also called the \"winter vomiting bug\" because it's more common in winter, although you can catch it at any time of the year.\n\nNorovirus can be very unpleasant but it usually clears up by itself in a few days.\n\nYou can normally look after yourself or your child at home.\n\nTry to avoid going to your GP, as norovirus can spread to others very easily. Call your GP or the NHS 24 '111' service if you're concerned or need any advice.\n\nThis page covers:\n\nSymptoms of norovirus\n\nHow is norovirus spread?\n\nPreventing norovirus\n\nWhat to do if you have norovirus\n\nWhen to get medical advice\n\nSymptoms of norovirus\n\nYou're likely to have norovirus if you experience:\n\nsuddenly feeling sick\n\nprojectile vomiting\n\nwatery diarrhoea\n\nSome people also have a slight fever, headaches, painful stomach cramps and aching limbs.\n\nThe symptoms appear one to two days after you become infected and typically last for up to two or three days.\n\nHow is norovirus spread?\n\nNorovirus spreads very easily in public places such as hospitals, nursing homes and schools.\n\nYou can catch it if small particles of vomit or stools (poo) from an infected person get into your mouth, such as through:\n\nclose contact with someone with norovirus – they may breathe out small particles containing the virus that you could inhale\n\ntouching contaminated surfaces or objects – the virus can survive outside the body for several days\n\neating contaminated food – this can happen if an infected person doesn't wash their hands before preparing or handling food\n\nA person with norovirus is most infectious from when their symptoms start until 48 hours after all their symptoms have stopped, although they may also be infectious for a short time before and after this.\n\nYou can get norovirus more than once because the virus is always changing, so your body is unable to build up long-term resistance to it.\n\nPreventing norovirus\n\nIt's not always possible to avoid getting norovirus, but following the advice below can help stop the virus spreading.\n\nStay off work or school until at least 48 hours after the symptoms have stopped. You should also avoid visiting anyone in hospital during this time.\n\n\n\nWash your hands frequently and thoroughly with soap and water, particularly after using the toilet and before preparing or handling food. Don't rely on alcohol hand gels, as they do not kill the virus.\n\n\n\nDisinfect any surfaces or objects that could be contaminated. It's best to use a bleach-based household cleaner.\n\n\n\nWash any items of clothing or bedding that could have become contaminated separately on a hot wash (60 °C) to ensure the virus is killed.\n\n\n\nDon't share towels and flannels.\n\n\n\nFlush away any poo or vomit in the toilet and clean the surrounding area with a bleach-based household cleaner.\n\n\n\nAvoid eating raw, unwashed produce and only eat oysters from a reliable source, as oysters can carry norovirus.\n\nHow to avoid Norovirus (Audio leaflet)\n\nWhat to do if you have norovirus\n\nIf you experience sudden diarrhoea and/or vomiting, the best thing to do is to stay at home until you're feeling better. There's no treatment for norovirus, so you have to let it run its course.\n\nYou don't usually need to get medical advice unless there's a risk of a more serious problem (see When to get medical advice).\n\nTo help ease your own or your child’s symptoms:\n\ndrink plenty of fluids to avoid dehydration. You need to drink more than usual to replace the fluids lost from vomiting and diarrhoea – as well as water, adults could also try fruit juice and soup. Avoid giving fizzy drinks or fruit juice to children as it can make their diarrhoea worse. Babies should continue to feed as usual, either with breast milk or other milk feeds.\n\ntake paracetamol for any fever or aches and pains.\n\nget plenty of rest.\n\nif you feel like eating, eat plain foods, such as soup, rice, pasta and bread.\n\nuse special rehydration drinks made from sachets bought from pharmacies if you have signs of dehydration, such as a dry mouth or dark urine – read more about treating dehydration.\n\nBabies and young children, especially if they're less than a year old, have a greater risk of becoming dehydrated.\n\nNorovirus can spread very easily, so you should wash your hands regularly while you're ill and stay off work or school until at least 48 hours after the symptoms have stopped, to reduce the risk of passing it on.\n\nWhen to get medical advice\n\nYou don't normally need to see your GP if you think you or your child has norovirus, as there's no specific treatment for it.\n\nAntibiotics won't help because norovirus is caused by a virus.\n\nVisiting your GP surgery with norovirus can put others at risk, so it's best to call your GP or the NHS 24 '111' service if you're concerned or feel you need advice.\n\nGet medical advice if:\n\nyour baby or child has passed six or more watery stools (poo) in the past 24 hours, or has vomited three times or more in the past 24 hours\n\nyour baby or child is less responsive, feverish, or has pale or mottled skin\n\nyou or your child has symptoms of severe dehydration, such as persistent dizziness, only passing small amounts of urine or no urine at all, or reduced consciousness – babies and elderly people have a greater risk of becoming dehydrated\n\nyou have bloody diarrhoea\n\nyour symptoms haven't started to improve after a few days\n\nyou or your child have a serious underlying medical condition, such as kidney disease, and have diarrhoea and vomiting\n\nYour GP may suggest sending off a sample of your stool to a laboratory to confirm whether you have norovirus or another infection.", "images": ["https://www.nhsinform.scot/Content/images/bsl-logo.svg", "https://www.nhsinform.scot/media/1716/nss-logo-blue.png", "https://www.nhsinform.scot/Content/images/logos/nhs-24--white.svg", "https://www.nhsinform.scot/Content/images/logos/nhs-inform-logo--white.svg", "https://www.nhsinform.scot/media/1060/woman-vomiting-into-toilet-web-ready.jpg?anchor=center&mode=crop&width=1200&height=630&rnd=131193666580000000", "https://api-visitor-us-east.velaro.com/20046/4564/button.jpg"], "top_img": "https://www.nhsinform.scot/media/1060/woman-vomiting-into-toilet-web-ready.jpg?anchor=center&mode=crop&width=1200&height=630&rnd=131193666580000000", "keywords": [], "authors": [], "canonical_link": "https://www.nhsinform.scot/illnesses-and-conditions/infections-and-poisoning/norovirus", "title": "Norovirus symptoms & treatment - Illnesses & conditions", "meta_data": {"viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "umb": {"id": 4669, "docType": "dtGuide"}, "ifmPageId": 4669, "ifmPageTitle": "Norovirus", "referrer": "always", "_info": "NHS inform", "description": "Norovirus is a stomach bug which causes diarrhoea and vomiting. Learn about norovirus treatment and prevention.", "og": {"type": "article", "locale": "en_GB", "title": "Norovirus symptoms and treatments", "description": "Norovirus is a stomach bug which causes diarrhoea and vomiting. Learn about norovirus treatment and prevention.", "image": "https://www.nhsinform.scot/media/1060/woman-vomiting-into-toilet-web-ready.jpg?anchor=center&mode=crop&width=1200&height=630&rnd=131193666580000000"}, "twitter": {"card": "summary_large_image", "site": "@NHSinform", "creator": "@NHSinform", "title": "Norovirus symptoms and treatments", "description": "Norovirus is a stomach bug which causes diarrhoea and vomiting. Learn about norovirus treatment and prevention.", "image": "https://www.nhsinform.scot/media/1060/woman-vomiting-into-toilet-web-ready.jpg?anchor=center&mode=crop&width=1200&height=630&rnd=131193666580000000"}, "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/Content/images/icons/ms-icon-144x144.png", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://www.nhsinform.scot", "summary": ""}