{"url": "www.cheatsheet.com/entertainment/rumors-about-carrie-underwood-and-mike-fisher-you-should-stop-believing.html/", "text": "Carrie Underwood revealed in November 2017 that she fell and broke her wrist outside her home in Nashville, Tennessee. Underwood also injured her face badly and needed roughly 40 stitches. As if that weren’t enough, the singer and her husband, Mike Fisher, have been fighting nasty family and breakup rumors for years, which only intensified after her fall. People began questioning if she and Fisher were headed for splitsville.\n\nHere are some of the outrageous rumors — including a nasty one about Mike Fisher (on Page 4!) — you should stop believing about this celebrity couple.\n\nUnderwood locked her son and dogs in a hot car\n\nCarrie Underwood has had to face some ugly rumors. | Christopher Polk/Getty Images for Mastercard Carrie Underwood has had to face some ugly rumors. | Christopher Polk/Getty Images for Mastercard\n\nThis rumor came about in 2015, when Underwood made news for breaking the window of her locked car to get her son, Isaiah, and dogs out of the hot vehicle. Underwood tweeted that her dogs somehow locked the doors. But not everyone was buying her explanation and started saying maybe she pushed the button accidentally and locked everyone in as she was stepping out.\n\nAccidents obviously do happen, and there is no evidence of anything else occurring other than what she said. So there’s no reason to believe she was lying about it.\n\nNext: Did a daytime talk show host start this rumor?\n\n\n\nUnderwood had a face lift, and her injury is a cover-up\n\nWendy Williams suggested Carrie Underwood is hiding her face because of a cosmetic procedure. | Wendy Williams suggested Carrie Underwood is hiding her face because of a cosmetic procedure. | Carrie Underwood via Instagram\n\nIn January 2018, after Underwood’s admission that she may not look the same since her fall, talk show host Wendy Williams suggested that the country star didn’t injure her face but instead had a face lift.\n\n“She [Carrie] released on Twitter that we may not recognize her when it’s all said and done. I don’t know what that means … an excuse for a face lift,” Williams said during her Hot Topics segment.\n\nShe then backed off after the harsh comment saying, “No … We’re cynical! She was already cute, so I don’t know what she’s doing or what happened.”\n\nNext: She looks completely different.\n\nShe’s unrecognizable since her fall\n\nCarrie Underwood posed for a photo after her accident. | Carrie Underwood posed for a photo after her accident. | Adrienne Gang via Twitter\n\nSo how different will the star look next time we see her? Well, at least one person took a photo with her and didn’t notice any change.\n\nIn fact, Below Deck alum Adrienne Gang thought Underwood looked “great” when she saw her working out in a gym at a resort. The Bravo star spoke to Us Weekly about their encounter on Dec. 12.\n\nI had no idea she got hurt prior to meeting her. She had a wrist brace on, but I didn’t think much of it until I saw the headlines after I posted our picture together. She looked great and seemed to be in great spirits. I didn’t notice anything amiss on her face. Simply, she looked lovely.\n\nNext: Ugly accusations against Mike Fisher\n\n\n\nFisher caused Underwood’s fall\n\nThere’s no reason to suspect this incident involved Fisher. | Michael Loccisano/Getty Images There’s no reason to suspect this incident involved Fisher. | Michael Loccisano/Getty Images\n\nAnother vicious rumor that swirled about the couple after the songbird’s fall is that Fisher pushed her down, causing her injury.\n\nBut those who are accusing her husband of domestic violence are ignoring the fact that he wasn’t even home when Underwood fell. Therefore, he obviously didn’t push her.\n\nFisher did fly home as soon as he heard about her accident and thanked all their fans for the well wishes and support while she recovered.\n\nNext: Is their marriage on the rocks?\n\n\n\nTheir marriage is in trouble, and they’re living separate lives\n\nIs their marriage in any type of trouble? | Rick Diamond/Getty Images for J/P Haitian Relief Organization Is their marriage in any type of trouble? | Rick Diamond/Getty Images for J/P Haitian Relief Organization\n\nThere comes a time in almost every celebrity couple’s relationship when, unfortunately, they have to deal with made up rumors that their marriage is in trouble.\n\nIn 2017, an unnamed source told a not-so-reliable site that the “Jesus Take the Wheel” artist and hockey player’s marriage was in “peril.” The source said they had grown apart and were having problems, even living separate lives. “Between their careers, Carrie and Mike are so busy that they’re barely together — and unfortunately, their problems run much deeper than that,” the source claimed.\n\nThere has never been any proof that this story was true or that this source knew what they were talking about. So we’ll just call it what it is: a rumor.\n\nNext: Did Underwood force Fisher to retire?\n\nUnderwood wanted another baby and forced Fisher to retire\n\nDid she want to have another baby? | Jason Merritt/Getty Images for dcp Did she want to have another baby? | Jason Merritt/Getty Images for dcp\n\nIn 2017, Fisher retired from the NHL after spending 17 seasons in the league with Ottawa Senators and Nashville Predators. Soon after his decision was announced, reports claimed Underwood forced him to retire because she wanted to work on their marriage and try for baby No. 2.\n\nGossip Cop busted this rumor, pointing out the so-called source only had second-hand knowledge of this.:”I heard that she had become really unhappy with the situation. Having Mike home will be one solution, and I believe she hopes that having another baby together will bring them even closer than when they first fell in love.”\n\nThis story had no truth to it, especially because Fisher didn’t stay retired long.\n\nNext: Is Underwood upset that Fisher came out of retirement?\n\n\n\nThe singer is unhappy with her husband’s decision to return to ice\n\nIs she keeping him away from his career? | Bruce Bennett/Getty Images Is she keeping him away from his career? | Bruce Bennett/Getty Images\n\nIn 2018, Fisher came out of retirement and rejoined the Predators. So a tabloid used that story and spun it, claiming Underwood was upset about his decision to return to the league.\n\nHowever, the posts she put on Instagram when he decided to go back point to the contrary. The “Before He Cheats” singer posted an image of a T-shirt with her hubby’s face on it that reads, “The Fish is back!” She also posted about how “proud” she is of him and hopes he can bring home the Stanley Cup.\n\nESPN even reported that it was Underwood who encouraged her man to return to the ice.\n\nNext: Are they splitting up?\n\n\n\nThe couple is getting a divorce\n\nShe confirmed they are doing just fine. | Ben Gabbe/Getty Images for TIME She confirmed they are doing just fine. | Ben Gabbe/Getty Images for TIME\n\nDivorce rumors popped up again in February 2018, and this time, Fisher set the record straight. After In Touch magazine reported they were going to end their marriage, the story gained legs when Fisher posted something to social media.\n\nThe NHL star posted a quote from Psalm 139:23-24 which read, “Search me, God, and know my heart; test me and know my anxious thoughts. See if there is any offensive way in me, and lead me in the way of everlasting.”\n\nA fan then posted they would be “praying” for the couple and hoped they could get past their troubles. Fisher shut down the rumor right then and there by responding, writing, “We’ve never been better. Thanks.”\n\nFollow Michelle Kapusta on Twitter @philamichelle.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-804329930-640x450.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Mike-Fisher-and-Carrie-Underwood-640x437.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/25017737_347318129076114_2909506714275414016_n-650x507.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Mike-Fisher-and-Carrie-Underwood-2-640x438.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Mike-Fisher-and-Carrie-Underwood-1-640x425.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Untitled.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Mike-FIsher-and-Carrie-Underwood-in-Tennessee-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Mike-Fisher-640x426.jpg?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-804329930-640x450.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-804329930-640x450.jpg", "keywords": [], "authors": ["Michelle Kapusta"], "canonical_link": "https://www.cheatsheet.com/entertainment/rumors-about-carrie-underwood-and-mike-fisher-you-should-stop-believing.html/", "title": "Rumors About Carrie Underwood and Mike Fisher You Should Stop Believing", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/rumors-about-carrie-underwood-and-mike-fisher-you-should-stop-believing.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "After Carrie Underwood was badly injured in a fall outside her home, she and her hubby Mike Fisher's personal lives have become the target of nasty rumors.", "og": {"locale": "en_US", "type": "article", "title": "Rumors About Carrie Underwood and Mike Fisher You Should Stop Believing", "description": "After Carrie Underwood was badly injured in a fall outside her home, she and her hubby Mike Fisher's personal lives have become the target of nasty rumors.", "url": "https://www.cheatsheet.com/entertainment/rumors-about-carrie-underwood-and-mike-fisher-you-should-stop-believing.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-08-03T18:57:25-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-804329930-640x450.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-804329930-640x450.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Sports", "section": "Entertainment", "published_time": "2018-06-07T17:42:00-04:00", "modified_time": "2018-08-03T18:57:25-04:00"}, "twitter": {"card": "summary_large_image", "description": "After Carrie Underwood was badly injured in a fall outside her home, she and her hubby Mike Fisher's personal lives have become the target of nasty rumors.", "title": "Rumors About Carrie Underwood and Mike Fisher You Should Stop Believing", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-804329930-640x450.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528407720.0, "source": "http://www.cheatsheet.com", "summary": ""}