{"url": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films", "text": "Series of American superhero films\n\nThe Marvel Cinematic Universe (MCU) films are a series of American superhero films produced by Marvel Studios based on characters that appear in publications by Marvel Comics. The MCU is the shared universe in which all of the films are set. The films have been in production since 2007, and in that time Marvel Studios has produced and released 23 films, with at least 14 more in various stages of development. It is the highest-grossing film franchise of all time, having grossed over $22.5 billion at the global box office. This includes Avengers: Endgame, which is the highest-grossing film of all time.\n\nKevin Feige has produced every film in the series, alongside Avi Arad for the first two releases, Gale Anne Hurd for The Incredible Hulk, Amy Pascal for the Spider-Man films, and Stephen Broussard for Ant-Man and the Wasp. The films are written and directed by a variety of individuals and feature large, often ensemble, casts. Many of the actors, including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner signed contracts to star in numerous films.\n\nMarvel Studios releases its films in groups called \"Phases\".[1][2] Their first film is Iron Man (2008), which was distributed by Paramount Pictures. Paramount also distributed Iron Man 2 (2010), Thor (2011) and Captain America: The First Avenger (2011), while Universal Pictures distributed The Incredible Hulk (2008). Walt Disney Studios Motion Pictures began distributing the series with the crossover film The Avengers (2012), which concluded Phase One.[2][3] Phase Two comprises Iron Man 3 (2013), Thor: The Dark World (2013), Captain America: The Winter Soldier (2014), Guardians of the Galaxy (2014), Avengers: Age of Ultron (2015), and Ant-Man (2015).[2]\n\nCaptain America: Civil War (2016) is the first film of Phase Three, and is followed by Doctor Strange (2016), Guardians of the Galaxy Vol. 2 (2017), Spider-Man: Homecoming (2017), Thor: Ragnarok (2017), Black Panther (2018), Avengers: Infinity War (2018), Ant-Man and the Wasp (2018), Captain Marvel (2019), Avengers: Endgame (2019), and Spider-Man: Far From Home (2019).[2] The first three phases are collectively known as \"The Infinity Saga\". The Spider-Man films are owned, financed, and distributed by Sony Pictures.\n\nPhase Four will include Black Widow (2020), The Eternals (2021), Shang-Chi and the Legend of the Ten Rings (2021), a third Spider-Man film (2021), Doctor Strange in the Multiverse of Madness (2021), and Thor: Love and Thunder (2022).[4][5][6] The phase will feature these films, as well as eight announced television event series for the streaming service Disney+.[4][7] Black Panther II (2022) and a Captain Marvel sequel (2022) are also in development,[5] along with one additional film for 2022 and four films for 2023.\n\nFilms\n\nThe Infinity Saga\n\nThe films from Phase One through Phase Three are collectively known as \"The Infinity Saga\".[10][11]\n\nUpcoming\n\n^ [4][7] Phase Four also includes multiple series streaming on Disney+\n\nFuture\n\nKevin Feige and Marvel have additional storylines planned through 2028,[70] resulting in many films \"on the docket that are completely different from anything that's come before—intentionally.\"[71] Feige noted at the 2019 San Diego Comic-Con that the studio has films scheduled to release after 2021, though they would not announce them nor the release dates at this time. Disney has scheduled additional release dates for untitled Marvel Studios films on October 7, 2022, as well as February 17, May 5, July 28, and November 3, 2023.\n\nBlack Panther II (2022)\n\nBy October 2018, Ryan Coogler had completed a deal to write and direct a sequel to Black Panther.[68] In July 2019, Feige confirmed the film is currently in development.[73] At the 2019 D23 Expo, the working title Black Panther II and a release date of May 6, 2022 were announced.\n\nUntitled Captain Marvel sequel (2022)\n\nFeige confirmed a sequel to Captain Marvel was in development at the 2019 San Diego Comic-Con.[74] In January 2020, Megan McDonnell was in final negotiations to write the script for the sequel. Anna Boden and Ryan Fleck, the directors and co-writers of the first film, were not expected to return, with the studio looking to hire a female director.[69] The film is scheduled to be released on July 8, 2022.[5]\n\nBlade\n\nMarvel Studios had a working script for a Blade film by May 2013,[75] after reacquiring the character's film rights.[76] By July 2015, Wesley Snipes stated that he had discussed the possibility of reprising his role with Marvel Studios.[77] At the 2019 San Diego Comic-Con, Blade was announced with Mahershala Ali as Eric Brooks / Blade.[4] The actor previously portrayed Cornell \"Cottonmouth\" Stokes in the first season of Luke Cage.[78] Blade is not part of Phase Four.[79]\n\nGuardians of the Galaxy Vol. 3\n\nIn April 2016, Feige stated that \"Guardians 3 is [one film that's] up there\" being considered for release beyond 2019.[80] In March 2017, James Gunn stated that a third Guardians film would happen \"for sure\",[81] and the following month confirmed he would return to write and direct Guardians of the Galaxy Vol. 3.[82] However, in July 2018, Disney and Marvel severed ties with Gunn following the resurfacing of controversial tweets from 2008 and 2009 making light of topics such as rape and pedophilia.[83][84] Marvel planned to continue to use Gunn's script for the film.[85] Production was put on hold in August 2018,[86] ahead of the planned start of filming in January or February 2019.[87][86] In March 2019, Disney and Marvel reversed course and reinstated Gunn as the director of the film. Filming will begin in 2020 once he has completed his work for the DC Extended Universe film The Suicide Squad.[88][89] Feige confirmed that the film was in development at the 2019 San Diego Comic-Con.[90]\n\nUntitled Ant-Man and the Wasp sequel\n\nAhead of the release of Ant-Man and the Wasp, Peyton Reed noted that he and Marvel were \"hopeful\" about a third Ant-Man film, having discussed potential story points.[91] Reed was confirmed to return to direct a third Ant-Man film by November 2019.[92] In April 2020, Jeff Loveness was hired to write the script.[93] It has a possible release date in 2022,[92] with filming expected to begin in January 2021.[94][93]\n\nUntitled Deadpool film\n\nAfter the acquisition of 21st Century Fox by Disney was announced in December 2017, Disney CEO Bob Iger said that Deadpool would be integrated with the MCU under Disney, with Ryan Reynolds expected to reprise his role as Deadpool from the X-Men film series.[95][96] The Once Upon a Deadpool version of Deadpool 2 (2018) was being watched carefully by Disney and Marvel to see whether it might inform how they could approach the character and integrate him into the PG-13 MCU.[97] In October 2019, Deadpool (2016) and Deadpool 2 screenwriters Rhett Reese and Paul Wernick said that they were waiting for approval from Marvel Studios to begin production on the third film. Reese said, \"[Deadpool] will live in the R-rated universe that we've created, and hopefully we'll be allowed to play a little bit in the MCU sandbox as well and incorporate him into that.\"[98] In December 2019, Reynolds confirmed that a third Deadpool film was in development at Marvel Studios.[99]\n\nUntitled Fantastic Four film\n\nIn July 2019, at the San Diego Comic-Con, Feige announced that the Fantastic Four would join the MCU, in an upcoming film centered around the team.[100] Feige said the film would \"[bring] Marvel's first family up to the sort of platform and level they deserve\", after the critical and commercial failure of 20th Century Fox's previous film adaptation.[101]\n\nUntitled mutant-centered film\n\nDuring Marvel Studios' panel at the 2019 San Diego Comic-Con, where the plans for Phase Four were discussed, Feige confirmed that the studio was developing films about mutants (which include X-Men).[4][102] Asked whether these film would not have \"X-Men\" in their titles, Feige acknowledged that the terms \"X-Men\" and \"mutants\" are interchangeable but went on to say that the MCU approach would be quite different from the 20th Century Fox film series.[103]\n\nTimeline\n\nExternal image The Phase One Timeline infographic released by Marvel in May 2012[104]\n\nDuring Phase One of the MCU, Marvel Studios lined up some of their films' stories with references to one another, though they had no long-term plan for the shared universe's timeline at that point.[105] Iron Man 2 is set six months after the events of Iron Man,[106] and around the same time as Thor according to comments made by Nick Fury.[105] The official canon tie-in comic Fury's Big Week confirmed that The Incredible Hulk, Iron Man 2, and Thor all took place within a week, a year before the crossover film The Avengers. Writers Chris Yost and Eric Pearson tried to follow the logic of the films' timeline when plotting the comic, and received \"the seal of approval\" from Feige and Marvel Studios on the final timeline.[107] As promotion for The Avengers, Marvel released an official infographic detailing this timeline in May 2012.[104]\n\nWanting to simplify the in-universe timeline,[105] the Phase Two films were set roughly in real time relating to The Avengers: Iron Man 3 takes place about six months later, during Christmas;[108][109] Thor: The Dark World is set one year later;[110] and Captain America: The Winter Soldier is two years after.[109] Avengers: Age of Ultron and Ant-Man ended the phase in 2015, with several months passing between those films in-universe as in real life.[113] For Phase Three, directors the Russo brothers wanted to continue using real time, and so Captain America: Civil War begins a year after Age of Ultron,[114] with Avengers: Infinity War set two years after that.[115] However, producer Brad Winderbaum said the Phase Three films would actually \"happen on top of each other\" while being less \"interlocked\" as the Phase One films were,[116] with Black Panther and Spider-Man: Homecoming respectively beginning a week and several months after Civil War;[117][118] Thor: Ragnarok beginning four years after The Dark World and two years after Age of Ultron,[119][120] around the same time as Civil War and Homecoming;[116] Doctor Strange taking place over a whole year and ending \"up to date with the rest of the MCU\";[121] Ant-Man and the Wasp also set two years after Civil War and shortly before Infinity War;[122] and both Guardians of the Galaxy and its sequel Vol. 2 being explicitly set in 2014,[123][124] which Feige believed would create a four-year gap between Vol. 2 and Infinity War, though the other MCU films up to that point do not specify years onscreen.[125]\n\nWhen Spider-Man: Homecoming was being developed, director and co-writer Jon Watts was shown a scroll detailing the MCU timeline that was created by co-producer Eric Carroll when he first began working for Marvel Studios. Watts said the scroll included both where the continuity of the films lined-up and did not lineup, and when fully unfurled it extended beyond the length of a long conference table. This scroll was used as the basis to weave the continuity of Homecoming into the previous films, such as The Avengers.[126] This was labeled in the film with a title card stating that eight years pass between the end of The Avengers and the events of Civil War, which was widely criticized as a continuity error that broke the established MCU timeline, in which only four years should have passed.[127][128] Additionally, dialogue in Civil War indicates that eight years pass between the end of Iron Man and the events of that film, despite the established continuity being closer to five or six years.[129][130] Infinity War co-director Joe Russo described the Homecoming eight years time jump as \"very incorrect\",[131] and the mistake was ignored in Infinity War which specified that its events were taking place only six years after The Avengers.[130] The public response to the Homecoming mistake inspired Marvel Studios to release a new timeline for all three phases,[128] and in November 2018, a timeline, specifying dates for the events in each film released to that point, was included as part of the sourcebook Marvel Studios: The First 10 Years, celebrating the 10-year anniversary of the MCU.[132]\n\nMarvel Studios: The First 10 Years timeline from November 2018[132] Year(s) Feature films 1943–1945 Captain America: The First Avenger 2010 Iron Man 2011 Iron Man 2, Thor 2012 The Avengers, Iron Man 3 2013 Thor: The Dark World 2014 Captain America: The Winter Soldier, Guardians of the Galaxy, Guardians of the Galaxy Vol. 2 2015 Avengers: Age of Ultron, Ant-Man 2016 Captain America: Civil War 2016–2017 Doctor Strange 2017 Black Panther, Thor: Ragnarok, Avengers: Infinity War Notes: The Incredible Hulk, Spider-Man: Homecoming, and Ant-Man and the Wasp are discussed in the Marvel Studios: The First 10 Years sourcebook, but their events are not included in the timeline.[132]\n\nThis timeline ignores the two \"eight-year\" continuity errors, but also contradicts the events of Black Panther and Infinity War by placing them in 2017. Despite the latter apparent mistakes, Thomas Bacon of Screen Rant described the timeline as \"the closest Marvel has yet come to making an official statement on just when the different MCU events are set\", bringing \"some sense of balance to the MCU continuity\".[133] Following Infinity War, the Russo brothers said future films would not necessarily be set according to real time as there are \"a lot of very inventive ways of where the story can go from here\", with both Ant-Man and the Wasp and Captain Marvel set earlier in the timeline;[134] the latter is set in 1995.[135] Avengers: Endgame begins shortly after Infinity War and ends in 2023 after a five-year time jump. It confirms dates for several of the other films, including The Avengers in 2012, Thor: The Dark World in 2013, Guardians of the Galaxy in 2014, Doctor Strange around 2017, and Ant-Man and the Wasp in 2018 at the same time as Infinity War.[136] Spider-Man: Far From Home begins eight months after Endgame in 2024.[137] Black Widow is set between Civil War and Infinity War.[138]\n\nRecurring cast and characters\n\nList indicator(s)\n\nThis section shows characters who will appear or have appeared in films in multiple phases within the Marvel Cinematic Universe, and have appeared in the billing block for at least two of them (see FAQ).\n\nA dark grey cell indicates the character was not in the film, or that the character's presence in the film has not yet been announced.\n\nA C indicates an uncredited cameo role.\n\nA V indicates a voice-only role.\n\n^ Iron Man 2, is Peter Parker.[187] In June 2017, Holland, Watts, and Feige stated that the child (played by Max Favreau) whom Tony Stark saves from a drone in, is Peter Parker.\n\nRelease\n\nHome media\n\nIn June 2012, Marvel announced a 10-disc box set titled \"Marvel Cinematic Universe: Phase One – Avengers Assembled\", for release on September 25, 2012. The box set includes all six of the Phase One films—Iron Man, The Incredible Hulk, Iron Man 2, Thor, Captain America: The First Avenger, and Marvel's The Avengers—on Blu-ray and Blu-ray 3D, in a replica of Nick Fury's briefcase from The Avengers.[231] In August 2012, luggage company Rimowa GmbH, who developed the briefcase for The Avengers, filed suit against Marvel Studios and Buena Vista Home Entertainment in U.S. federal court, complaining that \"Marvel did not obtain any license or authorization from Rimowa to make replica copies of the cases for any purpose.\"[232] The set was delayed to early 2013 for the packaging to be redesigned.[233] The box set, with a redesigned case, was released on April 2, 2013. In addition, the box set included a featurette on the then-upcoming Phase Two films, showing footage and concept art, as well as previously unreleased deleted scenes from all of the Phase One films.[234]\n\nIn July 2015, Marvel announced a 13-disc box set titled \"Marvel Cinematic Universe: Phase Two Collection\", for release on December 8, 2015, exclusive to Amazon.com. The box set includes all six of the Phase Two films—Iron Man 3, Thor: The Dark World, Captain America: The Winter Soldier, Guardians of the Galaxy, Avengers: Age of Ultron, and Ant-Man—on Blu-ray, Blu-ray 3D and a digital copy, in a replica of the Orb from Guardians of the Galaxy, plus a bonus disc and exclusive memorabilia. Material on the bonus disc includes all of the Marvel One-Shots with commentary, deleted scenes and pre-production creative features for each of the films, featurettes on the making of the post-credit scenes for the films, and first looks at Captain America: Civil War, Doctor Strange, and Guardians of the Galaxy Vol. 2.[235][236]\n\nIn September 2019, Feige indicated a box set with all 23 films of The Infinity Saga would be released, with the set including previously unreleased deleted scenes and other footage, such as an alternate take of the Nick Fury post-credits scene from Iron Man which references Spider-Man, the Hulk, and the X-Men.[237] The box set, featuring all 23 films on Ultra HD Blu-ray and Blu-ray, a bonus disc, a letter from Feige, and a lithograph art piece by Matt Ferguson, was released on November 15, 2019, exclusively at Best Buy.[238]\n\nIMAX 10th anniversary festival\n\nFrom August 30 to September 6, 2018, in conjunction with Marvel Studios' 10 year anniversary celebrations, all 20 films released at the time (Iron Man through Ant-Man and the Wasp) were screened in IMAX. The films were shown in release order, with four films per day. The final days of the festival were theme related, with one showing \"origin\" films (Iron Man, Spider-Man: Homecoming, Black Panther, and Doctor Strange), one showing \"team-ups\" (Guardians of the Galaxy Vol. 2, Captain America: Civil War, The Avengers, and Avengers: Infinity War),[239][240] and the final day showing Iron Man and The Avengers as chosen by the fans via a Twitter poll.[241] The festival also saw Iron Man, The Incredible Hulk, and Captain America: The First Avenger released in IMAX for the first time.[239][240]\n\nReception\n\nBox office performance\n\nThe Marvel Cinematic Universe is the highest-grossing film franchise of all time worldwide, both unadjusted and adjusted-for-inflation, having grossed over $22.5 billion at the global box office. Several of its sub series such as the Avengers, Iron Man, Captain America, and Thor film series are among the most successful film series of all time.[242]\n\nEach film is linked to the \"Box office\" section of its article.\n\nCritical and public response\n\nEach film is linked to the \"Critical response\" section of its article.\n\nRepurposed projects\n\nThese projects were in development as films from Marvel Studios before becoming television series under Marvel Television:\n\nInhumans : In April 2013, Feige mentioned the Inhumans as a property out of which he was \"confident\" a film would be made. [325] Inhumans as a concept would first be introduced to the MCU in 2014 through the second season of the television series Agents of S.H.I.E.L.D. [326] By August 2014, the studio was ready to move forward in development with the film, with a screenplay written by Joe Robert Cole. [327] In October 2014, the film was announced for Phase Three [328] and scheduled for release July 2019. By October 2015, Cole was no longer involved with the film and any potential drafts that he may have written would not be used. [330] In April 2016, Inhumans was removed from the release schedule, and would no longer be a part of Phase Three. [332] In July 2016, Feige said Inhumans would \"certainly\" be a part of the discussion regarding the film ideas for 2020 and 2021, [333] adding the following November that he was still optimistic the film could be released in Phase Four. [334] In November 2016, Marvel Television announced the series Marvel's Inhumans , which premiered on ABC in September 2017, after the first two episodes were screened in IMAX. [335] The series was not intended to be a reworking of the film. [336] ABC canceled Inhumans after one season in May 2018. [337]\n\n: In April 2013, Feige mentioned the Inhumans as a property out of which he was \"confident\" a film would be made. Inhumans as a concept would first be introduced to the MCU in 2014 through the second season of the television series By August 2014, the studio was ready to move forward in development with the film, with a screenplay written by Joe Robert Cole. In October 2014, the film was announced for Phase Three and scheduled for release July 2019. By October 2015, Cole was no longer involved with the film and any potential drafts that he may have written would not be used. In April 2016, was removed from the release schedule, and would no longer be a part of Phase Three. In July 2016, Feige said would \"certainly\" be a part of the discussion regarding the film ideas for 2020 and 2021, adding the following November that he was still optimistic the film could be released in Phase Four. In November 2016, Marvel Television announced the series , which premiered on ABC in September 2017, after the first two episodes were screened in IMAX. The series was not intended to be a reworking of the film. ABC canceled after one season in May 2018. Runaways: A film based on the Runaways went through a number of iterations. Brian K. Vaughan was originally hired to write a screenplay based on the property in May 2008.[338] In April 2010, Marvel hired Peter Sollett to direct the film,[339] and Drew Pearce was hired to write a script in May.[340] The following October, development on the film was put on hold,[341] with Pearce revealing in September 2013 that the Runaways film had been shelved in favor of The Avengers, with the earliest it could release being Phase Three.[342] In October 2014, after announcing all of Marvel's Phase Three films without Runaways, Feige stated the project was \"still an awesome script that exists in our script vault\", adding, \"We'd love to do something with Runaways some day. In our television and future film discussions, it's always one that we talk about, because we have a solid draft there. But again, we can't make them all.\"[343] In August 2016, Marvel Television announced Marvel's Runaways from the streaming service Hulu,[344] with the series receiving a full season order in May 2017.[345] It premiered in November 2017.[346] Hulu announced in November 2019 that the third season of Runaways would be its last.[347]\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/61/Searchtool.svg/16px-Searchtool.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/5/5f/Marvel_Cinematic_Universe_Infinity_Saga_Artwork.jpeg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5f/Marvel_Cinematic_Universe_Infinity_Saga_Artwork.jpeg/220px-Marvel_Cinematic_Universe_Infinity_Saga_Artwork.jpeg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5f/Marvel_Cinematic_Universe_Infinity_Saga_Artwork.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films", "title": "List of Marvel Cinematic Universe films", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/5f/Marvel_Cinematic_Universe_Infinity_Saga_Artwork.jpeg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}