{"url": "www.lifeandstylemag.com/posts/kim-kardashian-getting-divorce-with-kanye-west-159197", "text": "The tweets kept coming. On April 15, a year after Kanye West deleted his Twitter account, he returned with a vengeance. Over the next days and weeks, his posts grew increasingly bizarre. “The psychological zombie effect,” read one. “I’m super chaaaaaarged. Bout to take this whole thing to mars,” read another. After he called himself the “future president,” bragged about having “dragon energy,” and announced he’d fired his manager because “I can’t be managed,” speculation spread across the Internet that the rapper, who spent eight days in a psych ward in 2016, was having another breakdown. Wife Kim Kardashian was swift to fight back, tweeting that the media is “so quick to label him as having mental health issues for just being himself when he has always been expressive.”\n\nBut Kanye’s problems are more serious than anyone knows, insiders say, and they’ve led to the disintegration of his marriage after nearly four years. “Kim is in talks with lawyers about getting a divorce,” a source exclusively tells Life & Style. “Kanye’s acting more unpredictable than ever. Things have gotten so bad that Kim and Kanye sleep in separate rooms.”\n\nWhen she needs even more time apart from her husband, Kim, 37, flees their home and takes the kids — North, 4, Saint, 2, and 3-month-old Chicago — to stay at mom Kris Jenner’s house. There’s been no escaping his social media meltdown, though. In fact, roughly an hour after he professed his love for President Donald Trump online on April 25, Kanye, 40, admitted in another tweet that “my wife just called me” and told him to clarify that he doesn’t agree with everything Trump does. But Kanye doesn’t listen to Kim most of the time. She called him out on her own Twitter account the same day for posting photos inside their home when they’d agreed not to. Though she later insisted she was joking, “They fight constantly — blow-out fights,” says an insider. “Kanye needs professional help. He’s delusional and paranoid. He thinks he’s a savior. He talks to himself, and he talks to people who aren’t actually in the room because he thinks he’s being watched.”\n\nKim’s endured his behavior before, but now — with two young children and an infant at home — it’s become too much. “Kim is tired of covering for him and putting out fires that he keeps creating,” the insider says. “She can’t take it anymore.”\n\nShe initially didn’t want to give up on the marriage. Instead, she tried to stage an intervention for her husband, the insider says, but Kanye wasn’t having it. “He either got wind of it or just assumed it was coming because he told Kim, ‘Don’t even think about trying to do an intervention on me,’” reveals the insider. “He doesn’t want help — he thinks he’s fine. He says he doesn’t have any mental problems or issues with anything like addiction.”\n\nMaking matters worse, Kanye also announced he’s dropping two new albums in June. “Kim is pissed that he’ll be off traveling the world promoting his music while she’s left at home feeling like a single mom with three small kids,” says the source. “She accuses Kanye of being selfish and has told pals that she’s done with her husband always putting himself first.” Kanye, naturally, sees things differently. Stubborn Kanye “disagrees and blames ‘selfish’ Kim for their issues,” notes the source. “He doesn’t believe Kim is always there for him.”\n\nShe certainly was by his side in November 2016. On Nov. 21, Kanye was hand-cuffed to a gurney and admitted to LA’s UCLA Medical Center following four days of “crying fits, violence, sleep deprivation, and drug use” that were caught on videotape, according to a second insider. Kim, who had just landed in NYC when word of the breakdown reached her, immediately flew home to be by the designer’s side during his ensuing eight-day stay in the hospital. Hot 97 radio host Ebro Darden recently claimed Kanye told him being “addicted to opioids” led to the hospitalization — but that’s not what Kim and Kanye said at the time. Kim actually blamed the trauma of her own robbery at gunpoint in Paris a month earlier for Kanye’s psychological snap. When Kanye later filed suit against insurance company Lloyd’s (to get them to pay the $10.8M and fees he claimed they owed for 23 concerts that were canceled due to what he said was a “debilitating medical condition”), Lloyd’s alleged his breakdown was brought on by drug abuse. An attorney for the company claimed Kanye was seen on video saying he popped two Percocets at a time and “stated words to the effect that ‘this is all about getting off of drugs, bad drugs.’” But Kim said in sworn testimony that her husband only took one Percocet at a time and had a valid prescription. As for the liquid and traditional marijuana the rapper used? His lawyers pointed out that it had been legalized in California. The case was finally dismissed in February 2018 with both parties saying the matter had been “amicably” resolved.\n\nKanye kept a low profile for months after he left UCLA. But now his bizarre behavior has Kim experiencing déjà vu. “She’s afraid for Kanye, herself, and her family. That’s the main reason Kim wants a divorce,” says the insider. “She’s tired of the confrontations. She wants a clean break.”\n\nOne thing she doesn’t have to worry about: protecting her $175 million fortune. “She’s relieved to have a prenup in place,” says the source. Kanye, who announced on Twitter in 2016 that he had $53 million in personal debt, “is known for spending money like water, and his finances have been up and down for years. With him acting up right now, she’s afraid he’ll make irrational decisions and splash out millions on anything and everything. She’s spent years building her brand and is determined to protect her assets no matter what it takes.”\n\nSmart move. “He really has no respect for the dollar,” rapper pal GLC, who grew up with Kanye in Chicago, tells Life & Style. “I remember him spending outrageously. He might have a couple tens of thousands of dollars to his name but when it was time to be on the road and make appearances, he’d spend it on clothes.”\n\nNo one’s as protective of the Kardashian fortune as Kris, 62. But surprisingly, she’s taking her son-in-law’s side, both publicly and privately. On April 24, after reports surfaced that Kanye was hard to deal with and fighting with Kris and Kim, the momager tweeted, “Lies, Lies, Lies” and “Nope…not true!” She’s just trying to cover for Kanye, says the insider. But even behind closed doors, she isn’t throwing him under the bus. “Kris is trying to persuade Kim to work things out with Kanye,” says the source. “She sees them as the ultimate power couple and wants to keep it that way. Despite Kanye’s faults, Kris likes him and thinks he’s a great dad. She’s trying to talk Kim out of filing for divorce.”\n\nIt will be an uphill battle for Kris. “Kim has tried over and over again to work things out with Kanye, and has come to the conclusion that a leopard doesn’t change its spots,” says the source. “She’s finally reached her breaking point,” adds the insider. “There’s no way to work this out.”\n\nLove the Kardashian kids? Join our Kardashian kids Facebook group so you don’t miss any of the cuteness!\n\nFor more on this story, pick up the latest issue of Life & Style — and for more exclusive content sign up for our newsletter!", "images": ["https://www.lifeandstylemag.com/wp-content/uploads/2020/01/Cardi-B-Flaunts-Curves-and-Leaves-Little-to-the-Imagination-in-See-Through-Outfit-featured.jpg?crop=0px%2C0px%2C2000px%2C2000px&resize=90%2C90", "https://www.lifeandstylemag.com/wp-content/uploads/2019/11/True-Thompson-Dream-Kardashian-Cute-Photos-1.jpg?crop=0px%2C125px%2C1080px%2C613px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kim-kardashian-is-filing-for-divorce-from-kanye-west.jpg?resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/10/True-Thompson-Cutest-Photos-Selfie.jpg?crop=199px%2C0px%2C810px%2C810px&resize=90%2C90", "https://www.lifeandstylemag.com/wp-content/uploads/2020/04/True-Thompson-Already-Loves-Picking-Out-Her-Own-Clothes.jpg?crop=71px%2C393px%2C939px%2C531px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2019/09/The-Bachelor-Meet-the-Women_PP.jpg?resize=90%2C90", "https://www.lifeandstylemag.com/wp-content/uploads/2020/01/thenikkibella_84078405_2731228150290245_7074942051047440765_n.jpg?crop=0px%2C68px%2C818px%2C817px&resize=90%2C90", "https://www.lifeandstylemag.com/wp-content/uploads/2019/05/LS2319_cover_ns4_View.jpg?w=300", "https://www.lifeandstylemag.com/wp-content/uploads/2020/01/Khloe-Kardashian-Gives-a-Little-Tour-of-True-Thompson-Sweet-Bedroom-01.jpg?crop=149px%2C47px%2C701px%2C702px&resize=90%2C90", "https://www.lifeandstylemag.com/wp-content/uploads/2019/10/Khloe-Kardashian-Admits-She-Will-‘Never-Come-in-Between’-Tristan-and-Daughter-True-After-Scandal-pp.jpg?crop=0px%2C0px%2C2000px%2C1133px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2020/04/Khloe-Kardashians-Daughter-True-Thompson-Really-Lights-Up-When-Aunt-Kylie-Jenner-Comes-Over.jpg?crop=0px%2C0px%2C1080px%2C612px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2020/04/Millie-Bobby-Brown-Skincare-Routine-Should-You-Try-It-Out-01.jpg?crop=0px%2C0px%2C2000px%2C1133px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kim-kardashian-is-filing-for-divorce-from-kanye-west.jpg?resize=750%2C422", "https://www.lifeandstylemag.com/wp-content/uploads/2019/12/shutterstock_editorial_10491194ae.jpg?crop=0px%2C179px%2C2400px%2C1360px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/royal-kardashian-fashion.jpg?resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/younes-kourt-naked-pics.jpg?resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2019/10/Scott-Kourtney-Coparents.jpg?crop=0px%2C153px%2C1080px%2C612px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/ls-cover-1820.jpg?w=1180&h=1016&crop=1", "https://www.lifeandstylemag.com/wp-content/uploads/2020/04/Scott-Disick-and-Sofia-Richie.jpg?crop=0px%2C62px%2C2280px%2C1294px&resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kylie-stormi-name.jpg?resize=120%2C68", "https://www.lifeandstylemag.com/wp-content/uploads/2020/04/the-fat-jewish-emily-ratajkowski-sebastian-marriage-exclusive-feature.jpg?crop=0px%2C25px%2C2000px%2C1133px&resize=120%2C68"], "top_img": "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kim-kardashian-is-filing-for-divorce-from-kanye-west.jpg?resize=750%2C422", "keywords": [], "authors": ["Life", "Style Magazine"], "canonical_link": "https://www.lifeandstylemag.com/posts/kim-kardashian-getting-divorce-with-kanye-west-159197/", "title": "Kim Kardashian Getting Divorce With Kanye West (EXCLUSIVE)", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "The tweets kept coming. On April 15, a year after Kanye West deleted his Twitter account, he returned with a vengeance. Over the next days and weeks, his posts grew increasingly bizarre. “The psych…", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Kim Kardashian Getting Divorce With Kanye West (EXCLUSIVE)", "description": "The tweets kept coming. On April 15, a year after Kanye West deleted his Twitter account, he returned with a vengeance. Over the next days and weeks, his posts grew increasingly bizarre. “The psych…", "url": "https://www.lifeandstylemag.com/posts/kim-kardashian-getting-divorce-with-kanye-west-159197/", "site_name": "Life & Style", "updated_time": "2018-05-03T21:02:12+00:00", "image": {"identifier": "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kim-kardashian-is-filing-for-divorce-from-kanye-west.jpg?resize=750%2C422", "secure_url": "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kim-kardashian-is-filing-for-divorce-from-kanye-west.jpg?resize=750%2C422", "width": 750, "height": 422}}, "article": {"tag": "Kim Kardashian", "section": "Misc", "published_time": "2018-05-02T12:00:00+00:00", "modified_time": "2018-05-03T21:02:12+00:00"}, "fb": {"app_id": 741277405933843, "admins": 593583017, "pages": 229184533343}, "twitter": {"card": "summary_large_image", "description": "The tweets kept coming. On April 15, a year after Kanye West deleted his Twitter account, he returned with a vengeance. Over the next days and weeks, his posts grew increasingly bizarre. “The psych…", "title": "Kim Kardashian Getting Divorce With Kanye West (EXCLUSIVE)", "image": "https://www.lifeandstylemag.com/wp-content/uploads/2018/05/kim-kardashian-is-filing-for-divorce-from-kanye-west.jpg?resize=750%2C422"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1525262400.0, "source": "http://www.lifeandstylemag.com", "summary": ""}