{"url": "https://www.hollywoodreporter.com/live-feed/black-mirror-season-4-director-jodie-foster-arkangel-episode-1070594", "text": "Season four episode \"ArkAngel\" (now streaming) was directed by Foster, the first woman to step behind the camera for an episode of the Netflix anthology.\n\n[Warning: This story contains spoilers from the Black Mirror season four episode, \"ArkAngel.\"]\n\nThough Black Mirror is an anthology comprised of standalone stories, one of the new season four episodes sticks out from the rest in an unassuming way.\n\n\"ArkAngel,\" directed by Jodie Foster and starring Rosemarie DeWitt, doesn't bring with it the typical futuristic, hyper-technology backdrop that can easily be spotted in the episodes of Charlie Brooker's dystopian series. Instead, there is only one gadget on display in this intimate story of a single mother (DeWitt) who is desperate to keep her child safe: the ArkAngel, an experimental brain chip and corresponding tablet that tracks a child's every movement and gives the parent an option to censor experiences.\n\nThe story (which is streaming now on Netflix with all of season four) follows the child's life, one that is monitored by Marie (DeWitt) even when the product is discontinued. When the daughter blossoms into a teenager (played by Brenna Harding) and discovers her mother's betrayal, she nearly bludgeons her mother to death with the tablet and runs off, leaving DeWitt's character alone to live out her worst fear of abandonment.\n\nThe decision to tell a stripped down story was intentional for Foster, who tells The Hollywood Reporter she was most interested in exploring the nuances of the mother-daughter relationship at the heart of the story. The Academy-award winning actress, who also becomes the first female director of the entire Netflix series with the season four episode, says she was influenced by her own relationship with her mother, a single parent, when bringing creator-writer Brooker's script to life. Her star and friend DeWitt, a mother of two, adds that the end result wouldn't have been the same without Foster's eye or her combined life experience as an actor, daughter and mother.\n\n\"This story is much more an exploration of the human psyche and of our own fragile, messed up psychologies that are just highlighted by the reflection of technology and how we use it — and how responsible or irresponsible we are regarding it,\" Foster tells THR. In a chat below, both Foster and DeWitt peel back the layers of their episode to relive that difficult scene, share their interpretations of the gut-wrenching ending and discuss why more female stories aren't being told: \"I’ve made, I don’t know, 55 movies,\" says Foster, \"and I’ve only worked with a female director once in my whole life.\"\n\nWere you each fans of Black Mirror and how did your roles with \"ArkAngel\" come about?\n\nJodie Foster: I had never seen Black Mirror before. I was having lunch with [vp original content at Netflix] Cindy Holland bemoaning the film industry and saying how I really wanted to figure out how to do features on cable. I really think that some stories should be an hour and a half; they shouldn’t be eight episodes long. She said, “I think I’ve got something for you.” Then I watched all the Black Mirrors, they sent me the script and that was it.\n\nRosemarie DeWitt: I hadn’t seen Black Mirror either. When Jodie offered me the role, I watched a bunch and then I started feeling really anxious because they were so good that I stopped watching them. I was like, “OK, we just need to go make ours!”\n\nAfter bingeing so many episodes in a row, did the show influence your thoughts on technology?\n\nFoster: It didn’t give me the fear of technology so much because we really live with it. This story kind of feels like now. Or that we’re on the path to it.\n\nA lot of the Black Mirror episodes deal with far-fetched techno-paranoia ideas, but the concept of tracking your child — Marie's (DeWitt) intent when signing her daughter up for a trial with the ArkAngel — is already happening today. Not to mention helicopter parenting. How did that make this story more relatable?\n\nDeWitt: The humanizing aspect of this story is something that I definitely felt was on the page when I read the script, and then I really fought hard to bring her psychology through in filming. There are so few moments — since this episode is so tightly crafted and it spans such a long time — that I felt like Jodie was really meticulous in finding the moments that showed that this woman, my character, had a lot of baggage. She had experienced some loss and bad experiences, and there was not only this need to protect her daughter but an overall need of her daughter that was sort of self-serving, too, and that was going to put her in great danger of misusing this tool. It wasn’t just an every woman. Even though I think that every parent can relate to it, there is a specificity to this story.\n\nFoster: I really love the tapestry. That really tightly woven, incredibly intricate Ingmar Bergman tapestry of the relationship between mothers and daughters. And the natural progression of that. I had a really connected, very difficult relationship with my mom. She was in every part of my life, including my work, and it was a beautiful relationship — the most significant relationship I’ll ever have — and also, really painful. Individuating from her was one of the hardest things that I’ve ever done.\n\nIn what ways were you able to you pull from your own personal experience?\n\nFoster: I think I understood both sides of the coin. You always do that in films. You’re always looking at every character and saying, “Oh, I understand that because of this.” You relate it to your own experiences. What is interesting about the episode is that you start off thinking it’s the mother’s story and that it’s her perspective, and then as time goes on, you realize it flips to the daughter Sara’s perspective. Then it kind of flips back again. And that's because they are the same person. She came out of her body. You witness the child coming out of her body in the first few seconds. There’s no clean distinction between a mother and a daughter and that distinction has to be made by the daughter in an individuation moment.\n\nAt the end, when Sara (Harding) nearly kills her mother, she was still being censored by the ArkAngel. Ultimately she realizes what she's done, but she still leaves her alone in the house, in a pool of her own blood. Did you debate having her actually kill her mother?\n\nFoster: I thought Charlie [Brooker] nailed it with what you saw. I don’t think we ever felt like we needed to take it to that place where we say, “And the moral of the story is: And she died.” There was a next lesson for this fable.\n\nDeWitt: She needed to experience the loss of her daughter, which is the thing she has been trying to safeguard against her whole life. It’s really her worst fear coming true.\n\nWhat was that scene like to film?\n\nDeWitt: That was a hard scene to shoot. Not only because it was so precise — the writing of Black Mirror is so precise, the way Jodie directed this episode was so precise and the stunt work was also so precise — where exactly everything had to hit you and snap your neck back. Weirdly, sometimes the bigger, more emotional things for the audience are the more technical things for us.\n\nFoster: I’ve had a lot of experience with that making movies. Whether it’s a movie like Contact or others where you’re doing these really emotional things and they also happen to be in the most persnickety moments of the film. Where it’s 120 takes later and you’re acting to a green screen and it’s a challenge. The challenge of a film like this is that it feels like an indie movie but in fact, it still is very orchestrated.\n\nDeWitt: And I will say, I was very lucky as a performer because Jodie had done that as an actor and she had thought about that going in. We didn’t have the budget for 100 takes of anything, but Jodie would almost walk through it and know where the pitfalls were before we even got to it. Otherwise, we actually wouldn’t have been able to do it.\n\nFoster: The greatest joy I have as a director is watching actors give so much. I always try to prepare as much as possible so that when they get there, I’m ready! I’m ready to capture and it all goes very fast.\n\nHow long did you have to film that scene?\n\nFoster: I don’t even think we got a full day for that. It was a half day.\n\nWhen did you film the episode and how long was the shoot?\n\n\n\nDeWitt: We were shooting in November, including during Election Day.\n\nFoster: I think we filmed for three weeks, about 18 days. We filmed it in Toronto.\n\nWhat was set like on Election Day?\n\nFoster: We were all filling out our Canada defection forms. (Laughs.) The next day was the second day of shooting and we actually shot the end scene where Marie runs out of the house all bloody.\n\nDeWitt: For the scene, I kept having to hit my phone saying, “No! No! No!” once Sara leaves, and that’s what I had done while laying in bed as the results were coming in. So there was no acting there.\n\nWas that therapeutic?\n\nDeWitt: I would say it informed the scene. If anything, Jodie used the restrained version. I think I was doing some Sylvester Stallone “Adrian!” or Marlon Brando “Stella!”-type screaming in the versions that didn't make the final cut (laughs).\n\nThe overall palette of the episode — how dreary and drab things were, especially the clothes — stood out. Usually, Black Mirror episodes are modern, but here not much technology was even used aside from the ArkAngel. What kind of world were you trying to create?\n\nFoster: That was a choice that I wanted to make. I said, “What is America in the immediate future? Where is America going to be five years from now, or less?” I felt that some of what informed this mom’s life is that she was from this hard-scrabbled American town that had died. It was a town where there’s no opportunity. Everything had been closed, the infrastructure hadn’t been fixed. Nobody cared about them. She had a tough, working-class life, like in a Detroit suburb or Pittsburgh or something, and this beautiful, little, perfect kid is this light. That informed how she lived vicariously through her and why she wanted to keep her safe. Her world had been disappointing and she had been a disappointment. I love how [Charlie Brooker and executive producer Annabel Jones] support the artist because they did ask me those questions. They definitely were aware that these were choices we were making to reflect America, that this is America and not a clean, modern version of the future in England, for example.\n\nYou’ve directed episodes of Netflix's Orange Is the New Black and House of Cards, but this episode makes you the first female director of Black Mirror, which now has a total 19 episodes.\n\nFoster: Is that right? It’s funny. That seems like a big deal, but it’s not really unusual because there aren’t that many female directors. It’s changing now, and especially in television it’s changed quite a bit in the last few years. But I’ve made, I don’t know, 55 movies and I’ve only worked with a female director once in my whole life.\n\nAs an actor, how appealing was it to have a female director, especially for this story?\n\nDeWitt: Working with Jodie as a talented director was super enticing to me and just hearing you two now talking about it, if it had been a male director, I don’t think I would have been able to lean into it as much. So much of our journey through this was identifying the ways we related to the story as mothers, which way we related to the story as daughters and thinking of our personal mothers. There’s not a lot of dialogue, so we had to rely a lot on, “You know that feeling when…” and “You know that moment when…”. It would have been a different conversation with a male director. I wanted to be directed by Jodie Foster in particular, but in terms of this story, I’m so glad it was a woman. And a single mom is a different dynamic, in terms of the placeholder; who they are to each other and what they stand in for is sometimes not just mother and child.\n\nAfter Marie emerges alive and bloody from the fight, viewers see Sara hitchhiking out of town and the screen turns to black. How do you each envision their lives going from here? Where do you imagine them years from now?\n\nFoster: I think the question mark is really wonderful. You witness the last part of this fable; that the mother had this fear that she had from before the movie started, this fear of being abandoned by her child. Of not being able to find her. It was an irrational, crazy paranoid fear and you could recognize there was something not quite right about it. And yet, she created this final moment. She made it happen. She created it out of a desperation that forced her daughter to abandon her and into the arms of potentially exactly what she feared, which is not safety. That shutting of the door where the truck slams and it goes to black is the big question mark: Is Sara going to be in a ditch? Will she be raped by the side of the road? Will she be safe? Those are the questions that we have as parents.\n\nDeWitt: Also, now I’ve lost her. She is lost to the mother, it seems like, forever.\n\nFoster: Whether that is metaphorically or physically so, she is lost. They will never have that relationship again. That relationship is over, as it should be. We have now witnessed birth to individuation; that is a cycle of life and that’s why it ends on that hard black.\n\nGiven the current climate and the spotlight on how women in Hollywood have been treated, are you two more selective with who you work with at this point in your careers?\n\nFoster: I aspire to be able to appreciate and review a director based on their accomplishments and based on who they are and what they bring to the material, regardless of their gender. That’s what we’re all hoping for. My favorite feminist director was Jonathan Demme [Silence of the Lambs, Rachel Getting Married].\n\nDeWitt: Mine too.\n\nFoster: I’ve worked with a lot of amazing gentlemen in this business, and they were my dads. They took me into their wing and believed in me. They gave me opportunities and chances and I learned from them. That’s a part of my legacy. That’s a part of how I was raised in this business, by these wonderful men who educated me. They are a part of my story. Times have changed. The one area in the filmmaking business that hasn’t changed very much is for women, but I think that is changing now. It’s especially changing on streaming and cable. Now that viewing habits have changed and people don’t go to the movies so often anymore.\n\nDeWitt: It is changing. Like always, there is a lot more work to be done. And it does feel like stories about women tend to happen during times like these — we’re on a spiral in a linear sense and whether it be an Olive Kitteridge or an episode of Black Mirror, sometimes it takes different times to tell all different kinds of stories. But I’m so grateful when they’re 3D and complex and when we’re swimming in the deep water, which I feel like we got to do on this one.\n\nThe fourth season of Black Mirror is streaming now on Netflix. Keep up with THR's show coverage here.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/12/bywcqq0k.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/2017/12/black_mirror_still_and_jodie_foster_-_inset_-_getty_-_h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/12/black_mirror_still_and_jodie_foster_-_inset_-_getty_-_h_2017.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/12/black_mirror_still_and_jodie_foster_-_inset_-_getty_-_h_2017.jpg", "keywords": [], "authors": ["Jackie Strause", "Jackie.Strause Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/black-mirror-season-4-director-jodie-foster-arkangel-episode-1070594", "title": "'Black Mirror': How Jodie Foster and Rosemarie DeWitt Made Their Story Personal", "meta_data": {"viewport": "width=device-width", "description": "'Black Mirror' season four episode \"ArkAngel\" stars Rosemarie DeWitt and was directed by Jodie Foster, the first woman to direct on the Netflix anthology.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/black-mirror-season-4-director-jodie-foster-arkangel-episode-1070594", "domain": "https://www.hollywoodreporter.com/", "title": "'Black Mirror': How Jodie Foster and Rosemarie DeWitt Made Their Story Personal", "description": "Season four episode \"ArkAngel\" (now streaming) was directed by Foster, the first woman to step behind the camera for an episode of the Netflix anthology.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/12/black_mirror_still_and_jodie_foster_-_inset_-_getty_-_h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Black Mirror': How Jodie Foster and Rosemarie DeWitt Made Their Story Personal", "description": "Season four episode \"ArkAngel\" (now streaming) was directed by Foster, the first woman to step behind the camera for an episode of the Netflix anthology.", "url": "https://www.hollywoodreporter.com/live-feed/black-mirror-season-4-director-jodie-foster-arkangel-episode-1070594", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/12/black_mirror_still_and_jodie_foster_-_inset_-_getty_-_h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Black Mirror': How Jodie Foster and Rosemarie DeWitt Made Their Story Personal", "sailthru.description": "Season four episode \"ArkAngel\" (now streaming) was directed by Foster, the first woman to step behind the camera for an episode of the Netflix anthology.", "sailthru.author": "Jackie Strause", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-12-29 14:00:00", "sailthru.tags": "Live Feed, Television, Jodie Foster, Rosemarie DeWitt, Black Mirror"}, "movies": [], "publish_date": 1514527200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}