{"url": "www.newidea.com.au/brad-pitt-and-jennifer-aniston-marry-on-their-18th-anniversary", "text": "Getty\n\n'Some people close to them believe Jen is pregnant,' an insider told In Touch.\n\nThis news comes as no surprise to fans, who recently spotted Jen cradling what appeared to be a growing baby bump in Montreal earlier this month.\n\n'From what I've heard, even though she's 49, it just happened naturally - no IVF or anything,' the source says.\n\n'They're ecstatic!'\n\nRelated: Shocking pictures: Jennifer Aniston cradles baby bump\n\nRelated: CONFIRMED - Brad and Jen: 'They're back on!'\n\nGetty\n\nA source adds, 'Brad and Jen were so eager to wed again, they just had a private unofficial ceremony in the backyard of his house in the Pacific Palisades.'\n\n'The home overlooks the coastline and isn't far from the beach - it's breathtaking. It was the perfect setting.'\n\nIn Touch reports the former couple recommitted to each other on a sunny, blue-sky afternoon ahead of their original wedding anniversary on July 29.\n\nBrad's parents, his six children, and a few famous friends were also in attendance, the publication claims.\n\nAmong the famous faces were Jen and Brad's close friends, George and Amal Clooney and Courtney Cox, who acted in the bridal party.\n\n'There wasn's a lot of formality,' says the source. 'Just a beaming Brad and Jen pledging their love to each other.'\n\nRelated: Brad Pitt and Jennifer Aniston announce: 'We're in love again!'\n\nNo one is happier than Brad's parents, Bill and Jane, In Touch's report adds.\n\n'Jane truly considers it a blessed event,' the insider spills. 'She's always had a special kinship with Jen and was instrumental in her getting back together with Brad.'\n\nAn insider has previously stated that ever since Jen and Justin's split earlier this year, Jane has been begging her son to marry Jen.\n\n'Jane always preferred Jen to Angelina,' the Pitt insider claimed.\n\nIn the last 18 months, Brad's devoted himself to a sober lifestyle and started therapy, which insiders say has paved the way for his renewed relationship with Jen.\n\n'Brad and Jen are more open with each other now than they ever were in their marriage. They are older, wiser and different people in different places of their lives now,' says an insider.\n\n'They both know they got it wrong the first time around.'\n\nJen is finally getting the happy ever after she's longed for.\n\n'She's in it for the long haul with Brad,' a friend tells In Touch. 'Brad loves how they've both come full circle and found each other again. They were destined to be together.'\n\nNeither Brad or Jen have responded to In Touch's report.\n\nRelated: Brad Pitt and Jennifer Aniston reunite with a wedding and a baby\n\nRelated: Brad and Jen's wedding minister comes forward\n\nListen below to our new podcast WHO ARE YOU with Pete Timbs - this week he talks to Roxy Jacenko. You can subscribe via iTunes http://po.st/RxVC07 or OMNY http://po.st/sBS7Vd", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg", "http://www.newidea.com.au/media/30394/jen-and-brad.jpg"], "top_img": "http://www.newidea.com.au/media/30394/jen-and-brad.jpg", "keywords": [], "authors": ["Georgia Mars", "Georgia Mars Is A Digital Content Editor At New Idea Magazine. As A Self-Professed Celeb Expert", "Georgia Claims To Know Everything About Everyone", "When She'S Not Digging Deep For The Next Big Celebrity Scoop", "You Can Find Georgia Catching Up On The Latest Reality Tv."], "canonical_link": "https://www.newidea.com.au/brad-pitt-and-jennifer-aniston-marry-on-their-18th-anniversary", "title": "Brad and Jen ‘just married’ on their 18th anniversary", "meta_data": {"language": "en-us", "description": "Brad Pitt and Jennifer Aniston have recommitted to each other, 18-years after they first got married, In Touch reports.", "news_keywords": "Brad Pitt, Jennifer Aniston, Brad Pitt and Jennifer Aniston, Brad Pitt wedding, Jennifer Aniston wedding, Brad and Jen are back together, brad, jen, angelina jolie, Jen and Brad, Brad and Jen back together, Jen and Brad back together, celebrity wedding, celeb weddings, Jennifer Aniston wedding ring, Jennifer Aniston marries Brad Pitt second time, Brad and Jen wedding, Brad and Jen marry on their 18th anniversary, brad pitt third wedding, jen aniston third wedding, jen and brad recomitt, george clooney, amal clooney, celeb news, celebrity news, latest celeb news, latest celebrity news, celeb goss, celebrity goss, latest celeb goss, latest celebrity gossip, celeb", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/brad-pitt-and-jennifer-aniston-marry-on-their-18th-anniversary", "title": "Brad and Jen ‘just married’ on their 18th anniversary", "description": "Brad Pitt and Jennifer Aniston have recommitted to each other, 18-years after they first got married, In Touch reports.", "image": {"identifier": "http://www.newidea.com.au/media/30394/jen-and-brad.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Brad Pitt and Jennifer Aniston marry on their 18th anniversary", "description": "Brad Pitt and Jennifer Aniston have recommitted to each other, 18-years after they first got married, In Touch reports.", "image": "http://www.newidea.com.au/media/30394/jen-and-brad.jpg", "url": "https://www.newidea.com.au/brad-pitt-and-jennifer-aniston-marry-on-their-18th-anniversary"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1531961779.208, "source": "http://www.newidea.com.au", "summary": ""}