{"url": "https://people.com/tv/jersey-shore-ronnie-not-in-love-sammi-sweetheart/", "text": "Sammi “Sweetheart” Giancola may not be part of the Jersey Shore reboot, but that hasn’t stopped her from making headlines.\n\nOver the course of this season, the focus has often turned to Giancola’s absence — after all, Pauly “DJ Pauly D” DelVecchio brought along a custom, life-size doll designed to look and talk just like her. (“Rahhhhhnnnn! Staaaaahhhhp!”)\n\nGet push notifications with news, features and more.\n\nThere’s also been plenty of speculation amongst the cast that Giancola’s ex Ronnie Ortiz-Magro isn’t over the relationship. Their tumultuous on-again, off-again romance lasted seven years, three of which were captured on the original run of Jersey Shore from 2009-12. Giancola, 31, has said she opted out of the MTV reboot to focus on her businesses and her relationship — and avoid “potentially toxic situations,” presumably referring to Ortiz-Magro, 32.\n\nDuring a heart-to-heart on last week’s episode, Nicole “Snooki” Polizzi, 30, came to the conclusion that Ortiz-Magro was still harboring feelings for his ex.\n\n“You f—ing love Sam,” she told him. “Listen, you need to stop. Babe, get over Sam. It’s been f—ing 10 years. Why are we still talking about this?”\n\n“I think I just miss the feeling of like, security,” he replied. “Because that’s what she gave. And that’s so f—ing hard to find. And I feel like that’s why I am the way I am and will continue to be the way I am. … Every man wishes that he can be with the love of his life. Like, being with someone for seven years and then you don’t end up with that person? Yeah, it hurts.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nBut a source tells PEOPLE that despite the way Ortiz-Magro’s storyline has unfolded, he has indeed moved on.\n\n“He’s not in love with Sam anymore,” the source says. “It was a fun topic for the season. I mean, did you not laugh at the Sam doll? Editing just got him every time he spoke about her.”\n\nImage zoom Ronnie Ortiz-Magro and Sammi “Sweetheart” Giancola in 2013 Chris Roque/Getty\n\nAnd Giancola aside, Ortiz-Magro has his own relationship drama to deal with. This week, he split from Jen Harley, his girlfriend of over a year — less than a month after the two welcomed their first child together April 3, daughter Ariana Sky.\n\nThe relationship fell apart after a bitter feud erupted between the two on social media, with Ortiz-Magro alleging in a series of posts that his girlfriend was keeping “sex videos” with an ex.\n\n“Note to self, can’t turn a natural born HOE, into a HOUSEWIFE, if you find them in the gutter then leave them in the gutter,” he wrote. “Not all people can be saved when they are so far gone. All you can say you did [your] best and keep it moving.”\n\nHarley, who is also mom to son Mason from a previous relationship, shot back in her own Instagram story, writing, “Can’t turn a coke head into a father!”\n\nRELATED: Ronnie Ortiz-Magro Apologizes After Public Feud with Girlfriend — ‘I Acted on My Gut’\n\nOn Monday, the tension escalated when Harley went live on Instagram in the middle of an altercation between the two. But according to a source, the incident was “blown out of proportion.”\n\n“They had a verbal dispute, it happens in relationships,” the source said. “He found a video that he didn’t want to see and got upset about it.”\n\n“He’s getting labeled as this bad guy when he really isn’t,” the insider added. “He’s stressed and doesn’t want people to look at him in a bad light.”\n\nRELATED: Ronnie Ortiz-Magro’s Ex Posts First Photo of Daughter After Former Couple Feuds on Social Media\n\nImage zoom Jen Harley and Ronnie Magro Jen Harley/Instagram\n\nThe new father has since apologized for what went down.\n\n“I want to apologize to my family, friends and fans,” he said in a statement Monday evening. “This is a private matter that should have never been made public. I remain focused on my daughter and she is my number one priority.”\n\nIndeed, according to the source, Ortiz-Magro and Harley “are speaking civilly and trying to make sure Ariana has the best life possible.” (The estranged couple will “work out the visitation stuff once the dust settles.”)\n\nAs for whether there’s hope for a reconciliation? That remains to be seen, but the source said Ortiz-Magro “just wants to do his best for the baby.”\n\n“That’s where his heart is at,” the source said.\n\nJersey Shore Family Vacation airs Thursdays (8 p.m. ET) on MTV.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fronie-magro-jen-harley.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/jersey-shore-ronnie-not-in-love-sammi-sweetheart/", "title": "Jersey Shore's Ronnie Is 'Not in Love' with Ex Sammi: Source", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,Jersey Shore,News,Ronnie Ortiz-Magro,Sammi Giancola,TV", "news_keywords": "Exclusive,Jersey Shore,News,Ronnie Ortiz-Magro,Sammi Giancola,TV", "description": "Giancola has said she opted out of the MTV reboot to focus on her businesses and her new boyfriend", "og": {"title": "Jersey Shore's Ronnie Is 'Not in Love' with Ex Sammi, Source Says: 'Editing Got Him'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/jersey-shore-ronnie-not-in-love-sammi-sweetheart/", "description": "Sammi “Sweetheart” Giancola may not be part of the&nbsp;Jersey Shore reboot, but that hasn’t stopped her from making headlines. Over the course of this season,&nbsp;the&nbsp;focus&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/jersey-shore-ronnie-not-in-love-sammi-sweetheart/", "description": "Giancola has said she opted out of the MTV reboot to focus on her businesses and her new boyfriend", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/jersey-shore-ronnie-not-in-love-sammi-sweetheart/", "title": "Jersey Shore's Ronnie Is 'Not in Love' with Ex Sammi, Source Says: 'Editing Got Him'", "description": "Giancola has said she opted out of the MTV reboot to focus on her businesses and her new boyfriend", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}