{"url": "https://www.thewrap.com/allison-williams-talks-about-how-girls-changed-her-as-an-actress/", "text": "If you’re looking for some hints as to what tomorrow’s “Girls” finale has in store, Allison Williams is not the person to ask. In an interview with TheWrap, the actress known to “Girls” fans everywhere as Marnie Michaels is going to watch it for the first time on Sunday night with show creator and co-star Lena Dunham.\n\n“I could have seen it,” Williams said. “They sent it to me, but I just decided I wanted to see it in real time.”\n\nWhat we do know is that the final episode of “Girls” won’t see Hannah, Shoshanna, Marnie and Jessa giving viewers catharsis by seeing them all together as the screen fades to black. Last week’s episode saw the four come to an uneasy reconciliation with each other in the bathroom of Shosh’s apartment, but with all of them coming to accept that they are all better off without each other. Before the four go their separate ways tomorrow night, Williams told us about how the series has changed her as an actress and how she thinks Marnie has changed as a person.\n\nAlso Read: 'Girls': 10 Times Hannah Showed Up Wearing the Wrong Thing (Photos)\n\nHow did you feel about the decision to have the girls go their separate ways and not see each other in the finale?\n\nI didn’t really know what to make of it from a creator’s point of view because I always try to keep my nose out of what they are doing and I just trust what they’re doing. But from a selfish point of view, I was sad we weren’t all going to be in the same place when the show wrapped because it’s such an emotional moment and it felt strange to know that we were saying goodbye to people who are very close to us before we said goodbye to the show en masse. But I guess it made it more emotionally manageable because the fact that everyone wasn’t done at the same moment meant that everything was more slow and gradual and less of a shock when it was finally over.\n\nMarnie seems to have moments of self-reflection and then backtrack, do you think the scene in the pawn shop this season had a lasting effect in changing how she sees herself?\n\nI love that scene for a million reasons, but especially because Marnie’s ability to view herself has always been hindered by her own point of view on the person she’s talking to. It’s hard for her to take constructive criticism from Hannah, Jessa and Shosh because they’re all peers, so the idea of taking a big lesson from them always felt silly for Marnie. But whenever she faces these cold truths, it comes from unexpected sources.\n\nIn this case, she thinks she’s wearing something she thought this man in a pawn shop had never seen before. She’s like ‘I’m not your average pawn shopper, this is an anomalous situation for me.’ And he tells her, ‘Hey, nobody comes in here when everything’s great. You aren’t an exception to every rule.’ And whenever somebody says that to Marnie, it’s very tough for her to hear, but it’s important. It’s also easier to hear when it’s not coming from someone you watched throw up at a college party. But the phone call she makes to Desi afterwards shows that the talk had an impact on her that other talks don’t always land. Because it came from this stranger and because it came at a very vulnerable moment for her, it does end up altering things for her. It sets the stage for someone who is starting to learn how to operate in the world given how she is.\n\nAlso Read: 'Black Panther' Cast Does #GetOutChallenge, Scare the Crap Out of Daniel Kaluuya (Video)\n\nThis is a show where the characters hurt each other a lot. Who’s the one person Marnie owes an apology to and who really owes Marnie an apology?\n\nWell…I sort of think they all owe each other apologies. I think she and everyone she’s ever dated need to apologize to each other. I don’t really know who is at fault, but I do know there’s a lot of hurt there. When those relationships are taking form, there’s a lot of growing pains and people thrash around and accidentally hurt each other a lot.\n\nMarnie’s no exception to that. Charlie really hurt her. Desi really hurt her by destroying what she thought she wanted and was always going to have and really sending her out into the world in confusion and disarray. But I also don’t know if it should be a full-throated apology because people who have sent her adrift have also triggered some kind of real growth and introspection on her part. I think that tallying of hurt and who is at fault is something that done so much more at the beginning of the show, and at a certain point, there comes a time when they all just call it even.\n\nThat’s true especially in this group of friends. If they were to go back and tally how many times they’ve been hurt or they’ve hurt people and start making amends, I think it would quickly become a pretzel and everyone out of exhaustion would agree to make a blanket apology and move on.\n\nWay back in the first season, “Girls” was criticized in some corners for not being diverse enough. Did your time on “Girls” increase your interest in telling stories about social issues or in taking roles in projects like “Get Out”?\n\nI don’t think “Girls” and “Get Out” had anything directly to do with each other. I would have played Rose at any time in my career. It was the sort of role I have always kept an eye out for creatively. I do think “Girls” gave me a sort of critical eye towards the projects that I take on because I knew what it looked like to be a part of something that was created carefully. I wanted to be a part of projects that made deliberate choices and took risks. Safety wasn’t something I was interested in anymore and that negated a lot of the roles that were coming my way.\n\nBut as for the criticism of the show, I think being on “Girls” has taught me to look for roles that were written from a position of intimate knowledge of what they were writing about rather than about a life they didn’t know, which is why Lena didn’t want to try and screw up writing somebody else’s intimate truth. Because of the nature and tone of “Girls,” that would be a big whiff. So now I know to look for shows that take that same approach.\n\nAlso Read: How Dave Porter Merges the Music of 'Better Call Saul' and 'Breaking Bad' (Audio)\n\nI also think “Girls” taught me to have the confidence to be patient and wait for the right thing to come along so that when I got the script for “Get Out” and then talked to Jordan [Peele], I knew what I had in front of me and I knew that it was worth any risk involved. “Girls” has given me so many things, but the biggest has been that quiet confidence to make decisions in an industry that pushes you to make quick decisions because of the artificial urgency about people making up their minds.\n\nIf, ten years from now, there was a reunion movie or miniseries for “Girls,” would you be down for it? And what do you think Marnie’s life would look like a decade from now?\n\nOh, of course I would be down for a reunion. I already miss working with these people so I would love to reunite. As for Marnie, I think the only way she can have lasting happiness is if she ends up in a relationship with Elijah or somebody like Elijah, where it’s a very modern romance situation where they both get to do what they want to do outside the marriage. But they have a total support system for each other and get to live life with a partner without having to deal with the messiness of intimacy and love that I think is an Achilles’ heel for both Marnie and Elijah. But we’ll see. If a reunion happens I’m sure that — as has always been the case — Lena and Jenni [Konner] and Judd [Apatow] will come up with something that is both completely unexpected and something that I never could have thought of.\n\nThe series finale of “Girls” airs Sunday, April 16 at 10 p.m. on HBO.\n\nThis interview has been edited for clarity.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/uploads/2017/04/soshannagallery-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/laura-bush-michelle-obama-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2020/04/white-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/04/bill-cosby-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2017/03/GettyImages-52741361-160x105.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/Dwayne-Johnson-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/uploads/2017/04/hannahgallery.jpg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2017/04/Girls-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls.jpg", "keywords": [], "authors": ["Jeremy Fuster", "Ashley Boucher", "Linda Ge", "Matt Donnelly", "Daniel Goldblatt", "Rosemary Rossi", "Trey Williams"], "canonical_link": "https://www.thewrap.com/allison-williams-talks-about-how-girls-changed-her-as-an-actress/", "title": "Allison Williams on Saying Goodbye to ‘Girls,’ How it Gave Her ‘Confidence To Be Patient’", "meta_data": {"parsely-title": "Allison Williams on Saying Goodbye to ‘Girls,’ How it Gave Her ‘Confidence To Be Patient’", "parsely-link": "https://www.thewrap.com/allison-williams-talks-about-how-girls-changed-her-as-an-actress/", "parsely-type": "post", "parsely-pub-date": "2017-04-15T15:33:36-07:00", "parsely-section": "tv", "parsely-author": "Jeremy Fuster", "parsely-tags": "allison_williams, get-out, girls, hbo, lena_dunham", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "\"Girls\" star Allison Williams is going to watch its series finale for the first time on Sunday night with show creator and co-star Lena Dunham.", "news_keywords": "allison williams, get out, girls, hbo., lena dunham", "original-source": "https://www.thewrap.com/allison-williams-talks-about-how-girls-changed-her-as-an-actress/", "og": {"locale": "en_US", "type": "article", "title": "Allison Williams on Saying Goodbye to 'Girls,' How it Gave Her 'Confidence To Be Patient'", "description": "\"Girls\" star Allison Williams is going to watch its series finale for the first time on Sunday night with show creator and co-star Lena Dunham.", "url": "https://www.thewrap.com/allison-williams-talks-about-how-girls-changed-her-as-an-actress/", "site_name": "TheWrap", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "Lena Dunham", "section": "TV", "published_time": "2017-04-15T22:33:36-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "\"Girls\" star Allison Williams is going to watch its series finale for the first time on Sunday night with show creator and co-star Lena Dunham.", "title": "Allison Williams on Saying Goodbye to 'Girls,' How it Gave Her 'Confidence To Be Patient'", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls.jpg", "creator": "@thewrap"}, "generator": "WooFramework 6.2.0", "sailthru.title": "Allison Williams on Saying Goodbye to ‘Girls,’ How it Gave Her ‘Confidence To Be Patient’", "sailthru.date": "2017-04-15T22:33:36+00:00", "sailthru.author": "Jeremy Fuster", "sailthru.tags": "lena dunham,hbo.,girls,allison williams,get out", "sailthru.category": "tv", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2017/03/MarnieGirls-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1492320816.0, "source": "https://www.thewrap.com", "summary": ""}