{"url": "www.mercurynews.com/2017/09/28/kim-kardashian-says-caitlyn-jenner-lied-about-her-fathers-reasons-for-defending-o-j-simpson/", "text": "Forget the Kardashian storm brewing around reports that different sisters are expecting babies in various ways. Another intriguing Kardashian storm brewing has to do with the reasons that the reality TV family is estranged from one-time parent Caitlyn Jenner Related Articles Caitlyn Jenner: Robert Kardashian defended O.J. Simpson because he was jealous of me\n\nKardashians call Caitlyn Jenner ‘transgender traitor’ for sticking with Trump after military ban\n\nCaitlyn Jenner to Trump during SF visit: Don’t mess with my LGBT community\n\nAnd the reasons have nothing to do with Caitlyn coming out as a transgender woman in 2015.\n\nKim Kardashian, along with her sisters Kourtney and Khloe, are fed up with “shady” claims Caitlyn made in her memoir about their father Robert Kardashian and his friendship with O.J. Simpson, according to Entertainment Tonight.\n\nAs Kim explains in the upcoming premiere of Season 14 of “Keeping Up With the Kardashians,” she’s upset that Caitlyn wrote that their attorney father knew O.J. Simpson was guilty of double murder but defended him anyway to get back at their mother Kris Jenner.\n\nIn her memoir “Secrets of My Life,” Caitlyn said Robert was jealous that Kris had moved on so quickly after their divorce by marrying the Olympic gold medalist then known as Bruce Jenner.\n\nAccording to Caitlyn’s book, Robert knew it would upset Kris for him to join the defense team for Simpson in his trial on charges of murdering his ex-wife Nicole Brown Simpson and her friend Ronald Goldman. That’s because Kris had been close friends with Nicole and knew that O.J. had been violent towards her.\n\nIn a clip for Sunday night’s “KUWTK,” Kim reads to Kourtney and Khloe excerpts from Caitlyn’s memoir. Get more celebrity news and photos delivered to your inbox for free on weekdays. Sign up for our Coffee Break newsletter here.\n\n“It says in Caitlyn’s book, ‘Robert Kardashian knew O.J. Simpson was guilty, but joined the defense team to get back at his remarried ex,'” Kim Kardashian reads. “‘Robert told Caitlyn in secret after the O.J. murder trial that he believed his friend was guilty.'”\n\nKhloe cuts in: “That’s not true! Like, what?”\n\n“Like, to sell a book, you’re gonna make something up?” Kourtney says.\n\n“Dad so believed in him,” Kim says. “It is so shady that Caitlyn came over and gave me the book, and then on the phone she said, ‘Well, the final version has a few more things in it, but don’t worry, it’s nothing about you.’ So, she lied to me, ‘cause that is about me, if it’s about our dad.”\n\nKardashian also admits in a confessional interview that she and the newly self-styled transgender activist have a “strained” relationship. As Bruce Jenner, Caitlyn was the patriarch of the Kardashian reality TV show. Caitlyn’s coming out was featured on the show in a way that was praised as being respectful and informative on transgender issues.\n\n“I have always had Caitlyn’s back,” Kardashian says to her sisters in the clip. “but she is a liar. She is not a good person.”\n\nNicole Brown Simpson and her friend Ron Goldman were found stabbed to death outside Nicole’s condominium in the Brentwood area of Los Angeles on June 12, 1994.\n\nSimpson, the San Francisco-reared Heisman Trophy winner, former NFL star and celebrity pitchman, immediately became a person of their interest in their murders. On June 17, after the infamous low-speed pursuit of his white Ford Bronco SUV, he was arrested and charged with his killings. But he was acquitted in 1995.\n\nRobert was an original member of Simpson’s “dream team” of high-priced, high-profile attorneys. Throughout Simpson’s arrest and trial, Robert remained a steady and loyal presence.\n\nBut Caitlyn believes a jealous love triangle motivated Robert’s interest in helping his friend.\n\nRobert and Kris were married in 1978 and had four children together, future realty TV stars Kourtney, Kim, Khloe and Robert Jr. They divorced in 1991 and Kris immediately turned around and married Jenner, then a handsome, successful male athlete.\n\nIn her memoir Caitlyn wrote about Robert’s sticking by Simpson: “I wonder if it was (Robert’s) way of saying to her what I think she was saying to him when she married me: a big (expletive) you.” Reading this on your phone? Stay up to date with our free mobile app. Get it from the Apple app store or the Google Play store.\n\nCaitlyn contends that Robert knew his friend was guilty, based on a conversation Caitlyn had with Robert in the 1990s. Robert, who died of cancer in 2003, confessed his knowledge of O.J.’s guilt during a car ride the two shared, Caitlyn claims. This would have been after O.J. was found liable for the deaths of Nicole and Ron Goldman in a 1998 civil trial.\n\n“I would’ve been okay with it if they had gotten him in the first trial,” Robert said, according to Caitlyn.\n\n“The implication was obvious that he believed O.J. was guilty,” Caitlyn wrote.\n\nKris and Caitlyn divorced in 2015 after Caitlyn went public with news she’s transgender. Meanwhile, Simpson will be leaving a Nevada prison on parole next month after serving time for an unrelated robbery in Las Vegas.\n\nCaitlyn has acknowledged in interviews that she has a strained relationship with her ex-wife Kris Jenner and former Kardashian stepdaughters, though she maintains a connection with Kendall and Kylie Jenner, her daughters with Kris.\n\n“The relationship on the Kardashian side has been strained recently,” she admitted in an interview in August.\n\n“To be honest with you, I don’t really talk to them. I haven’t talked to them in months and months and months.”\n\nThe upcoming episode of “KUWTK” won’t be the first time Kim has spoken out against Caitlyn in recent weeks. Like our Facebook page for more conversation and news coverage from the Bay Area and beyond.\n\nAmid rumors about Kylie being pregnant with boyfriend Travis Scott’s child, Kardashian tweeted that the media has been “posting fake quotes from Caitlyn.” However, Kim didn’t deny reports that 20-year-old Kylie is pregnant.", "images": ["https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/09/kimcaitlyn3.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/09/kimcaitlyn1.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "http://thumbnail.newsinc.com/33035988.sf.jpg", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/05/moremet_18.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2017/09/kimcaitlyn9.jpg?w=1024&h=756", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/09/kimcaitlyn9.jpg?w=1024&h=756", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/09/28/kim-kardashian-says-caitlyn-jenner-lied-about-her-fathers-reasons-for-defending-o-j-simpson/", "title": "Kim Kardashian says Caitlyn Jenner lied about her father’s reasons for defending O.J. Simpson", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Kim Kardashian is fed up with Caitlyn Jenner's 'shady' claim that her father Robert Kardashian defended O.J. Simpson to get back at her mother Kris Jenner.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Kim Kardashian says Caitlyn Jenner lied about her father’s reasons for defending O.J. Simpson", "url": "https://www.mercurynews.com/2017/09/28/kim-kardashian-says-caitlyn-jenner-lied-about-her-fathers-reasons-for-defending-o-j-simpson/", "description": "Kim Kardashian is fed up with Caitlyn Jenner’s ‘shady’ claim that her father Robert Kardashian was jealous and defended O.J. Simpson to get back at her mother Kris Jenner.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/09/kimcaitlyn9.jpg?w=1024&h=756", "width": 1024, "height": 756}, "locale": "en_US"}, "article": {"published_time": "2017-09-28T14:14:18+00:00", "modified_time": "2017-09-28T17:14:21+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Kim Kardashian says Caitlyn Jenner lied about her father’s reasons for defending O.J. Simpson"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/09/kimcaitlyn9.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1506528000.0, "source": "http://www.mercurynews.com", "summary": ""}