{"url": "https://en.wikipedia.org/wiki/Kim_Jong-hyun_(singer)", "text": "For the NU'EST member of the same birth name, see JR (singer)\n\nSouth Korean singer\n\nKim Jong-hyun (April 8, 1990[1] – December 18, 2017),[2] better known mononymously as Jonghyun, was a South Korean singer-songwriter, record producer, radio host, and author under the SM Entertainment label. He was the main vocalist of the South Korean boy band Shinee for nine years, releasing twelve albums with the group in both Korean and Japanese. He also participated in SM Entertainment's project group, SM the Ballad, for the release of two EP albums.\n\nJonghyun was also a solo artist, beginning in January 2015 with the release of his first EP album, Base.[3] It peaked at number one on both the Billboard World Album Chart and the Gaon Album Chart.[4][5] On September 17 the same year, Jonghyun released a compilation album, Story Op.1.[6] His debut studio album She Is was released on May 24, 2016,[7] followed by his second compilation album, Story Op.2 on April 24, 2017.[8] Jonghyun began his first solo concert tour, titled \"The Story by Jonghyun\" on October 2, 2015. This was followed by three further concert tours in later years. He was regarded as one of the best vocalists in South Korea.[9] He has also received praise for his artistic control and involvement in the creation of his music, which are rare in K-pop.[10]\n\nJonghyun remained musically active as main vocalist of Shinee and as a solo artist until his death on December 18, 2017, when he committed suicide by carbon monoxide poisoning.[11] His final album, Poet | Artist, was released posthumously on January 23, 2018.[12] It was announced, prior to the release, that all profits from the album would be given to Jonghyun's mother and be used to start a charity foundation.[13] In September 2018, the Shinin Foundation was established by Jonghyun's family to help struggling young artists.[14][15][16]\n\nCareer\n\n2005–2014: Career beginnings\n\nIn 2005, Jonghyun was scouted by SM Entertainment when he was 15 years old, after playing in a song festival with his band at school.[17][18] Jonghyun debuted as part of the five-member boy group Shinee on May 25, 2008, on SBS' Inkigayo.[19] In 2009, Jonghyun started contributing to the group as a songwriter, writing the lyrics to their fourth Korean single, \"Juliette\", which was included on the group's second EP, Romeo. Jonghyun said he was inspired by the classic movie, Romeo and Juliet, and he wanted to write a romance story that \"will make everyone interested but also a story which everyone can identify with\".[20][21]\n\nIn October 2010, Jonghyun was one of twenty idols from various South Korean groups that recorded the song \"Let's Go,\" which promoted the 2010 G-20 Seoul summit. He provided vocals along with label mates Sungmin of Super Junior, Seohyun of Girls' Generation and Luna of f(x).[22] In November 2010, Jonghyun, along with TRAX's Jay, Super Junior's Kyuhyun, and Jino (now a member of Pentagon and goes by the name Jinho) participated in SM the Ballad, a project group formed by SM Entertainment with a focus on ballads and R&B.[23] The group released their debut EP album, Miss You, on November 29, 2010.[24]\n\nIn June 2011, Jonghyun appeared on KBS' Immortal Songs: Singing the Legend, a television competition program where singers perform new versions of old songs by \"legendary singers\".[25] Jonghyun won the first round and defeated his label mate, Yesung of Super Junior, but left the show after the first episode due to his busy schedule.[26] The show subsequently came under fire from viewers, who claimed the program's harsh elimination method and structure left Jonghyun in tears on stage.[27]\n\nIn October 2013, Jonghyun debuted as a composer with the track \"A Gloomy Clock\", which was included on IU's third Korean album, Modern Times. The song, which Jonghyun gave to IU as a friend, was also co-written by Jonghyun and dubbed a duet.[28] Two months later in December, Son Dam-bi released the song, \"Red Candle\", which was also composed and written by Jonghyun.[29]\n\nAfter a four year hiatus, SM the Ballad returned on February 4, 2014, with a new line-up and their second EP album Breath.[30] Jonghyun performed the title track \"Breath\" as a collaboration with Girls' Generation's Taeyeon.[31] In July 2014, Jonghyun debuted as a radio host on the MBC radio program \"MBC Blue Night [ko]\".[32] MBC said they chose Jonghyun to host because of his dedication to music-related activities and passion for music.[33] On August 2014, fellow Shinee member Taemin released his first EP album, Ace, for which Jonghyun contributed to the production by writing the lyrics to the track, \"Pretty Boy\".[34][35]\n\n2015–2016: Base, Story Op.1 and She Is\n\nBase, in January 2015. Jonghyun performing at the showcase for his debut album,, in January 2015.\n\nOn January 12, 2015, Jonghyun made his solo debut with his first EP, Base.[36] The lead track was originally the upbeat \"Crazy (Guilty Pleasure)\", which Jonghyun wrote the lyrics to. The pre-released track \"Déjà-Boo\" was named the second lead track after it charted very well on the digital charts. \"Déjà-Boo\" was co-composed by Zion.T.[37] Jonghyun's debut album received critical acclaim, and drew attention for his participation in the creative process of the album and the multiple collaborations with artists outside of SM Entertainment, including Younha, Wheesung and Zion.T. The album peaked at number one on both the Billboard World Album Chart and the Gaon Album Chart.[5][38] On January 10, television network Mnet confirmed that Jonghyun would appear on the first episode of the second season of entertainment program, 4 Things Show. Taemin, Davichi's Minkyung and Zion.T appeared as Jonghyun's friends during the episode.[39]\n\nIn March 2015, Jonghyun composed and wrote the song \"Playboy\", which was included in Exo's second Korean album, Exodus.[40] A month later, in April, Lim Kim released \"No More\" on her third EP album, Simple Mind, which was also composed and written by Jonghyun. He also participated in the vocal direction for all of the aforementioned songs.[41]\n\nLater that year, in October, Jonghyun appeared on the debut of the Mnet program, \"Monthly Live Connection\", which brought together two artists from different musical backgrounds to collaborate on one song. Jonghyun released the single \"Elevator\" on the 14th of October as part of the TV program.[42] Following that, he collaborated with Soran's Go Young-bae in creating the single \"I Guess Now It's the Fall\"[43] and with singer-songwriter Jung Joon-young in creating the single \"Aewol\".[44]\n\nJonghyun at 2016 Korean Popular Culture And Arts Awards\n\nIn August 2015, Jonghyun held his first solo concert The Story by Jonghyun, as a part of SM Entertainment's concert series The Agit.[45] Jonghyun performed songs from his first EP, and also released a new compilation album of his songs recorded in his radio show \"MBC Blue Night\". The compilation album, Story Op.1, was released on September 17, 2015.[46] Following the release of the album, Jonghyun performed a total of 12 sold-out shows, titled The Story by Jonghyun, in October. Each concert featured a different guest, including Shinee's Onew and Taemin, IU, Zion.T, Jung-in, Lim Kim, Oksang Dalbit, Coffee Boy, Nine, Lee Ji-hyoung, Soran, and poet Ha Sang-wook.[47]\n\nJonghyun published a book in September, titled Skeleton Flower: Things That Have Been Released and Set Free, which talks about his songwriting experiences and inspirations.[48] That same month, Jonghyun featured a segment on his radio show where he debuted a total of nine songs that were either completely written and composed by Jonghyun, or written by Jonghyun with the help of his composition group, WeFreaky.[49] In October 2015, Jonghyun was selected as one of the top five K-pop idol vocalists by a survey completed by 40 anonymous music industry officials.[50]\n\nJonghyun composed and wrote the track \"Already\" for Taemin's first full-length solo album, Press It, which was released in February 2016.[51] He also composed and wrote a track called \"Breathe\" for Lee Hi's album Seoulite, which was released in March 2016.[52] Jonghyun released a collaboration single with Heritage titled \"Your Voice\" on March 18, 2016, as part of SM Entertainment's SM Station project.[53]\n\nOn May 24, 2016, SM Entertainment released Jonghyun's first studio album, She Is, consisting of nine songs, most of which were written and composed by Jonghyun.[54] The album spans various genres, including electro-punk, EDM and R&B.[55][56] Jonghyun said that \"one can feel his passion as a singer-songwriter the most\" on She Is.[57]\n\n2017–2018: Story Op.2 and Poet | Artist\n\nOn March 9, 2017, MBC confirmed that Jonghyun would leave his position as radio host at \"MBC Blue Night\".[58] The decision came after a lengthy discussion between Jonghyun and the show's staff, who stated, \"It's disappointing, but because Shinee's Japanese and North American tour is about to start, he decided to leave.\"[59] In an interview for Esquire, he described the experience as a turning point in his life. It was a space where he could explore new things, express himself and connect with the public on a deeper level: ''Before, I think I was more comfortable being “the singer Kim Jonghyun.” [...] Because it was the one I [and the public] was used to. However, that changed when I started doing radio. As I started expressing my human side to others, I became [more] comfortable with the image of Kim Jonghyun that I revealed through radio.'' He also enjoyed the routine that came with hosting the midnight radio show. It gave him a sense of stability, which is rare in the entertainment industry.[60]\n\nHe released his second compilation album, titled Story Op.2, on April 24, 2017.[61] Jonghyun held a series of 20 concerts, titled The Agit (The Letter), between May and July, 2017, at SMTOWN Coex Artium in Seoul. Originally only 12 concerts were planned, but Jonghyun decided to hold eight additional concerts after fans requested more performances. The concerts included songs from the album Story Op.2, and attracted 14,000 fans.[62][63]\n\nOn December 9–10, 2017, Jonghyun held a concert titled Inspired at South Korea Olympic Handball Gymnasium.[64] Around the same time, Jonghyun was also working on his new album, which was set to be released in January 2018, and had also finished filming the music video for the lead track. The album, Poet | Artist was eventually released posthumously on January 23, 2018,[65][66][67] with all profits from the album sales to be given to Jonghyun's mother, in addition to establishing a foundation \"to help those who are living in difficult circumstances\".[68] Poet | Artist debuted at number 177 on the Billboard 200 with 5,000 equivalent album units, making Jonghyun the fourth Korean soloist to appear on the chart, after BoA, G-Dragon and Taeyang.[69]\n\nPersonal life\n\nJonghyun dropped out of high school in 10th grade to pursue a music career,[60] but later attended Chungwoon University before transferring to Myongji University, where he received a Master's Degree in film and musical studies.[70]\n\nIn April 2013, Jonghyun was involved in a car accident and injured his nose.[71][72] SM Entertainment reported that he had undergone surgery following the accident.[73] He sat out most of his group's promotions for their third full-length album, though he participated in the final week.[72]\n\nIn December 2013, as a show of support towards a protest focused on shining light on South Korea's social inequality, Jonghyun changed his Twitter profile picture to an image of a message written by a transgender, bisexual student protester.[74] It was a message that critiqued the country's cultural tightness, emphasis on social norms, and its discrimination against the LGBT community.[75] Jonghyun also reached out to the student and thanked her for speaking out and voicing her position that \"different doesn't mean wrong\".[76] This show of support attracted responses from the public, both positive and negative.[76] He received defamatory responses from Ilbe Storehouse members allegedly claiming to be members of Shinee's fanclub.[77][78][79]\n\nDeath\n\nIn December 2017, Jonghyun rented an apartment in Cheongdam-dong, Gangnam District in southeastern Seoul for two days.[80] He checked in at 12:00 PM KST on December 18, 2017.[81] Later that day, at 4:42 PM, Jonghyun's older sister, Kim So-dam, made an initial call to emergency responders, reporting that she believed he intended to commit suicide, because he had sent her a number of messages on KakaoTalk with words such as \"last goodbye\" and \"say I did well\".[81][82][83] He was last seen at a convenience store next to the apartment.[84][85][86]\n\nJonghyun was found unconscious by the police and rescue workers at around 6:10 PM in the apartment he rented.[81] He was immediately brought to Konkuk University Hospital in a state of cardiac arrest. He received emergency CPR treatment.[82] However, he failed to regain consciousness and was pronounced dead at the hospital at around 6:32 PM, aged 27.[83][87][88][89][81][90][91] Investigators believe he died from inhaling either toxic fumes or smoke, as they discovered coal briquettes burnt on a frying pan upon arriving at the apartment.[87] The police stated that, at the request of Jonghyun's family, a post-mortem would not be carried out,[92] and they declared his death a possible suicide.[93]\n\nJonghyun's funeral was held in Asan Medical Center's funeral hall in Pungnam-dong, Seoul, starting the afternoon of December 19.[94] Celebrities, such as BTS, IU, BoA, Girls' Generation, and Exo,[95] and fans attended the three-day public funeral.[96][97][98] Moreover, international fans also paid tribute to the singer around the world.[99][100][101][102][103] On December 21, following the public funeral, Jonghyun was moved from the hospital to a private funeral attended only by his family and close friends, and was then laid to rest in an undisclosed location.[104][105][106]\n\nJonghyun's death was linked to depression by various media outlets.[107][60] Following Jonghyun's death, fellow singer and friend Nine9, of the band Dear Cloud, posted on Instagram Jonghyun's suicide note which he had sent to her two or three days before his December 9 concert.[108][109] The note referred to a \"devouring\" depression and his struggles with fame.[108] Nine9 was alarmed by the note and was advised by her agency to keep in touch with Jonghyun.[108] She had tried to help him, but this only \"delayed his passing\" and \"did not prevent it\".[110]\n\nAftermath\n\nAfter Jonghyun's death, the hashtags \"#StayStrongShawols\"[111][112] and \"#YouDidWellJonghyun\" became trending topics on Twitter.[113] On December 30, 2017, Jonghyun debuted on Billboard's Social 50 chart at number two with 425,000 Wikipedia views, a boost of 17,974 percent.[114] Jonghyun's death opened discussions about the harsh and competitive nature of the entertainment business in South Korea, as well as mental health.[115][116]\n\nJonghyun's single \"Lonely\" rose to the top of South Korea's online music stores.[117] The song re-entered the country's national Gaon Digital Chart at number one, and the compilation album Story Op.2 ranked number seven on the Gaon Album Chart.[118] His first album She Is charted at number four.[119] The single and compilation album also ranked number six on Billboard's World Digital Song Sales chart and number five on its World Albums Chart.[120] Moreover, Jonghyun's book Skeleton Flower was re-released and became a bestseller following his death.[121][122]\n\nJonghyun's appearance on the variety show Night Goblin was scheduled to air on December 24, 2017, but JTBC decided not to broadcast it.[123] Shinee was slated to have a series of concerts in Japan in February 2018, and after discussion,[124] they decided to hold the concerts as scheduled.[125]\n\nTributes\n\nMany musicians and industry professionals around the world mourned Jonghyun's death. Labelmates Exo,[126] Girls' Generation member Taeyeon,[127] and TVXQ[128] paid tribute to him at their concerts. SM Entertainment artists including Exo, Red Velvet, Super Junior, NCT 127, and JYP Entertainment's Got7 attended the year-end music shows wearing black ribbons with an aquamarine-colored \"R.I.P. JH\" embroidery.[129][130]\n\nMBC Radio planned on holding a special memorial broadcast for Jonghyun's long-running radio show, \"Blue Night\", on December 21, but decided to cancel it due to \"the possible social effects of the late idol's voice going on air again.\"[131] In addition, SM Entertainment commemorated Jonghyun's death with the release of \"Dear My Family\" as a charity single, posthumously featuring Jonghyun and other artists from the label.[132] Moreover, SM Entertainment erected a memorial for Jonghyun at the Seoul’s COEX SM Atrium from January 27 to April 30, 2018.[133]\n\nLegacy\n\nJonghyun was the first artist to significantly participate in writing, organizing, and composing an album in SM Entertainment, a company known in the K-pop industry for limiting its artists' control over the production of their albums.[10] Kim Da-hee of the Korea Times named Jonghyun one of four K-pop musicians who have distinguished themselves from the mass-produced singers in the idol industry, the other three being G-Dragon, Zico and B1A4's Jinyoung, for their \"exceptional talent in songwriting, producing and dancing, plus other abilities that make them successful musicians\".[134] Jonghyun's musical style was considered to be unique, and he received praise for writing and composing the majority of his solo tracks.[135] Insight Korea mentioned him as one of seven idol group members who seemed to have been \"born to make music\".[135]\n\nDiscography\n\nFilmography\n\nFilm\n\nYear Title Role Notes Ref. 2012 I Am Himself Biographical film of SM Town [136] 2015 SMTOWN The Stage Documentary of SM Town [137]\n\nRadio\n\nBibliography\n\nYear Title ISBN Ref. 2015 Skeleton Flower: Things That Have Been Released and Set Free ISBN 978-8996955481 [140]\n\nConcerts\n\nHeadlining\n\nThe Story by Jonghyun (2015) [141]\n\nJONGHYUN – X – INSPIRATION (2016) [142]\n\nThe Agit (The Letter) (2017) [62]\n\nINSPIRED (2017)[64]\n\nAchievements\n\nAwards and nominations\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/20170708_SMTOWN_LIVE_-_%EC%A2%85%ED%98%84_%27%EB%8D%B0%EC%9E%90%EB%B6%80%27_4K_%EC%A7%81%EC%BA%A0.jpg/220px-20170708_SMTOWN_LIVE_-_%EC%A2%85%ED%98%84_%27%EB%8D%B0%EC%9E%90%EB%B6%80%27_4K_%EC%A7%81%EC%BA%A0.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/3f/20170708_SMTOWN_LIVE_-_%EC%A2%85%ED%98%84_%27%EB%8D%B0%EC%9E%90%EB%B6%80%27_4K_%EC%A7%81%EC%BA%A0.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Kim_Jonghyun_funeral_day_two_-_2.jpg/146px-Kim_Jonghyun_funeral_day_two_-_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/3/3a/SM_Entertainment_Group_Logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Kim_Jonghyun%27s_Signature.svg/150px-Kim_Jonghyun%27s_Signature.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Kim_Jong-hyun_during_at_Base_Showcase_01.jpg/220px-Kim_Jong-hyun_during_at_Base_Showcase_01.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Jonghyun_at_2016_Korean_Popular_Culture_And_Arts_Awards.jpg/220px-Jonghyun_at_2016_Korean_Popular_Culture_And_Arts_Awards.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3f/20170708_SMTOWN_LIVE_-_%EC%A2%85%ED%98%84_%27%EB%8D%B0%EC%9E%90%EB%B6%80%27_4K_%EC%A7%81%EC%BA%A0.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kim_Jong-hyun_(singer)", "title": "Kim Jong-hyun (singer)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/3f/20170708_SMTOWN_LIVE_-_%EC%A2%85%ED%98%84_%27%EB%8D%B0%EC%9E%90%EB%B6%80%27_4K_%EC%A7%81%EC%BA%A0.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}