{"url": "https://www.latingrammy.com/en/news/j-balvin-leads-latin-grammy-nominations-with-eight-followed-by-rosal-a-with-five-el-david", "text": "Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas),\n\nJorge Drexler (Salvavidas De Hielo), El David Aguilar (Siguiente), Kany García (Soy Yo), Natalia Lafourcade (Musas, Un Homenaje Al Folclore Latinoamericano En Manos De Los Macorinos, vol. 2), Luis Miguel (¡México Por Siempre!), Monsieur Periné (Encanto Tropical),\n\nRozalén (Cuando El Río Suena...) vie for Album Of The Year\n\nMIAMI (September 20, 2018) — The Latin Recording Academy® has announced the nominees for the 19th Annual Latin GRAMMY Awards®, the preeminent international honor for excellence in Latin music and the only peer-presented Latin music accolade. The nominees include a diverse group of established artists and newcomers. Leading the list is J Balvin with eight nominations, followed by Rosalía with five. In addition to the top nominees, several artists and producers received four nominations each including, El David Aguilar, Jorge Drexler, Kany García, and Natalia Lafourcade, along with producers Mauricio Rengifo and Andrés Torres.\n\n\"This year’s nominees are a testament to our members’ commitment to excellence and novelty in Latin music,\" said Gabriel Abaroa Jr., President/CEO of The Latin Recording Academy. \"The Latin Recording Academy received an unprecedented all-time record number of entries for the 19th Annual Latin GRAMMY Awards, resulting in a diversified group of talented artists, producers, and songwriters. The members of The Latin Recording Academy continue to acknowledge emerging talent, risk takers, creative innovators, and respected artists that allow Latin music to be discovered, explored and enjoyed, just as it has been for the past century.\"\n\nThe Album Of The Year list is composed of a diverse group of established and new artists, genres, and eclectic collaborations, such as Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas), Jorge Drexler (Salvavidas de Hielo), El David Aguilar (Siguiente), Kany García (Soy Yo), Natalia Lafourcade (Musas, Un Homenaje Al Folclore Latinoamericano En Manos De Los Macorinos,vol. 2), Luis Miguel (¡México Por Siempre!), Monsieur Periné (Encanto Tropical), and Rozalén (Cuando El Río Suena...).\n\nThe Latin GRAMMY Awards are voted on by The Latin Recording Academy's international membership body of music makers, who represent all genres and creative disciplines, including recording artists, songwriters, musicians, producers, and mixing and studio engineers. The 2018 nominees were selected from nearly 14,000 submissions across 49 categories during the eligibility period (June 1, 2017 through May 31, 2018).\n\nVoting members will begin the final round of online voting on September 28, 2018. Winners will be revealed on November 15, 2018, during the 19th Annual Latin GRAMMY Awards' Premiere and telecast ceremonies in Las Vegas. The telecast will broadcast live from the MGM Grand Garden Arena on the Univision Network from 8–11 p.m. ET (5–8 p.m. PT).\n\nFollowing is a list of the nominations in some of the 49 categories. They feature an array of musical genres, as well as some of the most prominent names and brightest newcomers in Latin music. For the complete list of nominees, please visit LatinGRAMMY.com.\n\nAlbum Of The Year\n\nPrometo – Pablo Alborán\n\nVibras – J Balvin\n\nCaravanas – Chico Buarque\n\nSalvavidas De Hielo – Jorge Drexler\n\nSiguiente – El David Aguilar\n\nSoy Yo – Kany García\n\nMusas (Un Homenaje Al Folclore Latinoamericano En Manos De Los Macorinos), Vol. 2 – Natalia Lafourcade\n\n¡México Por Siempre! – Luis Miguel\n\nEncanto Tropical – Monsieur Periné\n\nCuando El Río Suena... – Rozalén\n\nRecord Of The Year\n\nNo Vaya A Ser – Pablo Alborán\n\nÉ Fake (Homem Barato) – Anaadi\n\nMi Gente – J Balvin with Willy William\n\nInternacionales – Bomba Estéreo\n\nTelefonía – Jorge Drexler\n\nPara Siempre – Kany García\n\nX – Nicky Jam and J Balvin\n\nDanza De Gardenias – Natalia Lafourcade Featuring Los Macorinos\n\nBailar Contigo – Monsieur Periné\n\nMalamente – Rosalía\n\nSong Of The Year - A Songwriter's Award\n\nAntes De Ti – Manú Jalil and Mon Laferte, songwriters (Mon Laferte)\n\nBailar Contigo – Monsieur Periné, songwriters (Monsieur Periné)\n\nDanza De Gardenias – David Aguilar Dorantes and Natalia Lafourcade, songwriters (Natalia Lafourcade Featuring Los Macorinos)\n\nEmbrujo – El David Aguilar, songwriter (El David Aguilar)\n\nLa Puerta Violeta – Rozalén, songwriter (Rozalén)\n\nMalamente – Antón Alvarez Alfaro, Pablo Diaz-Reixa and Rosalía, songwriters (Rosalía)\n\nPara Siempre – Kany García, songwriter (Kany García)\n\nRobarte Un Beso – Mauricio Rengifo, Andrés Torres, Carlos Vives and Sebastián Yatra, songwriters (Carlos Vives & Sebastián Yatra)\n\nTelefonía – Jorge Drexler, songwriter (Jorge Drexler)\n\nTu Vida Mi Vida – Fito Páez, songwriter (Fito Páez)\n\nBest New Artist\n\nÁngela Aguilar\n\nAnaadi\n\nEl David Aguilar\n\nAlex Ferreira\n\nKarol G\n\nLos Petitfellas\n\nNana Mendoza\n\nChristian Nodal\n\nClaudia Prieto\n\nBenjamín Walker\n\nBest Contemporary Pop Vocal Album\n\nSer – Axel\n\nCamino Fuego Y Libertad – Pablo López\n\nCuerpo Y Alma – Beatriz Luengo\n\nF.A.M.E. – Maluma\n\nMiradas – Nana Mendoza\n\nBest Urban Fusion / Performance\n\nMi Gente – J Balvin with Willy William Featuring Beyoncé\n\nInternacionales – Bomba Estéreo\n\nYo Contra Ti – Daddy Yankee Featuring Orquesta Sinfónica De Puerto Rico\n\nSua Cara – Major Lazer Featuring Anitta and Pabllo Vittar\n\nMalamente – Rosalía\n\nBest Alternative Music Album\n\nClaroscura – Aterciopelados\n\nPuñal – Dante Spinetta\n\nFuerza Arará – Telmary\n\nMismo Sitio, Distinto Lugar – Vetusta Morla\n\nAztlan – Zoé\n\nBest Regional Song - A Songwriter's Award\n\nArránquense Muchachos – Domingo Leiva Delgado, songwriter (Pedro Fernández)\n\nAyúdame A Olvidarte – Gabriel Flores and Yoel Henríquez, songwriters (La Explosiva Banda De Maza)\n\nCorrido De Juanito – Edén Muñoz, songwriter (Calibre 50)\n\nEl Sueño Americano – Salvador Hurtado, songwriter (La Energía Norteña)\n\nProbablemente – Christian Nodal, songwriter (Christian Nodal)\n\nBest MPB (Música Popular Brasileira) Album\n\nMano Que Zuera – João Bosco\n\nCaravanas – Chico Buarque\n\nEdu, Dori E Marcos – Edu Lobo, Dori Caymmi e Marcos Valle\n\nCampos Neutrais – Vitor Ramil\n\nDeus É Mulher – Elza Soares\n\nDisclaimer: This release has been prepared with label copy information and recordings provided by labels and Academy members. There may still be minor adjustments when The Latin Academy reviews evidence of need for changes, corrections, or modifications.\n\nFor more information and the latest news, please visit the official Latin Recording Academy website at LatinGRAMMY.com. Follow us on Facebook (LatinGRAMMYs), Twitter (@LatinGRAMMYs) or Instagram (@LatinGRAMMYs). Use #LatinGRAMMY on your favorite social media platform.\n\nThe media credentialing process to cover the 19th Annual Latin GRAMMY Awards is open. Please visit www.latingrammy.com/en/press. The deadline to apply is October 3, 2018, at 9 p.m. ET (6 p.m. PT).\n\n\n\n\n\nABOUT THE LATIN RECORDING ACADEMY:\n\nThe Latin Recording Academy is an international, membership-based organization and comprises Spanish- and Portuguese-speaking recording artists, musicians, songwriters, producers and other creative and technical recording professionals. The organization is dedicated to improving the quality of life and cultural condition for Latin music and its makers. In addition to producing the Latin GRAMMY Awards to honor excellence in the recorded arts and sciences, The Latin Recording Academy provides educational and outreach programs for the Latin music community either directly or through its Latin GRAMMY Cultural Foundation®. For more information about The Latin Recording Academy, please visit LatinGRAMMY.com. For breaking news and exclusive content, follow us at: Twitter, Facebook, Instagram, Vine, Periscope, YouTube, Pinterest, Google+ and Tumblr.\n\n###\n\nMedia Contacts:\n\nThe Latin Recording Academy:\n\nIveliesse Malavé\n\nive@grammy.com\n\n(305) 576-0036\n\nThe Lippin Group on behalf of The Latin Recording Academy:\n\nElina Adut\n\nEAdut@lippingroup.com\n\n(323) 965-1990", "images": ["https://www.latingrammy.com/files/styles/square_thumbnail/public/news/fonsi.jpg?itok=gwBHaBDW", "https://www.latingrammy.com/files/styles/news_photos/public/news/930x580_2018-nominees-day-english.png?itok=w5te0wJA", "https://www.latingrammy.com/files/news/930x580_2018-nominees-day-english.png", "https://www.latingrammy.com/files/lg20_logo_eng_2020_04-02-20.png", "https://www.latingrammy.com/files/styles/square_thumbnail/public/news/eng_press_0.png?itok=uUfSgtCG", "https://www.latingrammy.com/files/styles/square_thumbnail/public/news/press_ji_en.png?itok=AYLkz7M1", "https://www.latingrammy.com/files/styles/square_thumbnail/public/news/lgcf_cnco-square.png?itok=_OX3MzmM", "https://www.latingrammy.com/files/styles/square_thumbnail/public/news/eng_press_0_0.png?itok=g7SiIz7Q"], "top_img": "https://www.latingrammy.com/files/news/930x580_2018-nominees-day-english.png", "keywords": [], "authors": [], "canonical_link": "https://www.latingrammy.com/en/news/j-balvin-leads-latin-grammy-nominations-with-eight-followed-by-rosal-a-with-five-el-david", "title": "J Balvin leads Latin GRAMMY® nominations with eight, followed by Rosalía with five; El David Aguilar, Jorge Drexler, Kany García, Natalia Lafourcade, and producers Mauricio Rengifo and Andrés Torres g", "meta_data": {"p": {"domain_verify": "7ef0d6bbf6b068cebe69f1e17e722f46"}, "description": "Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas),Jorge Drexler (Salvavidas De Hielo), El David Aguilar (Siguiente), Kany García (Soy Yo), Natalia Lafourcade (Musas, Un Homenaje Al Folclore Latinoamericano En Manos De Los Macorinos, vol. 2), Luis Miguel (¡México Por Siempre!), Monsieur Periné (Encanto Tropical), Rozalén (Cuando El Río Suena...) vie for", "keywords": "Music, Latin GRAMMY, Latin GRAMMY Awards, Latin Music", "twitter": {"card": "summary_large_image", "site": {"identifier": "@LatinGRAMMYs", "id": 41221076}, "creator": {"identifier": "@LatinGRAMMYs", "id": 41221076}, "title": "J Balvin leads Latin GRAMMY® nominations with eight, followed by", "url": "https://www.latingrammy.com/en/news/j-balvin-leads-latin-grammy-nominations-with-eight-followed-by-rosal-a-with-five-el-david", "image": {"identifier": "https://www.latingrammy.com/files/lg_meta_tags_2019_v0101.png", "width": 1110, "height": 500}, "player": {"identifier": "https://players.brightcove.net/6057940563001/default_default/index.html?videoId=", "width": 400, "height": 300}}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "apple-mobile-web-app-capable": "yes", "og": {"type": "website", "title": "J Balvin leads Latin GRAMMY® nominations with eight,  followed by Rosalía with five;  El David Aguilar, Jorge Drexler, Kany García, Natalia Lafourcade, and producers Mauricio Rengifo and Andrés Torres garnered four nominations each", "url": "https://www.latingrammy.com/en/news/j-balvin-leads-latin-grammy-nominations-with-eight-followed-by-rosal-a-with-five-el-david", "site_name": "Latin GRAMMYs", "image": "https://www.latingrammy.com/files/news/930x580_2018-nominees-day-english.png", "description": "Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas),Jorge Drexler (Salvavidas De Hielo), El David Aguilar (Siguiente), Kany García (Soy Yo), Natalia Lafourcade (Musas, Un Homenaje Al Folclore Latinoamericano En Manos De Los Macorinos, vol."}, "fb": {"app_id": 717227321625984}}, "movies": [], "publish_date": null, "source": "https://www.latingrammy.com", "summary": ""}