{"url": "www.thesun.co.uk/tvandshowbiz/4768929/scott-disick-looks-miserable-on-day-out-in-la-after-ex-kourtney-kardashian-banned-sofia-richie-from-meeting-their-kids/", "text": "SCOTT Disick was seen looking glum as he spent time with his son Mason in LA today – following the news Kourtney Kardashian has vetoed his new girlfriend from spending time with their children.\n\nThe reality star, who has Mason, Penelope and Reign with his ex, failed to raise a smile while treating Mason to some quality one on one time.\n\n7 Scott Disick was seen out and about with Mason in LA today Credit: X17Online.com\n\nDressed down, Scott, 34, wore a pair of cargo trousers and a black top, while Mason, 7, held onto his hand.\n\nTheir outing comes after The Sun Online revealed that the eldest sister isn’t keen on Scott’s 19-year-old girlfriend meeting their children just yet – and has told Scott to keep Sofia away.\n\n“Kourtney is a fierce mom, and she’ll do whatever it takes to protect her kids,” says the insider.\n\n“She doesn’t want them getting confused by Scott’s new girlfriend – Mason is seven, old enough to understand a lot of things now, and Kourtney doesn’t want them meeting another one of Scott’s new girlfriends, only for her to disappear from their lives in a month.\n\n7 The usually cheerful Scott looked in a contemplative mood Credit: X17Online.com\n\n7 Kourtney with her two youngest children, Reign and Penelope Credit: Fame Flynet\n\n“Plus, it would kill her to see another woman ‘playing mom’ to her kids in public. It would break her heart.\n\n“These past few months have been tough – she’s had to co-parent with Scott, and keep things nice between mom and dad. She spoke to Scott and said Sofia can meet the kids in a few months – and he’s agreed to do things her way … for now.”\n\nSince Scott confirmed he was dating Lionel Richie’s daughter Sofia in September, we’ve seen him taking Mason, Penelope and Reign out in LA – but girlfriend Sofia hasn’t been spotted with them.\n\nScott and Sofia have been on several loved-up holidays – to Miami, Venice, New York and to the Mexican villa where he first met Kourtney.\n\n7 Scott and Sofia in Venice earlier this month Credit: Flynet Pictures\n\n7 Scott and Kourtney in happier times with their three kids Credit: FameFlynet.uk.com\n\nKourtney has moved on from Scott with 23 year old model Younes Bendjima – but we haven’t spotted him meeting Kourt and Scott’s kids either.\n\nRecently on Keeping Up With The Kardashians, viewers saw an infuriated Kourtney ban Scott from seeing his kids during a wild party binge, saying: “I don’t want the kids seeing him like this.\"\n\nShe also revealed to sister Khloe that Scott had sent her screaming messages threatening to beat up boyfriend Younes and offensive rants when she went on holiday with sister Kim.\n\nShe’s also slammed her ex – who she dated for nine years before splitting in 2015 – for being photographed with “a different hooker every day”.\n\n7 Kourtney's also moved on - with model Younes Bendjima Credit: Rex Features\n\nKourtney Kardashian slams Scott Disick for being pictured with 'a different hooker every day'\n\n7 On Keeping Up With The Kardashians, Scott was banned by Kourt from seeing his kids when he was on a party binge Credit: BackGrid\n\nThe Sun Online has contacted Kourtney's spokesperson for comment.\n\nMost read in TV & Showbiz PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize BECK HOME The Beckhams post pics proving they didn't move back to London GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? Exclusive CHUM-IN-LAW MasterChef's Gregg laughs more with mum-in-law than wife who's 22yrs his junior\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.8 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.1 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2017/10/as-comp-scott.jpg?strip=all&quality=100&w=750&h=500&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/10/as-comp-scott.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Fay Strang", "Issy Sampson"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/4768929/scott-disick-looks-miserable-on-day-out-in-la-after-ex-kourtney-kardashian-banned-sofia-richie-from-meeting-their-kids/", "title": "Scott Disick looks miserable on day out in LA after ex Kourtney Kardashian ‘blocked’ Sofia Richie from meeting their kids", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Scott Disick looks miserable on day out in LA after ex Kourtney Kardashian 'blocked' Sofia Richie from meeting their kids", "url": "https://www.thesun.co.uk/tvandshowbiz/4768929/scott-disick-looks-miserable-on-day-out-in-la-after-ex-kourtney-kardashian-banned-sofia-richie-from-meeting-their-kids/", "description": "SCOTT Disick was seen looking glum as he spent time with his son Mason in LA today – following the news Kourtney Kardashian has vetoed his new girlfriend from spending time with their children. The…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/10/as-comp-scott.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2017-10-25T23:47:56+00:00", "modified_time": "2017-10-26T08:09:32+00:00", "publisher": 161385360554578, "tag": "Kourtney Kardashian, Scott Disick, Celebrity relationships and break ups, Keeping Up with the Kardashians", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The 34-year-old was seen spending quality time with his eldest son Mason today in LA. His ex partner Kourtney Kardashian has 'blocked' him from introducing new girlfriend Sofia Richie to their three children.", "twitter": {"text": {"title": "Scott Disick looks miserable on day out in LA after ex Kourtney Kardashian ‘blocked’ Sofia Richie from meeting their kids"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "scott's wrong?", "headline": "Scott Disick looks miserable after Kourtney ‘blocks’ Sofia from seeing kids", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/10/as-comp-scott.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/10/as-comp-scott.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 4768929, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1508975276.0, "source": "http://www.thesun.co.uk", "summary": ""}