{"url": "https://www.hollywoodreporter.com/features/jennifer-lawrence-interview-by-oprah-winfrey-1064576", "text": "The Oscar-winning actress talks to the legendary interviewer about everything from pay equity (\"I had it up to my f—ing eyeballs\") to her dealings with Harvey (\"He had only been nice to me — except for when he wasn't\") to where she sees herself in 20 years: \"I won't have periods anymore, that's a bonus.\"\n\nOprah Winfrey barely knew Jennifer Lawrence when the actress called and said she'd like to meet and then on Oct. 5 drove to see Winfrey at her Montecito, California, home. \"I was excited to have lunch, and we were just like 'girls in the garden,'\" says Winfrey. \"We probably talked for three and a half hours about life and fame and growing up and money and management and taking care of yourself and spirituality and philosophy. We drank rosé, and we laughed, and we talked about everything.\"\n\nAlmost everything. One thing they didn't discuss was Harvey Weinstein, whose history of harassment and assault exploded into view that day, when The New York Times first detailed it. But Weinstein became a focal point of the two women's conversation a few weeks later, when THR asked Winfrey, 63, to interview Lawrence for this Women in Entertainment issue. That was shortly before the 27-year-old actress was to receive the Sherry Lansing Leadership Award at THR's annual Power 100 breakfast, an award Winfrey received in 2013.\n\nSince their first meeting, the new friends have been texting back and forth. \"I sent her a copy of Wisdom of Sundays and, before that, Power of Now and A New Earth,\" notes Winfrey. \"What resonates with me is that, when you are talking to her, what you're seeing is the real thing. You're not seeing any pretense. She's asking all the right questions: 'How can I be used? How can I use this moment for something bigger than myself?'\"\n\nLawrence grew up in Louisville, Kentucky, and was propelled to fame with 2010's Winter's Bone. The Hunger Games made her a global superstar, along with roles in Silver Linings Playbook, American Hustle and the X-Men series. But it's not so much her stardom and four Oscar nominations (with a win for Silver Linings) that make her the perfect recipient of the Lansing award; it's also her nonprofit endeavors. She's been tireless in supporting Kentucky charities and those that help children in particular.\n\nThat's one reason why Winfrey was so impressed by \"how much light [Lawrence] carries. Capital L, capital Light. You can feel there's a strong intelligence and a desire to use this moment for something greater than fame and fortune.\"\n\nOPRAH WINFREY I read this wonderful book by Elizabeth Strout [Anything Is Possible]. And in it, she was speaking about one of the characters who was so embittered and regretful, and the line she used was, \"because her life did not turn out the way she had expected.\" Is your life what you expected?\n\nJENNIFER LAWRENCE When I started acting, I was totally satisfied when I was on a sitcom because I had a steady paycheck. And I was like, \"Maybe I can just find a way to be on sitcoms forever.\" I was totally satisfied and good. I never dreamed that I could have this kind of career.\n\nWhen you dreamed the dream, what did the dream look like? I used to drive home from church with my father past rich white people's houses — we'd be the last to leave our little church yard, and he'd be in this big, old, green Oldsmobile that I was embarrassed to be in — and I'd pick houses that I dreamed about living in, and that was a big dream for me: I'd have a house, I'd be able to pay my bills, I'd have two cars in the driveway.\n\nI used to do that, too. I remember driving by big, beautiful houses, but I always dreamed of being there with my parents. I never imagined I'd be able to own something like that on my own. I thought for a while maybe I could be an interior designer — that was the only job I knew about because my mom was friends with an interior designer. I was mostly just focused on a family when I was little. I would have never thought I'd be so career-focused. It's not something I knew about myself until I started becoming successful, and then I wanted to become more successful. I'd make a great movie, and then I'd want to make more great movies; I'd make money, I'd want to make more money. It was a mind-set I wasn't ever aware I had until my early 20s.\n\nAnd then, by the time you're 27, you've got [an Oscar]. By the time you've gotten four [nominations], does it come with —\n\nFear. You're immediately hit with fear. Or at least I was. I had been climbing and working and fighting, and I remember last year just getting hit with fear. All of a sudden it was, \"They're going to get sick of me.\" That's when all my insecurity came. I've been probably more insecure after last year, and I don't know if that's just a feeling of: I've got more to lose, I have more people to disappoint. I don't know how to explain it.\n\nWhen [mother! was] not [well received], [was that] disappointing?\n\nI read Twitter, and I was looking for bad mother! things. It was horrible. It was really bad. I loved this so much, and it just broke my heart, especially for Darren [Aronofsky, the film's writer-director and Lawrence's ex] because he loved this person. And any time you're in a relationship, their pain is your pain.\n\nYou're trolling for bad news?!\n\nI didn't know that's what I was doing. I don't know how to look up these things. I started twittering \"mother!\" 'cause I didn't know how else to get news, and that was really bad.\n\nHow do you choose what you're going to do next?\n\nIt's chemistry. It's like meeting a boyfriend. Red Sparrow [March]was sexual, and I haven't done anything sexy or sexual. I've been afraid of that since 2014, when I got my pictures hacked. I just thought, \"I'll never do that again. I'll never share that part of myself ever since it got shared against my will.\" And then when I said yes to Red Sparrow, I felt I was taking something back.\n\nWhen your pictures got exploited that way, did it feel like you'd been robbed? Like you came home and your whole house had been invaded?\n\nI would much prefer my whole house to have been invaded. That's what's so scary about electronic [things]. I have such fear with my phone and my computer and electronics. It's taking somebody's intellectual property but also my body. It was violating on a sexual level.\n\nWhat's the best advice you've been given?\n\nIt was probably by you. You just said it under your breath. You were talking, and then under your breath you said, \"You have to teach somebody how to treat you.\" That's the smartest thing I've ever heard.\n\nThat was a fun lunch. You know what was amazing about that lunch? The Harvey Weinstein story had broken that day or the day before. And I meant to bring it up and then I didn't.\n\nI don't know a woman who hasn't been touched by some sort of abuse. I'm sad by the women's stories, but I'm excited by the change that's going to come from it. The rule book is being rewritten right now. People are terrified. I mean, specifically, men using their power to abuse women. But I was abused by a woman on a movie. [In October, Lawrence said a female producer had once asked her to \"do a nude lineup with about five women who were much, much thinner than me. And we all stood side by side with only paste-ons covering our privates.\" She did not name the producer or the film.] There was a general consensus on [that] movie that I was fat, and so it wasn't just the woman. Everybody agreed that I was fat. And she had to be the mouthpiece.\n\nThat was where you were asked to lose 15 pounds —\n\n— in two weeks.\n\nAnd then someone said you were already —\n\n— that I was already fuckable. And I had to do a nude lineup. It was abusive. I mean, it wasn't sexually abusive, but —\n\nIt was abusive.\n\nI've talked to women. We've talked about forming a commission. It's just so sad because every actor, when you're starting out, there's really not a lot of options. On that movie, I called my agent, and I called everybody. It's like, there's not really anything anybody can do because the behavior is so normalized. And then you become more powerful, and people start fucking with you less. People at the beginning of their careers don't want to rock the boat because if you rock the boat, you'll be called difficult. How can there be rules in place where there are certain ways that you just cannot treat people? Or a commission, somebody that they can call? If every A-list actor decides to join this commission, we know everybody in the industry. I know every studio head in town. If I'm on this commission, and [if] I get an email about somebody being treated badly on a set, I can send an email. We have to all put our heads together and figure out how to not let this moment go, not just be like, \"Oh, well, that was crazy.\" Something has to really get done.\n\nI feel it happening. But you were rocking the boat several years ago when you came out talking about the differences in pay for men and women doing the same job.\n\nI felt this frustration that women in every field felt, which was: I'm trying to negotiate, and we're going through the numbers, and I'm seeing that the numbers aren't adding up, and it's like you just keep hitting a wall where you can't get paid more, [and] if you ask for more, we'll hire somebody else, and the whole movie will fall apart. They'd rather pull a whole movie apart than pay me fairly. And when the Sony hack happened, I was like, \"You know what? Fuck it. I'm not the only woman who's going through this. If everybody's looking at it anyway and everybody's talking about it …\" I didn't see an option other than saying something. I had just had it up to my fucking eyeballs.\n\nSo you were emboldened in that moment. And this now, the Weinstein moment, has also emboldened a lot of women. I was on the set with some other actresses, and everybody was behaving in a way that felt like PTSD.\n\nThere was this moment when all of this broke out and everybody was silent, and then all of a sudden, every actress' Twitter was blowing up with, \"You need to come forward and you need to say something and you need to condemn!\" Which is true: We do have a responsibility to say something; we've all worked with him, but everybody needed a moment. Just speaking for myself, I had known him since I was 20, and he had only ever been nice to me — except for the moments that he wasn't, and then I called him an asshole, and we moved on. He was paternal to me. So I needed a moment to process everything because I thought I knew this guy, and then he's being accused of rape. We all knew he was a dog, we knew that he was a —\n\nA brute?\n\nA tough guy, a brute, a tough guy to negotiate with. I didn't know that he was a rapist. And it's so widespread, the abuse, from so many different people — it's directors, it's producers — that I think everybody needed to [process it]. Everybody needs to deal with this in their own way; everybody needs to heal.\n\nHas there been a woman's or a man's story that stood out for you among all the stories of harassment?\n\nNo. They are all horrible, and not one is more horrifying than the next. But being able to hear when the woman wore the microphone and Harvey was telling her to watch him shower — I felt sick in my bones for an entire day. I was just sick. I was just like, \"I can't,\" after hearing that. And that's why it's so important to talk about abuse, all of the different forms of abuse, because he didn't lay a finger on her, and I felt chilled to my bones. Imagine having a man who is that powerful telling you to do something [and] you're saying no. [He's] threatening you, saying, \"Don't embarrass me. We're at this hotel.\"\n\nThe implication is that if you won't give up five minutes of your time, you're going to lose your career.\n\nThen you're done.\n\nLast question on this subject: With all of these women and men coming forward, what ultimately would be the best result?\n\nSocial change. Men need more social awareness. But this comes down to equality, and until all women in every job are paid equally for the same amount of work, how are we ever going to be thought of as equals? As long as there is one group of humans that is overruling another one, there's going to be abuse, [and] why would we be thought of as equals? … My political passion has almost turned into an obsession. I mean, I don't think you ever do feel settled, [but] as soon as you feel settled with your home and your personal life, you're looking at the world and going, \"How in the hell do I fix this? What do we do?\"\n\nHave you met Trump?\n\nNo, never.\n\nDo you want to?\n\nI think so. I've got a pretty good speech. And it ends with a martini to the face. (Laughter.) I have something to say for all of them. I watch different characters on the news, and I'm like, \"You just wait.\"\n\nIf that moment comes, you would be prepared?\n\nOh, I would, definitely. Oh, my God, I've been waiting for this moment. I'll give you a hint — it's not nice. You wouldn't want me to say it to you.\n\nYou are politically frustrated — we talked about that at lunch. This moment is a moment that forces us all to show up. So how will you show up?\n\nI've started with simply trying to raise money for the organiza­tion [Represent.Us] that I'm on the board of directors of. And then I'm going to go on campus tours. I want to be talking to high schoolers and college students. I want to travel around to the areas I'm from so that people realize that corruption is a completely nonpartisan issue. And we want to hold a press conference where the only people who are asking the questions are the high schoolers and the college students. I would [also] love to help pass a bundle of laws [against government corruption]. We'd be able to pass state-by-state legislation to help [stop] corruption in our government. I would love to pass laws that help celebrity parents be able to take their kids to places without having to worry about paparazzi.\n\nHow do you create a personal life?\n\nIt's really not hard. People imagine my life being [different]. It's actually pretty normal. I drove myself to the laser hair removal today. (Laughter.) I have always been a homebody. My social life has always been very boring: I sit around outside my house with my friends and drink wine, and that hasn't really changed. I don't really like to go out. I have friends who come and visit me when I'm on sets. It's just annoying because you have to work 13-, 14-hour days. So sometimes it's not nice to have my friends there, just because I feel bad and I have to work. I actually have the most amazing neighborhood tribe. My neighborhood is like a village. The women are sharing breast milk. Zoe Saldana just came and got an onion from me [the other day]. Cameron Diaz and I went on a hike [recently].\n\nReally? People are borrowing onions? Nobody borrows sugar anymore. It's like, \"May I have an onion and some kale?\"\n\n(Laughter.) Exactly. I made chicken broth.\n\nPeople who really know you use what adjectives to describe you?\n\nCrazy. Honest. I'm sure everybody would agree that I am honest and loyal, but they would also all agree that I'm crazy. Committed. Most of my friends are married, and I'm still over at their house every night like we're all married, all three of us. So the commitment is strong.\n\nThree people you'd like to have at a dinner party, living or dead?\n\nScott Disick [from Keeping Up With the Kardashians], Luann from Real Housewives of New York, Bethenny Frankel. And I'm not proud of that, but that's what comes from my heart.\n\nIf you had a seance, who would you want to contact?\n\nA seance? Oh, no! I just thought about friends. Abraham Lincoln. I'd ask him to be president, I'd ask him to run. I guess you'd ask him, \"How did you face such opposition so bravely?\" And then he'll say, \"Well, I got shot in the head for it, Jennifer.\"\n\nAre you more traditional or more modern?\n\nMy house is probably the exact blend of both. Probably leaning a little bit more traditional. I'm infatuated with my house. I don't even like L.A., I just like my house here, and I don't ever really leave. But it never feels done.\n\nDo you have a favorite possession?\n\nNo. I'm the opposite of a hoarder. I don't hang on to enough stuff. I mean, my most prized possession, my most cherished thing in the world, is my one and only daughter, Pippi [her dog].\n\nA favorite quote?\n\nMy favorite quote that's going on my tombstone, and I wrote this myself, probably stoned, is: \"I definitely shouldn't have done it, but I am at peace with knowing that I couldn't not.\" That started over me sending dub smashes — they're like jokey videos — to Robert De Niro, who was fully not getting it. And the more he wasn't getting it, the funnier I thought it was, and I kept leaning into it. I shouldn't have done it, but I'm at peace with knowing that I couldn't not. (Laughter.)\n\nFill in this blank. Twenty years from now, the world will be ...\n\nFair. (Laughs.) No, it'll be a carnival. It'll be a big zoo. Fair. That covers hunger, it covers a lot of bases.\n\nTwenty years from now, I will be ...\n\nI won't have periods anymore. That's a bonus.\n\nYeah, you will.\n\nFuck.\n\nDo you have a favorite joke?\n\nThis one New Yorker cartoon really got me. This man was at his mother's funeral, and it was just a cartoon of him at the pulpit, and he said, \"Mother wouldn't have wanted us to feel sad, she would've wanted us to feel guilty.\" (Laughter.)\n\nWhat's the lesson that has taken you the longest to learn?\n\nI'm still learning to slow down. My thoughts are so gigantic. I go from one small idea to 40 years from now, and I overthink everything, and nothing actually gets done. Worrying does nothing. So living in the moment and taking everything step by step is something I have not mastered. I am still working at it.\n\nThe lesson you would want to teach your younger self is ...?\n\nI would probably just say, \"Calm the fuck down.\" I would get so nervous. I was 21, going through world press tours, and it's just embarrassing. You don't want to see yourself at 21 being ridiculous.\n\nHow do you ground yourself, center yourself?\n\nI don't know if I've gotten there yet. I don't know if I do.\n\nAre you happy?\n\nYes.\n\nAre you fulfilled?\n\nYes. Not all the time, but overall, yeah.\n\nAre you religious, spiritual or both?\n\nNeither. I guess I am spiritual. I'm not religious. I grew up very religious. I have a religious family, but I don't believe in anything. I wouldn't call myself an atheist. I just believe in that thing, that something, whatever it is, that I do believe in. I don't think it identifies as a man. To argue over what it is is ridiculous because none of us have the answer. I pray, it's just I'm not praying to anybody specific. I grew up praying every night before bed, so I still sometimes do that, and it's a good checking-in time. But I was in a plane that had double-engine failure, and I was praying to God.\n\nWhether you believe in Him or not. (Laughter.)\n\nWhether I believe in Him or not! I was like, \"I don't know if you're out there, but if you are, please, please [save] the airplane.\"\n\n•••\n\nWhy THR Chose Jennifer Lawrence as This Year's Sherry Lansing Leadership Award Recipient\n\nFrom the very start of her career, the 27-year-old Oscar-winning actress has demonstrated fierce commitment to fairness and opportunity in Hollywood and beyond. — by Brian Porreca\n\nOn Dec. 6, at THR’s Women in Entertainment Breakfast, the Sherry Lansing Leadership Award — previously bestowed upon such industry vets as Barbra Streisand, Shonda Rhimes, Oprah Winfrey and Jane Fonda — will go to an actress born the year Ghost came out. But then Lawrence has accomplished more than most in her 27 years: She’s won an Oscar, headlined her own billion-dollar franchise and led the debate on pay equity. She has also become one of Hollywood’s most active philanthropists.\n\nSOCIAL JUSTICE\n\nEarly in her career, she began giving back alongside her Hunger Games co-stars to causes including the United Nations World Food Program. And when her star shot up, she started the Jennifer Lawrence Foundation. While it helps a variety of organizations, there is a focus on those supporting youth and children: the Boys and Girls Club, Make-a-Wish Foundation, Kids Cancer Alliance, Uspiritus, St. Mary's Center and West End Boys School, among others. Most recently, she joined the board of Represent.Us, the nation's largest grassroots anti-corruption campaign.\n\nHOMETOWN HERO\n\nIn 2016, the Oscar winner and four-time nominee donated $2 million to create the Jennifer Lawrence Foundation Cardiac Intensive Care Unit at Norton Children's Hospital in her hometown of Louisville, Kentucky. She also created the Jennifer Lawrence Arts Fund, which has funded more than $1 million toward arts education in Louisville. In November, the fund provided $100,000 in grants, including $50,000 for the city's renowned Actors Theatre of Louisville.\n\nHOLLYWOOD EQUITY\n\nIt was the hack heard round the world in 2014, and for Lawrence, Sony emails revealed that she and Amy Adams were paid less than their male co-stars in American Hustle. After that, she negotiated hard with the studio for her $20 million payday (more than Chris Pratt's) in Passengers. In 2015, she became a leading voice on the issue of pay parity when she shared her experience in an essay — \"Why Do I Make Less Than My Male Co-Stars?\" — for Lena Dunham's Lenny Letter. \"When the Sony hack happened and I found out how much less I was being paid than the lucky people with dicks, I didn't get mad at Sony,\" Lawrence wrote. \"I got mad at myself.\"\n\nThis story first appeared in the 2017 Women in Entertainment Power 100 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://cdn1.thr.com/sites/default/files/2017/12/jennifer_lawrence_-_photographed_by_miller_mobley_-_splash_2017.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://www.hollywoodreporter.com/sites/default/files/custom/Annie/THR_woe-embeds2x.png", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/12/jennifer_lawrence_-_photographed_by_miller_mobley_-_splash_2017.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/12/jennifer_lawrence_-_photographed_by_miller_mobley_-_splash_2017.jpg", "keywords": [], "authors": ["Oprah Winfrey"], "canonical_link": "https://www.hollywoodreporter.com/features/jennifer-lawrence-interview-by-oprah-winfrey-1064576", "title": "The Jennifer Lawrence Interview, by Oprah Winfrey", "meta_data": {"viewport": "width=device-width", "description": "The Oscar-winning actress talks to the legendary interviewer about everything from pay equity (\"I had it up to my f—ing eyeballs\") to her dealings with Harvey (\"He had only been nice to me — except for when he wasn't\") to where she sees herself in 20 years: \"I won't have periods anymore, that's a bonus.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/features/jennifer-lawrence-interview-by-oprah-winfrey-1064576", "domain": "https://www.hollywoodreporter.com/", "title": "The Jennifer Lawrence Interview, by Oprah Winfrey", "description": "The Oscar-winning actress talks to the legendary interviewer about everything from pay equity (\"I had it up to my f—ing eyeballs\") to her dealings with Harvey (\"He had only been nice to me — except for when he wasn't\") to where she sees herself in 20 years: \"I won't have periods anymore, that's a bonus.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/12/jennifer_lawrence_-_photographed_by_miller_mobley_-_splash_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "The Jennifer Lawrence Interview, by Oprah Winfrey", "description": "The Oscar-winning actress talks to the legendary interviewer about everything from pay equity (\"I had it up to my f—ing eyeballs\") to her dealings with Harvey (\"He had only been nice to me — except for when he wasn't\") to where she sees herself in 20 years: \"I won't have periods anymore, that's a bonus.\"", "url": "https://www.hollywoodreporter.com/features/jennifer-lawrence-interview-by-oprah-winfrey-1064576", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/12/jennifer_lawrence_-_photographed_by_miller_mobley_-_splash_2017.jpg", "width": 1500, "height": 844, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "The Jennifer Lawrence Interview, by Oprah Winfrey", "sailthru.description": "The Oscar-winning actress talks to the legendary interviewer about everything from pay equity (\"I had it up to my f—ing eyeballs\") to her dealings with Harvey (\"He had only been nice to me — except for when he wasn't\") to where she sees herself in 20 years: \"I won't have periods anymore, that's a bonus.\"", "sailthru.author": "Oprah Winfrey", "sailthru.vertical": "Movies", "sailthru.date": "2017-12-06 06:00:00", "sailthru.tags": "Movies,Oprah Winfrey,Jennifer Lawrence,Women in Entertainment,Women in Entertainment 2017"}, "movies": [], "publish_date": 1512511200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}