{"url": "https://en.wikipedia.org/wiki/Pretty_Little_Liars_(season_7)", "text": "The seventh and final season of the American mystery drama television series Pretty Little Liars, based on the books of the same name by Sara Shepard, was renewed on June 10, 2014 for two additional seasons, making the show Freeform's longest running original series.[1]\n\nThe season consisted of 20 episodes, in which ten episodes aired in the summer of 2016, with the remaining ten episodes aired from April 2017.[2][3][4] The season premiered on June 21, 2016[5] and ended on June 27, 2017 on Freeform.\n\nProduction and filming began in the end of March 2016, which was confirmed by showrunner I. Marlene King.[6] The season premiere was written by I. Marlene King and directed by Ron Lagomarsino.[7] King revealed the title of the premiere on Twitter on March 17, 2016.[8] On August 29, 2016, it was confirmed that this would be the final season of the series.[9]\n\nOverview [ edit ]\n\nA.D. gives the Liars 24 hours to find Charlotte's real killer or Hanna dies. While discussing possible suspects, the girls' suspicion fell on Alison. Aria suspects the red jacket blonde she saw entering the church was Alison. Emily finds the jacket in Alison's things and Caleb gives it to A.D. Meanwhile, Hanna manages to escape. Elliot's true motive is later revealed to Alison; she managed to use his phone to alert the girls to her location when he takes her out in his car one night. She jumps out of the car and he gives chase but Hanna accidentally runs him over and they bury him in the woods.\n\nThe Liars find out Jenna is calling Elliot as \"Archer\" on his burner phone. Mona then traces most of the sent messages from a secret apartment where they find out his real name is \"Archer Dunhill\". Toby discovers this and gets the cops to release Alison who reveals that she was the red jacket blonde but only tried to comfort Charlotte. Jenna befriends Sara and Noel begins helping them. Emily confronts Jenna and Sara. Jenna reveals that she became Charlotte's friend after feeling sympathy for her in Welby and helped Archer fake his identity to be with Charlotte. Sara reveals that they are all looking for the same thing but is killed soon after. A.D. tricks Hanna into believing Archer is alive and records her digging up his grave.\n\nThe Liars find videos in Noel's cabin of him torturing them in the dollhouse. Hanna kidnaps Noel after negotiating with him doesn't work and films an interrogation video. He manages to escape and lures the Liars to an abandoned blind school. They leave the dollhouse videos on a table and someone takes them but Noel and Jenna attempt to murder them. In the confrontation, Noel is accidentally killed, and Spencer is shot by A.D., while Jenna corners Spencer. Jenna prepares to kill Spencer, but is knocked out by Mary. She then reveals that Spencer is her second child. A.D. saves Jenna who asks if they shot Spencer.\n\nOne week later, Spencer has recovered and A.D. sends Jenna to confess to the cops that Noel wanted money Charlotte left Jenna for another eye surgery, killed Sara and tried to kill Jenna in the blind school. Peter returns and reveals that Mary is the one who killed Jessica. Hanna and Spencer follow the trail of a private investigator he hired to find Mary and bump into Ted who reveals he has been hiding her as she is his college fling with whom he conceived Charles. Mary reveals to Spencer that Peter and Jessica were planning to kill her, thus she used his pills to kill Jessica. A.D. then uses Emily's stolen eggs to impregnate Alison, as a way to further torture the liars. Meanwhile, A.D. hires Sydney Driscoll as their helper and she fakes being A.D. to recruit Aria into joining the A.D. team. Aria is forced into playing and becomes A.D.'s new helper, destroying Emison's baby nursery and leaving an \"A\" message in Spencer's house, until the Liars catch her in the act and she defects. Mona, who is becoming addicted to the A-game again, reveals that she tried to scare Charlotte into not resuming the A-game but Charlotte attacked her and she killed her in self-defense. Mary confesses to Rollins and Jessica's murder. A.D. ends the game as they have finally learned that Mona was Charlotte's killer.\n\nOne year later, Mary escapes from prison and Mona is released from Welby but rejoins the A-Team and is sent to kidnap Spencer, who comes face-to-face with A.D. – Alex Drake, her twin sister. Mary reveals she sold Alex to a London family to get out of Radley. Alex ran away and met Wren who revealed everything about Spencer to her and introduced her to Charlotte who left her everything. She became A.D. to use the Liars to find Charlotte's killer and killed Wren as he always saw her as Alex while she wanted to become Spencer to have her \"perfect life\". She explains that Sara was looking for Charlotte's false treasure in the Radley which was actually the secret file and Jenna recruited Noel to look for \"Charlotte's sister\". Jenna uses her enhanced sense of smell to figure out \"Spencer's not Spencer\" and alerts Toby who tells the others. Mona reveals to them that Wren was going to kill her but she convinced him she could get Mary out. The Liars, Toby, Mona, and Caleb come face to face with Alex and Spencer as they cannot tell them apart, until Toby makes the distinction by asking what Spencer's favorite poem from a book she gave him. Mona tracked A.D.'s location has a cop arrest her. The Liars then say goodbye to one another as Aria leaves for her honeymoon with Ezra. Mona moves to Paris and the \"cop\" is revealed to be her boyfriend who has imprisoned Alex and Mary in her basement dollhouse. In the finale moment, a new set of liars are awakened to find their leader, Addison, has just gone missing.\n\nCast [ edit ]\n\nNotes\n\n^[a] Unlike the other series regulars, Laura Leighton is only credited in the episodes she appears in.\n\nUnlike the other series regulars, Laura Leighton is only credited in the episodes she appears in. ^[b] Torrey DeVitto returns as the disguised version of Melissa Hastings created by Mona Vanderwaal in the episode \"Till Death Do Us Part\".\n\nEpisodes [ edit ]\n\nSpecials [ edit ]\n\nSpecial\n\nno. Title Narrator(s) Aired after Original air date U.S viewers\n\n(million) 1 \"A-List Wrap Party\" I. Marlene King &\n\nThe Cast of Pretty Little Liars \"Till Death Do Us Part\" June 27, 2017 ( ) 0.62[29] Showrunner I. Marlene King and the Liars sit down for an hour long unbarred and uncensored tell-all after series finale to discuss all of the series’ tightly held secrets, behind-the-scenes insights, and top moments.[30][31]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe seventh season was ordered with the sixth season on June 10, 2014, right before the fifth-season premiere aired, which made the show as ABC Family's longest running original series, surpassing The Secret Life of the American Teenager, which was ABC Family's previous longest running original series.[1] The season will consist of 20 episodes, in which ten episodes will air in the summer of 2016, with the remaining ten episodes beginning to air in April 2017.[2][3] Charlie Craig, who served as writer/consulting producer on the second season, will return for the seventh season as executive producer/co-showrunner.[32] I. Marlene King revealed the title of the premiere \"Tick-Tock, Bitches\" on Twitter.[8] Variety announced that season premiere would air on June 21, 2016, the latest for a season premiere in the show's history.[5] Additionally, series star Troian Bellisario would make her directorial debut this season. Bellisario is set to direct the fifteenth episode of the season.[33][34] A promo was released on May 12, 2016.[35] Freeform released a promotional poster for the season, on June 7, 2016.[36] After the season premiere, Freeform released another poster which included Ashley Benson.[37] On August 29, 2016, I. Marlene King with the principal cast of the show announced that Pretty Little Liars would end after the seventh season. King also announced that the show would start airing the second half of the season later than usual, in April 2017 and that the series finale would be a two-hour episode event.[4] It was reported on October 26, 2016, that a tell-all special will air after the series finale \"Till Death Do Us Part\", where the main cast and showrunner I. Marlene King talked about the show and behind-the-scenes exclusive.[30][31]\n\nFinal season speculation [ edit ]\n\nThe seventh season had been speculated by both fans and the cast and crew of the show to being the final season of Pretty Little Liars ever since the show was renewed for two additional seasons.[1] In an interview with BuzzFeed, Troian Bellisario said “This is the beginning of the end. But the best part about these last two years is that, because it’s the beginning of the end, we can actually start telling the story I think we’ve been waiting to tell for a long time.\"[3] Regarding the show's ending, Lucy Hale said to E! News that \"Seven seasons will definitely end the show.\"[38][39] Showrunner I. Marlene King commented on these rumors to TVLine as she said \"We have enough story to take us to the end of Season 7, and we’re going to let the fans tell us if they’re ready to say goodbye to this world and these characters.\"[40] She confirmed to being open for an eighth season and a movie and a new book.[41]\n\nIn an interview with Variety regarding the five-year time-jump from the sixth season, King said \"I think that this story when we're back will end next year at the end of Season 7\". She later took to Twitter where she confirmed that the current storyline that began in the second half of the sixth season would end after the seventh season, but would not necessarily mean that the show would end after the seventh season.[42][43] Hale said on The Late Late Show with James Corden that the show was ending after the seventh season.[44] Bellisario's fiancé Patrick J. Adams said in June 2016, that the show was ending in 2017, as the couple has decided to get married after the show ends.[45] Freeform gave out a statement not long after saying that \"There has been no official decision made for PLL beyond a season 7.\"[46] It was announced on August 29, 2016, the day before the mid-season finale would air, that Pretty Little Liars will end after the seventh season.[4]\n\nFilming [ edit ]\n\nProduction began on February 1, 2016, when King announced on Twitter that the writers were in full swing brainstorming and mapping the seventh season.[47][48] Production and filming began in the end of March 2016 and officially wrapped up in October 2016.[6][49]\n\nCasting [ edit ]\n\nThe seventh season has nine roles receiving star billing, with eight of them returning from the previous season, six of which was part of the original cast from the first season. The season saw the four protagonists of the series continue the roles as they try to take down the new 'A'. Troian Bellisario played Spencer Hastings, who has relationship problems with Caleb, while Ashley Benson played Hanna Marin, who was kidnapped at the end of last season. Lucy Hale continued her role as Aria Montgomery as she is set in a love triangle with Ezra and her boyfriend Liam. Shay Mitchell portrayed Emily Fields who begins to rekindle her relationship with Alison. Sasha Pieterse continued to portray Alison DiLaurentis as Alison struggles with being in a psych-ward. Janel Parrish returned as Mona Vanderwaal who seems to be finally on their side. Tyler Blackburn continues to play Caleb Rivers and Ian Harding also continued his role as Ezra Fitz. Andrea Parker was added as a series regular, playing Jessica DiLaurentis' twin sister Mary Drake.\n\nAfter the sixth-season finale, it was announced that Andrea Parker would return to the show as Mary Drake, Jessica DiLaurentis' identical twin sister and biological mother to Charlotte DiLaurentis.[50] TVLine later confirmed that Parker was added as a series regular for the upcoming season.[51] Deadline reported on May 10, 2016, that actor Nicholas Gonzalez was cast as Detective Vic Furey, a character who will oversee the Rosewood Police Department.[52] The character was later renamed Det. Marco Furey.[53] Tammin Sursok announced that she will return to the show as Jenna Marshall after last appearing in the fifth-season episode \"How the 'A' Stole Christmas\".[54] On June 2, 2016, Variety reported that Brant Daugherty would be returning as Noel Kahn; Brant has not appeared on the show since the beginning of the fifth season.[55]\n\nOn June 10, 2016, The Hollywood Reporter reported that Lindsey Shaw would be returning as Paige McCullers after leaving in the fifth season mid-season premiere.[56] The actress playing Sydney Driscoll, Chloe Bridges, posted an image on social media, confirming that she would return to the show after last appearing in the Christmas special episode.[57] On July 28, 2016, The Hollywood Reporter reported that Shane Coffey would be returning as Holden Strauss; Shane has not appeared on the show since the beginning of the third season.[58] It was announced on August 8, 2016, that Ava Allan will appear on the show, and will first appear in the second half of the season as Addison.[59] On August 17, 2016, TVLine reported that Edward Kerr would be returning to the show as Pastor Ted Wilson in the second half of the season. Kerr had not been on the show since towards the end of the fifth season.[60]\n\nReception [ edit ]\n\nLive + SD Ratings [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Episode Air date Time slot (EST) Rating/Share (18–49) Viewers (m) Rank (18–49) 141 1 \"Tick-Tock, Bitches\" June 21, 2016 ( ) Tuesdays\n\n8:00 p.m. 0.7[10] 1.43[10] 11[10] 142 2 \"Bedlam\" June 28, 2016 ( ) 0.6[11] 1.24[11] 15[11] 143 3 \"The Talented Mr. Rollins\" July 5, 2016 ( ) 0.5[12] 1.12[12] 12[12] 144 4 \"Hit and Run, Run, Run\" July 12, 2016 ( ) 0.6[13] 1.26[13] 7[13] 145 5 \"Along Comes Mary\" July 19, 2016 ( ) 0.6[14] 1.17[14] 15[14] 146 6 \"Wanted: Dead or Alive\" August 2, 2016 ( ) 0.5[15] 1.10[15] 12[15] 147 7 \"Original G'A'ngsters\" August 9, 2016 ( ) 0.6[16] 1.16[16] 9[16] 148 8 \"Exes and OMGs\" August 16, 2016 ( ) 0.6[17] 1.11[17] 14[17] 149 9 \"The Wrath of Kahn\" August 23, 2016 ( ) 0.5[18] 1.09[18] 16[18] 150 10 \"The DArkest Knight\" August 30, 2016 ( ) 0.7[19] 1.33[19] 11[19] 151 11 \"Playtime\" April 18, 2017 ( ) 0.7[20] 1.33[20] 4[20] 152 12 \"These Boots Were Made for Stalking\" April 25, 2017 ( ) 0.5[21] 0.92[21] 10[21] 153 13 \"Hold Your Piece\" May 2, 2017 ( ) 0.4[22] 0.86[22] 11[22] 154 14 \"Power Play\" May 9, 2017 ( ) 0.5[23] 0.91[23] 9[23] 155 15 \"In the Eye Abides the Heart\" May 23, 2017 ( ) 0.4[24] 0.85[24] 11[24] 156 16 \"The Glove That Rocks the Cradle\" May 30, 2017 ( ) 0.4[25] 0.90[25] 8[25] 157 17 \"Driving Miss Crazy\" June 6, 2017 ( ) 0.5[26] 0.97[26] 2[26] 158 18 \"Choose or Lose\" June 13, 2017 ( ) 0.5[27] 0.96[27] 7[27] 159 19 \"Farewell, My Lovely\" June 20, 2017 ( ) 0.4[28] 0.83[28] 9[28] 160 20 \"Till Death Do Us Part\" June 27, 2017 ( ) 0.7[29] 1.41[29] 2[29] 721 \"A-List Wrap Party\" June 27, 2017 ( ) Tuesday\n\n10:00 p.m. 0.3[29] 0.62[29] 14[29]\n\nLive + 7 Day (DVR) ratings [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Episode Air date Time slot (EST) 18–49 rating increase Viewers\n\n(millions) increase Total 18–49 Total viewers\n\n(millions) Ref. 141 1 \"Tick-Tok, Bitches\" June 21, 2016 ( ) Tuesdays\n\n8:00 p.m. 0.5 1.05 1.2 2.48 [61] 142 2 \"Bedlam\" June 28, 2016 ( ) 0.4 0.82 1.0 2.05 [62] 143 3 \"The Talented Mr. Rollins\" July 5, 2016 ( ) 0.4 0.74 0.9 1.85 [63] 144 4 \"Hit and Run, Run, Run\" July 12, 2016 ( ) 0.4 0.76 1.0 2.01 [64] 145 5 \"Along Comes Mary\" July 19, 2016 ( ) N/A N/A N/A N/A N/A 146 6 \"Wanted: Dead or Alive\" August 2, 2016 ( ) 0.5 0.84 1.0 1.94 [65] 147 7 \"Original G'A'ngsters\" August 9, 2016 ( ) 0.5 0.95 1.1 2.11 [66] 148 8 \"Exes and OMGs\" August 16, 2016 ( ) 0.5 0.86 1.1 1.97 [67] 149 9 \"The Wrath of Kahn\" August 23, 2016 ( ) 0.5 0.71 0.9 1.80 [68] 150 10 \"The DArkest Knight\" August 30, 2016 ( ) 0.4 0.77 1.1 2.10 [68] 151 11 \"Playtime\" April 18, 2017 ( ) 0.4 0.85 1.1 2.19 [69] 152 12 \"These Boots Were Made for Stalking\" April 25, 2017 ( ) N/A N/A N/A N/A N/A 153 13 \"Hold Your Piece\" May 2, 2017 ( ) N/A N/A N/A N/A N/A 154 14 \"Power Play\" May 9, 2017 ( ) 0.4 0.85 0.9 1.77 [70] 155 15 \"In the Eye Abides the Heart\" May 23, 2017 ( ) 0.5 0.98 0.9 1.83 [71] 156 16 \"The Glove That Rocks the Cradle\" May 30, 2017 ( ) 0.5 0.91 0.9 1.82 [72] 157 17 \"Driving Miss Crazy\" June 6, 2017 ( ) 0.5 0.93 1.0 1.90 [73] 158 18 \"Choose or Lose\" June 13, 2017 ( ) 0.4 0.93 0.9 1.90 [74] 159 19 \"Farewell, My Lovely\" June 20, 2017 ( ) 0.5 0.79 0.9 1.62 [75] 160 20 \"Till Death Do Us Part\" June 27, 2017 ( ) N/A N/A N/A N/A N/A", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fb/Final_season_DVD_Cover_art.jpg/220px-Final_season_DVD_Cover_art.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/f/fb/Final_season_DVD_Cover_art.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/fb/Final_season_DVD_Cover_art.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Pretty_Little_Liars_(season_7)", "title": "Pretty Little Liars (season 7)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/f/fb/Final_season_DVD_Cover_art.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}