{"url": "https://www.complex.com/pop-culture/2017/07/newlyweds-jessica-simpson-nick-lachey", "text": "For most of their careers, Nick Lachey and Jessica Simpson were third-tier pop stars. Simpson was always the bronze medal to Christina Aguilera’s silver and Britney Spears’s gold. Likewise, Lachey and his boy band, 98 Degrees, were consistently afterthoughts to the insanely popular Backstreet Boys and NSYNC. But thanks to a little show called Newlyweds: Nick & Jessica in 2003, MTV catapulted these two into household names. Simpson’s dumb blonde act (at least, we’re pretty sure it was an act) gave us so many gems that the couple forever secured their place in pop culture, even though they split only 3 years later in 2005. To get an idea of what went on behind the scenes, we spoke to Sue Kolinsky, who served as producer on the show for all three seasons of Newlyweds. Kolinsky, who lives in Los Angeles and still works in the television industry, is a three-time Emmy nominated producer. She has popular reality shows such Top Chef, Last Comic Standing and The Osbournes on her resume. Kolinsky spilled on the show's surprising success, Jessica's dumb blonde \"act\" and the tension between the couple in the last season.\n\nWere you fans of Nick and/or Jessica before production started?\n\nI had no idea who Jessica was.\n\nSo how did you end up working on the show?\n\nA group of us had worked with MTV on The Osbournes, and then two shows came up, and we had a choice between Rich Girls with Tommy Hilfiger's daughter or Newlyweds. I just chose Newlyweds because it sounded fun to be inside the world of somebody's brand new marriage. As soon as we started looking at the footage and I saw the \"Is this chicken or fish?\" [scene], I knew it was going to be a really fun ride.\n\nDid you suspect the show was going to be as successful as it turned out?\n\nWith the success of The Osbournes, we knew that this would probably be successful just based on the nature of the show. It was a whole new genre. When it comes to reality tv, back then it was at its purest form. Plus, [Nick & Jessica] were perfect because they were polar opposites, they were beautiful, and without even realizing it, they were very funny.\n\nWhat’s your take on people who said Jessica was just putting on a “dumb blonde” act?\n\nThere were times when we were like, \"Hm, does she really not know what this means?\" I truly believe the whole 'chicken & fish' situation was accurate. She really did not know. I remember there was a scene where there was a dead mouse by their pool and it had been dead for a while. Nick said, \"it's in rigor mortis\" and Jessica said, \"Riga-what?\" I truly believe she didn't know what that meant.\n\nDid you ever interact with Nick and Jessica personally?\n\nI would go out into the field occasionally and go to the shoots. They were nice. Nick was a little more accessible than Jessica, but she was very sweet and it was fun hanging out with them.\n\nThey split up soon after the last season aired. What was it like to be on set at that time?\n\nYou could feel there was tension between the two of them. They were very different people. He was a blue collar guy—he did a lot of things himself, like he and his brother would build things. He was frugal, and she had excessive taste. In the end they weren't suited for each other. The only thing they really had in common was their music. She was really young; I think he's seven years older than her. He wanted a family, and her father thought maybe she was too young. Her father was very involved in her life.\n\nDid you have any interaction with Joe Simpson?\n\nThe first season, I didn’t [interact with] him, really. But with the popularity of the show, he was given an executive producer credit and he did get a little more involved. He had a little more say in what went in and out of the episode. Not a tremendous amount.\n\nDo you still keep in touch with anyone from the Newlyweds set?\n\nOh yes, I've forged amazing friendships just from that whole experience. We have reunions a lot of the time—we're very close. It was a really special time for all of us. We joked about the days when we'd go to a club and there wouldn't be any seats and you could tell [the hostess] \"we work on The Osbournes and they'd let us in.\n\nThis interview has been condensed for clarity.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=6685975&cv=2.0&cj=1", "https://images.complex.com/complex/images/c_fill,dpr_auto,f_auto,q_90,w_1400/fl_lossy,pg_1/ibp5hzfsy21vi9z1esln/jessica-simpson-nick-lachey", "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/ibp5hzfsy21vi9z1esln/jessica-simpson-nick-lachey"], "top_img": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/ibp5hzfsy21vi9z1esln/jessica-simpson-nick-lachey", "keywords": [], "authors": ["Lauren Zupkus"], "canonical_link": "https://www.complex.com/pop-culture/2017/07/newlyweds-jessica-simpson-nick-lachey", "title": "'Newlyweds: Nick & Jessica' Was Less Scripted Than You Thought It Was", "meta_data": {"google-site-verification": "ICK39wBGvCQQMHpEUykVHWF8Ox_0MME-_qxe6ixFUik", "theme-color": "#000000", "description": "Former 'Newlyweds' producer Sue Kolinsky explains that Jessica's \"dumb blonde act\" wasn't an act.", "og": {"type": "website", "title": "'Newlyweds: Nick & Jessica' Was Less Scripted Than You Thought It Was", "description": "Former 'Newlyweds' producer Sue Kolinsky explains that Jessica's \"dumb blonde act\" wasn't an act.", "url": "https://www.complex.com/pop-culture/2017/07/newlyweds-jessica-simpson-nick-lachey", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/ibp5hzfsy21vi9z1esln/jessica-simpson-nick-lachey", "site_name": "Complex"}, "fb": {"app_id": 310521533114641, "pages": 117696581735620}, "twitter": {"card": "summary_large_image", "title": "'Newlyweds: Nick & Jessica' Was Less Scripted Than You Thought It Was", "description": "Former 'Newlyweds' producer Sue Kolinsky explains that Jessica's \"dumb blonde act\" wasn't an act.", "url": "https://www.complex.com/pop-culture/2017/07/newlyweds-jessica-simpson-nick-lachey", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,h_300,q_auto,w_600/fl_lossy,pg_1/ibp5hzfsy21vi9z1esln/jessica-simpson-nick-lachey", "site": {"id": 13049362}}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.complex.com", "summary": ""}