{"url": "https://en.wikipedia.org/wiki/John_Laurinaitis", "text": "John Hodger Laurinaitis (born July 31, 1962),[1][2][3] also known as Johnny Ace, is an American senior producer and retired professional wrestler, currently employed by WWE.\n\nHe has wrestled for such promotions as World Championship Wrestling (WCW), All Japan Pro Wrestling (AJPW) and WWE.[4] He is the brother of Joe (Road Warrior Animal; one half of the former wrestling tag team The Road Warriors) and Marcus, and is also the uncle of James Laurinaitis, former National Football League player. In WWE, Laurinaitis worked in the talent relations office for eight years, and as occasional wrestler from 2011 until 2012. After his on screen firing, he stepped down from his corporate backstage role to being a producer. Prior to joining WWE, Laurinaitis worked as an executive for WCW.\n\nProfessional wrestling career [ edit ]\n\nNational Wrestling Alliance/World Championship Wrestling (1986–1990) [ edit ]\n\nJohn Laurinaitis started wrestling in 1986 as Johnny Ace.[4] At first, while wrestling in Florida Championship Wrestling, Ace frequently teamed with his brother The Terminator. Later, when he wrestled for NWA's Jim Crockett Promotions he formed a tag team with Shane Douglas called \"The Dynamic Dudes\".[6] They were managed by Jim Cornette until Cornette turned on them for Bobby Eaton and Stan Lane's version of The Midnight Express. Prior to entering the competition as one of The Dynamic Dudes at the NWA, he appeared as a flagbearer for the team of The Sheepherders. In his last televised WCW match, Ace lost to Mean Mark Callous, later known as The Undertaker, at Capital Combat on May 19, 1990.\n\nAll Japan Pro Wrestling (1988–2000) [ edit ]\n\nAs All Japan Pro Wrestling was cutting its ties with the NWA in 1990, Laurinaitis chose to stay in it, thus becoming a permanent foreign fixture on the roster. In AJPW, he found a lot of success, teaming with Kenta Kobashi, \"Dr. Death\" Steve Williams and Bart Gunn.\n\nLaurinaitis enjoyed significant championship success and acclaim during his tenure, becoming a two-time All Asia Tag Team Champion, a four-time World Tag Team Champion, and the winner of the New Year's Heavyweight Battle Royal on January 2, 1991 at Korakuen Hall. He won two \"5 Star Match\" awards and one \"Match of the Year\" award from the Wrestling Observer, and was ranked #77 in Pro Wrestling Illustrated's (PWI) top 500 wrestlers for 1997. On February 28, 1998, Laurinaitis would reach the highest point of his singles career as he challenged Mitsuharu Misawa for the Triple Crown Heavyweight Championship. It would be Laurinaitis' only shot at those three prestigious belts. Following his retirement in 2000, he was placed #203 in PWI's top 500 all time rankings.\n\nWorld Championship Wrestling (2000–2001) [ edit ]\n\nLaurinaitis retired from the ring in 2000 after the split between All Japan Pro Wrestling and Pro Wrestling Noah. He soon returned to World Championship Wrestling where he replaced Vince Russo as head booker. Laurinaitis was responsible for booking the highly acclaimed one-night single elimination tournament held for the WCW United States Heavyweight Championship that was won by the debuting Lance Storm.\n\nWorld Wrestling Federation / Entertainment / WWE [ edit ]\n\nBackstage roles and Senior Vice President of Talent Operations (2001–2012) [ edit ]\n\nLaurinaitis was hired in as a road agent after WWF's acquisition of certain assets of WCW in March 2001 and in June on the same year, Laurinaitis was promoted to Director of Talent Relations.[7] In June 2004, Laurinaitis replaced Jim Ross as Vice President of Talent Relations, then being promoted to Senior Vice President in February 2007[7] and finally to Executive Vice President in March 2009. However, when Stephanie McMahon took over Talent Relations and handed over the reins to Paul Levesque, Laurinaitis moved down from his executive duties to being Senior Vice President of Talent Operations.[8] Laurinaitis's tenure in this role has received criticism from those who have worked for him, including Jim Cornette who, in his interviews with Kayfabe Commentaries, described how Laurinaitis failed to work in the same capacity with Ohio Valley Wrestling (WWE's developmental territory) as Ross did, often failing to warn the promotion when wrestlers OVW were using at the time were going to be called up to the main roster or when wrestlers from the main roster were set to appear for OVW but never did. Eventually WWE would end their relationship with OVW.[9]\n\nFollowing his tenure as an on-screen performer in 2012, Laurinaitis was relieved of his backstage executive duties and returned to his original role as a road agent.[10]\n\nOn-air authority figure (2011–2012) [ edit ]\n\nOn the June 27, 2011 episode of Raw, Laurinaitis was described by CM Punk during his infamous 'pipe bomb' promo as a \"glad-handing, nonsensical, douchebag yes-man\" who would \"tell Vince McMahon everything he wants to hear\".[11] Laurinaitis subsequently made an appearance alongside McMahon as a corporate stooge during the main event of the Money in the Bank pay-per-view the following month. At the climax of the WWE Championship match, under McMahon's orders, Laurinaitis tried to duplicate the Montreal Screwjob, but defending WWE Champion John Cena then proceeded to knock Laurinaitis out, not wanting to win the match that way. This interference allowed CM Punk to win the match and the championship. The next night on Raw, Laurinaitis appeared alongside McMahon as McMahon announced an 8-man tournament to decide a new WWE Champion following Punk's departure from the company. On the August 1 episode of Raw, Laurinaitis interrupted Triple H, telling him to strip Cena of his WWE Championship, which led Cena to interrupt him and threaten to hit him again before Laurinaitis fled the ring. The following week on Raw, Laurinaitis helped Triple H officiate the contract signing between CM Punk and John Cena for their match at SummerSlam. After signing the contract, Cena flipped the table over and moved to go face to face with Punk, but was stopped by Laurinaitis. As Laurinaitis talked to Cena, Punk kicked Laurinaitis in the back of the head, causing Cena to accidentally hit Triple H instead of Punk.\n\nFollowing Summerslam, Laurinaitis began to make regular appearances on WWE programming as part of an angle in which Triple H attempted to find out who had sent a text message to the returning Kevin Nash telling him to attack CM Punk after his victory at Summerslam, causing him to lose the WWE Championship to Alberto Del Rio who cashed in his Money in the Bank contract immediately afterwards. On the August 15 episode of Raw, Laurinaitis asked Nash for a private meeting in his office, and on the September 5 episode of Raw, after Triple H fired Nash, Laurinaitis was seen entering Nash's limo with him, leaving the arena. During this period Laurinaitis was also regularly shown sending text messages backstage and at ringside. After Nash claimed that he had sent the text message to himself, it was implied that Laurinaitis was working to try and undermine Triple H in his new role as Chief Operating Officer, presumably because he wanted the job for himself. At Night of Champions, Laurinaitis interfered in the main event in an attempt to have Triple H removed from power but was stopped by The Miz and R-Truth, who attacked both Triple H and CM Punk, believing there to be a conspiracy. Nash also interfered in the match after Laurinaitis sent a text at ringside.\n\nOn the September 26 episode of Raw, Laurinaitis acquired David Otunga, a Harvard Law School graduate, as his legal counsel and, as part of his kayfabe duties as Executive Vice President of Talent Relations, assigned Otunga to assemble Superstars that were disgruntled with Triple H's actions as COO. On that week's edition of SmackDown, Laurinaitis and Otunga sat down with Christian, Cody Rhodes, Dolph Ziggler, Jack Swagger and Vickie Guerrero to discuss the matter.\n\nOn the October 10 edition of Raw, following a kayfabe strike by members of the WWE roster as a result of Triple H's management, Vince McMahon introduced Laurinaitis as the new Interim General Manager of Raw.[12] That same night, Laurinaitis fired Jim Ross and reinstated The Miz and R-Truth, who had been suspended following repeated attacks. After a few weeks of impartiality during which he pledged that he would listen to the WWE fans using his slogan of \"People Power\", Laurinaitis began showing bias against WWE Champion CM Punk, who had repeatedly criticized Laurinaitis and questioned his integrity over the past few months.[13] On the December 26 edition of Raw, Laurinaitis placed Punk in a gauntlet match against three opponents; whoever pinned Punk would earn a shot at the WWE Championship at the Royal Rumble. Punk agreed to the match under the condition that if he beat all three, then he would receive a match against Laurinaitis himself afterwards. During the match, Laurinaitis distracted Punk, allowing Dolph Ziggler to pin Punk and earn a title shot.[14] The following week on Raw, Laurinaitis distracted Punk once again, causing him to be counted-out in his title match against Ziggler, thus retaining the championship.[15] Laurinaitis then scheduled a WWE Championship match between Punk and Ziggler at the Royal Rumble, in which he named himself guest referee. Laurinaitis continued to cause Punk to lose to Ziggler throughout January[16][17] which ultimately led to Punk attacking Laurinaitis in retaliation, claiming that he was abusing his power.[17] Laurinaitis began to declare himself as the soon to be permanent General Manager. In response to this, the Board of Directors ordered that his position as Interim General Manager would be taken under review by Chief Operating Officer Triple H. At the Royal Rumble, Laurinaitis brought in another official and Punk defeated Ziggler. On January 30 edition of Raw, Laurinaitis was set to have a performance review by Triple H. During the review, Triple H degraded Laurinaitis and his actions, but before the final decision he was interrupted by The Undertaker. The Board of Directors then decided on February 7, 2012 to retain Laurinaitis as Interim General Manager.[18]\n\nLaurinaitis subsequently began a feud with SmackDown general manager Theodore Long. The respective General Managers of Raw and SmackDown swapped places for one night only with Laurinaitis in charge of SmackDown for March 9, 2012 and Long in charge of Raw for March 5, 2012. On that week's edition of SmackDown, Laurinaitis wrestled his first match in eleven years (as well as his first for WWE), losing to Theodore Long in a singles match.[19] Laurinaitis continued his feud with Long until WrestleMania XXVIII, where both Long and Laurinaitis chose a team of six wrestlers to represent them, with the winning team earning General Manager control over both brands. Team Johnny defeated Team Teddy, resulting in Long losing his position as General Manager of SmackDown. On the April 6, 2012 edition of SmackDown, Laurinaitis forced Long to become his new assistant after threatening to discontinue Long's grandchildren's trust fund. On the April 23, 2012 episode of Raw, Laurinaitis appointed Eve Torres as Executive Administrator of Raw and SmackDown.\n\nFeud with John Cena (2012) [ edit ]\n\nOn the April 30, 2012 episode of Raw, Laurinaitis, with the aid of Tensai, attacked John Cena, before declaring himself as Cena's opponent at Over the Limit. On the May 14 episode of Raw, Laurinaitis publicly humiliated and fired Big Show from the WWE after Show disrespected him for constantly making fun of his voice. That same night, the Board of Directors sent Laurinaitis a letter stating that he would be fired if he lost the no disqualification match against Cena at Over the Limit. At the pay-per-view, Laurinaitis defeated Cena despite taking a heavy beating after Big Show interfered and attacked Cena. The following night on Raw, Laurinaitis, now using a power chair and crutches for mobility purposes, rehired Show after helping him win the match against Cena.\n\nOn the June 11, 2012 episode of Raw, Vince McMahon gave Laurinaitis a job evaluation. Before McMahon could fire Laurinaitis, Big Show hit the WMD on McMahon by accident. At No Way Out, Cena defeated Show in a Steel Cage match. After the match, McMahon fired Laurinaitis, followed by Cena hitting the Attitude Adjustment on Laurinaitis through a broadcast table. The next night on Raw, in his final show in charge, Laurinaitis booked himself in a 3-on-1 Handicap Match, teaming up with Big Show and David Otunga against Cena. During the match, both Show and Otunga walked out on Laurinaitis, which allowed Cena to hit Laurinaitis with three Attitude Adjustments before making him submit to the STF.\n\nSporadic appearances (2013–2018) [ edit ]\n\nOn the March 29, 2013 episode of SmackDown, Laurinaitis offered The Rock his services as manager for his match at WrestleMania 29 against John Cena. Rock responded by giving Laurinaitis a Spinebuster and a People's Elbow. Laurinaitis appeared at Survivor Series, alongside Los Matadores, R-Truth, Santino Marella and Fandango, and at the 2013 Slammy Awards, presenting the Rookie of the Year award to The Shield.\n\nOn SmackDown's 15th Anniversary Special on October 10, 2014, Laurinaitis formed a team to face Teddy Long's team to be determined as the greatest GM in SmackDown history. The match was won by Teddy Long's team. He appeared at the Slammy Awards in December and, on March 28, 2015 he inducted The Bushwhackers into the WWE Hall of Fame.\n\nPreceding the return of the brand split, Laurinaitis was one of several former authority figures to unsuccessfully apply for the general manager positions of either Raw or SmackDown. He made his appearance during the June 20, 2016 episode of Raw but was escorted off the stage by Shane McMahon.\n\nOn January 22, 2018, Laurinaitis was one of the guests that appeared on stage during the 25th Anniversary episode of Raw.[20]\n\nPersonal life [ edit ]\n\nLaurinaitis' brothers Joe, who is Animal of The Road Warriors, and Marcus were also professional wrestlers. He is also the uncle of James Laurinaitis, former linebacker for the St. Louis Rams and New Orleans Saints.\n\nOn September 3, 2015, Laurinaitis became engaged to Kathy Colace, who is the mother of the Bella Twins and the mother-in-law of former WWE champion Daniel Bryan.[21] The two were married in a private ceremony on March 24, 2016.[22]\n\nChampionships and accomplishments [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/0/07/John_Laurinaitis_Cut.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Punk_%26_Laurinaitis.jpg/220px-Punk_%26_Laurinaitis.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": ["On-Air Authority Figure"], "canonical_link": "https://en.wikipedia.org/wiki/John_Laurinaitis", "title": "John Laurinaitis", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}