{"url": "https://www.countryliving.com/life/entertainment/a19852939/tarek-el-moussa-new-house/", "text": "Tarek El Moussa is ready to show off his new bachelor pad! The Flip or Flop star purchased a new home this spring, right around the time the mansion he shared with ex-wife Christina El Moussa went on the market for $3 million (and sold within a month).\n\n\"It's so amazing to FINALLY have a home....a real home for me and my babies,\" Tarek, who split from Christina in 2016, captioned an Instagram photo of the page in People where his Costa Mesa, CA, house tour appeared. \"It's nice to have stability and call a place home after all these years. Brayden loves his race car themed room and Taylor loves her Mermaid room!!\"\n\nIt was love at first sight for the HGTV host, who wasn't actively looking for a new home, let alone one in that location, when he initially came across it. \"I was randomly driving down a street and saw this place and I knew it was the one!\" he shared on Instagram.\n\nClick through the photos below to see inside, pre-renovation.\n\n\"I walked in, and it had the absolute coolest bachelor-pad-meets-family-house vibes,\" he told People.\n\nHours later, he was putting in an offer, leaving him with an important lesson: \"If you want something go get it, go after it and never quit!\" he wrote on social media. \"This relates to life in general..if there is something you want take action!!! My ❤️❤️❤️ Babies finally get a home with daddy!!!\"\n\nThe purchase apparently came in under budget at $2.28 million, and though he loved it as-is, he couldn't resist the opportunity to make it his own. \"I did floor to ceiling wallpaper as an accent wall,\" he wrote in a sneak peek on Instagram, \"how cool is that!?\"\n\nThe 4-bedroom, 3.5-bathroom house looks completely different from the one he shared with Christina—although it too features a living room that opens up to a luxurious outdoor pool. And that kitchen! Simply swoonworthy.\n\n\n\nIn the current season of Flip or Flop, Tarek has been more involved in the design process than ever, and his new property gave him the perfect opportunity to flex those muscles once more, right down to the furnishings. \"I had nothing,\" Tarek told People. \"When I left, I left. So I got to design and build most of the furniture.\"\n\nThat includes an 8 ft.-by-8 ft. bed, but don't get any ideas: He's single right now and created the custom piece with cuddles with his kids in mind.\n\nTarek knows at least one of his neighbors: Christina now lives only two blocks away. \"I'm like, 'Get out of my neighborhood!'\" Tarek joked to E! after Christina, too, snatched up a home in Newport Beach, which she'll renovate as part of her new solo show, Christina on the Coast. The series will also focus on Christina's personal life; she has been dating boyfriend Ant Anstead for nine months.\n\nThe proximity could prove useful as the former couple continues to co-parent their two kids, Taylor and Brayden.\n\n\"I'm am [sic] so excited for my 'new beginnings' ... sometimes things are meant to be:),\" the celebrity realtor shared after purchasing the property.\n\n(h/t: People)", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-cancer-1527623975.jpg?crop=1.00xw:0.892xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/why-did-tarek-christina-el-moussa-divorce-1527025959.png?crop=1.00xw:0.758xh;0,0.106xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Taysha Murtaugh", "Lifestyle Editor", "Taysha Murtaugh Was The Lifestyle Editor At Countryliving.Com."], "canonical_link": "https://www.countryliving.com/life/entertainment/a19852939/tarek-el-moussa-new-house/", "title": "Tarek El Moussa New House Following Divorce From Christina", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Country Living", "title": "See Inside Tarek El Moussa's Bachelor Pad—Two Blocks From Ex Christina", "description": "\"It's nice to have stability and call a place home after all these years,\" the 'Flip or Flop' star said.", "url": "https://www.countryliving.com/life/entertainment/a19852939/tarek-el-moussa-new-house/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 165119423553230, "pages": 12013348247}, "article": {"publisher": "https://www.facebook.com/CountryLiving", "modified_time": "2018-08-03 02:18:08", "published_time": "2018-08-02 10:35:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CountryLiving", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "y2umrM2fg1eXvnoHVUyHzeVTDYfhwLzq_rWVXkg0Yhw", "title": "Tarek El Moussa New House Following Divorce From Christina - Inside 'Flip or Flop' Host's New Bachelor Pad​", "description": "Following his divorce from wife and costar Christina El Moussa, Flip or Flop host Tarek El Moussa has purchased a bachelor pad. See photos of Tarek El Moussa's new house, located only two blocks away from his ex, Christina.", "keywords": "tarek el moussa house, tarek el moussa bachelor pad, tarek and christina el moussa divorce, tarek el moussa real estate, tarek el moussa home", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=0.502xw:1.00xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Country Life,life,entertainment", "sailthru.date": "2018-08-02T22:35:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tarek-el-moussa-house-tour-1533248923.jpg?crop=0.502xw:1.00xh;0,0", "sailthru.socialtitle": "See Inside Tarek El Moussa's Bachelor Pad—Two Blocks From Ex Christina", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1533177300.0, "source": "https://www.countryliving.com", "summary": ""}