{"url": "https://www.bustle.com/p/bachelor-winter-games-adds-bibiana-lauren-g-to-the-cast-the-promo-is-already-a-lot-video-7914980", "text": "If you were heartbroken by Monday night's Bachelor (producer: Fallon Jethroe) elimination, you don't need to mourn for too long. ABC has just announced that two ladies from the current season who were, as you might say, \"gone too soon,\" will be on Bachelor Winter Games (supervising producer: Lindsay Liles), which airs in Feb. Yes, that's right: Bibiana and Lauren G. have joined the Winter Games cast, which already has a stacked list of Bachelor Nation members. While the whole cast of the Olympics-inspired new show offers reason enough for excitement, the truth is, Bibiana's return to Bachelor Nation might be the most exciting news of all.\n\nHer run on Season 22 was short — she only lasted three episodes — but impactful. In the third episode, Bibiana made a compelling case for why she should remain on TV. Even though Arie eliminated her, she tried to maneuver a one-on-one date with her love interest, which didn't quite go as planned. After setting up a couch and telescope outside in the driveway — the most romantic gesture ever, probably — the \"love trap,\" as you might call it, ended up hosting a romantic moment between Arie and Lauren B. INSTEAD. When Bibiana tried to break up their date at the spot she set up, Arie asked her for five more minutes with Lauren B. Ouch.\n\nAfter her elimination, Bibiana tearfully said that she wants \"everyone to know\" that she tried. Watching her do so, and cry the whole time while doing it, was highly entertaining for Bachelor fans. As a promo clip for Winter Games suggests, the new show will likely present more of the same — which is exactly what everyone wants.\n\nAs mentioned before, Bibiana won't be the only Season 22 contestant to return for Winter Games. Lauren G., who was eliminated at the end of the second episode, will also return. While Lauren G. didn't quite make as great of an impact as Bibi, her time on The Bachelor was undoubtedly cut too short. She didn't stand much of a chance, what with so many \"Laurens\" competing for Arie's affection. The fact that she'll get to have another chance at friendly competition is a reason for celebration. And the Winter Games competition already sounds pretty intense.\n\nThe new Bachelor spin-off, which will premiere on Feb. 13 has a loaded cast from all over the world. Yes, in the spirit of the 2018 Winter Olympics, the Bachelor's new show includes cast members both from the U.S. and other countries' Bachelor seasons. As for the U.S. contestants, fan-favorites like Ashley Iaconetti and Dean \"Deanie Baby\" Unglert will get another chance at love, all while competing in athletic challenges. It's gonna be intense.\n\nAs for the international contestants, Winter Games will host Ally Thompson of The Bachelor New Zealand, Nastassia Yaramchuk from Sweden, Japan's Yuki Kimura, Christian Rauch representing Switzerland and Germany, and many more. If you're not familiar with any of these people, fear not, as you'll probably soon know everything about them, from their athletic abilities to their hot-tub temperature preferences.\n\nThe Bachelor Winter Games promises to turn up the heat during the coldest months of the year, and it's probably going to be as thrilling, if not more, than the real Olympics. If there's anything that Bachelor Nation has taught everyone, it's that love is a game and the competition is fierce. Even though Bibiana and Lauren G. didn't have much luck with Arie, at least they get another shot at love and victory. And they'll have plenty more opportunity to cry on camera, which Bibiana will most definitely take advantage of. What a time to be alive.", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/1/16/6de09530-788b-492b-9aeb-37cea806c77f-484e3f8c-499f-4736-a761-458696186451-screen-shot-2018-01-16-at-104300-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/1/16/6de09530-788b-492b-9aeb-37cea806c77f-484e3f8c-499f-4736-a761-458696186451-screen-shot-2018-01-16-at-104300-am.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/cbae4fb9-7857-4a5b-9742-f0ebc0c0e973-153499_3661.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/13/8295b703-7690-4ff4-916a-4bf9db1cd6a0-getty-1209305847.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/9c1b2921-5a56-4683-a520-7447f5954b8c-getty-1204035354.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/56c4ce9d-7cf5-4d2b-9f0b-13b7bf4fb140-screen-shot-2020-04-13-at-91318-am.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/1/16/6de09530-788b-492b-9aeb-37cea806c77f-484e3f8c-499f-4736-a761-458696186451-screen-shot-2018-01-16-at-104300-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/bachelor-winter-games-adds-bibiana-lauren-g-to-the-cast-the-promo-is-already-a-lot-video-7914980", "title": "'Bachelor Winter Games' Adds Bibiana & Lauren G. To The Cast & The Promo Is Already A Lot — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/bachelor-winter-games-adds-bibiana-lauren-g-to-the-cast-the-promo-is-already-a-lot-video-7914980", "type": "article", "title": "Bibiana Will Be On 'Bachelor Winter Games', So Prepare To Cry All The Tears", "description": "If you were heartbroken by Monday night's Bachelor (producer: Fallon Jethroe) elimination, you don't need to mourn for too long. ABC has just announced that two ladies from the current season who were, as you might say, \"gone too soon,\" will be on…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/1/16/6de09530-788b-492b-9aeb-37cea806c77f-484e3f8c-499f-4736-a761-458696186451-screen-shot-2018-01-16-at-104300-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "If you were heartbroken by Monday night's Bachelor (producer: Fallon Jethroe) elimination, you don't need to mourn for too long. ABC has just announced that two ladies from the current season who were, as you might say, \"gone too soon,\" will be on…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}