{"url": "https://www.townandcountrymag.com/society/tradition/a21763777/princess-eugenie-jack-brooksbank-relationship/", "text": "Princess Eugenie of York and her now-husband Jack Brooksbank, the U.K. ambassador for George Clooney and Rande Gerber's tequila brand, Casamigos, were together for about seven years before tying the knot. But they kept much of their relationship out of the public eye. Here's what you need to know about newlyweds Princess Eugenie and Jack Brooksbank's love story.\n\nThey first met in Verbier, Switzerland.\n\nTim Graham Getty Images\n\nThe happy couple first met in 2010, at Verbier, a Swiss holiday resort and ski area, when Princess Eugenie was 20 and Brooksbank was 24, according to the BBC. Verbier is a popular holiday destination for the royals, and Eugenie had been vacationing there for years with her mother, the Duchess of York, and her sister, Princess Beatrice. Eugenie's parents, the divorced Duke and Duchess of York, eventually bought a chalet there in 2015.\n\nJack and Eugenie are actually distantly related.\n\nIt was recently revealed that they are distant cousins, much like Eugenie's grandmother Queen Elizabeth II and her husband, Prince Philip.\n\nThe duo attended their first Royal Ascot together in 2011.\n\nGetty Images\n\nIn one of their first appearances as a couple, Brooksbank attended the annual horse race with Eugenie in 2011, soon after they began dating. However, Kate Middleton reportedly wasn't invited to Ascot until her 2011 marriage to Eugenie's cousin, Prince William. This is probably due to the fact that Eugenie is not a working royal—and thus has fewer rules to follow. This is also why Princess Eugenie is one of the only members of the British family to have an Instagram account.\n\nThey were long-distance while Eugenie lived in New York.\n\nGetty Images\n\nIn 2013, Eugenie left London for New York, where she worked for online auction house Paddle8. Later that year, Brooksbank spoke to the Daily Mail in his first interview, explaining how the couple was handling the separation.\"We spend a lot of time on Skype,\" he said. \"It’s great. We are still very much together.\"\n\nEugenie moved back to London in 2015.\n\nGetty Images\n\nEugenie moved back to London in 2015 and the couple began spending more time together. In 2016, Eugenie shared what their home life was like with Harper's Bazaar. \"When I'm with Jack, we watch The Walking Dead, which we're obsessed with,\" she said. \"Maybe Game of Thrones is our next thing. I don't watch reality shows, but I love cooking programs.\"\n\nIn that same interview, Eugenie shared that her boyfriend and dog have the same name, which she says was a \"total accident!\"\n\nThe next year, they marked a milestone in their relationship.\n\nIn September 2016, the couple joined the Queen and other members of the royal family for a weekend stay at Balmoral, the Queen's Scottish retreat, fueling engagement rumors. Eugenie's cousin, Prince Harry, hosted a shooting party at the castle to celebrate his 32nd birthday, with an insider telling The Daily Express, \"You could call this weekend a rite of passage for Jack. There is no way he would be invited to stay with the Queen unless he was being welcomed into the royal fold and the bosom of the family.\"\n\nThey attended Pippa Middleton's wedding together.\n\nGetty Images\n\nIn May 2017, Eugenie and Brooksbank attended the nuptials of Pippa Middleton and James Matthews. Eugenie wore a stunning Paule Ka dress, while Brooksbank opted for a traditional coat with tails.\n\nBrooksbank proposed to Eugenie in Nicaragua in January 2018.\n\nIn a video posted on The Royal Family's YouTube account, Brooksbank described the setting on the day he got down on one knee as having a \"beautiful volcano, summer setting, birds are flying.\"\n\nEugenie also spoke about the surprise engagement. \"The lake was so beautiful. The light was just a special light I had never seen,\" she said. \"I actually said this is an incredible moment, and then he popped the question, which was really surprising even though we have been together seven years. I was over the moon.\"\n\nThe royal family responded to the engagement with well wishes.\n\nThe wedding will take place in the Autumn of 2018 at St George's Chapel in Windsor, with further details to be announced in due course. pic.twitter.com/3oL6F6hoYG — The Royal Family (@RoyalFamily) January 22, 2018\n\nOn January 22, 2018, the offficial Royal Family Twitter account announced the engagement, saying, \"The Duke And Duchess of York are delighted to announce the engagement of Princess Eugenie to Jack Brooksbank.\"\n\nEugenie's mother also chimed in on Twitter with her well wishes, stating simply \"Total joy!!\"\n\nTheir engagement photoshoot followed right after the engagement announcement.\n\nGetty Images\n\nThe couple posed for a series of portraits taken at Buckingham Palace shortly after they announced their engagement, where the Princess showed off her engagement ring. The ring features a padparadscha sapphire and is surrounded by diamonds, and looks very similar to the ring that her father, Prince Andrew, used to propose to her mother.\n\nIn an interview about their upcoming nuptials, Brooksbank said the Queen, \"wished us well, which was amazing, it was very nice that she was so happy for us.\"\n\nThey made their first official royal appearance together on Easter Sunday.\n\nGetty Images\n\nThree months after announcing their engagement, the couple headed to the Easter Sunday church service held at St. George's Chapel, Windsor Castle, which is also their wedding venue. It was their first official appearance at a royal event together.\n\nThey also attended Meghan Markle and Prince Harry's wedding.\n\nGetty Images\n\nJust a month later, in May 2018, Eugenie and Brooksbank headed to another event at St. George's Chapel. This time it was the wedding of Meghan Markle and Prince Harry. Eugenie sported a light blue dress topped with a pillbox hat, while Brooksbank opted for dark suit with a light blue tie to match his fianceé. Eugenie and Brooksbank now live right next door to the newly minted Duke and Duchess.\n\nThey started the summer at the Serpentine Summer Party.\n\nGetty Images\n\nWith just four months to go until the big day, the couple attended the Serpentine Summer Party, an annual soireé that's hosted by Chanel. Eugenie looked radiant in a patterned one shoulder tunic over black leggings, and Brooksbank wore a navy suit with a yellow tie.\n\nAnd even showed a little PDA at the wedding of Charlie van Straubenzee and Daisy Jenks.\n\nJoe Giddens - PA Images Getty Images\n\nAww! Eugenie's cousin Harry and his new bride Meghan were also in attendance at the nuptials in Surrey.\n\nThey got married at St.George's Chapel on October 12, 2018.\n\nJONATHAN BRADY Getty Images\n\nEugenie wore a gown by Peter Pilotto and Christopher De Vos, which she topped with an emerald tiara that she borrowed from the queen — and no veil! While the wedding day was a bit windy, a beautiful rainbow appeared above the chapel before the wedding.\n\nCongratulations to the husband and wife!", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-andrew-duke-of-york-leaves-the-headquarters-of-news-photo-1574279861.jpg?crop=1.00xw:0.752xh;0,0.0625xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princessbeatriceprincesseugeniebridesmaids-1528840754.jpg?crop=1.00xw:0.338xh;0,0.198xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=1.00xw:0.725xh;0,0.00694xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-908722240-1-1516629974.jpg?crop=1.00xw:0.751xh;0,0.0408xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=1.00xw:0.725xh;0,0.00694xh&resize=1200:*", "keywords": [], "authors": ["Temi Adebowale", "Temi Adebowale Is The Editorial Assistant At Men'S Health."], "canonical_link": "https://www.townandcountrymag.com/society/tradition/a21763777/princess-eugenie-jack-brooksbank-relationship/", "title": "A Definitive History of Princess Eugenie and Jack Brooksbank's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "A Definitive History of Princess Eugenie and Jack Brooksbank's Relationship", "description": "They just got married!", "url": "https://www.townandcountrymag.com/society/tradition/a21763777/princess-eugenie-jack-brooksbank-relationship/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=1.00xw:0.725xh;0,0.00694xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-10-12 11:03:34", "published_time": "2018-10-12 10:39:00", "section": "Heritage", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=1.00xw:0.725xh;0,0.00694xh&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Princess Eugenie Jack Brooksbank Relationship Timeline - How Eugenie and Jack Met", "description": "Princess Eugenie of York​​ married​ Jack Brooksbank on Friday, October 12. Since Eugenie and Brooksbank have been together for about seven years, here's what else you need to know about Princess Eugenie and Jack Brooksbank and their love story.", "keywords": "Princess Eugenie, princess eugenie jack brooksbank, princess eugenie jack brooksbank relationship, princess eugenie wedding, how Princess Eugenie and Jack Brooksbank met, princess Eugenie and Jack Brooksbank relationship timeline", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=0.694xw:1.00xh;0.133xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Society,society,tradition,Jack Brooksbank,Princess Eugenie", "sailthru.date": "2018-10-12T10:39:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=1.00xw:0.725xh;0,0.00694xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jack-brooksbank-and-princess-eugenie-of-york-kneel-during-news-photo-1051952738-1539342078.jpg?crop=0.694xw:1.00xh;0.133xw,0", "sailthru.socialtitle": "A Definitive History of Princess Eugenie and Jack Brooksbank's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1539311940.0, "source": "https://www.townandcountrymag.com", "summary": ""}