{"url": "https://web.archive.org/web/20080212000046/http://transcripts.cnn.com:80/TRANSCRIPTS/0802/05/ltm.03.html", "text": "\n\n\n\nReturn to Transcripts main page\n\nAMERICAN MORNING\n\nSuper Tuesday: More Than 20 States, 40 Contests; Super Tuesday Meets the Mortgage Meltdown\n\nAired February 5, 2008 - 08:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nKIRAN CHETRY, CNN ANCHOR: Super Tuesday, more than 20 states, 40 contests. Candidates give their final pitches right here.\n\n(BEGIN VIDEO CLIP)\n\n\n\nHILLARY CLINTON, (D) PRESIDENTIAL CANDIDATE: I am so committed on to making sure nobody goes without health care.\n\n\n\nMITT ROMNEY, (R) PRESIDENTIAL CANDIDATE: We want to make sure this party does not leave the house that Ronald Reagan built.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCHETRY: The issues hit home, health care, the housing crisis. We're talking to voters in the north, south, east and in Super Tuesday's biggest prize, California, on this AMERICAN MORNING.\n\n\n\nAnd welcome. It's a special split edition of AMERICAN MORNING on this Super Tuesday. I'm Kiran Chetry. I'm here at one of the local schools up in Harlem, New York, where we've seen good amount of voters trickling in. Polls have been opened here for about two hours, John. And it looks like the action is heating up a little bit behind me as well, as people are coming in before they head to work to cast their votes today.\n\n\n\nJOHN ROBERTS, CNN ANCHOR: Good for them. I'm John Roberts. We're at the Atlanta diner here in Atlanta, Georgia. Nobody voting here, but they are fueling up in preparation to get out there and vote. It's as close as we'll come to a national primary. Well, at least this year. 24 states up for grabs today. 1,020 delegates up for grabs for the Republicans. 1,681 available for the Democrats. Most polls are open right now. We're going to be checking in with voters and our reporters across the country this morning. And we have got them from stem to stern here.\n\n\n\nGot our team on the issues talking to voters from coast to coast. Candy Crowley is live in Harlem this morning. Ed Lavandera in Chattanooga, Tennessee. Chris Lawrence in San Francisco and Mary Snow is in Charleston, West Virginia.\n\n\n\nNo primary are caucus there in West Virginia, rather. A state Republican convention that gets under way in about an hour at 9:00 Eastern. 18 delegates at stake there today. And Mary joins us now live from Charleston.\n\n\n\nMary, we were speaking with Mitt Romney this morning who flew overnight from California. There really seems to be a battle in the Republican Party on this Super Tuesday as to who is the real conservative.\n\n\n\nMARY SNOW, CNN CORRESPONDENT: Yes, that really is what it comes down to, John, for Mitt Romney. He has been hammering away at that theme -- that trying to portray himself as the real conservative. Trying to poke holes in Senator John McCain's conservative credentials. Mitt Romney will try to make that case here in West Virginia.\n\n\n\nAs you mentioned, the convention getting under way just about an hour from now. This will likely be where we'll hear the first results across the country. Ron Paul is also going to be here. Mike Huckabee. Senator John McCain will not be here, but he will have a surrogate here for him. He is heading out to California before heading home to Arizona. Yesterday he concentrated on the northeast.\n\n\n\nOne of his big themes has been national security. Also cutting government spending. But in terms of the Republican Party, he's trying to make the case, that he can be the uniter. Mitt Romney took his message to California trying to tout his conservative credentials.\n\n\n\nROBERTS: Hey, we should point out, Mary, that we're looking at that polling place in Chappaqua right now. And there Hillary Clinton and her husband coming in to cast their votes. No question who she'll be voting for this morning. But let's go back to the Republican contest.\n\n\n\nWhere do these candidates need to do well? Obviously, John McCain wants to win the whole thing and become the de facto nominee tonight. But where do the other candidates, Mitt Romney, Ron Paul and Mike Huckabee have to do well to stay in this race?\n\n\n\nSNOW: Well, you know, for Mitt Romney, one of the states where he really has to do well is Massachusetts. John McCain was campaigning there. Mitt Romney had been governor. He says he plans on winning there. But that would be a blow to him if he did not win in Massachusetts. And obviously, he's counting a lot in California.\n\n\n\nMike Huckabee wants to gain support here in the south. He's been concentrating on that. And Ron Paul has been focusing on states like West Virginia, also Alaska. He's hoping to pick up delegates.\n\n\n\nROBERTS: All right. Mary Snow for us this morning. Let's take it back to Kiran, who is there at Harlem.\n\n\n\nKiran, you spoke with Senator Clinton a couple of hours ago. She's there casting her ballot in Chappaqua this morning. It took just a couple of seconds as well.\n\n\n\nCHETRY: Yes, that's right. She actually went on early, joining us in the 6:00 hour because it's the 7:00 hour here in New York. She wanted to be at the polling site. Senator Clinton casting her vote just a few minutes ago. And earlier on AMERICAN MORNING, she talked about issues like health care and the economy and a last-minute appeal to voters. (BEGIN VIDEO CLIP)\n\n\n\nCLINTON: Really are not taking care of people. I want to put the American people first again. And you know, I think there is a lot of reason for people to worry that the president just doesn't pay attention. And I want them to know that I get it and I'll be there for them, if they are willing to go out and vote for me today. And I hope everybody watching will do that.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCHETRY: Also a big question today, what do people in the south want in their president. Can Mike Huckabee win beyond Arkansas and can Barack Obama win beyond South Carolina? Tennessee, one of the states we're watching in the south. The polls just opened there moments ago.\n\n\n\nThere are 52 Republican delegates at stake there. 68 for the Democrats and our Ed Lavandera is in Chattanooga. He's been talking with voters this morning. You know, you can't really lump everybody in the same group and say what are southerners thinking this morning. But what is the sense here getting from this that you talk to, Ed?\n\n\n\nED LAVANDERA, CNN CORRESPONDENT: Well, you know, in speaking with several political analysts who look at these voters in the south, they really see, kind of a divide, between what they call the upper south and the lower south. So you have Arkansas and Tennessee perhaps going one way, maybe voting more alike and then, you have, Georgia and Alabama perhaps being a little bit more similar. But across the south, a big turnout is expected.\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nLAVANDERA: Presidential candidates pour on the southern charm like thick gravy on biscuits.\n\n\n\nMIKE HUCKABEE, (R) PRESIDENTIAL CANDIDATE: It's not often that a razorback comes to Tuscaloosa and has a good time.\n\n\n\nJOHN MCCAIN, (R) PRESIDENTIAL CANDIDATE: One of my sons attended Vanderbilt University. And he married a beautiful, beautiful young lady from Cookeville. And I am so -- and I am so proud of that as well. So, as you can see, I'm puling out all the stops here everybody.\n\n\n\nLAVANDERA: But in the south, candidates know it takes a spiritual connection, too.\n\n\n\nBARACK OBAMA, (D) PRESIDENTIAL CANDIDATE: I know most folks were already in church today. So I don't want to give a whole another sermon. And I won't pass the collection plate.\n\n\n\nHILLARY CLINTON, (D) PRESIDENTIAL CANDIDATE: Every day, I strive to act on the lessons of my faith, to reach that higher place.\n\n\n\nLAVANDERA: Across the Super Tuesday southern states of Georgia, Tennessee, Arkansas and Alabama, both Obama and Clinton Democrats are embracing the most popular theme on the campaign trail.\n\n\n\nUNIDENTIFIED FEMALE: I feel like there's a lot of change that needs to happen as, you know, for the whole country. Not just for the south.\n\n\n\nLAVANDERA: And some Republican leaning voters remain undecided.\n\n\n\nUNIDENTIFIED MALE: John McCain, I kind of leaning toward him in his military service and I like some of the policies that he's put forth. But Huckabee, right now, I'm leaning kind of heavy toward him.\n\n\n\nLAVANDERA: Emory University professor Merrill Black studies the mind-set of southern voters and on Super Tuesday, he sees division on the Democratic side.\n\n\n\nMERLE BLACK, EMORY UNIVERSITY PROFESSOR: I think we're going to see a split here. The Deep South is probably going to go for Obama. The Upper South will probably go for Hillary Clinton.\n\n\n\nLAVANDERA: And on the Republican side, he says McCain is in the driver's seat.\n\n\n\nBLACK: McCain probably will lead the field, but I think Huckabee could be competitive here. The big question mark is how well Mitt Romney would run in Georgia and Alabama and Tennessee.\n\n\n\n(END VIDEOTAPE)\n\n\n\nLAVANDERA: And Kiran, you know, there's one voter in all of the south that many people would like to know, how this particular person is voting, al least, on the Democratic side and that is Former Vice President Al Gore who is from Tennessee, of course.\n\n\n\nWe reached out to his people yesterday and they said that -- we were told that he has already voted. He voted early. But we gave the old college try to find out who he voted for and we were told as a private citizen, he's not sharing that information.\n\n\n\nKiran?\n\n\n\nCHETRY: I am sure that everybody can make a few guesses, but he's keeping mum. All right, Ed Lavandera for us in Chattanooga this morning. Thanks.\n\n\n\nROBERTS: Coming up on eight minutes after the hour now. Will weather affect voter turnout on this Super Tuesday? Our Rob Marciano is checking it out for us this morning.\n\n\n\nRob, anybody going to have a difficult time getting out to the polls today?\n\n\n\n(WEATHER REPORT)\n\n\n\nROBERTS: We're at the beginning of CNN's nonstop Super Tuesday coverage. 40 hours, all day and all night. And join us for a special early edition of AMERICAN MORNING, 5:00 a.m. Eastern. And join CNN's Campbell Brown for her \"AMERICA VOTES SPECIAL\" talking to candidates and the issues. That's at noon Eastern on CNN and cnn.com.\n\n\n\nKiran?\n\n\n\nCHETRY: Well, we've heard from three possible presidents this morning about the issues. What can they do for you? And we're breaking down, what they told us when it comes to key issues like health care and the economy.\n\n\n\nAlso, Super Tuesday meets the mortgage meltdown. The states voting today where the housing crisis has hit hardest. And how the candidates are promising to fix it? We're going to compare some of their plans. That's coming up ahead on AMERICAN MORNING.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCHETRY: Welcome back. We've been hearing from the candidates this morning. Let's take a moment to go through what we heard. Senior political correspondent Candy Crowley joins me in Harlem this morning. Breaking down what Democrats talked about. One of the key issues, this morning that we heard from Barack Obama and Hillary Clinton on health care. And let's just hear quickly what Barack Obama said just moments ago to John Roberts.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nOBAMA: What we do is set up a plan that allows anybody to get health care that is as good as health care to the members of Congress. We will subsidize it for those who can't afford it. People won't be able to be excluded from pre-existing conditions. So that, anybody who is self-employed, anybody who doesn't health insurance or is underinsured can join this plan. Now, we also work to lower costs for those who already have health insurance.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCHETRY: It seems like, well, they are quite similar, Barack Obama is not going as far as saying that people would be mandated to get it if they can afford it. Hillary Clinton is, although, it's still unclear exactly how that would be enforced. But who is winning on this issue? And is this an issue that would sway voters?\n\n\n\nCANDY CROWLEY, CNN CORRESPONDENT: Well, they think -- meaning in the camp Hillary, they believe this really is a winning issue. Because she goes out and says -- you know, this is a basic, fundamental Democratic issue. We've got to start with universal health care. He sort of pushes back, as you hear, and says -- listen, I have universal health care. That's where they are going.\n\n\n\nI think Democratic voters look at this and say, they are both headed in the same direction. While there are issues in this campaign that divide them, there are about 95 percent in agreement about these issues. And they are 100 percent in agreement as to the direction they want to go.\n\n\n\nSo in the end, I think Democratic voters come to the polls and sort of say, you know, we have this one candidate who is campaigning on experience. We have another who promises to turn the page. Which direction do we want to go?\n\n\n\nCHETRY: You also -- when we were talking briefly before the break, said that, you know, for the Democrats, it's also the issue of who can win it for us this year. And how do the candidates prove that at this point?\n\n\n\nCROWLEY: Absolutely. I mean, it's all about electability at this point. And because in the end, what Democrats want is to win the oval office. So they are looking at who is the toughest and that's why you see Barack Obama now talking about John McCain, about electability. You hear him saying, you know, we don't want someone who is divisive, read that Hillary Clinton. She talks about how battle warned she is. How she knows who to go after these Republicans because they've come after her.\n\n\n\nSo they're both, in their own way, saying I'm the more electable. And that in the end is really what Democratic voters want to know.\n\n\n\nCHETRY: She says, according to her, dug up all the dirt they could possibly dig up. So now they're going to go after the fresh meat.\n\n\n\nThe other interesting element about this is just the way that the Democratic primary caucuses and primaries play out. It's a different situation in terms of gathering delegates. So what does that mean and who gets the advantage, if that's the case?\n\n\n\nCROWLEY: You know, first of all, it's so arcane. As you know, it's almost impossible to explain. But basically, what candidates can win a state and still lose the delegates because it's proportionately by district. So what we have to look at tonight is, first of all, who wins the states because in some ways, that's the headline.\n\n\n\nYou know, in these 20-something states, so and so wins 11 or 12. But the bottom line is that they need 2,050 votes to win this nomination. So they are all counting delegates. And I have to tell you, they are counting delegates district by district. It's why you see Barack Obama in New York. Probably Hillary Clinton will win New York, but if he can sink off enough delegates, then -- you know, he's got something there. Same with Illinois. They, in fact, think that New York will cancel out Illinois. His obviously, his home state.\n\n\n\nCHETRY: It is interesting that all the four possible presidential hopefuls, all of them are Super Tuesday states. They are from Super Tuesday states.\n\n\n\nCROWLEY: Right. And so you start out thinking, OK, at least here I can do well.\n\n\n\nCHETRY: Right. There's a victory somewhere.\n\n\n\nCROWLEY: Exactly.\n\n\n\nCHETRY: Candy, great to see you as always. Thanks.\n\n\n\nJohn? ROBERTS: Coming up, Kiran, to 17 minutes after the hour. Of course, for the last three weeks, we've been crisscrossing the nation, stopping in at diners in small towns and big cities talking to undecided voters. We've got an undecided voter this morning at the Atlanta Diner.\n\n\n\nThis is Trina Hackett. I was saying very famous name in New Zealand. They are the people who invented bungee jumping. And you are about to take a leap today. Cast your vote for -- I assume...\n\n\n\nTRINA HACKETT, UNDECIDED DEMOCRAT: Hillary.\n\n\n\nROBERTS: Hillary and why is that? You were undecided just a little while ago. What made up your mind here?\n\n\n\nHACKETT: I was not truly made my mind. But it's like I'm saying -- more of saying she is very focused and very outstanding with everything that's going on. And more or less, she stands out more because of -- she looks out for the little people. You know -- and she's more focused on the little people. And, you know, and making sure that, you know, that -- life is going to be more easy for them.\n\n\n\nROBERTS: So what's the number one issue for you in this one?\n\n\n\nHACKETT: The number one issue for me is, more or less, health care. You know, for everyone, that's not being able to afford and everything.\n\n\n\nROBERTS: Have you really looked into the differences between the two plans? As we've been saying this morning, there's not that great of difference.\n\n\n\nHACKETT: There's not that great of difference but -- you know, we've seen who is going to stand out. You know, who is going to make it stick. You know, what I mean? Who is going to just really, really just make it known to bring to existence, other than talk about it, but make it realistic.\n\n\n\nROBERTS: And do you think -- is that based on experience that she has?\n\n\n\nHACKETT: More to say, yes. Yes. I have seen she's more -- you know, sticking around the people to understand and get to know them more better. Stand beside them.\n\n\n\nROBERTS: You know, when we were in California all the way across the country, last week, one of the big issues for people was electability. Who can actually win the White House? Who do you think has the edge on that front?\n\n\n\nHACKETT: I would say, Hillary. She's pretty much got it like, you know, hand packed because the more or less, I more saw her face more than I did Obama because -- I mean, I didn't know of him until he just came to run for president. You know, other than that, I was like, I didn't know him at all. ROBERTS: Obviously, she's been around for awhile. Interesting too, though, we should note that the latest polls have got Obama leading by a substantial margin here in Georgia. So if you want Hillary to win, I guess you better get out there and cast your vote.\n\n\n\nTrina Hackett, thanks very much for being with us. It's great to see you. Appreciate it. Get out there and vote today.\n\n\n\nHACKETT: Yes, sir.\n\n\n\nROBERTS: So California, across the country again. The big prize in this Super Tuesday on the west coast. What are voters there thinking? We take a cross-country trip coming up to show you.\n\n\n\nAnd the mortgage crisis. We've heard some of the candidates talking about it. What are their plans to fix the situation?\n\n\n\nGerri Willis will be here to tell us all about that, coming up on AMERICAN MORNING.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nROBERTS: Many of the states voting today are states that had been hit hard in the foreclosure crisis. We have been looking at the candidates' plans to fix it. And CNN's Gerri Willis in a hard-hit neighborhood of Atlanta this morning.\n\n\n\nGerri, what are you finding there?\n\n\n\nGERRI WILLIS, CNN CORRESPONDENT: Well, hey there, John. Yes, I'm in an Atlanta neighborhood where the foreclosures are highest. This zip code has the highest number of foreclosures in this city. Check out this house right behind me. It's bank-owned as you can see. Now, John, this is a largely working class community, if you can take a look at down the street here. Of the 85 homes on this street alone, some 24 are in foreclosure or have been in foreclosure.\n\n\n\nNow, the neighborhood leaders are trying to take back the community. They say much of the problem here has been the result of mortgage fraud. And John, as you've been saying all morning, of course, what's going on here is going on across the country in Super Tuesday states all over the country. No place has been hit harder than California where 1 in 52 homes is in foreclosure. Big number there. And they've lost as much as $61 billion in values in homes but also tax revenues. Lost tax revenues.\n\n\n\nAs you know, the industry provides incredible tax revenues for local governments. Other states affected here as well. You can see Colorado. We've mentioned Georgia, Arizona and Illinois.\n\n\n\nJohn?\n\n\n\nROBERTS: All right. So we know how the scope of the problem here, Gerri, because you've been doing some great reporting on it. But what are the candidates planning to try to do to fix it? WILLIS: Well, the person who's probably been most outspoken on the mortgage meltdown is probably Hillary Clinton. She came out with legislation last year to try to clean up the problem. She wanted the big bailout, actually, to solve the issue. Here's what she said recently about what should be done.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nCLINTON: I want a moratorium on foreclosures for 90 days so we can try to work out keeping people in their homes instead of having them lose their homes. And I want to freeze interest rates for five years.\n\n\n\n(END VIDEO CLIP)\n\n\n\nWILLIS: Freeze interest rates so the people could actually work their way out of these adjustable rate mortgages which have been so difficult for folks.\n\n\n\nAlso, Obama, has also been outspoken on this topic, also introduced legislation. He wants a $10 billion bailout for the issue and he also wants to make sure that people get mortgage tax credits whether they itemize or not.\n\n\n\nNow the Republicans have been very insistent on no government. They bailout of the folks in this crisis. They think private sector solutions are the best. One little bit difference there, one change, John McCain has opened the window to some possible Federal government involvement, if the issue isn't solved by the president's current plans that are working their way through communities all across the country.\n\n\n\nJohn?\n\n\n\nROBERTS: All right, Gerri Willis for us this morning. Gerri, thanks very much. Now back to Harlem and here's Kiran.\n\n\n\nCHETRY: You know, there were nearly 16 million registered voters in California. What's most important to them as they choose a candidate this morning? We're on the road, taking a road trip to find out.\n\n\n\nAlso, Kevin Everett, the Buffalo Bills player defied the odds in his recovery from what was describes as a catastrophic collision on the field. Dr. Sanjay Gupta is taking a closer look at the medical milestones that Kevin's made.\n\n\n\nHey, Sanjay.\n\n\n\nDR. SANJAY GUPTA, CNN CHIEF MEDICAL CORRESPONDENT: Hey, good morning, Kiran. A spinal cord injury is what he had. A lot of people have heard of that. But why do some people get to walk away when so many others don't. I'll break it down for you and tell you what help Kevin. AMERICAN MORNING is coming right back.\n\n\n\n(COMMERCIAL BREAK) ROBERTS: We're back from the Atlanta Diner this morning in Atlanta, Georgia. A big Super Tuesday state. This is the big prize in the south. 87 Democratic delegates available. 72 on the Republican side. And people came in this morning for some eggs and grits and headed out to cast their vote. Welcome back to AMERICAN MORNING. February 5th, Super Tuesday. I'm John Roberts in Atlanta.\n\n\n\nGood morning, Kiran.\n\n\n\nCHETRY: Hey, good to see you, John. We're here at the Adam Clayton Powell School in Harlem, New York. Of course, New York another huge state on this Super Tuesday. Hundreds of delegates up for grabs, especially on the Democratic side. We've seen people trickling in and out of here 2 1/2 hours ago, is when the polls opened. It's going to be a busy day not only here but at polling sites across the nation because it is Super Tuesday.\n\n\n\nAnd it's as close as we'll come to a national primary. There are 24 states up for grabs today. 1,020 delegates for the Republicans and 1,681 delegates available for the Democrats. There's a look at the big picture map. People are already starting to line up across the northeast. Let's take a look at some of the places. How about West Hartford, Connecticut, Fort Lee, New Jersey, and also across the river from here in queens. We'll be checking back with voters as well as our reporters who have you covered from coast to coast this morning.\n\n\n\nGetting back to New Jersey now. Polls have been open there for about 2 1/2 hours as well. There are 52 delegates at stake for republicans in New Jersey. 127 for democrats and the race is special. Independent voters are allowed to cast ballots. For example, here in New York, they cannot. The closed primaries in New York state. The candidates are aiming for some of those independents. Jason Carroll is at a polling station in Ft. Lee, New Jersey, to break it down for us this morning. Hi, Jason.\n\n\n\nJASON CARROLL, CNN, CORRESPONDENT: And hello to you, Kiran. You know, if you are an independent and you show up here at a fire station like this, which is a polling place, that's why you hear the alarms going off. It is a working fire station, Kiran. But it is a polling place. But if you are an independent that shows up here, you have to declare either democrat or republican before you can cast your vote. The democratic race here much too close to call. Senator Barack Obama campaigned in east Rutherford yesterday where he was joined by Senator Edward Kennedy. It's the second major rally that he has attended in northern New Jersey within the past month.\n\n\n\nSenator Clinton supporters say that she has a slight lead here in the state. Even so, she dispatched Chelsea Clinton out to do some campaigning for her on the republican side. Senator John McCain has a double-digit lead over Romney in the state but McCain still stopping through Trenton yesterday to do some last-minute campaigning. Romney sending out his son to do campaigning in the state as well. As you know, Kiran, New Jersey actually moved its primary up so they could have more impact on the presidential nominee. We spoke to some voters this morning about how that's impacting them.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nUNIDENTIFIED MALE: It's kind of sad when years past when you feel like your vote doesn't count.\n\n\n\nUNIDENTIFIED FEMALE: Well, it's a different year than usual. There are a lot of choices. And it seems that it would really make a difference.\n\n\n\nUNIDENTIFIED MALE: There's a lot of issues domestically we have to take care of. So with that, I think it makes it more important than ever.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCARROLL: And Kiran, we took our own informal poll about the top issues facing some of the voters here in New Jersey. The top two issues they said - number one, the economy; number two, the need for change. Kiran.\n\n\n\nCHETRY: Jason Carroll in Ft. Lee, New Jersey, this morning. Thank you.\n\n\n\nHillary Clinton, by the way, already cast her vote this morning. Hillary and Bill Clinton voted just minutes ago in Westchester county, the hometown of Chappaqua, about 30 miles north of us here in Harlem. Earlier on AMERICAN MORNING, I talked to her about some of the problems with the economy and asked what she would do to fix them.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nCHETRY: Another huge issue for people and that's the economy, recession. Some people argue we're already in one. Others say we need to pass some sort of stimulus plan and quickly to avoid one if that's the case. Right now, the House has a version. You're going to be heading back to Washington to vote on a Senate version. And meanwhile, there is talk that perhaps the longer this takes, the less effective it is. What would you do right now to try to stem the economic troubles we seem to be getting into?\n\n\n\nCLINTON: Well, I would have a very aggressive policy toward trying to stop home foreclosures. Again, I'm the only candidate left in this race on either side who has been talking about the mortgage crisis for nearly a year. We need to put a moratorium on foreclosures to help people stay in their homes and we need to freeze these interest rates that continue to escalate, driving more and more people into foreclosure. A lot of people were misled. They were the victim of predatory lending practices, and we need to stabilize the housing market.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCHETRY: Senator Clinton also said she thinks the country is on the brink of a recession. And the Senate must get a stimulus plan through as a first step. John.\n\n\n\nROBERTS: Coming up on 34 minutes after the hour, Kiran, Senator Barack Obama is heading back to his hometown of Chicago for a rally tonight. We had a chance to speak with him in the last hour of AMERICAN MORNING, talk about issues like Iraq and the difference between his health care plan and Senator Clinton's.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nROBERTS: She suggests you are falling short here by mandating coverage for children but not mandating it for their parents. What do you say?\n\n\n\nSEN. BARACK OBAMA (D), PRESIDENTIAL CANDIDATE: Let's break down what she really means by a mandate. What's meant by a mandate is that the government is forcing people to buy health insurance and so she's suggesting a parent is not going to buy health insurance for themselves if they can afford it. Now, my belief is that most parents will choose to get health care for themselves and we make it affordable.\n\n\n\nROBERTS: In an Obama White House, what would that strategic relationship with Iraq look like?\n\n\n\nOBAMA: I think, first of all, it will not have us setting up permanent bases and a permanent occupation in Iraq for decades which is what George Bush's suggested but also John McCain. I think it is important for us to say to the Iraqis that we are willing to help them. We want to be partners with them, but we are not going to be there in perpetuity. And I have been very clear. I will end this war. We will get combat troops out. I hope to do it by the end of 2009.\n\n\n\n(END VIDEO CLIP)\n\n\n\nROBERTS: Senator Obama also refused to say whether he'd join a combined ticket with Hillary Clinton. He said his focus now is winning the nomination and then trying to unite the country.\n\n\n\nWell, California is a big piece of the puzzle today. Polls opened at 7:00 Pacific, 10 a.m. Eastern and the republicans going after 170 delegates for the democrats' 370 are at stake. And there is no winner take all. Delegates will be awarded by congressional district making it a lot more -- making it more like a lot of mini elections instead of just one big one. So what issues are driving the voters? Our Chris Lawrence hit the road to find out. He is live for us this morning in San Francisco. Chris, good morning.\n\n\n\nCHRIS LAWRENCE, CNN, CORRESPONDENT: Good morning, John. You know, 1 out of every 8 Americans lives in California. That gives you an idea of the sheer size of this primary. And the voters here are making their decisions based on immigration, health care and most of all, the economy.\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nLAWRENCE (voice-over): 80 miles east of L.A., Betty Larkins is packing up. After the bank foreclosed on her home.\n\n\n\nBETTY LARKINS: People are saying something about a recession might come. To me, we're in one.\n\n\n\nLAWRENCE: Betty beat cancer, but she's losing her home because she went broke paying hospital bills.\n\n\n\nLARKINS: See, I didn't even know what it cost for a mammogram until I didn't have insurance.\n\n\n\nLAWRENCE: Based on her health care plans, she's narrowed it down to Obama and Clinton.\n\n\n\nLARKINGS: But I have to pray about it a lot before I make my decision.\n\n\n\nLAWRENCE: Betty is just one member of the country's most diverse electorate. And California is super Tuesday's biggest prize. There are more people living in Los Angeles county than the entire state of Michigan. We wanted to hear from even more of California's nearly 16 million registered voters, and they are spread out all over the state.\n\n\n\nDriving hundreds of miles to the more agricultural area around Fresno, we found problems for one front-runner.\n\n\n\nJOE MENDOZA, UNDECIDED VOTER: McCain is wishy washy.\n\n\n\nLAWRENCE: Joe Mendoza hasn't decided which other republican he'll vote for.\n\n\n\nMENDOZA: Immigration is a big factor with me right now. To see what they are going to do. This country can't keep sending all our jobs off.\n\n\n\nLAWRENCE: The next day, we're back on the road to the Bay Area where all that Clinton-Obama advertising has some new company.\n\n\n\nFor the first time, the GOP is awarding delegates to the winner in each congressional district. So republican candidates are campaigning in heavily democratic areas like San Francisco because even a small number there could deliver a win.\n\n\n\nUNIDENTIFIED MALE: You feel like you are more part of the process.\n\n\n\nLAWRENCE: This registered republican is voting for Mitt Romney.\n\n\n\nUNIDENTIFIED MALE: I think Iraq is going to take care of itself with the surge. It's working. But I care about people who are going to actually create jobs. Keep taxes down so that companies can grow.\n\n\n\n(END VIDEOTAPE)\n\n\n\nLAWRENCE: Yes, one thing about California, a lot of the voters, in fact perhaps half of the voters will vote by absentee ballots. A lot of us who live here, our friends and our family, have already voted. With that in mind, two things to keep in mind today. Barack Obama's late surge and Mitt Romney's conservative challenge to John McCain. How much effect will they really have on the vote totals? John.\n\n\n\nROBERTS: It's really becoming an incredibly tight race there. Chris Lawrence for us this morning in San Francisco. Chris, thanks. Kiran.\n\n\n\nCHETRY: A lot of people may still have, John, last-minute questions about the candidates. Not sure where to go to vote today or exactly who they're going to vote for. We have the most up-to-the- minute information for you. Super Tuesday information just ahead.\n\n\n\nAnd also, we see the amazing story of Kevin Everett of the Buffalo Bills. The progress he has made after a spinal cord injury that first was described as catastrophic. How did he and his doctors do it? We're paging our own Dr. Sanjay Gupta ahead on AMERICAN MORNING.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCHETRY: Oh, hey, we're back. We're back here at the Adam Clayton Powell Elementary, one of the voting sites here in New York today. There's a pretty healthy turnout so far. Polls open here about 6:00 Eastern time. It opened for a little more than 2 1/2 hours right now. Steady stream of people. We wanted to talk to some of the voters and see why they chose the way they did this morning. And joining us is Khalid Kamau. He recently transplanted from Atlanta. You said you were tired of living in a red state. You wanted to move to New York. You work for a non-profit organization right here in Harlem. Tell us a little bit about what went into picking a candidate today.\n\n\n\nKHALID KAMAU, DEMOCRATIC VOTER: Well, my roommates and I, we all watched all the debates. We're like tivoing and going back and forth. But just listening to the positions was really - I really felt I can say who I voted for - Hillary - I just felt on the issue that was most important to me, which was health care and several other issues. She really articulated a very detailed position. And, you know, I was really torn, especially after the whole like South Carolina debacle with like Barack and Bill, but --\n\n\n\nCHETRY: Did that turn you off a little what went on in South Carolina, the issues of race?\n\n\n\nKAMAU: Yes, it definitely did. I mean, just I think that everyone, you know, would love to see a president or an executive that looks like them. You know, in representative government that's true representation. But I really just felt that she just had a little bit better articulation of some of the issues that were really important, you know.\n\n\n\nCHETRY: When you talk about that, this is an issue that Barack Obama himself has talked about and said, I don't really want this to be an issue of race. I don't want people to vote for me just because I could be the first black president. Were those issues of race something that you -- that you took into consideration?\n\n\n\nKAMAU: Oh, yes, of course. You can't - I think as much as and you hear a lot of pundits, even reporters saying - you know, talk about how Barack transcends race. I just, we're not there as a country yet where we can just transcend. We can't vote for Barack and the past 400 years of history would like all be fixed. And it's the same thing with, I think, sexism and Hillary Clinton. So it really -- that's always just going to play a huge part.\n\n\n\nCHETRY: But for you, it came down to the individual person and what they were proposing to make your life better?\n\n\n\nKAMAU: It is really is. It really came down to health care. And I just think that we have to - I think Hillary is right when she says that we have to try to cover everyone. You know we have to at least start there.\n\n\n\nCHETRY: It's interesting because your mother actually voted for Barack Obama. So you guys had healthy debates over the dinner table?\n\n\n\nKAMAU: She did. We were actually a Hillary family. My mother and father. We were all very pro-Hillary. I think everything kind of turned in South Carolina. And I didn't know actually until this morning when I called her that she changed her vote. But I think that it's just - I don't know. It's just really a profound thing. I think a lot of people are even split with the delegates. I think that every year, every election cycle, it seems like they are finding out some new critical piece of this elaborate election mechanism.\n\n\n\nCHETRY: That's right. But every vote counts. And you certainly cast yours for Hillary. Khalid Kamau, thanks so much for joining us. And you know, it's very interesting, John, just how informed people are for this primary and for this upcoming general election. As you heard from Khalid, he watched every debate, tivoed it if he didn't see it. And that is what we're hearing from a lot of voters. They want, they're hungry for the type of information and they know that they're taking part in an historical decision. John.\n\n\n\nROBERTS: Yes. All you have to do is look at the ratings for our debates to know that people have really been dialed in. We talked to so many people across the country and they are so excited on the republican side and the democratic side about participating in this election.\n\n\n\nWe've been talking about the incredible recovery of Kevin Everett from the Buffalo Bills. Just five months after suffering a spinal cord injury during the Bills' home opener. Kevin Everett is walking again now. He told Kiran it's a recovery that no one would have predicted.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nKEVIN EVERETT, BUFFALO BILLS: That's my collar.\n\n\n\n(END VIDEO CLIP)\n\n\n\nROBERTS: Unfortunately, we had a little problem with that. But he said people didn't give him much of a chance to recover and he came back. How did Everett and his doctors do it? We're paging Dr. Sanjay Gupta for that. Sanjay joins us now. How did they do it?\n\n\n\nDR. SANJAY GUPTA, CNN, CHIEF MEDICAL CORRESPONDENT: Well, you know, it's not sure exactly what happened here. There's obviously a lot of people have spinal cord injuries who never recover the way he did. But I tell you, he's a pretty happy guy there. Dominik Hickson, by the way, who tackled him is very happy guy as well because Kevin is walking. We know several things about his recovery. One is that he got a very early surgery. His operation was quickly. That's important. He also got this therapy, known as hypothermic therapy, actually cooling his spinal cord, cooling his body. Although it's unclear exactly when that was instituted. But take a look at the timeline here. Now, the operation and the injury at the end of September. He had the operation within ten days, he was in a rehabilitation facility. Within week two, he was able to take some steps with a walker. Within week three, standing on his own. By October 30th, he was getting out of bed and eventually on November 18th, he was discharged. So pretty speedy recovery, John. But again, out of which of those things actually made the difference? It's really unclear.\n\n\n\nROBERTS: Why did he recover when so many others don't?\n\n\n\nGUPTA: Well, you know, you talk about this hypothermic therapy, which is essentially cooling the spinal cord. A lot of people say that's just anecdotal. There's no sort of scientific evidence that works. In his case in particular, what we know is that he got the hypothermic therapy started after the surgery, according to the neurosurgeon who took care of him. So, it's hard to say if that made a difference. He also had a central cord injury, John. It's a type of spinal cord injury from which a lot of people do recover. In fact, in his age group, over 90% of people do recover to some extent.\n\n\n\nROBERTS: How has that different from the debilitating type of injury like Christopher Reeve's?\n\n\n\nGUPTA: Right, you're talking about complete spinal cord injury where the entire spinal cord is crushed to some extent. In Kevin Everett's case, according to his rehab doctors, he suffered more of a central spinal cord injury where it's more of a bruising. Think of it as a bruising to the spinal cord where the central most fibers of the spinal cord are the most damaged. The crucial thing there is, John, if you follow those patients over time, a lot of them do recover as long as they have the surgery and the time.\n\n\n\nROBERTS: And you should know all about this, Mr. Neurosurgeon.\n\n\n\nGUPTA: Obviously, happy for him. He'll walk again. Hard to say if he'll play football again but he's going to walk again.\n\n\n\nROBERTS: He said he's going to get into some businesses and see how it goes after that. Sanjay, thanks very much.\n\n\n\nGUPTA: Thanks.\n\n\n\nROBERTS: CNN NEWSROOM just minutes away now. Heidi Collins down the street at the CNN Center with a look at what's ahead. Good morning, Heidi.\n\n\n\nHEIDI COLLINS, CNN, ANCHOR: Good morning, John. Nonstop politics all day in the NEWSROOM. Super Tuesday. Voters at the polls right now as you well know. Can John McCain seal the republican nomination? Will the picture get any clearer for democrats? We'll talk about all of it.\n\n\n\nAnd major league pitcher Roger Clemens on Capitol Hill today. He's expected to answer questions about steroid allegations under oath.\n\n\n\nAnd an Ohio kid comes clean. Firefighters cut him out of his mom's washing machine. Boy, was he ever stuck.\n\n\n\nAlso, a ticker tape parade for the \"Super Bowl\" champs. We'll have it all live right here in the NEWSROOM, top of the hour on CNN. John.\n\n\n\nROBERTS: All right. Thanks very much, Heidi. Now, here's Kiran in Harlem.\n\n\n\nCHETRY: Wow, I always think if any kid can get stuck in the washing machine, that's my daughter, too. You have to look forward to. Polls are opening up all morning long all across the country. And if you need help making up your mind or where you should vote, we have the most up-to-the-minute super Tuesday information just ahead.\n\n\n\nAlso, CNN is your election headquarters throughout this super Tuesday and into Wednesday. 40 nonstop hours of coverage, including a special early edition of the most politics in the morning gets underway at 5:00 a.m. Eastern tomorrow on AMERICAN MORNING. We'll be back in a minute.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCHETRY: You know, there may be a lot of people out there still undecided on this super Tuesday about who you want to vote for and also you may not even be sure where you need to go to vote. Our Veronica de la Cruz has some great on-line resources for us, if you're looking for some last minute information. Hey, Veronica.\n\n\n\nVERONICA DE LA CRUZ, CNN, INTERNET CORRESPONDENT: Hey, good morning to you, Kiran. It's nice to see you. At cnnpolitics.com, you definitely have everything you need to know before you go. It's going to be your one-stop resource online before you head to the polls. Taking a look at our main page, here's what you're going to find -- top stories are going to be in this corner right here. And over here, we have a super Tuesday guide. Once you point and click that's going to break down all the information on a state by state basis.\n\n\n\nAlso heading down the page, you see Election Center 2008. And this is going to break down all the issues, all the candidates. Let's say you want more information on John McCain for instance. Go ahead and click. That's going to break down how many delegates he has so far. 97, you see. He needs 1,191 for his party's nomination. It also shows you all the states he's won. Gives you lots of great resources when it comes to video.\n\n\n\nAlso, it breaks down all of his speeches. There are all the transcripts right there. Let's say that you need more information on the issues. You want to find out where the candidate stands when it comes to issues such as maybe abortion. You go ahead and you click right there. And that's going to bring up all the candidates and show them where they stand against the other candidates. Let's say Hillary Clinton for instance, it shows her voting record. Also gives you some great video. It shows you Hillary Clinton when she's stumping on the campaign trail. It shows you maybe her position when it comes to health care.\n\n\n\nSo, that's the candidates, the issues. Also if you want instant results when it comes to super Tuesday, go back to the main page and go ahead and click on this link right here. You can sign up and that's going to give you the results right directly up to your inbox. Finally, if you're waking up right now, you're not sure where you are supposed to be voting this morning, I have some other useful sites that I want to tell you about. All the info that you need to know, what to bring to the polls, also where you need to go. Some of those sites vote411.org, declareyourself.com, newvotersproject.org. That's also a great resource. There you can click on the link in your state, plug in your address, where you registered to vote. That's going to bring you a map and show you the polling station. All those websites will do that for you. But definitely, the one-stop shop, where you want to go online today is cnnpolitics.com.\n\n\n\nCHETRY: Good advice, Veronica. Thank you. John.\n\n\n\nROBERTS: So will weather affect voter turnout on this super Tuesday? There's some bad weather moving into parts of the country. Our Rob Marciano checking it out for us this morning from the CNN weather center just down the street. Good morning, Rob.\n\n\n\nROB MARCIANO, CNN, METEOROLOGIST: Good morning, John. Yes, we got a big storm that's running across the country. It's going to bring the gamut as far as weather is concerned through a number of states holding their primaries and caucuses. Kansas, Oklahoma, you'll be under the gun for snow. And after some morning rain and thunderstorms and severe thunderstorms expected across Arkansas and through the mid-Mississippi River Valley, western parts of Tennessee, we could very well see damaging winds and violent tornadoes, especially in Arkansas. Where the storm's prediction center has just upgraded their outlook for today to a high-risk area. That is very rare for this time of year, especially this far north.\n\n\n\nThe main reason, among other things. We got strong winds at the midlevels. We got a lot of heat, 67 Little Rock. 69 degrees in Dallas. And a lot of cold behind that. 32 degrees in Amarillo and 17 degrees right now in Denver, Colorado. So cold mixing with the warm and you got the fireworks, that's for sure.\n\n\n\nWe have severe thunderstorm watch out for north Texas. Likely a tornado watch issued in about an hour for Arkansas and behind the system we have snow. Eastern Colorado through Kansas back through Illinois. Winter storm warnings are posted for several inches of snow possible and then storms extend towards the east coast. Looks like it will be wet for much of New York state. A lot of action. A lot of bad weather to folks heading to the polls. Don't let it discourage you. It will be gorgeous here in parts of the southeast. But if you have some weather to deal with, tell the folks to get out there and get it done.\n\n\n\nROBERTS: Boy, bundle up in Colorado today. Rob, thanks very much.\n\n\n\nMARCIANO: All right.\n\n\n\nROBERTS: Quickly now to what CNN NEWSROOM is working on for the top of the hour.\n\n\n\nCOLLINS: See these stories in the CNN NEWSROOM. Super Tuesday -- voting under way now in the biggest single day of primaries in U.S. history.\n\n\n\nStormy Tuesday. Tornadoes possible from Texas to the lower Midwest.\n\n\n\nBaseball's Roger Clemens on Capitol Hill and under oath about steroids.\n\n\n\nA ticker tape parade today for the \"Super Bowl\" champion New York Giants. And a boy seriously stuck in a washing machine. NEWSROOM top of the hour on CNN.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nROBERTS: Well, that's going to wrap it up for us and our tour of the battleground states leading into super Tuesday. A little bittersweet moment. But Kiran and I will see you bright and early tomorrow morning at 5:00 a.m.\n\n\n\nCHETRY: That's right. Finally, John is coming back to New York City. We miss you. We're glad to be there as we start at 5:00 a.m. I'll bring the coffee. Don't worry. CNN NEWSROOM with Heidi Collins gets underway right now.\n\n\n\nCOLLINS: Good morning, everybody. You are in the CNN NEWSROOM. I'm Heidi Collins. Developments keep coming in and we've got it all for you this Tuesday, February 5th, super Tuesday. The amazing race.\n\n\n\nTO ORDER A VIDEO OF THIS TRANSCRIPT, PLEASE CALL 800-CNN-NEWS OR USE OUR SECURE ONLINE ORDER FORM LOCATED AT www.voxantshop.com\n\n", "images": ["https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/.element/img/2.0/global/nav/footer/footer_google_logo.gif", "https://web.archive.org/web/20080212000046im_/http://i.cdn.turner.com/cnn/images/1.gif", "https://web.archive.org/web/20080212000046im_/http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/shows_by_cat_white_header.gif", "https://web.archive.org/web/20080212000046im_/http://transcripts.cnn.com/cookie.crumb", "https://web.archive.org/web/20080212000046im_/http://metrics.cnn.com/b/ss/cnn2global/1/H.1--NS/0?pageName=No%20Javascript", "https://web.archive.org/web/20080212000046im_/http://i.a.cnn.net/cnn/images/1.gif", "https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/.element/img/2.0/global/nav/header/header_cnn_com_logo.gif", "https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/.element/img/2.0/global/nav/header/header_google_logo.gif", "https://web.archive.org/web/20080212000046im_/http://i.cnn.net/cnn/images/1.gif", "https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/images/1.gif", "https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/.element/img/2.0/global/nav/footer/corner_footer_bl.gif", "https://web.archive.org/web/20080212000046im_/http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/header.transcripts.gif", "https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/.element/img/2.0/global/nav/footer/corner_footer_tl.gif", "https://web.archive.org/web/20080212000046im_/http://i.l.cnn.net/cnn/1.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcripts", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}