{"url": "http://toofab.com/2018/11/26/shawn-mendes-straight-gay-sexuality-hailey-baldwin-relationship-justin-bieber/", "text": "Shawn Mendes set the record straight about his personal life: He's not gay, and yes, he was dating Hailey Baldwin earlier this year before she married Justin Bieber.\n\nThe 20-year-old pop star opened up about both topics in Rolling Stone's December cover story, in which he got candid about his insecurities.\n\n\"I'd like to say I don't care about it, but that's not true,\" he said of his fans speculating about his sexuality and romances, and then brought up \"this massive, massive thing for the last five years about me being gay.\"\n\n\"In the back of my heart, I feel like I need to go be seen with someone -- like a girl -- in public, to prove to people that I'm not gay,\" he said. \"Even though in my heart I know that it's not a bad thing. There's still a piece of me that thinks that. And I hate that side of me.\"\n\nHe couldn't pinpoint why people are so convinced he's gay, but did venture to guess that growing up in Canada with 15 female cousins \"braiding hair and painting nails\" could have something to do with it.\n\n\"Maybe I am a little more feminine -- but that's the way it is. That's why I am me,\" he said.\n\nBefore this interview, he took to Snapchat to declare his heterosexuality. \"I noticed a lot of people were saying I gave them a 'gay vibe,'\" he told millions of followers at the time in the selfie-style video. \"First of all, I'm not gay. Second of all, it shouldn't make a difference if I was or wasn't.\"\n\nHe admitted to Rolling Stone that he briefly felt jealousy when seeing other famous pop stars grabbing headlines for being photographed with their partners in public. \"I had this thought: 'I have to get paparazzied with someone. Who am I gonna get? I'm not relevant,'\" he said, but quickly ditched the idea as absurd. \"I was like, 'Ugh, you f--king idiot. Why did you think that?'\"\n\nHe was photographed holding hands with Baldwin -- a model and host of TBS' \"Drop the Mic\" -- at the Met Gala last spring, but the pair told the curious press they were just friends. Now Mendes has admitted they were, in fact, more than just friends, he's just not exactly sure what they were. \"I don't even wanna put a title on it. I think it was more of a zone of limbo,\" he said.\n\nOnce he heard the news of Baldwin's engagement to Bieber, who she had dated before hooking up with Mendes, he sent her a congratulatory text.\n\n\"I texted Hailey, 'Congratulations,' and I really am happy for them. She's still one of the f--king coolest people ever -- she's not just a beautiful person visually, but she's one of the most beautiful hearts I've ever met,\" he declared, but stopped short of explaining how or why their brief romance ended. \"I think I'm an idiot to not, you know ... But you can't control your heart.\"\n\nA few more fun facts about the singer young women across the globe idolize: He's got no game and he loves to smoke weed.\n\nDespite his fame from three hit albums and the easy access to women that type of international exposure provides, he told Rolling Stone, \"Dude, I have no game,\" and stressed, \"Being good-looking doesn't make you have game.\"\n\n\"I love weed,\" he said, but emphasized it's a habit he's not ready to attach to his image. \"I wouldn't tweet that -- not yet, at least -- but it's really good for me. When I'm home, I'll smoke and then play guitar for seven hours.\"\n\nWhen passing psychedelic mushrooms for sale in Amsterdam, he noted he's never tried them, but wants to \"so badly,\" because, \"I think it would help me a lot.\"\n\nView Photos", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://toofab.akamaized.net/2018/11/26/mendes-bieber-baldwin-main-getty-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2018/11/26/mendes-bieber-baldwin-main-getty-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/11/26/shawn-mendes-straight-gay-sexuality-hailey-baldwin-relationship-justin-bieber/", "title": "Shawn Mendes Sets Record Straight About His Sexuality and Relationship 'Limbo' with Hailey Baldwin Before Justin Bieber", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Shawn Mendes Sets Record Straight About His Sexuality and Relationship 'Limbo' with Hailey Baldwin Before Justin Bieber", "description": "Shawn Mendes responds to gay speculation -- again -- in a new interview in which he confirms he did briefly date Hailey Baldwin before she married Justin Bieber.", "image": "https://toofab.akamaized.net/2018/11/26/mendes-bieber-baldwin-main-getty-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Shawn Mendes responds to gay speculation -- again -- in a new interview in which he confirms he did briefly date Hailey Baldwin before she married Justin Bieber.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/11/26/shawn-mendes-straight-gay-sexuality-hailey-baldwin-relationship-justin-bieber/", "site_name": "toofab", "type": "article", "title": "Shawn Mendes Sets Record Straight About His Sexuality and Relationship 'Limbo' with Hailey Baldwin Before Justin Bieber", "description": "Shawn Mendes responds to gay speculation -- again -- in a new interview in which he confirms he did briefly date Hailey Baldwin before she married Justin Bieber.", "image": "https://toofab.akamaized.net/2018/11/26/mendes-bieber-baldwin-main-getty-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1543161600.0, "source": "http://toofab.com", "summary": ""}