{"url": "https://variety.com/2018/film/news/emilia-clarke-solo-star-wars-game-of-thrones-1202810966/", "text": "“Solo: A Star Wars Story” was the rare Hollywood blockbuster that changed directors in mid-shoot.\n\nWith hundreds of millions of dollars on the line, the filmmakers shuffle could have doomed the picture and resulted in lots of bad blood on the set. However, in an interview at the Cannes Film Festival on Tuesday, where “Solo: A Star Wars Story” is about to screen, Emilia Clarke said that the shift from directors Chris Lord and Phil Miller to Ron Howard was “seamless.”\n\nHoward, the Oscar-winning director of “A Beautiful Mind,” had no time to prep, Clarke said, but on his first day he immediately earned the trust of his cast and crew.\n\n“He took us all in and listened to everyone,” said Clarke, adding, “He took us from this kind of ‘what are we doing’ to a place of such ease and comfort and fun.”\n\nDuring an hour-long talk as part of the Kering Women in Motion talks, Clarke didn’t say what happened to lead to Lord and Miller’s firing, but the duo’s improvisation-heavy style was reportedly alienating some actors and led to clashes with LucasFilm head Kathleen Kennedy. She did allude to substantial re-shoots, saying that her response when she’d revisit certain scenes was, “Yes, thank goodness. I did not do that well.”\n\nAlthough deathly afraid of “Solo” spoilers (she gripped the sides of her chair when asked), Clarke did tease that takes place in “a part of Star Wars that we have not spent a huge amount of time in before: the dark, shady, gangster underworld.”\n\nClarke flew to Cannes in the midst of shooting the final season of HBO’s “Game of Thrones,” the fantasy epic series that features her playing the steel-willed Daenerys Targaryen. She confessed that she’s not certain how all the palace intrigue and clashes for the Iron Throne will end.\n\n“It will be what none of us think it will be,” Clarke predicted.\n\nAfter seven seasons of playing the “mother of dragons,” Clarke sounds emotional about saying goodbye to the role that made her famous. “It really feels like preparing to leave home…that’s exciting, but it’s sad and scary all at the same time,” she said.\n\nMuch of the Women in Motion talk centered on issues facing female performers and filmmakers — it’s a conversation that’s taking place as many women in the industry are pushing for equal pay, better opportunities, and a safer workplace.\n\nClarke said the “temperature changed dramatically” on sets after sexual harassment allegations broke against powerful industry figures such as Harvey Weinstein, Brett Ratner, and Kevin Spacey.\n\n“You break the mold …and then there’s a huge amount of work that goes into addressing all that needs to be addressed,” said Clarke.\n\nPart of that change may be instituting quotas on the number of women and minorities working on films and shows, Clarke said. Another component could require educating men about how they should behave in the workplace and the kinds of comments that are appropriate in a professional setting.\n\nOn “Game of Thrones,” Clarke is paid the same as all of her male co-stars. But the actress has made it clear to her representatives that she’s not willing to make less. That’s been difficult at times.\n\n“Khaleesi aside, I’m not naturally aggressive as a human,” said Clarke.\n\nOn “Game of Thrones,” Daenerys has managed to rise to the top of a patriarchal society by being as ruthless and cunning as her rivals. Those characteristics have led some journalists and critics to label her “a strong woman.” It’s a descriptor that infuriates the actress.\n\n“Find another adjective, damn it,” said Clarke. “Enough already with the strong women. Let’s just be women.”", "images": ["https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_9672084bs-e1526397178948.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fnews%2Femilia-clarke-solo-star-wars-game-of-thrones-1202810966%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202810966&comment_count=2", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_9672084bs-e1526397178948.jpg?crop=63px%2C7px%2C896px%2C504px&resize=681%2C383", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_9672084bs-e1526397178948.jpg?w=1000", "keywords": [], "authors": ["Brent Lang"], "canonical_link": "https://variety.com/2018/film/news/emilia-clarke-solo-star-wars-game-of-thrones-1202810966/", "title": "Emilia Clarke on ‘Solo’ Director Shake-Up, ‘Game of Thrones’ Final Season", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"Solo: A Star Wars Story\" was the rare Hollywood blockbuster that changed directors in mid-shoot. With hundreds of millions of dollars on the line, the filmmakers shuffle could have doomed the picture and resulted in lots of bad blood on the set.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202810966, "author": "Brent Lang", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-05-15T07:58:18"}, "pmc-tag": "Cannes Film Festival,Emilia Clarke", "title": "Emilia Clarke on ‘Solo’ Director Shake-Up, ‘Game of Thrones’ Final Season", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Emilia Clarke on ‘Solo’ Director Shake-Up, ‘Game of Thrones’ Final Season", "url": "https://variety.com/2018/film/news/emilia-clarke-solo-star-wars-game-of-thrones-1202810966/", "description": "“Solo: A Star Wars Story” was the rare Hollywood blockbuster that changed directors in mid-shoot. With hundreds of millions of dollars on the line, the filmmakers shuffle could have doo…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_9672084bs-e1526397178948.jpg?w=1000", "width": 1000, "height": 562, "alt": "Actress Emilia Clarke poses for photographers during a photo call for the film 'Solo: A Star Wars Story' at the 71st international film festival, Cannes, southern France2018 Solo: A Star Wars Story Photo Call, Cannes, France - 15 May 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-05-15T14:58:18+00:00", "modified_time": "2018-05-16T04:53:27+00:00"}, "twitter": {"creator": "@https://twitter.com/BrentALang", "site": "@variety", "text": {"title": "Emilia Clarke on ‘Solo’ Director Shake-Up, ‘Game of Thrones’ Final Season"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_9672084bs-e1526397178948.jpg?w=1000", "alt": "Actress Emilia Clarke poses for photographers during a photo call for the film 'Solo: A Star Wars Story' at the 71st international film festival, Cannes, southern France2018 Solo: A Star Wars Story Photo Call, Cannes, France - 15 May 2018"}, "card": "summary_large_image", "title": "Emilia Clarke on ‘Solo’ Director Shake-Up, ‘Game of Thrones’ Final Season", "description": "“Solo: A Star Wars Story” was the rare Hollywood blockbuster that changed directors in mid-shoot. With hundreds of millions of dollars on the line, the filmmakers shuffle could have doo…"}, "author": "Brent Lang", "content_type": "Article", "post_id": 1202810966, "title": "Emilia Clarke on 'Solo' Director Shake-Up, 'Game of Thrones' Final Season", "published_at": "2018-05-15 07:58:18", "image": "https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_9672084bs-e1526397178948.jpg?w=1000", "comment_count": 2, "tags": "Emilia Clarke", "topics": "News", "appeared_in_print": "No", "body": "\"Solo: A Star Wars Story\" was the rare Hollywood blockbuster that changed directors in mid-shoot.\r\n\r\nWith hundreds of millions of dollars on the line, the filmmakers shuffle could have doomed the picture and resulted in lots of bad blood on the set. However, in an interview at the Cannes Film Festival on Tuesday, where \"Solo: A Star Wars Story\" is about to screen, Emilia Clarke said that the shift from directors Chris Lord and Phil Miller to Ron Howard was \"seamless.\"\r\n\r\nHoward, the Oscar-winning director of \"A Beautiful Mind,\" had no time to prep, Clarke said, but on his first day he immediately earned the trust of his cast and crew.\r\n\r\n\"He took us all in and listened to everyone,\" said Clarke, adding, \"He took us from this kind of 'what are we doing' to a place of such ease and comfort and fun.\"\r\n\r\nDuring an hour-long talk as part of the Kering Women in Motion talks, Clarke didn't say what happened to lead to Lord and Miller's firing, but the duo's improvisation-heavy style was reportedly alienating some actors and led to clashes with LucasFilm head Kathleen Kennedy. She did allude to substantial re-shoots, saying that her response when she'd revisit certain scenes was, \"Yes, thank goodness. I did not do that well.\"\r\n\r\nAlthough deathly afraid of \"Solo\" spoilers (she gripped the sides of her chair when asked), Clarke did tease that takes place in \"a part of Star Wars that we have not spent a huge amount of time in before: the dark, shady, gangster underworld.\"\r\n\r\nClarke flew to Cannes in the midst of shooting the final season of HBO's \"Game of Thrones,\" the fantasy epic series that features her playing the steel-willed Daenerys Targaryen. She confessed that she's not certain how all the palace intrigue and clashes for the Iron Throne will end.\r\n\r\n\"It will be what none of us think it will be,\" Clarke predicted.\r\n\r\nAfter seven seasons of playing the \"mother of dragons,\" Clarke sounds emotional about saying goodbye to the role that made her famous. \"It really feels like preparing to leave home...that's exciting, but it's sad and scary all at the same time,\" she said.\r\n\r\nMuch of the Women in Motion talk centered on issues facing female performers and filmmakers -- it's a conversation that's taking place as many women in the industry are pushing for equal pay, better opportunities, and a safer workplace.\r\n\r\nClarke said the “temperature changed dramatically” on sets after sexual harassment allegations broke against powerful industry figures such as Harvey Weinstein, Brett Ratner, and Kevin Spacey.\r\n\r\n\"You break the mold ...and then there's a huge amount of work that goes into addressing all that needs to be addressed,\" said Clarke.\r\n\r\nPart of that change may be instituting quotas on the number of women and minorities working on films and shows, Clarke said. Another component could require educating men about how they should behave in the workplace and the kinds of comments that are appropriate in a professional setting.\r\n\r\nOn \"Game of Thrones,\" Clarke is paid the same as all of her male co-stars. But the actress has made it clear to her representatives that she's not willing to make less. That's been difficult at times.\r\n\r\n\"Khaleesi aside, I'm not naturally aggressive as a human,\" said Clarke.\r\n\r\nOn \"Game of Thrones,\" Daenerys has managed to rise to the top of a patriarchal society by being as ruthless and cunning as her rivals. Those characteristics have led some journalists and critics to label her \"a strong woman.\" It's a descriptor that infuriates the actress.\r\n\r\n\"Find another adjective, damn it,\" said Clarke. \"Enough already with the strong women. Let's just be women.\"", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1526396298.0, "source": "https://variety.com", "summary": ""}