{"url": "http://toofab.com/2018/05/23/sarah-silverman-defends-al-franken-louis-ck-complicated-feelings/", "text": "Sarah Silverman has no problem defending Al Franken from the groping allegations that cost him his Senate seat, but has \"complicated\" feelings about friend Louis C.K., who owned up sexual harassment allegations last fall and has been shunned ever since.\n\n\"Life is complicated,\" Silverman told GQ about C.K. in an interview published Wednesday. \"Love is even more complicated. But you can't not do it. I don't have some definitive sound bite or nutshell of how I feel about [his sexual misconduct], even to myself. But I'm also okay with that.\"\n\nSilverman's friendship with C.K. stretches back over two decades, so when he admitted to masturbating in front of female comics, it was a tough pill to swallow. But she's not opposed to him mounting a comeback, as long as he's learned his lesson.\n\n\"I think that there are people who were caught and there were people who were not caught,\" she said, \"But the important thing is that they are forever changed. And if that's the case, I don't see any reason why they can't continue being artists. Now, whether they're popular artists or not is up to the audience.\"\n\n\"I have compassion. There are people that just deny everything they're accused of and they continue to be the politicians or the filmmakers that they are. And there are people that come and say, 'I'm guilty of these things, and I'm wrong, and I want to be changed from this,'\" she explained. \"And yet those are the ones that kind of are excommunicated forever. He's my brother, so it's hard. I may not have a very clear perspective on it, but I'm trying to.\"\n\n\"People are very sure about what is right and wrong until it comes to their front door,\" she added.\n\nWhen it comes to her friend Franken, though, her thoughts are much more clear. The \"SNL\" alum was accused of sexual harassment as well at the height of the #MeToo movement this past fall. Multiple women claimed that Franken kissed and groped them without consent. Although he denied most of these allegations, he ended up resigning from his Senate seat, which he held on behalf of Minnesota from 2009 to 2018.\n\nSilverman spoke to the politician and his wife after the scandal, and said she believes he is innocent.\n\n\"He and [his wife] Franni are devastated,\" Silverman said. \"I understand that I may have cognitive distortion, because I love him so much. But all I can say is, and he may not be excited about this, but he has no sexuality. I believe in my heart of heart of hearts he never copped a feel. The sketch, the whole Leeann Tweeden sketch, is online. You can see it for yourself. It's not funny, but it's innocuous. He may have touched some sideboob by accident, or a tush by accident, but I'm telling you, Franni is his best friend and constant companion, and he has eyes for no one else.\n\n\"I've worked with him for years,\" she continued. \"I'm so sad that he got bullied into resigning, because all he loved in this world was being a senator and representing the people of Minnesota. I've never met a more pure person.\"\n\n\"On the show, you saw him kiss me on the lips. There is nothing sexual about it. He's a Jewish grandpa. He gives you big, Jewish, wet-lipped kisses. This is a guy whose passion was serving people and making the world a better place. There's a lot of baby-in-bathwater stuff, I think. We'll just get it in the process.\"\n\nThe comedy issue of \"GQ\" is available everywhere on newsstands May 29th and \"I Love You, America\" Season 2 premieres September 6 on Hulu.\n\nGQ\n\nGetty", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://toofab.akamaized.net/2018/05/23/gq-cover-inset-1.jpg", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2018/05/23/sarah-silverman-gq-inset-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2018/05/23/sarah-silverman-gq-inset-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/05/23/sarah-silverman-defends-al-franken-louis-ck-complicated-feelings/", "title": "Sarah Silverman Defends Al Franken From Groping Allegations and Shares 'Complicated' Feelings on Louis C.K.", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Sarah Silverman Defends Al Franken From Groping Allegations and Shares 'Complicated' Feelings on Louis C.K.", "description": "Sarah Silverman believes Al Franken is innocent after sexual harassment allegations torpedoed his political career, but she's not sure what to say about Louis CK.", "image": "https://toofab.akamaized.net/2018/05/23/sarah-silverman-gq-inset-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Sarah Silverman believes Al Franken is innocent after sexual harassment allegations torpedoed his political career, but she's not sure what to say about Louis CK.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/05/23/sarah-silverman-defends-al-franken-louis-ck-complicated-feelings/", "site_name": "toofab", "type": "article", "title": "Sarah Silverman Defends Al Franken From Groping Allegations and Shares 'Complicated' Feelings on Louis C.K.", "description": "Sarah Silverman believes Al Franken is innocent after sexual harassment allegations torpedoed his political career, but she's not sure what to say about Louis CK.", "image": "https://toofab.akamaized.net/2018/05/23/sarah-silverman-gq-inset-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1527004800.0, "source": "http://toofab.com", "summary": ""}