{"url": "https://popculture.com/country-music/2018/06/11/carrie-underwood-husband-mike-fisher-sings-ugly-cry-pretty/", "text": "Carrie Underwood posted a hilarious video of her husband, hockey player Mike Fisher, trying to sing to her new hit single \"Cry Pretty\" Saturday.\n\nWhile driving around, Fisher did his best to hit the same notes his wife hits in the song, but failed spectacularly. \"No, no, no, no, no, nononono noooooo,\" he wails behind the wheel.\n\n\"You going to start your new career as a country singer, babe?\" Underwood asks from the passenger seat.\n\n\"I've heard that many times,\" Fisher says before going back to singing \"Nooooo.\"\n\nThere was at least one person in the car who appreciated the scene. Their son, Isaiah Michael Fisher, is heard laughing hysterically in the background.\n\n\"Sounds just like the original,\" Underwood wrote in the caption, adding a zany face emoji.\n\nFans loved the funny video, especially Isiah's laughing in the back.\n\n\"Hahaha. Too funny. The giggling from backseat is priceless,\" one wrote.\n\n\"Love hearing that sweet giggle,\" added another.\n\nUnderwood shared the adorable family moment the same weekend they celebrated Fisher's birthday. He turned 38 on Tuesday, but they waited until the weekend since Underwood was busy at the CMA Music Festival. He got a special hat-shaped cake that read \"Catchin' Deers.\"\n\nThe singer also performed at the CMT Awards on Tuesday, belting out \"Cry Pretty\" while wearing glitter around her eyes to recreate the song's single art.\n\n\"Cry Pretty\" is the title track of Underwood's sixth studio album. The song was written with The Love Junkies, made up of Hillary Lindsey, Lori McKenna and Liz Rose.\n\n\"The first single is a song I love so much and can’t wait to share with you,\" Underwood said in a statement in April. \"The title refers to when emotions take over and you just can’t hold them back. It really speaks to a lot of things that have happened in the past year and I hope when you hear it, you can relate those feelings to those times in your life. It’s emotional. It’s real. And it ROCKS!\"\n\nCry Pretty the album comes out on Sept. 14. Hopefully Fisher's version is included as a bonus track.\n\nFisher is an NHL veteran and reached the Stanley Cup Finals with the Nashville Predators after the 2016-17 season. He retired after the series, but returned to the Predators partway through the 2017-18 season. After they lost in the playoffs to the Winnipeg Jets, Fisher announced his plans to retire for good.", "images": ["https://media.popculture.com/2018/01/mike-fisher-carrie-underwood-getty-rick-diamond-staff-20024664-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/01/mike-fisher-carrie-underwood-getty-rick-diamond-staff-20024664-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/country-music/2018/06/11/carrie-underwood-husband-mike-fisher-sings-ugly-cry-pretty/", "title": "Carrie Underwood's Husband Mike Fisher Sings Ugly to 'Cry Pretty'", "meta_data": {"description": "Carrie Underwood posted a hilarious video of her husband, hockey player Mike Fisher, trying to sing to her new hit single 'Cry Pretty' Saturday.Sounds just like the original...🤪 #CryPretty @mfisher1212A post shared by  Carrie Underwood (@carrieunderwood) on Jun 9, 2018 at 11:03am PDT While [...]", "keywords": "Carrie Underwood,Instagram,Mike Fisher", "news_keywords": "Carrie Underwood,Instagram,Mike Fisher", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "dsl89", "title": "Carrie Underwood's Husband Mike Fisher Sings Ugly to 'Cry Pretty'", "description": "Carrie Underwood posted a hilarious video of her husband, hockey player Mike Fisher, trying to [...]", "image": "https://media.popculture.com/2018/01/mike-fisher-carrie-underwood-getty-rick-diamond-staff-20024664-640x320.jpeg"}, "og": {"title": "Carrie Underwood's Husband Mike Fisher Sings Ugly to 'Cry Pretty'", "type": "article", "url": "https://popculture.com/country-music/2018/06/11/carrie-underwood-husband-mike-fisher-sings-ugly-cry-pretty/", "image": {"identifier": "https://media.popculture.com/2018/01/mike-fisher-carrie-underwood-getty-rick-diamond-staff-20024664-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Country Music", "description": "Carrie Underwood posted a hilarious video of her husband, hockey player Mike Fisher, trying to [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1528646400.0, "source": "https://popculture.com", "summary": ""}