{"url": "http://www.newslocker.com/en-us/news/celebrity/the-beckhams-the-wilsons-amp-more-celeb-couples-who-do-charity-work-together/", "text": "Victoria Beckham Celebrates a 'Stranger Birthday Than Usual' at Home amid Coronavirus Pandemic Victoria Beckham is spicing up another year of life!\n\nThe former Spice Girl singer celebrated her 46th birthday on Friday, and expressed how she’s feeling grateful to be surrounded by family as her husband David Beckham and three of their four kids are self-isolating together in their U.K. home.\n\nBeckham documented her special day on social media, sharing with fans that she went for a family bike ride, hosted a virtual dance party on Instagram Live and topped off the evening with a chocolate Read more\n\nTom Brady and Gisele Bündchen Fund Over 10 Million Meals amid Coronavirus Pandemic Tom Brady and Gisele Bündchen are doing their part to help those in need during the coronavirus (COVID-19) pandemic.\n\nThe NFL star, 42, partnered with Wheels Up to donate 10 million meals to Feeding America, he announced earlier this month. “Happy to support those in need and we all must continue to support each other,” Brady wrote on his Instagram Story Friday.\n\nBündchen, 39, also spoke about giving back and supporting others amid the global health crisis. “I’ve Read more\n\nLady Gaga Calls Boyfriend Michael Polansky the 'Love of My Life' Lady Gaga isn’t afraid to declare her “Stupid Love”!\n\nThe pop star, 34, revealed her love for boyfriend Michael Polansky during an appearance on MSNBC’s Morning Joe on Friday, where she discussed the upcoming One World: Together At Home concert on Saturday night.\n\nWhile discussing mental health and the novel coronavirus (COID-19) pandemic with hosts Mika Brzezinski and Joe Scarborough, Gaga casually called Polansky the “love” of her life.\n\n“With Born This W Read more\n\nReese Witherspoon and Lucy Hale Love to Wear This Hands-Free Bag Trend It’s no secret that we’re all trying to touch fewer things these days. That’s why it should come as no surprise that certain hands-free accessories, like fanny packs, have been on the uptick.\n\nRELATED: Reese Witherspoon, Jennifer Garner, and Taraji P. Henson All Agree on This Controversial Leggings Trend\n\nPeople certainly have their own opinions about the fanny pack, but the controversial throwback trend seems all the more relevant right now. And we’re not the only ones who Read more\n\nGianna Bryant, Alyssa Altobelli and Payton Chester Honored During WNBA Draft Gianna Bryant‘s dreams of being drafted into the WNBA came true on Friday, nearly three months after the tragic helicopter crash that killed the 13-year-old, her father Kobe Bryant and seven others.\n\nDuring the WNBA draft on Friday, commissioner Cathy Englebert named Gianna and her Mamba Academy teammates Alyssa Altobelli and Payton Chester, who also died in the crash, honorary draftees.\n\nEnglebert read out the three girls’ names just as she would announce any other draftee in a t Read more\n\nRunaway June's Jennifer Wayne Reveals She Was 'Rocked' by Coronavirus — and Will Be Donating Plasma Jennifer Wayne is opening up about her experience with the novel coronavirus and how she was able to fight off the illness.\n\nOn Wednesday, the Runaway June member revealed on Instagram that she had been “rocked” by the respiratory virus and was “struggling with whether or not to share” that she had contracted the disease.\n\nIn the post, the 38-year-old explained that she ultimately decided to go public with the news after having so many people reach out and to ask about her Read more\n\nIf You've Had Coronavirus, It's Still Best to Stay Home Until Experts Say It's Safe As governors begin to weigh lifting stay at home orders their states, there are still many unknowns about the new coronavirus, COVID-19, that are making experts wary of reopening the country.\n\nAs of April 17, there have been at least 667,945 COVID-19 cases in the U.S., though the true number is believed to be far higher due to the lack of available testing. While experts hope that the thousands of people who have recovered from the virus are now immune, they do not know for sure, and that’s Read more\n\nEven If You've Had Coronavirus, It's Best to Stay Home Until Experts Say It's Safe As governors begin to weigh lifting stay at home orders their states, there are still many unknowns about the new coronavirus, COVID-19, that are making experts wary of reopening the country.\n\nAs of April 17, there have been at least 667,945 COVID-19 cases in the U.S., though the true number is believed to be far higher due to the lack of available testing. While experts hope that the thousands of people who have recovered from the virus are now immune, they do not know for sure, and that’s Read more\n\nHow Jensen Ackles Introduced His Supernatural Costar Jeffrey Dean Morgan to Hilarie Burton Forget a match made in heaven — Jeffrey Dean Morgan and Hilarie Burton were a match made in an Irish pub.\n\nThe couple is launching a new weekly video-chat-based show on AMC, Friday Night in with the Morgans, filmed from their farm in upstate New York. In a sneak peek at the premiere posted by Entertainment Weekly, the stars welcome one of their first guests, Jensen Ackles.\n\nIn the clip, Ackles, 42, shares the story of how he introduced his former Supernatural costar Morgan to One T Read more\n\nBrews Brothers' Mike Castle Says He Was 'Enamored' with Wife Lauren Lapkus Before They Even Met Mike Castle is making his dreams come true one joke at a time.\n\nIn this week’s issue of PEOPLE, the Chicago native, 31, opens up about how he got his start in comedy, why his most recent role in Netflix’s Brews Brothers is a “dream come true,” and why he and his wife, actress and Orange Is the New Black star Lauren Lapkus, are the perfect match.\n\n“I grew up in Chicago and started doing improv at Second City when I was 13,” Castle tells PEOPLE. “I grew up i Read more\n\nWatch Shailene Woodley and Sebastian Stan Sing Karaoke Together During Late Night Out Shailene Woodley and Sebastian Stan are a karaoke match made in heaven!\n\nOn Thursday, Woodley, 28, shared on Instagram two videos of herself and Stan, 37, singing together while blowing off steam in-between takes of their new movie Endings, Beginnings. For the karaoke-filled night out, the costars belted both “Hungry Eyes” by Eric Carmen and the Cyndi Lauper hit “Time After Time.”\n\nThe scene partners showed off their vocals in the playful clips, with Stan at one point seemi Read more\n\nJulianne Hough Takes Walk with Actor Ben Barnes While Social Distancing in L.A. Julianne Hough is spending time with a friend amid the coronavirus pandemic.\n\nOn Thursday, Hough, 31, was spotted walking in her socks with Westworld actor Ben Barnes in Los Angeles. The actress wore all black and sunglasses as she toted her shoes in her hands, showing off her dog-patterned socks. Barnes, 38, walked beside Hough wearing a black shirt, shades and gray sweat shorts for the sunny outing. Hough and Barnes appear to have been friends for years; they posed together at HBO’s Emmys Read more", "images": ["https://img.newslocker.com/2020/04/18/205343235_725.jpg", "https://img.newslocker.com/2020/04/18/205339055_725.jpg", "https://img.newslocker.com/2020/04/18/205292159_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/04/18/205295865_725.jpg", "https://img.newslocker.com/2020/04/18/205290320_350.jpg", "https://img.newslocker.com/2020/04/17/205281563_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419170459-600.Faith-Hill-Tim-McGraw-Charity.kg.041917.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/04/17/205274936_725.jpg", "https://img.newslocker.com/2020/04/17/205280367_725.jpg", "https://img.newslocker.com/2020/04/17/205283424_725.jpg", "https://img.newslocker.com/2020/04/18/205287800_725.jpg", "https://img.newslocker.com/2020/04/18/205296608_725.jpg", "https://img.newslocker.com/2020/04/17/205283423_725.jpg", "https://img.newslocker.com/2020/04/18/205334704_725.jpg", "https://img.newslocker.com/2020/04/17/205284918_725.jpg", "https://img.newslocker.com/2020/04/18/205340976_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img.newslocker.com/2020/04/17/205282131_725.jpg", "https://img.newslocker.com/2020/04/18/205288879_725.jpg", "https://img.newslocker.com/2020/04/18/205286189_725.jpg", "https://img.newslocker.com/2020/04/17/205275580_725.jpg", "https://img.newslocker.com/2020/04/18/205297947_725.jpg", "https://img.newslocker.com/2020/04/18/205290319_350.jpg", "https://img.newslocker.com/2020/04/17/205276734_725.jpg", "https://img.newslocker.com/2020/04/17/205278005_725.jpg", "https://img.newslocker.com/2020/04/17/205279238_725.jpg", "https://img.newslocker.com/2020/04/17/205283000_725.jpg", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/newslocker-cube.png", "https://img.newslocker.com/2020/04/17/205281177_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/04/18/205339054_725.jpg", "https://img.newslocker.com/2020/04/18/205340596_725.jpg", "https://img.newslocker.com/2020/04/18/205290318_350.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419170459-600.Faith-Hill-Tim-McGraw-Charity.kg.041917.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/the-beckhams-the-wilsons-amp-more-celeb-couples-who-do-charity-work-together/", "title": "The Beckhams, The Wilsons & More Celeb Couples Who Do Charity Work Together", "meta_data": {"description": "Besides supermodel good looks, David and Victoria Beckham sound like some super parents.Last year, the famous couple cheered on their middle son as he competed in the children's race...", "og": {"title": "The Beckhams, The Wilsons & More Celeb Couples Who Do Charity Work Together - Celebrity news - NewsLocker", "description": "Besides supermodel good looks, David and Victoria Beckham sound like some super parents.Last year, the famous couple cheered on their middle son as he competed in the children's race...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/the-beckhams-the-wilsons-amp-more-celeb-couples-who-do-charity-work-together/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419170459-600.Faith-Hill-Tim-McGraw-Charity.kg.041917.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492855200.0, "source": "http://www.newslocker.com", "summary": ""}