{"url": "https://www.cheatsheet.com/entertainment/how-meghan-markle-is-getting-ready-for-life-as-a-royal.html/", "text": "With Meghan Markle and Prince Harry’s wedding now over, the former actress is settling into her new life as a royal. But before she married into the famous family, she received “princess-in-training” lessons consisting of everything from learning how to curtsy to life-saving tactics she can use in the event that she is ever kidnapped.\n\nHere’s more on the special hostage training Markle received, plus a look at some of the rules she must follow and the things she had to give up.\n\nNo selfies with fans\n\nShe might have to disappoint a few fans. | She might have to disappoint a few fans. | Meghan Markle via Instagram\n\nThis rule may not be set in stone, but taking selfies with fans is something the royals typically do not do. Therefore, Markle may have to turn down any picture requests she gets from the public.\n\nLainey Gossip noted that the new royal already explained to some fans that she is unable to take any snaps. During a walk at Nottingham, a fan asked for a photo with her and she said, “We’re not allowed.”\n\nThe same goes for autographs, mainly because the royals simply wouldn’t have the time to get to everyone.\n\nNo more acting\n\nShe will be focusing her energy on other responsibilities. | She will be focusing her energy on other responsibilities. | Meghan Markle via Instagram\n\nShortly after their engagement announcement was made, Markle revealed in the couple’s first joint interview that she was retiring from acting. This didn’t come as much of a surprise since everyone figured that she wouldn’t be returning to film Suits after marrying a prince.\n\nMarkle said about leaving the USA network show:\n\nI see it is a new change, a new chapter. I’ve been working on my show seven years, we were so fortunate to have that longevity on a series. For me, once we hit the 100 episode marker, I thought, I have ticked this box and I feel really proud of the work we’ve done there and now it’s time to work as a team with [Harry].\n\nVIP hostage training\n\nShe will have to be trained to handle emergencies. | Chris Jackson/Getty Images She will have to be trained to handle emergencies. | Chris Jackson/Getty Images\n\nThe downside to marrying such a recognizable member of the royal family is that you then can become a target. This is the case for Markle and the reason she had to undergo special training from elite military ops in case she is ever taken hostage.\n\n“When you are part of the royal family, suddenly, you become a victim for ISIS, for a terrorist group, for a kidnapping,” terrorism expert Robert Strang told Inside Edition and Markle being an American makes her even more of a target. Some of what she learned included how to cope mentally and physically, how to alert authorities and loved ones, and how to stay alive in such a situation.\n\nThis training is nothing new for the royals, but the news that Markle received it came after a chilling report that ISIS had targeted Prince George’s preschool recently.\n\nRoyal fashion do’s and don’ts\n\nShe will have to stock up on pantyhose. | Chris Jackson/Getty Images She will have to stock up on pantyhose. | Chris Jackson/Getty Images\n\nMarkle committed her first royal fashion faux pas when she and Harry appeared together in the Sunken Garden at Kensington Palace following the news of their engagement, and she didn’t wearing pantyhose. That’s a big no-no in the royal family. For example, the queen and Kate Middleton almost always wear sheer hose in public.\n\nIt’s also safe to say that we won’t see Markle in revealing outfits. Black dresses are also not acceptable to wear during royal enagaements. Even though Princess Diana once broke this rule at an affair with Princess Grace. Black dresses are usually only worn to funerals.\n\nIt’s a learning curve for Markle, but she’s still getting adjusted to the do’s and don’ts of royal fashioN and can always call the Duchess of Cambridge for some expert advice.\n\nProper table etiquette\n\nShe’ll need to learn specific table etiquette. | Adrian Dennis/ WPA Pool/Getty Images She’ll need to learn specific table etiquette. | Adrian Dennis/ WPA Pool/Getty Images\n\nLearning how the table is set and which fork to use WAS important for Markle to learn. Before you start drawing Julia Roberts in Pretty Woman comparisons here, no matter how good Markle’s table mannerisms were she had to learn the British etiquette which is different from how Americans dine.\n\nShe was prepped on other things too, like what appropriate conversations are to be discussed at the dinner table.\n\nHow to address other royals\n\nShe has to learn to properly address other royals. | Chris Jackson/Getty Images She has to learn to properly address other royals. | Chris Jackson/Getty Images\n\nMarkle has also learned how to address and behave around the queen and other members of the royal family.\n\nShe was taught how to properly address dignitaries abroad as well. In addition, she’ll be expected to have a firm grasp on the workings of the state.\n\nHow to curtsy\n\nWill Kate Middleton help her out with this one? | Chris Jackson/Getty Images Will Kate Middleton help her out with this one? | Chris Jackson/Getty Images\n\nFinally, Markle had to master the proper way to curtsy. The act is done by tucking one leg back with a slight bend in the knee, while also nodding the head.\n\nMarkle needs to do this when greeting those with higher royal rankings, including Queen Elizabeth II, Prince Philip, and Prince Charles.\n\nFollow Michelle Kapusta on Twitter @philamichelle.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-close-up.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-in-a-dressing-room-640x458.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Markle-taking-a-selfie-640x455.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-and-Prince-Harry-640x461.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Markle-taking-a-selfie-640x455.png", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-without-pantyhose-640x474.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-pushing-her-hair-back-640x427.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/11/Meghan-Markle-Close-Up-622x500.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Markle-taking-a-selfie-640x455.png", "keywords": [], "authors": ["Michelle Kapusta"], "canonical_link": "https://www.cheatsheet.com/entertainment/how-meghan-markle-is-getting-ready-for-life-as-a-royal.html/", "title": "How Meghan Markle Prepared for Life as a Royal", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/how-meghan-markle-is-getting-ready-for-life-as-a-royal.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Meghan Markle must undergo royal training now that she's engaged to Prince Harry. Here's a look at how she is preparing for life at the palace.", "og": {"locale": "en_US", "type": "article", "title": "How Meghan Markle Prepared for Life as a Royal", "description": "Meghan Markle must undergo royal training now that she's engaged to Prince Harry. Here's a look at how she is preparing for life at the palace.", "url": "https://www.cheatsheet.com/entertainment/how-meghan-markle-is-getting-ready-for-life-as-a-royal.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-29T22:52:59-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Markle-taking-a-selfie-640x455.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Markle-taking-a-selfie-640x455.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "royal family", "section": "Entertainment", "published_time": "2018-06-15T18:30:00-04:00", "modified_time": "2018-06-29T22:52:59-04:00"}, "twitter": {"card": "summary_large_image", "description": "Meghan Markle must undergo royal training now that she's engaged to Prince Harry. Here's a look at how she is preparing for life at the palace.", "title": "How Meghan Markle Prepared for Life as a Royal", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Markle-taking-a-selfie-640x455.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529101800.0, "source": "https://www.cheatsheet.com", "summary": ""}