{"url": "https://web.archive.org/web/20090919163055/http://www.whitehouse.gov/the_press_office/Remarks-by-the-First-Lady-on-What-Health-Insurance-Reform-Means-for-Women-and-Families/", "text": "THE WHITE HOUSE\n\nOffice of the First Lady\n\n_____________________________________________________________________\n\nFor Immediate Release September 18, 2009\n\nREMARKS BY THE FIRST LADY\n\nON WHAT HEALTH INSURANCE REFORM MEANS\n\nFOR WOMEN AND FAMILIES\n\nEisenhower Executive Office Building\n\nRoom 450\n\n11:33 A.M. EDT\n\nMRS. OBAMA: Thank you. Thank you all. Please, sit. Rest. (Laughter.) First of all, good morning. I am so thrilled to see so many of you here this morning at the White House. Welcome. And that's including my good friend, Dr. Dorothy Height. (Applause.) You know, she is always there, for the past eight months and before. If there was a big event, an important event, she finds a way to be here. She is my inspiration, and it is wonderful to see you again today. Thank you so much. (Applause.)\n\n\n\nThank you all for joining us today for the outstanding work you're doing every day on behalf of women and families all across this country. I have to thank our extraordinary Secretary of Health and Human Services, Kathleen Sebelius, for taking the time to be here. (Applause.) And for her tireless efforts to keep our nation healthy. And that includes not just pushing for health insurance reform but preparing us for H1N1, pursuing cutting-edge research to find treatments and cures for tomorrow. Clearly this is not the easiest portfolio she could have, but she is doing a terrific job, and we are grateful for her leadership.\n\nAnd I also want to thank Tina Tchen, who you all know, for emceeing today. (Applause.) She, too, is doing a fabulous job as Director of our Office of Public Engagement, and she played a critical role in pulling together today's event -- not just as an emcee but as a key figurehead, making sure that we're all aware of what's going on.\n\nAnd finally, I want to thank the three women behind me -- to Debi, Easter, and Roxi. (Applause.) It is not easy to come here and tell your story. And these stories aren't new. You know, these stories are happening all over this country, not just for thousands of women -- for millions of them. For two years on the campaign trail, this was what I heard from women, that they were being crushed, crushed by the current structure of our health care. Crushed. But these stories that we've heard today, and all of us -- if we're not experiencing it, we know someone who is. These are the stories that remind us about what's at stake in this debate. This is really all that matters. This is why we are fighting so hard for health insurance reform. This is it. This is the face of the fight.\n\nAnd that's why I'd like to talk to you today. That's why I'm here. That's why reform is so critical in this country -- not tomorrow, not in a few years, but right now. People are hurting in this country right now.\n\nBut there is also a reason why I invited this particular group to talk today. There's a reason why we've invited the leaders not only from family advocacy groups and health care advocacy groups, but for so many organizations that have been fighting for decades for empowerment for women. And that's because when it comes to health care, as the Secretary said, as we all know, women play a unique and increasingly significant role in our families. We know the pain, because we are usually the ones dealing with it.\n\nEight in 10 women, mothers, report that they're the ones responsible for choosing their children's doctor, for getting them to their checkups, for managing that follow-up care. Women are the ones to do it. Mothers are the ones that do it. And many women find themselves doing the same thing for their spouses. (Laughter.) And more than 10 percent of women in this country are currently caring for a sick or elderly relative. It's often a parent, but it could a grandparent, or a mother -- or a relative of some sort -- but it's often a parent. So they're making critical health care decisions for those family members as well.\n\nIn other words, being part of the sandwich generation, is what we are now finding, raising kids while caring for a sick or elderly parent, that's not just a work/family balance issue anymore. It's not just an economic issue anymore. More and more it is a health care issue. It's something that I have thought a great deal about as a mother.\n\nI will never forget the time eight years ago when Sasha was four months that she would not stop crying. And she was not a crier, so we knew something was wrong. So we fortunately were able to take her to our pediatrician that next morning. He examined her and same something's wrong. We didn't know what. But he told us that she could have meningitis. So we were terrified. He said, get to the emergency room right away.\n\nAnd fortunately for us, things worked out, because she is now the Sasha that we all know and love today -- (laughter) -- who is causing me great -- excitement. (Laughter.)\n\nBut it is that moment in our lives that flashes through my head every time we engage in this health insurance conversation. It's that moment in my life. Because I think about what on earth would we have done if we had not had insurance. What would have happened to that beautiful little girl if we hadn't been able to get to a pediatrician who was able to get us to an emergency room? The consequences I can't even imagine. She could have lost her hearing. She could have lost her life if we had had to wait because of insurance.\n\nAnd it was also fortunate that we happened to have good insurance, right? Because if we hadn't had good insurance, like many of the panelists up here, we would have been saddled with costs for covering that emergency room visit for her two days in the hospital. We would have still been paying off those bills.\n\nAnd this issue isn't something that I've thought about as a mother. I think about it as a daughter. As many of you know, my father had multiple sclerosis. He contracted it in his twenties. And as you all know, my father was a rock. He was able to get up and go to work every day, even though it got harder for him as he got sicker and more debilitated. And I find myself thinking, what would we have done as a family on the South Side of Chicago if my father hadn't had insurance, if he hadn't been able to cover his treatments? What would it have done to him to think that his illness could have put his entire family into bankruptcy? And what if he had lost his job, which fortunately he never did? What if his company had changed insurance, which fortunately never happened, and we became one of the millions of Americans, families, who can't get insurance because of a preexisting condition?\n\nSo these are the thoughts that run through my mind as I watch this debate and hope that we get it right.\n\nBut let's be clear: Women aren't just disproportionately affected by this issue because of the roles that we play in families. As Tina and Kathleen mentioned, women are affected because of the jobs that we do in this economy. We all know that women are more likely to work part-time, or to work in small companies or businesses that don't provide any insurance at all.\n\nWomen are affected because, as we heard, in many states, insurance companies can still discriminate because of gender. And this is still shocking to me. These are the kind of facts that still wake me up at night; that women in this country have been denied coverage because of preexisting conditions like having a C-section or having had a baby. In some states, it is still legal to deny a woman coverage because she's been the victim of domestic violence.\n\nAnd a recent study showed that 25-year-old women are charged up to 45 percent more for insurance than 25-year-old men for the exact same coverage. And as the age goes up, you get to 40, that disparity increases to 48 percent -- 48 percent difference for women for the exact same coverage in this country.\n\nBut it's not just women without insurance, as we've heard, as we know who are affected. Plenty of women have insurance. But it doesn't cover basic women's health services like maternity care or preventative care like mammograms or pap smears, which we all know we have to have. We can't go without these basic services. But many insurance policies don't even cover it.\n\nOr policies cap the amount of coverage that you can receive, as you've heard, or it drops coverage when people get sick and they really need the care. Or maybe people have coverage but they're worried about losing it if they lose their jobs or if they change jobs or if the company changes insurance carriers. Out-of-pocket costs get higher and higher. It's hard to be able to plan your monthly bills when you don't know what your premiums are going to be. So a lot of people find they have to drop their insurance because they can no longer afford it.\n\nJust think about it. Many women are being charged more in health care coverage, but as we all know, women are earning less. We all know that women earn 78 cents on the dollar to every men -- to a man. So it's not exactly surprising when we hear statistics that more than half of women report putting off needed medical care simply because they can't afford it.\n\nNow, we have trouble putting ourselves first when we have the resources -- just making the appointment when you have insurance to get your regular screenings, to take care of those illnesses, those bumps and lumps and pains that we tend to ignore. But then not to be able to do it because you can't have insurance, you don't have insurance -- it's not surprising that so many millions of women around this country are simply going without insurance at all.\n\nSee, and the thing that we all know is that the current state -- this current situation is unacceptable. It is unacceptable. (Applause.) No one in this country should be treated that way. It's not fair. It's not right. And these are hard-working people we're talking about, right? People who care about their kids, care about their lives. And these circumstances could happen to any of us. This is one of those, \"There but for the grace of God go I\" kind of situations. None of us are exempt -- ever.\n\nSo I think it's clear that health insurance reform and what it means for our families is very much a women's issue. It is very much a women's issue.\n\nAnd if we want to achieve true equality for women, if that is our goal; if we want to ensure that women have opportunities that they deserve, if that is our goal; if we want women to be able to care for their families and pursue things that they could never imagine, then we have to reform the system. We have to reform the system. The status quo is unacceptable. It is holding women and families back, and we know it.\n\nFortunately, that is exactly what my husband's plan proposes to do, and it's important for us to understand some of the basic principles of that plan. Under his plan, if you don't have insurance now, or you lose your insurance at some point in the future, you'll be able to purchase affordable coverage through an insurance exchange -- a marketplace with a variety of options that will let you compare prices and benefits. This is exactly the approach that is used to provide members of Congress with insurance. So the thought is that if it's good enough for members of Congress, it should be good enough for the people who vote them in. (Applause.)\n\nAnd this is also an important part of the plan. If you already have insurance -- and it seems that there are a lot of people who are worried that they'll lose what they have under this plan -- but under this plan, if you already have insurance, you're set. Nothing changes. You keep your insurance, you keep your doctors -- and you're blessed. (Laughter.) This plan just puts in place some basic rules of the road to protect you from the kinds of abuses and unfair practices that we've heard.\n\nUnder this plan, insurance companies will never again be allowed to deny people like Debi and her son coverage for preexisting conditions. Sounds like a good thing. So whether you have breast cancer, diabetes, asthma, or hypertension -- or even just had a C-section, or some mental health treatment that you had in your past -- none of that will be a reason to refuse you coverage under the plan that my husband is proposing. Because when you're fighting an illness, he believes that you shouldn't also have to be in the process of fighting the insurance companies at the same time. (Applause.) It's a basic idea.\n\nUnder this plan, insurance companies will no longer be able to drop your coverage when you get too sick, or refuse to pay for the care that you need, or to set a cap on the amount of coverage that you can get. And it will limit how much they can charge you for out-of-pocket expenses, because getting sick in this country shouldn't mean that you go bankrupt. That's a basic principle of this plan.\n\nAnd finally, this plan will require insurance companies to cover basic preventative care. Seems simple. (Applause.) From routine checkups, to mammograms, to pap smears -- and this would come at no extra charge to the patient, so folks like Roxi can get the chance to get the kind of screenings that she needs to save her life, because we already know that if we catch diseases like cancer early -- we know this -- it's much less costly to treat, and we might just be able to save some lives. We know this.\n\nSo, under this plan, we can save lives and we can save money. It's not just good medicine but it's good economics as well.\n\nSo I think this is a pretty reasonable plan. I don't know about you. (Applause.) But I know many of you believe it's a good plan as well. And I know that many of the groups that you represent believe that what we're doing here, this fight, is important. It's important to this country, it's important to women, it's important to families that we succeed.\n\nAnd now more than ever, as Tina said, as Secretary Sebelius said, we need to act. No longer can we sit by and watch the debate take on a life of its own. It is up to us to get involved, because what we have to remember is that now more than ever, we have to channel our passions into change.\n\nThat's nothing that you all haven't done before, right? (Laughter.) You all have been the driving force behind so many of our greatest health care achievements, whether it's been children's health insurance; to funding breast cancer research, stem cell research; to passing the Family Medical Leave Act. The folks in this room, you're the ones that made those phone calls, right? That you wrote those letters, you knocked on those doors. You're the ones that helped make that happen.\n\nAnd that's exactly what we need you to do today for health insurance reform. We are going to need you over the next few weeks to mobilize like you've never mobilized before. We need you to educate your members about what the plan really is and what it isn't, because education is the key to understanding, and it's going to take phone calls to explain, to talk things through, to make sure that people understand not just what's at stake but what this all means.\n\nAnd we know there will be all sorts of myths and misconceptions about what the plan is and isn't, so it's so important that you make sure that people know the facts, and at least they make their decisions based on the truth of what this plan is and isn't. We need you to make your voices heard right here in Washington. And you all know how to do that. (Laughter.)\n\nAnd no, it won't be easy, because there are always folks who are a little afraid of change. We all understand that. We talked about this all during the campaign. Change is hard. Sometimes the status quo, even if it isn't right, feels comfortable because it's what we know. So it is understandable that people are cautious about moving into a new place in this society. There will always be folks who will want things to stay just the way they are, to settle for the world as it is. We talked about that so much. This is one of those times.\n\nBut look, I am here today, standing before you as the First Lady of the United States of America, because you all didn't settle for the world as it is, right? (Applause.) You refused to settle. And as a result of many of your efforts, as a young girl, I was able to dream in ways that I could have never imagined, that my mother could never have imagined, that my grandmother could never have imagined. And thanks to so many of you, I am raising these beautiful young women, you know -- (applause) -- who are going to be able to think so differently about their place in the world because of the work that you've done.\n\n\n\nHealth care reform is part of that movement. Health insurance reform is the next step. So we're going to need you all, focused and clear, picking up the phones, talking, calling, writing your congressmen and women, making this something that is the highest priority for all of us, so that we can make sure that every single family in this country can move forward as we hope that they can; that they don't have to worry about whether they can insure themselves. They don't have to worry about whether their kids are going to break an arm. That's what kids do, they break stuff. (Laughter.)\n\nSo I am grateful for all of you, for the work that you've done, and for what I know that we can do together over the next several weeks. But we have to be, what, fired up and what?\n\nAUDIENCE: Ready to go!\n\nMRS. OBAMA: And ready to go. A little fired up and ready to go. So thank you so much. God bless you all, and God bless America. (Applause.)\n\nEND\n\n11:57 A.M. EDT\n\n", "images": ["https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/images/eop/sftr-whgov.gif", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/assets/images/get_connected_01.jpg", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/assets/images/home_touts_03.jpg", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/images/eop/hdr-usa-flag.gif", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/assets/tout/fy-2010-budget.jpg", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/images/eop/clear.gif", "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/assets/tout/smc_nt_04.jpg", "https://web.archive.org/web/20090919163055im_/http://statse.webtrendslive.com/dcs0l9nq800000ctek411lue6_2c8b/njs.gif?dcsuri=/nojavascript&WT.js=No&DCS.dcscfg=1&WT.tv=8.6.0"], "top_img": "https://web.archive.org/web/20090919163055im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Remarks by the First Lady on What Health Insurance Reform Means for Women and Families", "meta_data": {"keywords": "President, Barack Obama, White House, United States of America, 44th President, White House history, President Obama, Barck, Barek, Barak, Barrack, Barrak, Obma, Barack", "description": "WhiteHouse.gov is the official web site for the White House and President Barack Obama, the 44th President of the United States. This site is a source for information about the President, White House news and policies, White House history, and the federal government."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}