{"url": "garner315.rssing.com/chan-9362901/all_p13.html", "text": "Ben Affleck, Jennifer Garner and Lindsay Shookus are not in a “love triangle,” despite a false tabloid report. Gossip Cop can exclusively debunk the supposed drama. We’re told it’s entirely fabricated. According to OK!, Affleck’s girlfriend is becoming increasingly frustrated by the actor’s friendship with his estranged wife, so much so that she’s given him an ultimatum. “Every time things seem to be going well, something happens to remind her that Jen and the kids come first,” a so-called “source” tells the magazine. Late last month, Shookus visited Affleck in Hawaii, where he’s shooting the upcoming Netflix movie Triple Frontier. Meanwhile, Garner traveled to the tropical island with her and the actor’s three kids over Easter weekend. Using this as a jumping off point, the publication claims drama erupted when the two women supposedly crossed paths. The alleged insider contends, “Jen and the kids stayed in a hotel, but when she showed up to Ben’s rental, Lindsay was furious.” This narrative is completely inaccurate. In reality, Shookus left Hawaii before Garner and her children arrived on the island. Still, the outlet’s unreliable tipster says the tall, blonde “Saturday Night Live” producer “ultimately blew up at Ben, telling him she’s confused about his intentions and yelling, ‘It’s either her or me!'” However, Shookus was last spotted in Hawaii on Tuesday, March 27, while Garner was first photographed on the island on Saturday, March 31. It’s evident the two women never overlapped, further proving the magazine’s storyline is bogus. Regardless of the tabloid’s cover story being based on a false premise, Gossip Cop still checked in with multiple sources close to the situation, who exclusively assures us on background that there’s absolutely no “love triangle” between the actor, his girlfriend and his estranged wife. On the condition of anonymity, one insider tells us that Shookus is completely understanding of Affleck and Garner’s friendly dynamic, as well as his devotion to his kids. Our impeccable sources notes the TV producer shares a young daughter with her estranged husband, so she clearly understands the importance of co-parenting. Unfortunately, this isn’t the first time OK! has attempted to create a nonexistent love triangle between the estranged spouses and a third party. Gossip Cop recently busted the magazine for falsely claiming that Affleck and Josh Duhamel were fighting over Garner. Only, Affleck isn’t trying to reconcile with his estranged wife, and Duhamel, by his own admission, never ever pursued the actress in the first place. This latest narrative is more fiction from the repeatedly discredited outlet.\n\n\n\n\n\nLiam Neeson is not “taken” with Jennifer Garner, despite a new claim. Gossip Cop can bust a story falsely alleging the pair are on the verge of dating. A rep for Neeson confirms to us that the tale is untrue. But according to RadarOnline, Garner is Neeson’s “ultimate dream woman” and he “has it bad” for her. It’s alleged “Jen caught Liam’s eye” as she filmed the upcoming movie Peppermint, which is helmed by Neeson’s Taken director, Pierre Morel. “Now Liam’s hoping to be set up with her,” a so-called “insider” alleges to the site. And the ball is supposedly already rolling. The blog claims Garner was “consulting” with Neeson for her role in the action-driven Peppermint and even studied his Taken franchise. Apparently the website is unaware that Garner spent years starring on the action-filled TV series “Alias” before Taken even came out. She would not need guidance from Neeson for such a part. Still, the outlet maintains he and Garner are now “talking more and more frequently.” Asserts the specious source, “The fascination is mutual… They are flirting with the idea of going on an actual date, and Liam’s leaning on his friend Pierre to help make it happen.” But if Neeson and Garner are already bonding on their own, why would he need Morel to play matchmaker? With these red flags in mind, Gossip Cop checked in with Neeson’s rep, who tells us the whole report is made-up “B.S.” Neeson is not pursuing Garner, nor is she looking to date him. There is no “love connection” in the offing, contrary to the online publication’s contentions. There’s also a blatant factual error, with the site claiming “Garner’s divorce from her husband, Ben Affleck, was finalized last year.” It was recently the one-year anniversary of Garner and Affleck filing for divorce, but it has not been finalized yet. They are still legally married and, as People reported just days ago, are in private mediation as they work on an official settlement. It’s also worth noting RadarOnline has spent much of the past year peddling wrong information about Garner, including a December article that bogusly claimed Ben Affleck dumped Lindsay Shookus to get back together with her. Meanwhile, the blog’s sister outlet, the National Enquirer, falsely linked Neeson to Naomi Watts just over a year ago. In both cases, time has proven Gossip Cop’s debunkings were correct. Affleck never dumped Shookus for Garner and Neeson never dated Watts. When he and Garner never actually strike up a relationship of their own, it’ll be clear we’re right here, too. Share The Facts RadarOnline Website\n\nLiam Neeson wants to date his dream woman, Jennifer Garner. Share\n\nRead More Embed Information on embedding in your site oEmbed Link https://www.sharethefacts.co/share/653358a1-e06c-4be7-b251-01cbcf8f881c\n\n\n\nA new tabloid report claiming Jennifer Garner is pregnant and the baby could belong to either Ben Affleck, Josh Duhamel or a “mystery man” is completely absurd. Gossip Cop can exclusively debunk this nonsense. Not only is the actress not pregnant, but she hasn’t been on the dating scene since her 2015 split. “Jen’s Pregnancy Shocker” reads a headline in the latest issue of OK! The accompanying article quotes an alleged “source” as saying, “There’s talk in Jen’s circle that she could be expecting. The rumor is that she’s in the early stages and still deciding how to handle the situation.” The outlet’s questionable insider goes on to say that a pregnancy “would definitely come as a shock to Jen, as well as everyone around her.” The first red flag is that the outlet uses terms such as “there’s talk” and “rumor is,” which means the magazine isn’t particularly confident in its own story. Still, the seemingly phony tipster further contends that Garner “loves being single and playing the field,” suggesting there are various men who could be the father of her unborn child. The so-called “insider” first speculates Affleck is the dad because he spends so much time with his estranged wife. The next option is Duhamel, the actress’s Love, Simon co-star. And finally, the tabloid floats that the baby could belong to a “handsome mystery man” who was spotted with the actress in Los Angeles earlier this year. This ridiculous article is wrong on so many different levels. For starters, “Entertainment Tonight” reported just last week that Garner “has little interest in dating” and is entirely focused on her kids and her career. The trusted entertainment news outlet further noted the actress plans to be “very careful and very selective” when she does eventually start dating again. Considering that Garner hasn’t been on a date since her 2015 separation, the tabloid’s story clearly isn’t true, but Gossip Cop will also address the magazine’s rundown of supposed “baby daddies.” E! News reported earlier this month that Garner and Affleck “are not getting back together at all,” but continue to cordially co-parent their three kids. The actress’s estranged husband, who’s been in a relationship for more than a year with “Saturday Night Live” producer Lindsay Shookus, didn’t get Garrner pregnant. Meanwhile, Garner and Duhamel laughed off the rumors they were dating while promoting Love, Simon last month, so he’s out of the running as well. As for the “mystery man,” the actress’s rep assured Gossip Cop last month that she’s single and not romantically involved with anyone, which backs up what Garner herself has been saying for quite some time. There’s no “pregnancy shocker.” What’s shocking is how off-base the tabloid’s story is. Share The Facts OK! Magazine\n\nJennifer Garner is pregnant with either Ben Affleck, Josh Duhamel or a mystery man’s baby. Share\n\nRead More Embed Information on embedding in your site oEmbed Link https://www.sharethefacts.co/share/090341ae-fca9-493f-bf20-2adee1555ca4\n\n\n\nJennifer Garner never used Josh Duhamel to make Ben Affleck jealous, despite a false report published a year ago. Gossip Cop is taking a look back at this bust to see how our debunking has held up over time. 12 months have gone by, and it’s apparent there was no romance blossoming between the Love, Simon co-stars, just as we rightly said. But on April 20, 2017, we called out the National Enquirer for claiming Garner was going out of her way to flirt with Duhamel as they filmed Love, Simon, which at the time was known as Simon vs. the Homo Sapiens Agenda. The shoot was taking place in the wake of Garner and Affleck filing for divorce, leading the tabloid to quote a so-called “pal” of the actress as saying, “Josh is exactly what Jen needs right now.” The gossip magazine’s supposed source went on to vaguely assert Duhamel was “making her see things in a whole new light.” Meanwhile, Affleck was described as “insanely jealous,” in part because “Josh is even better looking than he is.” The alleged tipster maintained to the outlet that Garner was set on “ramping up her flirting with Josh” and was getting a “thrill out of making Ben jealous.” But contrary to the publication’s contentions, nothing was going on between the co-stars. A trustworthy source close to Garner assured Gossip Cop on the condition of anonymity that there was “no truth” to claims she was not flirting with Duhamel to make Affleck jealous. As we noted back then, Duhamel was still married during the production. Duhamel and wife Fergie didn’t announce their split until September, roughly five months later, and their breakup had nothing to do with a nonexistent flirtation with Garner. In fact, last fall Garner confessed that she was not even “interested” in dating. Even earlier this month, “Entertainment Tonight” reported that while Garner wants the next person she dates to be “in it for the long run,” she’s still in “no rush to return to the dating scene.” And while the tabloids again tried to link Garner to Duhamel this year, the actor himself actually shot down such claims on multiple occasions. Last month for example, Duhamel acknowledged Garner is an “incredible woman,” but complained about the false narrative being spread about them. He told E! Online, “It does truly amaze me what some of the things that are printed. It’s like, how is that even legal?” The actor also noted that they only filmed together for “a week and a half, two weeks.” Surely if Garner was actually trying to make Affleck “jealous,” she and Duhamel wouldn’t have shut down the romance rumors. And she would’ve made a point to be seen with him apart from shooting and promoting their film. But Garner and Duhamel have never once been seen together in a non-work capacity. Nor she has been seen moving on with any other guy, even though Affleck is in a relationship with Lindsay Shookus. Clearly, the National Enquirer story was entirely wrong.\n\n\n\n\n\nLoading...\n\nJennifer Garner is not heartbroken over Josh Duhamel supposedly getting cozy with Megan Fox, despite a tabloid report that’s wrong on every level. Gossip Cop can exclusively debunk this story. The entire narrative is based on lies. According to OK!, Garner is suffering another “romantic letdown” after sparking a relationship with Love, Simon co-star Duhamel, who’s now allegedly pursuing Fox on the set of their upcoming movie, Think Like a Dog. “Josh has had a crush on Megan since the beginning,” a so-called “source” tells the magazine. “They starred in two Transformers movies together, and he goes gaga when he gets to do a scene with her.” The outlet’s questionable insider goes on to say that Garner wasn’t exactly blindsided by the situation, despite being upset. “After everything Jen’s been through, she isn’t naive. She wasn’t throwing her eggs all in one basket,” adds the seemingly phony tipster. “She likes Josh and thinks he’s handsome and very sexy, but she’s telling friends that maybe this is a sign she should step back.” There’s nothing remotely true about any of this. For starters, Garner and Duhamel laughed off dating rumors while promoting their movie in March. Their denial came on the heels of Gossip Cop debunking countless stories about the two being a couple. The Love, Simon co-stars have never been romantically involved, so this latest article is provably untrue from the start. The second aspect of the tabloid’s story is no more accurate. Gossip Cop called out NW earlier this week for falsely claiming that Duhamel wanted to start dating Fox, who happens to be married with three children. The actor’s own rep assured us the two have a friendly and professional relationship. Meanwhile, “Entertainment Tonight” recently reported that Duhamel is currently dating actress Eiza Gonzalez. There’s no love triangle between Garner and Fox. Additionally, OK! seems to come up with random storylines on a whim. Last month, Gossip Cop busted the publication for falsely claiming that Garner was pregnant and the baby might belong to either Duhamel, Ben Affleck or a “mystery man.” Tellingly, this latest report makes no mention of any pregnancy. The pattern here is becoming fairly obvious. As soon as Duhamel starts working with an attractive female co-star, the tabloids throw him into a nonexistent romance with her. Now that it’s become abundantly clear the actor isn’t dating Garner, the magazine is trying to save face by claiming he dumped her for Fox. The untrustworthy outlet is just bombarding its readers with lies.\n\n\n\nLoading...\n\nJennifer Garner remains one of Hollywood’s most likeable stars. She sells movies and magazine covers, something that is not lost on the tabloids. As a result, the gossip media tends to use the actress for a lot of made-up stories. Gossip Cop is taking a look at five recent rumors about Garner below. In mid-April, RadarOnline announced Liam Neeson was “taken” with Garner, who was deemed his “ultimate dream woman.” The website quoted a so-called “insider,” who maintained the “fascination” was “mutual.” Claimed this supposed source, “They are flirting with the idea of going on an actual date.” Of course, the stars have yet to be seen together, and fans shouldn’t be hoping they’ll step out on a red carpet any time soon. A rep for Neeson exclusively told Gossip Cop that the romance report was complete “B.S.” Just days later, the site’s sister publication, OK!, published a crazy story claiming Garner was pregnant, and the father might be estranged husband Ben Affleck, Love, Simon co-star Josh Duhamel or a “mystery man.” In highly suspicious language, an alleged “source” maintained, “There’s talk in Jen’s circle that she could be expecting. The rumor is that she’s in the early stages and still deciding how to handle the situation.” This “talk,” however, was all wrong. A rep for Garner had already confirmed to Gossip Cop that she wasn’t involved with anyone, and that was backed up by “Entertainment Tonight,” which reported Garner has “little interest” in dating. There was no secret relationship and no pregnancy. Meanwhile, NW wanted readers to believe Garner and Affleck were giving their marriage “another shot.” A purported “source” claimed the actor was “hanging onto the hope that they’ll get back together,” while she’d “love for them to be a family again.” The outlet even went as far as claiming they had decided to “revive their marriage.” But this wasn’t the least bit factual. Though People reported that the dynamic between Affleck and Garner was “pretty good” one year after their divorce filing, they had no intention of reconciling romantically. On the contrary, their friendly relationship is to benefit their kids, and Affleck remains committed to girlfriend Lindsay Shookus. The National Enquirer recently opted to go in a somewhat different direction, alleging Garner was spending time with Affleck to get him “back into shape.” But the publication insisted she had ulterior motive, contending she was “getting a kick out of controlling his workouts and diet” after he “wrecked their marriage with his boozing, gambling and cheating.” While boasting that she was “enjoying watching him suffer,” the tabloid’s “insider” also claimed Garner was doing Affleck a “favor,” since he needed to slim down to play Batman again. As Gossip Cop pointed out, however, Affleck isn’t even sure if he’ll be suiting up as Batman again, and while he’s been seen working out with Shookus, he and Garner are more likely to be spotted with their kids at church. Most recently, OK! abandoned its pregnancy narrative last week for a piece claiming Garner was heartbroken over Duhamel getting supposedly cozy with Megan Fox. Here, the magazine maintained the “Alias” star was dealing with another “romantic letdown” because the actor was more interested in Fox than her. But Gossip Cop had already debunked untrue claims of a blossoming relationship between both pairs, and Garner and Duhamel themselves even laughed off rumors about them dating. The outlet was now trying to make a love triangle, even though Duhamel wasn’t involved with her or with the married Fox. This angle was just as fictitious as Garner’s nonexistent pregnancy. Though Garner is happily single as she raises three children and continues her successful career, the gossip media still prefers to focus on her love life. That apparently means putting her into phony relationships, love triangles, pregnancies and reunions. These scenarios rarely resemble reality, and, as explained above, there’s usually plenty of readily available evidence to disprove them. Fans should keep that in mind the next time these tabloids are on display.\n\n\n\nBen Affleck and Jennifer Garner are not “together again” in the gym, despite a new report claiming the actress is helping her estranged husband get “into shape.” Not only is this untrue tale reminiscent of a previously debunked story, but there is zero proof to support it. In fact, Gossip Cop can point out evidence that disproves it. This inaccurate article comes from RadarOnline, which begins by declaring, “Ben Affleck is back with Jennifer Garner… in the gym at least.” The site, in cruel terms, claims “the bloated Batman star has enlisted his estranged wife to whip him back into fighting shape.” A so-called “insider” contends that Affleck “always leaned on Jen to help him focus on a regime as well as prepare his gym routine and meal plans” during their marriage. Now that he’s seemingly put on weight and is in “terrible shape,” the blog’s supposed source alleges Garner “agreed to help him” slim down. On top of overseeing his fitness routine, the actress is “also taking charge of his diet, putting him on a detox plan,” maintains the outlet. Adds the purported tipster, “It’s a challenge getting Ben back on track but she’s into it. The kids see him so out of shape, so that’s a motivation too.” But the website notably has no photos of the exes at the gym together. It illustrates its story with individual, undated paparazzi shots of Affleck and Garner following separate sessions. And the last time they were pictured together, just a few days ago, Garner and Affleck were at their son’s baseball game, not working out. In contrast, it was with girlfriend Lindsay Shookus that Affleck was seen kayaking back in March. Of course, the actor doesn’t need a wife or a girlfriend to oversee his health regimen. Through his movie career, Affleck has access to top trainers, nutritionists and more. It is those experts who guide his fitness and diet plans. In fact, in 2016, Affleck and his longtime trainer spoke with Men’s Journal about transforming his body for Batman V Superman. So, to recap, the Oscar winner is on record about relying on a professional trainer for his health needs, there is no evidence of him currently working out with Garner, and there are recent photos of him exercising with Shookus. But that’s not all. More than a month ago, the National Enquirer claimed, and RadarOnline regurgitated online, that Garner was getting Affleck into shape. The two sister outlets had nothing to substantiate its contentions then, and the site still doesn’t now.\n\n\n\nBen Affleck is selling his Savannah-area home, but it’s not because he needs the cash to pay off Jennifer Garner in their divorce. One actually has nothing to do with the other. Gossip Cop can separate fact from fiction. In late May, it was revealed Affleck had listed his Georgia compound, which is located on Hampton Island Preserve, more than thirty miles outside of Savannah. He purchased the property in 2003, but hasn’t spent much time there in the last two years. Now RadarOnline is trying to connect his decision to sell the estate to his ongoing divorce from Garner. It’s specifically alleged a “cash-starved” Affleck is “selling assets to pay her off.” A so-called “source” is quoted as saying, “Ben is selling because of the divorce. He needs the cash, which will go to Jen as part of the settlement.” Yet while multiple outlets weeks ago covered the news of Affleck putting the residence up for sale, no reputable publications connected the decision to his split from Garner. Similarly, none have reported anything about him being in financial trouble. In fact, in evidence that’s he not, Affleck purchased a $19 million home in Pacific Palisades in April. If he was in such dire straights financially and needed to conserve money for his divorce, he needn’t have purchased such a pricey abode. In comparison, the Georgia compound is on the market for only for $8.7 million. It’s apparent then that Affleck is not “cash-starved.” It seems the real reason he’s decided to ditch the Southern estate is because he just doesn’t need it. Affleck hasn’t been spotted there since filming Live By Night on the property in the fall of 2015, at which time he also lived there for the production. If it was a vacation home that he used regularly, it might seem odd that he was suddenly parting ways with the compound. But it appears roughly two and a half years have passed since he’s stayed there, so it’s not exactly eyebrow raising that he’s decided to unload it. An Affleck confidante, who declined to speak on the record, tells Gossip Cop it’s “not true” he’s selling the residence to pay for his divorce from Garner. It should also be noted that RadarOnline has little credibility when it comes to reporting on the estrange couple. Last December, we busted the website for falsely claiming Affleck dumped Lindsay Shookus to win back Garner. And while the National Enquirer is running a virtually identical story about the property sale in its print edition this week, the site’s sister tabloid lied about Shookus being pregnant with Affleck’s baby last fall. Neither outlet can be trusted.\n\n\n\nBen Affleck never asked Jennifer Garner to get back together a year ago, despite a poorly-timed report. Exactly 12 months ago, Gossip Cop explained how and why the story was wrong. Now time has made its inaccuracy even clearer. On July 7, 2017, we rightly busted Life & Style for claiming Affleck was “pushing for an official reconciliation” after he and Garner took a family vacation to the Bahamas, despite their marital estrangement. Since the trip went well and they were supposedly “so happy back together,” it was alleged Affleck wanted to formally reunite. “Ben asked Jen to call off the divorce,” a so-called “insider” was quoted as saying. The tabloid’s alleged tipster went on to contend the actor was hoping “Jen will realize what a great time they had on vacation and want to move forward together.” And with their divorce not yet settled, “Ben isn’t going down without a fight,” maintained this questionable source. But as Gossip Cop pointed out then, the “insider” couldn’t have really been in-the-know because its purported inside information on the former couple was all wrong. As opposed to working on winning Garner back, Affleck had actually moved on. The very same week the magazine peddled this narrative, it was revealed Affleck was dating Lindsay Shookus. At the time, it was reported by E! Online that while the relationship was in the “early stages,” it was also “more than a summer fling.” The passage of time has shown just how right that was, and how wrong the tabloid was about a reunion with Garner. 365 days have gone by, and Affleck and the “SNL” producer are still together, while his divorce from Garner is still proceeding. In fact, People reported just a few days ago that Affleck and Shookus will be spending the summer together in Los Angeles while “Saturday Night Live” is on hiatus. “Entertainment Tonight” also recently did a story exploring how Affleck and Shookus may not be at the marriage stage yet, but their relationship is “still going strong.” Meanwhile, Life & Style has continued to spread misinformation. Last November, the magazine pretended it never peddled a tale about Affleck wanting to reunite with Garner and offered a new article alleging he and Shookus were “secretly engaged.” Gossip Cop corrected that at the time, and in the aforementioned “ET” story from two weeks ago, it was specifically stressed, “Ben isn’t ready to propose and has no plans to get engaged anytime soon.” So, this much is apparent: Life & Style was wrong last year claiming Affleck was asking Garner to get back together when he was actually moving on with Shookus. And the outlet was also wrong last fall when it alleged he and Shookus were “secretly engaged.” Gossip Cop will continue to hold the publication accountable when it comes to reporting on Affleck and all stars.\n\n\n\nJennifer Garner did not “block” Ben Affleck and Lindsay Shookus’ wedding, despite reports. Gossip Cop can debunk untrue these stories. As we’ve already reported, the actor is not ready to marry his girlfriend, regardless of the status of his separation from Garner. Sister outlets the National Enquirer and RadarOnline published identical articles on Wednesday contending Garner “refuses to sign her divorce papers,” thereby preventing Affleck from tying the knot with Shookus, “who’s rumored to be pregnant.” The publications accuse Garner of “stonewalling Affleck’s demand to finally put an end to their two-year divorce battle — because she doesn’t want her ex to marry” the “Saturday Night Live” producer, “even if she’s expecting.” The same so-called “insider” is quoted in both stories as saying, “Ben is trying to speed things along in their divorce but Jen is stalling.” Without offering any specifics, this supposed source alleges, “Every attempt he’s made is met with resistance.” Affleck is described as “frustrated” and “angry,” with the purported snitch also claiming, “Lindsay is living in L.A. with him and she intends to stay.” It’s a huge red flag, though, that this questionable “insider” makes all these assertions, yet doesn’t seem to know for sure whether Shookus is pregnant. There’s further reason to be skeptical of this specious snitch when it’s claimed “friends are saying” Garner is allegedly delaying the divorce” because “Lindsay’s encroaching upon her territory to become Mrs. Affleck.” The phrase “friends are saying” indicates that this purported “insider” doesn’t have any firsthand knowledge of what is or isn’t going on, nor do the tabloid and the website. There’s more suspicious phrasing when it’s asserted, “Now she’s hearing what people are saying — that Lindsay’s pregnant — and she’s terrified she’ll lose Ben and that he’ll marry Lindsay.” Garner needn’t fixate on what “people are saying” when she could simply ask Affleck herself, making this contention particularly illogical. There’s also a factual error in the line about a “two-year divorce battle.” Not only has there not been a “battle,” but two years haven’t passed since the estranged spouses filed their legal papers. Garner and Affleck filed for divorce in 2017, with the one-year anniversary just coming a few months ago in April. The claim that Shookus “intends to stay” in L.A. is also wrong. People has already reported that while she and Affleck are spending the summer together in Los Angeles, “She maintains a residence in New York City and will have to be on the East Coast more once the new season of ‘SNL’ begins filming in the fall.” As for a marriage between Affleck and Shookus, “Entertainment Tonight” recently reported that he “in no rush to get married again,” and “isn’t ready to propose.” And Garner is not the reason why. Rather, the outlet explained Affleck “wants to take things slow for the sake of his sobriety. He’s actually been told to take it slow and he’s heeding that advice.” In fact, Gossip Cop already busted RadarOnline earlier this week for falsely claiming Affleck and Shookus want to have a “shotgun wedding” in Hawaii. It was also alleged in that piece that the Emmy winner is “expecting.” But in addition to having no sign of a baby bump, E! Online recently reported that Shookus was drinking wine on a double date with Affleck and her parents late last month. Conclusion: There are a number of provable errors throughout these articles from Radar and its sister tabloid, the Enquirer. They both wrongly claim it’s been “two years” since Affleck and Garner filed for divorce, and untruthfully maintain Shookus is planning to “stay” on the West Coast permanently. And while the publications contend she and Affleck are ready to wed and may have a baby on the way, there’s substantial evidence and reliable reporting from others in the media that show none of that is accurate. Meanwhile, no proof is offered to back up any of the allegations, including the claim that Garner is “blocking” a (nonexistent) wedding from happening by holding up a divorce. On top of all this, Affleck’s rep tells Gossip Cop on the record that there is “no truth” to this narrative.\n\n\n\nLoading...\n\nIs Jennifer Garner “begging” Ben Affleck to a “second chance”? That’s what one of the tabloids wants readers to believe. But Gossip Cop can bust the bogus story. According to the Globe, Garner is still “desperately in love” with her estranged husband, and is “begging the boozing bad boy to dump his live-in lover and return to her arms.” A so-called “friend” is quoted as saying, “She’s told Ben point-blank she wants him back. He was stunned. But she’s begging him to consider it. He said he would.” Though Affleck and girlfriend Lindsay Shookus have supposedly moved in together, Garner “just can’t see life without him,” asserts the purported pal, claiming, “Ben was — and is — the love of her life and she can’t give him up.” The outlet even alleges the actress has “turned down dates in hopes he’ll return to her and their kids.” Maintains the purported tipster, “She regrets giving up on Ben and wants to try again.” The publication further contends Garner “tried to move in on Ben” during their time in Hawaii a few months ago. Though the trip was so their children could spend their Easter break with the actor as he filmed in the Aloha State, the article suggests Garner had an ulterior motive and “really enjoyed” the time she spent with Affleck. Actually, E! Online reported back in April that Garner was giving Affleck “alone time with the kids,” and she was seen exploring Honolulu without him. Shortly after, in a piece about how fans won’t give up on Garner and Affleck as a couple, the outlet stressed, “They are not getting back together at all. They are both moving on.” Nothing has changed, despite what the tabloid is claiming. In fact, this story contains a few falsehoods. While Affleck and Shookus are spending the summer together in Los Angeles, she is not living with him full-time. She has her own place in L.A., People has reported, and she’ll be back in New York when production for “SNL” starts up again this fall. And while the magazine takes a cheap shot at the actor by calling him a “boozing bad boy,” Entertainment Tonight recently did a story on Affleck and Shookus in which it was specifically stressed how he’s focusing on his sobriety. In that piece, it was also noted that Garner “wants to keep encouraging him and knows the importance of her children having both parents in their lives.” Nothing was said about her wanting to reconcile romantically. That Garner hasn’t started dating since their breakup shouldn’t be misconstrued as a sign she’s still holding a torch for Affleck. What it really shows is that her focus remains on her children and her career. Lastly, Gossip Cop already busted the tabloid’s sister publications, RadarOnline and the National Enquirer, this week for falsely claiming Garner is “blocking” Affleck from marrying Shookus by refusing to finalize their divorce. Even Affleck’s own rep confirmed that isn’t true.\n\n\n\nIs Ben Affleck begging Jennifer Garner to finalize their divorce so he can quickly marry Lindsay Shookus? That’s the premise behind a new tabloid story. Gossip Cop, however, looked into the claim and it’s not true. According to Life & Style, Affleck is tired of waiting for Garner to legally end their marriage because he wants to wed Shookus and is even exploring legal remedies. An unnamed “source” tells the magazine, “He has made it clear to Jen that unless the divorce is finalized by September, he’d have no choice but to arrange a court date.” Affleck has already bought a ring and wants to “marry Lindsay as soon as he can,” contends the outlet, which adds, “Ben’s getting awfully tired of waiting” for Garner to sign off on the divorce and wants to “make things permanent with Lindsay.” The alleged insider maintains, “Jen isn’t as ready to move on” and is dragging her feet when it comes to finalizing the divorce papers. “She never expected him to want to remarry again so soon,” offers the so-called “source.” However, asserts the unidentifiable tipster, Garner “knows that unless she stops stalling the process, things could take a bitter turn.” The reality, however, is that their separation is far from acrimonious. Recently, Affleck and Garner were spotted together laughing in a Los Angeles park. Also, Garner posted as loving tribute on Instagram to Affleck on Father’s Day. And just a few days ago, Garner and Affleck took their kids to “Hello, Dolly!” on Broadway, and it was noted how they’re in a “good place.” It’s true a little more than a year has gone by since Garner filed for divorce, but the actress is not “stalling the process.” A number of variables go into a split, including working out a division of assets, custody arrangements and child support, to name a few. Additionally, Affleck’s sobriety is part of both his divorce from Garner and possibly getting more serious with Shookus, with whom he currently has no plans to wed. As previously reported, Garner needs to make sure Affleck remains sober, as part of their custody agreement. Similarly, although their relationship is progressing nicely, Affleck is not marrying Shookus in the near future because he’s been told to slow down and focus on his sobriety. “Ben isn’t ready to propose and has no plans to get engaged anytime soon,” further notes “Entertainment Tonight.” And People also reports Affleck and Shookus are “not rushing anything.” Even with all the overwhelming proof to debunk the tabloid’s article, Gossip Cop reached out to the two stars’ reps. While a spokesperson for Garner didn’t comment, a source close to the actress tells us the magazine’s premise is “not true.” And a rep for Affleck also assures Gossip Cop the narrative about Affleck begging his estranged wife for a divorce so he can marry his girlfriend is “untrue.” It’s interesting that Life & Style claims the actor now has a ring and wants to get married because it previously alleged Affleck and Shookus got secretly engaged nine months ago. It’s also the same outlet Gossip Cop busted when it falsely reported Affleck asked Garner to get back together. The magazine’s untraceable (and possibly nonexistent) sources have been wrong before and are once again with this latest article about how Affleck is begging Garner to finalize their divorce so he can marry Shookus, who is still legally wed to her estranged husband.\n\n\n\nJennifer Garner and Lindsay Shookus are not “both pregnant” with Ben Affleck’s babies, contrary to a new tabloid cover story. Garner and Affleck also have not “called off” their divorce. Gossip Cop can exclusively bust these untruths. The latest cover of Star features photos of Garner and Shookus that were taken from side angles, giving the false illusion of protruding stomachs. These misleading pictures are being used to sell an entirely fabricated narrative about Affleck impregnating both women. It’s evident right in the sub-headline inside the issue that this is all bogus, with the magazine writing, “Sources Say Ben Affleck May Be Gearing Up For New Babies — With Both His Girlfriend And His Ex-Wife!” Garner is not Affleck’s “ex-wife,” as they are still legally married, and the use of the word “may” indicates the outlet doesn’t have any legitimate confirmation to back up its claims. In fact, the publication goes on to contend Affleck “could be expecting a child not only with Lindsay — but also with Jen.” Notably, neither “may” nor “could” appear on the cover, where it’s declared Shookus and Garner are “both pregnant.” The tabloid lures readers in with what appears to be an announcement, but then changes course in the actual story, which is apparently about the possibility that they’re both carrying the actor’s babies. Following this bait-and-switch, a so-called “source” calls the situation a “mess,” but asserts “the initial shock is wearing off,” and Affleck is “actually feeling good about it.” But how is it not known for sure then whether or not Garner and Shookus are expecting? The logic is faulty throughout the piece. It’s alleged that Affleck possibly impregnated Garner when he supposedly spent the night at her home back on March 7. “It’s no secret Ben was trying to woo Jen back, even while seeing Lindsay,” claims the tabloid’s untraceable “insider,” while the unnamed “source” theorizes Affleck and Garner “may have had a brief magic moment” during the unverified “sleepover.” Meanwhile, another anonymous “insider” contends that unidentifiable “people” are now “buzzing she’s pregnant, and that the timing lines perfectly up with the night Ben slept at her place.” As for Shookus, the magazine asserts she’s “rumored to be pregnant, too,” with another purported “source” alleging there’s “talk of a baby on the way.” She and Affleck are said to be “both very happy, in spite of the unusual circumstances,” which is a clear contradiction from the cover line that maintains Shookus’ “baby joy” has been “shattered.” In another red flag, there’s nothing said in the article about Affleck and Garner calling off their divorce, despite that also being touted on the front of the issue. Gossip Cop also already busted this same outlet a few weeks ago for falsely claiming Shookus is pregnant. As we pointed out then, just days before that tale was published Shookus and Affleck went on a double date with her parents, where she was seen drinking wine. That same weekend, Shookus and Affleck were photographed on a hike with her family, and it was clear from her pictured bared midriff that she does not have any kind of a baby bump. That was on June 24, a week after the misleading June 16 photo of Shookus that Star uses on its cover. Basically, she didn’t have a baby bump and then eight days later it disappeared. In regards to the actor reconciling with his estranged wife, People examined the state of Affleck and Garner’s relationship on the one-year anniversary of the divorce filing, and reported that while they co-parent and support one another, he is in a “very committed relationship” with Shookus. That means no dalliances with Garner. Furthermore, Garner just did a YouTube live stream with Martha Stewart this week, and it’s apparent from the video that she, too, doesn’t have a baby bump. The photo of Garner on the cover was taken on July 4, a full 12 days before her later flat-stomach appearance with Stewart. Conclusion: More recent photos of Garner and Shookus than the ones used by the tabloid show that neither of them has a baby bump. There is also independent reporting about Shookus drinking wine after the cover picture was taken, and another reputable outlet has reported that Garner and Affleck aren’t involved romantically any more. That rules out pregnancies for both women. In addition to all this transparent evidence, Garner’s spokesperson, who is authorized to speak on her behalf, confirms to Gossip Cop that she is neither pregnant nor having a rendezvous with Affleck. For his part, Affleck’s rep tells us on the record that the double pregnancy cover story is “so crazy” and untrue that it’s “amusing almost.” And a Shookus confidante, who spoke on the condition of anonymity, calls the claims both “hilarious” and “not true.” Share The Facts Star Magazine\n\nBen Affleck’s estranged wife, Jennifer Garner, and current girlfriend, Lindsay Shookus, are both pregnant with his babies. シェアする\n\n続きを読む 埋め込みコード あなたのサイトへの埋め込みに関する情報 oEmbedのリンク https://www.sharethefacts.co/share/5802f9b6-4f0c-41a6-8504-1726e4aeb58e\n\n\n\nDid Jennifer Garner really say she’s “not ready to divorce” Ben Affleck? That’s the untruthful claim coming from one of this week’s tabloids. Gossip Cop can debunk the allegation with video proof. The new cover of OK! Australia features the teaser, “Jen’s Heartbreaking Interview: ‘I’m Not Ready To Divorce Ben.'” Inside the issue, the same alleged quote appears in the headline, with the magazine claiming Garner “reveal[ed] why she hasn’t finalized their split.” The outlet is referring to Garner’s recent interview with the CBS show “Sunday Morning,” which broadcast a nine-minute profile of the actress this past Sunday. During the segment, she spoke candidly about the difficulty of living under tabloid scrutiny during her relationship with Affleck, and in the wake of their 2015 breakup. “There was a solid decade where there was five or six cars minimum, and easily up to 15 or 20 on the weekends, outside of my house at all times. And looking back on that, I really feel the stress of it. I could cry talking about it,” Garner said. She went on, “What I think I learned is that scrutiny on your private life puts a pressure to make something happen. You feel a pressure to hurry up and get married because you think that will end the, ‘Are they engaged or are they not?’ And that’s true in the reverse as well. If there is any inkling of trouble, or if the tabloid decides there’s trouble, it can create trouble. But to be honest, public scrutiny — everyone says, ‘Oh, you’ve had to go through this in public.’ The public isn’t what’s hard. What’s hard is going through it.” The outlet features some of these quotes in its article, but adds in the line, “I’m not ready to divorce Ben.” As the full CBS video of Garner’s interview shows, she never uttered such a quote, nor did she ever say anything remotely similar. This is an indisputable fabrication. The publication also claims that, though the actress and Affleck split three years ago, she “admits that even now, it’s hard to let go.” Again, the footage shows Garner said nothing like that. The “stress” to which she referred was entirely about the paparazzi staking out her home throughout the marriage, and “looking back on that,” as she said, can make her emotional. The tabloid maintains Garner “opened up about struggling to cope with the breakdown” of the relationship when that’s clearly not the case. She also never “revealed” why they haven’t finalized the divorce. On top of those blatant falsehoods, the magazine also quotes an “inside source,” who accuses Garner of “stalling” the divorce, and claims she’s “terrified” of losing Affleck to his girlfriend, Lindsay Shookus, amid “rumors” that the “SNL” producer “could be pregnant.” These “source” quotes, however, are plagiarized from the National Enquirer and RadarOnline, which Gossip Cop busted more than a week ago for wrongly contending Garner was “blocking” Affleck and Shookus from having a wedding. Even though those outlets were inaccurate in their allegations, OK! doesn’t bother to provide attribution and instead passes off the quotes as their own. Similarly, the article ends this way: “It’s clear that Ben will be a tough act to follow. ‘He’s the love of my life,’ she sadly admits. ‘What am I going to do about that?'” Again the tabloid doesn’t credit the original publication, likely because these quotes are two years old and from Garner’s first post-split interview with Vanity Fair in 2016. But they’re presented here as current statements, as if they may be from Garner’s CBS profile, when they are unequivocally not. Conclusion: The cover of OK! and the headline of its article feature the quote, “I’m Not Ready To Divorce Ben.” But the full video of Garner’s interview with CBS News, which is what the story is about, shows she never said that. The tabloid also doesn’t provide any context for additional quotes from Garner, presenting them as recent comments when they’re actually from an interview that was conducted a few years ago with a separate publication. In addition, the magazine plagiarizes from two fellow gossip outlets. This transparent fact-check makes it evident that the story is full of lies and misinformation.\n\n\n\nJennifer Garner and Ben Affleck broke up in 2015, and last year, he went public with a new relationship with Lindsay Shookus. Though he has very clearly moved on, Garner hasn’t opted for a new romance just yet. But that hasn’t stopped the tabloids from making up fictional ones. Below, check out five wrong dating rumors about the actress below. Just over a year ago, OK! announced Garner was in a “revenge romance” with Chris Pine. “Chris and Jen have been seeing each other on the down-low for a little while now,” a so-called “insider” was quoted as saying. At the same time, though, it was claimed they were stepping out at the Sunset Tower and going on afternoon hikes. Yet the stars, who are routinely photographed by paparazzi, were never seen together. That’s because they weren’t dating, and this cover story was fabricated out of thin air, as Gossip Cop said 12 months ago. Time has since proven our reporting was correct. Earlier this year, Pine started dating Annabelle Wallis. In March, the National Enquirer wanted readers to believe Garner had a “new guy,” an unnamed lawyer whom she already introduced to her family over a New Year’s vacation. As the story went, Garner and her kids initially spent Christmas in Montana with Affleck, but once he left, the purported beau and her family arrived to continue the holiday celebration. Tellingly, it was not said how Garner and the unidentifiable attorney met, or even why the magazine was running this narrative months after the alleged rendezvous. The outlet also failed to acknowledge that a mere month before the holidays, Garner admitted she’s not interested in dating. And, as Gossip Cop noted, her spokesperson further confirmed she was still single. The following month, in April, the publication’s sister site, RadarOnline, peddled a bogus romance narrative about Garner and Liam Neeson. The actor was said to be “taken” with the mom of three, and “hoping to be set up with her.” An untraceable “insider” claimed the pair bonded through her upcoming action film Peppermint, and maintained, “The fascination is mutual… They are flirting with the idea of going on an actual date.” When Gossip Cop investigated, however, a rep for Neeson told us the tale was “B.S.” There was also a clear factual error, with the blog wrongly contending Garner had “finalized” her divorce from Affleck “last year.” In actuality, the legal proceedings are ongoing, and it was the one-year anniversary of Garner filing for divorce just days before this misinformation was peddled. Throughout the first half of 2018, OK! ran a number of phony articles about Garner being in a relationship with Josh Duhamel. This culminated in May, when the tabloid alleged she was suffering another “romantic letdown” because he was supposedly now getting close with Megan Fox. A so-called “source” asserted, “She likes Josh and thinks he’s handsome and very sexy, but she’s telling friends that maybe this is a sign she should step back.” The problems here were two-fold: As Gossip Cop had already reported, and as the Love, Simon co-stars themselves had confirmed, Duhamel and Garner were not dating. But he wasn’t pursuing a romance with the married Fox, either. In fact, the actor is currently dating Eiza Gonzalez. Just last week, Star offered what is perhaps the most outrageous rumor of the bunch with a cover story claiming Garner and Shookus are “both pregnant” Affleck’s babies. It was alleged he possibly impregnated his estranged wife during a “sleepover” at her home on March 7. An anonymous insider insisted, “People are buzzing she’s pregnant, and that the timing lines perfectly up with the night Ben slept at her place.” Suspiciously, the cover of the issue said Garner was calling off their divorce, but nothing was mentioned about that in the actual article. Regardless, all of the contentions were untrue, both their spokespeople assured Gossip Cop on the record. We also uncovered a YouTube video from two days before this report that showed Garner has no baby bump whatsoever. Garner has also been falsely linked to neighbors, various “mystery” men, and even Patrick Dempsey. There’s no reason to believe the star won’t re-enter the dating world eventually. But all of these reports have been wildly premature and inaccurate. Readers can count on Gossip Cop to keep sharing what’s real and what’s isn’t going forward.\n\n", "images": ["https://www.gossipcop.com/wp-content/uploads/2018/04/Liam-Neeson-Jennifer-Garner-Dating.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/05/Jennifer-Garner-Rumors.jpg", "http://s2.gossipcop.com/up/2018/07/Jennifer-Garner-Not-Ready-Divorce-Ben-Affleck.jpg", "http://s4.gossipcop.com/up/2018/07/Ben-Affleck-Jennifer-Garner-Back-Together-Rumor.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Ben-Affleck-Jennifer-Garner-Back-Together-Marriage.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Ben-Affleck-Lindsay-Shookus-Jennifer-Garner-Love-Triangle.jpg", "http://s3.gossipcop.com/up/2018/05/Jennifer-Garner-Rumors.jpg", "http://s4.gossipcop.com/up/2018/04/Jennifer-Garner-Pregnant-Baby-599x395.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Jennifer-Garner-Josh-Duhamel-Ben-Affleck-Bust.jpg", "http://dhpikd1t89arn.cloudfront.net/rating_images/gossip_cop/GossipCopRating-01.png", "http://s1.gossipcop.com/up/2018/06/Ben-Affleck-Jennifer-Garner-Gym.jpg", "http://www.rssing.com/inc/img/tup-blue.png", "http://s3.gossipcop.com/up/2018/04/Matt-Damon-Ben-Affleck-Girlfriend-560x395.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/07/Ben-Affleck-Jennifer-Garner-Back-Together-Rumor.jpg", "http://s3.gossipcop.com/up/2018/04/Jennifer-Garner-Pregnant-215x300.jpg", "http://www.rssing.com/inc/img/tmbtn.png", "https://www.gossipcop.com/wp-content/uploads/2018/06/Ben-Affleck-Jennifer-Garner-Gym.jpg", "http://s1.gossipcop.com/up/2018/07/Jennifer-Garner-Block-Ben-Affleck-Lindsay-Shookus-Wedding.jpg", "http://www.rssing.com/inc/img/tsbtn.png", "https://www.gossipcop.com/wp-content/uploads/2018/07/Jennifer-Garner-Ben-Affleck-Second-Chance.jpg", "http://s4.gossipcop.com/up/2018/05/Jennifer-Garner-Josh-Duhamel-Megan-Fox-800x395.jpg", "http://s1.gossipcop.com/up/2018/07/Ben-Affleck-Jennifer-Garner-Divorce-548x395.jpg", "http://s2.gossipcop.com/up/2018/04/Jennifer-Garner-Ben-Affleck-Weight-521x395.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/07/Ben-Affleck-Jennifer-Garner-Divorce.jpg", "http://s3.gossipcop.com/up/2018/06/Ben-Affleck-Selling-Home.jpg", "http://www.rssing.com/inc/img/heartit-32.png", "http://s1.gossipcop.com/up/2018/04/Ben-Affleck-Jennifer-Garner-Renew-Vows-572x395.jpg", "http://dhpikd1t89arn.cloudfront.net/logos/gossip_cop_logo.png", "https://www.gossipcop.com/wp-content/uploads/2018/04/Jennifer-Garner-Pregnant-Alone.jpg", "http://s2.gossipcop.com/up/2018/07/Jennifer-Garner-Ben-Affleck-Second-Chance.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/05/Jennifer-Garner-Josh-Duhamel-Megan-Fox.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/06/Ben-Affleck-Selling-Home.jpg", "http://s3.gossipcop.com/up/2018/04/Jennifer-Garner-Josh-Duhamel-Ben-Affleck-Bust.jpg", "http://dhpikd1t89arn.cloudfront.net/rating_images/gossip_cop/GossipCopRating-00.png", "http://pixel.quantserve.com/pixel/p-KygWsHah2_7Qa.gif", "http://s3.gossipcop.com/up/2018/04/Liam-Neeson-Jennifer-Garner-Dating.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/07/Jennifer-Garner-Lindsay-Shookus-Both-Pregant.jpg", "http://s2.gossipcop.com/up/2018/04/Jennifer-Garner-Pregnant-Alone-596x395.jpg", "http://s3.gossipcop.com/up/2018/07/Jennifer-Garner-Lindsay-Shookus-Both-Pregant.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/07/Jennifer-Garner-Not-Ready-Divorce-Ben-Affleck.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Matt-Damon-Ben-Affleck-Girlfriend.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/07/Jennifer-Garner-Block-Ben-Affleck-Lindsay-Shookus-Wedding.jpg", "http://s1.gossipcop.com/up/2018/04/Ben-Affleck-Lindsay-Shookus-Jennifer-Garner-Love-Triangle-292x395.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Ben-Affleck-Jennifer-Garner-Renew-Vows.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Jennifer-Garner-Pregnant-Baby.jpg", "http://s1.gossipcop.com/up/2018/07/Jennifer-Garner-Dating-Rumors.jpg", "http://www.rssing.com/inc/img/icon_arrpw_green.gif", "http://s4.gossipcop.com/up/2018/04/Ben-Affleck-Jennifer-Garner-Back-Together-Marriage.jpg", "http://www.rssing.com/inc/img/matult.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/04/Jennifer-Garner-Ben-Affleck-Weight.jpg", "http://www.rssing.com/inc/img/search_icon.jpg", "https://www.gossipcop.com/wp-content/uploads/2018/07/Jennifer-Garner-Dating-Rumors.jpg"], "top_img": "https://www.gossipcop.com/wp-content/uploads/2018/04/Liam-Neeson-Jennifer-Garner-Dating.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Jennifer Garner – Gossip Cop", "meta_data": {"google-site-verification": "PrpIQYc2JsAHr9EIggqdk70c-ozWMC4Y_9SnMWMg80Q"}, "movies": [], "publish_date": null, "source": "http://garner315.rssing.com", "summary": ""}