{"url": "https://people.com/celebrity/jennifer-garner-ben-affleck-divorce/", "text": "Jennifer Garner and Ben Affleck have filed for divorce nearly two years after the couple originally announced their split, PEOPLE confirms.\n\nGarner and Affleck filed the docs together and they are both seeking joint legal and physical custody of their three kids. The date of separation, as well as the division of property and any spousal support, is still to be determined.\n\nGet push notifications with news, features and more.\n\nThe divorce filing was originally reported by TMZ.\n\nThe former couple filed mirror-image paperwork and they each filed “in propria persona” — which means without an on-the-record attorney. Both Affleck and Garner noted that they will keep any earnings they made since they separated, so the separation date they determine could affect the settlement. They announced their split on June 30, 2015.\n\nA source tells PEOPLE the filing is “super amicable.”\n\nA separate source adds, “They always planned to divorce despite what people said. If you look at their first statement it says divorce not separate. They just did it the way they wanted to and did what was best for their kids. There was no catalyst, it was just time. Nothing has changed, they are and still will be putting their kids first.”\n\nAffleck and Garner have been in mediation and are working with leading L.A. divorce attorney Laura Wasser, according to another source. Wasser has handled divorce cases of several A-listers including Angelina Jolie, Johnny Depp and Kim Kardashian.\n\nAffleck and Garner broke off their 10-year marriage in June of 2015, telling PEOPLE in a joint statement, “After much thought and careful consideration, we have made the difficult decision to divorce. We go forward with love and friendship for one another and a commitment to co-parenting our children whose privacy we ask to be respected during this difficult time. This will be our only comment on this private, family matter. Thank you for understanding.”\n\nOver the following months, Garner and Affleck, both 44, sometimes sparked reconciliation rumors as they continued to live together, vacation together and co-parent their kids — Violet, 11, Seraphina, 8, and Samuel, almost 5 — while also stepping out for solo outings.\n\nThe friendly exes have been spotted out frequently during the last few months, including a sighting on Election Day in L.A. where they were both seen wearing “I Voted” stickers after casting their ballots. The actors also spent the holidays together with their kids in Montana, with a source telling PEOPLE they “seemed to have a great time.”\n\nFROM COINAGE: You Don’t Need Superpowers to be Batman–Just This Much Money\n\nAffleck called Garner the “world’s greatest mom” at a TimesTalk in New York in mid-December while saying that the births of their children were the most defining moments of his life. “It’s a joy to hang out with them,” he added. “I think the meaning of life is to make good people.”\n\n“They are co-parenting the best they can,” a source who knows both of them told PEOPLE. “Whatever incarnation of a relationship this is works for them.”\n\nAfter completing rehab for alcohol addiction earlier this month, Affleck has been enjoying spending time with the kids. In fact, the morning after he announced he had completed rehab, things were business as usual as he was spotted taking his kids to school with Garner. A source told PEOPLE that the actor is relishing time with his children.\n\n“Ben is spending special time with all the kids separately,” the source said. “He seems very happy. The mood in general seems very upbeat. The kids are thrilled that he is back.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1375&h=720&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fben-affleck-jennifer-garner-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1375&h=720&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fben-affleck-jennifer-garner-1-2000.jpg", "keywords": [], "authors": ["Ale Russian", "Jodi Guglielmi"], "canonical_link": "https://people.com/celebrity/jennifer-garner-ben-affleck-divorce/", "title": "Ben Affleck and Jennifer Garner Officially File for Divorce", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ben Affleck,Breakups,Courts and Trials,Divorce,Jennifer Garner", "news_keywords": "Ben Affleck,Breakups,Courts and Trials,Divorce,Jennifer Garner", "description": "Jennifer Garner has filed for divorce from Ben Affleck just over a year and a half after the couple announced their split", "og": {"title": "Ben Affleck and Jennifer Garner Officially File for Divorce", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/jennifer-garner-ben-affleck-divorce/", "description": "Jennifer Garner and&nbsp;Ben Affleck&nbsp;have filed for divorce nearly two years after the couple originally&nbsp;announced their split, PEOPLE confirms. Garner and Affleck filed the docs together&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1375&h=720&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fben-affleck-jennifer-garner-1-2000.jpg", "width": 1375, "height": 720}}, "pinterest": {"url": "https://people.com/celebrity/jennifer-garner-ben-affleck-divorce/", "description": "Jennifer Garner has filed for divorce from Ben Affleck just over a year and a half after the couple announced their split", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fben-affleck-jennifer-garner-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/jennifer-garner-ben-affleck-divorce/", "title": "Ben Affleck and Jennifer Garner Officially File for Divorce", "description": "Jennifer Garner has filed for divorce from Ben Affleck just over a year and a half after the couple announced their split", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1375&h=720&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fben-affleck-jennifer-garner-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}