{"url": "https://www.usatoday.com/story/life/2018/05/16/how-watch-royal-wedding-prince-harry-and-meghan-markle/599352002/", "text": "Americans will have no trouble finding Prince Harry and Meghan Markle's royal wedding playing on a screen nearby on Saturday. The real difficulty will be in avoiding it for those surly few who can't stand weddings or royals or both.\n\nBut that lot can take themselves off to the wilderness with no Wi-Fi; everybody else will settle themselves in front of their tellys or devices very early in the morning to consume gallons of tea, nosh on crumpets and marvel at the ceremonial magic the British will conjure from the 948-year-old ramparts of Windsor Castle.\n\nMore than 2 billion people around the world watched the 2011 wedding of Prince William and the former Kate Middleton at Westminster Abbey in London, according to leading British wedding planning app Bridebook.\n\nGrab your screens::How to watch the royal wedding of Prince Harry and Meghan Markle\n\nNow, with the rise of smartphones and social media, more than 3 billion people are expected to turn to their screens to see Harry, 33, marry his 36-year-old American fiancée. This royal wedding could end up being the most viewed event in history.\n\nHere are some of the broadcast and cable networks' plans, in alphabetical order:\n\nABC\n\nGood Morning America leads off the day with a five-hour edition, with Robin Roberts and David Muir hosting the live coverage starting at 5 a.m. ET/2 PT from Windsor. (An additional hour of GMA will air at 7 a.m. PT for the West Coast.)\n\nThe network's news magazine, 20/20, will cover the nuptials with hour-long specials on Friday and Saturday at 10 ET/7 PT, with Muir anchoring and correspondent Deborah Roberts reporting from Windsor.\n\nBBC America\n\nThe U.S. version of the United Kingdom's \"The Beeb,\" the cable channel will air the wedding live as a direct simulcast of BBC One’s coverage, starting at 4:15 a.m ET/1:15 PT). An encore presentation of the wedding will air at 10 p.m. ET/7 PT.\n\nRoyal wedding: What we know about who's coming, who's not\n\nBBC World News\n\nBBC’s international 24-hour news service on Saturday will air the BBC’s wedding coverage starting at midnight ET/9 p.m. PT Friday with pre-wedding content.\n\nCoverage of the wedding will start at 5 a.m. ET/2 PT, when BBC World News will join BBC One's coverage. Then, starting at 9 a.m. ET/6 PT, coverage will continue with a BBC News special about the wedding.\n\nBritBox\n\nThe streaming service of BBC Studios and ITV (the British commercial network) will begin streaming coverage live at 4:25 a.m. ET/1:25 PT, offering the ITV feed of the event. The partnership says its coverage will offer the \"authentic British perspective\" of the wedding: Everyone you hear will be British, with local accents and the experience of having grown up with the royal family as part of everyday life. For Brits in the USA, it'll be a taste of home.\n\nCBS\n\nCBS This Morning co-host Gayle King and Entertainment Tonight co-host Kevin Frazier will anchor CBS News’ live coverage from London beginning at 4 a.m. ET/1 PT.\n\nThe network will also present a two-hour special, Royal Romance: The Marriage of Prince Harry and Meghan Markle, at 8 p.m. ET/5 PT on Saturday summing up the day’s events.\n\nCBSN, the network's 24/7 streaming news network, will begin its coverage at 4 a.m. ET/1 PT on Saturday.\n\nThe little royals::Prince George, Princess Charlotte to have starring roles in royal wedding\n\nEntertainment Tonight has been broadcasting from London and Windsor this week, with royal coverage on the nightly broadcast and on ET online. A full recap of the nuptials will air on ET on May 21.\n\nCNN\n\nLive coverage will begin from Windsor at 4 a.m. ET/1 PT, anchored by Anderson Cooper, Alisyn Camerota and Don Lemon along with CNN’s royal correspondent, Max Foster, plus royal commentators Victoria Arbiter and Kate Williams, royal biographer Sally Bedell Smith and fashion expert Joe Zee.\n\nThe network even signed up a new commentator, Boston University dean Harvey Young, who was Markle’s theater professor at Northwestern University.\n\nCNN’s coverage will be simulcast across CNN/U.S., CNN International and HLN. The coverage will replay at 8 p.m. ET/5 PT on Saturday and on HLN at 3 p.m. ET/noon PT.\n\nE!\n\nE! Live From the Royal Wedding, with Melanie Bromley, Giuliana Rancic and Brad Goreski, will air from Windsor with five hours of coverage starting at 5 a.m. ET/2 PT. Plus, the hour-long recap special, E! Royal Wedding Rundown, will air at 7 p.m. ET.\n\nTV does the royals::How to watch the royal wedding ironically (or sincerely)\n\nFox News\n\nFox & Friends’ Ainsley Earhardt will co-host the live coverage beginning at 5 a.m. ET/2 PT and then join Shepard Smith and Sandra Smith in covering the main event at 6 a.m. ET/3 PT.\n\nHBO\n\nFor a Funny or Die perspective on the wedding, HBO will air The Royal Wedding Live With Cord and Tish! starting at 7.30 a.m. ET/4:30 PT, with Saturday Night Live alums Will Ferrell and Molly Shannon playing their parody characters, “broadcast legends” Cord and Tish, chronicling the nuptials in real time. A prime-time replay will air at 9:45 ET/6:45 PT.\n\nNBC\n\nAll four hours of the Today show will be broadcasting from Windsor starting at 7 a.m. ET/4 PT Friday, featuring Savannah Guthrie, Hoda Kotb, Megyn Kelly and Kathie Lee Gifford. On Saturday, Guthrie and Kotb will co-anchor TODAY at the Royal Wedding from Windsor starting at 4:30 a.m./1:30 PT and continuing until 11 a.m. ET/8 PT.\n\nMSNBC coverage begins at 4 a.m. ET/1 PT with Joy Reid anchoring special coverage live from New York City, and Stephanie Ruhle and Katy Tur anchoring on-the-ground coverage live from Windsor.\n\nAccess Hollywood is broadcasting daily from outside Buckingham Palace in London and from Windsor this week, while Accessonline.com will live-stream the wedding beginning at 4:30 a.m. ET/1:30 PT.\n\nPBS\n\nThe network will broadcast live coverage from the BBC on Saturday, beginning at 4 a.m. ET/1 PT. A nightly series of special programs on the British royals started Monday.\n\nTLC\n\nThe channel will provide a live four-hour feed of the wedding starting at 5 a.m. ET/2 PT. This will be followed by a one-hour special, Royal Wedding Revealed, that night at 10 ET/7 PT.\n\nA note on streaming:\n\nYou can stream the royal wedding live for free here on USA TODAY and on our social platforms, including YouTube, as well as on the websites or mobile apps of ABC, CBS and NBC. For instance, ABC will live-stream its coverage through ABCNews.com, GoodMorningAmerica.com, their mobile apps and social platforms, starting at 5 a.m. ET/2 PT. You will need to be a pay-TV subscriber to watch on BBC America and HBO. For BritBox, you have to be a subscriber to stream but the first week is free after signing up.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5785681160001_5785675872001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/2f3d5d65632a87c323a5ee8f102ccd27d15d397e/c=0-188-1769-1183/local/-/media/2018/05/14/USATODAY/usatsports/wp-USAT-allthemoms-front1-17790-fa7a70ac.jpg?width=1769&height=995&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/ac34836e97bb2f2647f776f470e4e1f5b28e64b2/c=0-275-4494-2814/local/-/media/2018/05/10/USATODAY/USATODAY/636615741687381617-GTY-956899900.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/2f3d5d65632a87c323a5ee8f102ccd27d15d397e/c=0-188-1769-1183/local/-/media/2018/05/14/USATODAY/usatsports/wp-USAT-allthemoms-front1-17790-fa7a70ac.jpg?width=1769&height=995&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2018/05/16/how-watch-royal-wedding-prince-harry-and-meghan-markle/599352002/", "title": "How to watch the royal wedding of Prince Harry and Meghan Markle", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "How to watch the royal wedding of Prince Harry and Meghan Markle", "description": "Once again, royal watchers on the West Coast will have to get up pretty early in the morning to watch live coverage of the royal nuptials on May 19.", "url": "https://www.usatoday.com/story/life/2018/05/16/how-watch-royal-wedding-prince-harry-and-meghan-markle/599352002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/2f3d5d65632a87c323a5ee8f102ccd27d15d397e/c=0-188-1769-1183/local/-/media/2018/05/14/USATODAY/usatsports/wp-USAT-allthemoms-front1-17790-fa7a70ac.jpg?width=1769&height=995&fit=crop&format=pjpg&auto=webp", "width": 1769, "height": 995}, "type": "article"}, "article": {"author": "Maria Puente", "content_tier": "free", "opinion": "false"}, "description": "Once again, royal watchers on the West Coast will have to get up pretty early in the morning to watch live coverage of the royal nuptials on May 19.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/2f3d5d65632a87c323a5ee8f102ccd27d15d397e/c=0-188-1769-1183/local/-/media/2018/05/14/USATODAY/usatsports/wp-USAT-allthemoms-front1-17790-fa7a70ac.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "How to watch the royal wedding of Prince Harry and Meghan Markle", "description": "Once again, royal watchers on the West Coast will have to get up pretty early in the morning to watch live coverage of the royal nuptials on May 19."}}, "movies": [], "publish_date": 1526400000.0, "source": "https://www.usatoday.com", "summary": ""}