{"url": "https://web.archive.org/web/20070825014950/http://www.mcclatchydc.com:80/iraq/story/18861.html", "text": "WASHINGTON — U.S. troops could withdraw from Iraq within months, but if Iraq's government remains politically deadlocked, it probably would collapse and the nation would descend into chaos, a war game organized by the U.S. Army concluded earlier this month.\n\nThe war gamers, following a scenario created by their Army hosts, determined that U.S. troops would secure the exit route to Kuwait through largely Shiite Muslim southern Iraq and face little fighting as they drove their equipment out. Any attacks, the panel judged, would be \"harassment attacks,\" likely by a few Sunni members of al Qaida in Iraq who wanted to attack American troops one last time.\n\n\"Why would they stop us? They have been telling us to leave,\" said one participant who requested anonymity to speak freely about the war game.\n\nOnce U.S. troops left, however, the chaos in Iraq would escalate. Shiite militias would drive Baghdad's Sunni population into Iraq's western Anbar province, which is almost exclusively Sunni, the war gamers concluded. There would be a power struggle within Anbar among tribes backed by outside Sunni Arab states, including Saudi Arabia and Syria.\n\nRival Shiite factions would fight one another to control much of the rest of the country, and Iran presumably would back one side, although the gamers couldn't assess how overt Iranian interference would be. Turkey would consider entering Iraq from the north to thwart the Kurds, who desire independence and claim some of Turkey as part of their homeland.\n\nIraqi Prime Minister Nouri al Maliki's government would be unable to control the country. Indeed, the gamers concluded, his government could collapse unless Iran threw its support behind it.\n\n\"The mess we would leave behind would be awful,\" the participant said. \"The ethnic cleansing is happening now. Once we're gone, absent a political solution that would allow the Iraqi Army to go into action, all of that will be accelerated.\"\n\nThe Army staged the one-day exercise earlier this month at a Hilton hotel in suburban Springfield, Va., and invited 30 Iraq experts, among them serving and retired officers and Iraqi exiles.\n\nThe organizers picked April 2008 as a starting point — the month after which U.S. commanders have said they can't maintain the surge of additional U.S. forces and still give troops a year off between 15-month deployments — and January 2009 as the end. They played the roles of the Sunnis, the Shiites, the insurgents, the militias, the military generals and the Iraqi government.\n\nThe game was one of several simulations of what Iraq might look like in the 2009 time frame if U.S. troops leave, said retired Marine Col. Gary Anderson, who participated in the Springfield exercise and several previous such games. But he said the Army hasn't yet staged an exercise premised on an abrupt withdrawal.\n\nThat the military war games are focusing on the potential chaos in Iraq, rather than an abrupt troop withdrawal, offers some insight into how the Pentagon is planning for the next stage of the war, several of the participants told McClatchy Newspapers.\n\n\"It will be as easy to get out as it was to get in,\" said one senior defense official, who declined to speak on the record about possible future operations. He said he believes that U.S. forces could get out of Iraq in as little as six months.\n\nBut the military insists that there's no withdrawal plan at this time.\n\n\"Tell us the policy, and we will do it,\" one senior Pentagon official said.\n\nCritics said the military is underestimating how hard it'll be to get out of Iraq. They point to Israel's withdrawal from Lebanon, which boosted the fortunes of the militant Shiite Islamic group Hezbollah, and the Soviet Union's hasty withdrawal from Afghanistan, which cost more than 500 Soviet troops their lives.\n\nRep. Joe Sestak, D-Pa., a retired Navy vice admiral who was director of defense policy for the National Security Council in the Clinton administration, said he believes that drawing down or withdrawing troops could be one of the most dangerous periods of the Iraq war.\n\n\"The military will be vulnerable ... You are going to go out in a combat situation,\" Sestak said. \"I think we can do greater damage if we don't have a firm grasp on the military implications.\"\n\nU.S. troops are likely to leave an Iraq that's still embroiled in fierce sectarian violence, he said. \"How quickly can the military move its 160,000 troops out? What about the 100,000-plus contractors? How many of the military's 45,000 Humvees should be left behind for the Iraqi Army? Which of 64 military bases should be closed? How does the military protect its main route out of Iraq toward Kuwait?\"\n\nSestak estimates that it would take at long as two years to withdraw.\n\nAmerica's future in Iraq will be at center stage next month, when Gen. David Petraeus, the top U.S. military commander in Iraq, and Ryan Crocker, the U.S. envoy there, give an assessment and recommendation to Congress on Iraq's security and political situation.\n\nThe war gamers' only issue was getting out and at what cost.\n\nBy the end of the game, the players decided that the exercise had \"captured how bad it would be,\" said the participant who declined to be identified.\n\n\"I don't worry about how we will get out of Iraq,\" Anderson concluded about the latest war game. \"I am worried about the Iraqis we will kill on the way out.\"", "images": ["https://web.archive.org/web/20070825014950im_/http://mcclatchy.112.2o7.net/b/ss/nmmclatchy/1/F.1-XeLvs?pageName=Iraq%20pullout%20could%20create%20chaos%20(08/12/07%2008:14:53)&server=www.mcclatchydc.com&channel=Iraq&c1=/103/story/18861.html&c2=&c3=story-detail&c4=Iraq&c5&c6=MCD%7CDC%7CNews%7CNation_World&c7=&c8=&c9=&c10=http://www.mcclatchydc.com/iraq/story/18861.html&c11=18861%7CIraq%20pullout%20could%20create%20chaos&c12=&c13=&c14=&c15=&c16=&c17=&c18=&c19=&c20=&h1=&h2=&h3=&h4=&ns=mcclatchy", "https://web.archive.org/web/20070825014950im_/http://media.mcclatchydc.com/static/images/icon_yahoo.gif", "https://web.archive.org/web/20070825014950im_/http://media.mcclatchydc.com/smedia/2007/08/12/08/670-iraq_windshield_800.embedded.prod_affiliate.91.jpg", "https://web.archive.org/web/20070825014950im_/http://ad.doubleclick.net/ad/krwashington.news/news;c2=news_homepage;template=article;!category=news;pos=right2;sz=160x600;ord='+_krdDartOrd+'", "https://web.archive.org/web/20070825014950im_/http://www.mcclatchydc.com/static/favicon.ico", "https://web.archive.org/web/20070825014950im_/http://media.mcclatchydc.com/static/images/icon_rss.gif", "https://web.archive.org/web/20070825014950im_/http://media.mcclatchydc.com/static/images/icon_digg.gif", "https://web.archive.org/web/20070825014950im_/http://media.mcclatchydc.com/static/images/icon_delicious.gif", "https://web.archive.org/web/20070825014950im_/http://media.mcclatchydc.com/static/images/mcclatchy_logo.gif"], "top_img": "https://web.archive.org/web/20070825014950im_/http://www.mcclatchydc.com/static/favicon.ico", "keywords": [], "authors": ["Nancy A. Youssef", "Mcclatchy Newspapers"], "canonical_link": "", "title": "Iraq pullout could create chaos", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}