{"url": "ew.com/tv/2017/10/10/megyn-kelly-donna-karan-harvey-weinstein-video/", "text": "Incensed over Donna Karan's defense of Harvey Weinstein, Megyn Kelly laid into the fashion designer on Tuesday's episode of Megyn Kelly TODAY, declaring that she's \"done with Donna Karan\" while also inviting her on the program.\n\n\"Donna Karan, in the wake of the disturbing allegations about famed movie producer Harvey Weinstein allegedly harassing several women, used the power of her voice to attack women,\" said Kelly, 46, who famously leveled sexual harassment claims against her former Fox News boss, the late Roger Ailes, in her 2016 book, Settle for More. \"In an interview with the DailyMail.com on the red carpet Sunday night, Karan was asked about Harvey Weinstein, who she described as a wonderful person. And then she went on to raise what she apparently considers to be the burning question here: Are women who are getting harassed ‘asking for it'?\"\n\nAfter playing a clip of the comments — for which Karan has since apologized, telling the Associated Press they are \"not representative of how I feel or what I believe\" — Kelly turned the focus to her interview with one of Weinstein's accusers, TV journalist Lauren Sivan, who on Monday's episode told Kelly about her \"disgusting\" experience with Weinstein. \"Weirdly, I never thought to ask Lauren whether her skirt brought on that [restuarant] vestibule incident because her outfit is totally irrelevant — and most rational people know that,\" said Kelly.\n\nQuestioning Karan's statement, Kelly challenged her \"wrong\" thinking: \"There are laws in this country. Laws. I don't give a damn if a woman shows up in a bikini to the office. That doesn't invite or make it okay for her superior to harass her. It makes it okay for her boss to say, ‘Go home and change.' That's it. The truth is sexual harassment has nothing to do with wardrobe; it has to do with power and control and sexual proclivities that a superior chooses not to reign in. How insulting, by the way, to men, as well? Like they are a bunch of animals who cannot behave themselves if a woman shows part of her thigh, right? This attitude of blaming women for their own harassment is actually one of the reasons women choose not to come forward after they get harassed because they fear victim shaming.\"\n\nKelly continued: \"How about we not pile on, Donna? How about we use this moment to encourage women to find their own voices, despite the risks and to stand up for themselves — which is hard enough, without rich, powerful, well-connected fashion moguls lecturing them on their fashion choices.\"\n\nThen came Kelly's kicker: \"And speaking of fashion choices, here's one for you: I'm done with Donna Karan.\"\n\nDespite her dismissive message, Kelly invited Karan on the show for \"an honest discussion about how [Karan] really feels,\" adding, \"If she's really sorry, if she really was taken out of context, if she really doesn't believe that way, explain those comments.\"\n\nWith her comments Tuesday, Kelly joined a growing list of celebrities speaking out against Weinstein, whose scandal erupted following an Oct. 5 New York Times exposé alleging the movie mogul has been sexually harassing women for three decades. Weinstein has since been fired by The Weinstein Company and apologized for \"the way I've behaved with colleagues in the past\" in a statement to the Times. On Tuesday, a report posted by the New Yorker alleged more sexual misconduct claims, including assault, against Weinstein, which he also denied.\n\nWatch Kelly's segment in the video above. Megyn Kelly Today airs weekdays on NBC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F10%2Fmegynkelly-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F10%2Fmegynkelly-2000.jpg", "keywords": [], "authors": ["Nick Maslow"], "canonical_link": "https://ew.com/tv/2017/10/10/megyn-kelly-donna-karan-harvey-weinstein-video/", "title": "Megyn Kelly trashes Donna Karan for defending Harvey Weinstein", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Harvey Weinstein,Megyn Kelly", "news_keywords": "Harvey Weinstein,Megyn Kelly", "description": "Watch the video here.", "og": {"title": "Megyn Kelly trashes Donna Karan for defending Harvey Weinstein", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/10/10/megyn-kelly-donna-karan-harvey-weinstein-video/", "description": "Incensed over Donna Karan's defense of&nbsp;Harvey Weinstein,&nbsp;Megyn Kelly laid into the fashion designer on Tuesday's episode of&nbsp;Megyn Kelly TODAY, declaring that she's \"done with Donna&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F10%2Fmegynkelly-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2017/10/10/megyn-kelly-donna-karan-harvey-weinstein-video/", "description": "Watch the video here.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F10%2Fmegynkelly-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/10/10/megyn-kelly-donna-karan-harvey-weinstein-video/", "title": "Megyn Kelly trashes Donna Karan for defending Harvey Weinstein", "description": "Watch the video here.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F10%2Fmegynkelly-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1507564800.0, "source": "http://ew.com", "summary": ""}