{"url": "https://www.bustle.com/p/prince-georges-christmas-list-asks-for-only-one-present-because-he-isnt-messing-around-photos-6745125", "text": "Prince George of Cambridge knows exactly what he wants for Christmas — and he isn't messing around. During Prince William's visit to Finland, he presented Santa Claus with Prince George's Christmas list. Not only does this mean the public gets to experience George's handwriting for the first time, but we also have further insight into the 4-year-old royal's wishes and dreams for the perfect holiday.\n\nIn his letter, not only did George circle that he has been \"nice,\" rather than \"naughty\" this year, but he wrote down he wants a \"police car.\" He even signed his name (just \"George\") at the bottom.\n\nAccording to Hello! Canada, William told Santa at the Christmas market in Helsinki, \"I've seen you and I had to give you this letter.\" He then added about his son, \"He hasn't written down many requests, so I think one request is probably OK.\" William also made sure Santa paid attention to how George was \"nice\" this year. \"He's been a nice boy, a nice boy,\" he said.\n\nGeorge had the opportunity to list five presents he wanted for Christmas, but didn't. He only wrote down one item — and an important one at that. You have you to admire his definitiveness. Unlike many children, he didn't list a bunch of different gifts. Maybe he's hoping that by including one only thing it ensures he'll actually get it?\n\nIt's unclear if George is wishing for an actual police car or a toy version, but it seems more than likely he wants the latter — and that's what he'll probably receive on Dec. 25. It's highly doubtful his parents — oops Santa, will gift him with his own police car that he can't even drive.\n\nEither way, the fact that he has only one gift request speaks volumes. He clearly isn't greedy. Yes, he's a prince and is given luxuries that many aren't privy to, so maybe he already had so much stuff that the one thing missing from his life is a police car. Though, William and Kate Middleton seem to be raising their children to be appreciative of what they have in life, all while wanting them to have a \"normal\" of a life as possible.\n\nAs William once said about his children in a May interview with British GQ, \"I couldn't do my job without the stability of the family. Stability at home is so important to me. I want to bring up my children in a happy, stable, secure world, and that is so important to both of us as parents.\" He then added about his son, \"I want George to grow up in a real, living environment, I don't want him growing up behind palace walls, he has to be out there. The media make it harder but I will fight for them to have a normal life.\"\n\nThe 35-year-old activist was also quick to recognize he and his family don't live the average life. After being asked, \"But surely you must accept it as an abnormal life?\", he responded, \"Totally, but I can still try to protect them as children.\"\n\nBased on George's wish list for Christmas, it's probably safe to say that William's hopes of ensuring both George and Princess Charlotte remain children as long as possible is a reality. So many kids these days want huge gifts, like smartphones, tablets, computers, or video game systems, so to see that George seemingly wants a toy car shows his innocence — and it's truly refreshing.\n\nThe fact that George opened up his Christmas gifts early in December 2016, according to Kiss FM DJ AJ King (via Hello!) also shows just how much a kid he remains at heart. \"I had a really nice chat with Prince William who told me that this was their last week at work, as it were, before Christmas,\" King said. \"[William] said they were all really excited about it and that George is already opening his presents. He thought it a quite funny. That's kids for you, even the ones that are princes!\"\n\nAs for Charlotte, it's unclear what she wants for Christmas. Whatever she's hoping for is probably as sweet and childlike as her older brother's wish.", "images": ["https://imgix.bustle.com/uploads/getty/2017/11/30/049146fc-576a-4971-8f3f-4f9b185e5c3c-getty-610287158.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/060a47f5-6a46-41c6-b963-760894135871-getty-966471954.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/30/049146fc-576a-4971-8f3f-4f9b185e5c3c-getty-610287158.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/16/97010b86-55b6-4027-8ae3-8bbc96a4f438-getty-1132368586.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/12/2fca4db2-2ed7-40f0-a1a6-5f2e7b6be519-getty-1181489072.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/890c09e5-fa19-425c-8d41-2af949e3b73d-getty-1182019692.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/30/049146fc-576a-4971-8f3f-4f9b185e5c3c-getty-610287158.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/prince-georges-christmas-list-asks-for-only-one-present-because-he-isnt-messing-around-photos-6745125", "title": "Prince George’s Christmas List Asks For Only One Present, Because He Isn’t Messing Around — PHOTOS", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/prince-georges-christmas-list-asks-for-only-one-present-because-he-isnt-messing-around-photos-6745125", "type": "article", "title": "Prince George Only Asked Santa For One Gift, Because He’s Not Messing Around", "description": "Prince George of Cambridge knows exactly what he wants for Christmas — and he isn't messing around. During Prince William's visit to Finland, he presented Santa Claus with Prince George's Christmas list. Not only does this mean the public gets to…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/30/049146fc-576a-4971-8f3f-4f9b185e5c3c-getty-610287158.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Prince George of Cambridge knows exactly what he wants for Christmas — and he isn't messing around. During Prince William's visit to Finland, he presented Santa Claus with Prince George's Christmas list. Not only does this mean the public gets to…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}