{"url": "https://en.wikipedia.org/wiki/Shonda_Rhimes", "text": "American television producer, television and film writer, and author\n\nShonda Lynn Rhimes (born January 13, 1970) is an American television producer, television and film writer, and author. She is best known as the showrunner—creator, head writer, and executive producer—of the television medical drama Grey's Anatomy, its spin-off Private Practice, and the political thriller series Scandal. Rhimes has also served as the executive producer of the ABC television series Off the Map, How to Get Away with Murder, and The Catch.[2]\n\nIn 2007, Rhimes was named one of TIME magazine's 100 People Who Help Shape the World.[3] In 2015, she published her first book, a memoir, Year of Yes: How to Dance It Out, Stand in the Sun, and Be Your Own Person. In 2017, Netflix said that it had entered into a multi-year development deal with Rhimes, by which all of her future productions will be Netflix Original series.[4] Netflix had already purchased the streaming rights to back episodes of Grey's Anatomy and Scandal.[5]\n\nEarly life\n\nRhimes was born in Chicago, Illinois, as the youngest of six children of Vera P. (Cain), a college professor, and Ilee Rhimes, Jr., a university administrator.[6][7] Her mother attended college while raising their six children and earned a PhD in educational administration in 1991. Her father, who holds an MBA, became chief information officer (CIO) at the University of Southern California, serving until 2013.[8]\n\nRhimes lived in Park Forest South (now University Park, Illinois), with her two older brothers and three older sisters. She has said she exhibited an early affinity for storytelling.[9] While in high school, she served as a hospital volunteer, which inspired an interest in hospital environments.[10]\n\nRhimes attended Marian Catholic High School in Chicago Heights, Illinois. At Dartmouth College, she majored in English and film studies and earned her bachelor's degree in 1991.[11][12] At Dartmouth, she joined the Black Underground Theater Association. She divided her time between directing and performing in student productions, and writing fiction.[11]\n\nShe also wrote for the college newspaper.[13] After college, she relocated to San Francisco with an older sibling and worked in advertising at McCann Erickson.[14] She subsequently moved to Los Angeles to attend the University of Southern California and study screenwriting.[9] Ranked at the top of her USC class, Rhimes earned the Gary Rosenberg Writing Fellowship.[14] She obtained a Master of Fine Arts degree from the USC School of Cinematic Arts.\n\nWhile at USC, Rhimes was hired as an intern by Debra Martin Chase. Rhimes credits her early success, in part, to mentors such as this prominent African-American producer, and she worked at Denzel Washington's company, Mundy Lane Entertainment.[15] Chase served as a mentor to Rhimes: they worked together on The Princess Diaries 2.\n\nPersonal life\n\nRhimes adopted her first daughter in June 2002 and adopted another girl in February 2012.[16] In September 2013, Rhimes welcomed her third daughter via gestational surrogacy.[17]\n\nIn 2014, Rhimes gave a commencement address at her alma mater, Dartmouth College, where she received an honorary doctorate.[18]\n\nIn September 2015, Rhimes revealed she had lost 117 pounds via exercise and dieting.[19][20]\n\nCareer\n\nCareer beginnings: 1995–2004\n\nAfter graduation, Rhimes was an unemployed scriptwriter in Hollywood.[9] To make ends meet, Rhimes worked at a variety of day jobs, including as an office administrator, and then a counselor at a job center that taught job skills to mentally ill and homeless people. During this period, Rhimes worked as research director on the documentary, Hank Aaron: Chasing the Dream (1995), which won the 1995 Peabody Award.[9][14] In 1998 Rhimes made a short film, Blossoms and Veils, starring Jada Pinkett-Smith and Jeffrey Wright, which is her only credit as a film director.[9] New Line Cinema purchased a feature script of hers. Rhimes received an assignment to co-write the HBO movie Introducing Dorothy Dandridge (1999). It earned numerous awards for its star, Halle Berry.[9][14]\n\nIn 2001, Rhimes wrote Crossroads, the debut film of pop singer Britney Spears.[21] Despite being panned by critics, the film grossed more than $60 million worldwide.[22][23]\n\nRhimes next worked on writing Disney's sequel to its popular movie, The Princess Diaries (2001). Although The Princess Diaries 2: Royal Engagement (2004) did not score as well at the box office, Rhimes later said that she treasured the experience, if only for the opportunity to work with its star, Julie Andrews.[9] In 2003, Rhimes wrote her first TV pilot for ABC, about young female war correspondents, but the network turned it down.[14][15]\n\nGrey's Anatomy, Private Practice, Scandal and other projects with ABC\n\nRhimes is the creator and currently executive producer and head writer of Grey's Anatomy. The series debuted as a mid-season replacement on March 27, 2005. The series features the surgical staff at the fictional Seattle Grace Hospital (later to be named Grey Sloan Memorial Hospital), in Seattle, Washington. The series features an ensemble cast with Ellen Pompeo serving as titular character Meredith Grey, who provides narration for a majority of the series' episodes. On May 16, 2006, ABC announced plans to relocate Grey's Anatomy from Sunday evenings to Thursdays to anchor the network's Thursday evening programming,[24] by airing Thursdays at 9 p.m. As of 2018, the series continues.\n\nIn 2007, Rhimes created and produced the Grey's Anatomy spin-off series Private Practice, which debuted September 26, 2007, on ABC. The show chronicled the life of Dr. Addison Montgomery (Kate Walsh) as she left Seattle Grace Hospital for Los Angeles to join a private practice. The series also featured an ensemble cast, including Tim Daly, Amy Brenneman, Audra McDonald and Taye Diggs among others. The first season was shortened because of a writers' strike; it has nine episodes. In May 2012, ABC picked up Private Practice for the 2012–13 television season with 13 episodes. The series finale was aired January 22, 2013.[25]\n\nIn 2010, Rhimes created a new pilot for ABC called Inside the Box, a female-centric ensemble drama set in a Washington, D.C. network news bureau. The lead character was Catherine, an ambitious female news producer who, with her colleagues, pursued \"the story\" at all costs while juggling their personal animosities and crises of conscience.[26] It was not picked up by the network.[27]\n\nIn 2011, Rhimes served as executive producer for the medical drama, Off the Map, which was created by Grey's Anatomy writer, Jenna Bans. It focused on a group of doctors who practice medicine at a remote clinic in the Amazon jungle.[28] The series was officially cancelled by the ABC network on May 13, 2011.[29]\n\nIn May 2011, ABC ordered Rhimes' pilot script Scandal to series. Kerry Washington stars as Olivia Pope, a political crisis management expert. The character is partially based on former Bush administration press aide Judy Smith.[30][31] The series debut aired on April 5, 2012.[32]\n\nIn 2012, Rhimes developed a pilot for a period drama, Gilded Lilys, but it was not picked up to series.[33][34]\n\nIn December 2013, ABC ordered a pilot for a new Rhimes series, How to Get Away with Murder.[35] Actress Viola Davis joined the cast as the lead character in February 2014.[36] It was officially picked up to series on May 8, 2014.[37]\n\nIn March 2016, ABC premiered The Catch, a comedy-drama led by Rhimes based on a treatment by British author Kate Atkinson. It starred Mireille Enos and Peter Krause.[38] Later that month, Scandal, How to Get Away with Murder and Grey's Anatomy were respectively picked up for their sixth, third and 13th seasons. The following year, it was announced that Scandal would conclude after its upcoming seventh season, while The Catch was cancelled after its second.[39]\n\nNetflix deal\n\nOn August 14, 2017, Netflix announced that it had entered into an exclusive multi-year development deal with Rhimes, under which all of her future productions will be Netflix Original series. The service already had purchased U.S. streaming rights to past episodes of Grey's Anatomy and Scandal. Chief content officer Ted Sarandos described Rhimes as being a \"true Netflixer at heart\", since \"she loves TV and films, she cares passionately about her work, and she delivers for her audience\".[39]\n\nOf the deal, Rhimes said that\n\n[Sarandos] understood what I was looking for — the opportunity to build a vibrant new storytelling home for writers with the unique creative freedom and instantaneous global reach provided by Netflix's singular sense of innovation. The future of Shondaland at Netflix has limitless possibilities.[39]\n\nThe deal was considered to be a coup for Netflix due to Rhimes' prominence at ABC; it was also considered to be a counter toward the effort by Disney, ABC's parent company, to reduce the availability of their content on Netflix in favor of a planned subscription streaming service of their own.[39]\n\nIn June 2018, Netflix announced that the first project under the deal will be an adaptation of the New York magazine story How Anna Delvey Tricked New York's Party People, originally written by Jessica Pressler based on the real-life story of the controversial society fraud Anna Delvey.[40]\n\nShondaland\n\nShondaland is the name of Rhimes's production company.[41] Shondaland and its logo also refer to the shows Rhimes has produced[42] and to Rhimes herself. Shows included in Shondaland are:\n\nFilmography\n\nBibliography\n\nYear of Yes: How to Dance It Out, Stand In the Sun and Be Your Own Person, September 2016.\n\nEssays and reporting\n\n\"Scoop dreams\". Work for Hire. The New Yorker. 92 (32): 64. October 10, 2016. [46]\n\nAwards and nominations\n\nShonda Rhimes has won a Golden Globe award and was nominated for three Emmy Awards. She has also won awards from the Writer's Guild of America, Producer's Guild of America, and Director's Guild of America. Below is a more complete list.\n\nYear Category Nominated work Result Ref. 2011 Best Continuing Series Grey's Anatomy Nominated [47]\n\nYear Category Nominated work Result Ref. 2014 DGA Diversity Award Shonda Rhimes Won [47]\n\nYear Category Nominated work Result Ref. 2012 Golden Gate Award Shonda Rhimes Won [47]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Ms._magazine_Cover_-_Spring_2015.jpg/1200px-Ms._magazine_Cover_-_Spring_2015.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Ms._magazine_Cover_-_Spring_2015.jpg/220px-Ms._magazine_Cover_-_Spring_2015.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Ms._magazine_Cover_-_Spring_2015.jpg/1200px-Ms._magazine_Cover_-_Spring_2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Shonda_Rhimes", "title": "Shonda Rhimes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Ms._magazine_Cover_-_Spring_2015.jpg/1200px-Ms._magazine_Cover_-_Spring_2015.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}