{"url": "www.theguardian.com/lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt", "text": "Each week celebrity magazines breathlessly report yet another twist in the Jen-Brad-Angelina love triangle. But where do the stories come from? Are they ever true? And does that even matter?\n\nIn October 2007, at the unpoliced border between truth and invention where most weekly celebrity magazines have their headquarters, a rumour began to take hold: Brad Pitt and Angelina Jolie were splitting up. \"The romance is over,\" declared the US weekly In Touch, though its cover showed the world's most famous couple looking generally content. \"Jen blamed for wrecking marriage,\" Britain's Grazia explained a few weeks later, illustrating the story with a paparazzi shot of Pitt's ex-wife, Jennifer Aniston, wearing an irritated expression.\n\nBy then, though, In Touch already had a new scoop - \"A wedding to keep Brad!\" - and by the spring of 2008, things were looking official: \"Yes, they're getting married! The emotional moment Angelina knew she had to marry Brad.\" (A special edition of In Touch soon followed: \"Brad and Angelina: the wedding of the century.\")\n\nCuriously, the happy news never made the cover of the US edition of OK!, which focused instead on \"the wedding of the year\" - a \"backyard ceremony\" between Aniston and the singer John Mayer. Within months, the Aniston-Mayer union had flowered into another OK! exclusive that seemed to put to rest, at last, the long-running drama of the then 39-year-old Aniston's hunger for motherhood. \"Baby time for Jen,\" the magazine announced. In the Jolie-Pitt household, by contrast, things were no longer rosy: in fact, the relationship was over. \"Brad walks away,\" revealed In Touch.\n\nOf course, from a traditional perspective on the nature of reality, there were problems with these stories. Brad Pitt and Angelina Jolie had not separated, and did not get married. Jennifer Aniston and John Mayer did not get married either. As far as can be ascertained, Aniston is not pregnant. \"These weeklies no longer have any interest in actual reporting,\" Aniston's publicist, Stephen Huvane, told me via email. Richard Spencer, the editor-in-chief of In Touch, insists that all his stories are double-sourced. But maybe these disagreements over journalistic ethics miss the point. The weeklies are their own world, with their own rules. Their priority is to keep the rollercoaster of a star's life - romance, betrayal, marriage, separation, reunion - moving as quickly as possible. Real facts play a role, but not always a leading one. \"A tabloid version of a fact isn't exactly a lie,\" is how one editor at a prominent celebrity weekly puts it. \"But it isn't the truth. You know what I mean?\"\n\nAnd nowhere does the rollercoaster lurch more rapidly than in the narrative of the Aniston/Pitt/Jolie love triangle, now entering its sixth year - an astonishingly long time in the fast-turnover world of the weeklies. Even the verifiable facts about the three, the ones we can all agree on, seem too good to be true. A personable, blonde, all-American girl next door, cherished for her role in Friends, marries the leading heartthrob of his generation, who leaves her for a mercurial, almost freakishly beautiful star whom he meets on a movie set. He adopts her two children, they adopt one more, and have three of their own, including a pair of predictably perfect twins. Their expanding family - effortlessly combined with their humanitarian work - stands in perpetual affront to the all-American blonde, who makes no secret of her desire to have children, but instead bounces from one unsuccessful liaison to another, happiness always just out of reach.\n\nBut the verifiable facts will only take you so far. Fuelled by panic over falling magazine circulations, the challenges posed by blogs and a desensitised readership hungry for authentic emotion, the storyline of Brad, Angelina and Jennifer has achieved escape velocity. It seems, somehow, to exist independently of its real-life protagonists, even as it draws on the facts of their lives. And its inner workings - the web of relationships between stars, publicists, editors, paparazzi, \"insider\" sources and bloggers - show the machinery of modern fame operating at its most combative, absurd and intense.\n\nThe frenetic state of today's celebrity news industry stems from one inescapable fact: the lives of real people - even people as volatile and wealthy as A-list movie stars - simply don't unfold fast enough to meet the appetite for information about them. Weekly magazines need weekly scoops, and preferably scoops different enough to distinguish them from their rivals. Sales of celebrity magazines are plummeting (newsstand sales in the US fell 11% in the second half of last year, and the situation in the UK is similar, though Grazia is an exception) but the decline seems only to have increased the desperation for exclusives.\n\nOutside the traditional markets, meanwhile, OK! India or OK! Middle East (\"Dubai's premier celebrity magazine\") may be hunting for their own angle. Thousands of blogs crave multiple daily updates, and the biggest - TMZ.com, PerezHilton.com - can afford to pay for paparazzi pictures. And yet one person can only adopt so many Cambodian children in a given year, no matter how intent on breaking records Jolie may sometimes seem.\n\nEditorial meetings at celebrity magazines, therefore, may not always resemble those elsewhere. \"You build the story around an emotion,\" says a celebrity weekly editor, who spoke on condition of anonymity. \"What's happening with poor Jen this week? Well, John Mayer's seeing someone else, and for a woman of her age, that must be awful ... So you construct a narrative of what a woman her age may be feeling.\" Stories may start with nothing more than a set of photographs: Aniston looking happy, or sad - or happy one moment and sad the next, since if you take multiple shots of anyone, with a fast shutter speed, you can capture a range of expressions. \"The question is: how can we construct a story around a set of emotions that our readers are going to relate to? It can come from a genuine tip, or a photo. Or it can come out of our ass.\"\n\nDespite this freewheeling approach to the facts, the resulting stories stick to a narrow range. Aniston must emerge with hope, the editor says: despondency must be short-lived, because it's depressing - and, just as importantly, dull. (It would be just as dull were Aniston to find lasting peace with being single or childless. Stable couples are boring, too, however great their Hollywood clout: Kate Winslet doesn't sell magazines, and neither do Reese Witherspoon and Jake Gyllenhaal, so they rarely appear on covers.)\n\nThere are only really seven Brad/Jen/Angelina stories, endlessly recycled: Brad and Angelina in love; Brad and Angelina obtaining more children; Brad secretly meeting or texting Jen; Angelina's fury at Brad for meeting or texting Jen; Angelina looking dangerously thin (\"scary skinny\"); Jen in love; Jen alone again. \"You develop the narrative because you know it sells,\" the editor says. \"And because selling is everything, you have to come up with the next chapter. But things don't move on that quickly.\"\n\nIntuitively, you'd think the stars must ultimately welcome such coverage: surely even the pitiable image of Poor Jen is valuable exposure for an actor whose recent movies haven't been blockbusters? But while undoubtedly true lower down the food chain - \"the Hayden Panettiere level\", as one magazine writer described it - at the highest level of the celebrity ecosystem, if Pitt, Aniston and Jolie do benefit they don't acknowledge it. When I put the matter to Huvane - who represents Aniston, Gwyneth Paltrow, Demi Moore, Meg Ryan, Julianne Moore and Kirsten Dunst - he declined to be interviewed, but then sent several lengthy emails. \"I don't think lies and complete fabrications serve any positive result,\" he wrote. \"We were doing just fine before the weeklies even existed ... All they do is distort and damage the dignity of the private lives of actors ... I have never represented a client who enjoyed being followed by paparazzi or having fabricated stories about their lives in those magazines.\"\n\nHuvane is notorious for refusing to dignify stories in the weeklies with a response; Aniston confines her interviews to more respectful monthly magazines, and has been known to wear the same outfit for days, to reduce the market value of paparazzi shots. Huvane is scornful of the notion that this total non-co-operation only lets the rumour mill run wild.\n\n\"If you co-operate with one of the magazines, their competitors become vengeful and attack clients,\" he emailed. \"There is no upside to working with them ... Their tactic is to make up stories that are so damaging, in the hope that we would engage in a dialogue that gives them access to the talent.\" Contempt seemed to radiate from my laptop screen. \"We don't respond to that kind of behaviour,\" he concluded.\n\nWhich is not to say that the stars don't fan the flames by discussing their private relationships in the interviews they do give: Aniston famously told Vogue she thought Jolie's public comments about falling in love with Pitt, on the set of Mr & Mrs Smith, had been \"totally uncool\". At one recent film awards ceremony, Aniston even mined the love-triangle story for laughs, telling the audience that the titles of her movies (The Good Girl, Derailed, The Breakup) mirrored her life: \"If anyone has a movie called Everlasting Love With An Adult Stable Man, that would be great!\"\n\nAmid this environment of low-level war between publicists and magazines, Jolie cuts an exceptional figure. The 34-year-old employs no publicist, and for years at a time has had no agent. She arranges press and TV appearances herself, using a team of assistants, and last year, according to the New York Times, personally orchestrated the bidding war for the first pictures of her twins, Knox Leon and Vivienne Marcheline. The sale of rights, which went to People magazine in the US and Hello! in the rest of the world, raised $14m for the Pitt-Jolie Foundation, breaking all records for celebrity baby photos. The agreement, the New York Times reported, specified that the winning magazines were \"obliged to offer coverage that would not reflect negatively on [Jolie] or her family\". (In a statement, People denied making such a deal, but has been unsparingly positive in its coverage since.)\n\nIn a manner reminiscent of Princess Diana, Jolie has openly exploited the appetite for pictures to highlight her humanitarian work, which involves significant Washington lobbying efforts as well as the usual foreign trips. It's not clear whether her motives are entirely philanthropic: the focus on refugee issues may also serve to displace unwanted coverage, such as the potentially damaging portrayal of Jolie as a marriage-wrecker, which is known to have distressed her. But her approach shows how far a strategically minded star can still wrest power from the ravening media.\n\nThe record-breaking sums, however, may be a thing of the past. \"It was uncanny, the way [celebrity photo deals] mirrored the economy,\" says the weekly magazine editor. \"You just felt like you were on the edge. I remember saying to a friend: 'We're fiddling while Rome burns!' The highest amount ever paid for a celebrity child - and then, literally weeks later, Lehmann Brothers goes bust.\"\n\nFrancois Navarre came to Los Angeles from France to cover hard news: as a photojournalist for Le Monde, he chronicled the race riots that exploded on America's west coast in the early 1990s. \"I thought gossip news was not serious at all,\" he says. But he proved unable to resist. Navarre founded X17, now one of the world's biggest paparazzi agencies, employing around 60 photographers who work in team pursuit of the stars. When a newly bald Britney Spears attacked and damaged a sports utility vehicle with an umbrella in February 2007, it was an X17 photographer's vehicle that she targeted.\n\nWe're accustomed, with good reason, to thinking of the paparazzi as the lowest of the low, unworthy of being called journalists. But the irony of celebrity media is that the pictures sold by X17 and others are the only part that is solidly, indisputably real. How those pictures are interpreted by magazine writers, on the other hand, is anyone's guess. \"Today we had this exact thing,\" Navarre says. \"Hugh Grant, in New York, leaving a restaurant. In one picture he looks really upset, and in another, he's smiling. I'm sure we'll see 'look how angry he is, he's a loser,' and also, 'look, how happy and charming!' For Angelina, too - they totally take it picture by picture, to illustrate different angles.\"\n\nPitt is one of the paparazzi's least favourite subjects. \"It's almost an obsession for him, not being photographed,\" Navarre says. \"He's a photographer himself, or wants to be, and it bothers him that people take pictures of him and make money - he's crazy about that. It's not about privacy - he can say it's the kids as much as he wants, but I knew him before, and he was like that when he was just a guy with his guitar.\"\n\nPure fabrication by magazines is rare, Navarre maintains. \"Coming from hard news, we had this idea that in gossip, everything's fake. But now I'm on the gossip side, I'm surprised by how most of the time it's not. You'll have a little bit of news - a hint. I thought the fight between Angelina and Aniston would be totally fake, but it's not. Ninety per cent of the time, it comes from something true.\" Besides, he says, sounding briefly like a French poststructuralist philosopher, \"there is this idea that there is only one truth, and that you have to stick to it. But maybe not.\"\n\nThe blogosphere has greatly exacerbated this what-is-truth-anyway? approach. At sites such as Gawker and Defamer, Hollywood gossip is breathlessly consumed, but also marinaded in a rich sauce of cynicism. Readers are happy to engage with the narrative - and even buy ironic Team Aniston and Team Jolie T-shirts - without assuming any particular story to be true. The same is surely true of many readers of the weeklies. But the blogs, unlike the magazines, can admit it.\n\nRichard Spencer at In Touch is adamant that quotations attributed to \"an insider\" in his magazine always come from \"someone very close to the celebrity, or someone the celebrity employs - anyone from a bodyguard to a nanny to a friend to a hairstylist\", and that they're never paid. (They share their gossip, he says, because \"it's human nature\".) But he's happy to acknowledge that truth can be kaleidoscopic. \"Different friends tell different people different things,\" he says when I point out blatant contradictions between his magazine and others. \"It's not a question of anyone being wrong. If you were having divorce trouble, one friend could say, 'Oh, they're solid, nothing to worry about.' Another could say: 'You didn't see the fight I saw last night. She was crying in the bathroom.'\"\n\nAs for the Brangelina wedding that never happened, Spencer's argument runs as follows. The weeklies report the current state of rumours. A wedding was rumoured, so it was truthful to report that. \"We're not the type of magazine to just wait until it's confirmed,\" he says. \"People closely involved were talking about it. Pretend you had a sister in the same situation. Do you only want to know when your sister has got married? Or do you want me to tell you I had dinner with her last night, and she told me she thinks she might get married this summer? You can't just sit back and say 'when it happens, we'll report it with everyone else'.\"\n\n\"Angelina's birthday ends in tears,\" reports the current edition of In Touch. \"A friend\" explains that \"too much togetherness has taken its toll\". The magazine adds: \"While Brad did go to a lot of trouble for Angelina's 34th - presenting her with a specially commissioned painting of their family, as well as lingerie from Angelina's favourite store, Agent Provocateur - it wasn't long before the troubled couple erupted in a fight over Brad's ex-wife ... 'Things were going fine, and then Angie started accusing Brad of meeting Jen in LA,' says an associate.\"\n\nWhen you spend too much time poring over celebrity magazines, and interviewing their employees, odd things start to happen to your brain. You catch yourself wondering: might the magazines' hunger for new storylines somehow exert an influence on reality itself? According to the laws of some strange physics, unstudied by scientists, might the narrative necessity of a Brangelina divorce lead to one actually happening, in real life?\n\nWell, not for now, according to last week's People, which unsurprisingly offers an entirely different take from In Touch. Angelina's birthday celebrations, it seems, went flawlessly - and happened not at the couple's Long Island mansion but on the set of Jolie's latest film, Salt. (In Touch agrees that Pitt visited the set of Salt, but quotes a \"pal\" who says \"they're just going through the motions for appearance's sake\".)\n\nFor Mother's Day, which is celebrated in May in the US, \"Brad gave Angelina inscribed jewellery,\" People adds. An unnamed friend provides the article's closing quote: \"They are very, very happy.\"", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Celebrity%2CMagazines%2CMedia%2CBrad+Pitt%2CAngelina+Jolie%2CLife+and+style%2CJennifer+Aniston", "https://i.guim.co.uk/img/uploads/2017/10/09/Oliver-Burkeman,-R.png?width=300&quality=85&auto=format&fit=max&s=b75b6e33bbe0ff7d111e8c7785e84577", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2008/07/28/redcarpet1.jpg?width=300&quality=85&auto=format&fit=max&s=03ad57522b77525fac30258e223eed03", "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2008/07/28/redcarpet1.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1bd722630eedab4ad3c4e74bf0ca0dd1"], "top_img": "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2008/07/28/redcarpet1.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1bd722630eedab4ad3c4e74bf0ca0dd1", "keywords": [], "authors": ["Oliver Burkeman"], "canonical_link": "https://www.theguardian.com/lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt", "title": "The Brangelina industry: why Jennifer Aniston, Brad Pitt and Angelina Jolie keep making the headlines", "meta_data": {"description": "Oliver Burkeman reports on the complex relationship between celebrity magazines and Brad, Angelina and Jen", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Oliver Burkeman", "thumbnail": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pixies/2009/5/21/1242933329486/Angelina-Jolie-and-Brad-P-003.jpg?width=620&quality=85&auto=format&fit=max&s=f0f50a8a49d6165e1f758e3dbae9f7da", "keywords": "Celebrity,Magazines,Media,Brad Pitt,Angelina Jolie,Life and style,Jennifer Aniston", "news_keywords": "Celebrity,Magazines,Media,Brad Pitt,Angelina Jolie,Life and style,Jennifer Aniston", "og": {"url": "http://www.theguardian.com/lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt", "image": "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2008/07/28/redcarpet1.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1bd722630eedab4ad3c4e74bf0ca0dd1", "description": "Oliver Burkeman reports on the complex relationship between celebrity magazines and Brad, Angelina and Jen", "type": "article", "title": "The Brangelina industry: why Jennifer Aniston, Brad Pitt and Angelina Jolie keep making the headlines", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/oliverburkeman", "publisher": "https://www.facebook.com/theguardian", "section": "Life and style", "published_time": "2009-06-23T23:01:00.000Z", "tag": "Celebrity,Magazines,Media,Brad Pitt,Angelina Jolie,Life and style,Jennifer Aniston", "modified_time": "2017-11-25T21:21:05.000Z"}, "al": {"ios": {"url": "gnmguardian://lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt", "iphone": "gnmguardian://lifeandstyle/2009/jun/24/magazines-media-aniston-jolie-pitt?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2008/07/28/redcarpet1.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=f6be7d40583c01ed529000ba1871de83", "site": "@guardian", "card": "summary_large_image", "creator": "@oliverburkeman", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1245772800.0, "source": "http://www.theguardian.com", "summary": ""}