{"url": "people.com/movies/sarah-jessica-parker-sax-and-the-city-3-fallout-enormously-painful/", "text": "The cancellation of the third Sex and the City film came with headline-making allegations and jabs shared in the press between stars Sarah Jessica Parker and Kim Cattrall — something Parker says was “enormously painful” for her.\n\nIn an interview with The Daily Beast while promoting the second season of her HBO show Divorce, the 52-year-old Emmy-winner opened up about the pains of hearing things in the press that “aren’t true” — “especially when it is a personal attack about your character.”\n\nGet push notifications with news, features and more.\n\n“I’m stunned by how deeply it still cuts,” Parker said of the drama around the movie, which would have also starred Cynthia Nixon and Kristin Davis. “What happened, that was enormously painful for me.”\n\nImage zoom Kim Cattrall, Sarah Jessica Parker, Cynthia Nixon, Kristin Davis in Sex and the City 2. Craig Blankenhorn/Warner Bros/Courtesy Everett Collection\n\nParker first revealed in September that SATC3 had been scrapped despite 8 years of encouragement from fans and having a “beautiful, funny, heartbreaking, joyful, very relatable script and story” ready for filming.\n\nThough sources told PEOPLE Cattrall made “outrageous demands” to re-board the big screen franchise, she later denied that her requests had anything to do with the scrapping of the film and claimed she had never agreed to board SATC3 in the first place — even refuting an offer to do it back in 2016.\n\n“I never asked for any money, I never asked for any projects. To be thought of as some kind of diva is absolutely ridiculous,” the 61-year-old actress told Piers Morgan in October, saying Parker — who would have been a producer on the film — “could have been nicer.”\n\nCattrall then admitted that she had never been close with the other three co-stars. “We’ve never been friends,” Cattrall said. “We’ve been colleagues and in some way, it’s a very healthy place to be.”\n\nImage zoom Kim Cattrall and Sarah Jessica Parker Bryan Bedder/Getty\n\nAs the story unfolded, Parker said she wanted to speak out about it in the press but was held back by coaches who told her to remain quiet.\n\n“When all that stuff was happening with Sex and the City, which I know is meaningless in the world, but when it’s happening and you’re caught up in any of the muscle of that stuff, it’s so painful because all you want to do is respond. All you want to do is say, ‘Are you kidding me!? This is everything I know. This is everything that happened over the last six months. These are the conversations. These are the emails. These are the conversations with lawyers and agents and studio heads,'” she recalled to The Daily Beast. “But you’re counseled time and time again, “Don’t do it. You’re going to get in the weeds. It’s a nowhere road.”\n\n“I just kept saying, ‘This was an experience I loved. I love those women. We shared this experience. It was a privilege. If that’s what we’re left with, those memories, there are only four of us who…’ You know?” she added.\n\nImage zoom Sarah Jessica Parker Neilson Barnard/NBCUniversal/NBCU Photo Bank/Getty\n\nShe’s been more vocal recently though, talking about the possibility of trying the project again on the Golden Globes red carpet and even jokingly offering Cattrall’s role to Stephen Colbert.\n\nSo what changed? Turns out the bevy of sexual misconduct allegations plaguing Hollywood allowed Parker to put the SATC3 allegations into perspective.\n\n“The world shifted,” she said. “I was like, ‘Oh this is ridiculous.’ I was afraid to talk about these allegations, and now there are real allegations in the world. And all of a sudden I was like, ‘I think I’m going to answer the question about the Sex and the City movie.”\n\n“For so long I was told to be quiet about all of that stuff. And all of a sudden I’m like, ‘If people are being encouraged to come forward and talk about really difficult, painful, potentially criminal things that they were part of or witnessed, I think I can talk about the Sex and the City 3 movie,'” she added, laughing. “I think it’s okay! I’m a grown freaking woman.”\n\nImage zoom Kim Cattrall, Cynthia Nixon, Sarah Jessica Parker, and Kristin Davis Hector Vallenilla/Retna Ltd./Corbis\n\nRELATED VIDEO: Kim Cattrall Slams Sarah Jessica Parker as Tensions Surrounding SATC 3 Revealed: ‘Kim Killed the Movie,’ Says Source\n\nThough she’s open to discussing it now, Parker did understand that the conversation changes the way fans think about the legacy of the project.\n\n“It hurts the franchise… it does,” she said. “It changes the way people experience the show. It changes my own experience to have to talk about it like that. It opens the conversation up time and again. You put the white-hot spotlight back on it again. But then you realize it’s just silliness. Of course I can answer honestly about my experience. Of course I can say what happened. It’s so silly.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fsex-city-wp-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fsjp-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsarah-jessica-parker-kim-cattrall.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fsjp.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsex-and-the-city-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fsjp-2-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/movies/sarah-jessica-parker-sax-and-the-city-3-fallout-enormously-painful/", "title": "Sarah Jessica Parker Says Sex and the City 3 Fallout Was 'Enormously Painful for Me'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Cynthia Nixon,Kim Cattrall,Kristin Davis,Sarah Jessica Parker,Sex and the City,Sex and the City 2,TV", "news_keywords": "Cynthia Nixon,Kim Cattrall,Kristin Davis,Sarah Jessica Parker,Sex and the City,Sex and the City 2,TV", "description": "The cancellation of the third Sex and the City film came with headline-making fallout — something Sarah Jessica Parker struggled with", "og": {"title": "Sarah Jessica Parker Says Sex and the City 3 Fallout Was 'Enormously Painful for Me'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/sarah-jessica-parker-sax-and-the-city-3-fallout-enormously-painful/", "description": "The cancellation of the third&nbsp;Sex and the City&nbsp;film came with headline-making allegations and jabs shared in the press between stars&nbsp;Sarah Jessica Parker&nbsp;and&nbsp;Kim Cattrall&nbsp;— something Parker&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fsjp-2-2000.jpg", "width": 1231, "height": 645}}, "pinterest": {"url": "https://people.com/movies/sarah-jessica-parker-sax-and-the-city-3-fallout-enormously-painful/", "description": "The cancellation of the third Sex and the City film came with headline-making fallout — something Sarah Jessica Parker struggled with", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fsjp-2-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/sarah-jessica-parker-sax-and-the-city-3-fallout-enormously-painful/", "title": "Sarah Jessica Parker Says Sex and the City 3 Fallout Was 'Enormously Painful for Me'", "description": "The cancellation of the third Sex and the City film came with headline-making fallout — something Sarah Jessica Parker struggled with", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fsjp-2-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}