{"url": "www.thecut.com/2018/07/katie-holmes-jamie-foxx.html", "text": "Photo: Getty Images\n\nWelcome to You Know What I Heard, the Cut’s weekly celebrity gossip column about the peregrinations of the rich and famous.\n\nGet the best celebrity gossip in your inbox every week. Receive alerts every time there's more news from You Know What I Heard. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nKatie Holmes and Jamie Foxx have been rumored to be dating for five years now, but they’ve never publicly confirmed their relationship. In the beginning, it seemed like they were seeking privacy to avoid the wrath of Holmes’s ex-husband Tom Cruise. (There’s a persistent but unfounded rumor that Cruise put a five-year “dating ban” clause in the divorce agreement, which would have required Holmes to stay single in public until last year.) Then, it seemed like Foxx was the one who didn’t want to go public with Holmes, to maintain his image as a single man. But over the last year, the two have been more open about the fact that they spend time together: They’ve been spotted out to dinner multiple times and were photographed holding hands on a beach last September. So what’s their status now?\n\nLast week, the mostly fictional gossip site RadarOnline reported that Holmes and Foxx were planning a wedding but recently called it off due to “trust issues.” Surprisingly, Holmes’s publicist responded to the report, telling People that it was “100 percent untrue.” So … they’re together still? But not planning a wedding. But they’re in love! At least according to the latest from “Page Six.”\n\nThe gossip site reported yesterday that Holmes and Foxx had a “lovey dovey FaceTime chat” as Holmes was about to take off on a plane to Paris for Haute Couture Fashion Week. “Katie was FaceTiming Jamie after they boarded,” a source told the site. “She said she loves him and asked if he wanted ‘cookies from Paris.’ He was in Miami.” The source added that Holmes’s daughter, Suri Cruise, a nanny, and another friend were also on the flight.\n\nThis leak says to me that everything is status quo: Holmes and Foxx are together, they’re not going to talk about it publicly, and there’s probably never going to be a wedding.\n\nA few weeks ago we talked about Chris Pratt’s potential new girlfriend, Katherine Schwarzenegger. She’s the 28-year-old daughter of Arnold Schwarzenegger and Maria Shriver. She’s a lifestyle blogger. And she’s a Christian, apparently, which is what makes this Pratt relationship seem very plausible.\n\nPratt, who is 39, has been outspoken about his faith for the last five years or so. He is a regular attendee at Zoe Church, a millennial megachurch in L.A. founded by celebrity pastor Chad Veach. (Justin Bieber and several of Justin Bieber’s girlfriends have attended services there.) Guess who is a close personal friend of Veach? Shriver. She “interviewed” him for her Facebook page last December and noted that he comes to her house regularly to counsel her children.\n\nSo … did Veach set Pratt and Schwarzenegger up? Not exactly. According to reports in People and Us Weekly, Shriver was the one to make the match. An Us Weekly source said in a report yesterday that she set her daughter up with Pratt because “they’re both active in the church.” People’s source said Pratt and Schwarzenegger have been on “multiple dates,” including a picnic lunch in Santa Barbara that the paparazzi just so happened to catch last month. Did Shriver have something to do with that, too?\n\nOne small blessing from this week:\n\nKaley Cuoco got married in a horse barn.\n\nAnd here’s an interesting blind item from this week, from Enty at Crazy Days and Nights:\n\n“Don’t believe the hype. This former A list mostly movie actress who probably has dropped to A- or maybe even a B+ list because she doesn’t act as much, loves social media. She just doesn’t want the public, or her actor husband [to know] that she has it, especially since she uses some of her secret accounts to make sure he is being relatively faithful.”\n\nHmm … who just did a big magazine interview complaining about social media?\n\nFinally, I’ll leave you with a rude little “Page Six” story about John Mayer. Mayer, who has been mounting a comeback of sorts in recent months, is apparently having a hard time finding a new famous woman to date. An anonymous celebrity publicist told the site, “I would tell women in Hollywood to steer clear of him. He’s manipulative. He has a reputation … and it’s better to exercise caution dealing with anybody who kisses and tells.” We all remember what he said about Jessica Simpson, yes? Look out, Cazzie David!\n\nPhoto: Matt Winkelmeyer/Getty Images\n\nThanks so much for gossiping this week. Don’t forget to email me at allie.jones@nymag.com, send me a message on Twitter, or contact me on Signal, if you’d like to chat.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/chris-pratt-katherine-schwarzenegger.w710.h473.jpg ", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/john-mayer.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/lede.w700.h700.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/lede.w1200.h630.jpg", "keywords": [], "authors": ["Allie Jones"], "canonical_link": "https://www.thecut.com/2018/07/katie-holmes-jamie-foxx.html", "title": "What’s Going On With Katie Holmes and Jamie Foxx?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "What’s Going On With Katie Holmes and Jamie Foxx?", "url": "https://www.thecut.com/2018/07/katie-holmes-jamie-foxx.html", "description": "And more in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "What’s Going On With Katie Holmes and Jamie Foxx?", "description": "And more in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/07/03/gossip/lede.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@allierileyjones", "site": "@TheCut"}, "article": {"published_time": "2018-07-03T17:05:37.469Z", "tag": "you know what i heard, celebrity, culture, jamie foxx, katie holmes, christ pratt, john mayer", "publisher": "https://www.facebook.com/cut"}, "description": "And more in this week’s celebrity gossip column.", "sailthru.tags": "you know what i heard, celebrity, culture, jamie foxx, katie holmes, christ pratt, john mayer", "author": "Allie Jones", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1530637537.469, "source": "http://www.thecut.com", "summary": ""}