{"url": "www.inquisitr.com/4822966/brad-pitt-vowed-to-stay-celibate-amid-angelina-jolie-divorce-is-not-true-reports-gossip-cop/", "text": "Brad Pitt and Angelina Jolie’s official announcement to end their two-year marriage came as a surprise to their fans and well-wishers. Ever since their official separation, a lot has been written and said about the private lives of Brad, Angelina, and their six children. Most recently, it was claimed by several outlets that in order to move on in his life, Brad had reportedly vowed to remain celibate for a year. However, Gossip Cop debunked the claims.\n\nIn a recent report from The Sun, it was allegedly claimed that the award-winning actor is determined to not get intimate with anyone as he still continues to mend his broken heart after ending a decade-long romance with Angelina Jolie.\n\nBrad Pitt has not been in a relationship since his split with Angelina Jolie, but has been linked with several celebrities. In the recent months, his name was allegedly linked with Sienna Miller and Princess Charlotte Casiraghi. Most recently, his name was linked with his former wife, Jennifer Aniston. But apparently, the actor wants to focus on himself and his projects, revealed a source to The Sun.\n\n“He has been in relationships for pretty much all of his entire adult life.”\n\nHowever, Gossip Cop has debunked The Sun’s claims, and after contacting a source close to Brad, it revealed that the claims are fabricated.\n\nBrad Pitt and Angelina Jolie arrive at the premiere of Paramount Pictures' 'Beowulf.' Featured image credit: Kevin Winter Getty Images\n\nBrad revealed in an earlier interview that he quit drinking and was focused on a healthier lifestyle. It was also announced that Pitt was casually dating, but reportedly taking it slow. According to Gossip Cop, The Sun’s report had no real insight into the situation.\n\nIn professional endeavors, Brad Pitt will be next seen in James Gray’s sci-fi film, Ad Astra. In the forthcoming film, Brad will be seen portraying the role of Roy McBride, who searches across the galaxy to look for his father (played by Tommy Lee Jones), an engineer who disappeared on an alien mission. Ad Astra is scheduled to release on January 11, 2019.\n\nAfter Ad Astra, Brad will be seen sharing screen space with Academy Award-winning actor Leonardo DiCaprio in Quentin Tarantino’s Once Upon a Time in Hollywood. The upcoming film is said to have the backdrop of Sharon Tate’s murder, which shocked the nation in 1969.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/03/brad-pitt-angelina-jolie-marriage-picture-news.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2018/03/brad-pitt-celibacy-news-2018.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/2796d5da17c476cbb25029169dfc079c?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Viraj Mahajan"], "canonical_link": "https://www.inquisitr.com/4822966/brad-pitt-vowed-to-stay-celibate-amid-angelina-jolie-divorce-is-not-true-reports-gossip-cop/", "title": "Brad Pitt Vowing ‘To Stay Celibate’ Amid Angelina Jolie Divorce Is Not True, Reports ‘Gossip Cop’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}