{"url": "https://www.pbs.org/newshour/arts/as-more-women-accuse-charlie-rose-some-say-they-alerted-cbs-managers", "text": "NEW YORK — With 27 more women accusing former news anchor Charlie Rose of sexual misconduct, a report Thursday calls into question CBS News’ claims that his behavior was a surprise before he was fired last November.\n\nThe Washington Post said that on least three occasions prior to that, women reported discomfort about Rose’s actions to superiors. Rose was fired as “CBS This Morning” anchor and PBS cancelled his interview show after an earlier Post report on women who said he groped them, made lewd remarks or walked around naked around them.\n\nIn one new allegation, a former research assistant said Rose exposed his penis and touched her breasts when they worked at NBC News’ Washington bureau in 1976.\n\nThe Post said Rose, 76, told the newspaper in an email that its story was inaccurate and unfair.\n\nSince Rose was fired, CBS News said it has taken steps to ensure a safer workplace, including mandatory misconduct training. Network news President David Rhodes and other key managers have said they were unaware of Rose’s actions. Yet the Post outlined three episodes where word had reportedly spread:\n\nAnnmarie Parr was a 22-year-old news clerk in 1986 when she handed Rose a script and he asked whether she enjoyed sex and how often she liked to have it. She told a senior producer about it and said she didn’t want to be alone with Rose, and said her boss laughed and said, “Fine, you don’t have to be alone with him anymore.”\n\nIn 2011, a woman who worked at “CBS This Morning” said Rose forcibly kissed her at a holiday party. She complained to the show’s top producer, Chris Licht, but asked him not to tell human resources about it. Licht told the newspaper he followed her wishes and also talked to Rose about the incident.\n\nA 24-year-old woman who worked the night shift was noticed by Rose last year. He began taking her to expensive restaurants and talked about other jobs. The executive assistant to the show’s new producer, Ryan Kadro, said she told her boss about the attention Rose was paying to the young woman, and said he did not seem alarmed. Kadro disputed that she told him about inappropriate behavior.\n\nSome of the women told the Post they feared reporting bad behavior to their bosses because the network was more concerned about the male TV personalities. “I had been there long enough to know that it was just the way things went,” said Sophie Gayter, 27, who said Rose groped her while they walked down a hall. “People said what they wanted to you. People did what they wanted to you.”\n\nEleanor McManus, co-founder of Press Forward, a group of women who have been victims of sexual misconduct in newsrooms, said the Post report illustrated a systematic problem across news organizations that needed to be addressed.\n\n“It’s pretty clear that there were people in management who were aware that there was a problem, and nothing was done,” McManus told The Associated Press on Thursday. With the stories that have come out about the likes of Rose, Matt Lauer and Mark Halperin, the networks are making strides but women need to know they can report wrongdoings without repercussions, she said.\n\nMarcy McGinnis, who was senior vice president of newsgathering at CBS News when she left in 2005, said she didn’t know Rose but knew he had a reputation as a “ladies man.” His behavior never came up at senior staff meetings, she said, and she was surprised as others when she read about Rose’s behavior.\n\n“This just proves how important it is for people in positions of authority to believe people when they come forward with complaints, instead of brushing them off (by saying) ‘boys will be boys’ or ‘that’s just Charlie,'” McGinnis said.\n\nCBS News said it could not confirm or corroborate many of the stories told by The Post.\n\n“We continue to look for ways to improve our workplace and this period of reflection and action has been important to all of us,” the network said.\n\nThe network recently appointed a working group led by Karen Raffensberger, CBS standards director, to look at the structure of how CBS handles complaints of inappropriate behavior.\n\nFor many years, Rose did his PBS interview show at the same time he worked for CBS, and the Post story also examined his behavior there. In 2003, a then-20-year-old intern was brought by Rose on a trip to California, where she alleged that he squeezed her breast while on a car ride. The woman said she complained to PBS management and was told that Rose was harmless.\n\nPoll: A third of women say they’ve been sexually harassed or abused at work", "images": ["https://d3i6fh83elv35t.cloudfront.net/newshour/app/themes/pbs-newshour/assets/img/placeholder.jpg", "https://d3i6fh83elv35t.cloudfront.net/static/2019/07/canvas-promo.png", "https://d3i6fh83elv35t.cloudfront.net/static/2019/03/newsletter-politics-1024x684.jpg", "https://d3i6fh83elv35t.cloudfront.net/static/2020/04/2020-04-07T160931Z_1640666070_RC2SZF9G729L_RTRMADP_3_HEALTH-CORONAVIRUS-BRITAIN-ANTIBODIES-425x283.jpg", "https://d3i6fh83elv35t.cloudfront.net/newshour/app/themes/pbs-newshour/assets/img/sponsors/bnsf-railway.png", "https://d3i6fh83elv35t.cloudfront.net/newshour/app/themes/pbs-newshour/assets/img/sponsors/consumer-cellular.png", "https://d3i6fh83elv35t.cloudfront.net/static/2020/03/coronavirus-background.png", "https://d3i6fh83elv35t.cloudfront.net/newshour/app/themes/pbs-newshour/assets/img/sponsors/mutual-of-america.png", "https://d3i6fh83elv35t.cloudfront.net/static/2017/11/rose-300x200.jpg", "https://d3i6fh83elv35t.cloudfront.net/newshour/app/themes/pbs-newshour/assets/img/sponsors/raymond-james.png", "https://d3i6fh83elv35t.cloudfront.net/newshour/app/themes/pbs-newshour/assets/img/sponsors/cpb-footer-trans.png", "https://d3i6fh83elv35t.cloudfront.net/static/2017/11/rose-1024x683.jpg"], "top_img": "https://d3i6fh83elv35t.cloudfront.net/static/2017/11/rose-1024x683.jpg", "keywords": [], "authors": ["David Bauder", "Associated Press"], "canonical_link": "https://www.pbs.org/newshour/arts/as-more-women-accuse-charlie-rose-some-say-they-alerted-cbs-managers", "title": "As more women accuse Charlie Rose of sexual harassment, some say they alerted CBS managers", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "With 27 more women accusing former news anchor Charlie Rose of sexual misconduct, a report Thursday calls into question CBS News' claims that his behavior was a surprise before he was fired last November.", "og": {"locale": "en_US", "type": "article", "site_name": "PBS NewsHour", "title": "As more women accuse Charlie Rose of sexual harassment, some say they alerted CBS managers", "description": "With 27 more women accusing former news anchor Charlie Rose of sexual misconduct, a report Thursday calls into question CBS News' claims that his behavior was a surprise before he was fired last November.", "image": {"identifier": "https://d3i6fh83elv35t.cloudfront.net/static/2017/11/rose-1024x683.jpg", "height": 683, "width": 1024}, "url": "https://www.pbs.org/newshour/arts/as-more-women-accuse-charlie-rose-some-say-they-alerted-cbs-managers"}, "article": {"publisher": "https://www.facebook.com/newshour/", "published_time": "2018-05-03T16:21:00-04:00", "section": "Arts", "tag": "#metoo, cbs news, charlie rose"}, "fb": {"app_id": 114150878604116, "pages": 6491828674}, "twitter": {"site": "@newshour", "card": "summary_large_image", "title": "As more women accuse Charlie Rose of sexual harassment, some say they alerted CBS managers", "description": "With 27 more women accusing former news anchor Charlie Rose of sexual misconduct, a report Thursday calls into question CBS News' claims that his behavior was a surprise before he was fired last November.", "image": "https://d3i6fh83elv35t.cloudfront.net/static/2017/11/rose-1024x683.jpg"}, "news_keywords": "charlie rose, metoo movement, #metoo, cbs news, arts", "msapplication-config": "https://www.pbs.org/newshour/app/themes/pbs-newshour/assets/img/favicon/browserconfig.xml", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1525378860.0, "source": "https://www.pbs.org", "summary": ""}