{"url": "https://www.thisisinsider.com/why-anna-faris-chris-pratt-broke-up-family-plans-advice-2017-8", "text": "The INSIDER Summary:\n\nAnna Faris and Chris Pratt announced their separation earlier this year and filed for divorce this week.\n\nPeople have been speculating as to why.\n\nA report claims that the pair split because of different views on the type of family they wanted.\n\nWhile we can't confirm the report, this is a hurdle most couples will face at some point.\n\nOur collective hearts broke when the news came out that Chris Pratt and Anna Faris were separating after eight years of marriage — and even further when they officially filed for divorce. Since fans felt like they knew the pair personally, people quickly scrambled to figure out the reason for the split.\n\nSoon after they announced their break up, people on social media began speculating that Pratt had been unfaithful to Faris with co-star Jennifer Lawrence, something that the two had denied fervently in the past.\n\nAfter that, TMZ interviewed a source that said the real reason for the split was far less dramatic: Faris simply wanted a more \"traditional\" family that was in the same place at the same time. Pratt, with his burgeoning movie career, was often away and it put a strain on the couple's marriage.\n\nNow, it goes without saying that this report should be taken with a grain of salt since it's based on an anonymous source and the real reason will only be confirmed if it comes from Faris and Pratt themselves. But it's not hard to believe that this could very well be the reason — or at least part of the reason — for their separation, as it's something nearly every couple goes through. And it's something everyone can learn a lesson from.\n\nHave an in-depth conversation and have it often.\n\nWhen a relationship hits a serious stage and couples get married or commit to each other in some big way, people are often too overcome with excitement or too overwhelmed by the prospect of spending forever with this person to have a deep discussion about where their priorities lie.\n\nMost couples will have your standard conversation: Do you want kids? How many? Where do you want to live? What are your career goals? But real commitment requires an even deeper dive with even deeper questions: How do you each feel about taking care of aging parents? What will you do if one of you is laid off? What will you do if either of your careers goes better or worse than expected?\n\n\"Making major life decisions or wants with your partner in the dark or assuming that they know what you want and what your goals all, removes the opportunity for discussion, compromise, and support,\" therapist Stacey Ojeda told INSIDER. \"We have to give our partners the opportunity to help us meet our goals and needs to have a healthy relationship.\"\n\nEven the most well-matched couples are going to have different views on important topics throughout their time together.\n\nCouples can help avoid confusion by having an open dialogue from the beginning of their relationship.\n\nMake sure, even within the first month of dating someone, that you casually learn more about them and what they find most important. That sets a precedent for a relationship that allows you both to open up about your hard and fast goals — both now and in the future.\n\nPeople's priorities change, even in a committed relationship. Pixabay/MadalinIonut\n\n\"Disclosure from the beginning can save people time and heartache,\" April Davis, a relationship expert and CEO of LUMA–Luxury Matchmaking, told INSIDER. \"When you are starting to get serious your partner share your hard-lined must-haves and have-nots. If you know that you wish to be a homeowner, parent, or living abroad in the next five years let them know.\"\n\nAccept that people change, but keep your partner in mind.\n\nPeople still grow and change while married or committed to someone. The result is, often, the person we commit to isn't always the person we're with 5, 10, or 20 years down the line.\n\nRecognizing that people can change and be having constant conversations about priorities is a habit that all couples can benefit from. It's important when making new and exciting decisions that you include your partner in that vision of your future.\n\n\"The biggest mistake is sharing without making their partner feel like their apart of the vision,\" counselor Shuntai Walker told INSIDER. \"It's important to include and not exclude your loved one. Even if it's just for moral support.\"\n\n\n\nSometimes change can't be avoided.\n\nThese types of conversations about priorities and the future are important, but that's not to say that Faris and Pratt broke up because they didn't have these conversations. Sometimes even couples who talk about this frequently can experience changes, like Pratt's sudden box office success or the tabloid rumors of infidelity that Faris openly said made her feel lonely and insecure.\n\nVery often, a change in perspective or priorities cannot be avoided and the marriage has to end. But keeping an open dialogue will help you identify when things aren't working out for you and your partner, and how to best shift focus to improve your relationship, movie stars or not.", "images": ["https://i.insider.com/5a255c2a3339b06c4e8b4577?width=1200&format=jpeg", "https://i.insider.com/5988788f18b69839008b4794?width=600&format=jpeg&auto=webp", "https://www.thisisinsider.com/why-anna-faris-chris-pratt-broke-up-family-plans-advice-2017-8?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5988788f18b69839008b4794?width=24&format=jpeg&auto=webp", "https://i.insider.com/5980e7cb232dfa2d008b487d?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5a255c2a3339b06c4e8b4577?width=1200&format=jpeg", "keywords": [], "authors": ["Kristin Salaky"], "canonical_link": "https://www.insider.com/why-anna-faris-chris-pratt-broke-up-family-plans-advice-2017-8", "title": "The alleged reason behind Chris Pratt and Anna Faris' devastating divorce can teach couples a big lesson", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "The alleged reason behind Chris Pratt and Anna Faris' devastating divorce can teach couples a big lesson", "date": "2017-12-04", "news_keywords": "Relationships, Dating, Marriage, Relationship advice, Love, Chris Pratt, Anna Faris, Divorce, Kristin Salaky", "description": "A report claims that the reason why the movie star couple split was differences in what they wanted from a family. And all couples can learn something from it.", "author": "Kristin Salaky", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Culture", "og": {"title": "The alleged reason behind Chris Pratt and Anna Faris' devastating divorce can teach couples a big lesson", "description": "A report claims that the reason why the movie star couple split was differences in what they wanted from a family. And all couples can learn something from it.", "type": "article", "url": "https://www.insider.com/why-anna-faris-chris-pratt-broke-up-family-plans-advice-2017-8", "image": "https://i.insider.com/5a255c2a3339b06c4e8b4577?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "The alleged reason behind Chris Pratt and Anna Faris' devastating divorce can teach couples a big lesson", "sailthru.date": "2017-12-04", "sailthru.tags": "Relationships, Dating, Marriage, Relationship advice, Love, Chris Pratt, Anna Faris, Divorce, Kristin Salaky", "sailthru.description": "A report claims that the reason why the movie star couple split was differences in what they wanted from a family. And all couples can learn something from it.", "sailthru.author": "Kristin Salaky", "sailthru.verticals": "culture, people, health", "sailthru.image.full": "https://i.insider.com/59a05a6b701afca6088b45c6?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/59a05a6b701afca6088b45c6?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "The alleged reason behind Chris Pratt and Anna Faris' devastating divorce can teach couples a big lesson": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 300, "back-to-top": "control", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "control", "subscribe-smallest-price": "control"}, "viking-id": "598b0e71b9cd6c58008b492f", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1512316800.0, "source": "https://www.thisisinsider.com", "summary": ""}