{"url": "https://web.archive.org/web/20171228192703/http://houstonchronicle-tv.com/breaking-trump-fires-deputy-attorney-general-rod-rosenstein-raising-questions-over-muellers-fate/", "text": "WASHINGTON — Rod Jay Rosenstein, Deputy Attorney General for the United States Department of Justice has been removed from his office.\n\nNearly everyone who knows him seems to agree that Rod Rosenstein, the Deputy Attorney General and the official overseeing the special counsel Robert Mueller’s investigation of links between the Trump campaign and Russia, has a reputation for integrity.\n\nRod who is described by Jim Trusty, the former head of the Justice Department’s organized-crime division as a prosecutor, not a persecutor, had sought earlier to protect his good image by not taking a hastened decision to fire anyone without justifiable reasons.\n\nBut Trump could not fire Mueller directly, according to the law that authorizes Mueller’s probe, so the only possible way is to throw the Justice Department into upheaval by firing Deputy Attorney General Rosenstein who only holds the key Mueller’s expulsion.\n\nOnly the person acting as attorney general, and Rod Rosenstein who was on matters related to the probe, could fire Mueller, and he said he won’t do it without “good cause.” So Trump would first had to purge the upper ranks of the Justice Department until he finds someone willing to follow his orders and dismiss the special counsel.\n\nConflicting reports claim Rosenstein had resigned but it’s understood that Donald Trump made the decision to remove him after a review from his chief of staff, John Kelly.\n\nUNDER the best of circumstances—when America has a president who is disciplined, willing to hear harsh but necessary truths and loyal to those he trusts—the post of Attorney General is “perhaps one of the most powerful job in Washington”, according to Loretta Lynch. Loretta Elizabeth Lynch, an American attorney who served as the 83rd Attorney General of the United States, appointed by President Barack Obama in 2015 to succeed Eric Holder. Loretta Lynch, a political giant who held that post for Barack Obama said, under ideal conditions, it is also the “toughest job in government.”\n\nRosenstein, the hapless establishment Republican ousted as Deputy Attorney General on Monday December 4, 2017 lasted a smidgeon over few days. After days of increasingly public concerns over the likelihood of Mueller’s dismissal by Trump and amidst Trump’s former national-security adviser, Michael Flynn, had pleaded guilty to making false statements to federal investigators about his conversations with former Russian Ambassador Sergey Kislyak during the presidential transition, Mr Rosenstein is being replaced by Neil Gorsuch, who was recently nominated by Trump for a lifetime job on the U.S. Supreme Court.\n\nThe reshuffle puts Mr Rosenstein out of his misery and confirms Mr Trump’s fondness for surrounding himself with tough-as-nails generals, who already fill several top jobs in his government. It ends the fear of Trump administration being damaged by Flynn’s plea to Mueller’s investigation team.\n\nThese are not anything like ideal circumstances for Mr Neil Gorsuch. New holder of the toughest job in government, the ex-clerk for Judge David B. Sentelle on the U.S. Court of Appeals for the D.C. Circuit from 1991 to 1992, and then for U.S. Supreme Court Justices Byron White and Anthony Kennedy, from 1993 to 1994. He currently was serving as an Associate Justice of the Supreme Court of the United States. How long Mr Neil Gorsuch lasts is anyone’s guess. If he only emerges with his dignity intact and adhere to the orders and principles of Trump’s administration, he will have done better than his predecessor.\n\nPresident Donald Trump’s interview with the New York Times on Wednesday stirred speculation he might consider firing Special Counsel Robert Mueller for investigating Trump’s business dealings as part of the Russia probe.\n\nBut Trump could not fire Mueller directly, according to the law that authorizes Mueller’s probe. Firing the Deputy Attorney General simply means setting off a chain-reaction that would throw the Justice Department into upheaval and consequently reaching his target to fire Robert Mueller under his dictatorship.\n\nHe’d certainly begun by dismissing Rosenstein, whose political loyalties Trump questioned in the Times interview on Wednesday in which he also warned Mueller against broadening his investigation. Such a scenario would parallel President Richard Nixon’s 1973 “Saturday Night Massacre,” when Nixon forced out the top two officials in the Justice Department in order to oust the Watergate special counsel.\n\n“I don’t think that’s politically survivable, and it’s not clear how much collateral damage he will do, putting himself into a position to have somebody fire Mueller,” said Senator Sheldon Whitehouse, a Democrat from Rhode Island.\n\nExpanding Investigation\n\nMueller’s investigation has expanded to examine a broad range of transactions involving the president’s businesses, including dealings by his son-in-law, Jared Kushner, and Commerce Secretary Wilbur Ross, a person familiar with the probe told Bloomberg News. Trump told the Times that if Mueller examined his family’s finances beyond any relationship with Russia he’d consider it “a violation.”\n\n“There is no possible way anybody at the White House could be seriously thinking about firing Mueller,” said Senate Bob Corker of Tennessee, a Republican. “I don’t even want to comment on that because that’s so far out of bounds it couldn’t possibly be a serious discussion.”\n\nUndercutting Mueller\n\nTrump has indicated he would try to undercut Mueller’s credibility. In the New York Times interview, Trump said Mueller has “many other conflicts that I haven’t said, but I will at some point.”\n\nSeparately, the Washington Post reported Thursday night that Trump’s legal team was exploring ways to question Mueller by building a case that he has conflicts of interest in overseeing the investigation. The Post also cited one unidentified person familiar with the effort as saying that Trump has asked his advisers about his authority to grant pardons to aides, family members or even himself.", "images": ["https://web.archive.org/web/20171228192703im_/https://i0.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/sd.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i0.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/sav.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i2.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/jk-1.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i2.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/KOB.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i2.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/GTU.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i2.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/jk-1.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i0.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/wr.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/BB.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/AMT.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i0.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/sd.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/3.jpg?resize=1000%2C600", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/BB.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/http://houstonchronicle-tv.com/wp-content/uploads/2017/03/Houson.png", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/45.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i2.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/GTU.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/http://houstonchronicle-tv.com/wp-content/uploads/2017/12/3.jpg", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/45.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i2.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/KOB.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/AMT.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i0.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/sav.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i0.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/wr.jpg?resize=80%2C80", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/ads.jpg?resize=300%2C180", "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/ads.jpg?resize=80%2C80"], "top_img": "https://web.archive.org/web/20171228192703im_/https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/3.jpg?resize=1000%2C600", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171228192703/http://houstonchronicle-tv.com/breaking-trump-fires-deputy-attorney-general-rod-rosenstein-raising-questions-over-muellers-fate/", "title": "BREAKING: Trump fires Deputy Attorney General Rod Rosenstein, raising questions over Mueller’s fate", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "og": {"image": "https://web.archive.org/web/20171228192703im_/http://houstonchronicle-tv.com/wp-content/uploads/2017/12/3.jpg", "type": "article", "description": "WASHINGTON -- Rod Jay Rosenstein, Deputy Attorney General for the United States Department of Justice has been removed from his office.\n\nNearly everyone who knows him seems to agree that Rod Rosenstein, the Deputy Attorney General and the official overseeing the special counsel Robert Mueller’s in", "url": "https://web.archive.org/web/20171228192703/http://houstonchronicle-tv.com/breaking-trump-fires-deputy-attorney-general-rod-rosenstein-raising-questions-over-muellers-fate/", "title": "BREAKING: Trump fires Deputy Attorney General Rod Rosenstein, raising questions over Mueller's fate", "site_name": "Houston News", "locale": "en_US", "updated_time": "2017-12-05T10:20:44+00:00"}, "twitter": {"image": "https://web.archive.org/web/20171228192703im_/http://houstonchronicle-tv.com/wp-content/uploads/2017/12/3.jpg", "card": "summary_large_image", "url": "https://web.archive.org/web/20171228192703im_/http://houstonchronicle-tv.com/breaking-trump-fires-deputy-attorney-general-rod-rosenstein-raising-questions-over-muellers-fate/", "title": "BREAKING: Trump fires Deputy Attorney General Rod Rosenstein, raising questions over Mueller's fate", "description": "WASHINGTON -- Rod Jay Rosenstein, Deputy Attorney General for the United States Department of Justice has been removed from his office.\n\nNearly everyone who knows him seems to agree that Rod Rosenstein, the Deputy Attorney General and the official overseeing the special counsel Robert Mueller’s in"}, "generator": "WordPress 4.9.1", "ca_title": "BREAKING: Trump fires Deputy Attorney General Rod Rosenstein, raising questions over Mueller's fate", "ca_image": "https://i1.wp.com/houstonchronicle-tv.com/wp-content/uploads/2017/12/3.jpg?resize=150%2C150", "article": {"published_time": "2016-01-01T23:17:43+00:00", "modified_time": "2017-12-05T10:20:44+00:00", "section": "General News"}}, "movies": [], "publish_date": 1451690263.0, "source": "https://web.archive.org", "summary": ""}