{"url": "https://www.bhphotovideo.com/explora/home-entertainment/tips-and-solutions/5-things-you-need-for-the-perfect-outdoor-movie-party", "text": "Don’t take the gazebo down just yet. Summer, or some version of it, is still in full swing—and thus, so is your ability to enjoy it. Every year around this time, my family and I prepare for an annual summer tradition of our own: our backyard movie party. Summer must end at some point, but before it does, we break out the A/V gear, fire up the grill, and send it out with a bang. This type of party always goes over well with my outdoorsy crowd. There’s something about a big screen, good company, and good food that makes you appreciate all the awesomeness this time of year has to offer. Thankfully, this level of greatness isn’t difficult to achieve, nor is it as expensive as you may think. Check out our list and let me help you live your best summer.\n\nBefore we jump into in, let’s get some prerequisites out of the way. For starters, lighting and weather conditions cannot be overlooked. Projectors and outdoor displays perform at their best in darkened environments. So, plan to start your party after sundown and in ideal weather conditions. If you have a covered porch or deck, first, I’m jealous, but you may be able to get the party started a little earlier; a dark environment will further enhance the movie experience. When it comes to the weather, the goal isn’t just to protect your guests from the elements, it’s also important to keep your gear safe. Lots of A/V equipment has air-circulation vents that shouldn’t be near water, so be sure to check for a clear forecast. Another worthwhile consideration is space—while you won’t need half an acre to throw a movie party, planning around the real estate you do have is important.\n\nProjector\n\nYour projector is the life of the party, but not necessarily something you should overthink. There are a lot of options out there, but for outdoor viewing, there are two features I always look for: lumens (brightness output) and resolution. Calculating the amount of brightness your space needs can be tough, but I’ve had great results with models in the 3000 – 4000 lumen range, so this what I typically recommend. Keep in mind that lighting conditions are still important. If your projector picks a fight with daylight, daylight will be victorious. When projecting images, resolution is also an important factor. As bad as you may want one, you probably won’t need a 4K projector for your outdoor party. Full HD 1080p typically gets the job done for most screens in the 100-inch range.\n\nThe model I use currently is the BenQ MH733. While it’s technically a multimedia projector, as opposed to Home Theater, its mix of resolution (Full HD) and lumens (4000) proved ideal for my needs—and when it’s movie time, the projector’s Cinema mode dials things in quite nicely. Additionally, it’s 1.15 to 1.5:1 throw ratio fills my 80\" screen from a little more than 8' away, which is great, considering I don’t have a ton of space. Whether we’re watching sports or movies, this BenQ DLP projector has been the anchor of my outdoor A/V system.\n\nBenQ MH733 4000-Lumen Full HD DLP Projector\n\nIt’s also worth noting that projectors aren’t the only show in town. There is also a wide range of outdoor televisions to choose from. When it comes to screen sizes, projector systems offer more bang for your buck and are typically more portable, but outdoor displays have advantages of their own, such as weather resistance and not having to worry about bulb maintenance.\n\nSunBriteTV Veranda Series 75\"-Class UHD Outdoor LED TV\n\nScreen\n\nOutdoor projector screens come in many shapes and sizes. When deciding between an inflatable option like the Sima XL-72 or a stand-mounted alternative like this 92\" model from Camp Chef, you should take a look at your viewing environment and determine what screen size and installation type you can reasonably accommodate. Is your backyard windy? If so, look for a screen with support anchors. Screen mounting can be a fun part of the outdoor movie experience—in fact I’ve seen some creative installation designs over the years that included screens hanging from trees and mounted on fences. While I typically recommend a safer approach, if you’re so inclined, don’t be afraid to think outside of the box. In some cases, you may not even need a screen if you can project onto a wall or another large surface, although picture quality will vary with this approach.\n\nCamp Chef Backyard Big Screen Lite 92\" Folding Projection Screen\n\nVideo Source\n\nPrioritize ease of use when choosing a video source to pair with your outdoor system. You’re having a party, so don’t spend your summer hours completing a lengthy setup process. Personally speaking, I love my universal Blu-ray player, but taking it outdoors is risky and impractical. If your Wi-Fi connection is good, try something powerful, compact, and wireless like the Roku Streaming Stick. In addition to giving you access to a vast streaming library, it connects directly to your projector or outdoor display’s HDMI input; and if your projector has a compatible-USB port like the previously mentioned BenQ MH733, that port can be used to supply power to your streaming device.\n\nRoku Streaming Stick\n\nWhen a conventional component like a cable/satellite box or optical-disc player is your best option, consider an HDMI transmitter and receiver like this Wireless HD Kit from IOGEAR, or a wired video splitter like this 4-Port Switch. Just keep in mind that wireless performance will vary based on distance and the construction of your home, and the wired switch will likely require you to run cables through windows or doors. The advantage here is that you can keep your video sources safely indoors.\n\nIOGEAR Wireless HD Digital Kit\n\nPowered Speaker System\n\nAs great as my projector is, it’s 10W isn’t sufficient for an outdoor party. In all fairness, this is typically the case for most projectors. Even when used indoors, better (and louder) sound can be achieved when connecting to an external powered speaker system. Speaker shopping is one of my favorite things to do, and when it comes to matching it with a projector, the connectivity is relatively straightforward. If your projector or display has a 3.5mm output, which is a common interface, make sure your powered-speaker has a 3.5mm input, like this 100W powerhouse from ION Audio. An outdoor-rated speaker that includes a microphone and light effects? This speaker screams, “Party!”\n\nION Audio Pathfinder Waterproof Rechargeable Speaker System\n\nThe size of the speaker you choose will also depend on the amount of space you need to cover. In my experience, it’s always better to go bigger because you can easily turn down the volume if needed; making a smaller speaker perform like a bigger one is a more difficult task. Remember, this is supposed to be easy.\n\nThe Little Things\n\nInsect Repellent: I’m convinced that the mosquitoes of 2018 are smarter and more resilient than their ancestors, and I’ve got the bites to prove it. Don’t miss the action because you’re swatting at bugs or scratching bite marks.\n\nGood Neighbors: If you don’t plan to invite them, be considerate if your party runs late into the night. I once threw a late-night boxing party, so I planned ahead and invited neighbors. Nothing unites a community quite like a free pay-per-view event.\n\nReliable Connections: If you have an Internet-connected streaming device like the one I mentioned above, or have long cable runs, make sure your connectivity is solid. Movies that buffer are twice as long and are regrettably distracting. Think about getting a Wi-Fi range extender if your wireless connection doesn’t extend outdoors, or a powered/active-HDMI cable if you’re running a high-resolution signal over a wired connection more than 50'. An outdoor-ready power hub and extension cord like these from 360 Electrical and Milspec may also come in handy.\n\nKanexPro High Resolution HDMI Cable\n\nLess Talk, More Party\n\nSocial media accounts this time of year are flooded with all things outdoors, and if your friends are anything like mine, they’re doing all sorts of cool things like flying drones at the beach and pretending to not get sea sick on boats. Don’t compete with that. Let them have the day; the fun doesn’t stop when the sun goes down.\n\nDo you throw a backyard movie party of your own or need advice getting started? Tell us all about it—comment below.", "images": ["https://static.bhphotovideo.com/explora/sites/default/files/3-1471471324000_img_671922.jpg", "https://static.bhphotovideo.com/explora/sites/default/files/styles/wedding_page_main_300x170/public/22217-ts.jpg?itok=oEYstS4z", "https://static.bhphotovideo.com/explora/sites/default/files/6-1487795805000_1320131.jpg", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/camp_chef_os92l_backyard_big_screen_lite_1471471588000_1267251.jpg?itok=i_-_gQ13", "https://static.bhphotovideo.com/explora/sites/default/files/styles/wedding_page_main_300x170/public/22218-ts.jpg?itok=NKLOzDAA", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/roku_3800r_streaming_stick_1508422202000_1365500_1.jpg?itok=XE4LXRxR", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/milspec_d16528025_25_14_3_sjtw_pro_1398265822000_1044496.jpg?itok=iakUZmth", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/ion_audio_pathfinder_100w_waterproof_rechargeable_1487795805000_1320131.jpg?itok=FAaNjh9e", "https://static.bhphotovideo.com/explora/sites/default/files/styles/wedding_page_main_300x170/public/21426-topshot5.jpg?itok=UYSibhXq", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/iogear_ghdsw4k4_4_port_4k_hdmi_switch_1426260055000_1129149.jpg?itok=D7-ySnIJ", "https://static.bhphotovideo.com/explora/sites/default/files/4-1508422202000_1365500.jpg", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/360_electrical_36000_pro_heavy_duty_5_1445961020000_1179070.jpg?itok=vWREQr18", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/1479164762000_1293578_0.jpg?itok=kptyux9_", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/1361228707000_770153.jpg?itok=pte66lB_", "https://static.bhphotovideo.com/explora/sites/default/files/2-1511886310000_1377906.jpg", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/1454018716000_1220080.jpg?itok=OQbc2G_K", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/benq_mh733_1080p_4000_lumen_projector_1510250814000_1368371.jpg?itok=7DowS2vg", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/sima_xl_72_6_inflatable_theater_screen_1467819604000_544072.jpg?itok=fzPDeBfW", "https://static.bhphotovideo.com/explora/sites/default/files/styles/wedding_page_main_300x170/public/21630-ts.jpg?itok=KkWsBJKH", "https://static.bhphotovideo.com/explora/sites/default/files/styles/items_mentioned/public/iogear_gw3dhdkit_wireless_3d_digital_kit_1324934669000_836300_0.jpg?itok=21S-hMzB", "https://static.bhphotovideo.com/explora/sites/default/files/styles/wedding_page_main_300x170/public/25976-ts.jpg?itok=uInKiyi_", "https://static.bhphotovideo.com/explora/sites/default/files/5-1324934669000_836300.jpg", "https://static.bhphotovideo.com/explora/sites/default/files/1-1510250814000_1368371.jpg", "https://static.bhphotovideo.com/explora/sites/default/files/styles/top_shot/public/23843-topshot1a.png?itok=dJ34DVFk", "https://static.bhphotovideo.com/explora/sites/default/files/23843-topshot1a.png", "https://static.bhphotovideo.com/explora/sites/default/files/7-1361228707000_770153.jpg"], "top_img": "https://static.bhphotovideo.com/explora/sites/default/files/23843-topshot1a.png", "keywords": [], "authors": ["Richard L Stevens"], "canonical_link": "https://www.bhphotovideo.com/explora/home-entertainment/tips-and-solutions/5-things-you-need-for-the-perfect-outdoor-movie-party", "title": "5 Things You Need for the Perfect Outdoor Movie Party", "meta_data": {"description": "Before we say goodbye to summer, kick back and throw the perfect outdoor movie party for your friends and family. Assembling an awe-worthy system isn't as challenging as you may think, and a little bit of planning pays off big-time.", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "B&H Explora", "type": "article", "url": "https://www.bhphotovideo.com/explora/home-entertainment/tips-and-solutions/5-things-you-need-for-the-perfect-outdoor-movie-party", "title": "5 Things You Need for the Perfect Outdoor Movie Party", "description": "Before we say goodbye to summer, kick back and throw the perfect outdoor movie party for your friends and family. Assembling an awe-worthy system isn't as challenging as you may think, and a little bit of planning pays off big-time.", "image": "https://static.bhphotovideo.com/explora/sites/default/files/23843-topshot1a.png"}, "viewport": "width=1025", "HandheldFriendly": "true"}, "movies": [], "publish_date": null, "source": "https://www.bhphotovideo.com", "summary": ""}