{"url": "https://pagesix.com/2018/08/25/angelina-jolie-is-no-longer-the-saint-she-set-out-to-be/", "text": "Angelina Jolie spent a good decade transforming her image from a wild child who wore vials of blood around her neck to a latter-day Mother Teresa, ministering to refugees and war-zone orphans. But St. Angie’s halo has well and truly slipped.\n\n“It doesn’t matter how much charity work you do,” said a source with knowledge of the Jolie-Pitt family. “If you drive a wedge between a father and his children, you’re an a–hole.”\n\nOver the past few weeks, Jolie, 43, and her lawyers have claimed that Pitt, 54, has failed to pay any “significant” support for their six children. (Pitt’s camp insists that the actor has paid out $9.3 million since the couple’s 2016 split.) Jolie has, as a Hollywood source close to the Jolie-Pitts told The Post, tried to paint her ex as a “deadbeat dad” and created a rift between the actor and his kids.\n\nIn court documents, Pitt’s lawyers called out Jolie and her lawyers for filing papers that are “calculated to increase the conflict” and are a “thinly veiled effort to manipulate media coverage.”\n\nJust this month, she was playing mind games. Around August 1, Pitt asked Jolie, through lawyers, to end the marriage as soon as possible, even before the high-profile couple has worked out a custody schedule and financial agreement.\n\nThrough her team, Jolie asked her ex to wait a week to consider his request — then filed her own motion, requesting the exact same thing.\n\n“Angelina filed with the judge to make it look like she wanted the early ­divorce before Brad [did],” said Los Angeles divorce attorney Peter Walzer, who has cases up against one of Jolie’s lawyers, Laura Wasser.\n\nSome say it’s an act of revenge by Jolie, who was, of course, the first to make the public strike in the split.\n\n“She doesn’t want Brad to move on,” said the family source.\n\n“She’s furious that he’s not chasing after her — and [that fury is] now ruining her image.”\n\nJolie’s latest round of fire also comes this month when she hired two new attorneys — Hollywood bigwig Joseph Mannis, who has represented celebrities Halle Berry and Dennis Hopper in contentious family cases — and San Francisco-based Samantha Bley DeJean.\n\nThey join Wasser, who, according to the family source, advised the star not to go nuclear on Pitt.\n\n“I think Angelina thought, ‘I don’t like where this is going, let’s get tough,’ ” Walzer said of the actress’ decision to bring in more hired guns. “Several things have happened that have caused [her] to say ‘I better . . . hire some lawyers in who are going to be aggressive.’ ”\n\nThe Hollywood source said Jolie was also provoked to wage war by two of her friends: Lady Arminka Helic, a Bosnian foreign-policy expert and a member of the UK House of Lords; and Chloe Dalton, who worked as former UK Foreign Secretary William Hague’s speechwriter.\n\nThe trio all met through Hague, who a close confidant of Jolie’s, and with whom she set up a sexual-violence-prevention initiative for women in Bangladesh.\n\n“They played a big role in all of this, telling Angelina, ‘You’re the greatest’ ” the Hollywood source said of the friends.\n\nPart of Jolie’s strategy to protect her own persona, insiders say, has been to publicly shame Pitt since they announced their divorce in September 2016.\n\n“She filed for divorce out of the blue, then people connected to her floated information to the media that [Pitt] had punched one of their kids on a flight in a drunken, high rage,” said the family source. According to TMZ, Jolie told a social worker that Pitt had struck their son Maddox, then 15, on a private jet.\n\nThe Los Angeles County Department of Children and Family Services investigated and cleared Pitt of the child-abuse allegations. In November 2016, Pitt was also cleared by the FBI of any wrong­doing.\n\nThe family source added, “Angelina kicked the s–t out of Brad at the beginning. Then she tried to make other threats and said he was going to be ­arrested. She really started a whispering campaign against Brad that was ­demonstrably false.”\n\nJolie was further left fuming, according to the Hollywood source, when her ex was given a standing ovation by the audience at the January 2017 Golden Globes after months out of the spotlight.\n\n“Angelina went crazy. That’s why she insisted on releasing a joint statement two days later,” added the Hollywood source. “She was trying to attach herself to him, so people wouldn’t view her ­unfavorably.”\n\nIn the joint statement, released on January 10, 2017, Jolie and Pitt said they were hiring a private judge and would handle their divorce in a private forum, while working to reunify their family.\n\nBut then, the family source said, “Angelina believed the only way to win was to go in for the kill.” Jolie’s team publicly leaked court documents, alongside a statement about a lack of child support, to NBC News earlier this month.\n\n“She went on the attack,” the family source said. “Essentially, Angelina’s calling Brad a deadbeat dad, when he pays for the kids’ security, hotels and private jets. All he wants is to see his kids.”\n\nInsiders also told The Post that Jolie has made that difficult.\n\n“In the past two years, Angelina has driven a wedge between [Pitt] and the kids, from controlling [their] phone calls to telling the kids they don’t need to see him and picking times he can see them when she knows he’s working,” said a source with intimate knowledge of the divorce.\n\nIn June, Judge John Ouderkirk (who also presided over the couple’s August 2015 civil wedding ceremony) told Jolie that if the children “remain closed down to their father,” she faced losing custody of them.\n\nThe actress was ordered to give Pitt the numbers for all the kids’ phones, as well as to refrain from monitoring any conversations between him and the children.\n\nCurrently, Pitt gets visitation with Maddox, 17, Pax, 14, Zahara, 13, Shiloh, 12 and twins Vivienne and Knox, 10, for four hours every other day and 12 hours over the weekend. There is one exception: The court is allowing Maddox to decide how much time he spends with his father.\n\nOn Wednesday, news leaked that Jolie and Pitt had come to terms on an interim custody agreement. However, a source close to Pitt said that the couple have the same interim agreement that has been in place for a while, with a more permanent custody deal still to be decided.\n\n“There was no new agreement. This was totally made up,” the source said. “The biggest joke is that she continues to be awful toward him.”\n\n“Angie has these wild mood swings,” the source added. “She [had] launched this aggressive tone, which backfired, saying she’s poor when she’s making $25 million a movie, and saying Brad’s not paid child support. This week, she came back all mellow and super nice — it’s a direct reaction to the fact that people did not react well to her [previous] blow.”\n\n(Jolie’s representatives did not respond to requests for comment.)\n\nAs for financial support, Pitt’s lawyers have reiterated that he loaned Jolie $8 million so she could buy a $19 million home — the estate of legendary filmmaker Cecil B. DeMille — and has paid out more than $1.3 million in child ­support.\n\nFor Pitt, said the Hollywood source, “It’s really the alienation from his kids that’s the worst.”\n\nWalzer said Jolie needs to be careful about her behavior ahead of a custody hearing, which will be followed by family visits with a court-appointed psychologist.\n\n“When somebody is in the throes of this kind of custody proceeding, they’re not always rational,” he explained. “If you look uncooperative, it could be worse for you. If you look like you’re the alienating parent, then you’re putting yourself at risk — do you really want to do that?”\n\nAnd then there’s Jolie’s public reputation.\n\nThis is certainly not the first time Jolie has puppeteered her image and the lives of those around her.\n\nShe became truly famous, after years of under-the-radar movie roles, when she stole the show in the 1999 movie “Girl, Interrupted.” At that point, Jolie was Hollywood’s ultimate bad girl. She dressed in witchy black, was using drugs (as she would admit to years later) — including ­going to Disneyland while on acid — and shocked the world when she shared an uncomfortably intimate kiss with her brother James at the 2000 Oscars, where she won Best Supporting Actress.\n\nThat year, she married Billy Bob Thornton — who allegedly dumped fiancée Laura Dern to be with her — and took her reputation into overdrive when the two hit the red carpet wearing vials of each other’s blood.\n\nBut by 2003, the couple had split and she was ready to reinvent. She became a mom on her own to a son, Maddox, adopted from Cambodia. Hooking up with Pitt in 2004 on the set of “Mr. and Mrs. Smith,” she was seen as the vixen who stole the man of America’s sweetheart, Jennifer Aniston.\n\nThere was nowhere to go but up. So the transformation to St. Angie kicked into high gear as she adopted more children and pursued an interest in human rights.\n\n“Angelina did one of the greatest jobs ever in developing a new persona ,” said the Hollywood source.\n\nOne step at a time, Jolie showed her softer side. The couple was seen taking their multiracial brood of six around the world. Jolie became a special envoy to the United Nations. And she publicly, and poignantly, spoke of her mother’s death from ovarian cancer and her own decision to have a double mastectomy and surgery to remove her ovaries and fallopian tubes after discovering she tested positive for the BRCA1 gene.\n\n“Angie was controlling her own narrative,” said the Hollywood source. “She was a role model — there was a relatability about her and her health issues. She did a great job to combine all of these things.”\n\nBut, it seems, Jolie may have finally lost control.\n\n“Ultimately, she almost got too comfortable [acting as a role model],” added the Hollywood source. “She wasn’t able to adapt to some of the realities of her marriage and her life.\n\n“She just assumed that people would follow whatever she said, including her husband, and so when they had marital issues, she . . . believed she could just bully him into whatever she wanted.”\n\nAfter her marriage to Pitt came apart, ­Jolie employed a master stroke of public relations — breaking her silence on the split while in Cambodia promoting a movie she had directed, “First They Killed My ­Father.”\n\nLooking upset, she told the BBC in February this year it had been a “very difficult time . . . We are a family and we will always be a family, and we will get through this time and hopefully be a stronger family for it. I am coping with finding a way through to make sure that this somehow makes us stronger and closer.”\n\nHowever, the Jolie insider said, the actress was beset by old demons. “You can try to change as much as you want, but you’re always going to go back to who you truly are. She can’t help herself.”\n\nAccording to Page Six, Jolie is also fuming that she has been usurped as the world’s most glamorous humanitarian by Amal Clooney, the stylish human-rights lawyer who is married to George Clooney.\n\n“Angelina hates all the attention that Amal is getting,” said a Jolie insider. The brunette reportedly feels Amal has pulled a “single white female” and stolen her identity. The insider added: “Angie can’t understand why she herself has become so ­unpopular in Hollywood.”\n\nFor his part, Pitt has given only one interview since the split, to GQ in May 2017, in which he detailed how he had given up the alcohol and marijuana that he had used as “a crutch.”\n\nHe spoke of his fears for his children and said: “It is a drag to have certain things drug out in public and misconstrued. I worry about it more for my kids, being subjected to it and their friends getting ideas from it.”\n\nThis, said the Hollywood source, is why he just wants to finalize things as quietly and peacefully as possible. “He’s not having the best time, but he’s hanging in there. He’s hopeful this will all be resolved.”\n\nBut Hollywood’s former golden couple is now reduced to barely speaking to each other, added the Hollywood source. “They talk some, but [not] very much. Once you go down this road, and s–t gets flung about, then it’s very difficult.”", "images": ["https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png", "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=1200", "https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg", "https://nyppagesix.files.wordpress.com/2019/09/stitcher-button402x-1.png?w=165&h=49", "https://nyppagesix.files.wordpress.com/2019/09/spotify-podcast-badge-wht-grn-330x80402x.png?w=205&h=50", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://nyppagesix.files.wordpress.com/2019/09/google_podcasts_badge402x-1-1.png?w=190&h=48", "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=618&h=410&crop=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/apple-podcast-badge402x.png?w=190&h=46"], "top_img": "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["August"], "canonical_link": "https://pagesix.com/2018/08/25/angelina-jolie-is-no-longer-the-saint-she-set-out-to-be/", "title": "Angelina Jolie is no longer the saint she set out to be", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "“It doesn’t matter how much charity work you do...If you drive a wedge between a father and his children, you’re an a--hole.”", "generator": "WordPress.com", "og": {"type": "article", "title": "Angelina Jolie is no longer the saint she set out to be", "url": "https://pagesix.com/2018/08/25/angelina-jolie-is-no-longer-the-saint-she-set-out-to-be/", "description": "“It doesn’t matter how much charity work you do…If you drive a wedge between a father and his children, you’re an a–hole.”", "site_name": "Page Six", "image": {"identifier": "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=1200", "secure_url": "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2018-08-25T15:54:04+00:00", "modified_time": "2018-08-25T15:54:04+00:00", "publisher": "https://www.facebook.com/pagesix", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@pagesix", "site": "@pagesix", "text": {"title": "Angelina Jolie is no longer the saint she set out to be"}, "image": {"identifier": "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=664&h=441&crop=1", "alt": "Angelina Jolie", "src": "https://nyppagesix.files.wordpress.com/2018/08/angelina-jolie-feature.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Angelina Jolie is no longer the saint she set out to be", "description": "“It doesn’t matter how much charity work you do...If you drive a wedge between a father and his children, you’re an a--hole.”"}, "fb": {"pages": 261611377580503}, "parsely-metadata": "{\"post_id\":\"pagesix-4563352\"}", "keywords": "angelina jolie,brad pitt,child custody", "google-site-verification": "kUaM_iOUItG-sfAnU_xqPqFG_0hl71TEfuta-jVPcSw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "Page Six", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for celebrity news, gossip, entertainment, pop culture, photos, video and more.", "msapplication-task": "name=Subscribe;action-uri=https://pagesix.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/cf931623da1839c0650e550eb1cb4819?s=16"}, "movies": [], "publish_date": 1535126400.0, "source": "https://pagesix.com", "summary": ""}