{"url": "https://ew.com/books/2018/10/01/nick-offerman-megan-mullally-book-interview/", "text": "Image zoom Emily Shur\n\nComedic power couple Megan Mullally and Nick Offerman get very chatty about their relationship in their new book, The Greatest Love Story Ever Told.\n\nMullally, 59, and Offerman, 48, have a romance like no other, and in the book which proves this once and for all, the couple (best known for their turns on Will & Grace and Parks and Recreation, respectively) give readers an intimate — and hilarious — window into their dynamic. Along with gorgeous original photographs and illustrations, as well as a few individual essays, the book is comprised of transcripts between the two of them, as they detail how they met, what their day-to-day lives look like, and much more.\n\nFrom their home in the Hollywood Hills, Mullally and Offerman talked with EW about their process creating the book as well as their love for one another. It’s a winding conversation that doesn’t take too long to head into some strange territory.\n\nMullally and Offerman had just received their first final, hardcover copies of the book as our interview began. Naturally, it’s where we started. Read our full conversation below, and pre-order The Greatest Love Story Ever Toldahead of its Tuesday publication.\n\nENTERTAINMENT WEEKLY: What was that moment like, when you got the final copies?\n\nMEGAN MULLALLY: They looked beautiful. The book was so beautiful. The paper — if I was reading this book and turning each page, I think it’d be pleasurable. The paper is really fancy and nice.\n\nNICK OFFERMAN: It’s really fun when you envision a book and write it, and in this case, we shot these amazing photos that Megan designed. When you actually see them in action — this physical artifact — there’s something magical about that.\n\nMULLALLY: The photos look so good. There’s some drawings by Meryl Rowin who also did all of the hand-lettering, including the cover. It looks so good. It’s really exciting. There’s a little more bells and whistles in this book than if we had not embellished it at all. If we had written a novel, for example.\n\nFor sure. So let’s get into this: How did you decide to write a book together?\n\nMULLALLY: At first, Nick didn’t want to do a book! [Laughs] That’d be the main thing.\n\nOFFERMAN: I’m still having second thoughts.\n\nMULLALLY: He’s still having second thoughts, he says! He’d written three books that were very successful, and at a certain point, I said, “Based on our social media, for some reason it seems like people like us together as a couple. Every time one of us posts a photo of the two of us, people like it.” I said, “Hey, maybe we should write a book together,” and he goes, “Well, what would it be?” I said, “I don’t know, just like a funny book about our relationship.” He said, “Eh, I don’t really get what it would be.” It went on for two years, and then finally, we were on the phone with his book editor, now my editor also, and I said, “Hey, what if Nick and I wrote a book together?” She said, “Oh my God, that would be amazing.”\n\nI said, “What if it was just chapters and certain topics and we talked about stuff?” Originally, we were just tape recording it to send to her to transcribe, and then we were going to polish that up and put it into prose form. But when our editor got the recording, she said, “This is really good just like it is.” I said, “Why don’t we just leave it like that as a he-said she-said?” It really shows: This is just us talking to each other. We didn’t go back in and change it or rewrite it. Those are our actual conversations. If you want to get as close as possible to knowing what our dynamic is like together as a couple, there it is.\n\nHow did you record it? The flow is very natural, in that the conversations turn incredibly weird.\n\nMULLALLY: The concept of the book was that we would have nine chapters on various topics. We just turned on the recorder on Nick’s phone and laid in bed. Nick wouldn’t even know in advance what the topic was going to be. I would say, “Well, the topic is such-and-such,” and then we would start talking. It was all very in-the-moment, spontaneous, kind of Interview magazine-style.\n\nImage zoom Dutton\n\nIf you could describe the feeling of the recording process, how would you?\n\nOFFERMAN: For me, it would be “comfortable.” It’s strange having a pleasant and successful domestic relationship. We’re lucky enough to continue enjoying each other. It’s that simple. We’re just a couple people who like doing puzzles together. When we do things — whether it’s onstage or onscreen or record a book together in a bed — it’s pleasant and comfortable. We feel very lucky that we’re able to do that, and that it can be a source of inspiration for people.\n\nMULLALLY: I would say “pleasantly focused.” It’s really interesting: When we would start recording, start a new chapter, I’d just close my eyes for the whole time so I didn’t have any distractions, and [could] really focus on what Nick was saying. That helped me to really listen to him, rather than planning what I was going to say next in advance of him finishing what he was saying. I just wanted to be really in the moment. We did that, and also, I felt like I learned some things about Nick that I didn’t really know. We heard things about each other for the first time while we were recording the book.\n\nWhat was the thing you learned that surprised you the most?\n\nMULLALLY: Things about his family. I know his family is great, very down-home and kind and cool, but it’s hard for me to imagine that’s that tame. Hearing him say that one time his dad got mad about something and went out the front door — which he never did; he usually went out the back door — and his mom started crying, and that was this huge thing. That blew my mind: That would have been what we did before breakfast at my house.\n\nAny topic, Nick, you were particularly surprised by?\n\nOFFERMAN: Sex. One unique thing about our marriage is that we haven’t actually had sex. I feel a little shy and insecure about talking about that in public.\n\nMULLALLY: Just don’t rush me.\n\nOFFERMAN: I don’t feel like I am. We got through it. We eked out a chapter.\n\nMULLALLY: We set a proposed date of 2024. I think that’s fair. To have sex.\n\nOFFERMAN: Yep, six years. God.\n\nMegan, you do actually say in the book, “Nick didn’t have the trillions of sperm one might’ve hoped for.”\n\nMULLALLY: [Laughs loudly] It was just a conversation we were having. It just came out. I mean, it’s the truth.\n\nOFFERMAN: I think that’s what’s commonly referred to as a fun fact.\n\nBack on track! Between the photographs and the illustrations, it’s a very visual book.\n\nMULLALLY: I designed the book. Thinking about what the book should look like, I thought that we should have a photograph that would give you a loose idea of what each chapter was going to be. The titles of the chapters leave something to the imagination. I read through the chapters a few times and just tried to think which image would be best for each subject and which ones would be the funniest and the most interesting for Nick and I, specifically, to pull off. We shot all 11 setups — the nine interior photos and then the front and back photos — all in one day, which is an accomplishment. It was a pretty good day.\n\nOFFERMAN: I know it sounds like Megan did a lot of the work here, but I’d like to add that I agreed to all of this. I also showed up where and when I was told and put on the clothing that was in front of me.\n\nMULLALLY: I want to add that when we were at the photo shoot, Nick would pick up a ballet tunic and be like, “What’s this for?” He didn’t even know we were going to do a ballet shot. He was like, “Oh, okay.” He was very in the moment. [Laughs]\n\nOFFERMAN: It was a collaboration.\n\nThe tone weaves, and at times you both venture into more complicated, painful territory. Was there a particularly challenging topic to dredge up?\n\nMULLALLY: It was hard for me to talk about my father. I’d never really talked about my father, and so that was the hardest thing for me. Nick doesn’t have anything that’s hard to talk about, because he’s like a little twinkling bunny.\n\nIs that true, Nick?\n\nOFFERMAN: Yeah, I get described as a bunny in many ways. Twinkling. Adorable. But not well-sexed.\n\nMULLALLY: We’ve gotten him a couple of manuals. He’s studying up for 2024, but we’ll see if he’s there by then. We’ll have to give him a few quizzes and stuff beforehand, so we’ll see if he’s reading the literature he’s been provided.\n\nI think BuzzFeed has a few quizzes that are good for that.\n\nOFFERMAN: I’m all over it.\n\nMULLALLY: BuzzFeed gives him a sunny.\n\nOFFERMAN: [Groans]\n\nWhat?\n\nMULLALLY: [Laughing] I said, just the word BuzzFeed gives him a chub.\n\nOFFERMAN: Can you guys please stop saying that word? It seriously hurts.\n\nIf Megan can agree to that, I’m good with that.\n\nOFFERMAN: All right.\n\nMULLALLY: BuzzFeed.\n\nOFFERMAN: The chafing.\n\nBack on track! So Nick, you didn’t initially want to write a book with Megan. Tell me why from your perspective.\n\nOFFERMAN: I can’t keep this up, David. This is George Clooney. Nick is shooting in Vancouver, and I like to come over. They have a really nice shuffleboard court here in the hills.\n\nBut seriously, the books I’ve done previously have been really enjoyable, but a hustle, and a lot of hard work. There were specific things that I wanted to address in book form. I love doing anything creative with Megan — especially because she does all the work, so it’s a really fun collaboration for me. For me to sign onto something, someone has to say, “Here it is, here’s what it is, will you play?” Without that — when it’s just pitched like, “We should write a book together” — I’m usually not looking to add anything to my calendar.\n\nIn all honesty, there was a sexual negotiation involved. I was able to take four years off of Megan’s deadline. When we got married, it was 2032, and so we’re down to 2024. I’ll do another goddamn book. I’ll write a trilogy. I’ll write it in Braille. I don’t give a shit.\n\nYou’ll have to write it fast.\n\nMULLALLY: [Laughing loudly]\n\nOFFERMAN: I’m doing everything I can here, buddy.\n\nDo either of you have a favorite chapter?\n\nOFFERMAN: When you ask that question, what springs to mind is, every time I’ve read through the book, Megan makes me laugh so hard with her candor. When she answers me in a hilarious and curt way, it makes me laugh out loud every time. That’s my favorite thing about the book. Rather than pick a favorite chapter, I’ll pick a favorite characteristic. I think it really captures the dynamic of us together — whether we’re talking about something serious and emotional or something more lightweight. We weigh in with all of our faculties, but we also like to make each other laugh.\n\nMULLALLY: I have a favorite photograph: The big ballet lift. We took maybe seven photos because Nick had to hold me like that and it wasn’t very comfortable. We got a great big mirror into the photo studio, and then that way, Nick could look in the mirror and we could be sure that our lines were the same and the position was just right before we shot it. That was helpful.\n\nOFFERMAN: Hearing Megan say that, it did occur to me that I do have a favorite chapter, which is the acknowledgments. It’s succinct and really gets to the point.\n\nYou may be the first author to say that.\n\nOFFERMAN: I’ve been accused of thinking outside the box, and Megan, as a legal requirement, has me thinking outside the box for another six years. That’s the state of affairs over here.\n\nLast question: Is there a sequel to The Greatest Love Story Ever Told?\n\nOFFERMAN: We do have an idea. Honey, I’ll let you tell him about it.\n\nMULLALLY: I don’t know what the joke is. But we have talked about the fact that we could do other books because it’s just us talking about stuff together and since things are always changing, there will always be material for us to delve into. So yeah, I think it’d be fun to do another book, or more. Nick’s going to prison, so we’ll probably have to do a lot of it via the U.S. mail. It’ll be like love letters. But his letters will just be coming from prison.\n\nSounds romantic.\n\nOFFERMAN: The proposed title for book two is Patience.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fcho_8-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1753&h=918&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fcho_8-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20114'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2F9781101986677-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1753&h=918&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fcho_8-2000.jpg", "keywords": [], "authors": ["David Canfield"], "canonical_link": "https://ew.com/books/2018/10/01/nick-offerman-megan-mullally-book-interview/", "title": "EW's long, intimate, increasingly strange interview with Megan Mullally and Nick Offerman", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Megan Mullally,Nick Offerman", "news_keywords": "Megan Mullally,Nick Offerman", "description": "The pair chatted with EW about their hilarious new book. Nothing was off limits.", "og": {"title": "EW's long, intimate, increasingly strange interview with Megan Mullally and Nick Offerman", "type": "article", "site_name": "EW.com", "url": "https://ew.com/books/2018/10/01/nick-offerman-megan-mullally-book-interview/", "description": "Comedic power couple Megan Mullally and Nick Offerman get very chatty about their relationship in their new book,&nbsp;The Greatest Love Story Ever Told. Mullally, 59,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1753&h=918&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fcho_8-2000.jpg", "width": 1753, "height": 918}}, "pinterest": {"url": "https://ew.com/books/2018/10/01/nick-offerman-megan-mullally-book-interview/", "description": "The pair chatted with EW about their hilarious new book. Nothing was off limits.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fcho_8-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/books/2018/10/01/nick-offerman-megan-mullally-book-interview/", "title": "EW's long, intimate, increasingly strange interview with Megan Mullally and Nick Offerman", "description": "The pair chatted with EW about their hilarious new book. Nothing was off limits.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1753&h=918&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fcho_8-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1538323200.0, "source": "https://ew.com", "summary": ""}