{"url": "https://www.bostonglobe.com/arts/2017/12/19/here-what-matt-damon-said-about-metoo-and-backlash-that-followed/PNOjcVddMV9rQ13eqsDm4I/story.html", "text": "Damon first faced criticism in response to an ABC News interview that aired last Tuesday. Damon spoke with film critic Peter Travers about several men who are facing sexual assault and harassment allegations, including film executive Harvey Weinstein, US Senator Al Franken, and comedian Louis C.K.\n\nOver the past week, Cambridge-born-and-bred actor Matt Damon has found himself at the center of the #MeToo sexual harassment controversy after giving two interviews on the subject. Here’s a look at what he said, and what the response has been.\n\nIn an interview on “Popcorn with Peter Travers,” Damon said that we are living in a “culture of outrage” and that these recent allegations of sexual misconduct need to be analyzed on a spectrum.\n\nAdvertisement\n\n“There’s a difference between patting someone on the butt and rape or child molestation,” Damon said. “Both of those behaviors need to be confronted and eradicated without question, but they shouldn’t be conflated.”\n\nDamon said it’s been a “watershed moment” that women have felt empowered to share their stories and hold men accountable for sexual misconduct. He also said people should try to be optimistic about the state of the movie business and of men overall.\n\n“This [is] like 1 percent of the guys who are losing their careers,” Damon said. “It’s not everybody. It just feels like it.”\n\nDec. 15: The response\n\nDamon’s interview was met with criticism, including from actresses Alyssa Milano and Minnie Driver.\n\nDriver, Damon’s ex-girlfriend and “Good Will Hunting” co-star, responded to Damon’s comments in a series of tweets on Friday afternoon.\n\nGosh it’s so *interesting how men with all these opinions about women’s differentiation between sexual misconduct, assault and rape reveal themselves to be utterly tone deaf and as a result, systemically part of the problem( *profoundly unsurprising) — Minnie Driver (@driverminnie) December 15, 2017\n\nMilano, who worked with Damon in “Glory Daze” in 1995, responded to Damon’s comments in a Twitter thread last Friday night that began, “Dear Matt Damon, it’s the micro that makes the macro.”\n\nDear Matt Damon,\n\n\n\nIt’s the micro that makes the macro.\n\n\n\n(Thread) — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nWe are in a “culture of outrage” because the magnitude of rage is, in fact, overtly outrageous. And it is righteous. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nI have been a victim of each component of the sexual assault spectrum of which you speak. They all hurt. And they are all connected to a patriarchy intertwined with normalized, accepted--even welcomed-- misogyny. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nMilano went on to compare Damon’s spectrum philosophy to the spectrum of cancer.\n\nAdvertisement\n\nWe are not outraged because someone grabbed our asses in a picture. We are outraged because we were made to feel this was normal. We are outraged because we have been gaslighted. We are outraged because we were silenced for so long. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nThere are different stages of cancer. Some more treatable than others. But it’s still cancer. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nSexual harassment, misconduct, assault and violence is a systemic disease. The tumor is being cut out right now with no anesthesia. Please send flowers. #MeToo — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nDec. 17: Minnie Driver continues her criticism\n\nIn an interview with The Guardian published Sunday, Driver expanded on her reaction.\n\n“I felt I desperately needed to say something,” Driver told the publication. “I’ve realised that most men, good men, the men that I love, there is a cut-off in their ability to understand. They simply cannot understand what abuse is like on a daily level.”\n\n“I honestly think that until we get on the same page, you can’t tell a woman about their abuse,” Driver continued. “A man cannot do that. No one can. It is so individual and so personal, it’s galling when a powerful man steps up and starts dictating the terms, whether he intends it or not.”\n\nI don’t just speak for myself in this article, I speak for too many friends and co-workers as well. - Minnie Driver: men like Matt Damon 'simply cannot understand what abuse is like' https://t.co/Z9M120C6XZ — Minnie Driver (@driverminnie) December 17, 2017\n\n“How about: it’s all f****** wrong and it’s all bad, and until you start seeing it under one umbrella it’s not your job to compartmentalise or judge what is worse and what is not,” Driver continued. “Let women do the speaking up right now. The time right now is for men just to listen and not have an opinion about it for once.”\n\nDec. 18: Damon speaks with Business Insider\n\nDamon continued defending men in the entertainment industry in a Monday interview with Business Insider. He said more attention should be focused on the men who don’t commit acts of sexual misconduct.\n\n“We’re in this watershed moment, and it’s great, but I think one thing that’s not being talked about is there are a whole s---load of guys — the preponderance of men I’ve worked with — who don’t do this kind of thing and whose lives aren’t going to be affected,” Damon said.\n\nAdvertisement\n\nDec. 19: The response\n\nDamon was called out on Twitter yet again by various Hollywood figures, including actresses Rose McGowan and Debra Messing.\n\nMatt Damon is dense AF https://t.co/B9OKeh1WpG — rose mcgowan (@rosemcgowan) December 18, 2017\n\nMatt Damon- SERIOUSLY? You are a smart man. A privileged, white man. This is NOT the time to ask for a pat on the back. How about we NOT celebrate men who are simply decent human beings. Stay on track, Matt. It’s not about you. https://t.co/mmdbqAUyP7 — Debra Messing (@DebraMessing) December 18, 2017\n\nMatt Damon figuring it out on a “case by case basis.” pic.twitter.com/SbaBpeAizP — Ted Leo (@tedleo) December 19, 2017\n\nWhen it comes to Matt Damon, I am constantly hunting for goodwill — Aparna Nancherla (@aparnapkin) December 19, 2017\n\nSophia Eppolito can be reached at sophia.eppolito@globe.com. Follow her on Twitter @SophiaEppolito.", "images": ["https://www.facebook.com/ tr?id=884869448226452&ev=PageView&noscript=1", "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/TduvVJ_D3OkZFLI8nuK2wYuWsdg=/20x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/4VWDWBHBYYI6PIBPSK5ECMOEGQ.jpg", "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/drKPXuHXbShS15tZu-kCbwku2lc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/4VWDWBHBYYI6PIBPSK5ECMOEGQ.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035042&cv=2.0&cj=1"], "top_img": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/drKPXuHXbShS15tZu-kCbwku2lc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/4VWDWBHBYYI6PIBPSK5ECMOEGQ.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bostonglobe.com/arts/2017/12/19/here-what-matt-damon-said-about-metoo-and-backlash-that-followed/PNOjcVddMV9rQ13eqsDm4I/story.html", "title": "Here’s what Matt Damon said about #MeToo, and the backlash that followed", "meta_data": {"description": "Matt Damon first faced criticism in response to an ABC News interview that aired last Tuesday.", "arc": {"uuid": "3TF62PHEZAI6PPV3B2OGD4N6EA"}, "robots": "noarchive", "viewport": "width=device-width, initial-scale=1", "msapplication-config": "/pf/resources/images/icons/browserconfig.xml?d=157", "theme-color": "#ffffff", "fb": {"admins": 507486035, "app_id": 103933749691726, "pages": 5637143257}, "og": {"site_name": "BostonGlobe.com", "type": "article", "title": "Here’s what Matt Damon said about #MeToo, and the backlash that followed - The Boston Globe", "url": "https://www.bostonglobe.com/arts/2017/12/19/here-what-matt-damon-said-about-metoo-and-backlash-that-followed/PNOjcVddMV9rQ13eqsDm4I/story.html", "description": "Matt Damon first faced criticism in response to an ABC News interview that aired last Tuesday.", "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/drKPXuHXbShS15tZu-kCbwku2lc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/4VWDWBHBYYI6PIBPSK5ECMOEGQ.jpg", "pixelID": 884869448226452}, "article": {"opinion": "false", "publisher": "https://www.facebook.com/globe", "content_tier": "free"}, "twitter": {"account_id": 95431448, "card": "summary_large_image", "site": "@BostonGlobe", "title": "Here’s what Matt Damon said about #MeToo, and the backlash that followed - The Boston Globe", "description": "Matt Damon first faced criticism in response to an ABC News interview that aired last Tuesday.", "url": "https://www.bostonglobe.com/arts/2017/12/19/here-what-matt-damon-said-about-metoo-and-backlash-that-followed/PNOjcVddMV9rQ13eqsDm4I/story.html", "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/drKPXuHXbShS15tZu-kCbwku2lc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/4VWDWBHBYYI6PIBPSK5ECMOEGQ.jpg"}, "section": "Arts"}, "movies": [], "publish_date": 1513612800.0, "source": "https://www.bostonglobe.com", "summary": ""}