{"url": "www.wbur.org/cognoscenti/2018/04/30/kate-middleton-postpartum-cloe-axelson", "text": "My pregnancies, apart from the unplanned C-sections, were normal and uneventful. And I went through all the things the vast majority of postpartum women experience (Kate too, probably): vaginal bleeding, uterine cramps, engorged breasts, raging hormones, soreness, exhaustion, constipation and the general condition of feeling as if you’ve been run over by a truck.\n\nI have three kids: twins the first time (one born vaginally, the second, four hours later, by Cesarean section) and a singleton (also by Cesarean section) after 16 hours of labor and two hours of unsuccessful pushing.\n\nThe internet exploded. Some women pronounced the Duchess superhuman. Others offered blunt comparisons to their own postpartum conditions. Mercifully, most seemed to realize Kate’s seemingly supernatural ability to bounce back is not normal . But by focusing so much on her flawless appearance, we are distracted from the real trauma, physical and emotional, that is the childbirth experience.\n\nSeven hours after giving birth to her third child in less than five years, Kate Middleton, the Duchess of Cambridge, stood before the media — in heels and a cherry red Jenny Packham dress -- cradling her darling new prince.\n\nBut we don’t like to talk about these things. And we definitely don’t like to talk about the longer term physical struggles many postpartum women endure: urinary and fecal incontinence, acute pelvic pain, back pain, muscle tears, hairline fractures, prolapsed bladder, pain during sex (if one can even summon the desire: low sex drive is another unpleasant side effect) and the “mummy tummy” (medically known as diastasis recti), what happens when a woman’s abdomen stretches and separates to accommodate a growing fetus, but fails to knit itself back together. Many of these symptoms don’t appear immediately, and because these topics are not often talked about, women often assume symptoms are just the new normal.\n\nWomen’s health is the most popular of political footballs (to some people, it’s still a pre-existing condition to be a woman), and it’s also the most stigmatized. The female genitalia, in particular, is a gray area, a taboo even, something referred to as “down there” or “private parts” or, if you’re Oprah, “vajayjay.” The pelvic floor — the hammock of muscles that hold a woman’s bladder, bowel and uterus where they belong — isn’t visible, like a quad muscle, and it can be hard for women to pinpoint areas of discomfort. Most people don’t even know what a pelvis looks like, apart from a skeleton they’ve seen during Halloween.\n\nDonna Chiao, DPT, an orthopedic and pelvic health physical therapist, holds a model pelvis. (Courtesy of the author)\n\nBut a significant number of women, more than half by some counts, experience pelvic injury or dysfunction as a result of childbirth.\n\nThink about the women you know who joke about wetting their pants just a little bit when they laugh (one in three report urinary incontinence after childbirth), or resign themselves to pain during sex (that’s about one-third of all women too), or just assume a lumpy tummy — as my kids so lovingly called mine — is part of motherhood.\n\nNot enough women know they can resolve some, if not all, of these issues with physical therapy.\n\nAfter the birth of my third child, I was eager to get back to my regular running routine. When my OBGYN gave me the ‘all clear’ at my postpartum appointment, I vowed to start back slowly, running for a minute, then walking for a minute, to regain my strength and stamina.\n\nAfter a few jogs, I was hobbling around, worried that my insides might fall out and splatter against the pavement.\n\nI called my doctor, the very one who gave me the green light. She recommended a couple of places for women’s specific physical therapy, but the waitlist at Mt. Auburn Hospital, where I delivered, was 45 names long — so long they weren’t even willing to add my name to the queue. I was eventually able to get an appointment with an outstanding women’s health therapist at Marathon Sports in Newton, but I had to wait six weeks for my first appointment.\n\nMy experience isn’t uncommon. There are more women who need help than specialists who can provide care. (At Marathon, the average wait is four to six months.) Part of the scarcity of care has to do with the extensive clinical training pelvic floor specialists need to do internal pelvic exams. My PT, Donna Chiao, completed seven years of education beyond high school, not including all the continuing education courses she had to take after receiving her doctorate. She told me that anything regarding the pelvic floor is rarely taught as part of the standard physical therapy curriculum, even in doctoral degree programs.", "images": ["https://placehold.it/1x1/f8f8f8/f8f8f8", "https://d279m997dpfwgl.cloudfront.net/wp/2016/06/tile-bbc-news.jpg", "https://d279m997dpfwgl.cloudfront.net/wp/2013/05/Cloe-Axelson.jpg", "http://d279m997dpfwgl.cloudfront.net/wp/2018/04/AP_18113621489949-1000x699.jpg", "https://d279m997dpfwgl.cloudfront.net/wp/2018/04/AP_18113621489949-1000x699.jpg", "https://d279m997dpfwgl.cloudfront.net/wp/2016/06/icon-cognoscenti.png"], "top_img": "http://d279m997dpfwgl.cloudfront.net/wp/2018/04/AP_18113621489949-1000x699.jpg", "keywords": [], "authors": ["Cloe Axelson"], "canonical_link": "https://www.wbur.org/cognoscenti/2018/04/30/kate-middleton-postpartum-cloe-axelson", "title": "Sure, Kate Middleton Looks Great — But Let’s Talk About What Giving Birth Really Does To Women’s Bodies", "meta_data": {"viewport": "initial-scale=1, maximum-scale=1", "description": "By focusing so much on the Duchess's flawless appearance, writes Cloe Axelson, we are distracted from the real trauma that is childbirth.", "og": {"type": "website", "title": "Sure, Kate Middleton Looks Great — But Let’s Talk About What Giving Birth Really Does To Women’s Bodies", "description": "By focusing so much on the Duchess's flawless appearance, writes Cloe Axelson, we are distracted from the real trauma that is childbirth.", "url": "https://www.wbur.org/cognoscenti/2018/04/30/kate-middleton-postpartum-cloe-axelson", "image": {"identifier": "http://d279m997dpfwgl.cloudfront.net/wp/2018/04/AP_18113621489949-1000x699.jpg", "height": 699, "width": 1000}}, "fb": {"app_id": 134067973330252, "admins": 1549080028, "pages": 1734469353237891}, "twitter": {"card": "summary_large_image", "site": "@cogwbur", "creator": "@cogwbur", "title": "Sure, Kate Middleton Looks Great — But Let’s Talk About What Giving Birth Really Does To Women’s Bodies", "description": "By focusing so much on the Duchess's flawless appearance, writes Cloe Axelson, we are distracted from the real trauma that is childbirth.", "image": "http://d279m997dpfwgl.cloudfront.net/wp/2018/04/AP_18113621489949-1000x699.jpg"}, "apple-mobile-web-app-title": "WBUR.org"}, "movies": [], "publish_date": 1525017600.0, "source": "http://www.wbur.org", "summary": ""}