{"url": "www.elle.com/culture/celebrities/a12115489/selena-gomez-and-the-weeknd-relationship-timeline/", "text": "Selena Gomez and The Weeknd's (whose real name is Abel Tesfaye) breakup was reported today after nearly 10 months of dating. Theirs was a relationship of worldwide PDA, sweet Instagram stories about the other, and so much more. Here, a look back from start to finish.\n\nJanuary 2017: Selena Gomez and The Weeknd are photographed making out just two months after he broke up with Bella Hadid.\n\nThe two start following each other on Instagram, then go on vacation to Italy together (Florence and Venice specifically).\n\nThere, The Weeknd puts the first shot of Gomez in his Instagram story:\n\nInstagram\n\nAnd Gomez puts a video of The Weeknd on her 'gram, though she deletes it hours later. Fan accounts saved a receipt:\n\nThey're also shot showing a lot of PDA over dinner:\n\nMeanwhile, The Weeknd's ex, Bella Hadid, promptly unfollows Gomez on Instagram the day after the initial makeout photos of Gomez and The Weeknd come out. (The Weeknd and Gomez unfollow Hadid later in March.)\n\nFebruary 2017: At this point, the pair is more subtle about their relationship status. Gomez reportedly paid $30,000 for The Weeknd's Dave & Buster birthday party, although she was in New York City on the actual day for work. Gomez likes The Weeknd's birthday Instagram:\n\nOn her own Instagram, Gomez is caught wearing The Weeknd's clothes, a subtle nod they're together. Here, his jean jacket:\n\nAround Valentine's Day, the paparazzi photographs the two making out on a yacht in California. The Weeknd resumes his tour, and Gomez is spotted out at his concert in Amsterdam on the 24th. In March and April, Gomez continues to follow The Weeknd to his shows. She goes to over 10 different countries with him (Italy, the Netherlands, Germany, Switzerland, France, the U.S., Canada, Colombia, Brazil, and Argentina), and three continents.\n\nMarch 2017: Gomez and The Weeknd go on an aquarium date at Ripley's Aquarium in Toronto on a trip there together. The Weeknd posts a video of Gomez on his Insta story, then officially adds her to his grid.\n\nShe likes the post:\n\nInstagram\n\nMeanwhile, The Weeknd releases a song with Nav that seems to have a pointed message to Gomez's ex Justin Bieber, who had been publicly petty about Gomez and Tesfaye's relationship. Some of the verses seem to maybe be about Tesfaye stealing Gomez from Bieber, including:\n\nI think your girl, think your girl, fell in love with me\n\nShe say my f–k and my tongue game a remedy\n\nAnd:\n\nOh yeah, yeah, I just hit a lick and I know you feelin' some way\n\n(nah, nah nah nah, nah nah nah)\n\nI just took that chick, and I know you feelin' some way, oh yeah\n\nShe just want a n–a like me, you feelin' some way, way, way, yeah\n\nShe just want a n–a like me, I play no games\n\nApril 2017: The two are filmed making out at Coachella:\n\nAnd Gomez posts her Instagram official shot of the two. The Weeknd, of course, likes it:\n\nInstagram\n\nOn April 27th, an Access Hollywood reporter tactfully asks Gomez, who said earlier in the year she will never discuss her love life publicly, about The Weeknd. Gomez gives her first little interview on him.\n\nLiz Hernandez: I know you're taking over the Forum today. Are you gonna be here this weekend for The Weeknd?\n\nSelena Gomez: Ha, I might!\n\nHernandez: I hope to see you, girl. I'm going to be here.\n\nGomez: Well, good. You're gonna love it. You're gonna love it!\n\nMay 2017: Gomez and Tesfaye make their red carpet debut at the Met Gala. They are all PDA, inside and on the red carpet:\n\nE! reports on the red carpet itself, Gomez was overheard whispering \"I love you\" in The Weeknd's ear. They posed right before The Weeknd's ex Bella Hadid's mom, Yolanda, and brother, Anwar, arrived.\n\n\n\nGetty Images\n\nDuring a radio interview at the end of the month with Miami's Power 96.5 FM, Gomez talks about how she goes all in with boyfriends (and in this case, Tesfaye). \"I'm the kind of girl that loves tremendously big,\" she said. \"I just have always been that girl. I will give my heart and my soul to the person that I love. It's just how I operate. With that comes a lot, ya know? Clearly you understand.\"\n\nJune 2017: Gomez says during a radio interview that The Weeknd won't be influencing any of her music. \"No, I think for me I like to keep that really separate,\" Gomez tells host Zach Sang. \"I feel like for so long, I think you know, being a young woman, I've been single I mean for like, four years? I think it's so important and I spent so much time making sure that everything that I do, I do for myself. So as much as that has been inspiring because I love to be inspired by people that I do love and care about, but I'm a big advocate on making sure that I'm doing it for me. Because the moment I start doing something because I'm influenced by someone else, whoever it may be, it just doesn't work out so believe it or not, I keep that very, very separate, which is good.\"\n\nOn June 6th, Gomez and Tesfaye have a well-documented date night at Rao's restaurant in East Harlem. Gomez tags The Weeknd in her outfit shot for the night:\n\nInstagram\n\nAnd he's photographed checking her out as they arrive at the restaurant:\n\nSplash News\n\nThe two have a second date night in New York City the next day (Tesfaye is in town performing).\n\nBackgrid\n\nHe posts a shot of Gomez on his 'gram. Gomez's assistant leaves a joke in the comments:\n\nInstagram\n\nOn June 12th, Gomez tells Seacrest during a radio interview why she and Tesfaye went public. \"It's really hard when I would want to spend so much time hiding things. It's too much pressure, and I think everyone gets over everything eventually. I just want to be happy. If that's me just being myself, then I don't really care.\"\n\nJuly 2017: The Weeknd flies 11.5 hours to be with Gomez for her 25th birthday after his Paris show (Gomez celebrates her birthday in L.A.). On his Instagram story, he posts a shot that says \"\"on my way to you.\" \"Abel's on his way home...\" she announced with a smile on her Instagram Live of her initial party night.\n\nThey're photographed the next day having lunch together:\n\nClint Brewer/Splash News\n\nAnd dinner:\n\nAnd the next night, Gomez and The Weeknd are photographed meeting each other out after Gomez starts the night with her friends (they listen to The Weeknd's music, obviously):\n\nSplash News\n\nAugust 2017: Gomez opens up about The Weeknd in her September interview with InStyle when asked whether she's happy with him. \"I really am. It's great,\" she started. \"[But] I don't depend on one area of my life to make me happy. It's really important for me to love and nourish my friends and family and to make sure that I never get influenced by a guy. I've wanted to be in a strong headspace for years, and I really wasn't. Before, I was so young and easily influenced, and I'd feel insecure. You want someone to add to your life, not to complete you, if that makes sense. I'm lucky because he's more of a best friend than anything else.\"\n\nBoth The Weeknd and Gomez have September issue covers, and they support the other's by posting it on their Instagram story.\n\nInstagram\n\nThe Weeknd posted a shot from her editorial:\n\nInstagram\n\nLater that month, the two are spotted being PDAy on a Disneyland date:\n\n📸 | Selena and The Weeknd at Disneyland pic.twitter.com/1gAggow7dE — Selena Gomez Source (@GomezSource) August 21, 2017\n\nAnd The Weeknd and Gomez document his attempt to teach her video games:\n\nInstagram\n\nSeptember 2017: Gomez posts a photo of a date night with The Weeknd on her Instagram that appears to be the same one that's her phone background. He likes it:\n\nSelenaGomez Instagram\n\nSplash News\n\nThe two are spotted playing with puppies and later Gomez buys one, which she names Charlie:\n\nA source tells ET that the two are living together in New York City in a \"a low-rise luxury building in the heart of [Greenwich] Village\" that they're renting while Gomez is shooting her Woody Allen film there temporarily. (The Weeknd is still on tour but traveling back and forth.) This is \"a big deal,\" the source says, as Gomez usually stays in hotels while working on temporary projects.\n\nDuring fashion week, they make their second red carpet appearance at the Harper's Bazaar ICONS party. They're shot kissing on the carpet:\n\nGetty Images\n\nGetty Images\n\nLater that month, they post a photo of their New York City boat date on their Instagram stories:\n\nInstagram\n\nGomez announces that she had a kidney transplant during the summer on the 14th of that month. A source told People that The Weeknd rearranged his tour dates—and kept the summer open—so he could be with her. “It was a super serious operation,” the source said, “and all her friends were worried.”\n\nOctober 2017: The two's final public date takes place on October 12th, when they're spotted having a Halloween-themed date at Universal Studios Halloween Horror Nights. They're seen making out on a ride:\n\nNew fan taken video of Selena and Abel 😍❤️ pic.twitter.com/rIEwLfbymm — Selena Gomez Source (@GomezSource) October 13, 2017\n\nThe Weeknd goes back on tour, and Gomez returns to Los Angeles after wrapping her Woody Allen project. Gomez's ex, Justin Bieber, is spotted at her house with friends. Bieber first reached out to reconnect after finding out about Gomez's kidney transplant. TMZ reports The Weeknd is fine with them hanging.\n\nMeanwhile, Page Six publishes a report that The Weeknd and Drake are beefing because Drake allegedly had a fling with The Weeknd's ex, Bella Hadid.\n\nThe Sunday before Tesfaye and Gomez's breakup is announced, Gomez and Bieber are spotted having breakfast together, going to church together, and then spending the rest of the day and night at each other's houses, just the two of them.\n\nBACKGRID\n\nThe Weeknd, meanwhile, quietly unfollows members of Gomez's friends and family, including her mom, assistant, friend/kidney donor Francia Raisa, and her close friend and cousin Priscilla Deleon (who's also the mother of Gomez's godchild). Sources insist to TMZ that Tesfaye is fine with Gomez and Bieber hanging out, perhaps because things have already ended.\n\nOn October 30th, People breaks the news that Gomez and The Weeknd are done. They remain in touch, but the distance is ultimately what did them in. “It’s been hard for them to come to the realization that this is the direction things were heading, but it’s been hard for months,” the source told the outlet.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-the-weknd-1505162324.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-selena-the-weeknd-1509329465.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/33/1600x800/landscape-1502990361-elle-justin-bieber-selena-gomez.jpg?resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/celebrities/a12115489/selena-gomez-and-the-weeknd-relationship-timeline/", "title": "Everything That Happened in Selena and Abel Tesfaye's Dating Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "A Complete Timeline of Selena Gomez and The Weeknd's Relationship", "description": "From first makeout to their Coachella Instagram official selfie, with all the drama in between.", "url": "https://www.elle.com/culture/celebrities/a12115489/selena-gomez-and-the-weeknd-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-03-19 05:05:52", "published_time": "2017-10-30 08:56:23", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Selena Gomez and The Weeknd Relationship Timeline - Everything That Happened in Selena and Abel Tesfaye's Dating Relationship", "description": "From first makeout to their Coachella Instagram official selfie, with all the drama in between.", "keywords": "Selena Gomez,The Weeknd,bella hadid,justin bieber, abelena, selena gomez and the weeknd breakup, abel tesfaye", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/2560x2560/square-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,Bella Hadid,The Weeknd,selena gomez,justin bieber", "sailthru.date": "2017-10-30T20:56:23Z", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/2560x2560/square-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG", "sailthru.socialtitle": "A Complete Timeline of Selena Gomez and The Weeknd's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1509324983.0, "source": "http://www.elle.com", "summary": ""}