{"url": "www.thesun.co.uk/fabulous/6286606/prince-harrys-exes-invited-royal-wedding/", "text": "IT certainly says a lot about Meghan Markle’s confidence that she’s allowed her fiancé Prince Harry to invite ex-girlfriends to his wedding.\n\nWe previously told how Cressida Bonas, who dated the young royal for two years between 2012 and 2014, had got the call-up.\n\n10 Meghan may have won Prince Harry's heart, but who else came close? Credit: AP:Associated Press\n\nHowever, this week it has been reported that Zimbabwean beauty Chelsy Davy, who had an on-off six-year relationship with the prince, has been snubbed from the wedding reception.\n\nSo, which of his other glamorous exes have made the cut – and who is Not Formally Invited?\n\nEllie Goulding - INVITED\n\n10 Ellie Goulding was spotted canoodling with Harry at the Audi Polo Challenge in May 2016 Credit: Getty Images - Getty\n\nPrince Harry is believed to have dated the 31-year-old singer after the pair were spotted canoodling at the Audi Polo Challenge in May 2016.\n\nThe couple, who have been pals since meeting at Prince William’s wedding in 2011, are said to have exchanged some flirty text messages.\n\nAt the time, a source close to Harry’s circle told The Sun: “He has told friends how much he likes Ellie and she is clearly taken by him.”\n\nIn March we revealed that Ellie has been invited to the nuptials on May 19 - seven years after she sang at the wedding reception of Harry’s brother William in Buckingham Palace.\n\nCamilla Thurlow - NFI\n\n10 Love Island star Camilla is rumoured to have snogged Harry - but is now dating reality show co-star Jamie Jewitt Credit: Getty - Contributor\n\nThe Love Island star, 27, is rumoured to have dated Harry following his split from Cressida Bonas in 2014, having been spotted snogging him in Tonteria nightclub in Chelsea.\n\nShe managed to stay pretty tight-lipped about it on the reality show last year, claiming \"a lady never tells\" when quizzed during a game of Truth or Dare.\n\nLike Meghan, Camilla is an eager charity worker, having worked for the Halo Trust - the mine-clearance charity whose work was promoted by Princess Diana - and has described the actress as \"amazing and beautiful\".\n\nWe can imagine the two women being bezzie mates - but sadly, as far as we know, Camilla isn't on the guestlist.\n\n\n\nCaroline Flack - NFI\n\n10 Caroline is now engaged - but was previously linked to Harry Credit: Rex Features\n\nCaroline's been busy in her own love life of late, getting engaged to Apprentice star Andrew Brady after just three months of dating.\n\nThe 38-year-old dated Prince Harry in 2009, while she was a host on Gladiators.\n\nSpeaking about her brief romance with the prince, Caroline said: \"‘Once the story got out, that was it. We had to stop seeing each other.\n\n\"I was no longer Caroline Flack, TV presenter, I was Caroline Flack, Prince Harry’s bit of rough.\"\n\nWith Love Island returning to our screens in the coming months, we imagine Caroline might be \"too busy\" even if she did land an invite...\n\nChelsy Davy - NFI\n\n10 Chelsy was Prince Harry's first love, after meeting through mutual pals in 2004 Credit: Rex Features\n\nChelsy, 32, returned to Africa to study while Harry focused on his army career and Royal duties.\n\nChelsy was Prince Harry's first love, after meeting through mutual pals in 2004She returned to the UK to take up a top job at a law firm and was seen accompanying Harry to a number of high-brow events, including his brother's wedding to Kate Middleton.\n\n10 Chelsy is said to be 'a little hurt' to be missed off the reception guest list Credit: Getty - Contributor\n\nThough that year brought an end to their romance, yet party animal Chelsy and Harry remain good friends.\n\nIf reports are to be believed, she hasn't been asked to Harry's evening do at Frogmore House, and is \"surprised\", \"shocked\" and \"a little hurt\".\n\nCressida Bonas - INVITED\n\n10 Cressida and Harry tried to keep their relationship relatively private Credit: Getty - Contributor\n\nModel and actress Cressida, 28, was introduced to Harry by his cousin Princess Eugenie.\n\nThe pair shared a lust for life but still managed to keep their relationship relatively private, apart from moments when they were snapped off holidaying or partying at Glasto.\n\nShe allegedly called off their romance due to struggling with life in the spotlight while engagement rumours swirled, but the pair have remained on good terms.\n\nEugenie is also still pals with Cressy, and has invited her to her autumn wedding.\n\nWe can't imagine she'll recycle her frock from Harry's big day...\n\nShe is now dating chartered surveyor Harry Wentworth-Stanley, and posted a loved-up snap on Instagram on his 29th birthday, describing him as \"my love\". Could wedding bells be on the cards for her, too?\n\n10 Cressida has apparently been invited to the wedding Credit: Splash News\n\nFlorence Brudenell-Bruce - NFI\n\n10 Lingerie model Florence Brudenell-Bruce was spotted on Harry’s arm in 2011 Credit: Getty - Contributor\n\nLingerie model Florence Brudenell-Bruce, 32, was spotted on Harry’s arm in 2011, shortly after his split from Chelsy Davy.\n\nShe went on to marry multi-millionaire Henry St George in a romantic ceremony in the south of France, though her and the prince remain pals.\n\nSo, has she been invited? Well, she currently lives in the Bahamas and has a three-year-old to look after, so we'd say it's pretty unlikely she'll be there on the big day.\n\n\n\nMollie King - NFI\n\n10 Mollie caught Harry's eye in 2012 and the pair enjoyed a string of dates Credit: Getty Images - Getty\n\nThe Saturdays singer caught Harry's eye in 2012 and the pair enjoyed a string of dates.\n\nWhen quizzed about the romance, Mollie said: \"Yes, I have met Harry, and we did go out for a drink.\"\n\nAround the same time she publicly outed them, Harry reportedly called things off and Mollie went on to date supermodel David Gandy.\n\nAs far as we know, the Strictly Come Dancing semi-finalist hasn't been asked to sing (or dance) on the big day...\n\nMOST READ IN FABULOUS camera sly We’re addicted to taking catfish selfies - and our dates have walked out on us VERY EXOTIC Tiger King bikinis are sweeping Insta as celebs strip off in animal print STOCK TO IT Mum-of-six blasts stranger who mistook weekly supermarket shop for stockpiling TWO FOR ONE Photos show mum's shock as baby girl is followed by her surprise twin SCHOOL'S NOT OUT Kate ‘guilty’ about homeschool lie she told George & Charlotte over Easter FAKEAWAY Mum shows how to make a kebab at home if you're desperate for a takeaway\n\nHere we reveal more of the special couple's wedding secrets.\n\nMeanwhile one mum reveals why Prince Harry shouldn't invite ANY exes to his wedding.\n\nAnd these are the wedding protocols Meghan and Harry will have to follow when they get married.", "images": ["https://www.thesun.co.uk/wp-content/uploads/2018/05/dk-comp-harry-x.jpg?strip=all&quality=100&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/05/dk-comp-harry-x.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Hayley Richardson"], "canonical_link": "https://www.thesun.co.uk/fabulous/6286606/prince-harrys-exes-invited-royal-wedding/", "title": "Prince Harry’s exes: who’s invited and who hasn't made the cut to the wedding of the year", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Prince Harry’s exes: who’s invited and who’s NFI’d to the wedding of the year", "url": "https://www.thesun.co.uk/fabulous/6286606/prince-harrys-exes-invited-royal-wedding/", "description": "IT certainly says a lot about Meghan Markle’s confidence that she’s allowed her fiancé Prince Harry to invite ex-girlfriends to his wedding. We previously told how Cressida Bonas, who dated the you…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/05/dk-comp-harry-x.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Chelsy is said to be a little hurt to be missed off the reception guest list"}, "locale": "en_GB"}, "article": {"published_time": "2018-05-14T20:03:36+00:00", "modified_time": "2018-05-15T11:27:27+00:00", "publisher": 161385360554578, "tag": "Prince Harry and Meghan Markle royal wedding", "author": "https://www.facebook.com/Fabulous/"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "description": "Reports suggest there's at least one former flame on the guest list... Here we take a look at Prince Harry's exes and which ones have managed to score an invite to his upcoming nuptials to Meghan Markle", "keywords": "prince harry, meghan markle, royal wedding", "news_keywords": "prince harry, meghan markle, royal wedding", "twitter": {"text": {"title": "Prince Harry’s exes: who is invited and who hasn’t made the cut to the wedding of the year"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "SHOUT OUT TO MY EX", "headline": "Which of Prince Harry's exes have a royal wedding invite and who is NFI?", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/05/dk-comp-harry-x.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/05/dk-comp-harry-x.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 6286606, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1526328216.0, "source": "http://www.thesun.co.uk", "summary": ""}