{"url": "https://nypost.com/2017/09/23/how-a-decade-of-the-kardashians-radically-changed-america/", "text": "What better way to mark 10 years of the Kardashian scourge than a well-timed scandalous rumor? On Friday, two days before Sunday night’s two-hour “Keeping Up with the Kardashians” special on E!, TMZ reported that 20-year-old Kylie Jenner, the youngest of matriarch Kris Jenner’s six children, is pregnant by 25-year-old rapper Travis Scott.\n\nIn August, Kris and her five clients/daughters posed for The Hollywood Reporter, as siblings do, in flesh-toned lingerie, draped over and around each other seductively.\n\nIt’s America’s new normal, established by Kris. In the piece, she recounted hijinks from the show’s pilot.\n\n“The watercooler chatter from the first episode was all about [9-year-old] Kylie jumping on a stripper pole,” she said. “Kim had one installed in my bedroom . . . and Kylie hops up there, twirls around a couple of times, and it became this thing. When I look back on that, I belly laugh.”\n\nOf course. It’s not like Kylie, now 20, began pumping her face and body with filler and silicone as a teenager, or met her first boyfriend when she was 14 and he, the rapper Tyga, was 21, or that the majority of her very short life has been cannibalized for reality-TV fodder.\n\nIn any event, Kylie — with supermodel sister Kendall, social media empress Kim, and satellite siblings Khloe and Kourtney — have monetized their unique brand of fame into multimillion-dollar businesses. How and why is hard to explain; it’s not as though their stardom is backed up by any discernible talent. The Kardashians are like the bitcoin of the celebrity-industrial complex, their currency backed by nothing but those who buy into it.\n\nAnd plenty do. According to Forbes, Kim made nearly $50 million in the last year from her app, emojis and endorsements. Kendall ranked No. 3 on the magazine’s list of highest-paid models with $10 million in income. Kylie’s makeup line grossed $420 million in its first 18 months and WWD reports it will earn $1 billion by 2022. Kourtney and Khloe earn between $10 million and $15 million each through social media endorsements.\n\nMuch was made of the iPhone’s 10th anniversary this year — and rightly so — but consider the close ecological relationship between that technology and the concurrent rise of the Kardashians.\n\nThe clan has lived with us for 10 years now, and just as an entire generation doesn’t know life pre-iPhone, they don’t know life pre-Kardashian.\n\nOversexualized tween and teenage girls, sexting and oversharing online, with “social media influencer” a viable career option — none of this would have happened without the Kardashians. Just as Lucille Ball set the template for the sitcom and Steve Allen the late-night talk show, the Kardashians invented a new kind of celebrity.\n\nThey’ve also acculturated us to plastic surgery; never before have so many teenagers sought nips and tucks. The American Society of Plastic Surgeons has reported an uptick in the amount of teenagers undergoing cosmetic procedures: In 2014, 64,000 patients were ages 13-19; in 2015, that number was 64,470, with an additional 161,700 less invasive procedures performed that year. Now it’s just a thing kids do before going back to school.\n\n“This is directly related to the surgery of the stars of their reality shows,” Dr. Richard Ellenbogen, CEO of BeverlyHillsBody, told People.\n\nIt’s the Kardashian Generation, and overseeing all is Kris Jenner, who has used her family’s trashier aspects to muscle their way into the upper echelons of fashion and commerce. She may be among our greatest con artists, wearing us down by refusing to go away, her very staying power validating her pop-cultural omnipotence.\n\nThe woman who has pimped out her own daughters is now embraced as a feminist entrepreneur by no less than Lena Dunham, who published an interview with Jenner in her Lenny Letter last month. Noted was a framed photo, in Jenner’s office, of daughter Khloe’s mugshot after a DUI arrest. Kris has trained her offspring-cum-employees well in 21st-century shock art: “Kim Kardashian Reveals Her Favorite Sex Position, That She Pees in Her Spanx, and More Outrageous Things You Didn’t Need to Know,” ran a 2015 Us Weekly headline. Among those “things”: Kim outed Kourtney for urinating in a common area at Miami’s four-star Delano Hotel.\n\nTroubled brother Rob, who didn’t attend Kim’s wedding to Kanye West because, sources claim, Kim felt he was too overweight and unattractive, was reportedly reamed out by Kris after he quit filming in 2014. “Kris finally flat-out told him he’s an embarrassment to the family,” a source told Star that same year. “She called him a fat slob and told him he’s losing out on business opportunities because no one wants someone as huge as him representing their products.”\n\nYes: In Kris Jenner’s world, being overweight is worse for the brand than pissing on the floor of a fancy hotel.\n\n“Rob feels that show has truly ruined his family,” a source told Radar in February 2014. “He feels very alone.” Rob’s ex, Blac Chyna, with whom he has a child, also has a child with Kylie’s ex Tyga — and, for a time in 2016, their own reality show. When he began ranting against Chyna and posting revenge porn last summer, Kris called in a crisis management team and her “KUWTK” crew to film it all.\n\n“The show must go on,” a source told Hollywood Life.\n\nThe show itself really originated with Kim’s sex tape, made when she was just 23 and allegedly sold by someone close to the family. A few months later, it was used to launch “KUWTK.”\n\nAlso documented, on the original show and multiple spinoffs: the broken husbands and partners who cycle in and out of the family, including NBA star Lamar Odom, who was increasingly upset over his portrayal on the show and ended up overdosing in a Vegas brothel. Odom was reportedly “irate” and “inconsolable” after watching, and told a friend that all the family “had ever done was exploit him for the show . . . He felt chewed up and spat out.”\n\nKourtney’s small children can look forward to watching their father, Scott Disick, get black-out drunk repeatedly, his addiction a multi-season arc. She told THR that while filming the first season, she’d sneak into the bathroom to cry. “I don’t think we even knew what we were saying yes to,” said Khloe. “Kim and my mom were steering the ship.”\n\nBy the time Bruce Jenner’s divorce from Kris and subsequent gender reassignment surgery were announced in 2015, it was overshadowed as a storyline by the only question that really mattered: Who’d control the reveal — Kris on “KUTWK,” or Bruce, soon to be Caitlyn, alone? (Caitlyn won.) Would Kanye, who largely sidesteps the show, make a cameo? (Yes.) When Kim got robbed in Paris last year, would she share her trauma on the show? (Yes, with E! airing a teaser trailer in which Kim tearfully recounted the moment she was sure “they’re going to rape me.”)\n\nIn the aftermath, Kim disappeared from social media and said she would stop with her vulgar displays of wealth. “It’s not all about the money,” she reportedly said. “It’s not worth it.”\n\nNow, less than one year later, Kim’s the star of the 10th-anniversary teaser, standing like a silent cyborg, looks and body radically altered by surgery and weaves and filler and implants, staring vacantly into space as a small army adorns her like the plastic doll she is.\n\nHer mother must be so proud.", "images": ["https://thenypost.files.wordpress.com/2020/04/online-piano-class.jpg?quality=90&strip=all&w=300&h=200&crop=1", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=1200", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0"], "top_img": "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["Maureen Callahan", "September"], "canonical_link": "https://nypost.com/2017/09/23/how-a-decade-of-the-kardashians-radically-changed-america/", "title": "How a decade of the Kardashians radically changed America", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "What better way to mark 10 years of the Kardashian scourge than a well-timed scandalous rumor? On Friday, two days before Sunday night’s two-hour “Keeping...", "generator": "WordPress.com", "og": {"type": "article", "title": "How a decade of the Kardashians radically changed America", "url": "https://nypost.com/2017/09/23/how-a-decade-of-the-kardashians-radically-changed-america/", "description": "What better way to mark 10 years of the Kardashian scourge than a well-timed scandalous rumor? On Friday, two days before Sunday night’s two-hour “Keeping Up with the Kardashians” special on E!, TM…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2017-09-24T00:03:34+00:00", "modified_time": "2017-09-25T20:16:58+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "true", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "How a decade of the Kardashians radically changed America"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2017/09/nup_170132_1863_149255416.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "How a decade of the Kardashians radically changed America", "description": "What better way to mark 10 years of the Kardashian scourge than a well-timed scandalous rumor? On Friday, two days before Sunday night’s two-hour “Keeping Up with the Kardashians” special on E!,"}, "fb": {"pages": 225343690812937}, "nypost-section": "Opinion", "parsely-metadata": "{\"post_id\":\"nypost-11268620\"}", "keywords": "Opinion,Entertainment,blac chyna,brands,caitlyn jenner,celebrity pregnancies,kardashians,keeping up with the kardashians,khloe kardashian,kim kardashian,kourtney kardashian,kris jenner,reality tv,rob kardashian", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": [], "publish_date": 1506096000.0, "source": "https://nypost.com", "summary": ""}