{"url": "https://en.wikipedia.org/wiki/Nicolette_Robinson", "text": "Nicolette Kloe Robinson (born April 4, 1988) is an American stage and television actress.[3][4] She is known for her role as Jane in the television show The Affair and Jenna in the stage musical Waitress,[5] the latter of which marked her debut on Broadway.[6]\n\nEarly life [ edit ]\n\nRobinson was born on April 4, 1988 in Los Angeles, California, to a Jewish mother and an African-American father.[4] She has joked that her family \"looks like the U.N.\"[4] She attended the University of California, Los Angeles, where Robinson majored in musical theater. While in school she performed in multiple stage productions, UCLA's Awaken A Cappella, and received the Gant Gaither Theater Award from the Princess Grace Foundation-USA. Robinson also received a scholarship from the Jackie Robinson Foundation.[2]\n\nPersonal life [ edit ]\n\nIn 2012 Robinson married actor Leslie Odom Jr., whom she met in 2008 while auditioning for a role in the musical Once on This Island in Los Angeles.[7] Odom, who is known for originating the role of Aaron Burr in the stage musical Hamilton, served as the musical's assistant director.[7] As Robinson would be replacing an actor who had left the production, Odom was tasked with ensuring that she easily transitioned into the role and the two began a relationship after the show's run ended.[6] On April 23, 2017 the two had their first child, a daughter named Lucille Ruby.[8]\n\nPerformances [ edit ]\n\nStage [ edit ]\n\nTelevision [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nicolette_Robinson", "title": "Nicolette Robinson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}