{"url": "http://time.com/5286900/bishop-michael-curry-good-morning-america/", "text": "The Bishop who captivated the world with powerful, nearly 14-minute sermon at the royal wedding on Saturday said he gave an “outline” of his sermon to Prince Harry and Meghan Markle a week ahead of the event.\n\n“They were very gracious. I did provide a copy of the manuscript about a week before, I think it was,” Presiding Bishop Michael Curry told Robin Roberts on ABC’s Good Morning America Tuesday. “I only deviated slightly. You can’t get a preacher — you’re going to deviate a little bit.”\n\nHe added: “They were aware of the basic outline and what was in it.”\n\nThe Duke and Duchess of Sussex selected Curry, the first African American presiding bishop of the Episcopal Church, to deliver the sermon at their May 19 wedding at St. George’s Chapel in Windsor Castle. They chose Curry after consulting with the Archbishop of Canterbury and the dean of St. George’s Chapel, Curry told Good Morning America. When he got the phone call from the Archbishop’s Lambeth Palace informing him of their decision, he couldn’t believe it.\n\n“I said, ‘Get out of here. It’s April Fools. You gotta be kidding,'” he said. “And it was actually true.”\n\nA month later, when he was finally able to tell his wife the news, she had the same, stunned reaction, he said.\n\nBorn in Chicago, Curry said he has had a “remarkable and very surprising” last few days after his sermon on the power of love enchanted the world. He took a selfie with the crew on his American Airlines flight back to the U.S., he said, and Keenan Thompson on Saturday Night Live did an impression of him on the show’s “Weekend Update” segment that night.\n\n“It was a great likeness,” Curry said of the S.N.L. impression. “I can’t believe they actually pulled it off just in a matter of hours.”\n\nHe told Roberts that the clear love between Prince Harry and Meghan Markle inspired his sermon — and notably brought together a diverse group of people for the ceremony.\n\n“The love between those two people, between that royal couple, was so powerful, not only did we all show up, but it brought all these different worlds together,” he said. “It brought different nationalities, different ethnicities, different religious traditions, people of all stripes and types, people of different political persuasions, actually for a moment we were together, organized around love.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2019/11/prince-andrew-1-.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/05/michael-curry-royal-wedding-bishop.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2019/11/anne-boleyn.jpg?quality=85&w=312", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/05/michael-curry-royal-wedding-bishop.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Jennifer Calfas"], "canonical_link": "https://time.com/5286900/bishop-michael-curry-good-morning-america/", "title": "Bishop Michael Curry Gave Outline of Royal Wedding Sermon", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "onetime,Royal Family", "news_keywords": "onetime,Royal Family", "description": "Bishop Michael Curry captivated the world with his sermon at the royal wedding— and \"couldn't believe it\" when the couple chose him.", "og": {"title": "Prince Harry Saw an Outline of Michael Curry's Sermon Before Wedding", "type": "article", "site_name": "Time", "url": "https://time.com/5286900/bishop-michael-curry-good-morning-america/", "description": "Bishop Michael Curry captivated the world with his sermon at the royal wedding— and \"couldn't believe it\" when the couple chose him.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/05/michael-curry-royal-wedding-bishop.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5286900/bishop-michael-curry-good-morning-america/", "description": "Bishop Michael Curry captivated the world with his sermon at the royal wedding— and \"couldn't believe it\" when the couple chose him.", "media": "https://api.time.com/wp-content/uploads/2018/05/michael-curry-royal-wedding-bishop.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5286900/bishop-michael-curry-good-morning-america/", "title": "Prince Harry Saw an Outline of Michael Curry's Sermon Before Wedding", "description": "Bishop Michael Curry captivated the world with his sermon at the royal wedding— and \"couldn't believe it\" when the couple chose him.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/05/michael-curry-royal-wedding-bishop.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}