{"url": "people.com/movies/brad-pitt-angelina-jolie-divorce-custody-timeline/", "text": "Angelina Jolie and Brad Pitt‘s split in September 2016 was sudden and shocking — but after an initial flurry of ugly accusations, the couple entered divorce mediation and largely kept their negotiations private.\n\nNow their divorce has exploded into the headlines again as the couple battle over visitation and child support for kids Maddox, Pax, Zahara, Shiloh, Vivienne and Knox. Here’s a brief history of how things between them got so heated.\n\nGet push notifications with news, features and more.\n\nTheir Shocking Split\n\nJolie and Pitt were last photographed together in public in July 2016, when they stopped into a Jamba Juice store in L.A. with Shiloh.\n\nOn Sept. 19, 2016 Jolie filed for divorce. She cited irreconcilable differences as the reason for the split and asked for physical custody of their six children.\n\nImage zoom Pitt and Jolie with (from left) Pax, Zahara, Knox, Shiloh and Maddox in May 2014. Charley Gallay/Getty\n\nTroubling Allegations and an Investigation\n\nPitt was investigated by the Los Angeles County Department of Children and Family Services over allegations he got “verbally abusive” and “physical” with one of his children on the pair’s private plane the day before Jolie filed for divorce.\n\nA source told PEOPLE at the time that Pitt “made contact” with Maddox, then 15, in the shoulder area, but Maddox wasn’t injured. “There was a parent-child argument which was not handled in the right way and escalated more than it should have,” the source said.\n\nDCFS concluded its investigation in November. “It was a full and thorough investigation and the determination has been made that no charges should be brought,” a source said at the time, adding that there was no finding of abuse.\n\nAn Agreement to Keep the Divorce Private\n\nStarting in October 2016, Pitt was allowed weekly visits, supervised by a therapist, with his youngest kids, a January 2017 court filing revealed. The papers stated that weekly visits of “five hours each” had been scheduled through the end of January. That same month, Jolie and Pitt put out a joint statement saying they had reached an agreement to hash out their divorce confidentially in front of a private judge and “act as a united front.”\n\nCustody Issues Surface\n\nIn the following year-plus, the exes kept the peace and got back to their lives. Jolie continued her advocacy work, produced an Oscar-nominated animated movie and resumed acting with Maleficent 2. Pitt starred in and produced numerous movies and started dating, according to source, being seen with MIT professor Neri Oxman in April.\n\nThen in June 2018, their clash over custody wound up surfacing in public court documents. A judge ruled that Jolie could lose primary custody of their kids if she didn’t allow them each to form a “healthy and strong relationship” with Pitt. The judge set a detailed visitation schedule of when Pitt could spend time with the children in London, where Jolie has been filming for the summer, and in L.A. The ruled also granted Pitt unsupervised cell phone contact with the kids.\n\nA spokesperson for Jolie called the public release of the documents “deplorable.”\n\n“From the start, Angelina has been focused only on their health and needs,” the statement to PEOPLE continued, “which is why it was so important that this last court hearing be conducted privately.”\n\nImage zoom Kevin Mazur/WireImage\n\nPitt and Jolie in 2014.\n\nA Child-Support Spat\n\nJolie’s attorney Samantha Bley DeJean filed papers on Aug. 7 stating that Pitt “has a duty to pay child support. As of present, [Pitt] has paid no meaningful child support since separation.”\n\nIn the documents, Jolie’s lawyer added, “Given the informal arrangements around the payment of the children’s expenses have not been regularly sustained by [Pitt] for over a year and a half, [Jolie] intends to file an RFO [request for a court order] for the establishment of a retroactive child support order.”\n\nIn a filing the next day, Pitt’s lawyer Lance Spiegel slammed Jolie’s filing as “unnecessary” and “a thinly-veiled effort to manipulate media coverage.” The filing state that Pitt “loaned” Jolie $8 million to help her purchase her current home and has contributed over $1.3 million “for the benefit of [Jolie] and the minor children.”\n\nJolie’s lawyer shot back in a statement calling Pitt’s filing “a blatant attempt to obfuscate the truth and distract from the fact that he has not fully met his legal obligations to support the children.” Bley DeJean said Jolie is paying interest on the $8 million loan: “A loan is not, however, child support and to represent it as such is misleading and inaccurate.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fangelina-jolie-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=660&h=346&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fangelina-2-660.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F02%2Fbrangelina.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=660&h=346&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fangelina-2-660.jpg", "keywords": [], "authors": ["Dana Rose Falcone"], "canonical_link": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-custody-timeline/", "title": "How Brad Pitt and Angelina Jolie's Divorce Exploded", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Angelina Jolie,Brad Pitt,Celeb Relationships,Divorce,Maddox Jolie-Pitt,Movie Celebrities,Movie News,News", "news_keywords": "Angelina Jolie,Brad Pitt,Celeb Relationships,Divorce,Maddox Jolie-Pitt,Movie Celebrities,Movie News,News", "description": "Almost 2 years after Brad Pitt and Angelina Jolie split, they're fighting over money and the kids. Inside their divorce battle", "og": {"title": "How Brad Pitt and Angelina Jolie's Divorce Exploded", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-custody-timeline/", "description": "Angelina Jolie and Brad Pitt‘s split in September 2016 was sudden and shocking — but after an initial flurry of ugly accusations, the couple entered&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=660&h=346&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fangelina-2-660.jpg", "width": 660, "height": 346}}, "pinterest": {"url": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-custody-timeline/", "description": "Almost 2 years after Brad Pitt and Angelina Jolie split, they're fighting over money and the kids. Inside their divorce battle", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fangelina-2-660.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-custody-timeline/", "title": "How Brad Pitt and Angelina Jolie's Divorce Exploded", "description": "Almost 2 years after Brad Pitt and Angelina Jolie split, they're fighting over money and the kids. Inside their divorce battle", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=660&h=346&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F10%2Fangelina-2-660.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}