{"url": "www.washingtonpost.com/news/morning-mix/wp/2017/01/13/nicole-kidman-on-trump-we-as-a-country-need-to-support-whoevers-the-president/", "text": "During the interview, Derbyshire brought up Kidman’s dual Australian and American citizenship and noted the actress voted in the U.S. election.\n\n“I’m always reticent to start sort of commenting politically,” Kidman began. “I’ve never done it in terms of America, or Australia. I’m issue-based.”\n\nAD\n\nThen she continued, “I just say he’s now elected and we as a country need to support whoever’s the president because that’s what the country’s based on. However that happened, he’s there, and let’s go. ”\n\nAD\n\nAfter these remarks, she quickly discussed two topics — same-sex marriage and women’s health care and equality.\n\nShe said the former should be legal in Australia. On the latter, she said, “I’m very, very committed to women’s issues in terms of I do a lot of fundraising for U.N. Women and I do a lot of traveling for them. I also do an enormous amount of fundraising for breast and ovarian cancer, because that’s something that’s affected my family deeply. So they’re my issues that I’m very attached to.”\n\nAD\n\nKidman quickly came under fire on social media.\n\n“I think it’s time for Nicole Kidman to move to Russia,” tweeted one user. “Nicole Kidman married Tom Cruise who is a Scientologist. Her advice is the last thing America needs!” tweeted another. “Would you follow Hitler, just because he has a title?” asked one user.\n\nAD\n\nNicole Kidman: Americans need to support Trump\n\nAmericans: We just lost our healthcare!\n\nNicole Kidman: Me? Tonight I'm wearing Dior. — Kels Like Teen Spirit (@KelseyFGold) January 13, 2017\n\nhttps://twitter.com/BumbleBUnicorn/status/819820861913964544\n\nHer comments are a sharp departure from the rhetoric most celebrities have used since Trump’s surprise victory over Hillary Clinton.\n\nMost recently, Meryl Streep used her acceptance speech at the Golden Globes as a semi-political vehicle, espousing the virtues of a “principled press” and condemning the powerful who use bullying as a means of control. She never once mentioned Trump’s name while clearly speaking about him, bringing up “the person asking to sit in the most respected seat in our country imitat[ing] a disabled reporter.”\n\nAD\n\n“And this instinct to humiliate, when it’s modeled by someone in the public platform, by someone powerful, it filters down into everybody’s life, because it kind of gives permission for other people to do the same thing,” Streep said.\n\nAD\n\nFor her efforts, Trump employed his favorite insult, tweeting that Streep — winner of three Oscars and nominated for 19 — was “overrated” and was a “Hillary flunky who lost big.”\n\nBruce Springsteen, who in reference to Trump had previously told Rolling Stone “The republic is under siege by a moron,” recently gave a far-reaching interview on the popular podcast “WTF with Marc Maron.” In it, he wondered aloud if Trump “is simply competent enough to do this particular job.”\n\nAD\n\nSpeaking about Trump’s election, Springsteen warned, “When you let that genie out of the bottle — bigotry, racism, intolerance … they don’t go back in the bottle that easily if they go back in at all. Whether it’s a rise in hate crimes, people feeling they have license to speak and behave in ways that previously were considered un-American and are un-American. That’s what he’s appealing to. My fears are that those things find a place in ordinary, civil society.”\n\nAD\n\nSome celebrities didn’t wait quite so long to attack the president-elect. “West Wing” and “Social Network” screenwriter Aaron Sorkin published a letter in Vanity Fair addressed to his ex-wife Julia and his 15-year-old daughter Roxy the day after the election. In it, he called Trump “an incompetent pig with dangerous ideas, a serious psychiatric disorder, no knowledge of the world and no curiosity to learn,” then wrote simply, “This is truly horrible.”\n\nAs The Washington Post reported:\n\nAD\n\nIt was full of sharp language and vitriol (at one point, he called the president-elect a certain type of “nozzle” that can’t be printed here; at another, he stated Trump will be impeached within the year), despite the magazine labeling it as “moving.”\n\nThat said, there have been a few celebrities who have urged Americans to give Trump a chance, even if he wasn’t their first pick for the presidency.\n\nWe all need to give President-Elect Trump a chance. Support the good. Lobby against what we disagree on. No one is bigger than us all — Mark Cuban (@mcuban) November 9, 2016\n\nWhile accepting the Trevor Hero Honoree Award at the annual fundraiser for the Trevor Project, a nonprofit organization focused on suicide prevention among LGBTQ youth, Kelly Osbourne said to the audience, “We have to give him a chance. And we do it by spreading love, not hate.”\n\nAD\n\nMirroring this, BET founder Bob Johnson said, “Let’s give him a shot. Let’s give him the benefit of the doubt and see if we can find common ground. That is what’s best for African Americans.”\n\nFinally, some have outright supported Trump, such as former NBA star Dennis Rodman, who told Black Press USA, “We don’t need another politician, we need a businessman like Trump.”\n\nAD", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/26UIE6VC5I3OJFNU6CSVXVL7XE.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/611eba8a-306c-4ad4-9628-68035a07276e.png&w=90&h=90", "https://www.washingtonpost.com/resizer/L49tRmcnNrWBiKRBvgyDHKr3TeE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CRVTQTXCVU5YRETOM4E2YTFJGM.jpg"], "top_img": "https://www.washingtonpost.com/resizer/L49tRmcnNrWBiKRBvgyDHKr3TeE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CRVTQTXCVU5YRETOM4E2YTFJGM.jpg", "keywords": [], "authors": ["Travis M. Andrews", "Pop Culture Reporter Covering Music", "Movies", "Tv", "Comedy", "Celebrity Culture", "Staff Writer"], "canonical_link": "https://www.washingtonpost.com/news/morning-mix/wp/2017/01/13/nicole-kidman-on-trump-we-as-a-country-need-to-support-whoevers-the-president/", "title": "Nicole Kidman on Trump: ‘We as a country need to support whoever’s the president’", "meta_data": {"description": "Kidman quickly came under fire on social media.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/01/13/nicole-kidman-on-trump-we-as-a-country-need-to-support-whoevers-the-president/", "image": "https://www.washingtonpost.com/resizer/L49tRmcnNrWBiKRBvgyDHKr3TeE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CRVTQTXCVU5YRETOM4E2YTFJGM.jpg", "title": "Nicole Kidman on Trump: ‘We as a country need to support whoever’s the president’", "description": "Kidman quickly came under fire on social media."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Nicole Kidman on Trump: ‘We as a country need to support whoever’s the president’", "description": "Kidman quickly came under fire on social media."}, "last_updated_date": "2019-04-29T23:32:23.123Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1484236800.0, "source": "http://www.washingtonpost.com", "summary": ""}