{"url": "http://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927&page=4", "text": "August 8, 2010 \u0097 -- AMANPOUR: Good morning. I'm Christiane Amanpour, and at the top of the news this week, ending the war in Iraq.\n\n(BEGIN VIDEO CLIP)\n\nPRESIDENT BARACK OBAMA: Tens of thousands of our troops in Iraq are coming home.\n\n(END VIDEO CLIP)\n\nAMANPOUR: As America stands down, is Iraq ready to stand up? This morning from Baghdad, the commanding general of U.S. forces, General Ray Odierno, a \"This Week\" exclusive.\n\nThen, hidden wounds. After a decade of war, why is the military still so unprepared to deal with its emotional scars?\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): They didn't care about my family. The only thing I thought was my role was (inaudible).\n\n(END VIDEO CLIP)\n\nAMANPOUR: This morning, the general in charge of healing those wounds, an exclusive interview with the vice chief of staff of the army, General Peter Chiarelli.\n\nThen...\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): We are losing everything we have.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Jobs, immigration, and gay marriage. All the week's politics on our roundtable with Politico's John Harris; Gillian Tett of the Financial Times; George Packer of the New Yorker, and former Bush White House official Michael Gerson.\n\nAnd the Sunday Funnies.\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): According to the Bureau of Labor statistics, like half of American workers hold on to a job for four years or more. Bad news for President Obama.\n\n(END VIDEO CLIP)\n\nAMANPOUR: This weekend marks a major milestone in the seven-year war in Iraq. U.S. forces have now handed over control of all combat duties to Iraqi forces, and by the end of this month, all U.S. combat forces will be out. A transitional force of about 50,000 troops will remain, though.\n\nEarlier this week, President Obama spelled out their mission.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Our forces will have a focused mission -- supporting and training Iraqi forces; partnering with Iraqis in counter-terrorism missions, and protecting our civilian and military efforts. But make no mistake: Our commitment in Iraq is changing from a military effort led by our troops to a civilian effort led by our diplomats.\n\n(END VIDEO CLIP)\n\nAMANPOUR: But five months after elections, Iraqi politicians have not yet formed a government, and violence continues. Last night, three explosions at a market in southern Iraq killed dozens of people. And today, two car bombs went off west of Baghdad.\n\nJoining me this morning from Baghdad, the commander of U.S. forces in Iraq, General Ray Odierno. General Odierno, thank you very much for joining us on \"This Week.\"\n\nAnd I want to start by asking you about the handover. You have just handed over all combat operations to Iraqi forces. Are they really ready to stand up once you draw down by the end of this month?\n\nODIERNO: Well, this is something that we've been working for a very long time with the Iraqi security forces. For the last 20 months, we've been slowly and deliberately turning over more and more responsibility to them, and they have stepped up. They continue to do broad-scoped operations across all of Iraq. We continue to help them as they do these, and that will continue after 1 September, our assistance. But we do believe they are ready to assume full operations in Iraq.\n\nAMANPOUR: Well, let me ask you about the violence. This weekend alone in Basra in the south, there has been a big explosion that's caused dozens of deaths. What is it? Do you know what it is, in fact, was it a terrorist attack?\n\nODIERNO: Well, I think it probably was. We're still sorting through that, because there was conflicting reports, but my guess is it was probably some sort of an improvised explosive device that went off.\n\nI would just say, this is a reflection -- we have ups and downs here. As I step back, having been here since the dark days of 2006 and '7, to where we are today, what I see is a broad change in the security environment here in Iraq.\n\nHowever, there are still groups out there who are conducting terrorist acts against the people of Iraq, and they are doing this to stop the political way forward, to stop the political process moving forward, to stop democracy moving forward, and to cause the government of Iraq not to continue its progress. And that's what we're seeing that's playing out on the ground now.\n\nAMANPOUR: Well, General Odierno, in fact, it seems that the political parties in Iraq are not moving forward with the democracy as you describe it. Five months or more after the election, there is still no government. How much does that worry you, and what kind of vacuum is that creating there?\n\nODIERNO: Well, again, first off, we've seen during this time, this governmental formation timeframe, the Iraqi security forces have acted neutral; they've continued to conduct operations across the broad spectrum of operations that are necessary. In fact, I have found them to be very professional in continuing to execute the security profile. So we have seen no degradation in their ability to execute the security profile. And I think that's actually an extremely positive step forward for them, that they've continued to operate, even though -- or during this time of governmental formation.\n\nAMANPOUR: So, how concerned are you and at what point will you be concerned if there is no government, and do you think that that is providing space for insurgents to reorganize, as many suggest?\n\nODIERNO: Well, I will just tell you, is what we -- again, what we can't do is overreact to incidents. There are going to be incidents that occur here. There is a level of violence and a level of terrorism here that's going to occur. But I will tell you, over the last six to seven months, the success that we've had against Al Qaida in Iraq specifically in decapitating the leadership has in fact affected them. The kind of operations that they now conduct are very different than what they did just six months ago or eight months ago. And the kind of their ability to surge and do this over a sustained period of time is limited, and that's due to a lot of the work of the Iraqi security forces, working with us to conduct these operations.\n\nSo I think they can handle it. I think the bottom is for us here now, it's not about the number of people on the ground. It's really about how we continue to sustain stability. And you have to do that through continued development economically, continued development diplomatically and politically, as well as the continued improvement of the security forces. And I think we have a plan to do that beyond 1 September.\n\nAMANPOUR: So let me ask you about the diplomatic engagement, as you say. Do you think that the effort on military drawdown and the engagement that you have had with the Iraqis on the military drawdown may have not been matched by the effort on the diplomatic and political front?\n\nODIERNO: Well, I think, again, they come at different times. I think what we now have is -- it's about -- it's not only about our commitment; it's about the Iraqis now having the capability to move forward. And what we've seen over the last two years, that their governmental entities have improved significantly, and they are starting to move forward economically. For example, they have signed a whole bunch of oil contracts now that are just beginning to be executed across Iraq. So we're starting to see this economic progress.\n\nYou know, the political progress is slow because of the delaying of formation of the government. But I would say that's because we had legitimate, credible elections. The results were very close, and so now it's made it very difficult to form the government. But all the sides are talking. They are working through the formation of the government.\n\nAnd so I think they understand the importance of getting a government formed, so they continue to get assistance from the United States in developing their capacity across the economic and diplomatic spectrum.\n\nAMANPOUR: Do you think, General, that the government will be formed by September 1, when you are meant to be withdrawing to 50,000 force?\n\nODIERNO: Again, I would say the numbers and our numbers of withdrawing is not linked to the governmental formation process. Do I think they will have made progress by the 1st of September? I think so. I think we'll see some first steps toward forming a government by 1 September, but our numbers are not linked to that formation of the government. Our numbers are linked to the capacity that the Iraqis -- of the Iraqi security forces being able to sustain stability. And I think they are moving toward that capacity.\n\nAnd I remind everybody that we'll have 50,000 troops on the ground post 1 September, and that is still a very significant presence to continue to assist the Iraqi security forces as we move forward.\n\nAMANPOUR: What are you noticing in terms of interference potentially from other funded groups from the neighbors? Do you notice or are you alarmed that there may be any kind of other countries trying to take advantage of what is a bit of a political vacuum right now?\n\nODIERNO: Well, Iraq, as you well know, Christiane, Iraq is a strategically important place in the Middle East, just by its geographic location, by its population, by the influence it's had in the Middle East for a long time. So neighboring countries from around the Middle East have an interest inside of Iraq.\n\nBut I will tell you that I think Iraqis themselves are nationalistic in nature, and that's why it's important. A strong Iraq will defend itself against interference from outside countries, and I think as we build a strong Iraq and as we continue to build a strong security mechanism and as we continue to help them economically and diplomatically, that will make it less likely of others from the outside being able to interfere.\n\nNow, for the vacuum as we see today, again, I remind everyone is that we still have a significant presence here, and we are not going to -- we will not allow undue maligned influence on the Iraqi government as they attempt to form their government. What we're trying to do is provide them the space and time for them to do that, and we will continue to do that post 1 September. We'll still have a significant civilian presence, and again, we'll still have 50,000 troops on the ground here to ensure that this government can be formed by the Iraqis. And that all the other nations respect their sovereignty as they go about forming their government.\n\nAMANPOUR: What gives you the most concern right now? You are obviously speaking with great confidence about the Iraqi forces that you've been able to stand up. I think it's somewhere over 125,000 Iraqi forces since the surge. What gives you the most concern at the moment as you approach that August 31st date?\n\nODIERNO: I think I would just say it's not the security profile. Obviously I believe there will be people who attempt to take advantage of the opportunity of the attention being brought upon the August 31st date. And so, there will be groups who will try to take advantage and show weakness in the government of Iraq and try to create some sort of lack of confidence of the people in the process as you move forward. So that's probably my first concern. But I believe we can overcome that concern.\n\nThe second is, is that the Iraqis have to understand the importance of forming a government, doing it as quickly as possible, and getting themselves ready to leap forward so they can make progress on the economic front and the diplomatic front. And they've got to set themselves up for that, so it's important for the Iraqis to understand the importance of moving forward quickly, and I think we're starting to see that as we see negotiations pick up over the last couple of weeks.\n\nAMANPOUR: OK, and final question -- do you think U.S. diplomats have done enough to push the political parties together?\n\nODIERNO: I think it's a very fine line here, Christiane. What we want is we want to have the Iraqis form their own government. What we try to do here is facilitate that process, and I think that we behind the scenes have tried to facilitate the process without being directive in who should do what. And I think we've done a pretty fair job of that. And I think as time goes on, we'll try to facilitate it a bit harder to get them to move forward a bit quicker.\n\nAMANPOUR: Thank you very much, General Odierno. Thanks for joining us.\n\nODIERNO: OK, thank you very much. It was good to be with you today.\n\nAMANPOUR: General Chiarelli, thank you very much for joining us on THIS WEEK.\n\nCHIARELLI: Well, it's great to be here.\n\nAMANPOUR: One of the most extraordinary lines that I think I took away from the entire report was when it says, simply stated, we are often more dangerous to ourselves than the enemy. That is pretty stark.\n\nCHIARELLI: Well, we have an army that's, for almost a decade, has been going very, very hard with our operational tempo; having our soldiers deployed for 12 months, home anywhere from 12 to 16 months, and back for another 12 or 15-month deployment.\n\nAMANPOUR: It's too much.\n\nCHIARELLI: Well -- and during that time, we've seen an increase with some soldiers, a very small number of soldiers, of high-risk behavior.\n\nAMANPOUR: What do you mean by \"high-risk behavior\"?\n\nCHIARELLI: Well the abuse of alcohol, drugs, getting in trouble with the law.\n\nAMANPOUR: Is it just people who are predisposed to high-risk behavior or is it the -- the pressures of, as you said, these multiple deployments on such short turnaround?\n\nCHIARELLI: Well, we definitely think, and we have some pretty good data to show, that deployment plays a role in the increase that we've seen. But at the same time, there's all kind of stressors in a soldier's life.\n\nAMANPOUR: So let's talk about the particular problems. Let's talk about suicide-- so what did you notice about the suicide rate amongst the soldiers and those who are coming back?\n\nCHIARELLI: Well, some of the things that we're seeing in suicides is 60 percent of our suicides take place(AUDIO GAP) with our soldiers who are in their first term of enlistment. Normally, it's six --\n\nAMANPOUR: Sixty percent?\n\nCHIARELLI: Sixty percent.\n\nAMANPOUR: And most of those suicides are happening back home.\n\nCHIARELLI: There are two-thirds that are occurring back home and about a third that are happening in theater.\n\nAMANPOUR: Let me put up a statement that comes from the report. It says that there are instances where a leader's lack of soldier accountability resulted in suicide victims not being found until they have been dead for three or four weeks. And then it goes on to say that in an organization, the military, that prides itself on never leaving a soldier behind, this sobering example speaks to the leadership breakdown, the breakdown of leadership in a Garrison which appears to be worsening as the requirements of prolonged conflict slowly erode the essential attributes that have defined the Army for generations.\n\nThat's very serious language.\n\nCHIARELLI: Well it is, and it needs to be serious cause we need to go back to doing things the way we used to do things.\n\nAMANPOUR: But how does this happen? I mean, why aren't people looking at these young men? You've already mentioned that they are under extraordinary stress because of the redeployments in a much shorter period of time than is much generally called for.\n\nCHIARELLI: Well, commanders --\n\nAMANPOUR: So you know that they're at risk.\n\nCHIARELLI: Commanders are getting ready to take their soldiers into harm's way. And let's say you have a soldier that has a minor problem with alcohol, gets stopped at a roadside spot check and blows just over the legal limit six weeks before deployment.\n\nNow, this soldier has been downrange with you, done just a fantastic job in his last deployment and you're faced with either putting him into a drug and alcohol program or turning to the platoon sergeant and saying, listen, PFC. Chiarelli's a good soldier, let's do what we can. Let's forget this time.\n\nAMANPOUR: So no accountability?\n\nCHIARELLI: Well, I'm not saying no accountability --\n\nAMANPOUR: Repeat offenders.\n\nCHIARELLI: Well, that's how repeat offenders happen. He comes back from his next deployment, has a more serious issue with alcohol, no one knows about the first cause the leadership has changed out or he's moved to another unit, and we have this problem.\n\nAMANPOUR: Can I ask you, because I want to sort of stop you when you say high-risk behavior. Obviously some of it is because of high-risk behavior, but there are parents who have told us that it's not just about high-risk behavior. They're children were absolutely fine until they went to the front over and over again. One mother said, that she's offended at how suicide victims are being stereotyped as reckless losers predisposed to engage high-risk behavior, her son didn't leave home that way.\n\nYou know, do you think that -- do you think that all of these people are simply predisposed to high-risk behavior?\n\nCHIARELLI: Absolutely not. Absolutely not. What are soldiers are seeing downrange every day human beings shouldn't see at times, and we have problems with posttraumatic stress. We know we have soldiers who come back, and I like to call it a chemical injury that takes place because of the way their body reacts to some kind of event.\n\nAMANPOUR: And yet, you know, I know, because I've reported on these soldiers, and you know because you've had to deal with them and take care of them that this still is an enormous stigma\n\nAMANPOUR: Let me put up something that President Obama said this week about this very issue. Listen.\n\n(BEGIN CLIP)\n\nOBAMA: To anyone who is struggling, don't suffer in silence. It's not a sign of weakness to reach out for support, it's a sign of strength. Your country needs you. We are here for you. We are here to help you stand tall. Don't give up.\n\n(END CLIP)\n\nAMANPOUR: So President Obama speaking to veterans earlier this week.\n\nBut the thing is, whose here? How many behavioral experts do you have? How many people do you need? How many do you actually have?\n\nCHIARELLI: Well, I don't know if we know how many we need. We have a force that has been stressed after almost a decade of war. We're looking for new ways to be able to deliver behavior health, such as virtual behavior health where we literally bring up a network using the internet, using the network of doctors, say 200, from all over the United States who can, in fact, provide a good, good look at our soldiers when they return.\n\nAMANPOUR: I've heard that perhaps you have a shortfall of hundreds of people who can actually provide this kind of help.\n\nCHIARELLI: Well, we do have a shortage.\n\nAnd if you want to get at stigma, you start with the brigade commander, brigade command sergeant major and work right down the chain of command so every soldier sees his leader going through the same checks that the soldier's going to go through.\n\nAMANPOUR: I want to also have you listen to a young soldier in -- on the battlefield. Listen to this little clip for a moment.\n\n(BEGIN CLIP)\n\nMALE: You can't get a better high. It's like crack, you know? You can skydive or bungee jump or do kayak, what? Once you've been shot at, you really can't come down. There's nothing -- you can't top that.\n\nQUESTION: Are you going to go back to the civilian world then?\n\nMALE: I have no idea.\n\n(END CLIP)\n\nAMANPOUR: There it is.\n\nCHIARELLI: Well, that's the kind of individual -- that individual needs that help that we've got to convince to get that help. And we've got to get leadership to be attuned to those kind of reactions.\n\nAMANPOUR: What can leadership say to young soldiers, young servicemen and women who find themselves at the front and who have that reaction that there's no bigger high, that we cannot cope with civilian life once we come back?\n\nCHIARELLI: Leaders need to lead, to know their soldiers, to look for those signs that they see that PFC. Chiarelli has changed. PFC. Chiarelli is going out and maybe drinking a little bit too much, showing up for work late, whatever it might be.\n\nAMANPOUR: And just so that it's clear, it's not just suicides we're talking about, we're talking about crime, we're talking about rape, we're talking about addiction and dependence.\n\nAnd for instance, one of the statements in the report, as we continue to wage war on several fronts, data would suggest we're becoming more dependent on pharmaceuticals to sustain the force. In fact, anecdotal information suggests that the force is becoming increasingly dependent on both legal and illegal drugs.\n\nI mean, that's terrifying.\n\nCHIARELLI: That's a concern. We know that we had over 106,00 soldiers last year who had a prescription of three weeks or more for some kind of antidepressant, anti-anxiety medicine.\n\nAMANPOUR: Because I mean it sort of raises the specter of a significant number of people out there heavily armed, afraid, under fire, IEDs and drugs are sort of the motivating --\n\nCHIARELLI: But but, we know that the drugs that we're talking about are cleared by the CENTCOM surgeon for soldiers to be taking when they're downrange. So we're not sending any soldier into harm's way who is taking a drug that we feel would somehow endanger him or others.\n\nAMANPOUR: So now the big picture. Obviously, you've got this human drama. You mentioned already that they're being redeployed at much shorter intervals than many suggest are the correct intervals. For instance, some are saying that for a year in combat you have to have three years in Garrison, at home base. Are you able to do that?\n\nCHIARELLI: That's our goal.\n\nAMANPOUR: Are you able to?\n\nCHIARELLI: No, we're not there yet, but we're going to see ourselves get further, what we call, into balance. The first step for us is getting one year deployed, 24 months at home. That's our first step. We would like to get to one to three, which would be either nine months deployed, 27 months back home or 12 months deployed, 36 months back home. We know when that happens many of the problems that we've seen will in fact meliorate themselves.\n\nAMANPOUR: And how do you make sure you maintain your combat edge, as a military, as a force, and still have these appropriate cares for these people who are obviously coming back stressed and very fragile?\n\nCHIARELLI: You need that time at home. A portion of those 106,000 soldiers that I told you are on some kind of pain medication, it has nothing to do with a behavior health issue.\n\nThere are soldiers who have been on two, three, four deployments, hucking a rucksack filled with equipment that may weigh 70 to 80 pounds at 8,000 feet and they've got a knee injury or a leg injury that is painful. Probably should stay home and get operated on, but they go back for the second deployment and they're on some kind of a pain medication. We have soldiers who suck it up all the time and hide from their leaders when they're hurt.\n\nAMANPOUR: For their country.\n\nCHIARELLI: That's exactly right. Who feel a tremendous need that we all do in the military -- to be with our buddies. That's what it's all about.\n\nAnd that's one of the issues that we have to get through is we try to break down stigma. To get soldiers to understand that these hidden wounds of war are things that they've got to seek help for when they have problems.\n\nAMANPOUR: General Peter Chiarelli, thank you very much indeed for joining us.\n\nCHIARELLI: Thank you.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nSEN. LINDSEY GRAHAM, R-S.C.: Birthright citizenship I think is a mistake.\n\nSEN. MITCH MCCONNELL, R-KY.: This is the kind of thing that irritates Americans quite a lot.\n\nSEN. ARLEN SPECTER, D-PA.: Political pandering on the immigration issue has reached an hysterical (ph) level.\n\nSEN. JEFF SESSIONS, R-ALA.: I don't think the founders understood when (inaudible) the 14th Amendment that it would create a circumstance that people would fly into America from all over the world and have a child.\n\n(END VIDEO CLIP)\n\nAMANPOUR: The debate over the 14th Amendment, which guarantees citizenship to those born in America. One of the topics we'll discuss this morning on our roundtable with Gillian Tett of the Financial Times; Michael Gerson, former Bush speechwriter and Washington Post columnist; George Packer of the New Yorker and John Harris of Politico. George Will is on vacation.\n\nAnd before turning to domestic news, I want to start with Iraq, because we just heard from General Odierno and we know that the drawdown -- President Obama made his speech today reaffirming the drawdown -- rather, this week.\n\nDo you think everybody is taking credit but not giving credit where credit is due?\n\nGERSON: I didn't find the speech a particularly generous search. I mean, this is really the implementation of the status of forces agreement that was agreed to in 2008, under the Bush administration. Barack Obama, people forget, actually voted against funding for the troops. He opposed the surge. He gave a speech without mentioning the surge or General Petraeus. I think that that's probably -- you know, he's attempting to take credit for something that he opposed.\n\nAMANPOUR: The surge, let's face it, has worked up until now. We can see that it's had a huge, huge impact on stability in Iraq, despite a spike in violence. Do you think that it would have been even politically expedient to actually praise the surge? Because the future of Iraq is this president's future.\n\nHARRIS: Well, probably, the more cynical thing to do or the more sort of Machiavellian thing to do for President Obama would have been to lavish credit on President Bush. One of the central parts of Obama's brand, at least when he came into Washington, was that he was a bridge builder and could sort of drain (ph) politics. And he would have therefore sort of cut off the conservative critique, which is out there, that he is leaving too soon, and look gracious in doing so. I don't know, I think that may have just been -- that does not come naturally to him and it might have been a little much to swallow.\n\nAMANPOUR: Let me put up this byte, this little bit of sound from Vice President Biden on this issue.\n\n(BEGIN VIDEO CLIP)\n\nVICE PRESIDENT JOSEPH R. BIDEN JR.: I'm very optimistic about Iraq. I think it's going to be one of the great achievements of this administration.\n\n(END VIDEO CLIP)\n\nPACKER: Yes, it's a bit much. I mean, no one was for the surge. The surge had the support of a tiny group of people in Washington. Basically, the White House and its close allies, and the people in the military. And it stabilized Iraq, along with political developments inside that country. Let's not forget that there was the Sunni awakening. There was Muqtada Al-Sadr's decision to stand down his Shiite militias. So all of those things, the surge took advantage of. It has stabilized. But let's not exaggerate what kind of Iraq we're going to be leaving as we leave in the next year and a half. I mean, we spent $10 billion on that country's electrical system. How many hours a day are there of electricity in Baghdad now? Five hours a day. It's better than it was three years ago; it's still a pretty intolerable level of daily life and violence for ordinary Iraqis.\n\nTETT: And let's not underestimate the costs to the American people. I mean, we are seeing not just the financial costs. It's a human cost too, and I imagine that questions about that actually (ph) are going to keep mounting as we go forward not just in Iraq but Afghanistan as well.\n\nAMANPOUR: Michael?\n\nGERSON: And the next stage is complicated. I mean, we are -- our combat troops are leaving, but the political process is a difficult one, as you discussed earlier. The United States approach has been pretty hands-off. But if a government doesn't form after Ramadan, I think there is going to be a big argument over whether the United States is going to need to use a lot more leverage in this circumstance to try to get a good outcome and not convey that we're cutting and running, that we are no longer interested in Iraq. I think that would be a real mistake.\n\nAMANPOUR: And as we turn to the economy, which is obviously a huge, huge issue for the American people and, of course, people around the world, let's just put up this statistic that has come out this week, that there was a loss of 131,000 jobs, although private-sector jobs rose by 71,000. That's according to the Bureau of Labor Statistics. The unemployment rate remains pretty much the same at 9.5 percent, and there are 14.6 million Americans looking for work.\n\nWhat to say beyond throwing up one's hands? What can be done?\n\nTETT: Well, they're shocking numbers. And I think it's important to realize that what it illustrates is that the president, right now, is at a pretty important juncture point. For the last year, we have had some growth in the American economy, but much of that has been due to government aid, government spending, or what economists call an inventory rebuild. Basically, companies and shops ran down the stocks back in late 2008. They rebuilt them, but that process is kind of finished. And the big question now is, can the economy keep growing if the government doesn't keep pumping in money?\n\nAMANPOUR: The secretary of the Treasury, Tim Geithner, went out earlier this week to talk a lot about the economy and pumping it up. There was an op-ed that he actually penned for the New York Times, and I believe the title was \"Welcome to the Recovery.\" Is that something that he would have liked to have seen as an op-ed title?\n\nHARRIS: Well, the Treasury secretary was put in the same position as a newspaper reporter everywhere when we have to protest, hey, I don't write the headline. He definitely did not write the headline. The people in the Treasury actually saw that as almost -- almost a malicious move. They say it as a sarcastic or even taunting headline.\n\nThe substance of his op-ed in the New York Times was nuanced, saying, look, a lot of people are hurting, but the economy is getting better. And they were very purposeful in wanting to do that. The administration does feel that there is an important psychic element to recovery. They recognize that people do not have confidence. They recognize that many in the business sector believe that Obama is hostile to them, and they are tying to change that perception.\n\nPACKER: Seems like there is a widespread view that we're just entering a period in which growth is very slow and unemployment is very high. And there is not a lot that the private sector is going to be able to do about it, so the real question is, public policy. And there's a big debate in Congress and I think in this upcoming election as to the role of government.\n\nRight now, it seems like a lot of Democrats have joined Republicans in saying, we've done what we can with government spending, and yet there are millions of unemployed people.\n\n(CROSSTALK)\n\nGERSON: Democrats are pretty much at an ideological dead end. The reality is that this week, when Biden addressed these issues, he said the stimulus should have been larger. Pelosi is calling back the Congress to spend more money on public employees. The answer, they have really -- the Democrats in America have one answer, which is more spending, but that's precisely what independents are so concerned about in this upcoming election. Deficits, debt and spending.\n\nSo their economic answer is very much at odds with their political, you know, future here.\n\nTETT: But the problem in a way is that, you know, in a sense also the social contract in America, the American dream is starting to fragment. Because for years, America's prided itself on having an unemployment rate that was a lot lower than Europe's, but it didn't have a social safety net like Europe. Now in a sense it doesn't have a social safety net, and yet shockingly, the unemployment rate is approaching European levels, in some cases actually exceeding it, and that's a real challenge not just in an economic sense, but in a political sense too, about what is the American dream?\n\nAMANPOUR: And what about ingenuity in an economy? In other words, coming up with new ways to sort of spur the economy. Obviously, America and we've all been reading about how it has been losing its competitive edge in manufacturing. What is -- where are the new ideas in generating a new kind of economy that will generate jobs?\n\nPACKER: Well, the stimulus bill was supposed to fund a million new projects in terms of new energy, transportation, et cetera. Maybe we're not seeing the results right now. Maybe we have all become so used to instant analysis and instant results that we are just disappointed prematurely, and we'll see that in a few years, that spending is going to be having an effect in a lot of different parts of the country. But right now, there's just a sense of stagnation, which is truly lethal to the party in power.\n\nTETT: And what's fascinating is that so much of America in the last few decades has been about trying to focus on growing the pie, not worrying about how it is divided up. Because if you keep growing the pie, through innovation, through private-sector enterprise, then you don't have to worry about social equity and things like that. But if we are entering a period when the pie is stagnant, the question is going to be very political (ph), how do you divide that pie up?\n\nAMANPOUR: And political, what is this going to do for these upcoming elections?\n\nHARRIS: I think the larger sort of anemic state of the economy almost makes the traditional things that political reporters obsess about -- what is the message, what is the campaign strategy, where are they going to put the resources, almost makes them all irrelevant. An unemployment rate nearly 10 percent is the dominant fact. And the fact that there don't seem to be good policy remedies out there, and the Obama administration does indeed seem at somewhat loose ends as to what its next step is, that just makes it a very, very tough climate, and really makes all the other kind of tactical questions almost irrelevant.\n\nTETT: And poisonous as well. I mean, you really are starting to see the beginnings of a sort of a culture of hate, of finger-pointing, of scape-goating, and that could fuel the way for some very nasty, very negative politics going forward.\n\nAMANPOUR: And is it going to, you know, obviously the Obama administration wants to use the word choice coming up to this election, there is a choice between what we're doing and what the previous administration did. How is that going to play out? Because obviously a lot of the structural issues right now started in the previous administration?\n\nGERSON: I think some of that is true. But the reality is that the decisions that are made by current job creators about whether to invest in plants and equipment are decisions that are made about current events, not about two years ago. And right now, entrepreneurs see endless deficits and likely much higher taxes. A pretty hostile environment for investment in America. That is going to have to be turned around. You can't create jobs at a level we need in this economy without about a 4 percent growth rate, which is twice what we have now. And you know, politicians are going to have to step forward and say, how are we going to get growth?\n\nPACKER: I would add that it's been a somewhat one-sided ideological argument. The Republican Party has been united, vociferous and simple and clear in its message about what they don't want. And yet the Obama administration has been I think almost reluctant to say what they do want and what principles underlie it. They don't like to argue philosophically, unlike, say, Reagan, whom Obama has said good things about in the past. And that's left them exposed to the ideological arguments of the other side without being able to tell the country, here are the principles and the values and the reasons why the stimulus bill, the health care bill, the financial reform bill were all essential to correcting the failed philosophy of the last administration. They don't like to talk that way. And I'd say it's left them exposed in the fall elections.\n\nAMANPOUR: Let's move on to another issue, which was and has been a big issue this week, and that's the debate over 14th Amendment. We just saw clips from various political leaders talking about potentially having hearings on changing the Constitution.\n\nMichael, you have written about this, and I think you were very shocked that this is coming out of the Republicans right now.\n\nGERSON: Not just the Republicans, but you have Lindsey Graham, who has really been the voice of humanity (ph) and reform in immigration reform, and John McCain, who has changed his views in a very tough primary in this case. So the biggest defenders of the essentially pro-immigrant message in the Republican Party are turning for political reasons. That shows how powerful it is within the party, which I think it's bad in the long term for the Republican Party.\n\nOn this issue in particular, it's terrible policy. I mean, I think few constitutional scholars will disagree with that, but it's terrible politics for the Republican Party. Not in this election, but really decades down the road, appealing to the, you know, largest growing group of voters in America.\n\nAMANPOUR: And just so that we're clear, just describe for us exactly what the 14th Amendment was. It was to protect the children of African-American slaves who were born here.\n\nPACKER: It made them citizens. It gave them equal rights and due process under the Constitution. It's foundational. I mean, you could argue that along with the free expression amendments of the Bill of Rights, it's the most important constitutional amendment there is, and for the constitutionalist party, a party who has really become captive to a movement that wants to go back to a minimal reading of the Constitution and for government to do very little else, it's very strange that they should be tinkering with a sacred constitutional amendment.\n\nHARRIS: Also, Christiane, I would say it undercuts Republicans' own message. They said look, Arizona needed to act, right now, because there's a tangible problem right now and the federal government wasn't acting. Talking about the 14th Amendment is not serious politics. I mean, it would take years for a constitutional amendment to get passed. I mean, it's truly 100 percent symbolic politics.\n\n(CROSSTALK)\n\nTETT: ... quick fix sound byte politics and this culture of hate, and this, you know, scape-goating that's going on right now.\n\nAMANPOUR: Well, let's show some pictures. Actually, I wanted to ask you because there's a European connection to all of this as well. There has been protests in France, and President Sarkozy, who likes to call himself Sarko the American, has come out with some rather terrifying ideas about sending back foreign-born citizens if they're convicted of any crimes, about putting all sorts of anti-Muslim cultural crimes that he would use as a basis for sending them back.\n\nTETT: You only have to go back to the era of the great crash, the Great Depression, to see what happens when you have a period of profound ...economic dislocation and pain, and people start putting up barriers and pointing the fingers. And there's a risk that is now the era we're entering.\n\nGERSON: And that is the wisdom of the authors of the 14th Amendment. They essentially wanted to take this very, very difficult issue -- citizenship -- outside the political realm. They wanted to have an objective standard, birth, instead of a subjective standard, which is the majorities at the time. I think it's a much better way to deal with an issue like this.\n\nHARRIS: In fairness, one argument you could make, Michael, is that immigration reform is never going to happen unless this issue is really at a boil, and so perhaps that's what Lindsey Graham is doing. OK, let's turn this up to a boil and--\n\n(CROSSTALK)\n\nGERSON: -- cynical approach, to essentially take an issue this sensitive and this symbolic, and use that as way to leverage other political reform. I think that would be really cynical.\n\nPACKER: And I think a question -- something I'm looking for is how many Republicans and conservatives like Michael are going to stand up on this. Because what we've seen over the last year and a half on issue after issue is the more extreme tendencies in the Republican Party have been the loudest and have dominated the party's public posture. And few Republican leaders have been willing to distinguish themselves from it, because they pay a price.\n\nAMANPOUR: You've just written an article in the New Yorker this week about what you call the broken Senate. What exactly do you mean? We've got a quote from the article and then I want you to explain what you basically found there. That the Democratic class of 2008 arrived with President Obama, expecting to usher in a dynamic new era. Instead, their young Senate careers have passed in a daily slog of threatened filibusters and secret holds -- when a senator anonymously objects to bringing an appointment up for a vote, which requires unanimous consent.\"\n\nPACKER: Historically, the Senate has been the slower-moving of the two houses. The famous and maybe apocryphal story is that Jefferson asked Washington, why do we need a Senate? And Washington said, why did you pour your coffee from the cup into the saucer? And Jefferson said, to cool it. And Washington said, that's why we need the Senate, to cool the hotter, more impulsive passions of the people's chamber.\n\nBut right now, the Senate is -- it's gelatinous, it's stagnant. It -- I spent weeks sitting in the press gallery and wandering the halls and talking to senators. I sort of approached it as a newcomer. What goes on here? What are the customs, what are the rules? How do people treat each other? How much time do they spend having lunch together? How much time do they spend fund-raising? What I learned was, everything happens there except deliberation. And this is supposed to be the world's greatest deliberative body.\n\nAMANPOUR: And yet, quite a lot of legislation, quite a lot of big bills and laws have gone through.\n\nGERSON: I think you can argue with something like the health care reform that the Senate did exactly what it was supposed to do. It passed the bill, but it moderated it in some key ways, that I think took care of some of the worst excesses. That's what the Senate is supposed to do. And I think that some of these other issues like cap-and-trade and immigration, the reason they're not passing is not because the Senate is dysfunctional. It's because we don't have a national consensus on those issues.\n\nPACKER: Those are the big, big bills that get public attention, but daily life in the Senate, even on health care for example -- there was one moment in December when it was coming up for a vote, and in order to delay it as close as possible to Christmas, just to be a pain, the Republicans decided to filibuster a military spending bill -- imagine, during two wars, military spending was going to be held up in the Senate. And one Republican in particular, Thad Cochran, who didn't want to filibuster it because he wanted the money to go out, finally had to cave in because his leadership told him, we need your vote for the filibuster. That's daily life in the Senate, where senators aren't even really thinking and acting on their own.\n\nAMANPOUR: You quoted a lot of senators as sort of bemoaning glorious yesteryear where everybody was congenial and collegial and eating and drinking and basically doing deals together. This is what Senator Mitch McConnell said in response to your article.\n\n(BEGIN VIDEO CLIP)\n\nMCCONNELL: I don't see the same, David, Senate, that this New Yorker author sees. Some of my best friends are Democrats. Chris Dodd, Harry Reid. I don't think we have a collegiality problem. What we are in the middle of is a great debate about the future of the country.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Last word to all of you.\n\nHARRIS: He said \"that New Yorker author\" as though he was taking out the trash.\n\n(CROSSTALK)\n\nHARRIS: I mean, it was a great portrait of how sullen, snarling the Senate is.\n\nAMANPOUR: Is it about a huge debate over the future of the country?\n\nGERSON: I think we're having a major debate about the role and size of government, and the Senate is going to reflect that.\n\nTETT: And it's not just about the future of the country. It's about whether the government that has the machinery in place to actually solve the most pressing problems, be that unemployment or Iraq.\n\nPACKER: Like Wall Street, our political institutions are decadent and it's because of failure of elites to restrain themselves and behave in a larger interest.\n\nAMANPOUR: And we'll continue this discussion and the roundtable in the green room on abcnews.com/this week, where you can also find our fact checks in conjunction with PolitiFact.", "images": ["http://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/null", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "http://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/null", "keywords": [], "authors": ["Abc News", "January", "Min Read"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "title": "'This Week' Transcript: Odierno and Chiarelli", "meta_data": {"description": "Transcript of 'This Week' interview with Generals Ray Odierno and Peter Chiarelli", "keywords": "this week, christiane amanpour, iraq, militayr, suicide, army, odierno, chiarelli", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Odierno and Chiarelli", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "title": "'This Week' Transcript: Odierno and Chiarelli", "description": "Transcript of 'This Week' interview with Generals Ray Odierno and Peter Chiarelli", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2010-08-11T16:09:16Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,11351927", "ipad": "abcnewsipad://link/story,11351927", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Odierno and Chiarelli", "description": "Transcript of 'This Week' interview with Generals Ray Odierno and Peter Chiarelli", "url": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,11351927", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,11351927", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}