{"url": "https://people.com/movies/edward-nortons-production-company-sued-over-fire/", "text": "Edward Norton’s company is being sued by residents of a building destroyed in a fire last week which tragically killed a firefighter.\n\nOn Tuesday, as friends and family attended the funeral of the firefighter killed in the blaze, two residents filed a suit against the actor’s production company, Class 5 Films, and the owner of the apartment building, Vincent Sollazzo-Lampkin, after they claimed the production company knew about the fire that had broken out but did not warn residents.\n\nGet push notifications with news, features and more.\n\nThe company and the building owner are being sued for $7 million, according to court documents obtained by The Blast.\n\nIn a statement provided to PEOPLE at the time, the film’s producers said their crew noticed smoke and immediately began alerting the residents of the building.\n\n“Our production was towards the end of our working day and had dozens of people working on site, when our crew noticed that smoke was coming into our set and into other parts of the building from below us,” read the statement. “As soon as we noticed smoke coming up into our set, our crew immediately alerted the fire department and began alerting residents of the building even as we evacuated our cast and crew.”\n\nThe production company had not been served with the lawsuit by the deadline, so was unable to comment.\n\nImage zoom Edward Norton Jon Kopaloff/FilmMagic\n\nErica and George Cruz filed the suit claiming the production company kept “highly flammable equipment” in the basement of their Harlem building while filming Motherless Brooklyn. The two also claimed that representatives of Class 5 Films were aware of the fire that broke out on March 22 but did not let residents of the building know.\n\n“When representatives of Class 5, Inc. became aware of the fire, they did not warn the tenants in the building… in fact, they misled the tenants into believing there had been a fire that had been extinguished,” the complaint states.\n\nSollazzo-Lampkin’s attorney, Geovanny Fernandez, did not immediately respond to a request for comment.\n\nThe Cruzes’ apartment building was completely destroyed, causing them to be displaced and lose multiple personal items such as clothes, important documents and the loss of their rent-controlled apartment, their lawsuit says.\n\nThe fire allegedly exacerbated Erica’s asthma and caused her severe emotional distress as well as post-traumatic stress disorder and nightmares.\n\nThe Cruzes also claim the fire was caused by “reckless, careless and negligent” maintenance of the building such as failing to have fire extinguishers or working smoke detectors.\n\nIn a statement provided to PEOPLE at the time, the film’s producers offered “deepest condolences” to the family of Michael R. Davidson, who lost his life.\n\n“Our production was towards the end of our working day and had dozens of people working on site, when our crew noticed that smoke was coming into our set and into other parts of the building from below us,” read the statement. “As soon as we noticed smoke coming up into our set, our crew immediately alerted the fire department and began alerting residents of the building even as we evacuated our cast and crew.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\n“To our great sorrow, we now know that a NYC firefighter lost his life battling the blaze that grew, and our hearts ache in solidarity with his family,” the statement read. “New York City firefighters truly are the bravest in the world. We watched firsthand with astonishment as they charged into the smoke to make sure all were safely out and then fought to contain the blaze and prevent it from spreading, putting their lives on the line as they do every day. The FDNY are real-life super-heroes and have our boundless admiration and gratitude.”\n\nNew York City firefighters responded to the scene of the massive 5-alarm fire and Michael R. Davidson was killed as he helped to put out the fire.\n\nThe 37-year-old father of four was critically injured on the scene and “transported to Harlem Hospital where he succumbed to his injuries,” FDNY officials wrote on Facebook early Friday morning.\n\nImage zoom The site where the fire broke out in Harlem, New York City PacificCoastNews\n\n“It is with deep regret that FDNY announces the death of Firefighter Michael R. Davidson,” they added on Twitter — both social media posts coming with a photo of the late firefighter, who they say was “cited for bravery on four separate occasions.”\n\nDavidson has “bravely served the Department for 15 years” and is “the 1,150th member to make the Supreme Sacrifice while serving our city,” the FDNY wrote.\n\nImage zoom Michael R. Davidson was a firefighter who died after sustaining critical injuries in the fire FDNY/Twitter\n\nHe is survived by his wife Eileen and their four children — who, per a tweet from NYC Councilmember Mark D. Levine, are ages 7, 6, 3, and 1. Davidson’s father and brother are also firefighters.\n\nNorton was filming earlier in the building for the 1950s-set drama, based on a book of the same name by Jonathan Lethem. The area in which the film was shooting was unoccupied.\n\nThe movie — which Norton also stars in alongside Bruce Willis, Alec Baldwin, Bobby Cannavale, Leslie Mann and Willem Dafoe — tells the story of a private detective with Tourette’s Syndrome who seeks to solve the murder of his mentor and only friend.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1633&h=855&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-11.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-11.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fmichael-davidson.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1633&h=855&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-11.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/movies/edward-nortons-production-company-sued-over-fire/", "title": "Edward Norton's Production Company Sued for $7 Million After Tragic Harlem Fire Left 1 Dead", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrities,Edward Norton,Lawsuit,Movie Celebrities,Movie News,News", "news_keywords": "Celebrities,Edward Norton,Lawsuit,Movie Celebrities,Movie News,News", "description": "Edward Norton's production company, Class 5 Films, was sued on Tuesday for $7 million over the fire in an apartment in Harlem, New York City", "og": {"title": "Edward Norton's Production Company Sued for $7 Million After Tragic Harlem Fire Left 1 Dead", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/edward-nortons-production-company-sued-over-fire/", "description": "Edward Norton’s&nbsp;company is being sued by residents of a building destroyed in a fire last week which tragically killed a firefighter. On Tuesday, as friends&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1633&h=855&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-11.jpg", "width": 1633, "height": 855}}, "pinterest": {"url": "https://people.com/movies/edward-nortons-production-company-sued-over-fire/", "description": "Edward Norton's production company, Class 5 Films, was sued on Tuesday for $7 million over the fire in an apartment in Harlem, New York City", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-11.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/edward-nortons-production-company-sued-over-fire/", "title": "Edward Norton's Production Company Sued for $7 Million After Tragic Harlem Fire Left 1 Dead", "description": "Edward Norton's production company, Class 5 Films, was sued on Tuesday for $7 million over the fire in an apartment in Harlem, New York City", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1633&h=855&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fedward-norton-fire-11.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}