{"url": "https://web.archive.org/web/20010609190032/http://www.fuelgaugereport.com:80/index.asp", "text": "Select A Market Akron- OH Albany-Schenectady-Troy- NY Albuquerque- NM Allentown-Bethlehem-Easton- PA Amarillo- TX Anchorage- AK Ann Arbor- MI Asheville- NC Atlanta- GA Atlantic-Cape May- NJ Augusta-Aiken (GA only)- GA Austin-San Marcos- TX Bakersfield- CA Baltimore- MD Bangor- ME Barnstable-Yarmouth- MA Baton Rouge- LA Beaumont-Port Arthur- TX Bellingham- WA Benton Harbor- MI Bergen-Passaic- NJ Billings- MT Biloxi-Gulfport-Pascagoula- MS Binghamton- NY Birmingham- AL Bismarck- ND Bloomington- IN Bloomington-Normal- IL Boise City- ID Boston (MA only)- MA Boulder-Longmont- CO Bremerton- WA Bridgeport- CT Buffalo-Niagara Falls- NY Burlington- VT Canton-Massillon- OH Casper- WY Cedar Rapids- IA Champaign-Urbana- IL Charleston- WV Charleston-North Charleston- SC Charlotte-Gastonia-Rock Hill (NC only)- NC Charlottesville- VA Chattanooga (TN only)- TN Cheyenne- WY Chicago- IL Chico-Paradise- CA Cincinnati (OH only)- OH Clarksville-Hopkinsville (TN only)- TN Cleveland-Lorain-Elyria- OH Coeur D' Alene- ID Colorado Springs- CO Columbia- MO Columbia- SC Columbus- OH Columbus (GA only)- GA Corpus Christi- TX Covington- KY Cumberland (MD Only)- MD Dallas- TX Danville- IL Davenport-Moline-Rock Island (IA only)- IA Davenport-Moline-Rock Island (IL only)- IL Dayton-Springfield- OH Daytona Beach- FL Decatur- IL Denver- CO Des Moines- IA Detroit- MI Dover- DE Duluth-Superior (MN only)- MN East Saint Louis- IL Eau Claire- WI El Paso- TX Erie- PA Eugene-Springfield- OR Evansville-Henderson (IN only)- IN Fairbanks- AK Fargo-Moorhead (ND only)- ND Fayetteville- NC Fayetteville-Springdale-Rogers- AR Flagstaff- AZ Flint- MI Fort Collins-Loveland- CO Fort Myers-Cape Coral- FL Fort Smith (AR only)- AR Fort Wayne- IN Fort Worth-Arlington- TX Fresno- CA Gainesville- FL Galveston-Texas City- TX Gary- IN Grand Forks (ND only)- ND Grand Island- NE Grand Junction (CO only)- CO Grand Rapids-Muskegon-Holland- MI Great Falls- MT Green Bay- WI Greensboro--Winston-Salem--High Point- NC Greenville-Spartanburg-Anderson- SC Hagerstown- MD Harrisburg-Lebanon-Carlisle- PA Hartford- CT Hilo- HI Honolulu- HI Houston- TX Huntington-Ashland (KY only)- KY Huntsville- AL Indianapolis- IN Jackson- MI Jackson- MS Jacksonville- FL Janesville-Beloit- WI Johnson City-Kingsport-Bristol (TN only)- TN Juneau- AK Kansas City (KS only)- KS Kansas City (MO only)- MO Knoxville- TN La Crosse (WI only)- WI Lafayette- LA Lake Charles- LA Lancaster- PA Lansing-East Lansing- MI Las Cruces- NM Las Vegas (NV only)- NV Lawrence- KS Lewiston-Auburn- ME Lexington- KY Lincoln- NE Little Rock-North Little Rock- AR Los Angeles-Long Beach- CA Louisville (KY only)- KY Macon- GA Madison- WI Manchester- NH Medford-Ashland- OR Memphis (TN only)- TN Merced- CA Miami- FL Middlesex-Somerset-Hunterdon- NJ Milwaukee-Waukesha- WI Minneapolis-St. Paul (MN only)- MN Missoula- MT Mobile- AL Modesto- CA Monmouth-Ocean- NJ Montgomery- AL Myrtle Beach- SC Nashville- TN Nassau-Suffolk- NY New Haven-Meriden- CT New London-Norwich (CT only)- CT New Orleans- LA New York- NY Newark- NJ Norfolk- NE Norfolk-Virginia Beach-Newport News- VA North Platte- NE Oakland- CA Oklahoma City- OK Olympia- WA Omaha (NE only)- NE Orange County- CA Orlando- FL Owensboro- KY Parkersburg-Marietta (WV only)- WV Pensacola- FL Peoria-Pekin- IL Philadelphia (PA only)- PA Phoenix-Mesa- AZ Pine Bluff- AR Pittsburgh- PA Pittsfield- MA Pocatello- ID Portland- ME Portland-Vancouver (OR only)- OR Portsmouth-Rochester (NH only)- NH Providence-Fall River-Warwick (RI only)- RI Provo-Orem- UT Pueblo- CO Quincy- IL Raleigh-Durham-Chapel Hill- NC Rapid City- SD Reading- PA Redding- CA Reno- NV Richland-Kennewick-Pasco- WA Richmond-Petersburg- VA Riverside-San Bernardino- CA Roanoke- VA Rochester- MN Rochester- NY Rockford- IL Sacramento- CA Saginaw-Bay City-Midland- MI Salem- OR Salinas- CA Salisbury- MD Salt Lake City-Ogden- UT San Antonio- TX San Diego- CA San Francisco- CA San Jose- CA San Luis Obispo-Atascadero-Paso Robles- CA Santa Barbara-Santa Maria-Lompoc- CA Santa Cruz-Watsonville- CA Santa Fe- NM Santa Rosa- CA Savannah- GA Scranton--Wilkes-Barre--Hazleton- PA Seattle-Bellevue-Everett- WA Shreveport-Bossier City- LA Sioux City (IA only)- IA Sioux Falls- SD South Bend- IN Spokane- WA Springfield- IL Springfield- MO Springfield- MA St. Cloud- MN St. Joseph- MO St. Louis (MO only)- MO Steubenville-Weirton (WV only)- WV Stockton-Lodi- CA Syracuse- NY Tacoma- WA Tallahassee- FL Tampa-St. Petersburg-Clearwater- FL Terre Haute- IN Texarkana (AR only)- AR Texarkana (TX only)- TX Toledo- OH Topeka- KS Traverse City- MI Trenton- NJ Tucson- AZ Tulsa- OK Tuscaloosa- AL Utica-Rome- NY Vallejo-Fairfield-Napa- CA Vancouver- WA Ventura- CA Visalia-Tulare-Porterville- CA Wailuku- HI Washington (DC only)- DC Washington (MD only)- MD Waterloo-Cedar Falls- IA West Palm Beach-Boca Raton- FL Wheeling (WV only)- WV Wichita- KS Wilmington- NC Wilmington-Newark (DE only)- DE Yakima- WA Yolo- CA York- PA Youngstown-Warren- OH Yuba City- CA Yuma- AZ Prices updated: 6/11/2001 2:38:02 AM Data provided in cooperation with OPIS Energy Group and Wright Express, LLC Media are encouraged to localize fuel price stories by contacting their local AAA club media representative. National Unleaded Average\n\n\n\nRegular Mid Premium Diesel Current Avg. $1.674 $1.777 $1.841 $1.593 Yesterday Avg. $1.681 $1.784 $1.849 $1.595 Month Ago Avg. $1.706 $1.811 $1.876 $1.563 Year Ago Avg. $1.594 $1.692 $1.732 $1.501 *Prices are in US dollars per gallon\n\nHighest Recorded Price:\n\nRegular Unl. $1.718 5/15/2001 DSL. $1.702 10/19/2000 12 Month Average For Regular Unleaded\n\nAAA Fuel Gauge data may be used on a daily basis by news media Web sites, but should include attribution to AAA, the display of AAA's logo and a link to www.aaa.com. AAA's logo can be found in the \"About AAA\" section of the AAA NewsRoom. AAA's Daily Fuel Gauge Report is the most comprehensive retail gasoline survey available. Everyday over 60,000 self-serve stations are surveyed. © Copyright 2001, Oil Price Information Service", "images": ["https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/linefade.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/dfgr.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/sbs1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/natavg1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/summary.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/local1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/clubs1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/Nat_grph.jpg", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/natl1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/method1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/hook.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/moving1.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/aaalogo.gif", "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/metroavg.gif"], "top_img": "https://web.archive.org/web/20010609190032im_/http://www.fuelgaugereport.com/images/Nat_grph.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}