{"url": "https://web.archive.org/web/20180404213219/http://www.americatb.com:80/2018/03/29/breaking-trump-just-ended-welfare-for-one-huge-group-for-5-years-let-the-riots-erupt/", "text": "318 SHARES Share Tweet\n\nPresident Trump is about to end the longstanding abuse of the American welfare system and ban migrants from getting free money and handouts for five years. The immigration rules will prohibit migrants from coming to the country and taking advantage of free American welfare money right away. It will slow down, or stop, chain migration while protecting American workers and potentially saving taxpayers money.What used to happen is that people would migrate to America and just live on the free money they received. That’s called welfare abuse. America is open to migrants, but perhaps we don’t want migrants who can’t fend for themselves. Maybe it’s better if people who are self-sufficient migrate to the country so that we can reduce the amount of citizens living off the system.President Trump wants to introduce a merit-based Green card system in which migrants compete for Visas. Migrants can earn points for themselves by learning to speak English, gaining job training or job offers, or doing something else that is considered a benefit to the America. The idea seems to be that in order for America to grant Visas or citizenship, the migrant has to give something back to the country. It’s as though the government wants to stop people coming to America and living off the system and would prefer people coming to the country to be contributors. Do something for America and America will do something for you.Migrants to those countries must compete for a limited number of visas by gaining points for English proficiency, competitive training, a job offer or another major achievement that benefits the host country.The concept, which is modeled after similar programs from Australia and Canada, is taking harsh criticism from activists. It’s like they want an open border policy where everyone gets free welfare money, but that would just be the downfall of America. If we observe what’s happening in Germany, with Merkel’s “come on in” policy, then we see a mass increase in horrible crimes like gang rape. Do we want mass amounts of migrant gang rape in America? There’s already enough trouble with crime in sanctuary cities that protect illegal immigrant criminals. Those folks should be deported because of their bad behavior and often violent crimes they commit on American people and even other immigrants.If America prevents immigrants from getting free benefits for five years, then that makes people think twice about coming here. If a family who thinks about crossing the border to start a new life knows that they cannot live for free, then they may not come at all. If they have possible jobs lined up and will be almost instantly integrating successfully with society, then that’s a great match. America is the land of the free, but not the land of the free money.Migrants who enter the United States cannot receive welfare during their first five years in the country, President Trump revealed from his upcoming immigration overhaul.“Just this week, we announced a historic immigration bill to create a merit-based Green Card system that ends the abuse of our welfare system, stops chain migration, and protects our workers and our economy,” he stated on his weekly radio address. “As an example, you cannot get welfare for five years when you come into our country.”“You cannot just come in like in past weeks, years, and decades, you come in immediately and start picking up welfare. For five years, you have to say you will not be asking or using our welfare systems.”Compare that to Germany, where Chancellor Angela Merkel opened the border to millions of unvetted migrants who can’t speak German and lack employable skills, which dooms them to perpetual welfare paid by German taxpayers – and boredom that manifests into terrorist attacks against, once again, German taxpayers.Last year the German government admitted that only 2.8% of over 1.2 million migrants had gotten a job – but even then those statistics might be exaggerated, according to journalist Chris Menahan.“They said back in July only 55 out of one million migrants had got jobs with any major firms and 50 of those jobs were working at the post office,” he reported. “Two-thirds or more of these migrants are illiterate in their own languages.”“They came because Merkel promised them free money if they can just make it into the country.”What in tarnation would be a good reason for any country to accept illiterate people who don’t work? There is literally no benefit to the host country to admit people like that. I know it sounds mean to say this, but they don’t offer anything to the country other than leeching the system of funds and it’s a complete downgrade to the population. If you let too many low illiterate people into the country, then they have kids who could be illiterate, then over time, it would only decrease the overall intelligence of the country and civilization in America would suffer. We need hard working and intelligent people who bring promise and productivity to further the advancement of Americans and mankind. That sounds like quite a stretch but think of the impact of accepting one million people who mostly can’t read or don’t work.Now the government has to pay for them.Let’s say one million immigrants each get $30,000 worth of welfare benefits per year. That’s $30,000,000,000 of free welfare money sucked out of the American budget for people who put NOTHING back into our society, culture, or anything at all. That is literally a $0.00 return on investment. Not that people are a business, but that’s really bad business. And as you can see, Germany has turned into a cesspool from all the migrants flooding the gates and ruining their nation.Prepare for a massive backlash from liberals, democrats, and activists. There’s sure to be protests regarding Trump’s potential immigration policy.FOLLOW us on Facebook at Freedom Daily!", "images": ["https://web.archive.org/web/20180404213219im_/http://2.gravatar.com/avatar/8277f7285c5c1e5148e5bfdc18db894a?s=80&d=mm&r=g", "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/trump-welfare-riots-main-1200x630.jpg", "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/trump-welfare-riots-main-1200x630-678x381.jpg", "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/enVolve-POLL-Death-Penalty-4-Men-Rape-9-Girl1-800x445-800x4001-1-80x60.jpg", "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/Lexi3redo-678x356-80x60.jpg", "https://web.archive.org/web/20180404213219im_/http://2.gravatar.com/avatar/217465c479487a26550c6fe4adac1ff4?s=80&d=mm&r=g"], "top_img": "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/trump-welfare-riots-main-1200x630.jpg", "keywords": [], "authors": ["Hal Lemoyne", "Phil Hansen", "Virginia Jewell", "John Zagar"], "canonical_link": "https://web.archive.org/web/20180404213219/http://www.americatb.com/2018/03/29/breaking-trump-just-ended-welfare-for-one-huge-group-for-5-years-let-the-riots-erupt/", "title": "BREAKING: Trump Just Ended Welfare For One HUGE Group For 5 Years! – Let The Riots ERUPT!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"type": "article", "title": "BREAKING: Trump Just Ended Welfare For One HUGE Group For 5 Years! – Let The Riots ERUPT!", "description": "President Trump is about to end the longstanding abuse of the American welfare system and ban migrants from getting free money and handouts for five years. The immigration rules will prohibit migrants from coming to", "image": {"identifier": "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/trump-welfare-riots-main-1200x630.jpg", "width": 1200, "height": 630}, "url": "https://web.archive.org/web/20180404213219/http://www.americatb.com/2018/03/29/breaking-trump-just-ended-welfare-for-one-huge-group-for-5-years-let-the-riots-erupt/", "site_name": "America", "updated_time": "2018-03-29T19:59:36+00:00"}, "article": {"published_time": "2018-03-29T19:59:36+00:00", "modified_time": "2018-03-29T19:59:36+00:00"}, "twitter": {"card": "summary_large_image", "title": "BREAKING: Trump Just Ended Welfare For One HUGE Group For 5 Years! – Let The Riots ERUPT!", "description": "President Trump is about to end the longstanding abuse of the American welfare system and ban migrants from getting free money and handouts for five years. The immigration rules will prohibit migrants from coming to", "image": "https://web.archive.org/web/20180404213219im_/http://www.americatb.com/wp-content/uploads/2018/03/trump-welfare-riots-main-1200x630.jpg"}, "generator": "WordPress 4.9.5", "fb": {"pages": 1908815082670402}, "ia": {"markup_url": "http://www.americatb.com/2018/03/29/breaking-trump-just-ended-welfare-for-one-huge-group-for-5-years-let-the-riots-erupt/?ia_markup=1"}}, "movies": [], "publish_date": 1522252800.0, "source": "https://web.archive.org", "summary": ""}