{"url": "https://www.hollywoodreporter.com/features/johnny-depp-a-star-crisis-insane-story-his-missing-millions-1001513", "text": "What happened to $650 million? An explosive legal battle between one of Hollywood's best-paid actors and the business managers he fired has laid bare tumultuous finances, outrageous spending and troubling behavior on Disney's new 'Pirates' movie in a case that could even change how the industry does business.\n\nEarly one afternoon in October 2012, Jake Bloom and Joel Mandel left their respective Beverly Hills offices, slipped into their luxury cars and embarked on the roughly 30-minute journey to the Hollywood Hills compound of their client, Johnny Depp. Bloom was a rumpled and graying lawyer whose disheveled style camouflaged an intellect exercised on behalf of such luminaries as Martin Scorsese and Sylvester Stallone. Mandel, then in his early 50s, was a tall, rather amiable accountant who favored loose-fitting jeans and looser-fitting shirts, sartorial code designed to assure his clients he was just another boy in their band as well as a top-flight business manager steeped in the arcana of arbitrage and amortization.\n\nBoth men had been close to Depp for years. Bloom, indeed, was such a confidant to the actor that he had even joined him for an induction ceremony into the Comanche nation when he played Tonto in The Lone Ranger; as for Mandel, he had accompanied Depp to his three-island property in the Bahamas, atolls Mandel had helped his client buy for a total of $5.35 million.\n\nThese men were part of Depp's inner circle, at least as far as any lawyer or accountant could belong to the inner circle of an artist this mercurial, one with a skull-and-crossbones tattoo on his leg and \"Death is certain\" scrawled beneath it, whose soul mates were such creative titans as Marlon Brando, Keith Richards and Hunter S. Thompson — the journalist whose ashes Depp fired from a cannon hauled to the top of a 153-foot tower, a tribute for which the actor says he paid $5 million.\n\nLeaving their cars that day, the advisers approached one of Depp's five houses on a dead-end stretch of North Sweetzer Avenue. A modernist affair that was simply referred to as 1480, the building had been converted into a recording studio and was an appendage to an eight-bedroom, castle-like mansion once owned by music producer Berry Gordy. One of the star's two omnipresent assistants led the men in, past a painting that British artist Banksy had created for Depp, and into a den, where the actor was leaning back in a slightly battered chair, surrounded by dozens upon dozens of classic guitars.\n\nAfter the obligatory small talk, the visitors got to the point: Depp's cash flow had reached a crisis point, they declared. Even though the star had become wildly wealthy (later, Mandel would claim Depp earned more than $650 million in the 13-plus years he had been represented by The Management Group, the company Mandel had started in 1987 with his brother Robert), there just wasn't enough liquid money to cover Depp's $2 million in monthly bills.\n\nWithout a fire sale, Depp — then arguably the biggest star in Hollywood and certainly one of the best paid, thanks to the Pirates of the Caribbean franchise — would never be able to meet his obligations. Not the payments on his portfolio of real estate around the world. Not the impulse purchases such as the three Leonor Fini paintings he had bought from a Manhattan gallery (the first two for $320,000, the third as a $245,000 gift for then-girlfriend Amber Heard). Not the $3.6 million he paid annually for his 40-person staff. Not the $350,000 he laid out each month to maintain his 156-foot yacht. And not the hundreds of thousands of dollars he paid to sustain his ex-partner, Vanessa Paradis, and their children, Lily-Rose and Jack.\n\nMandel dug into his briefcase for a one-page summary he had prepared, but Depp waved it away. Still, after three hours, the actor agreed to a compromise: He would sell his beloved Amphitrite, the yacht he had bought for $10 million and spent $8 million renovating, where he'd hosted such friends as Brad Pitt and Angelina Jolie.\n\nWith his consent in place, Bloom and Mandel said their goodbyes, stepped out of the house and breathed a sigh of relief. The city stretched before them. The bright light that had bathed it when they arrived was fading and would soon give way to night.\n\nThat exchange, the start of an increasingly fraught relationship between the star and his team, would culminate in the 2016 firing of Mandel and Depp's longtime agent, United Talent Agency's Tracey Jacobs, along with a $25 million lawsuit filed Jan. 13 by Depp against the Mandels' TMG, accusing them of fraud and mismanagement, among other things.\n\nTMG has since countersued, alleging that Depp, now 53, failed to pay its commission on his income from the upcoming Pirates of the Caribbean: Dead Men Tell No Tales and painting a portrait of an out-of-control movie star, reeling from a nasty split from Heard and used to spending freely, including $30,000 a month on wine. The Mandels seek a court declaration that \"Depp is responsible for his own financial waste\"; Depp's side wants them to pay him millions, claiming they served as lawyers as well as accountants and therefore — if Depp's interpretation of a California statute is correct — had no right to a percentage of his earnings without a proper contract.\n\nThe lawsuits, along with multiple interviews conducted by THR, indicate that Depp's capricious behavior and poor decision-making placed him in a serious financial bind, which paved the way for the rupture with his closest advisers. (All declined to comment; while Bloom has not been fired, he has had no contact with Depp for months.)\n\nIt is unclear how the actor's problems have impacted his relationship with his sister, Christi Dembrowski, a longtime conduit to her brother and head of his production company who selected Mandel in the late 1990s as one of three potential business managers for Depp to interview. Dembrowski allegedly received $7 million in \"loans\" as TMG managed Depp's estate. She, like Depp, did not respond to requests for comment.\n\nThe unfolding legal battle could shake some of Hollywood's most established business traditions. Depp's new attorney is challenging the common practice of lawyers taking a percentage of their clients' earnings without a written contract. If the suit is successful, it could open the door to a host of similar challenges.\n\nAll this comes as Walt Disney Studios prepares for the May 26 release of its latest Pirates movie, the fifth in the series. Studio execs worry that Depp's personal peccadilloes could impact the marketing of their $230 million-budget tentpole and future of a $3.7 billion box-office franchise. Six years have passed since the last Pirates installment earned more than $1 billion globally, and Depp's most recent big-budget vehicle, Alice Through the Looking Glass, lost hundreds of millions of dollars for Disney; now it's betting that the star's private struggles won't sink this movie, too.\n\nDepp's demons — which seemed to surface in November 2014, when he appeared to be inebriated while presenting at the Hollywood Film Awards — became public when he was living in Australia for Pirates 5. Filming ran from February until July 2015, a span during which allegations of conflict between him and Heard spilled into the Australian tabloids.\n\n\"You've got to understand the kind of pressure Johnny was under in Australia,\" says producer Jerry Bruckheimer. \"At times helicopters would follow him home. There would be so many media outside his gates that trucks were feeding them. There was so much stuff made up about him: that Johnny had a fight on set and had gone back to the States, which we both read about while we were in his trailer.\"\n\nStill, sources close to the production report tales of excessive drinking, physical fights with Heard and constant lateness on set, which often left hundreds of extras waiting for hours at a time. Time and again, Bruckheimer, an assistant director and a flotilla of Disney executives led by production chief Sean Bailey were forced to huddle and debate how to handle their star's tardiness. \"He's not a morning person,\" quips one member of that group.\n\n\"There were certainly days when our plans were challenged,\" says Bailey. \"But no one should underestimate Johnny's passion and commitment to this character and franchise.\"\n\nSeveral times, the production staff raised the matter of Depp's tardiness with him, both on set and in his trailer, in a largely fruitless attempt to have him toe the line.\n\nOften, sources say, a production staffer was stationed in an unmarked car outside the Coomera, Queensland, compound that Depp had rented from Grand Prix champion Mick Doohan so that the sentinel could alert everyone the second a light was switched on in the morning (or afternoon).\n\n\"When he got up, he'd turn on the light, and the moment the light went on they'd call the line producer, who would then call the directors [Joachim Ronning and Espen Sandberg]: 'He's up! He's getting ready!' \" says an on-set source. \"They even had a special code term, like 'The eagle has landed.' Johnny had no idea this was going on.\"\n\nDepp's lateness and alleged heavy drinking caused enough concern that Jacobs, his then-agent, got into an argument with Bruckheimer when they were waiting on a set in the Gold Coast suburb of Helensvale. \"She went over to Jerry and said, 'You've got to do something! You're the producer,' \" recalls the production source. \"He said, 'You do something. You're the agent.' \" (Bruckheimer denies the spat took place.) \"Everyone was an innocent bystander watching this train wreck,\" the source continues. \"But when Johnny came on set, he was charming, nice. He's yin and yang.\"\n\nFilming shut down at one point when Depp injured himself, slicing open his finger. \"That was pretty serious,\" says Bruckheimer. Though many outlets reported the wound was the result of a booze-fueled marital dispute, Bruckheimer suggests otherwise. \"We don't really know. He got it caught in a car door, or he got it caught in a sliding door. I've heard a couple of versions.\"\n\nAsked whether Depp has put his troubles behind him since then, at least one ally insists that he has. \"I just saw him [on May 3]; he's never looked better,\" says litigator Martin Singer, who has worked with him for two decades, though not on the current lawsuits. \"The guy was as fit as a fiddle.\"\n\nBy the time he had begun shooting Pirates, Depp already was withdrawing from his closest reps. Jacobs, who had signed him after seeing the late-1980s Fox series 21 Jump Street, was ostracized and eventually fired in a short phone call. Colleagues say she was devastated. Mandel got his walking papers on March 14, 2016, in the form of a letter that insiders say stunned the business manager, who had seen Depp weeks earlier. That meeting had ended with a hug and a kiss.\n\nBy all objective measures, Depp's representatives seem to have served their client well. Following 2003's Pirates of the Caribbean: The Curse of the Black Pearl, the actor routinely earned $20 million upfront against 20 percent of the backend per picture and had a perk package worth approximately $3 million. According to one source, he reaped more than $40 million apiece from his share of the backend of the Pirates movies and made some $55 million from his profit participation on 2010's Alice in Wonderland, which earned $1.03 billion worldwide.\n\nIt is unclear how much Depp understood that these large numbers were not the amounts he could spend. UTA took 10 percent off the top; Bloom and Mandel each took another 5 percent; taxes and business expenses further reduced the income to far less than half the gross number. And after a tri­fecta of big-budget flops — 2014's Transcendence, 2015's Mortdecai and the Alice sequel in 2016 — it became clear the spigot was tightening.\n\nDepp's current lawyer, hired in October, insists the actor was not properly advised and that Depp's interest lay in his artistry, rather than his finances. But reps for TMG say Depp repeatedly was told to tighten the reins. The Mandel countersuit alleges that he ladled out $75 million on buying and updating 14 residences; owned more than 200 artworks, including some by Klimt, Warhol and Modigliani; kept a memorabilia collection in 12 storage facilities; and spent another $1 million archiving it.\n\nAfter he connected with Heard, on one occasion \"he walked into a [high-end jewelry] store, sat for a couple of hours,\" says an insider. \"They showed him a lot of stuff, gave him champagne, and he walked out with a $400,000 diamond cuff. It was a classic sort of moment because it wasn't worth $400,000.\"\n\nWhen the couple decided to take the Orient Express and travel around Europe, a full security team accompanied them. \"There were almost always two [security guards with Depp],\" the source says. \"He had a crew in L.A., a team of eight or 10 that traded off, with private security at the [Sweetzer] homes and the lofts downtown.\"\n\nThose lofts were a collection of penthouses in L.A.'s historic art deco Eastern Columbia Building; Depp has since sold two of the five units, which he bought for $7.2 million in 2007-08 and which were listed early last year at a combined price of $12.78 million.\n\nAs the financial strain grew more intense, sources say he pulled further away from Jacobs, Bloom, Mandel and his publicist, Robin Baum. At one point, the Depp lawsuit notes, \"Depp's talent agent [presumably Jacobs] wrote to Mandel: 'Did you tell [J]ohnny … he needs to make $25 million by the end of the year????? What are you doing?????' \"\n\nHis key reps struggled to maintain access. \"It became harder to find the right time to get him,\" says a source. \"In the old days, it was just [a question of] when he was free, but now it became [a matter of] finding a time when he was free and clear of mind and in the right mood. He got angry a lot. He'd scream at someone that worked at the house or his security.\"\n\nOn May 30, 2015, three years after the Sweetzer tete-a-tete, Mandel met with Depp again, this time in the Eastern Columbia building, ready for another confrontation. He insisted Depp sell his French chateau, part of a hamlet outside Saint-Tropez that he'd purchased for an unknown sum, before adding $10 million in renovations. The actor agreed. \"I am ready to face the music, in whatever way I must,\" he texted Mandel, according to the TMG countersuit. \"I know there's a way to dig ourselves out of this hole and I am bound and determined to do it.\"\n\nThe estate was put on the market for some $27 million, twice Sotheby's valuation; then, sources say, Paradis and Lily-Rose urged Depp to change his mind. The actor had never been married to the French actress-singer but continued to help support her after their 2012 split, even buying her a $4.5 million home. Now, when three prospective buyers asked to see the property, he got cold feet. The chateau was taken off the market. (It has since been relisted for $39 million.)\n\nThat issue helped sour the Depp-Mandel relationship. Soon after, they spoke by telephone, with four-letter words peppering their talk. In March 2016, Mandel and TMG were fired.\n\nThe possible catalyst for the lawsuit was a multimillion-dollar bridge loan TMG made to Depp in 2012. The managers say they tossed their client a lifeline as he faced default on a $5 million loan. In the cross complaint, TMG attorney Michael Kump says the firm stepped in to help Depp avert a \"devastating financial collapse.\" When he defaulted on that loan, TMG alleges, the firm initiated foreclosure proceedings on two of the actor's homes in the Hollywood Hills. TMG says Depp's lawsuit arrived with the potential sale of those homes only weeks away.\n\nThe star's perspective is different. According to Depp's complaint, his new business manager (and forensic accountant) Edward White uncovered serious discrepancies related to that loan and other financial matters. In this narrative, the actor felt the only recourse was to sue.\n\nIt was shortly before Halloween 2016, and Adam Waldman, 48, a well-known and outgoing Washington lawyer, was visiting his law firm's offices in Munich when his cellphone rang and a friend of Depp's came on the line. \"Something's not right with his financial situation,\" said the friend. \"Would you look into this?\"\n\nThe attorney's clients included Cher, Jolie and Russian billionaire Oleg Deripaska. In 2010, Waldman had filed paperwork with the Department of Justice, indicating that he would be working with Russian foreign minister Sergey Lavrov, \"gathering information and providing advice and analysis as it relates to U.S. policy towards the visa status of Deripaska.\" He knew how to handle chaos.\n\nDays later, he flew to Los Angeles for a meeting with Depp. Sitting in White's garden, overlooking the Bel Air golf course, the three men discussed the actor's finances; after several hours, Waldman was sure he had a case. On Jan. 13, acting on Depp's behalf, he filed the $25 million lawsuit against TMG and its principals, claiming negligence, fraud and breach of fiduciary duty.\n\nSoon after, the Mandels shot back. Typical of Depp's behavior, their suit claimed, was his response in 2008 when they cautioned him this was not the best time to buy another property, given his sputtering cash flow. \"I will call tracey [Jacobs] and jake [Bloom],\" Depp allegedly replied via email, \"and prepare them to make some ludicrous deals to refill the glass and make it f—ing overflow!!! Whatever we have to acquire 1480, let's do!!!! WE MUST BUY THIS HOUSE!!!\"\n\nIn his own lawsuit, Depp says he was kept in the dark about his finances and it was his ex-managers who weren't handling his money wisely. (Waldman maintains that it was Depp, not Mandel and Bloom, who called the October 2012 meeting.)\n\nAmong other charges, Depp alleges that TMG disbursed almost $10 million in \"loans\" to his sister and other parties close to the actor without his knowledge and took out loans for Depp, including $12.5 million from Tryon Management Services, secured by residuals from the first four Pirates movies, Alice and Into the Woods — also without his knowledge, according to the complaint. TMG says the loans were needed to keep Depp afloat and that the actor was fully aware of them. Waldman alleges, \"The Mandels' own written statement regarding the 'loans' constitute per se tax fraud that is sure to interest the IRS.\"\n\nIn addition to the loans, two other matters are central to the lawsuits.\n\nFirst, the Depp suit claims, TMG failed to pay Depp's taxes on time, resulting in $8.3 million in interest and penalties over the years — a claim TMG also denies, arguing that it had no choice, because the funds to pay the taxes were never available in April.\n\nSecond, perhaps most incendiary, Waldman alleges the Mandels were acting as both lawyers and business managers. Because they offered legal assistance, he says, they were bound by a California law forbidding attorneys from taking a percentage of clients' earnings unless they have a contract expressly allowing them to do so.\n\nWaldman's case hinges on the question of whether the Mandels did indeed serve as de facto lawyers. Both were trained as attorneys but say they never did anything for Depp that would constitute legal work. (The law does not apply to agents, Waldman notes, even those operating without a contract.)\n\nTestimony in the matter has come from a former TMG employee and whistleblower who was fired, Waldman asserts, because she complained about red flags in Depp's account. TMG says the woman was a low-level clerk who promised revenge when she was let go. Waldman counters that she was a \"TMG employee who was day-to-day manager of the Depp account.\" Her claims are currently under seal.\n\nWaldman declines to address whether he will also sue Bloom or his firm, but if his argument proves valid, he could force the disgorgement of tens of millions of dollars in fees and open the floodgates to a series of lawsuits between clients and their former reps.\n\n\"I don't think a commission agreement is enforceable without writing,\" says Jay Dougherty, director of Loyola Law School's Entertainment & Media Law Institute. \"Without a written agreement, I think the client can back out of the deal.\"\n\nAdds Waldman, \"I believe we are on to something that will change how Hollywood business is done in the future. If that is correct, the Depp case will have a larger meaning and effect beyond the personal interests of the parties.\" That assertion will remain untested until a judge hears the case, scheduled to go to trial in January. Meanwhile, Pirates 5 is moving forward, shadowed by Depp's problems.\n\nHow strapped for cash he is remains uncertain. While he has received $25.7 million over the past two years in profit participation from six movies (the first four Pirates, Alice and Into the Woods), all of that went to service debt, according to the litigation; his other income is unknown, though Waldman says he has earned money from finished movies including LAbyrinth, Fantastic Beasts and Where to Find Them and Gnomeo & Juliet: Sherlock Gnomes.\n\nBruckheimer maintains that Depp has put his woes behind him, along with his tardiness: \"He just finished Murder on the Orient Express and was on time every day,\" says the producer.\n\nThrough all of this, the man behind Captain Jack Sparrow has remained largely silent, giving only one interview to The Wall Street Journal. \"It's my money,\" he said on April 25. \"If I want to buy 15,000 cotton balls a day, it's my thing.\" As for his former representatives: \"I've worked very, very hard for a lot of years and trusted a lot of people, some who've clearly let me down.\"\n\n***\n\nThe Many, Many, Many Places Depp Calls Home\n\nUnlike his collections of classic guitars, fine art and fancy cars, the value of Depp's real estate holdings is not hard to ballpark. According to legal documents, Depp has purchased 14 residences, but a few have been sold. Today, he owns five houses in the Hollywood Hills; these homes are collectively worth about $19 million. He has sold two of his five penthouse lofts in the Eastern Columbia Building in DTLA for $5.6 million; the other three are worth roughly $6.5 million. He also owns an atoll in the Bahamas and a hamlet in France. All told, his properties are worth $50 million to $60 million.\n\nThis story first appeared in the May 10 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/05/depp_photo_illo_nb_splash.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/05/depp_photo_illo_nb_splash.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/05/depp_photo_illo_nb_splash.jpg", "keywords": [], "authors": ["Stephen Galloway Ashley Cullins"], "canonical_link": "https://www.hollywoodreporter.com/features/johnny-depp-a-star-crisis-insane-story-his-missing-millions-1001513", "title": "Johnny Depp: A Star in Crisis and the Insane Story of His \"Missing\" Millions", "meta_data": {"viewport": "width=device-width", "description": "What happened to $650 million? An explosive legal battle between one of Hollywood's best-paid actors and the business managers he fired has laid bare tumultuous finances, outrageous spending and troubling behavior on Disney's new 'Pirates' movie in a case that could even change how the industry does business.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/features/johnny-depp-a-star-crisis-insane-story-his-missing-millions-1001513", "domain": "https://www.hollywoodreporter.com/", "title": "Johnny Depp: A Star in Crisis and the Insane Story of His \"Missing\" Millions", "description": "What happened to $650 million? An explosive legal battle between one of Hollywood's best-paid actors and the business managers he fired has laid bare tumultuous finances, outrageous spending and troubling behavior on Disney's new 'Pirates' movie in a case that could even change how the industry does business.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/05/depp_photo_illo_nb_splash.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Johnny Depp: A Star in Crisis and the Insane Story of His \"Missing\" Millions", "description": "What happened to $650 million? An explosive legal battle between one of Hollywood's best-paid actors and the business managers he fired has laid bare tumultuous finances, outrageous spending and troubling behavior on Disney's new 'Pirates' movie in a case that could even change how the industry does business.", "url": "https://www.hollywoodreporter.com/features/johnny-depp-a-star-crisis-insane-story-his-missing-millions-1001513", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/05/depp_photo_illo_nb_splash.jpg", "width": 1500, "height": 844, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Johnny Depp: A Star in Crisis and the Insane Story of His \"Missing\" Millions", "sailthru.description": "What happened to $650 million? An explosive legal battle between one of Hollywood's best-paid actors and the business managers he fired has laid bare tumultuous finances, outrageous spending and troubling behavior on Disney's new 'Pirates' movie in a case that could even change how the industry does business.", "sailthru.author": "Stephen Galloway,Ashley Cullins", "sailthru.vertical": "Movies", "sailthru.date": "2017-05-10 06:00:00", "sailthru.tags": "Business,Johnny Depp,Longform 2017"}, "movies": [], "publish_date": 1494367200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}