{"url": "https://www.businessinsider.com/veterans-day-sale-roundup-2016-11", "text": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships so we get a share of the revenue from your purchase.\n\nYou may be counting down the days until Black Friday and Cyber Monday, but let's not forget about Veterans Day. While it's a day to honor those who have fought for our country, it does have lighter, commercialized connotations, like some really amazing sales.\n\nYou could go to a physical store, but you'll cover more ground — and be able to shop from your desk — by scouring the web for the best deals.\n\nTo make Veterans Day weekend shopping as efficient as possible, below are over 50 sales worth scrolling through this weekend:\n\nAllen Edmonds\n\nTake up to 50% off some of Allen Edmonds boots, loafers, and lace-ups.\n\nAll Modern\n\nSave 15% on select rugs, furniture, and lighting with the code \"ONEDAYSALE.\"\n\nAmazon\n\nWith tons of amazing deals every day, make Amazon one of your first virtual stops this weekend. If you're not a Prime member already, now's a better time than any to sign up — not only can you get same-day shipping for those last-minute orders, you can also take full advantage of those lightning deals before they sell out.\n\nBackcountry\n\nFor a limited time, you can save 20% on one full-price item when you use the code \"BC20PERCENT.\"\n\nBanana Republic\n\nBanana Republic is offering 40% off your entire purchase this weekend.\n\nBear Mattress\n\nThis brand's memory foam mattresses are designed to help your body recover quickly and efficiently after an intense workout. You can save $50 on any size mattress with the code \"FALL50\" this weekend.\n\nBellacor\n\nSave up to 80% on lighting and home decor at Bellacor.\n\nBloomingdales\n\nShoppers can take $25 off their orders when they use the code \"PRIVATE.\"\n\nBoden\n\nWith the code \"4QAD,\" you can save 25% and receive free shipping on orders totaling more than $49.\n\nClarks\n\nFor a limited time, take up to 30% off select styles.\n\nDockers\n\nThrough Sunday, you can save 40% on two items and 50% on three when you enter the code \"FROSTY50\" at checkout.\n\nFive Four Club\n\nWhen you enter the code \"NOVSHADES,\" you save 35% on your first order and get a free pair of sunglasses.\n\nFrank + Oak\n\nIf you need a new winter coat, enter the code \"BRRR20\" for 20% off outerwear.\n\nGodiva\n\nGet $10 off orders of $50 or more, $20 off $75 or more, and $30 off $100 or more — no code necessary.\n\nHenri Bendel\n\nSave up to 30% on jewelry, accessories, and home goods.\n\nHuckberry\n\nHuckberry regularly has sales on everything from hoodies to camping equipment. In addition to all of its regular deals, this weekend, shoppers can receive free shipping on select products.\n\nIndochino\n\nYou can get a custom suit for $399 when you enter the code \"WEEKEND\" at checkout — that's up to $400 in savings.\n\n\n\nJ.Crew\n\nToday only, J.Crew is offering an additional 40% off sale items with the promo code \"SALETIME.\"\n\nJomashop\n\nThe online store is known for its impressive watch discounts, and this weekend is no exception. With up to 65% off tons of watches, there's bound to be a timepiece that fits your budget and taste.\n\nJonathan Adler\n\nEnter the code \"GETFESTIVE\" and receive 20% off select furniture, pillows, and tabletop accessories.\n\n\n\nKenneth Cole\n\nThis weekend, you can take up to 60% off sale items, plus save an additional 30% with the code \"SAVE30.\"\n\n\n\nLe Creuset\n\nYou can pick up Le Creuset's non-stick cookware for 20% less this weekend. Perfect timing for your upcoming Thanksgiving dinner.\n\nLeesa\n\nSave $75 on any size mattress with the promo code \"FALL75.\"\n\nLevi's\n\nThrough Monday, you can take 30% off your entire order when you enter \"EARLY30\" at checkout.\n\nL.L.Bean\n\nTake 20% off everything at L.L.Bean — including the brand's popular Bean Boots — with the code \"SAVE20.\n\nMacys\n\nThe department store is offering up to 20% off select items with the code \"VETDAY\" and $10 off orders of $25 or more with \"VET25.\"\n\nMichael Kors\n\nUntil November 20, you can save an additional 25% off sale items — no code required.\n\nMonoprice\n\nToday only, take $5 off orders totaling more than $25 with the code \"VET5,\" or take $20 off orders over $100 with the code \"VET20.\"\n\nMoosejaw\n\nSave 20% on one full-price item with the code \"ANNISALE\" or take 30% off select brands.\n\nNashbar\n\nFriday is your last chance to take an extra 22% off orders of $49 or more.\n\nNew Balance\n\nThrough Sunday, you can take 15% off sitewide and receive shipping with the code \"GOBBLE.\"\n\nNordstrom\n\nThis weekend, take 40% off tons of clothes, accessories, and home goods.\n\nPatagonia\n\nHead over to Patagonia's \"Web Specials\" page and you'll find the brand's warm fleece pullovers, windbreakers, swim trunks, and much more on sale.\n\nPaul Fredrick\n\nTake 15% off orders of $150 or more and 25% off when you spend over $300.\n\nPottery Barn\n\nWith the code \"SAVEMORE,\" you can enjoy 10% off orders of $100 or more, 15% off $250 or more, 20% off $500 or more, and 25% off $1,000 or more.\n\nREI\n\nThrough November 21, shoppers can take up to 30% off tons of items. REI members can also save 20% on a single full-price or garage item with the code \"WINTER20.\"\n\nSapira\n\nSave $100 on a mattress from Sapira. The discount is automatically applied at checkout.\n\nSebago\n\nToday only, you can get select shoes for half off.\n\nSnapfish\n\nUntil Sunday, you can take 50% off orders of $30 or more with the code \"50HAPPY16.\"\n\nSpeck\n\nStarting at 12 p.m. EST on Monday, Speck will have a six-hour flash sale where you can save 30% on most of the brand's tech accessories.\n\nSpring\n\nAt Spring, you can save up to 60% on some of the site's favorite brands.\n\nSteve Madden\n\nYou can enjoy an extra 25% off your order and free shipping.\n\nSunglass Hut\n\nIf you're in the market for new shades, Sunglass Hut is offering 50% off select sale styles.\n\n\n\nTeabox\n\nTake 25% off your first subscription box when you enter the code \"TBSUB25\" at checkout.\n\nTed Baker\n\nThe British brand is offering 25% off select pieces.\n\nThe Company Store\n\nEnter the code \"N16BRAVE\" and save 20% on comforters, pillows, and other bedding essentials.\n\nThink Geek\n\nYou can currently save up to 60% on tons of \"Star Wars\" products. May the force be with you.\n\n\n\nTOMS\n\nAs a token of its appreciation, TOMS is offering 10% off to all military members.\n\nUdemy\n\nThrough Tuesday, you can take 75% off tons of online classes with the code \"UDEMY1175\" or enroll in some courses for $19 each when you enter \"UDEMY1119\" at checkout.\n\nWayfair\n\nTake an extra 15% off select sale items with the code \"HOLIDAY15.\"\n\nWest Elm\n\nWest Elm is currently offering great discounts on bedding, furniture, and rugs.\n\nWilliams-Sonoma\n\nWhen you enter the code \"FRIENDS,\" you receive 20% off your order as well as complimentary shipping.", "images": ["https://i.insider.com/5826155e691e8820038b644d?width=1200&format=jpeg", "https://www.businessinsider.com/veterans-day-sale-roundup-2016-11?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a060b8935876eaa008b5559?width=150&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/58261556691e8861008b64ff?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5826155e691e8820038b644d?width=1200&format=jpeg", "keywords": [], "authors": ["Kelsey Mulvey", "Insider Picks"], "canonical_link": "https://www.businessinsider.com/veterans-day-sale-roundup-2016-11", "title": "These are all the Veterans Day weekend sales you need to know about", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "These are all the Veterans Day weekend sales you need to know about", "date": "2016-11-11", "news_keywords": "Insider Picks, Shopping, Deals, Veterans Day, Kelsey Mulvey", "description": "To make your Veterans Day shopping as efficient as possible, we put together a list of more than 50 sales worth scrolling through this weekend.", "author": "Kelsey Mulvey", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Reviews", "og": {"title": "These are all the Veterans Day weekend sales you need to know about", "description": "To make your Veterans Day shopping as efficient as possible, we put together a list of more than 50 sales worth scrolling through this weekend.", "type": "article", "url": "https://www.businessinsider.com/veterans-day-sale-roundup-2016-11", "image": "https://i.insider.com/5826155e691e8820038b644d?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "These are all the Veterans Day weekend sales you need to know about", "sailthru.date": "2016-11-11", "sailthru.tags": "Insider Picks, Shopping, Deals, Veterans Day, Kelsey Mulvey", "sailthru.description": "To make your Veterans Day shopping as efficient as possible, we put together a list of more than 50 sales worth scrolling through this weekend.", "sailthru.author": "Kelsey Mulvey", "sailthru.verticals": "insiderpicks, thelife", "sailthru.image.full": "https://i.insider.com/58261556691e8861008b64ff?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/58261556691e8861008b64ff?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@insider_picks"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "control", "back-to-top": "control", "sticky-section-titles": "variant", "commerce-product-card-button-font": "control", "commerce-button": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "control", "subscribe-smallest-price": "control"}, "viking-id": "5825d67d691e8821008b636a", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1478793600.0, "source": "https://www.businessinsider.com", "summary": ""}