{"url": "https://variety.com/2017/tv/columns/hbo-girls-show-ending-lena-dunham-legacy-2-1202030312/", "text": "When “Girls” premiered in April 2012, it was almost all that the TV aficionado community could talk about, and it made a giant splash in pop culture, too. Nearly everyone had a strong take on the show Lena Dunham created. Below is Part 2 of Variety’s TV critics’ reflections on the show’s legacy and impact — and why they’re both happy and sad that the story of Hannah Horvath and her friends is wrapping up. (Part 1, from before the finale aired, is here, and a post-finale talk with executive producers Jenni Konner and Lena Dunham is here.)\n\nSonia Saraiya: Well, that was pretty perfect. I mean, it wasn’t, but in its insular, domestic sphere, harsh reality, “Latching” is where this whole season was trending, and such a fitting counterpoint to a similarly insular but much more self-aggrandizing premiere episode of “Girls.” I appreciate that instead of being about transformation, for any of the characters, the finale emphasizes resilience — that problems arise, and our predictable anxieties will flare up, but you can get better at bouncing back.\n\nFurthermore — I have never felt fully onboard with Hannah’s pregnancy as a plot point, and I appreciated learning that she wasn’t fully onboard with it, either. That narrative about being a new mother sounds like it may have come from Jenni Konner, who co-wrote and directed this episode, who talks about childrearing in interviews (including in a post-finale Q&A with Variety). Glimpsing a bit of “Girls” famously raw and unflinching lens directed at child-rearing is pretty satisfying.\n\nBut really, what got me is that Tracy Chapman’s “Fast Car” was stitched — thematically and melodically — through the episode. It’s almost not fair, because that song is wrenching enough to do a lot of emotional heavy lifting on its own. But its circularity about running away, growing up, finding home, and being someone must feel especially relevant when you’re a single mom in a house in the woods, just one car trip away from running away. In the premiere of “Girls,” Hannah asks her own parents for money; in the finale, she has to assume the mantle of grown-up, even though she’s scared s–itless, mostly because someone has to do it, and she can’t quit now. But is this what she wanted? Is she happy? Or is her settled contentment at the end, once Grover has finally started breastfeeding, about as good as it gets in this life? “Fast Car” doesn’t have easy answers, and I liked that “Latching” doesn’t either.\n\nMaureen Ryan: Oh “Girls,” you did the most “Girls” thing possible: After loving most of the lyrical and emotionally acute final season, I spent a good chunk of the finale wanting to scream and fending off a migraine. For me, the combative self-absorption of the characters just felt overly familiar and the setting a little too claustrophobic, and for the first two-thirds of the episode, a lot of the post-birth story played out in ways that I found frustrating rather than illuminating. I see where you’re coming from, and the last few minutes were sweet and memorable, but in the main, I found this particular variety of “Girls” episode — argumentative and somewhat predictable — more off-putting than most. So here we are, having one more critical argument about “Girls” — yay?\n\nThe thing is, many different TV shows have hauled out the difficulties of parenting a newborn to manufacture drama or conflict, so the topics on display and the treatments of them just felt overly familiar to me. And perhaps Marnie’s oblivious self-absorption was meant to be funny, but we’ve seen that so many times before, and given the stakes — i.e., the life and health of a baby — her condescending selfishness really grated on me throughout much of the final half-hour. This being “Girls,” perhaps her behavior was meant to annoy, but that’s a flavor that can get old fast.\n\nIt wasn’t until the great Becky Ann Baker showed up to school everybody that I could actually begin to find a few shreds of enjoyment in the finale. The upside is, all the yelling and crying and immaturity made me more than OK than with the fact that this show — which I have often loved, especially this season — is ending. Good luck, little Grover. (She really named her kid Grover? Hannah. You did not have to do that. Sigh.)\n\nSaraiya: How funny that you are positive about the show, but not about the finale, while I am almost vice-versa. I liked “Latching,” though I admit that I have no idea what to make of the fact that Hannah’s son is a brown baby — and will grow up to be a man of color. With this show’s relationship to racial dynamics, something about this feels strangely superficial. Of course, at this point, “Girls” is damned if it does, and damned if it doesn’t — but isn’t it a bit odd that It’s never discussed or dealt with, it’s just, oh yeah, Hannah’s having a brown baby? The show’s deep-seated discomfort with engaging with race never disappeared, despite six seasons of us talking about it.\n\nIn Part 1, you wrote that you always found “Girls” to be sincere. That struck me while watching the finale and pondering this baby, because I was so often frustrated that the show wasn’t sincere with its setups — there was this surreality or fantasy-level to the characters’ lives that made them more ciphers than characters. Even in this final season, which has been one of the most grounded, I read this long piece about how Hannah’s salaried-with-benefits teaching job at a cushy lib arts school upstate is essentially impossible. Maybe what you were saying is that the show always meant well — but even that, I’m not always so sure about. I’m not saying I’m ascribing evil motives to the show either. But like, I think sometimes the show was going for the best joke, or the most interesting denouement, not the one it felt the most strongly about.\n\nIn its defense, though, I think “Girls” was as much about Dunham and co. making characters out of the idiosyncrasies and silliness that they themselves were experiencing in the high creative echelons of contemporary hipsterdom. Hannah the writer, Ray the failed artist, Adam the actor, Marnie the “musician,” Shosh the publicist, Jessa from rehab — and on, and on. That person you know who moved upstate to have a kid on her own. That girl who got engaged two weeks after meeting someone and seems very happy. The one whose marriage fell apart and is now having some obscure experience of personal growth in another state. We don’t have tell-all novels, a la Jay McInerney or Bret Easton Ellis, about the New York arty media scene anymore: now we have shows like “Girls” to deliver second- or thirdhand gossip.\n\nThis cements one of my long-held feelings about the show, which is that more than being aimed at millennials, it was a show about millennials for millennials’ parents. Not you, Mo, you proud Gen X-er, but those homeowning HBO subscribers who want to ask what their kids are doing but maybe don’t feel so comfortable asking about “crack-cidents” on the phone. I don’t think it’s insignificant that this series has been as much about Becky Ann Baker’s transformation, as Hannah’s mom, as it has been about Hannah herself. (She was just fantastic in the finale.)\n\nRyan: I think you’re onto something there. I once wrote a long piece about the similarities between Liz Phair and Lena Dunham (who both went to Oberlin, and who both were lionized and torn apart in equal measure for their creative exploits — 20 years apart). We touched on this briefly in Part 1 of our dialogue, this idea of voyeurism: I would bet most HBO subscribers have never lived in Greenpoint, Brooklyn, but they want a window into that world, just like they want to know, on Sunday nights, what’s up in the realm of dragons and Lannisters. You’re so right about this being the Jay McInerney or Tama Janowitz novel of its time. Who has the time to read the hot new novelist’s take on what the cool people are doing in NYC? But we can watch this show and feel at least partially informed about what the Youngs are up to.\n\nI recall that somewhat early in the show’s run, a bunch of stories were published on the topic of how a goodly number of middle-aged male HBO subscribers watched “Girls.” Well, why wouldn’t they? Not only would it make all those tuition-paying dads feel like they knew what was up in their kids’ lives, “Girls” contended with the issues surrounding masculinity and intimacy that a lot of other prestige shows explore, but with a lot fewer murders and brothels.\n\nHannah grappled with a lot of things — her narcissism, her difficulty in sustaining jobs and relationships, her parents’ breakup, and now, this season, an unexpected pregnancy. But I’ve been thinking a lot about that the fact that a huge throughline of the show has concerned the reality that the men in Hannah’s life were often both more and less than she could handle, and she was never quite sure what to do about that. (As Hannah herself notes, Grover was just the latest in a long list of males with whom she had difficulties, though he was probably also the cutest. And not to sidestep the race thing, but it’s really strange to me that Hannah wouldn’t address the fact that she is parenting a non-white boy. You’d think that would be the exact sort of thing she’d monologue about, and I can definitely see why you felt that aspect of the story felt tacked-on.)\n\nBut speaking of men in general, I think a lot of women watching could relate to the issues that Hannah and all the other women contended with when it came to the guys in their lives. Weirdly enough, there were a lot of moments in which the men felt as though they were more dimensionalized than the women — in a show called “Girls.” It was one more conundrum to contend with, I suppose.\n\nThat said, I don’t feel all that cheated about who grew most or least, given that, as you say, for most of the characters on the show, they didn’t grow a ton. As was the case with Don Draper, I think they got better at recognizing and accepting their flaws, and seeing past their own pain and self-absorption and at least attempting altruism on a regular basis (the presence of a helpless baby in your life will often force that kind of accelerated growth on a person). Over time, though they were still spectacularly myopic at times, the show undeniably got better at depicting them sometimes stepping past the landmines that they, in the past, would have embraced in a fairly unthinking way.\n\nSaraiya: This is interesting, because I wouldn’t have come to this conclusion. I never felt the show was interrogating its men. Adam is a great character, and has really grown on me, but I don’t think the show has ever really investigated what was behind his pent-up rage and desire to humiliate his sexual partners in the first season — the negging, almost, that characterized his affection for Hannah. I mean, he ended up with Jessa, who two episodes ago admitted she was a sociopath. Ray is a curmudgeon, and the show kind of embraces that; but along the way he’s used Shoshana pretty abominably. Laird is out here still hitting on Hannah. And while Elijah is, again, played very well by Andrew Rannells, I’m not so sure that he’s learned or grown or anything. If “Girls” is anything, it’s the show of barely perceptible character development.\n\nOn the other hand, though, it’s probably significant that Hannah has not a girl baby but a boy — Grover, the name for the cutest boy muppet. And throughout the finale, Hannah makes these funny comments like “Men are disgusting!” for no real reason. Maybe for Dunham, “Girls” was partly an effort to redeem men. It seems she may have succeeded.\n\nRyan: You may be right — along with the show, I may not have investigated the motivations and actions of the male characters as much as I could have. I think that might be partly for a defensible reason — damn, this cast was so good. It was hard not to be forgiving (possibly too forgiving) when the characters were this unpredictable and often hilarious in their oddity and messy, fascinating humanity. Alex Karpovsky, Adam Driver, Andrew Rannells and Peter Scolari were just so fun to watch, no matter how weak or selfish or weird their characters were, and Chris O’Dowd saying “That was my Humie” in his epic final fight with Jessa ranks in my Top 5 “Girls” lines ever. Elijah was often the comic relief, but Rannells could turn on a dime and almost make me cry, even when he was just running lines in a department store.\n\nWould you agree that the members of the cast — particularly the core four women — have become better actors, in some cases shockingly so, since the show began? It’s not that I think anyone was bad back in 2012, but there were moments when I wondered about the range and versatility of some of the performers. The assurance that they have now, and the wide array of emotions that they can lock into, I find, is truly remarkable. Dunham in particular has been able to work in small gestures and very subtle emotional shades this season. She’s really been exceptional. And it didn’t surprise me that Allison Williams was so good in “Get Out” because she’s grown tremendously on “Girls” in the last few years. Am I wrong about that?\n\nSaraiya: Oh, absolutely. Dunham in particular has become a much stronger actress. Her scene with Jemima Kirke in the penultimate episode, “Goodbye Tour,” is striking for just how emotive both are after spending so many seasons playing robotic caricatures. I’m inclined to think that Williams’ performance has stayed the same, but the writers’ sense of irony towards her has heightened (and in “Get Out,” she is entirely manufactured, which of course makes perfect sense). The show has also been characterized by performers that were already great, right from the start: Becky Ann Baker, Andrew Rannells, Adam Driver, Zosia Mamet, and Alex Karpovsky (who in some episodes stole the show from Dunham).\n\nRyan: Agreed. To wrap things up, here’s the greatest compliment I can pay any show, and I think “Girls” certainly merits it: I know I’ll spend time thinking about what all these men and women are up to, even though I won’t get to check in on their lives and loves and aspirations any time soon. How will they get on? Will they find ways to support each other, even as they stumble over the bigger obstacles and frustrations life is likely to throw at them in the next couple of decades? If there is a reunion movie several years from now, I’d eagerly watch that (and of course it’s no sure thing that this great cast, all of whom deserve to go on to bigger and better things, will not too busy to be reassembled). What’s great is that I honestly can’t fully picture the trajectory of each character, though I like to imagine a future in which Ray is the mayor of New York, or at least the crankiest dad in Brooklyn.\n\nThese characters frustrated me, they entertained me, they shook up what was possible on television. They made me re-examine my assumptions and they prompted some of the best conversations I’ve ever had about this medium that we love. Hannah Horvath, you forced me to think harder and to dig deeper, and I don’t know if I fully got what “Girls” was going for all the time, but I’m truly grateful for the provocations and the laughs and the unpredictable ride.\n\nI can easily picture Grover reminiscing about his mom 20 years from now, when he’s sitting on the lawn of some well-regarded liberal arts college.\n\n“She’s a lot,” he’ll probably say, “but it was an adventure every day.”", "images": ["https://pmcvariety.files.wordpress.com/2017/04/hbo-girls-ep-610-hannah-marnie-8789-schafer-mark-2.jpg?w=1024", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fcolumns%2Fhbo-girls-show-ending-lena-dunham-legacy-2-1202030312%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202030312&comment_count=4", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/04/hbo-girls-ep-610-hannah-marnie-8789-schafer-mark-2.jpg?w=1024", "keywords": [], "authors": ["Sonia Saraiya Maureen Ryan", "Sonia Saraiya", "Maureen Ryan"], "canonical_link": "https://variety.com/2017/tv/columns/hbo-girls-show-ending-lena-dunham-legacy-2-1202030312/", "title": "Variety TV Critics Discuss the Legacy and Impact of ‘Girls’ (Part 2)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Maureen Ryan and Sonia Saraiya discuss the legacy of Lena Dunham's \"Girls\" (Part 2 of 2).", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202030312, "author": "Sonia Saraiya,Maureen Ryan", "pmc-category": "Columns", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-04-16T20:30:38"}, "pmc-tag": "Girls,HBO,Lena Dunham", "title": "Variety TV Critics Discuss the Legacy and Impact of ‘Girls’ (Part 2)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Columns", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Variety TV Critics Discuss the Legacy and Impact of ‘Girls’ (Part 2)", "url": "https://variety.com/2017/tv/columns/hbo-girls-show-ending-lena-dunham-legacy-2-1202030312/", "description": "When “Girls” premiered in April 2012, it was almost all that the TV aficionado community could talk about, and it made a giant splash in pop culture, too. Nearly everyone had a strong take on the s…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/hbo-girls-ep-610-hannah-marnie-8789-schafer-mark-2.jpg?w=1024", "width": 1200, "height": 800}, "locale": "en_US"}, "article": {"published_time": "2017-04-17T03:30:38+00:00", "modified_time": "2017-04-17T03:38:27+00:00"}, "twitter": {"creator": "@soniasaraiya", "site": "@variety", "text": {"title": "Variety TV Critics Discuss the Legacy and Impact of ‘Girls’ (Part 2)"}, "image": "https://pmcvariety.files.wordpress.com/2017/04/hbo-girls-ep-610-hannah-marnie-8789-schafer-mark-2.jpg?w=1024", "card": "summary_large_image", "title": "Variety TV Critics Discuss the Legacy and Impact of ‘Girls’ (Part 2)", "description": "Maureen Ryan and Sonia Saraiya discuss the legacy of Lena Dunham's \"Girls\" (Part 2 of 2)."}, "author": "Maureen Ryan", "content_type": "Article", "post_id": 1202030312, "title": "Variety TV Critics Discuss the Legacy and Impact of ‘Girls’ (Part 2)", "published_at": "2017-04-16 20:30:38", "image": "https://pmcvariety.files.wordpress.com/2017/04/hbo-girls-ep-610-hannah-marnie-8789-schafer-mark-2.jpg?w=1024", "comment_count": 4, "tags": "Lena Dunham", "topics": "Columns", "appeared_in_print": "No", "body": "When “Girls” premiered in April 2012, it was almost all that the TV aficionado community could talk about, and it made a giant splash in pop culture, too. Nearly everyone had a strong take on the show Lena Dunham created. Below is Part 2 of Variety’s TV critics’ reflections on the show’s legacy and impact — and why they’re both happy and sad that the story of Hannah Horvath and her friends is wrapping up. (Part 1, from before the finale aired, is here, and a post-finale talk with executive producers Jenni Konner and Lena Dunham is here.)\r\n\r\nSonia Saraiya: Well, that was pretty perfect. I mean, it wasn’t, but in its insular, domestic sphere, harsh reality, “Latching” is where this whole season was trending, and such a fitting counterpoint to a similarly insular but much more self-aggrandizing premiere episode of “Girls.” I appreciate that instead of being about transformation, for any of the characters, the finale emphasizes resilience — that problems arise, and our predictable anxieties will flare up, but you can get better at bouncing back. \r\n\r\nFurthermore — I have never felt fully onboard with Hannah’s pregnancy as a plot point, and I appreciated learning that she wasn’t fully onboard with it, either. That narrative about being a new mother sounds like it may have come from Jenni Konner, who co-wrote and directed this episode, who talks about childrearing in interviews (including in a post-finale Q&A with Variety). Glimpsing a bit of “Girls” famously raw and unflinching lens directed at child-rearing is pretty satisfying.\r\n\r\nBut really, what got me is that Tracy Chapman’s “Fast Car” was stitched — thematically and melodically — through the episode. It’s almost not fair, because that song is wrenching enough to do a lot of emotional heavy lifting on its own. But its circularity about running away, growing up, finding home, and being someone must feel especially relevant when you’re a single mom in a house in the woods, just one car trip away from running away. In the premiere of “Girls,” Hannah asks her own parents for money; in the finale, she has to assume the mantle of grown-up, even though she’s scared s--itless, mostly because someone has to do it, and she can’t quit now. But is this what she wanted? Is she happy? Or is her settled contentment at the end, once Grover has finally started breastfeeding, about as good as it gets in this life? “Fast Car” doesn’t have easy answers, and I liked that “Latching” doesn’t either.\r\n\r\nMaureen Ryan: Oh “Girls,” you did the most “Girls” thing possible: After loving most of the lyrical and emotionally acute final season, I spent a good chunk of the finale wanting to scream and fending off a migraine. For me, the combative self-absorption of the characters just felt overly familiar and the setting a little too claustrophobic, and for the first two-thirds of the episode, a lot of the post-birth story played out in ways that I found frustrating rather than illuminating. I see where you’re coming from, and the last few minutes were sweet and memorable, but in the main, I found this particular variety of “Girls” episode -- argumentative and somewhat predictable -- more off-putting than most. So here we are, having one more critical argument about “Girls” — yay? \r\n\r\nThe thing is, many different TV shows have hauled out the difficulties of parenting a newborn to manufacture drama or conflict, so the topics on display and the treatments of them just felt overly familiar to me. And perhaps Marnie’s oblivious self-absorption was meant to be funny, but we've seen that so many times before, and given the stakes — i.e., the life and health of a baby — her condescending selfishness really grated on me throughout much of the final half-hour. This being \"Girls,\" perhaps her behavior was meant to annoy, but that's a flavor that can get old fast. \r\n\r\nIt wasn’t until the great Becky Ann Baker showed up to school everybody that I could actually begin to find a few shreds of enjoyment in the finale. The upside is, all the yelling and crying and immaturity made me more than OK than with the fact that this show -- which I have often loved, especially this season -- is ending. Good luck, little Grover. (She really named her kid Grover? Hannah. You did not have to do that. Sigh.)\r\n\r\nSaraiya: How funny that you are positive about the show, but not about the finale, while I am almost vice-versa. I liked “Latching,” though I admit that I have no idea what to make of the fact that Hannah’s son is a brown baby — and will grow up to be a man of color. With this show’s relationship to racial dynamics, something about this feels strangely superficial. Of course, at this point, “Girls” is damned if it does, and damned if it doesn’t — but isn’t it a bit odd that It’s never discussed or dealt with, it’s just, oh yeah, Hannah’s having a brown baby? The show’s deep-seated discomfort with engaging with race never disappeared, despite six seasons of us talking about it.\r\n\r\nIn Part 1, you wrote that you always found “Girls” to be sincere. That struck me while watching the finale and pondering this baby, because I was so often frustrated that the show wasn’t sincere with its setups — there was this surreality or fantasy-level to the characters’ lives that made them more ciphers than characters. Even in this final season, which has been one of the most grounded, I read this long piece about how Hannah’s salaried-with-benefits teaching job at a cushy lib arts school upstate is essentially impossible. Maybe what you were saying is that the show always meant well — but even that, I’m not always so sure about. I’m not saying I’m ascribing evil motives to the show either. But like, I think sometimes the show was going for the best joke, or the most interesting denouement, not the one it felt the most strongly about.\r\n\r\nIn its defense, though, I think “Girls” was as much about Dunham and co. making characters out of the idiosyncrasies and silliness that they themselves were experiencing in the high creative echelons of contemporary hipsterdom. Hannah the writer, Ray the failed artist, Adam the actor, Marnie the “musician,” Shosh the publicist, Jessa from rehab — and on, and on. That person you know who moved upstate to have a kid on her own. That girl who got engaged two weeks after meeting someone and seems very happy. The one whose marriage fell apart and is now having some obscure experience of personal growth in another state. We don’t have tell-all novels, a la Jay McInerney or Bret Easton Ellis, about the New York arty media scene anymore: now we have shows like “Girls” to deliver second- or thirdhand gossip.\r\n\r\nThis cements one of my long-held feelings about the show, which is that more than being aimed at millennials, it was a show about millennials for millennials’ parents. Not you, Mo, you proud Gen X-er, but those homeowning HBO subscribers who want to ask what their kids are doing but maybe don’t feel so comfortable asking about “crack-cidents” on the phone. I don’t think it’s insignificant that this series has been as much about Becky Ann Baker’s transformation, as Hannah’s mom, as it has been about Hannah herself. (She was just fantastic in the finale.)\r\n\r\nRyan: I think you’re onto something there. I once wrote a long piece about the similarities between Liz Phair and Lena Dunham (who both went to Oberlin, and who both were lionized and torn apart in equal measure for their creative exploits -- 20 years apart). We touched on this briefly in Part 1 of our dialogue, this idea of voyeurism: I would bet most HBO subscribers have never lived in Greenpoint, Brooklyn, but they want a window into that world, just like they want to know, on Sunday nights, what’s up in the realm of dragons and Lannisters. You’re so right about this being the Jay McInerney or Tama Janowitz novel of its time. Who has the time to read the hot new novelist’s take on what the cool people are doing in NYC? But we can watch this show and feel at least partially informed about what the Youngs are up to. \r\n\r\nI recall that somewhat early in the show’s run, a bunch of stories were published on the topic of how a goodly number of middle-aged male HBO subscribers watched “Girls.” Well, why wouldn’t they? Not only would it make all those tuition-paying dads feel like they knew what was up in their kids’ lives, “Girls” contended with the issues surrounding masculinity and intimacy that a lot of other prestige shows explore, but with a lot fewer murders and brothels.\r\n\r\nHannah grappled with a lot of things -- her narcissism, her difficulty in sustaining jobs and relationships, her parents’ breakup, and now, this season, an unexpected pregnancy. But I’ve been thinking a lot about that the fact that a huge throughline of the show has concerned the reality that the men in Hannah’s life were often both more and less than she could handle, and she was never quite sure what to do about that. (As Hannah herself notes, Grover was just the latest in a long list of males with whom she had difficulties, though he was probably also the cutest. And not to sidestep the race thing, but it’s really strange to me that Hannah wouldn’t address the fact that she is parenting a non-white boy. You’d think that would be the exact sort of thing she’d monologue about, and I can definitely see why you felt that aspect of the story felt tacked-on.)\r\n\r\nBut speaking of men in general, I think a lot of women watching could relate to the issues that Hannah and all the other women contended with when it came to the guys in their lives. Weirdly enough, there were a lot of moments in which the men felt as though they were more dimensionalized than the women — in a show called “Girls.” It was one more conundrum to contend with, I suppose. \r\n\r\nThat said, I don’t feel all that cheated about who grew most or least, given that, as you say, for most of the characters on the show, they didn’t grow a ton. As was the case with Don Draper, I think they got better at recognizing and accepting their flaws, and seeing past their own pain and self-absorption and at least attempting altruism on a regular basis (the presence of a helpless baby in your life will often force that kind of accelerated growth on a person). Over time, though they were still spectacularly myopic at times, the show undeniably got better at depicting them sometimes stepping past the landmines that they, in the past, would have embraced in a fairly unthinking way.\r\n\r\nSaraiya: This is interesting, because I wouldn’t have come to this conclusion. I never felt the show was interrogating its men. Adam is a great character, and has really grown on me, but I don’t think the show has ever really investigated what was behind his pent-up rage and desire to humiliate his sexual partners in the first season — the negging, almost, that characterized his affection for Hannah. I mean, he ended up with Jessa, who two episodes ago admitted she was a sociopath. Ray is a curmudgeon, and the show kind of embraces that; but along the way he’s used Shoshana pretty abominably. Laird is out here still hitting on Hannah. And while Elijah is, again, played very well by Andrew Rannells, I’m not so sure that he’s learned or grown or anything. If “Girls” is anything, it’s the show of barely perceptible character development.\r\n\r\nOn the other hand, though, it’s probably significant that Hannah has not a girl baby but a boy — Grover, the name for the cutest boy muppet. And throughout the finale, Hannah makes these funny comments like “Men are disgusting!” for no real reason. Maybe for Dunham, “Girls” was partly an effort to redeem men. It seems she may have succeeded.\r\n\r\nRyan: You may be right -- along with the show, I may not have investigated the motivations and actions of the male characters as much as I could have. I think that might be partly for a defensible reason -- damn, this cast was so good. It was hard not to be forgiving (possibly too forgiving) when the characters were this unpredictable and often hilarious in their oddity and messy, fascinating humanity. Alex Karpovsky, Adam Driver, Andrew Rannells and Peter Scolari were just so fun to watch, no matter how weak or selfish or weird their characters were, and Chris O’Dowd saying “That was my Humie” in his epic final fight with Jessa ranks in my Top 5 “Girls” lines ever. Elijah was often the comic relief, but Rannells could turn on a dime and almost make me cry, even when he was just running lines in a department store. \r\n\r\nWould you agree that the members of the cast -- particularly the core four women -- have become better actors, in some cases shockingly so, since the show began? It’s not that I think anyone was bad back in 2012, but there were moments when I wondered about the range and versatility of some of the performers. The assurance that they have now, and the wide array of emotions that they can lock into, I find, is truly remarkable. Dunham in particular has been able to work in small gestures and very subtle emotional shades this season. She’s really been exceptional. And it didn’t surprise me that Allison Williams was so good in “Get Out” because she’s grown tremendously on “Girls” in the last few years. Am I wrong about that?\r\n\r\nSaraiya: Oh, absolutely. Dunham in particular has become a much stronger actress. Her scene with Jemima Kirke in the penultimate episode, “Goodbye Tour,” is striking for just how emotive both are after spending so many seasons playing robotic caricatures. I’m inclined to think that Williams’ performance has stayed the same, but the writers’ sense of irony towards her has heightened (and in “Get Out,” she is entirely manufactured, which of course makes perfect sense). The show has also been characterized by performers that were already great, right from the start: Becky Ann Baker, Andrew Rannells, Adam Driver, Zosia Mamet, and Alex Karpovsky (who in some episodes stole the show from Dunham).\r\n\r\nRyan: Agreed. To wrap things up, here's the greatest compliment I can pay any show, and I think \"Girls\" certainly merits it: I know I'll spend time thinking about what all these men and women are up to, even though I won't get to check in on their lives and loves and aspirations any time soon. How will they get on? Will they find ways to support each other, even as they stumble over the bigger obstacles and frustrations life is likely to throw at them in the next couple of decades? If there is a reunion movie several years from now, I'd eagerly watch that (and of course it's no sure thing that this great cast, all of whom deserve to go on to bigger and better things, will not too busy to be reassembled). What's great is that I honestly can't fully picture the trajectory of each character, though I like to imagine a future in which Ray is the mayor of New York, or at least the crankiest dad in Brooklyn.\r\n\r\nThese characters frustrated me, they entertained me, they shook up what was possible on television. They made me re-examine my assumptions and they prompted some of the best conversations I've ever had about this medium that we love. Hannah Horvath, you forced me to think harder and to dig deeper, and I don't know if I fully got what \"Girls\" was going for all the time, but I'm truly grateful for the provocations and the laughs and the unpredictable ride.\r\n\r\nI can easily picture Grover reminiscing about his mom 20 years from now, when he's sitting on the lawn of some well-regarded liberal arts college.\r\n\r\n\"She's a lot,\" he'll probably say, \"but it was an adventure every day.\"", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1492399838.0, "source": "https://variety.com", "summary": ""}