{"url": "people.com/tv/rhonj-did-teresa-giudice-cheat-on-joe-giudice/", "text": "Teresa Giudice has been known for her zen, namaste attitude after returning from her 11-month prison stay. But on Wednesday’s Real Housewives of New Jersey, the mother of four got back to her table-flipping ways when rumors surfaced that she was cheating on her husband Joe Giudice.\n\nAs viewers know, Joe is currently away serving a 41-month prison sentence — giving Teresa an opportunity to find romance with other people, longtime RHONJ guest Kim DePaola claimed. “I hear since Joe went away that she’s rekindling old frames,” she told Housewives Siggy Flicker and Dolores Catania while prepping for the fashion show at her fashion boutique, Posche.\n\nGet push notifications with news, features and more.\n\n“It’s not a rumor ’cause you’re going to find out it’s not,” DePaola added. “I’ll bet Posche on it right now. I think he treated her horribly and I was happy that she’s moving on!”\n\nShe may have been certain with her allegations, but Teresa sure found fault with the claims when Flicker and Catania passed them back to her.\n\n“I’m f—— fuming right now. I’m f—— fuming,” Teresa, 45, told the duo while at a group dinner with fellow New Jersey Housewives Melissa Gorga, Margaret Josephs and Friend of the Housewives Danielle Staub.\n\n“She’s such a f—— bitch!” Teresa screamed of DePaola, later throwing a glass against the restaurant’s wall behind her. “It’s not f—— true! Are you kidding me, it’s not true!”\n\nImage zoom Teresa and Joe Giudice Paul Zimmerman/Getty\n\nFlicker and Catania sure didn’t believe DePaola when they first heard the claims. “What are you talking about right now? Doesn’t matter, ’cause you know what rumors are? Just rumors!” Flicker said. “That’s all rumors. He’s not cheating and there’s no proof of it. Anybody can say anything, unless you have a picture of the wee-wee entering the cookie, who gives a s—? … People need to mind their own business. This woman has been through hell and back and she’s out there doing events, making money, and working her butt off for her children!”\n\n“Kim D’s always been a good friend to me, but spreading rumors about people’s marriages or their children is hitting below the belt,” Flicker told viewers.\n\nAdded Catania: “There aren’t any old flames — Joe’s the only man she’s ever been with!”\n\nImage zoom Kim DePaola Paul Zimmerman/Getty Images)\n\nStill, when she heard about DePaola’s claims from her friends, Giudice was certain that Catania — whom she has known for 20 years — hadn’t had her back. “You should have f—— stuck up for me,” Giudice yelled at Catania. “[Siggy] said [she] did, I don’t know if [you] did.”\n\nThat accusation pushed Catania off the ledge. “I did! When is enough enough? Huh? When is it a-f—— ’nuff?” Catania asked, bringing up Giudice’s decision to believe Danielle Staub over her in a previous argument. “I stuck up for you. Did you stick up for me against Danielle? I did and you didn’t. I did, and don’t think I will again.”\n\n“We did stick up for you!” Flicker reinforced. “I yelled, ‘It’s a rumor and it’s heresy, shut your mouth!’ We said it wasn’t true.”\n\nImage zoom Dolores Catania and Siggy Flicker Marcus Owen/startraksphoto.com\n\nTheir words weren’t enough for Giudice and Gorga, who have a long history of feuding with DePaula and were angry that Flicker and Catania were still going to walk in DePaola’s upcoming fashion show — an event thrown to help raise money for charity.\n\n“This is so crazy to me. Not only has Kim D done what she’s done for all these years to hurt me and my family, but now on top of it, she’s saying that Teresa’s a cheater. And Siggy and Dolores still are gonna go and support this woman?” Gorga asked viewers. “I’m completely baffled by it. Everything that they say they stand for to me is bulls—.\n\n“Yous two are f—— going and walking in her f—— show? Are you f—— kidding me?” Giudice asked.\n\n“Dolores, we don’t live in Switzerland. You gotta pick a side. This is your friend. Welcome to New Jersey,” Gorga said. “I have been called a stripper, a whore, I have been told my husband is a piece of s— and that my children are a piece of s—. Don’t you see what this vile human is?”\n\nRELATED VIDEO: What Advice Would Teresa Giudice Give Herself Before Joining ‘RHONJ’?\n\nBut Catania wasn’t backing down. “You don’t tell me what to do,” she told Gorga, before walking out with Flicker. “I pity Teresa for not seeing that I am the truest friend that she has. Teresa, guess what — you’ve been much closer to Kim D than I’ve ever been. Not too long ago, you and Kim D were spreading rumors about Melissa. So now the hypocrites that they are are turning on me. I don’t get it.”\n\nWithout them by her side, Giudice decided that she, Gorga, Josephs and Staub were going to go to the Posche show next week and confront DePaola. “I can’t believe that f—— bitch said that. I can’t believe they’re f—— supporting her after what she did to you, what she did to me. It’s just pretty screwed up,” Giudice said. “I think I need to go there and confront this f—— bitch.”\n\nHer friends were by her side. “The line in the sand has been drawn!” Staub said.\n\nThe Real Housewives of New Jersey airs Wednesdays (9 p.m. ET) on Bravo.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fsiggy-flicker-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fteresa-joe-giudice-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fjoe-guidice-teresa-guidice.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F03%2Fkim-de-paola-1-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fteresa-joe-giudice-1.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/rhonj-did-teresa-giudice-cheat-on-joe-giudice/", "title": "RHONJ: Did Teresa Giudice Cheat on Joe Giudice?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Danielle Staub,Dolores Catania,Joe Giudice,Joe Gorga,Margaret Josephs,Melissa Gorga,News,Real Housewives,Real Housewives of New Jersey,Siggy Flicker,Teresa Giudice,TV", "news_keywords": "Danielle Staub,Dolores Catania,Joe Giudice,Joe Gorga,Margaret Josephs,Melissa Gorga,News,Real Housewives,Real Housewives of New Jersey,Siggy Flicker,Teresa Giudice,TV", "description": "On Wednesday's Real Housewives of New Jersey, Teresa Giudice got back to her table-flipping ways when rumors surfaced that she was cheating on her husband Joe Giudice", "og": {"title": "Teresa Giudice Flips Out as Accusations that She's Cheating on Husband Joe Arise", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/rhonj-did-teresa-giudice-cheat-on-joe-giudice/", "description": "Teresa Giudice has been known for her zen, namaste attitude after returning&nbsp;from her 11-month prison stay.&nbsp;But on Wednesday’s&nbsp;Real Housewives of New Jersey, the mother of&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fteresa-joe-giudice-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/rhonj-did-teresa-giudice-cheat-on-joe-giudice/", "description": "On Wednesday's Real Housewives of New Jersey, Teresa Giudice got back to her table-flipping ways when rumors surfaced that she was cheating on her husband Joe Giudice", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fteresa-joe-giudice-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/rhonj-did-teresa-giudice-cheat-on-joe-giudice/", "title": "Teresa Giudice Flips Out as Accusations that She's Cheating on Husband Joe Arise", "description": "On Wednesday's Real Housewives of New Jersey, Teresa Giudice got back to her table-flipping ways when rumors surfaced that she was cheating on her husband Joe Giudice", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fteresa-joe-giudice-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}