{"url": "https://en.wikipedia.org/wiki/List_of_most_expensive_films#Films", "text": "Wikipedia list article\n\nBen-Hur (1925) was the most expensive film of the silent era, possibly holding the record for over twenty years. (1925) was the most expensive film of the silent era, possibly holding the record for over twenty years.\n\nDue to the secretive nature of Hollywood accounting it is not clear which film is the most expensive film ever made. Pirates of the Caribbean: On Stranger Tides officially holds the record with a budget of $378.5 million, while The Hobbit trilogy stands as the most expensive back-to-back film production with combined costs of $623 million after tax credits.\n\nInflation, filming techniques and external market forces affect the economics of film production. Costs rose steadily during the silent era with Ben-Hur: A Tale of the Christ (1925) setting a record that lasted well into the sound era. Television had an impact on rising costs in the 1950s and early 1960s as cinema competed with it for audiences, culminating in 1963 with Cleopatra; despite being the highest earning film of the year, Cleopatra did not earn back its costs on its original release. The 1990s saw two thresholds crossed, with True Lies costing $100 million in 1994 and Titanic costing $200 million in 1997, both directed by James Cameron. Since then it has become normal for a tent-pole feature from a major film studio to cost over $100 million and an increasing number of films are costing $200 million or more.\n\nThis list contains only the films that are already released to the general public and no films that are still in production, post-production or just announced films, for the reason that these costs can change during the production process. Listed below is the net negative cost: the costs of the actual filming, not including promotional costs (i.e. advertisements, commercials, posters, etc.) and after accounting for tax subsidies. The charts are ordered by budgets officially acknowledged by the production companies where they are known; most companies will not give a statement on the actual production costs, only estimates by professional researchers and movie industry writers are available. Where budget estimates conflict, the productions are charted by lower-bound estimates.\n\nMost expensive productions (unadjusted for inflation) [ edit ]\n\nOnly productions with a net budget in excess of a nominal value of $200 million in U.S. dollars are listed here. Due to the effects of inflation, all but one of the films on the chart have been produced in the 21st century.\n\nFilms [ edit ]\n\n* Officially acknowledged figure.\n\nBack-to-back film productions [ edit ]\n\n* Officially acknowledged figure.\n\nMost expensive films (adjusted for inflation) [ edit ]\n\nThe productions listed here have their nominal budgets adjusted for inflation using the United States Consumer Price Index[104] taking the year of release. Charts adjusted for inflation are usually ordered differently, because they are dependent on the inflation measure used and the original budget estimate.\n\nThe Soviet War and Peace, released in four parts across 1966 and 1967, is sometimes cited as the most expensive production ever: Soviet claims stating it cost $100 million (equivalent to $788 million in 2019 dollars) were circulated in the American press during its showing there. However, its financial records reveal it cost slightly more than $9 million (about $50–60 million in today's money).[nb 34] Another notable omission is Metropolis, the 1927 German film directed by Fritz Lang, often erroneously reported as having cost $200 million at the value of modern money. Metropolis cost $1.2–1.3 million at the time of its production, which would be about $12 million at 2009 prices according to the German Consumer Price Index.[nb 35]\n\n* Officially acknowledged figure.\n\nFoolish Wives was the first film to have a $1 million budget. was the first film to have a $1 million budget.\n\nThroughout the silent era, the cost of film-making grew steadily as films became longer and more ambitious and the techniques and equipment became more sophisticated.[198] It is not known for certain which was the first film to cost $1 million or more to produce, and several myths have grown over time: D. W. Griffith's Intolerance (1916) was reputed to have cost $2 million but accounts show it cost $385,906.77,[199] and A Daughter of the Gods (1916) was advertised as costing a million dollars but Variety estimated its true cost at $850,000.[147] The first film that is confirmed to have had a $1 million budget is Foolish Wives (1922), with the studio taking advantage of its exorbitant price and advertising it as \"The First Real Million Dollar Picture\".[54]\n\nThe most expensive film of the silent era was Ben-Hur (1925),[147] costing about $4 million—an astronomical sum in those days at twenty-five times the $160,000 average cost of an MGM feature.[198] It is unclear which sound era production superseded it as the most expensive film, although this is commonly attributed to Hell's Angels (1930), directed by Howard Hughes; the accounts for Hell's Angels show it cost $2.8 million but Hughes publicised it as costing $4 million, selling it to the media as the most expensive film ever made up.[200] The first film to seriously challenge the record was Gone with the Wind (1939), reported to have cost about $3.9–4.25 million,[147] although sources from the time state that Ben-Hur and—erroneously—Hell's Angels cost more.[201] Ben-Hur was definitively displaced at the top of the chart by Duel in the Sun in 1946, meaning Ben-Hur may have held the record for 21 years.\n\nThe 1950s saw costs rapidly escalate as cinema competed with television for audiences,[202] culminating with some hugely expensive epics in the 1960s that failed to recoup their costs.[147] A prominent example of this trend was Cleopatra (1963), which lost money on its initial release despite being the highest-grossing film of the year.[203] Since the 1990s, film budgets have once again seen a dramatic increase as the use of computer-generated imagery (CGI) has become commonplace in big-budget features.[204]\n\n* Officially acknowledged figure. The figure given is the cost of a multi-film production, where the films are produced simultaneously. The figure given is the cost of a multi-film production, where the films are produced simultaneously. Officially acknowledged figure.\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/6/63/Ben-Hur-1925.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Foolish_Wives_-_1922_-_glass-slide.jpg/220px-Foolish_Wives_-_1922_-_glass-slide.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Ben-Hur-1925.jpg/220px-Ben-Hur-1925.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/63/Ben-Hur-1925.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_most_expensive_films", "title": "List of most expensive films", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/6/63/Ben-Hur-1925.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}