{"url": "https://www.esquire.com/entertainment/movies/a25133806/joe-alwyn-mary-queen-of-scots-interview-2018/", "text": "Vest and trousers (part of three-piece suit, $2,675) and shirt ($395) by Dolce & Gabbana; Coupole Classic Power Reserve watch ($1,650) by Rado. Christian Anwander\n\nIn 2017, British actor Joe Alwyn shot four films across three continents in less than twelve months, and the resulting projects, all of which hit theaters in the latter half of this year, reveal his impressive range in a series of small but critical roles. First came Operation Finale, about the hunt for Nazi officer Adolf Eichmann (Ben Kingsley), with Alwyn as Eichmann’s son. Then there was Boy Erased, a film about gay-­conversion therapy, in which Alwyn, alongside a cast including Nicole Kidman, Russell Crowe, and Lucas Hedges, played a closeted predator. The Favourite soon followed, a riotous period piece with Alwyn, as a besotted courtier, revealing a knack for physical comedy opposite Emma Stone.\n\nCoat ($930) by AMI Alexandre Mattiussi; turtleneck ($980) by Prada; trousers ($348) by Boss; sneakers ($180) by New Balance x Stüssy. Christian Anwander\n\nThis month, the twenty-­seven-year-old appears in a very different kind of period film, Mary Queen of Scots. Directed by Josie Rourke, it tells the true story of two young queens who are cousins and rivals for the English crown, with a fierce and brilliant Saoirse Ronan in the role of Mary and Margot Robbie as a powerful yet vulnerable Elizabeth I. Alwyn plays Robert Dudley, Elizabeth’s right hand. “He isn’t driven by politics and ambition and power in the same way as the other male characters,” says Alwyn. “The others try to circle the women and use them for their own advantage. That’s not to say that my character is incapable of doing that, but he has higher priorities or higher feelings—his love and loyalty to Elizabeth.”\n\nSweater ($2,740) by Louis Vuitton; trousers ($780) and boots ($1,095) by Givenchy. Christian Anwander\n\nAlwyn’s big break came in a shot-out-of-a-cannon moment when Ang Lee cast him, at age twenty-four and fresh out of school, as the lead in the highly anticipated wartime drama Billy Lynn’s Long Halftime Walk. The film stumbled at the box office, but Alwyn remains grateful: “It’s still the most amazing experience I’ve ever had.” Landing a starring role so soon could have turned his head, but the young actor stayed focused on his work and regrouped by taking a number of smaller parts. “Since that film, I’ve tried to make a conscious effort to find projects where, if there were supporting roles where I could learn and be surrounded by a great cast of actors and filmmakers and crew, then that was what I wanted to do.”\n\nJacket ($1,950), shirt ($690), and trousers ($790) by Bottega Veneta; belt ($575) by Louis Vuitton. Christian Anwander\n\nThat approach led Alwyn not only to create a diverse résumé but also to work with a diverse group of directors. He’s currently shooting Harriet, about abolitionist Harriet Tubman, directed by Kasi Lemmons (Eve’s Bayou). Throughout, Alwyn has retained an apprentice-­like humility. “I still find it a strange readjustment when you go back to set,” he says. “To do your work in a way where you don’t feel anxious and completely consumed by anxiety, it takes experience and practice.”\n\nCoat ($3,900) and trousers ($890) by CALVIN KLEIN 205W39NYC; Calvin Klein Underwear T-shirt, Alwyn’s own. Christian Anwander\n\nHis levelheadedness has also helped him navigate the incessant curiosity about his relationship with superstar Taylor Swift. Asked whether anyone gave him guidance, Alwyn says he kept his own counsel. “I didn’t seek out advice on that. Because I know what I feel about it. I think there’s a very clear line as to what somebody should share, or feel like they have to share, and what they don’t want to and shouldn’t have to.”\n\nThis article appears in the Winter '19 issue of Esquire.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.381xh;0,0.192xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.381xh;0,0.192xh&resize=1200:*", "keywords": [], "authors": ["Emily Poenisch"], "canonical_link": "https://www.esquire.com/entertainment/movies/a25133806/joe-alwyn-mary-queen-of-scots-interview-2018/", "title": "Prepare to See Joe Alwyn in, Well, Everything", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#000000", "og": {"type": "article", "site_name": "Esquire", "title": "Prepare to See Joe Alwyn in, Well, Everything", "description": "The British actor appeared in four films this year—including Oscar hopefuls \"The Favourite\" and \"Mary, Queen of Scots.\"", "url": "https://www.esquire.com/entertainment/movies/a25133806/joe-alwyn-mary-queen-of-scots-interview-2018/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.381xh;0,0.192xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 171874009543995, "pages": 84169421673}, "article": {"publisher": "https://www.facebook.com/Esquire", "modified_time": "2018-12-07 11:00:57", "published_time": "2018-12-07 11:00:00", "section": "Movies", "opinion": "false"}, "twitter": {"site": "@Esquire", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.381xh;0,0.192xh&resize=640:*"}, "google-site-verification": "1vf5i9wM7chlCFc_0XI_e-oCfDf4sEvp32sTGKoaukQ", "title": "Joe Alwyn Talks Taylor Swift and Mary Queen of Scots and The Favourite Movies", "description": "British actor Joe Alwyn shot four films across three continents in less than twelve months, and the resulting projects, all of which hit theaters in the latter half of this year, reveal his impressive range in a series of small but critical roles.", "keywords": "joe alwyn, joe alwyn interview, joe alwyn 2018 interview, joe alwyn taylor swift, joe alwyn the favourite, joe alwyn mary queen of scots, joe alwyn movies, joe alwyn new movies", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.760xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,movies", "sailthru.date": "2018-12-07T11:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.381xh;0,0.192xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/esq120118joealwin006-1544030316.jpg?crop=1.00xw:0.760xh;0,0", "sailthru.socialtitle": "Prepare to See Joe Alwyn in, Well, Everything", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1544151600.0, "source": "https://www.esquire.com", "summary": ""}