{"url": "https://deadline.com/2018/03/greys-anatomy-spinoff-station-19-creator-stacy-mckee-interview-1202351815/", "text": "SPOILER ALERT: This story contains details about Station 19’s second episode tonight on ABC., “Invisible to Me.”\n\nStation 19 arrives punctually in the Time’s Up movement, shedding a light on female firefighters. Yes, this is a Grey’s Anatomy spinoff, with the initial spark for this series being former Grey Sloan surgical resident Ben Warren (Jason George), who has traded his scalpel in for an axe. However, he’s second banana to the real combustion that’s brewing here: In the wake of her father and Station 19 chief Pruitt Herrera (Miguel Sandoval) being diagnosed with cancer, Andy Herrera (Jaina Lee Ortiz) finds herself in direct competition with her boyfriend Jack Gibson (Grey Damon) for the top job. But as we learn at the onset of tonight’s episode, she’s in the pole position to prove herself.\n\nTonight’s second episode, “Invisible to Me,” finds her station responding to a pulled fire alarm at a middle school, from which we learn that Ben’s son is the culprit — but he’s got his reasons. And while the rescue effort in an overturned tanker situation is the climax of tonight’s show, in the final moments we find Warren and Dean Miller responding to, let’s say, a potentially explosive situation involving the latter’s new friend–maybe even future girlfriend–JJ (guest star Brenda Song), who is lying on the floor with a bleeding head after falling from a ladder: The fire alarm that Dean tried to fix earlier in the show still isn’t working. Or is it?\n\nWe spoke with Station 19 creator Stacy McKee about what lies ahead in the remaining eight episodes. McKee wrote tonight’s episode with Paris Barclay directing.\n\nDEADLINE: Let’s start off with one of the most important questions coming off tonight’s cliffhanger: Is that a bomb in JJ’s apartment?\n\nMcKEE: We’re going to have all the pieces in the next episode in regards to what that cliffhanger indicates.\n\nABC\n\nDEADLINE: What is it about Ben Warren that makes him the best Grey’s Anatomy character to lend himself to a spin-off? Going from being anesthesiologist to a firefighter — is he going through a mid-life crisis?\n\nMcKEE: I wouldn’t call it a mid-life crisis. For seasons, Ben was always striving to find the right thing. He wanted to do more, he wanted to cut, so he went to school to become a surgeon. He started from the ground-up and explored that world, and we watched him become the most amazing surgeon. He pushed the envelope and he would do things that he shouldn’t, and would improvise (against proper practice) to help a patient. It’s ingrained in his DNA to be at the forefront (of an emergency situation) and wanting to do the most good. He’s a bit more fearless that way, so he was the most organic choice to walk away from the career as a surgeon to become a firefighter.\n\nDEADLINE: With other firefighter dramas like Chicago Fire on the air, is there ever any concern in the writers’ room about keeping tabs on similar series so that you can stay fresh?\n\n\n\nMcKEE: Not really, not for me. I feel like that there are other medical shows out there and cop shows and lawyer shows. I love Chicago Fire and I have so much respect for their storytelling. But their storytelling is theirs and ours is ours. I approach telling a story from the characters I build, and where I go personally and where I take them with the environment filtering into that. That’s how I break story, and I want to do right and true with our characters first.\n\nABC\n\nDEADLINE: We know that women have made strides and broken through in such male-dominated professions as the military and police force. However, when it comes to firefighting, is Station 19 based on an actual firehouse, or are you leading by example in the series?\n\nMcKEE: What’s fascinating is that in Seattle, out of the entire country, they have the highest percentage of women in their fire department. Grey Sloan is already in Seattle and when I found that piece of information out, it was very inspiring to me and seemed like a natural step-up. We met with a lot of firefighters in the department and our set is inspired by the actual fire station in Seattle. We shot there for the pilot.\n\nDEADLINE: Can you tell us about the major crossovers that will take place between Station 19 and Grey’s Anatomy? We already saw Dr. Meredith Grey show up in the pilot last week. Is Martin Henderson’s Dr. Nathan Riggs making an appearance on the show?\n\nMcKEE: I will never say never to Martin comingback. There will definitely be crossovers throughout the season, some bigger, and some smaller. It’s important for me that the main characters cross-pollinate between the two shows. Ben Warren is still appearing on Grey’s Anatomy, and there’s some characters coming over from Grey’s.\n\nDEADLINE: Tell us the inspiration about tonight’s storyline: A middle school girl delivered a baby. Was this pulled from the headlines?\n\nMcKEE: That was shocking and while we see stories like this in the headlines periodically, it’s less about ripping from them. It was about telling a story from Ben’s connection to his son and watching what would happen when Ben’s son saw his Dad in this new role, going from a surgeon to a firefighter, and how your own kid handles a situation like that [Editor’s note: Ben’s son pulled the fire alarm so that his father could help deliver the girl’s baby]. It was something amazing from our storytelling point of view of watching Ben and how he would react to his son in that situation.\n\nDEADLINE: Is there another part to the baby story? Will we learn more about the father; is it Ben’s son?\n\nMcKEE: We don’t have plans to see the baby’s parents down the line. If you watch the following episodes, you’ll see that these characters –firefighters and ER responders- only see a certain window of the people they’re treating, unlike at Grey Sloan; we’re sending that person to that fire until it’s put out. It’s been a real fascinating, interesting way to tell the story. That’s what Ben Warren has to learn: You have to walk away from them, you don’t follow up.\n\nCBS\n\nDEADLINE: That was Marla Gibbs, Florence from The Jeffersons, making a cameo tonight as Aida. She gives the firemen a nice ‘Hello’ as they arrive at her senior living building. How did she join the show?\n\nMcKEE: In my initial pitch of the episode, I knew that nursing homes tend to be regular stops for firefighters, and our characters need to get to know people there. She has worked in Shondaland before (Editor’s note: She played Rose on Scandal). I didn’t have the chance to work with her, and only heard amazing things and jumped at the chance with her availability.\n\nABC\n\nDEADLINE: That was a great moment in the pilot where Dr. Meredith gives Andy Herrera a private place to cry when her father is in the hospital, and then instructs her to “Put her game face on.” Expound on this.\n\nMcKEE: That was such an important moment to see, because it embodies something bigger in these two shows. Meredith has grown up and learned to be on her own. I feel the character of Andy is just starting out. She’s trying to figure out what to explore on her own. Like recognizes like. Meredith recognizes Andy, sees a certain fierceness, and she’s a person who she can identify with. She can put herself in Andy’s shoes; a number of years ago, if she had been her, this is what Meredith would have needed; she’s passing a baton and helping Andy with what she needs to do next.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pmcdeadline2.files.wordpress.com/2018/03/station-19-iii.jpg?w=301&h=202&crop=1", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2018/03/station-19.jpg?w=1024", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pmcdeadline2.files.wordpress.com/2018/03/ellen-p.jpg?w=301&h=202&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2018/03/marla-gibbs1.jpg?w=301&h=202&crop=1", "https://pmcdeadline2.files.wordpress.com/2018/03/ben-warren.jpg?w=301&h=202&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F03%2Fgreys-anatomy-spinoff-station-19-creator-stacy-mckee-interview-1202351815%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202351815&comment_count=3"], "top_img": "https://pmcdeadline2.files.wordpress.com/2018/03/station-19.jpg?w=1024", "keywords": [], "authors": ["Anthony D'Alessandro"], "canonical_link": "https://deadline.com/2018/03/greys-anatomy-spinoff-station-19-creator-stacy-mckee-interview-1202351815/", "title": "‘Grey’s Anatomy’ Spinoff ‘Station 19’: How Creator Stacy McKee Is Stoking The Fire", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "SPOILER ALERT: This story contains details about Station 19's second episode tonight on ABC., \"Invisible to Me.\" Station 19 arrives punctually in the Time's Up movement, shedding a light on female firefighters.", "news_keywords": "ABC, Grey's Anatomy, Stacy McKee, Station 19", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Grey’s Anatomy’ Spinoff ‘Station 19’: How Creator Stacy McKee Is Stoking The Fire", "url": "https://deadline.com/2018/03/greys-anatomy-spinoff-station-19-creator-stacy-mckee-interview-1202351815/", "description": "SPOILER ALERT: This story contains details about Station 19’s second episode tonight on ABC., “Invisible to Me.” Station 19 arrives punctually in the Time’s Up movement, she…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/03/station-19.jpg?w=1024", "width": 1200, "height": 800, "alt": "Station 19"}, "locale": "en_US"}, "article": {"published_time": "2018-03-23T02:00:48+00:00", "modified_time": "2018-03-23T02:31:28+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘Grey’s Anatomy’ Spinoff ‘Station 19’: How Creator Stacy McKee Is Stoking The Fire"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/03/station-19.jpg?w=1024", "alt": "Station 19"}, "card": "summary_large_image", "creator": "@AwardsTony", "title": "‘Grey’s Anatomy’ Spinoff ‘Station 19’: How Creator Stacy McKee Is Stoking The Fire", "description": "SPOILER ALERT: This story contains details about Station 19’s second episode tonight on ABC., “Invisible to Me.” Station 19 arrives punctually in the Time’s Up movement, she…"}, "author": "Anthony D'Alessandro", "content_type": "Article", "post_id": 1202351815, "title": "'Grey's Anatomy' Spinoff 'Station 19': How Creator Stacy McKee Is Stoking The Fire", "published_at": "2018-03-22 19:00:48", "image": "https://pmcdeadline2.files.wordpress.com/2018/03/station-19.jpg?w=296&h=166&crop=1", "comment_count": 3, "tags": "Station 19", "topics": "TV", "body": "SPOILER ALERT: This story contains details about Station 19's second episode tonight on ABC., \"Invisible to Me.\"\r\n\r\nStation 19 arrives punctually in the Time's Up movement, shedding a light on female firefighters. Yes, this is a Grey's Anatomy spinoff, with the initial spark for this series being former Grey Sloan surgical resident Ben Warren (Jason George), who has traded his scalpel in for an axe. However, he's second banana to the real combustion that's brewing here: In the wake of her father and Station 19 chief Pruitt Herrera (Miguel Sandoval) being diagnosed with cancer, Andy Herrera (Jaina Lee Ortiz) finds herself in direct competition with her boyfriend Jack Gibson (Grey Damon) for the top job. But as we learn at the onset of tonight's episode, she's in the pole position to prove herself.\r\n\r\nTonight's second episode, \"Invisible to Me,\" finds her station responding to a pulled fire alarm at a middle school, from which we learn that Ben's son is the culprit -- but he's got his reasons. And while the rescue effort in an overturned tanker situation is the climax of tonight's show, in the final moments we find Warren and Dean Miller responding to, let's say, a potentially explosive situation involving the latter's new friend--maybe even future girlfriend--JJ (guest star Brenda Song), who is lying on the floor with a bleeding head after falling from a ladder: The fire alarm that Dean tried to fix earlier in the show still isn't working. Or is it?\r\n\r\nWe spoke with Station 19 creator Stacy McKee about what lies ahead in the remaining eight episodes. McKee wrote tonight's episode with Paris Barclay directing.\r\n\r\nDEADLINE: Let's start off with one of the most important questions coming off tonight's cliffhanger: Is that a bomb in JJ's apartment?\r\n\r\nMcKEE: We’re going to have all the pieces in the next episode in regards to what that cliffhanger indicates.\r\n\r\n\r\n\r\nDEADLINE: What is it about Ben Warren that makes him the best Grey's Anatomy character to lend himself to a spin-off? Going from being anesthesiologist to a firefighter -- is he going through a mid-life crisis? \r\n\r\nMcKEE:  I wouldn’t call it a mid-life crisis. For seasons, Ben was always striving to find the right thing. He wanted to do more, he wanted to cut, so he went to school to become a surgeon. He started from the ground-up and explored that world, and we watched him become the most amazing surgeon. He pushed the envelope and he would do things that he shouldn't, and would improvise (against proper practice) to help a patient. It's ingrained in his DNA to be at the forefront (of an emergency situation) and wanting to do the most good. He's a bit more fearless that way, so he was the most organic choice to walk away from the career as a surgeon to become a firefighter.\r\n\r\nDEADLINE: With other firefighter dramas like Chicago Fire on the air, is there ever any concern in the writers' room about keeping tabs on similar series so that you can stay fresh?\r\n\r\n\r\nMcKEE:  Not really, not for me. I feel like that there are other medical shows out there and cop shows and lawyer shows. I love Chicago Fire and I have so much respect for their storytelling. But their storytelling is theirs and ours is ours. I approach telling a story from the characters I build, and where I go personally and where I take them with the environment filtering into that. That's how I break story, and I want to do right and true with our characters first.\r\n\r\n\r\n\r\nDEADLINE: We know that women have made strides and broken through in such male-dominated professions as the military and police force. However, when it comes to firefighting, is Station 19 based on an actual firehouse, or are you leading by example in the series? \r\n\r\nMcKEE:  What's fascinating is that in Seattle, out of the entire country, they have the highest percentage of women in their fire department. Grey Sloan is already in Seattle and when I found that piece of information out, it was very inspiring to me and seemed like a natural step-up. We met with a lot of firefighters in the department and our set is inspired by the actual fire station in Seattle. We shot there for the pilot.\r\n\r\nDEADLINE: Can you tell us about the major crossovers that will take place between Station 19 and Grey's Anatomy? We already saw Dr. Meredith Grey show up in the pilot last week. Is Martin Henderson's Dr. Nathan Riggs making an appearance on the show?\r\n\r\nMcKEE:  I will never say never to Martin comingback. There will definitely be crossovers throughout the season, some bigger, and some smaller. It's important for me that the main characters cross-pollinate between the two shows. Ben Warren is still appearing on Grey's Anatomy, and there's some characters coming over from Grey's. \r\n\r\nDEADLINE: Tell us the inspiration about tonight's storyline: A middle school girl delivered a baby. Was this pulled from the headlines?\r\n\r\nMcKEE: That was shocking and while we see stories like this in the headlines periodically, it's less about ripping from them. It was about telling a story from Ben's connection to his son and watching what would happen when Ben's son saw his Dad in this new role, going from a surgeon to a firefighter, and how your own kid handles a situation like that [Editor's note: Ben's son pulled the fire alarm so that his father could help deliver the girl's baby]. It was something amazing from our storytelling point of view of watching Ben and how he would react to his son in that situation.\r\n\r\nDEADLINE: Is there another part to the baby story? Will we learn more about the father; is it Ben's son?\r\n\r\nMcKEE: We don’t have plans to see the baby's parents down the line. If you watch the following episodes, you'll see that these characters --firefighters and ER responders- only see a certain window of the people they're treating, unlike at Grey Sloan; we're sending that person to that fire until it's put out. It's been a real fascinating, interesting way to tell the story. That's what Ben Warren has to learn: You have to walk away from them, you don't follow up.\r\n\r\n\r\n\r\nDEADLINE: That was Marla Gibbs, Florence from The Jeffersons, making a cameo tonight as Aida. She gives the firemen a nice 'Hello' as they arrive at her senior living building. How did she join the show?\r\n\r\nMcKEE: In my initial pitch of the episode, I knew that nursing homes tend to be regular stops for firefighters, and our characters need to get to know people there. She has worked in Shondaland before (Editor's note: She played Rose on Scandal). I didn't have the chance to work with her, and only heard amazing things and jumped at the chance with her availability.\r\n\r\n\r\n\r\nDEADLINE: That was a great moment in the pilot where Dr. Meredith gives Andy Herrera a private place to cry when her father is in the hospital, and then instructs her to \"Put her game face on.\" Expound on this. \r\n\r\nMcKEE: That was such an important moment to see, because it embodies something bigger in these two shows. Meredith has grown up and learned to be on her own. I feel the character of Andy is just starting out. She's trying to figure out what to explore on her own. Like recognizes like. Meredith recognizes Andy, sees a certain fierceness, and she's a person who she can identify with. She can put herself in Andy's shoes; a number of years ago, if she had been her, this is what Meredith would have needed; she's passing a baton and helping Andy with what she needs to do next.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1521770448.0, "source": "https://deadline.com", "summary": ""}