{"url": "https://www.theknotnews.com/jennifer-lopez-and-alex-rodriguez-relationship-goals-32358", "text": "Everything about Jennifer Lopez and Alex Rodriguez‘s relationship points to success, beginning with their respective empires across the categories of dance, music, sports, entrepreneurship and more, all the way to their joint couple name, “J-Rod.” Indeed, it seems that the couple has finally discovered lasting love.\n\nWhile they have yet to be engaged as Rodriguez confirmed on the Today show this week, The Knot rounds up some of the reasons why this celebrity couple is on the road to lasting love.\n\nTiming Was Everything—And They See It\n\nBoth Lopez and Rodriguez have been honest about their past failures with love—previous marriages and engagements included—and why they’re both ready now. “We have to take our time. I’ve made plenty of mistakes in my past,” Lopez previously told Good Morning America. “We’re mature now. We’re grown ups, and we’re going to take our time and we’re going to do things at our own pace.”\n\nOn Wednesday, August 1, Rodriguez touched on how age has played into the dynamics of their relationship in a good way. “To be honest, if this happened when we were in our twenties, it would have never happened,” he said. “It was just too much craziness. I wasn’t mature enough. You know, boys, we got to get our dumbness out of the way.”\n\nThey Share Similar Life Stages\n\nRodriguez also explained how they bond over the parallels in their lives. “We’re in our forties. We’re both from New York,” he mused on the Today show. “We both come from Latino backgrounds. We both have two kids. I think we’ve both been through a lot and can really appreciate each other—both the good and the challenges.”\n\nLopez echoed her boyfriend’s notes about their similar life stages in an interview with Cubby and Carolina in the Morning this week. “I think we’re both in a good place in our lives,” she said on the radio program. “Now at this point in our lives where we both have kids, we both have accomplished certain things in our careers and we’re kinda in that second act of our lives, we really complement each other. It’s like, where I need help, he’s really strong and where he needs help I’m really strong.”\n\nThey Sharpen Each Other\n\nWith dynamic and thriving careers, both Lopez and Rodriguez continue to look for the next derivative of personal and professional growth. “I’m in a good relationship. I feel like I can say that for the first time, I don’t know, maybe ever,” she previously told Hola! “And not that I didn’t have great relationships, full of love and adventure, but this is the first relationship I’ve been where I feel like we really make each other better. We complement each other, and there’s really pure, true love. Just wanting to support the other person and make them happy. So there’s a different selflessness in the love that’s beautiful and different. And healthy!”\n\nTheir Modern Family Loves Each Other\n\n“Honestly it couldn’t be better,” Lopez added to Cubby and Carolina this week. “The four of them are amazingly special kids. I mean, of course I’m going to say that because I’m their mom, but they are and they’re sweet and they’re loving and they deal with us and our lifestyle in such a great way. And they love each other, they get along so good.”\n\nTheir Love Story Was Meant to Be\n\nIn a detailed Vanity Fair piece, Lopez went into detail about the beginning stages of their romance. In fact, it almost didn’t happen. “It was just one of those things where you feel compelled to do something you wouldn’t normally do,” she recalled. “I almost yelled out ‘Alex,’ but I am the shyest person when it comes to things like that… I could literally just have walked away. But I walk over and tap him on the shoulder and say ‘Hey.’”\n\nTheir first date was equally surprising. “He was sitting there in his white shirt, very confident and manly, but then he was just so talkative!” she recalled to Vanity Fair. “I think he thought I was going to be this loud person, but I’m not. I just listen. So he’s talking, talking about his plans, about how he had just retired from baseball, about how he saw himself getting married again, all these things you wouldn’t normally talk about on a first date. I don’t know if he thought it was a date. I thought it was a date.”\n\nSecure your ideal wedding vision by starting with The Knot’s Style Quiz, here.", "images": ["https://media-api.xogrp.com/images/cec381d2-93e9-4201-9271-30f51f4fec94~rs_200.h", "https://www.theknotnews.com/wp-content/authors/elee-9.jpg", "https://www.theknotnews.com/wp-content/uploads/2016/12/cropped-the-knot-news-logo@2x.png", "https://www.theknotnews.com/wp-content/uploads/2020/03/Brittany-Tyler-Couch-Story-Lead-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/Questions-About-How-Coronavirus-Could-Affect-Your-Wedding_-Read-This-LEAD-shutterstock-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/IMG_2127-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/89960078_664744544273850_2656838980867194880_o-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/shutterstock_1554396644-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2018/08/Lopez-Rodriguez-1500.jpg"], "top_img": "https://www.theknotnews.com/wp-content/uploads/2018/08/Lopez-Rodriguez-1500.jpg", "keywords": [], "authors": ["Esther Is The Senior News Editor At The Knot. A Self-Proclaimed Pop Culture Enthusiast", "She Appreciates A Good Celebrity Interview Just As Much As She Adores Nancy Meyers Movies. You Can Find Her Kicking Off Her Mornings With Barre", "A Green Juice", "Traveling", "Exploring New Cultures", "Rapidly Scrolling Her Feed For The Latest", "Greatest News. Follow Her On Instagram", "Twitter At"], "canonical_link": "https://www.theknotnews.com/jennifer-lopez-and-alex-rodriguez-relationship-goals-32358", "title": "Why Jennifer Lopez and Alex Rodriguez Are Relationship Goals", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no, minimal-ui", "description": "No, they’re not engaged just yet, but The Knot rounds up five reasons why this celebrity couple is meant to be.", "og": {"locale": "en_US", "type": "article", "title": "Why Jennifer Lopez and Alex Rodriguez Are Relationship Goals", "description": "No, they’re not engaged just yet, but The Knot rounds up five reasons why this celebrity couple is meant to be.", "url": "https://www.theknotnews.com/jennifer-lopez-and-alex-rodriguez-relationship-goals-32358", "site_name": "The Knot News", "updated_time": "2018-08-02T22:01:04+00:00", "image": {"identifier": "https://www.theknotnews.com/wp-content/uploads/2018/08/Lopez-Rodriguez-1500.jpg", "secure_url": "https://www.theknotnews.com/wp-content/uploads/2018/08/Lopez-Rodriguez-1500.jpg", "width": 1500, "height": 1200}}, "article": {"tag": "Jennifer Lopez", "section": "Celebrity", "published_time": "2018-08-02T21:50:01+00:00", "modified_time": "2018-08-02T22:01:04+00:00"}, "twitter": {"card": "summary", "description": "No, they’re not engaged just yet, but The Knot rounds up five reasons why this celebrity couple is meant to be.", "title": "Why Jennifer Lopez and Alex Rodriguez Are Relationship Goals", "image": "https://www.theknotnews.com/wp-content/uploads/2018/08/Lopez-Rodriguez-1500.jpg", "creator": "@theestherlee"}, "generator": "WordPress 4.9.8", "wp-parsely_version": "2.0", "msapplication-TileImage": "https://static.xoedge.com/patterns/images/windows-tile-144x144.png", "HandheldFriendly": "True", "MobileOptimized": 320, "mobile-web-app-capable": "yes", "msapplication-square70x70logo": "https://static.xoedge.com/patterns/images/windows-tile-70x70.png", "msapplication-square150x150logo": "https://static.xoedge.com/patterns/images/windows-tile-150x150.png", "msapplication-square310x310logo": "https://static.xoedge.com/patterns/images/windows-tile-310x310.png", "msapplication-TileColor": "#6CC6F0"}, "movies": [], "publish_date": 1533246601.0, "source": "https://www.theknotnews.com", "summary": ""}