{"url": "https://www.npr.org/2014/10/31/359827368/anything-that-connects-a-conversation-with-taylor-swift", "text": "'Anything That Connects': A Conversation With Taylor Swift\n\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\n\nTaylor Swift has had one amazing week. Her new album, released Monday, is on track to eclipse 1 million sales by Tuesday. The last artist to go platinum in a week was Swift herself with her 2012 album, Red. So by the time she arrived at NPR's New York bureau today, she'd earned the right to a little goofiness — in this case, showing up in her Halloween costume, a fuzzy white bodysuit with wings that she described as a Pegasus-unicorn hybrid.\n\nHer new album is titled 1989. That's the year Swift was born, which means that at just shy of 25 years old, she's spent close to half her life in the music industry. In a far-reaching conversation with NPR's Melissa Block, she addressed how things have changed since she began her career a decade ago — not just for her, but for the teenaged girls who have always been her primary demographic — as well as how she's reacted to the digital age's effect on media, music and feminism. Hear the radio version at the audio link, and read more of their conversation below.\n\nMelissa Block: I enlisted some expert outside counsel for this interview: my 12-year-old daughter. And I want to start with a question from her. \"In your hit song 'Shake It Off,' why'd you address the song to your haters and not your motivators?\"\n\nTaylor Swift: That's amazing. With the song 'Shake It Off,' I really wanted to kind of take back the narrative, and have more of a sense of humor about people who kind of get under my skin — and not let them get under my skin. There's a song that I wrote a couple years ago called \"Mean,\" where I addressed the same issue but I addressed it very differently. I said, \"Why you gotta be so mean?\" from kind of a victimized perspective, which is how we all approach bullying or gossip when it happens to us for the first time. But in the last few years I've gotten better at just kind of laughing off things that absolutely have no bearing on my real life. I think it's important to be self-aware about what people are saying about you, but even more so, be very aware of who you actually are, and to have that be the main priority.\n\nHere's a related question about the same song, from a 7th grader. She's thinking about the lyrics, and she says, \"That sounds a lot like middle school. Do you have anything that you can tell a middle school girl to help 'shake it off'\"?\n\nShe's exactly right. When I was in middle school, I had this fantasy — and I really thought this was how life worked — that when we were in school, we had to deal with bullying and kids picking on you for no reason, or making you feel like somehow don't deserve what you want, or you're not what you should be. And I thought that when you grow up and you're not in school anymore, when you're out there in the world with adults, that it's not like that anymore, that people don't attack each other for no reason or try to tear each other down. And I realized when I grew up that it's the same. It's the same dynamics, except we're not walking from classroom to classroom.\n\nIt's just interesting how you have to learn how to deal with this at one point or another in your life because people don't necessarily ever grow out of those impulses to pick on each other. Some of us do; some of us realize that's something you do when you're insecure, you try to lash out at someone else. But a lot of people will always do that to other people. So I guess what I try to encourage girls who are in middle school to do is to figure out a way to distract yourself from that negativity. Figure out what kind of art you love to create, or your favorite hobby. Something to throw all of your energy into. And realize that you're gonna have to learn how to cope with this at some point — because it's never going to end, necessarily.\n\nYouTube\n\nThere's definitely a different sound on this new album. You've left country completely behind; this is a really highly produced electronic pop album. But you also say to your fans in the liner notes that \"this is a different story line than I've ever told you before.\" I'm not sure I'm hearing that — so what do you think is new about the storyline in these songs?\n\nIn the past, I've written mostly about heartbreak or pain that was caused by someone else and felt by me. On this album, I'm writing about more complex relationships, where the blame is kind of split 50-50. I'm writing about looking back on a relationship and feeling a sense of pride even though it didn't work out, reminiscing on something that ended but you still feel good about it, falling in love with a city, falling in love with a feeling rather than a person. And I think there's actually sort of a realism to my new approach to relationships, which is a little more fatalistic than anything I used to think about them. I used to think that, you know, you find \"the one.\" And it's happily ever after, and it's never a struggle after that. You have a few experiences with love and relationships, and you learn that that's not the case at all. Lots of things are gray areas and complicated situations, and even if you find the right situation relationship-wise, it's always going to be a daily struggle to make it work. So those are different themes that I don't think people have really seen in my lyrics before.\n\nIs the song \"Wildest Dreams\" maybe an example of that?\n\nThat's actually a really good example of the way I go into relationships now. If I meet someone who I feel I have a connection with, the first thought I have is: \"When this ends, I hope it ends well. I hope you remember me well.\" Which is not anything close to the way I used to think about relationships. It's that realization that it's the anomaly if something works out; it's not a given.\n\nAre there new musical influences here? Some music reviewers have been mentioning the influence of Lorde or Lana Del Rey or maybe Robyn in some of your songs. What do you hear?\n\nI hear Peter Gabriel and I hear Annie Lennox. Those were the two artists that I was listening to a lot when I was making this record. What Annie does is so interesting to me, and it's not something you could ever try to duplicate. But the way she conveys a thought, there's something really intense about it. And I think that's something I'll always aspire to.\n\nAnd what about Peter Gabriel?\n\nWith Peter, that's an artist who has such incredible taste and such an incredible finger on the pulse of what would excite people, musically. What he was doing in the '80s was so ahead of its time, because he was playing with a lot of synth-pop sounds, but kind of creating sort of an atmosphere behind what he was singing, rather than a produced track. It was just kind of astonishing how he was able to do that. And then you see him in his later work, when he did that album full of modern-day covers. I mean, I just think that he's remarkable at giving people what they want, but they didn't think they wanted.\n\nI want to ask you about the song \"Out Of The Woods.\" There's this intriguing lyric in there about somebody \"hitting the brakes too soon, 20 stitches in a hospital room.\" What's that about?\n\nThat line is in there because it's not only the actual, literal narration of what happened in a particular relationship I was in, it's also a metaphor. \"Hit the brakes too soon could mean the literal sense of, we got in an accident and we had to deal with the aftermath. But also, the relationship ended sooner than it should've because there was a lot of fear involved. And that song touches on a huge sense of anxiety that was, kind of, coursing through that particular relationship, because we really felt the heat of every single person in the media thinking they could draw up the narrative of what we were going through and debate and speculate. I don't think it's ever going to be easy for me to find love and block out all those screaming voices.\n\nYouTube\n\nNot to ignore the broader metaphor here, but I am curious about the actual event. What happened?\n\nI'll bet you are. That's kind of between us, between the two people who it happened to. I think I put it in the song knowing it was an evocative lyric. And it was almost like this very strange, subtle clue to the media that they don't know everything that happened in that relationship, and they don't know everything that happens in my life, and I can have something really major and traumatic happen to me and they don't know about it.\n\nHow rare are those moments? When you feel like you can do something on your own that nobody will know about if you don't want them to.\n\nIt's strange because my life now is really abnormal. I get used to the fact that when I go out, there's gonna be a line of people wanting pictures on their phone, and there's gonna be crowds everywhere, even if there weren't crowds when I walked into a store. I realize the only privacy I'm really entitled to is when I'm in my own apartment or my own home, 'cause everything else is kind of — I'm looked at as sort of public property. And there's nothing I can do about that perception except control my mental perspective on it, which is, I need to treat people well. I need to be grateful. I need to take pictures with people when they ask for one. So if I'm not in the mood to do that, I don't leave my house.\n\nYou also do, in a certain way, make yourself pretty accessible through social media, right? You've been posting Polaroids of your fans holding your new album on your Twitter feed. And you chose fans to invite over to your various homes to have listening parties for the new album — made them cookies, I think? You do have this funny dynamic of bringing people in a very managed way, in a very calculated way, and then having to figure out where the boundary is.\n\nWell, yeah. I like for them to be in situations where they feel they can be themselves. Places they can't be themselves are when they're being pushed up against a barricade and there are thousands of them outside of a talk show, and they're trying to get a picture but they're screaming and everybody's freaking out. They can't necessarily be themselves when they're in these chaotic situations where fans usually find themselves.\n\nI've been on the internet for hours every single night figuring out what these people want from me.\n\nI did this thing called the 1989 Secret Sessions a few months ago, way before the album came out. I had spent months picking fans on Instagram, Tumblr, Twitter — people who had been so supportive and had tried and tried to meet me, had been to five shows or however many events but had never met me before. And so I picked these people. And in every single one of my houses in the U.S. and my hotel room in London, I would invite 89 people over to my living room, play them the entire album, tell them the stories behind it. And I'd say, you know, you can share your experience, but please keep the secrets about this album a secret. Let's not talk about lyrics before the album comes out. Let's not talk about song titles. And if you see anybody leaking music, please let us know.\n\nWe spent four hours together each night, taking Polaroids and having a great time and giving them a chance to tell me their stories that they wanted to tell in their own time. Not being rushed. Not having to feel panic. And then they went back out into the world, and they kept those promises. They didn't talk about lyrics. They didn't spoil the secret for other fans. Two days before the album came out, it leaked online, and it was the first time I've ever had an album leak without it trending on Twitter — because my fans protected it. Anytime they'd see an illegal post of it, they'd comment, \"Why are you doing this? Why don't you respect the value of art? Don't do this. We don't believe in this. This is illegal. This isn't fair. This isn't right.\" And it was wild seeing that happen.\n\nWhat do you think other artists could take from that? You are having huge success with this album at a time when a lot of artists can't sell albums to the same extent as they used to.\n\nWell I truly believe in the album. From the start of making one to the time it's finished, I focus on there being a visual theme and emotional DNA to it — including the physical package. I mean there has to be an incentive to go to a store, buy a CD. What people who are forecasting the downfall of the music industry don't think about is that there is a still a huge percentage of the country who drive their kids to school every day and play a CD and listen to it with their kids – there's a CD in the CD player in their car. So I understand that the industry's changing and a lot of people are streaming. However, there are a lot of people who aren't, which is what this release reflects. And so, in the physical CD, we've done an exclusive at Target that has three extra songs. It has three songwriting voice memos from my cell phone that were, you know, the initial rough rough ideas that I had; we put those on the album so people can have insight into the songwriting process. I have five sets of 13 Polaroids from the album photo shoot that are in an envelope in the CD, and depending on what album they get, they'll get a different set of polaroids with lyrics written on the bottom of them. So it's very much an experience that's different than downloading the music itself. It's almost like this kind of collector's edition, the physical copy.\n\nI can imagine other singers listening to this saying, \"You know, that's great for Taylor Swift. She has the resources to do all that. It's great marketing, but it's not art — and the rest of us are on a different playing field. We just can't compete with that.\"\n\nI think that the way that the music industry is changing so quickly, we can learn something from every big release, anything that connects with people. At the end of the day, this is a case by case scenario. If some other artist tries to has the same exact marketing campaign, tries to do secret living room sessions, that's great — if it makes a connection with their fans. If it doesn't make a connection with their fans, then it's not gonna work for them. And I think that what we need to start doing is catering our release plans to our own career, to our own fans, and really get in tune with them. I've been on the internet for hours every single night figuring out what these people want from me. And when it came time to put out an album, I knew exactly what to do.\n\nLet's think back to when your first album came out, when you were 16. You'd moved to Nashville with your parents to try to make this dream of yours come true. You were writing really personal songs about young love and your broken heart. Can you go back to those songs now? I mean, is there any way you can tap into that 16-year-old girl — or even younger, when you wrote them?\n\nI wrote my first album when I was 14 and 15, so now we're going on 10 years of making albums right now. The formula has never changed, in that I try to make an album that best represents the last two years of my life. People have essentially gotten to read my diary for the last 10 years. I still write personal songs, and sometimes people like to put a very irritating, negative, spin on that — as if I'm oversharing, as if it's too much information — when this has been the way I've lived my life and run my career the entire time. So I do think it's really important that I continue to give people an insight into what my life is actually like, even though it comes at a higher cost now.\n\nIf you were to go back and perform one of your earliest songs, a song like \"Tim McGraw,\" say, from your first album, could you connect? Could you go back to the girl who wrote that song as a young teenager?\n\nYes and no. When I do a live show, there are certain songs fans really want to hear, and I'm gonna always play those songs. There's a song called \"Love Story\" that I wrote when I was 17. I'm going to be playing that as long as I'm playing concerts. And I can go back and I can connect to that song — because of the stories I've heard from fans saying, \"We walked down the aisle to that song,\" or how special I feel it was when that was our first No. 1 worldwide hit. But \"Tim McGraw,\" that song I don't really connect to as much. I connect to it in the form of nostalgia, but that was a song about a first love. I'm in a very different place in my life right now, and I think you can only hope to grow so much, emotionally, that you can't necessarily connect to wide-eyed 15-year-old ideas of love anymore.\n\nI've been thinking about that song — I was listening to it today — because it feels to me like \"Wildest Dreams\" is in many ways the 10-years-older version of \"Tim McGraw,\" of telling somebody, \"Look back and remember me this way.\" In that song it's a black dress and in the new song, I think it's a fancy dress.\n\nAbsolutely. I didn't think about that at all. The only difference is that \"Tim McGraw,\" I wrote that song about a relationship that had already ended, hoping that he would remember me well. \"Wildest Dreams\" is about a relationship that is just beginning and already foreshadowing the ending of it.\n\nLike I said, I am the mother of a 12-year-old girl, and she loves your music. Her friends love your music. You have a huge platform among a very vulnerable, impressionable set of the population. And I wonder if you think about turning your lens outward, turning it away from the diary page, and sending a broader message to girls who would be really receptive to hearing about big ideas and the big world that's outside.\n\nLike what kind of messages?\n\nWell, other characters. I don't mean to minimize the effect of a love song or a pop song. But do you ever think about writing about other experiences, things that might turn girls away from themselves in a different way?\n\nWe are dealing with a huge self-esteem crisis. These girls are able to scroll pictures of the highlight reels of other people's lives, and they're stuck with the behind-the-scenes of their own lives.\n\nThere's nothing that's gonna turn girls away from themselves at age 12. I think that it's really important that I speak about things in interviews that I'm passionate about. I have brought feminism up in every single interview I've done because I think it's important that a girl who's 12 years old understands what that means and knows what it is to label yourself a feminist, knows what it is to be a woman in today's society, in the workplace or in the media or perception. What you should accept from men, what you shouldn't, and how to form your own opinion on that. I think the best thing I can do for them is continue to write songs that do make them think about themselves and analyze how they feel about something and then simplify how they feel. Because, at that age — really at any age, but mostly that age — what can be so overwhelming is that you're feeling so many things at the same time that it's hard to actually understand what those emotions are, so it can turn to anxiety very quickly.\n\nWe are dealing with a huge self-esteem crisis. These girls are able to scroll pictures of the highlight reels of other people's lives, and they're stuck with the behind-the-scenes of their own lives. They wake up and they look at their reflection in the mirror, and they compare it to some filtered, beautiful photo of some girl who's really popular and seems like she has it all together. This is not what you and I had to deal with when we were 12. It's so easy and readily available to compare yourself to others and to feel like you lose.\n\nI'm 24. I still don't feel like it's a priority for me to be cool, edgy, or sexy. When girls feel like they don't fit into those three themes, which are so obnoxiously thrust upon them through the media, I think the best thing I can do for those girls is let them know that this is what my life looks like. I love my life. I've never ever felt edgy, cool, or sexy. Not one time. And that it's not important for them to be those things. It's important for them to be imaginative, intelligent, hardworking, strong, smart, quick-witted, charming. All these things that I think have gone to the bottom of the list of priorities. I think that there are bigger themes I can be explaining to them, and I think I'm trying as hard as I possibly can to do that.\n\nI'm really surprised to hear you say that you never feel cool or edgy or sexy. I mean, you spend a lot of time on red carpets. You go to fashion shows. Those three words don't fit into your view of yourself?\n\nNot at all. I mean, going back to your daughter's age, I think a lot of our self-esteem and self-image is frozen in those formative years. And that was not a time in my life where I felt accepted or invited or like I belonged. And so I've kind of come into my own in that I no longer prioritize feeling those things.\n\nYou mentioned earlier you try to talk about feminism. What does feminism mean to you?\n\nI mean, by my basic definition, it means that you hope for equal rights and opportunities for men and women.\n\nAnd how does that play out in the music world that you're a part of? I mean, do you feel like that's not an issue for you anymore?\n\nIt's an issue every day that I read a headline that says, \"Careful, guys. She'll write a song about you.\" Meanwhile, I have best friends who are male musicians and songwriters, who write songs about their girlfriends and their ex-girlfriends, and that joke is never made about them. As women in public eye, our relationships are tallied up in ways that they aren't for men. And if men have a lot of relationships that are tallied up, it's thought of as mischievous, cheeky. \"Oh he's just out again with another girl.\" It's somehow done with a wink and a smile and for us, and it's supposed to be shameful, if we've had a few relationships that haven't worked out. When I open up a magazine and it says, \"Who's the hotter mama: J-Lo or Beyoncé ?\" You don't see, \"Who's the hotter dad: Matt Damon or Ben Affleck?\" It just doesn't happen. And if we continue this perception that women should be compared to other women and there's a winner and a loser, we're doing ourselves a huge disservice as a society.\n\nTaylor Swift, thanks so much for coming in to talk to us. I appreciate it.\n\nThank you; it's been good to talk to you, too. Tell your daughter hey for me.", "images": ["https://media.npr.org/assets/img/2020/03/24/undefined_sq-63f9f4b46bb9031d67f9785b66818f4befbab8bc.jpg?s=100", "https://media.npr.org/assets/img/2014/10/30/ts_photo_pr0500_0878_hirescrop-copy-97a9f606ce59a8f05c0ab40eda3ce85726c00ab2-s1100-c15.jpg", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://media.npr.org/assets/img/2012/11/02/066_sq-adcb6bc02d15e50ef5aaa58bb42bf2074aa53c96-s100-c15.jpg", "https://www.facebook.com/tr?id=1621557368158968&ev=PageView&noscript=1", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/assets/img/2014/10/30/taylor-swift-sunglasses_sq-d56f87a930be44226a83e276025505ac9ecfe0b5-s100-c15.jpg", "https://media.npr.org/assets/img/2014/10/30/ts_photo_pr0500_0878_hirescrop-copy_wide-60d32b98c0ca6f4f256ab8adc90d558affd71981.jpg?s=1400", "https://media.npr.org/assets/img/2020/03/17/coronavirus_daily_final__sq-2aca96317281db7f8671e5bf24e68fb77b66bbed.png?s=100", "https://media.npr.org/assets/img/2020/02/21/invisibiliapodcasttile-3000x3000_sq-3cea16f264a5ecd812496bd930d38c4f54102d6e.png?s=100", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/assets/img/2020/03/09/trh_podcast-tile_sq-c05fb259465d433a5cf8a21248b8fa209a6b7690.png?s=100", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/music/news/2010/11/taylorswift_sq-4ba0ba5f41d9a1ced121cf614f56328ab6e5bda9-s100-c15.jpg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/chrome/programs/logos/fresh-air.png"], "top_img": "https://media.npr.org/assets/img/2014/10/30/ts_photo_pr0500_0878_hirescrop-copy_wide-60d32b98c0ca6f4f256ab8adc90d558affd71981.jpg?s=1400", "keywords": [], "authors": ["Npr Staff"], "canonical_link": "https://www.npr.org/2014/10/31/359827368/anything-that-connects-a-conversation-with-taylor-swift", "title": "'Anything That Connects': A Conversation With Taylor Swift", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2014-10-31", "description": "Just shy of 25, Swift's been in the music industry nearly half her life. In an extended interview with NPR's Melissa Block, she addresses what's changed in music, media, feminism and her own career.", "og": {"title": "'Anything That Connects': A Conversation With Taylor Swift", "url": "https://www.npr.org/2014/10/31/359827368/anything-that-connects-a-conversation-with-taylor-swift", "type": "article", "description": "Just shy of 25, Swift's been in the music industry nearly half her life. In an extended interview with NPR's Melissa Block, she addresses what's changed in music, media, feminism and her own career.", "image": "https://media.npr.org/assets/img/2014/10/30/ts_photo_pr0500_0878_hirescrop-copy_wide-60d32b98c0ca6f4f256ab8adc90d558affd71981.jpg?s=1400", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "title": "'Anything That Connects': A Conversation With Taylor Swift", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2014/10/30/ts_photo_pr0500_0878_hirescrop-copy_wide-60d32b98c0ca6f4f256ab8adc90d558affd71981.jpg?s=1400"}}}, "movies": ["https://www.youtube.com/embed/nfWlot6h_JM?rel=0", "https://www.youtube.com/embed/JLf9q36UsBk?rel=0"], "publish_date": 1414684800.0, "source": "https://www.npr.org", "summary": ""}