{"url": "https://en.wikipedia.org/wiki/Barbara_Bush", "text": "For other people named Barbara Bush, see Barbara Bush (disambiguation)\n\nFormer First Lady of the United States\n\nBarbara Bush[1] (née Pierce; June 8, 1925 – April 17, 2018) was the first lady of the United States from 1989 to 1993 as the wife of George H. W. Bush, who served as the 41st president of the United States, and founder of the Barbara Bush Foundation for Family Literacy. She previously was the second lady of the United States from 1981 to 1989. Among her six children are George W. Bush, the 43rd president of the United States, and Jeb Bush, the 43rd governor of Florida. She and Abigail Adams are the only two women to be the wife of one U.S. president and the mother of another.[2]\n\nBarbara Pierce was born in New York City. She met George Herbert Walker Bush at the age of sixteen, and the two married in Rye, New York in 1945, while he was on leave during his deployment as a Naval officer in World War II. They moved to Texas in 1948, where George later began his political career.[3]\n\nEarly life [ edit ]\n\nBarbara Pierce was born on June 8, 1925, at Booth Memorial Hospital, a Salvation Army facility at 314 East 15th Street on Stuyvesant Square in the New York City borough of Manhattan, to Pauline (née Robinson) and Marvin Pierce. Because Booth Memorial Hospital moved in 1954 to Flushing, Queens (where it is now called New York-Presbyterian Hospital Queens), her birthplace is sometimes misreported as having taken place there, but that is an historical impossibility based on confusion about the hospital name. She was raised in the suburban town of Rye, New York.[4] Her father later became president of McCall Corporation, the publisher of the popular women's magazines Redbook and McCall's. She had two elder siblings, Martha (1920–1999) and James (1922-1993), and a younger brother, Scott (b. 1930). Her ancestor, Thomas Pierce Jr., an early New England colonist, was also an ancestor of Franklin Pierce, 14th president of the United States. She was a fourth cousin, four times removed, of Franklin Pierce and Henry Wadsworth Longfellow.[5]\n\nPierce and her three siblings were raised in a house on Onondaga Street in Rye. She attended Milton Public School from 1931 to 1937, Rye Country Day School until 1940[6] and later the boarding school Ashley Hall in Charleston, South Carolina, from 1940 to 1943.[4] In her youth, Pierce was athletic and enjoyed swimming, tennis, and bike riding.[4] Her interest in reading began early in life; she recalled gathering and reading with her family during the evenings.[4]\n\nMarriage and family [ edit ]\n\nBarbara Bush, center, surrounded by her family, mid 1960s\n\nWhen Pierce was 16 and on Christmas vacation, she met George H. W. Bush (1924-2018) at a dance at the Round Hill Country Club in Greenwich, Connecticut;[7] he was a student at Phillips Academy in Andover, Massachusetts.[8] After 18 months, the two became engaged to be married, just before he went off to World War II as a Navy torpedo bomber pilot. He named three of his planes after her: Barbara, Barbara II, and Barbara III. When he returned on leave, she had discontinued her studies at Smith College in Northampton, Massachusetts;[4] two weeks later, on January 6, 1945, they were married at the First Presbyterian Church in Rye, New York,[4] with the reception being held at The Apawamis Club.[9] They were married 73 years until her death on April 17, 2018, the longest married presidential couple in U.S. history until Jimmy and Rosalynn Carter beat their record on October 17, 2019.\n\nFor the first eight months of their marriage, the Bushes moved around the Eastern United States, to places including Michigan, Maryland, and Virginia, where George Bush's Navy squadron training required his presence.[4]\n\nOver the next 13 years, George and Barbara Bush had six children who, among them, gave the couple a total of 17 grandchildren and 9 great-grandchildren:\n\nTexas years [ edit ]\n\nAfter the war ended, George and Barbara had their first child while George was a student at Yale University. Famously, the child's very first words were \"How's Barbara?\" - a phrase she had heard echo from her father daily on his return from work. The young family soon moved to Odessa, Texas, where George entered the oil business. In September 1949, Barbara's parents were in a car accident in New York and her mother was killed. Mrs. Bush was pregnant at the time with her second child, and was advised not to travel to attend the funeral. When the baby was born, she was named Pauline Robinson Bush in honor of Barbara's mother.[10] The Bushes moved to the Los Angeles area for a time, and then to Midland, Texas in 1950. The Bushes would move some 29 times during their marriage.[4] Over time, Bush built a business in the oil industry and joined with colleagues to start up the successful Zapata Corporation. Barbara raised her children while her husband was usually away on business. In 1953, the Bushes' daughter, Robin, died of leukemia.[4]\n\nWhen their daughter Dorothy was born in August 1959, the Bushes moved from Midland to Houston. In 1963, George Bush was elected Harris County Republican Party chairman, in the first of what would become many elections. In 1964, he made his first run for a prominent political office—U.S. senator from Texas. Although he lost the election, the exposure that the Bush family received put George and Barbara on the national scene.[4]\n\nPolitical life [ edit ]\n\nIn 1966, George Bush was elected as a U.S. representative in Congress from Texas. Barbara raised her children while her husband campaigned and occasionally joined him on the trail. Over the ensuing years, George Bush was elected or appointed to several different positions in the U.S. Congress or the executive branch, or government-related posts, and Barbara Bush accompanied him in each case.\n\nThe Bushes celebrate in Houston on the evening in 1966 that George was elected a congressman.\n\nAs the wife of a congressman, Barbara immersed herself in projects that piqued her interest; the projects included various charities and Republican women's groups in Washington, D.C.[4] Though her husband lost a second bid for the Senate in 1970, President Richard Nixon appointed him the United States ambassador to the United Nations, which enabled Barbara to begin forming relationships in New York City with prominent diplomats.[4] As the Watergate scandal heated up in 1973, Nixon asked Bush to become Chairman of the Republican National Committee; Barbara advised her husband to reject the offer because of the harsh political climate,[4] but he accepted anyway.\n\nNixon's successor, Gerald Ford, appointed Bush head of the U.S. Liaison Office in the People's Republic of China in 1974, and the Bushes relocated. She enjoyed the time that she spent in China and often rode bicycles with her husband to explore cities and regions that few Americans had visited.[4] Three years later, Bush was recalled to the U.S. to serve as Director of Central Intelligence during a crucial time of legal uncertainty for the agency. He was not allowed to share classified aspects of his job with Barbara; the ensuing sense of isolation, coupled with her perception that she was not achieving her goals while other women of her time were, plunged her into a depression.[4][11] She did not seek professional help. Instead, she began delivering speeches and presentations about her time spent in the closed-off China, and volunteered at a hospice.[4]\n\nBarbara Bush defended her husband's experience and personal qualities when he announced his candidacy for President of the United States in 1980. She caused a stir when she said that she supported ratification of the Equal Rights Amendment and was pro-choice on abortion,[4] placing her at odds with the conservative wing of the Republican party, led by California governor Ronald Reagan. Reagan earned the presidential nomination over her husband, who then accepted Reagan's invitation to be his running mate; the team was elected in 1980.\n\nSecond Lady of the United States [ edit ]\n\nBarbara Bush's eight years as second lady made her a household name. After her son Neil was diagnosed with dyslexia, she took an interest in literacy issues and began working with several different literacy organizations. She spent much time researching and learning about the factors that contributed to illiteracy—she believed homelessness was also connected[12]—and the efforts underway to combat both.[4] She traveled around the country and the world, either with the vice president on official trips or by herself. In 1984, she wrote a children's book, C. Fred's Story, which recounted the adventures of a family as related by their cocker spaniel, C. Fred. She donated all of the book's proceeds to literacy charities.[12]\n\nBy the mid-1980s, Bush was comfortable speaking in front of groups, and she routinely spoke to promote issues in which she believed. She became famous for expressing a sense of humor and self-deprecating wit.[4] During the 1984 presidential campaign, Barbara made headlines when she told the press that she could not say on television what she thought of vice presidential candidate Geraldine Ferraro, but \"it rhymes with rich\".[13] After receiving criticism for the comment, Bush said she did not intend to insult Ferraro.[14]\n\nIn 1988, Vice President Bush announced his candidacy for president to succeed the term-limited President Reagan. By this time, Barbara had experienced two presidential campaigns, but broke new ground by becoming the third candidate's spouse to speak at the national party convention that nominated her husband (after Eleanor Roosevelt in 1940 and Pat Nixon in 1972).[4] She promised voters that she would be a traditional first lady and campaigned actively for her husband.[12] The campaign at times focused on the large Bush family, and contrasted her with the incumbent first lady, Nancy Reagan, by highlighting her interest in domestic staples such as church, gardening, and time spent with family while placing less emphasis on style sense and fashion; she drew attention to both her famous white hair and disinterest in wearing designer clothes.[4] She generally avoided discussion of political issues during the campaign, particularly those on which she and her husband differed, and those closely involved with the campaign have reported that she was actively involved in campaign strategy.[4] Bush was elected in November 1988 and sworn in on January 20, 1989.\n\nFirst Lady of the United States [ edit ]\n\nActivism [ edit ]\n\nSesame Street at United Studios (1989). Mrs. Barbara Bush participates in a taping of the television showat United Studios (1989).\n\nBush and Missouri Governor John Ashcroft attending a \"Parents as Teachers\" parent-child group, 1991\n\nFamily literacy was Barbara Bush's cause as first lady, and she called it \"the most important issue we have\".[15] She became involved with many literacy organizations, served on literacy committees and chaired many reading organizations. Eventually, she helped develop the Barbara Bush Foundation for Family Literacy.[16] She continued to be dedicated to eliminating the generational cycle of illiteracy in America by supporting programs where parents and their young children are able to learn together. During the early 1980s, after statistics had shown that foreign-born immigrants from Latin America had nearly quintupled just since 1960, statistics showed that 35 million adults could not read above the eighth-grade level and that 23 million were not able to read beyond a fourth-grade level. Mrs. Bush appeared on The Oprah Winfrey Show to discuss the situation and spoke regularly on Mrs. Bush's Story Time, a national radio program that stressed the importance of reading aloud to children.[4] Her children Jeb Bush and Dorothy Bush Koch serve as co-chairs of the Barbara Bush Foundation for Family Literacy. During her lifetime Mrs. Bush remained active in the foundation and served as honorary chair.[17]\n\nMrs. Bush also spoke about her support for abortion access, LGBT rights, civil rights, and AIDS awareness.[18][19][20]\n\nUpon her death, President Donald Trump made a statement declaring, \"Amongst [Mrs. Bush's] greatest achievements was recognizing the importance of literacy as a fundamental family value that requires nurturing and protection.\"[21]\n\nPresident Bush and the First Lady await the arrival of a Head of State at the White House.\n\nShe was active in the White House Historical Association and worked to revitalize the White House Preservation Fund, which she renamed the White House Endowment Trust. The trust raises funds for the ongoing refurbishment and restoration of the White House. She met her goal of raising $25 million towards the endowment. The White House residence staff generally found Barbara Bush to be the friendliest and most easygoing of the First Ladies with whom they had dealt.[22]\n\nBarbara Bush became the first U.S. first lady to become a recipient of the Henry G. Freeman Jr. Pin Money Fund, receiving $36,000, most of which she gave to favorite charities.\n\nPersonal life and interests [ edit ]\n\nBush was known for her affection for her pet English Springer Spaniel Millie and wrote a children's book about Millie's new litter of puppies. She even included Millie in her official White House portrait, painted by Candace Whittemore Lovely.[23]\n\nShe was struck every day by \"how much things had changed\" for her and her husband since they became president and first lady. In place of a limousine, Bush tried to use a smaller car and travel by train and commercial aircraft for out-of-town trips. The heads of Bush's Secret Service detail were partially opposed to her wishes; the agents agreed to the small car but did not approve of the commercial air and train travel. At that time, the number of threats to the first lady was higher than that of the vice president. Bush still wanted to use public transportation despite the opposition of the Secret Service. She was put-off by the fact that her flights would be delayed while agents checked out the planes and luggage. The plane on which Bush traveled was nicknamed \"Bright Star\", in honor of the leukemia foundation her husband and Hugh Liedtke founded after her daughter Robin died.[24]\n\nShe gave the Wellesley College commencement address in 1990; her speech was listed as #45 in American Rhetoric's Top 100 Speeches of the 20th Century (listed by rank).[25]\n\nThe First Lady visits patients at Children's Hospital in Washington, D.C., 1990\n\nDuring her husband's 1992 presidential campaign, Barbara Bush stated that abortion and homosexuality are personal matters and argued that the Republican Party should not take a stand on it, saying that \"The personal things should be left out of, in my opinion, platforms and conventions.\" Her personal views on abortion were not known, although her friends reported at that time that she \"privately supported abortion rights\".[26] She explained, \"I hate abortions, but I just could not make that choice for someone else.\"[27]\n\nIn March 1989, she disclosed that she was suffering from Graves' disease, which is an overactive thyroid ailment; the condition coincidentally affected her husband.[28] It is rare for two biologically unrelated people in the same household to develop Graves disease within two years of each other.[29] In June of that year, President Bush said of his wife that \"...she is doing just fine. And I think her doctors would say the same thing. She's got this Grave's disease under control.\"[30]\n\nIn 2002 she became an alumna initiate of the Texas Eta chapter of Pi Beta Phi at Texas A&M University. Bush chose this university due to it being the location of her husband's Presidential Library.[31]\n\nIn March 2019, in her last autobiography, it was revealed that at the time of her death, she no longer considered herself part of the Republican party.[32][33][34][35]\n\nPost–White House years [ edit ]\n\nBush's husband ultimately went on to lose his bid for re-election to Bill Clinton. After leaving the White House, the couple resided at the River Oaks community in Houston, Texas, and at the Bush compound in Kennebunkport, Maine. Bush described January 20, 1993, the day of Bill Clinton's inauguration, a \"tough day\" for her and her husband. After returning to Houston, the two were visited by their son, George W. Bush, and at that point, Bush realized that she had not cooked in 12 years. She had difficulty driving a car on her own, and she did not drive far from home for a long time; her husband warned people to get out of the way if they saw her car.[36] A month after her husband left office in February 1993, Bush was surprised when her husband booked them on the \"Love Boat\" ship Regal Princess.[37] In April 1993, Bush and her husband had breakfast with the former British Prime Minister Margaret Thatcher, who was on an American speaking tour. Thatcher mentioned the most recent celebration of former President Ronald Reagan's birthday at the Ronald Reagan Presidential Library and Museum, where he orated the same card twice. Bush read about the incident after Reagan was diagnosed with Alzheimer's disease, which she called a \"tragedy for both\" the Reagans.[38]\n\nPresident George W. Bush and his mother Barbara prepare to board Air Force One , 2005\n\nBush attempted to persuade her son George W. Bush not to run for Governor of Texas in the 1994 gubernatorial election. She was convinced that he could not defeat Ann Richards, but he went on to win the election.[39] Several days after he was sworn in as Governor of Texas, she went to a Distinguished Speakers Event at the LBJ Library for Lady Bird Johnson. There, she was introduced by her son, the new Governor of Texas, and the following day, received a letter from him dated January 18, 1995, in which he asserted that he would not be governor had it not been for her and George H. W. Bush. Mrs. Bush described the letter as having \"moved\" both her and her husband.[40][41] On September 3, 1995, the Bushes went to Vietnam. This was \"unbelievable\" to Barbara because she \"never expected to set foot in what had been North Vietnam. The Bushes first went to Hanoi and then to Ho Chi Minh City. They met with President Lê Đức Anh and party secretary Đỗ Mười.[42] On September 28, 1995, the Bushes drove to Portland, Maine, for the announcement of the Barbara Bush Children's Hospital. Bush said her life was being stretched, adding, \"Long after I am gone this hospital will be there with my name.\" The Bushes visited the children there, and Mrs. Bush started to recall her daughter Robin after seeing them. The Bushes returned home early that month.[43]\n\nBush campaigned for her son George W. Bush after he announced his presidential campaign in June 1999. Throughout the country, she met with women who supported his campaign, but she remained doubtful of his chances of winning. The resentment toward the campaign continued with her rejection of any criticism of her son that was said in her presence. She refused to watch any of the debates, in contrast to her husband, who was willing to listen and watch every debate. This created friction between the couple.[44]\n\nSeveral schools have been named for her: three primary schools and two middle schools in Texas and an elementary school in Mesa, Arizona. Also named for her is the Barbara Bush Library in Harris County, Texas,[45] and the Barbara Bush Children's Hospital at Maine Medical Center in Portland, Maine. She served on the Boards of AmeriCares and the Mayo Clinic, and headed the Barbara Bush Foundation for Family Literacy.\n\nOn March 18, 2003—two days before the beginning of the 2003 invasion of Iraq—her son George W. Bush was President when ABC's Good Morning America asked her about her family's television viewing habits. She replied:\n\nI watch none. He [former President George H. W. Bush] sits and listens and I read books, because I know perfectly well that, don't take offense, that 90 percent of what I hear on television is supposition, when we're talking about the news. And he's not, not as understanding of my pettiness about that. But why should we hear about body bags and deaths, and how many, what day it's gonna happen, and how many this or that or what do you suppose? Or, I mean, it's not relevant. So, why should I waste my beautiful mind on something like that, and watch him suffer.[46]\n\nGeorge and Barbara Bush attend the christening ceremony for the eponymous aircraft carrier USS George H.W. Bush , October 2006\n\nBush was visiting a Houston relief center for people displaced by Hurricane Katrina when she told the radio program Marketplace,\n\nAlmost everyone I've talked to says, 'We're gonna move to Houston.' What I'm hearing, which is sort of scary, is they all want to stay in Texas... Everybody is so overwhelmed by the hospitality, and so many of the people in the arenas here, you know, were underprivileged anyway, so this (as she chuckles slightly) is working very well for them.[47][48]\n\nThe remarks generated controversy.[49] In 2006, it was revealed that Barbara Bush donated an undisclosed amount of money to the Bush–Clinton Katrina Fund on the condition that the charity do business with an educational software company owned by her son Neil Bush.[50]\n\nOn October 3, 2008, Barbara Bush and her husband George opened the \"George and Barbara Bush Center\"[51] on the University of New England waterfront Biddeford Campus a few miles north of Walker's Point. The George and Barbara Bush Center lays the foundation for the heritage of Barbara Bush in New England and houses \"The Bush Legacy Collection\", material securing the Bush legacy in Maine, including memorabilia on loan from the George H. W. Bush Presidential Library at Texas A&M University. Particular attention is given to the family's New England heritage and to Barbara Bush's love for Maine.[52]\n\nIn a November 2010 interview with Larry King, Bush was asked about former Alaska Governor Sarah Palin. Bush remarked, \"I sat next to her once, thought she was beautiful, and I think she's very happy in Alaska, and I hope she'll stay there.\"[53] Palin responded, \"I don't want to, sort of, concede that we have to get used to this kind of thing, because I think the majority of Americans don't want to put up with the blue-bloods—and I say it with all due respect, because I love the Bushes—but, the blue-bloods, who want to pick and choose their winners, instead of allowing competition to pick and choose the winners.\"[54]\n\nBush was initially opposed to her son Jeb making a potential bid for the presidency; she believed that other families should have a try at the nation's highest office and that \"we've had enough Bushes\".[55] However, she reversed her position and appeared in a campaign ad for him. Beginning in February 2016, she began campaigning for him in New Hampshire, an early voting state.[56][57] Jeb Bush joked that a town hall meeting attended by his mother featured a larger gathering than town halls prior to her involvement.[58] Concerning her son, she believed that Jeb was nearly too well-mannered,[59] but also was confident that he is \"decent and honest, and everything we need in a president\".[58] Bush weighed in on Donald Trump, who was Jeb's rival for the nomination. By her own admission, she said that she could not understand how women \"can vote for someone who said what he said about Megyn Kelly\".[60][61] She also indicated that she had tired of Trump over the course of the campaign and due to her gender, she was \"not crazy about what he says about women\".[62] During the CBS Republican debate in February 2016, Jeb defended his mother by saying she \"is the strongest woman I know\", to which Trump replied that Bush herself \"should be running\".[63]\n\nBush and Abigail Adams are the only two women in United States history to have been both the wife of a president and the mother of a president.[64]\n\nIllnesses and death [ edit ]\n\nBush was diagnosed with Graves' disease in 1988. Later on, she suffered from congestive heart failure and chronic obstructive pulmonary disease (COPD).[65] Bush was a heavy smoker for 25 years, quitting in 1968 when a nurse condemned her smoking in her hospital room after surgery.[66]\n\nIn November 2008, Bush was hospitalized for abdominal pains and underwent small intestine surgery.[67] She underwent aortic valve replacement surgery in March 2009.[68]\n\nBush was hospitalized with pneumonia on New Year's Eve 2013 and was released from the hospital a few days later.[69][70]\n\nOn April 15, 2018, her family released a statement regarding her failing health stating that she had chosen to be at home with family, desiring \"comfort care\" rather than further medical treatment.[71][72] According to family spokesman Jim McGrath, her decision came as a result of \"a series of recent hospitalizations\".[73][74]\n\nBush died in her Houston home at the age of 92 on April 17, 2018.[65][75] Her son George W. Bush tweeted, \"My dear mother has passed on at age 92. Laura, Barbara, Jenna, and I are sad, but our souls are settled because we know hers was [...] I'm a lucky man that Barbara Bush was my mother. Our family will miss her dearly, and we thank you all for your prayers and good wishes.\"[76] President Donald Trump ordered flags to half-staff in Barbara Bush's memory,[77][78] as he and First Lady Melania Trump sent condolences on the nation's behalf; saying: \"As a wife, mother, grandmother, military spouse, and former First Lady, Mrs. Bush was an advocate of the American family...She will be long remembered for her strong devotion to country and family...\"[79] Former Presidents Jimmy Carter,[80] Bill Clinton,[81] Barack Obama,[82] and Senator John McCain (who died 4 months and 8 days after her) also sent condolences.[83] Some foreign leaders including Queen Elizabeth II of the United Kingdom, Canadian Prime Minister Justin Trudeau, and Russian President Vladimir Putin sent their condolences as well.[84][85]\n\nHer funeral was held at St. Martin's Episcopal Church in Houston on April 21, 2018, with burial at the George Bush Presidential Library in College Station, Texas.[86][87] Former Presidents Barack Obama, George W. Bush (son), Bill Clinton and George H. W. Bush (husband), and fellow First Ladies Melania Trump, Michelle Obama, Laura Bush (daughter-in-law) and Hillary Clinton were notable representatives who attended the service.[88] Barbara Bush's son and Fmr. Governor Jeb Bush and Presidential Historian and Biographer Jon Meacham gave Eulogies. Former British Prime Minister John Major and former Canadian Prime Minister Brian Mulroney were also in attendance.[89] Her husband was hospitalized the day after with an infection that led to sepsis.\n\nFollowing her death, a cartoon by Marshall Ramsey, of The Clarion-Ledger, was widely circulated, showing Barbara being greeted by her daughter Robin (who died of leukemia at age 3 in the 1950s) upon her entry to heaven. The cartoon was shared by various people and relatives of the family, including George W.'s daughter, Jenna Bush Hager.[90] She would be featured again in another Ramsey cartoon later on in December of that same year (following her husband George's death seven months later), where both she and Robin greeted George after he landed a TBM Avenger (the type of airplane he flew in the Navy during World War II) in heaven.[91]\n\nHer husband survived her by seven months, dying on November 30, 2018.\n\nAwards and legacy [ edit ]\n\nIn 1982, Barbara Bush received the D.A.R. Medal of Honor from the Daughters of the American Revolution. She became a member in 1985 and continued her membership until her death.\n\nIn 1995, Bush received the Award for Greatest Public Service Benefiting the Disadvantaged, an award given out annually by Jefferson Awards.[92] In 1997, she was the recipient of The Miss America Woman of Achievement Award for her work with literacy programs.[93]\n\nIn 2016, she received honorary membership in Phi Beta Kappa from the University of Houston chapter.[94]\n\nMultiple schools are named after Barbara Bush. They include Barbara Bush Middle School in Irving, Texas in the Dallas-Fort Worth area, operated by the Carrollton-Farmers Branch Independent School District;[95] Barbara Bush Elementary School in The Woodlands, Texas, in Greater Houston, operated by the Conroe Independent School District;[96] Global Leadership Academy at Barbara Bush Elementary in Grand Prairie, Texas, also in Dallas-Fort Worth]], operated by the Grand Prairie Independent School District;[97] and Barbara Bush Elementary School in the Parkway Villages neighborhood in western Houston, operated by the Houston Independent School District.[98]\n\nHonorary degrees [ edit ]\n\nBarbara Bush received honorary degrees from many institutions. These include:\n\nReferences and Primary sources [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Barbara_Bush_portrait.jpg/220px-Barbara_Bush_portrait.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Thatchers_and_Bushes_at_Chequers.jpg/170px-Thatchers_and_Bushes_at_Chequers.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/President_and_Mrs._Bush_await_the_arrival_of_President_Ali_Abdallah_Saleh_of_the_Yemen_Arab_Republic_for_a_State..._-_NARA_-_186408.tif/lossy-page1-170px-President_and_Mrs._Bush_await_the_arrival_of_President_Ali_Abdallah_Saleh_of_the_Yemen_Arab_Republic_for_a_State..._-_NARA_-_186408.tif.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Barbara_Bush_Signature.svg/128px-Barbara_Bush_Signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Mrs._Bush_and_Raisa_Gorbachev_deliver_Commencement_Addresses_at_Wellesley_College_-_NARA_-_186412.tif/lossy-page1-220px-Mrs._Bush_and_Raisa_Gorbachev_deliver_Commencement_Addresses_at_Wellesley_College_-_NARA_-_186412.tif.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/BarbaraBushESHouston.jpg/220px-BarbaraBushESHouston.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Entire_Bush_family.jpg/220px-Entire_Bush_family.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/George_and_Barbara_Bush_in_Houston%2C_Texas_on_the_night_which_George_Bush_was_elected_to_Congress_-_NARA_-_186373.tif/lossy-page1-220px-George_and_Barbara_Bush_in_Houston%2C_Texas_on_the_night_which_George_Bush_was_elected_to_Congress_-_NARA_-_186373.tif.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Barbara_Bush_at_LBJ_Presidential_Library.jpg/170px-Barbara_Bush_at_LBJ_Presidential_Library.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Mrs._Bush_and_Missouri_Governor_John_Ashcroft_attend_a_%22Parents_as_Teachers%22_parent-child_group_at_the..._-_NARA_-_186437.tif/lossy-page1-220px-Mrs._Bush_and_Missouri_Governor_John_Ashcroft_attend_a_%22Parents_as_Teachers%22_parent-child_group_at_the..._-_NARA_-_186437.tif.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/George_H._W._Bush_and_Barbara_Bush_laugh_during_George_H.W._Bush_%28CVN_77%29_christening.jpg/220px-George_H._W._Bush_and_Barbara_Bush_laugh_during_George_H.W._Bush_%28CVN_77%29_christening.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Barbara_Bush_and_Big_Bird.jpg/220px-Barbara_Bush_and_Big_Bird.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Barbara_Bush_portrait.jpg/1200px-Barbara_Bush_portrait.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/George_H._W._Bush%2C_President_of_the_United_States%2C_1989_official_portrait_%28cropped%29.jpg/100px-George_H._W._Bush%2C_President_of_the_United_States%2C_1989_official_portrait_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Mrs._Bush_visits_patients_at_Children%27s_Hospital_in_Washington%2C_D.C_-_NARA_-_186426.tif/lossy-page1-220px-Mrs._Bush_visits_patients_at_Children%27s_Hospital_in_Washington%2C_D.C_-_NARA_-_186426.tif.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Five_U.S._first_ladies_in_2013_crop.jpg/220px-Five_U.S._first_ladies_in_2013_crop.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Flag_of_Texas.svg/24px-Flag_of_Texas.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/US_Navy_050318-O-4039N-002_President_George_W._Bush_and_his_mother%2C_Barbara_Bush%2C_wave_goodbye_to_a_crowd_of_over_200_Sailors_and_Marines_aboard_Naval_Air_Station_%28NAS%29_Pensacola%2C_Fla.jpg/220px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/George-W-Bush.jpeg/100px-George-W-Bush.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Coat_of_arms_of_the_President_of_the_United_States.svg/70px-Coat_of_arms_of_the_President_of_the_United_States.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Barbara_Bush_portrait.jpg/1200px-Barbara_Bush_portrait.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Barbara_Bush", "title": "Barbara Bush", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Barbara_Bush_portrait.jpg/1200px-Barbara_Bush_portrait.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}