{"url": "www.complex.com/music/2017/06/def-jam-ceo-talks-kanye-west-new-music", "text": "Kanye West is working on new music. We got a taste of what’s coming this weekend, when two full-length tracks (featuring Migos, Young Thug, and ASAP Rocky) plus one snippet surfaced online.\n\nIn a recent appearance on Ebro in the Morning, Chance The Rapper noted that Kanye is working with Francis from Francis and the Lights on Ye’s next album. Kanye has also reportedly been working with Pusha T.\n\nAccording to a previous report from TMZ, Kanye has been doing this work “holed up” somewhere in Wyoming for inspiration. But, according to a new interview with Def Jam CEO Steve Bartels, Kanye may actually be working on the new project in Utah. He's somewhere out west, it appears, but no one seems to know exactly where.\n\nHere is the interaction between Variety and Bartels.\n\nVariety: Let me ask what’s up with several of your artists. Word was that Kanye West was recording by himself somewhere in Utah—is that real?\n\nBartels: I don’t know if that’s real or not, I read the same things you do. When we talk we don’t really get down to the granular of where he’s going and how he’s flying there, we keep it much more on a broader level. Kanye is working, that’s been widely reported. He’s always very focused, and our relationship with him is that we always have great respect for him and when he’s ready to do something or talk about something, we’re there for him, we totally support his vision and his focus, and that’s where we leave it. I check in with him from time to time just to see how he’s doing. What’s great about our relationship is that I always know when it’s go time—because he wakes me up. [Laughter]\n\nBartels did confirm Kanye is working on new music. He was not totally sure of the timeline for the release, however.\n\n“You never know,” Bartels said, when asked if the new music would arrive this year. “He’s always working, so maybe so. It’s never something we’re pushing—it’s always led by the creative side.”\n\nProbably a good approach from Bartels—let Kanye do his thing, and when the project’s done, he’ll let you know. He'll give you a call at 3 a.m.\n\nBartels also spoke on another Def Jam artist, Justin Bieber, who is quietly killing it right now.\n\n“The remarkable thing about him right now is that he could be having the song of the summer without it being his own record—both the DJ Khaled [‘I’m the One’] and Luis Fonsi [‘Despacito’] records are massive right now, and we’ve got another one coming,” Bartels said. “We’re doing a new release on Friday with Bieber and David Guetta called ‘2U.’ We’ll be working on in conjunction with Warner France—we’ll be taking care of it here. It’s a massive record, and it’s another song that’s gonna compete for song of the summer even though it’s starting later than the other two.”\n\nBartels has spent 30 years in the music business (he started as a DJ, and he’s been the Def Jam CEO since 2014), so he knows what he’s doing and how to handle artists. He also spoke on Bieber growing up in the spotlight, Iggy Azalea’s new music, and whether the upcoming releases from Vince Staples and 2 Chainz will step on each other.\n\nYou can read the full interview here.", "images": ["https://images.complex.com/complex/image/upload/t_author_pic/14642218_10210907073978024_4176258188872461527_n_nahuyn.jpg", "https://images.complex.com/complex/images/c_fill,dpr_auto,f_auto,q_90,w_1400/fl_lossy,pg_1/nx8rbus9wcbkkbmbzmbi/kanye-kim-nyc", "http://b.scorecardresearch.com/p?c1=2&c2=6685975&cv=2.0&cj=1", "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/nx8rbus9wcbkkbmbzmbi/kanye-kim-nyc", "https://images.complex.com/complex/image/upload/v1580766573/FFFFFF-1_cyvbjp.png"], "top_img": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/nx8rbus9wcbkkbmbzmbi/kanye-kim-nyc", "keywords": [], "authors": ["Aaron Mansfield"], "canonical_link": "https://www.complex.com/music/2017/06/def-jam-ceo-talks-kanye-west-new-music", "title": "Def Jam CEO Talks Kanye West and His New Music", "meta_data": {"google-site-verification": "ICK39wBGvCQQMHpEUykVHWF8Ox_0MME-_qxe6ixFUik", "theme-color": "#000000", "description": "In a recent interview, Def Jam CEO Steve Bartels discussed Kanye West's creative process and the new music he's currently working on.", "og": {"type": "website", "title": "Def Jam CEO Talks Kanye West and His New Music", "description": "In a recent interview, Def Jam CEO Steve Bartels discussed Kanye West's creative process and the new music he's currently working on.", "url": "https://www.complex.com/music/2017/06/def-jam-ceo-talks-kanye-west-new-music", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/nx8rbus9wcbkkbmbzmbi/kanye-kim-nyc", "site_name": "Complex"}, "fb": {"app_id": 310521533114641, "pages": 117696581735620}, "twitter": {"card": "summary_large_image", "title": "Def Jam CEO Talks Kanye West and His New Music", "description": "In a recent interview, Def Jam CEO Steve Bartels discussed Kanye West's creative process and the new music he's currently working on.", "url": "https://www.complex.com/music/2017/06/def-jam-ceo-talks-kanye-west-new-music", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,h_300,q_auto,w_600/fl_lossy,pg_1/nx8rbus9wcbkkbmbzmbi/kanye-kim-nyc", "site": {"id": 13049362}}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "http://www.complex.com", "summary": ""}