{"url": "https://www.standard.co.uk/news/world/charlie-sheen-says-he-categorically-denies-corey-haims-claim-of-rape-aged-13-a3685996.html", "text": "ES News email The latest headlines in your inbox twice a day Monday - Friday plus breaking news updates Enter your email address Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid You already have an account. Please log in Register with your social account or click here to log in I would like to receive lunchtime headlines Monday - Friday plus breaking news alerts, by email Update newsletter preferences\n\nCharlie Sheen has “categorically denied” the accusation that he raped child star Corey Haim at the age of 13.\n\nThe Two and a Half Men actor was 19 at the time he is alleged to have had sex with Haim when the two were filming the 1986 movie Lucas.\n\nA spokesman for the actor said: \"Charlie Sheen categorically denies these allegations.\"\n\nFormer actor Dominick Brascia claims Haim told him about the alleged incident before he died in 2010 at the age of 38.\n\nHe told the National Enquirer: “Haim told me he had sex with Sheen when they filmed Lucas.\n\n“He told me they smoked pot and had sex.\n\n“Haim said after it happened Sheen became very cold and rejected him. When Corey wanted to fool around again, Charlie was not interested.”\n\nAccording to Brascia, Haim also told him the co-stars had consensual sex years later, while Haim was in his mid-to-late 20s.\n\nBrascia said: “Haim told me he had sex with Sheen again.\n\n“He claimed he didn’t like it and was finally over Sheen. He said Charlie was a loser.”\n\nBrascia is also alleged to have had a sexual relationship with Haim, who died in 2010 at the age of 38, a claim that Brascia “emphatically denied” when asked about it by The Enquirer\n\nIt comes as the Lost Boys actor's regular co-star and friend Corey Feldman continues to speak out about child sex abuse in Hollywood.\n\nThe actor, now 46, has filed a report with police claiming he was sexually assaulted by Hollywood figures as a youngster.\n\nHe has previously alleged industry figures molested young actors including himself and Haim. He has not publicly named any individual as being subject of his allegations.\n\nThe Los Angeles Police Department said it is investigating the claim and that no arrests have been made.", "images": ["https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/09/07/charliesheen0811a.jpg"], "top_img": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/09/07/charliesheen0811a.jpg", "keywords": [], "authors": ["Patrick Grafton-Green"], "canonical_link": "https://www.standard.co.uk/news/world/charlie-sheen-says-he-categorically-denies-corey-haims-claim-of-rape-aged-13-a3685996.html", "title": "Charlie Sheen 'categorically denies' Corey Haim's claim of rape when aged 13", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#dc062b", "og": {"url": "https://www.standard.co.uk/news/world/charlie-sheen-says-he-categorically-denies-corey-haims-claim-of-rape-aged-13-a3685996.html", "title": "Charlie Sheen 'categorically denies' raping 13-year-old Corey Haim", "description": "Charlie Sheen has “categorically denied” the accusation that he raped child star Corey Haim at the age of 13. The Two and a Half Men actor was 19 at the time he is alleged to have had sex with Haim when the two were filming the 1986 movie Lucas. A spokesman for the actor said: \"Charlie Sheen categorically denies these allegations.\" Former actor Dominick Brascia claims Haim told him about the alleged incident before he died in 2010 at the age of 38.", "updated_time": "2017-11-09T17:56:36+00:00", "image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/09/07/charliesheen0811a.jpg", "site_name": "Evening Standard", "type": "article", "locale": "en_GB"}, "fb": {"pages": 165348596842143, "app_id": 193840110715213, "admins": 36903991}, "ia": {"markup_url": "https://www.standard.co.uk/pwamp/fbi/3685996"}, "description": "Charlie Sheen has “categorically denied” the accusation that he raped child star Corey Haim at the age of 13. The Two and a Half Men actor was 19 at the time he is alleged to have had sex with Haim when the two were filming the 1986 movie Lucas. A spokesman for the actor said: \"Charlie Sheen categorically denies these allegations.\" Former actor Dominick Brascia claims Haim", "keywords": "Charlie Sheen, World, News", "article": {"tag": "Charlie Sheen", "published_time": "2017-11-09T08:43:00+00:00", "modified_time": "2017-11-09T17:56:36+00:00", "publisher": 165348596842143, "section": "World", "author_name": "Patrick Grafton-Green", "content_type": "story", "word_count": 347, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 0}, "twitter": {"title": "Charlie Sheen 'categorically denies' raping 13-year-old Corey Haim", "description": "Charlie Sheen has “categorically denied” the accusation that he raped child star Corey Haim at the age of 13. The Two and a Half Men actor was 19 at the time he is alleged to have had sex with Haim", "card": "summary_large_image", "site": "@standardnews"}, "google-site-verification": "fI_fn7lv1QlqGWXMIJoqDICBG1ynAC0UDsrriO8e_m8", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Evening Standard"}, "movies": [], "publish_date": 1510216980.0, "source": "https://www.standard.co.uk", "summary": ""}