{"url": "steemit.com/art/@sharozgill/angelina-jolie-furious-over-oscar-snub", "text": "Is Angelina Jolie livid that her Cambodian movie, First They Killed My Father, wasn’t nominated for an Oscar? one of this week’s tabloids claims the actress is taking the snub very badly. Gossip Cop, but, can exclusively set the record directly.\n\nJolie’s new Netflix movie, which she co-wrote, produced and directed, didn't rating a nod for satisfactory foreign Language film at this 12 months’s Academy Awards, regardless of having received previous nominations at other awards indicates. in step with good enough!, the actress is reeling over the snub, specifically because Oscar popularity “might have been vindication amid the pressure of her cut up from Brad Pitt.”\n\nA so-called “supply” tells the magazine, “Angie campaigned hard for her movie, hitting the awards circuit and giving interviews. She’s wrecked to be out of the jogging. Directing way greater to Angie than performing ever did. She takes her filmmaking very severely.” The meant insider adds, “An Oscar nod might had been a triumph for her. She’s simply devastated.”\n\nbut Gossip Cop checked in with a supply close to the actress and filmmaker, who brushed off the tabloid’s record as “absolutely fake.” First They Killed My Father changed into a ardour challenge for Jolie, now not a movie she made for the sake of getting awards. The actress followed her oldest son Maddox from Cambodia in 2002, after which she became pressured to inform the tale of the united states’s genocide underneath the Khmer Rouge regime. The actress became determined to shed a mild on the brutal history of the poverty-stricken usa, now not to collect accolades.\n\non the other hand, good enough! does seem determined to disparage Jolie’s person. Gossip Cop lately busted the tabloid for making up a story about the actress being on a food regimen which includes best espresso and cigarettes. quickly before that nonsense, we referred to as out the publication for arbitrarily alleging that Jolie changed into in the midst of a “profession disaster.” Regardless, Jolie is very happy with her properly-acquired Cambodian drama, and she doesn’t want a gold statue to sense verified.", "images": ["https://steemitimages.com/DQmcqoz7zJWTFZSe2CXi8BGVhSpUuwcbnU6ik71SS51n3J4/image.png"], "top_img": "https://steemitimages.com/DQmcqoz7zJWTFZSe2CXi8BGVhSpUuwcbnU6ik71SS51n3J4/image.png", "keywords": [], "authors": [], "canonical_link": "https://steemit.com/art/@sharozgill/angelina-jolie-furious-over-oscar-snub", "title": "Angelina Jolie Furious Over Oscar Snub? — Steemit", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Is Angelina Jolie livid that her Cambodian movie, First They Killed My Father, wasn’t nominated for an Oscar? one of… by sharozgill", "og": {"title": "Angelina Jolie Furious Over Oscar Snub? — Steemit", "type": "article", "url": "https://steemit.com/art/@sharozgill/angelina-jolie-furious-over-oscar-snub", "image": "https://steemitimages.com/DQmcqoz7zJWTFZSe2CXi8BGVhSpUuwcbnU6ik71SS51n3J4/image.png", "description": "Is Angelina Jolie livid that her Cambodian movie, First They Killed My Father, wasn’t nominated for an Oscar? one of… by sharozgill", "site_name": "Steemit"}, "article": {"tag": "art", "published_time": "2018-02-03T17:51:57"}, "twitter": {"card": "summary_large_image", "site": "@steemit", "title": "Angelina Jolie Furious Over Oscar Snub? — Steemit", "description": "Is Angelina Jolie livid that her Cambodian movie, First They Killed My Father, wasn’t nominated for an Oscar? one of… by sharozgill", "image": "https://steemitimages.com/DQmcqoz7zJWTFZSe2CXi8BGVhSpUuwcbnU6ik71SS51n3J4/image.png"}, "application-name": "Steemit", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/images/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/images/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/images/favicons/mstile-150x150.png", "msapplication-wide310x150logo": "/images/favicons/mstile-310x150.png", "msapplication-square310x310logo": "/images/favicons/mstile-310x310.png"}, "movies": [], "publish_date": null, "source": "http://steemit.com", "summary": ""}