{"url": "https://www.latimes.com/entertainment/tv/la-ca-st-fall-preview-edie-falco-menendez-brothers-20170907-story.html", "text": "In 1989, Edie Falco paid little attention to the sensational murder case dominating the headlines involving the wealthy Menendez family.\n\n“The case was in the background of my life,” says Falco, when asked about the national fascination with the brutal Beverly Hills living room slayings of entertainment executive Jose Menendez and his wife, Mary Louise “Kitty” Menendez. The suspects were their sons, Lyle and Erik, who were 21 and 18, respectively, at the time of the murders.\n\n“There were other things to think about, and there were not 7,000 channels at the time,” says the Brooklyn native. Her distracted impression was that it was just “a couple of bratty kids that killed their rich parents.”\n\nA few years shy of the crime’s 30th anniversary, the case has moved to the front-line of Falco’s character gallery as the acclaimed actress — who scored back-to-back triumphs with her Emmy-winning roles on “The Sopranos” and “Nurse Jackie” — stars in NBC’s “Law & Order True Crime: The Menendez Murders,” premiering Sept. 26.\n\nAdvertisement\n\nFalco plays no-nonsense defense attorney Leslie Abramson in the eight-episode series, which introduces a nonfiction extension to the brand created by Dick Wolf. The producer hopes the project is the first of many that can use the “L&O” formula to re-examine high-profile crimes such as the Hillside Strangler and Son of Sam.\n\n“There are so many of these cases I want to know a lot more about,” Wolf said . The Menendez series will feature some “Law & Order” hallmarks: the colorful opening logo and the “chung chung” between scenes.\n\n“You have to appeal to your base,” Wolf said with a chuckle. “I’m using every comfort zone for my audience.”\n\nThe docudrama also marks the latest in a stream of Hollywood projects that reflect the ongoing interest in the scandalous murders, which centered on whether the Menendez brothers were cold-blooded murderers or victims of horrific child abuse who killed their parents to escape torment. (The brothers were sentenced to life in prison in 1996.)\n\nAdvertisement\n\nAmong the various Menendez projects were Lifetime’s June film “Menendez: Blood Brothers,” which featured Courtney Love as Kitty Menendez, and two separate made-for-TV movies in 1994.\n\nThe “Law & Order” version is the first to position Abramson as the central character, and it plans to offer a more extensive examination of the killings.\n\nExecutive producer and showrunner Rene Balcer believes the brothers were unfairly treated by what he called a corrupt justice system.\n\n“These guys never should have been sentenced to life without parole,” Balcer said . “They were overcharged and over-sentenced. They were abused kids who killed their abusers.”\n\nAdvertisement\n\nAlthough she had little interest at the time, Falco said she was attracted to the series by the complicated dynamics.\n\n“Things are never what they seem,” the actress said on location in Pasadena.\n\nJust minutes earlier, she had put on the wig that matched Abramson’s famously frizzy mane. Her appearance was worlds away from that of manicured mob wife Carmela Soprano or bleary, drug-addicted nurse Jackie Peyton.\n\nPortrait of Edie Falco in Pasadena, CA July 24, 2017. (Francine Orr / Los Angeles Times)\n\nAdvertisement\n\nFULL COVERAGE: Fall 2017 TV preview »\n\n“It’s a story of child abuse. That stuff hopefully affects everyone, but it really just gets me right in my gut what these boys were put through,” said Falco, the mother of two young kids. “There’s something more grotesque about the fact that they had money. They were not allowed to be seen as victims. People were not receptive to hearing how hard it was for them.”\n\nShe was also moved by Abramson’s mission to do right by the brothers.\n\n“Leslie is a woman who is very good at her job,” she said. “She is passionate about it and believes in her clients. That doesn’t necessarily mean she believes they’re innocent, but she believes in their right to a fair defense. That’s commendable of her. I think she really cared about these guys, beyond working for them.”\n\nAdvertisement\n\nMoments later, Falco was on the steps of an office building substituting for the Beverly Hills Courthouse, surrounded by extras playing reporters at a brief news conference. Her tone was direct and stern as she channeled Abramson, accusing prosecutors and police of violating her clients’ rights of doctor-patient privilege by seizing notes from Erik Menendez’s psychiatrist.\n\n“Any of us that sees a doctor, consults a lawyer or even confides in a priest, minister or rabbi had better be worried,” she said, as Abramson.\n\nAlthough Falco captures the attorney’s tough-as-nails demeanor, she got no advice from her real-life counterpart.\n\n“I did not meet her,” says Falco. “I don’t think she has any interest in being involved with this. That was the word I got. But there’s plenty to see of her on YouTube and in photos. She also wrote a great book called ‘The Defense Is Ready,’ which said a great deal about who she is and about the justice system, especially at that time.”\n\nAdvertisement\n\nLesli Linka Glatter (“Homeland”), who directed the first two episodes and also serves as an executive producer, said she was continually impressed by Falco’s performance.\n\n“Edie is an amazing actress, and she cannot lie,” said Glatter. “When she takes on a role, she gets fully inside a character.”\n\nTaking on such an intense character in a broadcast network drama was not part of a specific career plan, said Falco.\n\n“I have never known my creative direction after two iconic roles,” she said. “For a long time after ‘The Sopranos,’ the offers were all Italian wives. After ‘Nurse Jackie,’ it was tons of scripts about drug addicts.”\n\nAdvertisement\n\nReflecting on those roles gives her both personal and professional perspective.\n\n“The only thing that comes to mind is gratitude,” she says. “I feel tremendously blessed that I was presented with these two things that kept me busy for 10 years each. It kept me working and living in New York, which is what makes me happiest.”\n\nPortrait of Edie Falco in Pasadena, CA July 24, 2017. (Francine Orr / Los Angeles Times)\n\nThis story is part of The Times’ 2017 Fall television preview. Check out the complete coverage here.\n\nAdvertisement\n\ngreg.braxton@latimes.com\n\nTwitter:@GeBraxton\n\nALSO\n\nAll the new television shows to check out this fall\n\nAdvertisement\n\nFall TV Preview: ‘Star Trek,’ ‘Young Sheldon,’ ‘At Home With Amy Sedaris’ and all the new shows to watch out for\n\nOverrated/Underrated: Fall TV’s ongoing revivals and ‘Baroness Von Sketch Show’", "images": ["https://ca-times.brightspotcdn.com/dims4/default/a7e41b2/2147483647/strip/true/crop/1024x575+0+0/resize/840x472!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F00%2F2c%2F74741a032d708f7e023b9b98739e%2Fla-1504823700-b2uug0g2tu-snap-image", "https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/f21a84f/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2Fe2%2F6d95eee10fad8fc1988dff685846%2Fla-1504214905-gum58q60mr-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/baabb2f/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2Fe2%2F6d95eee10fad8fc1988dff685846%2Fla-1504214905-gum58q60mr-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/a916b3b/2147483647/strip/true/crop/1023x575+0+0/resize/840x472!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd1%2F9a%2F3b5cb774043bc9adf991a2fa4f83%2Fla-1504823588-3ezmcr6r3j-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/0ad036f/2147483647/strip/true/crop/1125x1125+438+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F39%2F84%2F13466124335bdcb610d89da79954%2Fimg-535dc5d1-turbine-la-bio-greg-braxton", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/baabb2f/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2Fe2%2F6d95eee10fad8fc1988dff685846%2Fla-1504214905-gum58q60mr-snap-image", "keywords": [], "authors": ["A Lifelong Los Angeles Resident", "Greg Braxton Has Written For The Los Angeles Times For More Than Three Decades. He Currently Is A Staff Writer Covering Television For The Calendar Section", "Has Also Written Extensively About Trends", "Cultural Issues In The Entertainment Field."], "canonical_link": "https://www.latimes.com/entertainment/tv/la-ca-st-fall-preview-edie-falco-menendez-brothers-20170907-story.html", "title": "Edie Falco lays down the law in ‘Law & Order True Crime: The Menendez Murders’", "meta_data": {"og": {"title": "Edie Falco lays down the law in 'Law & Order True Crime: The Menendez Murders'", "url": "https://www.latimes.com/entertainment/tv/la-ca-st-fall-preview-edie-falco-menendez-brothers-20170907-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/baabb2f/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2Fe2%2F6d95eee10fad8fc1988dff685846%2Fla-1504214905-gum58q60mr-snap-image", "url": "https://ca-times.brightspotcdn.com/dims4/default/baabb2f/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2Fe2%2F6d95eee10fad8fc1988dff685846%2Fla-1504214905-gum58q60mr-snap-image", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "PASADENA, CA JULY 24, 2017: Portrait of Edie Falco in Pasadena, CA July 24, 2017. Edie Falco, wh"}, "description": "In 1989, Edie Falco paid little attention to the sensational murder case dominating the headlines involving the wealthy Menendez family.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/greg-braxton", "content_tier": "metered", "published_time": "2017-09-08T14:00:00", "opinion": "false", "section": "Television"}, "twitter": {"card": "summary_large_image", "creator": "@gebraxton", "description": "In 1989, Edie Falco paid little attention to the sensational murder case dominating the headlines involving the wealthy Menendez family.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/169b34e/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2Fe2%2F6d95eee10fad8fc1988dff685846%2Fla-1504214905-gum58q60mr-snap-image", "alt": "PASADENA, CA JULY 24, 2017: Portrait of Edie Falco in Pasadena, CA July 24, 2017. Edie Falco, wh"}, "site": "@latimes", "title": "Edie Falco lays down the law in 'Law & Order True Crime: The Menendez Murders'"}, "fb": {"app_id": 119932621434123, "pages": 5863113009, "profile_id": "latimesent"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "Premium cable staple Edie Falco heads to broadcast TV with \"The Menendez Nurders.\"", "keywords": "Law & Order, Leslie Abramson, the Sopranos, the Menendez Brothers, Edie Falco, Nurse Jackie", "brightspot.contentId": "00000169-0cb8-dbbe-a16f-4ef8ce060000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1504713600.0, "source": "https://www.latimes.com", "summary": ""}