{"url": "fashionmagazine.com/culture/selena-gomez-justin-bieber-relationship/", "text": "Photography via Getty\n\nHave We Reached the End of Our 3,600 Word Jelena Timeline?\n\nSo. Much. Drama.\n\nEvery relationship has its ups and downs, but when we’re talking about Justin Bieber and Selena Gomez, that’s approximately seven years of roller-coaster emotions.\n\nThe two sparked dating rumours in 2010 and captured the hearts of both their fan bases, resulting in the #Jelena hashtag. Since Bieber and Gomez are two of the most famous young stars of their time, their admirers range from supportive to downright obsessive.\n\nTheir relationship is kind of very hard to follow, but luckily, we’ve broken down every single one of their breakups and makeups. Grab a snack, because there’s a lot to dive into.\n\nphotography via instagram.com/jelena_firstofall\n\nJanuary 2011: Vacation in St. Lucia\n\nBieber/Gomez dating rumours began to circulate in 2010. But it wasn’t until January 2011 that the pop stars confirmed their romance, namely by partaking in major PDA while on vacation together in St. Lucia.\n\nPhotography by Jon Kopaloff/FilmMagic\n\nFebruary 2011: Jelena steps out on red carpet at the Vanity Fair Oscars party\n\nYup, they finally made our dreams a reality by walking the red carpet together for the first time, thus confirming their young love. Aren’t they adorable?\n\nphotography by Kevin Mazur/Contributor/Getty\n\nMay 2011: Billboard Music Awards\n\nJelena looked happy and strong at the Billboard Music Awards. Oh, young love.\n\nphotography by steve granitz/contributor/getty\n\nNovember 2011: Jelena is over… apparently\n\nRumours that Gomez has dumped the Canadian pop star begin to surface, after a Bieber fan claimed she had sex with him backstage at a show in October 2010, and that he is the father of her 4-month-old child. However, it’s confirmed that the breakup rumours aren’t true.\n\nphotography via pinterest\n\nNovember 2012: The couple officially breaks up; Bieber briefly linked to model Barbara Palvin\n\nDon’t go anywhere, this is just the first of many breakups. After more than a year of puppy love, the two reportedly split for the first time as a result of their jam-packed schedules. Fans (and the internet) also begin to wonder whether there’s a relationship brewing between JB and Victoria’s Secret model Barbara Palvin. Palvin took to Twitter, confirming that there was nothing going on between her and Bieber.\n\nphotography via instagram.com/ashilrd\n\nJanuary 2013: The pair are reportedly back together; Gomez travels to Norway to visit Bieber\n\nThey clearly can’t stay away from one another for long. Less than 3 months after the duo called it quits, Bieber posted the above image of them on his Instagram… and of course, promptly deleted it.\n\nPhotography by Kevin Mazur/WireImage\n\nNovember 2014: Gomez performs at the American Music Awards\n\nThe singer took to the stage to perform her single, “The Heart Wants What It Wants.” Here’s the kicker: she confirmed the song was about Bieber. After a few more on-again off-again appearances in the media, the couple officially confirmed they’d split.\n\nphotography via instagram.com/mommyhaileybaldwin\n\n\n\nDecember 2014: Bieber denies Hailey Baldwin dating rumours\n\nJelena, what? We’re now onto Jailey. Talks that Bieber is dating model Hailey Baldwin are at a high. However, JB denies these rumours, assuring fans that they are simply good friends (whatever that means).\n\nphotography via instagram.com/zedd\n\nJanuary 2015: Gomez and Zedd dating rumours begin\n\nShortly after the Jailey rumours came out, Gomez was seen getting close with DJ Zedd. This romance was not confirmed until later that year in September, when Gomez spoke with Elle for an interview.\n\nphotography via instagram.com/selenamylight\n\nSeptember 2015: Gomez opens up about Bieber in ELLE\n\nGomez discusses her past relationship with her fellow pop star and states that she will always support him.\n\nphotography via instagram.com/selgselgenator\n\nNovember 2015: Bieber appears on The Ellen DeGeneres Show\n\nIn November 2015, JB stopped by Ellen, and while discussing his upcoming album Purpose, he revealed which songs were inspired by Selena—thanks for the intel, Biebs! The songs? Check out “What Do You Mean?” “Sorry” and “Mark My Words”.\n\nphotography via instagram.com/haileybaldwin\n\nJanuary 2016: Bieber and Baldwin hang out on New Year’s Eve\n\nWas it not recently that JB confirmed that he and Baldwin were just good friends? Yes, but now things appear to have changed. The two celebs took their romance public on Instagram. However, it’s unclear how long the this romance lasted, as they’ve since broken up.\n\nphotography via instagram.com/sofiarichie\n\nAugust 2016: Sofia Richie posts an Instagram of her and Bieber\n\nYes, Sofia Richie, daughter of Lionel Richie, and sister of Nicole Richie. Bieber and Richie both took to Instagram recently to post photos of their time in Japan. The comments on both their accounts proved one thing for sure: do not mess with Jelena fans.\n\nPhotography via Instagram.com/selenagomez\n\nAugust 2016: Gomez posts a clip of her singing “Let Me Love You”\n\nSo, just when we thought the dust had settled between Jelena, this clip surfaced of Gomez singing DJ Snake’s “Let Me Love You,” which features the Biebs on vocals. An official cover has yet to be released; however, suspicions that it’s coming soon have been heightened as DJ Snake posted a longer version of Gomez’s cover on his Snapchat. I think we can all agree that it’s a little odd of Selena to chose to cover her ex’s song after feuding over his new boo Sofia. But hey, you do you, Selena!\n\nphotography via instagram.com/revivaltour\n\nNovember 2016: Bieber allegedly visits Gomez in rehab\n\nGomez pulled out of her Revival Tour, in late August, due to complications caused by Lupus; mainly symptoms surrounding anxiety and panic. As a result, she checks in to rehab facility (feel better soon, Selena!). Rumours of Bieber visiting Gomez in rehab have started to circulate. Can somebody seriously loop us in, please?!\n\nPhotography by Jamie McCarthy/Getty Images\n\nJanuary 2017: Gomez and The Weeknd spotted together\n\nThe 24-year-old songstress was spotted making out with Canadian singer The Weeknd in photographs released by TMZ. According to the celeb news site, Gomez and The Weeknd (real name: Abel Tesfaye) were “getting handsy and mouthy” outside Giorgio Baldi restaurant in Santa Monica, Calif. They then made it Instagram official (sort of) during a trip to Italy where the pair were spotted wining and dining (and kissing, duh!) in Venice and Florence.\n\nPhotography by Charley Gallay/AMA2015/Getty Images for dcp\n\nFebruary 2017: JB and The Weeknd begin to feud\n\nWhile out in Los Angeles, Bieber was asked by paparazzi if he would listen The Weeknd’s music, to which he responded with a simple “Hell, no.” Fast forward to Valentine’s Day, when a track called “Some Way” by Toronto rapper Nav, featuring The Weeknd drops. “I think your girl / think your girl / fell in love with me,” the singer croons. The song also delves into NSFW territory: “She say my fuck and my tongue game a remedy.” Yikes! A day later, DJ Kygo’s single “It Ain’t Me” drops, featuring Gomez, and let’s just say the lyrics appear to allude to a certain former flame. Serious. Drama.\n\nPhotography via Instagram/_marissamarino\n\nApril 30, 2017: Selena reportedly pens a JB diss-track\n\nThe Sun reports that Gomez and singer/songwriter Charli XCX have collaborated on a track titled “Bad Girlfriend.” The British tabloid speculates that the song is about Justin Bieber, and states that a source has told them that it’s “…about a boyfriend the girl is no longer really into and has finally gotten wise to.” One of the alleged lines, according to The Sun is: “I know I’m not there for you or there when you call. I’m a bad girlfriend/I’m a bad girlfriend.” So. Much. Shade.\n\nPhotography via Instagram/selenagomez\n\nMay 2017: Selena promotes new single on Instagram\n\nLast week, Gomez took to her Instagram to tease fans with news of her upcoming single. The singer posted a trio of highly-stylized (read: dark, moody) images featuring the words “Bad Liar” scrawled with lipstick on a mirror. As a result, many are speculating that the song must be about her (surprise!) infamous ex-boyfriend. What we can confirm is that the track is scheduled to drop May 18.\n\nJune 2017: Selena compliments Justin on a radio talk show.\n\nDuring an interview on Sirius XM’s Morning Mash Up, ​Selena was asked ​to share ​her thoughts on Ariana Grande’s #OneLoveManchester benefit concert​. Turns out ​she had nothing but ​good things to say about the performers, including Justin.\n\n“It was beautiful,” says Selena. “I thought everyone did such a beautiful job. It was so gorgeous. I love how she [Ariana] ended it. I thought Justin did great. It was really beautiful.” Cue the wild screams tweets from Jelena fans.\n\nJELENA IS RISING AGAIN YOU GUYS pic.twitter.com/ea9zylAaSZ — shooters for krisdeana (@belizafucked) June 5, 2017\n\nPhotography by Kevin Mazur/WireImage\n\nJune 2017: A Selena and Justin duet reportedly leaked on Soundcloud\n\nThe two recorded an incomplete single called “Steal Our Love” back in 2013/2014 before their final breakup. While the song is no longer available to listen to (it was leaked and then swiftly taken off of Soundcloud), the Jelena fans over at Elle has kindly provided us the lyrics. And judging from the lines, the songs tells the story of two people in a troubled relationship who are fighting to make it work.\n\n“I can’t seem to choose what to do / There’s nothing I can say / I’m tired of the fight ’cause I’m never right / I just wanna cry, no,” Selena allegedly sings.\n\nSounds familiar?\n\nPhotography via Instagram/@justinbieber\n\nAugust 2017: Justin releases a new song titled “Friends”\n\n“Can we still be friends?” Bieber asks on his latest track with Bloodpop. He’s singing to to an ex who he swears he’s over but can’t quite completely, and (obviously) fans assume he’s singing to Selena. The plot thickened when people started realizing that Julia Michaels, a good friend of Selena, co-wrote the single. Hmmm…could this be the start of a healthy post-romance friendship?\n\nPhotography via Twitter/@heardtroye\n\nAugust 2017: Nude photos of Justin are posted to Selena’s Instagram\n\nWith 125 million followers, Selena Gomez is the most followed person on Instagram. So when hackers posted nude photos of her ex-bf to her account, a LOT of people noticed. When Selena’s team clued in, they swiftly took down her page to remove the NSFW photos and re-secure her account. Gomez’s Instagram was back online minutes later, with the nude pics deleted.\n\nThe explicit photos posted aren’t new: these are the same Bieber images that were published after the pop star’s Bora Bora vacation in 2015. Obviously, that doesn’t make it okay—we should never look a someone’s naked body without their consent.\n\nOctober 2017: Justin and Selena spotted hanging out at Gomez’s home\n\nLooks like Bieber’s song “Friends” really was about Selena! At the end of October, Justin was spotted at his ex-girlfriend’s home in California. According to TMZ, Jelena spent time with mutual friends, and Selena’s current boyfriend, The Weeknd, was fully aware of the hangout. TMZ also reports Justin and Selena first reconnected around the time Gomez announced she’d undergone a kidney transplant. All’s well that ends well!\n\nOctober 2017: Justin and Selena go to church together\n\nIt was Sunday Funday for Jelena, with the former lovers spending the full day together on Oct. 29, 2017. According to TMZ, Justin and Selena first attended church service together before grabbing a bite to eat at Joi Cafe in Westlake Village, California. The exes reportedly left together, and Biebs showed up at Selena’s doorstep later that evening. A Sunday well spent brings a week of content!\n\nOctober 2017: Selena is single, and Justin is THRILLED\n\nSound the alarms! According to a source via People, the “Sorry” singer is “happy Selena is single. He hopes to regain her trust so they can get back together.” According to Bieber’s “close friend”/wingman, “It seems their relationship now is very different. Justin is certainly a much better person. He would be a better boyfriend, too.” Maybe Justin’s song “Friends” wasn’t about Selena after all…\n\nNovember 2017: Justin and Selena get pretty cozy\n\nWell these two aren’t wasting any time are they? Jelena hung out in L.A. AGAIN the morning of November 1: They’re biking, they’re laughing, they’re nuzzling into one another, and it’s ALL going down in front of photographers. It’s not PDA, but it’s pretty close. All we need now is an Insta official pic from @justinbieber or @selenagomez.\n\nNovember 2017: Selena wears Justin’s hockey jersey\n\nSelena Gomez wearing Justin Bieber's hockey jersey is the Canadian equivalent of getting engaged, right? pic.twitter.com/Xr3SdQTSfq — Erica Steiner (@SendARavenPlz) November 2, 2017\n\nOkay, so it’s not a PDA social media post — but it’s pretty close! Selena arrived at the LA Vallet Ice Centre in an all-black ensemble, and after cheering on her ex (?!) boo, left the building wearing Beiber’s New Jersey Devils hockey jersey. Isn’t the ‘borrowed-from-a-boy’ look the international indicator of love?\n\nNovember 2017: Jelena is kissing in public again\n\nGuess it’s not too late to say sorry for #SelenaGomez and #JustinBieber 💕 #Jelena A post shared by FASHION Magazine (@fashioncanada) on Nov 16, 2017 at 9:45am PST\n\n\n\nThis is the PDA confirmation we were waiting for! TMZ has shared photos that show the pop singers sealing the deal with a rink-side kiss at one of Justin’s hockey games. To all those who doubted Jelena: we told you so.\n\nNovember 2017: Justin likes then unlikes a pic of Selena on Instagram\n\n📱| Justin Bieber liked this photo of Selena on Instagram pic.twitter.com/gvo1ZnDKr4 — Selena Gomez Source (@GomezSource) November 20, 2017\n\nJustin Bieber unliked https://t.co/vJbNYlFKRz — Selena Gomez Source (@GomezSource) November 20, 2017\n\nTrouble in paradise already? Fans freaked out after they noticed Bieber liked a photo of Selena on Instagram, only to unlike it a few minutes later (“Their whole relationship in a nutshell,” remarked one clever Twitter user). Granted, the photo wasn’t actually posted on Gomez’s account but rather a fan account meaning Biebs (who currently doesn’t follow Selena, nor does she follow him) is resorting to exploring the ‘gram for pics of his lady.\n\nIn other news, the “Wolves” songstress quietly unfollowed ex-boyfriend The Weeknd on Instagram, and he later followed suit. And now we wait for the real indicator of the relationship status of Jelena: the duo hitting the “Follow” button on each others’ accounts. Stay tuned.\n\nDecember 2017: Justin is asked if he’ll propose to Selena\n\nJustin Bieber Smiles, Blushes When Asked If He'll Propose to Selena Gomez https://t.co/ad4u4sGJ3f — TMZ (@TMZ) December 6, 2017\n\nIn a video captured by TMZ , a paparazzi is heard asking Justin if he plans to get down on one knee to propose to Selena. The Biebs didn’t get a straight answer, but he did flash a wide grin and blush at the question as he got into his car. That’s something, right?\n\nDecember 2017: Justin and Selena will spend Christmas apart\n\nAccording to a recent report from People, Gomez’s family is less than supportive about her reunion with Bieber, and won’t be inviting him their family Christmas. “Justin’s family always loved Selena,” a source told the Magazine, “but Selena’s family is still not happy about her seeing Justin.” Selena, on the other hand, will always be welcome in Stratford, Ontario: “I’ve met her and we have a special bond, so I think she’s precious,” Beiber’s mom, Pattie Mallete, gushed to People over the weekend.\n\nDecember 2017: Biebs and Selena share a drink at the Sugar Factory\n\nThey may not be spending *actual* Christmas together, but Justin and Selena are making sure to enjoy each other’s company pre-holiday festivities. According to TMZ, Jelena went on a date at the Sugar Factory, sharing a (non-alcoholic) drink called the Ocean Blue. How romantic!\n\nSelena Gomez’s mom was reportedly hospitalized after a fight about Justin Bieber\n\nPhotography via Getty\n\nSelena’s mom, Mandy Teefey, was voluntarily transported for treatment to a L.A. hospital last week after having a “heated” chat with Selena about her relationship with Justin, TMZ has reported. According to a source, Selena revealed to her mom that the on-again-off-again pair were in couples therapy, leading her to realize “the relationship was going to be more long-term.” The two later unfollowed each other on Instagram.\n\nDecember 2017: Jelena reportedly in couples therapy because of a fight over Hailey Baldwin\n\nThe drama continues! TMZ reports Jelena is in Christian’s couples therapy after the pair had a fight over Justin’s ex, Hailey Baldwin. According to sources connected to Hillsong Church, Bieber has been trying to make amends with Baldwin to “clear the air over their brief relationship and sour breakup.” He informed Selena of the the convo, which didn’t go over too well, resulting in the pair going to therapy.\n\nJanuary 2018: Justin poses on Instagram with a tree\n\nTrouble in paradise? While vacationing somewhere tropical, Justin posted a photo cuddling up to a palm tree with the caption, “Now I know what Love is.” Fans panicked: What does this mean? Did he not know what love was like when he was with Selena? Does he love the tree more than Selena? J-14 is convinced the caption is about his love for Jesus. (Interesting.)\n\nFebruary 2018: Jelena spotted making out amidst break-up rumours\n\njust seen Justin Bieber and Selena Gomez cuddling in the middle of the street:))) — 🍑 (@hennessyysilvaa) February 9, 2018\n\nPhew! No worries Jelena stans, the couple is going strong. When Bieber and Gomez attended the Rex Orange County show in Los Angeles, one fan got footage of what appears to be them cuddling in the street, while several others tweeted about seeing the two after the show. Here’s hoping the duo share their Valentine’s Day plans with the rest of us, and that they finally make things Insta-official?\n\nFebruary 2018: The pair indulge in a Laguna Beach Valentine’s staycation\n\nPhotography via Instagram/@TheJBCrewdotcom\n\nWith Gomez in New York for Fashion Week, it appears that the newly reunited couple won’t be spending Valentine’s Day together. But don’t fret Jelena stans! Because from the looks of things, Gomez and Bieber enjoyed a romantic staycation on the West Coast this past weekend in celebration of the holiday. TMZ reports that the duo were hanging poolside at the Montage hotel in Laguna Beach on Sunday, where they were spotted taking romantic beach walks and taking in the view.\n\nFebruary 2018: Jelena heads to Jamaica for a family wedding\n\nBieber and Gomez have landed in the Caribbean for a wedding — but don’t freak out yet, because it’s not their own. Justin’s dad Jeremy is tying the knot in Jamaica with longtime girlfriend Chelsey Rebelo, and the “Sorry” singer is bringing along Selena as his plus one. It’s a pretty big relationship step to take someone as a date to your parent’s destination wedding, right? These two are just as serious as we thought.\n\nMarch 2018: Selena Gomez posts a b-day tribute to her boo\n\nThis is the moment we’ve been waiting for! It’s not the PDA-filled couple selfie we were hoping for, but at least it’s something! It’s sweet, subtle — and kind of meta? It’s a photo of a photo of Selena Gomez with a photo of Justin Bieber on her forehead. The caption: “March 1, 1994 someone I know that happens to be super cool was born. Boom.” Well said. There’s no better birthday gift than an Insta-official relationship.\n\nMarch 2018: Sources say Jelena is taking time apart\n\nJust six days after making their relationship Instagram official, rumours have started circulating that the on-again couple are taking a break. An unnamed source told E! that after spending so much time together in Jamaica, Gomez and Bieber “were having a lot of little disagreements recently and one fight in particular blew up and caused them to decide to ‘break up.’ However they’ve been in contact the entire time and their feelings for each other have not changed.”\n\nBut don’t worry too much Jelena shippers: “They will absolutely get back together and they are not over,” says the source, “but they both need some time away from each other.”\n\nMarch 2018: Justin Bieber is spotted hanging out with another woman\n\nPhotography via Instagram/@floor8official\n\nTo cope with the break, Selena Gomez has taken off to Australia with her ukelele. Bieber has another approach to heartbreak: hang out with a beautiful blonde Sport’s Illustrated model. According to Entertainment Tonight, the mystery girl is Baskin Champion, younger sister to Abby Champion, actor Patrick Schwarzenegger’s GF. Champion and Bieber attended Craig David’s concert together in Los Angeles Tuesday night, where sources say Bieber had his “arm wrapped around her waist during one song, and she was spotted dancing up on him throughout the show.”\n\nMarch 2018: Justin and Selena have reportedly called it quits — for good\n\nGrab your tissue box: it looks like Jelena’s “break” has turned into a break-up. Reports say that Bieber is holding out for a reunion, but “Selena realized even though he’s made some positive improvements, they just aren’t a perfect match right now,” a source told E! News. The bad news gets worse, because the source also said that the two aren’t talking anymore (cue the Charlie Puth x Selena Gomez song.)\n\nFans think Gomez’s latest outfit — a pair of itty-bitty Daisy Dukes and a yellow t-shirt that read, “Never underestimate the power of a woman” — is hinting at the heartbreak. But hey, this could very well be message for all men!\n\nApril 2018: Sources say Justin wants Selena back\n\nNot all hope is lost! According to a new report from People, Bieber desperately wants Gomez to take him back.“He loves her. He wants her back,” the source says, adding he “misses” Gomez. Can these two please just let us know what’s up? This seven year on-again-off-again drama is giving us serious whiplash.\n\nMay 2018: Selena has apparently “completely moved on”\n\nHave we reached the end of our lover’s saga? Multiple sources have told E! News that Gomez is over Bieber and not interested in rekindling their romance any time soon. “She respects him as a person but has decided she is much happier doing her own thing.,” said one insider to E! Selena rarely even talks about Justin anymore, and is fully open to dating.” So, is this the conclusion of the on-again-off-again romance? Or has precedent shown us that this is just another bump in the road for these star crossed lovers?\n\nJune 2018: Justin and Hailey Baldwin are hanging out again\n\nAhhh another rekindled love! This past weekend, the once rumoured couple reunited for a few days of bikinis and bibles in Miami. They were photographed drying each other off by the pool, attending a church conference and snuggling on the VIP balcony of LIV Nightclub at Fontainebleau. You know, normal relationship stuff.\n\nJuly 2018: Justin and Hailey get engaged\n\nAfter just a month of dating, Bieber popped the big question to Baldwin at a resort in the Bahamas.“Everyone was at a restaurant on the property doing salsa dancing when Justin’s security told everyone to put their phones away,” two witnesses told TMZ, who broke the story early July 8, “because something special was about to happen.”\n\nHave we finally reached the fateful end of our ongoing Jelena timeline? After seven years of drama, maybe it’s what’s best.", "images": ["https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-05-e1478101062552-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/06/Screen-shot-2018-06-26-at-2.57.33-PM-e1530039507350-90x90-c-default.png", "https://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/img/dst/misc/snapchat-qr-code.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-10-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-06-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-07-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/10/Celebs-quitting-social-media-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/01/celebrity-hair-change-2017-selena-gomez-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/img/dst/logos/logo_st-joseph-cropped.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-08-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/Screen-Shot-2018-11-19-at-3.29.08-PM-90x90-c-default.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/12/selenamom-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2020/02/unnamed.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/06/selena-gomez-justin-bieber-relationship-leaked-duet-song-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-04-460x460-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/06/selena-gomez-justin-beiber-manchester-480x480-c-top.jpg", "https://media.giphy.com/media/zyHJwDcgCRKFy/giphy.gif", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-01-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-12-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/Screen-Shot-2018-03-28-at-2.13.45-PM-324x324-c-top.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-09-e1478105004370-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/Screen-Shot-2018-03-21-at-4.22.44-PM-427x427-c-top.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/06/Screen-Shot-2017-08-21-at-12.38.23-PM-480x480-c-top.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-13-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/05/selena-gomez-justin-bieber-relationship-bad-liar-480x480-c-top.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/08/Screen-Shot-2017-08-29-at-9.56.37-AM-464x464-c-top.png", "https://www.facebook.com/tr?id=1124567250995889&ev=PageView\r\n&noscript=1", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/01/selena-gomez-justin-bieber-the-weeknd-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-03-e1478099972143-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/11/selena-gomez-the-weeknd-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/07/001_B_coverLowRes_Thai_FASUM18-260x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena-480x320-c-top.jpg", "https://media.giphy.com/media/kEF2IQdTNIT8A/giphy.gif", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-11-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/11/selena-gomez-justin-bieber-relationship-14-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/07/CVR_AUG_FA0818_hi-260x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/08/shutterstock_editorial_9876802fo_huge-90x90-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2016/08/selena-gomez-justin-bieber-relationship-02-480x480-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/img/dst/fashion-logo.svg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-14-at-10.32.13-AM-426x426-c-top.png"], "top_img": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena.jpg", "keywords": [], "authors": ["Date July"], "canonical_link": "https://fashionmagazine.com/culture/selena-gomez-justin-bieber-relationship/", "title": "A Complete Timeline of Selena Gomez and Justin Bieber's Relationship", "meta_data": {"description": "So. Much. Drama.", "viewport": "width=device-width, initial-scale=1.0", "thumbnail": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena-900x600-c-default.jpg", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/mstile-144x144.png", "theme-color": "#ffffff", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "A Complete Timeline of Selena Gomez and Justin Bieber's Relationship", "description": "So. Much. Drama.", "url": "https://fashionmagazine.com/culture/selena-gomez-justin-bieber-relationship/", "site_name": "FASHION Magazine", "updated_time": "2019-08-07T14:28:15+00:00", "image": {"identifier": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena.jpg", "secure_url": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena.jpg", "width": 1788, "height": 1114}}, "article": {"tag": "selena gomez justin bieber relationship timeline", "section": "Culture", "published_time": "2018-07-08T08:50:04+00:00", "modified_time": "2019-08-07T14:28:15+00:00"}, "twitter": {"card": "summary_large_image", "description": "So. Much. Drama.", "title": "A Complete Timeline of Selena Gomez and Justin Bieber's Relationship", "image": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/03/jelena.jpg"}}, "movies": [], "publish_date": 1531039804.0, "source": "http://fashionmagazine.com", "summary": ""}