{"url": "www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "text": "Kanye West is rumored to be nearing billionaire status .\n\nThe rapper and entrepreneur joined President Donald Trump at the White House as he signed the Music Modernization Act on Oct. 11, 2018.\n\nThe celebrity’s business ventures include his successful Yeezy collection.\n\nFrom releasing new music to generating new controversies, Kanye West has no trouble staying in the headlines.\n\nFor example, the “Monster” artist and President Donald Trump supporter met with Trump himself on Oct. 11, 2018. The White House meeting included a ceremonial signing of the Music Modernization Act, which has increased royalty rights for musicians.\n\nWest also returned to music in a big way in 2018. The rapper released his album, “Ye,” on June 1, 2018, which was his first album release since 2016. The album features other big names like Nicki Minaj. West also released an album, “Kids See Ghosts,” with Kid Cudi on June 8.\n\nIn addition to his music, West appears to be busy with his business ventures: In April, the entrepreneur tweeted that his clothing company, Yeezy, would hit $1 billion in 2018. During a July appearance on the “Jimmy Kimmel Live!” show, Kim Kardashian West confirmed rumors that Kanye West was approaching billionaire status. His claim that Yeezy would hit the milestone is unlikely, but not impossible, according to GQ magazine.\n\nOpen a New Bank Account\n\n\n\n— ye (@kanyewest) We have 160 positions to fill by the end of the year. Yeezy will hit a billion dollars this year. It is the 2nd fastest growing company in history. It is a unicorn on its way to becoming a decacorn.— ye (@kanyewest) April 25, 2018\n\nKanye West Net Worth: $250M\n\nDespite his wife’s assertion of him reaching near-billionaire status, Kanye West’s current net worth is reported to be $250 million, according to Celebrity Net Worth. But at $220 per pair of Yeezy 350s, West would need to do just 12 shoe releases of 400,000 pairs over the course of a year to hit $1 billion in sales, according to GQ.\n\nAlthough the full impact of Kanye West’s recent controversial statements on his net worth is yet to be seen, at least one radio station program, “The Morning Bounce” on 105.1 in Detroit, announced in May 2018 that it would no longer play West’s music or have him on the show due to his comments on slavery. Other media personalities and hashtags to #BoycottKanye and #MuteKanye called for similar action around that time, but those statements haven’t resulted in a documented hit to West’s net worth.\n\nHis net worth is certainly a lot, but it’s less than half of the family fortune. Kim Kardashian West has a net worth of $350 million, according to Celebrity Net Worth, bringing the couple’s grand total to $600 million.\n\nAnother Near-Billionaire in the Family: Kylie Jenner Net Worth Skyrockets — See the Kardashian Sister’s Unbelievable Fortune\n\nThe couple has spent years renovating their $20 million Hidden Hills, Calif., estate since they purchased it in August 2014. They’ve spent around $20 million to overhaul the 30,000-square-foot property, TMZ reported in January 2018.\n\nBefore the move, they resided at their 9,000-square-foot Bel-Air, Calif., mansion, which they purchased for $9 million in 2013 and spent more than $2 million updating. In November 2017, the couple sold the home for $17.8 million, TMZ reported. Not only did this net them a huge profit, but the sale also made history as the most expensive sale in the Bel-Air Crest community.\n\nKanye’s most recent real estate eye-catcher is a swank apartment in one of Miami Beach’s most luxurious condos. He spent $14 million buying a unit in Faena House for his wife. The 47-unit building features upper crust trappings such as Miele appliances, Dornbracht bathroom finishes and marble flooring, all of which are listed as standard on the Miami Condo Investments website.\n\nKanye West Music Career\n\nKanye West’s debut album, “The College Dropout” (2004), included hit songs like “Jesus Walks” and “Slow Jamz.” He followed that album with his sophomore record, “Late Registration” (2005), which included the song “Gold Digger” featuring Jamie Foxx. Then came the albums “Graduation” (2007), “808s & Heartbreak” (2008), “My Beautiful Dark Twisted Fantasy” (2010), “Yeezus” (2013) and “The Life of Pablo” (2016).\n\nHis latest album, “Ye,” debuted at No. 1 on the Billboard 200 chart. About 70 percent of sales were composed of streaming equivalent albums, which was a first for a Billboard chart-topper. In March 2017, “The Life of Pablo” became West’s eighth album to go platinum. This accomplishment is especially significant considering more than 500,000 copies were pirated, making it one of the most bootlegged albums of all time.\n\nUnfortunately for West, the “Saint Pablo Tour” didn’t have the same happy ending. Following a slew of erratic onstage antics, West canceled the final 21 dates of the tour in November 2016.\n\nOpen a New Bank Account\n\nWest began releasing new music in April 2018, starting with the single “Lift Yourself,” which some believe is some sort of inside joke. He released the single “Ye vs. the People” shortly after, which features West and rapper T.I. talking about their political differences. Unfortunately for West, the media blitz didn’t seem to help generate sales for his new singles. “Lift Yourself” only racked up 4,000 digital sales in its first week, and “Ye vs. the People” reached only 12,000 in first-week digital sales, The Fader reported in May 2018.\n\nAlso See: Rapper Tyga’s Net Worth and Luxurious Lifestyle\n\nKanye West Business Ventures\n\nApart from music, Kanye West is also a fashion designer with his own collection: Yeezy. Yeezy Season 1 debuted at New York Fashion Week in February 2015 as a collaboration between West and Adidas. West debuted Yeezy Season 6 on Instagram, a departure from his usual NYFW debuts.\n\nPrior to joining forces with Adidas, West created a successful line of Nike Air Yeezy sneakers. But he cut ties with Nike in November 2013, claiming the company didn’t pay him royalties. In June 2016, Adidas announced it would continue its partnership with West, which could help turn him into a billionaire, Inc reported. Under the terms of this agreement, he’ll get his own retail shops, according to Inc. West has also expressed his interest in designing basketball and football athletic wear.\n\nIn April 2018, West claimed on Twitter that he is “currently the single highest paid person in footwear. That means I make more money on shoes than Michael Jordan.” Whether or not his claims are true, his Adidas contract is definitely lucrative. In an interview with Bloomberg TV, Adidas CEO Kasper Rorsted said that the company has not discussed dropping its deal with West, even though “there clearly are some comments we don’t support.”\n\nBeyond Yeezy, Kardashian West and West debuted their own line of children’s clothing in May 2017.\n\nKanye West Family\n\nKanye West spent an estimated $6.2 million to surprise his then-girlfriend Kim Kardashian with an elaborate marriage proposal in San Francisco. The couple married in Italy the following year in an extravagant ceremony thought to have cost roughly $2.8 million. This sum does not include the cost of their prenuptial festivities in Paris, which involved renting out the Palace of Versailles for their wedding rehearsal.\n\nFrequently vocal about his love for his wife, West has a history of showering her with over-the-top gestures. For example, for Mother’s Day 2016, West woke his wife with a surprise performance by a string ensemble in their living room. For Christmas 2017, West surprised Kardashian West with hundreds of thousands of dollars in stock options from major performing brands such as The Walt Disney Company, Adidas, Netflix and Apple. Kardashian West splashed the generous gift all over social media, touting West as the “best husband,” according to Fortune.\n\nKanye West Kids\n\nThe couple currently has three children. Their daughter North was born on June 15, 2013; their son Saint was born on Dec. 5, 2015; and their third child, daughter Chicago, was born on Jan. 15, 2018, delivered via surrogate. The decision to use a surrogate came after Kardashian West was pregnant and faced birth complications in the form of placenta accreta with her first two babies. The newest Kanye West and Kim Kardashian West baby will also be delivered via surrogate.\n\nOpen a New Bank Account\n\nClick through to read more about the ultimate status symbols only the rich can afford.\n\nMore on Net Worth and Celebrities\n\nWe make money easy. Get weekly email updates, including expert advice to help you Live Richer™.\n\nLaura Woods and Sean Dennison contributed to the reporting for this article.", "images": ["https://cdn.gobankingrates.com/wp-content/uploads/2017/08/170831_GBR_Contributors_Olya_1420x595-150x150.jpg", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/gbr-logo.svg.gzip", "https://cdn.gobankingrates.com/wp-content/uploads/2016/06/0_MAIN_KanyeNetWorth_Kevork_Djansezian_GettyImages-486015768.jpg", "http://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/logo-zergnet.png"], "top_img": "https://cdn.gobankingrates.com/wp-content/uploads/2016/06/0_MAIN_KanyeNetWorth_Kevork_Djansezian_GettyImages-486015768.jpg", "keywords": [], "authors": ["Gabrielle Olya", "Read More", "Lucy Mueller", "Laura Woods", "Priscilla Aguilera", "Joel Anderson", "Andrew Lisa"], "canonical_link": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "title": "Kanye West Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, shrink-to-fit=no", "description": "Kanye West is rumored to be nearing billionaire status. The rapper and entrepreneur joined President Donald Trump at the White House as he signed the Music Modernization Act on Oct. 11, 2018. The...", "keywords": "GOBankingRates,celebrity,entertainment,finance,kanye west,kanye west baby,kanye west net worth,kim kardashian,kim kardashian west,music,net worth,celebrities", "og": {"title": "Kanye West Net Worth", "type": "article", "url": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2016/06/0_MAIN_KanyeNetWorth_Kevork_Djansezian_GettyImages-486015768.jpg", "site_name": "GOBankingRates", "description": "Kanye West and Kim Kardashian's baby will arrive via surrogate."}, "article": {"published_time": "2019-01-04T19:14:00Z", "modified_time": "2019-06-18T16:32:11Z"}, "twitter": {"card": "summary_large_image", "title": "Kanye West Net Worth", "description": "Kanye West and Kim Kardashian's baby will arrive via surrogate.", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2016/06/0_MAIN_KanyeNetWorth_Kevork_Djansezian_GettyImages-486015768.jpg"}, "thumbnail": "https://cdn.gobankingrates.com/wp-content/uploads/2018/06/Kanye-West-shutterstock_5895392ba-848x477.jpg", "original-source": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "google-site-verification": "UM4IRrnbuHbpidFzGcubzUTnYM2nSbbsENyWzajsLtg", "msvalidate.01": "835EF260572EA20ACFC7CE1547620982", "fb": {"pages": 191525857260}, "p": {"domain_verify": "5c213d8c1e1470fb2409d7569153017a"}, "msapplication-TileImage": "https://cdn.gobankingrates.com/wp-content/uploads/2017/04/cropped-gbr-logo_go_site_id-270x270.png", "position": 4}, "movies": [], "publish_date": 1546629240.0, "source": "http://www.gobankingrates.com", "summary": ""}