{"url": "https://genius.com/a/kendrick-lamar-s-life-story-in-lyrics", "text": "From Cornrow Kenny to K. Dot, Kendrick Lamar has given us his life story through his raps. To prove it, we combed through years of the Compton spitter’s rhymes — from early mixtape days to his latest critically acclaimed material — piecing together his life story using only his lyrics. Thanks to his expert storytelling and vivid imagery, we have quite the hip-hop autobiography here. Be sure to click each line to see the source for every quote as you take a trip down K. Dot’s memory lane.\n\nPROLOGUE: I AM\n\nWelcome to the story of my life. I am Kendrick Lamar. Brace yourself. I’ll take you on a trip down memory lane. Fasten your seatbelts. The ride is rough.\n\nFamily is all I need. From Chicago, my daddy and my momma came to Compton to accomplish one thing: Raise a king, reign supreme, named Kendrick. I ain’t lying, it stand for king and I am one. My momma love me, but she know her son a trip. My pops gave me some game in real person. I’m wise like my pops but I’m young, motherfucker. I represent my lil' sisters and brothers. I’m the oldest.\n\nNow, everybody sit your bitch ass down and listen to this true mothafuckin' story told by Kendrick Lamar.\n\nCHAPTER I: good kid (1987-1997)\n\nWelcome to my diary. Can I pay my past a visit? Let me tell you when it all started: June 17th, 1987. I was born in Dominguez Hospital. Cornrow Kenny, he was born with a vision. My mother had named me Kendrick. That’s the name that I was given. My mama told me that I was different the moment I was invented. A strange baby. No, I’m not ashamed. Little Kendrick, a young boy from Compton, just a good kid trying to keep it neutral, trying to keep it positive.\n\nI remember it all, them early Compton days, on Alondra, in that small apartment. I seen a dead body at 5 and that shit made me traumatized.\n\nI went to McNair Elementary, Compton School District. Kendrick the good kid, straight-A student, infatuated with cartoons and G.I. Joes, The Simpsons, and eating some cereal for dinner. Apple Jacks and Animaniacs the only thing that gave me peace of mind. Cartoons and cereal. I ain’t felt this good since.\n\nYou don’t know about our living conditions. I’m from the bottom of the jungle. My section be on the west side of Compton, Cali, champ, where the killers posted on the corner like a letter stamp, kids don’t get sleep, guns keep ‘em up real late, walk in the school, shells lying on the concrete.\n\nI’ve been a welfare case. My life been on Section 8. ‘95, We was living out a hotel at the time. My mama didn’t raise me up to be jealous-hearted. “Regardless of where you stay, hold your head and continue marching,” That’s what she said, but in my head I wanted to be like Jordan. Close my eyes inside the swap meet and imagine it’s a mansion: gold ballroom. That’s a lifestyle that we never knew. Back to reality—we poor.\n\nI’m trapped inside the ghetto and I ain’t proud to admit it. Mama babysitting, Section 8 vouchers the move when nothing else to lose but a burger-flipping job. Momma’s scratching lottery tickets knowing that it’s just a fairy tale cus' we ain’t gonna win.\n\nWe was eating the free lunch. Every day we pray to eat at the table at Sizzlers, but never make the visit. All I seen was spam and raw sardines. For now, we heat this skillet so this canned food can burn.\n\nOh! I shot my first .22 when I was 9. Evidently, I had a fondness for material things. Ten years old trynna get a 10-K ring. Elementary hood shit. For the record, I used to do a lot of humping when I was little. I got a lot of whoopings over that shit too, and that’s random, but so what?\n\nCHAPTER II: m.A.A.d. city (1998-2003)\n\nThen I went to Vanguard, school of hardknocks. Can you relate to my story? Can you follow my dreams and admirations that I had ever since I was 13? Thirteen I was ready for gunplay. Dealing with depression ever since an adolescent.\n\nI was 14 when I wrote a rhyme. We was in the hood, 14 with the deuce-deuce, just a teenager deep in my thoughts. Every day I try to escape the realities of this world. I used to write rhymes, all day and all night.\n\nI swear to God half of ya’ll just don’t know Kendrick. Centennial High had me swimming with a pool of sharks. If I told you I killed a nigga at 16, would you believe me? Or see me to be innocent Kendrick you seen in the street with a basketball and some Now & Laters to eat? I grew up with killas man, people who killed men, but my character never could be like them.\n\nPeep my persona: I never killed a man, never sold any crack. I’m not your Crip or your Blood. Homie, I’m just Kendrick. I’m no gangster, no killer, I’m just your average Joe, but one thing you should consider: I’m the realest you know.\n\nCHAPTER III: BLACK BOY FLY (2004)\n\nWho is K. Dot? A young nigga from Compton, on the curb writing raps next to a gunshot, in the hood with the 17-year-olds that’s on hood patrol, teenage gun toters that don’t play fair. Where I’m from, we buy guns and more guns, to give to the young. So if you ask what I’m doing, I’m tryna duck the influence of my city that’s brewing. Real talk. Just a good kid from Compton that wanna rap.\n\nI am now on the verge of telling the real story: In 2004, I used to be jealous of Arron Afflalo. He was the one to follow. He was the only leader foreseeing brighter tomorrows. He would live in the gym. We was living in sorrow. Total envy of him. He made a dream become a reality, actually making it possible to swim his way up outta Compton with further more to accomplish. We singing the same old song. Eleventh graders gone wrong. He focused on the NBA we focused on some Patrón.\n\nRemember being 17 wishing someone would sign me. Dreams of living life like rappers do. Go getter, with no cheddar. Just a white tee and a swap meet sweater.\n\nI used to want to be the messiah of rap. Infatuated with becoming a relevant star. I used to wanna rap like Jay Z until I finally realized that Jay wasn’t me.\n\nThen, this nigga named Pop Gates came to my school with a camera. I freestyled on his DVD for a minute. Then after it hit the streets, I was known as K. Dot from Compton.\n\nCHAPTER IV: WANNA BE HEARD (2005-2007)\n\nAnyway, I put out a mixtape in 12th grade: Hub City Threat: Minor of the Year. DJ Dave and his brother designed, put together the music. I used to be in the booth till four in the morning with school in the morning, yawning, but I was on it. Put it out to the people, the people said I was stupid with the flow.\n\nTop Dawg told Dave that he’d like to meet me at the studio, the house of pain, Top Dawg headquarters. Made me freestyle for an hour. Told me come back tomorrow, but I came back in a hour.\n\nMy momma believed in me. She let me use her van to go to the studio even though she know her tank is empty. That’s who I do it fo'. My pops got a different approach. Yeah, he believed, but he always questioned when I'mma drop my debut CD. Really he was stressing me getting what I deserved.\n\nFresh outta school ‘cause I was a high school grad sleeping in the living room in my momma’s pad. My pops said I needed a job, I thought I believed him. Security guard for a month, and ended up leaving. In fact, I got fired ’cause I was inspired by all of my friends to stage a robbery the third Saturday I clocked in.\n\nHear Kendrick persevere: We hit the lab with Game and a few other names like Juice and Young. Ya boy did “The Cypha” freestyle and everybody’s like, “Wow. These Top Dawg niggas ‘bout to make noise.“ Shortly after Game took us on tour. I love you for that, but right after that, we didn’t see him no more.\n\nHere’s a story untold: I had a situation with Def Jam, premature. Shit went sour after Jay Z left but I didn’t care. I was glad Jay Z gave me respect.\n\nCHAPTER V: LET ME BE ME (2008-2010)\n\nBy this time, Jay Rock and “All My Life” hit the airwaves. We almost got into some major beef over Lil Wayne. That part I'mma leave out. There’s certain things that the streets only should know about. That’s when I dropped C4 and had the critics mad at me because they didn’t see my views. Grab the hottest album out and re-do it? That’s a goddamn power move stupid.\n\nYou heard my hip-hop when I was 16 years old. Well that was me then, now I’m an adult. 22, like the smallest of guns that you know. Most determined, but with the smallest of funds to show. But I’m not worried. My talent should take me places I’ve never been. The world should turn as soon as my records spin. I wanna be the highest, on top of all the bullshit. The negative you bring, the stress, the violence, the capital punishment, the loud police sirens. Too focused. One word: righteous.\n\nThis is Kendrick Lamar. No more K. Dot. Fuck a stage name. Cooking in a laboratory, hoping I can tell a story that the whole world can feel, like the ones that came before me. Dave said he proud of my newfound honesty and all I could say is, “Will the radio care?” Yeah? Or should I say no? Or should I just stop and come with a whole new approach? Try'na get my mama up out the hood, so don’t blame me if I hustle like I’m broke ‘cause all my life I’ve been broke.\n\nGot all these niggas approaching they mixtapes different. They said seven tracks, I said 15. Called it an EP, they said I’m trippin'. But little did they know, I’m tryna' change the rules that we’ve been confined to, so the corporate won’t make decisions. I’m thinking long-term, tryin' build a company. My future so bright.\n\nCHAPTER VI: CELEBRATION (2011-2016)\n\nWhoever thought that Rosenberg would mention me to Dre? Everybody heard that I fuck with Dre and they wanna tell me I made it. Nigga I ain’t made shit, if he gave me a handout, I'mma take his wrist and break it. Who ever have thought the moment I seen you on Bullis for “Cali Love,” 15 years later you’d be saving my life? Thank you.\n\nNo more livin' poor. I can feel the changes. I can feel the new people around me just want to be famous. Almost lost my life to the industry. Had to look through a photobook to remember me. You people don’t know Kendrick. I’m not the next pop star, I’m not the next socially aware rapper. I am a human mothafuckin' being, over dope ass instrumentation.\n\nI put a lot of pain in the shit I write. If you going through something, this the shit you recite: Section.80. My heart on my sleeve, and I’m speaking my mind on whatever I think. I’m living my dream. I sing what I’m living about.\n\nInside of the studio is where I spend my time at. Thinkin' ‘bout when Sherane tried to set me up. I’m tryna raise the bar high, making a classic—good kid, m.A.A.d city. The newer Miseducation. The story was short film. I put my life in these 12 songs, my fight in these 12 songs. Tell Flex to drop a bomb on this shit. I got the green and gold with a million sold off bein’ myself and I wish you can do the same thing.\n\nNothing’s been the same since they dropped “Control” and tucked a sensitive rapper back in his pajama clothes. I got enemies giving me energy. Subliminally sent to me all of this hate. I was gonna kill a couple rappers but they did it to themselves. I tell ‘em all to hail King Kendrick. Motherfucker know I started from the bottom. You niggas fear me like y'all fear God, but I resolved inside that private hall while sitting down with Jay. He said, “It’s funny how one verse could fuck up the game.”\n\nCame in the game with a plan of beatin' the odds. What an accomplishment. Thank God for rap. I would say it got me a plaque, but what’s better than that? The fact it brought me back home.\n\nWhile my loved ones was fighting the continuous war back in the city, I was entering a new one, a war that was based on apartheid and discrimination. Made me wanna go back to the city and tell the homies what I learned. So I made To Pimp A Butterfly. I told you, my Plan B is to win your hearts before we win a Grammy. Now I run the game got the whole world talkin'. Black man taking no losses.\n\nI’m so far away from the place I used to be: Look at the newer me, fate pursuing me. I can feel the energy in the air. It feel like I’m supposed to be here. Goddamn I feel amazing. A fool if I take it all for granted.\n\nA smart man if I keep my feet planted to the earth ‘cause the people that hurt can understand it. I’ll still give you Kendrick Lamar. This is me.\n\nTell success hello. We here. Dave just bought a new 911. Q just bought a brand new McLaren. Rock-a-lack about to buy the projects. Moosa got his son dripping in gold. Ali ‘bout to let his hair down on hoes. Me, I’m about to let my hair down on hoes. Top billing that’s a million a show. Might blow the whole no whammy on Soul. Might tell Obama be more like Punch. Sounwave caught a Grammy last year. Mack wop, bet he do what he want.\n\nPondering my next accomplishments. I should probably run for Mayor when I’m done, to be honest, and I put that on my Mama and my baby boo too. I quietly hope for change. When I’m done, I’m tryna run the government. They are big dreams. I think that I finally reached the pinnacle of finding myself as an individual. The world is so typical. I just wanna be higher than that. Level two: I’m not done. This is King Kendrick Lamar. And that’s all I wrote.", "images": ["https://images.rapgenius.com/a9cf592fb8ea7a193f11ed0a4e845c78.700x400x1.png", "https://www.facebook.com/tr?id=201983886890479&ev=PageView&noscript=1", "https://images.rapgenius.com/bfb6d9058965efc1b56f62f4de75007c.700x400x1.png", "https://images.rapgenius.com/3245b3490dd9da639786eff040f465ab.700x400x1.png", "http://b.scorecardresearch.com/p?c1=2&c2=17151659&cv=2.0&cj=1", "http://pixel.quantserve.com/pixel/p-f3CPQ6vHckedE.gif", "https://images.rapgenius.com/4a9e0a589a8f9eb44d05e0705c46c52f.700x430x1.png", "https://images.rapgenius.com/56b0d2936c15fe4f5c70a0e28e8c34fe.700x400x1.png", "https://images.rapgenius.com/aa5918293004e64ff617739268038b3b.700x400x1.png", "https://images.rapgenius.com/df23822c877d1cc9befb99f02945cd73.700x400x1.png", "https://images.rapgenius.com/45fd42b7dc34deae4e47b130aee3475d.700x400x1.png", "https://loadus.exelator.com/load/?g=4&j=0&p=1183&page-album_ids=&page-albums=&page-artist_ids=%5B1421%5D&page-artists=Kendrick+Lamar&page-type=article&user_signed_in=false"], "top_img": "https://images.rapgenius.com/4a9e0a589a8f9eb44d05e0705c46c52f.700x430x1.png", "keywords": [], "authors": [], "canonical_link": "https://genius.com/a/kendrick-lamar-s-life-story-in-lyrics", "title": "Kendrick Lamar’s Life Story (In Lyrics)", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=709482991", "y_key": "f63347d284f184b0", "og": {"site_name": "Genius", "url": "https://genius.com/a/kendrick-lamar-s-life-story-in-lyrics", "title": "Kendrick Lamar’s Life Story (In Lyrics)", "description": "From Cornrow Kenny to K. Dot", "image": "https://images.rapgenius.com/4a9e0a589a8f9eb44d05e0705c46c52f.700x430x1.png"}, "fb": {"app_id": 265539304824, "pages": 308252472676410}, "twitter": {"url": "https://genius.com/a/kendrick-lamar-s-life-story-in-lyrics", "title": "Kendrick Lamar’s Life Story (In Lyrics)", "description": "From Cornrow Kenny to K. Dot", "image": "https://images.rapgenius.com/4a9e0a589a8f9eb44d05e0705c46c52f.700x430x1.png", "site": "@Genius", "card": "summary_large_image", "app": {"name": {"iphone": "Genius"}, "id": {"iphone": 709482991}, "url": {"iphone": "genius://articles/265"}}}}, "movies": [], "publish_date": null, "source": "https://genius.com", "summary": ""}