{"url": "http://time.com/4914211/taylor-swift-snakes-timeline/", "text": "Taylor Swift teased her upcoming sixth album, Reputation, with a series of three slinky clips of a slithering snake. It seems the artist is moving into a new era — and will be taking that snake motif along with her.\n\nIn a way, Swift has always been associated with snakes: she was born in 1989, the year of the snake by the Chinese zodiac, and even titled her last album 1989. But previously, the slithery symbol was not an association she claimed or wanted as part of her narrative.\n\nBack in June 2016, Swift and DJ Calvin Harris ended their relationship in what seemed an amicable fashion. Soon after, Swift made it public that she had co-written the chart-topping hit “This Is What You Came For” for Harris under a pseudonym. In response, Harris fans soon took to Twitter to start hitting Swift with snake emojis. Snakes are, in biblical mythology and contemporary shorthand, cunning creatures. Some of Swift’s critics who felt the public reveal undermined Harris’s own success used snakes to share their belief that she had serpentine qualities of her own.\n\nThen in February 2016, Kanye West dropped his now-infamous rap song “Famous” off his album The Life of Pablo. One line, in particular, stood out: “I feel like me and Taylor might still have sex / Why? I made that b—h famous,” he sings. Up to that point, West and Swift had a fraught-turned-friendly history. While West had (notoriously) intercepted her win at the MTV Video Music Awards in 2009, they had afterwards mended fences, even sharing dinner and expressing plans to collaborate.\n\nBut after “Famous” came out, Swift condemned the line as misogynistic and expressed that she was not privy to the use of her name in that context. For West’s part, he said he had an “hour long convo with [Taylor] about the line and she thought it was funny and gave her blessings.”\n\nIn June 2016, Kim Kardashian West further supported her husband’s claim, telling GQ she had footage of a phone conversation in which Swift gave her approval to the lyric. And in July, Kim shared snippets of the taped audio of the phone call in question on her Snapchat story. Swift herself took to Instagram to respond, saying “you cannot ‘approve’ a song you haven’t heard,” and requested. to be “excluded from this narrative.”\n\nThe internet erupted into a frenzy. Coined the #KimExposedTaylorParty, Swift once again was bombarded with snake emojis. Feeding the fray, Kim even tweeted (obliquely) about “National Snake Day” in a seeming reference to Swift.\n\nThe snake emojis disappeared soon enough from Swift’s profiles. (Her Instagram account was the platform’s first test case of a filter to remove select words or emojis on certain feeds.)\n\nSwift also began a year-long period of limited public appearances and social media withdrawal, all culminating in the deletion of content off her digital presence last week, the reclamation of the snake imagery (and reinsertion of herself into that narrative) this week and the final announcement of Reputation on Wednesday.\n\nHer first single is expected to drop Thursday at midnight. It’s unclear what role snakes will play in her next steps.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Raisa Bruner at raisa.bruner@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/03/meghan-markle-narrate-disney-film.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2020/04/Adam-Schesinger-Coronavirus.jpg?quality=85&w=500", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Raisa Bruner"], "canonical_link": "https://time.com/4914211/taylor-swift-snakes-timeline/", "title": "Read the Full History of Taylor Swift and Snakes", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "taylor swift, taylor swift snakes, taylor swift instagram, taylor swift snake emoji, taylor kim kanye, taylor swift controversy, snake emojis", "news_keywords": "taylor swift, taylor swift snakes, taylor swift instagram, taylor swift snake emoji, taylor kim kanye, taylor swift controversy, snake emojis", "description": "The '1989' singer has a fraught history with snakes — and snake emojis — thanks to a feud with Kanye West and Kim Kardashian last year.", "og": {"title": "Taylor Swift Has a History With Snakes: Here's the Backstory", "type": "article", "site_name": "Time", "url": "https://time.com/4914211/taylor-swift-snakes-timeline/", "description": "Everything you need to know about Taylor Swift and snakes", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4914211/taylor-swift-snakes-timeline/", "description": "The '1989' singer has a fraught history with snakes — and snake emojis — thanks to a feud with Kanye West and Kim Kardashian last year.", "media": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4914211/taylor-swift-snakes-timeline/", "title": "Taylor Swift Has a History With Snakes: Here's the Backstory", "description": "Everything you need to know about Taylor Swift and snakes", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}