{"url": "www.yahoo.com/lifestyle/lindsay-lohan-wears-hijab-social-media-mixed-feelings-214247444.html", "text": "Lindsay Lohan was spotted at a modest fashion show wearing a hijab. The actress attended the second annual London Modest Fashion Week over the weekend, and she dressed the part.\n\nBefore the show, she posted a video on her Instagram, in which she learned how to style a hijab and expressed her desire to wear it traditionally. “I think it needs [to be] a little bit more tighter in the [back]. I don’t want it to come off and show too much,” the once risqué woman told her hijab-tutor in the video.\n\nPhoto: BBC News\n\nWhen someone suggested she switch wrapping styles so she could wear it as tight as she wanted, she said she wanted “to do traditional Saudi wrap. … That’s what I’d rather learn to do so I know. … I want to learn how to do it properly.” This could be because she’s set to film an all-female movie in Saudi Arabia. She then told the woman that she had been living in Dubai for three years.\n\nShe also posted a video from the fashion show and spoke to BBC Minute about modest apparel. “Fashion doesn’t always have to be so naked and can be adventurous and still beautiful, with a strong group of women behind it,” Lohan said.\n\nNot only did she wear the right clothing, she also wore the right makeup. According to halal/vegetarian/vegan makeup retailer HawaCosmetics, Lohan stopped by their booth and told them about “how she’s into halal cosmetics and what she’s actually wearing on her face today was all halal!!” according to their social media post. They were referencing the Muslim diet and referring to avoiding non-halal makeup.\n\n\n\n\n\nStory continues\n\nLohan’s efforts to respect Muslim traditions are getting mixed reactions. Some people really into this look were impressed by her interest, including the designers.\n\n@lindsaylohan is getting fitted for a hijab on her insta live right now and I am LIVING #Traditional — Evan ☕️BlackWhite (@EvBenjamin) February 17, 2018\n\n\n\n\n\nCan we deep, a whole fabulous @lindsaylohan repping at London Modest Fashion week @HauteElan! Amazing ❤️ pic.twitter.com/raVzZNMz39 — HafsahD (@HafsahDabiri) February 17, 2018\n\n\n\n\n\nLindsay Lohan flaunting Hijab at fashion show is BEAUTIFUL! — Saira Ali (@ImSairaAli) February 19, 2018\n\n\n\n\n\nLindsay Lohan shines in hijab at #London Modest Fashion Week https://t.co/bKCUUZqWzq pic.twitter.com/raq6GuIdFO — My Salaam (@My_Salaam) February 19, 2018\n\n\n\n\n\nLindsay Lohan in an hijab! Now there’s a role model. — Adele (@Contented2851) February 19, 2018\n\n\n\n\n\nOthers were angry that Lohan was promoting what they see as oppressive attire, especially when women are protesting wearing the hijab in Iran right now and getting arrested for it. “It amazes me how the western civilization sees wearing the hijab as an act of liberation and empowerment while women in Iran are removing their hijabs off as a protest, meaning the hijab is actually a sign of oppression in muslim countries,” one follower tweeted. One user accused Lohan of “normalizing Islamic misogyny.”\n\nSince when did promoting oppressive articles of clothing become a thing? Especially when women take off their hijab's in protest…seems counter-productive… — Lindsey D (@lindseyaya87) February 18, 2018\n\n\n\n\n\nIt amazes me how the western civilisation sees wearing the hijab as an act of liberation and empowerment while women in Iran are taking the hijab off as a protest, meaning the hijab is actually a sign of oppression in muslim countries.@DouglasKMurray — Tom Livne (@countertommy) February 19, 2018\n\n\n\n\n\nNormalizing islamic misogyny:\n\nLindsay Lohan wears hijab to London Modest Fashion Week show https://t.co/7YKSLpCn4r — GornaMary (@mary_i_c) February 19, 2018\n\n\n\n\n\n@BBCNews @lindsaylohan Meanwhile in Iran women are protesting the forced wearing of the hijab. Symbol of oppression. — Richard Buchannan (@RichardBuchann1) February 18, 2018\n\n\n\n\n\nNot at all? It’s entirely diff with their religion. Literally last week thousands of women protest the hijab and here on the West were fashionizing it.. — Luca Paolucci (@LPao01) February 18, 2018\n\n\n\n\n\nSome are defending her choice.\n\nLindsay Lohan is a grown woman, it is her choice to wear a Hijab. Appalled by the fact that many people are sending her hate messages and even death threats because of this! Repulsive behaviour… — Zayne (@KhanEnterprise0) February 19, 2018\n\n\n\n\n\nAuthor and “Advice Goddess” Amy Alkon pointed out that Lohan doesn’t fully get modest fashion just yet, since she was seen at another London Fashion Week show wearing a headscarf paired with a leather LBD.\n\nLindsay Lohan seems seriously confused, vis a vis the intersection of Islam and BDSM-lite with the hijab and ill-fitting leather minidress. — Amy Alkon (@amyalkon) February 18, 2018\n\n\n\n\n\nLindsay Lohan, who has never openly admitted to converting to #Islam, was spotted at the event wearing a hijab\n\nLindsay Lohan Rocks Leather Dress at #ZeynepKartal Fashion Show (AW18 collection show) @lindsaylohan @pekkan1 @ZeynepKartalOffical pic.twitter.com/kGdKvxfv1D — Real News Line (@RealNewsLine) February 18, 2018\n\n\n\n\n\nModest fashion blogger Maryam thinks we’re overthinking it. “Lindsay Lohan donning a Hijab is nothing offensive or alerting in my opinion,” she told Yahoo! Lifestyle. She gives the actress credit for exploring another religion. “I think it’s actually pretty cool that she is touching this part of the Islamic faith. If she wants to wear it, even if it’s occasionally, that’s her personal choice, I don’t see what the issue is,” the Muslim mom stated. “She’s expressed her interest in Islam and perhaps wants to experience the Hijab aspect of it and that’s kind of a no-brainer. So many Muslim women and those studying Islam take this step in their spiritual journey as Hijab is a pivotal part of a Muslim women’s identity. It’s just unfortunate her journey has to be so scrutinized and watched by the thousands since she’s a public figure.”\n\nWhile LiLo does love to shock, anyone who’s been following her shouldn’t be that surprised. She expressed an interest in Islam before this. She changed her Instagram bio in January to “Salam Aleikum,” a standard greeting among Muslims. “In Islamic culture, I feel like it’s a family to me, a lot of my friends are Arab, and they’ve been really good people to me,” she said in an interview on Good Morning Britain in 2017.\n\nLohan also told Piers Morgan about the time she got stopped at an airport while wearing a headscarf. She referred to it as the first time she was “racially profiled.” She had to remove her headscarf, and while she was OK with that, she was still shaken. “What scared me was, in that moment, how would another woman who doesn’t feel comfortable taking off her headscarf feel? That was really interesting to me. I mean, I was kind of in shock,” she said.\n\nWhen pressed about her interest in the religion, she said she had a soft spot for Islam. “I do study it, nothing is confirmed yet…” she said of converting.\n\nThe actress went to Turkey in 2016 to visit with Syrian refugees and was spotted wearing a floral headscarf. Then there was the time she hit the beach in Thailand wearing a burkini.\n\nAnd she sparked rumors that she’d be designing her own hijabs in 2017 when she posted a black-and-white photo of herself wearing one, with a caption reading, “New Fashion Line coming soon …. #fashion.” The post has since vanished, as have any signs of her hijab fashion line.\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "images": ["https://s.yimg.com/ny/api/res/1.2/NVY_LtEPYZX9BHpdgjy6BA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://s.yimg.com/uu/api/res/1.2/mZrYtn7olE.DESwWdKiddQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0aa169ed2fda44bb5ebd0c655f834dbc", "https://s.yimg.com/ny/api/res/1.2/kYAoOl8ruQ.KVh_RyqA9_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/mZrYtn7olE.DESwWdKiddQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0aa169ed2fda44bb5ebd0c655f834dbc", "https://s.yimg.com/ny/api/res/1.2/p7mhKIwKAg.NBKGJyIB9yg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTE2NjtoPTQ4/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/aa5a87b0-7e4e-11ea-bdfd-b9950c4c15e2", "https://s.yimg.com/rz/p/yahoo_life_en-US_h_p_lifev2.png", "https://s.yimg.com/rz/p/yahoo_life_en-US_h_w_lifev2.png"], "top_img": "https://s.yimg.com/ny/api/res/1.2/kYAoOl8ruQ.KVh_RyqA9_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/mZrYtn7olE.DESwWdKiddQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0aa169ed2fda44bb5ebd0c655f834dbc", "keywords": [], "authors": [], "canonical_link": "https://www.yahoo.com/lifestyle/lindsay-lohan-wears-hijab-social-media-mixed-feelings-214247444.html", "title": "Lindsay Lohan wears a hijab, sparking mixed feelings on social media", "meta_data": {"description": "The actress attended the second annual London Modest Fashion Week over the weekend, and she dressed the part.", "og": {"description": "The actress attended the second annual London Modest Fashion Week over the weekend, and she dressed the part.", "site_name": "Lindsay Lohan wears a hijab, sparking mixed feelings on social media", "title": "Lindsay Lohan wears a hijab, sparking mixed feelings on social media", "url": "https://www.yahoo.com/lifestyle/lindsay-lohan-wears-hijab-social-media-mixed-feelings-214247444.html", "type": "article", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/kYAoOl8ruQ.KVh_RyqA9_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/mZrYtn7olE.DESwWdKiddQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0aa169ed2fda44bb5ebd0c655f834dbc", "width": 1200, "height": 800}}, "keywords": "Lindsay Lohan, modest fashion, fashion show, hijab", "oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "news_keywords": "Lindsay Lohan, modest fashion, fashion show, hijab", "apple-itunes-app": "app-id=304158842,app-argument=yahoo://article/view?uuid=488be383-c829-3dd5-aa41-2c05b7f6d290&src=web", "twitter": {"title": "Lindsay Lohan wears a hijab, sparking mixed feelings on social media", "description": "The actress attended the second annual London Modest Fashion Week over the weekend, and she dressed the part.", "site": "@Yahoo", "dnt": "on", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/kYAoOl8ruQ.KVh_RyqA9_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/mZrYtn7olE.DESwWdKiddQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0aa169ed2fda44bb5ebd0c655f834dbc", "src": "https://s.yimg.com/ny/api/res/1.2/kYAoOl8ruQ.KVh_RyqA9_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/mZrYtn7olE.DESwWdKiddQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0aa169ed2fda44bb5ebd0c655f834dbc"}, "player": {"identifier": "https://www.yahoo.com/lifestyle-news/lindsay-lohan-wears-hijab-sparking-173401893.html?format=embed&region=us&lang=en-US&site=lifestyle&player_autoplay=1&expName=y20", "width": 500, "height": 281}, "card": "player"}, "al": {"android": {"url": "yahoo://article/view?uuid=488be383-c829-3dd5-aa41-2c05b7f6d290&src=web", "app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo"}, "ios": {"url": "yahoo://article/view?uuid=488be383-c829-3dd5-aa41-2c05b7f6d290&src=web", "app_name": "Yahoo", "app_store_id": 304158842}}}, "movies": ["https://www.youtube.com/embed/LDpwcE9ylZU?feature=oembed"], "publish_date": null, "source": "http://www.yahoo.com", "summary": ""}