{"url": "www.cosmopolitan.com/entertainment/celebs/news/a50446/kylie-jenner-tyga-dating-relationship-timeline/", "text": "Kylie Jenner and Tyga used to drive fans wild with their “Are they or aren’t they?” relationship after getting together in 2014. There were engagement and breakup rumors. They appeared on each other’s Instagram accounts. They shot down pregnancy rumors. And they took their romance to the next level: Snapchat. (Hands up if that video of Kylie “kissing” Tyga’s grill comes to mind right away.)\n\n\n\nEven though it’s all over now, take a look back at how Kyga came to be.\n\nNovember 2011: Kendall Jenner’s Sweet Sixteen birthday party is one of the first encounters between Kylie and Tyga. The latter performs for the very underage crowd, including a 14-year-old Kylie. Make what you will of the brief flirting, if you can even call it that.\n\nJuly 2014: Tyga makes what many Kyga fans believe is his first appearance on Kylie’s Instagram feed. Kendall and Chris Brown are there for the hang too.\n\nAugust 2014: Tyga celebrates Kylie’s 17th birthday and even offers her a shot of tequila while she’s dancing on some platform. Days later, Tyga ends his engagement to baby mama Blac Chyna two years after welcoming their son, King Cairo.\n\nSeptember 2014: Tyga responds to rumors he’s dating Kylie.\n\n@Tyga Twitter\n\nOctober 2014: Kylie makes one of her first appearances on Tyga’s Instagram account and the two celebrate Halloween together. Despite this giant step in their relationship, Kris Jenner says, “Kylie isn’t dating anybody.” In an interview with Ryan Seacrest, the momager insists that Kylie’s just hanging out with a “little group of kids who have been around forever.”\n\nNovember 2014: Tyga reportedly pulls out of an appearance at Greystone Manor in Los Angeles after Kylie is refused entry because 17-year-olds cannot go to clubs in this country. Weeks later, Tyga and Kylie, who are still officially friends at this point, spend Thanksgiving together.\n\nDecember 2014: Kylie hits three birds with one tweet. This tweet.\n\nin not trying to become a rapper, I'm not getting married, & I'm not pregnant.... — Kylie Jenner (@KylieJenner) December 12, 2014\n\nTyga and his “friend” Kylie visit a children’s hospital in Los Angeles. The sweet visit, which included meet-and-greets with patients and gifts, later appears on an episode of Tyga’s MTV2 show, Kingin’ With Tyga.\n\nFebruary 7, 2015: Tyga and Kylie spend their first Grammys weekend together by partying with Big Sean, Jennifer Lopez, Chris Brown, Justin Bieber, and others. Here’s the still-unconfirmed couple coupling up at the Grammys after-party with Kendall and Khloé.\n\nFebruary 13, 2015: Drake surprise-drops If You’re Reading This It’s Too Late, which includes the song “6PM in New York.” The lyric “You need to act your age and not your girl’s age” makes everyone think Drizzy is talking about Tyga.\n\nMeanwhile, Amber Rose joins in on the already crowded conversation and also slams Tyga. She tells The Breakfast Club: “[He] should be ashamed of himself. That’s how I feel. For sure....He has a beautiful woman and a baby and left that for a 16-year-old who just turned 17. Like, nah.”\n\nFebruary 16, 2015: Khloé responds to Amber’s comments and defends Kylie on Twitter.\n\nWe get asked questions about people all the time and my sisters and I always take the high road and don't answer. Truth is we don't know (1) — Khloé (@khloekardashian) February 16, 2015\n\nthese people. I don't know Amber so why would I comment on her. I'm not going to comment on someone I don't know. (2) — Khloé (@khloekardashian) February 16, 2015\n\nPlease stop talking about us in interviews mama. None of us talk about you. (3) — Khloé (@khloekardashian) February 16, 2015\n\nFebruary 17, 2015: Tyga denies he’s dating Kylie. Again. He tells The Breakfast Club that he did not “leave my family to be with Kylie. That’s ridiculous.” At this point, the radio program’s ratings presumably quadruple.\n\nFebruary 20, 2015: Kanye West sort of confirms Kyga is a real thing. Consider his response to The Breakfast Club (!) when the topic comes up: “I think that, ugh, I think [Tyga] got in early. I think he was smart.” It would later be revealed that the radio show edited Kanye’s original answer, which was something to the tune of “I think they in love.”\n\nKylie finally jumps into the whole Amber/Khloé tirade:\n\nMarch 13, 2015: Tyga pretty much says he’s dating Kylie without actually saying it.\n\nMarch 24, 2015: Blac Chyna shares an Instagram of her driving skills and her Audemars Piguet watch, believed to be a gift from Tyga when they were together.\n\nHours later, Kylie shares this. Can you feel the tension?\n\nApril 21, 2015: Everyone is crazy about the #KylieJennerChallenge, including Blac Chyna, with a sprinkle of shade.\n\nTwo days later, Blac Chyna shares text messages from her ex.\n\nApril 25, 2015: “Love is getting a tattoo of the person you love on one of the most painful areas of the human body.” —Tyga, probably\n\nJune 15, 2015: Tyga brings his son, King Cairo, to North West’s birthday party at Disneyland.\n\nJune 24, 2015: Tyga and Kylie make their first red-carpet appearance together at Cannes but they are not alone: Mom Kris and her boyfriend, Corey Gamble, are there too.\n\nGetty\n\nJuly 8, 2015: Tyga is linked to transgender model Mia Isabella, who claims Tyga sent her nude photos. While Tyga’s legal team disputes the report, they stand by the validity of the images. (Yes, that’s really his peen).\n\nJuly 24, 2015: A clip of I Am Cait shows Kylie telling her grandma Esther Jenner they’re similar because the latter married at 17. Kyga marriage rumors continue.\n\nJuly 27, 2015: In her cover story for Complex, Khloé defends her sister’s relationship with Tyga, saying Kylie “is not a normal 17-year-old” who goes to slumber parties and to prom. Rather, Kylie is a businesswoman and goes on private planes with Karl Lagerfeld.\n\n“It’s a rare circumstance, so let’s treat this as a special case,” Khloé says.\n\nJuly 30, 2015: Kylie marriage update #4,059,687.\n\nNot planning on getting married anytime soon :) — Kylie Jenner (@KylieJenner) July 30, 2015\n\nAugust 9, 2015: Tyga buys Kylie a Ferrari 458 convertible valued at a cool $320,000.\n\nAugust 10, 2015: Kylie turns 18. Tyga’s birthday message gets Instagram official.\n\nAugust 14, 2015: Kylie and sister Kendall auction off clothes on eBay for charity but it’s discovered that part of those clothes are from none other than Tyga’s own Last Kings line.\n\nAugust 18, 2015: Tyga joins Kylie and her family on a vacation in St. Barts.\n\nAugust 25, 2015: Tyga drops a new song, “Stimulated,” believed by many to be about having sex with Kylie when she was still underage. Consider these lyrics: “They say she young, I should’ve waited / She’s a big girl, dog when she stimulated.”\n\nThere’s a video, too, in which he and Kylie get mighty close.\n\nAugust 28, 2015: Kylie and Tyga’s hospital visit in Los Angeles from 2014 finally airs on Kingin’ With Tyga.\n\nAugust 30, 2015: Kylie and Tyga attend the MTV Video Music Awards together.\n\nFilmMagic\n\nSeptember 13, 2015: Kylie kisses Tyga’s grill on Snapchat because why not?\n\nSeptember 23, 2015: Tyga calls Kylie his “fiancée” on Snapchat, but you are all supposed to take it as a joke because it’s apparently just a borrowed rap lyric from Logic.\n\nOctober 23, 2015: Kylie and Tyga attend Olivier Rousting’s star-studded 30th birthday party. You’ve been trying to recreate this photo with your bae ever since.\n\nStefanie Keenan/Getty Images for Beats by Dre\n\nOctober 30, 2015: Kylie turns into a zombie in her second music video with Tyga. Here’s “Dope’d Up.”\n\nNovember 19, 2015: Kylie breaks up with Tyga because of “something Tyga did,” TMZ reports. It also happens to be his 26th birthday.\n\nNovember 22, 2015: Kylie tells “everyone to chill” in a new Snapchat photo with Tyga. Everyone is confused. The pair is later seen heading to an AMAs after-party, where TMZ asks Kylie if she’s going to marry Tyga. Her answer surprises no one.\n\nNovember 23, 2015: Kylie celebrates the one-year anniversary of that pregnancy rumor.\n\nThey've been saying I'm pregnant for one year now... One year. Let's get it together lol — Kylie Jenner (@KylieJenner) November 24, 2015\n\nNovember 25, 2015: Kylie tells Ellen DeGeneres there is no truth to that Tyga split rumor.\n\nNovember 26, 2015: Tyga spends Thanksgiving with Kylie and the Jenner/Kardashian/Disick/West clan. He makes the cut for the epic family photo.\n\nJanuary 8, 2016: Us Weekly reports that Tyga cheated on Kylie with Brazilian model Annalu Cardoso after meeting her on the set of one of his video shoots. She also appeared on an episode of his MTV2 show, Kingin’ With Tyga. One source claims Tyga “waits until Kylie is out of the country” before contacting the model.\n\nThree days later, Kylie and Tyga are spotted holding hands at the Arclight Cinemas in Hollywood.\n\nMarch 19, 2016: In a series of Snapchat videos, Kylie and Tyga turn up the PDA, almost to a level not suitable for even the most dedicated of fans. Here is Tyga grabbing Kylie’s butt at a West Hollywood nightclub. Come on, you two. Shouldn’t you be getting busy with a jigsaw puzzle and cup of tea or something?\n\nMay 2, 2016: Kylie and Tyga go to the annual Met Gala in his-and-hers Balmain ensembles but walk the red carpet separately.\n\nGetty\n\nGetty\n\nMay 12, 2016: TMZ reports Kylie and Tyga broke up “days” before the Met Gala, which explains why they didn’t walk the red carpet together. The site also reports that Tyga took his mom and a model to a Mother’s Day lunch.\n\nJune 29, 2016: In a Snapchat video of nail designs, Kylie says, “This reminds me of my husband,” which drives Kyga nation wild. Meanwhile, E! News reports that Kylie and Tyga are “definitely, officially, 100 percent back on.” One source says the couple just “needed a reset” and that “fate” brought them back together.\n\n\n\nAugust 6, 2016: Ahead of Kylie’s 19th birthday, Tyga gifts her with a brand-new Maybach, estimated to be $200,000, NBD.\n\nFor her big birthday weekend, Kylie jets to Turks and Caicos with Hailey Baldwin, Bella Hadid, and other BFFs. Tyga, who is in the midst of a legal battle with a former landlord of a Malibu property, is there too.\n\nNovember 10, 2016: Dream Kardashian is born to proud parents Rob Kardashian and Blac Chyna. Aunt Kylie turns to Twitter to celebrate the joyous occasion.\n\nI can't stop looking at her 😢 congrats @robkardashian @BLACCHYNA she's so beyond beautiful, a dream 💕 — Kylie Jenner (@KylieJenner) November 10, 2016\n\nNovember 19, 2016: In honor of Tyga’s 27th birthday, Kylie shares two steamy shots of herself and Tyga entangled on a concrete floor. They are both topless in the photos.\n\nDecember 11, 2016: In a series of Snapchat videos, Kylie can be seen cradling her 1-month-old niece Dream.\n\nJanuary 3, 2017: Kylie pays tribute to her beau by getting a lowercase “t” tattoo on her ankle. TMZ reports that the ink was done by celebrity tattoo maven Rafael Valdez—in December. So sneaky, that Kylie. Now would be a good time to use the zoom function on Instagram—you can spot the teeny-tiny “t” in this pic:\n\nFebruary 13, 2017: Tyga joins Kylie in New York City to celebrate her pop-up store opening. The couple celebrate Valentine’s Day together with a breathtaking view of Central Park.\n\nMarch 29, 2017: Tyga’s ex Blac Chyna blasts him on Snapchat and accuses him of not paying child support for their 4-year-old son, King Cairo. Blac Chyna also suggests that Tyga has been cheating on Kylie, bringing up names like “Terrell” and “Heather” on Snapchat.\n\nApril 3, 2017: People reports that Kylie and Tyga have split up again. As expected, the source says this is likely another “little break” and a reconciliation is “definitely possible.”\n\nHowever, this proves to be the last and final breakup before Kylie starts dating Travis Scott, the father of her daughter, Stormi Webster.\n\nApril 16, 2017: Kylie sparks romance rumors after being spotted with hip-hop artist Travis Scott at a party during Coachella. According to a People source, the two have been friends “for a while” and there’s nothing serious going on. “When she and Tyga are having drama, she tries to make him jealous by hanging out with other guys.”\n\nStill, Kylie and Tyga run into each other at Coachella too—and People sources say they “shared an awkward hug.”\n\n“Kylie looked really sad as she walked away,” the source adds.\n\nApril 25, 2017: Kylie and Travis sit courtside during an NBA playoff game between the Houston Rockets and Oklahoma City Thunder in Houston, Texas. One source tells People that the two “definitely looked like a couple cuddled up next to each other among her friends,” adding that they were “super hand-holdy.”\n\nGetty\n\nMay 4, 2017: Kylie and Travis sort of make things Instagram official with this (group) photo taken from the 2017 Met Gala. Travis is hiding behind his own hands.\n\nFour days later, Kylie joins Travis on a trip to Miami, where he performs during the Rolling Loud Festival. According to E! News, the pair coordinated in matching cargo pants and graphic T-shirts and had their arms around each other.\n\nJune 2, 2017: Tyga releases “Playboy,” a new single with rapper Vince Staples, via Soundcloud. The song features lyrics like, “Super freak in my passenger / She a superstar and got it bad for me / If I hang up, she call right back to me / You cut her legs off, she crawl right back to me,” leading many to suspect that he is, in fact, referring to ex Kylie. Do feel free to listen to the song and draw your own conclusions.\n\nJuly 5, 2017: Kylie is spotted out and about in London with a new-ish tattoo on her ankle, leading many to believe she replaced her tiny Tyga “t” tattoo with the letters “L.A.” to pay tribute to her hometown.\n\n\n\nGetty\n\nThe new tat comes weeks after Kylie and current beau Travis showed off matching butterfly tattoos on her Snapchat.\n\nSnapchat | Kylie Jenner\n\nSnapchat | Kylie Jenner\n\nAugust 21, 2017: Kylie talks about her breakup from Tyga publicly for the first time.\n\n“There was absolutely not one thing wrong with me and T. He and I will always, always have a bond,” she said on an episode of her E! reality show Life of Kylie.\n\n“There was no crazy fight, we just decided…well, I decided that I’m really young. I don’t want to look back in five years from now and feel like he took something from me when he’s really not that type of person.”\n\nMarch 28, 2018: As everyone knows at this point, Kylie is pregnant and expecting a baby with Travis! Still, that doesn’t stop some people from speculating about paternity after a fake Snapchat screenshot suggesting Tyga is the father makes the rounds.\n\nTyga responds to the rumors on Twitter himself.\n\n“I’ve never said anything about someone else’s child or family insinuating my involvement and will never do so,” Tyga says. “Please, stop spreading false stories and attacking people’s families. I have nothing to do with any of that. People should be able to live in peace.”\n\nAugust 31, 2018: More than a year after their breakup, Tyga puts Kylie on blast during an episode of Nicki Minaj’s Queen Radio show.\n\nWhen Nicki asks him if he misses Kylie, he says, “No, I’m good. I’m good, love, enjoy.” And when she asks if he put Kylie on the map, he replies, “Big fact. Everybody know that, that’s public,” adding that fans need to look at “the before and after.”\n\n“She always had a platform and she was always destined to be where she was going to be, regardless,” he says. “But when I stepped in and there was a lot of codes being taught, it was like, ‘You could do this. You should start this. You should start doing your hair like this, or you should do this. You should adapt because you need black people to fuck with you ’cause you need culture. If you ain’t got black people behind you, you ain’t got nothing—ain’t nobody going to listen. You can’t influence nobody.’ So I had a lot to do with all that.”\n\nAugust 29, 2019: Kylie and Tyga both party at the same Vegas nightclub, and the run-in is friendly. They were with a group of friends in a karaoke room and left separately.\n\nOctober 3, 2019: Kylie and Travis hang out at a recording studio just a day after Kylie and Travis break up, sparking all kinds of romance reconciliation rumors. (Seriously, the Tyga memes are UNREAL.)\n\nKylie immediately clarifies on Twitter that hanging out with Tyga was hardly a date and her focus is on her daughter, Stormi, right now.\n\nThe internet makes everything 100 times more dramatic than what it really is. There was no “2am date with Tyga”. You see me drop two of my friends off at a studio that he happened to be at. — Kylie Jenner (@KylieJenner) October 3, 2019\n\nTravis and i are on great terms and our main focus right now is Stormi ‼️ our friendship and our daughter is priority — Kylie Jenner (@KylieJenner) October 3, 2019", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-599842406-1570102496.jpg?crop=0.799xw:0.289xh;0.156xw,0.0935xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-stormi-instagram-1539204413.jpg?crop=1.00xw:0.502xh;0,0.0879xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/news/a50446/kylie-jenner-tyga-dating-relationship-timeline/", "title": "Everything to Know About Kylie and Tyga's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Look Back at Kylie Jenner and Tyga's Relationship, Pre-Breakup", "description": "Or Kyga, if you must.", "url": "https://www.cosmopolitan.com/entertainment/celebs/news/a50446/kylie-jenner-tyga-dating-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2019-10-04 05:07:05", "published_time": "2019-10-03 04:24:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Kylie Jenner and Tyga's Dating Timeline - Everything to Know About Kylie and Tyga's Relationship", "description": "From their first encounter to their many breakups, here's how Kylie Jenner and Tyga's relationship has bloomed over the years.", "keywords": "kylie jenner, tyga,", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=0.502xw:1.00xh;0.251xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,tyga,Kylie JEnner", "sailthru.date": "2019-10-03T16:24:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-tyga-01-1491248059.jpeg?crop=0.502xw:1.00xh;0.251xw,0", "sailthru.socialtitle": "A Look Back at Kylie Jenner and Tyga's Relationship, Pre-Breakup", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1570047840.0, "source": "http://www.cosmopolitan.com", "summary": ""}