{"url": "https://www.thehollywoodgossip.com/2018/03/scott-disick-and-sofia-richie-vacationing-with-the-kids-taunting/", "text": "Despite reports that Kourtney Kardashian has warned Sofia Richie to stay away from her kids, it doesn't sound like Scott or the teen are paying her any mind.\n\nIn fact, the two of them have embarked on a romantic vacation ... and brought Scott's kids along. You know, like a family.\n\nWhat's more is that a source reports that Scott is rubbing all of this in Kourtney's face ... just to taunt her.\n\nE!'s source is dishing on Scott Disick's baecation with Sofia Richie, and it sounds like they're having a great time.\n\nBut ... this loving couple is not alone.\n\n\"Scott and Sofia flew in on Monday evening on a private jet to Cabo with his kids and another couple.\"\n\nYou might wonder why someone would leave Southern California to go on vacation. Well, it's more than 10 degrees warmer in Cabo than in Calabasas right now. And to L.A. folks, weather in the 60s is \"cold.\"\n\nIt sounds like they've all been soaking up the sun and generally enjoying the lifestyle of the idle rich.\n\n\"They've been spending their days by the pool relaxing and enjoying the warm weather.\"\n\nAnd we're not just talking about Scott and Sofia. Mason, Penelope, and Reign are all having a blast, too.\n\n\"Scott's kids have stayed busy with lots of swimming and playing in the water.\"\n\nBut looking after the kids hasn't thrown a wet blanket over their romance.\n\n\"Scott and Sofia are inseparable and seem happy.\"\n\nThe source continues, talking about the lovey-dovey relationship between Scott and his teenage girlfriend.\n\n\"They were posing for pictures together and kissing every chance they got.\"\n\nScott and Sofia also have a puppy, and they brought their precious little love with them.\n\n\"They are both obsessed with the puppy and giving it lots of love.\"\n\nApparently, Scott is mostly doing this for Sofia.\n\n\"Scott promised Sofia a trip and thought it would be nice for them to get away.\"\n\nIn many ways, this trip is a couple's retreat with activities planned just for the two of them.\n\nHollywoodLife reports that Scott is deliberately antagonizing Kourtney by bringing his kids on a \"family vacation\" with Sofia.\n\n\"Scott is well aware that bringing Sofia on his trip to Mexico with the kids has pissed off Kourtney.\"\n\nSo ... why would he do such a thing?\n\n\"That was the whole point.\"\n\nOh.\n\n\"He’s been taunting Kourtney with pictures of Sofia and the kids bonding.\"\n\nThat seems outrageously cruel, if true.\n\n\"He’s clearly doing it to upset her.\"\n\nAnd, according to this report, Scott's bad behavior is getting even worse.\n\n\"But what’s even more twisted is that he’s been telling their mutual friends that Sofia is better with the kids than Kourtney is.\"\n\nThis is just sickening to hear.\n\n\"Scott claims they like Sofia more than Kourtney.\"\n\nAnd all of these messages are apparently designed to taunt and antagonize Kourtney.\n\n\"Scott knows it’s going to get straight back to Kourtney and mess with her head.\"\n\nHe spent a great deal of 2017 doing what many perceived as \"acting out\" to get back at Kourtney for moving on with her life. But this is worse.\n\n\"It’s a new low, even for him.\"\n\nOne can only imagine how hurt and distressed Kourtney must be.\n\nIt's not that she's possessive of Scott, it's that it must be distressing to hear about the father of her children acting like that. It must be breaking her heart.\n\nHowever, at least on the outside, Kourtney is enjoying her child-free time with a sexy vacation with boy-toy turned boyfriend Younes Bendjima.\n\nThis dreamy couple has spent the last few days on a trip up the California coast.\n\nIt's possible that Scott really is trying to wound Kourtney's pride but, if so, it sounds like he's only making an ass of himself.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--vzNz1oCE--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1522429460/attachment/kourtney-kardashian-sofia-richie-scott-disick-split.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--vzNz1oCE--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1522429460/attachment/kourtney-kardashian-sofia-richie-scott-disick-split.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/03/scott-disick-and-sofia-richie-vacationing-with-the-kids-taunting/", "title": "Scott Disick & Sofia Richie: Vacationing With the Kids! Taunting Kourtney Kardashian!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/03/scott-disick-and-sofia-richie-vacationing-with-the-kids-taunting/", "title": "Scott Disick & Sofia Richie: Vacationing With the Kids! Taunting Kourtney Kardashian!", "description": "Scott Disick and Sofia Richie are on a vacation with Scott's three children. Scott is reportedly using this to taunt Kourtney Kardashian.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--g7YLxlgX--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1364527955/wladimir-klitschko-and-hayden-panettiere-photo.jpg", "type": "image/jpeg", "width": 400, "height": 500}}, "article": {"published_time": "2018-03-30T13:06:11-04:00", "modified_time": "2018-03-30T13:13:06-04:00", "tag": "Relationships", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Scott Disick & Sofia Richie: Vacationing With the Kids! Taunting Kourtney Kardashian!", "description": "Scott Disick and Sofia Richie are on a vacation with Scott's three children. Scott is reportedly using this to taunt Kourtney Kardashian.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--vzNz1oCE--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1522429460/attachment/kourtney-kardashian-sofia-richie-scott-disick-split.png"}}, "description": "Scott Disick and Sofia Richie are on a vacation with Scott's three children. Scott is reportedly using this to taunt Kourtney Kardashian."}, "movies": [], "publish_date": 1522429571.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}