{"url": "https://en.wikipedia.org/wiki/Scandal_(TV_series)", "text": "2012 American political thriller television series\n\nScandal is an American political thriller television series starring Kerry Washington. Created by Shonda Rhimes, it aired on ABC from April 5, 2012, until April 19, 2018, for 124 episodes over seven seasons.[1] Kerry Washington's character, Olivia Pope, is partially based on former George H.W. Bush administration press aide Judy Smith, who serves as a co-executive producer.[2]\n\nThe show takes place in Washington, D.C. and focuses on Olivia Pope's crisis management firm, Olivia Pope & Associates (OPA), and its staff, as well as staff at the White House and surrounding political scene. In addition to Kerry Washington, the show features Tony Goldwyn as Fitzgerald Grant III, the President of the United States—later a former President—and Olivia's main love interest; Darby Stanchfield as Abby Whelan, an assistant at OPA (later renamed Quinn Perkins & Associates or QPA), and also the former White House Press Secretary and Chief of Staff; Katie Lowes as Quinn Perkins, former assistant at OPA and later head of QPA; Guillermo Diaz as Huck, a former agent of a spy agency called B613 and assistant at QPA; Jeff Perry as Cyrus Beene, the former White House Chief of Staff under Grant and later Vice President of the United States under Mellie Grant; Joshua Malina as David Rosen, the Attorney General; Bellamy Young as Mellie Grant, the ex–First Lady, a former senator, and later the President of the United States after Grant; Scott Foley as Jake Ballard, the Director of the NSA and Olivia's secondary love interest; Cornelius Smith Jr. as Marcus Walker, a civil rights activist, who used to be an OPA assistant and White House Press Secretary; Joe Morton as Eli \"Rowan\" Pope, Olivia's father and the former head of B613; and George Newbern as Charlie, a former B613 agent who later becomes a member of QPA.\n\nThe show was named a Television Program of the Year by the American Film Institute, received the Peabody Award for Excellence in Television and was honored as Outstanding Drama Series at the Image Awards. Washington has won the Image Award for Outstanding Actress in a Drama Series and has been nominated for an Emmy Award for Outstanding Lead Actress in a Drama Series, a Golden Globe Award for Best Actress in a Drama Series, and a SAG Award for Outstanding Performance by an Actress in a Drama Series.\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired Rank Viewers\n\n(in millions) First aired Last aired 1 7 April 5, 2012 ( ) May 17, 2012 ( 2012-05-17 ) 62 8.21[3] 2 22 September 27, 2012 ( ) May 16, 2013 ( 2013-05-16 ) 47 8.46[4] 3 18 October 3, 2013 ( ) April 17, 2014 ( 2014-04-17 ) 16 12.00[5] 4 22 September 25, 2014 ( ) May 14, 2015 ( 2015-05-14 ) 18 12.66[6] 5 21 September 24, 2015 ( ) May 12, 2016 ( 2016-05-12 ) 29 10.68[7] 6 16 January 26, 2017 ( ) May 18, 2017 ( 2017-05-18 ) 39 8.16[8] 7 18 October 5, 2017 ( ) April 19, 2018 ( 2018-04-19 ) 53 7.41[9]\n\nSeason 1 [ edit ]\n\nThe first season of Scandal introduced Olivia Pope (Kerry Washington) and the various members at her firm. In addition, it introduced the President of the United States, Fitzgerald Grant III (Tony Goldwyn) and his chief of staff Cyrus Beene (Jeff Perry). The season focuses on the lives of the team members, the relationship between Olivia and the President (her former employer), and the mystery surrounding Amanda Tanner's (Liza Weil) involvement with the White House, among other cases the team had solved.\n\nSeason 2 [ edit ]\n\nAn assassination attempt is made on Fitz's life, which almost kills him. As a result, Sally Langston (Kate Burton) takes over as President, much to Cyrus' dismay. After surviving, Fitz decides to get a divorce, which Mellie (Bellamy Young) tries to avoid by somehow convincing her OB/GYN to induce her labor four weeks early. Huck (Guillermo Díaz) is arrested for the attempted assassination after being framed by his girlfriend Becky (Susan Pourfar). After David (Joshua Malina) helps Huck go free, Huck, Olivia and her team trick Becky to show up at the hospital where she is arrested. Fitz finds out that Verna (Debra Mooney) was behind the assassination and kills her. At the funeral, he reveals to Olivia that he does not want a divorce as he is devastated after learning about the rigging from Verna.\n\nThe second arc focuses on finding the mole who is leaking classified information from the White House. Olivia and the team investigate the case after figuring out that the CIA Director's suicide was actually a murder. Olivia gets to know Captain Jake Ballard (Scott Foley), who works with the leader of B613, Rowan (Joe Morton), who orders Jake to get close to Olivia. At the end of the season, Mellie gives Fitz an ultimatum: either he becomes loyal to her, or she goes on national television and reveals Fitz's affair with Olivia. Fitz chooses Olivia, which makes Mellie reveal the affair. Fitz announces his re-election campaign. As Olivia and the team continue to investigate who the mole is, Huck manages to capture Charlie (George Newbern), who reveals the mole's identity: Billy Chambers (Matt Letscher). They figure out that Billy is working with David, who steals the Cytron card, but frames Billy and gives Cyrus the card in exchange for being reinstated as US Attorney. At the end, Olivia's name is leaked to the press as being Fitz's mistress, and it is revealed that Rowan is Olivia's father.\n\nSeason 3 [ edit ]\n\nAfter Olivia's name is leaked to the press as Fitz's mistress, Olivia Pope & Associates faces financial troubles when all their clients fire them. The firm accepts \"new\" clients in order to pay the bills. Rowan becomes more involved with Olivia's life, which begins to affect her, and leads Huck and Jake to investigate B613. They discover during a military action code named \"Operation Remington\", Fitz shot down a civilian aircraft over Iceland and Olivia's mother was one of over 300 casualties. Determined to find out the truth about Operation Remington, the firm investigates Rowan and learns that a passenger was removed from the flight by a Federal Marshal just prior to take off. Quinn (Katie Lowes) starts to hang out with Charlie, who sets her up to kill a security guard who was an eye-witness to the Federal Marshal's removal of the passenger. As a result of Quinn's inadvertent murder, Huck tortures her and she leaves the firm.\n\nMeanwhile, Fitz faces problems when Congresswoman Josephine \"Josie\" Marcus (Lisa Kudrow) is in the running to win the Democratic Party primary against Senator Samuel Reston (Tom Amandes) and become the first female president of the United States. Cyrus tries his best to find dirt on Marcus in order to ruin her campaign, but fails. After Olivia finds out that Fitz shot down the plane which killed her mother, she declines the offer of being the campaign manager for Fitz's re-election and becomes the manager for Josephine Marcus'. After an incident with Marcus' sister, Josephine backs out of her campaign. The second part of the season focuses more on the re-election campaign as Olivia has taken over as the campaign manager. At the same time, Sally announces that she is running for President by being an Independent. As a result, Fitz chooses the Governor of California, Andrew Nichols (Jon Tenney), as his new Vice Presidential running-mate. Nichols develops a relationship with the First Lady, Mellie. The campaign faces problems when Sally, stricken with guilt over murdering Daniel (Jack Coleman), almost reveals the truth at a debate. Cyrus asks Jake to help protect the secret, which he does by killing James (Dan Bucatinsky) to prevent exposing Cyrus's involvement in the cover up. The president's eldest children, Jerry (Dylan Minnette) and Karen Grant (Madeline Carroll), come to the White House for an interview, but Olivia soon figures out that they aren't pleased with their parents.\n\nSeason 4 [ edit ]\n\nAfter the passing of a close friend, Olivia returns to D.C. and is shocked by the state of OPA. The first half of the season focuses on Jake's arrest for the death of Jerry Grant after Rowan forces Tom (Brian Letscher) to name Jake as the operator. Rowan continues to try to make everyone believe Jake is guilty, which inspires Olivia to find out the truth for herself. After forcing Tom to reveal Rowan as his operator, Fitz, Jake, and Olivia make a plan to arrest Rowan. Unfortunately, the plan fails, causing Rowan to shut down B613 and start eliminating B613 agents. Olivia tries to kill Rowan when she confronts him, but he manages to flee. Abby (Darby Stanchfield) is now the White House Press Secretary, and is struggling with gaining the respect of Cyrus and Fitz, because they choose to demean her by calling her \"Red\" instead of Abby. Later in the season, Abby finds herself stressed even more by the presence of her abusive ex-husband, who has been nominated for Virginia State Senator, and she enlists Leo Bergen (Paul Adelstein) to help ruin his campaign. Quinn has stayed in contact with both Abby and Huck, in addition to trying to find Olivia.\n\nMellie struggles with the death of her son, Jerry. She finally comes to terms with her loss after finding out that Jerry was murdered due to being deliberately exposed to bacterial meningitis rather than contracting the disease naturally, and she chooses to form an alliance with Elizabeth North (Portia de Rossi). Later, after having an affair with him, Mellie discovers the true nature of Nichols, who threatens to tell the press about their affair. In the season finale, members of a grand jury gathered by David for the B613 case were killed after the initial hearing. OPA and David begin investigating the scene, and realized that Rowan was responsible. He also blackmailed Mellie into giving the names of the members, causing her to feel responsible. Cyrus later finds out the truth, but decides not to tell Fitz. After seeking advice from Maya (Khandi Alexander), Olivia and Jake decides to reveal B613 to the CIA, but it backfires. They later came up with a plan to frame Rowan for embezzlement of the funds at the museum he is working at, having him imprisoned. Later, Fitz finds out the truth about what Mellie and Cyrus had done; he orders them to leave the White House. Elizabeth then takes Cyrus' place as the chief of staff. In the last scene, he reunites with Olivia.\n\nSeason 5 [ edit ]\n\nOlivia and Fitz now embrace being a couple, going public with their relationship, thus leading to Olivia taking on many more of the First Lady-established roles in the White House. She continues managing Olivia Pope & Associates, which Marcus Walker (Cornelius Smith Jr.) becomes a part of, even using it to spin her image once the world looks down on her due to her new relationship with the President. However, by the midpoint of the season she feels too suffocated in this new life, and so she leaves Fitz, the White House, and secretly has an abortion. Olivia returns to her old life, dealing with the aftermath of her and Fitz's break up, and Rowan gets out of jail and reclaims Jake as his lapdog, while Fitz starts sleeping around and is put in his place by Abby. Meanwhile, Cyrus and Mellie are forced to move on with their lives now that Fitz has kicked them out, Cyrus struggling to figure out what he wishes to do next, and Mellie running for and being elected as a senator, being her next step in making a run for the presidency, which is the main focal point of the second half of the season.\n\nMellie makes a run for the presidency and takes Olivia on as her campaign manager, having to go against the likes of current Vice President Susan Ross (Artemis Pebdani), Hollis Doyle (Gregg Henry), and Pennsylvania Governor Francisco Vargas (Ricardo Chavira), the latter of which has his campaign managed by Cyrus. David and Elizabeth push for Susan's presidential run, and David begins to fall for her while also entering into a sexual relationship with Liz, ending in heartbreak for two of the three parties involved. Quinn and Charlie begin seeing each other, and Cyrus also has marital problems with Michael (Matthew Del Negro). Jake marries Vanessa Moss (Joelle Carter) as per Rowan's arrangement, and also kills her father, also upon Rowan's request. Olivia brutally murders former Vice President Nichols when he starts to recover from his paralysis and threatens to expose a great number of secrets, Fitz learns of her secret abortion, and the season concludes with Mellie and Frankie named as the respective Republican and Democratic nominees, with Jake and Cyrus selected as their respective VPs.\n\nSeason 6 [ edit ]\n\nOn March 3, 2016, ABC renewed Scandal for a sixth season,[10] which premiered on January 26, 2017. The entire season is about the murder of President-elect Frankie Vargas. It is revealed that his wife, Luna, was behind his murder because she wanted power. The end of season six concludes with Mellie becoming the first female President of the United States. At the end of Fitz's term, he decided to reinstate a B613 and become Command, due to Rowan's manipulation of him. Olivia convinces him not to, because she thinks it will destroy him. Then she has Mellie reserve a percentage of the Pentagon's funds in a blind emergency trust and uses that money to reinstate B613 herself. Olivia becomes Command at the end of the season and considers herself the most powerful person in the world.\n\nSeason 7 [ edit ]\n\nOn February 10, 2017, ABC renewed Scandal for a seventh season;[11] on May 10, 2017, it was announced that this season would be the show's last.[12] On January 3, 2018, a crossover with How to Get Away with Murder was announced,[13] which aired on March 1, 2018, with Viola Davis and Aja Naomi King guest starring.[14]\n\nThe final season follows the first year of Mellie's presidency and how she adjusts to being the leader of the free world after everything she's been through previously. Olivia finds herself struggling to balance both sides of being the most powerful person in the world: the white hat life as Mellie's Chief of Staff, and the black hat life of Command of B613, and her dip towards the latter strains her relationships with her friends and family, particularly after she orchestrates the murder of Bashranian President Rashad and his niece and nearly allows Quinn to be killed. Cyrus, now Vice-President after Olivia and Jake forced Luna Vargas to commit suicide at the previous season's end, finds himself on the cusp of finally achieving the position he has desired for so long. Fitz adjusts to his post-presidency life and his desire to establish his legacy. With Olivia having departed for the White House, Olivia Pope & Associates, now renamed Quinn Perkins & Associates (QPA) goes through a reboot, as Quinn and the remaining gladiators must now rebuild the firm's reputation from the bottom up. Soon, however, everyone is caught up in one last scandal stirred up by Cyrus that threatens to expose all of their various crimes over the past seven seasons to the public and land them all in prison or worse.\n\nCast and characters [ edit ]\n\nProduction [ edit ]\n\nConception and development [ edit ]\n\nIn early 2011, it was announced that Shonda Rhimes was developing a new pilot. In February, Kerry Washington was cast in a leading role.[16] Actress Gabrielle Union and Taraji P. Henson auditioned for this role alongside Washington before she was officially chosen. Henry Ian Cusick also landed a role in the series.[17] On February 28, 2011, it was announced that Tony Goldwyn landed the role as the president.[18] In May 2011, ABC picked up the pilot as a mid-season replacement.[19] During the Winter Television Critics Association Press Tour, it was announced that the show would premiere April 5, 2012 after Grey's Anatomy, relocating Private Practice to Tuesday nights.[20]\n\nThe program was renewed for a second season on May 11, 2012, in the same Thursday timeslot, while Private Practice remained in the new Tuesday evening timeslot to finish its final season.[21] Rhimes had stated at the time that the second season would likely be thirteen episodes or less,[22][23] but the renewal of the series after the fall meant that the second season would have two arcs through the season; the first covering the main 13-episode order, with the second arc taking place during the \"back nine\" order.\n\nScandal was renewed for a third season on May 10, 2013.[24] Along with other ABC dramas, this season was split into two runs of uninterrupted episodes, the first consisting of ten episodes. The second run, initially set to consist of 12 uninterrupted episodes, began on February 27, 2014.[25] On December 7, 2013, ABC Studios, announced that due to Kerry Washington's pregnancy, the overall episode order would be trimmed from 22 to 18,[26] which led the season finale to air four weeks earlier on April 17, 2014.\n\nThe show was renewed for a fourth season by ABC on May 9, 2014.[27] On May 13, 2014, ABC announced their new schedule, as well as a new time slot for Scandal. The show remained on Thursday night, but it was moved to 9:00 PM E.T. to make room for ShondaLand Production Company's new TV series, How to Get Away with Murder.[28] In August 2014, ABC programmed its entire Thursday primetime lineup with ShondaLand dramas Grey's Anatomy, Scandal and How To Get Away With Murder, then branded the night as \"Thank God It's Thursday\" (or \"TGIT\").[29] This echoes ABC's former TGIF branding of its Friday night family sitcoms and even NBC's Must See TV promotion of formidable Thursday night television hits in the 1990s.[30]\n\nThe remaining fall schedule for ABC was announced on October 30, 2014, where it was announced that Scandal would air nine episodes in the fall with the fall finale to air on November 20, 2014, just like the rest of ABC's primetime lineup \"TGIT\" Grey's Anatomy and How To Get Away with Murder.[31] The remaining 13 episodes aired after the winter break, beginning on January 29, 2015,[32] and ending with the season finale on May 14, 2015.[33]\n\nScandal was renewed for a fifth season on May 7, 2015, by ABC. The series will continue to air at Thursdays in the timeslot 9:00 p.m. E.T. like the previous season, as it was moved to the timeslot to make room for Shondaland Production Company's new TV series, How to Get Away with Murder. Production began on May 21, 2015, when Rhimes announced on Twitter that the writers were in full swing mapping the fifth season.[34]\n\nThe series was renewed for a sixth season on March 3, 2016, by ABC.[35] Production was scheduled to begin in July, confirmed by executive-producer Tom Verica.[36] After Kerry Washington announced that she was pregnant again, TVLine reported that ABC considered moving the show's premiere to midseason.[37] In addition, the episode order for the sixth season was reduced from 22 to 16 episodes.[38] During ABC's annual upfront presentation in May, it was announced that Scandal would premiere during midseason, following a fall run of the new series Notorious.[39] Production began on July 13, 2016, with director and executive producer Tom Verica announcing that the crew was scouting for filming locations.[40] The table read for the premiere was on July 26, 2016, with filming starting soon after.\n\nOn February 10, 2017, ABC announced that the series had been renewed for a seventh season.[41] On May 10, 2017, ABC announced that the seventh season would be the show's final season.[12]\n\nCrew [ edit ]\n\nWriting [ edit ]\n\nIn an interview with showrunner Shonda Rhimes, she revealed that the fourth season would highlight Darby Stanchfield's character, Abby Whelan. She said \"Season 4 is Abby's season. That was by design. A lot of what we know about Abby happens this season.\"[42] Rhimes also confirmed the speculation about the fate of the character Harrison Wright, who she confirmed was killed.[42] She said that all the people at OPA will cope in different ways to Harrison's death, Olivia the hardest. Rhimes said \"It will be very devastating for Abby in a surprising way. You'll see how she's coping with it in a very different way than you would expect.\"[43] Olivia will deal with her betrayal to everyone she left behind, when she hears about the fate of Harrison. The betrayals changed everyone permanently, and Olivia will have to deal with it.[43]\n\nShonda Rhimes stated that the fourth season will focus more on the core characters, as opposed to the third season where more characters were introduced. Rhimes explained why: \"Kerry Washington couldn't work 14 hours a day, so we had to tell our story in a different way, and that necessitated other people both picking up the slack in beautiful ways\".[43]\n\nShonda Rhimes said in an interview that the fifth season will begin only a few days after the events in the fourth-season finale. She stated that the fifth season will see Olivia and Fitz the only people standing in a single piece, as she said \"The world had been fairly blown apart for everybody except Olivia and Fitz. Everybody else was in a fairly blown apart place ... We pick up right there in that environment and we see what happens next.\" Rhimes continued talking about Cyrus and Mellie and their situation of not being in the White House anymore.[44] Rhimes also confirmed that \"the reconstitution\" of Team OPA would happen in the fifth season, as Rhimes revealed in an interview with TVLine, as she explained that the Gladiator conceit was sidelined a bit in the fourth season to instead \"healing\" Olivia. She noted that \"a lot of times it was just Huck and Quinn gladiating by themselves. And that wasn't the same dynamic.\"[45]\n\nWhen talking about the presidential campaign storyline in the show, showrunner Shonda Rhimes talked to The Hollywood Reporter about the character Fitzgerald Thomas Grant III not being president anymore. She said, \"I can't tell you any of that — but there is a plan. Tony is not going anywhere; where would he go?!\" Other cast members shared their opinions about Grant's next arc without the presidency. Tony Goldwyn, the actor playing Fitz, commented, \"He'll be much happier as the post-president than as the president.\" Jeff Perry, playing Cyrus Beene, said, \"I'd love our show to invent a great role for a president after he's out [of] office that would reverberate back to the real world.\" Executive producer Betsy Beers voiced her excitement about the character doing \"anything he wanted\". Other cast members compared Fitz's next move with former U.S. presidents Jimmy Carter and Bill Clinton.[46]\n\nIn an interview with Entertainment Weekly, Rhimes talked about the presidential election and its factor into the sixth season. She said that it would in both ways, adding, \"We are basically going to start our season on election night. Yes, it is going to play into our season, but we're not going to spend our time playing an election.\"[47]\n\nCasting [ edit ]\n\nThe first season had nine roles receiving star billing, including Kerry Washington as protagonist of the series, Olivia Pope, a former White House Director of Communications with her own crisis management firm. Columbus Short played the character Harrison Wright, while Darby Stanchfield played Abby Whelan, who begins a relationship with David Rosen. Katie Lowes acted as Quinn Perkins, and Guillermo Diaz played the character Huck, the troubled tech guy who works for Olivia. Jeff Perry played Cyrus Beene, the Chief of Staff at the White House. Joshua Malina played David Rosen, the U.S. Attorney who develops a relationship with Abby. Bellamy Young played First Lady Melody \"Mellie\" Grant, while Tony Goldwyn portrayed President Fitzgerald \"Fitz\" Thomas Grant III.\n\nHenry Ian Cusick did not return for the second season. In Season 4 he made a guest appearance as Stephen Finch.\n\nSeveral casting changes occurred for the second season. Henry Ian Cusick exited the show and did not return as his character Stephen Finch for the second season as the actor and showrunner Shonda Rhimes came to the mutual decision for him not to come back for the second year.[48] Both Bellamy Young, as First Lady of the United States, and Joshua Malina, as David Rosen, were bumped up to series regulars.[49][50]\n\nOn June 14, 2013, Scott Foley was promoted to regular as of the third season.[51] Casting for Lisa Kudrow was announced on August 28,[52] and was revealed to be playing Congresswoman Josephine Marcus for multiple episodes.[53] Private Practice alum Paul Adelstein was announced to join the cast as Leo Bergen, however at the time of the announcement, details on who he would play were kept under wraps.[54] On September 23, 2013, it was announced that Sally Pressman would be playing a recurring role on the show, which turned out to be the sister of Congresswoman Josephine Marcus, played by Lisa Kudrow.[55] Jack Coleman joined the cast in a recurring role as Daniel Douglas, the husband to Vice President Sally Langston.[56]\n\nOn November 5, 2013, Khandi Alexander was cast in a recurring role as Olivia's mother for a multiple episode arc.[57][58][59] On December 3, 2013, it was announced that the show was casting for a new role as a \"handsome, charismatic fella\" named Andrew, who would be a love interest for Bellamy Young's character, Mellie.[60] A few days later, on December 6, 2013, actor Jon Tenney was announced to have landed the role of Andrew.[61] On January 28, 2014, it was announced that Scandal was casting the guest-starring roles of Jerry Grant and Karen Grant, Tony Goldwyn and Bellamy Young's characters' children[62] A week later, on February 6, 2014, it was reported that the guest-starring roles of Jerry and Karen had been landed by Dylan Minnette and Madeline Carroll. The duo appeared in the fifteenth episode in addition to the season finale.[63]\n\nOn April 25, 2014, it was announced that Columbus Short would not return for the fourth season due to personal reasons.[64] In an interview with the show's creator Shonda Rhimes, she revealed that Short's character Harrison Wright would be killed off.[42] Television host Ellen DeGeneres revealed on Twitter that her wife, Portia de Rossi, had been cast in a multiple-episode \"top secret arc\".[65]\n\nOn July 30, 2014, it was announced Kelen Coleman would appear in the season four premiere.[66] On August 12, 2014, Mary McCormack and Josh Randall were cast as a couple in the season's second episode.[67] Lost alum Sonya Walger was cast in a recurring role, which was announced on August 18, 2014.[68] On August 22, 2014, Entertainment Weekly announced that Matthew Del Negro would play a recurring role.[69] It was announced that the role of Karen Grant, one of the Grant family's children, would be recast, and on September 5, 2014, Mary Mouser was revealed to be taking over the role.[70] Jasika Nicole returned as Huck's estranged wife in the fourth season, with her return beginning in the fifth episode.[71] Stephen Collins announced on Twitter that he would be returning to Scandal for an episode.[72] However, after news broke about sexual abuse allegations made about the actor, his footage was cut from the episode per ABC's request.[73]\n\nTwo alumni from the Shondaland-produced television show Private Practice appeared in the fourth season. It was announced on September 16, 2014, that Brian Benben had landed a guest-starring role.[74] In addition, Paul Adelstein returned as Leo Bergen in an episode which aired in November.[71]\n\nIt was reported on October 21, 2014, that Michael Trucco had been cast as Charles Putney, Abby's abusive ex-husband. Information about his character was that he is the youngest son of former Virginia Gov. James Putney and the ex-husband of Abby Whelan after he physically assaulted her in a drunken rage. He will appear in at least one episode of the fourth season.[75][76] On November 4, 2014, it was announced that Khandi Alexander is going to return as Maya Lewis in the winter finale. Alexander's role was initially meant for only one episode as a guest star, but was upgraded to recurring on November 14, 2014.[77] Jason Butler Harner was cast for the show in a recurring role, and first appeared in the winter premiere, playing Ian Woods.[78] On February 20, 2015, it was reported that comedian Lena Dunham had been cast in an unknown guest role,[79] and will appear in the sixteenth episode.[80] She ultimately portrayed Susanne Thomas, a young woman who writes a scandalous memoir about some of D.C.'s top politicians.\n\nIt was announced on February 4, 2016, that Ricardo Chavira would join the show in a recurring role, and would first appear in the eleventh episode.[81] Annabeth Gish was announced on February 8, 2016, to have been cast in a recurring role.[82] The Hollywood Reporter announced on February 18, 2016, that Joe Morton who plays Rowan \"Eli\" Pope had been promoted to a series regular, and was credited as a regular cast member for the first time in the twelfth episode of Season 5.[83] TVLine announced on August 6, 2016, that Glee-alum Jessalyn Gilsig will replace Joelle Carter as Vanessa Moss, Jake Ballard's wife.[84]\n\nTVLine announced on May 15, 2017, that George Newbern, who plays Charlie, is being promoted to a main cast member for Season 7, after having appeared in over fifty episodes as a recurring cast member.[85]\n\nFilming [ edit ]\n\nProduction started at the beginning of July, as Rhimes tweeted that the writers were hard at work collaborating ideas and mapping out the fourth season.[86][87] Scouting for the season began a few days later.[88] The table read for the first episode was on July 24, 2014,[89] and Rhimes revealed the title of the premiere the same day.[90][91] Filming for the fourth season began on July 28, 2014,[92] and ended on April 28, 2015.[93]\n\nScouting began in the beginning of July.[94] Kerry Washington announced the first table read would happen July 14, 2015.[95] The title of the season premiere, \"Heavy is the Head\" was revealed on August 8, 2015, by its director Tom Verica on Twitter.[96] Filming for the season began on July 16, 2015.[97]\n\nSeveral actors working on Shondaland-produced shows directed an episode for the fifth season. Tony Goldwyn from Scandal directed the second and 17th episode, making it the fourth and fifth episode he has directed on the show. Chandra Wilson who plays Dr. Miranda Bailey on Grey's Anatomy directed her first Scandal episode, which was the sixth episode \"Get Out of Jail, Free\". Scott Foley from Scandal also directed his first Scandal episode, the 16th named \"The Miseducation of Susan Ross\". Foley and executive producer Tom Verica announced Foley's debut as director on Twitter.[98] For the seventh season, both Kerry Washington and Darby Stanchfield are set to direct their first Scandal episodes, with Stanchfield having previously directed all episodes of the web series.[99][100][101]\n\nMusic [ edit ]\n\nChad Fischer was the composer for the show for its entire run. For his work he won the BMI TV Music Award six times from 2013 to 2018.[102][103][104][105][106][107][108]\n\nTwo soundtrack albums for Scandal were released. The first one was 2013 Songs from Scandal: Music for Gladiators featuring songs from the first two seasons of the show.[109] The second one titled Scandal: Original Television Series Soundtrack was released in 2018 and consisted entirely of Chad Fischer’s music from the show.[110][111][112]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nIn the United States Scandal aired on ABC on Thursday nights at 9pm/8pm CT. The program airs at the same time in Canada through the City television system with simsubbing of the ABC feed.\n\nThe series airs in Australia on the Seven Network with reruns airing on SoHo, Canal Sony in Latin America, ZFB-TV in Bermuda, Miami's WPLG in the Bahamas (via cable from the United States mainland), and on TVB Pearl in Hong Kong. The first two-season originally aired on Channel 4 in the United Kingdom.[113] In 2014 the show was picked up by rival broadcaster Sky Living who will continue from season three onwards.[114] In New Zealand it first aired on TV One but now airs on TV2.\n\nIt aired in South Africa on multiple television channels; first run episodes were aired on DStv premium channel M-net the day after their ABC run, along with reruns on rival satellite channel StarSat and SABC3 since May 2014. The series is re-titled in South Africa as The Fixer to avert confusion with the domestic soap opera entitled Scandal!.[115]\n\nIn Jamaica, Scandal airs on CVM TV.\n\nCable syndication [ edit ]\n\nOn July 15, 2013, BET and ABC announced an early syndication agreement, which saw BET carrying a marathon of the first two seasons on August 10 and 17, 2013, then in two-hour blocks on Wednesdays before the show's season three premiere on October 3.[116] BET airs new episodes after an eight-day delay.[117][118]\n\nHome media and online [ edit ]\n\nSeasons 1–5 of the series have been released on DVD by Walt Disney Studios Home Entertainment under the ABC Studios label. Additionally, Netflix currently streams all available seasons in the U.S, Canada, Mexico and Brazil. The show is available via traditional by-episode and season purchase by most online video retailers, including iTunes.\n\nSeason 1\n\nThe Complete First Season Set details Special features 7 Episodes\n\n2-Disc Set\n\nEnglish (Dolby Digital 5.1 Surround)\n\nEnglish SDH, Spanish and French subtitles Scandal: Setting The Pace\n\nGladiators in Suits: Casting a Series\n\nScripting Scandal Release Dates Region 1 Region 2 June 12, 2012 October 7, 2013\n\nSeason 2\n\nThe Complete Second Season Set details Special features 22 Episodes\n\n5-Disc Set\n\nEnglish (Dolby Digital 5.1 Surround)\n\nEnglish SDH, Spanish and French subtitles A Closer Look\n\nHanging with Huck\n\nDeleted Scenes\n\nOuttakes/Bloopers Release Dates Region 1 Region 2 September 3, 2013 February 17, 2014\n\nSeason 3\n\nThe Complete Third Season Set details Special features 18 Episodes\n\n4-Disc Set\n\nEnglish (Dolby Digital 5.1 Surround)\n\nEnglish SDH, Spanish and French subtitles Extended Finale Episode\n\nSee the Locations at Set\n\nSpotlight Cast Piece: Jeff Perry\n\nDeleted Scenes\n\nBloopers Release Dates Region 1 Region 2 September 23, 2014 January 19, 2015\n\nSeason 4\n\nThe Complete Fourth Season Set details Special features 22 Episodes\n\n5-Disc Set\n\nEnglish (Dolby Digital 5.1 Surround)\n\nEnglish SDH, Spanish and French subtitles Extended Episodes\n\nThe Fixer – A Day With Kerry Washington\n\nOuttakes Release Dates Region 1 Region 2 August 11, 2015 November 23, 2015\n\nSeason 5\n\nThe Complete Fifth Season Set details Special features 21 Episodes\n\n5-Disc Set\n\nEnglish (Dolby Digital 5.1 Surround)\n\nEnglish SDH, Spanish and French subtitles Release Dates Region 1 Region 2 August 23, 2016 November 23, 2016\n\nSeasons 6 and 7[119]\n\nThe Complete Sixth & Seventh Seasons - The Final Two Seasons Set details Special features 34 Episodes\n\nEnglish (Dolby Digital 5.1 Surround)\n\nEnglish SDH, Spanish and French subtitles Release Dates Region 1 Region 2 August 28, 2018\n\nReception [ edit ]\n\nCritical reception [ edit ]\n\nRotten Tomatoes ratings per season Season 1 2 3 4 5 6 7 Rating 89 92 100 95 92 80 95\n\nThe show has been met with generally favorable reviews, with a collective score of 64/100 based on 28 critics from Metacritic.[120] Based on advanced screeners sent before the show's premiere, Alan Sepinwall of HitFix stated:\n\nTo be perfectly honest, after watching four episodes of Scandal, I'm not 100 percent clear on what it is that Olivia and her team (most of them fellow lawyers who don't practice law) do, nor on exactly what the show is. I'm also not entirely sure that it matters. Scandal is a good example of what a show is about being far less important than how it's about it.[121]\n\nIndieWire, a daily news site reviewed the first season of Scandal, comparing it to the FX show Damages. Stating that the premise was similar and that Damages is a hell of a show, and worthy of all the accolades; but it's what Scandal could be, if the envelope was pushed a bit more, and if the show took more risks.\"[122]\n\nNewsday's Verne Gay called the series \"fun\", but added:\n\nAll the tropes, cliches and (especially) soap conventions series creator Shonda Rhimes has poured so generously into Grey's Anatomy and Private Practice over the years have been poured right back into this Beltway potboiler. The hairpin plot twists. The whiplash character reveals. The bumptious moralizing. The Strong Woman/Wronged Woman character type, and its direct corollary, Weak, Middle-Aged, Married Man Who Secretly Likes Hookers. It's all here![123]\n\nThe show however received many more positive reviews during its second season. The A.V. Club's Ryan McGee compared to the show to House of Cards, stating:\n\nScandal has quite a bit to say about how people in general operate. By extension, it also has a lot to say about the type of television people respond to in this ever-splintered viewing environment. In a year in which almost all ratings are down, Scandal has gone up. Its insane storytelling really isn't insane at all. Many want to dub House of Cards the future of television as a whole. In terms of distribution, this may be true. But by giving audiences what they want, and then giving them so much more than they ever expected, Scandal is the show those looking toward the future of television should be aiming to actually produce, regardless of the medium in which it is viewed.[124]\n\nAlan Sepinwall of HitFix also changed his stance:\n\nWhen Scandal debuted last spring, I wasn't sure what to make of it, beyond recognizing that Kerry Washington had the goods to carry a series and Shonda Rhimes had fashioned an excellent role for her. This season, though, Rhimes has kicked the show up to another level by ditching the Crisis of the Week procedural format in favor of reinventing Scandal as a gonzo hybrid of conspiracy thriller and high-stakes soap opera, involving election rigging, a presidential assassination attempt, a failed internal White House coup, and all sorts of other crazy shenanigans. It's ludicrous on virtually every level; it's also an enormous amount of fun, thanks to the writing and the performances.[125]\n\nRatings [ edit ]\n\nIn 2016, a New York Times study of the 50 TV shows with the most Facebook Likes found that Scandal \"displays the classic pattern of a show popular with a black audience\".[126] The show does well among an African American female audience.[126] Ratings grew significantly over the second season, reaching a series high with the season finale which increased 25% in total viewers and 39% in Adult 18–49 compared to the first season's finale.[127]\n\nThe season 3 premiere had 10.5 million total viewers, up 71 percent from last season's start in September 2012.[128][129] The season finale had 10.5 million total viewers, up 15% from last season's finale in May 2013.[130] The third season had an average of 11.5 million in Total Viewers, up 39% from the second season which had a total of 8.3 million. It also went up in Adults 18–49 with 43% with an average of 4.0/12, while the previous season had a 2.8/8. This qualifies Scandal as TV's fastest growing returning series.[130]\n\nThe fourth-season premiere also scored a series high in Total Viewers with 11.96 millions and in adults 18–49 with a 3.8/11.[131] The series was its ratings increase from week to week compared to its broadcasting last year.[132][133][134] The mid-season premiere \"Run\" was equaled the series's 2nd-highest-ever rating in adults 18–49.[135] The fourth season saw a decrease in the 18–49 key demographic by 5.4 percent to a 2.9, but an increase in total viewers by .86 percent with an average of 9.19 million viewers.[136]\n\nSeason Timeslot (EST) Number of episodes Premiere Finale TV season Overall rank Overall viewership Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Thursday\n\n10:00 pm 7 April 5, 2012 7.33[137] May 17, 2012 7.33[138] 2011–12 62[139] 8.21[139] 2 22 September 27, 2012 6.74[140] May 16, 2013 9.12[141] 2012–13 47[142] 8.46[142] 3 18 October 3, 2013 10.52[143] April 17, 2014 10.57[144] 2013–14 16[145] 12.00[145] 4 Thursday\n\n9:00 pm 22 September 25, 2014 11.96[146] May 14, 2015 8.08[147] 2014–15 18[148] 12.66[148] 5 21 September 24, 2015 10.25[149] May 12, 2016 6.65[150] 2015–16 29[151] 10.68[151] 6 16 January 26, 2017 7.62[152] May 18, 2017 5.23[153] 2016–17 39[154] 8.16[154] 7 Thursday 9:00 pm (1–14)\n\nThursday 10:00 pm (15–18) 18 October 5, 2017 5.52[155] April 19, 2018 5.46[156] 2017–18 53[157] 7.41[157]\n\nSocial media [ edit ]\n\nScandal is one of the most popular shows on social media. The cast tweets with their fans when the show is airing on television.[158] During the season three premiere, the show topped Nielsen's Twitter TV Ratings Top 10,[159] with 713,000 tweets that mentioned the show and were seen by an audience of 3.7 million users. The show has also the most loyal Twitter followers according to Nielsen Social.[160]\n\nAwards and nominations [ edit ]\n\nScandal has been acknowledged by the ALMA Awards, Image Awards, BET Awards, Emmy Awards, Screen Actors Guild Awards, Golden Globe Awards, Critics' Choice Awards, Teen Choice Awards and People's Choice Awards as well as honored by the American Film Institute and the Peabody Awards.\n\nKerry Washington, Columbus Short, Guillermo Díaz, Bellamy Young, and Tony Goldwyn have been recognized for their performances. The production team has been honored by the Costume Designers Guild, Society of Camera Operators, BMI Awards and the California on Location (COLA) Awards.\n\nCritics' top ten lists [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Henry_Ian_Cusick_%289425069422%29_Cropped.jpg/165px-Henry_Ian_Cusick_%289425069422%29_Cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Gabrielle_Union_-_Flickr_-_nick_step_%281%29.jpg/145px-Gabrielle_Union_-_Flickr_-_nick_step_%281%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/5/54/Scandal_Intertitle.png/250px-Scandal_Intertitle.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Kerry_Washington_LF.jpg/170px-Kerry_Washington_LF.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/PortiadeRossiEllenDeGeneresHWOFSept2012.jpg/170px-PortiadeRossiEllenDeGeneresHWOFSept2012.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Taraji_P._Henson_2010.jpg/150px-Taraji_P._Henson_2010.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/api/rest_v1/page/graph/png/Scandal_%28TV_series%29/0/8f7c9af1b57116e43bcaa322200898cf589fe46e.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Shonda_Rhimes_2008.jpg/165px-Shonda_Rhimes_2008.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Scandal_(TV_series)", "title": "Scandal (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}