{"url": "https://www.bustle.com/p/how-did-lily-james-matt-smith-meet-it-involved-period-costumes-zombies-11873224", "text": "British acting royalty Matt Smith and Lily James have become quite the hot couple of the acting scene ever since going public with their relationship back in 2015, but how did Lily James and Matt Smith meet, exactly? Well, despite making their first public appearance as an official couple at the Cinderella premiere in Milan three years ago, the love between the Doctor Who and Mamma Mia: Here We Go Again stars actually began to blossom a year prior.\n\nThe pair were first introduced back in 2014 whilst working on the set of Pride and Prejudice and Zombies, as Grazia reports, and speculation of a romantic relationship between Smith and James first emerged after the Mirror reported they were spotted together at the 2014 Cannes Film Festival. Shortly after the festival, rumours which hinted at a budding relationship between the actors only intensified after being photographed together once again, this time in London, as the Daily Mail reported.\n\nThese outings were the first time Smith and James had been romantically linked to anyone after the break up of their previous relationships with actress and model Daisy Lowe and actor Jack Fox, respectively, however it appears both have clearly moved on as they enjoy their third year together — which in celebrity terms, could be considered a lifetime.\n\nKevin Winter/Getty Images Entertainment/Getty Images\n\nSince they began dating the couple have enjoyed continued success in the world of acting, seen recently in Smith's Emmy Award nominated portrayal of Prince Philip in The Crown, and James' role in the Oscar-winning Darkest Hour. However, it's the recent juicy engagement rumours surrounding the two that have really got fans talking.\n\nAfter displaying a huge diamond ring, as Metro reported, which just so happened to be placed on her engagement finger at the 2018 BAFTA Awards, speculation of potential nuptials was sent into overdrive. And boyfriend Smith added more fuel to the rumour-mill fire whilst speaking on BBC Radio 4's Desert Island Discs when he revealed he was open to the idea of having children, and soon. The 35-year-old said \"I am thinking about kids quite a lot. I’d like a lot of them.\"\n\nKevin Winter/Getty Images Entertainment/Getty Images\n\nHowever, those rooting for a fairytale wedding in the near future were left disappointed after James briefly addressed the engagement rumours in an interview with Porter Edit. When discussing the supposed \"engagement\" ring she showed off on the BAFTAs red carpet, Lily said \"I’m just not very superstitious about rings. It’s stupid, probably, but I just put rings on any finger... I mean, Jesus. That ring’s worth one million pounds…\"\n\nAlthough I wouldn't dust off your wedding hats just yet, the current lack of any plans to tie the knot isn't to say there won't be wedding bells in the future. In a recent interview with Marie Claire, James expressed the possibility of herself and Smith buying a home together when she said, \"We want to get somewhere\", and continued \"That's going like, 'Can we go furniture shopping?' We bought a rug...and I love getting flowers and making things look nice.\"\n\nSo, even though marriage might not be on the cards just yet, the prospect of an engagement between this couple sounds like it could be well on the way. Though for now it sounds like they're having lots of fun together. In James' interview with Porter, she also explained how she nearly missed Glastonbury for her Mamma Mia audition, with the clash causing a \"real argument\" between the couple. At least it all worked out for the best.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/2/decdf095-d741-4703-98ca-86dac7303927-10044998ca.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/7d379cd6-7c7b-4796-8c88-2d4b2ea67811-0f983934-6d14-430c-92d4-37a6af1fca91-screenshot-2020-04-09-at-105431.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/9/11/67923d04-b5a5-4d04-9293-cb1d5499adbf-getty-506305078.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/9/11/c81598c6-d027-4a5c-9ed3-87f225d7e0f0-shutterstock_8770831ur.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/9/11/0a4000bf-2f58-461b-af99-f1141e69afbe-getty-506157452.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/9/11/c81598c6-d027-4a5c-9ed3-87f225d7e0f0-shutterstock_8770831ur.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/1/8bfe414d-d156-4a52-9803-2a386402fe38-08ee8781-b1c2-49c3-a52a-ecf81c6fdd4f-1.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/ad6c815d-cb75-40c0-baac-5136d7214543-1309519_howtobuildagirl_dolly_creditsvenarnstein_293582.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/9/11/c81598c6-d027-4a5c-9ed3-87f225d7e0f0-shutterstock_8770831ur.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/how-did-lily-james-matt-smith-meet-it-involved-period-costumes-zombies-11873224", "title": "How Did Lily James & Matt Smith Meet? It Involved Period Costumes And Zombies", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/how-did-lily-james-matt-smith-meet-it-involved-period-costumes-zombies-11873224", "type": "article", "title": "Forget Cinderella, Lily James & Matt Smith's Story Is The Only Fairytale You Need", "description": "British acting royalty Matt Smith and Lily James have become quite the hot couple of the acting scene ever since going public with their relationship back in 2015, but how did Lily James and Matt Smith meet, exactly? Well, despite making their first…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/9/11/c81598c6-d027-4a5c-9ed3-87f225d7e0f0-shutterstock_8770831ur.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "British acting royalty Matt Smith and Lily James have become quite the hot couple of the acting scene ever since going public with their relationship back in 2015, but how did Lily James and Matt Smith meet, exactly? Well, despite making their first…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}