{"url": "https://ew.com/movies/2018/01/04/gal-gadot-wonder-woman-interview/", "text": "Gal Gadot type TV Show\n\nEW asks Gal Gadot about the moment she knew Wonder Woman was a hit, which scenes across her three DC movies was her favorite, what she thought of James Cameron’s slam, and much more. Below the actress — one of EW’s Entertainers of the Year — takes our questions in a deep-dive Q&A recounting her incredible past year.\n\nENTERTAINMENT WEEKLY: At the start of 2017, Wonder Woman had wrapped principal production months ago, fans obviously saw you in Batman v Superman, the first trailer for the standalone film had come out. What were your expectations, did you know you had something special that point?\n\nGal Gadot: There’s always how you feel about something but you never know how it’s really going to be once it’s all done and ready to go. It felt like it was special. When we shot the movie we were so invested and so thoughtful with every decision we made with the character and the story, I was so privileged to work with an amazingly phenomenal filmmaker, Patty Jenkins. But we didn’t expect it to be so well received\n\nDid you have any particular worries?\n\nThose worries happened before we started to shoot the movie. Because this was my first movie that I really carried and led. The heavy lifting was on my shoulders. So I was worried at the beginning. I felt like the little girl looking at Mount Kilimanjaro and thinking: How am I going to climb all the way up? But slowly and gradually the journey to the pinnacle of this mountain was fascinating and exhilarating and exciting and it has a lot to do with the people you’re working with.\n\nBefore Wonder Woman there was a story about a leaked memo at Marvel where an executive suggested female superhero movies don’t work. Did you ever get a sense from anyone in the industry before the movie came out that they were skeptical?\n\nI’ve got to be honest and say not really. I read all the articles about how the previous female-led superhero movies didn’t work out very well. It took over 13 years for the studio to really go and shoot Wonder Woman. But once the decision was made, I didn’t fear. And after I witnessed how the audience reacted to Wonder Woman in Batman v Superman I was sure that it was going to do well, I just didn’t know how well. Whenever I read those type of articles it got me boosted and more motivated to show that they’re wrong.\n\nWas the premiere the first time you saw the film? What was your experience like that night?\n\nI’ve become more spiritual the more I grow up. The world has a very interesting way of grounding you and keeping you balanced. When we started to go and promote the movie I injured my back right at the beginning on the airplane to China. The success was so big but I couldn’t really enjoy it. I wasn’t popping champagne. I was laying in bed, not being able to hold my baby. I wasn’t able to sit in the first screening in Los Angeles premiere. I thought it’s like the movie had so much psychological pressure that I carried that my back was literally “broken.” So I didn’t take it for granted. I should really cherish every moment.\n\nWhen you saw the glowing reviews coming in … what was that like?\n\nIt was a Thursday evening and I knew they were lifting the embargo for the reviews at 9 p.m. It was my first time going through such a thing. Usually, I’m not in the loop on when the studio is lifting the embargo. So I put my daughter to bed and I said, “You need to fall asleep, I need to do some work tonight.” And of course that night she was very much awake. I said, “Okay. I’m going to bring my computer and sit next to you until you fall asleep.” So I bring my computer and I start to read all the reviews. I got so excited I called Patty. And the moment I called Patty she answered the phone — it didn’t even ring. She immediately picks up. She’s all, “What’s going on? I’ve been meditating for 20 minutes, not reading anything, literally waiting for you to call me.” I was just screaming: “Ahhhhh!” She said, “It’s good? It’s good?” I said, “It’s unbelievably amazing! I can’t believe this is happening to us right now!” And my daughter, who’s 6 now, and was part of the production — when you work so many hours [your children] come to set and become part of the circus. My daughter got so excited. My daughter asked me, “What’s happening, mama?” I told her: “People are liking the movie. See, if you work hard enough and you have good intentions sometimes in life people appreciate it.”\n\nThat’s a wonderful story. You clearly have such a great relationship with Patty. She, of course, had some lengthy negotiations to return as director for Wonder Woman 2. Were you concerned at all that you guys might not be able to reunite?\n\nUm, you want my honest opinion, right?\n\nOf course.\n\nNo. I told her I was with her completely and would support her and … you know, I think she’s completely entitled to what she’s going to get, the renegotiations that she did. She just did a phenomenal job and knew how to tell this story in the most interesting way. By doing such a movie, it’s a female-driven movie, it’s a Wonder Woman movie. But there’s a catch in that you don’t want the movie to be just for women and just for women or superhero fans to relate to this story. It was very clear for Patty from the beginning that she wanted this story to be universal, so everyone can relate in different ways to the journey of this character. She did it brilliantly and there was no happier person than me when it was announced she was going to continue and we’re all going to reunite.\n\nIt almost sounded like there that you were going to say if she hadn’t come back you wouldn’t have done the sequel. But I wasn’t sure if you were going to go that far…\n\nI didn’t need to. The executives at Warner Bros are smart and they showed her their appreciation. No one tried to take anyone’s credit. It was clear she created an amazing movie and she should be paid for it. There was no need to go through any declarations of any threats. Everyone was on the same page.\n\nPeople were literally crying in the theaters when it came out. I’m sure you’ve had a lot of feedback from fans since then. Was there any particular reaction from a certain fan that has really stuck with you?\n\nThere have been different ones. I met with this couple who were over 80 and they went together in wheelchairs and it was their date night and they were so excited to see a movie. I did a SAG Q&A and one of the people there said their niece had lost both of her legs and was really depressed and obviously was going through a very a hard time. Once the movie came out it became her thing. She watched Wonder Woman on a daily basis and that’s how she found more power to go through the struggle she’s going through. It’s been very emotional stories to funny and happy ones. Honestly, the word “incredible” is going to repeat itself because that’s the way it’s been recently.\n\nImage zoom Clay Enos/Warner Bros.\n\nYou’ve now played Wonder Woman across three films. What’s your favorite scene of your character?\n\nThere were a bunch. There were favorite scenes to play — I loved shooting the watch scene, and the dance scene in the square. But watching the movie, I loved when Wonder Woman first revealed herself by crossing No Man’s Land.\n\nIs there something that you feel like you’ve learned about how to play the character that you took a while to figure out?\n\nOne week we were struggling. It was the tower scene when, after Wonder Woman kills General Ludendorff and she thinks she’s killed Aries. She can’t understand why everybody was still fighting.\n\nI loved that scene.\n\nYeah. Because what Steve is saying is that not everyone is good, and people are both good and bad. And realization for Wonder Woman is that her mother was right. She’s devastated by this reveal. But the audience shares Steve’s point of view because we all understand men are bad and good. And I was really worried because there’s a fine line when playing some naiveté that you don’t want to play dumb. It took us a day to figure out the right balance and tone to that scene.\n\nIs there anything you did with the character along the way, that if you could back and do it differently, you would?\n\nNo, because the result was so great it brought us to where we are today. It’s like the Butterfly Effect — if you change something maybe the whole thing would be changed. So I wouldn’t change anything.\n\nThis seems like one of those roles that carries with it so much responsibility. Do you feel like you have to now be a role model off screen whether you want to be or not?\n\nIt’s a complicated question because it’s not like I want to be a role model. It’s not like anyone wakes up and goes, “Today, I’m gonna be role model!” But for me, I’m a really boring person. I get all the exciting action stuff when I’m acting. Because in real life, I’m married, I’m a mother. I’m not into going out and parties. It’s not who I am. So it’s kind of easy because I’m not reckless at all and because I have two girls. It’s important to me that when they grow up if they see me do something that they’ll feel comfortable with it. Do you know what I mean?\n\nThat being a parent shapes you into being a role model regardless of your career…\n\nYeah, exactly.\n\nAnother big headline during your year was that James Cameron criticized the film as an objectified icon, which Patty had some strong feelings about. But I don’t think I’ve seen you weigh in on that?\n\nBecause I didn’t want to give him the stage. First of all, I’m a big fan of his work. His movies are great. He was very innovative in many things that he did, and I’ve got nothing but great things to say about the creative and professional side of his work. When it happened, the timing of when it happened, he was promoting another movie of his. It was like he was looking for publicity and I just didn’t want to give him the stage.\n\nMost recently Justice League came out, and while you were praised for your performance the movie was hit a bit by critics. How did you feel about the film?\n\nWhen I started to shoot Justice League it was literally the day after I wrapped on Wonder Woman. So it was the same, but different, and it was really nice to share the stage with an ensemble cast and work with some of the guys again. It was a lot of fun. Obviously, it wasn’t about Wonder Woman; she was supporting the bigger story. I’m very excited to start working on Wonder Woman 2.\n\nWhat can you tell us about how your character evolves in the second film?\n\nOther than the wonderful work Lynda Carter did in the TV show this character was never really told on the big screen. We just see her origin story. But there’s so much to explore with this character who has 75 years of legacy, there’s so much material and so many ways and I’m psyched about it.\n\nYou recently tweeted that you’ll be “forever grateful to play this character.” How many Wonder Woman movies could you do? How will you know if and when it’s time to move on?\n\nI think that once I’m there, once I feel it’s time to move on, then I’ll know. Right now I don’t know.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F000264569hr-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F000264569hr-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F000264569hr-2000.jpg", "keywords": [], "authors": ["James Hibberd", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "Maggie Fremont"], "canonical_link": "https://ew.com/movies/2018/01/04/gal-gadot-wonder-woman-interview/", "title": "Gal Gadot teases Wonder Woman 2 in deep-dive interview", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Entertainers of the Year,Gal Gadot", "news_keywords": "Entertainers of the Year,Gal Gadot", "description": "'Wonder Woman' star Gal Gadot talks about the ups and downs of her 'exhilarating' year", "og": {"title": "Gal Gadot teases 'Wonder Woman 2' in deep-dive interview", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2018/01/04/gal-gadot-wonder-woman-interview/", "description": "EW asks Gal Gadot about the moment she knew Wonder Woman was a hit, which scenes across her three DC movies was her favorite, what&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F000264569hr-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/movies/2018/01/04/gal-gadot-wonder-woman-interview/", "description": "'Wonder Woman' star Gal Gadot talks about the ups and downs of her 'exhilarating' year", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F000264569hr-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2018/01/04/gal-gadot-wonder-woman-interview/", "title": "Gal Gadot teases 'Wonder Woman 2' in deep-dive interview", "description": "'Wonder Woman' star Gal Gadot talks about the ups and downs of her 'exhilarating' year", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F000264569hr-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1514995200.0, "source": "https://ew.com", "summary": ""}