{"url": "https://www.romper.com/p/blake-lively-compared-her-postpartum-body-to-other-moms-its-so-so-relatable-8225205", "text": "This has been a big week for Blake Lively talking about her postpartum body. After opening up about her weight loss process since giving birth to her youngest child in an Instagram post on Monday, she opened up even more on Wednesday. In an interview with E! News, Blake Lively revealed that she compared postpartum body to other moms, including Emily Blunt, and explained that it made her postpartum period more difficult.\n\nThe 30-year-old actress spoke with E! News on Wednesday morning, while attending the Michael Kors fall-winter 2018 show at New York Fashion Week along with her pal Emily Blunt. \"This one,\" she told the outlet, referring to Blunt. \"She was this size two months after birth and I think that's what's so hard because you compare yourself to other moms.\"\n\nEven though Lively chose to dedicate a lot of time to working out in order to return to the body she felt comfortable in, she has a great message for postpartum mothers who have other priorities. \"It took me 14 months, but I fit into PVC,\" she told E! News, pointing to her red trench coat. \"But, it's also OK if you don't. If that's not a priority or a goal of yours, then that's fine, too.\"\n\nJamie McCarthy/Getty Images Entertainment/Getty Images\n\nLively has two daughters with husband Ryan Reynolds: James, who is now 3 years, and Ines, who is 17 months old. Lively gave birth to Ines, in September 2016, and several months later, she began working with personal trainer Don Saladino. This past Monday, she took to Instagram to tell her followers about the past 14 months working alongside Saladino.\n\n\"Turns out you can’t lose the 61 lbs you gained during pregnancy by just scrolling through Instagram and wondering why you don’t look like all the bikini models,\" Lively captioned an Instagram photo of herself and Saladino. \"Thanks @donsaladino for kickin my A double S into shape. 10 months to gain, 14 months to lose. Feeling very proud 💪😁💪.\"\n\nHer trainer also shared a photo with his happy client on Monday. \"Couldn’t be more proud @blakelively!\" Saladino wrote on Instagram. \"61 pounds in 14 months after baby number 2!-Doesn’t she look awesome? 👍👍👍👏🏼👏🏼👏🏼.\"\n\nThis is not the first time Lively expressed her belief that postpartum bodies should not be held to standards of perfection. In an August 2016 appearance on Australian morning show Sunrise, host Nelson Aspen asked Lively how she was able to get her body back so quickly after giving birth to James. Instead of responding by discussing her exercise regimen or eating habits, Lively took the opportunity to discuss how postpartum mothers should be celebrated for giving birth instead of judged for what their bodies look like.\n\n\"It’s so unfair though, because it’s so celebrated,\" Lively said in the interview, when asked about postpartum body bounce-back. She further explained:\n\nIt’s like, this is what someone can look like after a baby. I think a woman’s body after having a baby is pretty amazing ... You don’t need to be Victoria’s Secret ready right away because you just did the most incredible miracle that life has to offer. I mean, you gave birth to a human being! So I would really like to see that celebrated.\n\nThe way society talks about postpartum bodies and celebrates celebrity mothers for shedding baby weight in short periods of time should not be the norm. By sharing her opinions on postpartum bodies, Lively is helping to fight this stigma. Yes, even though she chose to hire a personal trainer and lose postpartum weight, she has still acknowledged on many occasions that every new mother's body is different, and that every woman should be allowed to prioritize whatever they want to after having a baby. And all of that is worth celebrating.\n\nCheck out Romper's new video series, Bearing The Motherload, where disagreeing parents from different sides of an issue sit down with a mediator and talk about how to support (and not judge) each other’s parenting perspectives. New episodes air Mondays on Facebook.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/9784e5c3-d9c7-46aa-ab53-8e1e16ae49c6-getty-663923238.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.romper.com/uploads/getty/2018/2/14/77b2d973-95f5-4b94-a49d-5094dab593ce-getty-918230244.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/2/14/f2110312-34d5-451c-9b58-85fcfd38a33b-getty-918230182.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/2/14/f2110312-34d5-451c-9b58-85fcfd38a33b-getty-918230182.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/beaeb86d-572b-4eb6-8782-1e6322ece913-getty-1209737854.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/2/14/f2110312-34d5-451c-9b58-85fcfd38a33b-getty-918230182.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/blake-lively-compared-her-postpartum-body-to-other-moms-its-so-so-relatable-8225205", "title": "Blake Lively Compared Her Postpartum Body To Other Moms & It's So, So Relatable", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/blake-lively-compared-her-postpartum-body-to-other-moms-its-so-so-relatable-8225205", "type": "article", "title": "Blake Lively Says She Compared Her Postpartum Body To Other Moms & It's So, So Relatable", "description": "This has been a big week for Blake Lively talking about her postpartum body. After opening up about her weight loss process since giving birth to her youngest child in an Instagram post on Monday, she opened up even more on Wednesday. In an…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/2/14/f2110312-34d5-451c-9b58-85fcfd38a33b-getty-918230182.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "This has been a big week for Blake Lively talking about her postpartum body. After opening up about her weight loss process since giving birth to her youngest child in an Instagram post on Monday, she opened up even more on Wednesday. In an…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}