{"url": "https://www.monstersandcritics.com/smallscreen/am-exclusive-kyle-clarke-dishes-mightily-on-what-happens-at-the-abbey/", "text": "Kyle Clarke on What Happens at The Abbey\n\nE!’s bawdy pansexual adult soap opera reality show What Happens at The Abbey is a visual smorgasbord of pretty people all behaving badly.\n\nBut not all are the same.\n\nEnter former Army captain turned fitness model-turned-actor and entrepreneur Kyle Clarke. Painted as a bit of a bad boy bartender on this series set at a hot gay bar in West Hollywood, Clarke is embroiled in a reality love affair with castmate Marissa Chykirda (maybe) and he loves his momma and his little dog Koda like nobody’s business.\n\nClarke is whip-smart and thoughtful despite what we have seen in a previous episode where he dismissed fellow castmate Elizabeth Steinle at a charity event which caused her to melt down.\n\nDespite a two-week frost, Kyle and Liz have since worked out their issues and now are on solid footing as friends, a testament to the natural coaching abilities and maturity this uber-fit veteran brings to a cast of sometimes childish up-and-comers.\n\nEnthusiastic about health and longevity, Clarke tells how he trained his 65+-year-old dad to get his abdominal muscles ready for a cover shoot and how he is in it for the long game, wanting to take his devotion to nutrition and holistic health to the masses as he builds his brand and fame.\n\nWe spoke to Kyle about his role as the adult of the cast and his plans for fitness world domination:\n\nMonsters and Critics: Kyle, how did you come to the Abbey as an employee?\n\nKyle Clarke: I moved to LA about 6 years ago, right when I got here and because I did so much work in the fitness industry, people were like, ‘Oh, you should work at the Abbey’ and I had never been there before. After a couple of years, I work for a supplement company and I’m with them on salary, but I am basically paid to develop products, do their marketing, and stay in shape to do all of the photo shoots.\n\nSo I wasn’t really interacting with people too much, and I was kind of losing my people skills. When I was going on auditions I felt super awkward around people. I want to go more often, but I don’t want to drink, so I considered this bartending job, I am out and not drinking but I am making money and I am having fun. Where should I go?\n\nI’ve always been told I should work at the Abbey, so I drove down there and was really nervous because I had never been inside, it’s like the number one gay bar in the world and I was like, ‘oh man I’m about to walk ito this place and ask for a job,’ but I walked in, asked for a job and they said ‘we can’t hire you because you’ve never been to our establishment.’\n\nI sat down at the bar and all the regulars began talking to me, asking my story, where I was from and all of a sudden the general manager came back over to me and said, ‘Alright, come in on Thursday night, if you can handle Thursday, we’ll hire you on Friday.’\n\nI walked in on a Tuesday and was hired on a Friday, that never happens at the Abbey. Usually, they are never hiring, other people who have worked there have been there 10, 15, 20 years…\n\nM&C: Yet the cast of the show seems very young…\n\nKC: Right, I think I am the oldest castmate of the show.\n\nM&C: Your dad is in amazing shape, you have a photo of him on Facebook, can you talk about your father and your relationship?\n\nKC: Thank you, I come from an incredible family, My parents are both overly involved in me and my sister’s life. Once we went away to college…they just wanted the best for us so they did it out of love. When we went to college they kind of backed off as parents and became good friends and mentors and good role models for our lives.\n\nI’ve always been closer with my mom. But lately, my relationship with my dad has improved tremendously. He was a captain in the Marine Corps. He was more badass than I was. He was a fighter pilot in the Marines. He flew F-4 Phantoms, he was the real Top Gun! He did that so I wanted to be a captain as well. I went into the military and was a captain in the army, it bonded me with my dad.\n\nM&C: Was he disappointed you didn’t become a Marine?\n\nKC: No, it didn’t. It disappointed me that I didn’t become a Marine! [laughs] I wanted to become a Marine but the college I went to had Army on the base. I had a full-ride scholarship from the U.S. Army, to attend Washington University in St. Louis, MO. (he received his Bachelors of Science in Civil Engineering) and you had to go Navy and then Marine Corps. option.\n\nYou had to go into the Navy and hopefully get that option. I didn’t want to [go Navy] and be stuck on a ship somewhere. I would go crazy.\n\nAfter that, I started doing all of the fitness work after I got out of the military and my dad was like, ‘Hey I want to get back in shape,’ so I gave him a diet plan and the workout routine, ‘do this and you can get abs.’\n\n[Back then] he was like, ‘At 63…I don’t think I can get abs,’ and I said to him, ‘Do everything I told you and you will.’\n\nI told him, ‘If you get abs I will get you on the cover of a magazine.’ Six months he got abs, and then six months later I got him on the cover of a magazine.\n\nM&C: You are obviously motivating, on the show however you are dealing with a lot of children. Let’s talk about Elizabeth’s behaviors, on reality TV, producers gin up drama, can you talk about that charity party scene and your relationship with the women at the Abbey?\n\nKC: Right out the gate, when I met Elizabeth it was kind of like, alpha male-meets-alpha lesbian female they’ve really tried to go after the alpha male just to claim that. She and I butted heads really hard, in the beginning, We had three or four fights that were all cut out of the episodes already that lead up to the fight at the charity event. It kind of seems like it came out of nowhere, but we had already gone at it before then because…I don’t know… we are both trying to be ‘the man,’ I guess, I don’t know what the correct term is.\n\nAt the event, she was still at me, I didn’t know she had any kind of history with an eating disorder or that stuff, I obviously didn’t know. I was quite a few drinks deep, and if you can’t tell by the slurring of my words in that part [laughs] but I kind of said something that I definitely should not have said and it took her back. She kind of went through a lot of personal issues but I was the one who set it off, so I became the target.\n\nIt was at a charity event and I didn’t care if we were on camera or not, I was like, ‘leave me alone. I don’t want to talk to you right now, we are at a charity event.\n\nShe wouldn’t stop and it got bigger and bigger. She had a total meltdown. After that, we didn’t speak for a good two weeks, anywhere we went we wouldn’t speak to each other, just stay out of each other’s way. In Palm Springs, we all had ou own room and she tried to come over to mine, and I was like ‘I don’t want to talk,’ and she insisted she wanted to talk.\n\nI said, ‘I really want you to stay out of my way because you are going to make me look bad to America, please don’t talk to me on or off camera.’ She insisted, we talked, and I was like, ‘Alright, thank you, I am not trying to come after you’ and she said she felt like this and we really .. we both apologized and go past it.\n\nThe next day in Palm Springs you see on the episode this guy Chris calls her a ‘whale,’ he tells Erin ‘stop talking to the whale.’ I was in the jacuzzi with Marissa and I heard that. That was wrong, that is to a different level. It was directly at her and it was body shaming at its worst. So I hopped out of the jacuzzi and was like ‘Let’s go,’ to her and she was having a crisis, and when she is upset, ‘leave me alone.”\n\nShe internally implodes so I got the other guy out of there, and was like, ‘Listen, I get it it sucks I am sorry.’\n\nShe didn’t want to hear that. What’s funny is that right now, she got on a workout and diet plan and she looks incredible and is in great shape. She is doing it naturally, the right way. Since that day, she and I are friends have a much better relationship.\n\nIt’s weird because in Los Angeles everybody is so fake, everybody lies to you, so to have somebody – clearly, she’s taking her issues to a personal level- but some wear their heart on their sleeve and they’re honest and upfront and too much.\n\nI prefer that over somebody that hides that and doesn’t tell me how they really feel. She and I are cooler and in a better place than anyone else on the show.\n\nIt’s weird because in Los Angeles everybody is so fake, everybody lies to you, so to have somebody – clearly, she’s taking her issues to a personal level- but some wear their heart on their sleeve and they’re honest and upfront and too much…I prefer that over somebody that hides that and doesn’t tell me how they really feel. She and I are cooler and in a better place than anyone else on the show.\n\nM&C: Let’s talk about Daniel…he insinuates a lot of rumors about you and Billy…how do you handle him?\n\nKC: Daniel is just a goon. He’s just…I don’t know. How do I say this in the nicest way possible? Daniel is the guy who just gets made fun of but he also makes fun of himself. Most of the way he acts is just for the show, in real life he is not an issue for me at all and never has been.\n\nIn the show he wasn’t pushing me in the pool or doing any of that stuff to me, he’s just doing that to certain people to get some airtime. But he is a goofy guy, he doesn;t take himself that seriously and he doesn’t offend me, and I don’t take him that seriously either, He knows … he doesn’t even believe the stuff he’s saying ‘Oh yeah, Kyle and Billy are more than roommates…’ or whatever.\n\nM&C: Is he the classic vintage David Spade of the cast?\n\nKC: The thing is he tries to be the David Spade of the cast but just falls short. Because he’s not original. Even his ‘Oh, my look is Blue Steel, Ferrari, Le Tigre?’ whatever… he just stole that from Zoolander! For someone who hasn’t seen Zoolander, they would think he’s a funny guy, but if they had they’d be like, ‘Oh he ripped off all their material.’\n\nM&C: What’s the story with you and Marissa?\n\nKC: She was the new girl who came in, and was like, ‘Alright.’ How real do you want it? She came in, super nice girl, super sweet. I’ll pursue this girl and hung out with her a little bit and found out she had an on again-off again boyfriend. So usually when that happens, it’s like, well make this girl make a decision, hold her feet to the fire.’ Let’s see what are her true feelings…so I hung out with Ashley one day and Marissa was like, ‘I don’t like that.’ I could tell right away.\n\nWe dated for a while and I think you will see as the episodes go on. we go on a couple of dates and she doesn’t give me much attention, doesn’t really care that much. I put effort into it and wasn’t appreciated. I want to find someone who appreciates me.\n\nM&C: What’s your world domination plan and end game, do you want to be an actor or monetize your fitness brand?\n\nKC: Pretty much both. When I moved to LA the goal was acting and fitness. I am continuing to create more fitness items, and I would love to create a men’s skincare line. there’s not really much for guys out there.\n\nAlso, in acting, I have been on four auditions this week, two more and I am trying land some roles to get recognition. Problem is, getting a co-starring role on a show is difficult. I got a role on Shameless last year, but they are few and far between. You cannot overpower anybody on the show and I have a leading man look. There’s not going to be sending me out against leading actors out there because they have credits and all of that. I’m doing this show to raise my footprint to where taking a gamble on me might be worth it down the line.\n\nM&C: What requisite qualities are crucial for you to consider a mate and possibly a family down the road?\n\nKC: If it’s in the cards I would love that. First and foremost is honesty, followed quickly by respect. I have been lied to alot since I’ve been to LA by different women. I avoid it, if I am lied to once I am done. Honesty is a huge thing. I always put my partner before me, so if I am dating a girl, I am all about her and she’s all about her, I’m done. Someone that is as caring and giving as I am.\n\nFamily is big, someone that comes from a good family. I understand when someone a broken home I understand it wasn’t their doing, sometimes it affects them though and things come out that are because of that childhood. it’s tough to deal with that. I like outgoing, athletic girls willing to try things and who are adventurous. They must my love dog or they are done.\n\nM&C: Who wouldn’t love your dog, Koda?\n\nKC: Right? I had a girl walk in an almost, ‘Ewww,’ like making a ‘don’t come over to me’ face right at my dog. I thought well, this is not going to work. Koda doesn’t have to love them, but they have to love her. That’s the way it goes! [laughs]\n\nM&C: Signature Abbey drink you make and recipe, please?\n\nKC: The main drink at the Abbey we are known for is a Mixed Wild Berry Martini. It’s two ounces of Absolut Acai, an ounce and half of mixed berry medley liqueur and a splash of sweet and sour, and shaken and a splash of grenadine and two or three blueberries and raspberries on top. When I make it, I try to do more Absolut Acai and less mixed berry medley, because it is so, so sweet.\n\nM&C: Anything else to look forward to the Abbey – any surprises?\n\nKC: You will see some dates, my whole family which is super awesome for me. The fact I was able to get my dog and my entire family and best friend on national television is a really cool thing. They meet Marissa in Vegas where I was born and raised. We all have dinner together. We have a lot of fun in Vegas and … we come back and kind of open up the chapel next door to the Abbey and that’s pretty much te end of season one.\n\nM&C: Who is your favorite in the cast?\n\nKC: I have to pick Brandi [Andrews, the host]. She is the coolest chick ever. She is having a baby with Lawrence. She is so cool, she’s there and mama bear for everybody.\n\nWhat Happens at The Abbey airs Sundays at 10/9c on E!", "images": ["https://www.monstersandcritics.com/wp-content/uploads/2020/03/cropped-cropped-mc-logo-stroke-1-1.png", "https://www.monstersandcritics.com/wp-content/uploads/2019/02/kyle.jpg", "https://www.monstersandcritics.com/wp-content/themes/utility-pro/images/facebook.png", "https://www.monstersandcritics.com/wp-content/uploads/2017/06/eliz-abbey-1024x576.jpg", "https://www.monstersandcritics.com/wp-content/themes/utility-pro/images/email.png", "https://www.monstersandcritics.com/wp-content/uploads/2017/06/koda-576x1024.jpg", "https://www.monstersandcritics.com/wp-content/themes/utility-pro/images/twitter.png", "https://secure.gravatar.com/avatar/?s=48&d=mm&r=g", "https://secure.gravatar.com/avatar/?s=40&d=mm&r=g", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://www.monstersandcritics.com/wp-content/uploads/2019/02/kyle.jpg", "keywords": [], "authors": ["April Neale"], "canonical_link": "https://www.monstersandcritics.com/smallscreen/am-exclusive-kyle-clarke-dishes-mightily-on-what-happens-at-the-abbey/", "title": "Exclusive: Kyle Clarke dishes mightily on What Happens at The Abbey", "meta_data": {"description": "We wanted to hate this handsome fit cast member of E! What Happens At The Abbey but wound up discovering he's a family-centric, dog loving nice guy!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Exclusive: Kyle Clarke dishes mightily on What Happens at The Abbey", "description": "We wanted to hate this handsome fit cast member of E! What Happens At The Abbey but wound up discovering he's a family-centric, dog loving nice guy!", "url": "https://www.monstersandcritics.com/smallscreen/am-exclusive-kyle-clarke-dishes-mightily-on-what-happens-at-the-abbey/", "site_name": "Monsters and Critics", "updated_time": "2019-02-03T14:52:39+00:00", "image": {"identifier": "https://www.monstersandcritics.com/wp-content/uploads/2019/02/kyle.jpg", "secure_url": "https://www.monstersandcritics.com/wp-content/uploads/2019/02/kyle.jpg", "width": 800, "height": 473}}, "article": {"publisher": "https://www.facebook.com/monsterscritics", "author": "https://www.facebook.com/AprilMaryNeale/", "tag": "What Happens At The Abbey", "section": "Smallscreen", "published_time": "2017-06-11T19:00:24+00:00", "modified_time": "2019-02-03T14:52:39+00:00"}, "fb": {"app_id": 220249472958}, "twitter": {"card": "summary", "description": "We wanted to hate this handsome fit cast member of E! What Happens At The Abbey but wound up discovering he's a family-centric, dog loving nice guy!", "title": "Exclusive: Kyle Clarke dishes mightily on What Happens at The Abbey", "site": "@monstersandcrit", "image": "https://www.monstersandcritics.com/wp-content/uploads/2019/02/kyle.jpg", "creator": "@AprilMac"}, "p": {"domain_verify": "9abcc0658f1dd4ad8d86a2c33eba0388"}, "google-site-verification": "W0V7_Td7mscUYxsJwzRBhIxHF4JB2PnzdGVKDImP54o", "viewport": "width=device-width, initial-scale=1", "msapplication-TileImage": "https://www.monstersandcritics.com/wp-content/uploads/2019/05/cropped-monsters-critics-favicon.png"}, "movies": [], "publish_date": 1497207624.0, "source": "https://www.monstersandcritics.com", "summary": ""}