{"url": "people.com/movies/brad-pitt-angelina-jolie-what-new-ruling-means/", "text": "The custody battle between Brad Pitt and Angelina Jolie just heated up, with a judge ordering new restrictions for Jolie’s involvement in Pitt’s interaction with their six children.\n\nAccording to court documents obtained by PEOPLE, Jolie could be in danger of losing primary custody of the children if she doesn’t take steps to improve their relationship with their father. A judge in the couple’s ongoing divorce case said in the documents that “it is critical that each of [the six] children have a healthy and strong relationship with their father and mother,” and that Jolie must allow Pitt to maintain and repair that.\n\nGet push notifications with news, features and more.\n\nFamily law attorney David Glass, who is not associated with the case, tells PEOPLE that it “is extremely rare” to see a court intervene in this way, though they typically do so after extensive evaluation and to prevent children from being alienated from one parent.\n\nImage zoom Brad Pitt and Angelina Jolie. Jason Merritt/Getty\n\n“It looks like what this judge was weighing was the difference between estrangement and alienation,” says Glass, who has not had access to the court documents. “The difference there is, estrangement is when children aren’t connected to one of the parents, mainly because of something that parent did. So a hypothetical, if dad screams and yells at the kids and doesn’t treat them nicely, the kids stop wanting to see dad, that’s estrangement. An alienation refers to where children have been told by the other parent that the parent they’re not seeing is bad, or doesn’t like them, or doesn’t care about them. Just talking badly about the other parent and the kids start to internalize what the other parent is telling them. In alienation cases, kids will typically just repeat words that are beyond their years, or they will repeat reasons that they don’t possibly have access to the information.”\n\nHe adds: “It’s a rare case where the court will find that someone alienated the kids. It takes a lot to move the court past estrangement into alienation, but once it’s determined that one parent is alienating the kids, the court has no choice but to jump in and make pretty strong orders right away.”\n\nThe judge also outlined specific steps Jolie should take to aid Pitt’s access to and relationship with the children, including a detailed summer visitation schedule, and easy phone access between Pitt and each of the kids, without monitoring or interference from their mom. Glass says that the goal of the new guidelines is to “try to figure out what’s in the children’s best interest.”\n\nImage zoom Angelina Jolie, Shiloh Jolie-Pitt and Zahara Jolie-Pitt in 2018. Dia Dipasupil/FilmMagic\n\n“The schedule worked out by the court is the typical post-alienation reunification schedule,” he says. “You see them a couple hours a day and that starts leading to full days and eventually if things go well it leads to overnights, so you’re slowly acclimating the kids to the parent who’s been cut out of the kids lives.”\n\nRELATED VIDEO: Brad Pitt Is ‘in a Better Place’ Amid Divorce Proceedings with Angelina Jolie: Source\n\nAccording to the court documents, the kids have to continue to see their therapist with Pitt, which Glass says is a positive step.\n\n“That’s the first good news, that the kids are in therapy and that dad is somehow involved in the therapy. That’s where the kids can work out whatever issues they have. It’s that continuing contact with dad … all those little pieces that eventually lead to some sort of reunification with their dad.”\n\nReps for both Jolie, 43, and Pitt, 54, have not yet responded to a request for comment. Jolie filed for divorce from Pitt on September 19, 2016. The have six children: Maddox, 16, Pax, 14, Zahara, 13, Shiloh, 12, and 9-year old twins Vivienne and Knox.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1385&h=725&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fangelina-jolie-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fangelina-jolie6.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F09%2Fangelina-jolie-3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1385&h=725&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fangelina-jolie-1-2000.jpg", "keywords": [], "authors": ["Kara Warner"], "canonical_link": "https://people.com/movies/brad-pitt-angelina-jolie-what-new-ruling-means/", "title": "What the New Ruling Means in the Brad Pitt and Angelina Jolie Custody Case", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Angelina Jolie,Brad Pitt,Exclusive,Movie Celebrities,Movie News,News", "news_keywords": "Angelina Jolie,Brad Pitt,Exclusive,Movie Celebrities,Movie News,News", "description": "Family law attorney David Glass explains why Angelina Jolie and Brad Pitt’s latest custody issues are rare", "og": {"title": "What the New Ruling Means in the Brad Pitt and Angelina Jolie Custody Case", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/brad-pitt-angelina-jolie-what-new-ruling-means/", "description": "The custody battle between Brad Pitt&nbsp;and Angelina Jolie just heated up, with a judge ordering new restrictions for Jolie’s involvement in Pitt’s interaction with their&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1385&h=725&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fangelina-jolie-1-2000.jpg", "width": 1385, "height": 725}}, "pinterest": {"url": "https://people.com/movies/brad-pitt-angelina-jolie-what-new-ruling-means/", "description": "Family law attorney David Glass explains why Angelina Jolie and Brad Pitt’s latest custody issues are rare", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fangelina-jolie-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/brad-pitt-angelina-jolie-what-new-ruling-means/", "title": "What the New Ruling Means in the Brad Pitt and Angelina Jolie Custody Case", "description": "Family law attorney David Glass explains why Angelina Jolie and Brad Pitt’s latest custody issues are rare", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1385&h=725&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fangelina-jolie-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}