{"url": "www.inquisitr.com/4761834/rihanna-shockingly-reacts-to-pregnancy-claims-by-involving-future-baby-daddy-hassan-jameel-rumors/", "text": "Rihanna had a 2018 Grammy Awards night to remember, from a performance that drew cheers from the audience to an award. Her fans responded on Twitter and Instagram, but they seemed to be paying more attention to arguing whether Rihanna was pregnant or just thick than to her musical success, as the Inquisitr reported. While social media was debating Rihanna’s rumored baby bump, the songstress was celebrating at 1Oak Nightclub in New York City with her rumored billionaire beau, Saudi businessman Hassan Jameel, according to People.\n\nHassan and Rihanna kept the party going until after 3 a.m. at the club. The 29-year-old singer stunned in her third outfit of the evening, glittering in a gold crop top and gold jewelry. Rihanna received her award at the Grammys for Best Rap/Sung Performance for her collaboration with Kendrick Lamar.\n\nAlthough the songstress was immersed in celebrating with Jameel after the Grammys, she also reportedly became aware of the rumors soaring on Twitter and Instagram about her alleged pregnancy. An insider told Hollywood Life that Rihanna had an unexpected reaction to the reports that she was sporting a baby bump rather than flaunting thicker curves during her Grammy Awards performance. And part of the songstress’ reported reaction involved her beau.\n\nRihanna joined Kendrick Lamar in accepting the award for best rap/sung performance at the Grammys. Featured image credit: Matt Sayles Invision/AP Images\n\nThe pregnancy speculation began after Rihanna flaunted her curvy body as she danced during her “Wild Thoughts” performance at the Grammys. The songstress didn’t try to hide her thicker figure, according to the source, but she reportedly didn’t anticipate that she would face baby rumors.\n\n“Some fans jumped to the conclusion that the 29-year-old was pregnant after her tight costume showed a little belly bump.”\n\nRather than go public with denial of a baby bump, Rihanna is just laughing off the pregnancy claims and trying to ignore them, said the insider. She reportedly is not pregnant and not even trying to have a baby.\n\nRihanna Happy With Thick Curves, Talks Hassan As Baby Daddy\n\nThe source also revealed how Rihanna and her boyfriend feel about her thicker curves.\n\n“Rihanna’s been happy with her thicker look, and her billionaire boyfriend Hassan Jameel loves her curves.”\n\nIn addition to trying to laugh off and ignore the pregnancy rumors, however, Rihanna reportedly brought Jameel into the baby bump discussion. According to the insider, the songstress revealed that she does want children and believes that Hassan will be a fabulous father. Rihanna isn’t ready right now to have children, but she reportedly is eager to welcome one or more babies into her life with her beau.\n\n“She’s simply not ready to start a family… just yet,” clarified the insider.\n\nRihanna Caught Canoodling With Jameel\n\nThe source revealed that Rihanna thinks Jameel is the perfect partner for having children together, describing him as “kind and patient, and a loving person.” And while Rihanna anticipates that Hassan will become a terrific daddy to her children, the insider said that the songstress will be a great mother.\n\n“Rihanna loves children… She’s a natural mom, and she thinks Hassan will make an amazing father.”\n\nFor now, however, Rihanna reportedly is focused on her career rather than starting a family. The insider revealed that Rihanna hasn’t even met her future baby daddy’s family yet, and fans should be aware in the future that when they see her belly protruding, it’s probably a “food baby” rather than a pregnancy.\n\nstay pressed. A post shared by badgalriri (@badgalriri) on Jan 28, 2018 at 2:10pm PST\n\nRihanna and Jameel have been a couple since June. They were seen kissing in Spain during her vacation, dining at a restaurant in London in September, and visiting Boston in October. For Halloween, Rihanna and Jameel enjoyed dinner, bowling, and “canoodling all night,” an insider told People.\n\nAn heir to the Abdul Latif Jameel business dynasty of Saudi Arabia, which has the right to sell Toyota Motor vehicles in Saudi Arabia and other Middle Eastern countries, Hassan works as the head of a charitable group in the company, Community Jameel. Rumors soared last month that Rihanna and Jameel were engaged when she was seen wearing an enormous diamond. But an insider told People that the couple is not yet engaged.", "images": ["https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/01/Rihanna-Pregnancy-Rumors.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/01/Rihanna-Grammy-Award-Baby.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4761834/rihanna-shockingly-reacts-to-pregnancy-claims-by-involving-future-baby-daddy-hassan-jameel-rumors/", "title": "Rihanna Shockingly Reacts To Pregnancy Claims By Involving Future Baby Daddy Hassan Jameel [Rumors]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}