{"url": "https://people.com/movies/donna-karan-defends-harvey-weinstein-suggests-women-may-be-asking-for-it/", "text": "While many Hollywood figures have spoken out against Harvey Weinstein, Donna Karan is defending the movie mogul amid allegations of sexual misconduct.\n\nWhen asked to address the allegations leveled against Weinstein, 65, according to a video interview on the Daily Mail, the designer, 69, said women may be “asking for it.”\n\nGet push notifications with news, features and more.\n\n“You look at everything all over the world today and how women are dressing and what they are asking by just presenting themselves the way they do. What are they asking for? Trouble,” Karan said at the CinéFashion Film Awards in Los Angeles on Sunday.\n\nLate Monday, the designer said in a statement to PEOPLE that her comments had been taken out of context and she was “truly sorry to anyone” she offended.\n\nInitially during the red carpet interview with the Daily Mail, the designer talked about injustice women faced around the world before defending her movie mogul friend.\n\nImage zoom Matt Baron/REX/Shutterstock; Venturelli/WireImage\n\n“I think we have to look at ourselves. Obviously, the treatment of women all over the world is something that has always had to be identified,” she told the reporter. “Certainly in the country of Haiti where I work, in Africa, in the developing world, it’s been a hard time for women.\n\n“To see it here in our own country is very difficult, but I also think how do we display ourselves? How do we present ourselves as women? What are we asking? Are we asking for it by presenting all the sensuality and all the sexuality?\n\n“And what are we throwing out to our children today about how to dance and how to perform and what to wear? How much should they show?”\n\nRELATED GALLERY: The Harvey Weinstein Scandal: All of the Hollywood Figures Who Have Spoken Out Against Movie Mogul\n\nKaran, who is friends with Weinstein’s wife and Marchesa co-founder Georgina Chapman, also said, “Harvey has done some amazing things,” adding Weinstein and Chapman are “wonderful people.”\n\nWhen asked if Weinstein was “busted” following The New York Time exposé, Karan responded in the video, “I don’t think it’s only Harvey Weinstein.”\n\nWith her comments sparking outrage on Monday night, the DKNY later spoke out saying she did not mean to offend.\n\n“Last night, I was honored at the Cinemoi Fashion Film Awards in Hollywood and while answering a question on the red carpet I made a statement that unfortunately is not representative of how I feel or what I believe,’ she said in a statement. “I have spent my life championing women. My life has been dedicated to dressing and addressing the needs of women, empowering them and promoting equal rights.”\n\n“My statements were taken out of context and do not represent how I feel about the current situation concerning Harvey Weinstein. I believe that sexual harassment is NOT acceptable and this is an issue that MUST be addressed once and for all regardless of the individual.\n\n“I am truly sorry to anyone that I offended and everyone that has ever been a victim.”\n\nRELATED VIDEO: Harvey Weinstein Says Wife Georgina Chapman Is ‘Standing By’ Him as He Claims He ‘Never Laid a Glove’ on Ashley Judd\n\nOne of those who was offended by her comments was Rose McGowan, who reportedly reached a settlement with Weinstein after an alleged inappropriate incident.\n\nMcGowan — who previously branded Weinstein a “monster” – was shocked at Karan’s comments.\n\n“Donna Karan you are a DEPLORABLE Aiding and abetting is a moral crime. You are scum in a fancy dress,” McGowan tweeted.\n\nWhile celebrity chef and CNN star Anthony Bourdain also came out against Karan’s comments.\n\n“To @dkny How many seventeen year olds have you dressed like they are, in your words, ‘asking for it’?” Bourdain also shared, along with a DKNY ad.\n\nThe Weinstein scandal comes after the NYT reported Thursday that eight women, including actress Ashley Judd, came forward to accuse the film mogul of sexual misconduct. Following the allegations, the Oscar-winning film producer was removed from his powerhouse film studio The Weinstein Company.\n\n“I appreciate the way I’ve behaved with colleagues in the past has caused a lot of pain, and I sincerely apologize for it. Though I’m trying to do better, I know I have a long way to go,” Weinstein said, adding that he was working with therapists and planned to take time off to “deal with this issue head-on.”\n\nAccording to the NYT, Weinstein has reached at least eight settlements with women, including McGowan. In their claims, they allege that Weinstein behaved inappropriately during work meetings.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdonna-karan.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdonna-karan.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdonna-karan.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/movies/donna-karan-defends-harvey-weinstein-suggests-women-may-be-asking-for-it/", "title": "Donna Karan Defends Friend Harvey Weinstein, Suggests Women May Be 'Asking for It' By the Way They Dress", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Donna Karan,Harvey Weinstein,Movie Celebrities,Movie News,News,Style News", "news_keywords": "Donna Karan,Harvey Weinstein,Movie Celebrities,Movie News,News,Style News", "description": "The DKNY creator's comments sparked outrage on Monday", "og": {"title": "Donna Karan Defends Friend Harvey Weinstein, Suggests Women May Be 'Asking for It' By the Way They Dress", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/donna-karan-defends-harvey-weinstein-suggests-women-may-be-asking-for-it/", "description": "While many Hollywood figures have spoken out against Harvey Weinstein,&nbsp;Donna Karan is defending the&nbsp;movie mogul amid allegations of sexual misconduct. When asked to address the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdonna-karan.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/donna-karan-defends-harvey-weinstein-suggests-women-may-be-asking-for-it/", "description": "The DKNY creator's comments sparked outrage on Monday", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdonna-karan.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/donna-karan-defends-harvey-weinstein-suggests-women-may-be-asking-for-it/", "title": "Donna Karan Defends Friend Harvey Weinstein, Suggests Women May Be 'Asking for It' By the Way They Dress", "description": "The DKNY creator's comments sparked outrage on Monday", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdonna-karan.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}