{"url": "http://time.com/5077939/golden-globes-2018-date-host-nominees/", "text": "The 75th Golden Globe awards will soon be upon us. The annual ceremony brings together the biggest names in film and television for a boozy celebration of the previous year’s work, kicking off the season of acceptance speeches and red-carpet arrivals that culminates with the doling out of Oscars in early March.\n\nHere’s what to know about the 2018 Golden Globes awards ceremony.\n\nWhen are the Golden Globes?\n\nThe Golden Globes 2018 date is Sunday, Jan. 7. The awards will be broadcast live from the Beverly Hilton Hotel on NBC starting at 8 p.m. ET/5 p.m. PST. Check out where you can watch or stream the Golden Globes online for free.\n\nWho is hosting the Golden Globes?\n\nLate Night‘s Seth Meyers will host the 2018 Golden Globes, taking the baton from Jimmy Fallon, who presented the awards last year. Meyers joins a line of hosts that has previously included Tina Fey, Amy Poehler and Ricky Gervais — and he takes on the job as Hollywood continues to reel from numerous claims of sexual harassment and assault within the industry.\n\n“We’ve got a lot to talk about,” Meyers says in one promo for the ceremony, hinting that he won’t be shying away from challenging subjects during the Golden Globes show.\n\nWho are the Golden Globe nominees?\n\nThe 2018 Golden Globes nominations were announced Dec. 11, with the The Shape of Water leading the pack among movies with seven nominations. The Post and Three Billboards Outside Ebbing, Missouri followed, with six nods each, while Lady Bird scooped up four nominations. Big Little Lies dominated on the TV side with six nominations, while Feud: Bette and Joan received four nods. Fargo, This Is Us and The Handmaid’s Tale each received three nominations.\n\nOne of the year’s biggest snubs came in the Best Director category, where no women were nominated. Greta Gerwig (Lady Bird), Patty Jenkins (Wonder Woman) and Dee Rees (Mudbound) were all passed over, despite directing some of the most critically acclaimed movies of the year. Other films that didn’t make the cut despite buzzy reception include The Big Sick and Mother!. For more, see this full list of 2018 Golden Globes nominees.\n\nWho votes for the Golden Globes?\n\nGolden Globes nominees rarely know who exactly is voting for them. The voters belong to the Hollywood Foreign Press Association, a group of about 90 journalists from all over the world that is rather secretive about the identities of its members.\n\nWill anything be different about this year’s ceremony?\n\nYes, at least on the Golden Globes red carpet: Multiple high-profile actresses are reportedly planning to wear black to the ceremony to protest sexual harassment in Hollywood. According to People, participating nominees including Jessica Chastain, Emma Stone and Meryl Streep, among other women, plan to wear black dresses to the Golden Globes, and possibly to more events throughout awards season. Reports also indicate that many male actors, including Dwayne Johnson, intend to wear black in solidarity. Expect fewer questions about who attendees are wearing on the red carpet and more about why they’re wearing it.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Mahita Gajanan at mahita.gajanan@time.com.", "images": ["http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/02/jr-oseary-oscar-party-featured.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/02/bong-joon-ho.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/12/golden-globes-2018.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2017/12/golden-globes-2018.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Mahita Gajanan"], "canonical_link": "https://time.com/5077939/golden-globes-2018-date-host-nominees/", "title": "Everything You Need to Know About the 2018 Golden Globes", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "golden globes, golden globes 2018, 75th golden globe awards, golden globe awards 2018, golden globe nominations 2018, golden globe nominees, what are the golden globes, what channel is the golden globes on, golden globes 2018 date, when are the golden globes, what time are the golden globes, who is hosting the golden globes, who votes for the golden globes", "news_keywords": "golden globes, golden globes 2018, 75th golden globe awards, golden globe awards 2018, golden globe nominations 2018, golden globe nominees, what are the golden globes, what channel is the golden globes on, golden globes 2018 date, when are the golden globes, what time are the golden globes, who is hosting the golden globes, who votes for the golden globes", "description": "When are the Golden Globes? Who is nominated? Here’s everything you need to know about the 75th Golden Globe Awards ceremony.", "og": {"title": "Everything You Need to Know About the 2018 Golden Globes", "type": "article", "site_name": "Time", "url": "https://time.com/5077939/golden-globes-2018-date-host-nominees/", "description": "When are the Golden Globes? Who will host? Who is nominated? Here's what to know", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/12/golden-globes-2018.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5077939/golden-globes-2018-date-host-nominees/", "description": "When are the Golden Globes? Who is nominated? Here’s everything you need to know about the 75th Golden Globe Awards ceremony.", "media": "https://api.time.com/wp-content/uploads/2017/12/golden-globes-2018.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5077939/golden-globes-2018-date-host-nominees/", "title": "Everything You Need to Know About the 2018 Golden Globes", "description": "When are the Golden Globes? Who will host? Who is nominated? Here's what to know", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/12/golden-globes-2018.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": ["https://www.youtube.com/embed/bJje-B9YLIU"], "publish_date": null, "source": "http://time.com", "summary": ""}