{"url": "https://people.com/tv/everything-we-know-about-julianne-hough-brooks-laich-upcoming-wedding/", "text": "Julianne Hough and Brooks Laich‘s wedding is on the horizon!\n\nIt’s been nearly two years since the couple announced their engagement in August 2015 after a-year-and-a-half of dating, and the 28-year-old Dancing with the Stars judge and 33-year-old pro hockey player’s upcoming nuptials are drawing closer.\n\nGet push notifications with news, features and more.\n\nJust one month after getting engaged to her fiancé, the blushing bride-to-be told PEOPLE, “I’m just feeling so happy and blessed every moment of every day. My favorite thing about being engaged is just a sense of warmth and just joy.”\n\nHere’s everything we know about the couple’s wedding.\n\nImage zoom Jason LaVeris/FilmMagic\n\nThey Can’t Wait for Their Big Day\n\nThe countdown is on for their wedding, and the couple can’t wait to tie the knot!\n\nHough gushed about Laich in a sweet lovey-dovey Instagram post in early June, calling him, “My best friend, my hero, my everything!” She added: “I am completely and utterly madly in love with you!”\n\nIn celebration of his birthday in June, she shared two adorable throwback photos from her soon-to-be husband’s birthday party, which was celebrated by the pool. “#tbt celebrating this hunks birthday! @brookslaich 💙 That flame will never go out… 🔥🔥🔥” Hough captioned a video that was captured at the celebratory affair. She followed it up with an image of the engaged couple sharing a smooch: “#tbt Birthday kisses 💋.”\n\nThe NHL player also expressed his love for Hough (and their two pups!) recently. #wcw on these two angels!” he captioned a photo of her cuddling up to one of the couple’s beloved pups — Lexi — on a hike overlooking Los Angeles.\n\n“Couldn’t get our other girl Harley out from the shade of the tree for the photo…..I’m a lucky man to be surrounded by love like this!!”\n\nThere Will Be Lots of Dancing\n\nOne key element that will definitely be incorporated into the couple’s big day is dancing.\n\n“Oh my goodness, he wants more than anything to dance,” Hough told PEOPLE in September 2015 about her fiancé’s desire to show off his moves at the wedding. “He’s always wanted to dance before he ever met me, so he’s always asking me to teach him and I’m like, ‘Ask Derek!’ I’m just pawning my brother off to him. So I think Derek and Brooks might have a first dance. That would be interesting, and a sight to see for sure.”\n\nSpeaking with PEOPLE Now in December, the DWTS judge said that Laich is keen on doing a choreographed first dance at the reception. “It’s so funny because he really wants to do a first dance. And that’s more on him. Like, he wants to do it,” said Hough. “I was like, ‘Of course I’ll help you and teach you and we can do some stuff. But why don’t you ask, like, Derek [Hough]. I mean, he’s a dancer. He’ll help you.’ ”\n\nThat idea didn’t sit well with Laich. “He was like, ‘Why would I want Derek to teach me versus my fiancèe who’s my best friend,’ ” said Hough.\n\nSpeaking with Harry Connick Jr. in May, Hough dished on the choreographed number that they’ll showcase at the reception.\n\n“I was always under the impression that we would just get up there and do a little side-to-side dancing,” she said. “But he’s like, ‘No, I want a full-on choreographed routine!’ ”\n\n“He’s always wanted to dance,” she added. “I’m like, ‘Okay, well I’m going to have to teach you, and you’re going to have to listen.’ “\n\nMusic Is a Priority\n\nHough is hoping that her guests will be able to dance the night away to the tunes of one of her favorite musicians — and she’s willing to do whatever it takes!\n\n“I’m going to pull out all the favors,” she told Entertainment Tonight about getting Norwegian superstar DJ Kygo to perform. Hough said she’s even open to reaching out to Selena Gomez, who recently collaborated with Kygo, to see if the singer is able to “pull some strings” in her favor!\n\nAnd if big brother Derek could pull some strings, a certain singer would be performing at her big day.\n\n“You know who I want to get? Michael Bublé. I mean he won’t. He can’t possibly go, but it’d be amazing if he just sort of rose from the ground and was like ‘Hello!” and started singing!” Derek told PEOPLE Now in June.\n\nIt’s a Pup-Friendly Affair\n\nHough’s love for her two pups — Cavalier King Charles Spaniels, Lexi and Harley — is evident — and her wedding day will be no exception!\n\nThe two very special ladies will be included in her bridal party, according to the bride-to-be.\n\n“They will definitely be running down the aisle at some point,” she told PEOPLE. “For sure, probably wearing little ribbons and bows, the whole nine yards. I haven’t told Brooks yet, but that’s happening.”\n\nThey’ll Be Surrounded by Close Friends & Family\n\n\n\nThough Hough and Laich both compete and perform in front of millions of eyes on national TV, they’re hoping for something much smaller when it comes to their wedding day.\n\nLast June, she told PEOPLE that the magical night will include “mainly just friends and family.”\n\n“We’re keeping it pretty small and intimate,” she said. “Most of them know each other, so it’s perfect.”\n\nBig brother Derek Hough also hinted — shortly after the duo got engaged — at what he expects the big day to be like. “Something outdoors, in nature,” he said. “Sentimental. Something special to us. I have an idea where it’s going to be. … It’s going to be amazing.”\n\nBut even though they’re aiming to keep attendees to only closest friends and family members, Hough admitted to Entertainment Tonight that it will still be a full guest list.\n\n“I have a really big family. Brooks has sort of a moderate-sized family, so regardless of how small we want it, it’s still going to be big,” she said.\n\nFROM COINAGE: The Cost of Dancing With the Stars‘ Mirrorball Trophy\n\nThey’ll Have an Epic Wedding Guest List\n\nHough and her beau may want to keep the celebration on the smaller side, but there’s a few famous faces that we can almost guarantee will be in attendance.\n\nIn addition to her BFF Nina Dobrev — who documented Julianne’s Mexico-set bachelorette party in early March on social media — we presume the former DWTS pro and current judge will most likely invite longtime friend and dancing pro Mark Ballas, actress Nikki Reed, Monique Lhuillier and Aaron and Lauren Paul.\n\nShe Wants to Look Like Herself\n\nHough will have all eyes on her when she’s the brushing bride in white, but she definitely wants to look like herself when the big day arrives.\n\n“I want my wedding to feel glamorous, but timeless. And I think it goes from head to toe with your hair, your makeup, your dress and what you smell like,” Hough told PEOPLE in December, who maintains she wants to “look like me.”\n\nIn addition to her hair and makeup, she aims to maintain her overall physical appearance as she prepares for her wedding day.\n\n“If I get super hot for my wedding day and I’m not afterwards, and I’m not before, then it’s like, ‘Who is this person marrying my fiancé?’ Or, ‘Who’s my fiancé marrying?’ ” Hough told PEOPLE in early March. “I don’t want to look different than what I look like normally.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulianne-hough14.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1514&h=793&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulianne-hough14.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1514&h=793&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulianne-hough14.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/everything-we-know-about-julianne-hough-brooks-laich-upcoming-wedding/", "title": "Julianne Hough & Brooks Laich's Upcoming Wedding: Everything We Know", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Brooks Laich,Julianne Hough,News,TV", "news_keywords": "Brooks Laich,Julianne Hough,News,TV", "description": "The couple announced their engagement in August 2015", "og": {"title": "Julianne Hough & Brooks Laich's Upcoming Wedding: Everything We Know", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/everything-we-know-about-julianne-hough-brooks-laich-upcoming-wedding/", "description": "Julianne Hough and Brooks Laich‘s wedding is on the horizon! It’s been nearly two years since the couple announced their engagement in August 2015 after&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1514&h=793&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulianne-hough14.jpg", "width": 1514, "height": 793}}, "pinterest": {"url": "https://people.com/tv/everything-we-know-about-julianne-hough-brooks-laich-upcoming-wedding/", "description": "The couple announced their engagement in August 2015", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulianne-hough14.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/everything-we-know-about-julianne-hough-brooks-laich-upcoming-wedding/", "title": "Julianne Hough & Brooks Laich's Upcoming Wedding: Everything We Know", "description": "The couple announced their engagement in August 2015", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1514&h=793&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulianne-hough14.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}