{"url": "https://web.archive.org/web/20170201193055/http://theseattletribune.com/idaho-mother-sentenced-prison-multiple-citations-public-breastfeeding/", "text": "Heather Watson, a 32-year old mother and Baker County, Idaho, resident has been ordered to serve a 7-year prison sentence after receiving several indecent exposure citations for breastfeeding her 6 -month old daughter in public.\n\nAccording to Heather’s husband, Rick Watson, his wife had received a total of 6 indecent exposure citations for breastfeeding their daughter Caylee in public. Heather most recently was arrested by officers at a nearby public park. According to police reports and statements from Watson, she had been sitting on bench supervising her 3 other children, age 2, 5, and 7, as they played with other children at the park when her baby become fussy and needed to be fed.\n\nIdaho is currently the only state that has yet to pass a law allowing mothers to breastfeed in public without the consequences of indecent exposure. The only protection that nursing mothers have in Idaho is Jury Duty exemption. A Moveon.org petition was created by The Idaho Breastfeeding Law Coalition in effort to bring the state up to speed with the remainder of the states throughout the country that protect nursing mothers, however despite the petition’s 4,821 signatures, there is no indication that Idaho is anywhere close to passing new legislation.\n\n\n\n\n\n\n\nIn addition to serving a maximum 7-years in prison, because Watson was charged with multiple counts of indecent exposure, she will be required to register as a sex offender and will be placed on the National Sex Offender Registry.\n\nAccording to Heather’s husband and close friends, she was an advocate for mother’s rights and commonly took to social media websites such as Facebook to rant about her frequent indecent exposure citations and to complain about being harassed for breastfeeding her young daughter in a myriad of public locations. The below message was posted to Facebook a few weeks ago by Heather after she received her 4th citation for indecent exposure – “I’m so frickin pissed off by the barbaric, stone-age, laws we have in Idaho. I seriously just received my 4th ticket for the “indecent exposure” of my breast while feeding Caylee in public. You can bet I’m filing this document straight to the IDGAF folder (the trash can)!”\n\nThough Watson’s sentence is widely viewed as unnecessarily strict, Jude Walter Chapman, the sole judge presiding over Baker County and nearby Wiser, Idaho, made the following statement to reporters from a local ABC affiliate station, “We have laws in our state and due to Mrs. Watson’s repeated civil disobedience it’s is clear to me that she has little to no regard for the system our state was built upon. As a Judge, it’s not my job to create law, but to recognize and preside over it.”\n\nAs news of Watson’s sentencing has spread throughout the media, several public breastfeeding advocate groups have come together to demand change in Idaho’s current laws. They are asking anyone that disagrees with Judge Chapman’s ruling to voice your feedback by calling the Baker County Department of Justice at 785-273-0325.\n\n\n\n\n\n", "images": ["https://web.archive.org/web/20170201193055im_/http://theseattletribune.com/wp-content/uploads/2016/09/Heather-Watson-Facebook-Post.png", "https://web.archive.org/web/20170201193055im_/http://theseattletribune.com/wp-content/uploads/2016/09/Breastfeeding-map.png", "https://web.archive.org/web/20170201193055im_/http://2.gravatar.com/avatar/b95ae6a5b261e85a8733ba766746ad50?s=96&d=mm&r=g", "https://web.archive.org/web/20170201193055im_/http://theseattletribune.com/wp-content/uploads/2016/09/Breast-Feeding-Mugshot-Even.png"], "top_img": "https://web.archive.org/web/20170201193055im_/http://theseattletribune.com/wp-content/uploads/2016/09/Breast-Feeding-Mugshot-Even.png", "keywords": [], "authors": ["Editing Staff"], "canonical_link": "https://web.archive.org/web/20170201193055/http://theseattletribune.com/idaho-mother-sentenced-prison-multiple-citations-public-breastfeeding/", "title": "Idaho Mother Sentenced To Prison For Breastfeeding In Public", "meta_data": {"og": {"image": {"identifier": "https://web.archive.org/web/20170201193055im_/http://theseattletribune.com/wp-content/uploads/2016/09/Breast-Feeding-Mugshot-Even.png", "width": 880, "height": 705}, "locale": "en_US", "type": "article", "title": "Idaho Mother Sentenced To Prison For Breastfeeding In Public", "description": "A 32-year old Idaho woman has been sentenced to 7-years in prison after receiving multiple indecent exposure citations for breastfeeding in public.", "url": "https://web.archive.org/web/20170201193055/http://theseattletribune.com/idaho-mother-sentenced-prison-multiple-citations-public-breastfeeding/", "site_name": "The Seattle Tribune", "updated_time": "2017-01-03T18:59:17+00:00"}, "author": "Editing Staff", "description": "A 32-year old Idaho woman has been sentenced to 7-years in prison after receiving multiple indecent exposure citations for breastfeeding in public.", "robots": "noodp", "article": {"tag": "public", "section": "Uncategorized", "published_time": "2016-09-03T17:17:42+00:00", "modified_time": "2017-01-03T18:59:17+00:00"}, "twitter": {"card": "summary", "description": "A 32-year old Idaho woman has been sentenced to 7-years in prison after receiving multiple indecent exposure citations for breastfeeding in public.", "title": "Idaho Mother Sentenced To Prison For Breastfeeding In Public", "image": "https://web.archive.org/web/20170201193055im_/http://theseattletribune.com/wp-content/uploads/2016/09/Breast-Feeding-Mugshot-Even.png"}, "generator": "Powered by Visual Composer - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1472923062.0, "source": "https://web.archive.org", "summary": ""}