{"url": "https://popculture.com/celebrity/2017/05/31/tori-spelling-220k-default-judgement-money-problems/", "text": "Tori Spelling and her husband Dean McDermott's ongoing financial struggles are taking a turn for the worst.\n\nA judge recently ruled that the couple will be forced to pay off a $220k judgment, according to legal documents obtained by E! News. The ruling came on the heels of Tori and Dean failing to make an appearance for a subpoenaed court hearing last week.\n\nThe Beverly Hills 90210 actress and her hubby are fighting a legal battle against City National Bank, who is suing the couple for allegedly failing to pay off a $400k loan from 2010.\n\nThe bank accused Tori and Dean of failing to pay $185,714 plus an additional $2,407 in interest. The company also tacked on another $17,419, an amount that Tori allegedly overdrew this past September and has yet to pay.\n\nUp Next: Watch: Tori Spelling and Jennie Garth Throw Shade at Tiffani Thiessen on 'RuPaul'\n\nThis latest lawsuit is only one of many other financial snags that Tori and Dean have run into this past year. Back in April, the IRS reportedly drained both Tori and Dean's bank accounts.\n\nLast year, the news emerged that the celebrity couple was issued a lien by the state of California for $707,487.30 in unpaid federal taxes for their 2014 bill alone. Tori also reportedly owes more than $87,000 in unpaid credit card debt to American Express.\n\nSpelling has never been shy about discussing her financial issues. In her 2013 memoir Spelling It Like It Is, she spoke out about why she has problems spending too much money.\n\n\"It's no mystery why I have money problems. I grew up rich beyond anyone's wildest dreams. I never knew anything else,\" she wrote. \"Even when I try to embrace a simpler lifestyle, I can't seem to let go of my expensive tastes. Even when my tastes aren't fancy, they're still costly. I moved houses to simplify my life, but lost almost a million dollars along the way.\"\n\nMore: Tori Spelling Reveals New Photo Despite IRS Emptying Account\n\nTo add insult to injury, Dean's ex-wife, Mary Jo Eustace, is suing him for $100,000 in back child support for their son Jack.\n\nTori, 43, and Dean have five children, Liam, 10, Stella, 8, Hattie, 5, Finn, 4, and now baby son Beau. Despite their financial troubles, Tori recently said that she would be open to having more kids in the future.\n\n“All my kids have their little pair, so I would be open to one more,” Spelling said.\n\n[H/T E! News]\n\nPhoto Credit: Getty / David Livingston", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2017/05/31/tori-spelling-220k-default-judgement-money-problems/", "title": "Tori Spelling Owes A $220,000 Default Judgement", "meta_data": {"description": "Tori Spelling and her husband Dean McDermott's ongoing financial struggles are taking a turn for the worst.A judge recently ruled that the couple will be forced to pay off a $220k judgment, according to legal documents obtained by E! News. The ruling came on the heels of Tori and Dean failing to [...]", "keywords": "Tori Spelling,Celebrity News,Trending", "news_keywords": "Tori Spelling,Celebrity News,Trending", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Tori Spelling Owes A $220,000 Default Judgement", "description": "Tori Spelling and her husband Dean McDermott's ongoing financial struggles are taking a turn for [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Tori Spelling Owes A $220,000 Default Judgement", "type": "article", "url": "https://popculture.com/celebrity/2017/05/31/tori-spelling-220k-default-judgement-money-problems/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "Tori Spelling and her husband Dean McDermott's ongoing financial struggles are taking a turn for [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1496160000.0, "source": "https://popculture.com", "summary": ""}