{"url": "www.inquisitr.com/3593201/katie-holmes-and-jamie-foxx-update-is-he-adopting-her-daughter-suri-cruise/", "text": "Could Katie Holmes and Jamie Foxx be taking their relationship to the next level by starting a family together?\n\nFor the last several months, Katie Holmes and her rumored boyfriend, Jamie Foxx, whom she’s been linked to since 2013, have been facing rumors of possible pregnancies, but so far, nothing has come of the reports.\n\nWhile Katie Holmes and Jamie Foxx continue to stay silent about their alleged romance despite being seen together regularly throughout North America, rumors have continued to swirl in regard to their future plans. In the latest report, a source claimed Foxx might actually be planning to adopt the 10-year-old daughter of Katie Holmes and Tom Cruise, Suri Cruise, as his own.\n\nAlthough the idea may make sense to some, especially considering Tom Cruise has reportedly been estranged from the child for the past couple of years, Gossip Cop has shot down the false report, confirming that Foxx has no plans to become Suri’s legal guardian.\n\n“The reporting is completely false,” Foxx’s rep told the outlet of the story.\n\nKatie Holmes has not yet responded to the story.\n\nKatie Holmes And Jamie Foxx Are Facing Wedding Rumors, Reports Of A Tom Cruise Feud https://t.co/Alz4uol58q — Inquisitr News (@theinquisitr) October 2, 2016\n\nKatie Holmes was married to Tom Cruise from 2006 until 2012, and while the couple does have a child together, they have not appeared to have had any contact since their split, and the reason behind Cruise’s absence in Suri’s life has not been explained.\n\nAs for why Katie Holmes and Jamie Foxx continue to stay mum about their relationship, a report weeks ago claimed the former Dawson’s Creek actress was banned from going public with a new romance until 2017, five years after her divorce from Tom Cruise. According to a report by Radar Online, Katie Holmes’ divorce clause included this agreement, which granted Holmes $5 million for staying mum on her love life.\n\n“[Katie Holmes] signed a clause in her quickie divorce settlement that prevents her from embarrassing Tom in various ways, like talking about him or Scientology, or publicly dating another man for five years after the divorce,” the source claimed. “She’s allowed to date, but she cannot do so in a public fashion, and she’s not supposed to let any boyfriend near their daughter, Suri. Katie wanted out of the marriage so badly, she agreed to the terms — and got $4.8 million in child support, plus another $5 million for herself.”\n\nKatie Holmes To Return $5 Million To Tom Cruise Before Marrying Jamie Foxx? https://t.co/4YrSO9zLwR — Inquisitr News (@theinquisitr) October 8, 2016\n\nKatie Holmes and Jamie Foxx have been linked to one another for three years, and throughout their alleged romance, there have been several near-confirmations of their relationship. In addition to video of the couple dancing and a photo of them holding hands, Foxx’s friend, Claudia Jordan, formerly of The Real Housewives of Atlanta, said they were happy together during a radio interview earlier this year.\n\nKatie Holmes and Jamie Foxx are “really happy,” Jordan said. Then, a short time later, the reality star backtracked on her comments.\n\nAround the same time, Katie Holmes nearly blew her cover during a Barbra Streisand concert in New York City when she openly cheered on Foxx as he sang along with the singer. That same evening, Katie Holmes joined Foxx in his dressing room. However, due to security preventing photos at the event, no evidence of their encounter was ever shared.\n\n“[Katie Holmes and Jamie Foxx] figured it wasn’t a violation of the public rule because security prevented photos. They were so discreet,” the Radar Online source explained.\n\nMeanwhile, added the source, Tom Cruise is completely unconcerned with what Katie Holmes is doing with her life and wouldn’t mind getting his $5 million back.\n\n[Featured Image by Ilya S. Savenok/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2016/10/katie-holmes-jamie-foxx.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/3593201/katie-holmes-and-jamie-foxx-update-is-he-adopting-her-daughter-suri-cruise/", "title": "Katie Holmes And Jamie Foxx Update: Is He Adopting Her Daughter, Suri Cruise?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}