{"url": "www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-married-engaged-split/", "text": "MILEY Cyrus and Liam Hemsworth have officially called it quits.\n\nTheir split stunned fans, with many allegations leading to cheating and drug abuse - two claims which Miley has firmly denied, but what really happened? Here's what we know...\n\n5 Miley and Liam stunned fans after announcing their split Credit: Reuters\n\nWhat has Miley said about their split?\n\nOn August 10, 2019, the couple announced their split, adding that they plan on carrying on as friends and nothing more.\n\nAccording to an official statement made by Miley's rep, they parted ways to \"focus on themselves and careers\".\n\nBut just days after the shock statement was made by a rep of the former couple, photos of Miley making out with Kaitlynn Jenner surfaced online, leading fans to believe she had cheated on Liam, which ultimately led to their split.\n\n5 Miley set the record straight by voicing her frustration on matters concerning her marriage via Twitter Credit: MileyCyrus/Twitter\n\nThe allegations appeared to strike a nerve with the US pop star, who hit back on Twitter, where she said: \"I can admit to a lot of things but I refuse to admit that my marriage ended because of cheating.\n\n\"Liam and I have been together for a decade. I’ve said it before & it remains true, I love Liam and always will.\"\n\n5 Credit: MileyCyrus/Twitter\n\nMiley also slammed the criticism she was getting by tweeting: \"I can accept that the life I've chosen means I must live completely open and transparent with my fans who I love, and the public, 100% of the time.\n\n\"What I cannot accept is being told I'm lying to cover up a crime I haven't committed. I have nothing to hide.\"\n\n5 Miley Cyrus and Liam Hemsworth met on the set of 2009's The Last Song Credit: The Mega Agency\n\nWhy did Miley Cyrus and Liam Hemsworth split?\n\nOn August 13, Liam posted on Instagram: \"Just a quick note to say that Miley and I have recently separated and I wish her nothing but health and happiness going forward.\n\n\"This is a private matter and I have not made, nor will I be making, any comments to any journalists or media outlets.\n\n\"Any reported quotes attributed to me are false. Peace and Love.\"\n\nMiley's rep released a statement saying, “Ever evolving, changing as partners and individuals, they have decided this is what’s best while they both focus on themselves and careers.\n\n\"They still remain dedicated parents to all of their animals they share while lovingly taking this time apart.”\n\nHow did Miley Cyrus and Liam Hemsworth meet?\n\nMiley Cyrus, 26, had been in a relationship with Australian actor Liam Hemsworth, 28, since 2009.\n\nThe former star couple met on the set of their movie The Last Song.\n\nAt the time Liam was a virtual unknown, while Miley was a Disney pop princess.\n\n5 Apparently, there had been trouble in paradise months prior to their split Credit: PA:Press Association\n\nDid they call off their wedding?\n\nOn July 19, 2018, it was reported that Miley Cyrus and Liam Hemsworth \"called off their wedding\" as she’s \"not ready to have a baby\".\n\nAccording to OK! Australia sources, the ex Hollywood couple clashed over having children - with the Wrecking Ball singer not ready to become a mum.\n\nThe source said: \"'He wants kids and doesn't want to keep putting it off but it's not quite the timeline Miley had in mind. He is left heartbroken.\n\n\"Miley put off plans for the wedding and Liam was growing tired of it. They haven't been getting along in recent months.\"\n\nLater that day, however, Liam added a video of the pair to his Instagram story, suggesting the rumours are fake.\n\nLATEST ON MILEY 'I WAS NAIVE' Miley Cyrus’ ex Kaitlynn Carter claims she felt ‘mortified’ after their split CLOSE SHAVE Kelly Brook and Rochelle Humes among stars to give partners haircuts at home NO LOVE LOST Liam Hemsworth's brother Chris shades Miley Cyrus with dig about Malibu ‘IT F**KING HURTS' Miley Cyrus’ sister Noah says her famous singer sibling ‘f**ked her up’ CAN'T BE TAMED Miley Cyrus does boyfriend Cody Simpson’s makeup for new project ROCK N SOLE STAR Miley Cyrus to make rock album inspired by split from Liam Hemsworth\n\nOn December 24, 2018, it was revealed the couple \"wed in a secret ceremony\" at Miley’s house in Franklin, Tennessee, six years after getting engaged.\n\nMiley Cyrus was filmed dancing to Uptown Funk by Mark Ronson in her £6,800 wedding dress by Vivienne Westwood.\n\nThe couple's wedding photo was just like their first kiss on the set of The Last Song 10 years ago.\n\nTo celebrate finally tying the knot, they took the whole of Liam's family on a ski trip honeymoon to Montana.", "images": ["http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Joanne Kavanagh", "Maurice Cassidy"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-split-divorce-cheating/", "title": "Why did Miley Cyrus and Liam Hemsworth split?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Why did Miley Cyrus and Liam Hemsworth split?", "url": "https://www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-split-divorce-cheating/", "description": "MILEY Cyrus and Liam Hemsworth have officially called it quits. Their split stunned fans, with many allegations leading to cheating and drug abuse – two claims which Miley has firmly denied, …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2019-08-23T14:40:14+00:00", "modified_time": "2019-08-23T19:41:29+00:00", "publisher": 161385360554578, "tag": "Liam Hemsworth, Miley Cyrus, Celebrity relationships and break ups, Explainers", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "MILEY Cyrus and Liam Hemsworth have officially called it quits.", "keywords": "Miley Cyrus, Liam Hemsworth, married, singer, actor, actress, disney, engaged, wedding plans, split, rumours, couple, relationship, miley cyrus slide away, miley cyrus divorce, miley cyrus liam hemsworth split", "news_keywords": "Miley Cyrus, Liam Hemsworth, married, singer, actor, actress, disney, engaged, wedding plans, split, rumours, couple, relationship, miley cyrus slide away, miley cyrus divorce, miley cyrus liam hemsworth split", "twitter": {"text": {"title": "Why did Miley Cyrus and Liam Hemsworth split?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "miles apart", "headline": "Why did Miley Cyrus and Liam Hemsworth split?", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 5735247, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1566571214.0, "source": "http://www.thesun.co.uk", "summary": ""}