{"url": "www.inquisitr.com/5002947/oj-simpson-demanding-meet-khloe-kardashians-baby-true/", "text": "OJ Simpson allegedly is demanding to meet Khloe Kardashian’s new daughter with Tristan Thompson, True Thompson, per a new report by Radar Online.\n\nFor years, rumors have followed Kardashian that O.J. Simpson is her biological father. It was alleged that Kris Jenner carried on a secret affair with the former pro-football player during her marriage to Simpson’s lawyer, Robert Kardashian.\n\nJenner admitted in her book, Kris Jenner and All Things Kardashian, to an affair around the time Kardashian was conceived.\n\nSources tell Radar Online that Simpson is demanding to see his new “granddaughter.” This allegation has not been confirmed by either the Kardashian clan or Simpson himself.\n\nDuring a 2012 episode of Keeping Up with the Kardashians, Kris asked if her daughter would take a DNA test regarding her true paternity; Kardashian refused.\n\n“Seriously, my dad is Robert Kardashian. My other dad is Bruce Jenner,” Khloe reeled, continuing to her mother, “If you f***ed other people during the same time and you do not know, go on Maury!” Kim Kardashian later approached her sister and told her that their mother was upset by her reluctance to take the test.\n\nKhloe Kardashian then penned a letter to her mother which was read on the E! series.\n\n“I don’t need someone to tell me who my family is. I have had the blessing of having two phenomenal fathers. I don’t need a DNA test to prove who my father is.”\n\nRadar reported that a source at the Nevada prison where Simpson was incarcerated claims that Jenner called Simpson “at least once a week” and begged him to take a DNA test to put to rest rumors of her daughter’s paternity.\n\nFeatured image credit: Jason Bean-Pool Getty Images\n\nThe source allegedly stated, “O.J. believes now more than ever that Khloe is his daughter because True looks so much like his son Justin did when he was a baby.”\n\nOJ Simpson is a father to four children; Arnelle, 49, and Jason, 48, from his first marriage to Marguerite Whitley; and Sydney, 32, and Justin, 30, from his marriage to Nicole Brown.\n\n“Now that he’s out of prison, he wants his family around, but he really doesn’t have much family left,” the insider allegedly stated to Radar. “If True is his grandchild, then he absolutely wants to be a part of her life.”\n\nOJ Simpson was accused of murdering his wife Nicole Brown Simpson and her friend Ronald Goldman in 1994. Simpson was acquitted of both murders.\n\nSimpson was arrested in Las Vegas, Nevada, and charged with the felonies of armed robbery and kidnapping. In 2008, he was convicted and sentenced to 33 years imprisonment, with a minimum of nine years without parole. He served his sentence at the Lovelock Correctional Center near Lovelock, Nevada.\n\nSimpson was paroled from jail in October 2017.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/03/OJ-Simpson-1.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2018/07/Khloe-Kardashian-And-Tristan-Thompson-Barely-Speaking-.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/758eb8ec6d9a8c04d1d92a307699ac47?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lucille Barilla"], "canonical_link": "https://www.inquisitr.com/5002947/oj-simpson-demanding-meet-khloe-kardashians-baby-true/", "title": "OJ Simpson ‘Demanding’ To Meet Khloe Kardashian’s Baby, Per ‘Radar Online’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/K_7XJlyNRx8?feature=oembed"], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}