{"url": "www.twoeggz.com/int/6359438.html", "text": "California is “the darkest state in the Union,” according to country singer Dolly Parton, who claims that the state has been hit with a series of “Biblical disasters” in recent times as punishment for “embracing Satan and rejecting God.”\n\nParton predicted Los Angeles will suffer a similar fate to Sodom and Gomorrah, the Biblical cities synonymous with vice, darkness and impenitent sin.\n\n“California just keeps on being hit by disaster after disaster as foretold in the Bible,” the Grammy Award-winning entertainer and businesswoman told guests at Dolly Parton’s Stampede, a dinner and entertainment evening.\n\n“Pestilence, and epidemics, and crime, and disease. And you know what? They don’t even realize what is happening to them. They are so corrupted, they can’t even see what is right in front of their eyes.”\n\n“First they had the drought that lasted years and years, killing off billions and billions of dollars in crops, and making the soil so incredibly dry that a large rainstorm could easily turn into a major flood.\n\n“Then they had the fires. Awful, awful fires. Historical, deadly fires. Thousands lost their homes, scores lost their lives and their livelihoods. Did you know the Thomas fire is still burning? In the winter!“\n\n“And now they just had dozens of homes destroyed by mudslides,” Tennessee-born Parton said, making reference to the mudslides that have killed 15 people, with the toll expected to climb above 30. The mudslide hit an affluent part of California, and damaged Oprah Winfrey’s house.\n\n“When they get hit with the ‘Big One‘, Parton said, referencing the popular name for the super quake expected to rock California in the future, “then we will know that the End Times have truly begun.”\n\n“And don’t forget the sexual abuse scandals rocking Hollywood. They are being punished for embracing Satan and rejecting God.”\n\nIs California suffering from bad weather and bad luck, or is Parton right? Could a vengeful God be punishing California for decades of vice and sin?\n\nParton, who has sold more than 100 million records worldwide and been nominated for two Academy Awards, has previously stated that she considers herself an entertainer, and doesn’t believe it is her role to get involved with politics.\n\nAt last year’s Emmys, Parton was joined onstage by Lily Tomlin and Jane Fonda to present an award. Tomlin and Fonda took the opportunity to criticize President Donald Trump, but Parton refused to join in, maintaining a dignified silence.", "images": ["https://p0.ipstatp.com/large/005a58c66b250193f63b", "https://p9.pstatp.com/list/300x196/pgc-image/a4eee193debd4f8bbc0d7199c71323c5.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/44606633680442558fa238568edfd88a.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/54253ef26c024c47bb8795cf94b31b3d.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/e8d3a4845e1d4995a2976fc21d35fbc8.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/02a74e2837e44df6ab56c90c66553b89.jpg", "https://p9.pstatp.com/list/300x196/1bf70017c6116b1eee22.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/RsFXS6Q1N8GQr7.jpg", "https://p9.pstatp.com/list/300x196/dfic-imagehandler/61a1b9f7-d0dd-47a0-8a6c-3b06ededd2ba.jpg", "http://www.twoeggz.com/res/images/logo.png", "https://p9.pstatp.com/list/300x196/pgc-image/fc76bf4aae5f41b89daf44fc87876c38.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/Rt2M8NG8h06mkn.jpg", "http://www.twoeggz.com/pic/int/2018-01-13/e60e0212015a98e687bd23cc169c2e9c.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/Rt4pXe47YFFBWK.jpg"], "top_img": "http://www.twoeggz.com/pic/int/2018-01-13/e60e0212015a98e687bd23cc169c2e9c.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Dolly Parton: California’s ‘Biblical Disasters’ Punishment For ‘Embracing Satan’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=0, minimum-scale=1.0, maximum-scale=1.0", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "og": {"type": "article", "title": "Dolly Parton: California’s ‘Biblical Disasters’ Punishment For ‘Embracing Satan’", "description": "California is “the darkest state in the Union,” according to country singer Dolly Parton, who claims that the state has been hit with a series of “Biblical disa", "image": "/pic/int/2018-01-13/e60e0212015a98e687bd23cc169c2e9c.jpg"}, "keywords": "Dolly,Parton:,California’s,‘Biblical,Disasters’,Punishment,For,‘Embracing,Satan’", "description": "California is “the darkest state in the Union,” according to country singer Dolly Parton, who claims that the state has been hit with a series of “Biblical disa"}, "movies": [], "publish_date": null, "source": "http://www.twoeggz.com", "summary": ""}