{"url": "https://en.wikipedia.org/wiki/Bella_Hadid", "text": "American model\n\nIsabella Khair Hadid (born October 9, 1996)[4] is an American model. In 2016, she was voted \"Model of the Year\" by industry professionals for Model.com's Model of the Year Awards.[5]\n\nEarly life\n\nHadid was born in Washington, D.C.[6] and raised in Beverly Hills, California[6] to real-estate developer Mohamed Hadid[7][8] and former model Yolanda Hadid (née van den Herik). Her mother is Dutch, and her father is Palestinian.[9] Through her father she claims descent from Daher Al Omer, Prince of Nazareth and the Sheik of Galilee.[10][11] Hadid has two siblings, an older sister named Gigi, who is also a model, and a younger brother, Anwar. She has two older half-sisters, Marielle and Alana, from her father's side.[12]\n\nHadid and her siblings were originally raised on a ranch in Santa Barbara, California for ten years.[13] As a teenager, Hadid was an equestrian and dreamed of competing at the 2016 Rio Olympics,[14] although she competed in equitation,[15][16] which is not an Olympic discipline. She was diagnosed, along with her mother and brother, with chronic Lyme disease in 2012.[17]\n\nIn fall 2014, Hadid moved to New York City and began studying photography at the Parsons School of Design, signing to IMG shortly before. She has since dropped out of school due to the success of her modeling career, but has expressed interest in returning to school to take on fashion photography as a career once she is done modeling.[18] Hadid has also expressed interest in acting.[19]\n\nCareer\n\n2012–2014: Early work\n\nHadid began modeling at age 16 with a Flynn Skye commercial project. Hadid also starred in the \"Swan Sittings\" by Lesa Amoore, alongside actor Ben Barnes, before appearing in \"Smoking Hot\" by Holly Copeland. Hadid also modeled for Hanna Hayes' F/W 2013 collection, alongside various other commercial projects, including campaign work for Chrome Hearts during 2013 and 2014.[20][21]\n\n2014–2015: Professional rise\n\nHadid signed to IMG Models on August 21, 2014.[22]\n\nShe made her New York Fashion Week debut in the fall of 2014, walking for Desigual. In the spring fashion weeks of 2015, Hadid walked for Tom Ford in Los Angeles, and walked in the amfAR 22nd Cinema Against AIDs Gala fashion show in May. In the fall 2015 New York Fashion Week, she walked for Diane von Fürstenberg, Tommy Hilfiger, Jeremy Scott (she closed his show), and Marc Jacobs. At London Fashion Week, walked for Topshop Unique and Giles, and at Milan Fashion Week for Philipp Plein, Moschino, Missoni, and Bottega Veneta. While at Paris Fashion Week she walked for Balmain. In December 2015 she made her Chanel debut, walking for the first time in the luxury brand's Métiers d'Art show in Rome.[23]\n\nIn December 2014, Hadid made her first cover appearance on Jalouse Magazine and was featured on Day 27 of Love Magazine's Love Advent that same year.[24][25] Hadid appeared on the November 2015 cover of Seventeen and has shot editorials for magazines, including Vogue Australia and Elle.[26] She was also on the cover of Unconditional Magazine, Grey Magazine, Jalouse Magazine, V Magazine (with sister, Gigi), Editorialist, Wonderlands 10th Birthday Issue, S Moda, Evening Standard, Teen Vogue, and Twin Magazine F/W Issue.[27][28][29]\n\nHadid also featured in numerous editorials for various magazines, including Vogue Girl Japan, Harper's Bazaar, GQ, W magazine, Town and Country, Pop magazine, three for Glamour magazine, and two for Love magazine. She was also featured again in Love magazine's Love Advent Day 14 and 15 in 2015. Hadid also made an appearance in two CR Fashion Book's – \"Body Book\" and \"Fantasy Campaigns\".[30][31]\n\nHadid was one of eight young models to land Topshop's Holiday campaign and appeared in Balmain's Fall 2015 ad campaign (alongside sister Gigi), as well as starring in the Holiday campaign for Victoria's Secret's younger line, PINK, alongside spokesmodel Rachel Hilbert and Devon Windsor.[32] Hadid was also featured in the Spring 2015 ad campaign for Botkier Bags and the Fall 2015 ad campaign for Ralph Lauren Denim & Supply, as well as the campaign for Boghossian Jewels. She was also a co-star in Samsung's Fall/Winter Look Book, alongside Xiao Wen Ju, which incorporated both technology and fashion.[33]\n\n2016–2017\n\nIn January, Hadid made her Chanel Couture debut during Paris Haute Couture S/S Fashion Week.[34] She walked exclusively for Givenchy and walked for Chanel and Miu Miu at their shows in Paris Fashion Week in March 2016, as well as walking for FentyxPuma in New York Fashion Week in February 2016.[35] She also made her first Mercedes-Benz Fashion Week Australia appearance in May 2016, exclusively opening and closing the Misha Resort 2017 show.[36] Hadid walked for the amfAR 23rd Cinema Against AIDs fashion show and Dior Cruise 2017 show in London in May.[37][38] In June, she walked in the Haute Couture segment of Givenchy's Menswear S/S 2017 show during Men's Paris Fashion Week. During Paris Haute Couture F/W Fashion week she walked for both Versace, Dior, and Alexandre Vauthier, where she closed the show. Hadid also closed the show for Fendi Haute Couture in Rome later that week.[39] Hadid started off the S/S 2017 season during NYFW, opening for DKNY and walking for Michael Kors, Anna Sui, Ralph Lauren, and Marc Jacobs.[40][41] During London Fashion Week Hadid walked exclusively for Versus Versace, opening the show. The next week, in Milan, she opened for Alberta Ferretti and Fendi; as well as walking for Max Mara, Moschino, Versace, Bottega Veneta, and closing for Philosophy di Lorenzo Serafini.[42][43] On November 30, Hadid walked in the Victoria's Secret Fashion Show, wearing two looks, one from their Bright Night Angels segment and one from Secret Angels. Her Bright Night Angels look also featured a pair of wings.\n\nDuring 2016, she appeared on the covers of Seventeen Magazine Mexico, Self Service Magazine, CR Fashion Book's #CRGirs, V Magazine, Harper's Bazaar Spain, Japan, Australia, and Russia; Elle Brazil, US, UK, Thailand, Indonesia and Malaysia; Allure, Double Magazine, Glamour Germany, US, Russia, Hungary, Romania, Bulgaria, Turkey, and Iceland; Exit magazine, W magazine Korea, L'Officiel Russia, Sunday Times Style, British GQ, Flare, and Paper Magazine.[44][45][46][47][48] In May, Hadid spotlighted on her first Vogue cover for Vogue Turkey, a Vogue Me cover with Korean rapper G-Dragon in August, and received another three Vogue covers for Japan, Italia, and Paris, alongside model Taylor Hill, in September.[49][50] She had editorials in these magazines, as well as in; Glamour UK, British GQ, LOVE Club, Dazed, W Magazine, Vogue US and Paris, as well as an online editorial in Vogue for Valentine's Day. In May, Hadid made her first short film appearance of the year, starring in Tyer Ford's film, Private.[51] Hadid was also the star of LOVE Advent's calendar for Day 1 in a segment entitled \"Aerobics\".[52]\n\nHadid was also featured in the \"My America\" campaign by Marc Jacobs, TopShop's Denim Campaign for Summer 2016, starred in Joe's Jeans 2016 campaign, and Misha Collection's Resort and Misha Gold campaign.[36][53][54] Alongside Frank Ocean, Kate Moss, and others, she was featured in the Calvin Klein F/W 2016 global campaign. She starred in J.W Anderson's Fall/Winter campaign.[55] Hadid was also featured in Givenchy F/W 2016 campaign and in the brands' Resort 2017 line.[56]\n\nOn May 31, it was announced that Hadid is the new ambassador of Dior Makeup and would be starring in a new web series from the fashion house called Dior Makeup Live with Bella Hadid starting in June, and did a tutorial using their makeup for Vogue US's YouTube channel in August.[38] Hadid's first collaboration was announced on December 13. She partnered up with her best friend's, Jesse Jo Stark, family's brand, Chrome Hearts.[57] Hadid also shot her first campaign with the brand, just after turning 16 years old, and recently played the role of photographer for the Stark family for W Magazine back in August.[58][59] The date the collection she co-designed will be coming out is yet to be announced.\n\nIn March 2016, Hadid won Model of the Year at the Daily Front Row's Fashion Los Angeles Awards.[60] In June 2016, Hadid was ranked among Models.com's Top 50 Models list. In September 2016, she won Model of the Year at the GQ Men of the Year Awards in London.[61] In December, Models.com nominated Hadid for their Reader's Choice awards; for both Model of the Year and Social Media Star of the Year. She won Model of the Year Women from the Industry's vote.[62]\n\nIn January 2017, Hadid walked in Givenchy's S/S 2017 Haute Couture segment during their F/W Menswear Fashion Show in Paris.[63] During Haute Couture S/S week, she also walked for Chanel and opened Alexandre Vauthier. In February, she walked in her sister, Gigi's, Tommy Hilfiger collaboration \"TommyxGigi\" in Los Angeles and in Paris she closed the H&M Studio show, both last minute additions to the S/S 2017 season.[64] To start off the F/W 2017 season, Hadid walked for Alexander Wang, Sies Marjan, Carolina Herrera, Brandom Maxwell, Michael Kors, Anna Sue, Ralph Lauren; and opened for Prabal Gurung and Zadig et Voltaire; and closed for Oscar de la Renta, during NYFW.[65][66][67] During London Fashion Week, she was exclusive at Versace Versus, where she opened the show.[68] In Milan she walked for Alberta Feretti, Fendi, Moschino, and Versace. To close out the F/W 2017 RTW season, in Paris, she walked for Lanvin, Chanel, and opened Off-White. Hadid also starred in Alexandre Vauthier's F/W 2017 look book, in place of a runway show. While in Cannes, France for the 70th Annual Film Festival, she walked for Naomi Campbell's Fashion for Relief and the amfAR Gala's charity walks.[69][70] For the F/W 2017 Haute Coutre week, she walked for Miu Miu Resort, Maison Margiela, Fendi, and opened for Alexandre Vauthier.[71]\n\nHadid's first cover of the year was for the January issue of W Magazine Korea, a reprint of her W editorial from the US editions \"Royals Issue\".[72] Her first new cover of the year was for the recently rebranded Teen Vogue, Hadid starred on one of the Volume 1 covers with best friend, Jesse Jo Stark. Her first standard issue vogue cover was for the year was for Vogue China in April, appearing on their cover again in September, and another in June for Vogue Italia.[73][74][75][76] In September, Hadid topped her numbers from the year prior with Elle Russia, Harper's Bazaar China, and by breaking the record for most Vogue September covers in one year (formerly kept by Doutzen Kroes in 2013 and Linda Evangelista in 1993).[77][78][79] Hadid snagged the cover of five international editions of the fashion magazine; China, Spain, Brazil, Australia, and Arabia—also making Hadid newly launched Vogue Arabia's first September cover star—in the month. She also appeared on the cover of CR Fashion Book, Grazia Italia, Sunday Times Style, Porter Magazine; ELLE US, Russia, and France; InStyle, 032c, and was one of the covers for the first issue of Super ELLE China.[80] In 2017, she also had editorials in Vogue Paris, LOVE Magazine, V Magazine, and Dazed Magazine.[81]\n\nHadid and her sister, Gigi, started off the S/S campaign season together - starring alongside one another in both that seasons Fendi and Moschino campaigns.[82] Along with shooting a campaign with her sister, Hadid also shot a campaign for Zadig & Voltaire with her younger brother, Anwar. Hadid also starred solo in the DKNY, TAG Heuer, and Boghossian Jewels Les Merveilles S/S 2017 campaigns.[83][84][85] Hadid also starred in both Ochirly's Spring and Summer campaigns and in the ZaynxVersus capsule collection campaign. She starred in her first beauty campaign in S/S 2017 for Dior Makeup's \"Pump N' Volume\" mascara.[86] After being declared one of their Nike: NY Made ambassadors in 2016, Hadid starred in her first campaign with Nike for their OG Cortez sneaker.[87] As ambassador of the brand's accessories line, Hadid starred as the face of Bulari's Goldea Roman Night fragrance and F/W 2017 Serpiniti collection campaign.[88][89] Hadid starred in a second accessories campaign for Max Mara and in Penshoppe's \"Generation\" campaign.[90] Also in the F/W 2017 season, Hadid starred alongside Miles McMillan in Giuseppe Zanotti, Justin Grossman in NARS Cosmetics, and Kendall Jenner in Ochirly's Fall campaign.[91][92]\n\nAs ambassador of Dior Beauty, Hadid also starred in a series of videos entitled \"Dior Makeup with Bella Hadid\" throughout the year; these videos had begun in December 2016. On February 8, Hadid was announced the new ambassador for Bulgari's accessory lines and, on February 13, she was announced the new face and ambassador of TAG Heuer.[93][94]\n\nPersonal life\n\nLegal\n\nOn July 22, 2014, Hadid was arrested and charged with a DUI.[95] Her driver's license was suspended for one year and she was given six months of probation.[96] Hadid was also ordered to perform 25 hours of community service and attend 20 hours of Alcoholics Anonymous meetings.[97]\n\nRelationships\n\nHadid began dating Canadian singer The Weeknd at the beginning of 2015; the couple were first seen together in April at Coachella.[98][99] Hadid starred in his music video \"In the Night\" in December 2015. They made their red carpet appearance as a couple at the 2016 Grammys in February.[100] In November 2016, the couple reportedly broke up because their schedules were too conflicting.[101] However, they got back together in 2018,[102] and split once again in 2019.[103]\n\nReligion and politics\n\nIn 2016, Hadid donated a pair of denim jeans to Johny Dar's Jeans for Refugees project, which were to be hand painted and auctioned off in order to raise money for the International Rescue Committee.[104]\n\nIn January 2017, Hadid attended the \"No Ban, No Wall\" march in New York City, saying in an interview it was her own family history that drove her to participate in the march: \"I come from a really diverse background. I've had incredible experiences all over the world… and I've learned that we're all just people, and we all deserve respect and kindness. We shouldn't treat people as if they don't deserve kindness just because of their ethnicities. It's just not right.\"[105]\n\nHadid has said she is \"proud to be a Muslim\"[106][107] while reflecting on her father's history as a refugee, practicing Islam, and successful U.S. businessman when discussing her opposition to President Trump's immigration policies.[108] On December 8, 2017, Hadid joined London protests against Trump's decision to move the U.S. embassy in Israel and recognize Jerusalem as the capital of Israel.[citation needed]\n\nAwards and nominations\n\nFilmography\n\nTelevision\n\nAppearances Show Name Role 1 Keeping Up With the Kardashians As herself 3 Real Housewives of Beverly Hills 1 Making a Model with Yolanda Hadid\n\nShort films\n\nYear Film Title Production Role 2015 Bella Hadid's Guide to LA i-D Herself 2016 Private Tyler Ford Unnamed/Herself 2017 Going Home with Bella Hadid W Magazine Herself\n\nDior Beauty with Bella Hadid\n\nYear Film Title Description 2016 \"The Backstage\" Behind the scenes of Dior Cruise F/W16 fashion show, with Peter Phillips.[114] \"The Date\" Rouge Dior social media advertisement.[115] \"The Party\" Hadid shows her guide for a night out.[116] 2017 \"The Elevator\" Diorskin Forever Perfect Cushion social media advertisement.[117] \"The Makeup Talk\" Dior S/S17 Colour Gradient collection tutorial, with Peter Phillips.[118] \"The Call Time\" Backstage Pros social media advertisement.[119] \"The Diner\" Dior Addict Lacquer lipstick social media advertisement.[120] \"The Tattoo\" Dior Addict Lip Tattoo social media advertisement.[121]\n\nMusic videos\n\nYear Artist Title 2014 Jesse Jo Stark Down Your Drain[122] Jesse Jo Stark Baby Love 2015 The Weeknd In the Night[123] Belly ft. The Weeknd Might Not (featured)", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Bella_Hadid_Cannes_2018_2.jpg/220px-Bella_Hadid_Cannes_2018_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/3a/Bella_Hadid_Cannes_2018_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/24px-Flag_of_New_York_City.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Bella_Hadid_Met_Gala_2017.jpg/220px-Bella_Hadid_Met_Gala_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg/170px-AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/24px-BathingSuit1920s.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/LA_Skyline_Mountains2.jpg/24px-LA_Skyline_Mountains2.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Bella_Hadid_Cannes_2018_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bella_Hadid", "title": "Bella Hadid", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Bella_Hadid_Cannes_2018_2.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}