{"url": "https://en.wikipedia.org/wiki/Harry_Hamlin", "text": "American actor\n\nHarry Robinson Hamlin (born October 30, 1951) is an American actor, author, and entrepreneur. Hamlin is known for his roles as Perseus in the 1981 fantasy film Clash of the Titans and as Michael Kuzak in the legal drama series L.A. Law, for which he received three Golden Globe nominations.[1][2] For his recurring role on the AMC drama series Mad Men, Hamlin received a Primetime Emmy nomination for Outstanding Guest Actor in a Drama Series.\n\nEarly life [ edit ]\n\nHamlin was born October 30, 1951, in Pasadena, California, the son of Bernice (née Robinson), a socialite, and Chauncey Jerome Hamlin, Jr., an aeronautical engineer.[3][4][5] As a teenager, he attended Flintridge Preparatory School, near Pasadena, and The Hill School, a private boarding school in Pottstown, Pennsylvania, where he played soccer and lacrosse and acted in the school's musicals and plays. He also attended classes at the Pacific Conservatory of the Performing Arts. Hamlin attended University of California, Berkeley, and is an alumnus of the Theta Zeta chapter of the national fraternity Delta Kappa Epsilon, of which he was president in 1972.\n\nHamlin was graduated from Yale University in 1974 with dual Bachelor of Arts degrees in drama and psychology. Hamlin then attended the American Conservatory Theater's advanced actor training program from which he was awarded a Master of Fine Arts degree in acting in 1976.[5] There, Hamlin starred in a production of Equus, attracting the attention of director Stanley Donen.[6]\n\nCareer [ edit ]\n\nFilm and television [ edit ]\n\nHamlin appeared in the 1976 television production of Taming of the Shrew and also had the title role in the 1979 television miniseries Studs Lonigan. He starred in Movie Movie with George C. Scott in 1978, for which he received his first Golden Globe Award nomination.[7] His big-screen break was a starring role in the 1981 Greek mythology fantasy epic Clash of the Titans.[6] Afterwards, his career faltered somewhat[8] with such controversial films as Making Love in 1982 (the first gay themed love story to be produced by a major studio, Twentieth Century Fox)[9] and Blue Skies Again (1983).[10] He returned to television appearing in the miniseries Master of the Game (based on the novel by Sidney Sheldon) in 1984 and Space (based on the novel by James A. Michener) in 1985.\n\nHamlin appeared on the NBC legal drama series L.A. Law, playing attorney Michael Kuzak. He remained on the series from 1986 to 1991 during which time he was voted People magazine's \"Sexiest Man Alive\" in 1987.[10] Hamlin left the series at the end of the fifth season having been nominated three times for Best Actor in a television series by the Hollywood Foreign Press Association.[11]\n\nIn early 1991 Hamlin appeared in the music video and sang in the choir on the song \"Voices That Care\" which was made in support of U.S. troops who were stationed in the Middle East and involved at that time in Operation Desert Storm.[12] He then appeared in two 1992 episodes of Batman: The Animated Series, in each episode as a separate character. In the episode \"Joker's Wild\", Hamlin played the role of Cameron Kaiser, a ruthless businessman who sinks all his money into a casino, then counts on the Joker to destroy it in order to collect on the insurance policy from a reputable company, and in the other episode, \"Moon of the Wolf\", he provided the voice of Anthony Romulus, a greedy athlete who takes a potion to enhance his skills, only to realize too late that it has transformed him into a werewolf. In 1995, he participated in the documentary film, The Celluloid Closet where he discussed his role in the film Making Love.[13]\n\nIn 2001, he starred in the television comedy Bratty Babies, and in 2002 he reprised the role of Michael Kuzak in an L.A. Law reunion television movie.\n\nIn 2004, Hamlin began a recurring role on the television series Veronica Mars.[14] He played fading action hero Aaron Echolls, father to central show character Logan Echolls who had a turbulent relationship with him. Hamlin's character states that he (like the real-life Hamlin) was People magazine's 'Sexiest Man Alive' in 1987.[15][16] Aaron's wife, Lynn, was played by Hamlin's real-life wife, Lisa Rinna. Hamlin appeared beginning in the sixth episode of the first season, \"Return of the Kane\", and made his last appearance in the second season finale, \"Not Pictured\". In 2006, Hamlin took part in the third season of Dancing with the Stars with Ashly DelGrosso, but was voted off the show in the third week.[17]\n\nIn 2009, Hamlin starred in the series Harper's Island as Uncle Marty. He was killed abruptly in the first episode by being cut in half while he dangled from a broken wooden bridge.\n\nIn June 2010, Hamlin guest-starred in an episode of Army Wives and then became a recurring cast member.[18]\n\nIn June 2010, Hamlin starred in the Hallmark Channel movie You Lucky Dog.[19]\n\nOn December 4, 2008, TV Guide reported that Hamlin and Rinna signed a deal to create a reality television series[20] called Harry Loves Lisa that is based around their family life. The series was developed by TV Land and premiered on October 6, 2010.\n\nIn 2012, Hamlin began playing Lloyd Lishman, an older lover to Ian Gallagher (Cameron Monaghan) on the U.S version of Shameless (7 episodes circa the end of Season 3). Hamlin appeared in an adult diaper commercial with his wife during a primetime television program.[21]\n\nBeginning on April 28, 2013, Hamlin appeared in several episodes of season six (1968) of Mad Men as ad executive Jim Cutler after the merger of Sterling Cooper Draper Pryce and Cutler Gleason and Chaough. Hamlin was nominated for a 2013 Primetime Emmy Award for Outstanding Guest Actor in a Drama Series for his appearance in \"A Tale of Two Cities.\"\n\nIn 2016, Hamlin was cast in the EPIX comedy Graves[22] starring Nick Nolte, and in 2017, Hamlin was cast as Addison Hayes, a mysterious and powerful mastermind whose agenda will collide with Swagger in the new USA Network show Shooter.[23]\n\nStage [ edit ]\n\nHamlin made his Broadway debut in 1982 playing Moe Axelrod opposite Frances McDormand in the Broadway revival of Clifford Odets' Awake and Sing!.[24]\n\nAn avid Shakespearean actor, Hamlin played the title role in Hamlet at the famed McCarter Theater in Princeton, New Jersey, where he would go on to play Faust in Dr. Faustus the following year.[25]\n\nIn 1994, Hamlin received a Helen Hayes Award Nomination for his portrayal of Henry V, in the play of the same name, at the prestigious Shakespeare Theater Company in Washington, DC.[26]\n\nIn 1996, Hamlin returned to Broadway as Michael Buchanan in Tennessee Williams' Summer and Smoke at the Roundabout Theater.[27]\n\nVideo games [ edit ]\n\nHamlin reprised the role of Perseus in the 2007 video game God of War II. In the game, Perseus was trapped in a room while searching for the Sisters of Fate to revive his dead lover, and believes Kratos to be sent by the gods to test him.\n\nBooks [ edit ]\n\nIn 2010, Hamlin authored Full Frontal Nudity: The Making of an Accidental Actor, published by Scribner, wherein he shares stories of his career as an actor. (ISBN 1-4391-6999-3)[3][28]\n\nFusion power [ edit ]\n\nHamlin is an advocate for fusion power[29] and was an angel investor and co-founder of TAE Technologies,[30][31] formerly known as Tri Alpha Energy. TAE Technologies states that it is in the final stages of the research and development of a clean, non-radioactive fusion power generator.[32]\n\nHamlin delivered a talk on Fusion at the TEDX LA conference in 2016 entitled, \"You Don't Have To Be A Rocket Scientist To Be A Futurist!\"[33] Hamlin was also a board member of Advanced Physics Corporation.[34][35]\n\nHamlin with then-wife, Laura Johnson at the 1987 Emmy Awards.\n\nHamlin is also on the Board of Governors of the National Space Society.[36]\n\nPersonal life [ edit ]\n\nHamlin was in a four-year relationship with Swiss actress and original \"Bond Girl\" Ursula Andress, his co-star in the film Clash of the Titans, from 1979 to 1983.[12] In 1980 Hamlin had a son with Andress named Dimitri Alexander Hamlin.[37] From 1985 to 1989 he was married to actress Laura Johnson and between 1991 and 1992, to actress Nicollette Sheridan.[38][39]\n\nSince 1997 Hamlin has been married to former Days of Our Lives actress and television host Lisa Rinna. They have two daughters, Delilah Belle Hamlin[40] and Amelia Gray Hamlin,[41] who both featured in the reality show Harry Loves Lisa with the couple. The couple also starred in the first season of Veronica Mars as Aaron and Lynn Echolls, a married couple. They also starred as a married couple in the 2001 Lifetime Movie Sex, Lies, and Obsession.\n\nHamlin's wives have each been prominent prime time soap-opera actresses: Rinna starred on Melrose Place,[42] Sheridan was a regular on Knots Landing, Desperate Housewives, and the Dynasty reboot. Johnson was a regular on Falcon Crest (on which Andress later made guest appearances).\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nYear Title Role Notes 2007 God of War II Perseus", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/P_culture.svg/23px-P_culture.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Wikiversity-logo-en.svg/27px-Wikiversity-logo-en.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Flag_of_California.svg/24px-Flag_of_California.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Harry_Hamlin.jpg/220px-Harry_Hamlin.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/27px-Wiktionary-logo-v2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/e/e5/Harry_Hamlin.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Harry_Hamlin%2C_Laura_Johnson_%282091210429%29.jpg/220px-Harry_Hamlin%2C_Laura_Johnson_%282091210429%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Harry_Hamlin.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Harry_Hamlin", "title": "Harry Hamlin", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Harry_Hamlin.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}