{"url": "https://countryfancast.com/thomas-rhett-adoption-process/", "text": "Country artist Thomas Rhett and wife Lauren Akins had a year full of blessings, including officially getting to call Willa Gray their daughter. More here!\n\nLife just one year ago was a lot different for country music star Thomas Rhett and his wife Lauren Akins. The couple had no children— but that was all about to change when they would welcome their first daughter, Willa Gray, home from Uganda in May.\n\nHaving children is something the couple has dreamed about and asked God for and now that their dreams are coming true they take every minute to gush about their two bundles of joy. On the 2018 Grammy Awards Red Carpet the two couldn’t stop talking about their girls with E! News!\n\nThomas Rhett said that it has been “amazing” to watch Willa be a big sister to newborn Ada James.\n\n“She was jealous at first I think, but it’s so fun to watch her,” Thomas Rhett said. “She loves our little Ada so much.”\n\n“It’s something we just hoped for for so long,” Lauren spoke of her eldest daughter. “She was very fresh off just coming to America, so it was something that we really wanted her to feel comfortable.”\n\nWilla has become more comfortable with her little sister for sure! The video of the two of them meeting for the first time is heartbreakingly adorable!\n\n“I think I was more nervous that she just wouldn’t feel comfortable but the second I was like, ‘Do you wanna give her a kiss?’ and she leaned over and kissed [Ada], I was like, ‘Thank you God,’” Lauren added on the 2018 Grammy Awards Red Carpet. “It couldn’t be sweeter.”\n\nHaving Willa become an official member of the family wasn’t easy though. TR and Lauren also opened up about the emotional aspect it took to officially call her their daughter.\n\n“It is definitely the hardest thing we’ve ever been through,” Lauren shared with E! News. “But I think it needs to be hard because you have to fight for that baby just like you do. I’ve done both now — I’ve had one biological and I’ve had one through adoption. It’s a battle to bring your child home. And it just strengthens you as parents and as a team. It is hard but it’s so worth it.”\n\nSince Willa Gray has been home the whole Akins clan has just been enjoying life together and accomplishing many milestones. From Willa Gray’s first birthday with her family to Christmas as a family of four, they’ve done it all and with big smiles on their faces!\n\nFor more Akins family updates keep up with Country Fancast!", "images": ["https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=SX5zm1akGFL170", "https://cdn.mobsocmedia.com/uploads/sites/49/20180205172247/thomas-rhett-adoption-.jpg", "https://cdn.mobsocmedia.com/wp-content/themes/mobsoc-media-grid/assets/img/ajax-loader.gif?9f0db8", "https://www.facebook.com/tr?id=1034239779997311&ev=PageView&noscript=1", "http://b.scorecardresearch.com/p?c1=2&c2=22014649&cv=2.0&cj=1"], "top_img": "https://cdn.mobsocmedia.com/uploads/sites/49/20180205172247/thomas-rhett-adoption-.jpg", "keywords": [], "authors": [], "canonical_link": "https://countryfancast.com/thomas-rhett-adoption-process/", "title": "Thomas Rhett & Wife Open Up About Turbulent Adoption Process", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1", "description": "Country artist Thomas Rhett and wife Lauren Akins had a year full of blessings, including officially getting to call Willa Gray their daughter. More here!", "news_keywords": "thomas rhett adoption, thomas rhett lauren akins adoption, thomas rhett adopted daughter, thomas rhett lauren akins, thomas rhett daughters, thomas rhett family, thomas rhett wife, lauren akins, thomas rhett, entertainment, music, country music", "robots": "noodp", "fragment": "!", "og": {"url": "https://countryfancast.com/thomas-rhett-adoption-process/", "title": "Thomas Rhett & Wife Open Up About Turbulent Adoption Process", "description": "Country artist Thomas Rhett and wife Lauren Akins had a year full of blessings, including officially getting to call Willa Gray their...", "type": "article", "image": {"identifier": "https://cdn.mobsocmedia.com/uploads/sites/49/20180205172247/thomas-rhett-adoption-.jpg", "width": 1248, "height": 792}}, "fb": {"app_id": 284951345010990}, "twitter": {"card": "summary", "title": "Thomas Rhett & Wife Open Up About Turbulent Adoption Process", "description": "Country artist Thomas Rhett and wife Lauren Akins had a year full of blessings, including officially getting to call Willa Gray their...", "image": {"src": "https://cdn.mobsocmedia.com/uploads/sites/49/20180205172247/thomas-rhett-adoption-.jpg"}, "url": "https://countryfancast.com/thomas-rhett-adoption-process/"}}, "movies": [], "publish_date": 1517851844.0, "source": "https://countryfancast.com", "summary": ""}