{"url": "https://www.patheos.com/blogs/raindevil/2016/07/fighting-the-good-fight-but-at-what-cost/", "text": "I had a panic attack the other day at work. When I felt the panic start, I grabbed my things and went straight to the toilet and sat hyperventilating on the floor. I didn’t leave that room for about 40 mins. It was horrible. It was brought on by a day that ended up being more stressful than I anticipated.\n\nIt was a day I had been looking forward to because I was attending a meeting related to Inclusion and Diversity at work, and in those meetings I often feel safer than I do in any other meeting. However, as the meeting went on, I realised that just because I am in a meeting related to inclusion, doesn’t mean that I will feel completely welcome or accepted. There was one person in particular that responded to me in a way that made me feel more unwelcome than the others.\n\nI feel like I have to stand up for injustice and unfairness at work and in daily life. I feel like I have to be the one to say, this is not right and why should we put up with this unacceptable behaviour anymore? The problem is, I am just not resilient enough to cope with it all yet. I struggle to be one of the only voices in the room stating that something is unfair. I am struggling to be the one that is constantly challenging the norm and then being challenged for highlighting what is unfair.\n\nWhat everyone needs to keep in mind when it comes to promoting Inclusion and Diversity, is that often those that volunteer their time to support initiatives supporting inclusion, are doing it because they have gone through something themselves. Those volunteers know what it is like to be treated differently and have lived through adversity.\n\nLeaders within an organisation have to recognise that the volunteers who care about inclusion and diversity are often from a vulnerable minority group, despite what they can see on the surface. People may look at me and see a confident young white woman with her career before her (I hope I do, although I fear I may have stunted my career due to my involvement in Inclusion and Diversity) and they potentially think that I am simply an advocate for diversity as a young white woman I can’t possibly have had to deal with any issues? Could I?\n\nWhat people do not see is that on a daily basis I am battling with mental health issues that I have had to manage for the past 10 years. According to some, I would be considered disabled. I admit that my issues have occasionally held me back and prevent me from living the way others do. I am probably still in denial that I am disabled, so I will discuss this another day when I can face it and share it with you. All you need to know for now is that I have an anxiety disorder that sometimes prevents me from living a completely free and relaxed life.\n\nAs a woman, I have to deal with daily micro aggressions, as people are now calling them, which are seemingly banal issues but if you pile them up over time have a huge impact on women. For example, at work I am constantly talked over, or what I am said is heard, but then repeated by a man, who then gets acknowledged for it, I have to put up with regular mansplaining, when men feel that they need to tell me what to do and tell me in an incredibly patronising way how I should do something. Outside of work, I have to put up with regular harassment in the streets, men heckling me with inappropriate comments, which causes me considerable amounts of anxiety, as said in another post.\n\nLeaders and managers have an obligation to support those that speak up in the work place, whether they agree or not with the statement or whether or not they think someone is speaking from experience or not, as it takes great courage to say the unpopular thing. Often those that do speak up, have a traumatic history that they do not want others to experience. Also, leaders have to appreciate that it will come at a great cost for those volunteers to speak up, as often those who speak up will see their career progression suffer as a result or will experience mental health issues due to the stress of going against the grain. In my case, my mental health has worsened as a result of standing up.\n\nI am going on about leaders because the other day, I was not supported by a leader when I rightly spoke up about something that was clearly wrong. I don’t want to go into the details, but I was really shaken by it. I felt let down by someone who I thought was supportive. I felt quite deflated by the situation and feel I have lost an ally.\n\nI may have never had the ally to begin with. This person perhaps never saw the need to support me. Would they see the need if I gave them an explanation of what I have seen? I am not sure. I like to think they would. The fact is, I can’t and shouldn’t always explain that I am a member of a vulnerable group and therefore should be treated with more respect or treated more carefully than others. We should treat everyone with respect. We should treat everyone with kindness. We should be listening to everyone without judgement or bias.\n\nI live in a world of shoulds and it is tiring me out. I need to stop thinking about the shoulds and just accept reality for what it is. If I can accept that I will probably always be the one speaking up, the one saying the unpopular thing, then I will learn to be more resilient. I will learn to be ready for adversity. I won’t be on the defensive, I will just be prepared to feel alone in a room full of people.\n\nPrepared to be the target and prepared to be the fighter.", "images": ["https://www.patheos.com/~/media/images/components/navigation/patheos/patheos-logo-header.png", "https://wp-media.patheos.com/subdomain/sites/8/2020/04/SpellStimulusMoney-350x350.png", "https://wp-media.patheos.com/blogs/sites/1122/2020/04/header-10-350x350.jpg", "https://wp-media.patheos.com/blogs/sites/410/2020/04/cuomo1-350x350.png", "https://wp-media.patheos.com/blogs/sites/1299/2020/04/Screenshot-2020-04-17-at-12.54.12-300x300.png", "https://wp-media.patheos.com/blogs/sites/944/2020/04/Bible-Pew-swear-SM-150x150.jpg", "https://wp-media.patheos.com/blogs/sites/561/2020/02/24822522402_f572c4ed75_b-350x350.jpg", "https://wp-media.patheos.com/blogs/sites/563/2020/04/pope-350x350.jpg", "https://wp-media.patheos.com/blogs/sites/672/2016/07/Screen-Shot-2016-07-03-at-9.51.41-pm.png", "https://wp-media.patheos.com/blogs/sites/577/2016/02/RickWiles550.jpg", "https://wp-media.patheos.com/blogs/sites/577/2018/04/CohenTrump.jpg", "https://wp-media.patheos.com/blogs/sites/672/2016/07/IMG_4889-e1468353973607-150x150.jpg", "https://wp-media.patheos.com/blogs/sites/672/2017/10/IMG_9473-350x350.jpg", "https://wp-media.patheos.com/blogs/sites/672/2017/08/samantha-sophia-34200-350x350.jpg", "https://wp-media.patheos.com/blogs/sites/563/2020/04/Trump-150x150.jpg", "https://wp-media.patheos.com/blogs/sites/672/2017/02/Screen-Shot-2017-02-19-at-8.29.09-pm-150x150.png", "https://media.patheos.com/~/media/patheos-images/wordpress/writer-themes/raindevil/raindevil-theme-logo.png", "https://wp-media.patheos.com/blogs/sites/71/2019/08/antisemite.png", "https://wp-media.patheos.com/blogs/sites/672/2016/07/Screen-Shot-2016-07-02-at-5.07.55-pm-150x150.png", "https://wp-media.patheos.com/blogs/sites/541/2020/04/versailles-mirrors-150x150.jpg", "https://wp-media.patheos.com/blogs/sites/672/2017/02/Screen-Shot-2017-02-02-at-8.49.41-pm-150x150.png"], "top_img": "https://wp-media.patheos.com/blogs/sites/672/2016/07/Screen-Shot-2016-07-03-at-9.51.41-pm.png", "keywords": [], "authors": ["Praying For Rain", "Dancing With The Devil", "Dancing Devil"], "canonical_link": "https://www.patheos.com/blogs/raindevil/2016/07/fighting-the-good-fight-but-at-what-cost/", "title": "Fighting the Good Fight, But at What Cost?", "meta_data": {"referrer": "origin", "viewport": "width=device-width, initial-scale=1", "description": "The fight for fairness can be all too much.   I had a panic attack the other day at work. When I felt the panic start, I grabbed my things and went straight to the toilet and sat hyperventilating on the floor. I didn't leave that room for about 40 mins.  It was horrible. It was brought on by a day that ended up", "og": {"locale": "en_US", "type": "article", "title": "Fighting the Good Fight, But at What Cost?", "description": "The fight for fairness can be all too much.   I had a panic attack the other day at work. When I felt the panic start, I grabbed my things and went straight to the toilet and sat hyperventilating on the floor. I didn't leave that room for about 40 mins.  It was horrible. It was brought on by a day that ended up", "url": "https://www.patheos.com/blogs/raindevil/2016/07/fighting-the-good-fight-but-at-what-cost/", "site_name": "Praying for Rain and Dancing with the Devil", "updated_time": "2017-01-18T21:58:21+00:00", "image": "https://wp-media.patheos.com/blogs/sites/672/2016/07/Screen-Shot-2016-07-03-at-9.51.41-pm-768x511.png"}, "article": {"tag": "missionary kid", "section": "mental health", "published_time": "2016-07-04T21:18:56+00:00", "modified_time": "2017-01-18T21:58:21+00:00", "publisher": "http://www.facebook.com/PatheosAtheist", "author": "http://www.facebook.com/PatheosAtheist"}, "twitter": {"card": "summary", "description": "The fight for fairness can be all too much.   I had a panic attack the other day at work. When I felt the panic start, I grabbed my things and went [...]", "title": "Fighting the Good Fight, But at What Cost?", "image": "https://wp-media.patheos.com/blogs/sites/672/2016/07/Screen-Shot-2016-07-03-at-9.51.41-pm.png", "site": "@PatheosAtheist", "creator": "@PatheosAtheist", "url": "https://www.patheos.com/blogs/raindevil/2016/07/fighting-the-good-fight-but-at-what-cost/"}, "generator": "WordPress 4.9.2", "msapplication-TileColor": "#00aba9", "msapplication-TileImage": "https://www.patheos.com/blogs/wp-content/themes/Patheos%20TwentySeventeen/assets/images/favicons/mstile-150x150.png?v=00rbb46rd6", "theme-color": "#ffffff", "mobile-web-app-capable": "yes", "keywords": "Praying for Rain and Dancing with the Devil, mental health, Tales of Dancing with the Devil, atheism, atheist, discrimination, diversity, equality, fairness, god, godless, goodbye god, humanism, inclusion, jesus, missionary kid", "author": "Praying for Rain and Dancing with the Devil", "audience": "false", "shareaholic": {"site_id": "94e5dad2c639bd5ca382d31daef04419"}}, "movies": [], "publish_date": 1467667136.0, "source": "https://www.patheos.com", "summary": ""}