{"url": "https://web.archive.org/web/20100125035945/http://republicanleader.house.gov:80/News/DocumentSingle.aspx?DocumentID=167478", "text": "PWNED: House GOP Dominates Twitter, YouTube, Social Media in Congress\n\nDemocrats Innovate by Finding New Places to Ignore the Will of the America People\n\n\n\nWashington, Jan 22 - The conventional wisdom is being turned upside down as House Republicans demonstrate an unmatched ability to connect with the American people on the Internet’s most popular communities. Once considered the party of online innovation, new research and a host of media reports show that Democrats are largely ignoring some of the most popular social media communities on the web. Recent data shows that nearly 50 percent of adults are active on social networks, nearly two-thirds watch online videos on sites such as YouTube, while over seven million people have joined the fastest-growing online member community, Twitter. Apparently no one has faxed that data to congressional Democrats, however, as the vast majority has yet to incorporate many of these popular technologies into their day-to-day communications. Meanwhile, House Republicans, seeing a unique opportunity to communicate directly with the American people without the traditional media filters of the past, are busy forging new connections with their constituents online. A recently-released report, Twongress: The Power of Twitter in Congress shows us the most glaring example of this party disparity:\n\n\n\n“More Republicans Use Twitter Than Democrats - In Congress, there are 132 members who are using Twitter actively: 89 Republicans and 43 Democrats..in the House, there are 75 Republicans using Twitter (42.13 percent of the Republican Caucus) and 32 Democrats (12.45 percent of the Democratic Caucus).\"\n\nBut Twitter isn’t the only online community dominated by Republicans. Even as they find themselves in a 40 seat minority, House Republicans’ videos consistently outperform those of their counterparts on YouTube. The below chart, provided by industry analyst TubeMogul, illustrates this significant gap:\n\n\n\n\n\n\n\nCongressional Democrats’ constituents aren’t the only ones that can’t find them online. The national media continues to chronicle the Republican advantage and the Democrats’ lack of interest in social media:\n\n\n\nOn Twitter:\n\n\n\n• “The Republican leadership in the House is both aggressive and popular on Twitter. The party’s top two members in the House - John A. Boehner of Ohio and Eric Cantor of Virginia, respectively - have the most followed Twitter accounts in the chamber. Mr. Boehner and the No. 3 Republican in the House, Mike Pence of Indiana, had also combined to send out more than 3,000 Tweets .” (\n\n\n\n• “A report on lawmakers’ use of Twitter is out today and the results may surprise. ‘Twongress: The Power of Twitter in Congress’ by Mark Senak, a Democrat, finds that as of this month, Republican House members have sent out 529% more tweets than their Democratic counterparts . Notable tweeters include Arizona GOP Sen. John McCain, who has the most followers of any senator, and House Minority Leader John Boehner, who has the most followers compared to his GOP colleagues.” (\n\n\n\n• “ Though Barack Obama commanded the new media landscape during his 2008 presidential campaign, House Republicans in particular have been texting circles around the Democrats …The study found that of the 132 congressional lawmakers using Twitter, 89 are Republicans and 43 are Democrats. Only slightly more Republicans in the Senate used Twitter, but in the House, 75 Republicans count themselves as part of the Twitter scene, compared with 32 Democrats. Those Republicans on Twitter also are using it far more enough than Democrats. In the House, Republicans dominate the list of most-followed politicians.” (\n\n\n\n• “ GOP members of Congress have more than twice as many Twitter followers than their Democratic counterparts and tweet five times more often . Minority Leader John Boehner may look like a character from Mad Men, but the Don Draper of the House has a ‘director of new media…” (\n\n\n\nOn YouTube:\n\n\n\n• “Though the Democrats captured the majority of the seats in Congress, 89% of Republicans have channels, compared to just 74% of Democrats... Eight of the top 10 most-viewed and most-subscribed YouTube channels in Congress are from the GOP .” (\n\n\n\n• “Democrats may have been credited with more tech savvy in 2008, but Republican lawmakers are more popular on YouTube...They're also using YouTube more than their Democratic counterparts: 89 percent of Republicans in Congress have YouTube channels, compared to 74 percent of Democrats...Republicans have made a concerted effort to close the tech gap and catch up to Democrats since the 2008 election.” (The Atlantic, 1/21/10)\n\n\n\nAmericans are speaking out, and they want a transparent, responsive, and collaborative government. Social media is making that easier than ever and House Republicans have joined the conversation. When will Democrats log on and join us?\n\n\n\nCongressional Democrats’ constituents aren’t the only ones that can’t find them online. The national media continues to chronicle the Republican advantage and the Democrats’ lack of interest in social media:• “The Republican leadership in the House is both aggressive and popular on Twitter. The party’s top two members in the House - John A. Boehner of Ohio and Eric Cantor of Virginia, respectively - have the most followed Twitter accounts in the chamber..” ( The New York Times, 1/13/10 • “A report on lawmakers’ use of Twitter is out today and the results may surprise. ‘Twongress: The Power of Twitter in Congress’ by Mark Senak, a Democrat, finds that as of this month,. Notable tweeters include Arizona GOP Sen. John McCain, who has the most followers of any senator, and House Minority Leader John Boehner, who has the most followers compared to his GOP colleagues.” ( The Wall Street Journal, 1/14/10 • “…The study found that of the 132 congressional lawmakers using Twitter, 89 are Republicans and 43 are Democrats. Only slightly more Republicans in the Senate used Twitter, but in the House, 75 Republicans count themselves as part of the Twitter scene, compared with 32 Democrats. Those Republicans on Twitter also are using it far more enough than Democrats. In the House, Republicans dominate the list of most-followed politicians.” ( Fox News, 1/15/10 • “. Minority Leader John Boehner may look like a character from Mad Men, but the Don Draper of the House has a ‘director of new media…” ( The Washington Examiner, 1/17/10 • “Though the Democrats captured the majority of the seats in Congress, 89% of Republicans have channels, compared to just 74% of Democrats....” ( YouTube’s Citizentube, 1/21/10 • “Democrats may have been credited with more tech savvy in 2008, but Republican lawmakers are more popular on YouTube...They're also using YouTube more than their Democratic counterparts: 89 percent of Republicans in Congress have YouTube channels, compared to 74 percent of Democrats...Republicans have made a concerted effort to close the tech gap and catch up to Democrats since the 2008 election.” (Americans are speaking out, and they want a transparent, responsive, and collaborative government. Social media is making that easier than ever and House Republicans have joined the conversation. When will Democrats log on and join us? Print version of this document", "images": ["https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/img/image07.jpg", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/img/image03.jpg", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/UploadedFiles/1.jpg", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/img/image06.jpg", "https://web.archive.org/web/20100125035945im_/http://gopleader.gov/UploadedFiles/tube-mogul-stats.jpg", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/UploadedFiles/2.jpg", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/images/transpix.gif", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/img/image04.jpg", "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/img/image05.jpg"], "top_img": "https://web.archive.org/web/20100125035945im_/http://republicanleader.house.gov/img/image07.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "PWNED: House GOP Dominates Twitter, YouTube, Social Media in Congress", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}