{"url": "www.vox.com/culture/2017/4/10/15179082/anne-hathaway-publicity-cycle-hathahaters-jennifer-lawrence-taylor-swift", "text": "The great pendulum of Anne Hathaway hatred has begun to swing the other way.\n\nWhen Hathaway greeted her 2013 Oscar win with a whispered, “It came true!” she was one of the most hated movie stars in America. People hated her constant smile, her theater-kid eagerness, her desperate and palpable thirst for approval.\n\n“My my,” said Alexis Rhiannon on Crushable, in what would become the iconic manifesto of the Hathahater, “what a large beautiful mouth. I don’t like it. Look at those dark beautiful eyes. I don’t like them. Listen to her skinny beautiful words. I don’t like them. Shut up. Shut up, Anne Hathaway.”\n\nThere was think piece after think piece about why everyone hated Anne Hathaway, and every interviewer who talked to her asked about them. They still do.\n\n“It comes up in every interview I do, just about,” Hathaway said of the “why does everyone hate her” narrative, in an interview last week with Rich Juzwiak for Jezebel. “I am … not eager, but I am ready for the conversation to move to a place beyond it.”\n\nIt’s a thoughtful, graceful interview, one that ends with Juzwiak recognizing his own role in perpetuating Hathahate and repenting for it. Afterward, people approvingly passed around screencaps on Twitter, and talked about how unfair it is that people say mean things about Hathaway so often.\n\nIt’s now culturally acceptable to say that 2013’s Anne Hathaway hatred was based on systemic misogyny, just as it was culturally acceptable to say in 2013 that you hated Anne Hathaway.\n\nif you've always been aware of the ways gender bias affected how society treated Anne Hathaway, you are Hathawoke — Kevin O'Keeffe (@kevinpokeeffe) April 4, 2017\n\nBut that shift doesn’t have all that much to do with Hathaway herself. Nor is it because we are all exponentially more woke now than we were in 2013. It has to do with where Hathaway is in her publicity cycle.\n\nYou can see her cycle repeated in what’s been happening to Jennifer Lawrence and Taylor Swift over the past few years. It all follows a very familiar pattern, because the life cycle of a Hollywood starlet is fairly standard.\n\nPhase 1: This woman is pretty, and she’s talented!\n\nThe earliest phase is the most basic, and some lucky starlets manage to stay there for their entire careers. It expresses itself in the form of a mildly condescending expression of bewilderment that a telegenic young woman is also good at her job: Jennifer Lawrence was so good in Winter’s Bone, and she’s a babe on the red carpet! Taylor Swift is a tall, skinny blonde, and she writes a catchy pop song!\n\nFor Anne Hathaway, that moment came in 2005 when she appeared in Brokeback Mountain. In review after review, Hathaway (one year removed from The Princess Diaries 2) and Michelle Williams (one year removed from Dawson’s Creek) were both singled out with a faint note of surprise: Turns out those pretty girls from the teenybopper world can really act!\n\nPhase 2: This woman is absolutely everywhere, and I love her\n\nIt’s when the starlet advances to phase two that she’s in danger. This is where Jennifer Lawrence was in 2012, and where Taylor Swift was in 2014: the point where the starlet is up for major awards, on the cover of every magazine, featured on every talk show, and roundly declared to be the best thing since sliced bread.\n\nIn 2012, Lawrence was starring in The Hunger Games and Silver Linings Playbook, and she was killing it on the interview circuit. She was the celebrity everybody wanted to have brunch with. She was so beloved that Vice called up a bunch of hate groups to see if they had anything bad to say about J Law, and none of them did. (The Hathahaters were at their height at the end of that year, and many of the “Why does everyone hate Anne Hathaway?” think pieces pitted Hathaway against the wildly popular Lawrence.)\n\nIn 2014, Swift had just released 1989, and the media was madly in love with her witchy in-on-the-joke “Blank Space” video, her kicky short hair, and her newly created girl squad. Rolling Stone declared that it was “a year of power moves for Swift.”\n\nFor Hathaway, phase two hit with 2008’s Rachel Getting Married, the movie that definitively pulled her out of the Princess Diaries/Ella Enchanted/tiara movie ghetto, past the serviceable-wallpaper-for-Meryl-Streep Devil Wears Prada weeds, and into the A-list. The New York Times built an article around her smile; she got reviews with headlines like “no priss, no prada, no princess – Hathaway comes of age.”\n\nTellingly, it was Rachel Getting Married that got called out as Hathaway at her least hatable in Crushable’s iconic Hathahater take, because phase two is inevitably followed by phase three.\n\nPhase 3: This woman is absolutely everywhere, and I hate her\n\nThe consequence of plastering a starlet’s face everywhere — on all the magazine covers, all the talk shows, all the movie trailers — is that people get sick of her.\n\nGenerally, phase three is not a major danger for male stars. Even when Leonardo DiCaprio was launching his thirstiest Oscar-seeking campaign, showing up on every magazine and talk show, and was subject to much mockery, the ridicule was always tinged with affection: Oh, that Leo, he just wants it so badly. If you Google “why does everyone hate Leonardo Dicaprio,” you don't find think pieces about how he's such a try-hard. You get think pieces with the headline \"Why does the Academy hate Leo?!\" wondering why the Academy hasn't given him an Oscar yet when he clearly deserves one.\n\nBut when a certain type of female star reaches a certain level of exposure, the world is ready to turn against her. Any mistake she makes in the public eye becomes a massive liability, and the things that made people like her suddenly make them hate her.\n\nFor Lawrence, the moment came last year, when she told a “funny story” that involved defiling sacred stones in Hawaii. Public opinion, already prepped to turn against her, swelled violently. Her lack of filter stopped being funny and became offensive. Now, she’s considered that dreaded beast, a try-hard.\n\nSwift got hit last year, too. She was already on thin ice — the 1989 spell was wearing off — but then came her much-mocked Apple Music ad, and then the incredibly fake-seeming romance with Tom Hiddleston, and then the infamous “Kim exposed Taylor” party. People started writing think pieces with titles like “When Did You First Realize Taylor Swift Was Lying to You?”\n\nPhase three came for Hathaway in 2011, the year she hosted the Oscars with James Franco. The pair bombed — LA Weekly dubbed the ceremony “the most embarrassing Academy Awards ever” — and while everyone agreed that Hathaway, who at least had the grace to try, did better than a sleepwalking Franco, it marked the moment that people started regularly describing her as a “theater kid.” It was not a compliment:\n\nQ: Was Anne Hathaway stoned, too? A: No. Q: So what was her deal? A: She suffers from \"theater kid.\"\n\n“Theater kid” means that Hathaway is too enthusiastic, that she wants her audience’s approval too badly, that she’s a little bit nerdy and way too desperate. The work ethic that impressed everyone back in her Brokeback Mountain and Rachel Getting Married days was starting to grate. And from “theater kid,” it was a short descent into try-hard status.\n\nA try-hard, to be clear, is not just someone who works hard. Beyoncé works hard, and she is not a try-hard. A try-hard is someone who works hard while you watch and secretly root for them to fail. It’s in the eye of the beholder, and in the eye of the beholder, the behavior that’s an admirable work ethic one year is incredibly annoying next year.\n\nIn 2012 Hathaway was starring in Les Misérables, and she wanted an Oscar bad. (She was, you might say, trying hard for it.) It made people furious.\n\nSo when Hathaway accepted her Oscar in the spring of 2013, with a too-earnest (and, she would later admit, totally fake) “It came true!” she was at her popularity nadir. It was what should have been the peak of her professional achievement. Instead, everyone despised her.\n\nPhase 4: Personally, I think it’s anti-feminist to hate this woman. And she’s so pretty and so talented!\n\nEventually, the starlet’s dominant narrative shifts away from the idea that everyone hates her and toward the idea that it is sexist how much everyone hates her. But for that to happen, the starlet has to lay low for a good long while.\n\nSince Passengers, Jennifer Lawrence has all but disappeared from the public eye. Taylor Swift has been so hard to find that she even skipped her traditional biannual music drop. And Anne Hathaway hasn’t signed on to star in a major prestige movie since Les Misérables. The single exception was her reunion with Dark Knight Rises director Christopher Nolan in 2014’s Interstellar, in which she was second lead — and her appearances on that press tour often ended up pivoting to the question of why everyone hates Anne Hathaway.\n\nIt was a deliberate strategy on Hathaway’s part. \"My impression is that people needed a break from me,” she said in 2014, to explain why she’d been staying out of the public eye.\n\nShe’s been making test runs instead. She’s headlined a couple of movies, but only movies that come out during dead periods (2015’s The Intern, this year’s Colossal). And at each release, there’s a small flurry of profiles and think pieces about whether or not everyone’s over the Hathahatred.\n\nThis year, it looks as though Hathaway has been dormant long enough. She’s getting headlines like “You Are Wrong and Also Dumb if You Hate Anne Hathaway” and “It’s Not Cool to Hate Anne Hathaway Anymore.” She disappeared long enough for us to miss her, and to get the creeping suspicion that we hated her before because of sexist reasons.\n\nWhat remains to be seen is whether our newfound love for Anne Hathaway will last through another round of phase two–style omnipresence.\n\nThis cycle exists because we live in a very sexist world\n\nThe popularity cycle of a starlet that I’ve been describing here is not confined to the world of celebrity. It’s a cycle many women experience, in which they are beloved when they’re defying low expectations, and despised as soon as they show ambition.\n\nHillary Clinton’s popularity sank like a stone the second she announced she was running for president. Women who follow the popular advice to “lean in” at work find themselves facing negative performance reviews and lower salaries, because their ambition is off-putting. It’s as though we’ve all been taught for a very long time that for women, accomplishment is only worth celebrating if it appears to be effortless. Once we can see the effort — once Lawrence’s goofiness starts to seem like shtick, and Hathaway’s nerdiness like a desperate need for approval — we start to hate it.\n\nBut successful men usually don’t have to hide themselves away for fear of overexposure. Successful men, in fact, don’t have to hide themselves away from much of anything, especially when they are also wealthy, well-connected, and white. Men can win Oscars after being sued for sexual harassment with very little pushback; they can headline multiple major blockbusters mere months after being accused of domestic violence.\n\nJohnny Depp allegedly cut off the tip of his finger and used the bloody stump to finger-paint the words “Easy Amber” on a mirror to terrorize his then-wife Amber Heard. He remains the face of the Pirates of the Caribbean franchise. Anne Hathaway acted a little fake when accepting her Oscar and had to disappear for four years.\n\nSo yes, it’s perfectly reasonable to argue that 2013’s hatred of Hathaway was based in our culture’s deep-seated hatred of women. But the new trend of redemptive Anne Hathaway think pieces does not necessarily indicate that we are all stronger and wiser and better now, and that over the past four years we have magically learned to stop hating women. If we had, we wouldn’t be repeating the whole procedure with a new string of starlets.\n\nIt just means that Hathaway played the publicity cycle well. And the next time she’s up for a big award, we’ll have a chance to see if we’ve gotten any better.", "images": ["https://cdn.vox-cdn.com/thumbor/k-gM_OjroQ4XCkN82343gRoHXDQ=/0x0:4168x2779/1200x800/filters:focal(2327x454:2993x1120)/cdn.vox-cdn.com/uploads/chorus_image/image/54138639/659709692.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670451/1210070405.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/CxxZajMFfZOmwsL2pFJoPax_Z_g=/0x0:1196x1428/1200x0/filters:focal(0x0:1196x1428):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8301321/665015250.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670249/GettyImages_1218880371.0.jpg", "https://cdn.vox-cdn.com/thumbor/mo2AQm_hERCYRGEQH-6mAJ47mjo=/0x0:2083x3000/1200x0/filters:focal(0x0:2083x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8301245/162588862.jpg", "https://cdn.vox-cdn.com/thumbor/OfmeIQpUCz3qGHdAorfqAiu4Ckw=/0x0:3000x1891/1200x0/filters:focal(0x0:3000x1891):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8301227/83357974.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66671059/GettyImages_1210050360.0.jpg", "https://cdn.vox-cdn.com/thumbor/KnJvHBt5qQZd6wp5qDS-LrD9pfo=/0x0:1954x3000/1200x0/filters:focal(0x0:1954x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8301219/56368259.jpg", "https://cdn.vox-cdn.com/thumbor/7z3Kp7Zaa2LpHUXMlg9A3IGFuv0=/0x0:3228x2456/1200x0/filters:focal(0x0:3228x2456):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8301283/533874520.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667959/1219262470.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670298/fionaapple3000.0.jpg", "https://cdn.vox-cdn.com/thumbor/pUnf9pEAqLD_jY9c8a8St-jIEGU=/0x0:4168x2345/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/54138637/659709692.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670574/1210300395.jpg.0.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/pUnf9pEAqLD_jY9c8a8St-jIEGU=/0x0:4168x2345/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/54138637/659709692.0.jpg", "keywords": [], "authors": ["Constance Grady", "Jag Bhalla", "German Lopez", "Li Zhou", "Aaron Rupar", "Emily Todd Vanderwerff", "Dylan Scott", "Apr"], "canonical_link": "https://www.vox.com/culture/2017/4/10/15179082/anne-hathaway-publicity-cycle-hathahaters-jennifer-lawrence-taylor-swift", "title": "Anne Hathaway’s love-hate-redemption publicity cycle is a familiar (and sexist) one", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "article": {"publisher": "https://www.facebook.com/Vox", "published_time": "2017-04-10T09:00:02-04:00", "modified_time": "2017-04-10T09:00:02-04:00"}, "author": "Constance Grady", "style-tools": "https://www.vox.com/style/community/441/dd55371d9ef76d5d505f37d268e3aefb/tools.css", "p": {"domain_verify": "d4410485bd6277c2bf2ce0f277819dc6"}, "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "A timeline of hatred and redemption for celebrity women, featuring Anne Hathaway, Jennifer Lawrence, and Taylor Swift.", "og": {"description": "A timeline of hatred and redemption for celebrity women, featuring Anne Hathaway, Jennifer Lawrence, and Taylor Swift.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/pUnf9pEAqLD_jY9c8a8St-jIEGU=/0x0:4168x2345/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/54138637/659709692.0.jpg", "alt": "'Colossal' New York Premiere - Arrival", "height": 900, "width": 1600}, "site_name": "Vox", "title": "Anne Hathaway’s love-hate-redemption publicity cycle is a familiar (and sexist) one", "type": "article", "url": "https://www.vox.com/culture/2017/4/10/15179082/anne-hathaway-publicity-cycle-hathahaters-jennifer-lawrence-taylor-swift"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.vox.com/culture/2017/4/10/15179082/anne-hathaway-publicity-cycle-hathahaters-jennifer-lawrence-taylor-swift", "title": "Anne Hathaway’s love-hate-redemption publicity cycle is a familiar (and sexist) one", "description": "A timeline of hatred and redemption for celebrity women, featuring Anne Hathaway, Jennifer Lawrence, and Taylor Swift.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/pUnf9pEAqLD_jY9c8a8St-jIEGU=/0x0:4168x2345/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/54138637/659709692.0.jpg", "alt": "'Colossal' New York Premiere - Arrival"}, "site": "voxdotcom"}, "sailthru.title": "Anne Hathaway’s love-hate-redemption publicity cycle is a familiar (and sexist) one", "sailthru.tags": "general,vox,front-page,movies,celebrities,culture,latest-news", "sailthru.description": "A timeline of hatred and redemption for celebrity women, featuring Anne Hathaway, Jennifer Lawrence, and Taylor Swift.", "sailthru.date": "2017-04-10T09:00:02-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/pUnf9pEAqLD_jY9c8a8St-jIEGU=/0x0:4168x2345/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/54138637/659709692.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/ZvS-bjv9rPlOVFsyc_2AQj22vTg=/1271x0:4050x2779/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/54138637/659709692.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/hub/sbnu_logo_minimal/441/touch_icon_ipad_retina_1000_yellow.755.png", "msapplication-TileColor": "#4f7177", "outbrainsection": "latest-news"}, "movies": [], "publish_date": 1491753600.0, "source": "http://www.vox.com", "summary": ""}