{"url": "https://variety.com/2017/film/features/patty-jenkins-wonder-woman-hollywood-sexism-equal-pay-james-cameron-1202583237/", "text": "Much like a certain Amazon goddess with a lasso, there are no heights that director Patty Jenkins can’t scale. Her blockbuster “Wonder Woman,” which has grossed a staggering $821 million worldwide since it opened in the summer, has become a rallying call for women everywhere and a beacon of empowerment in a Donald Trump-led world. Beyond all the Instagram posts of little girls decked out in “WW” regalia while seeing the film and an endorsement from Hillary Clinton, Jenkins recently cracked another glass ceiling. She’ll be directing “Wonder Woman 2” for a reported $7 million to $9 million, a record salary for a female filmmaker.\n\nAs she negotiated the terms of her contract with Warner Bros. over several months, Jenkins was conscious of what earning a big paycheck would mean. “You’re of course aware of the money,” says Jenkins on a sunny afternoon in Los Angeles. “But I’ve never been more aware of a duty than I was in this deal. I was extremely aware that I had to make sure I was being paid what the male equivalent would be.”\n\nArt Streiber for Variety\n\nAccording to recent studies, women only earn roughly 80 cents to every dollar that men get. The pay gap is evident in all corners of society, even Hollywood, where A-list actresses such as Jennifer Lawrence and Charlize Theron have had to fight to be compensated the same as their male peers. But until now, there’s never been an A-list female director with as much clout as Jenkins. Other women behind big live-action tentpoles, such as Catherine Hardwicke (“Twilight”) and Sam Taylor-Johnson (“Fifty Shades of Grey”), didn’t return for second installments, and the studios quickly replaced them with male directors.\n\n“Women who have not been in a system that allows them to build up the same level of pay as men are not able to be paid the same as men forever if that’s the way it continues,” Jenkins says. “You have to ask for it to happen, and you have to ask when you’re the appropriate person.” She points to Theron, who starred in her 2003 independent film “Monster” and won an Oscar for the role. “I knew when Charlize had to do it on ‘Snow White and the Huntsman,’ and I felt that it was my job to do it here.”\n\nGal Gadot, the star of “Wonder Woman,” was cheering Jenkins on. “She is definitely paving the way for so many other female directors,” Gadot says. “I think it was very important that she fought to get the best deal. You got to walk the walk and talk the talk.”\n\nDespite the results of the presidential election and women’s marches throughout the country, Jenkins never imagined that “Wonder Woman” would touch such a nerve. “I didn’t really start to make the connection about the lightning rod it was going to hit until it had opened,” says Jenkins, who gets stopped by strangers who profess how much the movie has meant to them. “I assumed that it would be seen just as a superhero film.” She’s in awe of all the high-profile groupies that she’s collected along the way. “When you hear about people like Hillary Clinton or Dwayne Johnson talking about you in the press, it’s like, ‘What!’ It’s so crazy and lovely.”\n\nPatty Jenkins and Gal Gadot share a moment on the set of “Wonder Woman.”\n\nCourtesy of Warner Bros/Clay Enos\n\nAs Wonder Woman has resurfaced as a cultural icon, Jenkins has been the brains behind the movement. “I’ve become more well-known than I ever thought I would,” Jenkins says. “I didn’t think I would be getting this much attention.” Acting as an ambassador for the disenfranchised is a responsibility that Jenkins doesn’t take lightly. “I think the legacy of ‘Wonder Woman’ is a different kind of hero, one that hits the same marks but also really is about love and empowerment in a slightly different way,” she says. “I think that’s why I love that people wear her outfit. People who are struggling in some sort of way or don’t identify with the world they live in can often find themselves in Wonder Woman.”\n\nAlthough some critics have read “Wonder Woman” as a feminist manifesto — when our hero meets her love interest, Steve (Chris Pine), she keeps her clothes on, while he’s naked — Jenkins didn’t think about it in those terms. “Not at all,” she says. “And that is the success of feminism. I have always wanted to be last-wave feminism, where you’re so feminist, you’re not thinking about it at all. Where you’re like, ‘Of course this superhero is the greatest superhero of all time. Oh, she’s a woman? I wasn’t even thinking about that!’”\n\nNot everybody has been a fan of “Wonder Woman.” After James Cameron publicly bashed the movie with a misogynistic shrug, Jenkins shot back with her own statement on social media. “I actually was not upset at all,” Jenkins says. “Everybody is entitled to their own opinion. But if you’re going to debate something in a public way, I have to reply that I think it’s incorrect.” Did Cameron ever reach out to apologize? “No,” she says.\n\nJenkins worked in Hollywood as a focus puller and a camera operator in her 20s. She was among the small group of women doing a man’s job, but she wasn’t so aware of it. “I never thought about the fact that I was the only woman,” she says. Even so, she thinks it’s important to mentor other women as they try to climb the industry ladder. “I definitely do,” says Jenkins. “But also, I feel a real obligation to be open to help everyone. I really think that ‘Wonder Woman’ is a loving character to all.”\n\nThere’s been a lot of talk about why 14 years elapsed between her first film and “Wonder Woman.” Jenkins says that it was mostly her decision, because she wanted to be at home at night with her son and her husband. And it’s not as if she wasn’t working. She took on TV projects like directing the pilot of “The Killing.” “When you have a little baby, directing a feature where you’re gone every few years is not the easiest thing to sync up,” Jenkins says. “I know people who have done it. It wasn’t something I chose to do.”\n\nI have always wanted to be last-wave feminism, where you’re so feminist, you’re not thinking about it at all.”\n\nPATTY JENKINS\n\nAll the speculation about her career is understandable. The industry still has a dismal record when hiring women directors in the movies: Only 7% of the top 250 films of 2016 were directed by women, and that number gets smaller when you look at blockbusters. Next spring, Disney will release Ava DuVernay’s adaptation of “A Wrinkle in Time,” which has a budget north of $100 million. But the list of directors attached to the “Star Wars” franchise is all-male, even with a female producer (Kathleen Kennedy) in charge. “It would depend on the project,” Jenkins says when asked if she’d want to direct a “Star Wars” movie.\n\nIn the Oscars race, not a single woman director has been nominated since Kathryn Bigelow became the first to win in the category in 2010. Warner Bros. is campaigning Jenkins as part of a robust Oscar push for “Wonder Woman” — if she’s nominated, she’ll be the first director of a comic-book movie to be recognized. “There’s no reason why they shouldn’t be considered,” she says of the Academy embracing comic-book adaptations. At least there’s been some progress: This is the first time in recent memory that there’s more than one woman — including Dee Rees (“Mudbound”) and Greta Gerwig (“Lady Bird”) — with a real chance of being nominated for best director.\n\nJenkins was able to negotiate her groundbreaking deal with Warner Bros. because the studio didn’t lock her down to multiple chapters. She had been in talks for “Wonder Woman,” but the studio offered the job to another filmmaker. After Michelle MacLaren exited due to creative differences, Jenkins signed on, without committing to a sequel. “They could have tied me up earlier,” she says. “I wouldn’t have wanted that.” Even though she wasn’t on board for a second movie, she kept envisioning it while making the first. (She’s been working on a treatment with DC Entertainment president Geoff Johns.) “I think she has a really clear and fun and compelling place that she’s taking the story,” says Warner Bros. Pictures Group chief Toby Emmerich.\n\nJenkins directs a scene in the 2003 film “Monster.” Charlize Theron, who played serial killer Aileen Wuornos, won an Oscar for the lead role.\n\nSnap Stills/REX/Shutterstock\n\nOne of the mantras associated with Wonder Woman — “Life is tough but so am I” — could easily apply to Jenkins’ own upbringing. Her father, William T. Jenkins, was an Air Force captain. He fought in Vietnam and later ran maneuvers out of a military base in England; his family joined him on all his adventures overseas. In interviews, Jenkins has talked a lot about how the heroism of her dad shaped “Wonder Woman.” She even has a dedication to him in the film’s closing credits.\n\nBut what she doesn’t talk about much is that he died, at 31, when she was only 7. “He passed away after taking off from a runway exactly like the one that Steve takes off on,” Jenkins says, referring to Wonder Woman’s boyfriend. “He crashed in the ocean.” She’s still not sure exactly what happened. “Nobody knows. He was in the middle of a NATO mock dogfight. They crash a lot. You’re doing a tricky maneuver.”\n\nHer father’s spirit was on the “Wonder Woman” set, even if she didn’t always reference him directly. Gadot says she thought of Jenkins’ dad when she saw the film for the first time, especially during the climactic scene where Steve makes the ultimate sacrifice for the woman he loves. “I think that even in the short time that he was present in her life, he had a lot of effect on who she became,” Gadot says.\n\nThe death of her father framed Jenkins’ outlook in many ways. “It’s part of why I think I wanted to make movies,” she says. “I wanted to experience wonder somewhere. I didn’t think I would experience it in real life.”\n\nA few months after her dad passed away, Jenkins remembers a cross-country road trip from Kansas to San Francisco in a VW bug. “My mom” — who would put herself through school to become an environmental scientist — “dropped my sister and I at the movie theater to wait out this snowstorm,” Jenkins says. They watched the original “Superman,” starring Christopher Reeve. “I remember everything about the experience of seeing it,” Jenkins says. “It really hit me in that way of exactly what I think superheroes were designed to do — to inspire you to metaphorically imagine the superhero within.”\n\nThat movie gave a grieving young girl some hope. It also provided her with a clear goal. “Seriously, that’s the part I can’t believe,” Jenkins says. “I always thought, because of ‘Superman,’ one day I want to make a movie that makes other people feel like that movie made me feel. The fact that that’s come true is so stunning.”\n\nWatch a behind-the-scenes video of Jenkins’ Power of Women L.A. cover shoot.", "images": ["https://pmcvariety.files.wordpress.com/2017/10/patty-jenkins-bts-monster-2003.jpg", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ffilm%2Ffeatures%2Fpatty-jenkins-wonder-woman-hollywood-sexism-equal-pay-james-cameron-1202583237%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202583237&comment_count=25", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2017/10/patty-jenkins-power-of-women-variety.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://pmcvariety.files.wordpress.com/2017/10/wonder-woman-bts.jpg"], "top_img": "https://pmcvariety.files.wordpress.com/2017/10/patty-jenkins-power-of-women-variety.jpg?w=1000", "keywords": [], "authors": ["Ramin Setoodeh"], "canonical_link": "https://variety.com/2017/film/features/patty-jenkins-wonder-woman-hollywood-sexism-equal-pay-james-cameron-1202583237/", "title": "‘Wonder Woman’ Director Patty Jenkins on Equal Pay, Hollywood Sexism and James Cameron’s Nasty Words", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "How the director of \"Wonder Woman' became a beacon of inspiration in an industry dominated by men.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202583237, "author": "Ramin Setoodeh", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-10-10T06:00:14"}, "pmc-tag": "Patty Jenkins,Power Of Women,Wonder Woman", "title": "‘Wonder Woman’ Director Patty Jenkins on Equal Pay, Hollywood Sexism and James Cameron’s Nasty Words", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "Features", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Wonder Woman’ Director Patty Jenkins on Equal Pay, Hollywood Sexism and James Cameron’s Nasty Words", "url": "https://variety.com/2017/film/features/patty-jenkins-wonder-woman-hollywood-sexism-equal-pay-james-cameron-1202583237/", "description": "Much like a certain Amazon goddess with a lasso, there are no heights that director Patty Jenkins can’t scale. Her blockbuster “Wonder Woman,” which has grossed a staggering $821 million worldwide …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/10/patty-jenkins-power-of-women-variety.jpg?w=1000", "width": 1000, "height": 563, "alt": "Patty Jenkins Power of Women Variety"}, "locale": "en_US"}, "article": {"published_time": "2017-10-10T13:00:14+00:00", "modified_time": "2017-10-11T00:20:29+00:00"}, "twitter": {"creator": "@https://twitter.com/RaminSetoodeh", "site": "@variety", "text": {"title": "‘Wonder Woman’ Director Patty Jenkins on Equal Pay, Hollywood Sexism and James Cameron’s Nasty Words"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/10/patty-jenkins-power-of-women-variety.jpg?w=1000", "alt": "Patty Jenkins Power of Women Variety"}, "card": "summary_large_image", "title": "‘Wonder Woman’ Director Patty Jenkins on Equal Pay, Hollywood Sexism and James Cameron’s Nasty Words", "description": "How the director of \"Wonder Woman' became a beacon of inspiration in an industry dominated by men."}, "author": "Ramin Setoodeh", "content_type": "Article", "post_id": 1202583237, "title": "'Wonder Woman' Director Patty Jenkins on Equal Pay, Hollywood Sexism and James Cameron's Nasty Words", "published_at": "2017-10-10 06:00:14", "image": "https://pmcvariety.files.wordpress.com/2017/10/patty-jenkins-power-of-women-variety.jpg?w=1000", "comment_count": 25, "tags": "Wonder Woman", "topics": "News", "appeared_in_print": "Yes", "body": "Much like a certain Amazon goddess with a lasso, there are no heights that director Patty Jenkins can’t scale. Her blockbuster “Wonder Woman,” which has grossed a staggering $821 million worldwide since it opened in the summer, has become a rallying call for women everywhere and a beacon of empowerment in a Donald Trump-led world. Beyond all the Instagram posts of little girls decked out in “WW” regalia while seeing the film and an endorsement from Hillary Clinton, Jenkins recently cracked another glass ceiling. She’ll be directing “Wonder Woman 2” for a reported $7 million to $9 million, a record salary for a female filmmaker.\r\n\r\nAs she negotiated the terms of her contract with Warner Bros. over several months, Jenkins was conscious of what earning a big paycheck would mean. “You’re of course aware of the money,” says Jenkins on a sunny afternoon in Los Angeles. “But I’ve never been more aware of a duty than I was in this deal. I was extremely aware that I had to make sure I was being paid what the male equivalent would be.”\r\n\r\n\r\n\r\nAccording to recent studies, women only earn roughly 80 cents to every dollar that men get. The pay gap is evident in all corners of society, even Hollywood, where A-list actresses such as Jennifer Lawrence and Charlize Theron have had to fight to be compensated the same as their male peers. But until now, there’s never been an A-list female director with as much clout as Jenkins. Other women behind big live-action tentpoles, such as Catherine Hardwicke (“Twilight”) and Sam Taylor-Johnson (“Fifty Shades of Grey”), didn’t return for second installments, and the studios quickly replaced them with male directors.\r\n\r\n“Women who have not been in a system that allows them to build up the same level of pay as men are not able to be paid the same as men forever if that’s the way it continues,” Jenkins says. “You have to ask for it to happen, and you have to ask when you’re the appropriate person.” She points to Theron, who starred in her 2003 independent film “Monster” and won an Oscar for the role. “I knew when Charlize had to do it on ‘Snow White and the Huntsman,’ and I felt that it was my job to do it here.”\r\n\r\nGal Gadot, the star of “Wonder Woman,” was cheering Jenkins on. “She is definitely paving the way for so many other female directors,” Gadot says. “I think it was very important that she fought to get the best deal. You got to walk the walk and talk the talk.”\r\n\r\nDespite the results of the presidential election and women’s marches throughout the country, Jenkins never imagined that “Wonder Woman” would touch such a nerve. “I didn’t really start to make the connection about the lightning rod it was going to hit until it had opened,” says Jenkins, who gets stopped by strangers who profess how much the movie has meant to them. “I assumed that it would be seen just as a superhero film.” She’s in awe of all the high-profile groupies that she’s collected along the way. “When you hear about people like Hillary Clinton or Dwayne Johnson talking about you in the press, it’s like, ‘What!’ It’s so crazy and lovely.”\r\n\r\n\r\n\r\n\r\n\r\n\r\nPatty Jenkins and Gal Gadot share a moment on the set of “Wonder Woman.”\r\nCourtesy of Warner Bros/Clay Enos\r\n\r\n\r\n\r\nAs Wonder Woman has resurfaced as a cultural icon, Jenkins has been the brains behind the movement. “I’ve become more well-known than I ever thought I would,” Jenkins says. “I didn’t think I would be getting this much attention.” Acting as an ambassador for the disenfranchised is a responsibility that Jenkins doesn’t take lightly. “I think the legacy of ‘Wonder Woman’ is a different kind of hero, one that hits the same marks but also really is about love and empowerment in a slightly different way,” she says. “I think that’s why I love that people wear her outfit. People who are struggling in some sort of way or don’t identify with the world they live in can often find themselves in Wonder Woman.”\r\n\r\nAlthough some critics have read “Wonder Woman” as a feminist manifesto — when our hero meets her love interest, Steve (Chris Pine), she keeps her clothes on, while he’s naked — Jenkins didn’t think about it in those terms. “Not at all,” she says. “And that is the success of feminism. I have always wanted to be last-wave feminism, where you’re so feminist, you’re not thinking about it at all. Where you’re like, ‘Of course this superhero is the greatest superhero of all time. Oh, she’s a woman? I wasn’t even thinking about that!’”\r\n\r\nNot everybody has been a fan of “Wonder Woman.” After James Cameron publicly bashed the movie with a misogynistic shrug, Jenkins shot back with her own statement on social media. “I actually was not upset at all,” Jenkins says. “Everybody is entitled to their own opinion. But if you’re going to debate something in a public way, I have to reply that I think it’s incorrect.” Did Cameron ever reach out to apologize? “No,” she says.\r\n\r\nJenkins worked in Hollywood as a focus puller and a camera operator in her 20s. She was among the small group of women doing a man’s job, but she wasn’t so aware of it. “I never thought about the fact that I was the only woman,” she says. Even so, she thinks it’s important to mentor other women as they try to climb the industry ladder. “I definitely do,” says Jenkins. “But also, I feel a real obligation to be open to help everyone. I really think that ‘Wonder Woman’ is a loving character to all.”\r\n\r\nThere’s been a lot of talk about why 14 years elapsed between her first film and “Wonder Woman.” Jenkins says that it was mostly her decision, because she wanted to be at home at night with her son and her husband. And it’s not as if she wasn’t working. She took on TV projects like directing the pilot of “The Killing.” “When you have a little baby, directing a feature where you’re gone every few years is not the easiest thing to sync up,” Jenkins says. “I know people who have done it. It wasn’t something I chose to do.”\r\nI have always wanted to be last-wave feminism, where you’re so feminist, you’re not thinking about it at all.”\r\nPATTY JENKINS\r\nAll the speculation about her career is understandable. The industry still has a dismal record when hiring women directors in the movies: Only 7% of the top 250 films of 2016 were directed by women, and that number gets smaller when you look at blockbusters. Next spring, Disney will release Ava DuVernay’s adaptation of “A Wrinkle in Time,” which has a budget north of $100 million. But the list of directors attached to the “Star Wars” franchise is all-male, even with a female producer (Kathleen Kennedy) in charge. “It would depend on the project,” Jenkins says when asked if she’d want to direct a “Star Wars” movie.\r\n\r\nIn the Oscars race, not a single woman director has been nominated since Kathryn Bigelow became the first to win in the category in 2010. Warner Bros. is campaigning Jenkins as part of a robust Oscar push for “Wonder Woman” — if she’s nominated, she’ll be the first director of a comic-book movie to be recognized. “There’s no reason why they shouldn’t be considered,” she says of the Academy embracing comic-book adaptations. At least there’s been some progress: This is the first time in recent memory that there’s more than one woman — including Dee Rees (“Mudbound”) and Greta Gerwig (“Lady Bird”) — with a real chance of being nominated for best director.\r\n\r\nJenkins was able to negotiate her groundbreaking deal with Warner Bros. because the studio didn’t lock her down to multiple chapters. She had been in talks for “Wonder Woman,” but the studio offered the job to another filmmaker. After Michelle MacLaren exited due to creative differences, Jenkins signed on, without committing to a sequel. “They could have tied me up earlier,” she says. “I wouldn’t have wanted that.” Even though she wasn’t on board for a second movie, she kept envisioning it while making the first. (She’s been working on a treatment with DC Entertainment president Geoff Johns.) “I think she has a really clear and fun and compelling place that she’s taking the story,” says Warner Bros. Pictures Group chief Toby Emmerich.\r\n\r\n\r\n\r\n\r\n\r\n\r\nJenkins directs a scene in the 2003 film “Monster.” Charlize Theron, who played serial killer Aileen Wuornos, won an Oscar for the lead role.\r\nSnap Stills/REX/Shutterstock\r\n\r\n\r\n\r\nOne of the mantras associated with Wonder Woman — “Life is tough but so am I” — could easily apply to Jenkins’ own upbringing. Her father, William T. Jenkins, was an Air Force captain. He fought in Vietnam and later ran maneuvers out of a military base in England; his family joined him on all his adventures overseas. In interviews, Jenkins has talked a lot about how the heroism of her dad shaped “Wonder Woman.” She even has a dedication to him in the film’s closing credits.\r\n\r\nBut what she doesn’t talk about much is that he died, at 31, when she was only 7. “He passed away after taking off from a runway exactly like the one that Steve takes off on,” Jenkins says, referring to Wonder Woman’s boyfriend. “He crashed in the ocean.” She’s still not sure exactly what happened. “Nobody knows. He was in the middle of a NATO mock dogfight. They crash a lot. You’re doing a tricky maneuver.”\r\n\r\nHer father’s spirit was on the “Wonder Woman” set, even if she didn’t always reference him directly. Gadot says she thought of Jenkins’ dad when she saw the film for the first time, especially during the climactic scene where Steve makes the ultimate sacrifice for the woman he loves. “I think that even in the short time that he was present in her life, he had a lot of effect on who she became,” Gadot says.\r\n\r\nThe death of her father framed Jenkins’ outlook in many ways. “It’s part of why I think I wanted to make movies,” she says. “I wanted to experience wonder somewhere. I didn’t think I would experience it in real life.”\r\n\r\nA few months after her dad passed away, Jenkins remembers a cross-country road trip from Kansas to San Francisco in a VW bug. “My mom” — who would put herself through school to become an environmental scientist — “dropped my sister and I at the movie theater to wait out this snowstorm,” Jenkins says. They watched the original “Superman,” starring Christopher Reeve. “I remember everything about the experience of seeing it,” Jenkins says. “It really hit me in that way of exactly what I think superheroes were designed to do — to inspire you to metaphorically imagine the superhero within.”\r\n\r\nThat movie gave a grieving young girl some hope. It also provided her with a clear goal. “Seriously, that’s the part I can’t believe,” Jenkins says. “I always thought, because of ‘Superman,’ one day I want to make a movie that makes other people feel like that movie made me feel. The fact that that’s come true is so stunning.”\r\n\r\nWatch a behind-the-scenes video of Jenkins’ Power of Women L.A. cover shoot.\r\n\r\nhttps://www.youtube.com/watch?v=NTs0Fw2RkdA&feature=youtu.be", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/NTs0Fw2RkdA?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1507640414.0, "source": "https://variety.com", "summary": ""}