{"url": "https://www.bbc.com/news/newsbeat-44546430", "text": "Image copyright VH1\n\nAquaria, Kameron Michaels, Eureka and Asia O'Hara are the four queens competing in the season 10 final of RuPaul's Drag Race.\n\nAlthough, as Asia admitted in a recent episode, the real winner of the series is probably Vanessa Vanjie Mateo.\n\nDespite leaving in episode one Miss Vanjie made an impression that lasted an entire series.\n\nBut it's one of the remaining queens who will be crowned America's next drag superstar when the final episode airs.\n\nWho deserves to take the title? We spoke to Drag Race superfans for their predictions on who they want to win - and why.\n\nAquaria\n\nAt 21, New Yorker Aquaria is the season's youngest contestant and after winning the most challenges is statistically the favourite to win.\n\nLike previous winners, she's never landed in the bottom two - so has never faced elimination.\n\n\"I think people dismissed her initially as an 'Instagram queen',\" says 26-year old superfan Hayden East, who followed Aquaria on social media before she entered the show.\n\n\"Whereas previously Instagram queens have fallen short in other areas - like Miss Fame or Kim Chi who did really great in terms of looks but didn't quite reach the bar with dancing, performance, acting or comedy - I really feel like Aquaria has shown herself to be very well rounded.\"\n\nHayden says she has surpassed previous young competitors and been portrayed as a fully-fledged star, rather than a rising talent. And she's also been impressed with her knowledge of drag and LGBT culture.\n\n\"Aquaria is very young and to have all the cultural references, the confidence and the self-awareness is a real testament to her as a queen,\" he says.\n\nKameron Michaels\n\nShy queen Kameron mixes muscles with mascara and was labelled the \"trade\" of season 10 by contestants and viewers alike.\n\nKameron shared stories of bullying during the series, which helped fans warm to a quiet contestant who received a relatively small amount of screen-time.\n\n\"We've never really had a queen who blends the femininity and masculinity together like Kameron does,\" says 29-year-old viewer Lewis Peters.\n\n\"The whole masculine look stems from the fact that she was bullied when she was younger.\n\n\"Being part of the LGBT community we can all relate to that - being bullied growing up.\"\n\nKameron was responsible for several fan-favourite contestants losing their place in the show and has been called the \"lip sync assassin\" of season 10.\n\n\"Also,\" Lewis adds, \"Kameron is hot.\"\n\nEureka\n\nOriginally a contestant on season nine, Eureka injured her knee and hobbled away from the 2017 show with an open invitation to return this year.\n\nBut the 'elephant queen' hasn't been given the warmest reception by fans, despite a hilarious and successful ride into the 2018 final.\n\n\"She's been called 'too loud' and 'too overbearing' but that is just her and that's what makes her so funny,\" says Hayley Minn, a 26-year-old Drag Race viewer who has been a fan of Eureka since her first appearance.\n\nHayley says a win for a plus-size contestant would bring a great message of body positivity to the show.\n\n\"She makes her silhouette look incredible and really knows how to frame her shape and 'proportionise',\" she adds.\n\nHayley says Eureka's standout moments include appearing as Honey Boo Boo in the Snatch Game episode and appearing nearly naked as a giant baby during a talk show challenge.\n\nAsia O'Hara\n\nAsia's kindness nearly became her undoing when she spent more time sewing costumes for others than she did for herself in an early episode of season 10.\n\nA win for the oldest of the finalists would be a triumph for drag culture, says 22-year-old Noni Makuyana.\n\n\"Asia represents pageant drag and that isn't valued in the same way as Aquaria's drag is,\" says Noni.\n\n\"Aquaria is praised because she's new and innovative but at the same time, that's doing away with the history of black queens in drag.\"\n\nPageant drag queens focus on more traditional images of female beauty and this can be criticised for being \"old and traditional\", says Noni.\n\nBut she believes it's Asia's motherly role to other contestants during the show that makes her a deserving winner.\n\n\"You can tell she is a real down-to-earth, genuine, authentic person who is so caring. She's often lifted up so many other queens who have been in the race.\"\n\nShould the final four be more diverse?\n\nImage copyright VH1 Image caption Aquaria, Kameron, Eureka and Asia entered the show among a broad and diverse range of contestants\n\nNoni, along with some viewers and even contestants, says she is disappointed by the lack of more queens of colour in the final four - in a series where the likes of Monet X Change, The Vixen and Monique Heart brought some of the most memorable moments.\n\nShe says both Kameron and Eureka have been given second chances by the show's judges which would not have been given to contestants of colour.\n\n\"Lots of black queens haven't been given the same time, support - space to be better,\" she says.\n\n\"It echoes society that black women are judged more harshly and you have to be a certain way - if you're not then you're not important and you have to work ten times harder than everyone else.\"\n\nThe season 10 final of RuPaul's Drag Race will screen in the UK on Netflix on 28 June 2018.\n\nFollow Newsbeat on Instagram, Facebook and Twitter.\n\nListen to Newsbeat live at 12:45 and 17:45 every weekday on BBC Radio 1 and 1Xtra - if you miss us you can listen back here.", "images": ["https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=newsbeat::news.newsbeat.story.44546430.page&x1=[urn:bbc:cps:26064b5d-eb20-8842-ae41-15d9b41c6c4f]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/1024/socialembed/https://www.instagram.com/p/BkK1Ea4hwHi/~/news/newsbeat-44546430", "https://ichef.bbci.co.uk/news/1024/socialembed/https://www.instagram.com/p/BkEVbAhAbG6/~/news/newsbeat-44546430", "https://ichef.bbci.co.uk/news/1024/socialembed/https://www.instagram.com/p/BhpC6aTAboE/~/news/newsbeat-44546430", "https://ichef.bbci.co.uk/news/1024/socialembed/https://www.instagram.com/p/BjA1fSrgMcT/~/news/newsbeat-44546430", "https://ichef.bbci.co.uk/news/1024/branded_news/B434/production/_102123164_dragrace10.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/B434/production/_102123164_dragrace10.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/B434/production/_102123164_dragrace10.jpg", "keywords": [], "authors": ["Michael Baggs", "Newsbeat Reporter"], "canonical_link": "https://www.bbc.com/news/newsbeat-44546430", "title": "RuPaul's Drag Race: Who should win season 10?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Drag Race superfans explain why either Aquaria, Kameron, Eureka or Asia should win the 2018 series of the show.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 123218635, "og": {"title": "Drag Race: Who should win season 10?", "type": "article", "description": "Drag Race superfans explain why either Aquaria, Kameron, Eureka or Asia should win the 2018 series of the show.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/newsbeat-44546430", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/B434/production/_102123164_dragrace10.jpg", "alt": "BBC News. RuPaul's Drag Race"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Newsbeat"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Drag Race: Who should win season 10?", "description": "Drag Race superfans explain why either Aquaria, Kameron, Eureka or Asia should win the 2018 series of the show.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/B434/production/_102123164_dragrace10.jpg", "alt": "RuPaul's Drag Race"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/newsbeat-44546430?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}