{"url": "www.elitedaily.com/entertainment/celebrity/kylie-jenner-travis-scott-married-fans/2079523", "text": "I know, we're all way too fragile right now to introduce any more crazy rumors. King Kylie's pregnancy has left all of us laying on the side of our beds, looking up at the ceiling in some degree of an existential crisis, and now the new question starting to simmer to the surface is, \"Wait a minute, are Kylie Jenner and Travis Scott getting married?\" World, I can't even with this right now... but then again... if I must...\n\nHere is what we know. And by \"know,\" I mean here is what we are all rapidly absorbing at an alarming rate from various sources creating the false illusion of fact, but YA KNOW WHAT, THIS ISN'T ABOUT MY CONSPIRACY THEORIES SO BACK OFF, JAMIE. What we know is that reports are claiming that Kylie Jenner is pregnant with Travis Scott's baby, and due sometime in February. TMZ was the first to break the news on Sept. 22., and so far no one in the family has said she isn't pregnant, which is basically the same thing as shouting, \"YES, SHE IS.\" On top of that, sources say Jenner and Scott are reportedly having a baby girl, which feels pretty specific.\n\nElite Daily reached out to Kylie Jenner's and Travis Scott's teams for confirmation and comment, but did not hear back by time of publication.\n\nBob Levey/Getty Images\n\nOf course, Kylie's reported pregnancy isn't the first (or the last) to rock our world, so there are a couple of things we can do to prepare ourselves. First, let's assume this child's name is going to be some sort of noun that demands or encompasses a high, authoritative status. Options still up for grabs include Queen, Majesty, Honor, Royal, Lux, Heir, Kash and, my favorite, Koin with a \"K.\"\n\nWe can also guess that a wedding is on its way, because if there is one thing these girls love to do more than having babies, it's having weddings. (Unless you're Kourtney, then you just stick with the babies.)\n\nFans have their eyes and ears peeled for anything that might hint at a walk down the aisle, and while Kylie isn't sporting that big ol' ring finger rock she used to traipse around in when dating Tyga, that doesn't mean nuptials aren't in the cards.\n\nTwitter is out here waiting, Kylie.\n\nI know. There is so much to consider.\n\nThe Kardashian/Jenner family tree is forever in flux, being thrown for its largest loop when younger brother Rob had a baby with Kylie's ex-boyfriend's baby mama, Blac Chyna. Still, that cluster-f*ck of a branch was smoothed out when Kylie and Tyga broke up, making room for a new branch to grow on the family tree for Travis and his baby. (Are you guys hanging in there with me? I know, this paragraph got away from me.)\n\nStill, nothing has been confirmed on the marriage-front. Back in June of 2017, there was talk that Scott and Jenner might have peeled off for a secret elopement, which was first announced by Life & Style magazine. Alas, that rumor was quickly squashed thanks to Gossip Cop and sources close to the couple confirming it was, in fact, a lie.\n\nSomething tells me that if our girl Kylie does want to get married, she'll wait a while before that happens.\n\nThe young star has certainly seemed to hit her stride with her hit series Life Of Kylie, exclaiming multiple times on the series that this is the happiest she's ever been. Hey, can't hate that.\n\nWe love you girl, please keep us posted?\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/elite-daily/2017/08/02131236/kylie-jenner-life-therapy.png?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/elite-daily/2017/08/02131236/kylie-jenner-life-therapy.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.elitedaily.com/elite-daily/2017/09/22170332/kylie-jenner-travis-scott.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/08/02131236/kylie-jenner-life-therapy.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/kylie-jenner-travis-scott-married-fans/2079523", "title": "Are Kylie Jenner & Travis Scott Married? Fans Have Questions After Pregnancy Reports", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/kylie-jenner-travis-scott-married-fans/2079523", "type": "article", "title": "Are Kylie Jenner & Travis Scott Married? Fans Have Questions After Pregnancy Reports", "description": "I know, we're all way too fragile right now to introduce any more crazy rumors. King Kylie's pregnancy has left all of us laying on the side of our beds, looking up at the ceiling in some degree of an existential crisis, and now the new question…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/08/02131236/kylie-jenner-life-therapy.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "I know, we're all way too fragile right now to introduce any more crazy rumors. King Kylie's pregnancy has left all of us laying on the side of our beds, looking up at the ceiling in some degree of an existential crisis, and now the new question…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}