{"url": "https://www.elitedaily.com/p/adam-rippon-jussi-pekka-kajaala-are-dating-after-meeting-on-tinder-8701979", "text": "Sorry, boys. American Olympic bronze medalist Adam Rippon is now officially in a relationship with Finnish stud Jussi-Pekka Kajaala. And guess what? Adam's just like us, y'all – he found his new beau on a dating app. That's right, new couple Adam Rippon and Jussi-Pekka Kajaala met on Tinder. Our favorite ice-skating prince swipes right too, and he snagged a relationship from it. Goals.\n\n\"We met on Tinder while I was in Finland late last year and we kept in touch since then,\" Rippon told ET in an interview. \"We had been talking all through the holidays and the Olympics. We kept it pretty private but recently we decided to make it official.\"\n\nA European modern fairytale romance? We stan.\n\nRippon initially made waves at the 2018 PyeongChang Winter Olympics, when he became one of the first two openly gay U.S. athletes at the winter events. (Gus Kenworthy, the U.S. freestyle skier, was the other.) Rippon earned a bronze medal with Team USA for the figure skating team event. His unapologetic snark and witty commentary, along with his impressive skating skills, won him a dedicated Internet fanbase, garnering more than a combined 1.2 million followers across Instagram and Twitter.\n\nRippon made the media rounds post-Winter Olympics, proclaiming his single status and what he was looking for in a relationship.\n\n\"If you've got a job and you go to the gym, let me know I guess,\" Rippon told ET in an interview on the Academy Awards red carpet on March 4, where he said he was single. Rippon also talked to Ellen DeGeneres on The Ellen DeGeneres Show about his celebrity crushes, which include Jake Gyllenhaal, Shawn Mendes, and Harry Styles. Rippon met Mendes for the first time at the Oscars, posting a selfie of the two on Twitter. But now, Rippon is no longer single.\n\nRippon made it Instagram official on April 2, posting a shirtless picture with Kajaala atop Runyon Canyon in Los Angeles. Of course, Rippon announced the relationship with a bit of humor, punnily captioning the photo, \"Good boys Finnish first.\" Touché.\n\nKajaala also marked the relationship official on an Instagram post of his own, seemingly on the same hiking date.\n\n\"From Los Angeles with love,\" Kajaala captioned the photo of the two with their arms wrapped around each other.\n\nAnd, Rippon left a heart-eye emoji on the selfie of Kajaala on Instagram, below. We love a supportive boyfriend.\n\nBefore Kajaala, Rippon previously told People that he broke up with his boyfriend of two years during summer 2017.\n\n\"Everything was great with him, he was a great guy, but I felt like I really needed to focus on myself,\" Rippon told People. \"I was lucky that my ex-boyfriend is such a nice person that we’re still friends now.\"\n\nWith a new boyfriend in the Winter Olympics off-season, it doesn't mean Rippon is settling down in all aspects of his life. Rippon is slated to join ice skating tour Stars on Ice, beginning April 6 in Florida, performing in the same show as other Olympic medalists, including Sasha Cohen, Kristi Yamaguchi, Meryl Davis, Charlie White, and more.\n\nIn addition to Stars on Ice, Rippon is also rumored to be in the upcoming Dancing with the Stars athletes-only competition, joining possible polarizing skating legend Tonya Harding. (Which, BTW, can you imagine these two on TV together? Probably television gold.)\n\nWhatever happens next for the newly official couple, we're excited to see maybe a glimmer of Kajaala in the audience for Rippon's skating in Stars on Ice or potentially on Dancing with the Stars – and maybe Rippon will Finnish first with the famed Mirrorball Trophy, too.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/a304d67c-2dc0-495d-bda3-ce880eede1a1-getty-1206652895.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/shutterstock/2020/4/9/87198fea-028b-492d-ad35-5e236e447be7-shutterstock-1048862375.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/shutterstock/2020/4/14/9b25ebe7-c886-498f-b12e-bb39bcb207c6-shutterstock-1110894506.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/4/5/72c9c66d-6c2d-42de-84ec-ff30a4ece4ac-getty-919204584.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/4/5/72c9c66d-6c2d-42de-84ec-ff30a4ece4ac-getty-919204584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/5/72c9c66d-6c2d-42de-84ec-ff30a4ece4ac-getty-919204584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/adam-rippon-jussi-pekka-kajaala-are-dating-after-meeting-on-tinder-8701979", "title": "Adam Rippon & Jussi-Pekka Kajaala Are Dating After Meeting On Tinder", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/adam-rippon-jussi-pekka-kajaala-are-dating-after-meeting-on-tinder-8701979", "type": "article", "title": "Adam Rippon Met His Boyfriend On Tinder & Their First Pic Together Is Everything", "description": "Sorry, boys. American Olympic bronze medalist Adam Rippon is now officially in a relationship with Finnish stud Jussi-Pekka Kajaala. And guess what? Adam's just like us, y'all – he found his new beau on a dating app. That's right, new couple Adam…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/5/72c9c66d-6c2d-42de-84ec-ff30a4ece4ac-getty-919204584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Sorry, boys. American Olympic bronze medalist Adam Rippon is now officially in a relationship with Finnish stud Jussi-Pekka Kajaala. And guess what? Adam's just like us, y'all – he found his new beau on a dating app. That's right, new couple Adam…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}