{"url": "https://nypost.com/2017/01/11/khloe-helped-me-lose-50-pounds-to-get-revenge-on-my-ex/", "text": "A year into his three-year relationship with his boyfriend Kyle, Will Ontiveros, 27, became what he calls “happy fat” — packing on pounds through a combination of nights out and vacations together, as well as a comfort level with his partner that left him feeling like he didn’t have to watch his weight.\n\nThe TV and film producer added about 40 pounds onto his stocky, 5-foot-11 frame, but his boyfriend, who is 6-foot-5, didn’t. When Kyle ended their relationship in December 2015, he cited Ontiveros’ bigger figure as one of the reasons, saying he was no longer attracted to him.\n\n“He had mentioned the weight gain a year before he broke up with me, and I wasn’t able to do anything about it or didn’t have motivation,” Ontiveros tells The Post. “[The criticism] was sporadic . . . It would come up when we were frustrated with each other.”\n\nOntiveros, who moved from New Mexico to LA to be with Kyle, decided to win back his ex by signing up for the new E! weight-loss reality TV show “Revenge Body With Khloé Kardashian.” In 12 weeks, he lost 30 pounds from a starting weight of 255 pounds.\n\nIn the eight-episode series, which premieres Thursday at 8 p.m., LA-based participants spend three months working out with a personal trainer to lose weight, motivated by a desire to prove themselves to someone in their life, such as an ex or a parent. Boldface trainers include Gunnar Peterson, Harley Pasternak, Simone De La Rue and others.\n\nAlong the way, participants receive encouragement and tough love from Khloé, who has struggled with her weight since being dubbed the “fat sister” of the famous Kardashian clan.\n\nContestant Ranella Ferrer, a 5-foot-4 vocalist, turned to food to deal with a breakup and a mother who wasn’t supportive of her music ambitions. The 28-year-old’s 70-pound weight gain affected her career, as she began to bail on singing gigs because she was too ashamed to perform onstage at 207 pounds. Her mother became even more critical of her weight, career and lack of a boyfriend.\n\n“I wanted to get revenge on my mom. And I wanted to make her proud, because I feel like out of every one of the [five] children, I was the one that was the outcast,” she says. “Everyone’s a professional or college student . . . and here I am, a struggling artist who’s overweight and single with no kids.”\n\nTrainers worked with each participant on an individualized diet and exercise plan. Ferrer had to change her Thai food-heavy diet by limiting rice in meals, ordering more salads and drinking a gallon of water a day. Ontiveros started hitting the gym up to six times a week with Peterson, lifting weights and doing total-body resistance workouts, as well as an hour of cardio every night.\n\nDue to its title, “Revenge Body” has stirred up some pre-premiere controversy from health experts and viewers who worry it will promote quick-fix workouts and the body-shaming idea that you have to be thin and toned to be happy. Trainer Peterson says that while revenge can be an effective motivator, weight-loss success depends on much more than that, which the participants discover on the show.\n\n“Like many of the flawed fitness programs out there, if revenge is what it takes you to get up and get going, I’m all for it,” says Peterson, who has trained Khloé, along with her mom, Kris, and sister Kim. “I would say — and I think this happened on Will’s journey — he grew so much past that.\n\nWhen you’re doing this for you, it’s way more efficient. [Now] he goes home to visit his mom and he’s going to the gym on his own every day. That’s a big move for somebody who wasn’t going [at all].”\n\nIf revenge is what it takes you to get up and get going, I’m all for it.\n\nThe show is also a culmination of Khloé’s own weight-loss journey, which began in 2013. The 32-year-old reality TV star has since lost 40 pounds, with some worrying she’s gone too far. Peterson attributes Khloé’s success to her work ethic.\n\n“When Khloé trains with me, she shows up early, she knocks out cardio, she stretches and she’s ready to go when I finish whoever preceded her. That’s not common, believe me,” says Peterson.\n\nOntiveros has continued training with Peterson four to five times a week, and has now lost a total of 52 pounds. His revenge worked: Kyle reached out to Will in August and they briefly rekindled their romance, until Ontiveros thought better of the unhealthy reconciliation and ended it two weeks later.\n\nIn a particularly vengeful twist, he’s now dating one of Kyle’s ex-boyfriends.\n\n“Of course it felt rewarding in the beginning. This is what I wanted and here it was, and how funny that what I got isn’t actually what I wanted,” he says. “That was my ‘aha’ moment. It wasn’t even about revenge . . . It was a self-realization of, ‘Wow, I don’t need him.’ ”", "images": ["https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg?quality=90&strip=all&w=520&h=280", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=1200", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://thenypost.files.wordpress.com/2020/04/mani-kit-feature.jpg?quality=90&strip=all&w=300&h=200&crop=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png?w=231&h=45"], "top_img": "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["January"], "canonical_link": "https://nypost.com/2017/01/11/khloe-helped-me-lose-50-pounds-to-get-revenge-on-my-ex/", "title": "Khloé helped me lose 50 pounds to get revenge on my ex", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "A year into his three-year relationship with his boyfriend Kyle, Will Ontiveros, 27, became what he calls “happy fat” — packing on pounds through a...", "generator": "WordPress.com", "og": {"type": "article", "title": "Khloé helped me lose 50 pounds to get revenge on my ex", "url": "https://nypost.com/2017/01/11/khloe-helped-me-lose-50-pounds-to-get-revenge-on-my-ex/", "description": "A year into his three-year relationship with his boyfriend Kyle, Will Ontiveros, 27, became what he calls “happy fat” — packing on pounds through a combination of nights out and vacations together,…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2017-01-12T04:50:45+00:00", "modified_time": "2017-07-26T16:48:55+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Khloé helped me lose 50 pounds to get revenge on my ex"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2017/01/170112-khloe-kardashian-helped-me-feature.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Khloé helped me lose 50 pounds to get revenge on my ex", "description": "A year into his three-year relationship with his boyfriend Kyle, Will Ontiveros, 27, became what he calls “happy fat” — packing on pounds through a combination of nights out and vacations"}, "fb": {"pages": 225343690812937}, "nypost-section": "Living", "parsely-metadata": "{\"post_id\":\"nypost-10662052\"}", "keywords": "Living,TV,celebrity weight loss,diets,khloe kardashian,reality tv,sex and relationships,weight loss", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": ["https://www.youtube.com/embed/3nEey0TFcDs?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/DoH5ndrOodM?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1484064000.0, "source": "https://nypost.com", "summary": ""}