{"url": "https://en.wikipedia.org/wiki/Gypsy_(TV_series)", "text": "No. Title Directed by Written by Original release date\n\n1 \"The Rabbit Hole\" Sam Taylor-Johnson Lisa Rubin June 30, 2017 ( )\n\nJean is a therapist who is married and has a child. She is growing bored with her life and longs for excitement. She involves herself too much into her patients lives, by inserting herself into their lives. One day, Jean catches the eye of Sidney and immediately wants to know more about her and is attracted to her. She is later horrified to learn that one of her patients, Sam, is Sidney's boyfriend whom he has a complicated and dangerous relationship with. She has other patients, Claire, a mother who desperately wants to reunite with her daughter, Rebecca, and a drug-addict, Allison. She later tells Sidney that her name is Diane and they bond at one of Sidney's concerts.\n\n2 \"Morgan Stop\" Sam Taylor-Johnson Lisa Rubin June 30, 2017 ( )\n\nJean is trying to navigate her new and risky relationship with Sidney with her parental duties, much to her chagrin. Meanwhile, a previous patient of Jean's, Melissa, is in the hospital making dangerous accusations about Jean and what she did to her life. Michael and his receptionist Alexis navigate a strange relationship. Claire has been bothering Jean and interrupting her life as she grows more and more needy and desperate to maintain contact or make progress with Rebecca. Jean later meets up at a concert show for Sidney where her daughter, Dolly, contacts her forcing her to rush home so Sidney does not find out the truth about Jean. Jean rushes home where she and Michael connect, him unaware of her night's activities.\n\n3 \"Driftwood Lane\" Scott Winant Story by : Jessica Mecklenburg\n\nTeleplay by : Jessica Mecklenburg & Lisa Rubin June 30, 2017 ( )\n\nJean is trying to save her troubled relationship with Michael by having rough sex and wanting to go on a date in the city with him. Jean also is attempting to throw Dolly a birthday party while navigating her relationship with her fellow moms who she does not like. Dolly cuts her hair to look more like herself, as she feels she is more like a boy. In a flashback, Jean sees her mother with a new engagement ring, and in another flashback/dream mix, Sidney and her mother warn Jean that everyone is scared to be alone. This inspires Jean to check on Allison. Alexis shows up at Dolly's party making everyone uncomfortable. The party ends where Michael yells at Jean, telling her she made the party about herself and not about Dolly. Jean feels she is treated like she's invisible in her home. Fed up with Michael and her life, she storms off and leaves the house in the middle of the night that night.\n\n4 \"309\" Scott Winant Story by : Jonathan Caren\n\nTeleplay by : Jonathan Caren & Lisa Rubin June 30, 2017 ( )\n\nJean spends more time with Sidney while also trying to still navigate a falling relationship with Michael. Sidney shares with \"Diane\" that she's always had a thing for older women, upsetting her. To help her sessions with Claire, Jean tracks down Rebecca and talks to her about her mother and tries to encourage Rebecca to talk to her mother. In a session, Claire shares she is worried about Rebecca who is now living with a \"community\". Michael grows suspicious about where Jean continues to run off to. We learn Melissa took up arson, naming Jean as a motive. Sidney wants Jean and Sam to both meet at an event she invites them to. Jean later rescues Allison from an abusive relationship and proceeds to enter an apartment she has a key to that is not hers.\n\n5 \"The Commune\" Alik Sakharov Sean Jablonski June 30, 2017 ( )\n\nJean gets more into her patients lives, by acting as Sidney during meetings with Sam and taking Allison to an AA meeting; something she is uneasy about. Sam meets an ex of his, Emily, while out with friends one night, prompting him to move on from Sidney. Michael begins to grow suspicious of Jean after she refuses to let him see her phone and Sidney and Jean face off with Sidney telling \"Diane\" she is scared and \"Diane\" telling Sidney that she manipulates people. Jean later attends Rebecca's community meeting where she bonds and opens herself up by taking a new outlook on life. Michael spends the night with some friends, which makes him realize he does not want to get a divorce. Jean's new outlook on life prompts her to find Sidney and passionately kiss her, however, Larin spots her as she desperately tries to run away. Michael tells Jean he wants to work on their marriage and that he wants to go on a vacation.\n\n6 \"Vagabond Hotel\" Alik Sakharov Story by : Sneha Koorse\n\nTeleplay by : Sneha Koorse & Lisa Rubin June 30, 2017 ( )\n\nJean and Michael spend a night together at a hotel, which goes well. Michael heads back to work but Jean invites Sidney. Michael tells Alexis that they have to go on a trip to Texas for work, she is happy about doing so. Sidney takes Jean to break into Sam's house where they steal Sam's dog and Jean is horrified to find a gun. Jean is spotted by a neighbor on their way out. Sam later tells Jean this and that he is going to start dating Emily. Allison visits Jean with her abusive boyfriend, Tom, where Jean only makes their relationship worse. Jean and Sidney are later out when Jean collapses and passes out, having been drugged by Tom.\n\n7 \"Euphoria\" Victoria Mahoney Lisa Rubin June 30, 2017 ( )\n\nJean and Sidney spend a weekend at a hotel together where Jean wants to learn more about Sidney, while Sidney only wants sex. Michael spends the weekend at a work conference with Alexis, where they discuss Michael's struggling marriage and he mentions he wishes it was better than it was and complains to Alexis about Jean. Jean and Sidney later get high, where Jean has a troubling experience and starts to question what Sidney wants from her and if she still is in love with Sam. She later deletes Sam's number and messages from Sidney's phone. Alexis pressures Michael to give in to their desire and have sex, but he cannot; while Jean and Sidney finally have sex, leaving Jean feeling like she is a new person.\n\n8 \"Marfa\" Victoria Mahoney Jonathan Caren & Lisa Rubin June 30, 2017 ( )\n\nSidney has been growing suspicious of Jean, wanting to know more about who she is and herself. Jean is later horrified to learn from Claire that Rebecca wants to have a session with her, so she sets out to stop it. Michael and Alexis face trouble after he is questioned by his boss if he and Alexis had sex the previous weekend. Larin questions Jean's increasingly distant behavior and berates the person she has become. Sam tells Jean about his relationship with Emily and their sex life, when Jean begins asking more and more deep and violating questions about his sex with Sidney. \"Diane\" visits Rebecca and convinces her not to meet with her mother and to cut Claire off. Scott tells Michael that Alexis wants the office to know she loves him. Jean puts Allison in \"Diane\"'s apartment and she finds and begins to listen to tapes Jean has. Michael and Sidney meet when he goes to the coffee shop to buy Jean coffee, alarming Jean. Sidney uploads a photo of herself and Jean to social media, after promising not to. Jean reignites her sex life with Michael by using techniques Sam used on Sidney and tells him to never go to her coffee shop again.\n\n9 \"Neverland\" Coky Giedroyc Sean Jablonksi & Jessica Mecklenburg June 30, 2017 ( )\n\nAllison's mom shows up at Jean's office, saying she has not seen or heard from Allison in days. She also reveals that Allison lives with her, she is in perfect health, that Allison is supposed to be there four times a week, and she doesn't know who Allison's boyfriend is. Jean is shocked and refuses to offer any details to her mother; Jean later lies to her colleagues about what Allison's mother was doing there, but they really do not buy it. Jean meets with a doctor about Dolly's ADHD who prescribes Dolly medicine that Jean wants just to straighten out Dolly's gender issues. Sam tells Jean he thinks she keeps pushing Sidney on him so she can continue to control him, so he tells her their sessions are over. Michael confronts Alexis about starting the rumor about them in Texas and tells her he does have feelings for her, but he is still mad at her. Nancy comes to visit and bothers Jean which causes her to cut Dolly's hair to bother Nancy. Sidney nervously tells Jean that Sam is engaged to Emily and that she is afraid everyone in her life is leaving her, including Jean who won't tell her about her life. Jean calls Sam and asks to meet. Before Dolly's play, Jean gets a call from an unknown number but does not answer it. At the end of the play, Jean hears a voicemail from a frantic Allison begging her to quickly call her back before she gets a call from Gary who tells her that Allison is missing.\n\n10 \"Black Barn\" Coky Giedroyc Lisa Rubin June 30, 2017 ( )", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/4/44/Gypsy%2C_season_one_poster.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/44/Gypsy%2C_season_one_poster.jpg/250px-Gypsy%2C_season_one_poster.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/44/Gypsy%2C_season_one_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gypsy_(TV_series)", "title": "Gypsy (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/44/Gypsy%2C_season_one_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}