{"url": "https://web.archive.org/web/20171228182821/http://www.someonesbones.com/blog/delta-force-raids-obama-stronghold-in-thailand/", "text": "Delta Force Raids Obama Stronghold in Thailand\n\nDuring the pre-dawn hours on Christmas Day, Delta Force operators launched a precision strike against an Obama-controlled stronghold in Thailand, says an active Secret Service agent who claims President Trump green lit the operation following a series of telephone calls to United States military commanders and to Thailand Prime Minister Prayut Chan-o-cha.\n\nA Delta detachment, known as 1-SFOD in the Special Operations community, flew from Okinawa, Japan to the United States Embassy in Bangkok, and held position while Trump cleared the insurgency with his Thai counterparts.\n\nAccording to our source, the Trump administration learned that Obama, by proxy, owned a mansion and a 400-acre estate on the outskirts of the city of Si Sa Ket, approximately 500 km from Bangkok. On paper, the land was owned by the allegedly defunct Solyndra Corporation, a startup solar company to which Obama gave 2.2 billion taxpayer dollars in 2009. Shortly thereafter, Solyndra declared bankruptcy, and the money vanished. Despite apparent poverty, Solyndra maintained real estate holdings valued at over 800 million dollars in a half-dozen Southeast Asian countries. The Trump administration connected the dots, linking Obama to the Thai property, after asserting Presidential privilege and subpoenaing flight records that demonstrably proved Obama had travelled to Si Sa Ket six times as president and an additional four times in the past year.\n\nIn a June 2009 edition of the Washington Beacon, conservative author Thomas Clearwater wrote, “Solyndra does not appear to be a legitimate institution, and is likely a shell company or slush fund used or owned by Obama to launder his dirty money.”\n\nOur Secret Service source supports that contention.\n\n“Obama holds real estate, vast sums of currency, and shadow companies across the globe, under many aliases. He doesn’t keep them in his name, as that would be too conspicuous. The administration has learned about many of them and has been working with foreign governments to seize Obama’s illicitly gained assets. Many of these nations are not exactly friendly to the United States; we don’t know what Trump offered in exchange for rights to seize assets in non-extradition countries or put special operations boots on the ground on foreign soil. I’m sure the price way high. Clandestine missions are occurring right now. The Solyndra mansion was just one of many,” our source explained.\n\nAt 3:00 am (local time), a pair of helicopters, including decoy craft, airlifted Delta to its destination. They found the mansion deserted; however, according to our source, the dwelling had been recently occupied. The unit commander discovered freshly chopped vegetables and lukewarm coffee in the kitchen; outside fresh tire impressions lead away from the compound. Someone, our source said, must have tipped off the occupants shortly before Delta arrived on scene.\n\nStill, Delta did not leave the location empty-handed. They seized several encrypted laptops and over 200 million dollars in gold bullion, in addition to dozens of crates containing Chinese manufactured firearms and explosives. Moreover, and perhaps most disturbing, a maze of underground tunnels, ostensibly used for human trafficking, ran for miles in every direction beneath the surface. Having gathered all available evidence, they requested exfiltration and handed-off control to Thai law enforcement.\n\nUnder power granted by the ASEAN Declaration to Joint Action on Counter Terrorism, Thai officials confiscated the estate and all remaining possessions contained therein.\n\n(Visited 1,678 times, 1 visits today)", "images": ["https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/quake-280x200.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/themes/medianews-theme/images/favicon.ico", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/delta-150x150.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/10/6803-150x150.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/09/bones.gif", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/delta4-300x162.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/09/93267104_assange-150x150.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/thaimansion-300x214.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/sw-usa-280x200.png", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/09/evilobama-150x150.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/putin-280x200.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/solyndra-300x225.jpg", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/12/delta-810x410.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/uploads/2017/11/trumpputin-150x150.jpg"], "top_img": "https://web.archive.org/web/20171228182821im_/http://www.someonesbones.com/wp-content/themes/medianews-theme/images/favicon.ico", "keywords": [], "authors": ["Timothy Paterson", "Minion Man", "Del Simmons", "Michael Kosak"], "canonical_link": "https://web.archive.org/web/20171228182821/http://www.someonesbones.com/blog/delta-force-raids-obama-stronghold-in-thailand/", "title": "Delta Force Raids Obama Stronghold in Thailand", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "generator": "WordPress 4.9.1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}