{"url": "https://www.usmagazine.com/entertainment/news/celebrity-big-brother-winner-marissa-jaret-winokur-read-her-qa/", "text": "Cheers to the first Celebrity Big Brother winner! Marissa Jaret Winokur took home the $250,000 grand prize on Sunday, February 25 — with her BFF Ross Mathews by her side. The houseguests immediately clicked on the CBS series, and agreed to have each other’s backs until the very end. So much so, that Winokur chose him to be in the final two with her even though the TV personality had a very big chance at winning.\n\n“I had to choose Ross. Listen, my whole game was about trying to stay as true and honest to everybody as I possibly could so the idea of not choosing him was not an option. He saved me against Brandi [Glanville], a friend of his from the outside world. And he saved me against James [Maslow] who absolutely could have played a game with him longer. So once he saved me those two times I knew that was my only play,” the Broadway vet, 45, exclusively tells Us Weekly. “I wasn’t even playing [the Head of Household] to win. I was playing because I wanted Ross to win. Because I felt like we had such a great game together and I would have rather have lost to Ross than win next to someone that I might have just beat just because.”\n\nWinokur won the final HOH competition, which gave her the advantage to decide who would be sitting next to her during the finale. She saved Mathews and sent Mark McGrath and Ariadna Gutiérrez packing.\n\n“I wanted him to win. I wanted him to play his best game. I really supported him. But here’s the thing, I was just hoping Ross won so up until like halfway during the deliberations I was like, ‘Wait a second. You took Ross. You can still win!’ I was still campaigning for Ross and I forgot like, ‘Wait, you put him here. He didn’t put you here.’ I was so confused that I just won that [HOH] and I was sitting there,” she says. “I was the only one not walking around the house planning a speech. Mark and Ross and Ari — they were all walking in the house all day with speeches and I was like if I get second I’m fine. I’m not going to campaign against any of these people if anyone thinks to bring me. I want them to win. I wasn’t even answering questions! My husband was like, ‘You rambled. You didn’t know what you were saying. Until you finally clicked into saying I played my honest game and I did the best I could.’ He said, ‘Thank God you pulled it together because you basically were like vote for Ross!’”\n\nFor more, read the rest of her Q&A:\n\nUs: Ross said multiple times he would bring Mark to the final two. Have you spoken to Ross about that?\n\nMJW: I can see in Ross’ eyes during the last day or so he wasn’t taking me. I could tell. I mean look, we had spent 30 days together playing this game. I could tell he wasn’t giving me answers and he wasn’t telling me he wasn’t taking me. I think in my heart I hoped he would take me but I could tell. Honestly I wanted him to win because we were playing so good together. If it wasn’t going to be me I wanted him to win. I probably am still having a little post traumatic stress disorder right now but I’m not mad that he wasn’t going to take me. I respect that choice because I didn’t see what everyone else saw. I didn’t see that I was a threat. I figured no one is going to vote for me in the end because I haven’t really done anything here.\n\nUS: Were you surprised by how some of the votes went?\n\nMJW: Yeah, I was most surprised by Shannon [Elizabeth] to be honest. I knew Keshia [Knight Pulliam] and I had a really special relationship because people were trying to make her stay when she needed to go home to be with her baby. I didn’t care what anyone said. During that eviction people were still trying to get her to stay. It was a big deal in the house. I pulled her aside and I said, ‘It’s just you and me. You tell me what you want.’ So Keshia knew I always had her back. And then Omarosa [Manigault] I knew she really wanted a woman to win. It was Shannon’s vote that really touched my heart. We did Dancing With the Stars 10 years ago but we’ve never talked since. I barely talked to her then so we weren’t friends but I know her game and I know that I hurt her. It broke my heart that I hurt her and it did the whole time I was in the house. I felt bad. So I’m absolutely sending money to her charity.\n\nUS: You and your son Zev are just so cute. What were you telling him when you hugged him on stage?\n\nMJW: Oh my God! I was smothering him with so much love that no child should ever have. I was like, ‘I love you so much. I’ll never leave you again.’ He was like, ‘I love you! I love you! You won!’ I was so overbearing it was too much. My son and I are so close. My husband works five months in New York a year. So it’s really just me and my son half the time. We’re like a little dynamic duo the two of us.\n\nUS: You mentioned he will get a present he wanted because you won. What is it?\n\nMJW: It’s so horrible! Right before I left for Celebrity Big Brother he was like, ‘If you win Celebrity Big Brother you have to get me a Warped Wall.’ Which is that thing from American Ninja Warrior where they run up and grab onto the wood on a 14-foot wall. I was like, ‘Sure kid. If I win — not the second prize, not money if they do a prize during the show — I have to win the whole thing. If I win the whole thing then you can have a Warped Wall.’ He looked at me in the audience and he was like, ‘I get a Warped Wall!’ I was like, ‘Oh my God. I’m going to have a 14-foot Warped Wall in my backyard that my son’s going to break his arm on for sure.’\n\nUS: And side note: I loved your headbands! How many did you bring into the house and did you make any of them yourself?\n\nMJW: Oh my God, I didn’t make any of them myself. Some of them were a little mismatched so I would kind of combine some. In my mind I think I brought 10. I wear them all the time outside the house. I wear headbands because I just love them and have like 1,000 at my house. So I brought enough because my mindset was I’m going to bring stuff to share. I brought those gold eye patches that we all wore, I brought tons of sweatshirts that we all wore, James ended up taking my sweatshirt. I brought headbands because I was like, ‘How else to make friends?’\n\nUS: You always joked that you talk too much. Did you ever think that could hurt your game along the way?\n\nMJW: Yes! Oh, so much. … My biggest worry was that I was going to be in a house with a bunch of people who got annoyed by me talking. I was so stressed out. I’m 45 years old now and the night before going into the house I felt like it was high school. I was like, ‘I hope they like me. I hope I don’t annoy anybody. I hope they just are patient with me because I’m loud.’ If it weren’t for every single person in that house — the exact group that we had — I would have absolutely not been able to do the show. I can’t explain it. Even one person out would have changed the whole chemistry. Thankfully everyone in there got me and got my personality.\n\nUS: Would you do an All-Stars?\n\nMJW: I would never — this was a once in a lifetime experience. It’s so intense. … There’s a reason why people in their ‘20s do this show. I don’t know how they do it for three times the amount. We were there for 26 days. They go from 90 to 100 days. And let me tell you, it’s so intense so I don’t know how they do it. It’s mad respect to them.\n\nUS: How would you describe your experience in three words?\n\nMJW: Three words! Oh my gosh. I’ve never said three words in my life. Extraordinary, emotional and joyous.", "images": ["https://www.usmagazine.com/wp-content/uploads/2018/01/marissa-jaret-winokur.jpg?w=215", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/2018/02/marissa-jaret-winokur.jpg?w=238", "https://i1.wp.com/www.usmagazine.com/wp-content/uploads/2018/02/marissa-jaret-winokur.jpg?crop=0px%2C36px%2C802px%2C421px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/2018/02/ross-and-marissa.jpg?w=300", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/2018/02/marissa-ross-big-brother.jpg?w=300", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i1.wp.com/www.usmagazine.com/wp-content/uploads/2018/02/marissa-jaret-winokur.jpg?crop=0px%2C36px%2C802px%2C421px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Stephanie Webber"], "canonical_link": "https://www.usmagazine.com/entertainment/news/celebrity-big-brother-winner-marissa-jaret-winokur-read-her-qa/", "title": "'Celebrity Big Brother' Winner Marissa Jaret Winokur: Read Her Q&A", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "'Celebrity Big Brother' winner Marissa Jaret Winokur opens up about Ross Mathews, her fallout with Shannon Elizabeth and more — read the Q&A", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Celebrity Big Brother's Marissa: How I Really Feel About Ross' Final Two Deal With Mark", "description": "'Celebrity Big Brother' winner Marissa Jaret Winokur opens up about Ross Mathews, her fallout with Shannon Elizabeth and more — read the Q&A", "url": "https://www.usmagazine.com/entertainment/news/celebrity-big-brother-winner-marissa-jaret-winokur-read-her-qa/", "site_name": "Us Weekly", "image": {"identifier": "https://i1.wp.com/www.usmagazine.com/wp-content/uploads/2018/02/marissa-jaret-winokur.jpg?crop=0px%2C36px%2C802px%2C421px&resize=1200%2C630&ssl=1", "secure_url": "https://i1.wp.com/www.usmagazine.com/wp-content/uploads/2018/02/marissa-jaret-winokur.jpg?crop=0px%2C36px%2C802px%2C421px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "section": "Entertainment", "published_time": "2018-02-27T13:39:02+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "'Celebrity Big Brother' winner Marissa Jaret Winokur opens up about Ross Mathews, her fallout with Shannon Elizabeth and more — read the Q&A", "title": "Celebrity Big Brother's Marissa: How I Really Feel About Ross' Final Two Deal With Mark", "site": "@usweekly", "image": "https://i1.wp.com/www.usmagazine.com/wp-content/uploads/2018/02/marissa-jaret-winokur.jpg?crop=0px%2C36px%2C802px%2C421px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1519738742.0, "source": "https://www.usmagazine.com", "summary": ""}