{"url": "https://people.com/tv/teen-mom-jenelle-evans-husband-david-eason-alleged-homophobic-tweets/", "text": "Many Teen Mom viewers are outraged over homophobic tweets allegedly posted by Jenelle Evans‘ husband David Eason this week.\n\nThe MTV star — who shares a 1-year-old daughter, Ensley, with Evans, and has two kids from previous relationships — allegedly referred to gay and transgender people as “abominations.”\n\nGet push notifications with news, features and more.\n\nEason’s Twitter account has since been taken down, but screenshots of the alleged tweets continue to circulate. MTV did not immediately respond to PEOPLE’s request for comment.\n\nAfter sharing a news story about the possibility of allowing those with concealed carry permits to bring guns onto school property, Eason allegedly tweeted: “It only makes sense to protect our kids the proper way… the only way we know how.”\n\nOne Twitter user then suggested that instead of protecting kids with guns, we arm them with “education” and “intentional parenting.”\n\n“No, you are wrong,” Eason allegedly replied. “Please tell me sir, how do you propose we make all the people in America start being better parents? Or are you a monkeys uncle?”\n\nImage zoom Jenelle Evans and David Eason Bruce Glikas/FilmMagic\n\nThe same Twitter user then called on Eason to stop “glorifying assault rifles” and teach his children “how to solve problems without calling people names or using force.”\n\n“And just what makes you think you have the right to tell me how to be a parent? Because you think you know me?” Eason allegedly responded. “Lmao why don’t you go tell the homo and transgender parents to start teaching their kids better morals? Oh I forgot that’s supposed to be normal.”\n\nRELATED: ‘I Finally Snagged a Good Man’ — Teen Mom‘s Jenelle Evans on Finding Love with David Eason After a String of Broken Relationships\n\nAnother Twitter user then waded in, asking if Eason was going to teach his children “to hate gay and transgender people.”\n\n“No, I’m going to teach them not to associate with them or be that way,” he allegedly responded. “If you lay down with dogs you get up with fleas.”\n\nRELATED VIDEO: Jenelle Evans’ Ex Kieffer Delp Reportedly Arrested in Suspected Meth Lab Bust\n\nFans are now calling on MTV to fire Eason, 29.\n\n“You know, @MTV, for a network that claims to be tolerant and inclusive of the LGBT community, I have to say I’m shocked you’d still associate with ignorant, bigoted trash like David Eason,” user @BuyMeASlushie tweeted. “Are you seriously going to support someone who equates LGBT people to flea-ridden dogs?”\n\n“This is the type of person that’s allowed on tv, the type of person that’ paid by @mtv & @Viacom, and the type of person our youth is influenced by!” user @ImFcknRakin wrote. “We need to take a stand for gender equality and show our youth they’re loved no matter who they grow up to be! FIRE DAVID EASON!”\n\nOn Tuesday, Evans issued a statement to TMZ defending her husband.\n\n“David didn’t understand how offensive people would get or how Twitter even works. Now that he realizes his voice is very strong within media/tabloids he has deactivated his account. He agrees he will keep his comments to himself from now on,” she said. “David doesn’t hate people from the LGBT community. My old manager was gay and used to be one of me and Davids close friends. We attended Farrah’s birthday in Miami with a lot of LGBT people there and he didn’t act in any type of way. We went had a good time and left. We are sorry for the comments that were made.”\n\nEvans’ relationship with Eason was a point of contention on the most recent season of Teen Mom 2: Evans, 26, threatened to quit the show after an episode exposing the couple’s marital tensions aired. Evans later told PEOPLE that she couldn’t stop crying after watching it and felt as though she is “always portrayed as ‘the bad one’ to them no matter how much I change.”\n\nRELATED: Jenelle Evans Denies That Her Husband Abuses Her Son Kaiser — ‘David Is Super Protective’\n\n“I don’t like the fact that I’ve changed for the better and [I am] happily married, yet [people] perceive David as some angry dad that gets annoyed by his children,” she said. “Or, if MTV does not have the drama from the storyline they want, they try to create drama as hard as they can.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjenelle-evans2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjenelle-evans2.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjenelle-evans2.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/teen-mom-jenelle-evans-husband-david-eason-alleged-homophobic-tweets/", "title": "Teen Mom: David Eason Under Fire for Alleged Homophobic Tweets", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Jenelle Evans,LGBT Rights,News,Teen Mom,TV", "news_keywords": "Jenelle Evans,LGBT Rights,News,Teen Mom,TV", "description": "\"If you lay down with dogs you get up with fleas,\" Eason allegedly tweeted, referring to gay and transgender people", "og": {"title": "Teen Mom Fans Demand MTV Fire Jenelle Evans' Husband David Eason Over Alleged Homophobic Tweets", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/teen-mom-jenelle-evans-husband-david-eason-alleged-homophobic-tweets/", "description": "Many&nbsp;Teen Mom&nbsp;viewers are outraged over homophobic tweets allegedly posted by Jenelle Evans‘ husband David Eason this week. The MTV star — who shares a 1-year-old&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjenelle-evans2.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/teen-mom-jenelle-evans-husband-david-eason-alleged-homophobic-tweets/", "description": "\"If you lay down with dogs you get up with fleas,\" Eason allegedly tweeted, referring to gay and transgender people", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjenelle-evans2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/teen-mom-jenelle-evans-husband-david-eason-alleged-homophobic-tweets/", "title": "Teen Mom Fans Demand MTV Fire Jenelle Evans' Husband David Eason Over Alleged Homophobic Tweets", "description": "\"If you lay down with dogs you get up with fleas,\" Eason allegedly tweeted, referring to gay and transgender people", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjenelle-evans2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}