{"url": "time.com/money/5108647/jay-z-net-worth/", "text": "Last year, Shawn “Jay-Z” Carter pulled within a hair of beating out Diddy as the wealthiest man in hip-hop. The rapper’s net worth amounted to $810 million, according to Forbes—just $10 million short of Diddy’s total worth.\n\nBut with a series of massive business contracts, lofty real estate purchases and a successful album release and tour, 2018 may be the year Jay-Z’s net worth makes him the king of hip-hop.\n\nHere are all the ways Jay-Z has made, and is currently making, his money.\n\nJay-Z Albums\n\nAlbums aren’t really the way musicians make money nowadays—but Jay-Z started out as an entertainer, and his music is what put him on the map and paved the way for his future success. He’s been making music since the mid-1990s, and has racked up 14 No. 1 albums, according to Billboard—including his latest, last year’s 4:44, which included the songs Smile (which won him a GLAAD nomination) and Family Feud.\n\nHis best-selling album is 1998’s Vol. 2… Hard Knock Life, Billboard reports, but other winners have included The Blueprint (volumes 1, 2, and 3), The Black Album, and Magna Carta … Holy Grail.\n\nLive Nation Contract and Concerts\n\nJAY-Z performs at Honda Center on Oct. 27, 2017 in Anaheim, Calif. Timothy Norris—Getty Images for ABA Timothy Norris—Getty Images for ABA\n\nLast May, Jay-Z inked a deal worth a whopping $200 million over 10 years with entertainment conglomerate Live Nation Entertainment. The deal appears to have focused on live music and touring. Jay-Z’s 4:44 Tour concerts in November and December grossed a total of $48.7 million, according to Billboard, amounting to about $1.5 million per show.\n\nHis two previous tours, the Magna Carta Tour (in 2013-2014) and the Blueprint 3 Tour (2009-2010), grossed 37.4 million and $33.1 million in ticket sales, respectively, Billboard estimates.\n\nRoc-A-Fella Records\n\nJay-Z’s knack for business first took off when he founded Roc-A-Fella Records with fellow East Coast rappers Damon Dash and Kareem “Biggs” Burke in 1994, according to MTV News.\n\nRoc-A-Fella began as an independent label for Carter, Dash and Burke after they’d been snubbed by established labels, but grew into a powerhouse that released most of Jay-Z’s critically acclaimed albums, and gave artists like Cam’ron and Kanye West their launch pad.\n\nIn 1997, Carter, Dash and Burke sold half of Roc-A-Fella to Def Jam Recordings, one of the most prominent record labels in hip hop, for $1.5 million. Def Jam later bought the rest of Roc-A-Fella in 2004 for an additional $10 million. Jay-Z took over as president of Def Jam Recordings in 2004 for three years, and later created another successful entertainment label, Roc Nation.\n\nRoc Nation Sports\n\nJay-Z isn’t just a master at cultivating musical talent.\n\nShortly after forming Roc Nation, Jay-Z launched a sports management division of the company in a joint project with L.A.-based talent agency Creative Artists Agency. Roc Nation Sports boasts some of the country’s most well known athletes, with a roster that includes Kevin Durant, Dez Bryant, Leonard Fournette and Robinson Canó.\n\nRoc Nation Sports is Jay-Z’s second foray into the sports business: He previously owned a small stake in the Brooklyn Nets, helping the team orchestrate their move from New Jersey to Brooklyn. But in 2013 Jay-Z sold his share for $500,000. He reportedly was to get an additional $1.5 million from selling his stake in the Barclays Center—the Brooklyn arena that opened in 2012 and is home to the Nets—shortly after, according to Forbes.\n\nTidal\n\nUsher, Rihanna, Nicki Minaj, Madonna, Dead Mouse, Kanye West, Jay Z, Jason Aldean, Jack White, Daft Punk, Beyonce and Win Butler attend the Tidal launch event on March 30, 2015 in New York City. Kevin Mazur—Getty Images Kevin Mazur—Getty Images\n\nJay-Z’s current big music venture is the streaming service Tidal, which he co-owns with two-dozen other artists. Back in 2015, Jay-Z spent $56 million to buy the Swedish company that first launched Tidal. Artists like Rihanna and Beyoncé (Jay-Z’s wife) have launched music exclusively on Tidal.\n\nThe rapper-turned-businessman said he went into streaming to create a platform that makes sure artists get compensated. Spotify has come under pressure from artists in the past for not paying enough royalties; a report from The Verge found some musicians get just 15% to 20% of streaming revenue, and the average “per stream” payout is somewhere between $0.006 to $0.0084.\n\n“I’m just saying the producers and people who work on music are getting left out—that’s when it starts getting criminal,” Jay-Z said in an interview with Billboard at the time he bought Tidal. “It’s like you’re working hard and you’re not receiving.”\n\nDespite a rocky start, Tidal sold a 33% stake to Sprint in early 2017 for $200 million, CNN reported—a deal that valued the company at $600 million. As part of the deal, Sprint users get free access to Tidal for a limited time.\n\nJay-Z and Beyoncé Marriage\n\nOf course, Jay-Z is not the only money maker in his family. Beyoncé has both a pop track record and a fortune of her own—indeed, Forbes puts Beyoncé’s net worth at $350 million.\n\nThe two have also worked together over the years, collaborating on tracks such as Drunk in Love and Family Feud.\n\nOther Ventures\n\nAs if Jay-Z weren’t busy enough, he has several other business projects and partnerships that have helped build his total net worth and cement his status as a mogul.\n\n• Clothing\n\nJay-Z launched the clothing line Rocawear with Dash in 1999, and at one point had annual sales of over $700 million. However, personal issues between the company’s founders eventually led to its 2007 sale to Iconix Brand Group for $204 million in cash. There have also been recent reports that Jay-Z would be launching a new clothing line, apparently to be called AKA Shawn Carter.\n\n• Bar/Restaurant\n\nJay-Z opened 40/40 Club, a high-end sports bar and restaurant in New York City, in 2003. Since then, he has expanded the club to add two other locations, one in Brooklyn and another in Atlanta.\n\nJay-Z made massive renovations to the flagship restaurant in NYC a few years back, reopening it in January 2012 with a party attended by Warren Buffett and Spike Lee.\n\n• Champagne\n\nJay-Z bought the luxury French champagne brand Armand de Brignac for an undisclosed amount in 2014. While it’s not clear how much money the brand generates for him, its bottles have retailed for as much as $200,000, according to the New York Times; a more recently released bottle is priced at $850.\n\n• JetSmarter\n\nThe mogul also invested $20 million in 2015 in JetSmarter, an app that brands itself as an “Uber for private jets.” JetSmarter clients pay $9,000 a year for unlimited access to private flights anywhere in the world.\n\nReal Estate\n\nFile this not under how they make their money, but how they spend it: Jay-Z and Beyoncé topped the L.A. Times’ list of most expensive home sales last year, purchasing a Bel-Air mansion for $90 million after their family got a bit bigger with the birth of their twins, Rumi and Sir. Jay-Z’s house is about 30,000 square feet and includes spa facilities, a media room and four outdoor swimming pools.\n\nThe couple also bought a $26 million Hamptons mansion last September, located on Georgica Pond. Trulia also reports that Jay and Beyoncé have homes in New Orleans and Manhattan’s Tribeca neighborhood.", "images": ["https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z-tidal.jpg", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z.jpg?quality=85", "https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z-tour.jpg", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z.jpg?quality=85", "keywords": [], "authors": ["Allana Akhtar"], "canonical_link": "https://money.com/jay-z-net-worth/", "title": "Here’s How Much Jay-Z Is Worth—and How He Makes Money", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "celebrities,celebrity,Net Worth,Wealth", "news_keywords": "jay z net worth, what is jay z net worth, how much is jay z worth, how much money does jay z have, jay z and beyonce net worth, jay z 444 tour, jay z concert, jay z barclays, jay z albums, jay z roc nation", "description": "Here's how Jay-Z grew his net worth into the billions since first arriving on the scene as a rapper in the early 90s", "og": {"title": "Here’s How Much Jay-Z Is Worth—and How He Makes Money", "type": "article", "site_name": "Money", "url": "https://money.com/jay-z-net-worth/", "description": "Music, sports, booze, and more.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/jay-z-net-worth/", "description": "Here's how Jay-Z grew his net worth into the billions since first arriving on the scene as a rapper in the early 90s", "media": "https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/jay-z-net-worth/", "title": "Here’s How Much Jay-Z Is Worth—and How He Makes Money", "description": "Music, sports, booze, and more.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/01/180119-jay-z.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}