{"url": "https://en.wikipedia.org/wiki/Judy_Sheindlin", "text": "American lawyer, judge, television personality, and author\n\nJudith Susan Sheindlin (née Blum; born October 21, 1942),[2] known professionally as Judge Judy, is an American prosecution lawyer, former Manhattan family court judge, television personality, and author. Since September 1996, Sheindlin has presided over her own successful four-time Daytime Emmy Award–winning arbitration-based court show series, Judge Judy, produced by CBS Television Distribution.[2] She stated on The Ellen DeGeneres Show she would finish up with the series after the conclusion of the 2020/2021 season, which would mark a 25 year run, as she would be launching a new series titled Judy Justice, which would be of a similar format.[3]\n\nSheindlin passed the New York state bar examination in 1965 and became a prosecutor in the family court system. In 1982 New York City Mayor Ed Koch appointed her as a judge, first in criminal court, then later as Manhattan's supervising family court judge in 1986.\n\nSheindlin is the longest-serving judge or arbitrator in courtroom-themed programming history, a distinction that earned Sheindlin a place in the Guinness World Records.[4] She has additionally received a Lifetime Achievement Emmy for her work; during the 2019 awards ceremony, comedienne Amy Poehler referred to Sheindlin as \"the Jewish mother we all want\".[5]\n\nEarly life [ edit ]\n\nSheindlin was born Judith Susan Blum in the Brooklyn borough of New York City, to a Jewish family, from Germany, Russia, and Ukraine.[6][7][2][8] She described her father as \"the greatest thing since sliced bread\" and her mother as \"a meat and potatoes kind of gal.\"[9]\n\nSheindlin attended James Madison High School in Brooklyn before going on to American University in Washington, D.C., where she graduated with a Bachelor of Arts degree, majoring in government. She finished her law school education at New York Law School, where she earned her Juris Doctor degree in 1965.[10]\n\nCareer [ edit ]\n\nSheindlin passed the New York state bar examination in 1965, the same year as her graduation, and was hired as a corporate lawyer for a cosmetics firm.[2] Within two years she became dissatisfied with her job and left to raise her two children. She was made aware of a position in the New York court system as a prosecutor in the family courts in 1972.[2] In her role as a lawyer, Sheindlin prosecuted child abuse cases, domestic violence and juvenile crime.[2]\n\nBy 1982, Sheindlin's \"no-nonsense\" attitude inspired New York Mayor Ed Koch to appoint her as a criminal court judge.[2] Four years later, she was promoted to supervising judge in the family court's Manhattan division.[2] She earned a reputation as a \"tough\" judge (though she has disagreed with the labels \"tough\" and \"harsh\"),[11] known for her fast decision-making and acerbic wit.[9]\n\nIn February 1993, Sheindlin's outspoken reputation made her the subject of a Los Angeles Times article,[12] profiling her as a woman determined to make the court system work for the common good.[2] She subsequently was featured in a segment on CBS's 60 Minutes that brought her national recognition.[2] This led to her first book, Don't Pee on My Leg and Tell Me It's Raining, published in 1996. She retired as a family court judge that same year after having heard more than 20,000 cases.[2]\n\nJudge Judy [ edit ]\n\nJudge Judy stands next to a portrait of herself (2005)\n\nAfter the 60 Minutes special on her family court career in 1993 and authoring her first book shortly thereafter (Don't Pee on My Leg and Tell Me It's Raining), Sheindlin was approached about starring in a new reality courtroom series, featuring \"real cases with real rulings.\"[10] She accepted the offer, and her ongoing syndicated court show, Judge Judy, debuted on September 16, 1996.[13] The court show's present 24th season commenced on September 9, 2019.\n\nSince its debut, Judge Judy has remained the No. 1 rated court show[14] and regularly draws approximately 9 to 10 million viewers daily.[15] During the 2009–10 television season, Judge Judy became the first TV series in nearly a decade to attract more daytime viewers than The Oprah Winfrey Show.[16] Since then, it has been the highest rated show in all of daytime television.[17]\n\nOn March 2, 2015, CBS Television Distribution and Judge Sheindlin extended their contract for another four seasons, adding to her current contract (which was set to expire after the 2016–17 season), meaning it will be on the air until at least the 2020–21 season.[18] At that point, as Judge Sheindlin revealed in a March 2020 appearance on The Ellen DeGeneres Show, the series will conclude.[19]\n\nAuthor Brendan I. Koerner has commented on the popularity of Judge Judy:\n\nCourt-show viewers don't seem to want moral conundrums or technical wrinkles. They love Sheindlin's show because she offers them a fantasy of how they'd like the justice system to operate—swiftly, and without procedural mishaps or uppity lawyers. They get to see wrongdoers publicly humiliated by a strong authority figure. There is no uncertainty after Sheindlin renders her verdict and bounds off the bench, and there certainly are no lengthy appeals.[20]\n\nA 2013 Reader's Digest poll supported Koerner's statements, revealing that Americans trusted Judge Judy more than all nine justices of the United States Supreme Court.[21]\n\nThe program has integrated itself into American popular culture.[10] In 2003, VH1 named Sheindlin one of the \"200 Greatest Pop Culture Icons.\"[22] References to Sheindlin—typically as \"Judge Judy\", though often satirical—have appeared in multitudes of television programs and other media, including ABC's Jimmy Kimmel Live!;[21] Fox's The Simpsons as Judge Constance Harm (voiced by Jane Kaczmarek); NBC's Will & Grace; UPN/The CW's America's Next Top Model; NBC's The Weakest Link; ABC's The Practice; the Academy Awards; the book America: A Citizen's Guide to Democracy Inaction by Jon Stewart;[10] a skit by Vicki Lawrence portraying Thelma Harper/Mama on \"Betty White's 2nd Annual 90th Birthday\" celebration,[23] drag queen Bianca Del Rio portraying Judge Judy on RuPaul's Drag Race, etc.\n\nSheindlin has been parodied on Saturday Night Live, The Simpsons as Judge Constance Harm, and The Amanda Show as Judge Trudy.\n\nThe Judge Judy courtroom series has earned Sheindlin numerous awards and honors, including a star on the Hollywood Walk of Fame in February 2006;[24] induction into Broadcasting & Cable's Hall of Fame in October 2012;[25][26] being awarded vice presidency of the UCD Law Society in April 2013;[27] being presented with the Gracie Allen Tribute Award from the Alliance for Women in Media;[22] being awarded the Mary Pickford Award by the Hollywood Chamber Community Foundation at the 2014 Heroes of Hollywood;[28] etc.\n\nOne award Sheindlin had difficulty winning was a Daytime Emmy Award. By 2011, her program had been nominated 14 consecutive years without winning.[29][30] In mid-2012, an article from the New York Post reported that Judge Judy was snubbed by the award show by not even being nominated that year despite being the highest-rated court show.[31] In an interview with Entertainment Tonight (ET) on May 3, 2013, Sheindlin said, \"I have my walls full of Daytime Emmy Award nominations.\" When ET's interviewer asked Sheindlin if she thought she would ever win the award, she replied:\n\nI don't know. You know, somehow it would sort of break the spell. The show has been such a tremendous success that I'm almost afraid to think about winning—because so many of those shows that did win are no longer with us. So I say to myself 'you want the Emmy or you want a job? (laughing) Which one do you want?'[32]\n\nOn June 14, 2013, Judge Judy won its first Daytime Emmy for Outstanding Legal/Courtroom Program, having received its 15th nomination.[33] The program won again in 2016 and 2017. Sheindlin's status as longest-serving judge or arbitrator in courtroom-themed programming history rewarded her a place in the Guinness World Records on September 14, 2015, as part of her court show's 20th-anniversary celebration.[4]\n\nLongevity and retirement plans [ edit ]\n\nThe only court shows that outnumber Judge Judy's seasons are The People's Court and Divorce Court—both of which have suffered cancellation(s) and gone through multiple judges or arbitrators.\n\nOn March 30, 2011, Sheindlin was admitted to the hospital after she fainted on the set of her show while handling a case. She was released the next day, and it was later learned that she suffered a mini-stroke.[34] Regarding her retirement, Sheindlin has stated that it is up to her viewers and when they tire of watching the program, which she believes will inevitably happen one day. As of the present, however, Sheindlin has stated that fans still seem to be interested and taking something out of the court show.[35] Sheindlin admits the court show is \"seductive\" and hard to give up. Sheindlin said, \"I'm not tired. I still feel engaged by what I do, and I still have people who like to watch it.\"[14]\n\nIn February 2020, Sheindlin announced that the 2020-21 season of the show will be the last, after 25 years. A new program, entitled \"Judy Justice\" is set to air in 2022.[36]\n\nSalary [ edit ]\n\nIn 2005, Sheindlin's salary was US$15 million per year.[20] Her net worth at the beginning of 2007 was $95 million, and she ranked #13 on the Forbes top 20 richest women in entertainment.[37] In July 2010 when Sheindlin's contract was renewed, her salary increased to $45 million per year. It was later reported in October 2013 that Sheindlin is the highest-paid TV star, earning $47 million per year for Judge Judy, which translates into just over $900,000 per workday (she works 52 days per year).[38] According to Forbes, Sheindlin earned $147 million, pretax, in 2017.[39]\n\nOther media appearances [ edit ]\n\nSince the success of Sheindlin's courtroom series, she has been interviewed on talk and cable news broadcasts over the course of her career. These talk and cable news programs include Entertainment Tonight, The Wendy Williams Show,[40] Katie (numerous appearances),[41] Larry King Live (numerous appearances),[42] The View (numerous appearances),[43] Donny & Marie,[44] The Talk,[45] The Tonight Show, Dateline NBC, 20/20, etc.[46] On October 17, 1998, Sheindlin made a surprise guest appearance on Saturday Night Live, comedically interrupting one of Cheri Oteri's regular parodies of her presiding on Judge Judy.[47] Also as a result of her Judge Judy show stardom, she served as a judge for the 1999 Miss America pageant.[40]\n\nEarly on in her celebrity on February 21, 2000, the Biography program aired a documentary film on Sheindlin, \"Judge Judy: Sitting in Judgment\" (later released on home video). This 60-minute documentary captured Sheindlin's entire life story (dating back to her childhood), legal career, authoring career, entertainment career, etc. The special also featured input from those closest to Sheindlin and those who knew her best.[48][49] On December 23, 2008, Sheindlin shared about her life on Shatner's Raw Nerve, in which she was interviewed by William Shatner.[50] A year later in December 2009, Sheindlin again told the story of her life, legal career, authoring career, and entertainment courtroom career from an updated perspective in a two-hour interview for Archive of American Television.[51] In a free-wheeling 60-minute interview conducted by Katie Couric on September 17, 2013, for the 92nd Street Y, Sheindlin elaborated on previously-undisclosed fun facts of her life story and long career in the family court.[52][53]\n\nAs confirmed in January 2014, a new court show conceived by Sheindlin titled Hot Bench debuted on September 15, 2014. The courtroom series features a panel of three judges debating and deciding on cases brought to their TV courtroom. Stated Sheindlin, \"When my husband Jerry and I were in Ireland recently, we visited the courts and watched a three-judge bench, which I found both fascinating and compelling. I immediately thought what a terrific and unique idea for a television program that brings the court genre to the next level. We have assembled three individuals with extremely varied backgrounds to serve as the judges. They are smart and talented, with terrific instincts and great chemistry, and are sure to create a hot bench.\" The panel of judges consists of New York State Supreme Court judge Patricia DiMango and Los Angeles attorneys Tanya Acker and Larry Bakman (Bakman has since been replaced on Hot Bench by Michael Corriero). As with Judge Judy, Hot Bench is executive-produced by Randy Douthit and produced by CBS Television Distribution.[54][55] Sheindlin originally desired the title of her personal courtroom series to be Hot Bench before producers ultimately settled on Judge Judy.[56][57][58]\n\nOn August 31, 2016, it was reported that CBS has a scripted, semi-autobiographical drama series in the works based on the life of Sheindlin. The program title will be Her Honor (which was a proposed title for Sheindlin's court show along with Hot Bench). The show has been described as following the youngest judge in New York who, while proficient at handling family court cases, has a personal life that needs work. Executive producers of the program include Sheindlin herself, Chernuchin, Arnold Kopelson and Anne Kopelson. Chernuchin was a writer for the legal drama series Law & Order.[59][60][61]\n\nIn 2017, Sheindlin created a game show called IWitness that debuted on July 10 and ran for 6 weeks. The game show puts the contestant's observational skills to the test, requiring them to view video clips and recall what they have witnessed faster than their competitors.[62] On September 17, 2017, Sheindlin appeared on the series premiere of Fox News Channel's Objectified hosted by Harvey Levin. The program's first episode took an inside look at Sheindlin's life.[63]\n\nThe National Enquirer issued a formal apology in the September 2017 edition of their magazine for false statements, defaming Sheindlin as having cheated on her husband and suffering from Alzheimer's Disease along with brain damage. In addition, they apologized to her daughter Nicole Sheindlin for defaming her as having a jail record.[64]\n\nSheindlin and her program appeared on a November 26, 2017 broadcast of Curb Your Enthusiasm, presiding over a sketch comedy court case with Larry David as the plaintiff. The pseudo-Judge Judy case took the appearance of an actual case from Sheindlin's program, taking place from the show's courtroom set with trademarked voice-over briefs, theme music and audience response.[65]\n\nIn 2018 Sheindlin appeared as a guest on Norm Macdonald Has a Show on Netflix.[66]\n\nWriting [ edit ]\n\nSheindlin has authored seven books. In 1995, Judge Sheindlin published her first book, Don't Pee On My Leg and Tell Me It's Raining, in which she offers her insight into how and why the family court fails in its mission to impact shattered families. Beauty Fades, Dumb Is Forever, her second book, was published in January 1999. Her first children's book entitled, Win or Lose By How You Choose was published in 2000, followed by You Can't Judge A Book By Its Cover the next year. Sheindlin's third book for adults, Keep It Simple, Stupid: You're Smarter Than You Look, also on the New York Times best seller list, published in 2000, shares her wisdom and opinions on solving family issues.[67] One of her more recent books, which hit shelves on April 25, 2013, was inspired by one of her advisory catch phrases encouraging romantic partners to be judicious with regards to domestic partnerships.[68] In September 2014, Sheindlin celebrated the opening of her 19th season by giving out her latest book, What Would Judy Say: Be the Hero of Your Own Story, for free.[citation needed]\n\nNon-media projects and community work [ edit ]\n\nSheindlin, along with her stepdaughter Nicole Sheindlin, is the creator, director, and spokesperson for an alliance designed to empower women, entitled \"Her Honor Mentoring\".[69][70]\n\nIn September 2017, Sheindlin funded a space for public debate at the University of Southern California.[71]\n\nPersonal life [ edit ]\n\nIn 1964, Blum married Ronald Levy, who later became a prosecutor in juvenile court. They moved to New York and had two children, Jamie and Adam,[2] and divorced in 1976 after 12 years of marriage.[2]\n\nIn 1977, she married Judge Jerry Sheindlin, who was an arbitrator on The People's Court from 1999 to 2001.[2] They divorced in 1990, partially as a result of the stress and struggles that Judy endured after her father's death that same year.[2] They remarried a year later. She has three stepchildren with Sheindlin: Gregory, Jonathan and Nicole, and 13 grandchildren.[2] Jonathan is a retinal surgeon,[72] and Greg and Nicole are lawyers. Nicole is the co-creator (along with her stepmother) of the Her Honor Mentoring program.\n\nSheindlin owns homes in several states, including Connecticut,[73] New York,[74] Florida,[75] and Wyoming.[76] She commuted to Los Angeles every other week for two to four days to tape episodes of Judge Judy.[14][74] However, in May 2013, she bought a $10.7 million condominium in the Los Angeles suburb of Beverly Hills.[77] In 2018, Judy and her husband announced spending $9 million on the Bird House, a 9,700-square-foot property on 3.67 acres in Newport, Rhode Island that was owned by Dorrance Hill Hamilton.[78]\n\nSheindlin holds honorary Doctor of Law degrees from Elizabethtown College and the University at Albany, SUNY.[67]\n\nSheindlin is a registered Independent.[79] She is a supporter of same-sex marriage and,[43] although she has said that she is not a supporter of \"big government\", she believes that the issue of same-sex marriage should be handled at the federal level rather than on a state-by-state basis.[80] Sheindlin has stated that she is in favor of increasing requirements for gun ownership.[81] She prefers not to be labelled by political terms, and states that she is not registered with any political party. When asked about the 2012 presidential elections, Sheindlin stated that while she voted for President Barack Obama in 2008 (as well as voting for Ronald Reagan and Bill Clinton, respectively in 1980 and 1984, and 1992 and 1996), she did not care for either of the leading candidates in the 2012 United States presidential election.[82] In October 2019 Sheindlin penned an op-ed endorsing Michael Bloomberg for president, despite the fact that he had not announced a campaign.[83][84] In January 2020 she released an ad supporting him saying, in part, \"I like to say you can judge someone's character by what they've done; Mike Bloomberg has done amazing things, and will be a truly great president\".[84][85] She later campaigned alongside him.[86]\n\nLegal issues [ edit ]\n\nIn March 2013, a lawsuit was filed against Sheindlin by Patrice Jones, the estranged wife of Randy Douthit, executive producer of the Judge Judy court show. Jones alleged Douthit and Sheindlin had conspired to permit Sheindlin to buy Christofle fine china and Marley cutlery owned by Jones. She said Sheindlin had paid Douthit $50,815 for the items without her knowledge to deprive her of her valuables,[87] and she sought $514,421 from Sheindlin. The suit was settled out of court after Sheindlin returned the tableware to Douthit, and Jones agreed to pay him $12,500 and have the tableware handed back to her.[88]\n\nOn March 12, 2014, Sheindlin filed a lawsuit for the first time in her life. It was filed against Hartford, Connecticut personal injury lawyer John Haymond and his law firm. In the lawsuit, Sheindlin accused Haymond and his firm of using her television image without consent in advertisements that falsely suggested she endorsed him and his firm. Sheindlin's producer allegedly told the firm that use of her image is not permitted in March 2013, but ads continued to be produced. The lawsuit filed in federal court sought more than $75,000 in damages. Sheindlin said in her statement that any money she wins through the lawsuit will go toward college scholarships through the Her Honor Mentoring program. Sheindlin further stated, \"Mr. Haymond is a lawyer and should know better. The unauthorized use of my name is outrageous and requires legal action.\"[89][90][91] Haymond later filed a countersuit for punitive damages and attorney's fees, alleging defamation of him and his firm by Sheindlin.[92] Haymond insisted that local affiliates asked him to appear in Judge Judy promos to promote Sheindlin for which he obliged.[93][94] On August 8, 2014, it was reported that the case between Sheindlin and Haymond settled out of court in a resolution that favored Sheindlin. Haymond will be donating money to Sheindlin's charity, Her Honor Mentoring.[95]\n\nWorks [ edit ]\n\nFurther reading [ edit ]\n\nJazmine Hughes, \"Judge Judy is Still Judging You,\" New York Times Magazine, June 20, 2019.\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/1200px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/220px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Johnny-automatic-scales-of-justice.svg/24px-Johnny-automatic-scales-of-justice.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Judge_Judy_next_to_painting.jpg/220px-Judge_Judy_next_to_painting.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/1200px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Judy_Sheindlin", "title": "Judy Sheindlin", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/1200px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}