{"url": "www.inquisitr.com/4852661/channing-tatum-jenna-dewan-jealousy-bitter-fights-led-to-split-reports-radar-online/", "text": "Channing Tatum and Jenna Dewan officially announced their split on Monday night after months of speculation that the couple was heading for a divorce. Fans were stunned to hear the news that the pair had decided to end their nine-year marriage and couldn’t help but wonder what caused the sad breakup.\n\nAccording to an April 3 report by Radar Online, there were many factors that led to the end of Channing Tatum and Jenna Dewan’s marriage. The first is likely the fact that Tatum wanted to have more children. The actor and his estranged wife are the parents of one daughter, Everly, but it seems that the Magic Mike star wanted a bigger family, which is something that Dewan didn’t seem to be on board with. A past report by OK! Magazine claims that Jenna wanted to get back into acting and that caring for a newborn would derail those plans.\n\nThe baby battle allegedly continued for Channing Tatum and Jenna Dewan when the actress got tired of being a housewife while her husband spent his time on movie sets. A source revealed that Tatum made more than enough money to support the family and that he wanted Dewan at home with little Everly so she would not be raised by nannies.\n\nThe jealousy allegedly began to rise in Jenna Dewan as Channing Tatum hit new levels of success with movies like 21 Jump Street, Magic Mike, and their sequels. The pair met on the set of the film Step Up as equals in their careers, but Channing’s celebrity surpassed Jenna’s over the years. However, that wasn’t all Jenna was reportedly jealous of.\n\nChanning Tatum has become a sex symbol in Hollywood, and women flock to him wherever he goes. The actor will often create a gaggle of girls and women around him, and sources claim that Jenna Dewan hated the way her husband flirted with fans in front of her. Although many fans deemed the pair as the perfect couple, Dewan told the media earlier this year that they are far from perfect and “fight” just like any other couple would.\n\nChanning Tatum and Jenna Dewan released an official statement on their split via social media and revealed they would make no further comments on the end of their marriage going forward.", "images": ["https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2018/04/Channing-Tatum-and-Jenna-Dewan-split.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4852661/channing-tatum-jenna-dewan-jealousy-bitter-fights-led-to-split-reports-radar-online/", "title": "Channing Tatum & Jenna Dewan: Jealousy & ‘Bitter’ Fights Led To Split, Reports ‘Radar Online’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}