{"url": "https://en.wikipedia.org/wiki/Jet_Li", "text": "Singaporean martial artist and actor\n\nLi Lianjie (courtesy name Yangzhong; born 26 April 1963),[1] better known by his stage name Jet Li, is a Chinese film actor, film producer, martial artist, and retired Wushu champion who was born in Beijing. He is a naturalized Singaporean citizen.[2]\n\nAfter three years of training with acclaimed Wushu teacher Wu Bin, Li won his first national championship for the Beijing Wushu Team. After retiring from competitive Wushu at age 19, he went on to win great acclaim in China as an actor, making his debut with the film Shaolin Temple (1982). He went on to star in many critically acclaimed martial arts epic films, most notably as the lead in Zhang Yimou's Hero (2002), Fist of Legend (1994), and the first three films in the Once Upon a Time in China series (1991–1993), in which he portrayed folk hero Wong Fei-hung.\n\nLi's first role in a non-Chinese film was as a villain in Lethal Weapon 4 (1998), and his first leading role in a Hollywood film was as Han Sing in Romeo Must Die (2000). He has gone on to star in many international action films, including in French cinema with the Luc Besson-produced films Kiss of the Dragon (2001) and Unleashed (2005). He co-starred in The One (2001) and War (2007) with Jason Statham, The Forbidden Kingdom (2008) with Jackie Chan, all three of The Expendables films with Sylvester Stallone, and as the title character villain in The Mummy: Tomb of the Dragon Emperor (2008).\n\nEarly life and martial arts career [ edit ]\n\nLi was born in Beijing, China and was the youngest of two boys and two girls. When he was two years old, his father died and his family then lived in poverty.[3]\n\nLi was eight when his talent for Wushu was noticed as he practiced at a school summer course.[4] He then attended a non-sparring wushu event, followed by joining the Beijing Wushu Team which did a martial art display at the All China Games. Renowned coaches Li Junfeng and Wu Bin,[5] made extra efforts to help the talented boy develop. Wu Bin even bought food for Li's family because they could not afford to buy meat, which was essential for an athletes physical condition.[5] A very young Li competed against adults, in the Chinese Wushu Championships and won fifteen gold medals and one silver medal.[6]\n\nMy winning first place caused quite a sensation because I was so young. I was 12 years old, and the other two medalists were in their mid- to late twenties. During the awards ceremony, as I stood on the top step of the podium, I was still shorter than the 2nd and 3rd place medalists. It must have been quite a sight. Jet Li China's Internet Celebrity[7]\n\nAccording to Li, once, as a child, when the Chinese National Wushu Team went to perform for President Richard Nixon in the United States, he was asked by Nixon to be his personal bodyguard. Li replied, \"I don't want to protect any individual. When I grow up, I want to defend my one billion Chinese countrymen!\"[8]\n\nLi is a master of several styles of wushu, especially Chángquán (Northern Longfist Style) and Fānziquán (Tumbling Fist). He has also studied other arts including Baguazhang (Eight Trigram Palm), Taijiquan (Supreme Ultimate Fist), Xing Yi Quan (Shape Intent Fist), Zui Quan (Drunken Fist), Ying Zhao Quan (Eagle Claw Fist) and Tanglangquan (Praying Mantis Fist). He did not learn Nanquan (Southern Fist), because his training focused only in the Northern Shaolin Styles. He has also mastered wushu's main weapons, such as Sanjiegun (Three Section Staff), Gùn, Dao (Broadsword), Jian (Straight Sword).[9] Jet Li's martial arts prowess contributed to his domestic and international fame.[10]\n\nActing career [ edit ]\n\nChinese films [ edit ]\n\nThe fame gained by his sports winnings led to a career as a martial arts film star, beginning in mainland China and then continuing into Hong Kong. Li acquired his screen name in 1982 in the Philippines when a publicity company thought his real name was too hard to pronounce. They likened his career to an aircraft, which likewise \"takes-off\" as quickly, so they placed the name Jet Li on the movie posters. Soon everybody was calling him by this new name, which was also based on the nickname, \"Jet,\" given to him as a young student, due to his speed and grace when training with the Beijing Wushu team. He made his debut with the 1982 film Shaolin Temple. Some of his more famous Chinese films include:\n\nLi starred in the 1995 film High Risk, where Jet Li plays a Captain who becomes disillusioned after his wife is murdered by crime lords. Along the way, he pairs up with a wacky sell-out actor, Frankie (played by Jacky Cheung), and proceeds to engage in a series of violent battles in a high-rise building. The setting is similar to that of Die Hard and both their Chinese film titles. This movie is notable in that director Wong Jing had such a terrible experience working with Jackie Chan in Jing's previous film City Hunter that he chose to make Cheung's character a biting satire of Chan. Jet Li would later publicly apologise to Chan for taking part in it.\n\nLi had two wuxia feature films released in 2011, The Sorcerer and the White Snake and Flying Swords of Dragon Gate; the latter was helmed by Tsui Hark.\n\nTo promote tai chi, in 2012 Jet Li starred in a film titled Tai Chi and co-produced the movie with Chen Kuo-Fu. Li portrayed Tai Chi master Yang Luchan.[11][12]\n\nAmerican/Western films [ edit ]\n\nIn 1998, he made his American film debut in Lethal Weapon 4 which also marked the first time he had ever played a villain in a film. He agreed to do Lethal Weapon 4 after the producer Joel Silver promised to give him the leading role in his next film, Romeo Must Die (2000), alongside late singer Aaliyah. The film became a box office hit. Though Li spoke very little English at the time of production, his performance as Chinese mafia hitman Wah Sing Ku was praised.[13][14]\n\nLi turned down Chow Yun-fat's role in Crouching Tiger, Hidden Dragon (2000) because he promised his wife that he would not make any films during her pregnancy.[15] He also turned down the role of Seraph in The Matrix trilogy, based on his belief that the role was not one which required his skills and that the films were iconic and stunning enough without adding his name to the cast list. Li was also cast as Kato in The Green Hornet when the film was still in development in 2000. In 2001, it was moved to another studio. When the film was moved on again and released in 2011, the role of Kato was portrayed by Jay Chou.\n\nIn 2001, he appeared in two more films: The One, which was the first of his films with Jason Statham, and Kiss of the Dragon opposite Bridget Fonda which did moderately well at the box office. In July 2001, Li agreed to produce and star in an action film with Jackie Chan which was to be released in 2002 or 2003, but no further news of their collaboration surfaced until 2006. In 2002, the period martial arts epic film Hero was released in the Chinese market. This film was both a commercial and critical success and became the highest-grossing motion picture in Chinese film history at the time.[16] In 2003 he reunited with producer Joel Silver for the action thriller film Cradle 2 the Grave where he starred alongside rapper DMX and fellow martial artist Mark Dacascos. In 2004, Li lent his likeness, voice and provided motion capture work for the video game Jet Li: Rise to Honor.\n\nLi was presented the Visionary Award by East West Players, the oldest Asian American theatre in the United States,[17] in 2002 by contemporary John Woo. The award recognizes \"artists who have raised the visibility of the Asian Pacific American community through theater, film and television.\"[18] He delivered his acceptance speech in his native language of Mandarin.[19]\n\nLi took on a more serious role in the 2005 film, Unleashed (a.k.a. Danny the Dog), where he portrayed an adult with the mentality of a child who has been raised like an animal. Although his martial arts skills were used extensively, it was a somber film with more depth than had been previously seen in Li's films, and co-starred dramatic actors Bob Hoskins and Morgan Freeman.\n\nIn 2006, the martial arts film epic Fearless, was released worldwide. Although he will continue to make martial arts films, Fearless is his last wushu epic.[20] In Fearless, he played Huo Yuanjia, the real-life founder of Chin Woo Athletic Association, who reportedly defeated foreign boxers and Japanese martial artists in publicised events at a time when China's power was seen as eroding. Together with the film Fist of Legend, Li has portrayed both Chen Jun, the student and avenger of Huo Yuanjia (a.k.a. Fok Yun Gap), as well as Huo Yuanjia himself. Fearless was released on 26 January 2006 in Hong Kong, followed by a 22 September 2006 release in the United States where it reached second place in its first weekend.\n\nI stepped into the martial arts movie market when I was only 16. I think I have proved my ability in this field and it won't make sense for me to continue for another five or 10 years. Huo Yuanjia is a conclusion to my life as a martial arts star.[21]\n\nLi has stated in an interview with the Shenzhen Daily newspaper that this will be his last martial arts epic, which is also stated in the film's television promotions. However, he plans to continue his film career in other genres. Specifically, he plans to continue acting in epic action and martial arts films dealing more with religious and philosophical issues.[citation needed]\n\nLi's 2007 Hollywood film, War, was released in August of that year, and re-teamed him with actor Jason Statham, who previously starred with him in The One, and action choreographer Corey Yuen. War raked in a disappointing US$23 million at the box office, becoming one of Li's lowest grossers in America; however, it was a hit on video, accumulating nearly US$52 million in rental revenue, more than doubling its box office take.[22] With the exception of Romeo Must Die and the worldwide release of Hero, most of Li's American/Western films have been only modest hits like Kiss of the Dragon, The One, Unleashed, Cradle 2 the Grave, and the worldwide release of Fearless.\n\nHe has a very good control of the strength of every fist and kick. In the past, he used too much strength, those that get hit would be in great pain. He's the archetype of power. […] Yes, he's still the best. Yuen Woo-ping martial arts choreographer[23]\n\nIn late 2007, Li returned again to China to participate in the China/Hong Kong co-production of the period war film The Warlords with Andy Lau and Takeshi Kaneshiro. This film, with its focus on dramatics rather than martial arts, netted Li the Hong Kong Film Award for Best Actor.\n\nLi and fellow martial arts veteran Jackie Chan finally appeared together onscreen for the first time in The Forbidden Kingdom, which began filming in May 2007 and was released to critical and commercial success on 18 April 2008. The film was based on the legend of the Monkey King from the Chinese folk novel Journey to the West.[24][25] Li also starred as the lead villain in the fantasy action film The Mummy: Tomb of the Dragon Emperor with actors Brendan Fraser, Isabella Leong and Michelle Yeoh.[26]\n\nAfter a one-year hiatus from filmmaking, Jet Li returned to acting in 2010, portraying a mercenary in the film The Expendables, teaming up with action stars Sylvester Stallone, Jason Statham, Dolph Lundgren, Mickey Rourke, Eric Roberts, Steve Austin, Terry Crews, and Randy Couture. It was the third time he had teamed up with Statham. In 2012, he reprised his role briefly in the sequel The Expendables 2 and returned for the third film The Expendables 3 in 2014. Li was initially stated to be appearing with Vin Diesel in XXX: Return of Xander Cage, but according to a Facebook post by Diesel, Li was replaced by Donnie Yen.[27][28][29]\n\nLi was cast as the Emperor of China for the 2020 live action movie, Mulan.[30]\n\nPersonal life [ edit ]\n\nLi is a practitioner of Tibetan Buddhism.[31] His master is Lho Kunsang.[32]\n\nIn 1987, Li married Beijing Wushu Team member and Kids from Shaolin co-star Huang Qiuyan,[33] with whom he has two daughters, Si and Taimi.[34] They divorced in 1990. In 1999, Li married Nina Li Chi (born Li Zhi), a Shanghai-born, Hong Kong-based actress. He has two daughters with her, Jane (born 2000) and Jada (born 2002).[35]\n\nHe was in the Maldives when a tsunami hit during the 2004 Indian Ocean earthquake. Although it was widely reported at the time that he had died during the disaster,[36] he only suffered a minor foot injury, caused by a piece of floating furniture while he was guiding his 4-year-old daughter Jane and the nanny holding his 1-year-old daughter Jada to safety of higher ground amid dangerously rising ocean water. The four of them were by the pool and slightly above the beach when the wave came ashore, barely escaping to the upper floors of a hotel building.[37]\n\nIn 2009, Li, who previously had US citizenship after years working in the United States, renounced his US citizenship.[2][38] He was thought to have taken up Singaporean citizenship, although Singaporean authorities did not initially provide any confirmation of this.[39] On 28 July 2009, the chairman of One Foundation (the charity fund of Li) announced that Jet Li had indeed become a Singaporean citizen.[2] He was said to have chosen Singapore for its education system for his two younger daughters.[2]\n\nIn 2009, he launched his own fitness program, Wuji.[40] The programme consists of elements of martial arts, yoga and pilates; Adidas launched a special clothing line for it that bears the initials of \"JL\".[41][42]\n\nIn 2013, Li revealed that he suffers from hyperthyroidism and has been dealing with the issue for the past three years. Since his heart rate can hit 130~140 at rest, Li takes medication to control his heart rate and has been advised not to do any sort of exercise.[43][44] In 2016, he stated that he had recovered from his illness and that accepting fewer film offers was due to his charity work and not because of his health conditions.[45]\n\nIn his free time he likes to play badminton and table tennis, ride his bicycle, read and meditate. He collects rare Tibetan beads. He says he is never bored in his free time.[46][47]\n\nViews on life and martial arts [ edit ]\n\nLi, as a Buddhist, believes that the difficulties of everyday life can be overcome with the help of religious philosophies.[48] He thinks that fame is not something he can control; therefore, he does not care about it.[49]\n\nI never say to myself I'm the best fighter in the world. If someone learns martial arts solely to pick fights on the street, to lean on it as a keystone weapon in conflicts, to use it to bully and intimidate others – then that person, in my opinion, cannot be considered a true martial artist.[50]\n\nAccording to Li, everything he has ever wanted to tell the world can be found in three of his films: the message of Hero is that the suffering of one person can never be as significant as the suffering of a nation; Unleashed shows that violence is never a solution; and Fearless tells that the biggest enemy of a person is himself. Li thinks that the greatest weapon is a smile and the largest power is love.[51]\n\nAbout Wushu, he said that he believes the essence of martial arts is not power or speed but inner harmony, and considers it a sad development that today's Wushu championships place greater emphasis on form than on the essence of being a martial artist. He believes Wushu now lacks individuality and competitors move like machines, whereas according to his views Wushu should not be considered a race where the fastest athlete wins. He would like to see Wushu as a form of art, where artists have a distinctive style. Li blames the new competition rules that, according to him, place limitations on martial artists.[52]\n\nLi believes that Wushu is not primarily for self-defense and instead of trying to play the hero people should think about peaceful resolutions of conflicts and call the police if necessary:\n\n\"A gun outdoes years of martial arts training in a split second. Like I've said many times before, it is important to differentiate between movies and reality. The hero in movies may be able to knock the gun off his opponent and save the day, but in real life – probably that is not the case.\"[53]\n\nHe has also stated that he has never had to use his martial arts skills in a real-life fight and he does not wish to, either.[50]\n\nPhilanthropy [ edit ]\n\nLi has been a \"philanthropic ambassador\" of the Red Cross Society of China since January 2006. He contributed 500,000 yuan (US$62,500) of box office revenues from his film Fearless to the Red Cross' psychological sunshine project, which promotes mental health.[54]\n\nIn April 2007, touched by his life-shaking experience in the Maldives when he was close to dying during the 2004 tsunami, Li formed his own non-profit foundation called The One Foundation.[55][56] The One Foundation supports international disaster relief efforts in conjunction with the Red Cross as well as other efforts, including mental health awareness and suicide prevention. Since the starting of the foundation, Li has been involved with recovery efforts in seven disasters, including the 2008 Sichuan earthquake[37] and Typhoon Morakot in Taiwan.[57] In the 2013 Lushan earthquake in Ya'an, Sichuan, Li and other members of the entertainment sector were the first to appeal for donations of money, goods and materials to help the victims of the disaster.[58][59] Wu Jing was a One Foundation volunteer and helped in the effort.[60]\n\nLi discussed his commitment to philanthropy in an interview with the December 2009 issue of Alliance magazine, stating that \"grassroots non-government organizations can help the government in its blind spots. Government relief is not always detail-oriented. Grassroots NGOs can't be as big as a government effort, but they need to be flexible and independent.\"[61]\n\nIn September 2010, he was appointed by the International Red Cross as the first Good Will Ambassador. He posted online, saying:\n\n\"Today I signed a deal with the International Federation of Red Cross and Red Crescent Societies – IFRC – to become the FIRST goodwill ambassador in the history of this humanitarian organization. I am very honored! At the same time, I will not pause to celebrate, but instead keep pushing forward and do my best to help the world! Thank you all once again for your support and belief in me!\"[62]\n\nIt was also announced in September 2010, when Li was attending his wax unveiling ceremony in Hong Kong Madame Tussauds, that Li would be meeting Bill Gates and Warren Buffett to talk about charity work.[63] \"Three days ago, I received an email from Gates, hoping I could make time because he and Buffett hoped I could go for a 30-minute chat before the dinner about the future we face as human beings, so I will go,\" Li said.[64]\n\nTaiji Zen [ edit ]\n\nHe founded Taiji Zen in 2011, along with co-founder Executive chairman Jack Ma. Taiji Zen is a lifestyle company with the mission of spreading \"Health and Happiness for All\" through a balance of physical wellness and mental fitness. Taiji Zen combined the martial art of Taijiquan (a.k.a. T'ai Chi Chuan) with mindfulness-based practices such as meditation. It packaged these art forms into several different classes and online programs.[65]\n\nFilmography [ edit ]\n\nBy US box office statistics, the most successful Jet Li film as of August 2010 is Lethal Weapon 4, which grossed over $130 million domestically, while the second is The Expendables with over $103 million.[66] Hero is the third most successful foreign language film in the US,[67] and one of the most critically acclaimed Li movies.[68] Fearless is the seventh most successful foreign language film of all time in the US.[67] From an aggregated critical point of view, the best acclaimed Li movie is Fist of Legend (Rotten Tomatoes: 100%) and the worst is War (Rotten Tomatoes: 12%).[68]\n\nAwards and nominations [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nFurther reading [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/23px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/JetLiHK.jpg/220px-JetLiHK.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Jet_Li_2009_%28cropped%29.jpg/1200px-Jet_Li_2009_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Flag_of_Singapore.svg/23px-Flag_of_Singapore.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Jet_Li_2009_%28cropped%29.jpg/220px-Jet_Li_2009_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Yin_and_Yang_symbol.svg/21px-Yin_and_Yang_symbol.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Mark_Zuckerberg%2C_founder_Facebook%2C_and_Jet_Li%2C_famous_martial_arts_star.jpg/220px-Mark_Zuckerberg%2C_founder_Facebook%2C_and_Jet_Li%2C_famous_martial_arts_star.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/24px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Jet_Li_2009_%28cropped%29.jpg/1200px-Jet_Li_2009_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jet_Li", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Jet_Li_2009_%28cropped%29.jpg/1200px-Jet_Li_2009_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}