{"url": "www.j-14.com/posts/taylor-lautner-billie-lourd-breakup-136259", "text": "Taylor Lautner and Billie Lourd have broken up. The ridiculously good-looking couple met on set of Scream Queens and yes, their characters played love interests — who met an untimely end when Dr. Cassidy sacrificed himself to save Chanel #3 — but still, it was all cute af.\n\nIt was only a matter of time before they look this fictional love and well, made it a real thing. Now, here we are eight months later and they're dunzo.\n\n\"They aren't together anymore but they are still friendly. She’s really focused on her work right now,\" a source said to People.\n\nIf they're still friendly that leaves hope for a possible reconciliation, right? While we want to get our hopes up, that seems super unlikely since Billie has gone ahead and deleted every trace of her time with Tay from her Instagram. Her feed was once was flooded with adorable selfies from their many adventures but now, every trace of #couplegoals is gone. Remember that trip to the poppy fields?\n\nBesides the fact that we all went ahead (and by we, I mean myself) and got emotionally attached to this celeb couple, this breakup goes deeper. Billie went through the worst thing anyone could ever endure: losing her mom Carrie Fisher and her grandmother Debbie Reynolds one day apart. The two women who mean the most to her both passed away, and Taylor was by her side through it all. He really stepped up to be there for her, so much so that Billie's uncle Todd Fisher recently spoke so highly of the Twilight cutie and confirmed every thought we ever had about the kind of guy Taylor actually is.\n\n\"The truth of the matter is the guy is – he’s pretty spectacular. He's a really deep person and he has supported her amazing,\" Todd said in an interview. \"He's stepped up and acted like a husband would act. I mean, not that that’s what’s going on, but it’s just an amazing support system for her and I’m glad he’s in her life.\"\n\nTaylor was legit pulling husband duty over here. Need a minute to just let that sink in.\n\nNow, Taylor does have a habit of dating his co-stars after they play his on-screen GFs. There was Taylor Swift from Valentine's Day, then Lily Collins from Abduction, followed by Marie Avgeropoulos from Tracers before he met Billie. So it's kind of this thing to fall in love with these girls in real life and eventually these relationships fizzle out.\n\nBut it felt different for his romance with Billie. I was rooting for them. We were all rooting for them. It seemed like this was the real deal. Perhaps, just maybe, Taylor had finally found the perfect co-star to stay with him for the long haul. Whenever co-stars date IRL, there is always that sense of \"is this legit or are they just trying to get some promo?\" Sure, this has definitely happened in the past since Hollywood is a strange place filled with smoke and mirrors when you think about it, but you could literally feel the love between Taylor and Billie. Frankly, it's all rather disappointing to see this relationship has gone down in flames now too. If us mere fans are distraught over Mom and Dad going their separate ways, we can only imagine how the actual people involved are feeling.\n\nScream Queens has since been cancelled, so they won't even be any sort of TV reunion to possibly reignite the spark. Let's hope the next time Taylor decides to date another one of his co-stars, that relationship with a happier ending. Or better yet, maybe he should learn to just not fall in love with his co-workers and instead find a leading lady any other way.\n\nTbh, this is all just too much emotional investment and I don't need this second-hand heartbreak anymore. I've had a soft spot for Taylor ever since the Adventures Sharkboy and Lavagirl days, but homeboy needs to get it together when it comes to his love life, and I mean that in the best way possible. It all comes from a place of fan appreciation, so feel like I can say this and hopefully put it out there as a lesson because us fans get too attached and now here we are: wrecked and wondering if true love is even real anymore. Until he makes his debut with another stunning beauty and then I'll be shipping them too, that is.\n\nLove J-14? Be sure to subscribe to our YouTube channel for fun, exclusive videos with your favorite stars.", "images": ["https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner-billie-lourd-breakup.png?resize=533%2C400", "https://www.j-14.com/wp-content/uploads/2017/07/scream-queens-billie-lourd-taylor-lautner.gif?w=1180&h=279&crop=1", "https://www.j-14.com/wp-content/uploads/2019/07/selena-gomez-past-boyfriends.jpg?resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2018/10/taylor-lautner-girlfriends-past-relationships.jpg?resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner.gif?w=1180&h=276&crop=1", "https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner-billie-lourd-breakup.png?fit=200%2C150", "https://www.j-14.com/wp-content/uploads/2017/07/taylor-billie-poppy-field-selfie-2.png?w=1180&h=374&crop=1", "https://www.j-14.com/wp-content/uploads/2019/11/scream-queens-renewed-another-season.jpg?resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2018/10/j14_cover-e1539589804523.jpg", "https://www.j-14.com/wp-content/uploads/2017/11/twilight-6.jpg?crop=0px%2C0px%2C1191px%2C670px&resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2017/07/anthony-anderson-crying.gif?w=1180&h=281&crop=1"], "top_img": "https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner-billie-lourd-breakup.png?resize=533%2C400", "keywords": [], "authors": ["Jennifer Maldonado"], "canonical_link": "https://www.j-14.com/posts/taylor-lautner-billie-lourd-breakup-136259/", "title": "Why Taylor Lautner and Billie Lourd's Breakup Hurts the Most", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Taylor Lautner and Billie Lourd have broken up. The ridiculously good-looking couple met on set of Scream Queens and yes, their characters played love interests — who met an untimely end when Dr. C…", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Why Taylor Lautner and Billie Lourd's Breakup Hurts the Most", "description": "Taylor Lautner and Billie Lourd have broken up. The ridiculously good-looking couple met on set of Scream Queens and yes, their characters played love interests — who met an untimely end when Dr. C…", "url": "https://www.j-14.com/posts/taylor-lautner-billie-lourd-breakup-136259/", "site_name": "J-14", "updated_time": "2018-06-27T19:55:05+00:00", "image": {"identifier": "https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner-billie-lourd-breakup.png?resize=533%2C400", "secure_url": "https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner-billie-lourd-breakup.png?resize=533%2C400", "width": 533, "height": 400}}, "article": {"tag": "Taylor Lautner", "published_time": "2017-07-07T15:14:00+00:00", "modified_time": "2018-06-27T19:55:05+00:00"}, "fb": {"app_id": 782474828470382, "admins": 593583017, "pages": 6338692612}, "twitter": {"card": "summary_large_image", "description": "Taylor Lautner and Billie Lourd have broken up. The ridiculously good-looking couple met on set of Scream Queens and yes, their characters played love interests — who met an untimely end when Dr. C…", "title": "Taylor Lautner and Billie Lourd's Breakup Actually Cuts the Deepest", "image": "https://www.j-14.com/wp-content/uploads/2017/07/taylor-lautner-billie-lourd-breakup.png?resize=533%2C400"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1499440440.0, "source": "http://www.j-14.com", "summary": ""}