{"url": "https://en.wikipedia.org/wiki/Clinton_Kelly_(TV_personality)", "text": "Clinton Kelly (born February 22, 1969) is an American TV personality, author, and lifestyle consultant. He won an Emmy for his role as co-host on the popular ABC daytime show The Chew.[1] The Chew was nominated for multiple Emmys and ran for seven seasons.[2] He is also known for his role as co-host on the prime time reality show What Not to Wear, TLC's long-running reality program that featured fashion makeovers, for over 10 seasons.[3] Kelly is currently a contributing columnist to Woman's Day magazine offering style advice. He has published several bestselling books, including his most recent, I Hate Everyone, Except You - a humorous and candid collection of essays. Kelly started his career as a freelance writer for several fashion magazines and was an editor for Marie Claire and Mademoiselle.\n\nEarly years [ edit ]\n\nKelly was born in Panama City, Panama and raised in Port Jefferson Station, Long Island, New York. He graduated from Comsewogue High School in 1987.[4] Kelly recounts parts of his upbringing and childhood in his book, I Hate Everyone, Except You.[5] He attended Boston College and graduated with a Bachelor of Arts degree in Communications in 1991; he was president of Boston College's University Chorale.[6] Kelly always wanted to be a novelist, but was afraid of “being broke” if he became a writer.[7] He instead decided to pursue a master's degree in journalism, specializing in magazine publishing, from the Medill School of Journalism at Northwestern University in 1993. He credits his training from Medill as one of the reasons he was able to transition seamlessly into magazine editing - and ultimately television.[8] He likens the mindset of editing a magazine to be very similar to what is needed when producing a television show.\n\nCareer [ edit ]\n\nMagazines [ edit ]\n\nBefore joining What Not to Wear, Kelly worked as a freelance writer and editor at several publications in New York.[9] Kelly wrote about a range of topics including fitness, travel and relationships. He began his career in fashion when Kelly became an editor at Marie Claire and a deputy editor at Mademoiselle, where he contributed under the pseudonym \"Joe L'Amour\".[10][11] He later became the executive editor of the DNR, a New York-based weekly men's fashion and retail trade magazine.[12] He currently contributes to Women's Day as a columnist and style expert.\n\nTelevision [ edit ]\n\nWhile Kelly was at DNR, the producers at TLC's What Not to Wear decided to recast the original male lead and approached Kelly.[13] After three auditions, Kelly was chosen as the new co-host, alongside Stacy London. He has described their relationship as \"a brother and sister in the backseat of a car on a long car trip\".[14] The premise was to help participants refresh their wardrobes, and get them to look – and feel – better. Though makeover shows typically focus on the final look of the participant, this show highlighted the internal change and confidence participants gained during the makeover process. Kelly often asked contributors if their clothes made them feel beautiful and the majority of contributors admitted that they did not.[15] Kelly said of the ultimate purpose of the show:\n\n“Having a style is a great way to get what you want from your life. When your style is aligned with who you are, you feel empowered.”[16]\n\nKelly is openly gay, but in comparing What Not to Wear with the show Queer Eye—which pioneered gay men making over people seen as needing fashion advice—the Washington Blade noted some key differences: \"[U]nless you have your gaydar on while watching the show, you would have no idea. There's nothing 'gay' about the show and he doesn't really talk about it on air. Viewers trust Kelly's expertise based on the strength of his choices rather than on the 'he's gay and he should know' fashion theory.\"[17]\n\nThe show had over 350 contributors, those who experienced the makeovers, many of whom Kelly is still in contact with.[18] It was the impact on these contributors that kept Kelly engaged in the show for so long: “The only reason I was able to do that show for 10 years is because I knew I was helping women,” Kelly said. “It wasn’t just about the clothes; I felt I could continue empowering through this.”[19]\n\nKelly became the moderator of the ABC daytime show The Chew in 2011. Kelly was selected for The Chew after meeting a producer who had read his 2008 book, “Freakin’ Fabulous: How to Dress, Speak, Behave, Eat, Drink, Entertain, Decorate, and Generally Be Better Than Everyone Else.”[20] He did several screen tests, where the chemistry with his co-stars were evident, and started the show in 2011. The show featured food and lifestyle topics[21] and relied on the chemistry of the co-hosts.[22] The show was more reflective of Kelly’s interests and actual life, when not on TV, as it covered food, entertaining, and lifestyle topics.[23] It ran for seven seasons and was a staple in ABC’s weekday lineup. In 2015, Kelly shared the Daytime Emmy Award for Outstanding Informative Talk Show Host with his cohosts on The Chew.[24] Kelly reflected on the positive energy and goal of the show to have fun: “That’s a great feeling that people are tuning in because they enjoy hanging out and we’re inspiring them to create things.”[25] Kelly maintains close relationships with Michael Symon and Carla Hall.[26]\n\nIn 2019, Kelly became the host of the fifth season of the Food Network's seasonal cooking competition show, Spring Baking Championship. Filming of the 2020 season has already been completed. The show consists of eight one-hour episodes and where 10 bakers compete for the ultimate grand prize of $25,000 and the title of Champion.[27] Kelly also hosts the Haunted Gingerbread Showdown for the Food Network where nine gingerbread artists create displays to impress the judges for an ultimate prize and a feature in Food Network Magazine.[28] He has also been featured and served as a guest judge on other Food Network shows where his expertise in lifestyle, entertaining and food is relied upon.\n\nHe has also hinted to fans that he is developing a new show in the home space.[29]\n\nBooks [ edit ]\n\nIn 2017 he published his memoirs as a series of essays entitled I Hate Everyone, Except You. Kelly described the experience of writing his memoirs: This book really was about finally allowing myself to open up to the people who watched me on television for the past 15 or so years. It's basically a way of me saying, “I know that you probably have an idea of who I am, and to a certain extent you’re right, but that’s not all of who I am.” I'm actually just kind of a regular guy who got lucky enough to have a job on television. And I’ve had all the kinds of crazy experiences and embarrassments that you've had in your life as well. This is a way for me to share myself that I feel comfortable with, especially in today's society of oversharing.[30]\n\nHe published Freaking Fabulous on a Budget in 2013. In 2010, he wrote Oh No She Didn't,[31] telling the do's and don'ts of women's fashion. In 2008, Kelly wrote Freakin' Fabulous: How to Dress, Speak, Behave, Eat, Drink, Entertain, Decorate, and Generally be Better than Everyone Else.[32] In 2005, Kelly and Stacy London co-wrote a book titled Dress Your Best: The Complete Guide to Finding the Style That's Right for Your Body.[33]\n\nHe has also created a popular web series on his social media called Basic Grammar for Basic B*****s. The web series is a light-hearted approach to educating people on common grammar mistakes, examples are often taken from trolls who have posted on his social media.[34]\n\nDesign [ edit ]\n\nHis Miami home has also been featured in publications for interior design.[35] He designed the space to reflect his personality and features mid-century modern designs and flea market finds. He and his husband renovated the space using unusual pairings with unique finds. “I wanted something different, something fun.” He approached the space with “no rules” and endeavored to mix color, texture, pattern, and shine to reflect his personality.[36]\n\nPersonal life [ edit ]\n\nKelly is married to Damon Bayles, a psychologist.[37] They were married in 2009 at their home in Connecticut. His Jack Russell terrier, Mary, is a rescue dog and is a feature of many of his social media posts.[38] He splits his time among Manhattan, Connecticut and Miami Beach.[39][40]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Clinton_Kelly_2019.jpg/220px-Clinton_Kelly_2019.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/4/4e/Clinton_Kelly_2019.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Clinton_Kelly_2019.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Clinton_Kelly_(TV_personality)", "title": "Clinton Kelly (TV personality)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Clinton_Kelly_2019.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}