{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/roseanne-abc-season-2-renewal-sitcom-john-goodman-a8282326.html", "text": "Roseanne will be returning to ABC for a second season after the first season of the reboot was a spectacular success.\n\nThe second season of Roseanne is set to feature cast-members Roseanne Barr, John Goodman, Laurie Metcalf, Sara Gilbert, Alicia Goranson and Michael Fishman once again.\n\nAdditional cameos will be made by past cast-members every so often.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nThere is no word on whether or not the season will air by fall, but according to The Hollywood Reporter, the season order has reportedly been increased from nine episodes to 13.\n\nThe reboot of the hit sitcom premiered to stellar ratings with its March 27 premiere - becoming the highest-rated scripted broadcast of the season and also the highest-rated sitcom in over three years.\n\nThe Roseanne revival took in 18.1m viewers in its first night back, and three days of additional viewing has made that number reach 21.9m.\n\n\"We’re thrilled that America has welcomed the Conner family back into their homes,\" said ABC Entertainment president Channing Dungey. \"The show is as fresh and relevant today as it was when it left the air 21 years ago. We can’t wait to see what the Roseanne team has in store for next year.\"\n\nShowrunner Bruce Helford originally told the publication he'd love to shoot more episodes: \"Everybody has things that they’re doing, so it might be hard to get 22 episodes in. But I would love to do another 10 or 12 on a yearly basis.\"\n\nThe reboot of Roseanne sees its titular character and her husband Dan Conner (John Goodman) older and struggling with health problems and focuses on the struggles of their children: D.J. (Fishman) is parenting his black daughter alone while his wife is serving overseas, Darlene (Gilbert) lost her job and had to move home with her parents, bringing her two kids with her and Becky (Goranson) is contemplating becoming a surrogate to combat her debt.\n\nRoseanne also tackles the political divide that President Trump's election created between Roseanne and her sister Jackie (Metcalf), as well as the topic of gender-fluidity with Darlene's child.\n\nThe show is executive-produced by writer Whitney Cummings, actresses Gilbert and Barr, Tom Werner and Helford.\n\nRoseanne airs on Tuesdays at 8pm on ABC.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/29/09/roseanne-0.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/29/09/roseanne-0.jpg", "keywords": [], "authors": ["Ilana Kaplan"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/roseanne-abc-season-2-renewal-sitcom-john-goodman-a8282326.html", "title": "Roseanne: ABC has revived sitcom for season 2", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/tv/news/roseanne-abc-season-2-renewal-sitcom-john-goodman-a8282326.html", "title": "Roseanne reboot is such a hit it's already been renewed for a second season", "description": "The sitcom is coming back", "updated_time": "2018-03-30T21:54:06+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/29/09/roseanne-0.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8282326"}, "description": "Roseanne will be returning to ABC for a second season after the first season of the reboot was a spectacular success. The second season of Roseanne is set to feature cast-members Roseanne Barr, John Goodman, Laurie Metcalf, Sara Gilbert, Alicia Goranson and Michael Fishman once again. Additional cameos will be made by past cast-members every so often.", "keywords": "Roseanne, Roseanne Barr, John Goodman, Revival, Trump, Season 2, roseanne season 2, Lady Bird, Whitney Cummings, News, TV & Radio, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Roseanne", "published_time": "2018-03-30T21:54:07+01:00", "modified_time": "2018-03-30T21:54:06+01:00", "section": "News", "author_name": "Ilana Kaplan", "content_type": "story", "word_count": 389, "image_count": 3, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 1}, "twitter": {"title": "Roseanne reboot is such a hit it's already been renewed for a second…", "description": "Roseanne will be returning to ABC for a second season after the first season of the reboot was a spectacular success. The second season of Roseanne is set to feature cast-members Roseanne Barr, John", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1522443247.0, "source": "https://www.independent.co.uk", "summary": ""}