{"url": "https://en.wikipedia.org/wiki/Rainbow_(Kesha_album)", "text": "2017 studio album by Kesha\n\nRainbow is the third studio album by American singer Kesha. It was released on August 11, 2017 by Kemosabe and RCA Records. Primarily a pop record, Rainbow incorporates elements of pop rock, glam rock, neo soul, and country pop. Its lyrical themes range from letting go of the past, finding forgiveness within oneself for past mistakes, self-worth, and female empowerment.[4] Kesha assumed an integral role in the album's production and collaborated with several producers, including Ricky Reed, Drew Pearson, Ben Folds, and her mother Pebe Sebert.\n\nFollowing the release of her second studio album, Warrior (2012), Kesha dealt with several struggles in her personal and professional life, including a stint in a treatment center for an eating disorder and emotional issues, as well as a highly publicized legal battle with her former record producer Dr. Luke, whom she accused of sexual, physical, and emotional abuse. Kesha began writing material for her next album while in rehab in 2014 and as her recording contract at the time obliged her to work with Dr. Luke, she later recorded a series of new songs on her own and gave them to her record label. In 2016, it was confirmed that work had officially commenced on Kesha's third studio album, with Sony Music Entertainment assuring Kesha she would be able to produce a new album without having to work with Dr. Luke, the founder of Kemosabe Records. \"Praying\" was released as the lead single from Rainbow in July 2017, going on to be certified platinum in several countries worldwide. \"Learn to Let Go\" and \"Woman\" were released as the second and third singles from the album thereafter, seeing moderate commercial success worldwide.[5][6]\n\nRainbow marks a noticeable departure from the electropop sound of Kesha's first two studio albums. She co-wrote all but two tracks on the album, and said that she wanted her new music to reflect that she is a \"real person having a complete human experience,\" stating that there was no balance in her previous work.[7] Kesha stated that the album was inspired by several of her musical influences, including Iggy Pop, T. Rex, Dolly Parton, The Beatles, The Rolling Stones, The Beach Boys, James Brown, and Sweet. The album also features collaborations and guest appearances by Parton, Eagles of Death Metal, and The Dap-Kings Horns.\n\nRainbow debuted at number one on the Billboard 200 chart in the United States with 117,000 album-equivalent units and was the subject of universal acclaim from music critics, with several complimenting the feminist angle and uniqueness of the record as well as Kesha's vocal performance and ability to interweave different genres of music on the album. The album has been certified Gold by the Recording Industry Association of America (RIAA) and was nominated for Best Pop Vocal Album at the 60th Annual Grammy Awards, marking Kesha's first Grammy nomination. Kesha promoted the album through television and music festival performances and embarked on both the Rainbow Tour (2017–2019) and The Adventures of Kesha and Macklemore (2018), with American rapper Macklemore.\n\nBackground and recording [ edit ]\n\nRainbow \"quite literally\" saved her life. Kesha stated that\"quite literally\" saved her life.\n\nKesha initially began writing songs for her third studio album while as a patient at Timberline Knolls, an Illinois treatment center, for an eating disorder in 2014. Eager to write music while in treatment, a friend brought her a toy keyboard, and after some negotiation, the staff let her keep it.[7] She was not permitted to use any instrument with a power cord, explaining in an interview with Rolling Stone that the staff did not want her to have any objects that could be used for suicide: \"And I was like, 'I respect all of that, but please let me have a keyboard or my brain's going to explode. My head has all these song ideas in it, and I just really need to play an instrument.'\"[8] She completed work on several songs while in treatment, and following her release from rehab, she removed the dollar sign from her name, explaining it as a way of taking back her power.[7] In her August 2014 Teen Vogue cover interview, Kesha revealed she had recorded 14 new songs while in rehab.[9] Thereafter, Kesha filed an ongoing lawsuit against her former producer, Dr. Luke, accusing him of sexual, physical and emotional abuse. Since her recording contract at the time obliged her to work with the man she accused of abuse, Kesha subsequently became unable to release any new music under her label unless she worked with Dr. Luke, to which she refused.[10][11] As a result, Kesha recorded 22 new songs on her own during the legal battle and later gave them to her label.[12][13] After Sony Music Entertainment assured the singer she would be able to produce a new album without Dr. Luke, the founder of her label, work on Kesha's third studio album officially commenced.[14][15] In the summer of 2016, Kesha embarked on her third world tour, the Kesha and the Creepies: Fuck the World Tour. The tour commenced on July 23, 2016, in Las Vegas and ended on October 29, 2016, in Maine. The tour included various covers of songs and several rock and country reworks of her own hit singles.[16][17]\n\nIn a New York Magazine profile in October 2016, Kesha stated that as much as her first two studio albums Animal (2010) and Warrior (2012) represented who she was, she felt there was \"no balance\", saying that she is \"a real person having a complete human experience\" and she wanted her future music to represent that: \"To this day, I've never released a single that’s a true ballad, and I feel like those are the songs that balance out the perception of you, because you can be a fun girl. You can go and have a crazy night out, but you also, as a human being, have vulnerable emotions. You have love.\"[7] In an interview with Good Morning America the week of Rainbow's release, Kesha stated that she had written every song on the album and described Rainbow as \"quite literally saving [her] life\", and expressed her hope that the album would help people. She also explained the symbolism of the album's title, saying that she thinks \"color symbolizes hope – and the rainbow, it's no coincidence that it's also the symbol for the LGBT community. I've always just found hope in the bright colors, and I wanted to bring that more into my everyday life. Now my house is covered in rainbows, and my life and my body – I have like 10 rainbow tattoos. I go to the tattoo artist and it's like, 'A rainbow something?'\"[18]\n\nComposition [ edit ]\n\nKesha has said that Rainbow was inspired by her \"true\" musical influences: Iggy Pop, T. Rex, Dolly Parton, The Beatles, The Rolling Stones, The Beach Boys, James Brown, and Sweet.[19] The album contains a combination of both mournful cuts and upbeat dance tracks such as \"Woman\" and \"Bastards\". The album opens with the country-infused cut \"Bastards\", which, as Katie Baillie of Metro analyzed, is \"about not letting the bullies drag you down.\" \"Woman\" was inspired by a \"pussy grabbing comment\" Donald Trump made, which angered Kesha and made her yell \"I'm a motherfucking woman!\" This line is included throughout the song. Kesha wrote the title track on a toy keyboard while in rehab. It opens only with vocals and basic chords played on a piano.[4] The first line Kesha sings is, \"Got back the stars in my eyes, I see the magic inside of me.\" Baillie writes that the track \"builds in both sound an emotion [...] as a full live orchestra kicks in.\" Kesha was inspired to write \"Learn to Let Go\" by one of her friends who went through \"the worst childhood imaginable.\" The track is also based on Kesha's struggles while making Rainbow.[4]\n\nPromotion [ edit ]\n\nKesha performed in Japan at the Summer Sonic Festival on two dates: August 19 in Osaka and August 20, 2017 in Tokyo.[20] Following this, Kesha staged a solo concert in Nagoya on August 21.[21] In September, Kesha performed at the KAABOO and iHeartRadio festivals.[22] Kesha was also a performer at the MTV Europe Music Awards on November 12.[23] Kesha, alongside many other popular female singers, performed \"Praying\" at the 60th Annual Grammy Awards in 2018.\n\nKesha embarked on the Rainbow Tour, which began in Birmingham on September 26, 2017. She will also go on a co-headlining tour with American rapper Macklemore named The Adventures of Kesha and Macklemore (2018). The tour is scheduled to take place in 30 cities in North America during the summer.\n\nCritical reception [ edit ]\n\nRainbow received acclaim from music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album has an average score of 81 out of 100, which indicates \"universal acclaim\" based on 27 reviews.[25] Katie Baillie of Metro, who reviewed Rainbow a month before its release, called it a \"powerful, emotional and strongly feminist record that is worth the four-year wait.\" She wrote that the \"vulnerability of some songs will bring a tear to your eye, while others are so close to Kesha's old sound it'll have dance floors filled everywhere in no time.\" She described the album as \"a roller coaster of emotions, making you weep at the sadness of Rainbow and fist-pumping the air with Woman, and it was so worth the wait.\"[4]\n\nAndrew Uterberger of Billboard complimented Kesha's ability to make every song on the album sound different as well as differentiate herself from the electropop sound of her first two albums, stating that \"it all works\" and writing: \"Kesha has the swagger for neo-glam, the grit for old-school soul, the pipes for power-balladry – listening to some of the spine-shivering feats she accomplishes on \"Praying,\" it's practically unthinkable that she was mostly consigned to sing-speaking her way through the majority of her musical career. And she's not even half done: Before the end of Rainbow, the singer formerly known as K-Money will have sauntered her way through train-chugging, Johnny Cash-via-Kacey Musgraves country (\"Hunt You Down\"), schlocky frat rock (\"Boogie Feet\") and quirky singer-songwriter parables (\"Godzilla\"). And the only arguable stumble in the bunch comes with the stomping \"Boots,\" which pairs the taunting wordplay of Kesha 1.0 (\"If you can’t handle these claws/ You don’t get this kitty) with an electro-folk stomp that feels like a lukewarm version of Miley Cyrus' Bangerz.\"[36]\n\nBrittany Spanos of Rolling Stone gave Rainbow 4 stars out of a possible 5 and wrote: \"On her excellent comeback record, Rainbow, Kesha channels that drama into the best music of her career – finding common ground between the honky-tonks she loves (her mom is Nashville songwriter Pebe Sebert) and the dance clubs she ruled with hits like \"Tik Tok\" and \"Die Young,\" between glossy beats, epic ballads and grimy guitar riffs. In the process, she also finds her own voice: a freshly empowered, fearlessly feminist Top 40 rebel.\" Spanos also noted the noticeable departure from the electropop sound of Kesha's first two albums, writing, \"Kesha used to sing about partying with rich dudes and feeling like P. Diddy. Rainbow is full of sympathetic (if at times cloying) prisoner metaphors and therapist clichés [...] Across the board, she achieves a careful balance of her diverse musical selves: The gospel-tinged \"Praying\" takes the high road by wishing the best to the people who have hurt her, and \"Woman\" is a blissfully irreverent, proudly self-sufficient retro-soul shouter backed by Brooklyn funk crew the Dap-Kings.\"[37] She also stated that the album's \"most powerful moment\" is the singer's cover of Dolly Parton's \"Old Flames Can't Hold a Candle to You\", saying, \"Parton herself helps out on guest vocals. But this isn't some Grand Ole Opry homage. Kesha flips and filters it through her dreamy vision, turning the sweet tune into rousing rockabilly until the standard sounds refreshed and vividly modern, battle-tested and born again. Just like the woman singing it.\"[37]\n\nKatherine Flynn of Consequence of Sound complimented Kesha's ability to retain her uniqueness on the record and stated that the album \"feels much more organic\" than her previous work, writing: \"Rainbow, as a comprehensive work, feels much more organic and of this earth than anything by dollar-sign Ke$ha. There’s a strong, organic rock and country influence that places her much more firmly in a lineage, a tradition, instead of the weird, airless, EDM-influenced vacuum that she inhabited on songs like the title track of 2012's Warrior and hits like \"Blow\".\"[38] In an equally favorable review, Hilary Weaver of Vanity Fair described Rainbow as \"a blatant, angry response to the singer’s battle with a legal system that has left her feeling frustrated and trapped as an artist—but also a powerful pop album that earns the anticipation\", writing: \"This is an unapologetically open and honest Kesha we have never heard before—her voice is still recognizable but not as poppy and more focused with a message she wants her audience to hear loud and clear. She seems to come closest to directly referencing Dr. Luke once, as 'the boogeyman under [her] bed' in 'Letting Go'; the album is a more general, vocal proclamation against anyone who has wronged her in the past. This is Kesha’s story, but it’s also the response that any woman in the Trump era of 'locker-room talk' might want to blast in her car on a particularly frustrating day.\" She also described Kesha as being in a \"far different place than when her last album was released\", calling her a \"symbol of women standing up against patriarchal forces keeping them down\" and writing: \"It lends an automatic weight to Rainbow that Ke$ha might not have been able to shoulder—but Kesha, at least as she appears on this album, is up to the challenge.\"[1]\n\nIn a more mixed review, Chris Willman of Variety stated that Kesha seems \"stuck between a rock and a hard place\" on Rainbow, writing: \"For a while, anyway, it seems that a better title for this album than Rainbow would have been Warrior (except she used that one on her previous record). It would be nice to report that the songs addressing the distress of the last few years reveal her as a great confessional singer/songwriter, but the clunkiness of her most sober material here blunts its impact. Her most angry/inspirational tracks, like \"Don’t Let the Bastards Get You Down,\" \"Learn to Let Go,\" and \"Praying,\" suffer not from seriousness but relative artlessness as Kesha unleashes a stream of Deepak-ian self-help bromides (embellished with plenty of Tupac-ian language) that’d sound better as bathroom-mirror sticky-note affirmations than they do as gospel-choir-backed lyrics.\" He also negatively compared Kesha to Pink and the Dixie Chicks on the album, writing: \"The moment for some kind of personal revelation is nigh, but all these pop-psych clichés leave you feeling you know less about the real Kesha than you did coming in.\"[39] Willman also lamented that the moments where Kesha expresses glimpses of her previous electropop \"ridiculousness\" on the album \"[feel] refreshing and, just maybe, even more authentic. Not that you’d want her to push past her pain prematurely, but when it comes to the writing part, Kesha just happens to still be cleverer at playing koo-koo than guru.\"[39]\n\nAccolades [ edit ]\n\nRainbow appeared on several publications' year-end lists for 2017, as well as decade-end lists.\n\nCommercial performance [ edit ]\n\nIn the United States, Rainbow debuted at number one on the Billboard 200 with 117,000 album-equivalent units, which consisted of 90,000 pure album sales. It became her second number-one album in the country after Animal (2010).[53] On December 14, 2017, the album was certified Gold by Recording Industry Association of America (RIAA),[54] denoting sales of 500,000 copies. The album's lead single \"Praying\" has also been certified platinum in several countries worldwide.[55] The record opened atop the Canadian Albums Chart with 10,000 album-equivalent units earned and 7,000 copies sold.\n\nThe album debuted at number 4 on the UK Albums Chart[56] with 9,770 copies sold.[57] The album fell to number 33 the following week, and then to number 66 in its third week, its final week inside the top 100.[56]\n\nAwards and nominations [ edit ]\n\nKesha received two nominations at the 60th Annual Grammy Awards, including Best Pop Vocal Album and Best Pop Solo Performance for \"Praying\".[58]\n\nTrack listing [ edit ]\n\nJapanese bonus track[59] No. Title Writer(s) Producer(s) Length 15. \"Emotional\" K. Sebert\n\nWrabel Pearson 3:44 Total length: 52:20\n\nNotes\n\n^[a] signifies a co-producer\n\nPersonnel [ edit ]\n\nCredits adapted from Tidal.[60]\n\nMusicians\n\nTechnical\n\nDrew Pearson – engineer (1, 13, 14) , recording engineer (3, 10)\n\n, recording engineer Ethan Shumaker – engineer (1, 4, 6, 7, 13)\n\nSergio Chávez – engineer (2)\n\nFareed Salamah – engineer (3)\n\nJustin Armstrong – engineer (5)\n\nBilly Centenaro – engineer (5)\n\nAntonia Gauci – engineer (5)\n\nJoe Costa – engineer (8)\n\nDave Way – engineer (8)\n\nIngmar Carlson – engineer (10, 14) , assistant engineer (2, 5)\n\n, assistant engineer Bobby Holland – engineer (14)\n\nManny Marroquin – mixing engineer (1, 3, 4, 6, 7, 11, 13)\n\nChris Galland – mixing engineer (1, 3, 4, 6, 7, 11, 13)\n\nJon Castelli – mixing engineer (2, 5, 10)\n\nDavid Boucher – mixing engineer (8)\n\nShawn Everett – mixing engineer (9)\n\nKieron Menzies – mixing engineer (9)\n\nChris Garcia – mixing engineer (9)\n\nDean Reid – mixing engineer (9)\n\nMichael Stankiewicz – mixing engineer (9) , recording engineer (12)\n\n, recording engineer Trevor Yasuda – mixing engineer (9)\n\nChuck Ainlay – mixing engineer (12)\n\nStuart Crichton – recording engineer (2, 6) , engineer (6)\n\n, engineer Kevin Estrada – recording engineer (10)\n\nRobin Florent – assistant engineer (1, 3, 4, 6, 7, 11, 13)\n\nJeff Jackson – assistant engineer (1, 3, 4, 6, 7, 11, 13)\n\nRyan Nasci – assistant engineer (2, 5, 10, 14)\n\nMatt Dyson – assistant engineer (8)\n\nJeff Gartenbaum – assistant engineer (8)\n\nCharlie Paakkari – assistant engineer (8)\n\nZack Pancoast – assistant engineer (9, 12)\n\nIvan Wayman – assistant engineer (9)\n\nDesign Robert Beatty - artwork\n\nOlivia Bee - photography\n\nErwin Gorostiza - creative director\n\nBrian Roettinger - art direction Business Joshua Berkman - A&R\n\nKeith Naftaly - A&R\n\nKatie Welle - A&R\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRegion Certification Certified units/sales Canada (Music Canada)[87] Gold 40,000 United States (RIAA)[88] Gold 500,000 ^shipments figures based on certification alone\n\nsales+streaming figures based on certification alone\n\nRelease history [ edit ]\n\nList of regions, release dates, showing formats, label, editions and references Region Date Format(s) Label Edition(s) Ref. Various August 11, 2017 CD\n\nLP\n\ndigital download\n\nstreaming Kemosabe\n\nRCA Explicit\n\nclean [89] Japan August 16, 2017 CD Sony Bonus track [90] Brazil September 6, 2017 Sony Explicit [91]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f8/Kesha_-_Rainbow_%28Official_Album_Cover%29.png/220px-Kesha_-_Rainbow_%28Official_Album_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Kesha_Planes_Fire_%26_Rescue_premiere_July_2014_%28cropped%29.jpg/200px-Kesha_Planes_Fire_%26_Rescue_premiere_July_2014_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Dolly_Parton_accepting_Liseberg_Applause_Award_2010_portrait.jpg/200px-Dolly_Parton_accepting_Liseberg_Applause_Award_2010_portrait.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/11px-Star_half.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/f/f8/Kesha_-_Rainbow_%28Official_Album_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f8/Kesha_-_Rainbow_%28Official_Album_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Rainbow_(Kesha_album)", "title": "Rainbow (Kesha album)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/f/f8/Kesha_-_Rainbow_%28Official_Album_Cover%29.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}