{"url": "https://web.archive.org/web/20060930180024/http://clinton.senate.gov/news/statements/details.cfm?id=233783", "text": "As Delivered\n\nToday we are asked whether to give the President of the United States authority to use force in Iraq should diplomatic efforts fail to dismantle Saddam Hussein's chemical and biological weapons and his nuclear program.\n\nI am honored to represent nearly 19 million New Yorkers, a thoughtful democracy of voices and opinions who make themselves heard on the great issues of our day especially this one. Many have contacted my office about this resolution, both in support of and in opposition to it, and I am grateful to all who have expressed an opinion.\n\nI also greatly respect the differing opinions within this body. The debate they engender will aid our search for a wise, effective policy. Therefore, on no account should dissent be discouraged or disparaged. It is central to our freedom and to our progress, for on more than one occasion, history has proven our great dissenters to be right.\n\nNow, I believe the facts that have brought us to this fateful vote are not in doubt. Saddam Hussein is a tyrant who has tortured and killed his own people, even his own family members, to maintain his iron grip on power. He used chemical weapons on Iraqi Kurds and on Iranians, killing over 20 thousand people. Unfortunately, during the 1980's, while he engaged in such horrific activity, he enjoyed the support of the American government, because he had oil and was seen as a counterweight to the Ayatollah Khomeini in Iran.\n\nIn 1991, Saddam Hussein invaded and occupied Kuwait, losing the support of the United States. The first President Bush assembled a global coalition, including many Arab states, and threw Saddam out after forty-three days of bombing and a hundred hours of ground operations. The U.S.-led coalition then withdrew, leaving the Kurds and the Shiites, who had risen against Saddam Hussein at our urging, to Saddam's revenge.\n\nAs a condition for ending the conflict, the United Nations imposed a number of requirements on Iraq, among them disarmament of all weapons of mass destruction, stocks used to make such weapons, and laboratories necessary to do the work. Saddam Hussein agreed, and an inspection system was set up to ensure compliance. And though he repeatedly lied, delayed, and obstructed the inspections work, the inspectors found and destroyed far more weapons of mass destruction capability than were destroyed in the Gulf War, including thousands of chemical weapons, large volumes of chemical and biological stocks, a number of missiles and warheads, a major lab equipped to produce anthrax and other bio-weapons, as well as substantial nuclear facilities.\n\nIn 1998, Saddam Hussein pressured the United Nations to lift the sanctions by threatening to stop all cooperation with the inspectors. In an attempt to resolve the situation, the UN, unwisely in my view, agreed to put limits on inspections of designated \"sovereign sites\" including the so-called presidential palaces, which in reality were huge compounds well suited to hold weapons labs, stocks, and records which Saddam Hussein was required by UN resolution to turn over. When Saddam blocked the inspection process, the inspectors left. As a result, President Clinton, with the British and others, ordered an intensive four-day air assault, Operation Desert Fox, on known and suspected weapons of mass destruction sites and other military targets.\n\nIn 1998, the United States also changed its underlying policy toward Iraq from containment to regime change and began to examine options to effect such a change, including support for Iraqi opposition leaders within the country and abroad.\n\nIn the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including Al Qaeda members, though there is apparently no evidence of his involvement in the terrible events of September 11, 2001.\n\nIt is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons. Should he succeed in that endeavor, he could alter the political and security landscape of the Middle East, which as we know all too well affects American security.\n\nNow this much is undisputed. The open questions are: what should we do about it? How, when, and with whom?\n\nSome people favor attacking Saddam Hussein now, with any allies we can muster, in the belief that one more round of weapons inspections would not produce the required disarmament, and that deposing Saddam would be a positive good for the Iraqi people and would create the possibility of a secular democratic state in the Middle East, one which could perhaps move the entire region toward democratic reform.\n\nThis view has appeal to some, because it would assure disarmament; because it would right old wrongs after our abandonment of the Shiites and Kurds in 1991, and our support for Saddam Hussein in the 1980's when he was using chemical weapons and terrorizing his people; and because it would give the Iraqi people a chance to build a future in freedom.\n\nHowever, this course is fraught with danger. We and our NATO allies did not depose Mr. Milosevic, who was responsible for more than a quarter of a million people being killed in the 1990s. Instead, by stopping his aggression in Bosnia and Kosovo, and keeping on the tough sanctions, we created the conditions in which his own people threw him out and led to his being in the dock being tried for war crimes as we speak.\n\nIf we were to attack Iraq now, alone or with few allies, it would set a precedent that could come back to haunt us. In recent days, Russia has talked of an invasion of Georgia to attack Chechen rebels. India has mentioned the possibility of a pre-emptive strike on Pakistan. And what if China were to perceive a threat from Taiwan?\n\nSo Mr. President, for all its appeal, a unilateral attack, while it cannot be ruled out, on the present facts is not a good option.\n\nOthers argue that we should work through the United Nations and should only resort to force if and when the United Nations Security Council approves it. This too has great appeal for different reasons. The UN deserves our support. Whenever possible we should work through it and strengthen it, for it enables the world to share the risks and burdens of global security and when it acts, it confers a legitimacy that increases the likelihood of long-term success. The UN can help lead the world into a new era of global cooperation and the United States should support that goal.\n\nBut there are problems with this approach as well. The United Nations is an organization that is still growing and maturing. It often lacks the cohesion to enforce its own mandates. And when Security Council members use the veto, on occasion, for reasons of narrow-minded interests, it cannot act. In Kosovo, the Russians did not approve NATO military action because of political, ethnic, and religious ties to the Serbs. The United States therefore could not obtain a Security Council resolution in favor of the action necessary to stop the dislocation and ethnic cleansing of more than a million Kosovar Albanians. However, most of the world was with us because there was a genuine emergency with thousands dead and a million driven from their homes. As soon as the American-led conflict was over, Russia joined the peacekeeping effort that is still underway.\n\nIn the case of Iraq, recent comments indicate that one or two Security Council members might never approve force against Saddam Hussein until he has actually used chemical, biological, or God forbid, nuclear weapons.\n\nSo, Mr. President, the question is how do we do our best to both defuse the real threat that Saddam Hussein poses to his people, to the region, including Israel, to the United States, to the world, and at the same time, work to maximize our international support and strengthen the United Nations?\n\nWhile there is no perfect approach to this thorny dilemma, and while people of good faith and high intelligence can reach diametrically opposed conclusions, I believe the best course is to go to the UN for a strong resolution that scraps the 1998 restrictions on inspections and calls for complete, unlimited inspections with cooperation expected and demanded from Iraq. I know that the Administration wants more, including an explicit authorization to use force, but we may not be able to secure that now, perhaps even later. But if we get a clear requirement for unfettered inspections, I believe the authority to use force to enforce that mandate is inherent in the original 1991 UN resolution, as President Clinton recognized when he launched Operation Desert Fox in 1998.\n\nIf we get the resolution that President Bush seeks, and if Saddam complies, disarmament can proceed and the threat can be eliminated. Regime change will, of course, take longer but we must still work for it, nurturing all reasonable forces of opposition.\n\nIf we get the resolution and Saddam does not comply, then we can attack him with far more support and legitimacy than we would have otherwise.\n\nIf we try and fail to get a resolution that simply, but forcefully, calls for Saddam's compliance with unlimited inspections, those who oppose even that will be in an indefensible position. And, we will still have more support and legitimacy than if we insist now on a resolution that includes authorizing military action and other requirements giving some nations superficially legitimate reasons to oppose any Security Council action. They will say we never wanted a resolution at all and that we only support the United Nations when it does exactly what we want.\n\nI believe international support and legitimacy are crucial. After shots are fired and bombs are dropped, not all consequences are predictable. While the military outcome is not in doubt, should we put troops on the ground, there is still the matter of Saddam Hussein's biological and chemical weapons. Today he has maximum incentive not to use them or give them away. If he did either, the world would demand his immediate removal. Once the battle is joined, however, with the outcome certain, he will have maximum incentive to use weapons of mass destruction and to give what he can't use to terrorists who can torment us with them long after he is gone. We cannot be paralyzed by this possibility, but we would be foolish to ignore it. And according to recent reports, the CIA agrees with this analysis. A world united in sharing the risk at least would make this occurrence less likely and more bearable and would be far more likely to share with us the considerable burden of rebuilding a secure and peaceful post-Saddam Iraq.\n\nPresident Bush's speech in Cincinnati and the changes in policy that have come forth since the Administration began broaching this issue some weeks ago have made my vote easier. Even though the resolution before the Senate is not as strong as I would like in requiring the diplomatic route first and placing highest priority on a simple, clear requirement for unlimited inspections, I will take the President at his word that he will try hard to pass a UN resolution and will seek to avoid war, if at all possible.\n\nBecause bipartisan support for this resolution makes success in the United Nations more likely, and therefore, war less likely, and because a good faith effort by the United States, even if it fails, will bring more allies and legitimacy to our cause, I have concluded, after careful and serious consideration, that a vote for the resolution best serves the security of our nation. If we were to defeat this resolution or pass it with only a few Democrats, I am concerned that those who want to pretend this problem will go way with delay will oppose any UN resolution calling for unrestricted inspections.\n\nThis is a very difficult vote. This is probably the hardest decision I have ever had to make -- any vote that may lead to war should be hard -- but I cast it with conviction.\n\nAnd perhaps my decision is influenced by my eight years of experience on the other end of Pennsylvania Avenue in the White House watching my husband deal with serious challenges to our nation. I want this President, or any future President, to be in the strongest possible position to lead our country in the United Nations or in war. Secondly, I want to insure that Saddam Hussein makes no mistake about our national unity and for our support for the President's efforts to wage America's war against terrorists and weapons of mass destruction. And thirdly, I want the men and women in our Armed Forces to know that if they should be called upon to act against Iraq, our country will stand resolutely behind them.\n\nMy vote is not, however, a vote for any new doctrine of pre-emption, or for uni-lateralism, or for the arrogance of American power or purpose -- all of which carry grave dangers for our nation, for the rule of international law and for the peace and security of people throughout the world.\n\nOver eleven years have passed since the UN called on Saddam Hussein to rid himself of weapons of mass destruction as a condition of returning to the world community. Time and time again he has frustrated and denied these conditions. This matter cannot be left hanging forever with consequences we would all live to regret. War can yet be avoided, but our responsibility to global security and to the integrity of United Nations resolutions protecting it cannot. I urge the President to spare no effort to secure a clear, unambiguous demand by the United Nations for unlimited inspections.\n\nAnd finally, on another personal note, I come to this decision from the perspective of a Senator from New York who has seen all too closely the consequences of last year's terrible attacks on our nation. In balancing the risks of action versus inaction, I think New Yorkers who have gone through the fires of hell may be more attuned to the risk of not acting. I know that I am.\n\nSo it is with conviction that I support this resolution as being in the best interests of our nation. A vote for it is not a vote to rush to war; it is a vote that puts awesome responsibility in the hands of our President and we say to him - use these powers wisely and as a last resort. And it is a vote that says clearly to Saddam Hussein - this is your last chance - disarm or be disarmed.\n\nThank you, Mr. President.\n\n\n\n\n\n###", "images": ["https://web.archive.org/web/20060930180024im_/http://clinton.senate.gov/images/misc/clear.gif", "https://web.archive.org/web/20060930180024im_/http://clinton.senate.gov/images/press/header_links_speeches.jpg", "https://web.archive.org/web/20060930180024im_/http://clinton.senate.gov/images/press/footer.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Hillary Rodham Clinton, Senator for New York: Floor Speech of Senator Hillary Rodham Clinton on S.J. Res. 45, A Resolution to Authorize the Use of United States Armed Forces Against Iraq", "meta_data": {"description": "Floor Speech of Senator Hillary Rodham Clinton\non S.J. Res. 45, A Resolution to Authorize the Use of\nUnited States Armed Forces Against Iraq"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}