{"url": "https://www.independent.co.uk/arts-entertainment/music/news/michelle-williams-mental-health-help-destinys-child-depression-a8452261.html", "text": "Michelle Williams says she is seeking help for mental health issues after previously talking about suffering from depression.\n\nThe former Destiny's Child star wrote in an Instagram post that, as a mental health awareness advocate, she \"listened to the same advice\" that she has given others.\n\nHer post was praised for its honesty and she has since received support from the likes of original Destiny's Child member LaTavia Roberson and Missy Elliot.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n\"For years I have dedicated myself to increasing awareness of mental health and empowering people to recognise when it's time to seek help, support and guidance from those that love and care for your wellbeing,\" she wrote.\n\n\"I recently listened to the same advice I have given thousands around the world and sought help from a great team of healthcare professionals. Today I proudly, happily and healthily stand here as someone who will continue to always lead by example as I tirelessly advocate for the betterment of those in need.\"\n\nShe concluded: \"If you change your mind, you can change your life.\"\n\nIn an interview in October last year, Williams spoke about her experience of suffering from depression while she was in Destiny's Child.\n\n\"For years, I'm in one of the top-selling female groups of all time suffering with depression,\" she said. \"I was at that place where it got so dark and heavy because sometimes you feel like 'I'm the provider, I take care of people, I'm not supposed to be feeling this way - what do I do? I wanted out.\"\n\nResponding to Williams' Instagram post, Missy Elliot wrote on Twitter: \"I want to lift our sis up in prayer because there are so many people battling this and many trying to deal with it alone... Let's keep the ones who are openly dealing with it uplifted & be encouraging to them! Love u @RealMichelW.\"\n\nShape Created with Sketch. Great music documentaries to watch now Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Great music documentaries to watch now 1/6 Glastonbury The Movie (In Flashback) Glastonbury is taking a fallow year but if you’re still craving your Pilton fix, look no further. Filmed back in 1993, it captures the real, undiluted anarchic magic of the fields of Avalon, before it became the sanitised version it is today. Amazon Prime Video 2/6 What Happened, Miss Simone? An exceptional biopic detailing the life of the legendary singer and civil rights activist Nina Simone, featuring unseen footage, some spellbinding performances of her classic tracks and interviews with friends and family. Netflix 3/6 Whitney: Can I Be Me? Can I Be Me? Is the mantra Whitney adopted in the early years of her recording career as she tried to stay true to her musical influences. It’s a fitting title to this bittersweet, intimate portrait of a life in the balance. Netflix 4/6 Gaga: Five Foot Two Behind the scenes – without even the slightest whiff of a meat dress – this beautifully shot, slick documentary takes you into the heart of the inner sanctum of Gaga’s world as she works on her stripped bare album, Joanne. Netflix 5/6 Prince: Sign O’ The Times A must-see for any fans of the late, great, Purple One, this concert film captures Prince at his peak on the Sign O’ The Times tour in 1987. The music is exceptional. His stage presence unparalleled. Now TV Chris O’Meara/AP 6/6 Oh You Pretty Things: The Story of Music and Fashion, Part 2. Idols BBC4’s essential three-part series examines the close knit relationship between music and fashion. Part two takes a closer look at the Seventies - from Zandra Rhodes’ Queen costumes to the DIY punk explosion. iPlayer Getty Images 1/6 Glastonbury The Movie (In Flashback) Glastonbury is taking a fallow year but if you’re still craving your Pilton fix, look no further. Filmed back in 1993, it captures the real, undiluted anarchic magic of the fields of Avalon, before it became the sanitised version it is today. Amazon Prime Video 2/6 What Happened, Miss Simone? An exceptional biopic detailing the life of the legendary singer and civil rights activist Nina Simone, featuring unseen footage, some spellbinding performances of her classic tracks and interviews with friends and family. Netflix 3/6 Whitney: Can I Be Me? Can I Be Me? Is the mantra Whitney adopted in the early years of her recording career as she tried to stay true to her musical influences. It’s a fitting title to this bittersweet, intimate portrait of a life in the balance. Netflix 4/6 Gaga: Five Foot Two Behind the scenes – without even the slightest whiff of a meat dress – this beautifully shot, slick documentary takes you into the heart of the inner sanctum of Gaga’s world as she works on her stripped bare album, Joanne. Netflix 5/6 Prince: Sign O’ The Times A must-see for any fans of the late, great, Purple One, this concert film captures Prince at his peak on the Sign O’ The Times tour in 1987. The music is exceptional. His stage presence unparalleled. Now TV Chris O’Meara/AP 6/6 Oh You Pretty Things: The Story of Music and Fashion, Part 2. Idols BBC4’s essential three-part series examines the close knit relationship between music and fashion. Part two takes a closer look at the Seventies - from Zandra Rhodes’ Queen costumes to the DIY punk explosion. iPlayer Getty Images\n\nLaTavia Roberson, who was in Destiny's Child before Williams, called her a \"class act\". \"Depression is real especially in our community,\" she wrote. \"This is why I believe in live out loud and in colour. Keep shining Love ya sis. You're not in this alone!\"\n\nFor confidential support on issues involving mental health and depression, you can call Samaritans on 116 123 or visit mind.org.uk", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/18/09/Michelle-Williams-.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/18/09/Michelle-Williams-.jpg", "keywords": [], "authors": ["Roisin O'Connor"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/music/news/michelle-williams-mental-health-help-destinys-child-depression-a8452261.html", "title": "Michelle Williams: Destiny's Child star 'proudly' seeking help for mental health issues", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/music/news/michelle-williams-mental-health-help-destinys-child-depression-a8452261.html", "title": "Michelle Williams reveals she is 'proudly' seeking help over mental health issues", "description": "Singer revealed last year that she suffered from depression during her time as a member of the top-selling girl group", "updated_time": "2018-08-08T15:45:35+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/18/09/Michelle-Williams-.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8452261"}, "description": "Michelle Williams says she is seeking help for mental health issues after previously talking about suffering from depression. The former Destiny's Child star wrote in an Instagram post that, as a mental health awareness advocate, she \"listened to the same advice\" that she has given others.", "keywords": "Destiny's Child, Michelle Williams, Missy Elliot, LaTavia Roberson, depression, Mental Health, mental health awareness, News, Music, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Destiny's Child", "published_time": "2018-07-18T08:53:00+01:00", "modified_time": "2018-08-08T15:45:35+01:00", "section": "News", "author_name": "Roisin O'Connor", "content_type": "story", "word_count": 482, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 11, "external_link_count": 5}, "twitter": {"title": "Michelle Williams reveals she is 'proudly' seeking help over mental …", "description": "Michelle Williams says she is seeking help for mental health issues after previously talking about suffering from depression. The former Destiny's Child star wrote in an Instagram post that, as a", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1531900380.0, "source": "https://www.independent.co.uk", "summary": ""}