{"url": "www.inquisitr.com/4827007/blake-shelton-rumored-to-have-dumped-gwen-stefani-according-to-in-touch-weekly/", "text": "It’s apparently over between Blake Shelton and Gwen Stefani, according to the latest round of rumors. Shelton supposedly broke up with Stefani last month but the No Doubt singer is still clinging on to hope that they will get back together.\n\nBlake reportedly broke up with Gwen in February right before he went on tour, according to In Touch Weekly. The celebrity gossip magazine claims that a source close to the couple told them that Stefani is not taking the breakup too well.\n\n“Gwen doesn’t know what hit her,” said the source. “She’s heartbroken.”\n\nJealousy has apparently gotten the better of Gwen as Blake has had enough of her “neediness and all the drama,” which forced him to dump her, according to the source.\n\nRumor has it that Gwen is not too happy with the closeness between her boyfriend of two years and The Voice Season 13 winner Chloe Kohanski. Previous rumors say Blake and Chloe have developed a bond deeper than a student-teacher relationship, reported the Hollywood Gossip. This allegedly led Gwen to be suspicious of the two.\n\n“She told him she didn’t want to spend her life in fear of her famous partner cheating on her,” the source said.\n\nHowever, Gossip Cop has since debunked the rumor that Shelton and Stefani have been fighting because of the 24-year-old Kohanski.\n\n@blakeshelton #countrymusicfreakstour gx A post shared by Gwen Stefani (@gwenstefani) on Mar 14, 2018 at 3:28pm PDT\n\nThe supposed constant effort to reassure Gwen has taken a toll on Blake and now the county music superstar has reportedly told her that he’ll go through with the “latter part of the monthlong Country Freaks Tour without her.”\n\nThe insider said Gwen was caught by surprise.\n\n“Gwen was so used to accompanying him on tour, she was upended,” the source said. “After their nastiest argument ever, Blake took off without even saying goodbye. It was a real breaking point in the relationship.”\n\nAside from the rumored jealousy issues, Blake is also allegedly fed up with Gwen’s “demanding, critical ex-husband.” Stefani has been co-parenting her three sons with former husband and Bush frontman Gavin Rossdale. The two divorced after 13 years of marriage because of Rossdale cheating on Stefani.\n\nAfter the divorce, Gwen developed a friendly relationship with Blake while both were judges on The Voice. Their friendship eventually grew into a romantic relationship and the two has been together since unless, of course, the recent breakup rumor is true.\n\nTo make matters worse, the insider told In Touch Weekly that Blake has been getting some much-needed support from his ex-wife. Miranda Lambert is rumored to have recently split with Anderson East, which In Touch Weekly also reported a few days ago.\n\n“Miranda reached out to Blake via text,” the source said. “Ultimately, they buried the hatchet and have been supporting each other through their latest troubled relationships.”\n\nThe source also said Blake and Miranda have become “close friends and allies” during the past month and that the former lovers have become each other’s confidante.\n\nInterestingly, everything seems fine between Blake and Gwen based on the photos they have shared on social media. The two also performed together a few days ago and was seen shopping in Greensboro and enjoying themselves at Falls Park. As such, fans of the power couple may take this new breakup rumor with a grain of salt.", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/4b0fc539f03072b22dffa8ac42dcdf0b?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/03/Blake-Shelton-Gwen-Stefani-Breakup-Rumors.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Edge Ison"], "canonical_link": "https://www.inquisitr.com/4827007/blake-shelton-rumored-to-have-dumped-gwen-stefani-according-to-in-touch-weekly/", "title": "Blake Shelton Rumored To Have Dumped Gwen Stefani, According To ‘In Touch Weekly’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}