{"url": "www.etonline.com/news/212943_ben_affleck_history_with_alcohol_addiction_a_timeline_of_the_actor_struggles_and_road_to_recovery", "text": "Ben Affleck has returned to rehab as he continues to struggle with sobriety.\n\nJennifer Garner drove her estranged husband to an LA area facility on Wednesday afternoon, ET has learned. The 46-year-old actor knew he needed help and Garner was there for him, a source tells ET.\n\nAffleck revealed in March 2017 that he had completed treatment for alcoholism in order to be \"the best father I can be,\" but his history with addiction goes back much further. In fact, his experience with alcoholism began as a child, watching his own father, Timothy, battle the disease.\n\nAffleck has opened up about his past with alcoholism from his family's cycle of addiction to his 2001 rehab stint.\n\n\n\n1986: Parents' Divorce\n\n\"To be honest with you, the marriage was so bad, and I remember feeling relief,\" Affleck told Barbara Walters in a 2012 interview, reflecting on his parents' divorce when he was just 12 years old.\n\nA Timeline of Ben Affleck's Struggles With Sobriety This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\n\"[My father] was an alcoholic... I did know that as a child. He drank a lot. My father was a -- what did they call him -- a real alcoholic. He, you know, drank all day, drank every day, and to his credit, he got sober ultimately,\" he revealed. \"He's been sober for several decades, which I think is pretty impressive.\"\n\n\"[He] turned his life around in a very laudable way,\" the actor told The Daily Mail in 2008. \"But having such serious addiction issues has a major impact -- it colors who you are and becomes a part of you.\"\n\nThough he considered his childhood difficult, Affleck said it was his friend, Matt Damon, and brother, Casey, that helped him deal with his father's alcoholism and parent's divorce.\n\n\"I had good friends. I had Matt Damon, I had my brother, and I had a nucleus of friends that I grew up with and I had support from,\" he told Walters.\n\n\n\n1997: Managing Sobriety With Fame\n\nIt was a close collaboration with Damon that gained them both fame after 1997's Good Will Hunting -- shortly after which a 24-year-old Affleck stopped drinking.\n\n\"I just wanted to stop. I started regretting some things I did when I was drunk. It's funny to be obnoxious or out of control, but then it's like, 'I think I hurt that person's feelings,' 'I made a fool of myself' or 'I didn't want to kiss that girl,'\" he told a reporter in 1998. \"I have almost no inhibitions, so it's dangerous for me.\"\n\n\n\n2001: 30-Day Rehab Program\n\nIn July 2001, after a reported night of hard partying while between his high-profile relationships with Gwyneth Paltrow and Jennifer Lopez, Affleck completed a 30-day residential rehabilitation program for alcohol abuse, driven to Promises in Malibu by his friend, Charlie Sheen,People reported at the time. After news broke to the press, his publicist confirmed Affleck's rehab stay. \"Ben is a self-aware and smart man who has decided that a fuller life awaits him without alcohol,\" the rep stated. \"He is committed to traveling to a healthier road with the support of his family friends and fans.\"\n\n\"I went to rehab for being 29 and partying too much and not having a lot of boundaries and to clear my head and try to get some idea of who I wanted to be,\" Affleck told The Hollywood Reporter in 2012, declining to go into further detail. \"It was more a 'let me get myself straight,' before it became a rite of passage.\"\n\n\n\n2004: Jennifer Garner's Positive Influence\n\nIn 2004, Affleck married Daredevil co-star Jennifer Garner, who a source tells ET put a stop to Affleck's hard partying ways and helped the actor settle down.\n\nAccording to the source, friends noticed a significant change in the actor after the two got together, noting that Affleck was different than with past women he had dated. He settled down with Garner's positive influence, which \"lasted for a long time\" -- until the pair's split in June 2015.\n\n\"I think becoming a father makes you see the world differently and it’s good,\" Affleck said in a January 2017 interview with The Guardian, reflecting on his past mistakes and his three children with Garner: Violet, 11, Seraphina, 8, and Sam, 5.\n\n\"I’d always had a strong idea about my values and the direction I wanted to be headed in, then I ran into getting famous and it totally spun me around and I flailed around for a few years,\" he confessed. \"When you’re a young man in your 20s, part of that is making mistakes and learning from them. I just made those in front of everybody, rather than privately.\"\n\nJanuary 2017: Spotted Out With Sober Coach\n\nAffleck handled his most recent stint in rehab much more privately, though clues to the actor's struggles appeared in January, when the father of three was spotted with a blonde woman while out and about in Los Angeles.\n\nThough some at the time speculated that Affleck might have moved on from Garner (despite living on the same compound), a source told ET at the time that the woman was Elizabeth Weaver, a sober coach with whom he was working to make \"sure he stays on the right path.\"\n\n\"Ben has spent a good amount of time with her in recent weeks to kick his alcohol addiction,\" the source said. \"Ben is taking getting sober very seriously and knows he has to do this for his kids. Ben would do anything for his children and is hoping this will make his relationship with Jen better.\"\n\nFebruary 2017: Staying Sober at the Oscars\n\nA source tells ET that though Affleck is no longer working with Weaver, he was sober at the 2017 Academy Awards while supporting his little brother, Casey, as he won the Best Actor Oscar, and had a male sober companion by his side throughout the night.\n\nMarch 2017: \"Feeling Good\" After Rehab Announcement\n\nAffleck's Tuesday announcement credited his family, namely his three children, as his motivation for seeking treatment.\n\n\"I have completed treatment for alcohol addiction; something I've dealt with in the past and will continue to confront. I want to live life to the fullest and be the best father I can be,\" he wrote on Facebook. \"I want my kids to know there is no shame in getting help when you need it, and to be a source of strength for anyone out there who needs help but is afraid to take the first step.\"\n\n\"I'm lucky to have the love of my family and friends, including my co-parent, Jen, who has supported me and cared for our kids as I've done the work I set out to do,\" he continued. \"This was the first of many steps being taken towards a positive recovery.\"\n\n\"Ben did this for himself and his family. Family always comes first,\" a source tells ET. \"Ben has struggled with alcohol for years and it's a struggle that millions of people have to battle everyday. He has nothing to hide and wants his kids to know that he did everything he could to be a better father. That's why he announced it himself.\"\n\n\"He has completed his treatment and is feeling good,\" the source adds.\n\n\n\n2018: Returns to Rehab\n\nAffleck was taken to LA area facility on Wednesday, August 22 by his ex Jennifer Garner.\n\n\n\n\"Garner was very emotional but decided to take the situation into her own hands,\" an eyewitness tells ET. Garner appeared visibly shaken. \"She looked distraught.\"\n\nOn Wednesday, a separate source told ET that the actor has \"worked very hard to stay clean\" since his last stint in treatment, but there are concerns that he could be backsliding.\n\n\"Jen [Garner] is proud of the strides he's made, but some of his friends were worried he might be taking some steps backward and could be on a slippery slope,\" the source said.\"Ben wants nothing more than to get sober for his kids, for Jen and also for his career.\"\n\nThe source added that Affleck \"realizes the dangers of what he could lose in life if he doesn't stick to the program, and dedicate himself to these big changes.\"\n\nRELATED CONTENT:\n\nJennifer Garner Takes Ben Affleck Back to Rehab After His Struggles With Sobriety\n\nEverything Jennifer Garner Has Said About Ben Affleck Since Their Split\n\nBen Affleck 'Gave It His All' to Remain Sober But 'His Addiction Got the Best of Him,' Source Says (Exclusive)", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-03/benrehabdabs_1280_hulu.jpg?itok=HTnOzue4", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-01/300k%204.57.29%20PM.jpg?h=6c83441f&itok=hmPeZGv8", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/william-kate-gettyimages-1210304924.jpg?h=c673cd1c&itok=MhTkQIOb"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-03/benrehabdabs_1280_hulu.jpg?itok=HTnOzue4", "keywords": [], "authors": ["Jennifer Drysdale"], "canonical_link": "https://www.etonline.com/news/212943_ben_affleck_history_with_alcohol_addiction_a_timeline_of_the_actor_struggles_and_road_to_recovery", "title": "Ben Affleck's History With Alcohol Addiction: A Timeline of the Actor's Struggles and Road to Recovery", "meta_data": {"article": {"opinion": "false"}, "title": "Ben Affleck's History With Alcohol Addiction: A Timeline of the Actor's Struggles and Road to Recovery | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/news/212943_ben_affleck_history_with_alcohol_addiction_a_timeline_of_the_actor_struggles_and_road_to_recovery", "title": "Ben Affleck's History With Alcohol Addiction:  A Timeline", "description": "The 44-year-old actor announced on Tuesday that he had completed treatment for alcohol addiction.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-03/benrehabdabs_1280_hulu.jpg?itok=HTnOzue4", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 44-year-old actor announced on Tuesday that he had completed treatment for alcohol addiction.", "title": "Ben Affleck's History With Alcohol Addiction:  A Timeline", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jennifer Drysdale", "url": "https://www.etonline.com/news/212943_ben_affleck_history_with_alcohol_addiction_a_timeline_of_the_actor_struggles_and_road_to_recovery", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-03/benrehabdabs_1280_hulu.jpg?itok=HTnOzue4"}, "description": "The 44-year-old actor announced on Tuesday that he had completed treatment for alcohol addiction.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Matt Damon, Jennifer Garner, Ben Affleck", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.etonline.com", "summary": ""}