{"url": "https://www.vibe.com/2018/02/rihanna-birthday-toni-braxton-paris-hilton", "text": "The recent loss of legends in jazz, soul and classical music have saddened the music industry and reminded us of their touching gifts to music. The passing of Manu Dibango, Krzysztof Penderecki, Ellis Marsalis Jr., Bucky Pizzarelli and Alan Merrill brought endless tributes from peers and fans with the recent loss of soul singer-songwriter Bill Withers doing the same.\n\nWith a mirage of hits, the iconic songwriter left his mark on music with the release of his debut album Just As I Am in 1971. \"Ain't No Sunshine\" put a spotlight on his songwriting while 1977's \"Lovely Day\" reminded the industry of his signature vocals. Withers released eight studio albums, one live album and garnered three Grammys for his powerful songs that gave hope and love to fans to this day.\n\nHip-hop and R&B have gained the most from Withers as his music went on to inspire records like \"No Diggity\" by BLACKStreet, \"Roses\" by Kanye West and other songs from UGK, Dr. Dre, Jill Scott and more.\n\nTake a look at some of Withers' finest tunes covered, remixed and sampled below.\n\n__\n\n8. “Lovely Day” | Menagerie (1977)\n\nSampled On: T.W.D.Y., “Player’s Holiday” | Derty Werk (1999) LunchMoneyLewis - “It's Gonna Be A Lovely Day” feat. Aminè | Pets 2 Soundtrack (2019) Swizz Beatz - “Take A Picture” |One Man Band (2007)\n\nStandout: T.W.D.Y., “Player’s Holiday” | Derty Werk (1999)\n\nShort for \"The Whole Damn Yay,\" the group used Withers' sample while throwing a splash of The Bay's laid back flavor. With cameos from future legends like E-40 and Ray Luv, the single already embodied the best of R&B and hip-hop with guest verses from Too Short, Mac Mall and Otis & Shug. The mimosas and yacht are also a great touch.\n\nCovered By: Jill Scott, The Original Jill Scott from the Vault Vol. 1 (2011) Alt-J, This Is All Yours (2014) Robert Glasper Experiment, Black Radio 2 (2013) Kirk Franklin, The Nu Nation Project (1998)\n\nStandout: Kirk Franklin, The Nu Nation Project (1998)\n\nWho was going to beat a chorus singing to the lordt? Franklin's take on the classic gives us stirring gospel and appreciation for Withers and God. There are plenty of covers that have lifted the same vocals as Withers, but the ones listed have put their unique spin on the track.\n\n7. “Ain't No Sunshine” | Just As I Am (1971)\n\nSampled On: DMX - “No Sunshine” | Exit Wounds Soundtrack (2001) Lil B - “Up And Down” | Based Jam (2012) 2Pac- \"Soulja's Story\" | 2Pacalypse Now (1991)\n\nStandout: DMX - “No Sunshine” | Exit Wounds Soundtrack (2001)\n\n\"No Sunshine\" served as the only single from DMX's film alongside Steven Seagal, which gave everyone the perfect backdrop to the movie and X's intricate storytelling. Both the original and flipped version points out the dark elements of our lives. Withers penned the song after watching the film 1962 movie Days of Wine and Roses, he pondered over the toxicity in his life. \"Sometimes you miss things that weren't particularly good for you,\" he said in 2004 to SongFacts. \"It's just something that crossed my mind from watching that movie, and probably something else that happened in my life that I'm not aware of.\"\n\nCovered By: Soul For Real | Candy Rain (1994) Michael Jackson | Got to Be There (1972) The Boris Gardiner Happening | Is What's Happening (1973) The Temptations | Solid Rock (1972)\n\nStandout: Michael Jackson | Got to Be There (1972)\n\nAt 14, the future King of Pop gave a riveting cover of Withers' hit for his debut album, Got To Be There. From his vocal control throughout the track to the instrumentation, his cover takes the song to another level of heartbreak.\n\n6. \"Grandma's Hands” | Just As I Am (1971)\n\nSampled On: BLACKstreet - “No Diggity” feat. Dr. Dre and Queen Pen | Another Level (1996) Big K.R.I.T. - “I Gotta Stay” | K.R.I.T. Wuz Here (2010) Brother Ali - “Waheedah's Hands” | Champion (2004)\n\nStandout: BLACKstreet - “No Diggity” feat. Dr. Dre and Queen Pen | Another Level (1996)\n\nR&B heads are well aware of BLACKstreet's neverending ballads and the genius of Teddy Riley. But the pivot of their sound for their sophomore album Another Level was due to Withers and the William “Stylez” Stewart. Speaking to Fact Mag in 2017, the creator of New Jack Swing gave credit to Stylez for bringing him the sample of \"Grandma's Hands.\"\n\n“If he hadn’t played that sample for me, there would never be a ‘No Diggity’ And if he didn’t write it according to the melody I gave him so it would sound that way because I wanted it to sound funky,” he said. “I wanted it to be appealing to everyone, but mostly to women. I wanted every woman to feel like they were the ‘No Diggity’ girl and that song was about them and it came across. And now, still, today, that song plays and people are on that dancefloor.”\n\nCovered By: Gil Scott-Heron, Reflections (1981) Merry Clayton, Merry Clayton (1971) Barbra Streisand, Butterfly (1974)\n\nStandout: Gil Scott-Heron, Reflections (1981)\n\nGil Scott-Heron's version of the soul classic reminded us of his versatile talents. From spoken word to his vocal abilities, the Godfather of rap music always came through with his own sound and style. Reflections was one of four albums the late artist dropped in the 80s with critics looking to it as one of his finest projects. Other cuts from the album included \"Inner City Blues (Make Me Wanna Holler)\" and \"B Love.\"\n\n5. \"Use Me\" | Still Bill (1972)\n\nSampled On: Kendrick Lamar - “Sing About Me, I'm Dying Of Thirst\" | Good kid, Maad City (2012) J. Cole- \"Dollar And A Dream II\" | The Warm-Up (2009) Leela James - “So Good\" | Fall For You (2014) UGK - \"Use Me Up\" | The Southern Way (1992)\n\nStandout: Kendrick Lamar - “Sing About Me, I'm Dying Of Thirst\" | Good kid, Maad City (2012)\n\nLamar's take on \"Use Me\" blended right into the themes of his debut album, Good kid, Maad City allowing the artist to create another world on the project. To make things even better, Lamar also sampled Al Green's \"I'm Glad You're Mine\" for the track.\n\nCovered By: Grace Jones, Indigo Nights, Live (2008) Mick Jagger feat. Lenny Kravitz, Wandering Spirit (2004) Issac Hayes, Dr. Dolittle Soundtrack (1998)\n\nStandout: Mick Jagger feat. Lenny Kravitz, Wandering Spirit (2004)\n\nOn his third solo album, Jagger linked with Rick Rubin to test his creative energy, allowing him to work with Lenny Kravitz on their version of \"Use Me.\" Colliding worlds was one thing but to hear Kravitz's vocals come in on the bridge, set the track apart from the rest.\n\n4. “Kissing My Love” | Still Bill (1972)\n\nSampled On: J. Cole - “The Cut Off\" featuring kiLL Edward | KOD (2018) Dr. Dre - \"Let Me Ride\" featuring Snoop Dogg, RC and Jewell | The Chronic (1992) Masta Ace- \"Movin On\" | Take A Look Around (1990) Master P- \"Bastard Child\" | The Ghettos Tryin To Kill Me! | 1994\n\nStandout: Dr. Dre - \"Let Me Ride\" featuring Snoop Dogg, RC and Jewell | The Chronic (1992)\n\n\"Kissing My Love\" is one of most sampled from Withers catalog, thanks to its feverish drums. It's also why it fits into Dr. Dre's single and the G-funk era.\n\n3. Grover Washington's “Just The Two of Us” featuring Bill Withers | Winelight (1981)\n\nSampled/Covered On: Will Smith - “Just The Two of Us” | Big Willie Style (1997) Eminem- \"Just The Two of Us\" | Slim Shady EP (1997) Keri Hilson- \"Pretty Girl Rock\" | No Boys Allowed (2010)\n\nStandout: Will Smith - “Just The Two of Us” | Big Willie Style (1997)\n\nTouching and soulful, Smith's dedication to his eldest son Trey is just too cute for words.\n\n2. “Let It Be” | Just As I Am (1967)\n\nThe Original: The Beatles - “Let It Be” | Let It Be (1968)\n\n\"Let It Be\" is a pretty special record. Aretha Franklin recorded a version a year before the release of The Beatles' version and Withers gave his take on the record in the 70s. Slightly faster, his upbeat take on \"Let It Be\" just hits different.\n\n1. “Rosie” | Menagerie Re-Issue (1977)\n\nSampled On: Kanye West - “Roses” | Late Registration (2005)\n\nAs the somber part of Late Registration, \"Roses\" brings us into Kanye's world where he contemplates the mortality of a loved one. It's a sentimental take on the sample and one of the artist's most underrated songs. It's also a hidden gem for Withers as it isn't featured on Menagerie's LP. It was added as a bonus track on\n\nEnjoy the jams in playlist form below.", "images": ["https://www.vibe.com/assets/images/logo/white.svg?0cd0b31e24683c892ef3", "https://static.vibe.com/files/2020/04/GettyImages-1216652515-1586369049-650x366.jpg", "https://static.vibe.com/files/2020/04/sid-tipton-look-both-ways-premiere-1-copy-1587154525-e1587154609881-240x135.jpg", "https://static.vibe.com/files/2020/04/the-clark-sisters-lifetime-cast-viewers-1587065706-e1587066161772-300x169.jpg", "https://static.vibe.com/files/2020/04/pop-smoke-documentary-in-the-works-1-1587155425-240x135.jpg", "https://static.vibe.com/files/2020/04/kelly-rowland-coffee-music-video-1587167209-e1587167261519-240x135.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-compressed.jpg", "https://static.vibe.com/files/2020/04/Usher-The-Weeknd-Comparisons-1586361110-650x366.jpg", "https://static.vibe.com/files/2020/04/GettyImages-74959661-1585937337-e1585937419517-650x366.jpg", "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-431x602.jpg"], "top_img": "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "keywords": [], "authors": ["Sierra Brown"], "canonical_link": "https://www.vibe.com/2018/02/rihanna-birthday-toni-braxton-paris-hilton", "title": "Rihanna Rings In Her 30th Birthday With Toni Braxton And Paris Hilton", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-02-22T18:41:36-05:00", "published_time": "2018-02-22T16:23:32-05:00"}, "description": "Rihanna ushers in her Dirty 30s with her Day Ones, Toni Braxton and Paris Hilton.", "og": {"description": "Rihanna ushers in her Dirty 30s with her Day Ones, Toni Braxton and Paris Hilton.", "image": {"identifier": "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "height": 1500, "width": 1073}, "title": "Rihanna Rings In Her 30th Birthday With Toni Braxton And Paris Hilton", "type": "article", "url": "https://www.vibe.com/2018/02/rihanna-birthday-toni-braxton-paris-hilton", "site_name": "Vibe"}, "twitter": {"card": "summary", "description": "Rihanna ushers in her Dirty 30s with her Day Ones, Toni Braxton and Paris Hilton.", "image": "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "title": "Rihanna Brings In Her Dirty 30s With Toni Braxton And Paris Hilton", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1519334612.0, "source": "https://www.vibe.com", "summary": ""}