{"url": "https://www.bustle.com/p/13-celebrities-you-never-knew-the-stars-of-real-housewives-dated-27969", "text": "Both on- and off-screen the stars of Bravo's Real Housewives franchise never cease to surprise their fans. If you're in need of even more of a shock factor from the women, then here are a handful of people you never knew the Real Housewives have dated. Now that many of the Housewives are married with families, viewers don't often get to hear about their past relationships. Of course, there is the exception for those who can't help but brag about whether or not they've dated a celebrity. Do you really think Real Housewives of New York City's Sonja Morgan would pass up that chance?\n\nSurprisingly, the women of the Real Housewives have dated, or at least been linked to, many famous people. And the following list of men is actually quite impressive. It includes some extremely talented actors and singers. I mean, one of the women dated George Clooney and another one dated Nick Lachey. It’s crazy, right?\n\nRather than continuing to tease you with names, let’s get to it. Here are 13 famous individuals you probably had no idea some of the Real Housewives stars once dated. Don’t say I didn’t warn you about the surprises that are ahead.\n\n1. George Clooney\n\nMOLLY RILEY/AFP/Getty Images\n\nCan you believe Clooney is connected to one of the Housewives? To be exact, he dated Real Housewives of New York City's Carole Radziwill, or so she revealed during an episode. \"We dated literally during the Eisenhower administration,\" she said. Radziwill even called him \"lovely.\"\n\n2. Ralph Fiennes\n\nVittorio Zunino Celotto/Getty Images Entertainment/Getty Images\n\nIn addition to Clooney, Radziwill also dated Ralph Fiennes. She opened up about their one-time summer romance to Us Weekly in July 2014 and said, \"It was long ago and far away … over a summer I was living in London.\" As for whether or not a particular passage in her book The Widow's Guide to Sex and Dating is about her romance with Fiennes, it is not. \"[But] our relationship was not the basis for a storyline in my novel,\" she told Us. \"But like most fiction, stories are a pinch of the writer's experience and a part their imagination.\"\n\n3. Nick Lachey\n\nNoam Galai/Getty Images Entertainment/Getty Images\n\nFormer Real Housewives of Orange County star Lizzie Rovsek once dated Nick Lachey. During a July 2014 Watch What Happens Live airing, Andy Cohen brought up to Rovsek how the 98 Degrees singer once revealed in an elevator during a WWHL appearance that he dated the Housewife. Per Cohen, Lachey said, \"Oh my god. This woman that I used to date is about to be an Orange County Housewife.\" After Cohen asked Rovsek on WWHL, \"You dated him both pre and post Jessica [Simpson], right?\" she answered, \"Yes.\"\n\n4. Russell Simmons\n\nVivien Killilea/Getty Images Entertainment/Getty Images\n\nRussell Simmons hasn't dated only one Housewife, but two Housewives. During a Season 1 Real Housewives of Potomac episode, Katie Rost revealed she dated Simmons. Things did not end well between them, as she documented in some breakup blogs, but despite any drama, they are actually friends.\n\nAccording to Bravo, the other Bravolebrity the Def Jam co-founder dated is none other than Real Housewives of Atlanta star Cynthia Bailey. Actually, Bravo reports that Bailey's ex-husband Peter Thomas revealed to Essence in November 2010 that Simmons even proposed to her, but Bailey turned him down.\n\n5. Ben Stiller\n\nAstrid Stawiarz/Getty Images Entertainment/Getty Images\n\nThis one might come as a huge shock: Ben Stiller dated Brandi Glanville. I repeat, Ben Stiller dated Brandi Glanville in the '90s. During a February 2016 WWHL appearance Stiller said about dating the Real Housewives of Beverly Hills alum, \"It was short-lived and it was fun. I wouldn't characterize it as a relationship. It was a couple of dates, and fun.\"\n\nApparently, there has been speculation that Glanville dated Stiller ever since her 2014 book, Drinking and Dating, was released. Per SheKnows, she describes a comedian without naming his name and says he was a \"height-challenged up-and-coming comedian.\" SheKnows reports she also writes, \"He had the kind of face you remember. Sharp features, thick dark hair and a goofy grin.\" It's unclear if this exact passage is about Stiller, but it sure seems likely.\n\n6. Gerard Butler\n\nEmma McIntyre/Getty Images Entertainment/Getty Images\n\nThey may have not seriously dated, but Gerard Butler is connected to Brandi Glanville. The former Housewife appeared on WWHL in January 2012, where she dished that Butler is the most famous person she's ever had sex with besides her ex-husband, Eddie Cibrian. She called it \"a week of fun\" and gave Butler an \"11\" on his bedroom skills. However, when approached by TMZ in January 2012, Butler responded to Glanville's claims by asking, \"Who's Brandi Glanville?\"\n\nHowever, Butler confirmed he did have sex with Glanville to Howard Stern (via New York Daily News) in March 2013. His story differs from the Bravolebrity's, because according to him, they spent only an afternoon together rather than a week. \"It was a one-afternooner, but it was fun.\" He added, \"She is wild.\" As for why he seemingly pretended not to know her, he said, \"You know what I said, 'Who's Brandi Glanville?,\" because I didn't know her last name, didn't know she was a celebrity, didn't know she was going to run out and f*cking tell everyone about it!\"\n\nHe confronted her about it and she told Cohen on WWHL in March 2013, \"We had a little texting today, and I think he's a doll and I feel bad for what I said. He is lovely and I appreciate him making it right.\"\n\n7. C. Thomas Howell\n\nRick Diamond/Getty Images Entertainment/Getty Images\n\nIf you ever wanted to know who RHOBH star Kyle Richards lost her virginity to, here you go. C. Thomas Howell was her first boyfriend and they dated for five years. Richards confirmed to Andy Cohen on his Sirius XM radio show in December 2015 that her first time having sex was with Howell. However, she didn't really want to talk about it and said, \"Oh my God, this is so awkward. I'm so glad my husband isn't here right now.\"\n\n8. Julio Iglesias\n\nRONALDO SCHEMIDT/AFP/Getty Images\n\nOf course former reality star Yolanda Hadid dated musician Julio Iglesias. In a March 2015 RHOBH episode, Hadid told her co-stars while eating at an Amsterdam restaurant, \"I used to date Julio Iglesias, don't know if you guys know him, but when I was dating him 30 years ago, he was the one who brought me here for the first time.\" If you want to see a photo of the two in 1986, click here.\n\n9. Jensen Ackles\n\nAlberto E. Rodriguez/Getty Images Entertainment/Getty Images\n\nDid you know a Supernatural star apparently dated a Real Housewives of Miami star? Based on these photos from Getty Images, Jensen Ackles and Joanna Krupa seem to have once been an item. The kiss and the hand holding sure make it seem like they dated at one point in time. Seeing as the majority of the photos were taken in 2005, they most likely dated 12 years ago.\n\n10. Billy Idol\n\nMike Windle/Getty Images Entertainment/Getty Images\n\nIf anyone has a long list of famous men they once dated, it's RHONY's Sonja Morgan. In May 2011, she told Paper magazine that she dated Billy Idol. Morgan said, \"I went out with Billy for a while. That was nice.\" She then added, \"It was scary because he was dating Perry Lister, she had red hair and was like six feet tall. He's a vegetarian and a very nice man.\" It's unclear if she dated Idol at the same time as Lister.\n\nThough, in April 2011, Morgan told the New York Post that \"there were some Billy Idol days,\" after being asked about her past boyfriends. She then added, \"Dating is a strong word for some people.\" Who knows if she and Idol were serious or not.\n\n11. Matt Dillon\n\nVALERY HACHE/AFP/Getty Images\n\nNext for Morgan is actor Matt Dillon. She also told Paper magazine, \"Yeah, we had one whole date. Then he left me to go with another girl. It's an experience and it's fun.\" That's all we know about this supposed date between Morgan and Dillon, but who else wants to hear more details?\n\n12. Owen Wilson\n\nJeff Spicer/Getty Images Entertainment/Getty Images\n\nWhile appearing on WWHL in April 2015, Morgan revealed she dated Owen Wilson. She didn't elaborate any further than saying they dated. In January 2013, Morgan chatted with Star Pulse and said the following about Wilson, \"My celebrity crushes are the kooky, fun and quirky guys. Men like Owen Wilson, who I’ve had a flirt with, as he’s cute and brilliant.\"\n\n13. Eric Clapton\n\nLarry Busacca/Getty Images Entertainment/Getty Images\n\nDuring her April 2015 WWHL appearance, Morgan also confirmed she dated Eric Clapton. In a June 2012 RHONY episode, Morgan actually brought up Clapton's name after Aviva Drescher pulled out a bag holding one of her prosthetic legs. She said, \"I know that bag, Eric Clapton used to bring it to lunch then we'd go play pool.\" Before that, in a May 2011 blog post for Bravo, Morgan mentioned Clapton and wrote, \"I was introduced to several good restaurants by my dear old friend Eric Clapton. Boy did we have a great time.\"\n\nThere you have it. Some of the Real Housewives sure have a history with many famous faces.", "images": ["https://imgix.bustle.com/2017/1/4/521444004.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/508400636.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/616269608.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/513262748.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/390280ff-bf0e-41f6-8b19-ff8a0c409327.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/10/619040974.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/390280ff-bf0e-41f6-8b19-ff8a0c409327.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/2017/1/4/610053208.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/468854282.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/1da7b35e-7e55-4806-af9d-3280aa32eb53-getty-1173358504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/158285679.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/14/efcd4f59-9964-4c6d-a6ad-4634b0b09f8a-getty-1156675580.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/0da7790c-e1c6-4938-8b28-31640686b33f-getty-1209799362.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/489678462.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/534025852.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/480759450.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/603215898.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/4/457200924.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/2017/1/4/390280ff-bf0e-41f6-8b19-ff8a0c409327.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/13-celebrities-you-never-knew-the-stars-of-real-housewives-dated-27969", "title": "13 Celebrities You Never Knew The Stars Of 'Real Housewives' Dated", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/13-celebrities-you-never-knew-the-stars-of-real-housewives-dated-27969", "type": "article", "title": "13 Celebs You Never Knew The Real Housewives Dated", "description": "Both on- and off-screen the stars of Bravo's Real Housewives franchise never cease to surprise their fans. If you're in need of even more of a shock factor from the women, then here are a handful of people you never knew the Real Housewives have…", "image": {"identifier": "https://imgix.bustle.com/2017/1/4/390280ff-bf0e-41f6-8b19-ff8a0c409327.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Both on- and off-screen the stars of Bravo's Real Housewives franchise never cease to surprise their fans. If you're in need of even more of a shock factor from the women, then here are a handful of people you never knew the Real Housewives have…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}