{"url": "https://variety.com/2018/music/news/carly-pearce-country-music-women-1202985671/", "text": "On this week’s “CMT Artists of the Year” show, Little Big Town’s Karen Fairchild roused the crowd by using her acceptance speech to run through a list of 35 younger female country artists who are “there for you to support and play on the radio.” Not every singer on her list has found radio play completely elusive, though. A handful of the singers Fairchild mentioned have had some notable airplay — with the biggest out-of-the-box solo female success story of the last three years being Carly Pearce, whose first single, “Every Little Thing,” went to No. 1 in the format in 2017.\n\nThat’s why Pearce was the perfect choice to perform an acoustic set at the end of an panel discussion CMT and Variety jointly hosted about the plight of country’s female acts. Singing three songs and speaking freely about her own rough 10-year road on the way to becoming an overnight sensation, she provided a beam of hope to close out the “Breaking Down The Barrier: A Conversation About Women In Country Music” event, held at Nashville’s Cambria Hotel.\n\nVariety spoke with Pearce to hear more about whether she was really told things were hopeless for her because she was a woman (spoiler: she was) and the more cheerful subject of whether she might already have a sophomore effort on the way (she does).\n\nVARIETY: As Leslie Fram said in introducing you, you’re one of three solo females in the last 12 years to have a debut song top the country radio charts. Yet for a song that bucked the odds like that, “Every Little Thing” doesn’t check off every obvious box, or have obvious smash written all over it.\n\nPEARCE: If you look at the song that changed my life, it’s a heartbreak ballad with very little production, that was put out in the summer, by a brand new female. So we can’t live by the stereotype that women don’t work. Because I was a walking stereotype (of multiple recipes for failure) — and I worked.\n\nYou said you had 10 years of sheer frustration before getting signed to Big Machine. That’s sort of hard to fathom when things suddenly go as immediately well as they did for you.\n\nIt was definitely 10 years of feeling like I wasn’t good enough or that I didn’t have music that people thought was relatable or made to be on radio. I went into Leslie Fram’s office (at CMT) and cried so many times. I was so many times feeling defeated just because I was a female before they ever heard my music. I try to be very honest, now that I have some kind of platform in this genre, to let other females know that I was passed on by everyone. And what’s been great for me is to be able — and I say this very respectfully — to get out of Nashville and forget all the “male/female/male/female” (debates) and go play my music and see the girls in the front row sing back every word. Hear the people in the meet-and-greet say, “Your album — not just your song, but your album — got me through whatever experience” or “I hope to one day move to Nashville and do what you’re doing.” That’s been very inspiring and healed a lot of wounds that I had of feeling like I wasn’t good enough.\n\nWere you ever told explicitly that the rejection had to do with being a woman? Or was it couched in euphemisms?\n\nOh, (it was clear) I was penalized just for being a female, immediately. They didn’t want to take meetings with me if I was a female. They couldn’t get the females on their roster to work. I came into the scene when there were no girls. Kelsea (Ballerini) had not hit yet. Maddie & Tae with “Girl in a Country Song” had not hit. Maren (Morris) had not hit. There was no (CMT) Next Women of Country movement. Leslie hadn’t gotten that going when I first moved here. So it was definitely a lot different and even harder then. So I look at the last 10 years and think we’ve come a long way. And I have a very optimistic outlook on it, because I see, little by little, people like Kelsea and Maren and myself changing the game and being given opportunities. You know, it’s not by chance or by luck that three of the biggest male acts in the format took me as the female artist on tour this year. (Those headliners taking her out as opening act in 2018 were Blake Shelton, Rascal Flatts and, currently, Luke Bryan.) Obviously people want to hear women.\n\nDo you remember any rock-bottom points?\n\nTwo scenarios come to mind. In one, I was actually told by somebody very influential in the industry during a meeting to “move home.” And I remember making it out to my car just as the door shut before there was guttural crying. And another is, I played “Every Little Thing” for a lot of people right before it came out, and they told me that it wasn’t special, that my music wasn’t special and I was gonna have to change who I was in order to get a shot. So it’s been beautiful to align myself with a team that believed in the artist that I was and the music that I wanted to make, and I’ve never had to compromise on that. But the fans did this for me. My song went off to Sirius XM with no backing, no nothing, and the fans heard it and they connected to it, and that in itself needs to be shown and really articulated, because that was purely off of people listening to the radio and connecting to the song.\n\nTerrestrial radio took to you, too. Did the subject of women’s difficulties in breaking through come up when you would do those promotional tours?\n\nEach radio person and experience is different. You have some PDs that don’t look at it at all that way; you have some that do. For me, I’ve tried to keep it as much about the authenticity of my music as I can, whatever gender I am. My job in those radio visits is just to convey what my truth is, and they either like it or they don’t. I wish the idea of playing myself and Kelsea back to back wasn’t a no-no or something that gets a slap on the hands. But I do believe that I’ve been heard and respected as an artist just as much as any other artist, female or male, as I’ve introduced myself to country music. And I am really lucky. I travel with all men, my managers are male, my band is male, my radio team is primarily male, and my label head is a male — and I feel very respected. I feel like a partner as a businessperson, not just as a businesswoman.\n\nThe female artists in country tend to be more individualistic, and it’s not always clear whether that’s for better or worse, commercially.\n\nI feel like it’s very easy to distinguish myself from Kelsea or Maren or Lauren (Alaina), but you look at how many solo male artists there are, and I don’t know that you can really always differentiate them. And there are some pros and cons to that. When Faith and Trisha and Shania were big, if you hit, you were big.\n\nThat seems like such a different time. Those women of the ‘90s were huge without a lot of talk about how they’d smashed through some impossible barrier.\n\nThere were so many, from Reba to Sara Evans and Martina to the Dixie Chicks. And then after that, you have Carrie, Miranda and Taylor (coming along in the mid-2000s). They all meant so much to me. Who are going to be the next superstar females for the little girl — the mini-Carly Pearce — that’s figuring out that she wants to do this for a living? Who’s going to be her era of superstars that she’s idolizing? That’s something that we all have to be aware of.\n\nMaybe it’s the setbacks, but the women of country seem to have a we’re-all-in-this-together attitude that doesn’t always occur in the competitive world of pop.\n\nAnd Kelsea has been incredible to me, before I ever had a record deal; she liked my music and believed in what I was doing, so she took me under her wing, in the same way that Leslie has taken me and so many other women under her wing at CMT. And I think it’s now my responsibility to continue to carry the torch for whoever that next person that maybe is having some of the hardships that I went through in the last 10 years, and already I want to help pass it, in the way that Kelsea did for me, and the way that Taylor did for Kelsea. I’ve had people coming up behind me — Kalie Shorr and Runaway June are just two that come to mind — that go, “You’re paving the way for us to have a shot.” I take that seriously. That will never leave my brain.\n\nSo, you have a new album in the works?\n\nYeahhhhhh!\n\nHow far along is it?\n\nHmmmm… I’m about to shock everybody. [Coyly.] I don’t know, we’ll see. I’ve been working really hard. I just celebrated the one-year anniversary of the first album this week. I gave everything that I could into that first record of saying hello to country music, and I think that they know now that I’m here to stay in the genre and my heart beats in country. and I’m excited to show the evolution of my life over the last 15 months.\n\nSo, no predictions about when the first single from the second album will come out?\n\nSoon. My publicists are in here. I got my moms in here; I can’t be letting it out! Very soon. Like, really soon. Like, keep-checking-soon.\n\nIs there anything in particular you’ve changed up for the second album?\n\nAgain, I want to be The Female Country Artist. (As aspirations) I see CMAs, ACMs, Grand Ole Opry member — that is where my heart is. I have no desire to chase other genres. This is my lane; this is my wheelhouse. I hope to be Dolly Parton one day. So with that, you’re going to hear… The dobro has become a key part of my sound. And a lot in my life has changed, both professionally and personally. It’s going to be the same girl you know that’s unapologetically herself, but you’re going to hear a bit more of a maturity and just being completely 100% me for the first time. A lot of those songs that I wrote for the first record were in the midst of… not drowning, but swimming, trying to keep myself afloat. And now I know who I am, and I’ve grown up in the last two years. A lot of those songs [on the first album] were written even four and five years ago. So it’ll be a stronger perspective, but the same country girl. A lot happier girl.", "images": ["https://pmcvariety.files.wordpress.com/2018/10/carlysmile-e1539964612995.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Fmusic%2Fnews%2Fcarly-pearce-country-music-women-1202985671%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202985671&comment_count=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/10/carlysmile-e1539964612995.jpg?w=1000", "keywords": [], "authors": ["Chris Willman"], "canonical_link": "https://variety.com/2018/music/news/carly-pearce-country-music-women-1202985671/", "title": "Carly Pearce Does ‘Every Little Thing’ to Break Barrier Against Women in Country Music", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Country breakout Carly Pearce provided a beam of hope for women in the genre, singing and telling her story at a CMT/Variety summit.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202985671, "author": "Chris Willman", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-10-19T09:29:44"}, "pmc-tag": "carly pearce,cmt artists of the year,Leslie Fram", "title": "Carly Pearce Does ‘Every Little Thing’ to Break Barrier Against Women in Country Music", "pageclass": "article", "pmc-vertical": "music", "pmc-primary-category": "News", "pmc-primary-vertical": "music", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Carly Pearce Does ‘Every Little Thing’ to Break Barrier Against Women in Country Music", "url": "https://variety.com/2018/music/news/carly-pearce-country-music-women-1202985671/", "description": "On this week’s “CMT Artists of the Year” show, Little Big Town’s Karen Fairchild roused the crowd by using her acceptance speech to run through a list of 35 younger female country artists who are “…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/10/carlysmile-e1539964612995.jpg?w=1000", "width": 1000, "height": 623, "alt": "NASHVILLE, TENNESSEE - OCTOBER 16:  Recording Artist Carly Pearce Performs at True Bar and Music Room on October 16, 2018 in Nashville, Tennessee.  (Photo by Jason Davis/Variety)"}, "locale": "en_US"}, "article": {"published_time": "2018-10-19T16:29:44+00:00", "modified_time": "2018-10-19T16:31:06+00:00"}, "twitter": {"creator": "@https://twitter.com/ChrisWillman", "site": "@variety", "text": {"title": "Carly Pearce Does ‘Every Little Thing’ to Break Barrier Against Women in Country Music"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/10/carlysmile-e1539964612995.jpg?w=1000", "alt": "NASHVILLE, TENNESSEE - OCTOBER 16:  Recording Artist Carly Pearce Performs at True Bar and Music Room on October 16, 2018 in Nashville, Tennessee.  (Photo by Jason Davis/Variety)"}, "card": "summary_large_image", "title": "Carly Pearce Does ‘Every Little Thing’ to Break Barrier Against Women in Country Music", "description": "Country breakout Carly Pearce provided a beam of hope for women in the genre, singing and telling her story at a CMT/Variety summit."}, "author": "Chris Willman", "content_type": "Article", "post_id": 1202985671, "title": "Carly Pearce Does 'Every Little Thing' to Break Barrier Against Women in Country Music", "published_at": "2018-10-19 09:29:44", "image": "https://pmcvariety.files.wordpress.com/2018/10/carlysmile-e1539964612995.jpg?w=1000", "comment_count": 1, "tags": "Leslie Fram", "topics": "News", "appeared_in_print": "No", "body": "On this week’s “CMT Artists of the Year” show, Little Big Town’s Karen Fairchild roused the crowd by using her acceptance speech to run through a list of 35 younger female country artists who are “there for you to support and play on the radio.” Not every singer on her list has found radio play completely elusive, though. A handful of the singers Fairchild mentioned have had some notable airplay — with the biggest out-of-the-box solo female success story of the last three years being Carly Pearce, whose first single, “Every Little Thing,” went to No. 1 in the format in 2017.\r\n\r\nThat’s why Pearce was the perfect choice to perform an acoustic set at the end of an panel discussion CMT and Variety jointly hosted about the plight of country’s female acts. Singing three songs and speaking freely about her own rough 10-year road on the way to becoming an overnight sensation, she provided a beam of hope to close out the “Breaking Down The Barrier: A Conversation About Women In Country Music” event, held at Nashville’s Cambria Hotel.\r\n\r\nVariety spoke with Pearce to hear more about whether she was really told things were hopeless for her because she was a woman (spoiler: she was) and the more cheerful subject of whether she might already have a sophomore effort on the way (she does).\r\n\r\n\r\nVARIETY: As Leslie Fram said in introducing you, you're one of three solo females in the last 12 years to have a debut song top the country radio charts. Yet for a song that bucked the odds like that, “Every Little Thing” doesn’t check off every obvious box, or have obvious smash written all over it.\r\n\r\nPEARCE: If you look at the song that changed my life, it’s a heartbreak ballad with very little production, that was put out in the summer, by a brand new female. So we can’t live by the stereotype that women don’t work. Because I was a walking stereotype (of multiple recipes for failure) — and I worked.\r\n\r\nYou said you had 10 years of sheer frustration before getting signed to Big Machine. That’s sort of hard to fathom when things suddenly go as immediately well as they did for you.\r\n\r\nIt was definitely 10 years of feeling like I wasn’t good enough or that I didn’t have music that people thought was relatable or made to be on radio. I went into Leslie Fram’s office (at CMT) and cried so many times. I was so many times feeling defeated just because I was a female before they ever heard my music. I try to be very honest, now that I have some kind of platform in this genre, to let other females know that I was passed on by everyone. And what’s been great for me is to be able — and I say this very respectfully — to get out of Nashville and forget all the “male/female/male/female” (debates) and go play my music and see the girls in the front row sing back every word. Hear the people in the meet-and-greet say, “Your album — not just your song, but your album — got me through whatever experience” or “I hope to one day move to Nashville and do what you’re doing.” That’s been very inspiring and healed a lot of wounds that I had of feeling like I wasn’t good enough. \r\n\r\n\r\n\r\nWere you ever told explicitly that the rejection had to do with being a woman? Or was it couched in euphemisms?\r\n\r\nOh, (it was clear) I was penalized just for being a female, immediately. They didn’t want to take meetings with me if I was a female. They couldn’t get the females on their roster to work. I came into the scene when there were no girls. Kelsea (Ballerini) had not hit yet. Maddie & Tae with \"Girl in a Country Song\" had not hit. Maren (Morris) had not hit. There was no (CMT) Next Women of Country movement. Leslie hadn’t gotten that going when I first moved here. So it was definitely a lot different and even harder then. So I look at the last 10 years and think we’ve come a long way. And I have a very optimistic outlook on it, because I see, little by little, people like Kelsea and Maren and myself changing the game and being given opportunities. You know, it’s not by chance or by luck that three of the biggest male acts in the format took me as the female artist on tour this year. (Those headliners taking her out as opening act in 2018 were Blake Shelton, Rascal Flatts and, currently, Luke Bryan.) Obviously people want to hear women. \r\n\r\nDo you remember any rock-bottom points?\r\n\r\nTwo scenarios come to mind. In one, I was actually told by somebody very influential in the industry during a meeting to “move home.” And I remember making it out to my car just as the door shut before there was guttural crying. And another is, I played “Every Little Thing” for a lot of people right before it came out, and they told me that it wasn’t special, that my music wasn’t special and I was gonna have to change who I was in order to get a shot. So it’s been beautiful to align myself with a team that believed in the artist that I was and the music that I wanted to make, and I’ve never had to compromise on that. But the fans did this for me. My song went off to Sirius XM with no backing, no nothing, and the fans heard it and they connected to it, and that in itself needs to be shown and really articulated, because that was purely off of people listening to the radio and connecting to the song. \r\n\r\nTerrestrial radio took to you, too. Did the subject of women’s difficulties in breaking through come up when you would do those promotional tours?\r\n\r\nEach radio person and experience is different. You have some PDs that don’t look at it at all that way; you have some that do. For me, I’ve tried to keep it as much about the authenticity of my music as I can, whatever gender I am. My job in those radio visits is just to convey what my truth is, and they either like it or they don’t. I wish the idea of playing myself and Kelsea back to back wasn’t a no-no or something that gets a slap on the hands. But I do believe that I’ve been heard and respected as an artist just as much as any other artist, female or male, as I’ve introduced myself to country music. And I am really lucky. I travel with all men, my managers are male, my band is male, my radio team is primarily male, and my label head is a male — and I feel very respected. I feel like a partner as a businessperson, not just as a businesswoman.\r\n\r\nThe female artists in country tend to be more individualistic, and it’s not always clear whether that’s for better or worse, commercially.\r\n\r\nI feel like it’s very easy to distinguish myself from Kelsea or Maren or Lauren (Alaina), but you look at how many solo male artists there are, and I don’t know that you can really always differentiate them. And there are some pros and cons to that. When Faith and Trisha and Shania were big, if you hit, you were big. \r\n\r\nThat seems like such a different time. Those women of the ‘90s were huge without a lot of talk about how they’d smashed through some impossible barrier.\r\n\r\nThere were so many, from Reba to Sara Evans and Martina to the Dixie Chicks. And then after that, you have Carrie, Miranda and Taylor (coming along in the mid-2000s). They all meant so much to me. Who are going to be the next superstar females for the little girl — the mini-Carly Pearce — that’s figuring out that she wants to do this for a living? Who’s going to be her era of superstars that she’s idolizing? That’s something that we all have to be aware of. \r\n\r\n\r\n\r\nMaybe it’s the setbacks, but the women of country seem to have a we’re-all-in-this-together attitude that doesn’t always occur in the competitive world of pop.\r\n\r\nAnd Kelsea has been incredible to me, before I ever had a record deal; she liked my music and believed in what I was doing, so she took me under her wing, in the same way that Leslie has taken me and so many other women under her wing at CMT. And I think it’s now my responsibility to continue to carry the torch for whoever that next person that maybe is having some of the hardships that I went through in the last 10 years, and already I want to help pass it, in the way that Kelsea did for me, and the way that Taylor did for Kelsea. I’ve had people coming up behind me — Kalie Shorr and Runaway June are just two that come to mind — that go, “You’re paving the way for us to have a shot.” I take that seriously. That will never leave my brain.\r\n\r\nSo, you have a new album in the works?\r\n\r\nYeahhhhhh!\r\n\r\nHow far along is it?\r\n\r\nHmmmm… I’m about to shock everybody. [Coyly.] I don’t know, we’ll see. I’ve been working really hard. I just celebrated the one-year anniversary of the first album this week. I gave everything that I could into that first record of saying hello to country music, and I think that they know now that I’m here to stay in the genre and my heart beats in country. and I’m excited to show the evolution of my life over the last 15 months.\r\n\r\nSo, no predictions about when the first single from the second album will come out?\r\n\r\nSoon. My publicists are in here. I got my moms in here; I can’t be letting it out! Very soon. Like, really soon. Like, keep-checking-soon.\r\n\r\nIs there anything in particular you’ve changed up for the second album?\r\n\r\nAgain, I want to be The Female Country Artist. (As aspirations) I see CMAs, ACMs, Grand Ole Opry member — that is where my heart is. I have no desire to chase other genres. This is my lane; this is my wheelhouse. I hope to be Dolly Parton one day. So with that, you’re going to hear... The dobro has become a key part of my sound. And a lot in my life has changed, both professionally and personally. It’s going to be the same girl you know that’s unapologetically herself, but you’re going to hear a bit more of a maturity and just being completely 100% me for the first time. A lot of those songs that I wrote for the first record were in the midst of… not drowning, but swimming, trying to keep myself afloat. And now I know who I am, and I’ve grown up in the last two years. A lot of those songs [on the first album] were written even four and five years ago. So it’ll be a stronger perspective, but the same country girl. A lot happier girl.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/gA4-jiQ1bOI?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/y3yJGDSE54c?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1539966584.0, "source": "https://variety.com", "summary": ""}