{"url": "https://en.wikipedia.org/wiki/Dax_Shepard", "text": "American actor\n\nDax Randall Shepard[2] (born January 2, 1975)[3] is an American actor, writer, director and podcast host. He is best known for his work in the feature films Without a Paddle (2004), Zathura: A Space Adventure (2005), Employee of the Month (2006), Idiocracy (2006), Let's Go to Prison (2006), Hit and Run (2012), and CHiPs (2017), the last pair of which he also wrote and directed, and the MTV practical joke reality series Punk'd (2003). He portrayed Crosby Braverman in the NBC comedy-drama series Parenthood from 2010 to 2015. Since 2018, he has hosted the popular podcast Armchair Expert. He played Luke Matthews in the Netflix show The Ranch and co-stars in ABC's Bless This Mess.\n\nEarly life [ edit ]\n\nShepard was born in Highland Township, Oakland County, Michigan, in suburban Detroit.[4][2] He is the son of Laura LaBo,[5][6] who worked at General Motors (GM), and David Robert \"Dave\" Shepard, Sr.(deceased),[7][8][9] who was a car salesman.[8][10] His parents divorced when he was 3 years old.[4]\n\nShepard's mother developed a substantial business by the time he was in high school.[5] She worked car shows with traveling events at race tracks. She started as a janitor on the midnight shift at GM,[11] then worked in fleet management at the GM proving grounds in Milford, Michigan, then hosted hospitality days for all the GM family members, eventually moving into public relations at an ad agency.[10] She went back to GM, becoming the owner of four shops that managed publicity events for magazine journalists. From the age of 14 to 18, Shepard worked for his mother on the road, going from racetrack to racetrack.[4] For about two years, Shepard had a stepfather who was an engineer on the Corvette.[4][10] Shepard's mother has been married four times; Shepard said he's had three stepfathers.[12]\n\nAccording to Shepard, his mother named him for the rich playboy Dax (Diogenes Alejandro Xenos), in Harold Robbins' novel The Adventurers.[13] He has an older brother, David Shepard, who lives in Oregon,[8] and a younger half-sister, Carly Hatter,[4] whom he cast in two films: 2012's Hit and Run[14][15] and 2017's CHiPs.\n\nShepard has said that he was raised in Milford,[4] although he lived in a lot of places in suburban Detroit, growing up primarily in Walled Lake, Michigan. He graduated from Walled Lake Central High School in 1993[16] before enrolling in The Groundlings school.[17] After attending Santa Monica College and West Los Angeles College, Shepard transferred to UCLA, where he graduated magna cum laude with a B.A. in Anthropology.[18] He had a deal with his mother that if he went to college she would pay his rent.[4]\n\nShepard has said he wasn't interested in child-acting per se. He was a class clown in school, had a sense he was funny, and wanted to do stand-up. He has also said that he was more excited about being on talk shows than he was actually acting. Although he had friends who did stand-up in Detroit, he was too scared. Shepard thought if he moved to California \"that commitment would force him to do it.\"[4]\n\nCareer [ edit ]\n\nAfter a year in Santa Barbara, California, Shepard moved to Los Angeles in 1996. He found out about The Groundlings improv troupe from a friend from Santa Barbara, Kareem Elseify, ended up auditioning (the first time he acted), and took classes while also attending UCLA. After about five years of classes, he got into the Sunday Company of The Groundlings—in a group that included Melissa McCarthy, Fortune Feimster, Tate Taylor and Nat Faxon.[4]\n\nFrom 2003 onwards, Shepard became known from his work in the improv Candid Camera-type show, Punk'd, with Ashton Kutcher. When the show had its 2012 revival, he continued to appear. Shepard said he auditioned for Punk'd and while doing the pilot became friendly with Kutcher, who arranged for him to get an agent.[4] He had auditioned unsuccessfully for 10 years before landing the role in Punk'd, his first.[4]\n\nIn 2004, Shepard starred in the comedy Without a Paddle, alongside Seth Green and Matthew Lillard. Although the film received negative reviews, it was a commercial success that as of 2009 had grossed more than US$65 million worldwide.[19] In 2005 he starred as The Astronaut in Zathura: A Space Adventure, a science fiction adventure fantasy film. In 2006, he appeared with Dane Cook and Jessica Simpson in the comedy Employee of the Month and in Mike Judge's film Idiocracy as the character Frito.\n\nDuring the same time, Shepard began appearing in more films and landed his first main character role in Let's Go to Prison (2006), alongside Will Arnett and Chi McBride. He also had a main role in the 2008 comedy Baby Mama, starring opposite Tina Fey and Amy Poehler. Shepard wrote the script for the Paramount venture Get 'Em Wet, in which he again appeared with Arnett. In 2010, he wrote, directed and starred in the low-budget satirical mockumentary feature Brother's Justice; the film won an Audience Award at the 2010 Austin Film Festival. He also had a supporting role in the 2010 romantic comedy film When in Rome, which also starred his future wife Kristen Bell.\n\nFrom 2010 to 2015, Shepard was part of the main cast of the NBC drama Parenthood, playing Crosby Braverman.[20][21][22]\n\nShepard wrote, produced, co-directed, and starred in the 2012 low-budget film Hit and Run alongside Bell and his close friend Bradley Cooper.[23][24] He said the movie, which includes numerous car chases and fast driving scenes, allowed him to live out his Smokey and the Bandit fantasy.[4]\n\nShepard had a supporting role in the 2014 film The Judge, which starred Robert Downey Jr., Robert Duvall and Vera Farmiga.[25]\n\nIn September 2014, Dax starred with his wife, Kristen Bell, in a commercial for the Samsung Galaxy Tab S.[26] It was so popular (with over 20 million YouTube views) that they did another commercial for the holiday season.[27] The ad agency McKinney was behind both.[28]\n\nShepard wrote and directed a feature-length film called CHiPs, based on the 1977 to 1983 American crime drama of the same name, where he starred as Officer Jon Baker alongside Michael Peña as Frank \"Ponch\" Poncherello.[25] The project was released by Warner Bros.[29][30][31] on March 24, 2017 to negative reviews.\n\nOn February 14, 2018 Shepard launched the podcast Armchair Expert with cohost Monica Padman. The show explores the stories of their well-known guests. Featured guests on the show have included Kristen Bell, Ashton Kutcher, Will Ferrell, and Julia Louis-Dreyfus . On June 7, 2018 the show released their first episode of \"Experts on Expert\", in which Shepard and Padman interview experts in their fields. Featured experts on the show have included psychologist Wendy Mogel, comedian and author David Sedaris, and speechwriter Jon Favreau. The show was the most popular new podcast on iTunes in 2018.[32] On December 3, 2019, it was revealed the Shepard will be a host of the revived Top Gear America, which will debut on Motor Trend in Spring 2020.[33]\n\nPersonal life [ edit ]\n\nRelationships [ edit ]\n\nShepard met actress Kristen Bell, also a native of Detroit's northern suburbs, at the birthday party of a mutual friend; they began dating in late 2007. The couple announced their engagement in January 2010; however, they decided to delay marriage until the state of California passed legislation legalizing same-sex marriage.[34][35] After section 3 of the Defense of Marriage Act was ruled unconstitutional by the Supreme Court on June 26, 2013, Bell asked Shepard through Twitter to marry her,[36] which he accepted.[37] They were married at the Beverly Hills County Clerk's Office on October 17, 2013.[38] They have two daughters, Lincoln and Delta, born in March 2013[39] and December 2014.[40]\n\nSobriety [ edit ]\n\nShepard has said that, except for a year in high school when he used drugs (in 1992, leading to the police and his mother getting involved), he did not have a substance abuse problem until he was 18 years old.[4] After many struggles, Shepard got sober in September 2004.[4]\n\nInterests and charity work [ edit ]\n\nShepard races motorcycles at Buttonwillow Raceway, including his Ducati Hypermotard 1100S and Suzuki GSX-R1000.[41] He donates much of his time to the Hollenbeck Youth Center, an after-school program that provides opportunity to at-risk inner-city youth. He has served as their official Master of Ceremonies, along with his friend Tom Arnold, for the Inner-City Games and Hollenbeck Youth Center's Miracle on 1st Street Toy Giveaway Program in East Los Angeles.[42]\n\nHe is an avid car enthusiast[44] and can rebuild an engine. He has a 1967 Lincoln Continental (which was featured in the movie Hit and Run) and races off-road.[4]\n\nShepard and his wife are advocates of California Senate Bill 606, called \"no-kids paparazzi\".[45] Bell said: \"We're not saying that we can't be newsworthy. We're saying that our child is not newsworthy.\"[46] California Senate Bill 606[47] passed in 2013, with testimony by actresses Halle Berry and Jennifer Garner.[45]\n\nShepard practices the Transcendental Meditation program.[48]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]\n\nYear Award Category Work Result 2003 Teen Choice Award Choice TV Reality/Variety Star – Male Punk'd Nominated 2015 People's Choice Award Favorite Dramatic TV Actor Parenthood", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Dax_Shepard_at_the_2008_Tribeca_Film_Festival.JPG/150px-Dax_Shepard_at_the_2008_Tribeca_Film_Festival.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Dax_Shepard_Paleyfest_2013.jpg/220px-Dax_Shepard_Paleyfest_2013.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/9/9a/Dax_Shepard_Paleyfest_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Kristen_Bell_Dax_Shepard.jpg/220px-Kristen_Bell_Dax_Shepard.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Dax_Shepard_Paleyfest_2013.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dax_Shepard", "title": "Dax Shepard", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Dax_Shepard_Paleyfest_2013.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}