{"url": "heatworld.com/celebrity/news/miley-cyrus-liam-hemsworth-wedding-pregnant/", "text": "Fans can't believe the size of Gaz Beadle's garden and same\n\nAmy Schumer legally changes son's name because it sounds like 'genital'\n\nby Lucy Vine |\n\nIf you thought postponing a wedding and cancelling a honeymoon all in the space of a week might be a bad sign for a relationship - think again.\n\nThings are better than ever between Miley Cyrus and Liam Hemsworth. In fact, heat can reveal that the delay to their summer wedding plans is actually because they want to start a family...\n\n\"For the last couple of months Miley and Liam have been talking about 'when' not 'if' they have a baby,\" says an insider close to the A-list pair, who first dated from 2010-2013, before reuniting nine months ago at New Year, and getting re-engaged.\n\n\"They're not admitting anything officially, but all their friends reckon they're already trying and could even be pregnant already – a Christmas baby would be perfect.\"\n\n©Getty\n\nThe internet was alight with rumours last week, after pics emerged of actor Liam, 26, out for lunch with Miley, 23, who was wearing a very baggy shirt over what Twitter users pointed out could be a 'baby bump'.\n\nAnd insiders say the singer – who’s always been open about her love of marijuana and partying – has been cleaning up her act in recent months.\n\n\"She's eating really healthily, hasn't touched alcohol in forever, and even stopped dyeing her hair!\" says the friend.\n\n\"She's still been going to parties, but not nearly as many as she used to, and it's always with Liam glued to her side.\n\n\"Most of the time she's either working on The US Voice [where she’s a judge] or cuddling up with Liam and their dogs at home in Malibu.\n\n\"Everyone has noticed the change in her and her friends are gossiping about the possibility of them having a baby. It seems like the only reason they would've put off their plans.\"\n\nLast week, it was revealed that Miley and Liam – who said in June that they would like \"to have kids and raise a family out of the limelight\" – had cancelled flights and hotels for a honeymoon in the South Pacific Island of Bora Bora this summer, as well as postponing plans for a wedding in Australia.\n\n\"Word is they're now planning to have their big day in California, so Miley doesn't have to fly too far,\" says the source.\n\n\"They're also in the middle of renovating their house and building a nursery – so it's not like they’re being subtle! Liam is very eager to become a dad.\n\n\"He's spent so much time with his nieces and nephews and is desperate to have one of his own. They both want lots of kids, and it would be Miley's dream to be a pregnant bride.\"\n\nGet more Miley and Liam goss:", "images": ["http://heatworld.com/static/assets/play-button.svg", "http://heatworld.com/static/assets/twitter.svg", "http://heatworld.com/static/assets/pinterest.svg", "http://heatworld.com/static/assets/facebook.svg", "https://cdn.onebauer.media/one/lifestyle-images/celebrity/57c57270e7aa068659761466/miley and liam - grazia.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill"], "top_img": "https://cdn.onebauer.media/one/lifestyle-images/celebrity/57c57270e7aa068659761466/miley and liam - grazia.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "keywords": [], "authors": ["Lucy Vine"], "canonical_link": "https://heatworld.com/celebrity/news/miley-cyrus-liam-hemsworth-wedding-pregnant/", "title": "Miley Cyrus: from bride-to-be to baby on board", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "og": {"site_name": "Heat", "type": "website", "url": "https://heatworld.com/celebrity/news/miley-cyrus-liam-hemsworth-wedding-pregnant/", "description": "Miley Cyrus and Liam Hemsworth have delayed their summer wedding plans because they want to start a family... Read more on heat.", "title": "Miley Cyrus: from bride-to-be to baby on board", "locale": "en_GB", "image": {"identifier": "https://cdn.onebauer.media/one/lifestyle-images/celebrity/57c57270e7aa068659761466/miley and liam - grazia.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "width": 960, "height": 540, "type": "image/jpeg"}}, "twitter": {"title": "Miley Cyrus: from bride-to-be to baby on board", "description": "Miley Cyrus and Liam Hemsworth have delayed their summer wedding plans because they want to start a family... Read more on heat.", "card": "summary_large_image", "site": "@heatworld", "creator": "@heatworld", "image": {"identifier": "https://cdn.onebauer.media/one/lifestyle-images/celebrity/57c57270e7aa068659761466/miley and liam - grazia.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "alt": "miley cyrus liam hemsworth t shirt"}}, "description": "Miley Cyrus and Liam Hemsworth have delayed their summer wedding plans because they want to start a family... Read more on heat.", "next-head-count": 38}, "movies": [], "publish_date": null, "source": "http://heatworld.com", "summary": ""}