{"url": "https://en.wikipedia.org/wiki/Grey%27s_Anatomy_(season_15)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date U.S. viewers\n\n(millions)\n\n318 1 \"With a Wonder and a Wild Desire\" Debbie Allen Krista Vernoff September 27, 2018 ( ) 6.81[21]\n\nAs the doctors return to work from the post-wedding celebration, Meredith struggles to focus on work facing distractions by her sex dreams, Andrew, and her professional matchmaker patient. After learning of Owen and Amelia’s current living situation, Teddy decides she doesn’t really want to be interim chief, forcing Bailey to consider other candidates. On her way out, Teddy realizes she needs to see Maggie due to a suspected blood clot in her femoral vein, fearing a potential pulmonary embolism. In discussing her situation, Teddy tells her she’s pregnant with Owen’s baby. New orthopedic hires, Drs Atticus “Link” Lincoln and Nico Kim, are introduced when a bicyclist gets run over and winds up tangled in her bike. Jo’s obsession with work all but derails her honeymoon plans with Alex; however, her new idea could change the future of medicine. While Jackson admits to struggling with the idea of believing in God after surviving a near-death experience, Amelia admits to Owen that she still has feelings for him.\n\n319 2 \"Broken Together\" Kevin McKidd Meg Marinis September 27, 2018 ( ) 6.81[21]\n\nWhile Owen and Amelia struggle to reignite their sex life now that they have foster kids in the house, Maggie begins to distance herself from Jackson after he talks of marriage. As the new guy, Link makes his rounds introducing himself to colleagues, flirtatiously starting with Meredith who shuts him down. Bailey rules out Richard for interim chief, fearing that he’ll be a better chief than she or worse, that the job will be too stressful and lead him to drinking again. Finally, she decides to promote Alex to the new position. Upon Alex and Jo’s return from their honeymoon, Jo presents her new idea to Meredith asking her to create a fellowship for her. Excited by the possibilities, Meredith takes the idea to Bailey who initially denies the request; however, once Jo talks to her she agrees to the proposal. When Jackson’s patient is diagnosed with necrotizing fasciitis, he decides that the best place for her to survive is in Grey Sloan’s newest addition, the hyperbaric chamber. The tight space and condensed air takes its physical and emotional toll on the medical team when they lose. To end the day, the interns go have drinks at Joe’s, where Nico makes a move on Levi. Meredith finally confesses to her matchmaker that she doesn’t want to be married to her work any longer, and Jackson and Maggie profess their love for each other.\n\nNow that Maggie knows Teddy’s secret, she desperately tries to set up Amelia with anyone other than Owen. In addition, she also struggles to understand why Jackson has taken a leave of absence. Alex gets a rude awakening as he goes about his first day as interim chief, which includes messing up the OR schedule, approving too many requisition requests, and holding Vikram responsible for his ineptitude-which ends up with him being fired for a second time. Bailey finds herself unable to relax due to Alex’s first day troubles, and since Bailey is distracted, Jo feels like she isn’t holding up her end of the fellowship. As Meredith starts to become annoyed with the incessant questioning from her matchmaker patient, Richard mistakes his patient for a drunk, until he realizes that the patient actually has auto-brewery syndrome; however, before he’s able to make the diagnosis, he crosses Link and Alex until he’s put in his place.\n\n321 4 \"Momma Knows Best\" Cecilie Mosli William Harper October 11, 2018 ( ) 6.72[23]\n\nMeredith turns heads when she shows up to work done up and ready for her blind date. Alex feels used when Jo asks for a new MRI machine in bed and later they apologize to each other. Also Alex makes a questionable move to treat a patient with a preexisting condition and Qadri reports it to Webber. Amelia struggles to decide what to do with Betty when she comes home high, and takes the advice of Owen's mom. Maggie can't sleep knowing Teddy's secret and decides to tell someone. Dean asks Maggie out but doesn't get an answer. Andrew loses a kid in the hospital and Carina has to go visit their father. This episode begins a crossover with Station 19 that concludes on \"Under the Surface\".\n\n322 5 \"Everyday Angel\" Chandra Wilson Julie Wong October 25, 2018 ( ) 6.54[24]\n\nAt the hospital, while Bailey and Jo work together to help solve a mysterious case of stomach pain; Alex learns to work with Link and not let his past with Jo upset him. Jackson returns much to Maggie's surprise, but initially she's less than happy with him until the matchmaker helps her realize the true problem. Levi believes he's mistakenly taken Nico's interactions as come-ons, and Richard teaches Andrew a lesson about being a leader. Outside the hospital, Owen and Amelia spend all day outside Betty's school in attempt to keep her from skipping. Meredith talks Teddy through her animosity towards Owen by helping her understand that Owen is a good guy and deserves to know he's the father of her child.\n\n323 6 \"Flowers Grow Out of My Grave\" Nicole Rubio Kiley Donovan November 1, 2018 ( ) 6.71[25]\n\nMeredith treats a patient whose family celebrates Day of the Dead, making her think about the loved ones she has lost herself. Richard delivers the news that her father Thatcher is dying of acute myeloid leukemia. As they haven't talked since Lexie's death, Meredith is unsure whether to reach out to him or not. After working a case together, Nico and Levi share their first kiss but Nico turns him down after learning that he does not have any experience with men. Jackson tries to make up with Maggie while Jo encourages Link to pursue Meredith, who continues going on blind dates. While Link's treating a kid with cancer shows Meredith that he has more depth than she thought, Andrew is also showing interest in her. Meanwhile, Teddy tries to tell Owen about her pregnancy but they get sidetracked when Betty disappears. In search for a liver for their patient who has prepared herself to die, Bailey and Jo bring a liver back from the dead.\n\n324 7 \"Anybody Have a Map?\" Krista Vernoff Elisabeth R. Finch November 8, 2018 ( ) 6.60[26]\n\nWhile preparing for the opening of the first Catherine Fox medical center in Los Angeles, Catherine summons Tom Koracick and Meredith for a personal consult. She reveals she has been experiencing back pain and had scans taken. They perform a biopsy and learn she has grade 3 chondrosarcoma in her spine, which is unresponsive to chemo and difficult to treat given its location. Catherine fears her diagnosis will completely derail an already unsteady Richard, but Meredith convinces her not to hide her diagnosis. Richard springs into action when pregnant nurse Frankie collapses due to a wandering spleen. They rush her to the O.R. when her splenic artery ruptures. With Alex's help, he manages to save Frankie's baby but she passes away on the table. The loss and the nurses mourning drives him to a meeting, where he hears about a bartender offering recovering alcoholics free shots in exchange for sobriety chips. He visits the bar and demolishes it, which causes him to be arrested. Meanwhile, Jackson and Maggie have an honest conversation about their relationship when Maggie finds out he has been talking to other women about faith.\n\n325 8 \"Blowin' in the Wind\" Kevin McKidd Meg Marinis November 15, 2018 ( ) 7.30[27]\n\nA major wind storm hits Seattle, causing Alex and Jo to be stuck at home, which puts Bailey back in charge at the hospital. Richard tells Bailey about what happened at the bar and his arrest, so she suspends him for the day. The hospital is slammed with injured patients from the storm. After Amelia's patient dies, her organs are directed to Cece since she's a match. Teddy, after her successful surgery with Owen, tells him about the pregnancy. Richard tells Bailey to get some help to deal with her stress issues, while Maggie tells Jackson about his mom's cancer. Andrew tells Meredith that he has feelings for her, but she says she wants to wait until she can think on it clearly. Betty returns to the hospital after being missing for three days, prompting a grateful Amelia to want to apply to be her official foster mom. The storm knocks down a power pole, knocking the power out, and trapping Amelia, Teddy, and Owen, Meredith and Andrew, and Bailey, Helm, and the dead patient in separate elevators together before the transplant surgery. Nico and Levi are stuck inside an ambulance outside of the hospital and after a fight they kiss.\n\n326 9 \"Shelter from the Storm\" Jann Turner William Harper January 17, 2019 ( ) 7.07[28]\n\nFollowing the power outage, three elevators remain stuck. Meredith and Andrew grow closer after he tells her more about his family's difficult past. As Andrew tries to convince Meredith to be with him, their connection deepens when they discover they both speak Italian. Owen, Teddy, and Amelia must perform emergency surgery on their patient in the elevator using army-field techniques as they argue about Teddy's pregnancy. Jackson and Link work to get Bailey and Helm out of their elevator in order for Cece's surgery to start, but a maintenance man gets hurt in the process. Once the power is fixed, Cece has her transplant but does not make it. Jackson and Webber learn from Maggie about Catherine's cancer, just as Webber tries to help a desperate Betty get through recovery. Amelia gives Owen space to make a decision between her and Teddy. Meredith realizes she is in another love triangle with her two suitors, Andrew and Link.\n\n327 10 \"Help, I'm Alive\" Daniel Willis Jalysa Conway & Jason Ganzel January 24, 2019 ( ) 6.98[29]\n\nMeredith and Link butt heads over a surgery as she cannot understand his carefree attitude. Teddy tries to get a job at Grey-Sloan, angering Owen, who is still mad about being kept in the dark about the baby for so long. While in surgery, Owen accidentally gets injected through his I.V., risking permanent paralysis. After he collapses, Andrew is forced to take over the surgery while Levi must save Owen. Meanwhile, as Webber, Jackson, and Catherine prepare for a groundbreaking surgery on a woman's uterus, Maggie worries they are not accepting Catherine's diagnosis. After recovering, Owen offers Teddy his job as Head of Trauma but picks Amelia to be with. Levi, having saved Owen, uses his newfound confidence to rebrand his image. Link helps Meredith with Bailey's 5th birthday party, and she learns more about his past, putting him in a new light.\n\n328 11 \"The Winner Takes It All\" Allison Liddi-Brown Elisabeth R. Finch January 31, 2019 ( ) 7.27[30]\n\nAmelia and Koracick get ready to perform Catherine's risky cancer surgery. Maggie and Bailey comfort Jackson and Webber during their time of need. While operating, Koracick realizes they cannot take out the tumor all at once, prompting Webber to offer them his patented cancer-detector pen. After surgery, Catherine survives but learns that only 95% of the cancer was removed. Meanwhile, Meredith goes to visit a dying Thatcher, whom she hasn't seen since Lexie died. After getting off to a rocky start, Meredith pushes past her anger to reconnect with her father and say goodbye to him before he dies. She shares presents he brought back from overseas with her children.\n\n329 12 \"Girlfriend in a Coma\" Debbie Allen Kiley Donovan February 7, 2019 ( ) 6.79[31]\n\nMeredith gets some perspective on her love life from Natasha, a patient who has been bound to the ICU while stuck in a coma. Weeks go by before she finally wakes up and appears to be recovering, much to the delight of her fiancé, Garrett. Andrew grows impatient with Meredith's indecisiveness about him and Link. Bailey tells Ben she wants him to come home, but he is afraid she will change her mind again. While getting help from Richard, Catherine is frustrated with her postoperative exercises, worrying Jackson, who is comforted by Maggie. During a visit to Betty at her rehab facility, Owen and Amelia learn that Betty has been lying about her identity and that her real name is actually Britney, which she hid from them to avoid being found by her parents. Koracick and Teddy share their first kiss at Alex and Jo's New Year's Eve party and begin casually dating. Levi comes out as gay just as his relationship with Nico deepens. Natasha's health suddenly deteriorates, and she and Garrett decide to turn off her ventilator. Before she passes away, the hospital staff holds a wedding ceremony under the stars for them. Touched by their relationship, Andrew takes Meredith up to the roof, despite her standing date with Link, and the two share their first kiss.\n\n330 13 \"I Walk the Line\" Kevin McKidd Tameson Duffy February 14, 2019 ( ) 6.58[32]\n\nThe hospital is flooded with patients after a gun goes off during a parade and a teenager is caught in the cross-fire. Owen worries he will lose Leo when Betty's parents show up at the hospital, unaware of their daughter's situation. Though Amelia tries to help, Betty's parents make it clear that they believe Leo would be better off living with them. Maggie is faced with the difficult choice of whether to operate on a woman who used to bully her in medical school, just as Meredith tries to talk to Maggie about dating Andrew. Teddy and Koracick operate on a woman who has an odd relationship with her best friend and her husband, prompting Teddy to confirm with Koracick that he is the one she wants to be with, not Owen. Bailey has trouble with how well Alex is doing in his position as interim chief and realizes she wants the job back, which earns her condemnation from Richard. After getting Maggie's approval, Meredith finally allows Andrew to take her out on an official date.\n\n331 14 \"I Want a New Drug\" Jeannot Szwarc Zoanne Clack February 21, 2019 ( ) 6.89[33]\n\nA massive overdose in the community sends the doctors scrambling to help everyone admitted to the hospital. Owen is forced to say goodbye to Leo, who is going to live with Betty's parents, when he sees that Betty and her boyfriend are among the overdose patients. Betty suffers from an aortic dissection and is rushed off to a surgery led by Teddy, while a distraught Amelia is comforted by Link. Meredith breaks the hospital record for the longest single surgery while being cheered on by Andrew. Jackson is excited to go camping with Maggie, who is less than thrilled about having to spend the weekend outdoors but is later let off the hook when Jackson gives his camping gear to a homeless man in need of shelter to recover from a foot injury. Alex and Jo treat a woman who has lost her son in the park while buying drugs; after handing the son over to the woman's husband, Jo learns more about Alex's difficult childhood. Nico and Levi work together on various surgical procedures as their relationship continues to progress. Betty survives the surgery, reuniting her with her parents and bringing a thankful Amelia closer to Teddy.\n\n332 15 \"We Didn't Start the Fire\" Chandra Wilson Andy Reaser February 28, 2019 ( ) 6.99[34]\n\nIn this record-breaking episode, the doctors of Grey Sloan throw a party at Jackson's house to celebrate Amelia and Koracick's successful surgery on Catherine. Alex and Jo worry something might be wrong when Alex's mom, Helen, visits unexpectedly. Amelia and Owen say a final goodbye to Betty and Leo, putting them in a bad mood for the party. Meredith tells Alex that she is dating Andrew and is later caught making out with Andrew in Jackson's guest room by Richard. Maggie is annoyed by an article about her surgery on Kimberly Thompson, while Jackson grows impatient when Catherine, who goes out drinking with Bailey, fails to show up to the party. Owen spends the evening sulking about Teddy and Koracick's relationship, causing Amelia to break up with him, as she is tired of the constant back-and-forth. Right after Koracick punches Owen for an insensitive comment, everyone is rushed out of the house when the fire alarm goes off. After the party, Betty's parents return Leo to Owen and Amelia, as they believe they are better fit to raise him and Carina interrupts Andrew and Meredith at his apartment with the arrival of Andrew and Carina's estranged father.\n\n333 16 \"Blood and Water\" Pete Chatmon Kiley Donovan March 7, 2019 ( ) 6.55[35]\n\nAfter being visited by her mother, Ellis, in a dream, Meredith spends the day in the lab figuring out what her mother was trying to say to her. During a podcast interview, Maggie lets it slip that she is the product of Richard and Ellis' affair, which angers Richard. Jo stresses out about the prospects of her and Alex having a baby soon after Helen knits them clothes for their future children. Link and Jackson team up on a young athlete's surgery to remove his cancer without losing the ability to play baseball. Andrew and Carina argue about the mental state of their father, Vincenzo, who is in the hospital with a medical pitch, while Meredith struggles over whether to tell Alex about Vincenzo's manic episodes or respect what Andrew told her in confidence. Amelia and Owen are at odds over Leo's custody until Amelia officially ends things by giving Owen sole custody. Levi and Nico fight about Levi keeping their relationship a secret from his parents but later Levi finally tells Nico the reason as to why he did and that he loves him.\n\n334 17 \"And Dream of Sheep\" Sydney Freeland William Harper March 14, 2019 ( ) 6.57[36]\n\nAndrew and Carina find themselves sparring over their father's research project, while Vincenzo causes problems around the hospital as his mental illness grows more apparent. Jackson revolutionizes treatment for burn victims by swapping out human flesh for fish skin. Bailey tells Alex to have a conversation with Helen after she discovers that Helen has stayed in Seattle for so long because she is afraid of making the trip back home. Link and Amelia grow closer at a medical conference and, after arguing about prescription opioids, they hook up in her hotel room. Teddy and Owen bond over her pregnancy as they treat a pregnant woman who was in a car crash. After getting positive results from her DNA test, Jo decides she wants to find her birth mother. Meredith tries to be supportive of Andrew despite her reservations about his father and Maggie is stressed over talking about her personal life on live television.\n\n335 18 \"Add It Up\" Michael Watkins Alex Manugian March 21, 2019 ( ) 7.00[37]\n\nMaggie tests out mood rooms around the hospital as an alternative to medicine. Andrew continues to let the aftermath of his father's breakdown affect his work and relationship with Meredith while he tries to accept what has happened. Amelia and Link work on a patient who is in risk of paralysis while they hide their affections for one another after their one night stand at the conference. When Teddy starts having contractions, Owen rushes to her aide, which angers Koracick, who feels Owen is purposefully keeping him out of the loop. Alex treats a young girl whose math skills give the doctors a run for their money, while Jackson and Richard perform surgery on a non-binary patient.\n\n336 19 \"Silent All These Years\" Debbie Allen Elisabeth R. Finch March 28, 2019 ( ) 7.37[38]\n\nWhen a woman is admitted to the hospital for a sexual assault incident, Jo and Teddy work together to get her through a difficult procedure. At the same time, Jo avoids giving Alex details about her recent visit to her birth mother, who shared shocking details about Jo's past. Meanwhile, Bailey and Ben discuss dating with Tuck after learning that he has a girlfriend.\n\n337 20 \"The Whole Package\" Geary McLeod Meg Marinis April 4, 2019 ( ) 6.85[39]\n\nOwen and Teddy are forced to deal with the surprise arrival of Owen's sister, Megan, who is unaware of Teddy's pregnancy and has a lot to say after she finds out. Catherine gets ready to perform her first surgery back on a veteran until she discovers he lied about his personal life to have the transplant. Meredith vents her concerns to Jackson about Andrew operating alone with Richard, who had walked in on them at Catherine's party weeks ago. Alex and Maggie treat a young autistic boy who can't have the necessary surgery because his blood type is too rare. Link tries to cheer Jo up following her visit to her birth mother but realizes Jo is worse off than he and Alex thought. After returning to her position as Chief, Bailey gives a tour of the hospital to STEM students participating in a leadership program.\n\n338 21 \"Good Shepherd\" Bill D'Elia Julie Wong April 11, 2019 ( ) 6.81[40]\n\nAmelia and Link travel to New York to operate on a patient with a severe spinal deformity, but they're in for more than they bargained for when Amelia's sister, Nancy, invites them to dinner at her home. Amelia begs Link to pretend to be Owen, as she never told her family that they got divorced. With Amelia's other sister, Kathleen, also present, dinner becomes a night of recalling Amelia's mistakes as the \"black sheep.\" Things only worsen when their mother, Carolyn, joins them for dessert and is quick to point out Link and Amelia's lie, as Carolyn has already met Owen. When the conversation gets heated over Amelia's brain tumor and sobriety, Link defends Amelia before they leave for the hospital. Following her patient's successful surgery, Amelia has a long overdue heart-to-heart with Carolyn, who apologizes for not being there for her all these years. After making up with Link, Amelia returns back home and tells Meredith and Maggie about the trip.\n\n339 22 \"Head Over High Heels\" Allison Liddi-Brown Bridgette N. Burgess April 18, 2019 ( ) 6.24[41]\n\nAfter Zola catches Andrew trying to sneak out of the house in the middle of the night, Meredith has to figure out how to tell her kids about their relationship while she and Andrew treat a woman who has two uteri but is only pregnant in one. Jo returns to work but spends the day working in the lab partially drunk, worrying Alex even more. Richard is reunited with an old friend who has broken her 17-year sobriety and is admitted to the hospital with a shoe in her chest. At the urging of Megan, Owen tries out therapy and makes a breakthrough in his deep-rooted feelings about his past. While fielding job offers from hospitals across the country, Nico is at odds about his relationship with Levi until he makes a mistake that kills a young patient. Koracick and Amelia talk about her new romance with Link as the three of them try to reverse a woman's paralysis through a clinical trial. Jackson asks Maggie to move in with him, while Bailey deals with a falling out between her son and ex-husband.\n\n340 23 \"What I Did for Love\" Jesse Williams Mark Driscoll May 2, 2019 ( ) 6.96[42]\n\nMaggie treats Lucas Ripley, the chief of Seattle's firefighters, after he collapses outside a flower shop, exposing his relationship with Vic to the rest of the firefighters. Meredith puts her career in jeopardy when she commits insurance fraud for a father and daughter seeking asylum. Jo continues to let her personal life affect her job after she accidentally gives Gus and his family false hope. Owen learns about Amelia and Link's relationship and reveals to his therapist that he finally knows what he wants. Levi attempts to cheer up Nico, who is still distant following the death of his patient. After a day of sending her mixed signals, Andrew tells Meredith he loves her, leaving her speechless. Maggie accepts Jackson's invitation to move in together, and Koracick finds Teddy her dream home in Seattle. This episode begins a crossover with Station 19 that concludes on \"Always Ready\".\n\n341 24 \"Drawn to the Blood\" Kevin McKidd Andy Reaser May 9, 2019 ( ) 6.37[43]\n\nAlex desperately tries to save Gus, who has a heart attack while waiting for his blood donor to arrive from London. Owen and Levi meet with the donor and must convince her to complete her trip to Seattle. Bailey and Catherine spend the day meeting with hospital board members about a situation that the rest of the staff speculates about. As per Alex's request, Meredith tries to get Jo to open up about her birth mother while avoiding the aftermath of Andrew's declaration of love. Jackson convinces Maggie to go camping, but things go awry when Maggie cannot adjust to the rural outdoors. As Teddy nears her due date, she has a startling realization about whom she wants to be with. After Amelia rushes Link out of bed in secret, he questions if their relationship is real to her. When Andrew learns that Bailey and Catherine have been discussing Meredith's insurance fraud, he decides to take the fall for her just as she and Alex prepare for Gus's operation in the surgery chamber. Just as a fog begins to cover Seattle, Teddy goes into labor; Owen, Levi, and the donor get into a car accident; and Jackson and Maggie get stuck in the woods.\n\n342 25 \"Jump into the Fog\" Debbie Allen Krista Vernoff May 16, 2019 ( ) 5.99[44]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ea/Grey%27s_Anatomy_season_15_poster.jpg/220px-Grey%27s_Anatomy_season_15_poster.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/e/ea/Grey%27s_Anatomy_season_15_poster.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ea/Grey%27s_Anatomy_season_15_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Grey%27s_Anatomy_(season_15)", "title": "Grey's Anatomy (season 15)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ea/Grey%27s_Anatomy_season_15_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}