{"url": "https://en.wikipedia.org/wiki/Death_of_Diana,_Princess_of_Wales", "text": "Road accident causing the death of the British princess\n\n\"Death of Diana\" redirects here. For the death of Diana Miller, see Murder of Diana Miller\n\nIn the early hours of 31 August 1997, Diana, Princess of Wales died in hospital after being injured in a car crash in a road tunnel in Paris, France. Her partner, Dodi Fayed, and their driver, Henri Paul, were pronounced dead at the scene. Their bodyguard, Trevor Rees-Jones, survived with serious injuries.\n\nMedia blamed the erratic behaviour of paparazzi following the car, as reported by the BBC contributed to the crash.[1] In 1999, a French investigation found that Paul, who lost control of the vehicle at high speed while intoxicated and under the effects of prescription drugs, was solely responsible for the crash. He was the deputy head of security at the Hôtel Ritz and had earlier goaded paparazzi waiting for Diana and Fayed outside the hotel.[2] Anti-depressants and traces of an anti-psychotic in his blood may have worsened Paul's inebriation.[3][4] No evidence was found that paparazzi were near the car when it crashed.[5] In 2008, the jury at a British inquest returned a verdict of unlawful killing through grossly negligent driving by Paul and following vehicles. It was also found that none of the occupants of the car were wearing a seat belt.[6]\n\nDiana was 36 years old when she died.[7] Her death caused an outpouring of grief in the United Kingdom and worldwide, and her funeral was watched by an estimated 2.5 billion people. The Royal Family were criticised in the press for their reaction to Diana's death. Public interest in Diana has remained high and she has retained regular press coverage in the years after her death.\n\nCircumstances [ edit ]\n\nEvents preceding the crash [ edit ]\n\nA Mercedes-Benz W140, similar to the one involved in the accident.\n\nOn Saturday, 30 August 1997, Diana left Sardinia on a private jet and arrived in Paris with Dodi Fayed, the son of Mohamed Al-Fayed.[8] They had stopped there en route to London, having spent the preceding nine days together on board Mohamed Al-Fayed's yacht Jonikal on the French and Italian Riviera. They had intended to stay there for the night. Mohamed Al-Fayed was and is the owner of the Hôtel Ritz Paris. He also owned an apartment on Rue Arsène Houssaye, a short distance from the hotel, just off the Avenue des Champs Elysées.\n\nHenri Paul, the deputy head of security at the Ritz Hotel, had been instructed to drive the hired black 1994 Mercedes-Benz W140 in order to elude the paparazzi;[11] a decoy vehicle left the Ritz first from the main entrance on Place Vendôme, attracting a throng of photographers. Diana and Fayed then departed from the hotel's rear entrance,[12] Rue Cambon at around 00:20 on 31 August CEST (22:20 on 30 August UTC), heading for the apartment in Rue Arsène Houssaye. They did this to avoid the nearly 30 photographers waiting in front of the hotel.[12] They were the rear passengers; Trevor Rees-Jones, a member of the Fayed family's personal protection team, was in the (right) front passenger seat. It was believed that Diana and Dodi were not wearing seat belts.[14] After leaving the Rue Cambon and crossing the Place de la Concorde, they drove along Cours la Reine and Cours Albert 1er – the embankment road along the right bank of the River Seine – into the Place de l'Alma underpass.[15]\n\nThe crash [ edit ]\n\nAt 00:23, Paul lost control of the vehicle at the entrance to the Pont de l'Alma tunnel. The car struck the right-hand wall and then swerved to the left of the two-lane carriageway before it collided head-on with the 13th pillar that supported the roof.[16] The car was travelling at an estimated speed of 105 km/h (65 mph).[17] This was just over twice the speed limit in the tunnel which was 50km/h (31mph). It then spun and hit the stone wall of the tunnel backwards, finally coming to a stop. The impact caused substantial damage, particularly to the front half of the vehicle, as there was no guard rail between the pillars to prevent this. Witnesses arriving shortly after the accident reported smoke.[19] Witnesses also reported that photographers on motorcycles \"swarmed the Mercedes sedan before it entered the tunnel.\"[14]\n\nThe aftermath [ edit ]\n\nThe entrance to the Pont de l'Alma Tunnel, the site where Diana was fatally injured\n\nWith the four occupants still in the now wrecked car, the photographers, who had been driving slower and were some distance behind the Mercedes, reached the scene. The photographers were on motorcycles.[12] Some rushed to help, tried to open the doors and help the victims, while some of them took pictures. Airbags were deployed.[21] Police arrived on scene around 10 minutes after the crash at 00:30 and an ambulance was on site five minutes after the police, according to witnesses.[21] France Info radio reported that one photographer was beaten by witnesses who were horrified by the scene.[14] Five of the photographers were taken into custody.[19] Later, two others were detained and around 20 rolls of film were taken from the photographers.[14] Police also impounded their vehicles.[14] Firemen also arrived to help remove the victims.[22]\n\nStill conscious, Rees-Jones had suffered multiple serious facial injuries and a head contusion.[23] The front occupants' airbags had functioned normally.[24] The occupants were not wearing seat belts.[a] Diana, who had been sitting in the right rear passenger seat, was still conscious. Critically injured, Diana was reported to murmur repeatedly, \"Oh my God,\" and after the photographers and other helpers were pushed away by police, \"Leave me alone.\"[25] In June 2007, the Channel 4 documentary Diana: The Witnesses in the Tunnel claimed that the first person to touch Diana was Dr. Maillez,[26] who chanced upon the scene. He reported that Diana had no visible injuries but was in shock. Diana was removed from the car at 01:00. She then went into cardiac arrest and following external cardiopulmonary resuscitation, her heart started beating again.[28] She was moved to the SAMU ambulance at 01:18, left the scene at 01:41 and arrived at the Pitié-Salpêtrière Hospital at 02:06.[29]\n\nFayed had been sitting in the left rear passenger seat and was shortly afterwards pronounced dead.[30] Paul was declared dead on removal from the wreckage. Both were taken to the Institut Médico-Légal (IML), the Paris mortuary, not to a hospital. Paul was later found to have a blood alcohol level of 1.75 grams per litre of blood—about 3.5 times the legal limit in France,[23] (equivalent to about 2.2 times the legal limit in Canada/the U.K./the U.S., for purposes of comparison).\n\nDespite attempts to save her, Diana's internal injuries were too extensive and attempts were unsuccessful: her heart had been displaced to the right side of her chest, which tore the pulmonary vein and the pericardium. Despite resuscitation attempts, including internal cardiac massage, she later died at the hospital at approximately 04:00.[33] Anesthesiologist Bruno Riou announced her death at 06:00 at a news conference held at the hospital.[19][34]\n\nLater that morning, Jean-Pierre Chevènement (French Minister of the Interior) visited the hospital with French Prime Minister Lionel Jospin.[35] At around 17:00, Diana's former husband, Charles, Prince of Wales, and her two older sisters, Lady Sarah McCorquodale and Lady Jane Fellowes, arrived in Paris. The group visited the hospital along with French President Jacques Chirac and thanked the doctors for trying to save her life.[37] Prince Charles accompanied Diana's body home on Sunday.[38] Her body was taken to the Hammersmith and Fulham mortuary in London for a post-mortem examination later that day.[39]\n\nInitial media reports stated Diana's car had collided with the pillar at 190 km/h (120 mph), and that the speedometer's needle had jammed at that position.[23] It was later announced the car's speed on collision was about 95–110 km/h (60–70 mph). The car was certainly travelling much faster than the speed limit of 50 km/h (31 mph). In 1999, a French investigation concluded the Mercedes had come into contact with another vehicle (a white Fiat Uno) in the tunnel.[40] The driver of that vehicle has never been conclusively traced, although many believe the driver of the Fiat was Le Van Thanh but the specific vehicle has not been identified.[41][40]\n\nIt was remarked by Robin Cook, the British Foreign Secretary, that if the accident had been caused in part by being hounded by paparazzi, it would be \"doubly tragic.\"[12] Diana's brother also blamed tabloid media for her death.[42] An 18-month French judicial investigation concluded in 1999 that the crash was caused by Paul, who lost control at high speed while intoxicated.[43]\n\nMourning [ edit ]\n\nMembers of the public were invited to sign a book of condolence at St. James Palace.[44] All 11,000 light bulbs at Harrods were turned off and not switched on again until after the funeral.[44] Throughout the night, members of the Women's Royal Voluntary Service and the Salvation Army provided support for people queuing along the Mall.[45] More than one million bouquets were left at her London home, Kensington Palace,[46] while at her family's estate of Althorp the public was asked to stop bringing flowers as the volume of people and flowers in the surrounding roads was said to be causing a threat to public safety.[47]\n\nBy 10 September, the pile of flowers outside Kensington Gardens was 5 feet (1.5 m) deep in places and the bottom layer had started to compost.[48] The people were quiet, queuing patiently to sign the book and leave their gifts. There were a few minor incidents. Fabio Piras, an Italian tourist, was given a one-week prison sentence on 10 September for having taken a teddy bear from the pile. When the sentence was later reduced to a £100 fine, Piras was punched in the face by a member of the public when he left the court.[49] The next day two Slovakian tourists, Maria Rigolova, a 54-year-old secondary school teacher and Agnesa Sihelska, a 50-year-old communications technician, were each given a 28-day prison sentence for having taken 11 teddy bears and a number of flowers from the pile outside the palace.[50] This was reduced to a fine of £200 each.[51]\n\nFuneral [ edit ]\n\nEarly on, it was uncertain if it would be a state funeral since Diana had lost the style Her Royal Highness because of her divorce from Prince Charles in 1996.[52]\n\nDiana's death was met with extraordinary public expressions of grief, and her funeral at Westminster Abbey on 6 September drew an estimated 3 million mourners and onlookers in London,[53][54] and worldwide television coverage watched by 2.5 billion people.[55] It was aired to 200 countries in 44 languages.[56] Outside the Abbey and in Hyde Park crowds watched and listened to proceedings on large outdoor screens and speakers as guests filed in, including representatives of the many charities of which Diana was patron. Attendants included US First Lady Hillary Clinton, Bernadette Chirac, wife of the French President, Jacques Chirac and other celebrities, including Italian tenor Luciano Pavarotti and friends of Diana, George Michael and Elton John.[25][57] John performed a rewritten version of his song \"Candle in the Wind\" that was dedicated to her, known as \"Goodbye England's Rose\".[58] Protocol was disregarded when the guests applauded the speech by Diana's younger brother Earl Spencer, who strongly criticised the press and indirectly criticised the Royal Family for their treatment of her.[59] The funeral is estimated to have been watched by 31.5 million viewers in Britain. Precise calculation of the worldwide audience is not possible, but estimated at around 2.5 billion.[60]\n\nAfter the end of the ceremony, the coffin was driven to Althorp in a Daimler hearse.[61] Mourners cast flowers at the funeral procession for almost the entire length of its journey and vehicles even stopped on the opposite carriageway of the M1 motorway as the cars passed.[62]\n\nIn a private ceremony, Diana was buried on an island in the middle of a lake called The Oval, which is part of the Pleasure Garden at Althorp.[63] In her coffin, she wears a black Catherine Walker dress and black tights, and is holding a rosary in her hands. The rosary had been a gift from Mother Teresa of Calcutta, a confidante of Diana, who had died the day before her funeral. A visitors' centre is open during summer months, with an exhibition about her and a walk around the lake. All profits are donated to the Diana, Princess of Wales Memorial Fund.[64]\n\nReactions [ edit ]\n\nSome criticised the reaction to Diana's death at the time as being \"hysterical\" and \"irrational\". As early as 1998, philosopher Anthony O'Hear identified the mourning as a defining point in the \"sentimentalisation of Britain\", a media-fuelled phenomenon where image and reality become blurred.[65] Oasis bandleader Noel Gallagher responded to the reaction with \"The woman's dead. Shut up. Get over it\".[66] These criticisms were repeated on the 10th anniversary, when journalist Jonathan Freedland expressed the opinion that \"It has become an embarrassing memory, like a mawkish, self-pitying teenage entry in a diary ... we cringe to think about it.\" In 2010, Theodore Dalrymple suggested \"sentimentality, both spontaneous and generated by the exaggerated attention of the media, that was necessary to turn the death of the princess into an event of such magnitude thus served a political purpose, one that was inherently dishonest in a way that parallels the dishonesty that lies behind much sentimentality itself\".[67] Some cultural analysts disagreed. Sociologist Deborah Steinberg pointed out that many Britons associated Diana not with the Royal Family but with social change and a more liberal society: \"I don't think it was hysteria, the loss of a public figure can be a touchstone for other issues.\"[68] Carol Wallace of People Magazine said that the fascination with Diana's death had to do with \"the fairy tale failing to end happily – twice, first when she got divorced and now that she died.\"[69]\n\nRoyal family [ edit ]\n\nThe Queen expressed her dismay at Diana's death when she found out.[70] Prince Charles woke his sons before dawn to share the news.[71] On Sunday morning after Diana's death, the Queen and Princes Charles, William and Harry all wore black to church services at Balmoral Castle.[72] Charles and his sons returned to London on Friday, 5 September.[73] The Queen, who returned to London from Balmoral, agreed to a television broadcast to the nation.[74]\n\nThe Royal Family was criticised for a rigid adherence to protocol, and their efforts to protect the privacy of Diana's grieving sons was interpreted as a lack of compassion.[75] In particular, the refusal of Buckingham Palace to fly the Royal Standard at half-mast provoked angry headlines in newspapers.[75][76] \"Where is our Queen? Where is her Flag?\" asked The Sun.[74] The Palace's stance was one of royal protocol: no flag could fly over Buckingham Palace, as the Royal Standard is only flown when the Queen is in residence, and the Queen was then in Scotland. The Royal Standard never flies at half-mast as it is the Sovereign's flag and there is never an interregnum or vacancy in the monarchy, as the new monarch immediately succeeds his or her predecessor. Finally, as a compromise, the Union Flag was flown at half-mast as the Queen left for Westminster Abbey on the day of the funeral.[74] This set a precedent, and Buckingham Palace has subsequently flown the Union Flag when the Queen is not in residence.[77] A rift between Prince Charles and the Queen's private secretary Sir Robert Fellowes (Diana's brother-in-law) was reported in the media over what the nature of the Princess' funeral should be with Charles demanding a public funeral and Fellowes supporting the Queen's idea of a private one.[78] The Palace later issued a statement denying such rumours.[78]\n\nPrince Harry said in 2017 that the death of his mother caused severe depression and grief.[79] Prince William was 15 and Harry was 12 when Diana died.[80]\n\nPoliticians' reactions [ edit ]\n\nPresident Bill Clinton's remarks on Diana's death\n\nBritish Prime Minister, Tony Blair, said that he \"felt utterly devastated by the death of the Princess.\"[52] President Bill Clinton said that he and his wife, Hillary Clinton were \"profoundly saddened\" when they found out about her death.[19] Kofi Annan, the United Nations Secretary-General said that her death \"has robbed the world of a consistent and committed voice for the improvement of the lives of suffering children worldwide.\"[72] In Australia, the Deputy Prime Minister, Tim Fischer, condemned the paparazzi for their overzealous coverage of Diana.[81] Russian President Boris Yeltsin praised Diana's charity work in a statement saying \"All know of Princess Diana's big contribution to charitable work, and not only in Great Britain\".[82][83] Among other politicians who sent messages of condolences were South African President Nelson Mandela, Australian Prime Minister John Howard, Canadian Prime Minister Jean Chrétien, New Zealand Prime Minister Jim Bolger, and Israeli Prime Minister Benjamin Netanyahu.[82]\n\nPublic reactions [ edit ]\n\nIn London, thousands of people carried bouquets and stood outside of Buckingham Palace after the news of her death.[72] People started bringing flowers within an hour after the news was shared.[70] The BBC flew its flags at half-mast.[72] Both radio and television aired the British national anthem, \"God Save the Queen,\" in response to Diana's death, as is precedent for the death of a member of the Royal Family.[70]\n\nPeople in the United States were shocked at her death.[84] In Paris, thousands of people visited the site of the crash and the hospital where Diana died.[85] People brought flowers and also attempted to visit the Hotel Ritz, as well.[85] In Bosnia, a land-mine survivor, Jasminko Bjelic, who had met Diana only three weeks earlier, said, \"She was our friend.\"[72] Following her death many celebrities including actors and singers blamed the paparazzi and condemned their reckless behavior.[86][87]\n\nDuring the four weeks following her funeral, the suicide rate in England and Wales rose by 17% and cases of deliberate self-harm by 44.3% compared with the average for that period in the four previous years. Researchers suggest that this was caused by the \"identification\" effect, as the greatest increase in suicides was by people most similar to Diana: women aged 25 to 44, whose suicide rate increased by over 45%.[88] Another research showed that 50% of Britons and 27% of Americans were deeply affected by her death as if someone they knew had died. It also concluded that in general women were more affected than men in both of the countries.[89] The same research showed that Diana's \"charitable endeavors\" and \"ability to identify with ordinary people\" were among the main factors that caused her to be admired and respected by the people.[89] In the weeks after her death counselling services reported an increase in the number of phone calls by the people who were seeking help due to grief or distress.[90]\n\nThe national grieving for Diana had economic effects. In the short term, the Centre for Economics and Business Research (CEBR) estimated that retail sales dropped 1% that week. Traffic congestion in central London as crowds went to the palaces to pay homage likewise adversely affected productivity, and the CEBR estimated that would cost businesses £200 million, or a total loss of 0.1% of gross domestic product for the third quarter of 1997. However, in the long run the CEBR expected that to be offset by increased tourism and memorabilia sales.[91]\n\nMemorials [ edit ]\n\nFlame of Liberty, the unofficial Diana memorial in Paris, France, the day after the 20th anniversary of her death. The ground is covered with flowers and other tributes, and the chain fence covered with The, the unofficial Diana memorial in Paris, France, the day after the 20th anniversary of her death. The ground is covered with flowers and other tributes, and the chain fence covered with love locks\n\nIn the years after her death, interest in the life of Diana has remained high. As a temporary memorial, the public co-opted the Flamme de la Liberté (Flame of Liberty), a monument near the Alma Tunnel related to the French donation of the Statue of Liberty to the United States. The messages of condolence have since been removed and its use as a Diana memorial has discontinued, though visitors still leave messages in her memory. A permanent memorial, the Diana, Princess of Wales Memorial Fountain, was opened by the Queen in Hyde Park in London on 6 July 2004.[92]\n\nInquests [ edit ]\n\nUnder English law, an inquest is required in cases of sudden or unexplained death.[93][94] A French judicial investigation had already been carried out but the 6,000-page report was never published.[95] On 6 January 2004, six years after her death, an inquest into the deaths of Diana and Fayed opened in London held by Michael Burgess, the coroner of the Queen's household.[94] The coroner asked the Metropolitan Police Commissioner, Sir John Stevens, to make inquiries, in response to speculation that the deaths were not an accident.[94][96] The police investigation reported its findings in Operation Paget in December 2006.[97]\n\nIn January 2006, Lord Stevens explained in an interview on GMTV that the case is substantially more complex than once thought. The Sunday Times wrote on 29 January 2006 that agents of the British secret service were cross-examined because they were in Paris at the time of the crash. It was suggested in many journals that these agents might have exchanged the blood test of the driver with another blood sample (although no evidence for this has been forthcoming).[98][99]\n\nThe inquests into the deaths of Diana and Fayed opened on 8 January 2007, with Dame Elizabeth Butler-Sloss acting as Deputy Coroner of the Queen's Household for the Diana inquest and Assistant Deputy Coroner for Surrey in relation to the Fayed inquest. Butler-Sloss originally intended to sit without a jury;[100] this decision was later overturned by the High Court,[101] as well as the jurisdiction of the Coroner of the Queen's Household. On 24 April 2007, Butler-Sloss stepped down, saying she lacked the experience required to deal with an inquest with a jury.[102] The role of Coroner for the inquests was transferred to Lord Justice Scott Baker, who formally took up the role on 13 June as Coroner for Inner West London.[103]\n\nOn 27 July 2007, Baker, following representations for the lawyers of the interested parties, issued a list of issues likely to be raised at the inquest, many of which had been dealt with in great detail by Operation Paget:\n\nWhether driver error on the part of Henri Paul caused or contributed to the cause of the collision Whether Henri Paul's ability to drive was impaired through drink or drugs Whether a Fiat Uno or any other vehicle caused or contributed to the collision Whether the actions of the Paparazzi caused or contributed to the cause of the collision Whether the road/tunnel layout and construction were inherently dangerous and, if so, whether this contributed to the collision Whether any bright/flashing lights contributed to or caused the collision and, if so, their source Whose decision it was that the Princess of Wales and Dodi Al Fayed should leave from the rear entrance to the Ritz and that Henri Paul should drive the vehicle Henri Paul's movements between 7 and 10 pm on 30 August 1997 The explanation for the money in Henri Paul's possession on 30 August 1997 and in his bank account Whether Andanson was in Paris on the night of the collision Whether Diana's life would have been saved if she had reached hospital sooner or if her medical treatment had been different Whether Diana was pregnant Whether Diana and Dodi Al Fayed were about to announce their engagement Whether and, if so in what circumstances, the Princess of Wales feared for her life The circumstances relating to the purchase of the ring The circumstances in which Diana's body was embalmed Whether the evidence of Tomlinson throws any light on the collision Whether the British or any other security services had any involvement in the collision Whether there was anything sinister about (i) the Cherruault burglary or (ii) the disturbance at the Big Pictures agency Whether correspondence belonging to the Princess of Wales (including some from Prince Philip) has disappeared, and if so the circumstances.[104]\n\nThe inquests officially began on 2 October 2007 with the swearing of a jury of six women and five men. Scott Baker delivered a lengthy opening statement giving general instructions to the jury and introducing the evidence.[105] The BBC reported that Mohamed Al-Fayed, having earlier reiterated his claim that his son and Diana were murdered by the Royal Family, immediately criticised the opening statement as biased.[106]\n\nThe inquest heard evidence from people connected with Diana and the events leading to her death, including Paul Burrell, Mohamed Al-Fayed, her stepmother, the survivor of the crash, and the former head of MI6.[107]\n\nScott Baker began his summing up to the jury on 31 March 2008.[108] He opened by telling the jury \"no-one except you and I and, I think, the gentleman in the public gallery with Diana and Fayed painted on his forehead sat through every word of evidence\" and concluded that there was \"not a shred of evidence\" that Diana's death had been ordered by the Duke of Edinburgh or organised by the security services.[109] Lord Justice Scott Baker concluded his summing up on Wednesday, 2 April 2008.[110] After summing up, the jury retired to consider five verdicts, namely unlawful killing by the negligence of either or both the following vehicles or Paul; accidental death or an open verdict.[108] The jury decided on 7 April 2008 that Diana had been unlawfully killed by the following vehicles.[111][112] Princes William and Harry released a statement in which they said that they \"agree with their verdicts and are both hugely grateful.\"[113] Mohamed Al Fayed also said that he would accept the verdict and \"abandon his 10-year campaign to prove that Diana and Dodi were murdered in a conspiracy\".[114]\n\nThe cost of the inquiry exceeded £12.5 million, the coroner's inquest cost £4.5 million; a further £8 million was spent on the Metropolitan Police investigation. It lasted 6 months and heard 250 witnesses, with the cost heavily criticised in the media.[115]\n\nRelated lawsuits [ edit ]\n\nNine photographers who had been following Diana and Dodi in 1997, were charged with manslaughter in France.[116] France's \"highest court\" dropped the charges in 2002.[116]\n\nThree photographers who took pictures of the aftermath of the crash on 31 August 1997 had their photographs confiscated and were tried for invasion of privacy for taking pictures through the open door of the crashed car.[116][117] The photographers, who were part of the \"paparazzi\" were acquitted in 2003.[116]\n\nConspiracy theories [ edit ]\n\nAlthough the initial French investigation found that Diana had died as a result of an accident, several conspiracy theories have been raised.[118] Since February 1998, Fayed's father, Mohamed Al-Fayed (the owner of the Hôtel Ritz, where Paul worked, and thus potentially liable for wrongful death liability) has claimed that the crash was a result of a conspiracy,[119] and later contended that the crash was orchestrated by MI6 on the instructions of the Royal Family.[120] His claims were dismissed by a French judicial investigation[3] and by Operation Paget, a Metropolitan Police Service inquiry that concluded in 2006.[121] An inquest headed by Lord Justice Scott Baker into the deaths of Diana and Fayed began at the Royal Courts of Justice, London, on 2 October 2007, a continuation of the inquest that began in 2004.[102] On 7 April 2008, the jury concluded that Diana and Fayed were the victims of an \"unlawful killing\" by the \"grossly negligent\" chauffeur Paul and the drivers of the following vehicles.[122] Additional factors were \"the impairment of the judgment of the driver of the Mercedes through alcohol\" and \"the death of the deceased was caused or contributed to by the fact that the deceased was not wearing a seat belt, the fact that the Mercedes struck the pillar in the Alma Tunnel rather than colliding with something else\".[111]\n\nOn 17 August 2013, Scotland Yard revealed that they were examining the credibility of information from a source that alleged that Diana was murdered by a member of the British military.[123][124]\n\nIn the media [ edit ]\n\nAfter Dark television discussion - \"After Diana\" - broadcast on A specialtelevision discussion - \"After Diana\" - broadcast on Channel 4 on 13 September 1997\n\nActor George Clooney publicly lambasted several tabloids and paparazzi agencies following Diana's death. A few of the tabloids boycotted Clooney following the outburst, stating that he \"owed a fair portion of his celebrity\" to the tabloids and photo agencies in question.[125]\n\nDiana was ranked third in the 2002 Great Britons poll sponsored by the BBC and voted for by the British public, after Sir Winston Churchill (1st) (a distant cousin), and Isambard Kingdom Brunel (2nd), just above Charles Darwin (4th), William Shakespeare (5th), and Isaac Newton (6th). That same year, another British poll named Diana's death as the most important event in the country's last 100 years.[126] Historian Nick Barrett criticised this outcome as being \"a pretty shocking result\".[127]\n\nLater in 2004, US TV network CBS showed pictures of the crash scene in one of its programmes which were \"part of a 4,000-page French government report.\" It showed an intact rear side and centre section of the Mercedes, including one of an unbloodied Diana with no outward injuries crouched on the rear floor with her back to the right passenger seat—the right rear door is fully open. The release of these pictures were poorly received in the UK, where it was felt that the privacy of Diana was being infringed.[128] Buckingham Palace, UK Prime Minister and Diana's brother condemned the action, while CBS defended its decision saying that the pictures \"are placed in journalistic context - an examination of the medical treatment given to Princess Diana just after the crash.\"[129]\n\nOn 13 July 2006, Italian magazine Chi published photographs that showed Diana amid the wreckage of the car crash;[130] the photos were released despite an unofficial blackout on such photographs being published.[131][b] The editor of Chi defended his decision by saying he published the photographs simply because they had not been previously seen, and he felt the images were not disrespectful to the memory of Diana.[131]\n\nThe British newspaper The Daily Express has been criticised for continued and sustained coverage of Princess Diana following her death. A 2006 report in The Guardian showed that the newspaper had mentioned her in numerous recent news stories, with headlines including \"Perhaps Diana should have worn seatbelt\", \"Diana inquiry chief's laptop secrets stolen\", \"£250,000 a year bill to run Diana fountain\" and \"Diana seatbelt sabotage probe\".[132]\n\nInternet coverage [ edit ]\n\nDiana's death occurred at a time when Internet use in the developed world was booming, and several national newspapers and at least one British regional newspaper had already launched online news services. BBC News had set up online coverage of the general election earlier in 1997[133] and as a result of the widespread public and media attention that Diana's death resulted in, BBC News swiftly created a website featuring news coverage of Diana's death and the events that followed it. Diana's death helped BBC News officials realise how important online news services were becoming, and a full online news service was launched on 4 November that year, alongside the launch of the BBC's rolling news channel BBC News 24 on 9 November.[134]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nNotes [ edit ]\n\n^ Although there are conflicting reports (such as BBC and CNN ), the investigation Operation Paget report notes \"Operation Paget's view is that none of the seat belts were being worn at the time of the impact, including that of Trevor Rees-Jones.\" (Page 421) [1] ^ The photographs, taken minutes after the accident, show her slumped in the back seat while a paramedic attempts to fit an oxygen mask over her face.\n\nCitations [ edit ]\n\nBibliography [ edit ]\n\nCoordinates: [1]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Flamme_de_la_Libert%C3%A9_Place_de_l%27Alma_2017-09-01_3.jpg/220px-Flamme_de_la_Libert%C3%A9_Place_de_l%27Alma_2017-09-01_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Coat_of_Arms_of_Diana%2C_Princess_of_Wales_%281996-1997%29.svg/100px-Coat_of_Arms_of_Diana%2C_Princess_of_Wales_%281996-1997%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/240px-Flowers_for_Princess_Diana%27s_Funeral.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/24px-EC1835_C_cut.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/1200px-Flowers_for_Princess_Diana%27s_Funeral.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Mercedes_W140_front_20070609.jpg/220px-Mercedes_W140_front_20070609.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Coat_of_Arms_of_Diana%2C_Princess_of_Wales_%281981-1996%29.svg/100px-Coat_of_Arms_of_Diana%2C_Princess_of_Wales_%281981-1996%29.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/President_Clinton%27s_Remarks_on_Death_of_Princess_Diana_%281997%29.webm/220px--President_Clinton%27s_Remarks_on_Death_of_Princess_Diana_%281997%29.webm.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/After_Dark_special_edition_on_13_September_1997.jpg/220px-After_Dark_special_edition_on_13_September_1997.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/24px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/18px-EC1835_C_cut.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/24px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Correspondence_regarding_death_of_Diana%2C_Princess_of_Wales_%281997%29_%2820393151714%29.jpg/220px-Correspondence_regarding_death_of_Diana%2C_Princess_of_Wales_%281997%29_%2820393151714%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Alma_tunnel_Paris.jpg/220px-Alma_tunnel_Paris.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/1200px-Flowers_for_Princess_Diana%27s_Funeral.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Death_of_Diana,_Princess_of_Wales", "title": "Death of Diana, Princess of Wales", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/1200px-Flowers_for_Princess_Diana%27s_Funeral.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}