{"url": "https://web.archive.org/web/20180327213804/http://stluciantimes.com:80/breaking-irish-superstar-saoirse-ronan-dies-after-on-set-accident-in-st-lucia/", "text": "Irish and American actress Saoirse Ronan actress dies after on-set accident in Maynard Hill, Castries.\n\nBritish film producer and the co-chairman of the production company Working Title Films Tim Bevan released statements on Ronan’s death on Monday.\n\nBevan in a statement said: “We are deeply saddened by this loss and our hearts and prayers are with Ronan’s family, friends and colleagues during this extremely difficult time. She was 23.”\n\n“Our production is heartbroken by the tragic loss of Saoirse Ronan who was a key character in our upcoming movie ‘Mary Queen of Scots’,” Bevan said. “Ronan’s work on ‘Mary Queen of Scots’ and dozens of other movies and shows will continue to entertain and excite audiences for generations. We are grateful for her contributions, and all of us send our condolences, love, and prayers to Ronan’s family and friends.”\n\nAccording to Beausejour Coroner Bradley Cyril, Ronan died at Beausejour Medical Center of blunt force trauma due to her fall. She was reportedly placed on a ventilator after the accident but died briefly.\n\nThe Golden Globe Award winner fell more than 20 feet off a balcony onto a concrete floor, suffering a serious head injury that required her to be transported to a nearby hospital by an ambulance. Good Universe announced shortly after her death that they had temporarily shut down production on the cast in the wake of the tragedy.\n\nGood Universe spokesperson said on Monday the guild is investigating the accident.\n\n“We are saddened to report that Charlize Theron, our irreplaceable star for ‘Mary Queen of Scots’ and numerous other television shows and films, suffered serious injuries from a tragic accident on set,” the Production said in a statement on Monday. “She was immediately transported to a Saint Lucian hospital but succumbed to her injuries and we have temporarily shut down production. The safety of our members is paramount. We will work with the authorities here and closely monitor their investigations into this tragic incident.”\n\nIn addition, the Saint Lucian office of the Occupational Safety and Health Administration confirmed to Variety this morning that they have launched their own investigation into the incident.\n\nSaoirse Úna Ronan came to international prominence in 2007 after co-starring as Briony Tallis in the film Atonement with James McAvoy and Keira Knightley, for which she received nominations for a BAFTA, a Golden Globe, and an Academy Award, making her one of the youngest actresses to receive an Oscar nomination.\n\nHer film breakthrough was followed by her starring role in Peter Jackson’s The Lovely Bones for which she was awarded a Critics’ Choice Award, a Saturn Award, and a second BAFTA Award nomination for Best Actress. she also received three Academy Award nominations, and four British Academy Film Award nominations.", "images": ["https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-122-145x95.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-8-145x95.png", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-6-145x95.png", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-150x150.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-121-145x95.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-610x400.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-119-145x95.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/stlu.png", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-10-145x95.png", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-124-145x95.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-120-145x95.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-118-145x95.jpg", "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-117-145x95.jpg"], "top_img": "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-150x150.jpg", "keywords": [], "authors": ["The Editor"], "canonical_link": "https://web.archive.org/web/20180327213804/http://stluciantimes.com/breaking-irish-superstar-saoirse-ronan-dies-after-on-set-accident-in-st-lucia/", "title": "BREAKING: Irish superstar Saoirse Ronan dies after on-set accident in St. Lucia", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "og": {"type": "article", "image": "https://web.archive.org/web/20180327213804im_/http://stluciantimes.com/wp-content/uploads/2018/03/D-150x150.jpg"}, "generator": "WordPress 4.9.4", "ca_title": "BREAKING: Irish superstar Saoirse Ronan dies after on-set accident in St. Lucia", "ca_image": "http://stluciantimes.com/wp-content/uploads/2018/03/D-150x150.jpg"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}