{"url": "https://www.billboard.com/articles/news/grammys/8096794/grammys-2018-what-fans-didnt-see-on-tv-behind-the-scenes", "text": "Music fans tuning into the Grammy Awards got to see all of the action live from Madison Square Garden starting at 7:30 p.m. ET Sunday night (Jan. 28), but the day started long before that for many of the night's nominees. With the Premiere Ceremony taking place before the show, several awards started being handed out as early as 3 p.m. ET -- 75, to be exact -- and Billboard was there to catch it all from the start.\n\nFrom red carpet interactions to press room commentary, Grammys given out early to behind-the-scenes moments inside the official show, here's a glimpse of what doesn't get caught on camera on music's biggest night.\n\n3:19 p.m. ET Ten minutes after the Grammy Awards Premiere Ceremony kicks off, the first Grammy of 2018 is awarded to LCD Soundsystem for their song “Tonite,” marking the dance-rock band’s first win after five previous nominations. Paul Schaffer gives the LCD Soundsystem ballot to the model on the side of the stage and says “Take this,” with a wisecrack toward the recent controversies surrounding sexual misconduct in the entertainment business. \"When I say take this I mean it wit the most #MeToo kind of respect,” he quips.\n\n3:24 p.m. Kendrick Lamar’s “HUMBLE.” wins for best music video, which producers Nathan K. Scherrer & Anthony Tiffith accepted on behalf of all the directors and producers that were nominated along with them. Tiffith kept it short and sweet, reiterating Lamar’s message in the song: \"I just wanna say, stay humble. Thank you.\"\n\n3:36 p.m. Upon accepting the award for best boxed or special limited edition package for The Voyager Golden Record: 40th Anniversary Edition, art director Lawrence Azerrad dedicates the award to the late Chuck Berry, who passed away last year. Later in the press room, Azerrad further explains his reasoning for tributing Berry. “[He’s] the only example of rock ’n' roll on the album .... Long after the Earth is swallowed up by the sun, Chuck Berry’s record will still be floating in space. So it was kind of poignant on the 40th anniversary of the Voyager and our record coming out was also the year that he left us. He was a critical part of the project.\"\n\n3:38 p.m. Paul Schaffer’s band plays an instrumental version of Fall Out Boy’s “Centuries” as Leonard Bernstein composer goes up to accept historical album — coincidental timing for the choice, as Fall Out Boy had just earned their fourth No. 1 album as M A N I A debuted atop the Billboard 200 just hours before.\n\n3:49 p.m. India.Arie delivers the first performance of the 2018 Grammys, a poignantly relevant rendition of her 2013 hit, “I Am Light.\"\n\n3:51 p.m. Sasha Barr, who worked with Father John Misty to create the Pure Comedy album packaging (and won this year’s Grammy for best recording package) reveals to press room reporters that the two — who have worked together several times in the past — are already working on the follow-up to the album.\n\n3:59 p.m. 24K Magic engineers John Hanes & Charles Moniz celebrate their win for best engineered album, non-classical by talking about Bruno Mars’ involvement with the album’s engineering. \"He wants to try all permutations and exhaust all possibilities. It really pushed us to make sure that what it is is the best it could be,” Moniz says. Hanes adds, \"He’s a bit of a perfectionist, but in a good way. Every idea that he has pushes it forward in a complimentary way. He pushes it always in the right direction.\"\n\n4:06 p.m. Following Justin Hurwitz’s back-to-back win for the La La Land soundtrack, Lin-Manuel Miranda’s Moana hit “How Far I’ll Go” beats out \"City of Stars\" for best song written for visual media. Despite his excitement for the nomination, Miranda wasn’t there to accept the award.\n\n4:08 p.m. After Residente wins for best Latin rock, urban or alternative album, the Latin rapper talks to reporters in the press room and acknowledges the influence of Latin music on the pop world thanks to Luis Fonsi and Daddy Yankee's “Despacito” and beyond: \"It’s good what’s happening. I’m not against any music genre, I don’t like when people don’t care about art anymore ... I’m happy to win this, it helps.”\n\n4:25 p.m. Dear Evan Hansen producers Benj Pasek and Justin Paul — who won for best musical theater album — address the #TimesUp pins they’re sporting on their suit lapels. \"It’s very exciting to be liviing in a time where people can feel free to speak up and to speak the truth and to not feel afraid,” Paul says. As for their Grammy win, Pasek couldn’t help smiling while saying, “It’s a very surreal and wonderful experience, and we feel very honored to be here tonight.\"\n\n4:29 p.m. Justin Hurwitz reflects on the La La Land flub at last year’s Oscars while holding his two Grammys for La La Land’s wins in the best compilation soundtrack for visual media and best score soundtrack for visual media. \"It was a crazy moment, honestly it’s a blur. I’ve watched it on YouTube a few times because my actual memory is a blur,” he says in the press room. “It was just very confusing, but it was a great night for our movie and obviously a great night for Moonlight which is a phenomenal film.\"\n\n5:10 p.m. Following his win for best contemporary Christian music album (Chain Breaker), Zach Williams mentioned that Chris Pratt had used one of his songs in an Instagram post earlier in the week that made it go viral. Even despite having a conversation with Pratt on Instagram messaging, Williams admits, “I did not wake up this morning thinking I’d win a Grammy.”\n\n5:18 p.m. As Reba McEntire discusses her excitement for winning her first Grammy in 25 years — she previously won for best country vocal collaboration “Does He Love You” in 1993 — this time for best roots gospel album (Sing It Now: Songs of Faith & Hope). While talking with reporters, McEntire covered topics fun and controversial, from the #MeToo and #TimesUp movements to playing Colonel Sanders in the latest KFC commercial: “When they asked me, I said, ‘Heck yeah, who wouldn’t want to be the Colonel Sanders?' I had a blast shooting’ the commercials.\"\n\n5:26 p.m. The late Leonard Cohen wins his third Grammy, as “You Want It Darker\" wins for best rock performance.\n\n5:35 p.m. The Weeknd’s Starboy wins for best urban contemporary album, but the singer isn’t in attendance to pick up his award. Luckily for Abel, Jimmy Jam was presenting at the time, who also happens to live around the corner from The Weeknd: \"I’ll make sure he gets it,” he quips.\n\n5:40 p.m. Lana Del Rey walks the red carpet and grabs reporters’ phones to give social media shout-outs.\n\n6:03 p.m. Mastadon’s drummer Brann Dailor talks to press room reporters about accepting their first Grammy after “Sultan’s Curse” won for best metal performance. \"I have no idea what I said up there,\" but we’re beyond excited and thrilled. This is part of the American dream.”\n\n6:09 p.m. Bruno Mars’ “That’s What I Like” co-writer James Fauntleroy expresses his confidence that the 24K Magic hit — which had already won for best R&B song and best R&B performance — is also on track for a song of the year win: \"It’s gonna win ‘em all.” (Update: It did.)\n\n6:22 p.m. Portugal. The Man’s bassist Zach Carothers beams over the group’s win for pop duo/group performance for “Feel It Still” while talking to press room reporters, admitting, \"Things are just going our way, I don’t know what’s going on around here. It’s been a really, really long overnight success — a 12-year-long overnight success.”\n\n6:25 p.m. Sam Smith notices two little girls on the red carpet and stops to give hugs and snap a picture.\n\n6:36 p.m. Producer foursome The Stereotypes talk to reporters in the press room about winning best R&B song for Bruno Mars’ “That’s What I Like,” which they already got to celebrate with Mars in a small way. “I just texted him, I said, ‘Let’s go’ with about 11 o’s after it and he hit me back and said ‘I saw y'all!’ with the high 10,” The Stereotypes’ Jonathan Yip says. \"He definitely was watching us and I think he was excited he won and that we won.\"\n\n6:41 p.m. After Tony Bennett won his 21st Grammy (for best traditional pop vocal album, Tony Bennett Celebrates 90), the legendary singer gushes to Billboard about his love for Lady Gaga and her impact on his career, one of his handlers adds, “Gaga told us at her last concert at Citi Field that we’re actually helping her audience.”\n\n6:57 p.m. After arriving on the floor of Madison Square Garden, Jack Antonoff pops on his Mets cap -- a necessary accessory with his tux -- and snaps a few photos with Khalid.\n\n7:11 p.m. Cardi B and the train of her dress are escorted into MSG (with fiance Offset and his group Migos not far behind) and the celebs gabbing around her pause their conversations to marvel at the white gown.\n\n\"What's really really good? What's poppin'?\" - Cardi B to all her haters #GRAMMYs pic.twitter.com/pKi7y0nE7g — billboard (@billboard) January 29, 2018\n\n7:28 p.m. “Bruno! Sit down, Bruno!” -- minutes before the start of the telecast, Grammys producer Ken Ehrlich chastises Bruno Mars to take his seat in the front row (Mars, for his part, listens to the command and sits down).\n\n7:45 p.m. Right before Kendrick Lamar’s “Loyalty” is announced as the winner of best rap/sung performance, multiple people in the audience call out “HOV!” and “JIGGA!” in hopes of hearing JAY-Z’s “Family Feud” being called as the winner.\n\n8:08 p.m. \"You guys overestimated the height,” Alessia Cara quips as she walks up to the press room mic holding her best new artist Grammy. Grabbing the mic off the stand (and further joking, “I’m gonna do stand-up comedy after this”), Cara admits that she definitely didn’t see the win coming. “None of this feels real, to be honest … I probably won’t process this for another seven years.”\n\n8:21 p.m. As Luis Fonsi and Daddy Yankee perform “Despacito,” press room employees and reporters can’t help but bounce along to the Latin smash, clapping after Fonsi's final “Despacito.” Coincidence or not, the performance also sparks the loudest in-house reaction of the night thus far.\n\nWe asked Luis Fonsi how the massive success of #Despacito has changed his life.#GRAMMYs pic.twitter.com/oFVaSSUR3U — billboard (@billboard) January 29, 2018\n\n8:36 p.m. Dave Chappelle’s “Can we kick it?” comment during his presentation of the best rap album Grammy (in reference to A Tribe Called Quest’s classic “Can I Kick It?”) sparks an enthusiastic “Yes we can!” in the press room and inside the show — including a passionate response from Childish Gambino.\n\n9:12 p.m. DJ Khaled’s trademark “Another one” and spirited dance moves during his \"Wild Thoughts” performance with Rihanna and Bryson Tiller results in some jovial laughs from reporters backstage, as well as applause at the end. After finishing his first-ever Grammys performance, DJ Khaled gives Rihanna a 10-second bear hug once the cameras pan away, visibly moved by the accomplishment. Rih responds with a wide grin and pat on Khaled’s back.\n\n9:27 p.m. Inside the arena, you could almost hear a pin drop during Maren Morris, Brothers Osborne and Eric Church's performance of \"Tears In Heaven.\" But the noise of people loudly chatting in the concourse took away from a touching moment meant to honor the victims of last year's shootings in Las Vegas and Manchester, England.\n\n9:53 p.m. During commercial breaks, Grammy-goers are treated to past performances that typically have a connection to the one that just took place. Following U2's moving performance of \"Get Out Of Your Own Way\" live from a barge on the Hudson River, those inside the arena re-lived when U2 performed \"Beautiful Day\" in 2001.\n\n9:59 p.m. The \"dramatic reading\" sketch of Trump administration tell-all Fire and Fury makes both the press room and arena erupt in laughter, especially during Cardi B and DJ Khaled's excerpts -- and loudest when Hillary Clinton made an instantly viral cameo.\n\nHillary Clinton, Cardi B and more \"audition\" to narrate \"Fire and Fury\" at the #GRAMMYs https://t.co/v21HlrUzwK pic.twitter.com/zQptixRSQe — billboard (@billboard) January 29, 2018\n\n10:32 p.m. As Bruno Mars wins record of the year for \"24K Magic,\" The Stereotypes happen to be on the press room stage to celebrate their song of the year win with Mars for \"That's What I Like,\" which results rousing cheers from all four of the producer crew and reporters. They continue to answer questions while excitedly watching Mars accept his award, and Ray Romulus tells Billboard about their backstage celebration: \"He was just like, 'We did it man. It's about time. It's really about time that we had some success together.'\"\n\n10:39 p.m. With at least 20 minutes left to go, MSG is already emptying out as people start to head to after-parties.\n\n10:42 p.m. James Corden acts like he’s about to introduce Barack Obama... and instead intros Recording Academy chief Neil Portnow. The MSG audience grumbles in response after haphazardly standing up for the fake-out.\n\n10:55 p.m. Logic using the word “shitholes” might have earned him a bleep-out in the telecast, but defending the countries President Trump recently dismissed as “not SHITHOLES” also earned the rapper an immediate standing ovation from the Madison Square Garden attendees, who stood for the rest of his politically tinged sermon.\n\n10:58 p.m. As Chris Stapleton sports his three Grammys from the night -- the country crooner won for best country solo performance (\"Either Way\"), best country song (\"Broken Halos\"), and best country album (From a Room: Volume 1) in a sweep -- to the press room, admitting, \"I feel kind of awkward holding three of them right now.\" Stapleton also discusses working with Justin Timberlake on their recently released collaboration, \"Say Something\" and reveals that he plays the opening guitar lick on \"Filthy.\"\n\n11:05 p.m. Logic comes backstage to the press room after his moving performance of \"1-800-273-8255\" with Alessia Cara and Khalid and, despite the heavy yet uplifting message he shared after performing, he was in a bit of a witty mood as he took the mic. \"I've never done this, I feel like I should be on the Knicks or something,\" he jokes, later telling reporters that he was asked by the Recording Academy to give a speech. \"I wanted it to come from the heart. I’m not Tupac, or this prophetic dude or anything like that, I just want to make music and have fun. However, I have a power that a a lot of people in this world don’t, and I've been given a stage that the one percent get. I thought if I was going to have this power, I’d use it for positivity -- peace love and positivity to spread a positive message. Everyone is beautiful, and the world isn’t equal -- and we need to fight towards that.\"\n\n11:12 p.m. Donald Glover, aka Childish Gambino, comes to the press room post-show and addresses his 2017 comments about bringing Childish Gambino to an end -- even despite winning a Grammy for best traditional R&B performance (\"Redbone\") earlier in the night. \"I stand by that,\" he says. \"I'm really appreciative of this and I'm making another project, but I like endings. I think they're important to progress. If a lot of things had death notes or clauses we'd have less problems. Endings are good, they force things to get better.\"\n\n11: 55 p.m. Grammys executive producer Ken Ehrlich talks to reporters in the press room in a late post-show appearance (the final press room appearance of the night), briefly discussing Taylor Swift's absence at this year's awards -- and hinted that she may be invited to perform in 2019: \"Hopefully we'll see her next year, we'd like her on the show.\"", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/grammys-2018-recirc-billboard.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?31b846bafac45d8539bb", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://static.billboard.com/files/media/alessia-cara-backstage-grammys-show-2018-billboard-1548-1024x677.jpg"], "top_img": "https://static.billboard.com/files/media/alessia-cara-backstage-grammys-show-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.billboard.com/articles/news/grammys/8096794/grammys-2018-what-fans-didnt-see-on-tv-behind-the-scenes", "title": "41 Things You Didn't See on TV at Grammys 2018", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-01-31T13:06:12-05:00", "published_time": "2018-01-29T00:13:10-05:00"}, "description": "From red carpet interactions to press room commentary, Grammys given out early to behind-the-scenes moments inside the official show, here's a glimpse of what doesn't get caught on camera on music's biggest night.", "og": {"description": "From red carpet interactions to press room commentary, Grammys given out early to behind-the-scenes moments inside the official show, here's a glimpse of what doesn't get caught on camera on music's biggest night.", "image": {"identifier": "https://static.billboard.com/files/media/alessia-cara-backstage-grammys-show-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Grammys 2018: 41 Things You Didn't See on TV | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/grammys/8096794/grammys-2018-what-fans-didnt-see-on-tv-behind-the-scenes", "site_name": "Billboard"}, "title": "41 Things You Didn't See on TV at Grammys 2018", "twitter": {"card": "summary_large_image", "description": "From red carpet interactions to press room commentary, Grammys given out early to behind-the-scenes moments inside the official show, here's a glimpse of what doesn't get caught on camera on music's biggest night.", "image": "https://static.billboard.com/files/media/alessia-cara-backstage-grammys-show-2018-billboard-1548-1024x677.jpg", "title": "41 Things You Didn't See on TV at Grammys 2018", "site": "@billboard"}}, "movies": [], "publish_date": 1517202790.0, "source": "https://www.billboard.com", "summary": ""}