{"url": "www.lifeandstylemag.com/posts/kylie-jenner-butterfly-tattoo-134542/photos/kylie-jenner-hips-125075", "text": "Kylie Jenner Is Afraid of Butterflies, Which Is Weird Because She Has a Tattoo of One\n\nHaving a baby definitely changes you! Now that Kylie Jenner is a mom — she just announced that she gave birth to her first child with her baby daddy Travis Scott — she definitely had a completely different mindset than most other 20-year-olds. Last June, fans were shocked when Kylie and Travis debuted their new matching butterfly tattoos, but now it all makes sense. She got the butterfly to symbolize her relationship with the father of her baby girl!\n\nWhat’s more surprising is Kylie got a tattoo of an insect that she’s afraid of!\n\nOver the summer, her show Life of Kylie, has really taught us a lot about the makeup mogul. In a clip from an episode from Season 1, Kylie and her BFF Jordyn Woods went to a zoo together. Too bad Ky learns that she’s terrified of butterflies.\n\n“I’m scared if one lands on me!” the 20-year-old screamed as her friend laughed. Of course, the workers assured her that the butterflies are harmless, but she didn’t care.\n\n“Butterflies are just part of the secrets of Kylie,” she said in a voiceover. “It’s kind of just ironic because I’m terrified, terrified of butterflies. All butterflies. This is how I think of them: cut the wings off and if you just look at their bodies, they’re not that pretty. It’s literally a bug.”\n\nThe irony came from the fact that she and boyfriend Travis Scott have matching tatoos of those “bugs.” Kylie got a mini butterfly above her right ankle while Travis, 25, got the same exact ink on his left ankle.\n\nThis isn’t the first time the couple has shown their love using the winged insect. Over the course of their ten-month romance, they have sent each other cryptic messages on social media using the butterfly emoji, most likely inspired by Travis’ song, “Butterfly Effect”.\n\n“She caught the waves just thumbin’ through my braids (alright)/ Heatin’ up, baby, I’m just heatin’ up (it’s lit),” he rapped in the NSFW hit. “Need ya love, not a need it is a must/ Feelin’ stuck, you know how to keep me up.” And it looks like the song even inspired their baby’s nursery room!\n\n(Photo Credit: YouTube)\n\nBack in June, Life & Style reported that Kylie and Travis may have made their relationship even more permanent by getting married in a super secret ceremony. “Kylie and Travis tied the knot at her Calabasas mansion,” a source revealed. “It wasn’t a big, glamorous affair like other Kardashian weddings, and only a few close friends were invited. But Kylie is crazy about Travis.”\n\nThe insider continued, “There were no official E! cameras there, but Kylie asked her friends to film the special moment on their iPhones. She plans to use the footage on her new show.”\n\nAs expected, her ex-boyfriend Tyga was not thrilled. “Tyga will be upset,” an insider said of the 27-year-old, who dated the lip kit mogul for almost three years. “But he won’t necessarily be surprised. He felt Kylie was so immature. The two of them together were just nothing but fighting and drama all the time.”\n\nTo see what other changes Kylie has made to her body, check out the gallery below!", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs=", "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-hips.jpg?fit=200%2C200", "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-butt.jpg?fit=200%2C200", "https://www.lifeandstylemag.com/wp-content/uploads/2018/02/kylie-jenner-butterflies-baby-nursery.png?w=1180&h=547&crop=1", "https://www.lifeandstylemag.com/wp-content/uploads/2019/05/LS2319_cover_ns4_View.jpg?w=300", "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-hips.jpg?resize=1000%2C630"], "top_img": "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-hips.jpg?resize=1000%2C630", "keywords": [], "authors": ["Life", "Style Magazine"], "canonical_link": "https://www.lifeandstylemag.com/posts/kylie-jenner-butterfly-tattoo-134542/", "title": "Kylie Jenner Is Afraid of Butterflies, But Has a Tattoo of One", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Having a baby definitely changes you! Now that Kylie Jenner is a mom — she just announced that she gave birth to her first child with her baby daddy Travis Scott — she definitely had a completely d…", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Kylie Jenner Is Afraid of Butterflies, But Has a Tattoo of One", "description": "Having a baby definitely changes you! Now that Kylie Jenner is a mom — she just announced that she gave birth to her first child with her baby daddy Travis Scott — she definitely had a completely d…", "url": "https://www.lifeandstylemag.com/posts/kylie-jenner-butterfly-tattoo-134542/", "site_name": "Life & Style", "updated_time": "2018-02-05T01:18:18+00:00", "image": {"identifier": "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-hips.jpg?resize=1000%2C630", "secure_url": "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-hips.jpg?resize=1000%2C630", "width": 1000, "height": 630}}, "article": {"tag": "Travis Scott", "section": "Pics", "published_time": "2018-02-05T01:03:00+00:00", "modified_time": "2018-02-05T01:18:18+00:00"}, "fb": {"app_id": 741277405933843, "admins": 593583017, "pages": 229184533343}, "twitter": {"card": "summary_large_image", "description": "Having a baby definitely changes you! Now that Kylie Jenner is a mom — she just announced that she gave birth to her first child with her baby daddy Travis Scott — she definitely had a completely d…", "title": "Travis Scott Proves He's \"Obsessed\" With @kyliejenner With Matching Butterfly Tattoo!", "image": "https://www.lifeandstylemag.com/wp-content/uploads/2017/09/kylie-jenner-hips.jpg?resize=1000%2C630"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1517792580.0, "source": "http://www.lifeandstylemag.com", "summary": ""}