{"url": "www.bustle.com/p/nick-jonas-priyanka-chopras-relationship-is-reportedly-instagram-official-fans-are-loving-it-photo-9563691", "text": "It turns out there may have been some truth to all the rumors about Nick Jonas and Priyanka Chopra's relationship. In a sweet Instagram story post on Friday, June 22, Nick Jonas and Priyanka Chopra went seemingly confirmed their relationship. Jonas posted the IG story video of Chopra, in which she walks toward the camera laughing, and the caption for it is simply: \"Her [heart-eyes emoji]. (Bustle reached out to Jonas and Chopra's reps for comment, but has not yet received a response.)\n\nAccording to a People report on Saturday, June 23, Jonas and Chopra have been spotted together in Mumbai, India, where Jonas was reportedly going to meet Chopra's mother, Madhu. The rumored couple appeared in photos together taken in India that were published by the publication. People cited an unnamed source, who said the relationship was \"getting serious\" and \"They're very happy.\" Earlier this month, The Daily Mail published photos on June 11 of the rumored couple attending his cousin Rachel Tamburelli’s wedding in Atlantic City, New Jersey.\n\nAdditionally, Chopra and Jonas were spotted together in May at a Los Angeles Dodgers baseball game and attending the Beauty and the Beast concert at the Hollywood Bowl in Los Angeles, according to Us Weekly. An eagle-eyed Twitter user even posted a video of the Chopra and Jonas at the game. Jonas and Copra were also spotted together dining at Toca Modera in the Los Angeles neighborhood West Hollywood in May, according to E! News. (Bustle reached out to reps for Chopra and Jonas for comment when the rumors first began circulating, but did not receive a response.)\n\nFan reaction to Chopra and Jonas' reportedly confirmed relationship involved a lot of excitement.\n\nFans are using lots of heart-eye emojis themselves.\n\nOne fan got all the nostalgic feels.\n\nEven one fan on Twitter is trying to figure out Chopra and Jonas' couple name.\n\nRumors of Jonas and Chopra's romance began circulating as far back as May 2017, when the duo attended the Met Gala together. In a 2017 appearance on Jimmy Kimmel Live, Kimmel asked Chopra if the Met Gala appearance together meant they were dating. Chopra explained to Kimmel, \"We were both wearing Ralph Lauren and we decided to go together. It was fun ... We were on the same table and we know each other, so we were like, 'Hey, you know what, let's go together.' And I was like 'OK, let's go together.' It ended up just working out.\"\n\nJimmy Kimmel Live on YouTube\n\nAs Chopra mentioned on Jimmy Kimmel Live, she and Jonas knew each other before attending the Met Gala. According to the Indo Asian News Service in December 2017, Jonas reportedly said in a statement in December 2017, \"[Chopra and I] met through a mutual friend, who she did Quantico with — this guy Graham — and we met up like, in New York the first time, and the same day I think we found out that we were both going to the Met Gala with Ralph Lauren.\" Graham could likely be Graham Rogers, who starred in Quantico with Chopra and the film Careful What You Wish For with Nick Jonas.\n\nJonas' also said in his statement to Indo Asian New Service that he would like to visit India one day. He said in the statement:\n\n\"I've never been (to India). But I'm dying to go and I have now heard from Priyanka, my new friend a lot about it. Just given me a lot of names of place to go if I go there ... \"And as strange as it sounds but we couldn't have planned it [the Met Gala]. We just had a great time. She's a lovely person and I'm dying now to go to India.\"\n\nAnd now, according to several news outlets, it looks like Jonas is visiting India with Chopra. Whether or not Jonas' sweet Instagram story is definitely confirming their relationship, it seems like Jonas and Chopra are having a great time together.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/6/23/13a1f921-3d7a-4b2f-a566-f24ceb4b3091-screenshot_20180623-082623_instagram.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/23/f9e3bc76-970d-499f-9ec3-c15630c17e69-getty-678060068.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/23/f9e3bc76-970d-499f-9ec3-c15630c17e69-getty-678060068.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/0301616f-a32f-413e-9fef-efe48242f292-getty-537759406.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/436a4d24-0503-4050-a54f-0367f1974937-getty-919969056.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/17/39520c21-3afd-488a-968d-c3a389c49a76-a22ba8ea-8478-485b-bd12-e0d831859033-getty-1205125763.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/6/23/f9e3bc76-970d-499f-9ec3-c15630c17e69-getty-678060068.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/nick-jonas-priyanka-chopras-relationship-is-reportedly-instagram-official-fans-are-loving-it-photo-9563691", "title": "Nick Jonas & Priyanka Chopra's Relationship Is Reportedly Instagram Official & Fans Are Loving It — PHOTO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/nick-jonas-priyanka-chopras-relationship-is-reportedly-instagram-official-fans-are-loving-it-photo-9563691", "type": "article", "title": "Nick Jonas & Priyanka Chopra Just Became Instagram Official & Fans Are LOSING It", "description": "It turns out there may have been some truth to all the rumors about Nick Jonas and Priyanka Chopra's relationship. In a sweet Instagram story post on Friday, June 22, Nick Jonas and Priyanka Chopra went seemingly confirmed their relationship. Jonas…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/6/23/f9e3bc76-970d-499f-9ec3-c15630c17e69-getty-678060068.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "It turns out there may have been some truth to all the rumors about Nick Jonas and Priyanka Chopra's relationship. In a sweet Instagram story post on Friday, June 22, Nick Jonas and Priyanka Chopra went seemingly confirmed their relationship. Jonas…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}