{"url": "http://uk.businessinsider.com/kylie-jenner-weight-gain-pregnancy-2018-3", "text": "Kylie Jenner gave birth to her first child, daughter Stormi, in early February.\n\nWhile answering fan questions on Twitter, Jenner revealed that she gained 40 pounds during pregnancy. She quickly deleted the tweet.\n\nAccording to gynecologist Dr. Kecia Gaither, 40 pounds is at the high end of a healthy weight gain for underweight pregnant women.\n\nJenner also revealed her biggest pregnancy cravings, including Eggo waffles and sushi.\n\n\n\nIt's no secret that Kylie Jenner often posts photos of herself on social media. But since the news of her first pregnancy broke, the 20-year-old has been notoriously selective with sharing photos of herself, likely due to her desire to keep the pregnancy private.\n\nJenner is now slowly opening up about her experience. During a recent Q&A session with fans on Twitter, the makeup mogul revealed that she gained 40 pounds while carrying her daughter, Stormi. She quickly deleted the tweet.\n\nThe face-palm emoji was a nice touch. @kyliejenner/Twitter\n\nJenner was previously seen discussing her weight in her viral pregnancy announcement video, in which her doctor seemed to advise 28-35 pounds as an average total weight gain, noting that Jenner had gained 20 pounds at that time.\n\n\"Yeah, so, eight more pounds,\" the reality star replies.\n\nJenner's doctor also advised her to engage in more cardio. Kylie Jenner/YouTube\n\nRecommended weight gain for pregnant women is based on each person's body and individual needs.\n\nThe average amount of weight a woman should gain during pregnancy ranges from 25 to 40 pounds, according to gynecologist Dr. Kecia Gaither.\n\n\"The question of weight gain in pregnancy is often a point of controversy,\" Gaither told INSIDER. \"But in general, health providers advise weight gain based on the patient's body weight at the start of pregnancy.\"\n\nGenerally speaking, Gaither said most women will fall into one of these pre-pregnancy weight categories and will be advised to gain weight according to their body:\n\nUnderweight: 28 to 40 pounds\n\nNormal weight: 25 to 35 pounds\n\nOverweight: 15 to 20 pounds\n\nObese: 10 to 15 pounds\n\nOnly around one-third of pregnant women (32%) gain weight within those recommended guidelines, according to the Center for Disease Control, which noted that recent studies found that 21% had gained too little weight, and 48% had gained too much.\n\nWhile Jenner's 40-pound weight gain is technically within those general parameters, fan reactions ranged from awe to disbelief.\n\nAlthough Jenner's sister Kim Kardashian West was very open about (and cruelly mocked for) her struggles with weight gain during pregnancy, the Kylie Cosmetics creator largely shielded her pregnant body from the public eye.\n\nJust over a month after giving birth, however, the new mom has been posting social media updates where she shows off her stomach. Of course, they sparked a response on social media.\n\nAlthough Jenner has not commented on her post-pregnancy diet or workout routine, according to What to Expect, if a woman gains at least 35 pounds during pregnancy, it generally takes between 10 months and two years to return to her previous weight.\n\nIf Jenner did lose 40 pounds in one month, two experts said that could be unsafe — or even impossible.\n\n\"Losing more than 10% of your initial body weight in one month is likely not a good idea,\" Dr. Caroline Apovian, director of the Nutrition and Weight Management Center at Boston Medical Center, told INSIDER.\n\nAlthough health recommendations always vary based on each person's body, Apovian said that \"average safe weight loss\" is generally considered to be one to two pounds per month.\n\nDietitian Andy Bellatti told INSIDER that barring special circumstances, like bariatric surgery, losing more than 10 pounds in a month would give him pause — and that 40 pounds would likely be impossible.\n\n\"Even with pregnancy, you could see 40 pounds lost, but that would be two or three months after birth,\" Bellatti told INSIDER.\n\nIt's important to keep in mind, however, that it's unclear exactly how much weight Jenner has lost.\n\nBefore & after having a baby looking better than ever! A post shared by Kylie Jenner (@kyliesnapchat) on Mar 3, 2018 at 7:43am PST Mar 3, 2018 at 7:43am PST\n\nAdditionally, depending on the size of the baby and the weight of the woman's amniotic fluid and placenta (which are delivered at birth), most pregnant women can lose up to 12 pounds during delivery, according to What to Expect.\n\nSome fans did jump to Jenner's defense. One pointed out the difference between losing weight and losing baby weight. After all, Jenner did not gain 40 pounds of pure fat — she had a little human growing inside of her.\n\nFor her part, Jenner described her pregnancy as \" a perfect experience.\"\n\nIn fact, she revealed that the toughest part was not being able to eat sushi. She told another fan that her biggest craving during her pregnancy were Eggo waffles.\n\n\"I never liked them before I was pregnant and haven't had one since I had her… So strange!\" Jenner wrote.\n\nJenner had previously revealed her undying love for In-N-Out burgers — which she chose to eat against her doctor's orders. When a fan pointed this out, the \"Life of Kylie\" star added donuts to her list of indulgences.\n\nWe're glad Jenner is feeling more comfortable opening up to her fans — and we hope for more honest discussions about pregnancy and motherhood in the future.\n\nSign up here to get INSIDER's favorite stories straight to your inbox.", "images": ["https://i.insider.com/5aa6d8747708e95bd17fbd80?width=600&format=jpeg&auto=webp", "https://i.insider.com/59c91cc8ba785e5caa6cee4b?width=1200&format=jpeg", "https://i.insider.com/5aa6d8747708e95bd17fbd80?width=24&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "http://uk.businessinsider.com/kylie-jenner-weight-gain-pregnancy-2018-3?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5aa6d8747708e95bd17fbd81?width=600&format=jpeg&auto=webp", "https://static.businessinsider.com/image/5cf6b11111e205471c5718a4", "https://i.insider.com/5a7b20d0ec1ade0b9813cf8a?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/59c91cc8ba785e5caa6cee4b?width=1200&format=jpeg", "keywords": [], "authors": ["Callie Ahlgrim"], "canonical_link": "https://www.insider.com/kylie-jenner-weight-gain-pregnancy-2018-3", "title": "Kylie Jenner reveals how much weight she gained during pregnancy — and then quickly deletes the tweet", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Kylie Jenner reveals how much weight she gained during pregnancy — and then quickly deletes the tweet", "date": "2018-03-12", "news_keywords": "Kylie Jenner, Weight Gain, Pregnancy, Kardashians, Motherhood, Health, Wellness, Culture, Callie Ahlgrim", "description": "While answering fan questions on Twitter, Jenner revealed that she gained 40 pounds during pregnancy.", "author": "Callie Ahlgrim", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Insider", "og": {"title": "Kylie Jenner reveals how much weight she gained during pregnancy — and then quickly deletes the tweet", "description": "While answering fan questions on Twitter, Jenner revealed that she gained 40 pounds during pregnancy.", "type": "article", "url": "https://www.businessinsider.com/kylie-jenner-weight-gain-pregnancy-2018-3", "image": "https://i.insider.com/59c91cc8ba785e5caa6cee4b?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Kylie Jenner reveals how much weight she gained during pregnancy — and then quickly deletes the tweet", "sailthru.date": "2018-03-12", "sailthru.tags": "Kylie Jenner, Weight Gain, Pregnancy, Kardashians, Motherhood, Health, Wellness, Culture, Callie Ahlgrim", "sailthru.description": "While answering fan questions on Twitter, Jenner revealed that she gained 40 pounds during pregnancy.", "sailthru.author": "Callie Ahlgrim", "sailthru.verticals": "insider", "sailthru.image.full": "https://i.insider.com/5aa6d8747708e95bd17fbd7f?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5aa6d8747708e95bd17fbd7f?width=160&format=jpeg", "twitter": {"card": "summary_large_image"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "variant", "pfi-wider-content": "variant", "back-to-top": "variant", "sticky-section-titles": "control", "post-breadcrumbs": "control", "tabbed-homepage": "control", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5aa6d8757708e95bd17fbd82", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1520784000.0, "source": "http://uk.businessinsider.com", "summary": ""}