{"url": "www.vulture.com/2017/11/which-lines-on-taylor-swifts-album-diss-kanye-and-kim.html", "text": "Look what they made her do. Photo: Jamie McCarthy/Getty Images\n\nThe moment that makes Taylor Swift’s new album comes roughly two minutes and 30 seconds into “This Is Why We Can’t Have Nice Things,” the third to last song. She’s claiming to find reconciliation with her greatest foe Kanye West and extend an olive branch, when — psych! — she interrupts her own attempt at forgiveness to immediately rescind the offer. Taylor cackles with a confession: It’s all bullshit. “I can’t even say it with a straight face,” she says, cracking herself up. This is what you’ve been waiting for — finally, Swift has dropped the act. It’s her very own “sorry not sorry” bundled in a song that doubles as her harshest critique of Kanye West and Kim Kardashian yet. “Look What You Made Me Do” was the warm-up; the rest of the album is a fast ball down the middle. Here are the songs and lines most definitely, unmistakably meant for Kanye and Kim.\n\n“This Is Why We Can’t Have Nice Things”\n\nThere are lines on other songs that speak more broadly to Taylor’s perceived victimization by Kanye, but “TIWWCHNT” turns the tables on her enemy. Here, she’s the attacker. To begin, she sets the scene and rewinds the clock back to the simpler times of last July. Back when she was “throwing nice big parties,” “jumping to the pool from the balcony,” and enjoying an embarrassment of riches that come with being a pop star so titanic that she seemed untouchable. “Feeling so Gatbsy for that whole year,” she reminiscences about what was meant to be her hiatus. She’s referring specifically to her 2016 Fourth of July party, the last time the court of public opinion largely ruled in her favor.\n\nWeeks later, the party was over when Kardashian exposed Swift on Snapchat for having lied about not approving controversial lyrics about her on Kanye’s song “Famous.” (The one where he calls Tayor a “bitch” and half-jokes that they “might still have sex.”) Swift has been playing defense ever since and resents it: “So why’d you have to rain on my whole parade?” she sings.\n\n“It was so nice being friends again / There I was giving you a second chance / But then you stabbed my back while shaking my hand / And therein lies the issue / Friends don’t try to trick you / Get you on the phone and mind-twist you / And so I took an ax to a mended fence.”\n\nThe history of Swift and Kanye’s feud goes back nearly a decade, when Kanye interrupted her speech at the 2009 VMAs. It was contentious for years, but they eventually made amends and Taylor presented him with the MTV Video Vanguard Award at the 2015 VMAs. It’s the “second chance” Taylor refers to. But she concludes that Kanye deceived her when he recorded her without her knowledge in the soundbite heard around the world during their chat about “Famous.” The gloves are off.\n\n“But I’m not the only friend you’ve lost lately / If only you weren’t so shady.”\n\nIt’s a low blow, but boy is it good. Swift goes on to take a potshot at Kanye about the dissolution of his friendship with Jay-Z, alluding to the fact that Hov cut him out of his life after Kanye said some shady things about Beyoncé. (Jay-Z confirmed his bad blood with Kanye on 4:44 earlier this year).\n\n“Here’s a toast to my real friends / They don’t care about that he said, she said / And here’s to my baby / He ain’t reading what they call me lately / And here’s to my momma / Had to listen to all this drama / And here’s to you / ’Cause forgiveness is a nice thing to do / Haha, I can’t even say it with a straight face.”\n\nBut of all Taylor’s digs at Kanye, her subtlest is her best. She makes a play on Kanye’s “Runaway” — “let’s have a toast for the douchebags” — and twists his words to praise the only people still standing in her corner through it all: her mom, her man, and her mates. And when she breaks in the middle of trying to praise Kanye. That’s just what he made her do.\n\n“I Did Something Bad”\n\nAt the top of the album, Swift is at her most vindictive. “I Did Something Bad” is a “LWYMMD” sequel and it’s also where you’ll find the best line of the album:\n\n“If a man talks shit, then I owe him nothing.”\n\nTaylor builds to the line by first mentioning a narcissist who loves her and tells her more lies than she tells him. “This is how the world works / Now all he thinks about is me,” she sings, implying that’s just industry politics. Kanye West, of course, has long been crowned music’s biggest narcissist. She follows that rare expletive-laced missive with “I don’t regret it one bit, ’cause he had it coming.” Taylor’s setting the stage for her own reenactment of Chicago. Both lines and others on this song could be interpreted about a number of men she feels have done her wrong — Kanye, Calvin Harris, Tom Hiddleston — but it’s the breakdown that lets you know that she’s most perturbed about Kanye.\n\n“They’re burning all the witches, even if you aren’t one / They got their pitchforks and proof / Their receipts and reasons / They’re burning all the witches, even if you aren’t one / So light me up.”\n\nThis whole section is sung in Auto-Tune, Kanye’s much-loved creative device. But Auto-Tune has never really been Taylor’s thing, making her use of it here all the more calculated. “They’re burning all the witches” appeared as an Easter egg in her “…Ready for It?” video; it’s her way of owning the villainous image she’s been branded with since Kanye and Kim tarnished her reputation. They’ve burned her with their “receipts” (namely Kim’s Snapchat), but she’s happy to go up in flames. In fact, with this song, she’s lighting the match. As her chorus makes crystal clear, she’s still not sorry: “They say I did something bad / But why’s it feel so good? / Most fun I ever had / And I’d do it over and over and over again if I could.”\n\n“End Game”\n\nThe subject of this song is vaguer than the previous two, but that doesn’t mean she doesn’t still get in a couple well-played digs at Kanye:\n\n“I hit you like bang / We tried to forget it, but we just couldn’t / And I bury hatchets, but I keep maps of where I put ‘em / Reputation precedes me, they told you I’m crazy / I swear I don’t love the drama, it loves me.”\n\n“You’ve been calling my bluff on all my usual tricks / So here’s a truth from my red lips.”\n\nHer last laugh: She raps the whole thing.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2017/11/09/09-kim-kardashian-kanye-west.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/11/09/09-kim-kardashian-kanye-west.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/09/09-kim-kardashian-kanye-west.w1200.h630.jpg", "keywords": [], "authors": ["Dee Lockett"], "canonical_link": "https://www.vulture.com/2017/11/which-lines-on-taylor-swifts-album-diss-kanye-and-kim.html", "title": "The Songs on Taylor Swift’s Album That Definitely Diss Kanye and Kim", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Songs on Taylor Swift’s Album That Definitely Diss Kanye and Kim", "url": "https://www.vulture.com/2017/11/which-lines-on-taylor-swifts-album-diss-kanye-and-kim.html", "description": "“Friends don’t try to trick you / Get you on the phone and mind-twist you / And so I took an ax to a mended fence.”", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/09/09-kim-kardashian-kanye-west.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Which Lines on Taylor Swift’s Album Diss Kanye and Kim?", "description": "“Friends don’t try to trick you / Get you on the phone and mind-twist you / And so I took an ax to a mended fence.”", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/09/09-kim-kardashian-kanye-west.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-11-09T18:30:59.387-05:00", "tag": "taylor swift, kanye west, kim kardashian, reputation, music, where's the beef?, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "Every line on Taylor Swift’s Reputation about Kanye West, Kim Kardashian, and the “Famous” scandal. .", "sailthru.tags": "taylor swift, kanye west, kim kardashian, reputation, music, where's the beef?, vulture homepage lede", "author": "Dee Lockett", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1510270259.387, "source": "http://www.vulture.com", "summary": ""}