{"url": "https://www.trashtalktv.com/07/20/the-bachelorette-recap-hometown-heartbreak/413992/", "text": "Hi, Trashies! It’s hometowns week which means we get to see the people who will be most embarrassed by the contestants’ appearances on this show! Shall we get right to it?\n\nFirst up, Rachel travels to Baltimore to meet Eric’s family. Eric is super creepy and purrs at Rachel, but she doesn’t seem to mind. Then some guy shows up for a few minutes to talk about Rachel before he disappears.\n\nMore screen time than Adam and Matt combined.\n\nI can’t pay too much attention to this conversation because I’m distracted by how good Eric looks with just a little bit of facial hair.\n\nMore of this Eric, please!\n\nWith that, Rachel becomes the first woman that Eric has ever brought home and his family is just straight up delightful! Seriously, I want to hang out with them always – especially his Aunt Verna.\n\nVERNA FOR BACHELORETTE!!!\n\nWhen Rachel talks to Verna, they discuss how Rachel is being judged by the black community as well as by the white community in this situation. Eric’s conversation with his mom seems super scripted, but that’s not really that surprising based on what he’s told us about their relationship. Rachel talks to Eric’s mom next and it’s just a lot of complimentary stuff about Eric. Honestly, the more I watch this date, the more I like Eric. I was iffy about him in the beginning, but I’ve grown to really love him. Why couldn’t we have seen this Eric the whole time?\n\nHere’s to you, Eric!\n\nOf course, this ends with Eric saying “I love you” because we’re at that point in the season. Ugh, but then he ruins it by purring at Rachel again. Never mind. I hate Eric again.\n\nEw. We have to hang out with Bryan and he quotes Will Smith at her.\n\nYou’re not that cool, Bryan.\n\nThey go to Domino Park and this is when I realize that Bryan is winning this thing. The big tell is the effortless way that Rachel just calls him “baby.” That’s what I remember about Andi’s season – she only gave a pet name to Josh.\n\nI can’t not point out that Bryan’s shirt is hideous.\n\nAfter all that, it’s time to meet the infamous mother that broke up Bryan’s last relationship.\n\nAw. Bryan and his mom got matching cheek implants\n\nBryan’s mom is just as terrifying as you’d imagine. I’m not sure why his family think it’s not possible to be threatened by his relationship with his mother. She seems like she has boundaries issues. If a guy’s mother straight up says, “If he’s not happy, I’ll kill you” you bet your ass I’m going to run screaming in the other direction. This date is a whole bunch of nothing and Bryan gives the obligatory “I love you.” Awesome. Let’s move on to something more interesting.\n\nOh, thank God that’s over. Rachel is off to Madison, Wisconsin to meet Peter’s family. They start the day by walking around the farmer’s market while we continue his “guy who has doubts” edit. After that, Rachel and Peter head to a bar where they meet his friends and they talk about Peter having a lot of black friends.\n\nNope. Totally not an awkward conversation.\n\nPeter spends a little time with just his guy friends and he expresses his doubt again, This totally has to be the “next Bachelor” edit, right? There’s always this type of edit for the next lead. It just makes me laugh that he keeps saying that he doesn’t like to move fast with relationships. Does he realize what show he came on? Peter is so pretty, but kind of dumb.\n\nSo, let’s move on to meet the parents!\n\nPeter’s mom has “can I speak to your manager” hair.\n\nThe whole date revolves around how great Peter is with his niece and nephew and how he has his walls up. This goes right along with Rachel wanting and engagement at the end of it all but wondering if Peter is ready. *Yawn.* Unfortunately, Peter doesn’t give Rachel the “I love you” she wants and I think, for the first time all season, Peter is in danger of going home.\n\nOh, and now it’s time for the main event – Dean’s hometown date. I start off a little bit annoyed at Rachel and her constantly questioning why Dean hasn’t reach out to his father to fix their relationship. Look, I’m very lucky when it comes to my family life. I have a wonderful relationship with my parents. However, I have some friends who aren’t quite as lucky. While I’ll never understand how they feel, I know that the parent-child relationship can be complicated. I don’t think Rachel’s questioning came from a place of trying to pressure Dean, just a place of ignorance. I don’t think she can wrap her head around his life because it’s so far from her own experience. Granted, I think a lot of the questioning came from producers. I can easily imagine them telling her something like, “He just needs a little encouragement to talk to his father!”\n\nAt least there are ATVs, so there’s that.\n\nThe meeting with Dean’s father and stepmother just makes me angry at ABC. I really think that this was neither the time nor place for Dean to confront his dad for the first time in two years. I also feel a little bit bad for Dean’s father. My guess is he thought this was going to just be a generally meeting of the girlfriend and then Dean (likely giving into pressure from the producers) sprung an impromptu therapy session on him. Now, I’m not saying that Dean’s dad is completely blameless when it comes to their strained relationship. The two of them clearly have a lot to work on if they want to be in each other’s lives again. However, I just think that this show exploited a very complicated and painful situation for the sake of ratings Between Racist E. Lee earlier in the season and this, I’m completely over the ABC producers and the BS they’ve pulled.\n\nOh, and Dean, of course, tells Rachel he’s falling in love with her.\n\nAnd, holy shit! Rachel says she’s falling in love with him too!\n\nAnd now we move into the rose ceremony. The top three are…\n\nBryan\n\nEric\n\nPeter\n\nDean’s exit is pretty cold. I completely understand that he’s pissed that Rachel dumped him right after saying she was falling in love with him. While that was a crappy thing to do, I have to remember that 1.) there’s never a good time to dump someone and 2.) my guess is Rachel was trying to just comfort Dean in that moment so she said the most caring thing she could think of.\n\nI’m kind of saddened by all of the hate Rachel has been getting after this episode. I see all these comments about how it was wrong of her to send Dean home after such a devastating hometown date. Seriously? So, Rachel should keep Dean around because she feels bad for him? That’s kind of a shitty thing to do. My guess is that Dean was always going to be the next to go home. Unfortunately, it just happened at this point. As most past leads have said, they knew their final pick pretty early on in the season. At this point, very little is going to change that. It was never going to be Dean as the last one standing.\n\nThis happens every season – the audience starts to turn on the lead. People were pissed that Chris dumped Jade after learning about her Playboy past. Kaitlyn got a lot of shit for not dumping Nick before he picked out a ring. JoJo was hated for sending Chase home immediately after he said “I love you” during the fantasy suite date. Even Ben – this franchise’s golden boy – got a lot of hate for sending Amanda home immediately after meeting her kids. This is all just par for the course – each season there is a fan favorite who gets dumped and the audience gets pissed off and starts sending hate filled and threatening comments to the lead on social media. Besides, if the rumors I’m hearing about Paradise are to be believe, then Dean is definitely over it.\n\nSo, that’s it, Trashies! We’re so close to the end! At least this season is somewhat interesting compared to the last few snoozefests we’ve had.\n\nUntil next time, Trashies!\n\nWant more TrashTalk? Follow us on Twitter for updates of recaps as they publish, like us on Facebook for a daily update, watch our TV parody vids on YouTube, or for funny TV pics, heart us on Instagram, and get find the occasional gif on Tumblr!", "images": ["https://media.giphy.com/media/3o85xz5KCMBmP4XWRW/giphy.gif", "https://www.trashtalktv.com/wp-content/uploads/2017/07/ATVs.jpg", "https://www.trashtalktv.com/wp-content/uploads/2018/07/not-a-good-sign.jpg", "https://www.trashtalktv.com/wp-content/uploads/2017/07/implants.jpg", "https://www.trashtalktv.com/wp-content/uploads/2017/07/damn.jpg", "https://www.trashtalktv.com/wp-content/uploads/2017/07/manager.jpg", "https://www.trashtalktv.com/wp-content/uploads/2018/08/Gary.jpg", "https://www.trashtalktv.com/wp-content/uploads/2018/08/Wills.jpg", "https://www.trashtalktv.com/wp-content/uploads/2016/04/tttv_icon_icon.png", "https://www.trashtalktv.com/wp-content/uploads/2017/07/hideous.jpg", "https://www.trashtalktv.com/wp-content/uploads/2017/07/verna.jpg", "https://www.trashtalktv.com/wp-content/uploads/2014/01/PopePhilly_avatar_1389296899-96x96.jpg", "https://www.trashtalktv.com/wp-content/uploads/2016/02/TTTV-New-Color-Logo.gif", "https://www.trashtalktv.com/wp-content/uploads/2017/07/heres-to-Eric.jpg", "https://www.trashtalktv.com/wp-content/uploads/2017/07/embarrassing.jpg", "https://www.google.com/images/poweredby_transparent/poweredby_FFFFFF.gif", "https://www.trashtalktv.com/wp-content/uploads/2017/07/love.jpg", "https://www.trashtalktv.com/wp-content/uploads/2017/07/Hey-guy.jpg"], "top_img": "https://www.trashtalktv.com/wp-content/uploads/2016/04/tttv_icon_icon.png", "keywords": [], "authors": [], "canonical_link": "https://www.trashtalktv.com/07/20/the-bachelorette-recap-hometown-heartbreak/413992/", "title": "The Bachelorette Recap: Hometown Heartbreak – TrashTalkTV", "meta_data": {"themify-framework-css": "themify-framework-css", "generator": "WordPress 4.9.13", "viewport": "width=device-width, initial-scale=1", "msapplication-TileImage": "https://www.trashtalktv.com/wp-content/uploads/2015/10/cropped-TTTV-LOGO-2015-Large-sqh-300x300.gif"}, "movies": [], "publish_date": null, "source": "https://www.trashtalktv.com", "summary": ""}