{"url": "https://web.archive.org/web/20040611074627/http://en.wikipedia.org:80/wiki/Tim_McGraw", "text": "From Wikipedia, the free encyclopedia.\n\nServer will be down for maintenance on 2004-06-11 from about 18:00 to 18:30 UTC.\n\nTim McGraw (born May 1, 1967) is a popular male singer in country music, having achieved many number one singles on the country charts, six multi-platinum albums and sales of over 25 million albums. He is married to popular female country singer Faith Hill. He was born in Delhi, Louisiana. His mother was a waitress called Betty Trimble and his father was Tug McGraw, a famous relief pitcher for the New York Mets and the Philadelphia Phillies.\n\nEarly career\n\nTug McGraw had a brief affair with Tim's mother, and he was originally named Stanley Tim McGraw. Trimble raised Tim in Start, Louisiana, near Monroe. He didn't discover that McGraw was his father until he was 11. As a child, he was torn between a career in music and a career in athletics. While attending Northwestern State University, he was drawn to a musical career and started playing in clubs around Louisiana. Dropping out of university in 1989, he left for Nashville and played in clubs in that city hoping to be discovered.\n\nHe signed with Curb Records in 1990 but it wasn't until 1992 that he had his first minor hit \"Welcome to the Club\" off his self-titled debut album which failed to make much of a dent on the charts. He achieved a couple of minor hits, \"Memory Lane\" and \"Two Steppin Mind\", off the same album in 1993.\n\nSuccess\n\nThe second album Not a Moment Too Soon went on to become the best selling country album in 1994. The first single written by John D. Loudermilk called \"Indian Outlaw' caused considerable controversy as critics argued that it presented native Americans in a patronising way. As a result of the controversy, some radio stations refused to play it. The controversy helped spur sales and the song became McGraw's first top ten country single and reached top 20 on the pop charts.\n\nThe second track \"Don't Take the Girl\", a ballad, reached the top of the country charts as did the title track in 1995. \"Down on the Farm\" reached number two and \"Refried Dreams\" reached the top 5. The album sold over 5 million copies, topping the Billboard 200 as well as the country album charts. He won Academy of Country Music awards for album of the year and top new male vocalist in 1994.\n\nContinued success and home life\n\nAll I Want released in 1995 continued his run of success debuting at number one on the country charts. The album sold over two million copies and reached top 5 on the Billboard 200. \"I Like It, I Love It\" reached number one on the country charts as the leadoff single while \"She Never Lets It Go to Her Heart\" also went to number one in 1996. \"Can't Really Be Gone\" reached number two and \"All I Want is a Life\" and \"Maybe We Should Just Sleep On It\" reaching top 5.\n\nIn 1996, Tim McGraw toured the US on the “Spontaneous Combustion” tour, which was the most successful country tour of that year. Faith Hill was his support act and the title of the tour turned out to be prophetic as the singers married late in the year. The couple have had three daughters – Gracie Katherine born May 5, 1997, Maggie Elizabeth born August 12, 1998 and Audrey Caroline born December 6, 2001.\n\nHis happy family life is in contrast with his father who had a reputation as a hell raiser. Tug McGraw once famously said: \"Ninety percent I'll spend on good times, women, and Irish Whiskey. The other ten percent I'll probably waste.\"\n\nTim McGraw also produced the debut album by Jo-Dee Messina with long-time associate Byron Gallimore. He has co-produced all three of her albums with Gallimore.\n\nKing and Queen of country\n\nEverywhere continued his golden run topping the country charts and reaching number two on the album charts in 1997. The album sold 4 million copies. The first single \"It’s Your Love\", a duet with Faith Hill, reached number one on the country charts, reached the top ten in the pop charts and became the most played single in the history of the Billboard country charts. Three more singles \"Everywhere\", \"Where the Green Grass Grows\" and \"Just to See You Smile\" reached the top of the country charts from the album. \"Just to See You Smile\" set a new record spending 42 weeks on the Billboard charts. The Country Music Association awarded Everywhere as its album of the year for 1997.\n\nA Place in the Sun in 1999 was another huge hit topping the US pop and country album charts and selling three million albums. It featured another four chart topping singles on the country charts including \"Please Remember Me\" with Patty Loveless “Something Like That”, “My Best Friend\" and \"My Next Thirty Years\". By 1999, he had taken over from Garth Brooks as the most popular singer in country music.\n\nFaith Hill's career was also going well. Another duet between the pair \"Just to Hear You Say You Love Me\" reached the top five of the US country charts. Faith reached number 7 on the Billboard 200 with lead single \"This Kiss\" reaching number 7 on the Billboard Hot 100 pop charts and also making the pop charts in other countries including Australia and Canada. Faith also made number 11 on the Canadian album charts. Her follow up album Breathe consolidated her success reaching number one on the Billboard 200 upon release on November 21, 1999 with the title track reaching number 2 on the Billboard Hot 100. The Way you Love Me also reached number 7. The album also featured another duet between the couple called \"Let's Make Love\" which won a Grammy in 2000 for Best Country Vocal Collaboration. By the end of 1999, Tim McGraw was the most popular country male singer and Faith Hill was one of the most popular singers along with Shania Twain.\n\nDuring summer 1999, Tim McGraw toured the US with the Dixie Chicks as the support artist as well as appearing as the headline artist at the George Strait Country Music Festival. In 2000, he released a \"Greatest Hits\" album which again topped the charts spending nine weeks on top of the country charts. He and his tour support artist Kenny Chesney got involved in a scuffle with police officers when Chesney attempted to ride one of their horses - Tim McGraw was later cleared of the charges.\n\nIn the latter half of 2000, he and Hill went out on the \"Soul 2 Soul 2000\" tour playing to sellout crowds in 64 venues including Madison Square Gardens. It was one of the top tours of any genre in the US and the leading country tour during 2000.\n\nSet This Circus Down was released in 2001 featuring four number one country hits - \"Grown Men Don't Cry\", \"Angry All the Time\", \"The Cowboy in Me\" and \"Unbroken\". A duet with Jo-Dee Messina \"Bring on the Rain\" also topped the country charts. \"Things Change\" made the history as the first country song to chart from a downloaded version following his performance of the song at the CMA Awards Show.\n\nTim McGraw and the Dancehall Doctors\n\nIn 2002, Tim McGraw bucked country music traditions by recording his album Tim McGraw and the Dancehall Doctors with his tour band the Dancehall Doctors in the Catskill Mountains. Unlike rock music where it is commonplace for touring bands such as the E Street Band or Crazy Horse to play on albums with the artist they support, country albums are normally recorded with session musicians.\n\nTim McGraw states on his web site that he felt he owed it to the musicians who had been an integral part of his success. \"My previous albums were done in pretty much the Nashville way—the session guys came in and laid down their tracks and then I sang. I'm proud of all of those records, but I wanted to capture some of the feel and groove that I loved in my favorite records when I was growing up. It's almost unheard of for a country artist to record with his road band, but my guys have been with me for a long time, and they're an important part of what I do. And it was time to get that on a record.\"\n\nAll of the Dancehall Doctors had been with Tim McGraw since at least 1996. They include:\n\nTim McGraw and the Dance Hall Doctors was released on November 26, 2002 reached number 2 on the country charts with \"Real Good Man\" reaching number one. \"She's My Type of Rain\" reached number 2 in 2003 and \"Red Rag Top\" reached the top 5. The album also features a faithful cover version of \"Tiny Dancer\" by Elton John off the Madman across the Water album. The artist also features appearances by Kim Carnes on \"Comfort Me\" - a response to the September 11, 2001 attacks - and Don Henley and Timothy B. Schmit of the Eagles on \"Illegal\".\n\nDiscography\n\nTim McGraw (album) (1993)\n\nNot a Moment Too Soon (1994)\n\nAll I Want (1995)\n\nEverywhere (1997)\n\nPlace in the Sun (1999)\n\nGreatest Hits (Tim McGraw) (2000)\n\nSet this Circus Down (2001)\n\nTim McGraw and the Dancehall Doctors (2002)\n\nFurther reading\n\nTim McGraw: Tim McGraw and the Dancehall Doctors - This is Ours, Atria Books, 2002 (ISBN 074346706X).\n\nExternal links", "images": ["https://web.archive.org/web/20040611074627im_/http://en.wikipedia.org/style/images/poweredby_mediawiki_88x31.png", "https://web.archive.org/web/20040611074627im_/http://en.wikipedia.org/favicon.ico", "https://web.archive.org/web/20040611074627im_/http://en.wikipedia.org/style/images/gnu-fdl.png"], "top_img": "https://web.archive.org/web/20040611074627im_/http://en.wikipedia.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Wikipedia, the free encyclopedia", "meta_data": {"KEYWORDS": "Tim McGraw", "robots": "index,follow"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}