{"url": "www.yourtango.com/2018315344/is-kylie-jenner-pregnant-again-with-baby-two-new-details-shes-expecting-again-with-travis-scott", "text": "Stormi may have a sibling on the way.\n\nIs Kylie Jenner pregnant again with baby #2? Already? Rumors say yes. There's been rampant speculation that the reality star And Forbes' youngest almost-billionaire and her beau Travis Scott are expecting a second child. Even though its only been a few months since Kylie and Travis' first daughter, Stormi, was born it's very possible that she could be pregnant.\n\nWe, of course, may not know for awhile as she didn't officially confirm her last pregnancy until three days after she gave birth.\n\nHere is what we know so far about the Kylie pregnancy rumors:\n\n1. A source said they were trying for another baby while on vacation.\n\nA post shared by Kylie (@kyliejenner) on May 1, 2018 at 11:12am PDT\n\nKylie and Travis went on vacation to Turks and Caicos to celebrate Travis' birthday. While there, they were reportedly doing more than just celebrating. \"Kylie and Travis have been having amazing baby-making sex while on vacation. Travis is totally turned on by Kylie now that she has bounced back from her pregnancy and has all of her insane curves again. Travis finds Kylie irresistible in her bikini and thinks she looks amazing,\" a source said.\n\n2. Kylie wants Stormi to have a sibling close in age.\n\nA post shared by Kendall + Kylie (@kendallandkylie) on Jul 17, 2018 at 7:17pm PDT\n\nThe new mom wants her daughter to have a sibling close in age like her and Kendall. \"Kylie wants her kids to be close in age like she is with Kendall. So they can grow up being best friends.\" Kendall is two years older than Kylie so they still have a bit more time.\n\n3. Kylie loves seeing Travis be a dad.\n\nA post shared by Kylie Jenner and Travis Scott (@kyandtravis) on Jul 17, 2018 at 10:45am PDT\n\nA source said, \"Nothing has been sexier to Kylie than to watch Travis become an amazing father to their daughter. Things between them have never been better.\"\n\n4. Kylie had a pregnancy scare.\n\nA month ago, Kylie reportedly had a pregnancy scare. A source close to Kylie told Hollywood Life the scare \"really freaked her out,\" but that \"Travis was super excited to have another kid right away. [Kylie] was totally upset over the idea of being pregnant again so quickly. She has been so relieved to get her body back after the last year, so she is not ready to go through it all again so soon after giving birth to Stormi,\" the source explains. \"Kylie thought that it must be some miracle for her to get pregnant again so soon after giving birth, but quickly realized it was only a false alarm.\"\n\n5. She's gotten pregnant quickly before.\n\nJust one month into her relationship with Travis Scott the young mogul found out she was expecting. She says this was because their relationship felt so natural and drama-free from the public eye. \"We had a lot of downtime. It was organic. And we would just go to these random cities. We got to not be who we really were. Like, if we were in LA, I feel like it would’ve been way different. Everything happened for a reason. We weren’t going out as ‘Kylie and Trav.’ We would just be in Cleveland, walking the street for hours. We would go on walks, and no one would bother us,\" Kyile said.\n\n6. She said she had the 'perfect' experience with her first pregnancy.\n\nA post shared by Stormi Jenner Webster (@stormijenner.w) on Jul 17, 2018 at 7:57pm PDT\n\nWhen asked what the worst part of her pregnancy was she had a surprising answer. “There really was no worst part! probably not being able to eat sushi lol,” the makeup mogul revealed. “I had such a perfect experience.” Sounds like she wouldn't mind being pregnant again.\n\n7. Travis and Kylie like to keep things private.\n\nA post shared by Kylie (@kyliejenner) on May 7, 2018 at 9:55pm PDT\n\nKylie has said, \"For sure, I know he [Travis] doesn't like the attention. That's why we just go the extra mile to keep our relationship super private, or like, if he has events or something, I won't come. Because I want him to do his own thing. I want him to be him. I don't want it to be Kylie and Trav. If people don't ever see us together, that's okay with me, because we just do our thing.\" So if she is, indeed, pregnant, we probably won't know until she's totally ready to share.\n\nMolly Given is a writer living in Philadelphia and lover of all things to do with mystery and magic in life. When she’s not writing her fingers off she can be found planning her next adventure in a new part of the world.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/image%20%2869%29.png?itok=YDECMe_F", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2869%29.png?itok=LBAvsR4-"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2869%29.png?itok=LBAvsR4-", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018315344/is-kylie-jenner-pregnant-again-with-baby-two-new-details-shes-expecting-again-with-travis-scott", "title": "Is Kylie Jenner Pregnant Again With Baby #2? New Rumors She's Expecting Again With Travis Scott", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "entertainment and news, Buzz", "article": {"author": "https://www.facebook.com/molly.given", "published_time": "2018-07-18T16:45:15", "modified_time": "2018-07-18T16:45:15"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018315344/is-kylie-jenner-pregnant-again-with-baby-two-new-details-shes-expecting-again-with-travis-scott", "title": "Is Kylie Jenner Pregnant Again With Baby #2? New Rumors She's Expecting Again With Travis Scott", "description": "Stormi may have a sibling on the way.", "updated_time": "2018-07-18T16:45:15", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2869%29.png?itok=LBAvsR4-", "width": 620, "height": 309}}, "description": "Is Kylie Jenner pregnant again with baby #2? Rumors are swirling the young reality star and almost--billionaire is pregnant with another baby with beau, Travis Scott. Here is what we know so far about these rumors Kylie Jenner's expecting again.", "abstract": "Is Kylie Jenner pregnant with baby #2? Already? There are rumors pointing to yes. A lot of speculation has been going around about the young", "robots": "follow, index, noodp, noydir", "news_keywords": "kylie jenner pregnant, kylie jenner pregnant again, kylie jenner baby, kylie jenner baby #2, kylie jenner having baby 2, kylie jenner second baby, is kylie jenner pregnant again, kylie jenner baby bump, kylie jenner preggo, kylie jenner preg, kylie jenner travis scott expecting again, kylie jenner preg again", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018315344/is-kylie-jenner-pregnant-again-with-baby-two-new-details-shes-expecting-again-with-travis-scott", "title": "Is Kylie Jenner Pregnant Again With Baby #2? New Rumors She's Expecting Again With Travis Scott", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/image%20%2869%29.png?itok=LBAvsR4-", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/ERQpQJPlOHw"], "publish_date": 1531903515.0, "source": "http://www.yourtango.com", "summary": ""}