{"url": "www.mercurynews.com/2018/04/12/khloe-kardashian-gives-birth-to-baby-girl-with-tristan-thompson-by-her-side/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nWhen Khloe Kardashian gave birth Thursday morning to her first child, the baby’s father, Tristan Thompson, was there despite the cheating scandal swirling around him, TMZ and other outlets reported.\n\nKardashian gave birth to her daughter around 4 a.m at a hospital outside Cleveland. Her mother Kris Jenner and sisters Kim Kardashian and Kourtney Kardashian also were there. The baby’s name and other details were not reported.\n\nThe Cleveland Cavaliers player had also been invited into the delivery room, despite the fact that he reportedly left Kardashian devastated and “ballistic” after news broke this week that he had been unfaithful to her with multiple women.\n\nTMZ reported that the 33-year-old reality TV star, in her ninth month of pregnancy, began having contractions Wednesday amid all the turmoil of the cheating allegations.\n\nKardashian had relocated to Thompson’s hometown of Cleveland to enjoy the final stretch of her pregnancy and to give birth to her baby at an area hospital. When news surfaced about Thompson and his alleged trysts with other women, it was too late in her pregnancy for her to fly back to Los Angeles. Kris Jenner and Kim and Kourtney Kardashian rushed to Cleveland to be by her side.\n\nAs for having Thompson with her, sources told TMZ that Khloe Kardashian understood the importance of the birth in the lives of everyone involved and believed that the bond between her daughter and Thompson could be cemented in the delivery room.\n\n“The Kardashians are furious with Tristan, but despite what happened in New York, Khloé really wanted him there for the birth of their daughter,” a source told Page Six.\n\nThompson’s presence in the delivery room came hours after he and his team lost to the lowly New York Knicks at Cleveland’s Quicken Loans Arena. Thompson didn’t receive a very warm welcome back at his home arena. TMZ and People both reported that people in the crowd booed when he joined the game late in the first quarter.\n\nKardashian’s labor started the day after reports began surfacing in various outlets that her NBA boyfriend had cheated on her in October, when she was three months pregnant, and more recently over the weekend, when he was traveling with his team in New York City.\n\nThe Daily Mail, TMZ and other outlets on Tuesday published photos and videos of Thompson, 27, making out with a curvy brunette at a club in New York City on Saturday night and then later entering a hotel room with the woman. She was subsequently identified by the Daily Mail and Page Six as an Instagram model and strip club bartender named Lani Blair.\n\nTMZ also published a video of Thompson, shot by a surveillance camera in October 2017, at a Washington D.C. hookah lounge. Thompson is seen in the video making out with two women and allowing the women to grope him.\n\nOne of the women in the video told TMZ Wednesday that she had no idea Thompson was in a serious relationship with Khloe Kardashian when she and he had their “fling.”\n\nA report in People magazine on Wednesday quoted an “insider” as saying that the cheating allegations were “a long time coming.”\n\n“Tristan has been consistently cheating on Khloé,” the source told People. “He’s a serial cheater. And there will be more women to come out of the woodwork.”\n\nThis is not the turn in her relationship that Khloe Kardashian likely expected, certainly not recently when she posted happy baby bump photos of her in romantic, sexy poses with her baby daddy.\n\nKardashian and Thompson began dating in September 2016, with the “Keeping Up With the Kardashians” star soon proclaiming that she thought Thompson was the man she wanted to spend the rest of her life with.\n\nIn a June 2017 episode of “Keeping Up With the Kardashians,” she gushed about how she and Thompson had talked about starting a family together. “He wants to have five or six kids with me and that’s lovely. We could start at one and grow from there,” Kardashian said.\n\nKardashian and the rest of her famous family soon become regular fixtures at Cavaliers games. In December 2017, she announced her pregnancy by sharing a snap of her bare baby bump. Related Articles Tristan Thompson jeered at Cavaliers game; sex tape reportedly bought and destroyed\n\n‘Ballistic’ Khloe Kardashian may be having contractions; family rushes to Cleveland\n\nPregnant Khloe Kardashian stuck in Cleveland as Tristan Thompson’s ‘serial’ cheating scandal — with ‘sex tape’ — explodes\n\nWhat Kardashian curse? Tristan Thompson shops for a mansion with Khloe Kardashian\n\nBut the idea that Thompson would make loyal boyfriend/husband/father material seemed a stretch, given that he broke up with his previous girlfriend, Jordan Craig, while she was pregnant. Craig gave birth to their son, Prince, in December 2016 after he had begun to see Kardashian.\n\nThis story is developing.", "images": ["https://www.mercurynews.com/wp-content/uploads/2018/04/tristan-thompson-_15.jpg?w=1024&h=676", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/04/tristan-thompson-_02.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/04/tristan-thompson-_15.jpg?w=1024&h=676", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/04/12/khloe-kardashian-gives-birth-to-baby-girl-with-tristan-thompson-by-her-side/", "title": "Khloe Kardashian allows Tristan Thompson in the delivery room for their daughter’s birth", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Khloe Kardashian's contractions reportedly started Wednesday, the day after news broke that Tristan Thompson had allegedly cheated on her with multiple women.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Khloe Kardashian allows Tristan Thompson in the delivery room for their daughter’s birth", "url": "https://www.mercurynews.com/2018/04/12/khloe-kardashian-gives-birth-to-baby-girl-with-tristan-thompson-by-her-side/", "description": "Khloe Kardashian’s contractions reportedly started Wednesday, the day after news broke that her Cleveland Cavaliers boyfriend had allegedly cheated on her with multiple women.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/04/tristan-thompson-_15.jpg?w=1024&h=676", "width": 1024, "height": 676}, "locale": "en_US"}, "article": {"published_time": "2018-04-12T16:55:20+00:00", "modified_time": "2018-04-13T11:57:52+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Khloe Kardashian allows Tristan Thompson in the delivery room for their daughter’s birth"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/04/tristan-thompson-_15.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1523462400.0, "source": "http://www.mercurynews.com", "summary": ""}