{"url": "http://www.thefashionspot.com/beauty/665555-black-girl-skin-care/", "text": "Just because summer is long gone doesn’t mean we still don’t want to glow like J.Lo. So we sought out Kat Leverette, a licensed esthetician, ethnic skincare expert and owner of Clinically Clear Skin Rehab Center, for advice on achieving a glowy, even-toned complexion. Follow these tips for gorgeous, lit-from-within skin all year long.\n\nWash Your Face Before Bedtime\n\nCleanse your skin gently, especially at night, as a vital part of your bedtime routine. Unclogging pores of the day’s oil and grime is important for keeping skin clear.\n\nUse a Low-Lathering, Sulfate-Free Cleanser\n\nA gentle cleanser removes makeup and excess oil without stripping your skin. If your skin feels tight and dry after washing, you’re using something too strong. Opt for a creamy face wash, like Cetaphil Gentle Skin Cleanser or CeraVe Hydrating Cleanser.\n\nTake It Easy\n\n“Cleanse with your fingertips and rinse by splashing water on your face. Pat dry. Don’t roughly rub your skin dry with a towel. The pressure of a washcloth or towel and friction from sonic brushing may feel good and appeal to your desire to be squeaky clean, but can cause darker, uneven skin tone and aggravate acne. Instead, dry skin with small, gentle pats or let it air dry,” advises Leverette.\n\nExfoliate Your Skin\n\nBut not too aggressively or too often. “Over-scrubbing is like giving yourself a rope burn — causing irritation and a darker, uneven skin tone. Avoid using washcloths, spa gloves, buffing pads, sonic scrubbers or coarse scrubs. Choose a fine-grain scrub made with jojoba beads or other environment-friendly beads instead,” says Leverette. “And don’t rub hard — use light pressure in a gentle circular motion.”\n\nNoncomedogenic sunflower oil and table sugar blended together make an excellent all-over exfoliator. Apply in the shower before you turn the water on. Massage all over using gentle pressure. Rinse off and pat dry.\n\nTry an Alcohol-Free Toner Mist\n\nSpritz your face with a refreshing facial spray to hydrate skin and set makeup. On extra hot days, mist throughout the day to rehydrate.\n\nHydrate From Within\n\nIf you are dehydrated, your skin will look dull. Leverette recommends drinking half your weight in ounces of water or non-caffeinated beverages like herbal tea for a healthy flush.\n\nGo Easy on the Oil\n\nYou want a glow, not an oil slick. “Resist the urge to slather your skin and scalp with heavy oils. If you’re acne-prone, you’ll pay the price with clogged pores, blackheads and pimples,” says Leverette. “Opt for fragrance-free sunflower oil for the same effect and clearer skin.”\n\nMoisturize\n\nTo keep your skin supple and soft, Leverette suggests using lotions and moisturizers that contain ceramides. “Ceramides are a major component of our skin’s surface that protect against moisture loss to keep your skin youthful, supple, moist and glowing.” Try CeraVe Facial Moisturizing Lotion.\n\nGet Even\n\nDark spots and blotchy skin can mar a beautiful complexion. Look for products with skin-brightening ingredients, like licorice, mulberry, bearberry and kojic acid. These ingredients gradually fade hyperpigmentation and encourage an even, radiant hue.\n\nNatural Camouflage\n\nIf you need extra coverage, smooth on a luminous foundation or tinted moisturizer for a natural, radiant finish. Or try light-diffusing BB creams for a photo-filtered effect.\n\nProtect Your Skin\n\nLack of sun damage will keep your skin dewy and supple for years to come. “Yes, darker skin needs protection too, especially on overcast days because the UVA penetrates clouds and windshields. If your skin darkens at all, it’s sun damage in the making,” says Leverette. “Makeup with sunscreen added is not enough protection. Technology has made it possible for physical sunscreens like zinc oxide and titanium dioxide to go on sheer. Use SPF 30 and apply with a massage motion with the palm of your hand, gently working the sunscreen into the skin. But be cautious; sheer sunscreens use chemical sunscreening agents that provide less protection against the longer UVA rays.”\n\nGo for the Glow\n\nTake some loose pearlescent (not glittery) gold, peach or bronze eye powder shadow. Mix a tiny bit in the palm of your hand with a few drops of foundation, sunscreen or moisturizer. Apply to outer cheeks and brow bone for an extra touch of luminosity.\n\nEat Healthy\n\nA low-sugar, antioxidant-rich diet consisting of colorful fruits and vegetables (especially leafy greens), legumes and lean protein will ensure you’re healthy inside as well as out for a natural glow.\n\nWork It Out\n\nWorking out gives you all the beauty benefits that money can’t buy. Exercising at least 30 minutes a day gets your heart pumping and increases circulation by bringing oxygen into your bloodstream. It’s the best way to achieve a youthful glow.\n\n[ Next: The Black Girl’s Guide to Waking Up with Soft, Tangle-Free Tresses ]\n\nPresented by Target", "images": ["https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/gplus-icon.svg", "https://cdn3-www.thefashionspot.com/assets/uploads/2018/06/logo_tfs.svg", "https://cdn3-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/pinterest-icon.svg", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/tfs.svg", "http://secure-au.imrworldwide.com/cgi-bin/m?ci=au-evolve&cg=0&cc=1&ts=noscript", "https://cdn2-www.thefashionspot.com/assets/uploads/2018/06/logo_tfs_small.svg", "https://cdn1-www.thefashionspot.com/assets/uploads/2015/11/balmain-spring-summer-2016-gorgeous-glowy-skin-landscapecropped.jpg", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/twitter-icon.svg", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/instagram-icon.svg", "https://cdn3-www.thefashionspot.com/assets/uploads/2015/03/joanesprofilepic-150x221.jpeg", "https://cdn3-www.thefashionspot.com/assets/uploads/2015/11/balmain-spring-summer-2016-gorgeous-glowy-skin-landscapecropped.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6036161&cv=2.0&cj=1", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/facebook-icon.svg"], "top_img": "https://cdn3-www.thefashionspot.com/assets/uploads/2015/11/balmain-spring-summer-2016-gorgeous-glowy-skin-landscapecropped.jpg", "keywords": [], "authors": ["Joane Amay", "Read More About Joane Amay Articles..."], "canonical_link": "https://www.thefashionspot.com/beauty/665555-black-girl-skin-care/", "title": "The Black Girl’s Guide to Gorgeous, Glowy Skin", "meta_data": {"p": {"domain_verify": "857ed4595f63223069d7704498ec6eaf"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "description": "Go for the glow with these tips for gorgeous, glowy skin.", "og": {"locale": "en_US", "type": "article", "title": "The Black Girl's Guide to Gorgeous, Glowy Skin - theFashionSpot", "description": "Go for the glow with these tips for gorgeous, glowy skin.", "url": "https://www.thefashionspot.com/beauty/665555-black-girl-skin-care/", "site_name": "theFashionSpot", "updated_time": "2015-12-01T11:38:04+00:00", "image": {"identifier": "https://cdn3-www.thefashionspot.com/assets/uploads/2015/11/balmain-spring-summer-2016-gorgeous-glowy-skin-landscapecropped.jpg", "secure_url": "https://cdn3-www.thefashionspot.com/assets/uploads/2015/11/balmain-spring-summer-2016-gorgeous-glowy-skin-landscapecropped.jpg", "width": 615, "height": 410, "alt": "woman with gorgeous skin"}}, "article": {"tag": "skincare", "section": "Beauty", "published_time": "2015-12-01T11:07:54+00:00", "modified_time": "2015-12-01T11:38:04+00:00"}, "fb": {"app_id": 153652024698919}, "twitter": {"card": "summary_large_image", "description": "Go for the glow with these tips for gorgeous, glowy skin.", "title": "The Black Girl's Guide to Gorgeous, Glowy Skin - theFashionSpot", "site": "@fashion_spot", "image": "https://cdn3-www.thefashionspot.com/assets/uploads/2015/11/balmain-spring-summer-2016-gorgeous-glowy-skin-portraitcropped.jpg", "creator": "@joaneamay"}}, "movies": [], "publish_date": 1448968074.0, "source": "http://www.thefashionspot.com", "summary": ""}