{"url": "https://www.thehollywoodgossip.com/2018/01/lala-kent-gives-dating-advice-id-rather-be-a-bitch-than-dumb/", "text": "It's only been a few days since Vanderpump Rules star Lala Kent went public with her married boyfriend, and now she's offering some dating advice like some sort of relationship expert.\n\nNow, anyone can give advice -- you don't need a degree to have common sense or to tell someone that their boyfriend crossed a line.\n\nBut in Lala Kent's case, the advice that she's dishing out is ... controversial.\n\nSo, Lala Kent doesn't limit her good deeds to stripping down to fight SeaWorld and other aquatic circuses. She also gives out relationship advice.\n\nTaking to Instagram Live, Lala Kent revealed a \"f--king crazy\" direct message that she'd received from a fan who wanted her input.\n\n\"This girl was talking about this guy that she's pretty into, she's been seeing him for a while.\"\n\nAnd the girl has a specific reason for talking to Lala for advice.\n\n\"There's quite an age gap, it's kind of like me and my man, she's my age, maybe a little older...he's like in his later 40s.\"\n\nRandall Emmett is 46. Lala will turn 28 this year.\n\n\"And they've never been official but he was like really cute at the beginning and then he falls off the earth.\"\n\nUh-oh. That's not a great sign.\n\n\"He's like inconsistent, which as women I think is f--ked up, like don't be inconsistent.\"\n\nIt might mean that he's unsure about this relationship. It might mean that he's lying to this girl -- and maybe to someone else in his life.\n\nOr he might be just using this girl to feel young, and then running off when it starts to feel too much like a relationship.\n\nWhatever the cause, Lala doesn't like it any more than we do.\n\n\"If you're gonna be inconsistent, women we need to give them the boot, it's not OK.\"\n\nLala goes on to explain that the girl went to dinner with this older man and that man's friend before the New Year.\n\nThe girl had a few drinks at the bar because she was nervous.\n\n\"So she gets a little too drunk at the bar she says, they get into a cab and she starts to take her clothes off in the cab.\"\n\nThe girl was making certain that the driver couldn't see her as she did this.\n\nIt did not go over well.\n\n\"She started taking her pants off and he started reprimanding her and getting upset and made her feel really stupid.\"\n\nOur first thought is that this girl, who's clearly feeling insecure in this relationship enough that she's anxious before dinner and then wants reassurance that this older man finds her sexy, should dump his ass.\n\nLala Kent, we're happy to say, feels the same way.\n\n\"I'll tell you how I would react, first of all my p--sy is no longer yours to have fun with, you're a f--king asshole.\"\n\nThat's good advice.\n\nHere comes the controversy:\n\n\"You make me feel dumb, I'm not about that life; you can call me a homewrecker, you can call me a bitch, you can call me whatever you want, when you make me feel dumb, I'm wiping my hands clean.\"\n\nTo be clear, if a guy's calling a girl names in a way that she's not okay with, that's not any more okay than ridiculing a girl as \"stupid.\"\n\nWhat this girl was doing sounds desperate, which suggests to us that this guy is standoffish and cold -- maybe even more like this in front of his friend.\n\nThat's no good for a relationship, folks.\n\nIf a guy isn't friendly or is only friendly sometimes, that means that he has his own emotional issues, and it's not your job to crack through the ice. Move on to a guy who can show you how much he appreciates you.\n\nAnd if a guy makes you feel dumb -- or calls you ugly names or otherwise demeans you outside of consensual bedroom roleplay -- dump his ass at the curb. It's 2018 and awful guys don't deserve great girlfriends.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--7KUKyiU4--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1482239644/ooh-la-la-kent.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--7KUKyiU4--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1482239644/ooh-la-la-kent.jpg", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/01/lala-kent-gives-dating-advice-id-rather-be-a-bitch-than-dumb/", "title": "Lala Kent Gives Dating Advice: I'd Rather Be a Bitch Than Dumb!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/01/lala-kent-gives-dating-advice-id-rather-be-a-bitch-than-dumb/", "title": "Lala Kent Gives Dating Advice: I'd Rather Be a Bitch Than Dumb!", "description": "Lala Kent gives dating advise to a woman her age who is also dating a much older man. Lala's mostly good advice takes a controversial turn.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--FY5uek0C--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1449007990/lala-kent-modeling-photo.jpg", "type": "image/jpeg", "width": 627, "height": 616}}, "article": {"published_time": "2018-01-05T12:18:06-05:00", "modified_time": "2018-12-31T19:50:52-05:00", "tag": "Instagram", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Lala Kent Gives Dating Advice: I'd Rather Be a Bitch Than Dumb!", "description": "Lala Kent gives dating advise to a woman her age who is also dating a much older man. Lala's mostly good advice takes a controversial turn.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--7KUKyiU4--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1482239644/ooh-la-la-kent.jpg"}}, "description": "Lala Kent gives dating advise to a woman her age who is also dating a much older man. Lala's mostly good advice takes a controversial turn."}, "movies": [], "publish_date": 1515172686.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}