{"url": "en.wikipedia.org/wiki/American_Media,_Inc.", "text": "American magazine publishing company\n\nAmerican Media, Inc. (AMI) is an American publisher of magazines, supermarket tabloids, and books based in New York City. Originally affiliated with only the National Enquirer, the media company's holdings expanded considerably in the 1990s and 2000s. In November 2010, American Media filed for Chapter 11 bankruptcy protection due to debts of nearly $1 billion, but has continued to buy and sell magazine brands since then.\n\nAMI has been in the news affiliated with accusations of catch and kill operations. On December 12, 2018, the U.S. Attorney's Office reported that AMI admitted to paying $150,000 to Karen McDougal in concert with a candidate's presidential campaign for the sole purpose of preventing damaging allegations prior to the 2016 US presidential election.[2][3]\n\nAccording to its September 2018 non-prosecution agreement with Southern District of New York federal prosecutors, AMI \"shall commit no crimes whatsoever\" for three years, otherwise \"A.M.I. shall thereafter be subject to prosecution for any federal criminal violation of which this office has knowledge.\"[4]\n\nOn April 10, 2019, Chatham Asset Management, which controls 80 percent of AMI's stock, forced AMI to sell the National Enquirer.[5][6] This came after Chatham owner Anthony Melchiorre, who AMI has also relied on for survival, expressed dismay over the tabloid magazine's recent scandals involving hush money assistance to U.S. President Donald Trump's 2016 campaign and blackmail of Jeff Bezos.[5][6] On April 18, 2019, AMI agreed to sell not only the National Enquirer, but two of its other publications, Globe and National Examiner, to Hudson Group.[7][8]\n\nHistory [ edit ]\n\nThe modern American Media came into being after Generoso Pope Jr., longtime owner of the National Enquirer, died in 1988, and his tabloids came under new ownership. American tabloids began consolidating in 1990, when American Media bought Star from Rupert Murdoch. The purchase of Globe Communications (owner of the Globe and the National Examiner) followed nine years later.[9] Roger Altman, through Evercore Partners, bought a controlling stake in American Media in 1999.[10]\n\nAmerican Media is not to be confused with American Media Distribution the international news coverage firm. American Media's former corporate headquarters in Boca Raton, Florida, figured prominently in news headlines in late 2001, after an anthrax attack was perpetrated on the company[11] and other media outlets.[12] Since then the corporate headquarters have moved to New York City at 1 Park Avenue in Manhattan, before moving to the Financial District to the former JP Morgan Chase headquarters at 4 New York Plaza. That building was severely damaged by Hurricane Sandy but reopened in February 2013. The CEO, David J. Pecker, travels between the Boca Raton and New York offices while managing the company.[citation needed]\n\nAMI continued to expand after it bought Joe Weider's Weider Publications in 2002. Joe Weider continued to manage control of his magazines under AMI's Weider Publications subsidiary until his death in March 2013.[13][14]\n\nAmerican Media also owns Distribution Services, an in-store magazine merchandising company. In fall 2002, it launched the book-publishing imprint, AMI Books.[15]\n\n2010s: Bankruptcy and continued acquisitions [ edit ]\n\nIn 2009, American Media was taken over by its bondholders to keep it out of bankruptcy.[16]\n\nIn November 2010, American Media filed for Chapter 11 bankruptcy protection due to nearly $1 billion in debt, and assets of less than $50,000.[17] Its subsidiary, American Media Operations Inc., listed assets of $100 to $500 million and debt of over $1 billion.[18] It exited in December.\n\nIn May 2014, American Media announced a decision to shift the headquarters of the National Enquirer from Florida, where it had been located since 1971, back to New York City, where it originally began as The New York Enquirer in 1926.[19] In August 2014, American Media was acquired by Chatham Asset Management and Omega Charitable Partnership[20].\n\nIn 2015, American Media sold Shape, Natural Health, and Fit Pregnancy to Meredith.[21]\n\nIn 2016, Pecker revealed to the Toronto Star that AMI now relied on support from Chatham Asset Management and its owner Anthony Melchiorre.[22][6] The $4 billion hedge fund owns 80 percent of AMI's stock.[6]\n\nIn March 2017, American Media acquired Us Weekly from Wenner Media for a reported $100 million.[23] Three months later, in June 2017, American Media also acquired Men's Journal from Wenner Media.[24]\n\nIn June 2018, American Media acquired 13 brands from Bauer Media Group including In Touch Weekly, Life & Style and Closer to add to their celebrity portfolio. They also acquired Bauer Media's kids group including J-14 and Girl's World.[25]\n\nIn February 2019, American Media acquired TEN's adventure sports properties.[26]\n\nIn April 2019, the National Enquirer was reported to be up for sale and likely to be sold within days. The company stated that it had shifted its emphasis away from tabloids to its \"glossy\" magazines such as Us Weekly and Men's Journal.[27] This came following pressure from Chatham owner Anthony Melchiorre, who expressed disapproval of the Enquirer's style of journalism.[6][5] On April 18, 2019, AMI accepted an offer from Hudson News head James Cohen and agreed to sell not only the National Enquirer, but also Globe and The Examiner to Hudson News for $100 million.[7][8] At the time the sales were announced, AMI was approximately $355 million in debt.[28]\n\n\"Catch-and-kill\" scandals related to Donald Trump [ edit ]\n\nIn late 2015, AMI paid $30,000 to Dino Sajudin, a doorman at Trump Tower, to obtain the rights to his story in which he alleged Donald Trump had an affair in the 1980s that resulted in the birth of a child. Sajudin in April 2018 identified the woman as Trump's former housekeeper.[29] AMI reporters were given the names of the woman and the alleged child, while Sajudin passed a lie detector test when testifying that he had heard the story from others. Shortly after the payment was made, Pecker ordered the reporters to drop the story.[30] In April 2018, AMI chief content officer Dylan Howard denied the story was \"spiked\" in a so-called \"catch and kill\" operation, insisting that AMI did not run the story because Sajudin's story lacked credibility.[31] On August 24, 2018, after AMI had released Sajudin from the contract, CNN obtained a copy of it and published excerpts. The contract instructed Sajudin to provide \"information regarding Donald Trump's illegitimate child,\" but did not contain further specifics of Sajudin's story.[32]\n\nKaren McDougal [ edit ]\n\nAmerican Media Inc. Non-Prosecution Agreement\n\nIn 2016, AMI paid Playboy model Karen McDougal $150,000 for exclusive rights to her allegations of a ten-month affair with Donald Trump—which she claimed happened in 2006–2007, when he was already married to Melania[33]—but AMI never published the story. AMI publicly acknowledged having made the payment after The Wall Street Journal revealed it days before the 2016 presidential election, but AMI denied that its purpose had been to \"kill damaging stories about\" Trump; instead, AMI claimed it had paid only for \"exclusive life rights to any relationship [McDougal] has had with a then-married man\" and \"two years' worth of her fitness columns and magazine covers.\"[34][35] In March 2018, McDougal filed a lawsuit to invalidate the non-disclosure agreement she had with AMI.[36][37] A month later, AMI settled with McDougal, allowing her to speak about the alleged affair.[38] In August 2018, it was reported that AMI CEO/Chairman David Pecker and AMI chief content officer Dylan Howard were granted witness immunity in exchange for their testimony regarding hush money payments made by Donald Trump's then-personal lawyer, Michael Cohen, in an attempt to influence the 2016 presidential election.[39]\n\nOn December 12, 2018, the U.S. Attorney's Office announced its agreement with AMI \"AMI admitted that it made the $150,000 payment in concert with a candidate's presidential campaign,\" the press release said, so that Karen McDougal wouldn't \"publicize damaging allegations about the candidate before the 2016 presidential election. AMI further admitted that its principal purpose in making the payment was to suppress the woman's story so as to prevent it from influencing the election.\" As a result of this agreement, AMI would not face prosecution and agreed to provide extensive assistance to prosecutors about the involvement of Trump and other politicians with the company.[2] The same press release also revealed that Michael Cohen had been sentenced to three years in prison for various crimes, including the $150,000 campaign finance violation—the facilitation of the payment to McDougal—to which he pled guilty on August 21, 2018.[40][41][42]\n\nJeff Bezos blackmail [ edit ]\n\nIn January 2019, the National Enquirer broke a story about the extramarital affair of Amazon founder and Washington Post owner Jeff Bezos with Lauren Sánchez. Bezos began investigating how and why the information had been leaked to the National Enquirer.[43] President Trump has long expressed displeasure with Bezos,[44][45][46] and Trump's irritation may have increased due to the Washington Post's critical coverage of the murder (and the subsequent cover-up[47]) of one of its reporters, Jamal Khashoggi.[48] This, Bezos suspects, may have been the political motivation for someone to leak his affair to the tabloid.[49]\n\nOn February 7, 2019, Bezos shared emails that he had received the previous day[49] in which AMI sought a public statement from him and his lawyer \"affirming that they have no knowledge or basis for suggesting that AM's coverage [of the sexual affair] was politically motivated or influenced by political forces, and an agreement that they will cease referring to such a possibility.\" AMI chief content officer Dylan Howard and his lawyer Jon Fine threatened Bezos, saying that if Bezos did not promptly meet their demands, AMI would publish selfies and sexts sent between Bezos and his girlfriend.[50] Bezos wrote that he would refuse to make this \"specific lie\" or to otherwise participate in this blackmail bargain that \"no real journalists [would] ever propose.\"[49] \"Of course I don't want personal photos published,\" Bezos added, but he said he chooses to \"stand up, roll this log over, and see what crawls out.\"\n\nThat same day, The Washington Post published an article on the matter, quoting a former federal prosecutor who speculated that this news could undermine AMI's recent deal with the government. If prosecutors decide they must file new criminal charges against AMI, the government may not be able \"to continue to use them [AMI] to assist other ongoing investigations,\" said Robert Mintz.[51]\n\nLauren Sanchez's brother, Michael Sanchez, an ardent Trump supporter, stated he was told by multiple AMI employees that the Enquirer set out to do \"a takedown to make Trump happy\"[52] and The Daily Beast reported seeing documents showing that Sanchez believed the Bezos story was run with \"President Trump's knowledge and appreciation.\"[53]\n\nPublications [ edit ]\n\nDivisions [ edit ]\n\nAMI Books\n\nAMI Entertainment Group [54] [55]\n\nDistribution Services, Inc.\n\nDew Tour\n\nSee also [ edit ]", "images": ["http://en.wikipedia.org/static/apple-touch/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/American_Media%2C_Inc._logo.png/100px-American_Media%2C_Inc._logo.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/American_Media_Inc._Non-Prosecution_Agreement.pdf/page1-220px-American_Media_Inc._Non-Prosecution_Agreement.pdf.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Media,_Inc.", "title": "American Media, Inc.", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}