{"url": "https://www.thecut.com/2018/10/meghan-markle-royal-tour-fashion-outfits-pictures.html", "text": "The many royal-tour looks of Meghan Markle. Photo: Getty Images\n\nMeghan Markle and Prince Harry have just wrapped up their first official royal tour (as parents-to-be), which entailed 16 days of traveling across Australia, New Zealand, Fiji, and Tonga for diplomatic (and also apparently fashion) purposes.\n\nLuckily for us, the royal couple attended more than 70 engagements total during their tour, with Meghan wearing around 30 different ensembles over the course of the trip. Fittingly, as soon as Meghan and Prince Harry landed in Sydney on October 15, the Duchess of Sussex immediately drew even more attention than usual with her sartorial choices — although in fairness, she was carrying binders at first, which was confusing.\n\nBut with so many events, outfit changes, and of course, her pregnancy, all eyes were on Meghan. Here’s a look at all of Meghan’s outfits from the tour.\n\nMeghan landed in Sydney on October 15 in a black-and-maroon jacket, black heels, a black turtleneck, and black tailored pants (and binders).\n\nMeghan Markle and Prince Harry in Sydney. Photo: Newspix/Newspix via Getty Images\n\nFor her first official tour stop on October 16, Meghan opted for an ivory “Blessed” dress by Australian designer Karen Gee, butterfly earrings previously worn by Princess Diana, and Stuart Weitzman “Legend” pumps.\n\nMeghan Markle. Photo: Pool/Getty Images\n\nShe then put on a trench coat over her Karen Gee dress.\n\nMeghan Markle and Prince Harry. Photo: Mark Metcalfe/Getty Images\n\nMeghan ended the day in an olive-green pleated button-up skirt dress by Brandon Maxwell.\n\nMeghan Markle in Brandon Maxwell. Photo: Andrew Parsons / i-Images/WireImage\n\nThe duchess kicked off day two of the royal tour in Dubbo, Australia, where she wore opted for a casual look (which is fitting as she went to a farm): black jeans by Outland Denim (an Australian brand), a white button-down by Maison Kitsuné, boots from J. Crew, and perhaps most notably, a $145 gray blazer from her friend Serena Williams’s line.\n\nMeghan Markle and Prince Harry. Photo: Pool/Getty Images\n\nOn day three, the consistently affectionate duo traveled to Melbourne, where Meghan’s Martin Grant trench coat made another appearance.\n\nMeghan Markle and Prince Harry in Melbourne. Photo: Pool/Getty Images\n\nMeghan later took off her trench to reveal a navy dress by Australian designer Dion Lee.\n\nMeghan Markle in Dion Lee. Photo: Chris Jackson/Getty Images\n\nMeghan also changed out of her navy dress and into a black Club Monaco frock (with buttons) in Melbourne – but kept her beloved trench on.\n\nMeghan Markle in Club Monaco. Photo: Scott Barbour/Getty Images\n\nShe also threw on her black Rothy’s flats to walk in the sand (as we assume heels would be absolutely impossible).\n\nMeghan’s Rothy’s. Photo: Chris Jackson/Getty Images\n\nMeghan and Prince Harry headed to Bondi Beach in Sydney on day four of their tour, where she shared some positive vibes while wearing a Martin Grant dress.\n\nMeghan Markle and Prince Harry on Bondi Beach. Photo: Ryan Pierse/Getty Images\n\nShe changed into a Roksanda dress to visit a school later.\n\nMeghan Markle. Photo: Pool/Getty Images\n\nOn day five, Meghan wore a dress by Emilia Wickstead and a Philip Treacy hat as she and Prince Harry (clad in official military dress) visited the Anzac Memorial.\n\nMeghan Markle and Prince Harry. Photo: Ian Vogler/Getty Images\n\nThat same day, Meghan wore a white Altuzarra blazer, an Invictus Games shirt, black jeans, and cool shades by Illesteva.\n\nMeghan Markle and Prince Harry at the Invictus Games. Photo: Chris Jackson/Getty Images for the Invictus Ga\n\nAt night, during the opening ceremony of the Invictus Games Sydney 2018, she opted for a Stella McCartney dress (that she wore before).\n\nMeghan Markle and Prince Harry at the Invictus Games. Photo: Chris Jackson/Getty Images for the Invictus Ga\n\nThough it was announced that Meghan would be reducing some of her duties during the trip, she still attended an Invictus reception lunch on day six, wearing black jeans, a black turtleneck, a white pinstripe blazer by L’Agence, and an Oroton bag.\n\nHere they are. Photo: Chris Jackson/Getty Images for the Invictus Ga\n\nShe changed into some Veja sneakers to go on a boat.\n\nMeghan Markle and Prince Harry on a boat. Photo: Chris Jackson/Getty Images for the Invictus Ga\n\nThe next day, the couple headed to Fraser Island, where she donned a Reformation dress.\n\nMeghan Markle and Prince Harry. Photo: Chris Jackson/Getty Images\n\nWhen the couple touched down in Fiji, Meghan wore a white custom Zimmermann dress and a hat by Stephen Jones.\n\nMeghan Markle in Fiji. Photo: Andrew Parsons / i-Images/Getty Images\n\nShe also sported a gorgeous blue Safiyaa cape dress to an official dinner.\n\nMeghan Markle and Prince Harry in Fiji. Photo: Ian Vogler/Getty Images\n\nOn Tuesday, October 23, to attend a climate change performance and give a speech on education, Meghan wore a pink print Figue dress.\n\nMeghan Markle in Fiji. Photo: Pool/Getty Images\n\nFor her final appearance in Fiji, Meghan wore a Jason Wu dress.\n\nMeghan Markle’s last Fiji look. Photo: Chris Jackson/Getty Images\n\nArriving in Tonga, Meghan wore a red dress by Self Portrait.\n\nMeghan Markle and Prince Harry arriving in Tonga. Photo: Chris Jackson/Getty Images\n\nMeghan looked extremely bridal in a custom white Theia dress to a formal reception (which she paired with Princess Diana’s aquamarine ring, as she also wore during her royal wedding reception).\n\nMeghan Markle, looking extremely bridal. Photo: Pool/Samir Hussein/WireImage\n\nShe donned into another Martin Grant dress for an event with the prime minister of Tonga.\n\nMeghan Markle in Martin Grant, again. Photo: Pool/Getty Images\n\nAnd of course, she then changed again – into a blue shirtdress by Veronica Beard and heels by Banana Republic while visiting a forest conservation.\n\nMeghan Markle in Veronica Beard. Photo: Pool/Getty Images\n\nBack in Sydney, Meghan went full movie star glam in Oscar de la Renta.\n\nMeghan Markle in Oscar de la Renta. Photo: Paul Edwards/Getty Images\n\nStill in Australia, she wore a Scanlan Theodore wrap jacket, black Outland jeans, and Sarah Flint heels to an Invictus Games event.\n\nPrince Harry and Meghan Markle at the Invictus Games. Photo: Chris Jackson/Getty Images for the Invictus Ga\n\nTo wrap up the Invictus Games, Meghan wore an olive Antonio Berardi tuxedo dress and heels by Aquazzura.\n\nMeghan Markle at the Invictus Games. Photo: Mark Kolbe/Getty Images for the Invictus Ga\n\nEn route to New Zealand, Meghan wore a belted Boss jersey dress and those same Aquazzura heels at the airport. She was also carrying a handbag by Cuyana.\n\nMeghan Markle and Prince Harry at the airport. Photo: RICK RYCROFT/AFP/Getty Images\n\nLanding in New Zealand, Meghan wore a plaid trench by Karen Walker and a black maternity dress by ASOS.\n\nPrince Harry and Meghan Markle in New Zealand. Photo: HAGEN HOPKINS/AFP/Getty Images\n\nShe then changed into a black cocktail dress by Gabriela Hearst to deliver a powerful speech on feminism and the importance of voting.\n\nMeghan’s speech. Photo: Pool/Getty Images\n\nThe next day, we saw her in a Jac + Jack turtleneck, black jeans, Stuart Weitzman boots, and a Club Monaco coat.\n\nMeghan Markle and Prince Harry. Photo: Chris Jackson/Getty Images\n\nShe changed into Adidas by Stella McCartney sneakers and weather appropriate outerwear later on.\n\nA very outdoorsy royal couple. Photo: ROBERT KITCHIN/STUFF/Getty Images\n\nThen we saw Meghan in a white tuxedo dress by Maggie Marilyn.\n\nA fitting scene. Photo: Dominic Lipinski/Getty Images\n\nMeghan swapped her Martin Grant trench for a Burberry coat, and paired it with a nude Brandon Maxwell dress.\n\nMeghan Markle and Prince Harry. Photo: Chris Jackson/Getty Images\n\nShe also put on some J.Crew jeans, a Karen Walker blazer, and some black wellies by the Original Muck Boot Company while in Auckland.\n\nMeghan Markle and Prince Harry. Photo: Phil Walter/Getty Images\n\nAttending a reception, Meghan re-wore an outfit we saw her wear at a polo event with Prince Harry in May 2017. At the time, though, the pics of the dress were taken from far away, so this appearance was our first clear image of the navy Antonio Berardi dress.\n\nMeghan Markle. Photo: Ian Vogler/Getty Images\n\nOn the final day of the royal tour, Meghan started out in a navy Stella McCartney dress (and a traditional Korowai robe).\n\nMeghan Markle at an event in New Zealand. Photo: Chris Jackson/Getty Images\n\nShe then changed into blue Givenchy separates. The skirt unfortunately appeared to be slightly sheer when photographed.\n\nMeghan Markle in Givenchy. Photo: Dominic Lipinski/Getty Images\n\nFinally, Meghan wrapped up the royal tour in flats, black pants, and Prince Harry’s puffy Norrøna Oslo coat.\n\nMeghan Markle in Prince Harry’s coat. Photo: Chris Jackson/Getty Images\n\nThis post has been updated.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/10/16/meghan/15-meghan-markle-new-lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/10/16/meghan/15-meghan-markle-new-lede.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/10/16/meghan/15-meghan-markle-new-lede.w1200.h630.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2018/10/meghan-markle-royal-tour-fashion-outfits-pictures.html", "title": "Everything Meghan Markle Wore on Her Royal Tour", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Everything Meghan Markle Wore on Her Royal Tour", "url": "https://www.thecut.com/2018/10/meghan-markle-royal-tour-fashion-outfits-pictures.html", "description": "A look at all the mom-to-be’s best outfits from the 16-day trip.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/10/16/meghan/15-meghan-markle-new-lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Everything Meghan Markle Wore on Her Royal Tour", "description": "A look at all the mom-to-be’s best outfits from the 16-day trip.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/10/16/meghan/15-meghan-markle-new-lede.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2018-10-31T11:41:00.000-04:00", "tag": "keeping up with the royals, meghan markle, prince harry, culture, celebrity, fashion", "publisher": "https://www.facebook.com/cut"}, "description": "Meghan Markle, who recently announced her pregnancy, just wrapped up a tour of Australia, New Zealand, Tonga, and Fiji with Prince Harry. Here is a roundup of all of her outfits from the royal tour.", "sailthru.tags": "keeping up with the royals, meghan markle, prince harry, culture, celebrity, fashion", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1541000460.0, "source": "https://www.thecut.com", "summary": ""}