{"url": "star941fm.iheart.com/content/2017-07-08-celebrities-react-nelsan-ellis-dead-at-39/", "text": "Nelsan Ellis is dead. The actor, best known for starring on “True Blood” and “Elementary,” died at age 39. Now celebrities are reacting on Twitter and paying tribute to the late star. See tweets below.\n\nEllis’ death was announced on Saturday by his manager. Emily Gerson Saines said in a statement, “Nelsan has passed away after complications with heart failure. He was a great talent, and his words and presence will be forever missed.”\n\nOn “True Blood,” Ellis starred as Lafayette Reynolds. He held the regular role for the duration of the seven-season series, earning two Satellite Awards, an Entertainment Weekly honor, and a NewNowNext Award. He and the rest of the cast also garnered a SAG Award nomination. In 2016, he joined “Elementary” as Shinwell Johnson. His character was killed off on the May 7, 2017 episode.\n\nEllis also worked on the big screen, most notably portraying Martin Luther King, Jr. in The Butler. Additional credits from both mediums include Secretariat, The Help, Get On Up, “Veronica Mars,” “Without A Trace” and a guest-judging appearance on “Ru Paul Drag’s Race.” Octavia Spencer, Ellis’ co-star in The Help, was actually the first on social media to break the news of his passing.\n\n“Just got word that we lost @nelsanellisofficial. My heart breaks for his kids and family. #RIPNelsanEllis. #brillIantactor #trueblood #getonup #thesoloist #thehelp,” she posted on Twitter and Instagram. Dule Hill tweeted, “Shocked & saddened to hear of Nelsan Ellis’ passing. Major fan of this talented actor. Way too young #Rip #TrueBlood.” Michael McMillian wrote, “Stunned, devastated by the terrible news of @OfficialNelsan’s passing. Nelsan was a genius and a beautiful soul. Sending love to his family.”\n\nGabrielle Union exclaimed, “My God, such a beautiful soul and talented artist. Blown. Away. #RIP.” Cynthia Erivo expressed, “#NelsanEllis RIP this is incredibly sad!” Denis O’Hare told followers, “Very disturbed and sad that Nelsan Ellis has died. Such a huge talent. Such a wonderful man. The world is a poorer place today.” Sam Trammell also shared, “I don’t know if I’ve ever seen the level of humility and kindness that came with the Magnificent Talent that Nelsan Ellis had. Miss u friend.”\n\n“Tragedy. Love and support to @OfficialNelsan’s closest friends family,” said Janina Gavankar. Gabourey Sidibe wrote, “Heartbroken over the passing of Nelsan Ellis. He was always so sweet to me and so entertaining to watch in screen. Michael Raymond-James commented, “Unbelievably sad news. Nelsan was such a sweet, gentle soul with an enormous talent. He will be missed greatly RIP.” Seth Gabel declared, “This man was a master of his craft. Such a terrible loss for us all.” Wished Chrissy Metz, “May your transition be full of love, light and peace, @OfficialNelsan. Thank you for sharing your magical gifts with us.”\n\nOn Instagram, Joe Manganiello posted, “Crushed today by the loss of my friend and castmate Nelsan Ellis. He was a wonderful person, a pioneer, and a one of a kind artist. Watching him work was like watching someone channel a spirit. It was mesmerizing. RIP.” Kristin Bauer said on her own page, “One of the sweetest most talented men I’ve ever met. A terrible loss for all of us. Rest In Peace Nelsan. You will be missed. I don’t know how else to put words to this terribly sad news.” Back on Twitter, Tika Sumpterwrote, “Heartbroken about @OfficialNelsan. Such a beautiful human being. Man.”\n\nAnna Camp stated, “My heart is broken today over the loss of @OfficialNelsan I was in complete awe of your talent and so honored to have known your kindness.” Anna Paquin wrote, “It was an utter privilege to work with the phenomenally talented and deeply kind soul .@OfficialNelsan I’m devastated by his untimely death.” Her husband and “True Blood” co-star Stephen Moyer told fans, “Nelsan Ellis was truly remarkable. A brilliant, charismatic, intelligent, soulful, wonderful dude. this is just completely tragic.”\n\nTrue Blood author Charlaine Harris tweeted, “I am so sad about the death of Nelsan Ellis, a great talent gone too soon. Such a shock.” TV show creator Alan Ball said, “Nelsan was a singular talent whose creativity never ceased to amaze me. Working with him was a privilege.” HBO also said in a statement, “We were extremely saddened to hear of the passing of Nelsan Ellis,. Nelsan was a long-time member of the HBO family whose groundbreaking portrayal of Lafayette will be remembered fondly within the overall legacy of True Blood. Nelsan will be dearly missed by his fans and all of us at HBO.”", "images": ["https://i.iheart.com/v3/re/new_assets/f79fc341-a979-4863-81b0-eea1ddc6e07b", "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "https://amplifypixel.outbrain.com/pixel?mid=004d2133385513d6a3dbfd9993b43474ab", "https://i.iheart.com/v3/re/assets.brands/5c2e313ba12b6e78c8eeefdb?ops=gravity(\"center\"),maxcontain(150,52),quality(80)", "http://b.scorecardresearch.com/p?c1=2&c2=6036262&cv=2.0&cj=1", "http://i.iheart.com/v3/re/new_assets/57d1caf936ce620b3fa9e66f"], "top_img": "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "keywords": [], "authors": ["Shari Weiss"], "canonical_link": "https://www.iheart.com/content/2017-07-08-celebrities-react-nelsan-ellis-dead-at-39/", "title": "Celebrities React: Nelsan Ellis Dead At 39", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The actor, best known for starring on “True Blood” and “Elementary,” died at age 39.", "thumbnail": "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "keywords": "variety, Celebrity gossip, Entertainment, music, contests, news, giveaways, variety, Celebrity gossip, Entertainment, music, contests, news, giveaways", "og": {"title": "Celebrities React: Nelsan Ellis Dead At 39 | STAR 94.1", "type": "article", "image": "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "url": "https://star941fm.iheart.com/content/2017-07-08-celebrities-react-nelsan-ellis-dead-at-39/", "description": "The actor, best known for starring on “True Blood” and “Elementary,” died at age 39.", "locale": "en_us", "site_name": "STAR 94.1"}, "twitter": {"card": "summary_large_image", "url": "https://star941fm.iheart.com/content/2017-07-08-celebrities-react-nelsan-ellis-dead-at-39/", "site": "@Star941FM", "creator": "@Star941FM", "title": "Celebrities React: Nelsan Ellis Dead At 39 | STAR 94.1", "image": "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "description": "The actor, best known for starring on “True Blood” and “Elementary,” died at age 39.", "domain": "star941fm.iheart.com"}, "parsely-title": "Celebrities React: Nelsan Ellis Dead At 39 | STAR 94.1", "parsely-link": "https://www.iheart.com/content/2017-07-08-celebrities-react-nelsan-ellis-dead-at-39/", "parsely-image-url": "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "parsely-tags": "variety, Celebrity gossip, Entertainment, music, contests, news, giveaways, variety, Celebrity gossip, Entertainment, music, contests, news, giveaways", "parsely-type": "post", "msapplication-TileImage": "https://i.iheart.com/v3/re/new_assets/5961500901a6b4d301784ee7?ops=gravity(%22north%22),fit(740,416),quality(65)", "google-site-verification": "p2FWrUKxtwBmQgHV4CjD80oKdZZBjmMNByoWvZMsYso", "msvalidate.01": "E98E323249F89ACF6294F958692E230B", "format-detection": "telephone=no", "application-name": "STAR 94.1", "msapplication-TileColor": "#fff", "fb": {"pages": 101142779935339, "app_id": 114693951941329}, "parsely-pub-date": "2017-07-08T21:29:00.000Z", "parsely-author": "Shari Weiss", "parsely-section": "ent-news-urban-ac"}, "movies": [], "publish_date": 1499443200.0, "source": "http://star941fm.iheart.com", "summary": ""}