{"url": "en.wikipedia.org/wiki/Julie_Bowen", "text": "American actress\n\nJulie Bowen Luetkemeyer (born March 3, 1970)[1] is an American actress. She is best known for playing Aunt Gwen on Dawson's Creek (2000), Carol Vessey on Ed (2000–04), Denise Bauer on Boston Legal (2005–07), Sarah Shephard on Lost (2005–07), and Claire Dunphy on the comedy Modern Family (2009–2020). The last earned her six nominations for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series (2010–2015), winning in 2011 and 2012.\n\nBowen has also appeared in films such as Happy Gilmore (1996), Multiplicity (1996), Venus and Mars (2001), Joe Somebody (2001), Kids in America (2005), Sex and Death 101 (2007), Crazy on the Outside (2010), Jumping the Broom (2011), and Horrible Bosses (2011).\n\nEarly life [ edit ]\n\nBowen was born in Baltimore, Maryland,[1][2] the middle of three daughters of Suzanne (née Frey) and John Alexander Luetkemeyer Jr., a commercial real estate developer.\n\nRaised in suburban Ruxton-Riderwood, Maryland, Bowen first attended Calvert School, then Garrison Forest School and Roland Park Country School,[3][4] and also attended St. George's School in Newport, Rhode Island. She studied at Brown University, majoring in Italian Renaissance studies.[5] She spent her junior year in Florence, Italy.[2] During college, she had roles in Guys and Dolls, Stage Door, and Lemon Sky. Before graduating, she had the lead role in the independent film Five Spot Jewel. Among other places, Bowen studied acting at the Actor's Institute.\n\nCareer [ edit ]\n\nBowen in 2009\n\nBowen had a role in the soap opera Loving (1992) and an episode of the college drama Class of '96 (1993). She had the lead role in the television film Runaway Daughters (1994). She played the love interest of the title character in Happy Gilmore (1996).[2] She appeared in the films Multiplicity (1996) and An American Werewolf in Paris (1997). She has had guest roles on television series such as Party of Five (1996) and Strange Luck (1996).\n\nBowen had a recurring role as Roxanne Please on ER (1998–99). She first gained prominence on the television series Ed (2000–04), where she played high school English teacher Carol Vessey. She then guest starred as Sarah Shephard in five episodes of Lost (2005–07). She also played attorney Denise Bauer on the series Boston Legal (2005–08), and had a recurring role on Weeds (2008). She was a spokesmodel for Neutrogena, most recently advertising the Pure Glow products. She appeared on an episode of Celebrity Jeopardy! on August 31, 2010.\n\nSince 2009, Bowen has starred as Claire Dunphy on the ABC sitcom Modern Family. For her portrayal, she received six consecutive Primetime Emmy Award nominations for Outstanding Supporting Actress in a Comedy Series (2010–15), winning the award in 2011 and 2012. Bowen told an interviewer that winning an Emmy is more like \"German soldiers in the trenches of the world wars,\" and that \"when you win the award, it is like being pulled out of the trench.\" She also stated that \"as exciting and wonderful as it is not to be in the trench, and to be recognized for what you do, it also means everyone has got a clear shot at you and that is a very frightening prospect for most of us.\"[6]\n\nPersonal life [ edit ]\n\nBowen at the 25th Annual \"A Time for Heroes\" Celebration in October 2014\n\nBowen suffers from the cardiovascular condition bradycardia in which her regular heartbeat is below normal. As a result, she has worn a pacemaker since her early twenties.[7]\n\nBowen married Scott Phillips, a real estate investor and software developer, on September 9, 2004. The couple has three sons, the first born in April 2007, and twins born in May 2009, with whom she was visibly pregnant when shooting the pilot for Modern Family.[8] She is a self-described \"low Protestant.\"[9] In February 2018, she filed for divorce from Phillips[10] which was finalized on September 13, 2018.[11]\n\nBowen has stated that motherhood has made her a lot more conservative.[12] In 2002, Bowen donated $1,000 to the campaign of Republican Helen Delich Bentley for Maryland's 2nd district in the U.S. House of Representatives.[13]\n\nIn 2016, Bowen appeared in \"Fight Song\", a Pitch Perfect-inspired music video, shown at the Democratic National Convention, in support of candidate Hillary Clinton.[14]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/e/e2/Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Julie_Bowen_2009.jpg/170px-Julie_Bowen_2009.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg/220px-Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Julie_Bowen_Oct_2014_%28cropped%29.jpg/170px-Julie_Bowen_Oct_2014_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/ETalk2008-Julie_Bowen_ALT.jpg/170px-ETalk2008-Julie_Bowen_ALT.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Julie_Bowen", "title": "Julie Bowen", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}