{"url": "https://www.inquisitr.com/4441602/heidi-montag-and-spencer-pratt-talk-future-play-dates-with-the-hills-kids/", "text": "Soon-to-be parents Heidi Montag and Spencer Pratt are just a few short weeks away from welcoming their first baby. Just recently, another former ‘Hills cast member, Lauren Conrad welcomed her first child, a baby boy named Liam Tell. Now, at 31-weeks-pregnant, Heidi Montag is counting down the days until she gives birth to her son. Now, the longtime reality TV couple are closer than ever to becoming parents.\n\n“It’s too much for me!… I think I’m just adjusting to the level of anxiety I’m dealing with. This is terrifying.”\n\nFor her first pregnancy, Heidi said she’s feeling pretty good. The mom-to-be is trying to work out a little more by swimming.\n\n“I’m feeling good. I’m trying to work out a little bit more… swimming to flip the baby’s position inside.”\n\nSpencer and Heidi have finally chosen a name for their first born, but has chosen not to reveal the unique baby name just yet.\n\n“We have a name as of right now, so that’s exciting… It’s very original.”\n\nThe former reality television stars decided on a name after much thought even though Spencer wanted something more extravagant, “I definitely wanted Speidi. At least a middle name!”\n\nThe baby’s name is as Pratt said, “Not as flashy as I would like.” Heidi Montag added, “We came to a common ground.”\n\nhttps://www.instagram.com/p/BVs26rtDuQG/?hl=en&taken-by=heidipratt\n\nPotential play dates with The Hills co-stars and their little ones are more of a reality now that Whitney Port is now the proud mom to son Sonny Rosenman, Kristin Cavallari has three kids of her own and Audrina Patridge recently celebrated daughter Kirra Bohan’s first birthday.\n\nHeidi and Spencer, who wed in 2008, recently returned from a babymoon in Hawaii where they celebrated Pratt’s 34th birthday.\n\nhttps://www.instagram.com/p/BW-nnOYDQez/?hl=en&taken-by=heidipratt\n\nSpencer joked about his son being marriage potential for Kristin Cavallari’s little girl, Saylor Cutler, down the line.\n\n“We got NFL superstar [Jay Cutler], Kristin Cavallari. Go marry into that family, please. And Kristin hooked Heidi and I up, so it would make sense… Liam, Sonny. We got the whole squad. I’m hoping they get their own series—The Hills Nickelodeon.”\n\nKristin Cavallari, the 30-year-old is a mother to three: son Camden, 4, and Jaxon, 3, as well as daughter Saylor, 1, has had practice in the motherhood realm and gave her former co-stars some tips on parenting.\n\n“When Audrina was pregnant, she reached out a lot and asked me some questions, like what pregnancy jeans I liked, and that kind of stuff… I’ve talked to her since she’s had the baby and she sounds like she’s just loving life. For Heidi, I put together a little list of different products and toys that I’ve loved and sent that over to her.”\n\nA major piece of advice that Cavallari shared with Today was that with her three kids, she realized each child is different and every person in every family is different so it’s important for parents to remain open-minded. Cavallari said at the end of the day a mom must do what she thinks is best for her child and trust “your gut feelings.”\n\nSpencer Pratt and Heidi Montag are already joking about their future son marrying Kristin Cavallari's daughter. https://t.co/We48Xu0CaI pic.twitter.com/jpmdBwSQ9B — E! News (@enews) August 20, 2017\n\nMontag revealed to Us magazine that she’s looking forward to watching their son develop his own interests whether they be Micky Mouse or ballerinas.\n\n“I’m really excited for his personality and his little smile… I’m excited to take him to Disneyland and to see if he’s into dinosaurs, Mickey Mouse or ballerinas — it can be anything. Maybe he’ll be the best dancer!”\n\n[Featured Image by Jerod Harris/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/08/heidi-montag-the-hills-spencer-prarr-baby-laguna-beach-reunion-lauren-conrad.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://secure.gravatar.com/avatar/c620e1af7745c39399a9f7e6fb74db6e?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Ashley Hoffman"], "canonical_link": "https://www.inquisitr.com/4441602/heidi-montag-and-spencer-pratt-talk-future-play-dates-with-the-hills-kids/", "title": "Heidi Montag And Spencer Pratt Talk Future Play Dates With ‘The Hills’ Kids", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}