{"url": "www.cynopsis.com/051917-industry-reacts-to-death-of-roger-ailes-snl-vet-heads-for-earlier-pastures-catherine-zeta-jones-turns-to-drugs-for-lifetime-movie/", "text": "A CYNOPSIS MESSAGE FROM TURNER THE EXPERIENCE IS … Powerful storytelling. Trusted environments. Unparalleled ad capabilities that drive results.\n\nGroundbreaking partnerships. Fans at the center. TURNER is reimagining advertising to simplify your world and deliver solutions that allow:\n\nContent to drive innovation. Technology to ignite fandom. Creating experiences that matter. TURNER THE EXPERIENCE IS EVERYTHING. TBS | TNT | truTV | CNN | HLN | Adult Swim | Cartoon Network | Boomerang | Turner Sports CYNOPSIS Good morning. It’s Friday May 19, 2017 and this is your first early morning briefing.\n\nTonight’s Premieres: A&E: Live PD: Police Patrol at 9p Syfy: 12 Monkeys at 8p Travel: Josh Gates’ Destination Truth at 9p Tonight’s Finales: ABC: The Toy Box at 8p CBS: Undercover Boss at 8p Saturday’s Premieres: Food: Great Food Truck Rally at 2p HGTV: We Bought the Farm at 11p and 11:30p Reelz: Autopsy: The Last Hours Of… at 8p World: American Epic at 8p Saturday’s Finales: CBS: Training Day at 9p HGTV: Lakefront Bargain Hunt Renovation at 9p Sunday’s Premieres: Fyi: Scraps at 10:30p Reelz: The Shocking Truth at 9p Showtime: Twin Peaks: The Return at 9p Travel: Food Paradise at 8p Sunday’s Finales: AMC: Into the Badlands at 10p CBS: Madame Secretary at 9p, Elementary at 10p Food: Iron Chef Gauntlet at 9p Fox: The Simpsons at 8p, Making History at 8:30p, Family Guy at 9p HGTV: Island Life at 10p and 10:30p ID: Scene of the Crime with Tony Harris at 10p PBS: Call the Midwife at 8p Syfy: 12 Monkeys at 10p A CYNOPSIS MESSAGE FROM ESPN LET’S BE UP FRONT When it comes time to measure up, we rely on third party validation. We don’t grade our own homework. Click for more UP FRONT truth from ESPN . IN THE NEWS The passing on Thursday of former Fox News chairman and CEO Roger Ailes, a TV news pioneer and player in Republican politics who founded FNC in 1996 and resigned in the wake of sexual harassment allegations last summer, prompted a wide range of responses. Said Rupert Murdoch, executive chairman of 21st Century Fox, “ A brilliant broadcaster, Roger played a huge role in shaping America’s media over the last thirty years.” Weighed in Slate, “We live in the world Roger Ailes broke.” Offered MSNBC’s Joy Reid via Twitter, “So Roger Ailes has died. Lots to unpack in that obit.” Ailes, who was 77, died from complications of a fall in his home. A ticker outside the news net’s midtown Manhattan office said yesterday, “A giant passes.” Saturday Night Live will have to find a new Drunk Uncle. With his comedy, Me, Myself & I, picked up by CBS, SNL staple Bobby Moynihan is leaving the NBC sketch show after 9 seasons. Season finale airs tomorrow. The FCC is proposing to do away with the main studio rule, requiring each TV station to have a main studio near its local community. The idea behind the rule, adopted over 70 years ago, was to keep stations accessible to the community, before modern technology made such communication easier. “Broadcasters have shown that the main studio rule is a continuous cost that keeps them from serving their local communities in meaningful ways, like broadcasting additional local programming,” said FCC chairman Ajit Pai on Thursday. “Today’s notice is an important step toward bringing the FCC’s media rules into the digital age.” Instead of spending money on a “for your consideration” Emmy push, the creative team behind CBS comedy Mom is making a $250,000 donation to launch a public support campaign for political target Planned Parenthood. Series star Allison Janney and co-creator/EP Chuck Lorre broke the news on CBS This Morning yesterday. Bobby Moynihan’s leaving Saturday Night Live after 9 seasons. Which SNL alum do you miss most? Let us know in the new Cynopsis poll: http://cynopsis.com/poll/ A CYNOPSIS MESSAGE Don’t miss this critical webinar next week webinar on Tuesday, May 23 at 1:30 , and get exclusive advice on determining which issues will be meaningful to your target audience. Featuring Young & Rubicam’s Shelly Diamond, Chief Client Officer and Belle Frank, Chief Strategy Officer, and from AT&T, we’ll have Brynne Dunn Jones, Senior Manager of Corporate Social Responsibility. Join us for the How to Program & Market a Winning Social Good Strategy and get exclusive advice on determining which issues will be meaningful to your target audience. Featuring REGISTER NOW and discover how doing good is good business\n\nPRODUCTION & DEVELOPMENT\n\nLifetime ordered original movie Cocaine Godmother, starring Catherine Zeta-Jones as drug kingpin Griselda “Black Widow” Blanco. Crime drama from Asylum Entertainment goes into production this year for a 2018 debut. ITV America signed Smith Entertainment to an exclusive pod deal through which former NBA star and basketball analyst Kenny “The Jet” Smith (Inside the NBA) and his wife and producing partner, Gwendolyn Osborne-Smith (The Price Is Right), will create and produce series across a range of genres, under the ITV America banner. The Dark Crystal: Age of Resistance was picked up by Netflix. Fantasy series prequel to the 1982 film starts shooting this fall. UPFRONTS And then there was one. The CW’s presentation of its fall slate at the New York City Center began with Muse playing their new single, “Dig Down,” part of a new network “image campaign,” said Rob Tuck, EVP of national sales. “The CW has evolved from a linear network to a broadcast-digital hybrid to true multi-platform success,” said net president Mark Pedowitz, adding that the lineup is “better and broader than it’s ever been.” The fall schedule has new military drama Valor following Supergirl on Mondays. The Flash returns Tuesdays at 8, with DC’s Legends of Tomorrow at 9p. After Riverdale on Wednesdays is a reimagined and “deliciously decadent” Dynasty, while Arrow and Supernatural go back-to-back on Thursdays. Fridays bring Crazy Ex-Girlfriend followed by Jane the Virgin, moving to a new night at 9p. Life Sentence, starring Lucy Hale (Pretty Little Liars) and DC series Black Lightning are set for midseason. A 4-series superhero crossover event will take place in the fourth quarter, and season 13 of Supernatural will include a special animated Scooby-Doo episode. Digitally speaking, Everwood will be available to stream on CW Seed June 1 and the original Dynasty will be added August 1, ahead of the linear premiere of its reboot. Machina’s Chasing the Cup returns in the fall as part of CW’s quarterly eSports specials. NEW SERIES Bravo’s Real Estate Wars debuts Thursday, July 6 at 10p. Docu-series dives into cutthroat turf battles in Orange County, CA. Smithsonian Channel takes a swing at telling the story of primates in Amazing Monkeys , premiering Wednesday, June 14 at 8p. COMING UP Jane Pauley will anchor a special edition of CBS Sunday Morning’s “By Design” from Amsterdam May 21 at 9a. In addition to tulips, the design-themed broadcast will feature sit-downs with Jessica Simpson and Bette Midler. Nicki Minaj will open the 2017 Billboard Music Awards, broadcast live on both coasts Sunday, May 21 at 8p ET on ABC. Minaj will be joined by Jason Derulo, David Guetta and Lil Wayne for a 9-minute performance. AXS TV remembers Soundgarden’s Chris Cornell, who died May 17 at age 52, with a special broadcast of Sound Off with Matt Pinfield: Chris Cornell tomorrow, May 20 at 7:30p, with encores on Sunday and Monday. ADVERTISING & BRANDS The U.S. advertising market dipped 1% in April, according to Standard Media Index. Among those bucking the trend was social media, up 12%. Another winner: cable news, with Fox News up 12%, CNN rising 16% and MSNBC up 63%. Vera Bradley is teaming with new TLC reality competition Girl Starter, aimed at empowering young entrepreneurs. Tonight’s episode features the brand’s co-founder and CCO, Barbara Bradley Baekgaard, as a guest judge. The TV Upfront market will be up in the low-to-mid single digits in CPM price increases, projected UBS after interviewing 39 ad execs. The survey points to volume being flat-to-down. “Advertisers indicated that the sports category will see the greatest increases and broadcast prime and news would see declines,” said UBS, which also noted advertiser interest was piqued by upcoming Viacom net Paramount Channel. GOING GLOBAL A+E Networks and Lionsgate expanded their long-term U.S. home entertainment partnership with a new deal covering worldwide physical DVD distribution rights for A+E’s portfolio of brands. As part of the multi-year agreement, Lionsgate will distribute a range of scripted, factual and movie content from A+E Networks’ catalogue across packaged media platforms around the world. DIGITAL DATA Sundance Now will premiere season 3 of French spy series, The Bureau, along with a companion chat show. Streaming starts June 22. A CYNOPSIS MESSAGE Give your team’s Rising Star well-deserved recognition The Cynopsis Rising Star Awards program is designed to encourage and reward exceptional accomplishment, shining a light on young professionals with the smarts, maturity, and drive to become industry leaders. We look forward to honoring these young innovators with an award at our annual awards reception in September as well as added recognition on Cynopsis.com and throughout our social media platform (Twitter, LinkedIn, Facebook, Instagram). The deadline is June 21 – Nominate today ! RATINGS Part 4 of Bravo’s The Real Housewives of Atlanta reunion was the most watched (P2+) episode in 2+ years and the most watched reunion in 3+ years, earning 2.4 million P18-49 (up +15% versus the prior week’s episode). Southern Charm delivered a series high among all key demos, including 1.1 million P18-49, up +19% versus the prior week, while Below Deck Mediterranean delivered 889,000 in the demo, up +24%. The season 20 premiere of Oxygen’s Snapped was the highest rated episode since the season 16 launch in 2015 among W25-54 (228,000), with 507,000 total viewers. The series finale of CBS’s Criminal Minds: Beyond Borders dipped to a series low 4.1 million total viewers. The spin-off had a 2-season run. Live + Same Day Household Ratings: Wednesday, May 17, 2017 time-period averages Source: NTI, Galaxy as dated Live+SD CBS: 3.6/7 Survivor 4.9/9, Criminal Minds 3.2/6, Criminal Minds: Beyond Borders 2.8/5 NBC: 3.5/7 Blindspot 2.8/5, Law & Order: SVU 3.6/6, Chicago P.D. 4.2/8 ABC: 3.2/6 The Goldbergs 3.2/6, Speechless 2.8/5, Modern Family 3.7/7, Downward Dog 2.9/5, Designated Survivor 3.2/6 FOX: 3.0/6 Shots Fired 2.0/4, Empire 4.0/7 UNIVISION: 1.0/2 La Reina de la Cancion .9/2, La Doble vida de Estela Carrillo 1.0/2, La Piloto 1.0/2 CW: .7/1 Arrow .9/2, The 100 .6/1 TELEMUNDO: .6/1 El Capo .6/1, La Querida del Centauro .6/1, La Querida del Centauro .6/1 Wednesday A19-49: FOX 1.5/6, ABC 1.3/5, NBC 1.1/4, CBS 1.0/4, UNI .6/2, CW .4/2, TELE .4/2 Friday Fun Fact: U.S. Congress voted to pay President George Washington a salary of $25,000 a year, or 2% of the total U.S. budget in 1789. This Day in History: 1848 – Mexico ended the Mexican-American War, started in 1845 when the U.S. annexed Texas, by signing the Treaty of Guadalupe Hidalgo. Answer to Our Last Trivia Question: Which short-lived series featured Hugh Jackman and Melanie Griffith? Viva Laughlin (2007). Kudos to: Bob Telford-SAG/AFTRA/Valley Village, CA, Elizabeth Wendorf-Blackwood Seven/LA, Cynthia New-Spectrum Reach/Cape Girardeau, MO, Synda Kollman-Charter Marketing Group/Deerfield Beach, FL, Susan Nessanbaum-Goldberg-M and S Entertainment/LA, David Garber-Loyola Marymount University/Playa Vista, CA, Tim Dempsey-FOX Networks Group/NYC, Andy Pittman-TAMU/College Station, TX, Ken DuBow-Bob’s Your Uncle/Cannes Today’s Trivia Question: What was the second spin-off of The Mary Tyler Moore Show (1970-1977)? (Email trivia@cynopsis.com with your answer and be sure to include your name, company, city and time zone. Unofficial rules: a limit of four correct answers from each time zone will be selected.) Answer to Our Last Anagram: Tool Pail = La Pilato. Kudos to: Tom Moore-Kalt Productions/LA, David Stern-BARD Entertainment/NYC, Current Series Anagram: A Hostile Grin (Email trivia@cynopsis.com with your answer; first three respondents with the correct answer who aren’t in trivia will be posted in tomorrow’s newsletter.) Lynn Leahey\n\nEditorial Director\n\n@Lynn_Leahey Roberta Caploe\n\nPublisher\n\n@robertacaploe Diane K Schwartz\n\nSenior Vice President\n\nMedia Communications Group Cynopsis Ad Sales\n\nMike Farina | 203-218-6480\n\nVP, Sales Cynopsis Job Listings Sales\n\nTrish Pihonak | 203-899-8459\n\nDirector of Operations CYNOPSISJOBS – For More jobs, please visit Cynopsis.com JOB OPENING: POWERHOUSE ON-AIR PROMOPRODUCER/WRITER/DIRECTOR /TCM & FILMSTRUCK/ATL: Seasoned Player/Coach needed for 2 acclaimed movie brands. Min 6-8 yrs promo prod exp in entertainment, brdcst or cable TV w/4-5 yrs conceptualizing/writing/prod promos for multiple platforms. Full info/apply HERE (5/26) JOB OPENING: AD SALES ASST /FUSE Media/NY: Recent grad w/previous ad sales/adv internship exp. to asst ad sales dept. Strong Excel & multi-tasking a +. Good comm, interpersonal & organzt’l skills. Apply HERE (5/26) JOB OPENING: AD SALES ASST /FUSE Media/Chicago: Recent grad w/previous ad sales/adv internship exp. to asst ad sales dept. Strong Excel & multi-tasking a +. Good comm, interpersonal & organzt’l skills. Apply HERE (5/26) JOB OPENING: ANALYST, DIGITAL ANALYTICS /CNBC: Passionate, motivated candidate for Digital Analytics team. Synthesize user data to provide actionable insights to key stakeholders. Partner w/teams across orgnztn, incl IT, Product, & Edit to understand stakeholder needs, devise measurement plans & report on site & feature performance. Apply HERE (5/26) JOB OPENING: SALES PLANNER TV /DIGITAL/GSN TV/Santa Monica: Hybrid role Sales assistant/planner. 2+ yrs’ experience. Advanced training in Powerpoint, Excel, bus writing; Familiar with Wide Orbit; BA Degree. Send res and CL gsnadsales@gmail.com (5/26) JOB OPENING: DEVELOPMENT EXEC : For short-term project w/potential for more. Established NY prodco. Generate ideas, find talent. Proposal writing a plus. gmtvny@yahoo.com (5/26)\n\nJOB OPENING: SR PLANNER /Z LIVING cable network/NYC: Immediate opening. Create/maintain sales plans, assisting AEs & SVP w/ sales presentations & projects as needed. 5 yrs’ exp at a nat’l cable network, w/min 3 yrs in a planner position. Exp w/Wide Orbit creating plans pref’d. Resume/cover: HERE (5/25) JOB OPENING: BROADCAST/IT Engineer /NBCU/East Coast: Support day to day broadcast television, digital and IT/IP operations, Assist with implementation of software upgrades and system expansions, perform periodic maintenance. Full info/apply HERE (5/25) JOB OPENING: ANALYST-PRICING & PLANNING /Marathon Ventures/NYC: Work directly w/heads of sales & pricing to identify key revenue drivers in Direct Response TV AdSales. Must be detail-oriented w/strong data, excel skills. Resumes/Info: HERE (5/25)\n\nJOB OPENING : PRODUCT SUPPORT SPECIALIST /WO NETWORK /NYC: Dedicated support for 1 of our largest clients. Educate/support w/questions regarding use of WO Network, troubleshoot system issues, identify & doc software defects, handle req’s. 2+ yrs exp cable network w/in sales or traffic dept. Full info/apply HERE (5/24) JOB OPENING : SPONSORSHIP SALES e-sports /NYC: Responsible for driving sponsorship revenue for mega esports events (US/Int’l). Candidate should have 7+ yrs of relevant exp. & knowledge of esports space. Resumes: aegtalentmanagement@aegworldwide.com (5/24) JOB OPENING: DIRECTOR RESEARCH /Discovery/LA : Leads all prim rsrch (qual/quant) for Discovery. Devel focus grps, consmr panels, srvys. Work with prgmg, prod, and mktg to execute pilot & mktg tests, genre studies, series maint. Strat advisor to ntwrk exec mgt team. Present findings through written and presentations. APPLY (5/23)\n\nJOB OPENING: SR AD SALES RESEARCH ANALYST /Travel Channel & GAC/NYC: Partner w/Ad Sales team to produce actionable insights, compelling stories & persuasive network positioning. Bachelor’s degree & 3+ yrs of media rsrch exp. Expertise w/Nielsen, Star Media, MRI, Simmons, & Kantar systems. Full info/apply HERE (5/20) JOB OPENING: INVENTORY CONTROL MANAGER/NBC/East Coast: Inventory Control Manager – max station’s revenue. Minimum of 3 years of Television traffic exp & exp with Wide Orbit traffic system. Full info/apply HERE (5/20)\n\n\n\nJOB OPENING: TRAFFIC COORDINATOR/Z LIVING TV/NYC: Assist Ad Sales team in the management of traffic functions. Copy/material assignment, log placements, meeting daily traffic operations deadlines, as well as office manager and other duties that may be assigned. Cover/resume HERE (5/20) JOB OPENING: MARKETING MGR/UP TV/ATL: 3+ creative media exp. at cable network. Exp. dev. mkting strategies & creative briefs. Exp. working w/ creative agencies and executing campaigns. Must have budget mgt exp. Exp. managing media trafficking for off channel. Apply HERE (5/20) WHAT’S ON TONIGHT – FRIDAY MAY 19, 2017\n\nABC: The Toy Box [ f ], 20/20\n\nCBS: Undercover Boss [ f ], The New I Love Lucy Superstar Special, Blue Bloods [r]\n\nCW: The Originals, Reign\n\nFOX: Maid in Manhattan\n\nNBC: First Dates, Dateline NBC PBS: Washington Week, Charlie Rose – The Week, American Masters, American Masters [r] Telemundo: El Capo, La Querida del Centauro, La Querida del Centauro\n\nUnivision: La Rosa de Guadelupe, La Doble vida de Estela Carrillo, La Piloto", "images": ["https://www.cynopsis.com/wp-content/uploads/2017/05/roger-ailes.png", "https://www.cynopsis.com/wp-content/uploads/2015/10/jobs10-280x168.jpg", "https://www.cynopsis.com/wp-content/uploads/2020/04/nbamicrosoft-280x210.jpg", "https://ad.doubleclick.net/ddm/activity/src=6418530;type=cynop0;cat=cynop0;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;npa=;ord=1?", "https://www.cynopsis.com/wp-content/uploads/2020/04/bmw-280x210.jpg", "https://api.b2c.com/api/noscript-2886ngru5uzeozmbr3v.gif", "https://www.cynopsis.com/wp-content/uploads/2020/04/screen-shot-2020-04-15-at-3-26-52-pm-280x182.png", "https://www.cynopsis.com/wp-content/uploads/2020/04/amc-upfront-280x185.png"], "top_img": "https://www.cynopsis.com/wp-content/uploads/2017/05/roger-ailes.png", "keywords": [], "authors": ["Cynopsis Media"], "canonical_link": "https://www.cynopsis.com/051917-industry-reacts-to-death-of-roger-ailes-snl-vet-heads-for-earlier-pastures-catherine-zeta-jones-turns-to-drugs-for-lifetime-movie/", "title": "05/19/17: Industry weighs in on shocking death of former Fox News chief", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Industry reacts to death of Fox News chief Roger Ailes", "og": {"locale": "en_US", "type": "article", "title": "05/19/17: Industry weighs in on shocking death of former Fox News chief", "description": "Industry reacts to death of Fox News chief Roger Ailes", "url": "https://www.cynopsis.com/051917-industry-reacts-to-death-of-roger-ailes-snl-vet-heads-for-earlier-pastures-catherine-zeta-jones-turns-to-drugs-for-lifetime-movie/", "site_name": "Cynopsis Media", "updated_time": "2017-05-19T06:41:28-04:00", "image": "https://www.cynopsis.com/wp-content/uploads/2017/05/roger-ailes.png"}, "article": {"section": "Cynopsis", "published_time": "2017-05-19T06:17:58-04:00", "modified_time": "2017-05-19T06:41:28-04:00"}, "generator": "EventON 2.3.19", "wp-parsely_version": "1.10.2"}, "movies": [], "publish_date": 1495189078.0, "source": "http://www.cynopsis.com", "summary": ""}