{"url": "https://web.archive.org/web/20180924183531/https://www.babygaga.com/15-kids-who-wont-inherit-a-dime-from-their-celeb-parents-and-5-who-are-already-millionaires/", "text": "While many of us have no choice but to work hard for every dollar we earn, others have the benefit of knowing that they will someday inherit a small fortune from their wealthy family members. Of course, not everyone has the advantage of coming from a life of privilege and prestige but in some cases even the ones who do aren’t always assured financial security just because they were born into it. In fact, it has become quite a popular trend for affluent parents to actually disinherit their own children in favor of them having to earn their money the old fashioned way. While some entitled offspring may argue that being cut out of their mother and father’s will is unfair to say the least, these parents are no strangers to the methods of tough love and will stop at nothing to make sure that their offspring don’t grow to become lazy and entitled adults.\n\nIt would be easy to argue the plus sides to not giving children millions of dollars that they haven’t actually earned on their own, but there are still some celebrities and business moguls who firmly believe in giving everything they’ve acquired to their children in the event that they pass away. There have been plenty of famous kids who have already fallen into a fortune when it comes to their substantial inheritance, making them millionaires (and even billionaires) before they are old enough to vote. Here are 15 kids who won’t inherit a dime from their super rich parents...and 5 who are already millionaires.\n\nadvertising\n\n20 Mila And Ashton Tell Their Kids They’re ‘Poor’\n\nLong before Mila Kunis and Ashton Kutcher even gave much thought to reproducing they both agreed to raise their future children with a strong set of values. Ranking high up on their list, the couple vowed to not allow their kids to become spoiled brats, and that meant not letting them leech off of their parent’s wealth. According to Kunis, teaching her little ones about how hard work pays off is “so important because we both came from pretty solid poverty backgrounds and grew up very poor and are very much self-made and are very aware of what a dollar is worth. Nothing’s been handed to us.” The actress made it quite clear that them from a very early age that her kids won’t be entitled to any of their famous parents’s earnings and even said that she sometimes tells them, “Mommy and Daddy may have a dollar, but you’re poor. You are very poor, you have nothing. Mommy and Daddy have a bank account.”\n\n19 Gordon Ramsay Refuses To Raise Trust-Fund Kids\n\nadvertising\n\nWith a hearty net-worth of around $54 million, it’s safe to say that Gordon Ramsay is pretty rich in his own right. Of course, that money didn’t just fall out of the sky and the sassy chef turned reality star worked his tail off in order to acquire all of his monetary gains. The father of four is the proud papa of daughters Megan and Matilda as well as teenage twins Jack and Holly, but don’t be confused – Ramsay plans on leaving absolutely nothing to his kiddos in his will.\n\nThe trash-talking food aficionado stated, “My fortune won’t be going to my children”. Ramsay has also been quite vocal about how he raises his kids to be grateful for all they have and to not expect anything from their father in terms of living lavishly. Gordon has even said that when he and his wife fly first-class he makes sure that his children fly coach because they simply haven’t “earned” the right to do so just yet. His methods may seem a bit harsh, but the life lessons he’s teaching his children are something that money can’t buy.\n\n18 Mark Zuckerberg Gave Away 99% Of His Daughter’s Inheritance\n\nMost people already know that Mark Zuckerberg made his fortune as the co-founder of Facebook, but they probably aren’t aware that the self-made billionaire already has plans to leave ninety-nine percent of his overall funds to charities instead of his two children. The computer programmer and entrepreneur is the father of two little girls, Maxima and August, but following the birth of his first daughter Mark pledged to donate the overwhelming majority of his growing fortune to a good cause.\n\nThe star stated his plans to bestow his Facebook shares, currently valued at $450 million to philanthropy instead of his offspring. While that still leaves his kiddos with a pretty penny in terms of potential inheritance, it’s unlikely that Zuckerberg will haphazardly hand money over to his children without having them understand the value working in order to pay for their own lifestyle. It’s pretty safe to say that the Zuckerbergs will be properly schooled in the art of giving and the sheer importance of understanding just how lucky they have it.\n\n17 Already Millionaires: Paris, Prince & Blanket Jackson\n\nadvertising\n\nAs one of the biggest superstars the world has ever seen, Michael Jackson spent the majority of his lifetime as an entertainer and has certainly earned every penny of his massive fortune. After his untimely death in 2009, there was much dispute about the actual value of his earnings and assets, with numbers going as high $500 million. What’s even more extraordinary is that even in the years following his departure, Jackson’s estate has managed to earn millions of dollars in album sales, televised specials and other deals linked to Michael’s name and likeness. Just last year alone, the late King of Pop raked in a staggering $75 million.\n\nOf course, you may be wondering who is reaping the benefits of Jackson’s incredible fortune but the answer is pretty simple: his three children, Paris, Prince, and Blanket have been bestowed a massive sum of money from their beloved father. Jackson left his kids $5 million to split amongst themselves as well as $8 million per year in inheritance. On top of that, all of their major expenses will be covered including $30,000 annually on private school tuition and lavish vacations. Needless to say, the Jackson three are set for life and even though they are only teenagers themselves, they are bona-fide millionaires thanks to their incredible inheritance.\n\n16 Bill Gates' Three Children Have To Work For What They Get\n\nAs one of the most prominent and richest people in the world, businessman Bill Gates has a current net-worth of $90 billion and that number only continues to grow. Despite having more money than most of us could even fathom, the Microsoft mogul insists that his children will have to learn how to fend for themselves when it comes to making their own money. Upon hearing the suggestion that his three children, Jennifer, Phoebe, and Rory, would receive $10 million each in his absence, Gates was quick to shut down talk of a substantial inheritance, saying, “They won’t have anything like that. They need to have a sense that their own is meaningful and important. You’ve got to make sure they have a sense of their own ability and what they’re going to go and do.”\n\nOf course, Gates plans on providing as many opportunities to his children as he can while he’s alive, insisting that he will fund their pricey educations in hopes of setting the foundation for them to expand upon their own careers. Gates stood firm on his stance to not financially support his kids from the great beyond, reiterating, “It’s not a favor to kids to have them have huge sums of wealth. It distorts anything they might do, creating their own path.” In fact, Bill and his wife are so certain of their future plans for their massive fortune that they have publicly proclaimed many times that most of it will be left to various charities instead of their kids.\n\n15 Jackie Chan’s Son Isn’t Getting Anything At All\n\nadvertising\n\nJackie Chan has gone above and beyond to establish himself as a well-rounded martial artist, actor, producer, director, stuntman and even singer…and he definitely has the funds to show for it. Chan is said to be worth an estimated $350 million, but his child won’t be getting a red cent from his famous father’s last will and testament. Jackie, who has fathered a son named Jaycee, is confident that his son won’t be needing any of his hard-earned cash, stating, “If he is capable, he can make his own money.\n\nIf he is not, then he will just be wasting my money”. This kind of logic seems to be the best way for children of celebrities to develop a sense of self-worth instead of living in their famous family member’s shadow. Not surprisingly, the star has also publicly stated that he will leave the entirely of his fortune to charity in the event of his death, leaving nothing for his son to claim as his own.\n\n14 Simon Cowell’s Son Won’t Have Access To His Fortune\n\nAs a judge on American Idol, Simon Cowell became a household name but at that point the music producer has already earned himself an impressive net-worth. All these years later, Cowell has had his hand in establishing some of the biggest names in the entertainment industry and his income has ballooned to a staggering $95 million per year. With a current personal value of over $550 million, one might assume that Simon’s only son, Eric, could someday look forward to inheriting a large chunk of change from his padre, but that couldn’t be any farther from the truth.\n\nWhen asked about whom he planned on bestowing his multi-million dollar bankroll to, the star was quick to confess, “I’m going to leave my money to somebody. A charity, probably — kids and dogs.” Cowell elaborated by saying that he doesn’t “believe in passing on from one generation to another,” making it quite clear that his little guy shouldn’t ever expect to live off of his father’s dime.\n\nadvertising\n\n13 Already A Millionaire: Allegra Versace\n\nadvertising\n\nGrowing up in the stunning city of Milan as the daughter of famed fashion designer Donatella Versace and former fashion model Paul Beck, Allegra Versace has always lived large as an Italian heiress and socialite. While she is sure to take possession of her mother’s astronomical fortune someday, Allegra has already inherited a large sum of money from her late uncle, making her an enviable millionaire when she was only eleven years old. When Gianni Versace unexpectedly died in 1997, he bestowed almost half of his empire to his niece. At the age of eighteen, Allegra was given even more money and power from her uncle’s estate and her personal net-worth skyrocketed to hundreds of millions of dollars. With a recognizable last name like Versace, it’s safe to say that Allegra will be financially set for life. Currently, the heiress has an estimated net-worth of $800 million and we’re all understandably green with envy.\n\n12 Anderson Cooper’s Wealthy Family Won’t Leave Him A Dime\n\nMost people know Anderson Cooper as a recognizable figure on CNN, but the news anchor and journalist actually comes from a long line of well-to-do moguls that have had multiple generations of serious wealth. As a member to the famous Vanderbilt family, Cooper should technically be an heir to the large fortune that his lineage has amassed since the early 1920’s. His ancestors were in the railroad and shipping industry and had acquired millions, with Anderson’s mother inheriting a $5 million trust that she ultimately transformed into a $200 million design empire of her very own. But just because Anderson Cooper comes from significant wealth doesn’t mean that his hands will ever touch any of the money his predecessors have earned. In an interview with Howard Stern, Cooper revealed that he won’t be receiving an inheritance at all, saying, \"My mom's made clear to me that there's no trust fund.\" Cooper seemed to agree with his mother’s decision to leave him absolutely nothing in her absence, stating, \"Who's inherited a lot of money that has gone on to do things in their own life? From the time I was growing up, if I felt that there was some pot of gold waiting for me, I don't know that I would've been so motivated.\" Of course he’s not worried about getting any money from his momma – Anderson has a personal net-worth of his own that’s in the ballpark of around $200 million. Looks like he doesn’t need a trust fund after all!\n\n11 Gene Simmons’ Kids Won’t Be Rich Off His Money\n\nadvertising\n\nAs one of the founding members of the popular rock band, KISS, Gene Simmons is certainly worth a pretty penny. The bassist has actually amassed around $300 million over the course of his career, but his two children aren’t automatically going to get their hands on it when it comes to their inheritance. According to Simmons, his daughter and son, Sophie and Nick, will be taken care of but anything beyond that point will solely become their own responsibility. Speaking candidly on the matter of money, Gene told the media, “In terms of an inheritance and stuff… they will never be rich off my money because every year they should be forced to get up out of bed, and go out and work and make their own way.” Gene wants to make sure that his kids understand that nothing in life comes for free, and he will ensure that they have to put in a little effort if they want to see results. The star elaborated on his beliefs regarding hard work, stating, “I don’t want them to say, ‘Thanks, dad, for making me rich.’ No, you wanna be able to stand on your own two feet and say, “I did that.\"\n\n10 Sting Plans On Spending It All While He Still Can\n\nAs a world-renowned musician, singer and songwriter, Sting has certainly earned every penny of the $300 million fortune he has amassed over the course of his fruitful career. The star is a proud father to three sons and three daughters, but he insists that all six of his children don’t expect to become rich overnight in the event of his eventual demise. In fact, Sting has openly admitted to spending as much as he possibly can in life in the hopes of leaving nothing for his brood to inherit. Sting candidly confessed, “I told them there won’t be much money left because we are spending it. We have a lot of commitments. What comes in, we spend, and there isn’t much left.”\n\nThe music icon wants to ensure that his children will be self-sufficient long after he’s gone and he wants to know that they’ll able to support themselves financially. Despite knowing their father’s net-worth, Sting’s children were never raised holding a silver spoon and that makes their famous father proud. The star recently stated, “They rarely ask me for anything, which I really respect and appreciate. They have the work ethic that makes them want to succeed on their own merit.”\n\n9 Already Millionaires: Victoria & Marlena Laboz\n\nadvertising\n\nVictoria and Marlena Laboz may only be twenty-one and seventeen, but they are already millionaires after their wealthy Manhattan landlord father passed away and bestowed his $37 million fortune to his daughters. Maurice Laboz may have left the entirety of his real estate earnings to his girls, but his generosity didn't come without a few strings attached. The Laboz sisters already have access to a portion of their inheritance, but there are still many incentives to look forward to down the road.While their dad ensured that the sisters won't get at least $10 million of their inheritance until they turn thirty-five, he left specific guidelines for the duo to follow in order to cash-in on the rest of the funds.\n\nLaboz's oldest daughter Marlena will receive $500,000 for getting married as long as her future husband agrees to sign an iron-clad prenup. She will also be bestowed $750,000 if she graduates from an accredited university. The girls' late father also agreed to triple the amount of their annual salaries as well as pay a significant amount of cash once they have children...as long as they are born within wedlock. While Laboz's strict guidelines may seem like a bit much, his methods may be a better alternative than simply giving all of his lifelong fortune to his daughters in one giant lump sum.\n\n8 Kevin O’Leary's Kids Won't Inherit A Single Cent\n\nKevin O’Leary may be known as one of the harshest business-minded investors on the hit show Shark Tank, but his real life persona isn’t much different from the trash-talking heavy hitter he portrays on television. After all, O’Leary didn’t earn his riches from sitting on the sidelines, and he plans on instilling a similar set of values into the lives of his two children. The mogul is said to be worth in the ballpark of $400 million but neither his son Trevor nor his daughter Savannah should expect a substantial payout from their father’s massive fortune.\n\nWhile Kevin is supportive of his kid’s education and will fund whatever educational endeavors they choose to pursue along the way, he has openly admitted that he plans on leaving them absolutely nothing in terms of inheritance. According to O’Leary, “I am not planning on giving my kids any of my wealth. You want to prepare your children for launching their own lives. I tell wealthy parents that if they don’t kick their kids out of the house and put them under the stresses of the real world they will fail to launch – they will become unsuccessful adults. I really believe that.” Guess they don’t call him a ‘”shark” for nothing.\n\n7 Nigella Lawson Is Determined To Give Her Kids Nothing\n\nadvertising\n\nAs a well-known English journalist, TV personality and gourmet food writer, Nigella Lawson is definitely worth a whole lot of moolah. On top of that, Lawson grew up accustomed to a life of privilege since her parents were quite wealthy and seen as elite members of society. While Nigella may have been given a lifestyle that most children and young adults could only dream of, it certainly made her even more aware of the dangers that come along with providing financial perks for youngsters starting from birth. The mother to daughter, Cosmina, and son, Bruno, insists that she won’t be following in her own parents footsteps when it comes to raising her own brood.\n\nWhen it comes to leaving her kids with an inheritance, Nigella wants to hear nothing of the sort. The outspoken star told the press, “I am determined that my children should have no financial security. It ruins people not having to earn money”. Lawson was brutally honest in her interview, admitting that her stance on bestowing” money upon those who hadn’t worked for it had even caused a rift between her and her hubby, stating, \"I argue with my husband, because he believes that you should be able to leave money to your children. I think we'll have to agree to disagree.\" Needless to say, we don’t think Nigella Lawson’s kids should anticipate receiving much financial support from their mom unless they really work for it.\n\n6 George Lucas Plans On Giving His Fortune To Charity\n\nAs the brains behind some of the biggest box office hits ever, including the epic Star Wars franchise, it’s only expected that George Lucas would be worth an incredible amount of money. The filmmaker is said to have a net-worth of around $5.2 billion, but the father of four doesn’t plan on bestowing much of that to his children. Amanda, Everest, Jett and Katie Lucas are all surely aware of their father’s prestige and inevitable wealth, but they shouldn’t expect it to just fall into their lap once he passes away.\n\nAccording to George himself, he plans on donating at least half of his lifelong income to charitable causes instead of handing it over to his kids just for being born to him. Rather than financially providing for only his kids, Lucas plans to leave his legacy to as many children as he possibly can and provided intricate details of his mission in a lengthy pledge letter that was open to the public. Lucas stated, \"I am dedicating the majority of my wealth to improving education. We have to plan for our collective future—and the first step begins with social, emotional and intellectual tools we provide to our children.” We have to commend Lucas for doing his due diligence and helping out those in need…we can only hope his kids feel the same!\n\n5 Already A Billionaire: Athina Onassis\n\nadvertising\n\nSome people can only dream of becoming rich beyond belief at some point in their lifetime, but for Athina Onassis that all became a reality the day of her eighteenth birthday. Onassis is the last living descendant of Aristotle Onassis, the late great shipping tycoon. Upon her grandfather’s death, Athina became a certified billionaire after coming into an estimate $2.7 billion in family funds that included the rights to successful companies, shares and bonds, high-end artwork, lavish island properties and of course, a private jet. These days, many have compared Onassis to a modern day Greek princess, as she has inherited more money and riches than most people could ever fathom. Once the heiress turned twenty-one, she was gifted another $2 billion and was given the title of President of The Onassis Foundation. Although she has surely been accustomed to the finer things in life since birth, the budding billionairess has had full control over her entire family’s incredible fortune since she was just a teenager herself.\n\n4 Andrew Lloyd Webber's Offspring Won't Get A Free Ride\n\nWith an estimated net-worth of around $1.2 billion, Andrew Lloyd Webber indisputably has a substantial bank account. The English composer made his money using his talent and ambition, and his work has been prominently featured on Broadway for well over a decade. Even though he has plenty of cash to be significantly distributed to his five children in the event of his passing, Webber has confessed that he has no plans of leaving them any kind of inheritance from his estate. The star insists that his kids are well-aware that they won’t be receiving any rewards from their old man and that they are actually supportive of his decision, stating, “They aren’t bothered. They don’t think that way. It is about having a work ethic – I don’t believe in inherited money at all.” The father of Nicholas, Alastair, William, Imogen and Isabella has long stressed the importance of developing a strong work ethic, telling the press, “I am not in favor of children suddenly finding a lot of money coming their way because then they have no incentive to work.”\n\n3 Davina McCall Wants Her Kids To Be Appreciative\n\nadvertising\n\nFamed British television producer may be worth several million dollars, but that certainly doesn’t mean that her children will be entitled to any of it. The mother of three children; Holly, Tilly, and Chester, wants to ensure that her offspring are well-equipped to hold their own in the real world without relying on any financial assistance from their parents. The star is steadfast about her children learning the value of a dollar and instilling the importance of hard work in them starting from a young age…and that means they likely won’t collect a dime from McCall’s fortune. Speaking to The Sun, Davina explained her tough love approach, stating, “I look at my daughters now and have painstakingly told them they won’t be inheriting any money. Me and [my husband] plan on spending every penny.” Davina is serious about not raising her children to be dependent on mommy’s money, saying, “I’d hate to have a spoiled brat. I want them to be appreciative”.\n\n2 Pierre Omidyar’s Kids Won’t Be Financially Set For Life\n\nAs the founder of the popular and long-lasting online auction website, eBay, Pierre Omidyar is a certified billionaire. The entrepreneur used his skills and intellect to create a legacy that earned him over $10 billion worth of personal wealth, but the business mogul insists that his three children won’t be allowed to sit idly and live off of daddy’s money. Since he is so wealthy, Omidyar has made philanthropy a major part of his life and aims to instill the same values in his children. Pierre has made it quite clear that the overwhelming majority of his funds will be allotted to various charities instead of being gifted to his own children. Surely his kids understand their father’s desire to give to the less fortunate, especially since his explanation of why he wanted to donate their potential inheritance was rather concise. According to Omidyar, “We have more money than our family will ever need. There’s no need to hold onto it when it can be put to use today, to help solve some of the world’s most intractable problems.”\n\n1 Already A Millionaire: Billie Lourd\n\nadvertising\n\nIn setting out on her career as a Hollywood actress, Billie Lourd’s lineage left her with some seriously big shoes to fill. The star was the granddaughter of the legendary Debbie Reynolds and the daughter of Carrie Fisher, most famous for her iconic role as Princess Leia in the Stars Wars movie series. Lourd was gaining some serious momentum in Tinseltown before her mother’s sudden passing in December of 2016. News of Carrie Fisher’s death was a major blow to her fans all over the world, but perhaps no one took the heartbreak as hard as Debbie Reynolds did. In an even more tragic and unexpected turn of events, Reynolds subsequently passed away one day after Fisher that same year.\n\nFollowing the loss of two longtime major Hollywood power-players, Billie Lourd was left with the challenge of navigating through life without her beloved mother and grandmother. Of course, many began wondering what would happen to Fisher and Reynold’s worldly possessions, and the answer was quite simple. At the age of twenty-five, Lourd inherited nearly $7 million from her late loved one’s estates. In addition to her hefty inheritance, the budding beneficiary was also left with a lucrative life insurance policy, luxury cars, jewelry and the rights to her mother’s image and likeness which are sure to be valued at a pretty penny.\n\nSources: Time.com, CNBC.com, Time.com, Fortune.com, People.com, NYPost.com\n\nGive BabyGaga a Thumbs up!", "images": ["https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://web.archive.org/web/20180924183531im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://web.archive.org/web/20180924183531im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://web.archive.org/web/20180924183531im_/https://www.facebook.com/tr?id=378931439163281&ev=PageView&noscript=1", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/th-logo-full-white.7684e614.svg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://web.archive.org/web/20180924183531im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/12/Untitled-defsign.jpg", "https://web.archive.org/web/20180924183531im_/https://www.babygaga.com/public/build/images/hc-logo-full-white.5f66cfe4.svg"], "top_img": "https://web.archive.org/web/20180924183531im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/12/Untitled-defsign.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180924183531/https://www.babygaga.com/15-kids-who-wont-inherit-a-dime-from-their-celeb-parents-and-5-who-are-already-millionaires/", "title": "15 Kids Who Won't Inherit A Dime From Their Celeb Parents (And 5 Who Are Already Millionaires)", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "These kids won't grow up to become lazy and spoiled adults.", "og": {"title": "15 Kids Who Won't Inherit A Dime From Their Celeb Parents (And 5 Who Are Already Millionaires)", "type": "article", "image": {"identifier": "https://web.archive.org/web/20180924183531im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/12/Untitled-defsign.jpg", "width": 1024, "height": 512}, "url": "https://web.archive.org/web/20180924183531/https://www.babygaga.com/15-kids-who-wont-inherit-a-dime-from-their-celeb-parents-and-5-who-are-already-millionaires/", "locale": "en_US", "description": "These kids won't grow up to become lazy and spoiled adults.", "site_name": "BabyGaga"}, "article": {"published_time": "2017-12-16T22:12:45Z", "section": "Incredible"}, "fb": {"app_id": 270407583294564, "pages": 135226476595920}}, "movies": [], "publish_date": 1513462365.0, "source": "https://web.archive.org", "summary": ""}