{"url": "https://people.com/tv/new-york-post-kim-kardashian-donald-trump-outrage/", "text": "The New York Post sparked outrage after sharing a photo of an upcoming cover commenting on Kim Kardashian West’s meeting with Donald Trump to discuss prison reform.\n\nThe Keeping Up with the Kardashians star, 37, met with the 71-year-old commander in chief on Wednesday to discuss a possible pardon for Alice Johnson, a 62-year-old great-grandmother serving a life sentence for a first-time, nonviolent drug offense.\n\nGet push notifications with news, features and more.\n\nThe news made the cover of the New York Post, which referred to the meeting as “Trump meets Rump” and “The other big a– summit,” a reference to Trump’s postponed meeting with North Korean leader Kim Jong Un.\n\nThe cover also referred to Kardashian West as “Kim Thong Un.”\n\nRELATED: Donald Trump Says He Had a ‘Great Meeting’ with Kim Kardashian as They Pose in Oval Office\n\n“Disgusting headline, @nypost,” wrote Charmed alum Alyssa Milano.\n\n“@KimKardashian was meeting with President Trump about a critical issue and you lead with her ass? This is unacceptable sexism. No woman deserves this,” she added. “Thank you for using your platform to raise awareness for the issue of prison reform, Kim.”\n\nWashington Post columnist Karen Tumulty added, “Can we just stand back for a moment and acknowledge the sexism of this headline? @KimKardashian is far from the first celebrity to understand the power of using her spotlight to call attention to a serious issue.”\n\nDonald Trump Jr. also weighed in on the cover, claiming that if Kardashian West had this meeting when former president Barack Obama was in office, “it would have been lauded.”\n\nRELATED VIDEO: Kim Kardashian Rocks a Power Suit for White House Meetings About Prison Reform\n\n“Hate to always have to point out the obvious but you never got this kind of hate [when] Obama did his parading of celebs through The White House. When he did it they were all amazingly subject matter experts. Why the continued double standard?” he wrote.\n\n“Here a woman @Kim Kardashian who happens to be a celeb has spent years on one case researching it, funding legal defense funds, but because she met with @realdonaldtrump about the issue that she’s taken very seriously, she’s mocked and criticized,” he continued. “The BS from the media and left wing agenda just really needs to stop.”\n\nRELATED: Kim Kardashian Is Talking to Jared Kushner About a Pardon for Great-Grandma Jailed for Life\n\nAfter calling attention to Kardashian West’s previous political work in advocating for gun control and Planned Parenthood, journalist Yashar Ali claimed that he was told the KKW Beauty mogul’s decision not to smile in the photograph documenting her visit with Trump “was intentional.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nFollowing their meeting, the president shared a photo of the pair behind the Resolute desk in the Oval Office.\n\n“Great meeting with @KimKardashian today, talked about prison reform and sentencing,” Trump tweeted.\n\nMissing from the photo was Trump’s son-in-law and senior advisor Jared Kushner, whom the KKW Beauty mogul was scheduled to speak with, according to CNN and Vanity Fair.\n\nMeanwhile, Kardashian West shared a photo of the presidential seal on the White House carpet with the caption: “Happy Birthday Alice Marie Johnson. Today is for you.”\n\nImage zoom Kim Kardashian/Instagram\n\nRELATED: Kim Kardashian Rocks a Power Suit for White House Meetings About Prison Reform\n\nThe mother of three shared the same comment on Twitter in honor of Johnson, who was incarcerated in October 1996 after she helped facilitate communications in a drug trafficking case.\n\n“I would like to thank President Trump for his time this afternoon. It is our hope that the President will grant clemency to Ms. Alice Marie Johnson who is serving a life sentence for a first-time, non-violent drug offense,” she later tweeted.\n\n“We are optimistic about Ms. Johnson’s future and hopeful that she —and so many like her—will get a second chance at life,” she wrote in a follow-up tweet.\n\nIn a personal essay published on CNN earlier this month, Johnson opened up about what Kardashian West’s help has meant to her, including the spotlight that has been placed on her case.\n\n“Some refer to prison as a place where hope dies. Some days I’ve found that to be almost right,” Johnson wrote. “Each time that I’ve come close [to giving up], God has restored my faith.”\n\n“So when the unlikely voices of Kim Kardashian West and Jared Kushner came together to shine a spotlight on my case, I could only thank God, for he works in mysterious ways,” she continued.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fkim-kardashian-donald-trump-2-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fkim-kardashian-donald-trump-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fkim-kardashian-donald-trump-2000.jpg", "keywords": [], "authors": ["Maria Pasquini"], "canonical_link": "https://people.com/tv/new-york-post-kim-kardashian-donald-trump-outrage/", "title": "New York Post’s Kim Kardashian Trump Meeting Cover Sparks Outrage", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Donald Trump,Kardashians,Keeping Up with the Kardashians,Kim Kardashian,News,Politics,TV", "news_keywords": "Donald Trump,Kardashians,Keeping Up with the Kardashians,Kim Kardashian,News,Politics,TV", "description": "The New York Post sparked outrage after sharing a photo of an upcoming cover commenting Kim Kardashian West’s meeting with Donald Trump", "og": {"title": "New York Post’s ‘Trump Meets Rump’ Cover Sparks Outrage Over 'Sexist' Depiction of Kim Kardashian", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/new-york-post-kim-kardashian-donald-trump-outrage/", "description": "The New York Post sparked outrage after sharing a photo of an upcoming cover commenting on&nbsp;Kim Kardashian West’s meeting with Donald Trump&nbsp;to discuss prison reform.&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fkim-kardashian-donald-trump-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/new-york-post-kim-kardashian-donald-trump-outrage/", "description": "The New York Post sparked outrage after sharing a photo of an upcoming cover commenting Kim Kardashian West’s meeting with Donald Trump", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fkim-kardashian-donald-trump-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/new-york-post-kim-kardashian-donald-trump-outrage/", "title": "New York Post’s ‘Trump Meets Rump’ Cover Sparks Outrage Over 'Sexist' Depiction of Kim Kardashian", "description": "The New York Post sparked outrage after sharing a photo of an upcoming cover commenting Kim Kardashian West’s meeting with Donald Trump", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fkim-kardashian-donald-trump-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}