{"url": "https://www.vanityfair.com/hollywood/2018/09/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram", "text": "For most of us, Monday night’s Emmys ceremony was all about a surprising collection of winners—plus one shocking proposal. But for Sex and the City fans, the night was something else entirely: a bitter reminder that underneath the sweet surface of that beloved franchise lurks something darker. I’m talking, of course, about the ongoing feud between Sarah Jessica Parker and Kim Cattrall, which Kristin Davis may have inadvertently re-ignited during the ceremony with a seemingly pointed Instagram.\n\nDavis posted a photo of herself and her co-stars from the 2004 ceremony, writing, “Emmy flashback—super happy memories and wishing joy to everyone tonight. We are all so incredibly lucky to get to do what we do!” The only problem? Though Parker and Cynthia Nixon were present and accounted for in the photo, Cattrall was missing. Coincidence? Fans thought not.\n\nListen: it’s entirely possible that Davis meant nothing by this. Nixon and Parker were, after all, the cast members who went home with gold statuettes during the 2004 Emmys, so it makes sense for Davis to have posed only with them. Still, it seems pretty unlikely that Davis was completely unaware of how it would look for her to post a photo that does not also picture Cattrall—especially within the context of a cast feud that’s been churning publicly for a year now. Besides, subtly leaving a shunned member of your social circle out of an Instagram post sounds like a total Charlotte move.\n\nThe rumored beef between Parker and Cattrall has sizzled for years—allegedly dating back to the final season of Sex and the City, when Cattrall supposedly became angry over the pay gap between herself and Parker. Last year, tales of this feud of yore came to the fore again as news broke that Sex and the City 3 would never reach theaters—and early rumors pointed to Cattrall as the cause. The film was all teed up until Cattrall allegedly refused to participate unless Warner Bros. pledged to make another one of her long-gestating projects. Cattrall, however, has insisted that she simply didn’t want to be involved in the film.\n\nWillie Garson, who played Stanford Blatch on the series, was not shy about slamming Cattrall after she compared her experience with the show to a toxic relationship. “Dear fans, because I'm ‘toxic,’ I'm going to negotiate a contract for 6 months, not come to terms, then say I never wanted to do it anyway,” he said. Cattrall later lashed out at Parker for offering her condolences following the death of Cattrall’s brother. “Your continuous reaching out is a painful reminder of how cruel you really were then and now,” Cattrall wrote on Instagram. “Let me make this VERY clear. (If I haven’t already) You are not my family. You are not my friend. So I’m writing to tell you one last time to stop exploiting our tragedy in order to restore your ‘nice girl’ persona.” Jason Lewis, who played Samantha Jones’s love interest on the show, surprisingly took Parker’s side later that month. Nixon has, so far, done a pretty good job of staying neutral.\n\nWhich brings us back to Davis. While we can’t say for sure if Davis meant anything deeper by her Instagram post, it’s worth remembering that she’s traditionally done a decent job herself of keeping things sunny when it comes to cast relationships and failed Sex and the City movie projects. So perhaps we should give her the benefit of the doubt here. But either way, it seems unlikely we’ll see these four women reuniting for cupcakes at Magnolia Bakery anytime soon.", "images": ["https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/master/w_2560%2Cc_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/16:9/w_1280,c_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg"], "top_img": "https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/16:9/w_1280,c_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg", "keywords": [], "authors": ["Laura Bradley", "Laura Bradle"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/09/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram", "title": "Sex and the City’s Kristin Davis Just Re-Ignited an Ongoing Cast Feud", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Laura Bradley", "copyright": "Copyright (c) Condé Nast 2020", "description": "Davis may not have meant any offense with her Emmys-throwback Instagram—but it sure seemed like a total Charlotte move.", "id": "5ba0f1316603312e2a5bbecf", "keywords": "hollywood,television", "news_keywords": "hollywood,television", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5ba0f1316603312e2a5bbecf", "parsely-metadata": "{\"description\":\"Davis may not have meant any offense with her Emmys-throwback Instagram—but it sure seemed like a total Charlotte move.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/16:9/w_1000,c_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/1:1/w_1000,c_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg\"}", "og": {"description": "Davis may not have meant any offense with her Emmys-throwback Instagram—but it sure seemed like a total Charlotte move.", "image": "https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/16:9/w_1280,c_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg", "site_name": "Vanity Fair", "title": "Sex and the City’s Kristin Davis Just Re-Ignited an Ongoing Cast Feud", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/09/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Davis may not have meant any offense with her Emmys-throwback Instagram—but it sure seemed like a total Charlotte move.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5ba100eb2cab742dd65ad15d/16:9/w_1280,c_limit/sex-and-the-city-feud-sarah-jessica-parker-kim-cattrall-kristin-davis-instagram.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Sex and the City’s Kristin Davis Just Re-Ignited an Ongoing Cast Feud"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}