{"url": "https://nypost.com/2017/12/28/ex-miss-americas-asked-to-help-recruit-new-leaders-after-email-uproar/", "text": "ATLANTIC CITY, NJ — Trashed by emails sent by pageant officials, former Miss Americas may help choose the new leaders of the Miss America Organization.\n\nThe group told The Associated Press Wednesday night that it is seeking the help of former Miss Americas and state directors to recommend the next generation of leaders for the pageant.\n\nIn emails that were published last week by the Huffington Post, pageant officials ridiculed the appearance, intellect and sex lives of former Miss Americas. The emails included one that used a vulgar term for female genitalia to refer to past Miss America winners, one that wished that a particular former Miss America had died and others that speculated about how many sex partners former Miss America Mallory Hagan has had.\n\nThe ensuing uproar led to the group’s executive director, Sam Haskell; its president, Josh Randle; board chairwoman Lynn Weidner, and one other board member to resign.\n\nDan Meyers, the group’s interim board chairman, said the group wants former Miss Americas and state directors to recommend members for a search committee that would determine the organization’s leadership structure, and choose individuals to fill those roles.\n\n“The board wanted to have a process that was unprecedented in terms of openness, transparency and inclusion,” he said. “Given the turbulent nature of leadership transitions, asking all the stakeholders to be a part of this process was the best way.”\n\nSome past winners reacted negatively to the board’s statement, saying the board had not reached out to them about help in selecting new leaders. Others said they wanted no involvement whatsoever by any current board members in seeking new leadership.\n\n“At this time all remaining members must step aside so we can take our beloved program back,” Miss America 1977 Dorothy Benham told the AP. “They have underestimated the strength, intelligence, and determination of the women who have worn the Miss America crown, as well as every young woman who is currently wearing, or has worn the local and state crown. We stand united.”\n\nJennifer Vaden Barth, a former Miss North Carolina, said the former winners want a completely new board to search for leaders, not one that supported Haskell.\n\n“The board needs to accept responsibility for the damage they have caused,” she told the AP late Wednesday. “They need to step aside quickly and allow new leadership to save the Miss America program.”\n\nUnder the plan, former Miss Americas and state directors collectively would name four people to the search committee, and the board would name a former state title holder to the panel. These five individuals and two board members “will begin their exhaustive search in a matter of days,” a statement from the board read.\n\nThere are currently two vacancies on the 14-member board, and there will be at least two more when the resignations of Randle and Weidner become effective in a matter of weeks.\n\nThe organization hopes to have the nominations in hand by Jan. 3. The board said it was notifying groups of its decision to seek their help late Wednesday night.\n\nThe emails already cost the pageant its television production partner and raised questions about the future of the nationally televised broadcast from Atlantic City’s Boardwalk Hall the week after Labor Day each year. Dick Clark Productions told the AP last Thursday that it cut ties with the Miss America Organization over the emails, calling them “appalling.”\n\nMeyers said the group has spoken with ABC, the television network scheduled to broadcast the September 2018 pageant, as well as with pageant sponsors. None has ended its relationship with the Miss America Organization, he said. Independent messages sent by the AP over the past two days seeking comment from ABC and pageant sponsors have gone unanswered.", "images": ["https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=1200", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2020/04/marketing.png?w=300&h=200&crop=1", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://thenypost.files.wordpress.com/2020/02/knewz_300x250.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0"], "top_img": "https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["Associated Press", "December"], "canonical_link": "https://nypost.com/2017/12/28/ex-miss-americas-asked-to-help-recruit-new-leaders-after-email-uproar/", "title": "Ex-Miss Americas asked to help recruit new leaders after dirty email scandal", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "ATLANTIC CITY, NJ — Trashed by emails sent by pageant officials, former Miss Americas may help choose the new leaders of the Miss America Organization.\nThe...", "generator": "WordPress.com", "og": {"type": "article", "title": "Ex-Miss Americas asked to help recruit new leaders after dirty email scandal", "url": "https://nypost.com/2017/12/28/ex-miss-americas-asked-to-help-recruit-new-leaders-after-email-uproar/", "description": "ATLANTIC CITY, NJ — Trashed by emails sent by pageant officials, former Miss Americas may help choose the new leaders of the Miss America Organization. The group told The Associated Press Wednesday…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2017-12-28T15:50:32+00:00", "modified_time": "2017-12-28T18:33:01+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Ex-Miss Americas asked to help recruit new leaders after dirty email scandal"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2017/12/hagan1.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Ex-Miss Americas asked to help recruit new leaders after dirty email", "description": "ATLANTIC CITY, NJ — Trashed by emails sent by pageant officials, former Miss Americas may help choose the new leaders of the Miss America Organization.\nThe group told The Associated Press Wednesday"}, "fb": {"pages": 225343690812937}, "nypost-section": "News", "parsely-metadata": "{\"post_id\":\"nypost-11494909\"}", "keywords": "News,beauty pageants,miss america,sexual harassment", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": [], "publish_date": 1514390400.0, "source": "https://nypost.com", "summary": ""}