{"url": "www.thehollywoodgossip.com/2018/02/justin-theroux-and-jennifer-aniston-all-you-need-to-know-about-t/", "text": "The marriage between Justin Theroux and Jennifer Aniston really is over.\n\nOn Thursday night, the actor and actress released a joint statement confirming that they were going their separate ways after two years as husband and wife.\n\nBefore delving into various details concerning this stunning break-up, let's take another look at this statement.\n\nIt reads as follows:\n\nIn an effort to reduce any further speculation, we have decided to announce our separation.\n\nThis decision was mutual and lovingly made at the end of last year. We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship.\n\nNormally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly.\n\nWhatever else is printed about us that is not directly from us, is someone else’s fictional narrative.\n\nAbove all, we are determined to maintain the deep respect and love that we have for one another.\n\nWhile this news took us by surprise, many tabloids have actually been calling it for months.\n\nBefore the Aniston-Brad Pitt reconciliation rumors start in earnest (What? It's too late for that?), we figured we'd go deep into this likely divorce.\n\nWhat brought it about? How did Aniston and Theroux try to salvage their romance? Where does each go from here?\n\nThis is what we've been able to dig up thus far, courtesy of various outlets on the Internet...\n\nUs Weekly: To kick off 2018, Anison and Theroux took a vacation in Cabo San Lucas with Jason Bateman and his wife, Amanda Anka.\n\nAccording to magazine insiders, Amanda had been trying to work as a \"mediator\" between Aniston and Theroux for months, hoping to help them iron out all problems.\n\nShe talked Justin into going on this vacation.\n\n“The Cabo trip was a make or break vacation for Jen and Justin,\" writes Us Weekly. \"They went away with their friends hoping to have fun and work on it.”\n\nAlas, the plan failed, this source laments, saying the guys simply hung out together and the women hung out together.\n\nRadar Online: But what caused the actual tension between the stars that prompted this trip in the first place?\n\nBoth Entertainment Tonight and Radar cite distance as a key factor.\n\nTheroux spent more of his time in New York for work and Aniston in Los Angeles. In some ways, it was as simple as this.\n\nAfter spending about two months apart toward the end of last year, an anonymous insider tells this website that the pair had a major argument in their Bel-Air mansion on December 14.\n\nShortly after this blow-up, Radar alleges Aniston started to \"lean hard\" on ex-boyfriend Gerard Butler, stirring up further jealousy and animosity between her and her husband.\n\nIt didn't help, meanwhile, that Theroux is known as a \"flirt\" when it comes to his co-stars.\n\nEntertainment Tonight: It wasn't mere distance that drove Aniston and Theroux apart, it was how much he loved New York and how much she hated it there.\n\nSources tell this outlet that paparazzi attention was a major source of contention for them in The Big Apple.\n\n\"It made for an awkward living situation for Jen and Justin because they knew the neighbors weren't happy\" about all the reporters outside their building at all times, ET writes.\n\n\"The tension came to a head in what the source refers to as \"the bologna incident,\" explains one insider, who says Theroux once came downstairs to find that someone had covered his motorcycle in slices of bologna.\n\nFor real! Reportedly!\n\nAniston thought it was one of their neighbors who did it.\n\nAniston and Theroux do not have any children, which makes their split less messy.\n\nMultiple outlets also confirm they do have an iron-clad prenuptial agreement.\n\nJennifer is the mega rich star between the tandem, considering all the money she has banked from Friends, and Us Weekly writes that these assets are well \"protected.\"\n\nThe estranged couple started to date in 2011 and got married in May of 2015.\n\nWe still can't believe they're over.\n\nAnd we also can't believe Aniston will soon be back together with Pitt! You know it's happening!", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--I_ksWhBo--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1518779635/jen-and-justin.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--I_ksWhBo--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1518779635/jen-and-justin.jpg", "keywords": [], "authors": ["Hilton Hater"], "canonical_link": "https://www.thehollywoodgossip.com/2018/02/justin-theroux-and-jennifer-aniston-all-you-need-to-know-about-t/", "title": "Justin Theroux and Jennifer Aniston: All You Need to Know About Their Split", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/02/justin-theroux-and-jennifer-aniston-all-you-need-to-know-about-t/", "title": "Justin Theroux and Jennifer Aniston: All You Need to Know About Their Split", "description": "Justin Theroux and Jennifer Aniston are headed for a divorce. Where did this seemingly perfect marriage go wrong?!?", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--aytu0a9c--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1384372097/ian-somerhalder-and-nina-dobrev-together.png", "type": "image/png", "width": 566, "height": 461}}, "article": {"published_time": "2018-02-16T06:51:10-05:00", "modified_time": "2018-02-16T06:53:13-05:00", "tag": "Justin Theroux", "author": "Hilton Hater"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Justin Theroux and Jennifer Aniston: All You Need to Know About Their Split", "description": "Justin Theroux and Jennifer Aniston are headed for a divorce. Where did this seemingly perfect marriage go wrong?!?", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--I_ksWhBo--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1518779635/jen-and-justin.jpg"}}, "description": "Justin Theroux and Jennifer Aniston are headed for a divorce. Where did this seemingly perfect marriage go wrong?!?"}, "movies": [], "publish_date": 1518781870.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}