{"url": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Emma_Stone", "text": "As of 2018, American actress Emma Stone has won 31 awards from over 91 nominations, and was named runner-up for five of those nominations. She has been nominated for two AACTA International Awards, three Academy Awards, and four British Academy Film Awards, winning one from each. She has also won a Golden Globe Award, two MTV Movie Awards, a People's Choice Award, three Screen Actors Guild Awards, and three Teen Choice Awards.\n\nStone began her acting career with a role in a theater production of The Wind in the Willows in 2000.[1] She won the Young Hollywood Award for Exciting New Face for her debut film—the teen comedy Superbad (2007), which had her play a high school student. For the role of a zombie apocalypse survivor and a con-artist in the horror comedy film Zombieland, she received a nomination for the Teen Choice Award for Choice Movie Actress – Comedy. At the 2010 Scream Awards, she garnered Best Ensemble award and Best Horror Actress nomination. She had her breakthrough with her first leading role in Easy A (2010),[2] a teen comedy which saw her play a high school student perceived to be sexually promiscuous. She was nominated for BAFTA Rising Star Award and Golden Globe Award for Best Actress in a Musical or Comedy, and won the MTV Movie Award for Best Comedic Performance. Her role was also included in Time's list of \"Top 10 Everything of 2010\".[3]\n\nStone played a supporting role in the 2011 romantic comedy-drama Crazy, Stupid, Love, for which she was awarded the Teen Choice Award for Choice Movie Actress – Comedy. Further success came with the critically acclaimed drama The Help (2011), in which she played an aspiring writer learning about the lives of the African-American maids.[4] The film won Best Ensemble Cast from Women Film Critics Circle, Broadcast Film Critics Association and Screen Actors Guild Awards; she was nominated for the Teen Choice Awards for Choice Movie Actress – Drama. For portraying Gwen Stacy in The Amazing Spider-Man (2012), she was nominated for the People's Choice Award for Favorite Movie Actress and the Teen Choice Award for Choice Female Movie Star of the Summer. The role of a recovering drug addict in the black comedy-drama Birdman (2014) earned her nominations for the Academy Award, BAFTA Award, Golden Globe Award and Screen Actors Guild Award for Best Supporting Actress, and MTV Movie Award for Best Performance. She also won the Boston Society of Film Critics Award for Best Supporting Actress for the film. Stone won the Academy Award for Best Actress, BAFTA Award, Golden Globe Award, and Volpi Cup for Best Actress for playing an aspiring actress in the musical La La Land (2016). Her portrayal of Abigail Masham, Baroness Masham in The Favourite (2017), earned her second Best Supporting Actress nominations for an Academy Award, Golden Globe, Screen Actors Guild, and BAFTA Awards.\n\nAcademy Awards [ edit ]\n\nThe Academy Awards, commonly known as the \"Oscars\", are a set of 24 awards given by the Academy of Motion Picture Arts and Sciences annually for excellence of cinematic achievements.[5]\n\nAustralian Academy of Cinema and Television Arts Awards [ edit ]\n\nThe AACTA Awards are presented annually by the Australian Academy of Cinema and Television Arts (AACTA) to recognize and honor achievements in the film and television industry.[9]\n\nBritish Academy of Film and Television Arts Awards [ edit ]\n\nThe BAFTA Award is an annual award show presented by the British Academy of Film and Television Arts.[12]\n\nBritish Independent Film Awards [ edit ]\n\nThe British Independent Film Awards honors British independent cinema and filmmaking talent in United Kingdom.\n\nComedy Awards [ edit ]\n\nThe Comedy Awards, run by the American television network Comedy Central, honored the best of comedy.[18]\n\nCritics' Choice Awards [ edit ]\n\nGolden Globe Awards [ edit ]\n\nThe Golden Globe Award is an accolade bestowed by the 93 members of the Hollywood Foreign Press Association (HFPA) recognizing excellence in film and television, both domestic and foreign.[21]\n\nGotham Awards [ edit ]\n\nHollywood Film Awards [ edit ]\n\nThe Hollywood Film Awards are held annually to recognize talent in the film industry.[28]\n\nIndependent Spirit Awards [ edit ]\n\nThe Independent Spirit Awards are presented annually by Film Independent, to award best in the independent film community.[30]\n\nMTV Movie & TV Awards [ edit ]\n\nThe MTV Movie & TV Awards is an annual award show presented by MTV to honor outstanding achievements in films. Founded in 1992, the winners of the awards are decided online by the audience.[32]\n\nNational Board of Review Awards [ edit ]\n\nThe National Board of Review Award was founded in 1909 in New York City to recognize \"film, domestic and foreign, as both art and entertainment\".[37]\n\nYear Nominated work Category Result Ref. 2012 The Help Best Cast Won [38]\n\nNAACP Image Awards [ edit ]\n\nThe NAACP Image Award is annually presented to people of color in film, television, music, and literature.[39]\n\nYear Nominated work Category Result Ref. 2012 The Help Outstanding Actress in a Motion Picture Nominated [40]\n\nNewNowNext Awards [ edit ]\n\nThe NewNowNext Award is an annual awards show, held by the gay- and lesbian-themed network Logo.[41]\n\nYear Nominated work Category Result Ref. 2011 — Brink of Fame Nominated [42]\n\nNickelodeon Kids' Choice Awards [ edit ]\n\nThe Nickelodeon Kids' Choice Awards, also known as the Kids Choice Awards (KCAs), is an annual awards show that airs on the Nickelodeon cable channel that honors the year's biggest television, film, and music acts, as voted by Nickelodeon viewers.[43]\n\nYear Nominated work Category Result Ref. 2015 The Amazing Spider-Man 2 Favorite Movie Actress Won [44]\n\nPeople's Choice Awards [ edit ]\n\nThe People's Choice Awards is an American awards show recognizing the people and the work of popular culture. The show has been held annually since 1975, and is voted on by the general public.[45]\n\nYear Nominated work Category Result Ref. 2012 The Help Favorite Movie Actress Won [46] 2013 The Amazing Spider-Man Favorite Movie Actress Nominated [47] Favorite Face of Heroism Nominated Favorite On-Screen Chemistry (shared with Andrew Garfield Nominated 2014 Gangster Squad Favorite Dramatic Movie Actress Nominated [48] 2015 Birdman Favorite Dramatic Movie Actress Nominated [49] The Amazing Spider-Man 2 Favorite Movie Actress Nominated Favorite Movie Duo (shared with Andrew Garfield) Nominated\n\nProducers Guild Awards [ edit ]\n\nSanta Barbara International Film Festival [ edit ]\n\nThe Santa Barbara International Film Festival is an eleven-day film festival held in Santa Barbara, California.\n\nYear Nominated work Category Result Ref. 2017 La La Land Outstanding Performer(s) of the Year Award Won [51]\n\nSatellite Awards [ edit ]\n\nThe Satellite Awards are a set of annual awards given by the International Press Academy.[52]\n\nSaturn Awards [ edit ]\n\nThe Saturn Awards are presented annually by the Academy of Science Fiction, Fantasy, and Horror Films to honor science fiction, fantasy, and horror films, television, and home video.[59]\n\nYear Nominated work Category Result Ref. 2015 Birdman Best Supporting Actress in a Film Nominated [60]\n\nScream Awards [ edit ]\n\nThe Scream Awards are held annually to recognize films in the horror, science fiction, and fantasy genre.[61]\n\nScreen Actors Guild Awards [ edit ]\n\nThe Screen Actors Guild Awards are organized by the Screen Actors Guild‐American Federation of Television and Radio Artists. First awarded in 1995, the awards aim to recognize excellent achievements in film and television.[64]\n\nSpike Awards [ edit ]\n\nThe Spike Guys' Choice Awards and Spike Video Game Awards are annually held by television channel Spike.[69]\n\nSpike Guys' Choice Awards [ edit ]\n\nSpike Video Game Awards [ edit ]\n\nTeen Choice Awards [ edit ]\n\nThe Teen Choice Awards is an annual awards show that airs on the Fox Network. The awards honor the year's biggest achievements in music, movies, sports, television, fashion, and other categories, voted by teen viewers.[74]\n\nVenice Film Festival [ edit ]\n\nThe Venice Film Festival is the oldest film festival in the world, and one of the \"Big Three\" film festivals, alongside the Cannes Film Festival and Berlin International Film Festival.[80]\n\nYear Nominated work Category Result Ref. 2016 La La Land Volpi Cup for Best Actress Won [81]\n\nYoung Hollywood Awards [ edit ]\n\nThe Young Hollywood Awards honor young people's achievements in music, film, sports, television, and sports.[82]\n\nYear Nominated work Category Result Ref. 2008 Superbad Exciting New Face Won [83] 2014 The Amazing Spider-Man 2 Favorite Actress Nominated [84] Best On-Screen Couple Nominated\n\nCritics associations awards [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Emma_Stone_2%2C_2014_%28cropped%29.jpg/230px-Emma_Stone_2%2C_2014_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/d/dd/Emma_Stone_2%2C_2014_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Emma_Stone_2%2C_2014_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Emma_Stone", "title": "List of awards and nominations received by Emma Stone", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Emma_Stone_2%2C_2014_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}