{"url": "https://people.com/tv/bachelor-ashley-iaconetti-jared-haibon-dating/", "text": "After three years of ups and downs, Ashley Iaconetti and Jared Haibon are finally officially together — and sharing all the details of their emotional love story.\n\nThe giddy couple recently sat down together to film a tear-filled episode of Iaconetti’s show The Story of Us (shared exclusively with PEOPLE) to open up about their journey, which began three summers ago on Bachelor in Paradise.\n\nGet push notifications with news, features and more.\n\n“Bachelor Nation hasn’t seen so many of the important details that make up our story. I thought there was no better way to explain to the people who have followed our love lives for over three years than by filming our own episode of The Story of Us,” Iaconetti, 30, tells PEOPLE exclusively.\n\nAdds Haibon, 29: “Our close friends have watched our relationship evolve and understand how we’ve gotten to this point. But people who haven’t been a part of our day-to-day lives ask us ‘Wait, how did this happen?’ With this show, it gave me an opportunity to elaborate more than just saying ‘I’m an idiot.'”\n\nLove at First Sight\n\nWhile all Paradise fans know Iaconetti has been enamored with her boyfriend since she first laid eyes on him in 2015, what they might not know is that Haibon also immediately felt a deep connection to her pretty early on.\n\nAdmitting he was a little freaked out when he noticed Iaconetti frequently “staring” at him during the second season of BiP, Haibon — who thought she was “really hot” — only has fond memories of their first one-on-one date in Mexico.\n\n“I remember just being so comfortable with you and how easily we got along … how the conversation just flowed,” he says on their episode of The Story of Us (produced by Married at First Sight and Seven Year Switch‘s Kinetic Content). “It never felt dull … or awkward.”\n\nImage zoom Ashley Iaconetti and Jared Haibon Courtesy Ashley Iaconetti\n\nIt was “truly love at first sight” for Iaconetti, however, who wasn’t able to fully be herself during the experience. “My interpretation of our first date is a little different. I was constantly scared of another girl coming in and catching your eye,” explains Iaconetti. “I was overthinking every little thing that came out of my mouth.”\n\nThough Haibon “dumped” Iaconetti on the show, “I never felt like it was over between us after Paradise,” he says. “I’m not gonna lie and say that I was in love with Ashley during BiP. It was a slow build for me.”\n\nFlirty Friendship\n\nAfter their first season of Paradise together, the couple built a strong friendship — but also became the definition of “it’s complicated.”\n\nDuring a weekend spent in Virginia with their friends for a charity event Iaconetti was planning, Haibon saw her in a different light. “I was in love,” he says. “That was such a different experience being with someone in the show and in real life. You were just so down to earth and easy-going, ambitious … sexy. I wanted you that night.”\n\nAdds Iaconetti: “I knew that he was looking at me!”\n\nThough they frequently hung out several times throughout the fall and were “flirty” with each other, the timing just wasn’t right.\n\nWant to keep upwith the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nThe duo met up in Boston at one point and “we made out real hard,” says Iaconetti. But shortly after, Haibon extended an L.A. trip to spend time with Iaconetti, and their relationship took a turn for the worse.\n\nAfter going to dinner and a movie, Haibon spent the night at Iaconetti’s home. “You, like, kind of fell asleep in my bed. We kind of snuggled, but at this time I had to really force the snuggling,” she recalls. “This is when I knew something was wrong. And I don’t know what was wrong still.”\n\nLooking back now, Haibon says he just wasn’t ready to be in a fully committed relationship. “Of course there were more-than-friendship feelings for me, but I felt like if there was any doubt in my head, that’s so unfair for me to be halfway in,” he says.\n\nParadise Part 2\n\nWith their mutual friends urging Iaconetti to move on from Haibon, the duo agreed to see other people for their second go on Paradise in 2016.\n\nBut Iaconetti “came in like a roller coaster,” recalls Haibon. “I’ll never forget that. It was really difficult … I was trying to tell you we weren’t gonna be together because I wanted you to move on [and] be happy.”\n\nThe drama continued after Mexico, and “we had so many arguments that summer when it was airing,” says Iaconetti. Those many fights helped them build a stronger bond, however, and “that kicked off a solid year of just friendship.”\n\nImage zoom Jared Haibon and Ashley Iaconetti Courtesy Ashley Iaconetti\n\nEventually, however, Haibon went into a “dark hole” and became “really withdrawn [and] almost resentful and angry,” says a tearful Iaconetti, who even had a “daybed” for Haibon when he would visit her in L.A.\n\nExplains Haibon: “I think sometimes you imagine like you’re in this rainy day constantly and you just accept that as life. I’m like going after this other girl and we’re going on dates, and yet it’s so much easier with you. I knew that if you and I were to ever date … there’s no going back. Even if I had a two percent doubt about our relationship, then I probably shouldn’t do it because I don’t want to risk losing you as a friend.”\n\nJared Professes His Love\n\nHaibon eventually signed up to do Bachelor in Paradise Australia while Iaconetti gave love another shot on Bachelor Winter Games, where she met Kevin Wendt.\n\n“I remember I was on a date with a girl in Paradise … and I was just sitting there and thinking, ‘God, I wish Ashley were here,'” recalls Haibon. “I just wanna hang out with Ashley.”\n\nWhen he returned from Australia, the duo exchanged a few flirty texts, but then Iaconetti jetted off to Winter Games in late 2017.\n\n“I remember I heard rumors that you might have met somebody, and I was sad,” says Haibon. “Sometimes I need a kick in the ass. That was a big kick in the ass.”\n\nOver the holidays, the duo exchanged awkward pleasantries before heading to a formerly planned vacation to St. Lucia with her sister Lauren and Bachelor alums Tanner Tolbert and Jade Roper in January.\n\nRELATED: The Bachelor’s Ashley Iaconetti on Kevin Wendt Split: He ‘Just Wasn’t My Forever Guy’\n\n“Going into St. Lucia, I did a lot of self-reflection … trying to figure out what I want, what I should do, if I should do anything,” he says about weighing whether or not to tell Iaconetti about his feelings for her. “It’s so unfair for me to say anything. Ashley goes on a show, finds another guy and now I’m gonna say something? What kind of assh— does that?”\n\nAfter opening up to their “fairy godfather” Tolbert, however, Haibon decided to come clean to Iaconetti. “Tanner loves the theatrics of everything,” says Haibon. “But he said something that really resonated with me. Tanner said ‘It’s more unfair to Ashley if you don’t say anything because you need to give her the opportunity to let her know how you feel and let her make up her own mind.’ I was like ‘Okay!'”\n\nImage zoom Jared Haibon and Ashley Iaconetti Courtesy Ashley Iaconetti\n\nThe morning before the group flew back to the States, Haibon finally opened up to Iaconetti about his feelings for her. “I left that conversation with him not just admitting that he was jealous but also he had feelings, and you kind of alluded to wanting to be with me,” says Iaconetti.\n\n“I remember you said ‘I’m gonna keep dating [Kevin],'” says Haibon. “I knew that in the coming months, I would have to really show Ashley that I was very serious about this.”\n\nHe also took a page right out of a romantic comedy and planted a kiss on Iaconetti just as she was about to board her flight. “I remember thinking ‘I should really kiss her.’ I was scared to do it. Tanner was like ‘You should go kiss her,’ and I was like ‘Yup!'”\n\nBut even after sharing a romantic smooch at the airport, Iaconetti wanted to give her relationship with Wendt a fair shot. “I thought ‘Okay, well that’s everything I’ve ever wanted, but I’m definitely gonna continue dating this other guy,'” she says. “I do like him. He’s pursued me … he’s been all in the entire time and I deserve to pursue somebody else and for somebody else to pursue me after all this time.”\n\nAs Winter Games was airing, however, Iaconetti knew her relationship with Wendt was over. “I just knew in my heart at that point that it wasn’t right with Kevin. I ended the relationship because it had run its course, and then Jared was still there,” she says, adding that she didn’t cheat on her ex.\n\nTheir Fairy-Tale Ending\n\nAfter Iaconetti and Wendt split in March, Haibon went all out to win over Iaconetti and poured his heart into an emotional love letter that took three days to write. “I was scream-crying basically alone in my apartment reading that just sobbing and sobbing,” says Iaconetti.\n\nSince then, the couple have been going strong — and Haibon continues to woo his girlfriend.\n\nImage zoom Jared Haibon and Ashley Iaconetti Kinetic Content\n\n“He’s written me other letters and filled my apartment with flowers. He tells me every day that he’s the luckiest man alive,” she says.\n\nAdds Haibon: “I’m living proof that you should listen to your gut, and that it’s not too late. The person I wanted to be with most was right in front of my eyes.”\n\nThe Story of Us: Ashley I & Jared was executive produced by Chris Coelen, Paria Sadighi, Ashley Iaconetti and Jared Haibon.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-4-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-3-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-2.jpg", "keywords": [], "authors": ["Melody Chiu"], "canonical_link": "https://people.com/tv/bachelor-ashley-iaconetti-jared-haibon-dating/", "title": "Ashley Iaconetti and Jared Haibon Dating 3 Years After Paradise", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ashley Iaconetti,Bachelor in Paradise,Celeb Relationships,Couples,News,reality star,The Bachelor,The Bachelor Winter Games,The Bachelorette", "news_keywords": "Ashley Iaconetti,Bachelor in Paradise,Celeb Relationships,Couples,News,reality star,The Bachelor,The Bachelor Winter Games,The Bachelorette", "description": "The couple open up in an emotional interview about finally finding their happily ever after", "og": {"title": "Bachelor Alums Ashley Iaconetti and Jared Haibon Are Dating — Find Out All the Details", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelor-ashley-iaconetti-jared-haibon-dating/", "description": "After three years of ups and downs, Ashley Iaconetti and Jared Haibon are finally officially together — and sharing all the details of their emotional&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-2.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/tv/bachelor-ashley-iaconetti-jared-haibon-dating/", "description": "The couple open up in an emotional interview about finally finding their happily ever after", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelor-ashley-iaconetti-jared-haibon-dating/", "title": "Bachelor Alums Ashley Iaconetti and Jared Haibon Are Dating — Find Out All the Details", "description": "The couple open up in an emotional interview about finally finding their happily ever after", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fashley-iaconetti-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/87t2QmKwmqI"], "publish_date": null, "source": "https://people.com", "summary": ""}