{"url": "https://www.inquisitr.com/4679120/matt-damon-explains-why-he-and-ben-affleck-did-not-see-each-other-for-thanksgiving-this-year/", "text": "For more than 30 years, Ben Affleck and Matt Damon have been friends, and while the two actors live near each other in Los Angeles and try and spend time together when possible, it seems that this year for Thanksgiving the friends were simply unable to see each other. While there were apparently plans for Affleck to spend some time with his longtime pal, Damon, on Thanksgiving this year, things did not work out.\n\nWhile speaking to E! News, Matt Damon explained exactly what happened on Thanksgiving, and why he and Ben Affleck were unable to see each other. According to Damon, it seems he actually had other plans for the holiday that led to him not being in Los Angeles. The actor shared that rather than spend Thanksgiving in LA, he ended up flying back to Boston in order to spend the holiday with his family there.\n\nDuring his discussion about his holiday plans, Matt Damon laughed and said that it was definitely not Ben Affleck’s fault that they did not get to see each other this year for Thanksgiving. Damon jokingly blamed himself for the fact that they did not end up spending any time together on the holiday, saying “it is not his fault he didn’t spend Thanksgiving with me. It’s my fault that I left.” Simply put, there was just no way the two friends could see each other with Matt Damon being in a completely different state.\n\nYou're welcome @JimmyKimmel. No need to thank me. A post shared by Ben Affleck (@benaffleck) on Feb 29, 2016 at 12:21pm PST\n\nWhile the two actors may not have gotten to see each other for Thanksgiving, there is still Christmas to look forward to, only this time the man without plans happens to be Matt Damon. Although the actor may not know what is happening for Christmas, Damon joked that he tries to “not see him as much as possible.” He went on to say that although they may not have been in the same state on Thanksgiving, it is likely that they will in fact “be in the same area code during Christmas.” Matt Damon even said that whenever he can, he does attempt to crash all of Ben Affleck’s parties since they are usually “highfalutin affair[s].”\n\nEven though Ben Affleck and Matt Damon might not have had the chance to spend Thanksgiving together, there is a chance that they may get to see each other for Christmas. Either way, Damon had nothing but kind things to say about his longtime friend, even as he was out promoting his own work, saying that Affleck is just “an amazing guy.”", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/12/Ben-Affleck-and-matt-Damon-missed-Thanksgiving-together.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://secure.gravatar.com/avatar/4a918df6a9bd9504e87608b20d87cb49?s=250&d=mm&r=g"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Kimberley Spinney"], "canonical_link": "https://www.inquisitr.com/4679120/matt-damon-explains-why-he-and-ben-affleck-did-not-see-each-other-for-thanksgiving-this-year/", "title": "Matt Damon Explains Why He And Ben Affleck Did Not See Each Other For Thanksgiving This Year", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}