{"url": "https://www.rollingstone.com/culture/culture-features/surviving-r-kelly-118608/", "text": "Kitti Jones had been dreaming of this moment for years.\n\nIt was June 2011, and R. Kelly had just performed to a frenetic crowd at the Verizon Theatre outside Dallas, Texas. It had been nearly two decades since the singer’s raunchy lyrics and honeyed voice turned him into a R&B superstar and sex symbol. But despite multiple controversies over his alleged sexual relationships with underage girls, his still-dedicated fan base sent his latest album – the throwback soul LP Love Letter ­– to Number Six on the Billboard 200.\n\nLove Letter is relatively tame, coming from the man who once sang, “Girl, I got you so wet, it’s like a rainforest/Like Jurassic Park, except I’m your sexasaurus.” But like most of his shows, the Dallas concert was raucous, with Kelly launching into boisterous call-and-response theatrics and leaving the stage to embrace screaming fans. When he took off his sparkling button-down shirt and revealed a Dallas Mavericks jersey, the place erupted.\n\nSurprisingly, Jones – a popular DJ for Dallas hip-hop and R&B station 97.9 The Beat – wasn’t in the audience. She’d been into Kelly since she was a teen in the early 1990s, when she’d hide in her room with his music to escape her mother’s tumultuous romantic relationships. She’d buy every magazine he was in and, upon the release of his 1993 solo debut, 12 Play, took a limo to a third-row seat at her first Kelly show. She’d seen him in concert seven times since. “He was my Brad Pitt,” she says.\n\nBut even though she was disappointed to miss it, bailing on the concert meant something better: she was at Fat Daddy’s, a club in suburban Mansfield, Texas, setting up for the Beat-sponsored after-party. She was finally going to meet the man she’d been captivated by for more than 20 years.\n\n“He was everything that I thought,” says Jones. “He was handsome. He just owned the room.”\n\nLater that night, the guest of honor arrived. Clad in a crisp white shirt, diamond earrings and tan fedora, he hardly looked his 44 years. As Jones made her way upstairs to the VIP section, she approached R. Kelly (real name Robert Kelly). “I said, ‘Oh I’m so upset, because this is one of the first concerts I’ve ever missed,'” Jones tells Rolling Stone. “And he was like, ‘Well you’ve seen one, you’ve seen them all.'”\n\nJones says he then invited her to the next stop on the tour, which took her aback. “I’m thinking, ‘I know he’s not inviting me.’ On the inside, I’m freaking out a little bit,” Jones says. “Did he really say that? He was everything that I thought. He was handsome. He represented a powerful man. He just owned the room [and had] all the things that make up that ‘Oh my God’ factor.”\n\nAs Jones tells it, when Kelly went to shake her hand after small talk, he gave her a piece of paper with his phone number and told her to text him her number. Jones says that after she texted Kelly from the bathroom, he replied, saying to always call him “daddy” ­– never call him Rob.\n\nWorried that any continued interaction that night would look unprofessional, Jones says she decided to take off. “I was just like, ‘I’m outta here,’ beeline to my car,” she recalls. Around 3 a.m., Jones says Kelly called her to ask where she had gone, following up with a text that read simply, “Sin pic.”\n\nThe night would begin, according to Jones, a two-year relationship with Kelly rife with alleged physical abuse, sexual coercion, emotional manipulation and a slew of draconian rules that dictated nearly every aspect of her life. Those rules, including what and when to eat, how to dress, when to go to the bathroom and how to perform for the singer sexually, were first described in writer Jim DeRogatis’ bombshell BuzzFeed feature on Kelly last July.\n\nBut the girls that story focused on met Kelly when they were in their teens; Jones was different. She had a career. A car. An ex-husband. A child. She’d been working in radio for more than five years and was used to being around celebrities. And while Kelly denies the allegations to Rolling Stone, over the course of multiple interviews with Jones and others familiar with her situation, what emerges is a detailed account of her relationship with Kelly and a firsthand look at life in the singer’s inner circle.\n\nKelly’s alleged manipulation of women dates back to 1994, when the singer, then 27, married 15-year-old R&B singer Aaliyah. In 1996, Kelly was sued for $10 million by aspiring vocalist Tiffany Hawkins, who claimed that she first began having sex with Kelly at age 15 and “suffered personal injuries and severe emotional harm because she had sex with the singer and he encouraged her to participate in group sex with him and other underage girls.” (The lawsuit was settled for an undisclosed sum in 1998.) Kelly would eventually settle separate suits brought by two more women who said they’d had sex with him when they were under 18.\n\nIn February 2002, DeRogatis, then a reporter and music critic for the Chicago Sun-Times, anonymously received a now-infamous 26-minute video and passed it on to the police. The tape allegedly shows Kelly telling a girl to call him “daddy” and urinating in her mouth. The girl’s aunt told the paper that the girl had only been 14. “It’s crap, and that’s how we’re going to treat it,” Kelly told a Chicago TV station at the time.\n\nKelly was indicted four months later on multiple child-pornography charges and faced up to 15 years in prison. After finally going to trial in 2008, Kelly was found not guilty on all 14 counts. (Jurors admitted after the trial that they could not verify the identity of the girl, who did not testify, despite more than a dozen witnesses identifying her on the tape. Consequently, they could not definitively say that she was underage.)\n\nAs a radio personality in a still-nascent social-media era, Jones – who first became an on-air DJ in 2006 – was a conduit for listeners to comment on Kelly’s legal troubles, including his 2008 acquittal. On air, she says, she tried to remain neutral, but she admits that at the time, she thought the singer may have been set up. She continued to be a devout fan. “I still went to his concerts. We played his music [on the radio],” she says. “I didn’t know there were other girls that he had paid off.”\n\nJones says the two began speaking regularly via phone and text for two months after their first meeting, before they met again. “I want you to come and see me in Denver,” Jones says Kelly told her. “That’s my getaway spot.” He would cover the airfare, the hotel room, everything – all she had to do was get on a plane and show up.\n\n“I got there before he did because he of course doesn’t like to fly, so he’s taking the bus,” Jones says. She had sent Kelly “racy photos” while he was en route to the hotel and was excited to reunite face-to-face. As she waited in the hotel room for Kelly to arrive, she heard a knock at the door. “He brushed past me,” Jones says. “I’m thinking we’re going to hug or peck each other. But he plopped down on the couch and pulled out his penis and started pleasuring himself.”\n\n“Maybe he just has weird ways of getting off,” Jones remembers thinking during her second encounter with Kelly.\n\nJones was stunned. Should she leave? Say something? Proceed? If this were a “regular guy working at CVS,” says Jones, she would’ve been furious. But the combination of physical attraction and the two months of courteous courtship just made Jones put the incident “in the back of my head.”\n\n“I was attracted to him and was just like, ‘Well, OK. Fine,'” she says. “Maybe he just has weird ways of getting off.” The two had oral sex that weekend, with Kelly, according to Jones, saying things like, “I gotta teach you how to be with me” and “I gotta train you.” “He was like a drill sergeant even when he was pleasuring me,” Jones says. “He was telling me how to bend my back or move my leg here. I’m like, ‘Why is he directing it like this?’ It was very uncomfortable.”\n\n“But he tried to make me feel special about [the trip],” Jones adds. “Like, ‘If I didn’t really like you, I wouldn’t have done that, and I wouldn’t even be wasting my time flying you out, and I respect you.'” Jones and Kelly continued their romance, with Kelly, according to Jones, sending her flowers and gifts at work. “I had been divorced a couple of years at that point and [I was] meeting some bad guys,” Jones says. But Kelly made her feel better. “He’s not trying to hurry up and have sex. It was an escape for me.” She was single, lonely and her son was living in Europe with her ex-husband. Kelly offered the perfect respite.\n\nIt was in September 2011, during Jones’ first trip to Chicago to visit Kelly at his Trump Tower apartment, that she began noticing odd incidents. After Jones texted Kelly that the driver arrived at the airport on time, Jones alleges Kelly told her not to speak to him and inform the singer if the driver talked to her. It was part of a pattern, Jones later realized, of male figures in Kelly’s orbit avoiding interacting with any woman around the singer. Jones recalls stumbling on a stair that night and watching two male employees nearby not flinch. “They knew not to talk to me or help or anything,” she says.\n\nDespite the red flags, Jones was starting to fall for Kelly. She says as the singer began to confide in her more about past traumatic events like the deaths of his mother and childhood girlfriend, she began feeling protective of him. If people knew who he really was, thought Jones, they’d be more sympathetic. “Rob kinda makes you feel like you have to defend him,” she says. “It’s like you and him against the world. If someone brought him up [in conversation], immediately a wall went up.”\n\nIn November 2011, Jones quit her DJ job, sold her car and moved into the singer’s Chicago apartment. “She asked me what I thought about her quitting her job and moving,” says Veda Loca, a DJ for The Beat who worked with Jones at the time. “I was like, ‘You only live once.’ I mean, fuck, it’s R. Kelly.”\n\n“Soooo enough mushy talk I have a flight out at 2p my new journey has begun!!” Jones tweeted at the time. “By this time, I’m falling in love with the guy,” she says now. A few days after Jones moved in, Kelly would release “Shut Up,” his first song following throat surgery in July, which doubled as a rebuke to his detractors. “Even before the doctors was done and I could awake/A tsunami of rumors had come to wipe my career away,” Kelly sings. “But to everybody that be callin’ me, tellin’ me what they be sayin’ about me/Bringin’ me all of this negative shit, y’all the ones I ain’t fuckin’ with.”\n\nAccording to Jones, Kelly claimed that he would pay her double her salary if she moved to Chicago, but also cautioned her on his close relationship with women. “He said, ‘I have friends and I have girls I’ve raised,'” Jones recalls. “I didn’t know what he meant by ‘raised’ at the time. He said, ‘I eventually want you to meet them, but I want to make sure you’re mentally ready for that.'”\n\nTo Jones, theirs was a mature relationship – and in the beginning, she was under the impression that Kelly was monogamous. “As long as you don’t see it or find anything suspicious, you just assume you’re the only one until it’s right in your face,” she says.\n\nAlmost instantly upon moving to Chicago, Jones says, Kelly began governing nearly every detail of her life, starting with the requirement that she wear baggy sweatpants whenever she went out and text near-constant updates on her whereabouts. (A source who knew Kelly confirmed the singer’s demands on Jones to Rolling Stone.) Jones says she was forced to text either the singer or one of his employees for even the slightest request. (Sample text message: “Daddy, I need to go to the restroom.”)\n\nUnlike on earlier weekend visits, Jones says she now had to “stand up and greet daddy” every time he walked in the room. Jones could still travel back to Dallas to see her friends, but was tethered to her phone to supply continuous updates to the singer.\n\n“We are suppose[d] to tell Rob [if] someone breaks a rule,” Jones texted her friend in 2013.\n\nJones had been living with Kelly for less than a month when she claims the first instance of physical abuse occurred, in November 2011. Jones says that on a return trip to Dallas around Thanksgiving, she saw the video at the heart of his child-pornography trial for the first time and challenged Kelly on the phone about it. “He said, ‘Bitch, don’t you ever fucking accuse me of something like that,'” Jones says. “He never had spoken to me like that before.”\n\nJones claims Kelly remained enraged when she flew back and met him at the airport. “My heart was just beating through my chest,” she says. “He just turned into a monster. I blamed myself ’cause I was like, ‘Maybe I shouldn’t’ve said anything.'” As they drove home, Jones says she repeatedly apologized while Kelly kicked her multiple times and delivered a series of open-handed slaps to her face. “I was putting my hand over my face and telling him I was sorry,” Jones says. “He would start kicking me, telling me I was a stupid bitch [and] don’t ever get in his business.” The next day, Jones says, the couple went shopping and neither spoke about the incident.\n\nShortly after the alleged abuse, Jones considered leaving Kelly but began to think “about how ashamed I was of leaving my career.” She was concerned about both exposing the man she loved and having “too much explaining to do.” “I didn’t want to damage him any further than what people already thought,” she says. Jones claims in the first year she lived with Kelly, the singer physically abused her approximately 10 times, with the frequency increasing the following year.\n\nKelly’s career hardly diminished despite his legal troubles. In June 2012, he released Write Me Back, his 11th studio album, which debuted at Number Five. He announced his Single Ladies Tour two months later.\n\nKelly took Jones on the two-month, cross-country trek, marking a relatively calm period in their relationship. “The abuse was heavy before the tour,” she says. “Then when the tour came, he treated me like a princess. I just thought, ‘Why would I walk away from this?'”\n\nEach show was a barrage of sexually charged imagery. Kelly would sing about having sex to his own music, don a white leather jacket with the word “SINGLE” adorned in miniature LED lights, judge a mock-stripping contest from a gold-and-white throne and let fans grab his crotch while singing. In St. Louis, he caused two women to fight over a towel he asked them to use to wipe his sweaty face. “I get horny off my own shit sometimes,” he told the crowd at one show. “He’s eager to shock, confuse and impress in equal parts,” Rolling Stone wrote of his Chicago stop. “At times, his show resembles audible pornography.”\n\nHe even included a live skit involving Jones – one that would have been absurdist, raunchy humor under normal circumstances. In retrospect, the bit takes on a more sinister meaning. After Kelly brings Jones onstage, two men dressed in white lab coats make her sign a waiver and chain her arms inside a white cage. Kelly enters as a white sheet is draped over the cage, obscuring the couple. The cage begins rocking as the band’s music intensifies, with Jones and Kelly eventually shown silhouetted. After Kelly simulates oral sex on Jones, the two re-emerge, and a mock-fatigued Jones is led offstage. “‘I’ve never paraded around anybody before,'” Jones says Kelly told her before the tour started. “‘I’m gonna make sure people see us together.'”\n\n“People started recognizing it was me on YouTube [and] thought I was living this glamorous, ‘I have a butler’-type of life,” Jones says. Kelly was particularly excited for his Dallas show, says Jones, to “rub it in the faces” of Jones’ former colleagues at The Beat.\n\nThough she still had to text him continuously, she was given more freedom on tour. “He’ll have a car service and then take me to the hotel and be like, ‘Get room service … Go shopping, spend whatever you want,”‘ Jones says. “I think he knew leading up to the tour that I was just over it. He knew that I was holding all these secrets that I had learned being in the inner circle and that I could probably be the one to nail him. So him taking me on that tour was like, ‘Let me make sure I treat this one a certain way.'”\n\nNear the end of the tour, one day after Thanksgiving 2012, Kelly released the third installment of Trapped in the Closet, his bizarre, wildly popular R&B opera. The night before, according to Jones, he and nearly 20 associates enjoyed a holiday feast in New York without her. “I starved on Thanksgiving because the room service [at the hotel] was closed and he made me think he was coming back to get me at 11 o’clock,” she says. “He just hopped back in the bed the next day like it was nothing.”\n\nR. Kelly + Kitti Jones – Cage Skit\n\nIn January 2013, Kelly moved Jones from Trump Tower to his nearby recording studio, which also contained several rooms for living quarters. Jones didn’t think anything of it at the time – Kelly was moving personal possessions over to the studio, too – but says that someone close to Kelly has since told her the move was to accommodate another of Kelly’s girlfriends. “When I moved some of my things out of there, I wasn’t thinking, ‘Oh, some other girl is moving in,'” Jones says.\n\nKelly housed Jones alongside two of his other girlfriends, allegedly demanding that each of them contact Kelly or one of his employees before leaving their room. Despite all three girlfriends living in one location, Jones says the singer at first tried to ensure none of them knew the others were living there. There were no locks on the doors, but cameras monitored every move and Kelly would punish the women for attempting to leave for any reason without permission. (The source who knew Kelly independently confirmed Kelly’s rules with his girlfriends to Rolling Stone.) Kelly would frequently take away Jones’ phone as punishment – sometimes as long as two months – cutting off her ability to request food or perform basic functions, according to Jones and the other source who knew him.\n\nTwo months into living at the studio, Jones says, Kelly began using starvation on her as punishment for not following his orders. Jones says the longest she went without food was two and a half days, though single days without a meal were not uncommon. “Will u send a pizza here to studio I’m alone til 4am no card no money just dropped off with my blanket and the guys aren’t replying,” Jones texted childhood friend LaToya Howard on May 23rd, 2013, at 12:35 a.m. “I feel dizzy.” (Loca, who worked with Jones at The Beat, tells Rolling Stone that she noticed Jones’ drastic weight loss after Jones broke up with Kelly and said Jones told her she had sometimes not been allowed to eat.)\n\nPer Kelly’s rules, say multiple sources, any sharing of personal info – your hobbies, where you worked, your favorite food – with another woman was not allowed. (The girlfriends all had nicknames, with Jones claiming that none of them knew the others’ real names upon meeting.) “We are suppose[d] to tell Rob [if] someone breaks a rule [or tries] to be negative with each other,” Jones texted Howard on March 16th, 2013.\n\n“If you disclose your relationship with him [to another woman] – how long you’ve known him or whatever – you can get beat,” Jones claims. “He doesn’t want in any way for one girl to feel more like, ‘Oh, we’re closer than you guys.’ Even though we knew deep down we’re all living there, we didn’t address it.”\n\nAny woman living in the studio, she says, was obligated to look down when walking down the hallway or toward the bathroom to avoid looking at other men. “When I was on tour, it was just clear [that] people knew not to be in my path,” Jones says. “I don’t know what he would think would happen if you’re looking at somebody. I think he’s looking at it like that’s letting a guy know it’s OK to speak to you.”\n\n“She started sending me text messages like, if there were guys around, she could not look at any of [them],” Howard says. “She had to always have her head down or if they were in a conference room and she was sitting next to Rob, he would have her turn facing him and she had to keep her head down the whole time. If a male would say something funny, she couldn’t laugh.”\n\nOne musician who opened for R. Kelly during this time also noticed Jones’ guardedness. “Probably the first week of the tour … we tried to speak to [Kitti] and she just kept walking,” he tells Rolling Stone. “He had control over her. She was scared to even have a conversation with anyone else. The last show, she walked up to us and hugged us but you could tell she was looking over her shoulder to make sure nobody was looking.”\n\nTodd Muhammad, a longtime friend of Kelly’s who has written and produced for the singer, denies that Kelly acted abusively toward women but admits that the singer made it a point to separate his male acquaintances from his girlfriends. “He’s very, very private,” Muhammad says. “I’ve never known him to have [a girlfriend] that would have a relationship – even a friendship – with any of his boys. … He definitely keeps them separated.”\n\n“You just become numb to what’s happening,” says Jones.\n\nJones says that in March 2013, she was introduced to another one of Kelly’s girlfriends. The singer brought the woman in naked and told her to crawl toward Jones and perform oral sex on her. “He told me, ‘I raised her. I’ve trained this bitch. This is my pet,'” she says.\n\nThat night would begin a new, darker chapter of Jones’ relationship with Kelly, one in which she claims he would force her to have sex with other women. Kelly would frequently fly girls in for sex, says Jones, and order her and his other girlfriends to hook up with them. “You can’t say no because you’re going to get punished,” she says. “You just become numb to what’s happening. It’s so traumatic the things that he makes you do to other people and to him.”\n\n“He videotapes everything that he does, and sometimes he’ll just make you watch what he’s done to other girls or girls that he had be together,” she adds. “He would masturbate to that and then have you give him oral sex while he’s watching what he did with somebody else on his iPad.”\n\nIn one particularly graphic example, Jones claims she witnessed Kelly urinating on two women while she and the women were in the middle of a sex act with the singer. “It was just a game for him,” she says. “He just went back and forth [on them] when he was peeing and told [another girlfriend] to clean it up afterwards. That was the worst that I’ve ever seen.”\n\nJones claims her coerced sexual encounters with women became more frequent as time went on. “Ninety-nine percent of the time, I didn’t want to do it and I would tell him I didn’t want to do it,” Jones claims, adding that she once vomited after performing oral sex on another one of Kelly’s girlfriends. “It was the most horrible thing. People look at it and go, ‘Oh, you’re grown.’ No. You have to actually be there to know exactly what it felt like for a person to overpower you and make you feel like there’s nothing for you outside of him.”\n\nJones describes this period from March 2013, when she was first forced to have sex with other women, to her departure that September as “six months of hell.” She says the punishments – including physical abuse – increased as one of Kelly’s other girlfriends fabricated or exaggerated stories to Kelly that made Jones look bad. “I was getting punished for something every week,” Jones says. “If I wasn’t getting slapped, I wasn’t eating or my phone was gone.”\n\nKelly headlined the Pitchfork Music Festival in Chicago alongside Björk and Belle and Sebastian that July, prompting a new wave of criticism led by DeRogatis. “What does it say when an artist who’s been accused of hurting numerous young women is celebrated by IFC, the Independent Film Channel [who aired the latest installment of Trapped in the Closet] and music festivals such as Coachella, Bonnaroo and Pitchfork?” DeRogatis wrote at the time.\n\nIn August 2013, after one instance where Kelly had taken her phone, Jones was able to secretly reactivate her Facebook account long enough to send a message to Howard asking her to FedEx an activated phone to the recording studio. “She said, ‘Can you send me a phone because Rob took the phone away and threw it out the window?'” Howard says. Knowing that Kelly often slept until midafternoon, Jones says she timed a bathroom visit to surreptitiously grab the FedEx package.\n\nThe lowest point for Jones came that same month. By then, “his voice scared me, seeing that he called scared me, hearing a door open and close scared me.” Feeling “like trash,” Jones sat on a couch, contemplated suicide and plotted her next move. “I just said, ‘I’m gonna kill myself and it’s gonna be his fault,'” she says. “‘I can either kill myself or kill him. What use am I when I walk out of here?'”\n\nIn September 2013, Jones told Kelly that she wanted to visit Dallas to take her son, now back from Europe, shopping for school supplies. “I was fed up with just everything,” she says. “Fuck what people are gonna think. You need to take your ass home.”\n\nShe left her possessions in Chicago, flew to Dallas with two suitcases and never returned. “She had to be careful as to what she was packing,” Howard says. “Nothing that had heels or club clothing. She just had to have her sweats and T-shirts.”\n\n“I can either kill myself or kill him,” Jones recalls thinking in August 2013.\n\nJones says Kelly didn’t outwardly express hard feelings when she left for good, as the two spoke occasionally and amicably following her departure. But Jones was suspicious of Kelly’s motives. Was he genuinely OK with the breakup, or intentionally conciliatory for fear of Jones publicizing her accusations against the singer?\n\nTwo months later, in November 2013, Kelly went to Dallas for a show and met with Jones, ostensibly to return some items she left in Chicago. Jones says he remained amiable before meeting her, inviting her to his tour bus, she thought, to retrieve her possessions.\n\nBut when she got on the bus, Jones alleges Kelly assaulted her. “I walked on the bus and I was like, ‘Hey daddy!’ And I went to go hug him and he was like, ‘Bitch, I’m not giving you shit’ and he was just attacking me,” says Jones. “I knew he wasn’t going to kill me, but it was a lot of force. I was thinking, ‘I’m not going to call the police.’ I just felt so stupid,” she says.\n\n“[He was] instilling the fear back in me,” Jones says. “When a person sees that you’re not calling the police or the press on them … it’s like, ‘Let me make my mark so you’ll be afraid.’ And it worked.” It would be the last in-person contact the two would have.\n\nFrom the end of 2013 until December 2016, Jones tried to rebuild her life, getting a job financing for car loans. (She has since begun getting back to a career in radio.) She had complicated feelings about Kelly. On one hand, she still felt protective over him, reaching out to see how he was doing after a particularly intense video interview with the Huffington Post – one where, after the interviewer posed a series of questions that he saw as “negative,” he walked out. “I was like, oh my God, poor thing,” she says. Yet on the other hand, she was perpetually dealing with survivors’ guilt and the stress of staying quiet for fear of retribution and shame, all while hoping to put her experience in the past and move on. “I suffered in silence. I lived in fear for the last three and a half years,” says Jones. “I haven’t been living my life. I’ve just kind of been existing.”\n\nWhen Rolling Stone provided to Kelly a detailed list of allegations Jones made against him, Kelly categorically denied them. “Mr. Kelly is aware of the repeated and now evolving claims of [Ms. Jones],” Kelly’s representative wrote in a statement. “It is unfortunate that Ms. Jones, after public statements to the contrary, is now attempting to portray a relationship history with Mr. Kelly as anything other than consensual involvement between two adults. As stated previously, Mr. Kelly does not control the decision-making or force the actions of any other human being, including Ms. Jones, by her own admission. Any claim of wrongdoing of any kind or of mistreatment of any woman by him is false, ill-motived and defamatory.”\n\nLast December, Timothy and Jonjelyn Savage, the parents of 22-year-old Joycelyn Savage, who is currently living with Kelly and other women, asked Jones for advice on how to get their daughter to leave the singer, the couple confirm to Rolling Stone. (In a video posted on TMZ, Savage claimed that she is living with Kelly of her own free will.) Jones hadn’t been keeping up with Kelly’s current girlfriends, but initially tried to help the Savages.\n\n“I cried when she showed me photos of her daughter, and then I called [Joycelyn] ’cause I said, ‘Maybe this is my moment to help somebody, ’cause I’m sitting here on this information that can stop [him],” Jones says. “I felt like I had the power to stop him earlier.” Jones says she no longer is in communication with the Savages but the conversations spurred her to consider going public with her story.\n\n“I wouldn’t wish those memories on anybody,” she says. “I used to think about them and well up with tears, but now I’m so angry about the things that I let him get away with. I feel some sense of responsibility with the girls in the house now. I feel guilty because I was quiet for that long. Now I feel like I have a purpose again because I can talk about this, get it behind me and not be ashamed. Now I’m like, ‘Bring it on.’ I don’t fear him at all.”\n\nJones says she is setting up a nonprofit organization called Stop Protecting Your Abuser. “By me being silent, it allowed him to feel untouchable, that he could keep things going as long as he could pay people off and put enough fear and shame in us that you would never speak on it again,” she says. “Staying silent absolutely protects your abuser.”\n\nKelly called Jones in May of this year, the last time Jones says the two have communicated in any capacity. “He said, ‘If someone came to you right now and asked them how I treated you, you can’t fucking say that I didn’t treat you good. … You had a roof over your head. You went shopping. You didn’t have to want for shit. So you can never go around and say that I was a monster like other people say that I am,'” Jones says. “I was so scared when he was talking to me. I was like, ‘This guy really thinks he did me a favor.’ He doesn’t look at the sexual stuff as scarring and damaging people.”\n\nJones kept her mouth shut for a long time, but “staying silent absolutely protects your abuser,” she says.\n\nKelly’s popularity has remained steadfast. From 1993 to 2013, 13 of the singer’s 14 studio albums peaked in the top 5 of the Billboard 200, including six that reached Number One. He has sold more than 35 million albums worldwide, and in 2010, Billboard named him the Number One R&B artist of the past 25 years based on chart performance. Jones says she knows many people “already have [their] minds made up” about the singer, but hopes her story will be a cautionary tale to other women.\n\nJones says she never signed a non-disclosure agreement, but that Kelly wanted her to sign a document that would safeguard him from legal action. She refused. “Rob is about to force me to sign a letter they typed up stating things I never did just to prevent me from ever suing him,” Jones texted Howard on May 16th, 2013. “Please save this text … in case I ever need to prove I was forced. He is saying he needs to feel protected if I leave or if he fired me.” Jones’ lawyer, Shay M. Lawson, tells Rolling Stone that no legal proceedings against Kelly have been filed, but that Jones “is still very much exploring her legal options.”\n\nAsked what she hopes people take away from her experience, Jones speaks in a measured yet defiant tone. “I want them to not be so dismissive towards the women that are speaking out,” says Jones. “We’re not just rolling over out of bed and saying, ‘Hmm, let me just make up a story about R. Kelly today. Let me make it sound similar to something that he’s already been accused of and put my own remix to it just [because] I want some attention.’ [Anyone who has spoken out] has gotten annihilated in the press [and] from fans.\n\n“And then they judge people by how they look: ‘She’s too old, he wouldn’t go for her, this bitch is lying.’ Any little thing to justify what he’s doing to people,” Jones continues, her voice rising. “It pisses me off that people that really did suffer and go through the things that they did and wanted to kill themselves are still ashamed, in hiding, embarrassed and just afraid overall to speak out. The backlash from it will make you feel like [you wish you’d] never talked about it. And all this has been replaying in my head and I’m like, ‘Fuck that. I’m not letting this be me.'”", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-features%2Fsurviving-r-kelly-118608%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=118608", "https://www.rollingstone.com/wp-content/uploads/2018/06/escaping-r-kelly-kitti-inside-story-read-8a2b7da3-b41a-4751-8183-05266937ab70.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/escaping-r-kelly-kitti-inside-story-read-8a2b7da3-b41a-4751-8183-05266937ab70.jpg", "keywords": [], "authors": ["Jason Newman", "News Director", "Jason Newman'S Most Recent Stories", "Flashback", "What The Hell Were The Rock Music Awards In", "A", "Big Brother", "Cast Still Doesn T Know About Coronavirus", "A Few Minutes With Billy Idol", "New York S New Ambassador For Parking Violations"], "canonical_link": "https://www.rollingstone.com/culture/culture-features/surviving-r-kelly-118608/", "title": "Surviving R. Kelly: Former Girlfriend Alleges Abuse", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Kitti Jones left her home and career for a relationship with the R&amp;B idol R. Kelly. That's when she says the abuse began. Now she's speaking out.", "news_keywords": "long reads, R. Kelly, sexual misconduct", "og": {"type": "article", "title": "Surviving R. Kelly: Former Girlfriend Alleges Abuse", "url": "https://www.rollingstone.com/culture/culture-features/surviving-r-kelly-118608/", "description": "Kitti Jones left her home and career for a relationship with the R&B idol. That’s when she says the abuse began. Now she’s speaking out", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/escaping-r-kelly-kitti-inside-story-read-8a2b7da3-b41a-4751-8183-05266937ab70.jpg", "width": 1024, "height": 684, "alt": "Surviving R. Kelly kitti inside story read 2017"}, "locale": "en_US"}, "article": {"published_time": "2017-10-23T17:49:00+00:00", "modified_time": "2019-06-05T17:55:58+00:00"}, "twitter": {"text": {"title": "Surviving R. Kelly: Former Girlfriend Alleges Abuse"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/escaping-r-kelly-kitti-inside-story-read-8a2b7da3-b41a-4751-8183-05266937ab70.jpg?w=1024", "alt": "Surviving R. Kelly kitti inside story read 2017"}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@jasonrnewman", "title": "Surviving R. Kelly: Former Girlfriend Alleges Abuse", "description": "Kitti Jones left her home and career for a relationship with the R&B idol R. Kelly. That's when she says the abuse began. Now she's speaking out."}, "generator": "WordPress 5.4", "author": "Jason Newman", "content_type": "Article", "post_id": 118608, "title": "Surviving R. Kelly: Former Girlfriend Alleges Abuse", "published_at": "2017-10-23 17:49:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/escaping-r-kelly-kitti-inside-story-read-8a2b7da3-b41a-4751-8183-05266937ab70.jpg?w=1024", "comment_count": 0, "tags": "sexual misconduct", "topics": "Culture Features", "body": "Kitti Jones had been dreaming of this moment for years.\r\n\r\nIt was June 2011, and R. Kelly had just performed to a frenetic crowd at the Verizon Theatre outside Dallas, Texas. It had been nearly two decades since the singer's raunchy lyrics and honeyed voice turned him into a R&B superstar and sex symbol. But despite multiple controversies over his alleged sexual relationships with underage girls, his still-dedicated fan base sent his latest album – the throwback soul LP Love Letter ­– to Number Six on the Billboard 200.\r\n\r\nLove Letter is relatively tame, coming from the man who once sang, \"Girl, I got you so wet, it's like a rainforest/Like Jurassic Park, except I'm your sexasaurus.\" But like most of his shows, the Dallas concert was raucous, with Kelly launching into boisterous call-and-response theatrics and leaving the stage to embrace screaming fans. When he took off his sparkling button-down shirt and revealed a Dallas Mavericks jersey, the place erupted.\r\n\r\nSurprisingly, Jones – a popular DJ for Dallas hip-hop and R&B station 97.9 The Beat – wasn't in the audience. She'd been into Kelly since she was a teen in the early 1990s, when she'd hide in her room with his music to escape her mother's tumultuous romantic relationships. She'd buy every magazine he was in and, upon the release of his 1993 solo debut, 12 Play, took a limo to a third-row seat at her first Kelly show. She'd seen him in concert seven times since. \"He was my Brad Pitt,\" she says.\r\n\r\nBut even though she was disappointed to miss it, bailing on the concert meant something better: she was at Fat Daddy's, a club in suburban Mansfield, Texas, setting up for the Beat-sponsored after-party. She was finally going to meet the man she'd been captivated by for more than 20 years.\r\n\"He was everything that I thought,\" says Jones. \"He was handsome. He just owned the room.\"\r\n \r\n\r\nLater that night, the guest of honor arrived. Clad in a crisp white shirt, diamond earrings and tan fedora, he hardly looked his 44 years. As Jones made her way upstairs to the VIP section, she approached R. Kelly (real name Robert Kelly). \"I said, 'Oh I'm so upset, because this is one of the first concerts I've ever missed,'\" Jones tells Rolling Stone. \"And he was like, 'Well you've seen one, you've seen them all.'\"\r\n\r\nJones says he then invited her to the next stop on the tour, which took her aback. \"I'm thinking, 'I know he's not inviting me.' On the inside, I'm freaking out a little bit,\" Jones says. \"Did he really say that? He was everything that I thought. He was handsome. He represented a powerful man. He just owned the room [and had] all the things that make up that 'Oh my God' factor.\"\r\n\r\nAs Jones tells it, when Kelly went to shake her hand after small talk, he gave her a piece of paper with his phone number and told her to text him her number. Jones says that after she texted Kelly from the bathroom, he replied, saying to always call him \"daddy\" ­– never call him Rob.\r\n\r\nWorried that any continued interaction that night would look unprofessional, Jones says she decided to take off. \"I was just like, 'I'm outta here,' beeline to my car,\" she recalls. Around 3 a.m., Jones says Kelly called her to ask where she had gone, following up with a text that read simply, \"Sin pic.\"\r\n\r\nThe night would begin, according to Jones, a two-year relationship with Kelly rife with alleged physical abuse, sexual coercion, emotional manipulation and a slew of draconian rules that dictated nearly every aspect of her life. Those rules, including what and when to eat, how to dress, when to go to the bathroom and how to perform for the singer sexually, were first described in writer Jim DeRogatis' bombshell BuzzFeed feature on Kelly last July.\r\n\r\nBut the girls that story focused on met Kelly when they were in their teens; Jones was different. She had a career. A car. An ex-husband. A child. She'd been working in radio for more than five years and was used to being around celebrities. And while Kelly denies the allegations to Rolling Stone, over the course of multiple interviews with Jones and others familiar with her situation, what emerges is a detailed account of her relationship with Kelly and a firsthand look at life in the singer's inner circle.\r\n\r\n\r\n\r\nKelly's alleged manipulation of women dates back to 1994, when the singer, then 27, married 15-year-old R&B singer Aaliyah. In 1996, Kelly was sued for $10 million by aspiring vocalist Tiffany Hawkins, who claimed that she first began having sex with Kelly at age 15 and \"suffered personal injuries and severe emotional harm because she had sex with the singer and he encouraged her to participate in group sex with him and other underage girls.\" (The lawsuit was settled for an undisclosed sum in 1998.) Kelly would eventually settle separate suits brought by two more women who said they'd had sex with him when they were under 18.\r\n\r\nIn February 2002, DeRogatis, then a reporter and music critic for the Chicago Sun-Times, anonymously received a now-infamous 26-minute video and passed it on to the police. The tape allegedly shows Kelly telling a girl to call him \"daddy\" and urinating in her mouth. The girl's aunt told the paper that the girl had only been 14. \"It's crap, and that's how we're going to treat it,\" Kelly told a Chicago TV station at the time.\r\n\r\nKelly was indicted four months later on multiple child-pornography charges and faced up to 15 years in prison. After finally going to trial in 2008, Kelly was found not guilty on all 14 counts. (Jurors admitted after the trial that they could not verify the identity of the girl, who did not testify, despite more than a dozen witnesses identifying her on the tape. Consequently, they could not definitively say that she was underage.)\r\n\r\nAs a radio personality in a still-nascent social-media era, Jones – who first became an on-air DJ in 2006 – was a conduit for listeners to comment on Kelly's legal troubles, including his 2008 acquittal. On air, she says, she tried to remain neutral, but she admits that at the time, she thought the singer may have been set up. She continued to be a devout fan. \"I still went to his concerts. We played his music [on the radio],\" she says. \"I didn't know there were other girls that he had paid off.\"\r\n\r\nJones says the two began speaking regularly via phone and text for two months after their first meeting, before they met again. \"I want you to come and see me in Denver,\" Jones says Kelly told her. \"That's my getaway spot.\" He would cover the airfare, the hotel room, everything – all she had to do was get on a plane and show up.\r\n\r\n\"I got there before he did because he of course doesn't like to fly, so he's taking the bus,\" Jones says. She had sent Kelly \"racy photos\" while he was en route to the hotel and was excited to reunite face-to-face. As she waited in the hotel room for Kelly to arrive, she heard a knock at the door. \"He brushed past me,\" Jones says. \"I'm thinking we're going to hug or peck each other. But he plopped down on the couch and pulled out his penis and started pleasuring himself.\"\r\n \"Maybe he just has weird ways of getting off,\" Jones remembers thinking during her second encounter with Kelly.\r\n \r\n\r\nJones was stunned. Should she leave? Say something? Proceed? If this were a \"regular guy working at CVS,\" says Jones, she would've been furious. But the combination of physical attraction and the two months of courteous courtship just made Jones put the incident \"in the back of my head.\"\r\n\r\n\"I was attracted to him and was just like, 'Well, OK. Fine,'\" she says. \"Maybe he just has weird ways of getting off.\" The two had oral sex that weekend, with Kelly, according to Jones, saying things like, \"I gotta teach you how to be with me\" and \"I gotta train you.\" \"He was like a drill sergeant even when he was pleasuring me,\" Jones says. \"He was telling me how to bend my back or move my leg here. I'm like, 'Why is he directing it like this?' It was very uncomfortable.\"\r\n\r\n\"But he tried to make me feel special about [the trip],\" Jones adds. \"Like, 'If I didn't really like you, I wouldn't have done that, and I wouldn't even be wasting my time flying you out, and I respect you.'\" Jones and Kelly continued their romance, with Kelly, according to Jones, sending her flowers and gifts at work. \"I had been divorced a couple of years at that point and [I was] meeting some bad guys,\" Jones says. But Kelly made her feel better. \"He's not trying to hurry up and have sex. It was an escape for me.\" She was single, lonely and her son was living in Europe with her ex-husband. Kelly offered the perfect respite.\r\n\r\nIt was in September 2011, during Jones' first trip to Chicago to visit Kelly at his Trump Tower apartment, that she began noticing odd incidents. After Jones texted Kelly that the driver arrived at the airport on time, Jones alleges Kelly told her not to speak to him and inform the singer if the driver talked to her. It was part of a pattern, Jones later realized, of male figures in Kelly's orbit avoiding interacting with any woman around the singer. Jones recalls stumbling on a stair that night and watching two male employees nearby not flinch. \"They knew not to talk to me or help or anything,\" she says.\r\n\r\nDespite the red flags, Jones was starting to fall for Kelly. She says as the singer began to confide in her more about past traumatic events like the deaths of his mother and childhood girlfriend, she began feeling protective of him. If people knew who he really was, thought Jones, they'd be more sympathetic. \"Rob kinda makes you feel like you have to defend him,\" she says. \"It's like you and him against the world. If someone brought him up [in conversation], immediately a wall went up.\"\r\n\r\nIn November 2011, Jones quit her DJ job, sold her car and moved into the singer's Chicago apartment. \"She asked me what I thought about her quitting her job and moving,\" says Veda Loca, a DJ for The Beat who worked with Jones at the time. \"I was like, 'You only live once.' I mean, fuck, it's R. Kelly.\"\r\n\r\n\r\n\r\n\"Soooo enough mushy talk I have a flight out at 2p my new journey has begun!!\" Jones tweeted at the time. \"By this time, I'm falling in love with the guy,\" she says now. A few days after Jones moved in, Kelly would release \"Shut Up,\" his first song following throat surgery in July, which doubled as a rebuke to his detractors. \"Even before the doctors was done and I could awake/A tsunami of rumors had come to wipe my career away,\" Kelly sings. \"But to everybody that be callin' me, tellin' me what they be sayin' about me/Bringin' me all of this negative shit, y'all the ones I ain't fuckin' with.\"\r\n\r\nAccording to Jones, Kelly claimed that he would pay her double her salary if she moved to Chicago, but also cautioned her on his close relationship with women. \"He said, 'I have friends and I have girls I've raised,'\" Jones recalls. \"I didn't know what he meant by 'raised' at the time. He said, 'I eventually want you to meet them, but I want to make sure you're mentally ready for that.'\"\r\n\r\nTo Jones, theirs was a mature relationship – and in the beginning, she was under the impression that Kelly was monogamous. \"As long as you don't see it or find anything suspicious, you just assume you're the only one until it's right in your face,\" she says.\r\n\r\nAlmost instantly upon moving to Chicago, Jones says, Kelly began governing nearly every detail of her life, starting with the requirement that she wear baggy sweatpants whenever she went out and text near-constant updates on her whereabouts. (A source who knew Kelly confirmed the singer's demands on Jones to Rolling Stone.) Jones says she was forced to text either the singer or one of his employees for even the slightest request. (Sample text message: \"Daddy, I need to go to the restroom.\")\r\n\r\nUnlike on earlier weekend visits, Jones says she now had to \"stand up and greet daddy\" every time he walked in the room. Jones could still travel back to Dallas to see her friends, but was tethered to her phone to supply continuous updates to the singer.\r\n\r\n \r\n\"We are suppose[d] to tell Rob [if] someone breaks a rule,\" Jones texted her friend in 2013.\r\nJones had been living with Kelly for less than a month when she claims the first instance of physical abuse occurred, in November 2011. Jones says that on a return trip to Dallas around Thanksgiving, she saw the video at the heart of his child-pornography trial for the first time and challenged Kelly on the phone about it. \"He said, 'Bitch, don't you ever fucking accuse me of something like that,'\" Jones says. \"He never had spoken to me like that before.\"\r\n\r\nJones claims Kelly remained enraged when she flew back and met him at the airport. \"My heart was just beating through my chest,\" she says. \"He just turned into a monster. I blamed myself 'cause I was like, 'Maybe I shouldn't've said anything.'\" As they drove home, Jones says she repeatedly apologized while Kelly kicked her multiple times and delivered a series of open-handed slaps to her face. \"I was putting my hand over my face and telling him I was sorry,\" Jones says. \"He would start kicking me, telling me I was a stupid bitch [and] don't ever get in his business.\" The next day, Jones says, the couple went shopping and neither spoke about the incident.\r\n\r\nShortly after the alleged abuse, Jones considered leaving Kelly but began to think \"about how ashamed I was of leaving my career.\" She was concerned about both exposing the man she loved and having \"too much explaining to do.\" \"I didn't want to damage him any further than what people already thought,\" she says. Jones claims in the first year she lived with Kelly, the singer physically abused her approximately 10 times, with the frequency increasing the following year.\r\n\r\nKelly's career hardly diminished despite his legal troubles. In June 2012, he released Write Me Back, his 11th studio album, which debuted at Number Five. He announced his Single Ladies Tour two months later.\r\n\r\nKelly took Jones on the two-month, cross-country trek, marking a relatively calm period in their relationship. \"The abuse was heavy before the tour,\" she says. \"Then when the tour came, he treated me like a princess. I just thought, 'Why would I walk away from this?'\"\r\n\r\nEach show was a barrage of sexually charged imagery. Kelly would sing about having sex to his own music, don a white leather jacket with the word \"SINGLE\" adorned in miniature LED lights, judge a mock-stripping contest from a gold-and-white throne and let fans grab his crotch while singing. In St. Louis, he caused two women to fight over a towel he asked them to use to wipe his sweaty face. \"I get horny off my own shit sometimes,\" he told the crowd at one show. \"He's eager to shock, confuse and impress in equal parts,\" Rolling Stone wrote of his Chicago stop. \"At times, his show resembles audible pornography.\"\r\n\r\nHe even included a live skit involving Jones – one that would have been absurdist, raunchy humor under normal circumstances. In retrospect, the bit takes on a more sinister meaning. After Kelly brings Jones onstage, two men dressed in white lab coats make her sign a waiver and chain her arms inside a white cage. Kelly enters as a white sheet is draped over the cage, obscuring the couple. The cage begins rocking as the band's music intensifies, with Jones and Kelly eventually shown silhouetted. After Kelly simulates oral sex on Jones, the two re-emerge, and a mock-fatigued Jones is led offstage. \"'I've never paraded around anybody before,'\" Jones says Kelly told her before the tour started. \"'I'm gonna make sure people see us together.'\"\r\n\r\n\r\n\r\n\"People started recognizing it was me on YouTube [and] thought I was living this glamorous, 'I have a butler'-type of life,\" Jones says. Kelly was particularly excited for his Dallas show, says Jones, to \"rub it in the faces\" of Jones' former colleagues at The Beat.\r\n\r\nThough she still had to text him continuously, she was given more freedom on tour. \"He'll have a car service and then take me to the hotel and be like, 'Get room service … Go shopping, spend whatever you want,\"' Jones says. \"I think he knew leading up to the tour that I was just over it. He knew that I was holding all these secrets that I had learned being in the inner circle and that I could probably be the one to nail him. So him taking me on that tour was like, 'Let me make sure I treat this one a certain way.'\"\r\n\r\nNear the end of the tour, one day after Thanksgiving 2012, Kelly released the third installment of Trapped in the Closet, his bizarre, wildly popular R&B opera. The night before, according to Jones, he and nearly 20 associates enjoyed a holiday feast in New York without her. \"I starved on Thanksgiving because the room service [at the hotel] was closed and he made me think he was coming back to get me at 11 o'clock,\" she says. \"He just hopped back in the bed the next day like it was nothing.\"\r\n\r\nR. Kelly + Kitti Jones - Cage Skit\r\n\r\n\r\n\r\n \r\n\r\nIn January 2013, Kelly moved Jones from Trump Tower to his nearby recording studio, which also contained several rooms for living quarters. Jones didn't think anything of it at the time – Kelly was moving personal possessions over to the studio, too – but says that someone close to Kelly has since told her the move was to accommodate another of Kelly's girlfriends. \"When I moved some of my things out of there, I wasn't thinking, 'Oh, some other girl is moving in,'\" Jones says.\r\n\r\nKelly housed Jones alongside two of his other girlfriends, allegedly demanding that each of them contact Kelly or one of his employees before leaving their room. Despite all three girlfriends living in one location, Jones says the singer at first tried to ensure none of them knew the others were living there. There were no locks on the doors, but cameras monitored every move and Kelly would punish the women for attempting to leave for any reason without permission. (The source who knew Kelly independently confirmed Kelly's rules with his girlfriends to Rolling Stone.) Kelly would frequently take away Jones' phone as punishment – sometimes as long as two months – cutting off her ability to request food or perform basic functions, according to Jones and the other source who knew him.\r\n\r\nTwo months into living at the studio, Jones says, Kelly began using starvation on her as punishment for not following his orders. Jones says the longest she went without food was two and a half days, though single days without a meal were not uncommon. \"Will u send a pizza here to studio I'm alone til 4am no card no money just dropped off with my blanket and the guys aren't replying,\" Jones texted childhood friend LaToya Howard on May 23rd, 2013, at 12:35 a.m. \"I feel dizzy.\" (Loca, who worked with Jones at The Beat, tells Rolling Stone that she noticed Jones' drastic weight loss after Jones broke up with Kelly and said Jones told her she had sometimes not been allowed to eat.)\r\n\r\nPer Kelly's rules, say multiple sources, any sharing of personal info – your hobbies, where you worked, your favorite food – with another woman was not allowed. (The girlfriends all had nicknames, with Jones claiming that none of them knew the others' real names upon meeting.) \"We are suppose[d] to tell Rob [if] someone breaks a rule [or tries] to be negative with each other,\" Jones texted Howard on March 16th, 2013.\r\n\r\n\r\n\r\n\"If you disclose your relationship with him [to another woman] – how long you've known him or whatever – you can get beat,\" Jones claims. \"He doesn't want in any way for one girl to feel more like, 'Oh, we're closer than you guys.' Even though we knew deep down we're all living there, we didn't address it.\"\r\n\r\nAny woman living in the studio, she says, was obligated to look down when walking down the hallway or toward the bathroom to avoid looking at other men. \"When I was on tour, it was just clear [that] people knew not to be in my path,\" Jones says. \"I don't know what he would think would happen if you're looking at somebody. I think he's looking at it like that's letting a guy know it's OK to speak to you.\"\r\n\r\n\"She started sending me text messages like, if there were guys around, she could not look at any of [them],\" Howard says. \"She had to always have her head down or if they were in a conference room and she was sitting next to Rob, he would have her turn facing him and she had to keep her head down the whole time. If a male would say something funny, she couldn't laugh.\"\r\n\r\nOne musician who opened for R. Kelly during this time also noticed Jones' guardedness. \"Probably the first week of the tour … we tried to speak to [Kitti] and she just kept walking,\" he tells Rolling Stone. \"He had control over her. She was scared to even have a conversation with anyone else. The last show, she walked up to us and hugged us but you could tell she was looking over her shoulder to make sure nobody was looking.\"\r\n\r\nTodd Muhammad, a longtime friend of Kelly's who has written and produced for the singer, denies that Kelly acted abusively toward women but admits that the singer made it a point to separate his male acquaintances from his girlfriends. \"He's very, very private,\" Muhammad says. \"I've never known him to have [a girlfriend] that would have a relationship – even a friendship – with any of his boys. ... He definitely keeps them separated.\"\r\n\"You just become numb to what's happening,\" says Jones.\r\nJones says that in March 2013, she was introduced to another one of Kelly's girlfriends. The singer brought the woman in naked and told her to crawl toward Jones and perform oral sex on her. \"He told me, 'I raised her. I've trained this bitch. This is my pet,'\" she says.\r\n\r\nThat night would begin a new, darker chapter of Jones' relationship with Kelly, one in which she claims he would force her to have sex with other women. Kelly would frequently fly girls in for sex, says Jones, and order her and his other girlfriends to hook up with them. \"You can't say no because you're going to get punished,\" she says. \"You just become numb to what's happening. It's so traumatic the things that he makes you do to other people and to him.\"\r\n\r\n\"He videotapes everything that he does, and sometimes he'll just make you watch what he's done to other girls or girls that he had be together,\" she adds. \"He would masturbate to that and then have you give him oral sex while he's watching what he did with somebody else on his iPad.\"\r\n\r\nIn one particularly graphic example, Jones claims she witnessed Kelly urinating on two women while she and the women were in the middle of a sex act with the singer. \"It was just a game for him,\" she says. \"He just went back and forth [on them] when he was peeing and told [another girlfriend] to clean it up afterwards. That was the worst that I've ever seen.\"\r\n\r\nJones claims her coerced sexual encounters with women became more frequent as time went on. \"Ninety-nine percent of the time, I didn't want to do it and I would tell him I didn't want to do it,\" Jones claims, adding that she once vomited after performing oral sex on another one of Kelly's girlfriends. \"It was the most horrible thing. People look at it and go, 'Oh, you're grown.' No. You have to actually be there to know exactly what it felt like for a person to overpower you and make you feel like there's nothing for you outside of him.\"\r\n\r\n\r\n\r\nJones describes this period from March 2013, when she was first forced to have sex with other women, to her departure that September as \"six months of hell.\" She says the punishments – including physical abuse – increased as one of Kelly's other girlfriends fabricated or exaggerated stories to Kelly that made Jones look bad. \"I was getting punished for something every week,\" Jones says. \"If I wasn't getting slapped, I wasn't eating or my phone was gone.\"\r\n\r\nKelly headlined the Pitchfork Music Festival in Chicago alongside Björk and Belle and Sebastian that July, prompting a new wave of criticism led by DeRogatis. \"What does it say when an artist who's been accused of hurting numerous young women is celebrated by IFC, the Independent Film Channel [who aired the latest installment of Trapped in the Closet] and music festivals such as Coachella, Bonnaroo and Pitchfork?\" DeRogatis wrote at the time.\r\n\r\nIn August 2013, after one instance where Kelly had taken her phone, Jones was able to secretly reactivate her Facebook account long enough to send a message to Howard asking her to FedEx an activated phone to the recording studio. \"She said, 'Can you send me a phone because Rob took the phone away and threw it out the window?'\" Howard says. Knowing that Kelly often slept until midafternoon, Jones says she timed a bathroom visit to surreptitiously grab the FedEx package.\r\n\r\nThe lowest point for Jones came that same month. By then, \"his voice scared me, seeing that he called scared me, hearing a door open and close scared me.\" Feeling \"like trash,\" Jones sat on a couch, contemplated suicide and plotted her next move. \"I just said, 'I'm gonna kill myself and it's gonna be his fault,'\" she says. \"'I can either kill myself or kill him. What use am I when I walk out of here?'\"\r\n\r\nIn September 2013, Jones told Kelly that she wanted to visit Dallas to take her son, now back from Europe, shopping for school supplies. \"I was fed up with just everything,\" she says. \"Fuck what people are gonna think. You need to take your ass home.\"\r\n\r\nShe left her possessions in Chicago, flew to Dallas with two suitcases and never returned. \"She had to be careful as to what she was packing,\" Howard says. \"Nothing that had heels or club clothing. She just had to have her sweats and T-shirts.\"\r\n\"I can either kill myself or kill him,\" Jones recalls thinking in August 2013.\r\nJones says Kelly didn't outwardly express hard feelings when she left for good, as the two spoke occasionally and amicably following her departure. But Jones was suspicious of Kelly's motives. Was he genuinely OK with the breakup, or intentionally conciliatory for fear of Jones publicizing her accusations against the singer?\r\n\r\nTwo months later, in November 2013, Kelly went to Dallas for a show and met with Jones, ostensibly to return some items she left in Chicago. Jones says he remained amiable before meeting her, inviting her to his tour bus, she thought, to retrieve her possessions.\r\n\r\nBut when she got on the bus, Jones alleges Kelly assaulted her. \"I walked on the bus and I was like, 'Hey daddy!' And I went to go hug him and he was like, 'Bitch, I'm not giving you shit' and he was just attacking me,\" says Jones. \"I knew he wasn't going to kill me, but it was a lot of force. I was thinking, 'I'm not going to call the police.' I just felt so stupid,\" she says.\r\n\r\n\"[He was] instilling the fear back in me,\" Jones says. \"When a person sees that you're not calling the police or the press on them ... it's like, 'Let me make my mark so you'll be afraid.' And it worked.\" It would be the last in-person contact the two would have.\r\n\r\nFrom the end of 2013 until December 2016, Jones tried to rebuild her life, getting a job financing for car loans. (She has since begun getting back to a career in radio.) She had complicated feelings about Kelly. On one hand, she still felt protective over him, reaching out to see how he was doing after a particularly intense video interview with the Huffington Post – one where, after the interviewer posed a series of questions that he saw as \"negative,\" he walked out. \"I was like, oh my God, poor thing,\" she says. Yet on the other hand, she was perpetually dealing with survivors' guilt and the stress of staying quiet for fear of retribution and shame, all while hoping to put her experience in the past and move on. \"I suffered in silence. I lived in fear for the last three and a half years,\" says Jones. \"I haven't been living my life. I've just kind of been existing.\"\r\n\r\nWhen Rolling Stone provided to Kelly a detailed list of allegations Jones made against him, Kelly categorically denied them. \"Mr. Kelly is aware of the repeated and now evolving claims of [Ms. Jones],\" Kelly's representative wrote in a statement. \"It is unfortunate that Ms. Jones, after public statements to the contrary, is now attempting to portray a relationship history with Mr. Kelly as anything other than consensual involvement between two adults. As stated previously, Mr. Kelly does not control the decision-making or force the actions of any other human being, including Ms. Jones, by her own admission. Any claim of wrongdoing of any kind or of mistreatment of any woman by him is false, ill-motived and defamatory.\"\r\n\r\n\r\n\r\nLast December, Timothy and Jonjelyn Savage, the parents of 22-year-old Joycelyn Savage, who is currently living with Kelly and other women, asked Jones for advice on how to get their daughter to leave the singer, the couple confirm to Rolling Stone. (In a video posted on TMZ, Savage claimed that she is living with Kelly of her own free will.) Jones hadn't been keeping up with Kelly's current girlfriends, but initially tried to help the Savages.\r\n\r\n\"I cried when she showed me photos of her daughter, and then I called [Joycelyn] 'cause I said, 'Maybe this is my moment to help somebody, 'cause I'm sitting here on this information that can stop [him],\" Jones says. \"I felt like I had the power to stop him earlier.\" Jones says she no longer is in communication with the Savages but the conversations spurred her to consider going public with her story.\r\n\r\n\"I wouldn't wish those memories on anybody,\" she says. \"I used to think about them and well up with tears, but now I'm so angry about the things that I let him get away with. I feel some sense of responsibility with the girls in the house now. I feel guilty because I was quiet for that long. Now I feel like I have a purpose again because I can talk about this, get it behind me and not be ashamed. Now I'm like, 'Bring it on.' I don't fear him at all.\"\r\n\r\nJones says she is setting up a nonprofit organization called Stop Protecting Your Abuser. \"By me being silent, it allowed him to feel untouchable, that he could keep things going as long as he could pay people off and put enough fear and shame in us that you would never speak on it again,\" she says. \"Staying silent absolutely protects your abuser.\"\r\n\r\nKelly called Jones in May of this year, the last time Jones says the two have communicated in any capacity. \"He said, 'If someone came to you right now and asked them how I treated you, you can't fucking say that I didn't treat you good. ... You had a roof over your head. You went shopping. You didn't have to want for shit. So you can never go around and say that I was a monster like other people say that I am,'\" Jones says. \"I was so scared when he was talking to me. I was like, 'This guy really thinks he did me a favor.' He doesn't look at the sexual stuff as scarring and damaging people.\"\r\nJones kept her mouth shut for a long time, but \"staying silent absolutely protects your abuser,\" she says.\r\n \r\n\r\nKelly's popularity has remained steadfast. From 1993 to 2013, 13 of the singer's 14 studio albums peaked in the top 5 of the Billboard 200, including six that reached Number One. He has sold more than 35 million albums worldwide, and in 2010, Billboard named him the Number One R&B artist of the past 25 years based on chart performance. Jones says she knows many people \"already have [their] minds made up\" about the singer, but hopes her story will be a cautionary tale to other women.\r\n\r\nJones says she never signed a non-disclosure agreement, but that Kelly wanted her to sign a document that would safeguard him from legal action. She refused. \"Rob is about to force me to sign a letter they typed up stating things I never did just to prevent me from ever suing him,\" Jones texted Howard on May 16th, 2013. \"Please save this text … in case I ever need to prove I was forced. He is saying he needs to feel protected if I leave or if he fired me.\" Jones' lawyer, Shay M. Lawson, tells Rolling Stone that no legal proceedings against Kelly have been filed, but that Jones \"is still very much exploring her legal options.\"\r\n\r\nAsked what she hopes people take away from her experience, Jones speaks in a measured yet defiant tone. \"I want them to not be so dismissive towards the women that are speaking out,\" says Jones. \"We're not just rolling over out of bed and saying, 'Hmm, let me just make up a story about R. Kelly today. Let me make it sound similar to something that he's already been accused of and put my own remix to it just [because] I want some attention.' [Anyone who has spoken out] has gotten annihilated in the press [and] from fans.\r\n\r\n\"And then they judge people by how they look: 'She's too old, he wouldn't go for her, this bitch is lying.' Any little thing to justify what he's doing to people,\" Jones continues, her voice rising. \"It pisses me off that people that really did suffer and go through the things that they did and wanted to kill themselves are still ashamed, in hiding, embarrassed and just afraid overall to speak out. The backlash from it will make you feel like [you wish you'd] never talked about it. And all this has been replaying in my head and I'm like, 'Fuck that. I'm not letting this be me.'\"", "onesignal": "wordpress-plugin"}, "movies": ["https://www.youtube.com/embed/nZGkf8Oneo8?version=3&enablejsapi=1&origin=https://www.rollingstone.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1508780940.0, "source": "https://www.rollingstone.com", "summary": ""}