{"url": "www.mercurynews.com/2018/02/15/jennifer-anistons-short-marriage-to-justin-theroux-is-over/", "text": "Click here if you are having a problem viewing the photos or video on a mobile device\n\nJennifer Aniston and Justin Theroux, one of Hollywood’s most glamorous super couples, have split after just two and a half years of marriage, the Associated Press is reporting.\n\nThe two, who had been together as a couple for seven years, had been spending quite a bit of time apart in recent months, with Theroux often spotted in New York City away from their Los Angeles home, People reported.\n\nThe couple issued a statement through Aniston’s longtime publicist, saying that the decision to separate “was mutual and lovingly made at the end of last year,” Page Six reported.\n\nThe couple also said they were making the announcement publicly, “in an effort to reduce any further speculation.”\n\n“Normally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly,” the statement read. “Whatever else is printed about us that is not directly from us, is someone else’s fictional narrative. Above all, we are determined to maintain the deep respect and love that we have for one another.”\n\nThe “Friends” star, 49, and Theroux, 46, a screenwriter and actor lauded for his performance in HBO’s “The Leftovers,” were engaged in August of 2012. They married in August 2015 in an intimate but star-studded in the garden of their $21 million minimalist estate in Bel-Air. Jimmy Kimmel officiated, according to Harpers Bazaar.\n\nAniston was previously married to Brad Pitt from 2000 to 2005. As she and Pitt were breaking up, Pitt’s romance with Angelina Jolie became public.\n\nThe announcement that Aniston and Theroux are done comes just a few days after the actress celebrated her 49th birthday Sunday in Malibu with girlfriends, including Courtney Cox. Theroux, meanwhile, was across the country for New York fashion week, Us Weekly reported.\n\nSources recently told People that their busy schedules worked for both of them and helped their marriage.\n\n“Justin often spends a few days in NYC by himself,” a source People. “When he is in NYC, Jen will catch up with friends and enjoys her own life. When Justin is in L.A., it’s very special for them. They socialize together with friends. They often go out to dinner or have people over.”\n\nBut Aniston told a story of marital bliss in a conversation with actress, comedian and writer Amy Sedaris, published in September in Harper’s Bazaar. The two shared happy memories of Aniston’s wedding to Theroux. Sedaris, who is a good friend of Theroux’, served as his “best man.”\n\n“Everything about that wedding was perfect,” Sedaris said. “Everyone was dressed like a bunch of woodland creatures, and your dress looked so beautiful and breezy.”\n\nAniston said it was “fun” to revisit a video of the wedding Theroux had just given her.\n\nBut the actress, who has a passion for interior design, also talked about the challenges of working together on updating their Bel-Air mansion, which is featured on the March cover of Architectural Digest.\n\n“They say building houses can make or break a couple,” Aniston said. “I was so used to doing it on my own, and there were moments when I was like, ‘Don’t say no so fast.’ I have this dialogue with my interior designer where I’ll go: ‘No. Hate it. Move. Next.’ That can sound a little abrupt, so I had to retool my attitude a bit. It wasn’t very hard because he loved whatever I brought to him.”", "images": ["https://www.mercurynews.com/wp-content/uploads/2017/04/leftovers_11.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/04/leftovers_11.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/02/15/jennifer-anistons-short-marriage-to-justin-theroux-is-over/", "title": "Jennifer Aniston’s short marriage to Justin Theroux is over", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Justin Aniston and Justin Theroux have announced they are splitting up after two years of marriage.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Jennifer Aniston’s short marriage to Justin Theroux is over", "url": "https://www.mercurynews.com/2018/02/15/jennifer-anistons-short-marriage-to-justin-theroux-is-over/", "description": "The actress and her actor/screenwriter husband were married for just over two years and were together for seven.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/04/leftovers_11.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-02-15T23:46:26+00:00", "modified_time": "2018-02-16T21:39:54+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Jennifer Aniston’s short marriage to Justin Theroux is over"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/04/leftovers_11.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1518624000.0, "source": "http://www.mercurynews.com", "summary": ""}