{"url": "https://www.washingtonpost.com/goingoutguide/movies/yes-oceans-8-is-a-heist-movie-but-its-also-an-empowering-cheeky-comedy/2018/06/05/9426b760-668c-11e8-a69c-b944de66d9e7_story.html", "text": "By those lights, “Oceans 8” is a dutiful (if, at times, also cheeky) heir to the franchise that began in 2001 with Steven Soderbergh’s reboot of the original “Ocean’s 11,” a suave exemplar of a male-dominated lineage that runs from the noirish “Rififi” (1955) to last year’s country-fried caper flick “Logan Lucky,” also by Soderbergh. What lends this genre outing more than a touch of topical interest is the female-centric cast, headed by Sandra Bullock and including a lively band of actresses in strong supporting roles. Like the gender-flipped “Ghostbusters” before it, this new movie neither reinvents not dishonors its inspiration, instead adding a modicum of zip — if less than turbocharged horsepower — to a vehicle that runs you through the staging of a crime by, ironically, obeying all the traffic laws.\n\nAD\n\nAD\n\nBullock plays con artist Debbie Ocean, who, as the film begins, is being released after a five-year stint in prison for running a scam. The sister of George Clooney’s Danny Ocean, the mink-oil-slick grifter who headlined the previous three “Ocean’s” films — and who, we quickly learn, is recently deceased — Debbie has hit upon a plan: steal a $150 million diamond necklace during the Met Gala, the splashy annual fundraiser of the Metropolitan Museum of Art’s Costume Institute. Crime, it seems, is not only in her blood — despite her protestations to the contrary to the parole board — it is also the only way she knows how to pay the rent. Early, amusing scenes show Debbie gaming gullible clerks at posh stores and a hotel.\n\nThe first, and least engaging, part of the tale involves what amounts to an HR recruitment video for the underworld. With the assistance of her sometime partner-in-crime Lou (Cate Blanchett), Debbie puts together the requisite rogue’s gallery of outlaws, including a daffy, down-on-her-luck fashion designer (Helena Bonham Carter); a jeweler itching to get out from her domineering mother’s thumb (Mindy Kaling); a smart-mouth pickpocket (Awkwafina); a pot-smoking computer hacker named Nine Ball (Rihanna); and a nerdy suburban mom who moonlights as a fence for stolen goods (Sarah Paulson).\n\nSpecial praise is reserved for Bonham Carter, who delivers a charming dollop of her trademark clownishness, and Awkwafina, a rapper, comedian and actress who injects a refreshing dash of street culture to a cast and story line that leans heavily on haute couture. The latter is largely courtesy of Anne Hathaway, playing the self-absorbed actress/socialite from whose neck the jewels are to be lifted, via a ballet of criminally complex sleight-of-hand. Real-world fashionista cameos include appearances by Vogue editor Anna Wintour, Kim Kardashian West and many others, playing themselves.\n\nAD\n\nAD\n\nFrom this point on, the film slowly picks up steam, delivering more and greater pleasures, mainly in the form of illegal logistics and comedy, as it navigates its way to the climax. A subplot involving the aforementioned righting of a wrong — here, it takes the form of revenge against an ex-lover who abused his trust — adds a bit of #MeToo zest to an exercise that can feel, at times, otherwise perfunctory. During the first act, Debbie explains that she won’t hire a qualified man for her team because men attract too much attention: “A ‘him’ gets interest, a ‘her’ gets ignored,” she tells Lou, setting up the film’s subversive subtext about leveraging female invisibility as a tool of empowerment. Interestingly, a planned cameo by Matt Damon, who was to have reprised his role as Linus Caldwell, was cut after an online petition circulated to remove the actor from the film after he made controversial comments about sexual harassment.\n\nPerhaps all this is making too much of “Ocean’s 8’s” significance. It’s not exactly a polemical film. But even as it plays by the rules, it nevertheless manages to score a political point or two. Eight of them, actually.\n\nPG-13. At area theaters. Contains strong language, drug use and some suggestive material. 110 minutes.\n\nAD", "images": ["https://www.washingtonpost.com/resizer/7XAbdCnzRJyB960tGvyhZL7TTts=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KFRHNYTFEEI6RJ3I5UCD4M7R3Q.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/a1b4e358-1572-4852-93f3-799e3d47e89b.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/7XAbdCnzRJyB960tGvyhZL7TTts=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KFRHNYTFEEI6RJ3I5UCD4M7R3Q.jpg", "keywords": [], "authors": ["Michael O'Sullivan", "Film Critic", "Reporter Covering Movies", "The People Who Make Them"], "canonical_link": "https://www.washingtonpost.com/goingoutguide/movies/yes-oceans-8-is-a-heist-movie-but-its-also-an-empowering-cheeky-comedy/2018/06/05/9426b760-668c-11e8-a69c-b944de66d9e7_story.html", "title": "'Ocean's 8' review: The heist movie is also an empowering, cheeky comedy", "meta_data": {"description": "A stellar female cast shakes things up in an otherwise dutiful heir to the franchise.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/goingoutguide/movies/yes-oceans-8-is-a-heist-movie-but-its-also-an-empowering-cheeky-comedy/2018/06/05/9426b760-668c-11e8-a69c-b944de66d9e7_story.html", "image": "https://www.washingtonpost.com/resizer/7XAbdCnzRJyB960tGvyhZL7TTts=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KFRHNYTFEEI6RJ3I5UCD4M7R3Q.jpg", "title": "Review | Yes, ‘Ocean’s 8’ is a heist movie. But it’s also an empowering, cheeky comedy.", "description": "A stellar female cast shakes things up in an otherwise dutiful heir to the franchise."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Review | Yes, ‘Ocean’s 8’ is a heist movie. But it’s also an empowering, cheeky comedy.", "description": "A stellar female cast shakes things up in an otherwise dutiful heir to the franchise."}, "last_updated_date": "2018-06-06T13:58:50.535Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1528128000.0, "source": "https://www.washingtonpost.com", "summary": ""}