{"url": "https://www.nytimes.com/interactive/2017/12/05/us/harvey-weinstein-complicity.html", "text": "Harvey Weinstein built his complicity machine out of the witting, the unwitting and those in between. He commanded enablers, silencers and spies, warning others who discovered his secrets to say nothing. He courted those who could provide the money or prestige to enhance his reputation as well as his power to intimidate.\n\nIn the weeks and months before allegations of his methodical abuse of women were exposed in October, Mr. Weinstein, the Hollywood producer, pulled on all the levers of his carefully constructed apparatus.\n\nHe gathered ammunition, sometimes helped by the editor of The National Enquirer, who had dispatched reporters to find information that could undermine accusers. He turned to old allies, asking a partner in Creative Artists Agency, one of Hollywood’s premier talent shops, to broker a meeting with a C.A.A. client, Ronan Farrow, who was reporting on Mr. Weinstein. He tried to dispense favors: While seeking to stop the actress Rose McGowan from writing in a memoir that he had sexually assaulted her, he tried to arrange a $50,000 payment to her former manager and throw new business to a literary agent advising Ms. McGowan. The agent, Lacy Lynch, replied to him in an email: “No one understands smart, intellectual and commercial like HW.”\n\nMr. Weinstein’s final, failed round of manipulations shows how he operated for more than three decades: by trying to turn others into instruments or shields for his behavior, according to nearly 200 interviews, internal company records and previously undisclosed emails. Some aided his actions without realizing what he was doing. Many knew something or detected hints, though few understood the scale of his sexual misconduct. Almost everyone had incentives to look the other way or reasons to stay silent. Now, even as the tally of Mr. Weinstein’s alleged misdeeds is still emerging, so is a debate about collective failure and the apportioning of blame.\n\nExecutives at Mr. Weinstein’s film companies who learned of allegations rarely took a stand, cowed by their volatile boss or worried about their careers. His brother and partner, Bob, participated in payoffs to women as far back as 1990. Some low-level assistants were pulled in: They compiled “bibles” that included hints on facilitating encounters with women, and were required to procure his penile injections for erectile dysfunction. His lawyers crafted settlements that kept the truth from being explored, much less exposed. “When you quickly settle, there is no need to get into all the facts,” said Daniel M. Petrocelli, a lawyer who handled two agreements with accusers.\n\nAgents and managers across Hollywood, who wanted in on Mr. Weinstein’s star-making films, sent actresses to meet him alone at hotels and advised them to stay quiet when things went wrong. “That’s just Harvey being Harvey,” more than one agent told a client. At C.A.A., for example, at least eight talent agents were told that Mr. Weinstein had harassed or menaced female clients, but agents there continued to arrange private meetings. Even Nick Wechsler, a talent manager at another firm who confronted Mr. Weinstein about Ms. McGowan, felt he had to maintain business ties with him: “Sometimes he was the only game in town.”\n\nMr. Weinstein held off press scrutiny with a mix of threats and enticements, drawing reporters close with the lure of access to stars, directors and celebrity-packed parties. Some journalists negotiated book and movie deals with him even as they were assigned to cover him. The studio chief once paid a gossip writer to collect juicy celebrity tidbits that Mr. Weinstein could use to barter if other reporters stumbled onto an affair he was trying to keep quiet. He was so close to David J. Pecker, the chief executive of American Media Inc., which owns The Enquirer, that he was known in the tabloid industry as an untouchable “F.O.P.,” or “friend of Pecker.” That status was shared by a chosen few, including President Trump.\n\nDisney, the kingdom of family-friendly entertainment, tightly controls its operations, but it allowed the Weinstein brothers to run the Miramax studio with virtual autonomy during the 12 years they were employees. (The pair wore T-shirts boasting “Corporately Irresponsible” to one company retreat.) Along with an impressive record of Oscars, Mr. Weinstein left Disney with a trail of settlements and claims of sexual misconduct that accumulated during his tenure. Disney, which says it was not aware of his alleged abuses, now faces accusations in a lawsuit that it “knew, should have known or was willfully blind.”\n\nMr. Weinstein, 65, is under investigation by law enforcement authorities in three cities. Though he has acknowledged that his behavior “has caused a lot of pain,” his lawyers denied that he committed sexual assault. His spokeswoman disputed claims of inappropriate advances in this article, saying Mr. Weinstein’s recollections differed from those of his accusers.\n\nA master of leverage, Mr. Weinstein parlayed his films into relationships across the worlds of entertainment, politics, publishing and beyond, achieving a stature that at times proved useful in intimidating others and protecting himself. “I know the president of the United States. Who do you know?” Mr. Weinstein, a Democratic fund-raiser, would say during the years Barack Obama was in the White House, adding expletives. “I’m Harvey Weinstein,” he used to say. “You know what I can do.”\n\nIn late September, emails show, he was discussing a documentary television show he was working on with Hillary Clinton. He had long raised campaign cash for her, and her feminist credentials helped burnish his image — even though Tina Brown, the magazine editor, and Lena Dunham, the writer and actress, each say they had cautioned Mrs. Clinton’s aides about his treatment of women. Now, Mr. Weinstein exchanged questions about distribution rights for the show. “I am hopeful we can get a good price for this,” Robert Barnett, Mrs. Clinton’s lawyer, replied.\n\nTwo days later, Jeff Bezos, founder and chief executive of Amazon, interrupted a vacation in Hawaii to field advice from Mr. Weinstein, according to the emails. The Wall Street Journal was reporting on turmoil at Amazon Studios, one of Mr. Weinstein’s business partners. He recommended an aggressive response that involved hiring some of his own team, including a libel lawyer who “makes sure everyone sticks to the right narrative,” Mr. Weinstein wrote. He added, “I’m happy to coordinate with whoever you’d like, as a friend of the court.” Mr. Bezos declined to comment.\n\nEven as Mr. Weinstein was aware that reporters were examining his behavior, he attended the Toronto International Film Festival in September and invited two women to his hotel room. He alternated between making massage requests, other unwelcome advances and offers of career help, said the women, who asked to remain unidentified, but whose account was backed up in part through text messages and a friend who was told at the time of the encounter. Then, the women said, he issued pleas and warnings not to tell anyone. Mr. Weinstein called the account “nonsense.”\n\nHe pressured his business associates, telling Lance Maerov, an outspoken member of the Weinstein Company board, that he would find embarrassing details from his past and use them against him. He pushed Irwin Reiter, an executive who had worked with him for three decades, to speak favorably of him to reporters. When Mr. Reiter refused, he said, Mr. Weinstein responded that he had damning information about him too.\n\nAbout the same time, he tried to facilitate a business deal with Ms. Lynch, the literary agent consulting with Ms. McGowan, and others. “Getting together with three intelligent women would help my image immensely,” he wrote in an email, proposing a meeting. That never happened, according to Ms. Lynch. She said that she felt Mr. Weinstein was trying to ingratiate himself with her because of her relationship to Ms. McGowan, and that she was simply playing along. Jill Messick, Ms. McGowan’s former manager, never received or accepted money from the producer, her lawyer said.\n\nMinutes before The New York Times published the first allegations about Mr. Weinstein this fall, he called the reporters who wrote it. Swinging between flattery and threats, he said that he had ways of knowing who had cooperated with the investigation and the means to undermine it.\n\n“I am a man who has great resources,” he warned.\n\nAt Agencies, a Failure to Act\n\nMia Kirshner, a Canadian actress who was 19 when she starred in the film “Exotica,” traveled to New York not long after its 1994 release. Miramax distributed the movie, and her agents at C.A.A. had set up a meeting with Mr. Weinstein at her hotel. “We thought it was a coup,” she recalled. The producer had already told Ms. Kirshner, whose grandparents had survived the Lodz ghetto in Poland, that he wanted to discuss a film about the Warsaw ghetto uprising. But when he came to her room, his agenda was to exchange sex for career opportunity, the actress said. While she rejected him, the experience left her feeling “extremely upset and alarmed and scared,” and somehow, like so many other women who say he targeted them, at fault.\n\nShe told her primary agent, Lisa Grode, who sounded shocked. In a subsequent conversation, her talent manager, John Carrabino, and his boss, Sandy Gallin, joined the call. Mr. Gallin was outraged and urged Ms. Kirshner to meet with the producer again, while wearing a wire. “I remember John and Lisa were both like, ‘Sandy, no!’” Ms. Kirshner said. From the general tone of the conversation, she concluded she should drop the matter. “I was told to forget about it; it was pointless to do anything about this,” Ms. Kirshner said.\n\nShe was grateful to Ms. Grode for signing her and for encouraging her to get a college degree, she said. But in that moment, she recalled, “I was very disappointed by them.”\n\n“It all came down to money,” she said. “It speaks to why he was protected as opposed to the actors.“ Ms. Grode and Mr. Carrabino declined to comment; Mr. Gallin is deceased.\n\nIt is impossible to say how many women might have been spared Mr. Weinstein’s alleged sexual aggression had more agents responded with the impulse to act. At C.A.A., at least eight agents had heard about Mr. Weinstein’s behavior, largely from actresses they represented, but several former senior C.A.A. agents said they were unaware of it or any formal agency response.\n\nIn a statement, C.A.A. said it apologized “to any person the agency let down for not meeting the high expectations we place on ourselves.” Like other agencies, it said it had begun revising its management structure to include more women and improve its sexual harassment policies.\n\nWhen asked if he had known of Mr. Weinstein’s alleged harassment of clients, Bryan Lourd, a partner at C.A.A., declined to comment, citing client confidentiality. In mid-September, Mr. Weinstein stormed into Mr. Lourd’s office to complain about an article that Ronan Farrow, a C.A.A. client, was writing on Mr. Weinstein’s alleged misconduct for The New Yorker, according to someone familiar with C.A.A.’s dealings with Mr. Weinstein. Later that month, Mr. Lourd tried to set up a meeting at the producer’s request. “This guy won’t meet right now,” he wrote to Mr. Weinstein on Sept. 26. “He did say he will call you soon. I think he is absolutely pursuing the story.”\n\nThe top agencies are among Hollywood’s most male institutions; none has ever been led by a woman. “Given everything that has happened, agencies are suddenly on a very steep learning curve, but I think they are doing the work to create a better environment,” said Marti Noxon, a television producer. She had been disappointed in the past by an agent’s response when she reported that she had been sexually harassed.\n\nTwo decades ago, Ashley Judd, who met Mr. Weinstein in his hotel room for what she thought was a business meeting, said she turned down the producer’s repeated offers of a massage, as well his efforts to steer her toward the bathroom so she could watch him shower. After the encounter, the actress made no secret of what had transpired, and told her agent, Michelle Bohan, who was then at the William Morris Agency. “I know my agent would have done whatever I asked her to do,” Ms. Judd said. “I honestly didn’t know what to ask anyone to do.” Ms. Bohan, who remains Ms. Judd’s agent, declined to comment.\n\nFailure to take action in the face of misconduct accusations was hardly limited to cases involving Mr. Weinstein. After complaints about his treatment of women became public, Reese Witherspoon said in a recent speech that a director had sexually assaulted her when she was 16, and she expressed anger toward “the agents and the producers who made me feel that silence was a condition of my employment.”\n\nAgents often sign actresses when they are at peak value to the industry — just out of their teens, if not still in them — and also at peak vulnerability, given their youth. Although agents are charged with protecting their clients’ interests, they earn their living, indirectly, from the executives who write their clients’ paychecks. For agents, actors and actresses might come and go, but Mr. Weinstein was one of Hollywood’s seemingly permanent fixtures, distributing as many as 30 films a year.\n\nIn the absence of any collective discussion of Mr. Weinstein’s alleged behavior, stories circulated in the industry, tainting many of those associated with him. More than two decades ago, Gwyneth Paltrow reported advances he made in a hotel room to her agent, Rick Kurtzman of C.A.A. Mr. Kurtzman “looked incredulous” and expressed revulsion, Ms. Paltrow said, but he did not suggest discussing the episode with the agency’s leaders. Mr. Kurtzman declined to comment.\n\nMs. Paltrow went on to become known as the first lady of Miramax, winning an Oscar in 1999 for her performance in “Shakespeare in Love.” But without her knowledge, Mr. Weinstein was tarnishing and trading on her golden-girl image. Ms. Paltrow said she rebuffed Mr. Weinstein. But now, she is hearing that as he tried to coerce other women, he repeatedly boasted that he had sex with her. Complying with him was “the best thing you can do for your career now,” Mr. Weinstein told one young actress in 2000, mentioning Ms. Paltrow and others. Another woman, who alleged that Mr. Weinstein assaulted her in 2004, recalled a photo of Ms. Paltrow prominently displayed in the room.\n\nIn recent weeks, Ms. Paltrow has started to connect with some of those who said Mr. Weinstein cited her name in disturbing encounters. She said the phone calls with the other women have been devastating. “He’s not the first person to lie about sleeping with someone,” she said in an interview, “but he used the lie as an assault weapon.”\n\n‘Impossible to Control’ at Disney\n\nWhen Disney bought Miramax in 1993, it acquired an un-Disney-like duo from New York, brothers who already had reputations as ruthless businessmen and fearsome bosses.\n\nBut the Weinsteins had an eye for talent and success in critically acclaimed art house films. They were given wide latitude — “virtual autonomy,” as Disney put it in a statement — a move meant to preserve Miramax’s creative culture. That hands-off supervision, several former executives now suggest, could have inadvertently created opportunities for misconduct that Mr. Weinstein exploited.\n\nThe Disney-Miramax relationship soon became strained. Over the years, multiple Disney executives cycled through the thankless task of monitoring the Weinsteins. They spent lavishly. They took on edgy films that made Disney uncomfortable. Without Disney’s knowledge, they negotiated to launch Talk, a magazine edited by Ms. Brown. They bristled at Disney’s restraints. “They were impossible to control,” said Bill Mechanic, a former executive. Soon after The Times published its story about the allegations against Mr. Weinstein, Disney’s former chief executive, Michael D. Eisner, called him “an incorrigible bully” on Twitter.\n\nBut Disney continued to bankroll the Weinsteins with hundreds of millions of dollars a year — more money than they had ever handled before — and Mr. Eisner tolerated them as they were churning out hits. When Chris McGurk, then a Disney executive, broached the idea of selling Miramax in the mid-90s, he recalled Mr. Eisner saying, “I’m not selling as long I’m chairman.”\n\nDisney said that it did not know of any complaints, lawsuits or the settlements dealing with sexual misconduct involving Mr. Weinstein, and no clear evidence to the contrary has emerged. But there were hints of other troubling behavior.\n\nOne involved a physical altercation with a male employee at a film conference in the mid-90s that resulted in a financial settlement. About that time, the producer Sybil Robson Orr said that when she complained to Mr. Weinstein about falling short on a distribution deal, he berated her with vulgarities, pounding his desk and vowing to destroy her career, according to a 1996 lawsuit. Two Disney executives joined in the threats, she claimed.\n\nShe prevailed, receiving a “sizable award,” said Bertram Fields, the lawyer who represented her. “No one is going to do that again,” Mr. Weinstein vowed, according to a former Miramax official. The producer and his company later hired Mr. Fields and another star litigator, David Boies.\n\nIn 2004, the Weinsteins turned their high-powered lawyers on Disney as a showdown loomed over growing business disagreements. The next year, Disney and the Weinsteins split. The brothers started the Weinstein Company, reportedly raising about $1 billion and attracting investors including Fidelity, Quinta Communications and Goldman Sachs, their banker. Goldman, which compiled a 142-page initial offering for investors, said it was not aware of Mr. Weinstein’s alleged misdeeds.\n\nBy that time, dozens of women had become victims of Mr. Weinstein, they now say. One of them, a Canadian who anonymously filed a lawsuit accusing him of assaulting her in 2000, said in an interview: “You do not get to trade on my physical safety for your accolades and your Oscars.”\n\nKeeping the Media Close\n\nShortly after the news investigations of Mr. Weinstein’s alleged abuse were published, A. J. Benza, a former New York Daily News gossip columnist, received a two-word text from the producer: “Help me.”\n\nMr. Benza had been integral to the network of friendly journalists — gossip columnists, magazine writers, editors and authors — whom the producer relied on to promote his entertainment empire and sometimes punish rivals or deflect threats.\n\nOver dinner in West Hollywood in late 2003 or early the next year, the men had discussed a plan to help Mr. Weinstein avoid embarrassment. While married to his first wife, he had become involved with someone else, Mr. Benza discovered. A clerk at a Los Angeles art studio where he commissioned a gift for Mr. Weinstein — a painting of a reimagined “Hollywood” sign reading “Harveywood” — volunteered to Mr. Benza that a friend, Georgina Chapman, was seeing the producer. Mr. Weinstein, who would later marry Ms. Chapman, was separated and wanted to keep the relationship confidential until he was divorced, according to his spokeswoman, Sallie Hofmeister.\n\nMr. Benza, then between jobs, had a suggestion. “I could supply your P.R. girls with a lot of gossip — a lot of stories — and if people come at them with the ‘Harvey’s having an affair story,’ they can barter,” Mr. Benza recalled telling Mr. Weinstein. “He said, ‘A. J., it’s got to be good stories,’ and I said, ‘Don’t you worry about it.’”\n\nCollecting a monthly retainer, Mr. Benza said, he reported items on Roger Clemens, Michael Jackson and others and sent them to Mr. Weinstein’s communications team, though he didn’t know whether they were used to trade away stories about the producer. Mr. Weinstein’s spokeswoman said the payments to Mr. Benza were for public relations work during Miramax’s dispute with Disney.\n\nAfter 10 months, Mr. Weinstein said, “I think the coast is clear; I think we beat this thing,” according to Mr. Benza, who recently had a brief stint as a writer for American Media and also runs his own gossip podcast, “Fame Is a Bitch.”\n\nMr. Benza and Mr. Weinstein were exploiting a longstanding system of favor-trading between the press and the movie business. Gossip writers need a stream of insider scoops, industry beat reporters need exclusives on the next big deal and glossy magazines need celebrities who can drive newsstand sales. Mr. Weinstein, who wanted glowing coverage, could provide that and more.\n\nThe producer often held out business opportunities to those who covered him. He had book and movie deals with writers and editors at Fox News, The New York Post, Premiere magazine, Vanity Fair, Variety and elsewhere. In Mr. Benza’s case, a book contract came immediately after he left The Daily News. In interviews, several journalists who had business ties to him said the arrangements did not cause them to pull punches.\n\nHe had particularly strong ties to the tabloid giant American Media — owner of The Enquirer, Globe, OK!, Radar Online and others — with which he teamed up to pursue several media and production deals.\n\nOn occasion, Mr. Weinstein’s defenses showed cracks. Two journalists learned of assault accusations against him — David Carr and Ken Auletta — while writing warts-and-all profiles of him in the early 2000s.\n\nMr. Auletta, of The New Yorker, said he learned about a sexual assault allegation that a former assistant had made against the producer, and a related settlement that required confidentiality. Mr. Auletta said that he and his editors concluded just before publishing that they could not include the allegation because the woman would not agree to cooperate.\n\nMr. Carr, a New York Times columnist who died in 2015, heard about Ms. McGowan’s assault allegation and other accusations while reporting a profile for New York magazine in 2001, his editors said.\n\nSeveral weeks before the article was published, Kroll, a private investigative agency that did work for Mr. Weinstein, provided him with some details of Mr. Carr’s reporting, according to a former Miramax executive who spoke on the condition of anonymity. Mr. Carr wrote in the profile that Mr. Weinstein seemed to have “near-perfect visibility into my notebook,” and told friends that Mr. Weinstein called him before publication to read a line he had written.\n\nHis spokeswoman dismissed the account as “urban legend,” and a top Kroll executive, Daniel E. Karson, did not respond to a request for comment.\n\nMr. Carr’s article also did not include any sexual misconduct allegations; Caroline Miller, then New York’s editor, said that none of the women would speak on the record. That same wall of silence would stymie other journalists in the years that followed.\n\nPlaying the Gossip Card\n\nMr. Weinstein’s secrets began seeping out in March 2015, after the New York City police questioned him about an allegation that he groped an Italian model, Ambra Battilana.\n\nAs he and his legal team worked to undermine Ms. Battilana’s credibility, American Media entered the picture.\n\nMr. Weinstein had struck a business deal earlier that year with American Media, working with Dylan Howard, The Enquirer’s editor and the company’s chief content officer, on a talk show. American Media was known to sometimes help out allies in trouble with a strategy known in tabloid newsrooms as “catch and kill” — acquiring exclusive rights to damaging stories and then not publishing them.\n\nIn the Battilana case, the company scrambled to buy her story. But a sale never went through, American Media said, because Ms. Battilana’s price was too high. She said, through a spokesman, that she “never sought out or solicited any offers.” Documentation reviewed by The Times, in fact, shows her rebuffing an attempt to pay her. Prosecutors ultimately did not pursue charges against Mr. Weinstein, citing insufficient evidence, and the story did not appear in America Media publications.\n\nA few months later American Media and the Weinstein Company expanded their partnership. And after two actresses, Ms. Judd and Ms. McGowan, made veiled mention of misconduct by Mr. Weinstein in 2015 and 2016, Mr. Howard came to his aid. The Weinstein Company told the editor about Ms. McGowan’s allegations and said “it might be a good article for him to pursue,” according to Ms. Hofmeister, the producer’s spokeswoman. She said that Mr. Howard was never asked to “dig up damaging information on actresses.”\n\nMr. Howard dispatched a reporter at the entertainment news service Coleman-Rayner, which works with American Media, to collect hostile commentary about Ms. McGowan. “This is killer. Especially if my fingerprints r not on this,” Mr. Weinstein wrote in an email obtained by The Times and first reported in The New Yorker.\n\nIn November last year, Lauren O’Connor, a former Weinstein Company employee who had written a blistering memo asserting sexual harassment and other misconduct by Mr. Weinstein, received calls from a Coleman-Rayner reporter. He said he was working on a story about “major studio heads” and kept pressing her to speak even when she declined. She said it made her so uncomfortable she reported the phone call to her lawyer.\n\nAmerican Media has acknowledged that it sometimes worked to gather information to help Mr. Weinstein because of mutual business interests. “To the extent AMI provided ‘off the record’ information to Mr. Weinstein about his accusers,” the company said in a statement, it did so “at a time when Mr. Weinstein was denying any harassment.” The statement said Mr. Howard would not have allowed the information to be published.\n\n(On Tuesday, The Associated Press reported that American Media had conducted an inquiry in 2012 into sexual harassment allegations against Mr. Howard, but concluded there had been no serious wrongdoing.)\n\nBy fall last year, Mr. Weinstein was trying to stop what he feared would be a story about the allegations against him by New York magazine. Once again, he called on Mr. Benza, meeting him at the Peninsula Beverly Hills that October.\n\nSaying the magazine was “doing a Bill Cosby on me,” Mr. Weinstein asked for help, Mr. Benza recalled. He said he did not believe at the time that the studio chief had abused women, and despite feeling a debt of loyalty, would not have knowingly participated in a scheme to silence victims.\n\nHe said Mr. Weinstein suggested that Mr. Benza pose as an author “writing a hit job,’’ so he could call potential sources to learn what they were saying about the producer. Mr. Weinstein discussed paying Mr. Benza up to $20,000 a month and providing a list of contacts, Mr. Benza said, though the producer never followed through. Mr. Weinstein’s spokeswoman denied that he had proposed the scheme.\n\nBut a list was shared with Mr. Howard, who sent Mr. Weinstein an email last December with an attachment called “Contacts” and a note reading, “Let’s discuss next steps on each.”\n\nThe New York magazine piece never materialized; the accusers would not speak on the record. But The Times, NBC and then The New Yorker began pursuing their own stories.\n\nThe day before The Times published its article this fall, Mr. Weinstein was planning to make his last defense. He wrote an urgent email to Mr. Howard, instructing him to meet outside the newspaper’s headquarters in Manhattan. American Media said that Mr. Howard did not show.\n\nThe Celebrity Shield\n\nIf Mr. Weinstein built his wall of invulnerability from many varied bricks, it was covered with a sheen of celebrity. He created stars through his movies, but he also acquired famous friends through his other activities, including in the Democratic politics that dominate Hollywood.\n\nChief among them were Bill and Hillary Clinton. Over the years, Mr. Weinstein provided them with campaign cash and Hollywood star power, inviting Mrs. Clinton to glittery premieres and offering to send her films. After Mr. Clinton faced impeachment in the Monica Lewinsky scandal, he donated $10,000 to Mr. Clinton’s legal defense fund. Mr. Weinstein was a fund-raiser and informal adviser during Mrs. Clinton’s 2000 Senate campaign, a guest in her hotel suite when she won and a host of an A-list victory party. He was an early backer of both her presidential bids.\n\nMr. Weinstein’s political activity — he provided consistent support for Mr. Obama as well — boosted his image as a man with friends in high places and close ties to the country’s leading female politician. It is not clear if rumors of his record of sexual misconduct had ever reached them.\n\nBut two prominent women said they warned Mrs. Clinton’s team. In 2016, Lena Dunham, the writer and actress, said she was troubled by the producer’s visible presence during Mrs. Clinton’s presidential run, hosting fund-raisers and appearing at campaign events. She had heard stories, both directly and secondhand from other actresses, about disturbing encounters with him, she said. So in March last year, Ms. Dunham, a vocal Clinton supporter, said she warned the campaign.\n\n“I just want you to let you know that Harvey’s a rapist and this is going to come out at some point,” Ms. Dunham said she told Kristina Schake, the campaign’s deputy communications director. She recalled adding, “I think it’s a really bad idea for him to host fund-raisers and be involved because it’s an open secret in Hollywood that he has a problem with sexual assault.”\n\nEarlier, during the 2008 presidential race, Tina Brown, the magazine editor, said she cautioned a member of Mrs. Clinton’s inner circle about him. “I was hearing that Harvey’s sleaziness with women had escalated since I left Talk in 2002 and she was unwise to be so closely associated with him,” Ms. Brown said in an email.\n\nMs. Dunham said that Ms. Schake seemed surprised at her warning, and that Ms. Schake said she would tell Robby Mook, the campaign manager, Ms. Dunham recalled in an interview.\n\nThe #MeToo Moment The latest news and insights on the sexual harassment and misconduct scandals roiling society.\n\nWith the Democratic National Convention approaching in summer 2016, Ms. Dunham said she also warned Adrienne Elrod, a spokeswoman for Mrs. Clinton who was leading efforts with celebrity campaigners. As far as Ms. Dunham could tell, the campaign had not responded to her concerns about Mr. Weinstein. Weeks before Election Day, the producer helped organize a star-packed fund-raiser: an evening on Broadway with Julia Roberts, Anne Hathaway and others.\n\nMs. Elrod and Ms. Schake, through Mrs. Clinton’s communications director, denied that Ms. Dunham mentioned rape, while Mr. Mook said that no one had ever alerted him about the producer.\n\nNick Merrill, the communications director, said in a statement: “We were shocked when we learned what he’d done. It’s despicable behavior, and the women that have come forward have shown enormous courage. As to claims about a warning, that’s something staff wouldn’t forget.” Referring to Ms. Dunham, the statement continued, “Only she can answer why she would tell them instead of those who could stop him.” Mr. Merrill added that no one could find people from the 2008 campaign who could recall a warning from Ms. Brown.\n\nMrs. Clinton herself said in a statement in October that she was “shocked and appalled by the revelations,” adding that the alleged behavior “cannot be tolerated.”\n\nWhile Ms. Dunham says she has “an incredible allegiance to Hillary,” and does not believe the reports ever traveled to Mrs. Clinton, she remains troubled by what had happened. “A year and a half ago, on one of the most progressive campaigns in history, this wasn’t a problem,” she said, referring to the allegations about Mr. Weinstein.\n\n(Ms. Dunham herself stirred controversy recently for defending a former colleague accused of sexual assault, though she later apologized.)\n\nDays after Mrs. Clinton’s election loss, the Clintons had dinner with Mr. Weinstein, Mr. Boies, the lawyer, and their wives at Rao’s restaurant in Harlem, Manhattan.\n\nMrs. Clinton and Mr. Weinstein began planning a documentary TV show about her campaign. Discussions about the project stretched out for months with her lawyer, Robert Barnett, who emailed with Mr. Weinstein on Sept. 28 about potential European buyers.\n\nIn a statement, Mr. Barnett said that “talks were ongoing until the allegations surfaced, at which point all discussions ceased — completely and permanently.”\n\nAt Work, ‘Nothing Was Done’\n\nBeginning in 2014, one of Harvey Weinstein’s longest-serving employees had an overdue realization that he needed to do something about his boss’s treatment of women.\n\nIrwin Reiter had done finance and accounting work for Mr. Weinstein for three decades. He knew the outlines of a few alarming episodes with female employees over the years, but he had never intervened. Like many others, he had brushed aside Mr. Weinstein’s private relations with actresses, figuring it was an embarrassing but consensual extramarital habit.\n\nNow Mr. Reiter watched the public accusations mount against Bill Cosby. He learned that Mr. Weinstein allegedly harassed a new employee named Emily Nestor, offering her career help in return for sex. Sandeep Rehal, then a 28-year-old assistant, began confiding in him about some of Mr. Weinstein’s demands. She had to rent him a furnished apartment, using his corporate credit card to stock it with women’s lingerie, flowers, two bathrobes and extra clothes for Mr. Weinstein.\n\nMr. Weinstein had long used his company credit card with abandon, relying on assistants to classify what was business or personal, sometimes writing checks to reimburse the company, according to several current and former employees. Now, on top of his salary — $2 million before bonuses in 2015, according to his contract — he wanted the business to pay expenses including a $27,000 tip for yacht staff and a private jet stop in Europe to pick up a model. Mr. Reiter and other executives also began to question why he was putting women on movie production payrolls without clear assignments.\n\n“How many????????????? How many are enough???? How many are too much???” Mr. Reiter wrote in a February 2015 email to Tom Prince, the head of physical production.\n\n“We fly ‘actresses’ in from all over the world for 1-2 lines of dialogue,” Mr. Prince wrote back.\n\nIn a statement, Mr. Weinstein’s lawyers, Blair Berk and Ben Brafman, said that he never used “company resources for personal expenditures,” and that he reimbursed the company “where there was any confusion.”\n\nConcerned that his boss’s activities were “going to take the company down,” Mr. Reiter and other executives decided they should act. But Mr. Weinstein was the dominant figure in the company. He and his brother owned nearly half the business and served as co-chairmen, and he packed the board with allies.\n\nFellow executives helped mask Mr. Weinstein’s behavior going back to 1990. That year, a 23-year-old assistant said he sexually assaulted her when she ran an errand at his home. Bob Weinstein worked on the confidential settlement, according to two people familiar with the agreement — the first of at least three he would be involved in over the years. In a statement, Bob Weinstein said he did not recall being informed of the initial settlement, and denied being aware that his money was used to pay off two other accusers.\n\nAfter the episode with the young assistant, Harvey Weinstein confessed that he had done “something terrible,” according to John Schmidt, then Miramax’s chief financial officer. “I don’t know what got into me. It won’t happen again,” Mr. Schmidt, in an interview, recalled Mr. Weinstein telling him. Mr. Weinstein denied having this conversation.\n\nBut the allegations kept coming. Even as other women at the company complained of abuse, Mr. Weinstein was never fully held to account. In 1998, Zelda Perkins, an assistant in London, confronted him about harassing her and allegedly assaulting a colleague. Donna Gigliotti, a senior executive who had left Miramax a few years earlier, recommended a lawyer and encouraged Ms. Perkins to demand more settlement money. But “Shakespeare in Love,” which Ms. Gigliotti had produced with Mr. Weinstein, was about to be released. “She clearly felt that it was perfectly fine to get me to down Harvey,” Ms. Perkins said. But “she wasn’t going to stick her neck out.”\n\n“When Zelda told me what happened to her colleague, I was horrified,” Ms. Gigliotti said in a recent email. “Once I was sure she had good independent counsel, I thought it best to let her lawyer determine how to approach and deal with Harvey. I did what I thought was best for Zelda,” she said, adding that she did not speak to Mr. Weinstein for years afterward.\n\nIn 2010, Ms. Gigliotti resumed working with Mr. Weinstein, becoming the president of production at his company. She left a year later.\n\nThe Weinstein brothers used “fear, intimidation, psychological and emotional abuse” on their executives, male and female, said Amy Israel, Miramax’s former co-head of acquisitions. “As a spectator to the abuse you were silenced by the fear that you would become the next target,” she said. “The only alternative seemingly was to quit — to throw away everything you had worked so hard for and walk out the door.”\n\nEven as someone with stature, Ms. Israel was not immune: Mr. Weinstein promoted her, praised her work, then harassed her, she said. When she stopped by his hotel room to pick him up for a film festival screening in 1994, she said, he was nearly naked and asked her for a massage.\n\n“I reported the incident to someone more senior,” she said. “And I was told that another one of my other colleagues had also been harassed. But no one had ever bothered to warn me. Even after reporting it, nothing was done.” She started warning female colleagues never to be alone with Mr. Weinstein, she said.\n\nThe human resources department was seen by many as protecting Mr. Weinstein more than his employees. When Ms. O’Connor complained that she was frightened to travel with Mr. Weinstein, “the response was basically, ‘let us know if he hits you or crosses a line physically,’” she wrote in a 2015 memo. After she submitted a document detailing allegations of sexual harassment and other misconduct by Mr. Weinstein, Mr. Boies and another lawyer helped reach a settlement with her.\n\nGot a confidential news tip? Do you have the next big story? Want to share it with The New York Times? We offer several ways to get in touch with and provide materials to our journalists.\n\n“The first time I spoke out, the message from H.R. was, ‘This is not our problem,’” Ms. O’Connor said in an interview. “The second time I spoke up the response was, ‘How can we quickly make this go away?’”\n\nMr. Weinstein shielded himself with legal measures that silenced alleged victims and muffled employees. Mr. Weinstein has said he struck at least eight to 12 settlements with women claiming mistreatment, according to two associates who spoke on the condition of anonymity. Steve Hutensky, a Miramax lawyer nicknamed the Cleaner-Upper by some colleagues, helped write an agreement with Ms. Perkins in 1998 that barred her from disclosing Mr. Weinstein’s name, even to a therapist, and required her to provide “reasonable assistance” to Miramax if the company chose to contest any criminal investigation that might arise.\n\nMr. Hutensky also helped implement an unusually restrictive nondisclosure agreement, obtained by The Times, that prohibited Miramax employees from disclosing any information about “Harvey Weinstein and Bob Weinstein and their family members, friends and/or business associates,” without the written consent of the brothers. Mr. Hutensky declined to comment.\n\nMr. Boies, a trusted adviser to Mr. Weinstein, signed a contract this summer with Black Cube, a private investigative firm founded by former intelligence analysts from the Israel Defense Forces. The firm was hired to block The Times’s reporting about Mr. Weinstein, and an operative posed as a women’s rights advocate to get information from an accuser, The New Yorker reported. Black Cube declined to discuss its operations, and Mr. Boies said he did not select the firm or direct its work.\n\nMr. Weinstein cast some of his youngest and least powerful employees in the most uncomfortable roles. In recent weeks, their actions have become a matter of painful debate: Were they careerists doing whatever it took to advance, or victims themselves?\n\nSome women whom the producer allegedly targeted describe assistants manipulating them with chilling detachment. In 2004, when Ashley Matthau was a dancer in a Weinstein film, she said his assistant ushered her into a car, told her that the meeting with the producer was for business purposes and then waited outside a hotel room. There, she said, Mr. Weinstein pushed her on a bed and masturbated on her. When she walked out, the assistant was waiting. Ms. Matthau began to cry, but the woman “wouldn’t even acknowledge me,” she said. “It just seemed like a well-oiled machine.” She later reached a settlement with Mr. Weinstein.\n\nProtesting could get an assistant fired: Michelle Franklin, who worked in London in 2012, said her initial alarm about arranging encounters only escalated as she saw women who appeared emotionally bruised by them. One day, as she guided a woman to Mr. Weinstein’s hotel room, she confronted him. “It’s not my job, and I don’t want to do it,” she remembers saying. “Your opinion doesn’t count,” she said he responded. She was fired soon after.\n\nOthers stayed quiet because they felt like they shared a shameful secret. “You become more and more aware of everything going on, then you realize what it is you’re cleaning up, and you don’t ever want to tell anyone that — friends, family, my parents — what kind of job this is,” Ms. Rehal said. She and Ms. Franklin said they were tasked with procuring injectable erectile dysfunction drugs, Caverject and alprostadil. Mr. Weinstein paid with his company card and gave Ms. Rehal a $500 bonus for supplying the medication, she said. Ms. Rehal said she had to keep a supply of the shots at her desk, dispense them to him in brown paper bags and sometimes deliver the medication to hotels and elsewhere before his meetings with women. She and Ms. O’Connor said they had to escort Mr. Weinstein to sex-addiction therapy in 2015.\n\nMr. Weinstein somehow knew personal information about Ms. Rehal, mentioning her student loans and where her younger sister attended school and saying he could have her kicked out. Rewards awaited those who went along, he said. “This is Harvey Weinstein University, and I decide if you graduate,” he told Ms. Rehal and other assistants. Other former employees recall him saying, “One phone call and you’re done.” Mr. Weinstein denied threatening Ms. Rehal about her sister.\n\nEven as Mr. Reiter learned more, he said his efforts to stop Mr. Weinstein went nowhere: The man and the business were too intertwined. Mr. Reiter several times confronted Mr. Weinstein, who brushed him off. Along with David Glasser, the president, and Andy Kim, the chief financial officer, Mr. Reiter voiced concerns with a board member in summer 2015 about whether Mr. Weinstein’s employment contract should be renewed. The executives put together a plan with Bob Weinstein to eject his brother from the company — they called it “Plan B” or the “non-Harvey option,” according to Mr. Reiter. In the end, the board renewed his contract.\n\nSoon Mr. Reiter found himself under scrutiny. Mr. Boies acknowledged to Mr. Reiter that a security firm was scanning his computer, Mr. Reiter said. It was not the first time Harvey Weinstein had surveilled his associates: Years before, a former Miramax executive who was in a legal dispute with the producer and his company said operatives from Beau Dietl & Associates tailed him, even while he and his wife drove their children to school in Westchester County, N.Y. Richard A. Dietl, head of the private investigative firm, said he could not recall working for Mr. Weinstein.\n\nA decade ago, Kroll investigators spent weeks sifting through employee emails looking for derogatory comments about Mr. Weinstein, searching for phrases like “hate Harvey” and another that used the word “fat” followed by an expletive, according to a person familiar with the undertaking. More recently, when Mr. Weinstein heard that Jessica Lewis, a casting director on the television show “Marco Polo,” was discussing his behavior toward women, he told her, “I have ears and eyes everywhere!”\n\nJust before the Times investigation was published, Mr. Weinstein asked Mr. Reiter to speak favorably about him to reporters: “If you don’t help me, 180 people will lose their jobs,” Mr. Weinstein said, according to the finance official.\n\nWhen he refused, Mr. Weinstein threatened: “You’re not so clean either — I have stuff on you,” he said, referring to a decades-old anecdote about Mr. Reiter repeatedly calling a female co-worker. Mr. Reiter said that he saw her being grabbed at a bar, tried to intervene and called her multiple times the next day to discuss what had happened.\n\n“His modus operandi was always to try to find something on someone else,” Mr. Reiter said. Through his spokeswoman, Mr. Weinstein denied threatening Mr. Reiter.\n\nAfter years of support for Mr. Weinstein, most of the board members have now quit, while publicly staying silent. Privately, at least one expressed loyalty. On Oct. 7, the day before he was ousted from his own company, Mr. Weinstein received an email from the investor Paul Tudor Jones.\n\n“I love you,” he wrote, while detailing the steps Mr. Weinstein should take to rehabilitate his image. Mr. Jones told The Times that he condemned Mr. Weinstein’s alleged misconduct and wanted to encourage him to get help.\n\n“Focus on the future as America loves a great comeback story,” he wrote to the movie producer.\n\nHe finished: “The good news is, this will go away sooner than you think and it will be forgotten!”", "images": ["https://static01.nyt.com/images/2017/11/30/us/00complicity-images-slide-ALTB/00complicity-images-slide-ALTB-master180.png", "https://static01.nyt.com/images/2017/11/04/nyregion/00complicity-alpha-promo/00complicity-alpha-promo-facebookJumbo-v7.jpg", "https://static01.nyt.com/images/2017/11/29/autossell/00COMPLICITY4/merlin_130664879_96f59aa9-609f-4cf6-9e6c-e3950e0d2dd1-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY10/merlin_130682915_5c7242cd-4597-4c99-a451-9902483fe2f8-master180.jpg", "https://static01.nyt.com/images/2017/12/06/us/06COMPLICITY16/merlin_130926305_56eb6784-70f2-44da-b988-f73f064c2a3c-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY1/merlin_130682504_c2921d4f-20ee-4f47-a7cb-dac7fd0fbf42-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY2/merlin_130682501_7b213abc-f45a-41b1-a0e7-ffdd0afcac4f-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY8/merlin_130682507_9e0eb22e-e9e7-4855-8112-7234790ed8e2-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY5/merlin_130642787_7c34f52b-3361-4a58-a658-b1f67efb772c-master180.jpg", "https://static01.nyt.com/images/2017/12/03/autossell/03COMPLICITY14/merlin_9615318_807b1859-e284-4632-b7ff-cd49b68deca2-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY9/merlin_33864748_c069fa98-08be-4a6f-9afa-bec38fcb6b94-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY11/merlin_130287872_dfb5fdb8-7954-47b9-bf82-6505490da46a-master180.jpg", "https://static01.nyt.com/images/2017/12/05/us/00complicity-cover-image/00complicity-cover-image-master180.jpg", "https://static01.nyt.com/images/2017/11/30/us/00COMPLICITY12/merlin_130717943_a0a1e855-1745-4b7e-88fe-b5dadd15dbf3-master180.jpg", "https://static01.nyt.com/images/2017/12/04/autossell/03COMPLICITY13/merlin_128669228_51f418fa-5aff-4c0b-bb14-89be67479d84-master180.jpg", "https://static01.nyt.com/images/2017/12/04/us/00complicity-images-slide-CMFJ/00complicity-images-slide-CMFJ-master180.png", "https://static01.nyt.com/images/2017/12/04/autossell/00COMPLICITY3/merlin_130682576_36295653-fad1-4161-be1d-0b97cc4a124d-master180.jpg", "https://static01.nyt.com/images/2017/12/03/autossell/03COMPLICITY16/merlin_130759934_32a699e5-f399-4772-b1be-5086f98235c5-master180.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://static01.nyt.com/images/2017/11/04/nyregion/00complicity-alpha-promo/00complicity-alpha-promo-facebookJumbo-v7.jpg", "keywords": [], "authors": ["Megan Twohey", "Jodi Kantor", "Susan Dominus", "Jim Rutenberg", "Steve Eder"], "canonical_link": "https://www.nytimes.com/interactive/2017/12/05/us/harvey-weinstein-complicity.html", "title": "Weinstein’s Complicity Machine", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "fb": {"app_id": 9869919170}, "twitter": {"site": "@nytimes", "url": "https://www.nytimes.com/interactive/2017/12/05/us/harvey-weinstein-complicity.html", "title": "Weinstein’s Complicity Machine", "description": "The producer Harvey Weinstein relied on powerful relationships across industries to provide him with cover as accusations of sexual misconduct piled up for decades.", "image": "https://static01.nyt.com/images/2017/11/04/nyregion/00complicity-alpha-promo/00complicity-alpha-promo-videoSixteenByNineJumbo1600-v7.jpg", "card": "summary_large_image"}, "sourceApp": "nyt-v5", "applicationName": "interactive", "foundation-build-id": "nyt-v5", "PT": "Multimedia", "PST": "Interactive", "tom": "interactive_feature", "hdl": "Weinstein’s Complicity Machine", "slug": "harvey-weinstein-complicity", "lp": "The producer Harvey Weinstein relied on powerful relationships across industries to provide him with cover as accusations of sexual misconduct piled up for decades.", "dfp-ad-unit-path": "us", "keywords": "Weinstein, Harvey,Sexual Harassment,Sex Crimes,Creative Artists Agency,McGowan, Rose,Movies,Actors and Actresses,Miramax Films,Paltrow, Gwyneth,Walt Disney Company,News and News Media,Benza, A J,National Enquirer,Howard, Dylan,Kirshner, Mia,American Media Inc,Clinton, Hillary Rodham,Dunham, Lena,Judd, Ashley", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/us/index.jsonp", "published": "2017-12-06T00:19:38.000Z", "modified": "2018-01-24T10:00:05.965Z", "section": "U.S.", "author": "http://www.nytimes.com/by/steve-eder", "tag": "Judd, Ashley", "opinion": "false", "content_tier": "metered"}, "DISPLAYDATE": "Dec. 5, 2017", "dat": "Dec. 5, 2017", "author": "Steve Eder", "robots": "noarchive", "articleid": 100000005583350, "nyt_uri": "nyt://interactive/1fbc7f92-7068-5df0-b633-20fdfa64cde4", "pubp_event_id": "pubp://event/6221feb47ae641eeb06ad6ddd46b38c8", "description": "The producer Harvey Weinstein relied on powerful relationships across industries to provide him with cover as accusations of sexual misconduct piled up for decades.", "image": "https://static01.nyt.com/images/2017/11/04/nyregion/00complicity-alpha-promo/00complicity-alpha-promo-facebookJumbo-v7.jpg", "byl": "By Megan Twohey, Jodi Kantor, Susan Dominus, Jim Rutenberg and Steve Eder", "thumbnail": "https://static01.nyt.com/images/2017/11/04/nyregion/00complicity-alpha-promo/00complicity-alpha-promo-thumbStandard-v8.jpg", "news_keywords": "Harvey Weinstein,Sexual harassment,Rape,Creative Artists Agency,Rose McGowan,Movies,Actor,Miramax Films,Gwyneth Paltrow,Walt Disney,News media;journalism,A J Benza,National Enquirer,Dylan Howard,Mia Kirshner,American Media,Hillary Clinton,Lena Dunham,Ashley Judd", "pdate": 20171205, "og": {"url": "https://www.nytimes.com/interactive/2017/12/05/us/harvey-weinstein-complicity.html", "type": "article", "title": "Weinstein’s Complicity Machine", "image": "https://static01.nyt.com/images/2017/11/04/nyregion/00complicity-alpha-promo/00complicity-alpha-promo-facebookJumbo-v7.jpg", "description": "The producer Harvey Weinstein relied on powerful relationships across industries to provide him with cover as accusations of sexual misconduct piled up for decades."}, "CG": "us", "hostApp": "vi", "typ": "int", "template": "interactive", "ver": "nyt5", "sov": 4, "vp": "small", "test": "projectvi", "gpt-beta": "vqwdtftx", "prop": "mnyt", "plat": "mweb", "edn": "us", "als_test": 1587231628787, "brandsensitive": "true", "per": "weinsteinharvey,mcgowanrose,paltrowgwyneth,benzaaj,howarddylan,kirshnermia,clintonhillaryrodham,dunhamlena,juddashley", "org": "creativeartistsagency,miramaxfilms,waltdisneycompany,nationalenquirer,americanmediainc", "des": "newsandnewsmedia", "auth": "jimrutenberg,jodikantor,megantwohey,steveeder,susandominus", "coll": "usnews", "artlen": "short", "ledemedsz": "none", "section": "us", "si_section": "us", "id": 100000005583350, "gscat": "neg_mastercard,neg_ibmtest,neg_ibm,neg_orep,neg_hearts,neg_bp,gs_entertain,neg_google,neg_cathay,neg_mktg_safe_q4_2019,gv_crime,gs_entertain_movies,neg_msft,neg_samsung,gs_business,gs_law_misc,neg_capitalone,gs_law,gs_t", "adtargeting": "{\"typ\":\"int\",\"template\":\"interactive\",\"ver\":\"mvi\",\"sov\":\"4\",\"vp\":\"small\",\"test\":\"projectvi\",\"ref\":\"\",\"refdom\":\"\",\"abra_dfp\":\"\",\"gpt-beta\":\"vqwdtftx\",\"prop\":\"mnyt\",\"plat\":\"mweb\",\"edn\":\"us\",\"als_test\":\"1587231628787\",\"brandsensitive\":\"true\",\"per\":\"weinsteinharvey,mcgowanrose,paltrowgwyneth,benzaaj,howarddylan,kirshnermia,clintonhillaryrodham,dunhamlena,juddashley\",\"org\":\"creativeartistsagency,miramaxfilms,waltdisneycompany,nationalenquirer,americanmediainc\",\"des\":\"sexualharassment,sexcrimes,movies,actorsandactresses,newsandnewsmedia\",\"auth\":\"jimrutenberg,jodikantor,megantwohey,steveeder,susandominus\",\"coll\":\"usnews\",\"artlen\":\"short\",\"ledemedsz\":\"none\",\"section\":\"us\",\"si_section\":\"us\",\"id\":\"100000005583350\",\"gscat\":\"neg_mastercard,neg_ibmtest,neg_ibm,neg_orep,neg_hearts,neg_bp,gs_entertain,neg_google,neg_cathay,neg_mktg_safe_q4_2019,gv_crime,gs_entertain_movies,neg_msft,neg_samsung,gs_business,gs_law_misc,neg_capitalone,gs_law,gs_t\"}", "adunitpath": "/29390238/nyt/undefined"}, "movies": [], "publish_date": 1512403200.0, "source": "https://www.nytimes.com", "summary": ""}