{"url": "https://people.com/tv/bachelor-raven-gates-bekah-martinez-twitter-feud/", "text": "It appears that Raven Gates and Bekah Martinez are no longer friends.\n\nLeaving their days of receiving red roses on ABC behind, The Bachelor alums were the ones dishing out jabs and clapbacks at each other on Friday as they engaged in a fiery Twitter feud.\n\nGet push notifications with news, features and more.\n\nIt all started after Martinez, 23, watched the June 4 episode of The Bachelorette in which Becca Kufrin confronted Colton Underwood about his relationship with her close friend and former Bachelor contestant, Tia Booth.\n\nThough both Underwood and Booth have said that things between them didn’t work out, Martinez tweeted otherwise when she shared a photo of Booth sitting in Underwood’s lap, which was previously posted by RealitySteve.\n\n“Tia+Colton: ‘yeah Becca, we’re both 100% over each other! we’re TOTALLY not planning on getting back together/probably engaged the minute we’re in paradise (we’re gonna get so many followers from this manufactured narrative lol),” Martinez wrote.\n\nImage zoom Raven Gates; Bekah Martinez Bob D'Amico via Getty; RB/Bauer-Griffin/GC Images\n\nGates quickly reacted to Martinez’s tweet to defend close friend Booth.\n\n“Make sure you follow @whats_ur_sign_ so she can get those followers so she can stop talking s–t about her friends.. like tia!! And Becca!! Come on now hurry up!!” Gates said in a since-deleted tweet. (But don’t worry, Bachelor Nation had the receipts to prove it!)\n\nTo which Martinez replied, “Girl I would never talk s–t on Becca because she’s as real as it gets. That’s the reason I tweeted that thing about Colton and Tia in the first place, because it looked like they both played her on this one.”\n\nRELATED: Bekah Martinez Had to Return ‘Everything with Tags’ After Going ‘Broke’ on Her Bachelor Wardrobe\n\nHowever, it didn’t end there as Gates said, “You know that Tia didn’t. And you’re entitled to your opinion. I don’t like the situation either, but if you said you’d stop bashing Tia, then you should keep your word.”\n\nThe feud showed no signs of slowing down, with Gates cryptically tweeting about the social media showdown without mentioning Martinez’s name.\n\n“How can people be so full of hate all of the time? Aren’t you tired??” she wrote before taking down the tweet.\n\n“How can you hate on your ‘friends’ constantly?? Why’d you delete your first tweet that was directly aimed at me? Why don’t you just @ me?”\n\nRELATED: 15 Bachelor Nation Stars Who Found Fame (or Infamy!): Where Are They Now?\n\nImage zoom\n\nThe back-and-forth ultimately resulted in Gates deleting a majority of her tweets and blocking Martinez on Twitter.\n\n“Just so you guys know, Bekah tweeted something rude & unnecessary to create drama & I went to stick up for my friend who can’t respond right now. I decided to delete the tweets & I blocked her bc I don’t want to keep engaging with someone who will continuously drag her ‘friends,’ ” Gates later clarified, after condemning Martinez for being “so cruel.”\n\n“It’s so sad that people find their self worth from being mean and hateful to their friends,” Gates tweeted about Martinez.\n\nIt didn’t take long for Martinez to respond as she tweeted, “1. keep acting like Tia and I were besties since that’s the best you can do here. 2. there are not enough twitter characters to address the rest of your self-contradicting bulls–t.”\n\nRELATED: Is Tia Booth Really Over Colton Underwood? Bachelor Alum Caila Quinn Doesn’t Think So!\n\nWhile Underwood and Booth have spoken out about their brief fling in January, Kufrin did not take the news of them dating well, especially considering the fact that she and Tia are actually good friends.\n\n“I’m not going to lie — I don’t know how I feel about it,” she said during the June 4 episode. “It makes me feel a little bit sick. I’m very attracted to you, I really like where our conversation was on night one and I feel like we had a lot in common, but it’s a very tricky situation. It puts me in a very strange position. It’s just a lot to take in right now.”\n\nRELATED: Becca Kufrin Feels ‘Sick’ After Finding Out Bachelorette Contestant Dated Her Friend Tia Booth\n\nImage zoom Colton Underwood and Becca Kufrin; Tia Booth Paul Hebert/ABC; Noel Vasquez/Getty Images\n\nAt the beginning of the year, Underwood and Booth met up in Los Angeles for a date, and a few weeks later, he learned that he had been selected to be a contestant on Kufrin’s season.\n\nBooth exclusively told PEOPLE that she tried to tell Kufrin about the relationship at the live After the Final Rose taping in March, but was not able to do so.\n\n“I just wanted to make sure they would give each other a chance,” she said. “I didn’t want Becca to see our friendship as the most important thing and not give him that chance.”\n\nThe Bachelorette airs Mondays (8 p.m. ET) on ABC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fraven-bekah-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fraven-bekah-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Ftia-boothinset-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fscreen-shot-2018-06-15-at-8-24-33-pm-1.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fraven-bekah-1.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/tv/bachelor-raven-gates-bekah-martinez-twitter-feud/", "title": "Bachelor Alums Raven Gates & Bekah Martinez's Twitter Feud", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Becca Kufrin,Bekah Martinez,News,Raven Gates,The Bachelor,The Bachelorette,TV", "news_keywords": "Becca Kufrin,Bekah Martinez,News,Raven Gates,The Bachelor,The Bachelorette,TV", "description": "Bachelor Nation had all the (Twitter) receipts after Raven Gates deleted a majority of her tweets clapping back at Bekah Martinez", "og": {"title": "Bachelor Alums Raven Gates & Bekah Martinez's Fiery Twitter Feud Is Full of Shady Clapbacks", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelor-raven-gates-bekah-martinez-twitter-feud/", "description": "It appears that Raven Gates and Bekah Martinez are no longer friends. Leaving their days of receiving red roses on ABC behind, The Bachelor alums&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fraven-bekah-1.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://people.com/tv/bachelor-raven-gates-bekah-martinez-twitter-feud/", "description": "Bachelor Nation had all the (Twitter) receipts after Raven Gates deleted a majority of her tweets clapping back at Bekah Martinez", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fraven-bekah-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelor-raven-gates-bekah-martinez-twitter-feud/", "title": "Bachelor Alums Raven Gates & Bekah Martinez's Fiery Twitter Feud Is Full of Shady Clapbacks", "description": "Bachelor Nation had all the (Twitter) receipts after Raven Gates deleted a majority of her tweets clapping back at Bekah Martinez", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fraven-bekah-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}