{"url": "https://us.blastingnews.com/showbiz-tv/2017/07/bachelor-in-paradise-icons-amanda-stanton-robby-hayes-spark-dating-news-001875883.amp.html", "text": "Amanda Stanton and Robby Hayes, the \"Bachelor in Paradise\" stars, were both spotted holding each other's hands in West Hollywood after enjoying an hour of stay inside a restaurant. A report from E! News has confirmed that both continued to spark the dating rumors which have longed surfaced online. The growing speculations certainly made fans questioning on their real Relationship status. It was never the first time for this rumored pair to be seen out in public over the weekend in Los Angeles.\n\nTo recall, both were also spotted attending the Los Angeles Dodgers Ball game. The rumored pair was joined by their friends on that event. As of now, the rumored couple is yet to confirm the news and the real relationship that they shared towards each other.\n\nQuality time together\n\nStanton and Hayes were both spotted again at the Malibu Wines as they celebrated the birthday of their friend and co-star, Raven Gates.\n\nMeanwhile, a source has informed E! News that the \"Bachelor in Paradise\" stars were silently spending quality time with each other. It was also reported that both were seen being affectionate to each other. Fans couldn't help but speculate that something romantic is already happening between the two stars.\n\nBoth stars have always given fans the right impression that they mean a lot special towards each other.\n\nTo recall, Stanton has shared about the painful breakup she went through with her past relationship. She further told E! News how hard it was to move on from such relationship. Hence, it looked as if Hayes will be the kind of guy whom will mend his broken heart.\n\nRumored relationship\n\nAs of now, Stanton and Hayes have continued to spark their romance rumors. Despite the news, the press did not hear back some comments from the rumored couple over their real relationship. Meanwhile, their fans have also flooded Twitter with their thoughts since their romance news broke online.\n\nFurther, it wasn't also made clear whether or not both have fallen in love with each other while filming the \"Bachelor in Paradise\" series. Despite being engaged to Josh Murray, Stanton decided to call it quits back in December 2016. Hence, her followers looked forward that she will finally find real love with Hayes.\n\nAs their romance rumors continue, fans are also very eager to continue seeing these stars on screen as \"Bachelor in Paradise\" airs on TV by August 14 and 15. Despite the alleged sexual misconduct during the production, a lot were happy that the series is really happening soon.", "images": ["https://staticr1.blastingcdn.com/media/photogallery/2017/7/25/main/b_660x347/bachelor-in-paradise-stars-amanda-and-robby-continue-to-spark-dating-rumors-image-via-youtubeenews_1464785.jpg"], "top_img": "https://staticr1.blastingcdn.com/media/photogallery/2017/7/25/main/b_660x347/bachelor-in-paradise-stars-amanda-and-robby-continue-to-spark-dating-rumors-image-via-youtubeenews_1464785.jpg", "keywords": [], "authors": ["Read More On The Same Topic Sweet Diana Dawn", "'The Crown' Casts Olivia Colman To Replace Claire Foy As Queen Elizabeth", "'Justice League' International Trailer Reveals The Villainous Steppenwolf", "Gabrielle Union Joins 'Bad Boy' Upcoming Tv Spinoff"], "canonical_link": "https://us.blastingnews.com/showbiz-tv/2017/07/bachelor-in-paradise-icons-amanda-stanton-robby-hayes-spark-dating-news-001875883.html", "title": "'Bachelor in Paradise' icons Amanda Stanton, Robby Hayes spark dating news", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "fb": {"app_id": 459022437543956, "pages": 556225464427184}, "og": {"type": "article", "site_name": "Blasting News", "url": "https://us.blastingnews.com/showbiz-tv/2017/07/bachelor-in-paradise-icons-amanda-stanton-robby-hayes-spark-dating-news-001875883.html", "locale": "en_US", "title": "'Bachelor in Paradise' icons Amanda Stanton, Robby Hayes spark dating news", "image": {"identifier": "https://staticr1.blastingcdn.com/media/photogallery/2017/7/25/main/b_660x347/bachelor-in-paradise-stars-amanda-and-robby-continue-to-spark-dating-rumors-image-via-youtubeenews_1464785.jpg", "type": "image/jpeg", "width": 660, "height": 347}, "description": "Stanton and Park were spotted in public and this lead fans speculating that both shared romantic relationship with each other."}, "article": {"publisher": "https://www.facebook.com/BlastingNews/"}, "twitter": {"card": "summary_large_image", "title": "'Bachelor in Paradise' icons Amanda Stanton, Robby Hayes spark dating news", "image": "https://staticr1.blastingcdn.com/media/photogallery/2017/7/25/main/b_660x347/bachelor-in-paradise-stars-amanda-and-robby-continue-to-spark-dating-rumors-image-via-youtubeenews_1464785.jpg", "description": "Stanton and Park were spotted in public and this lead fans speculating that both shared romantic relationship with each other....", "url": "https://goo.gl/mWtKtt", "site": "@BlastingNews", "creator": "@BlastingNews"}}, "movies": [], "publish_date": 1500959609.0, "source": "https://us.blastingnews.com", "summary": ""}