{"url": "deadline.com/2017/12/minnie-driver-matt-damon-alyssa-milano-sexual-harassment-1202228942/", "text": "Minnie Driver and Matt Damon are reconnecting — but it’s under circumstances that could be better. The Oscar-nominated actress recently took to Twitter to slam her Good Will Hunting co-star about his recent comments about sexual assault.\n\nIn the wake of the deluge of sexual misconduct accusations involving Harvey Weinstein and Ben Affleck, two men who Damon has worked closely with, the Downsizing actor spoke to Peter Travers on ABC on Thursday about the cloud of allegations hovering over Hollywood. He pointed out that the men being accused are being put into “one big bucket” and then said that there is a “spectrum of behavior.”\n\n“You know, there’s a difference between, you know, patting someone on the butt and rape or child molestation, right?” he said in the interview. “Both of those behaviors need to be confronted and eradicated without question, but they shouldn’t be conflated, right?”\n\nRelated Story Commission On Sexual Harassment Formed By Hollywood Heavyweights; Anita Hill Will Chair\n\nWhen Driver received word of his comments, she took to Twitter saying, “God God, SERIOUSLY?” From there, she did not hold back and continued to drag Damon and other men who share the same opinions.\n\n“Gosh it’s so interesting how men with all these opinions about women’s differentiation between sexual misconduct, assault and rape reveal themselves to be utterly tone deaf and as a result, systemically part of the problem (profoundly unsurprising),” she tweeted.\n\nGosh it’s so *interesting how men with all these opinions about women’s differentiation between sexual misconduct, assault and rape reveal themselves to be utterly tone deaf and as a result, systemically part of the problem( *profoundly unsurprising) — Minnie Driver (@driverminnie) December 15, 2017\n\nThis was followed by an enormous amount of support from other women. In an interview with the Guardian, Driver said that she felt the need to say something and that men “cannot understand what abuse is like on a daily level.”\n\n“I honestly think that until we get on the same page, you can’t tell a woman about their abuse,” continued Driver. “A man cannot do that. No one can. It is so individual and so personal, it’s galling when a powerful man steps up and starts dictating the terms, whether he intends it or not.”\n\nOther women in Hollywood came forward to criticize Damon’s clouded point of view including Alyssa Milano. In a series of tweets, Milano addressed Damon in a series of tweets saying that women are outraged “because we were silenced for so long.” She went on to compare sexual harassment, misconduct, assault, and violence to cancer saying that it is a “systemic disease.” She concluded, “The tumor is being cut out right now with no anesthesia. Please send flowers.”\n\nDear Matt Damon, It’s the micro that makes the macro. (Thread) — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nWe are in a “culture of outrage” because the magnitude of rage is, in fact, overtly outrageous. And it is righteous. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nI have been a victim of each component of the sexual assault spectrum of which you speak. They all hurt. And they are all connected to a patriarchy intertwined with normalized, accepted–even welcomed– misogyny. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nWe are not outraged because someone grabbed our asses in a picture. We are outraged because we were made to feel this was normal. We are outraged because we have been gaslighted. We are outraged because we were silenced for so long. — Alyssa Milano (@Alyssa_Milano) December 16, 2017\n\nThere are different stages of cancer. Some more treatable than others. But it’s still cancer. — Alyssa Milano (@Alyssa_Milano) December 16, 2017", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "http://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2017/12/driver-damon-milano.jpg?w=650", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F12%2Fminnie-driver-matt-damon-alyssa-milano-sexual-harassment-1202228942%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202228942&comment_count=51", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/12/driver-damon-milano.jpg?w=650", "keywords": [], "authors": ["Dino-Ray Ramos"], "canonical_link": "https://deadline.com/2017/12/minnie-driver-matt-damon-alyssa-milano-sexual-harassment-1202228942/", "title": "Minnie Driver, Alyssa Milano Call Out Matt Damon For “Tone Deaf” Comments About Sexual Assault", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Minnie Driver and Matt Damon are reconnecting — but it's under circumstances that could be better. The Oscar-nominated actress recently took to Twitter to slam her Good Will Hunting co-star about his recent comments about sexual assault.", "news_keywords": "Alyssa Milano, Harassment, Matt Damon, Minnie Driver", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Minnie Driver, Alyssa Milano Call Out Matt Damon For “Tone Deaf” Comments About Sexual Assault", "url": "https://deadline.com/2017/12/minnie-driver-matt-damon-alyssa-milano-sexual-harassment-1202228942/", "description": "Minnie Driver and Matt Damon are reconnecting — but it’s under circumstances that could be better. The Oscar-nominated actress recently took to Twitter to slam her Good Will Hunting co-star a…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/12/driver-damon-milano.jpg?w=650", "width": 650, "height": 443}, "locale": "en_US"}, "article": {"published_time": "2017-12-18T01:01:30+00:00", "modified_time": "2017-12-18T04:23:38+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Minnie Driver, Alyssa Milano Call Out Matt Damon For “Tone Deaf” Comments About Sexual Assault"}, "image": "https://pmcdeadline2.files.wordpress.com/2017/12/driver-damon-milano.jpg?w=650", "card": "summary_large_image", "creator": "@DinoRay", "title": "Minnie Driver, Alyssa Milano Call Out Matt Damon For “Tone Deaf” Comments About Sexual Assault", "description": "Minnie Driver and Matt Damon are reconnecting — but it’s under circumstances that could be better. The Oscar-nominated actress recently took to Twitter to slam her Good Will Hunting co-star a…"}, "author": "Dino-Ray Ramos", "content_type": "Article", "post_id": 1202228942, "title": "Minnie Driver, Alyssa Milano Call Out Matt Damon For \"Tone Deaf\" Comments About Sexual Assault", "published_at": "2017-12-17 17:01:30", "image": "https://pmcdeadline2.files.wordpress.com/2017/12/driver-damon-milano.jpg?w=296&h=166&crop=1", "comment_count": 51, "tags": "Minnie Driver", "topics": "Business", "body": "Minnie Driver and Matt Damon are reconnecting — but it's under circumstances that could be better. The Oscar-nominated actress recently took to Twitter to slam her Good Will Hunting co-star about his recent comments about sexual assault.\r\n\r\nIn the wake of the deluge of sexual misconduct accusations involving Harvey Weinstein and Ben Affleck, two men who Damon has worked closely with, the Downsizing actor spoke to Peter Travers on ABC on Thursday about the cloud of allegations hovering over Hollywood. He pointed out that the men being accused are being put into \"one big bucket\" and then said that there is a \"spectrum of behavior.\"\r\n\r\n“You know, there’s a difference between, you know, patting someone on the butt and rape or child molestation, right?” he said in the interview. “Both of those behaviors need to be confronted and eradicated without question, but they shouldn’t be conflated, right?”\r\n\r\nWhen Driver received word of his comments, she took to Twitter saying, \"God God, SERIOUSLY?\" From there, she did not hold back and continued to drag Damon and other men who share the same opinions.\r\n\r\n\"Gosh it’s so interesting how men with all these opinions about women’s differentiation between sexual misconduct, assault and rape reveal themselves to be utterly tone deaf and as a result, systemically part of the problem (profoundly unsurprising),\" she tweeted.\r\n\r\nhttps://twitter.com/driverminnie/status/941733516999405568\r\n\r\nhttps://twitter.com/driverminnie/status/941739322474086400\r\n\r\nThis was followed by an enormous amount of support from other women. In an interview with the Guardian, Driver said that she felt the need to say something and that men \"cannot understand what abuse is like on a daily level.\"\r\n\r\n“I honestly think that until we get on the same page, you can’t tell a woman about their abuse,\" continued Driver. \"A man cannot do that. No one can. It is so individual and so personal, it’s galling when a powerful man steps up and starts dictating the terms, whether he intends it or not.\"\r\n\r\nOther women in Hollywood came forward to criticize Damon's clouded point of view including Alyssa Milano. In a series of tweets, Milano addressed Damon in a series of tweets saying that women are outraged \"because we were silenced for so long.\" She went on to compare sexual harassment, misconduct, assault, and violence to cancer saying that it is a \"systemic disease.\" She concluded, \"The tumor is being cut out right now with no anesthesia. Please send flowers.\"\r\n\r\nhttps://twitter.com/Alyssa_Milano/status/941840663087218689\r\n\r\nhttps://twitter.com/Alyssa_Milano/status/941840799506898944\r\n\r\nhttps://twitter.com/Alyssa_Milano/status/941840946420789250\r\n\r\nhttps://twitter.com/Alyssa_Milano/status/941841081200607232\r\n\r\nhttps://twitter.com/Alyssa_Milano/status/941841252516900864\r\n\r\nhttps://twitter.com/Alyssa_Milano/status/941842010540982273", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1513558890.0, "source": "http://deadline.com", "summary": ""}