{"url": "https://people.com/tv/bachelor-arie-luyendyk-jr-lauren-burnham-announce-hawaii-wedding-date/", "text": "It’s official: Arie Luyendyk Jr. and Lauren Burnham will soon graduate from fiancés to husband and wife.\n\nAppearing on The View Wednesday, the happy couple made the announcement that their wedding will take place next year — in Hawaii!\n\nGet push notifications with news, features and more.\n\n“We are very excited to tell you guys that we have booked a venue,” said Burnham. “We’re getting married in Hawaii on January 12th next year!”\n\n“It’s in Maui — it’s at Haiku Mill which has this beautiful, old world feel with a lot of vines and greenery,” added Luyendyk Jr. “It’s not your typical beach wedding. And it’s a private wedding, so not on TV — just a close group of friends. Probably 100 guests.”\n\nAsked whether they felt like they were rushing things, Burnham said if they could “get married tomorrow we would.”\n\n“We’re just really happy with each other and we vibe well together,” she said. “We’re best friends, so we’re just ready for that next step.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nLuyendyk Jr., 36, and Burnham, 26, were at the epicenter of the most recent (and most controversial!) season of The Bachelor. Less than two months after proposing to finalist Becca Kufrin, Luyendyk Jr. realized he was still in love with his runner-up, Burnham. He ultimately decided to break things off with Kufrin, 28, to pursue a relationship with Burnham — and proposed to her on live television during the two-hour After the Final Rose special on March 6.\n\nImage zoom Arie Luyendyk Jr. and Lauren Burnham on The Bachelor\n\nSince then, all three parties involved have moved on. Kufrin is engaged once again, this time after wrapping production on The Bachelorette (her season premieres Monday on ABC), and Luyendyk Jr. and Burnham have moved in together in his hometown of Scottsdale, Arizona.\n\n“We’re in our condo now and we just bought a new house,” Burnham said on The View. “Things are moving pretty quickly and everything’s been great.”\n\nThe couple also admitted that they have yet to watch their season finale — including the painfully raw footage of Luyendyk Jr. ending things with Kufrin.\n\n“I think going back to that time, it was a big risk to do what I did and I know that it wasn’t a popular decision. But it was a decision I had to make for myself. … I knew that Lauren was the person I was supposed to be with,” said Luyendyk Jr. “I never watched the finale, so we don’t really know how that breakup looked on TV. But breakups are hard, and I think that everyone handles it in a different way. They say it was unedited, but it was edited. You’re not in control of the editing room and you can’t really control what they show.”\n\n“My breakup was taped, everyone else’s was, and that’s just kind of the name of the game,” added Burnham.\n\nAnd Luyendyk Jr. said he thinks his relationship with Burnham is even more solid because of what they went through.\n\n“I think our relationship is stronger and I wouldn’t change it,” he said. “We’re happy. When we go out in public, it’s all positivity. And that’s cool to see.”\n\n“Our relationship is so unique and it’s nothing that I’ve ever had before,” added Burnham. “So the fact that he was willing to take that risk and all of America hating him to be with me, that means a lot to me.”\n\nOpening up exclusively to PEOPLE after the scandal, Luyendyk Jr. admitted he wholeheartedly regretted proposing to Kufrin while he was still in love with Burnham.\n\nImage zoom Arie Luyendyk Jr. and Lauren Burnham Jana Cruder\n\n“The simple fact is I made a huge mistake,” he said. “I made what I thought was a good choice, but my heart wasn’t in it. I felt the enormous pressure and the enormity of the show and production, and I felt I should lead with my head and go through with it.”\n\nOnce reconciled with Burnham, he said he felt like “a huge weight lifted off my shoulders.”\n\nRELATED VIDEO: All About the 3.5-Carat Engagement Ring Bachelor Arie Luyendyk Jr. Gave Lauren Burnham\n\nBurnham told PEOPLE she “totally” respected Luyendyk Jr.’s decision “to follow his heart.”\n\n“I don’t blame him for it, and I think it’s made us stronger in the end,” she said. “It was worth risking getting hurt again to see where it could go. We’ve had a lot of conversations about it, and I know he won’t change his mind again.”\n\n“It makes things easier for me knowing that he was able to be with Becca outside of this experience and he still knew that wasn’t what he wanted,” she added. “It gives me confidence in our relationship knowing that he truly wants to be with me and he took this huge risk to make it happen.”\n\nAnd both agreed that they were “very excited about marriage and starting a family” — in fact, Luyendyk Jr. said he wants two to four kids.\n\n“If we get lucky, maybe we’d have twins!” he said.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2F148181_4326-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1499&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1499&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/bachelor-arie-luyendyk-jr-lauren-burnham-announce-hawaii-wedding-date/", "title": "Arie Luyendyk Jr. and Lauren Burnham Announce Wedding Date and Location", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Arie Luyendyk Jr.,Celebrity Weddings,Couples,Lauren Burnham,News,The Bachelor,The View,TV,Weddings", "news_keywords": "Arie Luyendyk Jr.,Celebrity Weddings,Couples,Lauren Burnham,News,The Bachelor,The View,TV,Weddings", "description": "The Bachelor couple will graduate from fiancés to husband and wife", "og": {"title": "It's Official! The Bachelor's Arie Luyendyk Jr. and Lauren Burnham to Wed in Hawaii Next Year", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelor-arie-luyendyk-jr-lauren-burnham-announce-hawaii-wedding-date/", "description": "It’s official: Arie Luyendyk Jr. and&nbsp;Lauren Burnham&nbsp;will soon graduate from fiancés to husband and wife. Appearing on&nbsp;The View Wednesday, the happy couple made the announcement&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1499&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2.jpg", "width": 1499, "height": 785}}, "pinterest": {"url": "https://people.com/tv/bachelor-arie-luyendyk-jr-lauren-burnham-announce-hawaii-wedding-date/", "description": "The Bachelor couple will graduate from fiancés to husband and wife", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelor-arie-luyendyk-jr-lauren-burnham-announce-hawaii-wedding-date/", "title": "It's Official! The Bachelor's Arie Luyendyk Jr. and Lauren Burnham to Wed in Hawaii Next Year", "description": "The Bachelor couple will graduate from fiancés to husband and wife", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1499&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}