{"url": "https://web.archive.org/web/20101103082821/http://gopleader.gov/News/DocumentSingle.aspx?DocumentID=213442", "text": "With Americans demanding a new way forward in Washington, House Republican Leader John Boehner (R-OH) uses the Weekly Republican Address to outline solutions for ending economic uncertainty, stopping government’s spending binge, and changing the way Congress does business. In the address, Boehner notes that this is a new approach that hasn’t been tried in Washington – by either party – and it is at the core of the Pledge to America, a governing agenda Republicans built by listening to the people.\n\n\n\nLeader Boehner recorded the weekly address earlier this week from Ohio, where he ran a small business and saw first-hand how Washington can make it harder for employers and entrepreneurs to meet a payroll and create jobs. Following is a transcript of Boehner’s remarks. Audio of the Weekly Republican Address is available now here. The video will be available here for viewing and here for downloading.\n\n\n\n“Hello. I’m John Boehner.\n\n\n\n“Before I served in Congress, I ran a small business here in Ohio, and I saw first-hand how politicians in Washington can make it harder for small employers to meet a payroll and create jobs.\n\n\n\n“In the final days of the 2008 campaign, Barack Obama promised to ‘change this country and change the world.’\n\n\n\n“Well I don’t know about the world, but here at home, Americans haven’t experienced the change President Obama promised. One in ten of our fellow citizens is out of work. Our national debt has grown by $3 trillion Trust in government has fallen to an all-time low.\n\n\n\n“These problems didn’t start under President Obama. But instead of fixing them, his policies have made them worse. A ‘stimulus’ spending spree that created jobs in China and El Salvador, while millions of Americans lost their jobs here. A job-killing national energy tax. A government takeover of health care.\n\n\n\n“All these things have combined to create massive uncertainty for small businesses, the engine of job creation in America, while our children face a future clouded by debt.\n\n\n\n“Americans are demanding a new way forward in Washington – an approach that neither party has tried.\n\n\n\n“It starts with cutting spending instead of increasing it; making government smaller and more accountable; and helping small businesses get back to creating jobs again.\n\n“That’s what Republicans are offering with our Pledge to America, a governing agenda built by listening to the people.\n\n\n\n“A generation of fiscal recklessness in Washington has pushed us to the brink. Just to stay afloat, we’re now borrowing 41 cents of every dollars we spend from our kids and grandkids.\n\n\n\n“This spending spree threatens our children’s future. It’s also hurting our economy. Americans know it has to stop, and our Pledge to America puts forth a plan to do just that. We’re ready to cut spending to pre-‘stimulus,’ pre-bailout levels, saving taxpayers $100 billion almost immediately. And we’re ready to put in place strict budget caps that limit spending from here on out, to ensure that Washington is no longer on this spending binge.\n\n\n\n“We need to stop the coming tax hike. We can’t balance the budget without cutting spending and achieving real economic growth – and we won’t have real economic growth if we raise taxes on small businesses and families.\n\n\n\n“There’s a third thing we need to do to help our economy, and that’s change Congress itself. The American people are in charge of this country, and they deserve a Congress that acts like it. Americans should have three days to read all bills before Congress votes on them – something they didn’t get when the ‘stimulus’ was rushed into law. We should put an end to so-called ‘comprehensive’ bills that make it easy to hide wasteful spending projects and job-killing policies. Bills should be written by legislators in committee in plain public view – not written in the Speaker’s office, behind closed doors.\n\n\n\n“Across our nation, Americans are looking at President Obama’s policies and asking – ‘where are the jobs?’ To help our economy get back on track, we have to stop all of the coming tax hikes and cut spending – and to cut spending, we need to change Congress itself.\n\n\n\n“This is a new way forward that hasn’t been tried in Washington yet. It’s a break from the direction in which President Obama has taken our country. And frankly, it’s also a break from the direction in which Republicans were headed when Americans last entrusted us with the reins of government. The American people are in charge, and they deserve nothing less.\n\n\n\n“Together, we can do these things. And in doing so, we can begin the drive for a smaller, less costly, and more accountable government that honors our Constitution and respects the will of the people.\n\n\n\n“These ideas are at the core of our Pledge to America.\n\n\n\n“We’ve tried it President Obama’s way. We’ve tried it Washington’s way. It hasn’t worked. It’s time to put the people back in charge.\n\n\n\n“Thank you for your time and may God bless the United States of America.\"", "images": ["https://web.archive.org/favicon.ico"], "top_img": "https://web.archive.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "In Weekly Republican Address, Boehner Calls For “New Way Forward” Focused on Creating Jobs, Cutting Spending, & Reforming Congress", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}