{"url": "https://variety.com/2017/tv/news/crazy-ex-girlfriend-rebecca-bpd-nathaniel-season-3-1202608629/", "text": "SPOILER ALERT: Do not read if you have not yet watched the Nov. 17 episode of “Crazy Ex-Girlfriend,” entitled “Josh Is Irrelevant.”\n\nUntil now on “Crazy Ex-Girlfriend,” Rebecca Bunch (Rachel Bloom) thought she suffered with anxiety, depression, and OCD. But in the sixth episode, she received a new diagnosis: borderline personality disorder (BPD).\n\n“We wrote her kind of by feel for a while,” explains executive producer Aline Brosh McKenna. “We kind of wrote her behavior in a way that felt right to us for about a season and a half, and then Rachel and I started to realize this was an area we were going into. It’s funny, we were trying to help Rebecca, so we were trying to figure out what was best for her. And when we looked into it, so much of this seemed to resonate.”\n\nAfter attempting to commit suicide, Rebecca was admitted to a hospital where her doctors discovered that she ticked more than just the five items on the BPD checklist necessary for the diagnosis.\n\nIn fact, when McKenna was researching the disorder, she realized that not only did Rebecca exhibit all nine of the items on the list, but in their 36 episodes, they had about 10 examples of each of the nine symptoms.\n\n“No diagnosis is a perfect diagnosis, and it’s a bit imprecise, and there are many schools of thought on BPD, but we tried to dial in on what we thought was accurate for her,” McKenna says.\n\nRebecca was initially excited to learn her previous diagnoses were inaccurate, which led to a musical number about finding her “tribe” and understanding what was wrong so it could be fixed. But when she received the actual diagnosis, her tune changed because she thought it meant she was “broken” and would not be able to be fixed after all.\n\n“There are a whole host of behaviors that are deeply rooted in her, so she’ll continue to struggle — but she’ll struggle with more information,” McKenna says.\n\nNow that she has an official diagnosis, that struggle will be “to include her new truths about herself into her daily life,” says McKenna, as well as to learn new strategies to try and get better. For Rebecca, the path will be “intensive” therapy, which the show will explore in upcoming episodes through group therapy sessions.\n\n“Mainly it’s a lot of hard work, and it’s really challenging, and the people who do that hard work are very brave,” McKenna says. “Just because she has a name for it, it doesn’t mean her behavior’s going to be different. In many ways, it kind of enhances her struggle, it makes it harder. Because now when she’s doing things, she knows why, and that makes her confused and angry. And there’s a lot with mental health stuff [that’s] one step forward and two steps back. She’s not always diligent about it, but we really see her going forward, doing the work. She really is an A-student, so when she has an assignment she really takes it on.”\n\nBy the end of the episode, Rebecca also finally acknowledged that her ex Josh (Vincent Rodriguez III) was not the cause of her problems.\n\n“For Rebecca, love is her drug of choice,” McKenna says. “That’s a very dangerous substance, but like food, you need to have it. So she has to learn how to get love in her life in a healthy way, which is obviously very challenging for her. And if she messes up with that going forward, it has possible serious consequences for her.”\n\nAs Rebecca struggles to come to terms with her diagnosis (“Is that who I am? How do I live within that? What choices do I make now?” says McKenna) she isn’t the only one who is going to have to do some hard work to understand their own psychology. Nathaniel (Scott Michael Foster) finally got a glimpse into his family’s history when he learned his mother overdosed on sleeping pills when he was a child. Despite that backstory, McKenna says, it won’t always be easy for him to see what Rebecca is going through.\n\n“He’s got a lot of unresolved pain in his past,” McKenna says. “It sets him on the most serious of the journeys.”\n\nJosh, too, must figure out who he is and what he wants his life to be without a relationship with Rebecca.\n\n“What I think is really interesting is that Josh had connected to her because he was struggling with his own identity and failing in New York, and here’s this smart, cosmopolitan, charming, beautiful girl that loves [him] and makes [him] feel special,” McKenna says. “Of course the audience has always known that it had nothing to do with him – he was just kind of conveniently placed – but he didn’t know that. He thought she loved him, and that made him feel great. He really starts to have his quarter-life crisis now. He is now unemployed, he doesn’t have a place to live, he doesn’t have her anymore, he’s not seeing anyone. It’s tough stuff coming up for Josh.”\n\nThe season may have started off as a revenge tale, but it has grown into something much more complicated. That’s why, although McKenna originally considered the “Scary Scary Sexy Lady” song as a new opening credits sequence, they ultimately went with “Crazy” instead. And similarly, McKenna admits that “there’s a change in the names in the episode titles coming up” to cover the new themes – and really, new Rebecca – with which the show is now dealing.\n\n“Crazy Ex-Girlfriend” airs on Fridays at 8 p.m. on the CW.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2017/11/crazy.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fcrazy-ex-girlfriend-rebecca-bpd-nathaniel-season-3-1202608629%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202608629&comment_count=3", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/11/crazy.jpg?w=1000", "keywords": [], "authors": ["Danielle Turchiano"], "canonical_link": "https://variety.com/2017/tv/news/crazy-ex-girlfriend-rebecca-bpd-nathaniel-season-3-1202608629/", "title": "‘Crazy Ex-Girlfriend’ Boss on Rebecca’s Diagnosis, Nathaniel’s Backstory and Josh’s ‘Quarter-Life Crisis’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"Crazy Ex-Girlfriend\" EP Aline Brosh McKenna explains the genesis behind Rebecca's new diagnosis and what's next now that she knows.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202608629, "author": "Danielle Turchiano", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-11-17T18:00:18"}, "pmc-tag": "Aline Brosh Mckenna,Crazy Ex-Girlfriend", "title": "‘Crazy Ex-Girlfriend’ Boss on Rebecca’s Diagnosis, Nathaniel’s Backstory and Josh’s ‘Quarter-Life Crisis’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Crazy Ex-Girlfriend’ Boss on Rebecca’s Diagnosis, Nathaniel’s Backstory and Josh’s ‘Quarter-Life Crisis’", "url": "https://variety.com/2017/tv/news/crazy-ex-girlfriend-rebecca-bpd-nathaniel-season-3-1202608629/", "description": "SPOILER ALERT: Do not read if you have not yet watched the Nov. 17 episode of “Crazy Ex-Girlfriend,” entitled “Josh Is Irrelevant.” Until now on “Crazy Ex-Girlfriend,&…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/crazy.jpg?w=1000", "width": 1000, "height": 563, "alt": "Crazy Ex-Girlfriend"}, "locale": "en_US"}, "article": {"published_time": "2017-11-18T02:00:18+00:00", "modified_time": "2017-11-18T02:00:19+00:00"}, "twitter": {"creator": "@https://twitter.com/danielletbd", "site": "@variety", "text": {"title": "‘Crazy Ex-Girlfriend’ Boss on Rebecca’s Diagnosis, Nathaniel’s Backstory and Josh’s ‘Quarter-Life Crisis’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/crazy.jpg?w=1000", "alt": "Crazy Ex-Girlfriend"}, "card": "summary_large_image", "title": "‘Crazy Ex-Girlfriend’ Boss on Rebecca’s Diagnosis, Nathaniel’s Backstory and Josh’s ‘Quarter-Life Crisis’", "description": "\"Crazy Ex-Girlfriend\" EP Aline Brosh McKenna explains the genesis behind Rebecca's new diagnosis and what's next now that she knows."}, "author": "Danielle Turchiano", "content_type": "Article", "post_id": 1202608629, "title": "'Crazy Ex-Girlfriend' Boss on Rebecca's Diagnosis, Nathaniel's Backstory and Josh's 'Quarter-Life Crisis'", "published_at": "2017-11-17 18:00:18", "image": "https://pmcvariety.files.wordpress.com/2017/11/crazy.jpg?w=1000", "comment_count": 3, "tags": "Crazy Ex-Girlfriend", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read if you have not yet watched the Nov. 17 episode of \"Crazy Ex-Girlfriend,\" entitled \"Josh Is Irrelevant.\"\r\n\r\nUntil now on \"Crazy Ex-Girlfriend,\" Rebecca Bunch (Rachel Bloom) thought she suffered with anxiety, depression, and OCD. But in the sixth episode, she received a new diagnosis: borderline personality disorder (BPD).\r\n\r\n\"We wrote her kind of by feel for a while,\" explains executive producer Aline Brosh McKenna. \"We kind of wrote her behavior in a way that felt right to us for about a season and a half, and then Rachel and I started to realize this was an area we were going into. It's funny, we were trying to help Rebecca, so we were trying to figure out what was best for her. And when we looked into it, so much of this seemed to resonate.\"\r\n\r\nAfter attempting to commit suicide, Rebecca was admitted to a hospital where her doctors discovered that she ticked more than just the five items on the BPD checklist necessary for the diagnosis.\r\n\r\nIn fact, when McKenna was researching the disorder, she realized that not only did Rebecca exhibit all nine of the items on the list, but in their 36 episodes, they had about 10 examples of each of the nine symptoms.\r\n\r\n\"No diagnosis is a perfect diagnosis, and it's a bit imprecise, and there are many schools of thought on BPD, but we tried to dial in on what we thought was accurate for her,\" McKenna says.\r\n\r\n\r\n\r\nRebecca was initially excited to learn her previous diagnoses were inaccurate, which led to a musical number about finding her \"tribe\" and understanding what was wrong so it could be fixed. But when she received the actual diagnosis, her tune changed because she thought it meant she was \"broken\" and would not be able to be fixed after all.\r\n\r\n\"There are a whole host of behaviors that are deeply rooted in her, so she'll continue to struggle — but she'll struggle with more information,\" McKenna says.\r\n\r\nNow that she has an official diagnosis, that struggle will be \"to include her new truths about herself into her daily life,\" says McKenna, as well as to learn new strategies to try and get better. For Rebecca, the path will be \"intensive\" therapy, which the show will explore in upcoming episodes through group therapy sessions.\r\n\r\n\"Mainly it's a lot of hard work, and it's really challenging, and the people who do that hard work are very brave,\" McKenna says. \"Just because she has a name for it, it doesn't mean her behavior's going to be different. In many ways, it kind of enhances her struggle, it makes it harder. Because now when she's doing things, she knows why, and that makes her confused and angry. And there's a lot with mental health stuff [that's] one step forward and two steps back. She's not always diligent about it, but we really see her going forward, doing the work. She really is an A-student, so when she has an assignment she really takes it on.\"\r\n\r\nBy the end of the episode, Rebecca also finally acknowledged that her ex Josh (Vincent Rodriguez III) was not the cause of her problems.\r\n\r\n\"For Rebecca, love is her drug of choice,\" McKenna says. \"That’s a very dangerous substance, but like food, you need to have it. So she has to learn how to get love in her life in a healthy way, which is obviously very challenging for her. And if she messes up with that going forward, it has possible serious consequences for her.\"\r\n\r\nAs Rebecca struggles to come to terms with her diagnosis (\"Is that who I am? How do I live within that? What choices do I make now?\" says McKenna) she isn't the only one who is going to have to do some hard work to understand their own psychology. Nathaniel (Scott Michael Foster) finally got a glimpse into his family's history when he learned his mother overdosed on sleeping pills when he was a child. Despite that backstory, McKenna says, it won't always be easy for him to see what Rebecca is going through.\r\n\r\n\"He's got a lot of unresolved pain in his past,\" McKenna says. \"It sets him on the most serious of the journeys.\"\r\n\r\nJosh, too, must figure out who he is and what he wants his life to be without a relationship with Rebecca.\r\n\r\n\"What I think is really interesting is that Josh had connected to her because he was struggling with his own identity and failing in New York, and here's this smart, cosmopolitan, charming, beautiful girl that loves [him] and makes [him] feel special,\" McKenna says. \"Of course the audience has always known that it had nothing to do with him – he was just kind of conveniently placed – but he didn't know that. He thought she loved him, and that made him feel great. He really starts to have his quarter-life crisis now. He is now unemployed, he doesn't have a place to live, he doesn't have her anymore, he's not seeing anyone. It's tough stuff coming up for Josh.\"\r\n\r\nThe season may have started off as a revenge tale, but it has grown into something much more complicated. That's why, although McKenna originally considered the \"Scary Scary Sexy Lady\" song as a new opening credits sequence, they ultimately went with \"Crazy\" instead. And similarly, McKenna admits that \"there’s a change in the names in the episode titles coming up\" to cover the new themes – and really, new Rebecca – with which the show is now dealing.\r\n\r\n\"Crazy Ex-Girlfriend\" airs on Fridays at 8 p.m. on the CW.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1510970418.0, "source": "https://variety.com", "summary": ""}