{"url": "https://www.rollingstone.com/culture/culture-news/youtube-star-austin-jones-arrested-for-two-counts-of-child-pornography-201199/", "text": "YouTube singer Austin Jones was returning to the U.S. following a concert in Poland on Monday when he was taken into custody at Chicago’s O’Hare Airport. The 24-year-old was arrested on two counts of production of child pornography. If convicted, he could land in prison for a minimum of 15 years.\n\nAccording to the Chicago Sun Times, Jones will remain in federal custody until his court hearing Wednesday because prosecutors say he is a “risk to the community and there’s a danger he’ll flee.”\n\nCourt documents state that Jones was allegedly in communication with two underage female victims via Facebook in August 2016 and May 2017, and in both interactions, had asked the 14- and 15-year-old victims to “prove” to him that they were his biggest fans by sending him sexually explicit videos.\n\nIn the criminal complaint, one girl admitted that she made 15 videos for Jones as recently as May 4th, in what she called an “audition.” She alleged that the YouTube star pressured her to “work really hard” even though she told him she “might pass out” and was tired from what he was asking her to do. At one point during the Facebook interactions, the victim allegedly acknowledged that Jones was 24, and he requested that she repeatedly acknowledge that she was “only 14.”\n\nJones’ other alleged victim, whom he chatted with in August 2016, alleged that the singer told her she would get to perform a sex act on him if she were “lucky.” In the chat, Jones allegedly acknowledged that he was 23 at the time and the victim was 14. Federal authorities said the girl sent Jones a total of 25 videos, including eight that were sexually explicit.\n\nAccording to the complaint, once arrested Monday, Jones admitted to “receiving videos from the victims, and he admitted it was for sexual pleasure.”\n\nJones, who is best known for his own renditions of popular songs by artists like Justin Bieber, Twenty One Pilots and Fall Out Boy, has a following of more than 500,000 subscribers on his YouTube page and more than 300,000 followers on Instagram.\n\nThe singer came under fire in 2015 over allegations that he had lied about his age in order to solicit “twerking” videos from underage girls, which lead to a lengthy Facebook apology and an emotional YouTube confessional.\n\n“I’m embarrassed. I’d have conversations online with girls that would involve me asking them to create a video of themselves twerking,” he wrote at the time in a since-deleted Facebook post. “Sometimes I’d make videos of myself doing some twerk moves in return. Here’s the truth: I NEVER asked them to do anything more than send a twerking video. Nothing EVER went beyond that.”", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Fyoutube-star-austin-jones-arrested-for-two-counts-of-child-pornography-201199%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=201199", "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-austin-jones-a358cd43-2ad1-4f39-812a-dfbd03a21fa0.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-austin-jones-a358cd43-2ad1-4f39-812a-dfbd03a21fa0.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/youtube-star-austin-jones-arrested-for-two-counts-of-child-pornography-201199/", "title": "YouTube Star Austin Jones Arrested for Two Counts of Child Pornography", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "YouTube star Austin Jones, 24, reportedly admits to requesting and receiving sexually explicit videos from underage girls", "news_keywords": "YouTube", "og": {"type": "article", "title": "YouTube Star Austin Jones Arrested for Two Counts of Child Pornography", "url": "https://www.rollingstone.com/culture/culture-news/youtube-star-austin-jones-arrested-for-two-counts-of-child-pornography-201199/", "description": "Singer, 24, reportedly admits to requesting and receiving inappropriate videos from underage girls", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-austin-jones-a358cd43-2ad1-4f39-812a-dfbd03a21fa0.jpg", "width": 1024, "height": 462, "alt": "austin jones, austin jones arrested, youtube star, youtube star austin jones, youtube star austin jones arrested, austin jones arrested child pornography, youtube star child pornography, youtube star child pornography charges, austin jones cover songs, austin jones youtube controversy"}, "locale": "en_US"}, "article": {"published_time": "2017-06-14T15:52:00+00:00", "modified_time": "2018-06-25T15:24:29+00:00"}, "twitter": {"text": {"title": "YouTube Star Austin Jones Arrested for Two Counts of Child Pornography"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-austin-jones-a358cd43-2ad1-4f39-812a-dfbd03a21fa0.jpg?w=1024", "alt": "austin jones, austin jones arrested, youtube star, youtube star austin jones, youtube star austin jones arrested, austin jones arrested child pornography, youtube star child pornography, youtube star child pornography charges, austin jones cover songs, austin jones youtube controversy"}, "card": "summary_large_image", "site": "@RollingStone", "title": "YouTube Star Austin Jones Arrested for Two Counts of Child Pornography", "description": "YouTube star Austin Jones, 24, reportedly admits to requesting and receiving sexually explicit videos from underage girls"}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 201199, "title": "YouTube Star Austin Jones Arrested for Two Counts of Child Pornography", "published_at": "2017-06-14 15:52:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-austin-jones-a358cd43-2ad1-4f39-812a-dfbd03a21fa0.jpg?w=1024", "comment_count": 0, "tags": "YouTube", "topics": "Culture News", "body": "YouTube singer Austin Jones was returning to the U.S. following a concert in Poland on Monday when he was taken into custody at Chicago's O'Hare Airport. The 24-year-old was arrested on two counts of production of child pornography. If convicted, he could land in prison for a minimum of 15 years.According to the Chicago Sun Times, Jones will remain in federal custody until his court hearing Wednesday because prosecutors say he is a \"risk to the community and there's a danger he'll flee.\"Court documents state that Jones was allegedly in communication with two underage female victims via Facebook in August 2016 and May 2017, and in both interactions, had asked the 14- and 15-year-old victims to \"prove\" to him that they were his biggest fans by sending him sexually explicit videos.In the criminal complaint, one girl admitted that she made 15 videos for Jones as recently as May 4th, in what she called an \"audition.\" She alleged that the YouTube star pressured her to \"work really hard\" even though she told him she \"might pass out\" and was tired from what he was asking her to do. At one point during the Facebook interactions, the victim allegedly acknowledged that Jones was 24, and he requested that she repeatedly acknowledge that she was \"only 14.\"Jones' other alleged victim, whom he chatted with in August 2016, alleged that the singer told her she would get to perform a sex act on him if she were \"lucky.\" In the chat, Jones allegedly acknowledged that he was 23 at the time and the victim was 14. Federal authorities said the girl sent Jones a total of 25 videos, including eight that were sexually explicit. According to the complaint, once arrested Monday, Jones admitted to \"receiving videos from the victims, and he admitted it was for sexual pleasure.\"Jones, who is best known for his own renditions of popular songs by artists like Justin Bieber, Twenty One Pilots and Fall Out Boy, has a following of more than 500,000 subscribers on his YouTube page and more than 300,000 followers on Instagram.The singer came under fire in 2015 over allegations that he had lied about his age in order to solicit \"twerking\" videos from underage girls, which lead to a lengthy Facebook apology and an emotional YouTube confessional.\"I'm embarrassed. I'd have conversations online with girls that would involve me asking them to create a video of themselves twerking,\" he wrote at the time in a since-deleted Facebook post. \"Sometimes I'd make videos of myself doing some twerk moves in return. Here's the truth: I NEVER asked them to do anything more than send a twerking video. Nothing EVER went beyond that.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1497455520.0, "source": "https://www.rollingstone.com", "summary": ""}