{"url": "popculture.com/reality-tv/2018/07/03/kim-kardashian-kanye-west-divorce-rumors-proven-false/", "text": "\n\nRumors of Kim Kardashian and Kanye West getting a divorce are highly exaggerated. The superstar couple are still married.\n\nAccording to Gossip Cop, OK! Australia recently published an issue with the headline \"Kim & Kanye: It’s Finally Over! Divorce Papers Signed!\" The cover even showed documents, claiming they proved the divorce. But one never happened.\n\nIn fact, the documents on the cover are actually from Kardashian's 2004 divorce from her first husband, Damon Thomas. They are in the public record, so the documents can be easily obtained on the web.\n\nThe content in the report is exactly the same as what appeared in In Touch Weekly.That issue included a supposed quote from Kardashian, \"Kanye's not the man I fell in love with.\" The cover also claimed West broke down in tears and Kardashian took their three children to live with her mother, Kris Jenner.\n\nAt the time the two reports were published, both OK! Australia and In Touch were owned by the same company, Bauer Media. As of July 1, In Touch is owned by American Media Inc., the publisher of Us Weekly, Radar Online and the National Enquirer.\n\nIn Touch claimed that Kardashian was pushed \"over the edge\" after they went to Paris in June. A source told the magazine Kardashian was upset after seeing West hug Virgil Abloh at the Louis Vuitton fashion show. But if Kardashian was upset, she did not show it publicly. In fact, she retweeted a video of the scene, adding a heart emoji.\n\nThe trip was emotional for Kardashian, since it marked her first time in Paris since she was robbed there in October 2016.\n\nThe tabloid report also claims Kardashian told her family she was leaving West after his infamous remarks about slavery to TMZ and his tweets. In reality, Kardashian publicly supported her husband. Later, West did admit he thought Kardashian would leave him.\n\n\"There was a moment where I felt like after TMZ, maybe a week after that, I felt like the energy levels were low, and I called different family members and was asking, you know, 'Was Kim thinking about leaving me after TMZ?'\" he told The New York Times last month. \"So that was a real conversation.\"\n\nWest also referred to Kardashian's decision to stick by him in his son \"Wouldn't Leave,\" in which he raps, “Told her she could leave me now/But she wouldn’t leave.”\n\nWest and Kardashian have been married since 2014 and share three children, 5-year-old North, 2-year-old Saint and 6-month-old Chicago.\n\nPhoto credit: Getty", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2018/07/03/kim-kardashian-kanye-west-divorce-rumors-proven-false/", "title": "Kim Kardashian-Kanye West Divorce Rumors Proven False", "meta_data": {"description": "Rumors of Kim Kardashian and Kanye West getting a divorce are highly exaggerated. The superstar couple are still married.According to Gossip Cop, OK! Australia recently published an issue with the headline 'Kim & Kanye: It’s Finally Over! Divorce Papers Signed!' The cover even showed documents, [...]", "keywords": "Kim Kardashian,Kanye West", "news_keywords": "Kim Kardashian,Kanye West", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "dsl89", "title": "Kim Kardashian-Kanye West Divorce Rumors Proven False", "description": "Rumors of Kim Kardashian and Kanye West getting a divorce are highly exaggerated. The superstar [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Kim Kardashian-Kanye West Divorce Rumors Proven False", "type": "article", "url": "https://popculture.com/reality-tv/2018/07/03/kim-kardashian-kanye-west-divorce-rumors-proven-false/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Rumors of Kim Kardashian and Kanye West getting a divorce are highly exaggerated. The superstar [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1530547200.0, "source": "http://popculture.com", "summary": ""}