{"url": "https://www.sltrib.com/artsliving/tv/2018/03/21/how-tan-france-ended-up-calling-salt-lake-city-home-and-other-things-that-might-surprise-you-about-the-queer-eye-star/", "text": "“Queer Eye” guy Tan France is the British-born son of Pakistani parents who makes his home in Salt Lake City.\n\nIf that sounds like it has the makings of a funny story, well, France himself — the fashion expert on the Netflix series — laughed out loud when he told it.\n\nUtah is not exactly where you’d expect to find one of the stars of the Netflix series, which has been a major topic of conversation on social media since it premiered in early February. The streaming service doesn’t release viewership numbers, but the show won over skeptical critics — it’s at 96 percent among critics (and 90 percent among viewers) on Rotten Tomatoes.\n\nA dozen years ago, France was living in New York with a housemate who was a Utah native. France came here to visit, and he decided he would make this his home after he’d been here “for about 20 minutes.”\n\nSeriously.\n\n“I went out to dinner at Chili’s on Fourth South,” France said, “and at the end of that meal, I said to my friend, ‘I’m going to live here one day.’ ”\n\nHis friend scoffed, but France said Salt Lakers “are some of the nicest people I’ve ever met. And I can see the mountains from this restaurant, and that’s beautiful.’ ”\n\nFrance continued to visit Utah every three or four months. A couple of years later, he met his husband, Rob France.\n\n“We started to date and then, yeah, I realized he was the one very shortly after that. So I planned on Utah being my home.”\n\nWhich it has been for nearly a decade. France operated clothing businesses here — he created Kingdom & State and co-created Rachel Parcell Inc. — and made a home with his husband, who’s an illustrator.\n\nArticle continues below\n\n“There are so many things that kept me here,” he said. “And, most importantly, I found the most incredible friend group. So it truly is my favorite place on Earth.”\n\nUnexpected stardom • The producers of “Queer Eye” reached out to France because of his work in the fashion industry. They were looking for somebody to step into the shoes of the most high-profile guy on the original “Queer Eye for the Straight Guy” (2003-07), fashion guru Carson Kressley.\n\nThe Netfix reboot, titled simply “Queer Eye,” features five gay men (the Fab Five) who help other men with fashion, style, personal grooming, interior design and the rather nebulous “culture.”\n\nFrance auditioned as sort of a lark, “but never in a million years did I think I would end up on a TV show. … It made no sense to me that they would take a chance on somebody who’d never been on TV and gets nervous having a photo taken.”\n\nYes, France is a handsome man with great hair, but he insists he never even liked to have his picture taken.\n\n“The other [Fab Five] boys have all done TV before. They’d done film before. They’re comfortable in this space, and they’d always wanted this for many, many years,” France said.\n\n(Bobby Berk has made multiple TV appearances on home design shows; Karamo Brown was on “The Real World” and has many hosting and acting credits; Antoni Porowski is an actor; and Jonathan Van Ness stars in the “Funny or Die” parody “Gay of Thrones.”)\n\n“It was just surprising when … I was the one who got the job,” France said. “And it’s still shocking to me.”\n\nAs of this writing, the Fab Five are still waiting to hear if Netflix will pick up “Queer Eye” for a second season. But they’re hopeful. Executive producer David Collins has been talking about producing Season 2 somewhere in the Midwest. (Atlanta was home base for Season 1.)\n\nMuslim and Mormon • Growing up in London, Tan France was raised Muslim; growing up in Wyoming, his husband, Rob, was raised Mormon. In an earlier interview with the New York Post, Tan France said, “We practice some of our religions’ practices. We don’t practice them all. We practice what works for us.”\n\nA few weeks later, Tan apologized and demurred when asked about their backgrounds.\n\n“We really don’t talk about religion,” he said. “People make assumptions about what our religions are, but we leave it to them.”\n\nFamous in Salt Lake City • Since “Queer Eye” debuted, France is recognized constantly. And nowhere more often than in his adopted hometown — which is “shockingly, even more hectic” than New York or Los Angeles.\n\n“I no longer go to the store,” France said. “We don’t go out to dinner anymore, we only have friends over to dinner at our home. It just gets too chaotic.”\n\nFrance believes he’s recognized more often in Utah because “there aren’t many people that look like me here. Whereas in New York and L.A., there are people of color. Here, people can spot me a mile off.”\n\nOr they hear his accent. “They’re wonderful because I’m British,” he said with a laugh. “And I hate to say that, but they love the Brits out here.”\n\nHe’s not complaining. “On the whole, it’s lovely. But one person asks for a selfie, there’s then a line and we could be stuck there for an hour or two when we went out to get milk.”\n\nInspiring to Salt Lake gays • France said he’s regularly approached by people who don’t just want a selfie with him, they want to tell him “a story about their dad watching [‘Queer Eye’] or their granddad watching it — just people who I would never expect to watch the show. And they say, ‘You don’t know how much it’s changed the conversation in our home.’\n\n“I feel so blessed to be in a position where I’m on a show and I’m having conversations that are affecting real people.”\n\nHe’s also been surprised by the number of people “who reached out to say they were able to come out … because their family watched the show. Actually, a lot of Salt Lakers … will stop me and say, ‘I came out this month because you gave me the courage to on this show.’ It’s insane.”\n\nGetting comfortable on camera • Chatting with the smooth, erudite France today, you’d never know that he was overwhelmed when “Queer Eye” production began.\n\n“I definitely wasn’t the person that you see now. I was so nervous,” he said.\n\nAnd the pressure got to him when he filmed his first scene in front of a production team “of 30-something people, all waiting for me to say something. That kind of pressure you can’t prepare for, quite honestly.”\n\nHe uses words like “hideous” and “hellacious” to describe the first couple of weeks.\n\n“I would leave the set and go home and call my husband on FaceTime and just sit there and cry, saying, ‘I’ve made the biggest mistake of my life. I don’t think I’m ever going to be comfortable,’” said France. “I guess I just needed a couple of weeks to get over it. Now, these things don’t faze me at all.”\n\n‘Queer Eye’ for a new generation • There are some major differences between the original “Queer Eye for the Straight Guy” and the reboot — and not just that, in one of the eight episodes, the new Fab Five make over a gay guy.\n\nThe new guys are a lot more touchy-feely. They talk about their personal lives; the originals did not.\n\n1 of 10 View Caption (Photo courtesy of Carin Baer/Netflix) Karamo Brown, Jonathan Van Ness, Tan France, Bobby Berk, Antoni Porowski, Neal Reddy —... (Photo courtesy of Netflix) Tan France, Bobby Berk and the fire chief in the “Hose Before Bros” episode of “Queer Eye.” Tan France, Karamo Brown, Jonathan Van Ness — three members of the Fab Five — in an episode of “Queer Eye.” (Photo courtesy Gavin Bond/Netflix) Bobby Berk, Karamo Brown, Antoni Porowski, Jonathan Van Ness and Tan France star in “Quee... (Photo courtesy of Netflix) Salt Lake resident Tan France, left, stars in “Queer Eye” on Netflix. (Photo courtesy of Netflix) Joe Gallois and Tan France in the “Below Average Joe” episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France, right, checks out Remington Porter's new look in “The Renaissance of Remington” episo... (Photo courtesy of Netflix) Tan France in an episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France and Neal Reddy in the “Saving Sasquatch” episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France, left, helps Cory Waldrop find his best look in the “Dega Don't episode of “Queer Eye.... (Photo courtesy of Carin Baer/Netflix) Karamo Brown, Jonathan Van Ness, Tan France, Bobby Berk, Antoni Porowski, Neal Reddy — the Fab Five — in an episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France, Bobby Berk and the fire chief in the “Hose Before Bros” episode of “Queer Eye.” Tan France, Karamo Brown, Jonathan Van Ness — three members of the Fab Five — in an episode of “Queer Eye.” (Photo courtesy Gavin Bond/Netflix) Bobby Berk, Karamo Brown, Antoni Porowski, Jonathan Van Ness and Tan France star in “Queer Eye” on Netflix. (Photo courtesy of Netflix) Salt Lake resident Tan France, left, stars in “Queer Eye” on Netflix. (Photo courtesy of Netflix) Joe Gallois and Tan France in the “Below Average Joe” episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France, right, checks out Remington Porter's new look in “The Renaissance of Remington” episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France in an episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France and Neal Reddy in the “Saving Sasquatch” episode of “Queer Eye.” (Photo courtesy of Netflix) Tan France, left, helps Cory Waldrop find his best look in the “Dega Don't episode of “Queer Eye.” <\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n>\n\n“It wasn’t the right time,” France said. “I don’t think that America [was] ready to hear who was married, who was in a relationship, who wanted children. … We’re breaking down those barriers.”\n\nFifteen years ago, the original Fab Five “were there to make things pretty. Whereas now … I represent so much more than just putting clothes on somebody.”\n\nHe is by no means trying to run away from his job as “style guy” on the show.\n\n“But I’m hoping what you notice is that there’s so much more to every one of us,” France said. “We are there to change people’s opinions. To open their hearts and minds, and show them a version of gay men — gay life — that they’ve never seen before.”\n\nA version that features “just regular folk who have husbands, who have children, who are of a certain religion, who are of a certain background.”\n\nHair-raising social media • France is surprised that his social media following has ballooned; he’s stunned by all the interest in his hair.\n\n“It’s the one constant,” he said. “I get an average of a thousand [Instagram direct messages] a day, and probably 700 or 800 are about my hair.”\n\nSeriously, people?\n\nFrance had fewer than 3,000 followers pre-“Queer Eye”; Netflix execs hoped that would climb to 10,000 after the show debuted.\n\n“I’m at almost 270,000 within less than a month. That’s insane,” France said. “People are connecting so strongly with the show, and, therefore, they want to DM because they feel like they truly know me.”\n\nBTW, yes, that’s his real hair. No, he doesn’t color it (the gray is real). And, no he doesn’t spend a lot of time on it.\n\nGay, Muslim, Middle Eastern, immigrant • France isn’t just shattering stereotypes about gay men, he’s doing the same for other “marginalized demographics.”\n\n“Let’s face it, in this current climate, me being on a very commercial show is the opposite of what our leadership may want shown on a national platform,” he said. “I represent everything that the current administration doesn’t like. I’m gay. I’m of a certain religion. I am Middle Eastern. And I’m an immigrant.”\n\nAnd he’s showing that an immigrant can come to America, create successful businesses … and become a TV star.\n\n“I think it’s a very important message,” France said. “So I’m really glad that they chose somebody like me to represent our community.”\n\nDelayed retirement • Not only did France have no plans to be a TV star, he didn’t plan to be working, period, at this point in his life.\n\n“I was actually retiring just before I got the call for the show,” he said. Yes, he’s only in his mid-30s. But he and his husband want to start a family.\n\n“I wanted to start the surrogacy process,” France said. “I just wanted to live a quiet life. I have a home that I’m in love with in Salt Lake, and that was all I wanted. I just wanted to give it all up and focus on family life.\n\n“And then this happens.”\n\nDon’t be intimidated • France said people tell him all the time that they’re fearful he’ll judge what they’re wearing.\n\n“Literally everybody I meet,” he said. “And, literally, everybody who asks me for a selfie, the first thing they say is, ‘Oh, I should’ve dressed up more.’”\n\nHis goal on the show is “to get the best version of that person out” by dressing them as well as he can.\n\n“I really am not that critical of what people wear,” he said, bursting into laughter. “I think, ‘If you’re comfortable in what you’re wearing, good for you.’”", "images": ["https://www.sltrib.com/resizer/VDl9yC2Cax01q0xOiGj45-IkWpQ=/970x0/filters:quality(100)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/YRARROSSEFF3JKTECJ54J4VBJY.jpg", "https://www.sltrib.com/resizer/w1Paet4BgFpN4NwSA3D3RtJG98U=/970x0/filters:quality(100)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/P6CFXZDXUBBODMQPAUBQAYKXU4.jpg", "https://www.sltrib.com/resizer/5J_9VKqecygD6cTCQnsXUHn2ew0=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/336OGMWXU5GCPPU7BRFXMWH3GM.jpg", "https://www.sltrib.com/resizer/vlUHyMhAiuLI3nTt444jrwWOj4g=/970x0/filters:quality(100)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/33XCSBGY3JEXNC7BKDHSVZFZX4.jpg", "https://www.sltrib.com/pb/resources/assets/img/donate_sltrib_button_icon_redbright.png", "https://www.sltrib.com/resizer/Hgzw9wXDDs1hotQIsF8NvKWWogg=/970x0/filters:quality(100)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/A464QMQWOJBIHA7BOQ7CQS4QXU.jpg", "https://www.sltrib.com/resizer/0h3k2YF-EUqq30La-kXzRJg8DDc=/970x0/filters:quality(100)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/336OGMWXU5GCPPU7BRFXMWH3GM.jpg", "https://www.sltrib.com/resizer/5qbxrFbleLgg-OgowstoQuEYepE=/970x0/filters:quality(100)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/N3CXWWRVS5DG7B2Z2CACJF7OZA.jpg", "https://www.sltrib.com/resizer/U-mH2cLeESxf6iBDFPIO0I6l4FE=/70x70/smart/filters:quality(86)/s3.amazonaws.com/arc-authors/sltrib/0d2c27ce-211e-4d20-9938-5a5db6302dbb.jpg", "https://www.sltrib.com/pb/resources/assets/img/vectors/sltrib-logo.svg", "https://www.sltrib.com/pb/resources/assets/img/vectors/close-icon.svg", "https://www.sltrib.com/resizer/S-1tlL9udHu2x02zeLoV-lkNCnE=/60x60/smart/filters:quality(86)/s3.amazonaws.com/arc-authors/sltrib/0d2c27ce-211e-4d20-9938-5a5db6302dbb.jpg"], "top_img": "https://www.sltrib.com/resizer/5J_9VKqecygD6cTCQnsXUHn2ew0=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/336OGMWXU5GCPPU7BRFXMWH3GM.jpg", "keywords": [], "authors": ["Spierce Sltrib.Com", "Scott D. Pierce"], "canonical_link": "https://www.sltrib.com/artsliving/tv/2018/03/21/how-tan-france-ended-up-calling-salt-lake-city-home-and-other-things-that-might-surprise-you-about-the-queer-eye-star/", "title": "It took ‘Queer Eye’ star Tan France 20 minutes to decide to move to Salt Lake City", "meta_data": {"referrer": "unsafe-url", "apple-mobile-web-app-title": "SLTrib", "application-name": "SLTrib", "msapplication-config": "/pb/resources/favicons/browserconfig.xml?v=1.1", "theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "description": "“Queer Eye” guy Tan France is the British-born son of Pakistani parents who makes his home in Salt Lake City.", "twitter": {"site": "@sltrib", "card": "summary_large_image", "description": "“Queer Eye” guy Tan France is the British-born son of Pakistani parents who makes his home in Salt Lake City.", "image": "https://www.sltrib.com/resizer/5J_9VKqecygD6cTCQnsXUHn2ew0=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/336OGMWXU5GCPPU7BRFXMWH3GM.jpg", "title": "It took ‘Queer Eye’ star Tan France 20 minutes to decide to move to Salt Lake City"}, "og": {"description": "“Queer Eye” guy Tan France is the British-born son of Pakistani parents who makes his home in Salt Lake City.", "site_name": "The Salt Lake Tribune", "type": "article", "locale": "en_US", "image": "https://www.sltrib.com/resizer/5J_9VKqecygD6cTCQnsXUHn2ew0=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/336OGMWXU5GCPPU7BRFXMWH3GM.jpg", "title": "It took ‘Queer Eye’ star Tan France 20 minutes to decide to move to Salt Lake City", "url": "https://www.sltrib.com/artsliving/tv/2018/03/21/how-tan-france-ended-up-calling-salt-lake-city-home-and-other-things-that-might-surprise-you-about-the-queer-eye-star/"}, "distribution": "global", "rating": "general", "language": "en_US", "article": {"publisher": "https://www.facebook.com/saltlaketribune", "author": "https://www.facebook.com/saltlaketribune", "section": ","}, "fb": {"app_id": 913431655408104}, "ogType": "article", "ogImage": "https://arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/336OGMWXU5GCPPU7BRFXMWH3GM.jpg", "pianoReload": "false", "canonicalUrl": "https://www.sltrib.com/artsliving/tv/2018/03/21/how-tan-france-ended-up-calling-salt-lake-city-home-and-other-things-that-might-surprise-you-about-the-queer-eye-star", "isMetered": "true", "title": "It took ‘Queer Eye’ star Tan France 20 minutes to decide to move to Salt Lake City", "robots": "index, follow", "twt-article-id": "GQSFVZW64ZD2VEJ3ZIPWTD3K2E", "twt-published-at": "2018-03-22T14:30:00.106Z", "twt-article-url": "https://www.sltrib.com/artsliving/tv/2018/03/21/how-tan-france-ended-up-calling-salt-lake-city-home-and-other-things-that-might-surprise-you-about-the-queer-eye-star/", "twt-author-name": "spierce@sltrib.com", "twt-page-title": "It took ‘Queer Eye’ star Tan France 20 minutes to decide to move to Salt Lake City"}, "movies": ["https://www.youtube.com/embed/GZMrivD2Aok?feature=oembed", "https://www.youtube.com/embed/NvZVq23wAUw?feature=oembed", "https://www.youtube.com/embed/7BiK0rNpFxg?feature=oembed"], "publish_date": 1521561600.0, "source": "https://www.sltrib.com", "summary": ""}