{"url": "https://variety.com/2018/film/columns/oscars-best-popular-film-category-commentary-1202899728/", "text": "For a hundred years, movies have been a popular art form. So Wednesday morning, when the news came out that the Academy of Motion Picture Arts and Sciences is proposing to introduce a new category at the Oscars, one that would be called best popular film (or words to that effect), the first reaction I had — apart from my jaw dropping on the floor in shock and dismay — was: best popular film? What does that even mean?\n\nI get the motivation. The Academy, along with ABC, the TV network that programs the Oscars, is looking for new ways to lure viewers to a show that, in recent years, has seemed less and less interested in any film that could be called a blockbuster. That’s become a problem for the Oscars, as both a TV-ratings spectacle and a cultural event. There’s growing conviction, and with good evidence, that “the mass audience” — the people who turn out to see comic-book movies, “Star Wars” movies, etc. — is less and less interested in the Oscars. Ratings for the show have been in a slow but steady decline, and out of that reality grows the conviction — and fear — that the Oscars have become marginalized.\n\nThe problem is real. But let’s be clear: This category is not the way to fix it. The notion of putting “popular” films in a section all their own isn’t just unworkable — and, the more you look it, nonsensical. It’s nothing short of reprehensible. It violates the very spirit of what movies have been ever since there have been movies.\n\nI ask again: What, exactly, is a “popular” film? “Avengers: Infinity War”? Undoubtedly. “Mission: Impossible — Fallout”? Most certainly. And what about “La La Land,” the musical that became a mainstream phenomenon by grossing $150 million? I’d say that counts too. So should “La La Land” have been nominated in the best popular film category? It’s not a comic-book movie, but it is a highly entertaining work of popular appeal made in a time-honored Hollywood genre.\n\nOkay, it’s obvious that “La La Land” was trying to be a movie of genuine artistry. So should that, in fact, disqualify it from inclusion in the best popular film category? And if so, what do you do with “The Greatest Showman”? It wasn’t an acclaimed film like “La La Land” (though I gave it one of its rare rave reviews), but it, too, was a highly popular musical, grossing $175 million. Should that film have been nominated in the best popular film category? If so, should the category actually be called best popular film that critics don’t like?\n\nBut if that’s the case, what do you do with popcorn movies — big-ticket movies, blockbuster movies, popular movies — that critics adore? (Believe it or not, we actually give good reviews to more than a few of them.) As my colleague Kristopher Tapley has noted, there’s been much talk this year about the possibility of “Black Panther” receiving a best picture nomination, and maybe even winning. If that happened, it would be an event with meaning, a sign that the industry knows how to salute its organic diversity — and, just as much, that it could recognize that a comic-book film can achieve a heightened artistry. If the scenario of “Black Panther” dominating the Oscars came to pass, it would seem, to me, the essence of what the Oscars should be all about.\n\nBut let’s assume that we have a best popular film category. You’d think that “Black Panther,” since it’s the top-grossing movie of the year, would be relegated — almost by definition — to that category. Later on Wednesday, though, the Academy issued a clarifying statement that said a movie could be nominated in both the best popular film and best picture categories. That solves one problem by creating another. Imagine that “Black Panther” was nominated in both categories. Wouldn’t there be at least some Academy voters who felt tempted to vote for it in one category (i.e., best popular film) instead of the other? Wouldn’t the movie, in effect, be competing against itself?\n\nLet’s be honest: The whole notion of a best popular film category feels chintzy and cheesy and superficial — very People’s Choice Awards, or MTV Movie & TV Awards. And in the end, how much difference would it make anyway? Are the legions of blockbuster fans who, more and more, don’t even bother to tune into the Oscars really going to watch, all of a sudden, because there is now one category devoted to “their” movies? Are they really going to sit through the entire telecast to find out whether “Infinity War” can beat “Mission: Impossible — Fallout”? Anyone who believes that is dreaming.\n\nYet for all the ways that it’s unworkable, impractical, and not at all likely to succeed, the single worst aspect of the proposed best popular film category is that it feels not just tacky but corrupt. It’s a piece of cultural demagoguery. It commits a sin that I would call philosophical.\n\nThe whole notion of dividing movies into “art” and “entertainment,” with the suggestion that the “art” films appeal to a “small, elite” audience and that the “entertainment” films appeal to, you know, the people, has always been simplistic and, ultimately, untrue. And these days it comes with an unmistakable Trumpian spin. The mainstream vs. the elites!\n\nSure, you can point to examples throughout movie history where thinking in terms of that dichotomy was justified. Robert Bresson’s “Diary of a Country Priest” is an art film that was never going to be a mass-audience crowd pleaser; “Transformers” movies are mass-audience machines that no one would confuse with art.\n\nYet the real history of movies is about all these categories — these ways of thinking — being broken down. Most of the great films of the studio-system era were popular hits. In the ’70s, extraordinary works of art, like “Easy Rider” and “The Godfather” and “Chinatown” and “Taxi Driver,” became timeless popular films. And though there’s no denying that this happens less in our era, it’s not as if it doesn’t happen at all. Just look at films like “Dunkirk” or “Lincoln” or “Mad Max: Fury Road,” all of them enormous hits, and all spectacular works of art. Which category should they be in?\n\nAnd since we’re talking about the Academy, let’s take a closer look at all the fantasy/popcorn/genre movies the Academy habitually underrates and overlooks. The argument, back in 2009, that “The Dark Knight” should receive a best picture nomination wasn’t just based on the idea that “it’s time” for a comic-book movie to finally get that recognition. It was based on the infinitely more pure idea that, yes, “The Dark Knight” was that good. It was a genuine work of popular art.\n\nThe point is that, more and more, as our blockbusters tussle with year-end “awards films” for the attention of moviegoers, we need to begin looking at movies without putting them in slots, which is really a way of marginalizing them, reducing them from magical experiences to cut-and-dried niche products. The last thing that the Academy should now be doing is creating a reactionary new category that is, in effect, the Popular Ghetto. Instead, it should be working to take off its blinders and make more room in the big tent for every movie that comes out. That’s how to win viewers back to the Oscars without trashing the essence of what movies are.", "images": ["https://pmcvariety.files.wordpress.com/2016/11/blackpanther.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2016/11/blackpanther.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fcolumns%2Foscars-best-popular-film-category-commentary-1202899728%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202899728&comment_count=54", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2016/11/blackpanther.jpg?w=1000", "keywords": [], "authors": ["Owen Gleiberman"], "canonical_link": "https://variety.com/2018/film/columns/oscars-best-popular-film-category-commentary-1202899728/", "title": "Popular Film Category Violates Everything the Oscars Are Supposed to Be About", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "The proposal for a best popular film category at the Oscars violates everything it's supposed to be about.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202899728, "author": "Owen Gleiberman", "pmc-category": "Columns", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-08-08T13:00:48"}, "pmc-tag": "Black Panther,La La Land,Oscars", "title": "Popular Film Category Violates Everything the Oscars Are Supposed to Be About", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "Columns", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Popular Film Category Violates Everything the Oscars Are Supposed to Be About", "url": "https://variety.com/2018/film/columns/oscars-best-popular-film-category-commentary-1202899728/", "description": "For a hundred years, movies have been a popular art form. So Wednesday morning, when the news came out that the Academy of Motion Picture Arts and Sciences is proposing to introduce a new category …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/11/blackpanther.jpg?w=1000", "width": 1000, "height": 562, "alt": "No Merchandising. Editorial Use Only. No Book Cover UsageMandatory Credit: Photo by Marvel/Disney/Kobal/REX/Shutterstock (9360960dg)Danai Gurira, Chadwick Boseman, Lupita Nyong'o, Florence Kasumba\"Black Panther\" Film - 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-08-08T20:00:48+00:00", "modified_time": "2018-08-08T22:33:27+00:00"}, "twitter": {"creator": "@OwenGleiberman", "site": "@variety", "text": {"title": "Popular Film Category Violates Everything the Oscars Are Supposed to Be About"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/11/blackpanther.jpg?w=1000", "alt": "No Merchandising. Editorial Use Only. No Book Cover UsageMandatory Credit: Photo by Marvel/Disney/Kobal/REX/Shutterstock (9360960dg)Danai Gurira, Chadwick Boseman, Lupita Nyong'o, Florence Kasumba\"Black Panther\" Film - 2018"}, "card": "summary_large_image", "title": "Popular Film Category Violates Everything the Oscars Are Supposed to Be About", "description": "The proposal for a best popular film category at the Oscars violates everything it's supposed to be about."}, "author": "Owen Gleiberman", "content_type": "Article", "post_id": 1202899728, "title": "Popular Film Category Violates Everything the Oscars Are Supposed to Be About", "published_at": "2018-08-08 13:00:48", "image": "https://pmcvariety.files.wordpress.com/2016/11/blackpanther.jpg?w=1000", "comment_count": 54, "tags": "Oscars", "topics": "Columns", "appeared_in_print": "No", "body": "For a hundred years, movies have been a popular art form. So Wednesday morning, when the news came out that the Academy of Motion Picture Arts and Sciences is proposing to introduce a new category at the Oscars, one that would be called best popular film (or words to that effect), the first reaction I had — apart from my jaw dropping on the floor in shock and dismay — was: best popular film? What does that even mean? \r\n\r\nI get the motivation. The Academy, along with ABC, the TV network that programs the Oscars, is looking for new ways to lure viewers to a show that, in recent years, has seemed less and less interested in any film that could be called a blockbuster. That’s become a problem for the Oscars, as both a TV-ratings spectacle and a cultural event. There’s growing conviction, and with good evidence, that \"the mass audience\" — the people who turn out to see comic-book movies, \"Star Wars\" movies, etc. — is less and less interested in the Oscars. Ratings for the show have been in a slow but steady decline, and out of that reality grows the conviction — and fear — that the Oscars have become marginalized.\r\n\r\nThe problem is real. But let’s be clear: This category is not the way to fix it. The notion of putting \"popular\" films in a section all their own isn’t just unworkable — and, the more you look it, nonsensical. It’s nothing short of reprehensible. It violates the very spirit of what movies have been ever since there have been movies.\r\n\r\nI ask again: What, exactly, is a \"popular\" film? \"Avengers: Infinity War\"? Undoubtedly. \"Mission: Impossible — Fallout\"? Most certainly. And what about \"La La Land,\" the musical that became a mainstream phenomenon by grossing $150 million? I’d say that counts too. So should \"La La Land\" have been nominated in the best popular film category? It’s not a comic-book movie, but it is a highly entertaining work of popular appeal made in a time-honored Hollywood genre.\r\n\r\nOkay, it’s obvious that \"La La Land\" was trying to be a movie of genuine artistry. So should that, in fact, disqualify it from inclusion in the best popular film category? And if so, what do you do with \"The Greatest Showman\"? It wasn’t an acclaimed film like \"La La Land\" (though I gave it one of its rare rave reviews), but it, too, was a highly popular musical, grossing $175 million. Should that film have been nominated in the best popular film category? If so, should the category actually be called best popular film that critics don’t like?\r\n\r\nBut if that’s the case, what do you do with popcorn movies — big-ticket movies, blockbuster movies, popular movies — that critics adore? (Believe it or not, we actually give good reviews to more than a few of them.) As my colleague Kristopher Tapley has noted, there's been much talk this year about the possibility of \"Black Panther\" receiving a best picture nomination, and maybe even winning. If that happened, it would be an event with meaning, a sign that the industry knows how to salute its organic diversity — and, just as much, that it could recognize that a comic-book film can achieve a heightened artistry. If the scenario of \"Black Panther\" dominating the Oscars came to pass, it would seem, to me, the essence of what the Oscars should be all about.\r\n\r\nBut let’s assume that we have a best popular film category. You'd think that \"Black Panther,\" since it's the top-grossing movie of the year, would be relegated — almost by definition — to that category. Later on Wednesday, though, the Academy issued a clarifying statement that said a movie could be nominated in both the best popular film and best picture categories. That solves one problem by creating another. Imagine that \"Black Panther\" was nominated in both categories. Wouldn't there be at least some Academy voters who felt tempted to vote for it in one category (i.e., best popular film) instead of the other? Wouldn't the movie, in effect, be competing against itself?\r\n\r\nLet’s be honest: The whole notion of a best popular film category feels chintzy and cheesy and superficial — very People’s Choice Awards, or MTV Movie & TV Awards. And in the end, how much difference would it make anyway? Are the legions of blockbuster fans who, more and more, don’t even bother to tune into the Oscars really going to watch, all of a sudden, because there is now one category devoted to \"their\" movies? Are they really going to sit through the entire telecast to find out whether \"Infinity War\" can beat \"Mission: Impossible — Fallout\"? Anyone who believes that is dreaming.\r\n\r\nYet for all the ways that it’s unworkable, impractical, and not at all likely to succeed, the single worst aspect of the proposed best popular film category is that it feels not just tacky but corrupt. It's a piece of cultural demagoguery. It commits a sin that I would call philosophical.\r\n\r\nThe whole notion of dividing movies into \"art\" and \"entertainment,\" with the suggestion that the \"art\" films appeal to a \"small, elite\" audience and that the \"entertainment\" films appeal to, you know, the people, has always been simplistic and, ultimately, untrue. And these days it comes with an unmistakable Trumpian spin. The mainstream vs. the elites!\r\n\r\nSure, you can point to examples throughout movie history where thinking in terms of that dichotomy was justified. Robert Bresson’s \"Diary of a Country Priest\" is an art film that was never going to be a mass-audience crowd pleaser; \"Transformers\" movies are mass-audience machines that no one would confuse with art.\r\n\r\nYet the real history of movies is about all these categories — these ways of thinking — being broken down. Most of the great films of the studio-system era were popular hits. In the '70s, extraordinary works of art, like \"Easy Rider\" and \"The Godfather\" and \"Chinatown\" and \"Taxi Driver,\" became timeless popular films. And though there’s no denying that this happens less in our era, it’s not as if it doesn’t happen at all. Just look at films like \"Dunkirk\" or \"Lincoln\" or \"Mad Max: Fury Road,\" all of them enormous hits, and all spectacular works of art. Which category should they be in?\r\n\r\nAnd since we’re talking about the Academy, let’s take a closer look at all the fantasy/popcorn/genre movies the Academy habitually underrates and overlooks. The argument, back in 2009, that \"The Dark Knight\" should receive a best picture nomination wasn’t just based on the idea that \"it's time\" for a comic-book movie to finally get that recognition. It was based on the infinitely more pure idea that, yes, \"The Dark Knight\" was that good. It was a genuine work of popular art.\r\n\r\nThe point is that, more and more, as our blockbusters tussle with year-end \"awards films\" for the attention of moviegoers, we need to begin looking at movies without putting them in slots, which is really a way of marginalizing them, reducing them from magical experiences to cut-and-dried niche products. The last thing that the Academy should now be doing is creating a reactionary new category that is, in effect, the Popular Ghetto. Instead, it should be working to take off its blinders and make more room in the big tent for every movie that comes out. That’s how to win viewers back to the Oscars without trashing the essence of what movies are.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1533758448.0, "source": "https://variety.com", "summary": ""}