{"url": "www.cnn.com/2017/08/28/entertainment/taylor-swift-new-music-video-guide/index.html", "text": "(CNN) Taylor Swift has used her latest video to throw some shade and let the world know she's heard everything people have been saying about her.\n\nSwift premiered the video for \"Look What You Made Me Do\" Sunday night at MTV's Video Music Awards and it was a lot to take in.\n\nThe singer, who had been keeping such a low profile for so long that fans had started to worry, posted in an Instagram caption over the weekend saying \"There will be no further explanation. There will just be reputation.\"\n\nIt was a clever tease, given that \" Reputation \" is the name of her new album set to drop on November 10.\n\nThere will be no further explanation. There will just be reputation. A post shared by Taylor Swift (@taylorswift) on Aug 25, 2017 at 4:54am PDT\n\nSince Tay has yet to give the low down on what it all means, we'll attempt to break it down for you:\n\nThe death of her rep\n\nThe singer gets right down to it, opening up her video with a tombstone that reads \"Here lies Taylor Swift's reputation\" before a zombie version of Swift climbs out of the grave.\n\nAnd how did her reputation die?\n\nThe viewers don't get a cause of death, so one is left to assume Swift is making a statement about all the bad press she's gotten in the last year or so with everything from her break up and spat with producer and DJ Calvin Harris, to her highly-publicized falling out with rapper Kanye West and his wife, Kim Kardashian.\n\nSwift and the couple have had competing narratives as to whether Swift signed off on West calling her a \"b***h\" in a song lyric.\n\nSome fans think Swift took a shot at West with the lyrics \"I don't like your little games, don't like your tilted stage/The role you made me play of the fool, no, I don't like you.\" The rapper's last concert tour featured a floating and tilted stage.\n\nThe moment at the end of the video when Swift said \"Getting receipts, gonna edit this later\" as she pointed her camera phone and mimicked the act of recording a video was interpreted by some fans as a swipe at Kim Kardashian, who was said to have \"brought receipts\" to her husband's spat with the pop star.\n\nSaid \"receipts\"-- an internet catchphrase used to call for proof or evidence -- was a video of a phone conversation between the rapper and Swift, which Kardashian said proved the singer knew about the song lyric she later complained about. Swift shot back at the time that no where did the video show her approving being called a \"b***h.\"\n\nShading an old frenemy?\n\nThe internet also has some theories about a scene in which Swift dressed up to look like Katy Perry.\n\nOne fan tweeted a screen grab of the scene writing \"#TaylorSwift personates #KatyPerry holding a #Grammy because Taylor has plenty & Katy doesn't have one.\"\n\nThe two have had a long-standing feud and interestingly enough Perry was the host of the VMAs this year.\n\nRemember the Tay-shirt controversy?\n\nSwift gave a nod to last year's hoopla over then-boyfriend actor Tom Hiddleston, who wore a white \"I Heart T.S.\" tank while the pair frolicked with friends at the beach for Fourth of July weekend.\n\nShe cheekily had a group of male backup dancers wear crop tops with the same message, though in black, possibly to match the stilettos they rocked.\n\nAnd if you dig the look, you too can proclaim your love as it's part of the merch for sale on her site.\n\nTaylor Swift Is Selling the 'I Heart T.S.' Crop Tops From the 'Look What You Made Me... https://t.co/UwUDhSdmfT pic.twitter.com/y55sm3Ecxl — Major Celeb News (@MajorCeleb) August 28, 2017\n\nThose snakes\n\n\"Swifties,\" as her die-hard fans are known, were thrilled with the singer owning a bit of her hater history.\n\n#TaylorSwiftIsASnake has been the hashtag for those on Twitter wishing to take the singer to task, and the reptiles showed up in her video, with one even serving her tea.\n\nOld and new Taylor are never ever ever getting back together\n\nSwift's many faces and signature looks of over the years made a stunning appearance rife with symbolism.\n\nDressed in a furry one-piece which read \"Rep,\" the new Swift stood on a mountain made up of the older versions of herself from different music videos and red carpet appearances.\n\nThe old Swifts fight to climb to the top before they are all seen falling away.\n\nAnd if that imagery wasn't obvious enough, we see the new Swift saying into the phone \"I'm sorry, the old Taylor can't come to the phone right now. Why? Oh, cause she's dead.\"\n\nSwift mocks Swift\n\nThose old Taylors help Swift close out her music video as she uses them to parody some of the stinging comments that have been made about her over the years.\n\nThere's earnest, nerdy Swift from the \"You Belong With Me\" video who was scolded by zombie Swift saying, \"Stop making that surprise face, it's so annoying.\"\n\n\"You can't possibly be that surprised all the time,\" said ballerina Swift, who appeared in the \"Shake It Off\" music video.\n\nThe just starting out, acoustic guitar version of Swift from her teen years was told to \"Stop acting like you're so nice, you are so fake\" by circus ringleader Swift from the 2012 MTV European Music Awards.\n\nWhen baby Swift starts to cry, a nearby Swift says \"There she goes playing the victim, again.\"\n\nThe video ends with the version of Swift who was famously interrupted by West during her acceptance speech at the 2009 MTV Video Music Awards.\n\nWearing that same off the shoulder gown and clutching her VMA award, Swift utters her now infamous line \"I would very much like to be excluded from this narrative\" which was part of her official statement to the whole West-Kardashian kerfuffle, to which the rest of the Swifts respond with a resounding \"Shut up!\"\n\nOn Tuesday, YouTube announced that \"Look What You Made Me Do\" had the biggest debut of any video in its history with 43.2 million views in 24 hours.\n\nThe previous record holder was Psy's \"Gentleman\" with 36 million views in the first 24 hours.", "images": ["http://cdn.cnn.com/cnnnext/dam/assets/170828124008-01-taylor-swift-music-video-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170828124008-01-taylor-swift-music-video-super-tease.jpg", "http://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif?labels=noscript%3ANo%20Labels%20Set", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7"], "top_img": "https://cdn.cnn.com/cnnnext/dam/assets/170828124008-01-taylor-swift-music-video-super-tease.jpg", "keywords": [], "authors": ["Lisa Respers France"], "canonical_link": "https://www.cnn.com/2017/08/28/entertainment/taylor-swift-new-music-video-guide/index.html", "title": "Taylor Swift's new music video: A guide to what it all means", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "section": "entertainment", "referrer": "unsafe-url", "og": {"pubdate": "2017-08-28T14:41:11Z", "url": "https://www.cnn.com/2017/08/28/entertainment/taylor-swift-new-music-video-guide/index.html", "title": "A guide to Taylor Swift's new music video", "description": "Taylor Swift has used her latest video to throw some shade and let the world know she's heard everything people have been saying about her.", "site_name": "CNN", "type": "article", "image": {"identifier": "https://cdn.cnn.com/cnnnext/dam/assets/170828124008-01-taylor-swift-music-video-super-tease.jpg", "width": 1100, "height": 619}}, "pubdate": "2017-08-28T14:41:11Z", "lastmod": "2017-08-29T17:02:05Z", "author": "Lisa Respers France, CNN", "twitter": {"title": "A guide to Taylor Swift's new music video", "description": "Taylor Swift has used her latest video to throw some shade and let the world know she's heard everything people have been saying about her.", "card": "summary_large_image", "image": "https://cdn.cnn.com/cnnnext/dam/assets/170828124008-01-taylor-swift-music-video-super-tease.jpg"}, "description": "Taylor Swift has used her latest video to throw some shade and let the world know she's heard everything people have been saying about her.", "keywords": "entertainment, Taylor Swift's new music video: A guide to what it all means - CNN", "thumbnail": "https://cdn.cnn.com/cnnnext/dam/assets/170828124008-01-taylor-swift-music-video-super-tease.jpg", "vr": {"canonical": "https://edition.cnn.com/2017/08/28/entertainment/taylor-swift-new-music-video-guide/index.html"}, "article": {"opinion": "false", "content-tier": "free"}, "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "template-top": "entertainment,art-img"}, "movies": ["https://www.youtube.com/embed/3tmd-ClpJxA?feature=oembed"], "publish_date": 1503849600.0, "source": "http://www.cnn.com", "summary": ""}