{"url": "https://popculture.com/reality-tv/2018/02/10/teen-mom-2-briana-dejesus-plastic-surgery/", "text": "Teen Mom 2 star Briana DeJesus is recovering after another round of plastic surgery from the help of Dr. Michael \"Dr. Miami\" Salzhauer.\n\nThe 23-year-old shared a photo with Salzhauer on Instagram. \"Can’t wait to see the final results in a few weeks,\" she wrote in the caption, adding the hashtag, \"New Body Who Dis.\" She also tagged Salzhauer.\n\nE! News reports that DeJesus also posted more photos of herself after the procedure on Instagram Stories. \"Ew [laugh out loud] can't wait for all the blood to wash off and dead skin to fall,\" she wrote on one of the pictures.\n\n\"I did a tummy tuck, a breast lift with an implant exchange because she did have implants from before — she wanted to be smaller, higher and perkier — so we changed her implants out for smaller ones,\" Salzhauer told E! News. \"And we also did some contouring and reshaping of her booty, of her shape overall. We did that, I think it was a week ago Monday.\"\n\nSalzhauer said DeJesus \"did great,\" especially since she went to him before.\n\n\"I am happy that she's sharing her journey with the world because there are a lot of moms that want mommy makeovers and they're scared,\" Salzhauer told E! News. \"Seeing somebody that they know, even if it's through social media, go through it is helpful as far as educating people about it.\"\n\nAs InTouch Weekly reported last week, DeJesus also shared graphic before and after photos on Snapchat. Javi Marroquin, who broke up with DeJesus last month, was by DeJesus' side to support her. However, her decision to get plastic surgery was one of the reasons for the split.\n\n\"Javi and I are not together anymore. Our future just doesn’t line up. He doesn’t want me to get my surgery for a breast lift, lipo, and tummy tuck (which I’m doing in two weeks) because it’ll look bad on his name at work. Also, I don’t plan on moving in with him in the summer and for these reasons, he broke up with me,\" she told Blasting News last month.\n\nShe continued, “I have no bad things to say to about him. He wanted a wife and home right now and I didn’t see a reason to rush. I wish him the best going forward, and I am sad things panned out this way, but this is where things currently stand. Again, we are no longer together.”\n\nDeJesus welcomed her second child, Stella DeJesus, last summer. Stella's father is an ex-boyfriend, Luis. Photo\n\nPhoto credit: Instagram/ Briana DeJesus", "images": ["https://media.popculture.com/2018/02/dejesus-dr-miami-full-pic-20025517.jpeg", "https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2018/02/10/teen-mom-2-briana-dejesus-plastic-surgery/", "title": "'Teen Mom' Briana DeJesus Undergoes 'Mommy Makeover'", "meta_data": {"description": "Teen Mom 2 star Briana DeJesus is recovering after another round of plastic surgery from the help of Dr. Michael 'Dr. Miami' Salzhauer.The 23-year-old shared a photo with Salzhauer on Instagram. 'Can’t wait to see the final results in a few weeks,' she wrote in the caption, adding the hashtag, [...]", "keywords": "Briana DeJesus,Teen Mom 2", "news_keywords": "Briana DeJesus,Teen Mom 2", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "dsl89", "title": "'Teen Mom' Briana DeJesus Undergoes 'Mommy Makeover'", "description": "Teen Mom 2 star Briana DeJesus is recovering after another round of plastic surgery from the help [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "'Teen Mom' Briana DeJesus Undergoes 'Mommy Makeover'", "type": "article", "url": "https://popculture.com/reality-tv/2018/02/10/teen-mom-2-briana-dejesus-plastic-surgery/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Teen Mom 2 star Briana DeJesus is recovering after another round of plastic surgery from the help [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1518192000.0, "source": "https://popculture.com", "summary": ""}