{"url": "www.billboard.com/articles/columns/pop/8015200/selena-gomez-justin-bieber-relationship-timeline", "text": "Selena Gomez and Justin Bieber's on-again, off-again relationship is making headlines once again, after the pop stars were spotted together on a recent breakfast-and-church date.\n\nFans may be speculating whether or not the one-time couple's romance is rekindling, especially amid reports of Gomez and The Weeknd splitting up, or if they're just friends. It's hard say: Gomez and Bieber's storied relationship has gone from breaking up and making up and from \"I am so beyond done with talking about that\" to \"I'm never going to stop loving her.\"\n\n\"Sometimes love isn't a feeling but a choice,\" Bieber posted on Instagram in 2014. In an interview published a year later, he spoke candidly of his ex and circled back to that quote: \"Love is a choice. Love is not a feeling. People have made it seem in movies that it's this fairy tale. That's not what love is. You're not gonna want to love your girl sometimes but you're gonna choose to love her.\"\n\nBelow, check out a play by play of the couple's relationship -- at least, the parts that have been seen through the public eye.\n\nDecember 2010: It All Started With Pancakes\n\nThey first met in 2009. A year later, when Bieber was 16 and Gomez was 18, the two apparently shared a meal and some laughs -- and maybe took part in some hand-holding? -- at an IHOP in Philadelphia.\n\nGomez apparently exclaimed to US that \"it was just pancakes!\" but a week later, they were seen together again by Bieber's tour bus in Miami, where he had a concert. Those who were really paying attention noticed Bieber had his arm placed on Gomez's back.\n\nBieber brushed it off by calling Gomez \"an amazing person\" and telling MTV he was \"just having fun being a teenager.\"\n\nJanuary 2011: Caught Kissing in the Caribbean\n\nThe young maybe-lovebirds still weren't saying a thing about their rumored relationship, but the pictures said plenty.\n\nGomez and Bieber were photographed on vacation together, kissing and embracing on a private yacht in St. Lucia.\n\nFebruary 2011: Holding Hands & Going Red Carpet Official\n\nAfter being photographed together again, this time hand in hand in Santa Monica, Calif., the new teen idol couple made their first real appearance together at a Vanity Fair after-party for the 2011 Oscars in Hollywood.\n\nBieber looked sharp in a black suit, while Gomez turned heads in a stunning red gown -- but more importantly, they arrived arm in arm on the party's red carpet.\n\nSelena Gomez and Justin Bieber arrives at the Vanity Fair Oscar Party at the Sunset Tower in Los Angeles on Feb. 27, 2011. AP Photo/Carlo Allegri\n\nMarch 2011: Thanks to Ellen, Selena Will Never Spend a Night Alone\n\nThere was no denying she was dating Bieber by now, so Gomez was a good sport when Ellen DeGeneres teased the singer about their relationship. In fact, she even accepted a very special gift from the daytime talk show host: a pillow with her boyfriend's face.\n\n\"He's gonna make me sleep with this every night,\" she admitted.\n\nMay 2011: Smooching at the Billboard Music Awards\n\nAt the 2011 Billboard Music Awards, Gomez and Bieber were seen sharing some PDA yet again, this time with a kiss. Things were still sweet a few months into their budding romance.\n\nSeptember 2011: A Romantic Date Alone ... At the Staples Center\n\nIn a grand gesture, Bieber planned a kind of night out with his girlfriend that's not easily replicated. The two had the entire Staples Center to themselves, where they apparently enjoyed a private viewing of Titanic.\n\n“Romance isn’t dead,” Bieber tweeted after their romantic date. “Treat your lady right fellas.”\n\nromance isnt dead. treat your lady right fellas. #REAL — Justin Bieber (@justinbieber) September 24, 2011\n\nFebruary 2012: Diamonds for Valentine's Day\n\nAround the time of Valentine's Day in 2012, Gomez showed off a new sparkly ring in a photo on Twitter. The ring appeared to be made up of diamonds shaped in the letter 'J,' and her hand was being held by (one can only guess) Bieber.\n\n\"I'm finally home,\" she tweeted along with the picture.\n\nApril 2012: Selena's 'Humiliating' Kiss Cam Moment\n\nThe couple's outing to a Lakers game ended up majorly embarrassing Gomez, after their faces showed up on the kiss cam and they found themselves obligated to, you know, kiss.\n\n“Oh God, that was probably the most humiliating thing that’s ever happened to me,” she told Ryan Seacrest. “We were watching and I thought it was funny, and they were showing little elderly couples and it was so cute. And all of a sudden we’re both looking up and we come on [the screen] and it’s like… it was so awkward. It was so weird. I mean you have to kiss, right?”\n\nNovember 2012: Selena & Justin Break Up\n\nThe Associated Press confirmed Gomez and Bieber went their separate ways, with other outlets reporting that \"distance\" and \"busy schedules\" were the reason for the split heard 'round the pop world.\n\nApril 2013: A Snuggly Snapshot\n\nRumors swirled about the couple revisiting their romance, but some seemingly concrete evidence came when Bieber shared a shirtless Instagram photo in which he was being embraced by his ex.\n\n\"'You've been makin music for too long babe come cuddle' -her,\" he captioned the picture.\n\nMay 2013: A GIFable Moment\n\nAfter another awards show round, a brief backstage happening made its rounds around the internet.\n\nGomez and Bieber were spotted sharing a quick kiss. Meanwhile, Gomez's bestie Taylor Swift reacted to the scene by turning away and sticking her tongue out.\n\ni hope taylor gives selena THAT LOOK after seeing her with justin again pic.twitter.com/6xLHVs3oPI — • (@Splasharesongs) October 29, 2017\n\nJanuary 2014: Some Quality Time Together\n\nAfter a quiet period, the pair was spotted by TMZ casually riding Segways together in Calabasas. Bieber also shared a photo of the two on Instagram with the caption \"love the way you look at me.\"\n\nEarly November 2014: The Power of 'The Heart Wants What It Wants'\n\nLikely inspired by her relationship with Bieber, Gomez dropped a personal new song along with a music video.\n\nOpening \"The Heart Wants What It Wants,\" a emotional voiceover from Gomez said, \"I know him though, and I know that I know his heart, and I know what he wouldn't do to hurt me. But I didn't realize that I'm feeling so confident and feeling so great about myself and then it [can] just be completely shattered by one thing. By something so stupid. But then you make me feel crazy, you make me feel like it's my fault. I was in pain.\"\n\nMeanwhile, Bieber posted a quote on Instagram that was interpreted to be his response: \"Sometimes love isn't a feeling but a choice.\" He added, \"It's easy to love when you feel it, but love when it's hard to love.\"\n\nMid-November 2014: Justin Unfollows Selena on Instagram\n\nIt was unclear what drama caused him to do this, but fans certainly took notice when Bieber stopped following Gomez on Instagram.\n\nSome speculated that he wasn't thrilled by the cozy photo she'd posted with her \"The Heart Wants What It Wants\" music video co-star. \"I think [Justin] was a little jealous of the video guy at first,\" the singer had previously told Ryan Seacrest.\n\nJune 2015: 'Where Are U Now,' Selena?\n\nIn the video for Bieber's \"Where Are U Now\" collaboration with Skrillex and Diplo, Selena's name clearly makes a cameo.\n\n\"Justin wrote this record during a tough time in his life and it comes to us that sometimes, as artists, we are also just objects and we have to take that as much as we have to use that to create,\" Skrillex and Diplo said in a statement.\n\nSeptember 2015: Justin's 'What Do You Mean' Video References Selena\n\nBieber may have been reaching out to Selena in his \"What Do You Mean\" music video.\n\nSome super observant fans noticed that her name was spray-painted on a wall of graffiti in the clip for the song, in which he sings lines like \"First you wanna go to the left then you wanna turn right/ Wanna argue all day, make love all night.\"\n\nSelena Gomez's name is spray painted on a wall in Justin Bieber's \"What Do You Mean\" music video. #Jelena pic.twitter.com/c3boNK8HMl — klaroline hooligan (@perhapsonedaykc) September 1, 2015\n\nEarly October 2015: Selena Says She's Found Closure\n\nThe singer opened up about her feelings toward her ex-boyfriend while doing press for her new album, Revival.\n\n“We’re on good terms,\" Gomez said in a Billboard cover story, but clarified that she was ready to focus on herself and her career: This is my time. I’ve deserved this. I earned it. This is all me.”\n\n“At this point, there is no anger,\" she said in an interview with Refinery29. \"There's closure in a very good, healthy way. We’ve seen each other. I'm always encouraging and I am proud of his journey.\n\nShe added: \"I think people are making it out to be something that is more tragic than it really was. We grew up together. We both made mistakes. That's it.\"\n\nMid-October 2015: A Justin & Selena Duet?\n\nOne night on OVO Sound Radio, an unreleased song that had the former couple trading vocals came out of nowhere. The track had lyrics about wanting to work things out in a relationship, and Bieber singing the line “Gotta be strong, strong, strong” in the chorus.\n\nIt turned out the song was written two years prior and wasn't meant to be released, but it sure had fans wondering what was going on at the time.\n\nMay 2015: A Mini Reunion\n\nThe two reportedly attended the same church service one weekend, and they were spotted being goofy in a Snapchat video posted by a preacher.\n\nAugust 2015: Selena Throws Some Shade on the 'Jelena' Obsession\n\nThe couple's relationship -- referred to as \"Jelena\" by many -- may have seen its downfall due to their young age and being overly exposed by the media, according to Gomez.\n\n\"It's difficult for people to separate us. The internet wants to freeze this moment in time and constantly repeat it,\" she told the U.K.'s Sunday Times.\n\n\"I didn't think I was doing anything bad by falling in love,\" the singer said. \"There's such an emphasis on people being the perfect thing and then destroying them because it's good press. Throw in the fact that you are a teenager -- it makes it more difficult.\"\n\nSeptember 2015: What Justin Learned\n\nWhile he didn't say her name, Bieber described his intense relationship with Gomez in an interview with Complex.\n\n\"I moved in with my girlfriend when I was 18,\" he said. \"Started my own life with her. It was a marriage kind of thing. Living with a girl, it was just too much at that age. But we were so in love. Nothing else mattered. We were all about each other.\n\n\"But when it’s like that and you get your value from that, people will always disappoint you,\" he went on. \"Your girl or your dude, they’re always going to disappoint you. Your full identity can’t be in that person. My identity was in her. Her identity was in me. When stuff would happen, I would lose my freakin’ mind, and she would lose her mind, and we would fight so hard because we were so invested in each other. Love is a choice. Love is not a feeling. People have made it seem in movies that it’s this fairy tale. That’s not what love is. You’re not gonna want to love your girl sometimes but you’re gonna choose to love her. That’s something in life that I had to figure out.\"\n\nEarly November 2015: 'A Love That Never Really Dies'\n\nIn a Billboard cover story, Bieber proclaimed, \"When you love someone that much, even if something comes between you, it’s a love that never really dies.\"\n\nIn an interview with Access Hollywood around the same time period, he admitted that at least three of the tracks on his Purpose album were about Gomez. On an Ellen appearance, he revealed the titles of those songs -- \"Sorry,\" \"What Do You Mean\" and \"Mark My Words\" -- and mused that someday they \"could maybe come together and make an awesome duo\" once again.\n\n\"It was really tough. I don't know if I'm over it yet,\" Bieber said of their breakup at the time.\n\n\"[She] is someone I love dearly,\" he went on. \"I'm never going to stop loving her. I'm never going to stop checking in on her. I don’t think if you end a relationship, you should end that, unless it was super toxic and you guys were hurting each other physically or mentally. We always respected each other and we still respect each other.\"\n\n\"I don’t know what happens. I don't know what is going to happen in the future. I think we both gotta do some soul searching ourselves and figure out ourselves before we can just try to figure out each other,\" he added.\n\nLate November 2015: Selena's Still His Sunshine on a Cloudy Day\n\nOver a year after they were last seen out in public with one another, Bieber made a crystal clear statement when he serenaded his former flame with \"My Girl\" at a hotel bar. The pair reportedly left together, according to footage captured by TMZ.\n\nDecember 2015: Justin Gets Nostalgic on Instagram\n\nBieber advised everyone to \"calm down\" when he posted some cute throwback photos from his dating days with Gomez, including one of the two of them on a red quadbike, and another of the couple holding hands a movie premiere.\n\nJust a throwback calm down A post shared by Justin Bieber (@justinbieber) on Dec 1, 2015 at 7:03pm PST\n\nCrazy throwback A post shared by Justin Bieber (@justinbieber) on Dec 5, 2015 at 11:25pm PST\n\nJanuary 2016: Selena Is So Over Talking About Her Ex\n\nThe \"Same Old Love\" singer got straight to the point when Rolling Stone asked her about Bieber.\n\n\"Honestly, what I would love to be printed is that I am so beyond done with talking about that, and him,\" she responded. 'Nuff said.\n\nFebruary 2016: They're on Friendly Terms\n\n\"We don't talk often, but we're cordial. If she needs something, I'm there for her. If I need something, she's there for me,\" Bieber said of his ex in an interview with GQ. During the same period, Gomez congratulated him on winning a Grammy for \"Where Are U Now\": “I’m very happy for him. Honestly, so cool,\" she said.\n\nMarch 2016: Justin Lets Us in on All the 'Feels'\n\nThrowing it back yet again, Bieber showed everyone he was still thinking about his romance with Gomez by posting an old photo of the former couple locking lips.\n\nThe intimate picture would go on to become the most-liked picture on Instagram at the time.\n\nFeels A post shared by Justin Bieber (@justinbieber) on Mar 19, 2016 at 4:07pm PDT\n\nJuly 2016: Justin's Mom Wishes Selena a Happy Birthday\n\nBieber probably isn't singing about Gomez on \"Love Yourself,\" since his mama clearly does like her. On Gomez's birthday, Pattie Mallette (Bieber's mom) wished the singer a happy birthday, along with a very pleasant message: \"I am blessed to know you @selenagomez & celebrate this precious day you were born!\"\n\nI am blessed to know you @selenagomez & celebrate this precious day you were born! Don't let them get to you. Keep UR peace & joy #LoveWins — Pattie Mallette (@pattiemallette) July 22, 2016\n\nAugust 2016: Justin Leaves Instagram\n\nAfter threatening to make his Instagram private if his followers didn't \"stop the hate\" about rumored girlfriend Sofia Richie, he went a step further and deactivated it completely.\n\nGomez, however, apparently sided with his Beliebers. She reportedly commented, “If you can’t handle the hate, then stop posting pictures of your girlfriend lol- It should be special between you two only. Don’t be mad at your fans. They love you and supported you before any one ever did.”\n\nJanuary 2017: Justin's Not a Weeknd Fan\n\nWhile word was getting out that Gomez had started dating The Weeknd, Bieber didn't have anything nice to say about it. When asked if he listens to the rapper's music, Bieber replied, \"Hell no I can’t listen to a Weeknd song. That shit's wack.\"\n\nOctober 2017: Back to Breakfast\n\nFollowing reports that Gomez and The Weeknd broke up, she was seen meeting Bieber for breakfast and going to church with him. Of course, this got people wondering whether they're just friends who are reconnecting, or if their relationship will begin again.", "images": ["https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?4863e69cb9d656c61185", "https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/justin-bieber-selena-gomez-05-11-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg"], "top_img": "https://static.billboard.com/files/media/justin-bieber-selena-gomez-05-11-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.billboard.com/articles/columns/pop/8015200/selena-gomez-justin-bieber-relationship-timeline", "title": "Selena Gomez & Justin Bieber: A Timeline of Their Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2017-10-31T14:03:01-04:00", "published_time": "2017-10-31T00:29:59-04:00"}, "description": "Selena Gomez and Justin Bieber's on-again, off-again relationship is making headlines once again. Check out a play by play of the couple's relationship -- at least, the parts that have been made public.", "og": {"description": "Selena Gomez and Justin Bieber's on-again, off-again relationship is making headlines once again. Check out a play by play of the couple's relationship -- at least, the parts that have been made public.", "image": {"identifier": "https://static.billboard.com/files/media/justin-bieber-selena-gomez-05-11-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Selena Gomez & Justin Bieber Relationship Timeline | Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/pop/8015200/selena-gomez-justin-bieber-relationship-timeline", "site_name": "Billboard"}, "title": "Selena Gomez & Justin Bieber: A Timeline of Their Relationship", "twitter": {"card": "summary_large_image", "description": "Selena Gomez and Justin Bieber's on-again, off-again relationship is making headlines once again. Check out a play by play of the couple's relationship -- at least, the parts that have been made public.", "image": "https://static.billboard.com/files/media/justin-bieber-selena-gomez-05-11-billboard-1548-1024x677.jpg", "title": "Selena Gomez & Justin Bieber: A Timeline of Their Relationship", "site": "@billboard"}}, "movies": [], "publish_date": 1509424199.0, "source": "http://www.billboard.com", "summary": ""}