{"url": "www.inquisitr.com/4936378/meryl-streep-nicole-kidman-feud-on-big-little-lies-set-reports-closer-weekly/", "text": "There’s a feud brewing behind-the-scenes on the Season 2 set of the HBO series, Big Little Lies, and it’s between two much-adored actresses.\n\nAn insider told Closer Weekly that original series star Nicole Kidman and show newcomer Meryl Streep are just not getting along, and it is affecting everyone working on the project.\n\nEven though the series leads, Kidman, Reese Witherspoon, Shailene Woodley, Zoë Kravitz, and Laura Dern, have consistently promoted female power throughout the promotion of the series and awards season, it seems as if jealousy may still be rearing its ugly head.\n\n“Nicole feels she’s the star of the show and is threatened by Meryl,” the source revealed to Closer. “Meryl’s picked up on it and the two have really gotten into it…. [They had] an epic falling-out.”\n\nKidman, 50, won multiple awards for her portrayal of Big Little Lies‘ Celeste Wright, including an Emmy, a Golden Globe, and a Screen Actors Guild award. She has only one Oscar though, which was for her role in The Hours.\n\nMeanwhile, 58-year-old Streep is highly revered in Hollywood and has been nominated for an Oscar an outstanding 21 times, with three total wins. She officially joined the cast in January, playing Mary Louise Wright, the mother-in-law of Kidman’s character, who has come to town to make sure her grandchildren are okay following the death of their father/her son, played in Season 1 by Alexander Skarsgård.\n\nWhen it was first announced that Streep would be joining the series, Kidman posted a photo of the two of them together to her Instagram page and said, “Welcome to the [Big Little Lies] family Ms. Streep — can’t wait.”\n\nIf the rumors are true though, somewhere along the line, something changed.\n\n“Their feud is affecting the entire series,” the Closer source said. “Tension on the set is at an all-time high.”\n\nOne factor that may be playing a role in the on-set tension is salary.\n\nFor the first season of Big Little Lies, sources told the Hollywood Reporter that Kidman and Witherspoon each received between $250,000 and $350,000 per episode, along with executive producer fees.\n\nEven though their Season 2 per episode rate has reportedly gone up to $1 million, Streep will make around $800,000 per episode, according to Variety, which is way more than Kidman received during her first year on the HBO series.\n\nPossibly trying to stop these rumors from spreading, Witherspoon posted a picture to Instagram of herself, Kidman, Streep, and Woodley smiling all together at a bowling alley last week.\n\n“We work and we play! Bowl-a-Rama party with the ladies of [Big Little Lies],” she captioned the pic.\n\nBased on the novel, Big Little Lies, by Liane Moriarty, David E. Kelley originally created and wrote HBO’s take on the book as a limited series. After quickly becoming a favorite of both critics and TV viewers, and winning a slew of prestigious awards, HBO announced in December that it would air a second season of the drama, slated to premiere sometime in 2019.\n\n“The way things are going, who knows if there will be a third season?” the Closer source said.", "images": ["https://secure.gravatar.com/avatar/343f6a73aa5158542acf6b7d375ce501?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/06/MerylStreep-NicoleKidman-Edit.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Cheryl A. Hoahing"], "canonical_link": "https://www.inquisitr.com/4936378/meryl-streep-nicole-kidman-feud-on-big-little-lies-set-reports-closer-weekly/", "title": "Meryl Streep And Nicole Kidman Feud On ‘Big Little Lies’ Set, Reports ‘Closer Weekly’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}