{"url": "https://qz.com/1142420/matt-lauer-fired-from-nbc-news-everything-we-know-about-sexual-misconduct-allegations-against-the-today-host/", "text": "Update Nov 30 at 7:50am ET: Matt Lauer issued an apology on the morning of Nov. 30. More details are below.\n\nNBC fired Matt Lauer, co-anchor of the Today show, on Nov. 29 after executives learned of allegations of sexual misconduct.\n\nThe storm created in the wake of October’s revelations of allegations of harassment and assault against studio executive Harvey Weinstein is continuing to spread across industries. Lauer is the latest powerful man—along with Kevin Spacey, Charlie Rose, and Mark Halperin, to name a few—to see his career cut short amid accusations of sexual harassment. But he’s unlikely to be the last.\n\nSeveral news organizations, including Variety and the New York Times, had been investigating Lauer for weeks. NBC, which was aware of Variety’s story, terminated Lauer hours before the piece dropped. The New York Times, which has been covering the fallout, has since updated its main story 14 times (as of this publishing), with details from several women (paywall), including one of the latest complaints filed with NBC.\n\nHere’s what we know so far:\n\nThe termination caught the staff off guard\n\nNBC staffers learned Lauer was fired about 34 hours after a woman and her lawyer visited NBC’s headquarters in New York and spoke with company executives for several hours, reports the New York Times.\n\nThe staff of the Today show only learned that Lauer was being fired at about 4am, shortly before making the official announcement on air at 7am local time Wednesday.\n\nNBC News chairman Andy Lack sent out the following memo to staff, which was then read by Savannah Guthrie and Hoda Kotb, who stepped in as a substitute host, on the Today show:\n\nDear Colleagues, On Monday night, we received a detailed complaint from a colleague about inappropriate sexual behavior in the workplace by Matt Lauer. It represented, after serious review, a clear violation of our company’s standards. As a result, we’ve decided to terminate his employment. While it is the first complaint about his behavior in the over twenty years he’s been at NBC News, we were also presented with reason to believe this may not have been an isolated incident. Our highest priority is to create a workplace environment where everyone feels safe and protected, and to ensure that any actions that run counter to our core values are met with consequences, no matter who the offender. We are deeply saddened by this turn of events. But we will face it together as a news organization – and do it in as transparent a manner as we can. To that end, Noah [Oppenheim, NBC News president] and I will be meeting with as many of you as possible throughout the day today to answer your questions. Andy\n\nNBC has received two more complaints since\n\nIn his memo, Lack said the “detailed complaint” was the first the company had received in over 20 years. The woman whose complaint led to the firing is represented by the law firm Wilkenfeld, Herendeen & Atkinson (paywall). More details are likely to emerge soon. Though she said she is not yet ready to share her story publicly, she has met with reporters from the Times.\n\nAfter Lauer’s firing, NBC received at least two more complaints.\n\nThe New York Times spoke with one of the women who filed the recent complaints. The details of the other have not been reported.\n\nMatt Lauer has issued an apology\n\nOn the morning of Nov. 30, Variety’s follow-up story included a statement from Lauer released by his publicist. “Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed,” he said.\n\nThe full statement from Variety:\n\n“There are no words to express my sorrow and regret for the pain I have caused others by words and actions. To the people I have hurt, I am truly sorry. As I am writing this I realize the depth of the damage and disappointment I have left behind at home and at NBC. Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed. I regret that my shame is now shared by the people I cherish dearly,” Lauer said in a statement that was released by a personal publicist and formed the bulk of the top story on “Today” Thursday morning. “Repairing the damage will take a lot of time and soul searching and I’m committed to beginning that effort. It is now my full time job. The last two days have forced me to take a very hard look at my own troubling flaws. It’s been humbling. I am blessed to be surrounded by the people I love. I thank them for their patience and grace.”\n\nDetails from the latest accuser\n\nThe New York Times reports that one of the two additional women who accused Lauer of sexual misconduct had started as a producer for the Today show in the late 1990s.\n\nShe had described uncomfortable moments over the years, such as Lauer asking if she had ever cheated on her husband or him sitting uncomfortably close to her during a car ride to the airport, according to the report.\n\nThe incident in question took place in 2001, when Lauer reportedly asked the woman, who was then in her early 40s, to talk about a story in his office during work hours. He then locked the room. The New York Times describes the series of events that allegedly took place after (paywall):\n\nThe woman said Mr. Lauer asked her to unbutton her blouse, which she did. She said the anchor then stepped out from behind his desk, pulled down her pants, bent her over a chair and had intercourse with her. At some point, she said, she passed out with her pants pulled halfway down. She woke up on the floor of his office, and Mr. Lauer had his assistant take her to a nurse.\n\nThe Times said Lauer’s representatives did not respond to requests for comment.\n\nHe allegedly locked women in his office\n\nLauer was afforded plenty of privacy in his office. Not only was the location secluded, but he had a button under his desk that allowed him to lock his door remotely.\n\nNBC employees told the New York Times this was a “regular security measure” (paywall) for high-profile employees (Lauer’s salary is reportedly $25 million annually), but two women who spoke to Variety said this allowed him to initiate contact with female employees with the reassurance he wouldn’t be caught in the act.\n\nVariety reports that in another incident, he had dropped his pants and exposed his penis to another female employee in his locked office.\n\nHe allegedly summoned women to his hotel room while covering the Olympics\n\nLauer reportedly used his business travel, including covering several Olympic Games, as opportunities to lure women into his hotel room. During one trip, he allegedly asked a female producer to deliver a pillow to his hotel room. Variety notes that he later told colleagues his wife “accompanied him to the London Olympics because she didn’t trust him to travel alone.”\n\nHe was known for regularly making lewd comments around female staff\n\nIn addition to being fixated with their bodies and appearances, Lauer was reportedly known for making inappropriate remarks at work, sometimes asking female producers about their sexual history and “offering to trade names,” reports Variety.\n\nIn one comment, he had said he “wanted some milk” (paywall) when referring to a woman’s chest, which was heard by multiple people over an audio feed, according to the New York Times.\n\nHe would also make vulgar comments over text messages. Variety reports he had compared a colleague’s performance in bed to her work.\n\nOnce, when he allegedly gifted a female colleague a sex toy, he included ”an explicit note about how he wanted to use it on her,” according to Variety.\n\nLauer also reportedly enjoyed playing the game “fuck, marry, or kill,” using that as an opportunity to talk about female hosts he’d like to have sex with.\n\nHe exploited his power at the network\n\nIn Variety, a former colleague summed up how powerful men like Lauer can prey on women working for them:", "images": ["https://cms.qz.com/wp-content/uploads/2020/03/QZ-DB-avatar-1.png?w=40&h=40&crop=1&strip=all&quality=75", "https://cms.qz.com/wp-content/uploads/2017/11/matt-lauer-today-sexual-misconduct.jpg?quality=75&strip=all&w=410&h=231", "https://cms.qz.com/wp-content/uploads/2017/11/matt-lauer-today-sexual-misconduct.jpg?quality=75&strip=all&w=1400"], "top_img": "https://cms.qz.com/wp-content/uploads/2017/11/matt-lauer-today-sexual-misconduct.jpg?quality=75&strip=all&w=1400", "keywords": [], "authors": ["Alice Truong"], "canonical_link": "https://qz.com/1142420/matt-lauer-fired-from-nbc-news-everything-we-know-about-sexual-misconduct-allegations-against-the-today-host/", "title": "Matt Lauer fired from NBC News: Everything we know about sexual misconduct allegations against the Today host — Quartz", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=5", "og": {"locale": "en_US", "description": "Lauer is the latest of powerful men whose careers have been cut short amid accusations of sexual harassment and assault in their industries.", "image": "https://cms.qz.com/wp-content/uploads/2017/11/matt-lauer-today-sexual-misconduct.jpg?quality=75&strip=all&w=1400", "title": "Everything we know about sexual misconduct allegations against Matt Lauer", "type": "article", "url": "https://qz.com/1142420/matt-lauer-fired-from-nbc-news-everything-we-know-about-sexual-misconduct-allegations-against-the-today-host/", "site_name": "Quartz"}, "application-name": "Quartz", "theme-color": "#000000", "apple-mobile-web-app-title": "Quartz", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "msapplication-window": "width=1024;height=768", "msapplication-tooltip": "Global business news and insights", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://cms.qz.com/wp-content/uploads/2020/04/qz-icon.jpg?w=144&h=144&crop=1&strip=all&quality=75", "msapplication-square70x70logo": "https://cms.qz.com/wp-content/uploads/2020/04/qz-icon.jpg?w=70&h=70&crop=1&strip=all&quality=75", "msapplication-square150x150logo": "https://cms.qz.com/wp-content/uploads/2020/04/qz-icon.jpg?w=150&h=150&crop=1&strip=all&quality=75", "msapplication-wide310x150logo": "https://cms.qz.com/wp-content/uploads/2020/04/qz-icon.jpg?w=310&h=150&crop=1&strip=all&quality=75", "msapplication-square310x310logo": "https://cms.qz.com/wp-content/uploads/2020/04/qz-icon.jpg?w=310&h=310&crop=1&strip=all&quality=75", "google-site-verification": "s3UlsLX3rTzf6Zh3P-bFlB0KcMuM1gKAPYrMm5icDK8", "news_keywords": "Hoda Kotb,Andy Lack,Ann Curry,Savannah Guthrie,mark halperin,30 rock,Today Show,NBC News,Kevin Spacey,Matt Lauer,sexual misconduct,harvey weinstein,NBC,office,workplace,sexual assault,sexual harassment,#MeToo", "article": {"publisher": "https://www.facebook.com/quartznews"}, "author": "Alice Truong", "twitter": {"card": "summary_large_image", "creator": "@alicetruong", "image": "https://cms.qz.com/wp-content/uploads/2017/11/matt-lauer-today-sexual-misconduct.jpg?quality=75&strip=all&w=1400", "site": "@qz", "url": "https://qz.com/1142420/matt-lauer-fired-from-nbc-news-everything-we-know-about-sexual-misconduct-allegations-against-the-today-host/"}, "description": "Lauer is the latest of powerful men whose careers have been cut short amid accusations of sexual harassment and assault in their industries."}, "movies": [], "publish_date": null, "source": "https://qz.com", "summary": ""}