{"url": "https://en.wikipedia.org/wiki/Tristan_Thompson", "text": "Canadian professional basketball player\n\nTristan Trevor James Thompson (born March 13, 1991) is a Canadian professional basketball player for the Cleveland Cavaliers of the National Basketball Association (NBA). He played one season of college basketball for Texas before being drafted fourth overall by the Cavaliers in the 2011 NBA draft.[1] He also represents Canada in international competition. Thompson won an NBA championship with the Cavaliers in 2016.\n\nHigh school career\n\nBorn in Brampton, Thompson attended St. Marguerite d'Youville Secondary School in Brampton for his freshman year. After driving from Brampton twice to visit a prep school in the United States, Thompson decided to attend Saint Benedict's Preparatory School in Newark, New Jersey for his sophomore year along with fellow University of Texas at Austin commit Myck Kabongo. He cited the increase in exposure and skill level as his reason for transferring.[2]\n\nThompson spent his sophomore and half his junior year at St. Benedict's, making an immediate impact and showing flashes of brilliance.[3] In his short time there, he shot through the ranks to super-stardom, becoming the top recruit in the nation entering his junior season.[4] The nation's top basketball programs heavily sought Thompson, who made the first verbal commitment of the class of 2010 to Rick Barnes and the Texas Longhorns.[5]\n\nTwenty-one games into his junior year, the relationship between Thompson and then-St. Benedict's coach Dan Hurley hit a rough patch. Hurley's in-your-face, no-holds-barred coaching style took a toll on the young star. During a game against then-top-ranked Mater Dei, Hurley confronted Thompson during a time out. A heated debate ensued, and Thompson was sent off the court and later removed from the team.[6] Over the next few days he made it known that he was planning to leave, resulting in a barrage of calls from top prep schools throughout North America trying to acquire his services. The next week he transferred to Findlay Prep with his close friend and AAU teammate Cory Joseph.[7][8]\n\nThompson joined Findlay on the back end of their schedule, making an immediate impact on the team and thriving under Findlay coach Michael Peck's system and coaching style. Thompson solidified his top recruit status and helped lead Findlay to their first National Championship. He continued to round and polish his skills his senior year in preparation for college and held fast to his commitment to the University of Texas, officially signing his letter of intent on November 11, 2009.[9] Thompson then led his team to another National Championship at the ESPN National High School Invitational.[10] After their senior year, Thompson and Joseph both committed to Texas and were the fourth and fifth Canadians to be named McDonald's All-Americans, after Bill Wennington (1981), Barry Bekkedam (1986) and Olu Famutimi (2003).[11] Thompson was also named a Jordan Brand Classic All-American.[12]\n\nCollege career\n\nThompson averaged 13.1 points and 7.8 rebounds per game for the Texas Longhorns in 2010–11 as he won the team's Most Valuable Player award, as voted on by his teammates. Nationally, Thompson was one of five finalists for the Wayman Tisdale Award, an honor given to the National Freshman of the Year by the U.S. Basketball Writers Association. Thompson won the Big 12 Freshman of the Year honours as well as first-team NABC All-District 8 and USBWA All-District VII honours.[13] He led the team in rebounding, blocked shots (86), double-doubles (10) and field goal percentage (.546) while ranking second in scoring. He helped Texas conclude the 2010–11 season with a 28–8 record and advanced to the NCAA Tournament Round of 32. The Longhorns finished No. 8 in the final AP poll.[14]\n\nThompson told media after the NCAA tournament that he planned to return to Texas for his sophomore season but changed his mind.[15] On April 21, 2011, he declared for the NBA draft, forgoing his three years of college eligibility.[16]\n\nProfessional career\n\nNBA draft\n\nOn June 23, 2011, Thompson was drafted fourth overall in the 2011 NBA draft by the Cleveland Cavaliers. At the time, he was the highest drafted Canadian-born player in NBA history,[17] that was until Anthony Bennett and Andrew Wiggins were selected with the first overall pick in 2013 and 2014, respectively. Thompson continued to make history, drafted alongside Joseph, who was picked 29th by the San Antonio Spurs, one of only two occasions in NBA history that two Canadians were selected in the first round of the same draft, the other being in 1983 when Leo Rautins and Stewart Granger were selected 17th and 25th respectively.[18] The 2011 draft was also the first time three Texas Longhorn basketball players went in the first round of a draft, when Thompson's former collegiate teammate Jordan Hamilton went 26th overall to the Dallas Mavericks.[19][20]\n\nCleveland Cavaliers (2011–present)\n\n2011–12 season: Rookie season\n\nThompson during his rookie season in 2012\n\nDuring the 2011 NBA lockout, Thompson attended classes at the University of Texas to finish his college degree.[21] Thompson signed his rookie contract with the Cavaliers on December 9, 2011 before the start of training camp.[22] Thompson made his professional debut against his hometown Toronto Raptors on December 26, 2011. In 17 minutes off the bench, Thompson scored 12 points and pulled in 5 rebounds.[23] Thompson came off the bench behind veteran forwards Antawn Jamison and Anderson Varejão for the first three months of his rookie season but still managed to make his presence known on both ends of the court. His production increased in February as his minutes increased, and he recorded three double-doubles that month. His best performance in February was a 15-point, 12-rebound, two-block effort in 30 minutes of play as the Cavaliers defeated Sacramento 93–92. Both Thompson and teammate Kyrie Irving were later named to the 2012 Rising Stars Challenge. However, Thompson was selected to play for Team Shaq, while Irving was selected by Team Chuck.\n\nThompson was inserted into the starting lineup on March 18 against Atlanta as Varejao continued to recover from a fractured wrist. He recorded seven points and six rebounds. The turning point of his season came in the following game against New Jersey, when he posted a 27-point, 12-rebound performance in a 105–100 road win. After Varejao was ruled out indefinitely, head coach Byron Scott decided to start Thompson at centre for the remainder of the regular season.[24] Thompson did not disappoint, upping his averages to 9.3 points, 7.5 rebounds and just under one block per game as a starter. He shone in April even with Cleveland out of the playoff race, scoring in double figures in 10 of his final 16 games and blocking a season-high four shots against Memphis on April 23. He finished the season with averages of 8.2 points and 6.5 rebounds in 60 games as he earned NBA All-Rookie second team honours, becoming the first Canadian to ever earn All-Rookie team honours in the NBA.\n\n2012–13 season\n\nIn the 2012–13 season, Thompson worked on avoiding getting his own shots blocked, and switched his shooting hand from left to right.[25] For most of the season, almost 17%, or one out of six, of his shots were blocked,[a] threatening former NBA player Danny Fortson's 16.7% rate in 1997–98. Thompson dropped to around 15% by season's end, which was only reached by three other players before the season.[b][26] He went on to average 3.7 offensive rebounds per game, which ranked fifth in the NBA and first among second year players, and set the Cavaliers franchise record for most offensive rebounds in a single season with 306 (second in the NBA), surpassing Zydrunas Ilgauskas' 299 offensive rebounds in the 2004–05 season. He also recorded a team-high 31 double-doubles on the season, becoming just the ninth player in franchise history to total at least 30 double-doubles in a single season. He started all 82 games in 2012–13 as he averaged 11.7 points on .488 shooting, 9.4 rebounds and 0.9 blocks in 31.3 minutes per game.[27]\n\n2013–14 season\n\nIn the 2013 off-season, Thompson decided to switch his shooting hand to his right instead of his left.[28] Despite the change, he had an almost identical season for the Cavaliers in 2013–14, as he started all 82 games while averaging 11.7 points and 9.2 rebounds in 31.6 minutes per game. He tied for fifth in the Eastern Conference with a team-leading and career-best 36 double-doubles.[27]\n\n2014–15 season\n\nDuring the 2014 off-season, the Cavaliers acquired All-Star forwards LeBron James and Kevin Love. Thompson came off the bench for most of the season, providing energy and solidifying his place as one of the best offensive rebounders in the league, averaging 8.5 points and 8 rebounds per game. He played in all 82 games and started 15. The Cavaliers finished with a 53–29 record and made the playoffs for the first time since 2010. Early in the first round, Kevin Love dislocated his shoulder and was ruled out for the rest of the post-season. Thompson became the starter after Love's injury and helped the Cavaliers reach the 2015 NBA Finals. The Cavaliers faced the Golden State Warriors, and lost the series in six games. During the playoffs, Thompson emerged as one of the NBA's best rebounders, especially on the offensive glass. He became a restricted free agent after the season.[29]\n\n2015–16 season: Championship season\n\nOn October 22, 2015, Thompson re-signed with the Cavaliers on a five-year, $82 million contract, ending a four-month contract stalemate that caused Thompson to miss training camp, the preseason, and the FIBA Americas Championship.[30][31][32] Throughout the 2015–16 season, Thompson shared the starting center role with Timofey Mozgov. On January 25, 2016, he recorded a season-high 19 points and 12 rebounds in a 114–107 win over the Minnesota Timberwolves.[33] On March 26, in a win over the New York Knicks, Thompson tied Jim Chones' franchise record by appearing in his 361st consecutive game for the Cavaliers.[34] He broke that record three days later, appearing in his 362nd consecutive game in a loss to the Houston Rockets.[35] Thompson helped the Cavaliers reach the NBA Finals for the second consecutive season. There they made NBA history by coming back from a 3–1 deficit against the Golden State Warriors to win the series in seven games, ending a 52-year championship drought in Cleveland.[36][37]\n\n2016–17 season\n\nOn December 26, 2016, in a loss to the Detroit Pistons, Thompson became the first player in franchise history to play in 400 consecutive regular-season games.[38] On April 5, 2017, Thompson missed the Cavaliers' game against the Boston Celtics with a sprained right thumb. Thompson's absence ended his streak of consecutive games played at 447—the longest in team history and the longest active streak in the league at the time.[39] He missed four games with the injury before returning to action in Cleveland's regular-season finale on April 12 against the Toronto Raptors.[40] Thompson helped the Cavaliers go 12–1 over the first three rounds of the playoffs to reach the NBA Finals for a third straight season. There the Cavaliers matched-up with the Golden State Warriors, but lost the series in five games.[41][42]\n\n2017–18 season\n\nOn November 2, 2017, Thompson was ruled out for three to four weeks with a left calf strain that he suffered the previous night against the Indiana Pacers.[43] On December 12, 2017, he played in his first game since November 1; he went scoreless and did not have a rebound in 6 minutes against the Atlanta Hawks.[44] On February 25, 2018, he had a season-high 13 rebounds in 23 minutes in a 110–94 loss to the San Antonio Spurs.[45] In Game 7 of the Cavaliers' first-round playoff series against the Pacers, Thompson, who played just 24 minutes in the first six games, made a rare start and had 15 points and 10 rebounds in a 105–101 win.[46] The Cavaliers made it to the 2018 NBA Finals, where they were swept by the Golden State Warriors.\n\n2018–19 season\n\nThompson in January 2019\n\nTo begin the season for the 6–21 Cavaliers, Thompson was averaging career highs in points (12.0) and rebounds (11.6) through 27 games.[47] However, on December 11, he was ruled out for two to four weeks with a left foot sprain.[48] He returned to action on January 2 against the Miami Heat after missing 10 games.[49] On March 20, against the Milwaukee Bucks, Thompson returned after missing 26 games with a sore left foot.[50]\n\n2019–20 season\n\nOn January 9, 2020, Thompson recorded a double-double with a career-high 35 points, 14 rebounds, three assists, three blocks and a steal in an 115–112 overtime win over the Detroit Pistons.[51]\n\nCareer statistics\n\nNBA\n\nRegular season\n\nYear Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 2011–12 Cleveland 60 25 23.7 .439 .000 .552 6.5 .5 .5 1.0 8.2 2012–13 Cleveland 82 82 31.3 .488 .000 .608 9.4 1.3 .7 .9 11.7 2013–14 Cleveland 82 82 31.6 .477 .000 .693 9.2 .9 .5 .4 11.7 2014–15 Cleveland 82 15 26.8 .547 — .641 8.0 .5 .4 .7 8.5 2015–16† Cleveland 82 34 27.7 .588 — .616 9.0 .8 .5 .6 7.9 2016–17 Cleveland 78 78 29.9 .600 .000 .498 9.2 1.0 .5 1.1 8.1 2017–18 Cleveland 53 22 20.2 .562 — .544 6.6 .6 .3 .3 5.8 2018–19 Cleveland 43 40 27.9 .529 — .642 10.2 2.0 .7 .4 10.9 Career 562 378 27.8 .519 .000 .610 8.6 .9 .5 .7 9.2\n\nPlayoffs\n\nYear Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 2015 Cleveland 20 15 36.4 .558 — .585 10.8 .5 .3 1.2 9.6 2016† Cleveland 21 21 29.6 .527 — .575 9.0 .7 .4 .9 6.7 2017 Cleveland 18 18 31.2 .587 — .667 8.3 1.4 .5 .7 8.2 2018 Cleveland 19 11 21.9 .590 .000 .741 5.9 .6 .1 .4 6.2 Career 78 65 29.8 .564 .000 .620 8.5 .8 .3 .8 7.7\n\nCollege\n\nYear Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 2010–11 Texas 36 34 30.7 .546 .000 .487 7.8 1.3 .9 2.4 13.1\n\nInternational career\n\nThompson represented his country and Canada Basketball at the FIBA Americas Under-18 Championship in 2008, where Canada won the bronze medal, placing behind Argentina and the United States.[52] Thompson once again competed for Canada at the 2009 FIBA Under-19 World Championship in Auckland, New Zealand.[53]\n\nAt the 2013 FIBA Americas Championship, Thompson averaged 11.6 points and 10.0 rebounds per game.[52] He also competed in the 2016 FIBA World Olympic Qualifying Tournament, and in 2018, he played one game in a qualifying tournament for the 2019 FIBA World Cup.[52][54]\n\nAwards\n\nPersonal life\n\nThompson is the oldest of four sons of Trevor and Andrea Thompson, who are from Jamaica.[56] His younger brother Dishawn played high school basketball for Wesley Christian High School in Allen, Kentucky, where he was a highly rated prospect.[57] He is also the cousin of former Virginia State University football standout and former Canadian Football League defensive tackle Jemal Thompson.[58] In 2013, Thompson founded the Amari Thompson Fund, which works closely with Epilepsy Toronto to raise funds and awareness to support those affected by epilepsy. Thompson's youngest brother Amari has the neurological disorder and experiences seizures almost daily due to his condition.[59][60][61]\n\nIn December 2016, Thompson's ex-girlfriend Jordan Craig gave birth to his first child, a son, Prince Tristan Thompson.[62]\n\nThompson was in a romantic relationship with Khloé Kardashian.[63] In April 2018, Kardashian gave birth to a daughter, True Thompson. Thompson was found to have cheated on Kardashian during her pregnancy.[64][65][66][67] In February 2019, Kardashian and Thompson split amidst rumors that Thompson had cheated on Kardashian with her younger half-sister Kylie Jenner’s best friend, Jordyn Woods.[68][69]\n\nSee also\n\nNotes\n\n^ The league average is 6.3% of shots being blocked. ^ Comparison limited to players who attempted at least 500 field goals in a season since 1997, the earliest for which NBA.com has data.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Tristan_Thompson_Cavs_vs_Wizards_%28cropped%29.jpg/150px-Tristan_Thompson_Cavs_vs_Wizards_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Tristan_Thompson_%2848885525837%29.jpg/220px-Tristan_Thompson_%2848885525837%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Tristan_Thompson_%2848885525837%29.jpg/1200px-Tristan_Thompson_%2848885525837%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Tristan_Thompson_against_the_Portland_Trail_Blazers_%28cropped%29.jpg/150px-Tristan_Thompson_against_the_Portland_Trail_Blazers_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sports_icon.png/31px-Sports_icon.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Tristan_Thompson_%2848885525837%29.jpg/1200px-Tristan_Thompson_%2848885525837%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tristan_Thompson", "title": "Tristan Thompson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Tristan_Thompson_%2848885525837%29.jpg/1200px-Tristan_Thompson_%2848885525837%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}