{"url": "https://popculture.com/reality-tv/2018/05/15/lauren-bushnell-says-theres-no-bad-blood-with-ex-ben-higgins/", "text": "Lauren Bushnell might not hold any grudges against ex-fiancé Ben Higgins, but she says they don’t keep in touch.\n\n“I feel like we’re in the same circle ,so obviously I’m sure we both see what the other is doing and are aware of that,” Bushnell, 28, told PEOPLE. “I mean, there’s no bad blood, but we don’t talk all that often.”\n\nBushnell revealed that she did text Higgins, 30, when he launched his Generous Coffee company.\n\n“I know that was something very important to him,” she said. “He had been working on it when we were together, so I shot him a text and congratulated him and all that. But other than a text here and there, not a lot. If I were to see him at an event like this or wherever, I don’t think it would be weird. I would love to say hello and congratulate him because he’s doing so many great things and kind of catch up. I think what we have going is working, and I think we both wish each other the best.”\n\nBushnell and Higgins got engaged on season 20 of The Bachelor. After the reality dating show was over, Bushnell moved to Denver in April 2016 to be with her fiancé, and the two starred in a single season of their own own reality network series: Ben and Lauren: Happily Ever After?\n\nThe pair announced their split in May 2017, and Bushnell said it’s been “incredibly bizarre” seeing how much her life has changed just one year later.\n\n“Just looking back at the last few years, it is kind of overwhelming to sit down and think about it, because so much has changed and I’ve been through so much,” she said. “I’ve had so many highs and so many lows, too. I think that’s what makes life so cool and beautiful, and I’m sure everyone can relate, but it’s interesting to think that it’s already been almost a year. Only like a year ago I was living in Denver, and now I’m back in Los Angeles, which is where I was living, and I feel like finally things have settled for me.”\n\n“I feel far less anxious and more settled and grounded and I feel like I’ve kind of got a little bit more of a hold on my life,” she continued. “For a while there it felt a little overwhelming so I’m happy and everything’s good.”\n\nThere's been a lot going on in her dating life, too. Bushnell has been dating her current boyfriend Devin Antin, a real-estate investor, since at least July 2017. The couple met prior to her stint on The Bachelor and remained friends before turning their relationship romantic.\n\n“We’ve known each other for a while, and obviously things are not perfect all the time, but I think what makes it work is we both are just very similar,” she said. “Our personalities are similar, our senses of humor are similar, and we both have an entrepreneurial mind. He makes me laugh, and we have fun together. I don’t know if there’s this perfect recipe for success, but I think if anything, the thing I appreciate most about him is that he is super supportive and he’s always pushing me to do things that maybe I wouldn’t have done, and again, he’s very much always in my corner supporting me.”\n\nPhoto credit: Instagram / Lauren Bushnell", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2018/05/15/lauren-bushnell-says-theres-no-bad-blood-with-ex-ben-higgins/", "title": "Lauren Bushnell Says There's 'No Bad Blood' With Ex Ben Higgins One Year After Breakup", "meta_data": {"description": "Lauren Bushnell might not hold any grudges against ex-fiancé Ben Higgins, but she says they don’t keep in touch.“I feel like we’re in the same circle ,so obviously I’m sure we both see what the other is doing and are aware of that,” Bushnell, 28, told PEOPLE. “I mean, there’s no [...]", "keywords": "The Bachelor,ABC", "news_keywords": "The Bachelor,ABC", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Lauren Bushnell Says There's 'No Bad Blood' With Ex Ben Higgins One Year After Breakup", "description": "Lauren Bushnell might not hold any grudges against ex-fiancé Ben Higgins, but she says they [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Lauren Bushnell Opens up About Relationship With Ex Ben Higgins After Breakup", "type": "article", "url": "https://popculture.com/reality-tv/2018/05/15/lauren-bushnell-says-theres-no-bad-blood-with-ex-ben-higgins/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Lauren Bushnell might not hold any grudges against ex-fiancé Ben Higgins, but she says they [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1526313600.0, "source": "https://popculture.com", "summary": ""}