{"url": "https://www.vox.com/culture/2017/7/20/15998474/caitlyn-jenner-aerosmith-dude-looks-like-a-lady-transphobia", "text": "Caitlyn Jenner is facing criticism after joking about one of Aerosmith’s most famous — and offensive — tunes.\n\nIn the caption of a July 18 Instagram photo of Jenner posing with Aerosmith lead singer Steven Tyler, Jenner teased that the pair is working on a duet of Aerosmith’s 1987 hit “Dude (Looks Like a Lady),” which Jenner called “one of my favorite songs!”\n\n@iamstevent and I are working on our duet for Dude Looks Like a Lady. One of my favorite songs! A post shared by Caitlyn Jenner (@caitlynjenner) on Jul 18, 2017 at 9:53am PDT\n\nThen, during an appearance on Jimmy Kimmel Live later that day, Jenner, who is a trans woman, told the story behind the snapshot and how she first came to view “Dude (Looks Like a Lady)” as her “theme song.”\n\nJenner revealed that the photo was taken “two nights ago” during a fundraiser in Minneapolis, Minnesota. Upon seeing Tyler perform, Jenner said she was compelled to go backstage, say hello, and tell the musician how much one of his songs had meant to her.\n\nAfter telling Kimmel that before she publicly came out as a trans woman in 2015, her life was full of “secrets” and “hiding,” she recalled her conversation with Tyler:\n\n“I said to Steven, ‘I have had some really, really tough times in my life. ... Every once in a while I would ... sneak out in the dark and drive around. And I always used to take your song, ‘Dude (Looks Like a Lady)’.”\n\nJenner further explained to Kimmel that “Dude (Looks Like a Lady)” became something of a personal anthem for her, “driving around in my little car with my little CD in there, whippin’ up the tunes and stuff. ... It made me feel good.”\n\nBut not every member of the LGBTQ community feels so warmly about the song.\n\nOriginally released in 1987, “Dude (Looks Like a Lady)” spent 20 weeks on the Billboard Hot 100 chart. It also experienced a second wind in 1993, after it was included on the soundtrack for the Robin Williams cross-dressing comedy Mrs. Doubtfire.\n\nHowever, despite the song’s mainstream success, Aerosmith has frequently been criticized for the lyrics and music video’s offensive insinuations about trans women.\n\nIn general, the lyrics blur the lines between being a trans woman, a cross-dressing man, or a man who simply has “feminine” traits. The song also plays on the idea that trans women intentionally deceive men or are “in disguise,” that they are unattractive or repulsive (as evidenced in one of the video’s first scenes where Steven Tyler recoils at the sight of a construction worker whose gender identity is purposely unclear), and at one point mixes pronouns, going from “Oh she like it” in one line to “Oh, he was a lady,” in the next.\n\nGiven the song’s backstory, the fact that it offends many people is hardly surprising.\n\nIn an 2012 interview with SongFacts, songwriter Desmond Child, who worked with Aerosmith on the contentious track, reveals that the song was based on Tyler’s experience of once mistaking Mötley Crüe vocalist Vince Neil for a woman at a bar. After realizing who he was, Tyler and his fellow band members joked about how the “dude looked like a lady.”\n\nDesmond goes on to share that he talked Aerosmith into the song’s story concept of “a guy that walks into a strip joint and falls in love with the stripper on stage, goes backstage and finds out it's a guy.” Though Desmond argues that “Dude (Looks Like a Lady” is “a very accepting song,” many people take issue with the reading that the trans woman stripper is “tricking” her customers, not to mention the suggestion that a trans woman is actually a man.\n\nTrans women have long been subject to harmful misconceptions of this nature. As a result, they experience “disproportionate violence and discrimination at the hands of both strangers and intimate partners,” according to the Human Rights Campaign.\n\nThough a representative of Jenner’s told HuffPost that there are currently no actual plans for Jenner and Tyler to record a duet, the song’s history and Jenner’s comment are still igniting heavy pushback from the LGBTQ community.\n\n“Don't keep doing things that perpetuate the false idea that trans women are actually men,” one Reddit user wrote. “It’s making things more dangerous for every one of us that isn't protected by having a bajillion dollars and being a public figure.”\n\nOn Twitter, people have called Jenner’s comments “irresponsible.”\n\nShe just doesn't get it, does she?\n\nOf all the songs in all Aerosmith repertoire in all the world, she had to choose this one #CaitlynJenner https://t.co/qACH6bXXGe — Mx Jigsaw (@MxJigsaw) July 19, 2017\n\nI can't help but feel like #CaitlynJenner's recent instagram post is super irresponsible pic.twitter.com/tuAg1Bf4Kf — Forbes (@forbuss) July 18, 2017\n\nSince coming out, several of Jenner’s public statements and stances as a celebrity trans activist have been criticized for being out of touch or simply offensive. This new controversy raises more concerns about how accurately and responsibly Jenner presents her own community, especially considering the danger that trans women face when the “realness” of their womanhood is challenged.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66672267/GettyImages_1210300377.0.jpg", "https://cdn.vox-cdn.com/thumbor/uNJvzKKArsa5eAY_ju8RBkjoKx4=/0x0:741x400/1200x800/filters:focal(141x66:259x184)/cdn.vox-cdn.com/uploads/chorus_image/image/55810049/Caitlyn_Jenner__Instagram.0.png", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66563937/GettyImages_1129912168.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66671897/shel_silverstein.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66672426/GettyImages_1187901752.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66672372/GettyImages_1210313287.0.jpg", "https://cdn.vox-cdn.com/thumbor/Gww3Z4Qcx_IXmDTA7I86OQftN18=/0x0:711x400/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55810047/Caitlyn_Jenner__Instagram.0.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66672024/1218646346.jpg.0.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/Gww3Z4Qcx_IXmDTA7I86OQftN18=/0x0:711x400/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55810047/Caitlyn_Jenner__Instagram.0.png", "keywords": [], "authors": ["Abbey White", "Dylan Matthews", "Riley Beggin", "Zeeshan Aleem", "Matthew Yglesias", "Constance Grady", "Emily Todd Vanderwerff", "Jul"], "canonical_link": "https://www.vox.com/culture/2017/7/20/15998474/caitlyn-jenner-aerosmith-dude-looks-like-a-lady-transphobia", "title": "Caitlyn Jenner is under fire for calling Aerosmith’s “Dude Looks Like a Lady” her theme song", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "article": {"publisher": "https://www.facebook.com/Vox", "published_time": "2017-07-20T16:20:02-04:00", "modified_time": "2017-07-20T16:20:02-04:00"}, "author": "Abbey White", "style-tools": "https://www.vox.com/style/community/441/dd55371d9ef76d5d505f37d268e3aefb/tools.css", "p": {"domain_verify": "d4410485bd6277c2bf2ce0f277819dc6"}, "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "The lyrics and story behind the song have some people labeling it transphobic.", "og": {"description": "The lyrics and story behind the song have some people labeling it transphobic.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/Gww3Z4Qcx_IXmDTA7I86OQftN18=/0x0:711x400/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55810047/Caitlyn_Jenner__Instagram.0.png", "height": 900, "width": 1600}, "site_name": "Vox", "title": "Caitlyn Jenner is under fire for calling Aerosmith’s \"Dude Looks Like a Lady\" her theme song", "type": "article", "url": "https://www.vox.com/culture/2017/7/20/15998474/caitlyn-jenner-aerosmith-dude-looks-like-a-lady-transphobia"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.vox.com/culture/2017/7/20/15998474/caitlyn-jenner-aerosmith-dude-looks-like-a-lady-transphobia", "title": "Caitlyn Jenner is under fire for calling Aerosmith’s \"Dude Looks Like a Lady\" her theme song", "description": "The lyrics and story behind the song have some people labeling it transphobic.", "image": "https://cdn.vox-cdn.com/thumbor/Gww3Z4Qcx_IXmDTA7I86OQftN18=/0x0:711x400/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55810047/Caitlyn_Jenner__Instagram.0.png", "site": "voxdotcom"}, "sailthru.title": "Caitlyn Jenner is under fire for calling Aerosmith’s \"Dude Looks Like a Lady\" her theme song", "sailthru.tags": "general,vox,front-page,celebrities,culture,identities,lgbtq", "sailthru.description": "The lyrics and story behind the song have some people labeling it transphobic.", "sailthru.date": "2017-07-20T16:20:02-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/Gww3Z4Qcx_IXmDTA7I86OQftN18=/0x0:711x400/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55810047/Caitlyn_Jenner__Instagram.0.png", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/m0uAoALTeMCJHDDLQoqItW7ZAY0=/0x0:400x400/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/55810047/Caitlyn_Jenner__Instagram.0.png", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/hub/sbnu_logo_minimal/441/touch_icon_ipad_retina_1000_yellow.755.png", "msapplication-TileColor": "#4f7177", "outbrainsection": "lgbtq"}, "movies": ["https://www.youtube.com/embed/nf0oXY4nDxE?rel=0&controls=2"], "publish_date": 1500480000.0, "source": "https://www.vox.com", "summary": ""}