{"url": "http://www.newslocker.com/en-us/news/celebrity/adam-levine-jokes-blake-shelton-has-three-balls-and-gwen-stefanis-reaction-is-priceless/", "text": "Reese Witherspoon and Lucy Hale Love to Wear This Hands-Free Bag Trend It’s no secret that we’re all trying to touch fewer things these days. That’s why it should come as no surprise that certain hands-free accessories, like fanny packs, have been on the uptick.\n\nRELATED: Reese Witherspoon, Jennifer Garner, and Taraji P. Henson All Agree on This Controversial Leggings Trend\n\nPeople certainly have their own opinions about the fanny pack, but the controversial throwback trend seems all the more relevant right now. And we’re not the only ones who Read more\n\nGianna Bryant, Alyssa Altobelli and Payton Chester Honored During WNBA Draft Gianna Bryant‘s dreams of being drafted into the WNBA came true on Friday, nearly three months after the tragic helicopter crash that killed the 13-year-old, her father Kobe Bryant and seven others.\n\nDuring the WNBA draft on Friday, commissioner Cathy Englebert named Gianna and her Mamba Academy teammates Alyssa Altobelli and Payton Chester, who also died in the crash, honorary draftees.\n\nEnglebert read out the three girls’ names just as she would announce any other draftee in a t Read more\n\nRunaway June's Jennifer Wayne Reveals She Was 'Rocked' by Coronavirus — and Will Be Donating Plasma Jennifer Wayne is opening up about her experience with the novel coronavirus and how she was able to fight off the illness.\n\nOn Wednesday, the Runaway June member revealed on Instagram that she had been “rocked” by the respiratory virus and was “struggling with whether or not to share” that she had contracted the disease.\n\nIn the post, the 38-year-old explained that she ultimately decided to go public with the news after having so many people reach out and to ask about her Read more\n\nIf You've Had Coronavirus, It's Still Best to Stay Home Until Experts Say It's Safe As governors begin to weigh lifting stay at home orders their states, there are still many unknowns about the new coronavirus, COVID-19, that are making experts wary of reopening the country.\n\nAs of April 17, there have been at least 667,945 COVID-19 cases in the U.S., though the true number is believed to be far higher due to the lack of available testing. While experts hope that the thousands of people who have recovered from the virus are now immune, they do not know for sure, and that’s Read more\n\nEven If You've Had Coronavirus, It's Best to Stay Home Until Experts Say It's Safe As governors begin to weigh lifting stay at home orders their states, there are still many unknowns about the new coronavirus, COVID-19, that are making experts wary of reopening the country.\n\nAs of April 17, there have been at least 667,945 COVID-19 cases in the U.S., though the true number is believed to be far higher due to the lack of available testing. While experts hope that the thousands of people who have recovered from the virus are now immune, they do not know for sure, and that’s Read more\n\nHow Jensen Ackles Introduced His Supernatural Costar Jeffrey Dean Morgan to Hilarie Burton Forget a match made in heaven — Jeffrey Dean Morgan and Hilarie Burton were a match made in an Irish pub.\n\nThe couple is launching a new weekly video-chat-based show on AMC, Friday Night in with the Morgans, filmed from their farm in upstate New York. In a sneak peek at the premiere posted by Entertainment Weekly, the stars welcome one of their first guests, Jensen Ackles.\n\nIn the clip, Ackles, 42, shares the story of how he introduced his former Supernatural costar Morgan to One T Read more\n\nBrews Brothers' Mike Castle Says He Was 'Enamored' with Wife Lauren Lapkus Before They Even Met Mike Castle is making his dreams come true one joke at a time.\n\nIn this week’s issue of PEOPLE, the Chicago native, 31, opens up about how he got his start in comedy, why his most recent role in Netflix’s Brews Brothers is a “dream come true,” and why he and his wife, actress and Orange Is the New Black star Lauren Lapkus, are the perfect match.\n\n“I grew up in Chicago and started doing improv at Second City when I was 13,” Castle tells PEOPLE. “I grew up i Read more\n\nWatch Shailene Woodley and Sebastian Stan Sing Karaoke Together During Late Night Out Shailene Woodley and Sebastian Stan are a karaoke match made in heaven!\n\nOn Thursday, Woodley, 28, shared on Instagram two videos of herself and Stan, 37, singing together while blowing off steam in-between takes of their new movie Endings, Beginnings. For the karaoke-filled night out, the costars belted both “Hungry Eyes” by Eric Carmen and the Cyndi Lauper hit “Time After Time.”\n\nThe scene partners showed off their vocals in the playful clips, with Stan at one point seemi Read more\n\nJulianne Hough Takes Walk with Actor Ben Barnes While Social Distancing in L.A. Julianne Hough is spending time with a friend amid the coronavirus pandemic.\n\nOn Thursday, Hough, 31, was spotted walking in her socks with Westworld actor Ben Barnes in Los Angeles. The actress wore all black and sunglasses as she toted her shoes in her hands, showing off her dog-patterned socks. Barnes, 38, walked beside Hough wearing a black shirt, shades and gray sweat shorts for the sunny outing. Hough and Barnes appear to have been friends for years; they posed together at HBO’s Emmys Read more\n\nCool Grandma! Judi Dench Dances in TikTok Challenge with her Grandson in Adorable Video Trendy social media dance moves are a piece of cake for Judi Dench!\n\nIn a recent appearance on her grandson Sam William‘s TikTok account, the 85-year-old Cats actress can be seen dancing along to the song “Cheryl” by Yung Gravy.\n\nSince the multigenerational family members are apart during the pandemic, Williams propped up an iPad that had Dench demonstrating the viral routine on the screen, while he synced up his moves standing in the background.\n\nAfter seamlessly hitting all Read more\n\nTaylor Swift Cancels All 2020 Live Appearances and Performances Due to Coronavirus Pandemic Taylor Swift has cancelled all upcoming live appearances and performances for the remainder of 2020.\n\nThe star — whose festival, Lover Fest, was originally scheduled to kick off in Los Angeles in July — announced the decision on Twitter Friday, citing concerns over the ongoing novel coronavirus (COVID-19) pandemic. Her U.S. and Brazil tour dates in support of her latest LP, Lover, will now take place in 2021.\n\n“I’m so sad I won’t be able to see you guys in concert thi Read more\n\nNo Joke! Joaquin Phoenix Almost Played Batman in a Scrapped Darren Aronofsky Superhero Film Joaquin Phoenix‘s comic book trajectory nearly played out much differently.\n\nIn a new interview with Empire, director Darren Aronofsky opened up about the scrapped big-screen Batman adaptation he was developing in the early 2000s, telling the British film magazine that he once pushed to have Phoenix play the comic book hero.\n\nWarner Bros., the studio behind the DC franchise, apparently had a different tone in mind for the movie.\n\n“The studio wanted Freddie Prinze Jr. and I wanted Joaqui Read more\n\nRosie Huntington-Whiteley Says She's 'Really Proud' Son Jack Has Her 'Proper English Accent' Rosie Huntington-Whiteley has passed her British accent on to her son!\n\nThe 32-year-old actress and model participated in her very first Instagram Story Q&A session on Thursday night, where some fans asked about how life at home was going with Jason Statham and their son Jack Oscar, 2½.\n\nWhen one inquiry came from a fan who wanted to know whether Jack had inherited her vocal tendencies or her fiancé’s, Huntington-Whiteley wrote back, “I’m really proud to say he Read more\n\nKelly Ripa and Mark Consuelos Say 'Comfort' and 'Experimentation' Keep Their Sex Life Healthy The coronavirus isn’t slowing down Kelly Ripa and Mark Consuelos‘ sex life.\n\nThe couple got candid in a chat with Andy Cohen and Bruce Bozzi on the SiriusXM Radio Andy show Quarantined with Bruce on Friday. After Cohen (who is recovering from coronavirus himself) revealed that the self-isolation period is the “longest” he’s gone without having sex, Ripa and Consuelos admitted that they don’t let too much time pass before getting intimate.\n\n“We found each o Read more\n\nErika Jayne and Danielle Staub Danced at the Same N.J. Go-Go Club Before They Were Housewives Long before they were Bravo Housewives, Erika Girardi and Danielle Staub had something else in common.\n\nAs pointed out by the Instagram account Best of Bravo, the two stars both used to perform at a go-go club called Shakers in Carlstadt, New Jersey.\n\nGirardi, 48, invited the Bravo cameras and her costars to the club on Wednesday’s season premiere of the Real Housewives of Beverly Hills. During a cast trip to New York City, Girardi took some of the ladies with her on a visit to the Garden St Read more", "images": ["https://img.newslocker.com/2020/04/18/205292159_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/04/18/205295865_725.jpg", "https://img.newslocker.com/2020/04/18/205290320_350.jpg", "https://img.newslocker.com/2020/04/17/205271595_725.jpg", "https://img.newslocker.com/2020/04/17/205281563_725.jpg", "https://img.newslocker.com/2020/04/17/205272923_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/04/17/205274936_725.jpg", "https://img.newslocker.com/2020/04/17/205280367_725.jpg", "https://img.newslocker.com/2020/04/17/205283424_725.jpg", "https://img.newslocker.com/2020/04/18/205287800_725.jpg", "https://img.newslocker.com/2020/04/18/205296608_725.jpg", "https://img.newslocker.com/2020/04/17/205283423_725.jpg", "https://img.newslocker.com/2020/04/17/205284918_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img.newslocker.com/2020/04/17/205282131_725.jpg", "https://img.newslocker.com/2020/04/18/205288879_725.jpg", "https://img.newslocker.com/2020/04/18/205286189_725.jpg", "https://img.newslocker.com/2020/04/17/205275580_725.jpg", "https://img.newslocker.com/2020/04/18/205297947_725.jpg", "https://img.newslocker.com/2020/04/17/205269826_725.jpg", "https://img.newslocker.com/2020/04/18/205290319_350.jpg", "https://img.newslocker.com/2020/04/17/205276734_725.jpg", "https://img.newslocker.com/2020/04/17/205278005_725.jpg", "https://img.newslocker.com/2020/04/17/205279238_725.jpg", "https://img.newslocker.com/2020/04/17/205283000_725.jpg", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/newslocker-cube.png", "https://img.newslocker.com/2020/04/17/205281177_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/201749/rs_600x600-170509114002-600.adam-levine-gwen-stefani.5917.jpg?downsize=450:*&crop=450:350;left,top", "https://img.newslocker.com/2020/04/17/205271594_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/04/17/205272098_725.jpg", "https://img.newslocker.com/2020/04/17/205272097_725.jpg", "https://img.newslocker.com/2020/04/18/205290318_350.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/201749/rs_600x600-170509114002-600.adam-levine-gwen-stefani.5917.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/adam-levine-jokes-blake-shelton-has-three-balls-and-gwen-stefanis-reaction-is-priceless/", "title": "Adam Levine Jokes Blake Shelton Has \"Three Balls\"--and Gwen Stefani's Reaction Is Priceless", "meta_data": {"description": "Blake Shelton isn't exactly a man of mystery.The 40-year-old country singer tells it like it is, which is one of the many reasons his girlfriend (and fellow Voice mentor) Gwen...", "og": {"title": "Adam Levine Jokes Blake Shelton Has Three Balls--and Gwen Stefani's Reaction Is Priceless - Celebrity news - NewsLocker", "description": "Blake Shelton isn't exactly a man of mystery.The 40-year-old country singer tells it like it is, which is one of the many reasons his girlfriend (and fellow Voice mentor) Gwen...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/adam-levine-jokes-blake-shelton-has-three-balls-and-gwen-stefanis-reaction-is-priceless/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/201749/rs_600x600-170509114002-600.adam-levine-gwen-stefani.5917.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1494355500.0, "source": "http://www.newslocker.com", "summary": ""}