{"url": "https://www.inquisitr.com/4964206/meghan-markle-pda-blunder-prince-harry/", "text": "Meghan Markle experienced a roller coaster this week as the newlywed continued to navigate her new life with Prince Harry in the British Royal Family.\n\nRecently, the Inquisitr reported that Meghan Markle took over a royal duty for Queen Elizabeth II later this year when the Queen will step back from responsibilities in the Queen’s Young Leaders program, and Markle will join her husband, Prince Harry in welcoming the young leaders in the program to Buckingham Palace.\n\nEarlier this week, according to an Express report, the 36-year-old Duchess of Sussex joined the Duke of Sussex and the Queen at Buckingham Palace for the Queen’s Young Leader Awards. Markle hit the ground running with her royal engagements after her mid-May royal wedding, and by the looks of their fun giggles at recent events, she and Queen Elizabeth II get along famously.\n\nHowever, the major faux pas that the new Duchess committed at the Queen’s Young Leader awards that made headlines was her crossing her legs over her knees instead of using the so-called “Duchess Slant,” which involves crossing her legs at the ankles instead of the knees. If that wasn’t enough, though, now another supposed break in royal protocol has come to light. Markle attempted to reach for Prince Harry’s hand as they walked behind the Queen.\n\nMeghan Markle breaks another Royal rule by trying to hold Prince Harry's hand https://t.co/CjGDLkKmYQ — Daily Mail U.K. (@DailyMailUK) June 29, 2018\n\nIn a video of the event, Markle, who wore a beautiful Prada dress in pale pink with her hair softly down around her shoulders, reached out to take her new husband’s hand. Instead of taking the Duchess’s hand, the Duke actually pulled his arms in closer to his sides and clasped them in front of him. After the rebuff, the two continued to walk on as if nothing out of the ordinary occurred.\n\nIndeed, as a newlywed, it makes sense to reach out to hold hands when walking especially in stressful situations, but for some reason, the Royal Family does not do that very often. The Queen herself rarely holds her husband, Prince Philip’s, hand during official public engagements, and that seems to set the tone for the family as a whole in their interactions with the public.\n\nAlthough Prince Harry and Meghan Markle often hold hands, they may not be participating in official royal family engagements when they do so. The new Duke and Duchess of Sussex appear quite affectionate towards each other in their body language. Every move Markle makes right now receives an incredible amount of scrutiny, and this hand-holding rebuff merely is one more of those profoundly analyzed details.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/06/Meghan-Markle-Prince-Harry-3.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/42196c046e4a2503f7f937da1575ba1c?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Rachel Dillin"], "canonical_link": "https://www.inquisitr.com/4964206/meghan-markle-pda-blunder-prince-harry/", "title": "Meghan Markle Makes A PDA Blunder With Prince Harry Amidst Roller Coaster Week", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}