{"url": "https://people.com/music/ariana-grande-pete-davidson-disneyland-after-engagement/", "text": "The best way to celebrate an engagement? With a little Disney magic.\n\nAfter news dropped that Ariana Grande and Pete Davidson are set to marry after just several weeks of dating, the happy couple celebrated with a trip to Disneyland on Monday. The 24-year-old singer, who was also accompanied by brother Frankie Grande, documented their adventure on her Instagram story, sharing videos of her fiancé, also 24, making silly remarks mid-ride as she giggled.\n\nGet push notifications with news, features and more.\n\nShe captioned one video, “Full mood,” while another was labeled, “Another take. I really like this one.”\n\nImage zoom Pete Davidson and Ariana Grande MEGA\n\nGrande got a little naughty in another post, which featured Davidson yelling with the caption, “When I got on top.” She later deleted the joke, but the clip was captured and shared to Twitter by fans.\n\nRELATED: They’re Engaged! Inside Ariana Grande & Pete Davidson’s Love Story\n\nThe Disneyland Celebrities Instagram page also obtained a video captured by a fan of the duo getting off of a rollercoaster, with Davidson thoughtfully offering his hand to help the pop star out.\n\nGrande rocked mouse ears for the outing and briefly waved after a fan called out her name.\n\nAnother admirer was lucky enough to snap a few selfies with the “No Tears Left to Cry” singer.\n\nPEOPLE confirmed on Monday that Grande and Davidson are engaged after several weeks of dating.\n\nRELATED VIDEO: Five Things To Know About Pete Davidson and Ariana Grande\n\nFor her part, the singer tweeted “i love u sm hi & thank u i love u bye,” a message that many of her followers are taking as her own confirmation of the news.\n\nGrande also wrote, “crying,” in response to a tweet calling her “Mrs. Davidson.”\n\nAnother told the star, “I hope he knows he is maRRYING US AS WELL.” Grande replied, “HAHAHAHAHAHH HES BEEN BRIEFED.”\n\n“It’s a recent engagement. They’re just two people who found love quickly and make each other happy all the time. They both started talking about it this past weekend. It’s nothing they’ve been hiding,” an insider told PEOPLE.\n\nWatch the full season of Search History on PeopleTV.com or download the PeopleTV app on your favorite device.\n\nThe couple — who began dating shortly after Grande’s breakup from rapper ex Mac Miller in May — have been using social media to express their affection for one another. Davidson also confirmed that he had split from his longtime girlfriend Cazzie David in mid-May, around the same time he wrapped his fourth season performing on Saturday Night Live. He will reportedly return to the show when it resumes production in the fall.\n\n“Everyone around them is super supportive and happy that they’ve found love,” a source told PEOPLE.\n\nAnd the newly engaged pair have also continued to support one another after they opened up about their respective hardships.\n\n“He went through a rough patch a while back but he’s been really happy lately,” the source said about Davidson, who recently revealed that he’s back to drinking and smoking following his diagnosis of borderline personality disorder. Davidson has also said he struggles with anxiety and Crohn’s disease.\n\nGrande previously said she’s battled anxiety and post-traumatic stress disorder since the bombing at the Manchester, U.K. concert venue where she was performing in May 2017.\n\n“It’s hard to talk about because so many people have suffered such severe, tremendous loss,” she told Vogue U.K. for their July issue.\n\n“But, yeah, it’s a real thing. I know those families and my fans, and everyone there experienced a tremendous amount of it as well. Time is the biggest thing. I feel like I shouldn’t even be talking about my own experience — like I shouldn’t even say anything,” Grande said.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fariana-grande3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fariana-grande3-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fariana-grande3-2000.jpg", "keywords": [], "authors": ["Stephanie Petit"], "canonical_link": "https://people.com/music/ariana-grande-pete-davidson-disneyland-after-engagement/", "title": "Engaged Ariana Grande and Pete Davidson Visit Disneyland", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ariana Grande,Couples,Disneyland,Engagements,Music News,News,Pete Davidson", "news_keywords": "Ariana Grande,Couples,Disneyland,Engagements,Music News,News,Pete Davidson", "description": "Ariana Grande documented their Disneyland adventure on her Instagram story, sharing videos of Pete Davidson making silly remarks mid-ride", "og": {"title": "Ariana Grande and Pete Davidson Hit Disneyland After Whirlwind Engagement News", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/ariana-grande-pete-davidson-disneyland-after-engagement/", "description": "The best way to celebrate an&nbsp;engagement? With a little Disney magic. After news dropped that Ariana Grande&nbsp;and&nbsp;Pete Davidson&nbsp;are set to marry after just several weeks&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fariana-grande3-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/ariana-grande-pete-davidson-disneyland-after-engagement/", "description": "Ariana Grande documented their Disneyland adventure on her Instagram story, sharing videos of Pete Davidson making silly remarks mid-ride", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fariana-grande3-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/ariana-grande-pete-davidson-disneyland-after-engagement/", "title": "Ariana Grande and Pete Davidson Hit Disneyland After Whirlwind Engagement News", "description": "Ariana Grande documented their Disneyland adventure on her Instagram story, sharing videos of Pete Davidson making silly remarks mid-ride", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fariana-grande3-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}