{"url": "https://web.archive.org/web/20181106213128/https://screenrant.com/halloweentown-movie-trivia-behind-scenes-details/", "text": "This year marks the 20th anniversary of one of Disney's first ever original movies, and a fan favorite, Halloweentown. The original movie went on to spawn three sequels - Halloweentown II: Kalabar's Revenge, Halloweentown High, and Return to Halloweentown. Fans love to rewatch these movies every year around Halloween, and Disney still plays them on its channel to this day. What is so special about Halloweentown that makes fans keep coming back for more?\n\nThere are so many things to love about the Halloweentown movies. There's the nostalgia, the not-so-high-tech special effects, and the all around family Halloween fun. Debbie Reynolds, of course, shines in her role as Aggie, the magical witch grandmother to Marnie, Dylan, and Sophie. Marnie, played by Kimberly J. Brown (until she was recast in the fourth film with Sarah Paxton) is a massive fan favorite as well. To this day, Brown is asked about her time in the Halloweentown movies, and even revisits the real Halloweentown once in a while with her castmates.\n\nEvery film set comes with obstacles, but bringing the monster-filled Halloweentown to life was no easy feat. We'll take a look at behind-the-scenes secrets the cast and crew has shared over the years. Brown especially has revealed tons of fun facts about the making of the Halloweentown movies in her own personal videos. We love when actors are just as obsessed with their films as we are, and this is one cast that loves their legacy.\n\nHere are 20 Crazy Details Behind The Making Of The Halloweentown Movies.\n\nadvertising\n\n20 Benny the taxi driver was a robot\n\nOne of the most iconic characters from Halloweentown is definitely Benny the skeleton taxi driver. He is one of the first monsters that Marnie, Dylan, and Sofie meet in Halloweentown, and he is a recurring character throughout the franchise.\n\nWhen asked about how working with Benny was, Kimberly J. Brown - who plays Marnie - revealed that he was actually a robot. \"The actor dubbed his lines after filming, so we actually worked with a robot,\" Brown recalls, \"I’ll always remember the ‘errr err’ sound it made.\" Knowing this detail makes it even funnier looking back on their scenes together. Marnie and her siblings always look pretty confused when they're with Benny-- now we know why!\n\n19 The budget was cut from $30 million to $4 million\n\nadvertising\n\nWhen director Duwayne Dunham was presented the script for Halloweentown, he had no idea what he was in for. \"I read it and I thought, 'Holy smokes, this is big, I mean really big,'\" he recalls. Disney agreed, admitting that the film would have to be cut down significantly in order to be made.\n\nDunham began with a budget of $20 to $30 million, and by the time everything was cut, they were down to a $4 million budget. This was no small cut-back, and Dunham had to get creative with ways to stretch the budget. It wasn't easy, but they made it work. \"I met with the writers and we started going through it,\" Dunham said. It took weeks to finally get the film to match the budget. Halloweentown was filmed in only 24 days.\n\n18 There was almost a different ending\n\nWhile the first Halloweentown movie has a happy ending where Marnie and the Cromwells save Halloweentown, originally the ending wasn't so simple. In fact, it was pretty dark.\n\nIn the ending we all know and love, Marnie places the talisman inside the giant pumpkin that resides in the middle of Halloweentown. For the alternate ending, Marnie was to place the talisman in the middle of a magical forest. As Marnie walked through the forest, she grew older and older with each step.\n\nEven though the ending was scrapped, they got so far as making a mold of Marnie's head in order to achieve the effect. Since the ending was not used after all, Kimberly J. Brown ended up keeping the headpiece for herself.\n\n17 Kimberly J. Brown took a mold of her own head from set.\n\nBoth the cast and crew took a few mementos from the Halloweentown set. With an elaborate like that, how could you not?\n\nKimberly J. Brown,who played Marnie, says she still has a broom from set, and strangely enough, a mold of her own head!\n\nDirector Duwayne Dunham admits to having a pretty cool piece of memorabilia as well. \"We had a stained glass worker there,\" Dunham recalls,\"[I have] a stained glass picture of a black cat with an arched back and kind of an orange moon.\" The coolest part is that his kids love it to this day, and they put it out each Halloween. \"I set that in the window and I put a light behind it,\" Dunham said, \"that’s my beacon to Halloweentown.\"\n\n16 Kalabar's spell was improvised\n\nWhile shooting Halloweentown II: Kalabar's Revenge, Daniel Kountz got quite the surprise when it came time to conjure the portal to Halloweentown. Kountz, who plays Kal, Kalabar's son, had to make up his own spell at the last minute. The script reads “Kal says spell and walks through the portal,” Kountz told MTV. He assumed that he would be given a spell to say, but this wasn't the case.\n\nWhen asked on set if he had prepared a spell, Kountz lied and said yes, then quickly scrambled to make something up.\n\nBelieve it or not, he got inspiration from a choir song he learned in school. “I just pulled that out of nowhere, and they ended up using it,\" Kountz recalls, \"and I think it actually worked out pretty well.\"\n\n15 Real flames shot from Marnie's hair dryer\n\nadvertising\n\nIn a world of modern technology, we've gotten used to most effects being done with CGI technology or motion capture. Back in the 1990s, on a film set with a very small budget, things had to be done differently. Kimberly J. Brown let us in on this fun fact about the hair salon scene.\n\n\"I actually had to stand with a hair dryer and real flames shot out of it, and it was very hot,\" Brown recalled. Was it a good idea for a child to hold a hair dryer blowing flames? Brown seems to think so, adding, \"it was very safe, and very fun.\"\n\n14 Halloweentown is actually St. Helens, Oregon\n\nIf you're wondering where Halloweentown was filmed, it wasn't just on a Disney lot. In fact, the real world town of St. Helen's, Oregon is where it all began. The cast and crew absolutely loved it there, because it really felt like stepping into another world.\n\nKimberly J. Brown remembers it fondly to this day, saying,\"it was the perfect location, with a town square and everything.\" Director Duwayne Dunham loved the location because of how easy it was to film in. He called it, \"basically an abandoned town\" that was an \"ideal place\" for the film. Dunham also fell in love with the color scheme of St. Helens, and admits they got lucky, seeing as how the film budget was so small.\n\n13 They had to reuse extras\n\nThe small budget was a huge obstacle throughout filming. From special effects, to the number of takes they could afford, to the amount of people they had on set - everything had to be planned meticulously. Dunham remembers how they made it seem like more monsters were roaming around Halloweentown than were actually present. \"We had just enough [extras], and we would double up and change costumes and make it look like there were more and different people and that sort of thing,\" Duhman told MTV.\n\nIt seems like the Halloweentown extras really earned their pay on this film.\n\nLuckily for Dunham, he was working with a great group of people. \"Everybody really pitched in and everybody was really on board with what we were doing, so there was never any grumbling.\"\n\n12 Robin Thomas lost his voice for a week on set\n\nWhile everyone in the cast gave it their all, Robin Thomas, who played Kalabar, actually gave his voice for his role! Granted, he only lost it for about a week, but that's still a big price to pay when you're an actor. Thomas remembers the crazy conditions in which he had to shoot his epic City Hall ending scene, and how loud he had to yell.\n\nWith no body mic, or mic of any kind, Thomas found himself having to pull out all the stops. He remembers it vividly, saying, \"I was having to project my voice down. There were fans. [I was] 150 feet or so from the camera. That was challenging. I blew my pipes out.\" Thankfully Halloweentown became a cult classic, so Thomas's voice didn't go to waste!\n\n11 High School Musical stars were in Halloweentown High\n\nadvertising\n\nTwo years before High School Musical became a Disney Channel original sensation, two of its stars found a home in Halloweentown as well.\n\nYou may know Olesya Rulin best as Kelsi, the quiet yet lovable pianist from High School Musical.\n\nFirst she was everyone's favorite pink troll in Halloweentown High. Rulin played Marnie's brother Dylan's love interest, until they just decided to be friends in the end.\n\nAnother notable High School Musical star who ended up appearing in two Halloweentown films is Lucas Grabeel. In Halloweentown High, he played Ethan the Warlock, and he was also appeared in Return to Halloweentown the same year High School Musical was released. Apparently Disney likes to keep it all in the family!\n\n10 Debbie Reynolds' impact on set\n\nWhen asked to reflect on Debbie Reynolds after her passing, all members of the cast agreed that she was the life of the set. Everyone remembers her fondly for always being in a good mood and wanting to help in any way. \"She’s just very giving and wanted everybody to shine as brightly as they could,\" recalls director Duwayne Dunham.\n\nKimberly J. Brown stayed close with Reynolds even after the third film wrapped. She has also kept a memento from her, telling Bustle, \"I actually have a note from her that she gave me when we wrapped the third movie that I’ve had framed all of these years.\"\n\n9 Kimberly J. Brown did not want to be recast as Marnie\n\nWhen Marnie was recast for the fourth film in the franchise, Return to Halloweentown, fans were very displeased. It spawned loads of memes on the internet, poking fun at Disney for thinking that we wouldn't notice or care that they recast the main character. In a candid interview, Kimberly J. Brown made it very clear that she did not want to be recast as Marnie.\n\n\"I wanted to do the fourth one and was fully available for the shoot,\" Brown said.\n\n\"Nothing makes me happier than playing Marnie. Disney decided not to use me for the fourth one, I don’t know why. I was definitely disappointed not to do it.\" If fans weren't already angry, they are now! Rumored scheduling conflicts were said to be the reason Brown was recast, but it seems that wasn't the case.\n\n8 Halloweentown High and Luck of the Irish were filmed at the same school\n\nWhile Disney may be one of the biggest production companies in the world, that doesn't mean the studio is above reusing shooting locations as much as possible. This was the case for the high school where Halloweentown High was filmed. Halloweentown High, the third film in the franchise, was actually shot in the same high school as another Disney Channel original movie, The Luck of the Irish.\n\nThis is especially apparent when we see Aggie, played by Debbie Reynolds, teaching basketball during gym class. It is clearly the same gym where we see the main character Kyle and his team play in The Luck of the Irish. Both scenes involve basketball too! There are many shots where you can see the same lockers and classrooms as well.\n\n7 Only two actors starred in all four films\n\nadvertising\n\nWhile Debbie Reynolds did make an appearance as grandma Aggie in Return to Halloweentown, it was very brief. There are only two actors who returned to their parts full-force in the fourth film, and those are Judith Hoag who plays Gwen, and Joey Zimmerman who plays her son Dylan. As we all know, Marnie was recast. Emily Roeske also did not return as Sophie.\n\nThe storyline tries to maintain connections to the past three films, but ultimately Return to Halloweentown feels like an entirely different world.\n\nThanks to the larger presence of Judith Hoag and her own separate storyline, as well as Zimmerman accompanying our new Marnie - Sarah Paxton - to Witch College, the sentiment of the original movies was kept somewhat intact. They even cast a professor who has a striking resemblance to Reynolds.\n\n6 Halloweentown was shot during a sweltering summer\n\nWhen filming a movie this big, sometimes you have to deal with unexpected elements - one of those being the weather. Halloweentown was shot in July of 1998, so everyone was expecting it to be hot, but not as hot as it was.\n\nIt turned out being one of the hottest summers St. Helen's, Oregon ever had.\n\nJoey Zimmerman, who plays Marnie's brother Dylan, said that the townspeople had it worst. \"People were passing out,\" Zimmerman recalls, \"the fish guy mask, and the crazy alien mask\" all made for very hot costumes. Even some of the main cast, like Debbie Reynolds, who almost always wears long velvet robes in the film, had it tough as well.\n\n5 Kimberly J. Brown had input on the 3rd film\n\nThough Kimberly J. Brown may have been recast for the fourth Halloweentown film, she will forever be the original Marnie. Not only does she love the movies just as much as we do, but she really cares about the fans. For these reasons, Brown wanted to get involved in the storyline for the third film, Halloweentown High, to make sure that there was continuity between all of the films.\n\n\"We had a new writer with the third movie so they were nice enough to let me have a little bit of input,\" Brown told Seventeen. Brown loves the characters, and said that being involved behind-the-scenes was important to her. We're glad Brown put her own special touch into the story while she was still our Marnie.\n\n4 A \"Spirit of Halloweentown\" bash is thrown every year\n\nWhat's better than watching Halloweentown? How about actually visiting Halloweentown - St. Helen's, Oregon - where a \"Spirit of Halloweentown\" bash has been thrown for years. The party is to honor the Halloweentown movies, and what better place than where it all started?\n\nKimberly J. Brown, and even Debbie Reynolds have reunited at the \"Spirit of Halloweentown\" bash along with other cast members over the years.\n\nThousands of fans show up in hopes of seeing their favorite characters every year, and even just to see the town and the real-life places that were used for the movie. The festivities run for a week in October.\n\n3 The Halloweentown book is real\n\nadvertising\n\nIn the first Halloweentown film, Marnie, Dylan, and Sofie are introduced to Halloweentown through a book. When grandmother Aggie reads them the Halloweentown story for bedtime, we see a drawing of a witch that looks just like Marnie.\n\nKimberly J. Brown revealed that these books were specially made for the movie, and are, in fact, entirely finished books. \"They had an artist draw that picture of me too so it would look a little like me,\" she recalls. \"It really is a beautiful book! But there are only a few copies made for the shoot.\" Now we're just curious about who has these few, coveted copies!\n\n2 It was one of the first Disney Channel Original movies\n\nHalloweentown is more than just a fan favorite around the Halloween season, it was actually one of the first ever Disney Channel original movies ever made! Director Duwayne Dunham remembers the process of getting the film up and running. It was during a time when Disney Channel was just starting to make their own movies, originally Halloweentown was going to be a film for NBC.\n\n\"Disney Channel had just started production on their first movie, which was 'Brink,'\" Dunham recalls. Interestingly enough, Dunham actually wanted to direct Brink, but \"they offered me Halloweentown\" he said, \"and Halloweentown was huge.\" While Halloweentown may have been the second ever to go into production, by the time it came out it was actually the fourth ever Disney Channel original to be released.\n\n1 The Teenage Mutant Ninja Turtles connection\n\nSometimes the perks of being an actor include meeting your idols on set. This happened with Joey Zimmerman when he found out Judith Hoag would be playing his mother.\n\nZimmerman is a big fan of the original Teenage Mutant Ninja Turtles, which Hoag starred in.\n\nThe funniest part? He waited until after Halloweentown was done filming to tell her what a big fan he is! \"I wanted to be a professional, so I waited until after filming the entire first movie before exploding about TMNT,\" Zimmerman recalls. When he found out that there would be more Halloweentown movies, he said that \"doing the sequels was like winning some kind of lottery.\" He looked forward to any scene with Hoag.\n\n---\n\nWhat's your favorite making of Halloweentown fact? Let us know in the comments!", "images": ["https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://web.archive.org/web/20181106213128im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://web.archive.org/web/20181106213128im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://web.archive.org/web/20181106213128im_/https://static2.srcdn.com/wordpress/wp-content/uploads/2018/10/Halloween-town-Marnie-Recast.jpg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://web.archive.org/web/20181106213128im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://web.archive.org/web/20181106213128im_/https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg"], "top_img": "https://web.archive.org/web/20181106213128im_/https://static2.srcdn.com/wordpress/wp-content/uploads/2018/10/Halloween-town-Marnie-Recast.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20181106213128/https://screenrant.com/halloweentown-movie-trivia-behind-scenes-details/", "title": "20 Crazy Details Behind The Making Of Halloweentown", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "It's the 20 year anniversary of Halloweentown, so let's look back on what made this franchise such a family favorite.", "og": {"title": "20 Crazy Details Behind The Making Of Halloweentown", "type": "article", "image": {"identifier": "https://web.archive.org/web/20181106213128im_/https://static2.srcdn.com/wordpress/wp-content/uploads/2018/10/Halloween-town-Marnie-Recast.jpg", "width": 1710, "height": 900}, "url": "https://web.archive.org/web/20181106213128/https://screenrant.com/halloweentown-movie-trivia-behind-scenes-details/", "locale": "en_US", "description": "It's the 20 year anniversary of Halloweentown, so let's look back on what made this franchise such a family favorite.", "site_name": "ScreenRant"}, "article": {"published_time": "2018-10-24T09:10:13Z", "section": "Lists"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1540372213.0, "source": "https://web.archive.org", "summary": ""}