{"url": "https://steemit.com/nia/@naseer.exclusive/nia-jax-s-date-turns-out-to-be-a-dud-brie-bella-plots-her-comeback-and-nattie-neidhart-becomes-the-divas-champ-on-total-divas", "text": "It seemed like Nia Jax had lastly discovered somebody to gentle her hearth, however might she stand the flames?\n\nOn this week’s episode of Whole Divas, Nia combated courting insecurities and body image issues head-on by inviting the firefighter she met at a speed dating event to a Intercourse and the Metropolis get together.\n\nIt wasn’t lengthy earlier than sparks had been flying between the pair.\n\n“I am just about on cloud 9 proper now. It was an incredible evening. The get together, the style present and connecting with Jonathan,” Nia exclaimed.\n\nHowever the first date butterflies had been shortly squashed when Nia came upon some disappointing information about her new boo.\n\nWhereas the women had been out to brunch, Brie Bella determined to do some investigating. “Did you Google him in any respect?” Brie requested.\n\n\n\nA brief Google search later, Brie found that Nia’s firefighter was truly a porn star!\n\n“Scorching porn actor,” Brie introduced. “No, no!” the women yelled in unison.\n\nNia was upset to say the least. “I am by no means courting once more,” the WWE star declared.\n\nWhereas Nia was busy attempting to make a match, Nattie Neidhart was working to win her SmackDown Ladies’s Championship match in opposition to Trinity (Naomi) Fatu at SummerSlam.\n\n“For seven years I’ve been preventing to develop into a champion within the WWE and to be in a championship match at SummerSlam is big,” Nattie gushed.\n\nTrin positively put up a battle, however in the long run, all of Nattie’s blood, sweat and tears paid off. Nattie proudly displayed her new title belt for the gang.\n\n“It has been such an extended highway. This win makes 15 years of wrestling worthwhile. It truly is a dream come true,” Nattie confessed.\n\n\n\nNattie’s huge win and Nikki Bellas week of press and promos made Brie want a comeback now more than ever, even when she felt a bit discouraged at first.\n\n“I have to put my huge woman pants on and I have to stroll into SummerSlam and be like, ‘Hear, I am gonna come again, set the date!'” Brie declared.\n\nAnd that is precisely what Brie did. After speaking with WWE’s Director of Expertise Relations, Mark Carrano, the WWE star received the inexperienced gentle.\n\n“We now have some artistic concepts able to go and we’ll see what occurs,” Carrano instructed Brie.\n\nThat was all of the gasoline Brie wanted to gentle her hearth, “Brie Mode won’t ever be forgotten and Brie Mode is gonna come again,” Brie vowed.\n\nSee every thing that went down on this week’s episode within the recap video above!\n\nWatch a model new Whole Divas Wednesday at 9 p.m., solely on E!\n\nSource:https://goo.gl/nUwi94", "images": ["https://steemitimages.com/DQmco2TSVYmv1JXykcBArAawhwPnTtygJmGQGq1gDBaqqMA/33.jpg", "https://steemitimages.com/640x0/https://steemitimages.com/DQmagQwExGBDwSdY1hJr1tSRrkwBHkkF5qBN2kurXoSytdQ/22.jpg", "https://steemitimages.com/DQmagQwExGBDwSdY1hJr1tSRrkwBHkkF5qBN2kurXoSytdQ/22.jpg"], "top_img": "https://steemitimages.com/DQmagQwExGBDwSdY1hJr1tSRrkwBHkkF5qBN2kurXoSytdQ/22.jpg", "keywords": [], "authors": [], "canonical_link": "https://steemit.com/nia/@naseer.exclusive/nia-jax-s-date-turns-out-to-be-a-dud-brie-bella-plots-her-comeback-and-nattie-neidhart-becomes-the-divas-champ-on-total-divas", "title": "Nia Jax’s Date Turns Out to Be a Dud, Brie Bella Plots Her Comeback and Nattie Neidhart Becomes the Divas Champ on Total Divas — Steemit", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "It seemed like Nia Jax had lastly discovered somebody to gentle her hearth, however might she stand the flames?   On… by naseer.exclusive", "og": {"title": "Nia Jax’s Date Turns Out to Be a Dud, Brie Bella Plots Her Comeback and Nattie Neidhart Becomes the Divas Champ on Total Divas — Steemit", "type": "article", "url": "https://steemit.com/nia/@naseer.exclusive/nia-jax-s-date-turns-out-to-be-a-dud-brie-bella-plots-her-comeback-and-nattie-neidhart-becomes-the-divas-champ-on-total-divas", "image": "https://steemitimages.com/DQmagQwExGBDwSdY1hJr1tSRrkwBHkkF5qBN2kurXoSytdQ/22.jpg", "description": "It seemed like Nia Jax had lastly discovered somebody to gentle her hearth, however might she stand the flames?   On… by naseer.exclusive", "site_name": "Steemit"}, "article": {"tag": "nia", "published_time": "2018-01-16T06:16:21"}, "twitter": {"card": "summary_large_image", "site": "@steemit", "title": "Nia Jax’s Date Turns Out to Be a Dud, Brie Bella Plots Her Comeback and Nattie Neidhart Becomes the Divas Champ on Total Divas — Steemit", "description": "It seemed like Nia Jax had lastly discovered somebody to gentle her hearth, however might she stand the flames?   On… by naseer.exclusive", "image": "https://steemitimages.com/DQmagQwExGBDwSdY1hJr1tSRrkwBHkkF5qBN2kurXoSytdQ/22.jpg"}, "application-name": "Steemit", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/images/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/images/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/images/favicons/mstile-150x150.png", "msapplication-wide310x150logo": "/images/favicons/mstile-310x150.png", "msapplication-square310x310logo": "/images/favicons/mstile-310x310.png"}, "movies": [], "publish_date": null, "source": "https://steemit.com", "summary": ""}