{"url": "www.inquisitr.com/5011363/kim-kardashian-tells-sister-kourtney-that-nobody-wants-her-around-that-shes-not-exciting-to-look-at/", "text": "The brand new season of Keeping Up with the Kardashians premieres on Sunday, and it looks like it is going to be tense between the sisters. Especially, Kim Kardashian and Kourtney Kardashian.\n\nAccording to an August 1 report by People Magazine, a brand new sneak peek was released of the upcoming season, and it appears that Kim and Kourtney will be at each other’s throats.\n\nIn the clip, Kim Kardashian is trying to set up a photo shoot and is having a hard time moving things around to fit it into her very busy schedule. Meanwhile, Kourtney is complaining that she needs to be out of the shoot by four o’clock, which is making her younger sister increasingly angry.\n\nThe girls’ mother, Kris Jenner, enters the picture and tries to calm tensions by telling Kourtney to “be nice.” However, she doesn’t help matters. The sisters begin screaming at one another.\n\n“If I’m out by four [o’clock], that’s all I need. If [I get there] and no one’s ready, and I’m, like, lingering around, I’m leaving at 4 p.m., and I don’t care what anyone says,” Kourtney Kardashian states in the clip.\n\nWhen Kim Kardashian tells her sister that she is supposed to having a meeting and can only schedule it for 7 a.m., Kourtney tells her to reschedule the meeting in an unsympathetic way. This is the straw that breaks the camel’s back, and Kim gets fed up.\n\n“No one wants you in the f—ing shoot. Get the f— out of here and go. … We don’t want you in the shoot,” Kim tells her sister. Kourtney replies that she has no interest in doing the photo shoot anyway, and Kim says, “Good, ’cause you’re so f—ing annoying.”\n\nKris Jenner takes Kim Kardashian’s side in the argument, telling her oldest daughter that she is being “annoying” and that she has a way of “rubbing people the wrong way.”\n\nKim then throws the fact that she has the busier schedule and career in Kourtney’s face, saying that she doesn’t have a business to run, so she could never understand how hard it is for her to schedule multiple things.\n\n“Maybe if you had a f—ing business that you were passionate about … but you don’t, so don’t even act like you know what I’m talking about.” At this point, Kourtney Kardashian gets up and leaves the room to gather her things.\n\nKim Kardashian then goes for the final blow, saying that Kourtney Kardashian doesn’t need to be in the photo shoot anyway, because she’s the “least exciting to look at.”\n\n“I need Kourtney to not be so f—ing annoying with a stick up her a— like she f—ing runs this s—, because she doesn’t. She’s the least exciting to look at,” Kim states as Kourtney leaves and slams the door behind her.\n\nKeeping Up with the Kardashians premieres on E! Sunday night at 9 p.m.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/12/Why-Kim-Kardashian-Kourtney-Kardashian-Are-Reportedly-Caught-In-A-Nasty-Feud.jpg", "https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/5011363/kim-kardashian-tells-sister-kourtney-that-nobody-wants-her-around-that-shes-not-exciting-to-look-at/", "title": "Kim Kardashian Tells Sister Kourtney That Nobody Wants Her Around & That She’s Not Exciting To Look At", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}