{"url": "https://www.teenvogue.com/story/darren-criss-golden-globes", "text": "The Golden Globes red carpet was a significant one this year, as attendees marched down the red carpet wearing black to show solidarity with the #TimesUp initiative. Women and men alike donned black outfits on the carpet, and wore pins signifying their support of the movement, but for some reason, women seemed to be the only ones asked questions about #TimesUp and gender equality in general — and people took notice. In an interview with E! News's Giuliana Ransic, actors Darren Criss and Edgar Ramírez took it upon themselves to bring up why they wore black, and the work they're doing to support gender equality.\n\nAfter being asked what the evening means to them, Edgar brought up the #TimesUp initiative, saying he's proud to be wearing black to support it. While Darren said the reason for wearing black on the red carpet was sort of an \"ominous cloud\" over the evening, he said the show of solidarity is ultimately one of resilience.\n\n\"It's actually kind of a celebration of resilience. I think it's a great representation of our solidarity and our community, that hopefully will reflect positively on the people tuning in.\"\n\nAnd because Edgar pointed out that sexual harassment, misconduct and gender inequality \"is not a women's issue,\" but \"an all genders issue,\" Darren highlighted his support of the United Nations Women's movement, HeForShe.\n\n\"This is a campaign from UN Women called HeForShe. It kind of calls out the boys,\" Darren said. \"There's been a lot of strong, inspiring women who have led the way in voicing their outrage, but this is our way of calling out the lads to be held accountable and to voice their own solidarity and say this is something we don't stand for either.\"\n\nThis is so important. Women certainly don't need men to speak on or lead movements on their behalf, but having men uphold, amplify and support the voices of women calling for change is essential. By holding each other accountable, men can make a difference in how women are treated across the country and the world. In a speech to the United Nations in 2014, Emma Watson said it's not just women who need men to work toward gender equality, men need it too.\n\n\"Men, I would like to take this opportunity to extend your formal invitation. Gender equality is your issue too. Because to date, I've seen my father's role as a parent being valued less by society despite my needing his presence, as a child, as much as my mother's. I've seen young men suffering from mental illness, unable to ask for help, for fear it would make them less of a men—or less of a man,\" she said. \"In fact, in the U.K., suicide is the biggest killer of men, between 20 to 49, eclipsing road accidents, cancer and coronary heart disease. I've seen men made fragile and insecure by a distorted sense of what constitutes male success. Men don't have the benefits of equality, either.\"\n\nUltimately, Edgar summed it all up. Anyone who has ever felt burdened by gender stereotypes needs to work toward shattering them, he said.\n\n\"It's not only liberation movement for women, it's a liberation movement for all genders,\" Edgar said. \"Everyone who has felt the burden of a gender stereotype or the pressure of fitting into an uncomfortable mold, or being intimidated against.\"\n\nRelated: Actresses and Hollywood Leaders Announce Anti-Sexual Misconduct Group Time’s Up", "images": ["https://assets.teenvogue.com/photos/5a53e3a912eaec683c013ed0/16:9/w_1280,c_limit/GettyImages-902439422fb.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5a53e3a6f47d0c38da437c2b/16:9/w_2560%2Cc_limit/GettyImages-902439422.jpg"], "top_img": "https://assets.teenvogue.com/photos/5a53e3a912eaec683c013ed0/16:9/w_1280,c_limit/GettyImages-902439422fb.jpg", "keywords": [], "authors": ["Brittney Mcnamara", "Brittney Mcnamar"], "canonical_link": "https://www.teenvogue.com/story/darren-criss-golden-globes", "title": "Darren Criss Stood Up for Gender Equality on the Golden Globes 2018 Red Carpet", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Brittney McNamara", "copyright": "Copyright (c) Condé Nast 2020", "description": "Find out what actor Darren Criss said about gender equality on the Golden Globes 2018 red carpet.", "id": "5a53a66c099c032d3280764c", "keywords": "sexual health + identity,darren criss,gender,gender equality", "news_keywords": "sexual health + identity,darren criss,gender,gender equality", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a53a66c099c032d3280764c", "parsely-metadata": "{\"description\":\"Find out what actor Darren Criss said about gender equality on the Golden Globes 2018 red carpet.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5a53e3a45ec05c5920811496/16:9/w_1000,c_limit/GettyImages-902439422.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5a53e3a45ec05c5920811496/1:1/w_1000,c_limit/GettyImages-902439422.jpg\"}", "og": {"description": "\"This is our way of calling out the lads.\"", "image": "https://assets.teenvogue.com/photos/5a53e3a912eaec683c013ed0/16:9/w_1280,c_limit/GettyImages-902439422fb.jpg", "site_name": "Teen Vogue", "title": "Darren Criss Called on Men to Hold Each Other Accountable for How They Treat Women", "type": "article", "url": "https://www.teenvogue.com/story/darren-criss-golden-globes"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "\"This is our way of calling out the lads.\"", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5a53e3a912eaec683c013ed0/16:9/w_1280,c_limit/GettyImages-902439422fb.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "Darren Criss Called on Men to Hold Each Other Accountable for How They Treat Women"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}