{"url": "www.bustle.com/p/kim-kardashian-predicted-kylie-jenner-would-be-a-young-mom-but-shes-not-the-only-one-9489571", "text": "Now that Kylie Jenner's daughter, Stormi, is four months old, the world has gotten used to the fact that she's a mom — but finding out that she welcomed her first daughter at 20, after dodging rumors for months, was initially a pretty big shock. However, someone in her family wasn't that surprised. Kim Kardashian said she always knew Jenner would be a mom at a young age, and she's not the only one who can see the future. Jenner also predicted it a long time ago herself.\n\nAccording to E! News, Kardashian opened up about Jenner's journey into motherhood during a Business of Fashion West panel she did with mom Kris Jenner on Monday. While talking about the long future they hope Keeping Up With The Kardashians has ahead, they admitted that they joke about North West getting married in a future episode — and that at one point, they joked that Jenner would even have a baby, too, which obviously already happened.\n\n\"We used to say, 'Season 17, Kylie has a baby,'\" Kim said at the panel. \"And we all looked at each other and [were] like, 'Oh sh*t! That just happened.'\"\n\nAnd as E! also pointed out, being that the upcoming season — which will hopefully include Jenner's pregnancy and Stormi's birth — is Season 15, Kardashian's guess was almost 100 percent accurate.\n\nConsidering how close the Kardashian-Jenner sisters are with each other, it's no surprise that Kardashian knows her youngest sister well enough to predict something like this. Plus, Jenner has always talked about being a young mom on multiple occasions in the past.\n\nIn a 2016 episode of KUWTK, Jenner said that having kids at 30 would be too late, adding that she thought 25 would be a better age. And when talking to Interview Magazine in 2015, she pointed out that she would love to have a family by 30, at which point she would disappear out of the spotlight.\n\n\"When I’m, like, 30, I want to go off the map, have a family, and live in Malibu with a farm, and just raise my own chickens,\" she said at the time.\n\nShe may not have gone off the map completely since having Stormi, but she's definitely reduced her social media presence, and so far, she's kept everything that has to do with her baby girl as private as possible.\n\nDuring the panel, Kim K also opened up about how much her family means to her — whether KUWTK goes on forever or not. She said:\n\n\"I think that the way my family and I have always dealt with everything is we know we have each other. Nothing else really matters. So at the end of the day, this could all go away and we all have each other and we're confident in that. So, we're always going to be who we are. And if one of us is fighting with, you know, a boyfriend or an ex, or whatever the examples you were giving, I mean, we all know what it is. Like, we all know we support each other and we love each other. And a part of all of that craziness has given us the platform to have our brands.\"\n\nIn the end, no matter who's pregnant when, this family is here for each other, and that's what's important. It doesn't matter how old Jenner is — it's very clear that she loves being a mom to Stormi so far, and as far as what she's shared on social media, it seems like motherhood definitely agrees with her.\n\nIt's pretty impressive that Kardashian was able to predict the future like that, though. Can she share everything else she thinks will happen over the course of KUWTK? It would be interesting to see if things end up playing out that way in the end.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/b0dfbc93-8b69-424e-9350-ae1e7312ed6e-getty-1209737023.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/3/194ae6f8-bcef-4f14-b94e-ad8aa42bad93-getty-1181741946.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/19/d6d8c194-a53b-404a-a319-b470ba92a3cb-getty-486236878.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/4/143448e3-4aad-4671-9733-857842778d0d-getty-1094888054.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/19/d6d8c194-a53b-404a-a319-b470ba92a3cb-getty-486236878.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/19/981e4735-8243-4363-951e-d76f763f3bee-something-new-cta-all-articles.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/6/8073b318-8f7e-41e3-93d0-a5f3aa3d8ea7-krisxkkw-kkwfragrance-group.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/6/19/d6d8c194-a53b-404a-a319-b470ba92a3cb-getty-486236878.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/kim-kardashian-predicted-kylie-jenner-would-be-a-young-mom-but-shes-not-the-only-one-9489571", "title": "Kim Kardashian Predicted Kylie Jenner Would Be A Young Mom, But She's Not The Only One", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/kim-kardashian-predicted-kylie-jenner-would-be-a-young-mom-but-shes-not-the-only-one-9489571", "type": "article", "title": "Whoa, Kim Kardashian Totally Predicted That Kylie Jenner Would Be A Young Mom", "description": "Now that Kylie Jenner's daughter, Stormi, is four months old, the world has gotten used to the fact that she's a mom — but finding out that she welcomed her first daughter at 20, after dodging rumors for months, was initially a pretty big shock.…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/6/19/d6d8c194-a53b-404a-a319-b470ba92a3cb-getty-486236878.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Now that Kylie Jenner's daughter, Stormi, is four months old, the world has gotten used to the fact that she's a mom — but finding out that she welcomed her first daughter at 20, after dodging rumors for months, was initially a pretty big shock.…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}