{"url": "www.thesun.co.uk/tvandshowbiz/1819402/shock-reports-claim-brad-pitt-had-an-affair-with-co-star-marion-cotillard-behind-anges-back/", "text": "ANGELINA Jolie reportedly ended her marriage after discovering Brad Pitt was cheating with his co-star according to sensational claims in the US.\n\nThe New York Post reports that the 41-year-old hired a private investigator to spy on him on the set of his latest film — where they claim she learned he was cheating.\n\nThe \"well placed source\" told the paper's Page Six section that there is no turning back for the couple - worth £310 million.\n\n6 Brad Pitt and Marion Cotillard on set of their new film Credit: Fame Flynet\n\nThey said: “She hired a private eye because she felt that he was fooling around with her on the set, and it turns out, he was.\n\n\"And that was the final straw.\"\n\nPitt had been rumored to have been cozying up to his Allied co-star, 40-year-old Marion Cotillard, in London for months.\n\nIf the rumours are true it means history has repeated itself - Brad and Angelina famously fell in love while filming Mr and Mrs Smith in 2004.\n\nAt the time he was married to Friends actress Jennifer Aniston.\n\nHe and Jolie also had been sparring over their lifestyle, another source said.\n\nShe has increasingly wanted to quit Hollywood in favour of devoting herself full-time to her humanitarian work, while Pitt prefers Tinseltown, the source said.\n\n6 The couple filed for divorce today after twelve years together Credit: Reuters\n\nThe post continues: “The older she gets, the more serious she becomes, and she is sick of the Hollywood thing.\n\n“He wants to make movies. She doesn’t.\n\n\"It’s a fundamental difference. It’s how you live your life.”\n\n6 Angelina wants full custody of their six children Credit: Rex Features\n\nFrench actress Marion has previously starred in Inception, and won an Oscar in 2007 for her role as Edith Piaf in La Vie en Rose.\n\nShe starred alongside Michael Fassbender in the 2015 film adaption of Macbeth.\n\n[youtube https://www.youtube.com/watch?v=MbM88BG9Ae8&w=560&h=315]\n\nToday The Sun revealed that Angelina is seeking physical custody of the couple’s six children – Maddox, 15, Zahara, 11, Shiloh, 10, Pax, 12 and eight-year-old twins, Knox and Vivienne.\n\nMaddox, Zahara and Pax were adopted from orphanages in Cambodia, Ethiopia and Vietnam, respectively, while the remaining three are their biological children.\n\n6 Brad was married to Jennifer Aniston when he met and fell in love with Angelina on the set of Mr and Mrs. Smith Credit: Reuters\n\nThe Tomb Raider star doesn’t want Brad to have joint physical custody, just joint legal custody, meaning he would get visitation rights only.\n\nLatest in TV and Showbiz MOVIE MARATHON Stuck inside? These are the 35 best films to watch on Netflix right now HOTTING UP When is the MasterChef 2020 final? One budding chef will win the coveted title Breaking CROONER DEAD French singer Christophe, 74, famous for his ballads dies of lung disease best of both worlds Meet Sandy Tang - MasterChef 2020 finalist 'love yourself' RHOC’s Meghan King Edmonds advises ‘single ladies’ to use vibrators FYNE DINING Who is MasterChef 2020 contestant Claire Fyfe? Chobb's knob! How to watch Star Wars on Disney+ 'KEEP YOUR SHIRT ON!' Teen Mom's Farrah slammed for wearing a bra in sexy video with Sophia ANOTHER CANCELLATION? Teen Mom ratings plummet as fans beg MTV to cancel ‘boring’ series VIRAL HIT Sam Smith says they 'definitely' had coronavirus\n\nAnge has hired Laura Wasser, who previously represented Johnny Depp in his divorce case with Amber Heard.\n\nThe documents list the date of separation as Sept. 15, 2016.\n\nThe couple were married in August 2014 but have been together since 2004.\n\nThe couple were last seen in July, when they were seen looking at ease in a supermarket with their son, Knox.\n\n6 The last picture of the couple was taken in July Credit: Xposure\n\nEarlier today copies of the divorce papers were released, and show that Angelina filed citing 'irreconcilable differences'.\n\nIt's not her first trip to the divorce court either - she was previously married to Billy Bob Thornton.\n\n6 A copy of papers filed at Los Angeles Superior Court by Angelina Jolie Credit: Reuters\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.9 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2016/09/emma-landscape-3-x-21.jpg?strip=all&w=750&h=500&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2016/09/emma-landscape-3-x-21.jpg?strip=all&w=750&h=500&crop=1", "keywords": [], "authors": ["Emma Gritt"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/1819402/shock-reports-claim-brad-pitt-had-an-affair-with-co-star-marion-cotillard-behind-anges-back/", "title": "Shock reports claim Brad Pitt was cheating with co-star Marion Cotillard behind Ange’s back", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Shock reports claim Brad Pitt had an affair with co-star Marion Cotillard behind Ange's back", "url": "https://www.thesun.co.uk/tvandshowbiz/1819402/shock-reports-claim-brad-pitt-had-an-affair-with-co-star-marion-cotillard-behind-anges-back/", "description": "ANGELINA Jolie reportedly ended her marriage after discovering Brad Pitt was cheating with his co-star according to sensational claims in the US. The New York Post reports that the 41-year-old hire…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2016/09/emma-landscape-3-x-21.jpg?strip=all&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Angelina wants full custody of their six children"}, "locale": "en_GB"}, "article": {"published_time": "2016-09-20T16:06:36+00:00", "modified_time": "2016-09-21T06:44:35+00:00", "publisher": 161385360554578, "tag": "Angelina Jolie, Brad Pitt, Marion Cotillard, Angelina Jolie and Brad Pitt split, Celebrity relationships and break ups", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "US reports hint that history repeated itself", "keywords": "Brangelina divorce, brad pitt cheating, angelina jolie brad pitt divorce, marion cottilard brad pitt, brad pitt affair", "news_keywords": "Brangelina divorce, brad pitt cheating, angelina jolie brad pitt divorce, marion cottilard brad pitt, brad pitt affair", "twitter": {"text": {"title": "Shock reports claim Brad Pitt was cheating with co-star Marion Cotillard behind Ange’s back"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "WAS HE HAVING AN AFFAIR?", "headline": "Shock reports claim Brad Pitt had an affair with co-star Marion Cotillard behind Ange's back", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2016/09/composite-ba6.jpg?strip=all&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2016/09/composite-ba6.jpg?strip=all&w=620&h=413&crop=1"}}, "parsely-post-id": 1819402, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1474387596.0, "source": "http://www.thesun.co.uk", "summary": ""}