{"url": "https://variety.com/2018/music/news/jay-z-beyonce-trump-kanye-west-in-david-letterman-interview-watch-video-1202746011/", "text": "Among the many topics explored in the newest episode of “My Next Guest Needs No Introduction,” Jay-Z opened up to David Letterman about infidelity in his marriage with Beyonce, thoughts on Donald Trump and his relationship with Kanye West.\n\nLetterman (who had his own cheating scandal with members of his “Late Show” staff) talked about his journey to be being a better husband, to which Jay-Z responded, “For a lot of us – especially where I grew up, and [for] men in general – we don’t have emotional cues. Our cues are be a man, stand up, don’t cry … I want to be open, I want to have the emotional tools it takes to keep my family together.\n\n“I have a beautiful wife who’s understanding and knew that I’m not the worst of what I’ve done,” he continued. “And we did the hard work of going to therapy. We love each other. We put in the work. This music that I’m making now is a result of things that have happened earlier. Like you, I like to believe that we’re in a better place today, but still working, still communicating and growing. I’m proud of the father and the husband I am today because of all of the work that I’ve done.”\n\nJay-Z and Beyonce, who have been married since 2008 and have three children together, made headlines last year after each released albums addressing Jay-Z’s infidelity, with Beyonce dubbing the other woman “Becky with the good hair” on “Lemonade.” In response, on his “4:44” album last year, the rapper apologized multiple times and vowed to put in the work for his relationship. The two will spend several months on their “On the Run II” tour this year, which launches June 6 in the U.K., heads across Europe before moving to North America on July 25, and continuing across the continent before wrapping in Seattle on Oct. 4.\n\nElsewhere in the interview, Jay-Z said that he thinks that what President Trump is “forcing people to do is have a conversation and band together and work together. You can’t address something that’s not revealed. He’s bringing out an ugly side of America that we wanted to believe is gone … We still gotta deal with it. We have to have tough conversations – talk about the N-word, talk about why white men are so privileged in this country.” He added that he predicts there will be a record-breaking number of voters in the next election.\n\nJay-Z also discussed his tumultuous relationship with West, saying, “he’s like a brother to me, do you get along with your family all of the time?” and his reaction to his mother, Gloria Carter, coming out as gay.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Fmusic%2Fnews%2Fjay-z-beyonce-trump-kanye-west-in-david-letterman-interview-watch-video-1202746011%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202746011", "https://pmcvariety.files.wordpress.com/2018/04/jay-z-letterman-my-next-guest.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/04/jay-z-letterman-my-next-guest.jpg?w=1000", "keywords": [], "authors": ["Kirsten Chuba"], "canonical_link": "https://variety.com/2018/music/news/jay-z-beyonce-trump-kanye-west-in-david-letterman-interview-watch-video-1202746011/", "title": "Jay-Z Opens Up About Beyonce, Trump, Kanye West in David Letterman Interview (Watch)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "In the newest episode of \"My Next Guest Needs No Introduction,\" Jay-Z opened up about infidelity in his marriage and thoughts on Trump.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202746011, "author": "Kirsten Chuba", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-04-06T13:30:52"}, "pmc-tag": "Beyonce,Kanye West,My Next Guest Needs No Introduction,Shawn 'Jay-Z' Carter", "title": "Jay-Z Opens Up About Beyonce, Trump, Kanye West in David Letterman Interview (Watch)", "pageclass": "article", "pmc-vertical": "music", "pmc-primary-category": "News", "pmc-primary-vertical": "music", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Jay-Z Opens Up About Beyonce, Trump, Kanye West in David Letterman Interview (Watch)", "url": "https://variety.com/2018/music/news/jay-z-beyonce-trump-kanye-west-in-david-letterman-interview-watch-video-1202746011/", "description": "Among the many topics explored in the newest episode of “My Next Guest Needs No Introduction,” Jay-Z opened up to David Letterman about infidelity in his marriage with Beyonce, thoughts…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/04/jay-z-letterman-my-next-guest.jpg?w=1000", "width": 1000, "height": 563}, "locale": "en_US"}, "article": {"published_time": "2018-04-06T20:30:52+00:00", "modified_time": "2018-04-06T20:30:54+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "Jay-Z Opens Up About Beyonce, Trump, Kanye West in David Letterman Interview (Watch)"}, "image": "https://pmcvariety.files.wordpress.com/2018/04/jay-z-letterman-my-next-guest.jpg?w=1000", "card": "summary_large_image", "title": "Jay-Z Opens Up About Beyonce, Trump, Kanye West in David Letterman Interview (Watch)", "description": "In the newest episode of \"My Next Guest Needs No Introduction,\" Jay-Z opened up about infidelity in his marriage and thoughts on Trump."}, "author": "Kirsten Chuba", "content_type": "Article", "post_id": 1202746011, "title": "Jay-Z Opens Up About Beyonce, Trump, Kanye West in David Letterman Interview (Watch)", "published_at": "2018-04-06 13:30:52", "image": "https://pmcvariety.files.wordpress.com/2018/04/jay-z-letterman-my-next-guest.jpg?w=1000", "comment_count": 0, "tags": "Shawn 'Jay-Z' Carter", "topics": "News", "appeared_in_print": "No", "body": "Among the many topics explored in the newest episode of \"My Next Guest Needs No Introduction,\" Jay-Z opened up to David Letterman about infidelity in his marriage with Beyonce, thoughts on Donald Trump and his relationship with Kanye West.\r\n\r\nLetterman (who had his own cheating scandal with members of his \"Late Show\" staff) talked about his journey to be being a better husband, to which Jay-Z responded, \"For a lot of us – especially where I grew up, and [for] men in general – we don't have emotional cues. Our cues are be a man, stand up, don't cry … I want to be open, I want to have the emotional tools it takes to keep my family together.\r\n\r\n\"I have a beautiful wife who's understanding and knew that I'm not the worst of what I've done,\" he continued. \"And we did the hard work of going to therapy. We love each other. We put in the work. This music that I'm making now is a result of things that have happened earlier. Like you, I like to believe that we're in a better place today, but still working, still communicating and growing. I'm proud of the father and the husband I am today because of all of the work that I've done.\"\r\n\r\nJay-Z and Beyonce, who have been married since 2008 and have three children together, made headlines last year after each released albums addressing Jay-Z's infidelity, with Beyonce dubbing the other woman \"Becky with the good hair\" on \"Lemonade.\" In response, on his \"4:44\" album last year, the rapper apologized multiple times and vowed to put in the work for his relationship. The two will spend several months on their “On the Run II” tour this year, which launches June 6 in the U.K., heads across Europe before moving to North America on July 25, and continuing across the continent before wrapping in Seattle on Oct. 4.\r\n\r\nElsewhere in the interview, Jay-Z said that he thinks that what President Trump is \"forcing people to do is have a conversation and band together and work together. You can't address something that's not revealed. He's bringing out an ugly side of America that we wanted to believe is gone … We still gotta deal with it. We have to have tough conversations – talk about the N-word, talk about why white men are so privileged in this country.\" He added that he predicts there will be a record-breaking number of voters in the next election.\r\n\r\nJay-Z also discussed his tumultuous relationship with West, saying, \"he's like a brother to me, do you get along with your family all of the time?\" and his reaction to his mother, Gloria Carter, coming out as gay.\r\n\r\n\r\n\r\n\"For my mother to have to life as someone she wasn't, hide and protect her kids … for all this time, for her to sit in front of me and tell me, 'I think I love someone,' I really cried. I was so happy for her that she was free,\" he said. \"I knew [that that she was gay], but this was the first time we had the conversation, the first time I heard her say she loved her partner.\"\r\n\r\nJay-Z's \"My Guest Needs No Introduction\" episode was released on Netflix on Friday.\r\n\r\nhttps://www.youtube.com/watch?v=Dy2UzcvqS3w\r\n\r\nhttps://www.youtube.com/watch?v=Ll-GzXpBx-s", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/Dy2UzcvqS3w?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/Ll-GzXpBx-s?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1523046652.0, "source": "https://variety.com", "summary": ""}