{"url": "https://en.wikipedia.org/wiki/%C3%89chame_la_Culpa", "text": "2017 song by Luis Fonsi and Demi Lovato\n\nFor Échame a Mi la Culpa, see José Ángel Espinoza\n\n\"Échame la Culpa\" ( Spanish: [ˈetʃame la ˈkulpa]; transl. \"Put the Blame on Me\") is a song by Puerto Rican singer and songwriter Luis Fonsi and American singer Demi Lovato. Fonsi co-wrote the song with Alejandro Rengifo and its producers Andrés Torres and Mauricio Rengifo.[1] It was released through Universal Music Latin Entertainment, Republic Records and Island Records on November 17, 2017 as the second single from his tenth studio album, Vida. On March 2, 2018, an English remix of the song titled \"Not on You\" was released.\n\nThe song has reached number one in Austria, Lebanon, Slovenia, Mexico, Spain, Argentina, Bolivia, Chile, Costa Rica, Ecuador, El Salvador, Guatemala, Honduras, Panama, Paraguay, Peru and Uruguay, as well as the top ten in Belgium, Germany, Hungary, Italy, Poland, Portugal, Slovakia, Sweden and Switzerland, the top twenty in Croatia, France, Greece, Latvia, the Netherlands and Norway, and the top thirty in Scotland. It also reached number 46 in the UK and 47 on the Billboard Hot 100. The song is certified Platinum or higher in ten countries, including Diamond in Brazil and Mexico.\n\nRelease and promotion [ edit ]\n\nLovato first teased a photo from the music video shot via Instagram on October 21, 2017,[2] to which Fonsi commented: \"What's up Demi...\", and later posted a behind-the-scenes picture on his own Instagram, captioned: \"Finished! It's a wrap\",[3] to which Lovato replied: \"Hola Fonsi\".[4] On November 1, 2017, MTV News reported that the collaboration will be titled \"Échame la Culpa\", a song Fonsi has been performing solo during live shows across the summer.[5] In an interview with Billboard at iHeartRadio Fiesta Latina in Miami, Fonsi admitted: \"It's a fun song, a fun record, we already filmed the video.\" He also revealed that the song would premiere in two weeks.[6] In a clip shared by Billboard on November 13, 2017, Lovato and Fonsi can be seen meeting each other via a FaceTime call to discuss details about their collaboration.[7] On November 14, 2017, Lovato took to social media to announce the song's release, along with a snippet of the song featuring only her part,[8][9][10][11] as Fonsi posted a shot of himself lying in bed with pillows covered in the song's title.[12][13] It was released onto iTunes for download three days later,[14] and Fonsi published a photo that day of a truck with him and Lovato on it, as well as short quotes, including \"¿Qué pasa Demi?\" (English: What's up Demi?) and \"Hey Fonsi\".[15] Fonsi told Viva Latino: \"The lyrics are very joyful. It's that play on words, that famous cliché of 'It's not you, it's me' that many of us have used.\"[16] On April 12, 2018, Fonsi performed the song live together with German singer Helene Fischer during a medley with \"Despacito\" at the German Echo Music Prize.[17]\n\nCritical reception [ edit ]\n\nThe song received positive reviews from music critics. Jon Caramanica of The New York Times called the song \"a jaunty, celebratory number\", and felt Lovato singing in clipped Spanish is \"only marginally less comfortable than the bumpy-edged English-language semi-soul she employs elsewhere on the song\".[18] Deepa Lakshmin of MTV News wrote that it is \"equally infectious\" as \"Despacito\".[19] Ross McNeilage of the same publication deemed the song \"an absolute powerhouse anthem that goes harder than 'Despacito' ever did\", and gave credit to \"Demi's flawless Spanish and [Fonsi and Lovato's] undeniable chemistry\".[20] Bianca Gracie of Fuse regarded it as \"a welcomed refresher away from the ongoing 'Despacito' takeover\".[21]\n\nMusic video [ edit ]\n\nThe music video first takes place in Lovato's bedroom, before the duo meet up in an abandoned warehouse and hold a dance party.[22][23][24] In its first 24 hours of release, the video accrued more than 17.4 million views, a record for Lovato.[25]\n\nOn YouTube, the video became the third-fastest music video in history to reach 500 million views and the fifth-fastest to reach 1 billion views, being the fastest collaboration in history to reach these two milestones.[26] As of October 2019, it has received over 1.9 billion views, making it one of the site's 50 most-viewed videos.[27]\n\nLive performances [ edit ]\n\nFonsi and Lovato made their duet debut performance during Lovato's Tell Me You Love Me World Tour at the American Airlines Arena in Miami, United States on March 30, 2018.[28] On April 12, 2018, Fonsi performed the song live together with German singer Helene Fischer during a medley with \"Despacito\" at the German Echo Music Prize.[29] On May 27, 2018, Fonsi performed the song with Lovato during the BBC Music's Biggest Weekend.[30] The song is included in both Luis Fonsi's Love + Dance World Tour and Lovato's Tell Me You Love Me World Tour set list.\n\nTrack listings [ edit ]\n\nDigital download[31]\n\n\"Échame la Culpa\" – 2:53\n\nDigital download – Not on You remix[32]\n\n\"Échame la Culpa\" (Not on You remix) – 2:53\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6e/Luis_Fonsi_and_Demi_Lovato_%C3%89chame_la_Culpa.jpg/220px-Luis_Fonsi_and_Demi_Lovato_%C3%89chame_la_Culpa.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/6/6e/Luis_Fonsi_and_Demi_Lovato_%C3%89chame_la_Culpa.jpg", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/6e/Luis_Fonsi_and_Demi_Lovato_%C3%89chame_la_Culpa.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/%C3%89chame_la_Culpa", "title": "Échame la Culpa", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/6e/Luis_Fonsi_and_Demi_Lovato_%C3%89chame_la_Culpa.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}