{"url": "https://en.wikipedia.org/wiki/Full_House", "text": "This article is about the American television series. For other uses, see Full house\n\nAmerican television series\n\nFull House is an American television sitcom created by Jeff Franklin for ABC. The show chronicles the events of widowed father Danny Tanner who enlists his brother-in-law Jesse Katsopolis and best friend Joey Gladstone to help raise his three daughters, oldest D.J., middle child Stephanie and youngest Michelle in his San Francisco home. It aired from September 22, 1987 to May 23, 1995, broadcasting eight seasons and 192 episodes.\n\nWhile never a critical favorite, the series was consistently in the Nielsen Top 30 (from 1988 onward) and continues to gain even more popularity in syndicated reruns, and is also aired internationally.[1][self-published source?] One of the producers, Dennis Rinsler, called the show \"The Brady Bunch of the 1990s\".[2] For actor Dave Coulier, the show represented a \"G-rated dysfunctional family\".[3] It has also had tie-in merchandise marketed, such as a series of paperback books.\n\nA sequel series, Fuller House, premiered on Netflix on February 26, 2016.\n\nPlot summary [ edit ]\n\nAfter the death of his wife Pam, sports anchor Danny Tanner recruits his brother-in-law Jesse, a rock musician; and his best friend since childhood, Joey, who works as a stand-up comedian, to help raise his three young daughters. Over time, the three men, as well as the children, bond and become closer to one another.\n\nIn season two, Danny is reassigned from his duties as sports anchor by his television station to become co-host of a new local breakfast TV show, Wake Up, San Francisco, and is teamed up with Nebraska native Rebecca Donaldson. Jesse and Rebecca (\"Becky\") eventually fall in love and get married in season four. In season five, Becky gives birth to twin sons, Nicholas (\"Nicky\") and Alexander (\"Alex\").\n\nMain cast [ edit ]\n\n^ The character's surname was changed from \"Cochran\" to \"Katsopolis\" after the first season ended.\n\nProduction [ edit ]\n\nCasting [ edit ]\n\nJohn Posey as Danny Tanner in the pilot (shown with Sweetin and Cameron as Stephanie and D.J.)\n\nThe producers' first choice to play the character of Danny Tanner was Bob Saget. Saget was not available to appear in the pilot due to his commitment as an on-air contributor to CBS's The Morning Program. The producers instead cast actor John Posey to play Danny. Posey only appeared in the unaired pilot (which is included on the DVD release of Season 1).\n\nJohn Stamos's character was originally named Jesse Cochran; Stamos reportedly wanted his character to better reflect his Greek heritage, so producers decided to change the character's surname to Katsopolis (beginning with season two).\n\nTo comply with child labor laws, twins Ashley and Mary-Kate Olsen were cast to alternate in the role of Michelle during tapings. The girls were jointly credited as \"Mary Kate Ashley Olsen\" in seasons two through seven because the producers did not want audiences to know that the Michelle character was played by twins. The sisters occasionally appeared together in fantasy sequences. That made Full house one of the only shows on TV where a baby grew up in front of the cameras, with viewers witnessing all the development stages of the twin actresses.[2] Bob Saget recalled he would often get complaints from the child actors' moms because he wouldn't watch his language while on stage.[3] Jodie Sweetin was spotted in a guest spot on the show Valerie.[3] Lori Loughlin was hired in 1988 for a six-episode romance plot with \"Uncle Jesse\" but ended up staying until the end of the show.[3]\n\nAll seven of the original cast members remained with the show through its entire eight-year run, with five characters added to the main cast along the way. D.J.'s best friend Kimmy was a recurring character in seasons one through four, who was upgraded to a regular in season five. Rebecca originally appeared for six episodes in season two; producers decided to expand her role and made her a regular the following season. After marrying Jesse, they have twins Nicky and Alex, who make their debut in season five. As babies, the children were played by Daniel and Kevin Renteria, and in season six, the roles of the twins were succeeded by Blake and Dylan Tuomy-Wilhoit. The last main character added was Steve Hale, who was D.J.'s boyfriend in seasons six and seven. He was played by Scott Weinger.\n\nTaping [ edit ]\n\nThe series was created by Jeff Franklin and executive produced by Franklin, along with Thomas L. Miller and Robert L. Boyett. The series was produced by Jeff Franklin Productions and Miller-Boyett Productions, in association with Lorimar-Telepictures (1987–1988), Lorimar Television (1988–1993), and then by Warner Bros. Television (1993–1995) after Lorimar was folded into Warner Bros.'s existing television production division.\n\nAlthough the series was set in San Francisco, the sitcom itself was taped at the Warner Bros. Studios in Los Angeles. Outside of certain excerpts in the opening title sequences, including Alamo Square Park's Painted Ladies, the only episode to have actually been taped in San Francisco was the first episode of season eight, \"Comet's Excellent Adventure\". There were also a few episodes which were filmed on-location elsewhere, most notably Hawaii in the season three premiere \"Tanner's Island\", and at Walt Disney World for the two-part sixth-season finale \"The House Meets the Mouse\".\n\nThe series experienced heavy turnover with its writing staff throughout its run. The first season in particular had at least three writing staff changes, with Lenny Ripps (who remained with the show until the early part of the fourth season, by then serving as a creative consultant) and Russell Marcus being the only writers surviving the changes through the entire season. Show creator and executive producer Jeff Franklin was the only writer to remain with the series throughout its entire eight-season run (Franklin also wrote and directed several episodes during the first five seasons). Marc Warren and Dennis Rinsler joined the series' writing staff in the second season as producers and remained with the show until its 1995 cancellation; Warren and Rinsler took over as head writers by season five and assumed showrunning duties as executive producers for the sixth season to allow Franklin to focus on Hangin' With Mr. Cooper (Full House served as Cooper's lead-in when the former aired on Tuesday nights during the 1992–93 season).\n\nTheme song [ edit ]\n\nThe show's theme song, \"Everywhere You Look\", was performed by Jesse Frederick, who co-wrote the song with writing partner Bennett Salvay and series creator Jeff Franklin. Various instrumental versions of the theme song were used in the closing credits; the version used during seasons three through eight was also used in the opening credits in some early syndication runs, although the song was almost always truncated to the chorus for broadcast. Seasons one through five used a longer version of the theme song. In syndicated airings, the line \"you miss your old familiar friends, but waiting just around the bend\" replaced the lines starting with \"how did I get delivered here, somebody tell me please...\" (after ABC Family acquired the series in 2003, it became the first television outlet to air the long versions of the theme since the series' ABC run, which were included only in select episodes from the first five seasons, whereas the full version was used in most episodes during those seasons). Hallmark Channel reruns have used four different cuts of the theme song, including the full version.\n\nABC used the show to launch other sitcom hits such as Home Improvement, Family Matters and Hangin' with Mr. Cooper.[2]\n\nThe actor Dave Coulier sold the Mr. Woodchuck puppet he made on the show to the toy store Toys \"R\" Us.[2]\n\nEpisodes [ edit ]\n\nFull House originally aired on Fridays from September 1987 to August 1991, which spanned the show's first four seasons, and later became the flagship program of ABC's newly launched TGIF block in September 1989. The show was briefly moved to Tuesdays during the 1987–88 season and then aired twice a week on Tuesdays and Fridays for a few months in order to help the series build an audience. It remained on Fridays permanently for the next three seasons, as the show's ratings increased. Full House was moved to Tuesdays full-time for season five and remained there until the series ended in 1995. While the show's first season was not very successful, finishing 71st that year, mostly because it was a new series placed in an 8 p.m. Eastern timeslot (most freshman series start out in protected time slots preceded by successful lead-ins), the show quickly became popular during its second season as it was placed immediately following the established hit show Perfect Strangers (which was also produced by Tom Miller and Bob Boyett). From season three onwards, it was ranked among Nielsen's Top 30 shows (a ratings increase which allowed the series to move back to Fridays at 8 p.m.).[4] By the fourth season, the series jumped to the Top 20 and remained there until the seventh season (the series peaked at the top ten during seasons five and six).[5]\n\nIn 1995, despite the fact the show was still rated in the top 25, ABC announced that it was canceling the show after eight seasons due to the increasing costs of producing the series. By the end of the show, the average cost of one episode was $1.3 million. Plans to move Full House to The WB network fell through.[2] The one-hour series finale was watched by 24.3 million viewers, ranking No. 7 for the week and attracting a 14.6 household rating and a 25 percent audience share.[citation needed]\n\nSeason Episodes Originally aired Rank Rating First aired Last aired 1 22 September 22, 1987 ( ) May 6, 1988 ( 1988-05-06 ) 71 10.9[6] 2 22 October 14, 1988 ( ) May 5, 1989 ( 1989-05-05 ) 28 15.5[7] 3 24 September 22, 1989 ( ) May 4, 1990 ( 1990-05-04 ) 21 15.3[8] 4 26 September 21, 1990 ( ) May 3, 1991 ( 1991-05-03 ) 14 16.1[9] 5 26 September 17, 1991 ( ) May 12, 1992 ( 1992-05-12 ) 8 17.4[10] 6 24 September 22, 1992 ( ) May 18, 1993 ( 1993-05-18 ) 10 15.8[11] 7 24 September 14, 1993 ( ) May 17, 1994 ( 1994-05-17 ) 16 14.4[12] 8 24 September 27, 1994 ( ) May 23, 1995 ( 1995-05-23 ) 24 12.5[13]\n\nU.S. syndication [ edit ]\n\nWarner Bros. Television Distribution handles the domestic and international syndication rights to the series. During the summer of 1991, reruns of the early seasons began airing in a daily daytime strip on NBC.[14] Starting in September 1991, Warner Bros. Domestic Television Distribution began distributing Full House for broadcast in off-network syndication and was syndicated on various local stations nationwide until 2003.\n\nThe series formerly aired on TBS, ABC Family, The N/TeenNick, CMT, and Hallmark Channel.\n\nIn 2014, episodes have averaged 1.5 million viewers on Nick at Nite, which is up 7 percent from 2013 and a 0.4 rating in the key 18–49 demographic, up 8 percent from 2013.[15]\n\nOn September 29, 2017, Hulu acquired the streaming rights to Full House along with fellow Warner Bros. TV productions Family Matters, Hangin' with Mr. Cooper, Perfect Strangers and Step by Step in addition to Disney-ABC TV productions Boy Meets World, Dinosaurs and Home Improvement.[16]\n\nCritical reception [ edit ]\n\nDespite the show's popularity, critics' reviews for Full House were mostly negative in the show's early years[17] but became more positive in later years.[18] The first season holds an aggregate score of 31/100 (\"Generally unfavorable reviews\") on Metacritic.[19] In Slate, Willa Paskin referred to the series as \"a hackneyed and saccharine family sitcom\".[20] Isaac Feldberg opined that it was \"archetypally average, hiding behind a ubiquitous laugh track and obnoxiously on-the-nose life lessons.\"[21]\n\nReunions [ edit ]\n\nDuring Bob Saget's final season as host of America's Funniest Home Videos, six other Full House cast alumni (John Stamos, Dave Coulier, Candace Cameron, Jodie Sweetin, Andrea Barber, and Lori Loughlin) reunited on the May 9, 1997, episode (the episode which preceded Saget's final episode as host of that series).[22]\n\nIn a December 2008 news story,[23] it was reported that John Stamos was planning a reunion movie.[24] This idea was quickly withdrawn, because reportedly most of the cast was not interested.[25] In 2009, Stamos announced that a feature film based on the show was still planned. Stamos told The New York Daily News, \"I'm working on a movie idea, but it wouldn't be us playing us. I'm not 100% sure, but it would probably take place in the first few years.\" Stamos posited Steve Carell and Tracy Morgan for the roles of Danny and Joey respectively.[26]\n\nIn 2012, eight of the Full House cast members reunited in Los Angeles for their 25th anniversary. Publicists for Mary-Kate and Ashley Olsen said that they \"weren't able to attend, given their work schedules.\"[27]\n\nOn July 19, 2013, the original Jesse and the Rippers (the band which Jesse Katsopolis served as frontman until he was voted out in season 8) reunited on Late Night with Jimmy Fallon. The group performed a medley of covers including the Beach Boys' \"Forever,\" Elvis Presley's \"Little Sister,\" \"Hippy Hippy Shake\", and ending with the Full House theme \"Everywhere You Look\". Bob Saget and Lori Loughlin made cameo appearances.[28]\n\nIn January 2014, Saget, Stamos, and Coulier appeared on Late Night with Jimmy Fallon. They each reprised their characters, while Fallon dressed in child's pajamas in a bed framed by four gigantic pencils, similar to Michelle Tanner's bed from the show. Saget, Stamos, and Coulier said some of their famous catchphrases from the show, as well as singing \"The Teddy Bear\" song.[29] Stamos, Saget and Coulier also appeared together in a 2014 commercial for Dannon Oikos Greek Yogurt (for which Stamos serves as spokesperson) that debuted during Super Bowl XLVIII, days after their appearance on Late Night.[30]\n\nSpin-off series [ edit ]\n\nIn August 2014, reports circulated that Warner Bros. Television was considering a series spin-off.[31] John Stamos, who has an ownership stake in the show, headed up the attempt to get the series back into production.[32] Netflix closed a deal to produce a 13-episode sequel series tentatively titled Fuller House, with many of the original series cast members reprising their roles.[33] Notably, Mary-Kate and Ashley Olsen both declined to reprise the role of Michelle in the first season,[34] although the creators and producers said they could still possibly appear in future seasons.[35][36] Stamos would guest star as well and serve as producer.[37][38]\n\nFilming began on July 25, 2015.[39] Like the original series, the show is set in San Francisco.[40] The original series idea was focused on D.J., a veterinarian struggling to raise three boys after her firefighter husband Tommy Fuller is killed in the line of duty; Stephanie, who is aspiring to become a musician; and Kimmy, who is a party planner and a single mother to a teenage daughter, Ramona. The show's premise follows one similar to the original series when Stephanie makes plans to put her career on hold for a while and move in with D.J. to help take care of her children. Almost immediately afterward, Kimmy makes the same offer for her and Ramona to move in and help out. Netflix premiered the series on February 26, 2016,[41] with the premiere episode featuring a Tanner family reunion.[42][43] As of December 6, 2019, there have been five seasons of the series.[44]\n\nOther media [ edit ]\n\nHome media [ edit ]\n\nWarner Home Video released all eight seasons of the series on DVD in Region 1 between 2005 and 2007.[45] A complete series box-set containing all 192 episodes was released on November 6, 2007. As of 2016, the complete series is available for purchase via online retailers such as Amazon.[46] Additionally, the first four seasons were also released on DVD in Region 2 and Region 4.[47]\n\nTitle Region 1 Region 2 Region 4 The Complete First Season February 8, 2005 2007 November 16, 2005 The Complete Second Season December 6, 2005 2007 April 5, 2006 The Complete Third Season April 4, 2006 2007 August 9, 2006 The Complete Fourth Season August 15, 2006 2007 September 5, 2007 The Complete Fifth Season December 12, 2006 2013 (via Amazon only) N/A The Complete Sixth Season March 27, 2007 N/A N/A The Complete Seventh Season August 7, 2007 N/A N/A The Complete Eighth Season November 6, 2007 N/A N/A The Complete Series November 6, 2007 N/A N/A\n\nBook series [ edit ]\n\nBooks based on Full House are geared toward children primarily between the ages of 8 and 14. Warner Bros., which holds the rights to Full House and its associated characters, would not permit others to use their characters and selected who could write books based on the television series. The books are based on the Silhouette romance novels by Mills & Boon. Full House Michelle #7: Summer Rhapsody is a Silhouette Special Edition #75 by Nancy John and Laura O'Neil in February 1983.\n\nThe series includes the following:\n\nFull House Stephanie : These 33 books were written from the point of view of the Tanners' middle daughter, Stephanie Tanner. They take place with Stephanie in a different middle school, likely because of a slightly different redistricting plan compared to the one mentioned in season seven's \"Fast Friends\". She has different best friends as well, Allie Taylor and Darcy Powell. Though these are book creations, she has known Allie since kindergarten, and there are several places in the first five seasons of Full House where fans think an unnamed extra could be Allie. This series begins with Stephanie being pressured to join a clique called the Flamingos, by completing a series of dares. She almost does the last one, though she is not sure if she wants to before D.J. catches her trying to steal Danny's phone card. Stephanie explains tearfully what was happening, and D.J. helps her to understand what the Flamingos were really up to: they wanted to use the phone card to call their boyfriends. Stephanie and the Flamingos become fierce rivals. Hip Hop Til You Drop , Two for One Christmas Fun , and Ten Ways to Wreck a Date are the most popular.\n\n: These 33 books were written from the point of view of the Tanners' middle daughter, Stephanie Tanner. They take place with Stephanie in a different middle school, likely because of a slightly different redistricting plan compared to the one mentioned in season seven's \"Fast Friends\". She has different best friends as well, Allie Taylor and Darcy Powell. Though these are book creations, she has known Allie since kindergarten, and there are several places in the first five seasons of where fans think an unnamed extra could be Allie. This series begins with Stephanie being pressured to join a clique called the Flamingos, by completing a series of dares. She almost does the last one, though she is not sure if she wants to before D.J. catches her trying to steal Danny's phone card. Stephanie explains tearfully what was happening, and D.J. helps her to understand what the Flamingos were really up to: they wanted to use the phone card to call their boyfriends. Stephanie and the Flamingos become fierce rivals. , , and are the most popular. Full House Michelle : These 40 stories are told from Michelle's point of view. The first 27 feature more of her, and the other Tanners', home life than others, though some focus on events at school, whereas the last 14, the \"Michelle and Friends\" series, focuses mostly on Michelle and her classmates. Unlike Stephanie, Michelle goes to the same elementary school but is in a different class. Two stories were translated and published in Japan in February 2007. Super special My Best Friend is a Movie Star came out in September 1996, and along with The Substitute Teacher and How to be Cool are the most popular.\n\n: These 40 stories are told from Michelle's point of view. The first 27 feature more of her, and the other Tanners', home life than others, though some focus on events at school, whereas the last 14, the \"Michelle and Friends\" series, focuses mostly on Michelle and her classmates. Unlike Stephanie, Michelle goes to the same elementary school but is in a different class. Two stories were translated and published in Japan in February 2007. Super special came out in September 1996, and along with and are the most popular. Full House Sisters : These 14 books focus on Michelle and Stephanie's friendship and comical situations that occur between them. The sisters often alternate points of view in the story.\n\n: These 14 books focus on Michelle and Stephanie's friendship and comical situations that occur between them. The sisters often alternate points of view in the story. Full House: Dear Michelle : These four books were published several years after the others stopped being produced. They take place with Michelle in the third grade, where she writes an advice column for her class paper.\n\n: These four books were published several years after the others stopped being produced. They take place with Michelle in the third grade, where she writes an advice column for her class paper. Club Stephanie: 1997–2001 revival series with the Sisters series. Sweetin is younger than Nickelodeon's Larisa Oleynik in Alex, You're Glowing and Irene Ng in Hot Rock.\n\nRussian adaptation [ edit ]\n\nIn 2006, Full House was one of a group of Warner Brothers properties licensed to Moscow-based network STS for adaptation to Russian. The show, Topsy-Turvy House [ru] followed the plots of the American version with changes to accommodate cultural differences. It ran for two seasons, beginning in 2009.[48][49]\n\nThe Unauthorized Full House Story [ edit ]\n\nOn August 22, 2015, a television movie called The Unauthorized Full House Story was first released by Lifetime. It tells the behind-the-scenes story of the series.[50]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Full_House_1987_TV_series_logo.png/250px-Full_House_1987_TV_series_logo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/21px-SMirC-laugh.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Ambox_scales.svg/50px-Ambox_scales.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/SF_From_Marin_Highlands3.jpg/24px-SF_From_Marin_Highlands3.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Rubik%27s_cube_v3.svg/19px-Rubik%27s_cube_v3.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b6/Full_House_%28Original_pilot%29.jpg/220px-Full_House_%28Original_pilot%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/4/47/Full_House_1987_TV_series_logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/18px-EC1835_C_cut.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/47/Full_House_1987_TV_series_logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Full_House", "title": "Full House", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/4/47/Full_House_1987_TV_series_logo.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}