{"url": "https://deadline.com/2018/01/bafta-nominations-surprises-snubs-diversity-analysis-1202239082/", "text": "There’s much to chew on in this morning’s BAFTA Film Awards nominations. The 6,500-strong British Academy of Film and Television Arts tossed a lot of love towards titles with UK-centric stories and/or pedigrees while embracing Guillermo del Toro’s lyrical fantasy The Shape Of Water. The Fox Searchlight film, for which del Toro won the Directing Golden Globe on Sunday, scored a leading 12 nominations.\n\nThe group entirely snubbed Steven Spielberg’s The Post, a serious and timely Oscar candidate, giving it zero mentions. (Is it notable that the American story walked away from Sunday’s Golden Globes empty-handed, despite a gag at the top of the show that anticipated a sweep?)\n\nBlade Runner 2049, a critically-lauded movie that nevertheless faltered, also appears to be a favorite with BAFTA voters (the film’s biggest offshore box office market is the UK). When Denis Villeneuve’s name was listed among Best Director nominees this morning, there was cheering from the press corps at 195 Piccadilly in London. The Sony/Alcon sci-fi sequel otherwise largely scored nods in the tech categories with a total of eight mentions.\n\nRelated Story Coronavirus: BAFTA In Talks With Distributors About 2021 Eligibility Flexibility\n\nWarner Bros’ Dunkirk from Christopher Nolan also scored eight nominations including Best Film and Director along with tech nods. Working Title/Focus’ Darkest Hour, which follows Winston Churchill against the backdrop of the crisis faced on the beaches at Dunkirk, has nine mentions including in the Best Film, Best British Film, Leading Actor and Supporting Actress fields. Gary Oldman as Churchill is seen as the frontrunner this awards season while this is the first major nomination for Kristin Scott Thomas in Darkest Hour.\n\nEric Fellner, co-chief of Working Title which nabbed a total 12 noms today, says of Darkest Hour, “The name I see on all of these nominations is Joe Wright” who did not score a directing bid. For Fellner, “A film can’t get this kind of recognition without a brilliant creative visionary at the head of it, that was our director.”\n\nIn a bit of trivia, Scott Thomas last won a BAFTA in 1995 for Four Weddings And A Funeral, the same year that Hugh Grant also last won, and for the same film. He’s nominated for Supporting in Paddington 2 this time around, the box office smash that’s got further nods for Adapted Screenplay and Best British Film.\n\nAlthough set in the U.S. midwest, Fox Searchlight’s nine-time BAFTA nominee Three Billboards Outside Ebbing Missouri was co-financed by the UK’s Film4 and is written and directed by the British/Irish filmmaker Martin McDonagh. He scored nods today while the movie was also recognized in the Best Film, British Film, Cinematography, Supporting Actor and Actress races. It scooped the Globe on Sunday in the drama category, and also picked up Best Actress for Frances McDormand, among other wins. McDormand is also nominated at BAFTA but, in a surprise, won’t be up against Judi Dench for Victoria And Abdul, with that film scoring just one BAFTA mention today for Hair & Make-Up.\n\nEntering the Leading Actress BAFTA race is Annette Bening for Film Stars Don’t Die In Liverpool, another title with a British background that also picked up a surprise Leading Actor nod for Jamie Bell who last won in 2001 for Billy Elliot.\n\nBAFTA Chief Executive Amanda Berry says more British films were entered this year and points out that eight of the 20 performance nominees are British, repping a higher number than in recent memory.\n\nThe BAFTA’s faced some criticism last year for a perceived lack of diversity among its nominees. Dee Rees’ Mudbound was shut out this year, and the conversation might turn around a lack of female directors in the main category. Berry says, however, that BAFTAs new talent schemes are seeing increasing diversity. “Change is definitely happening.” There are also, she notes, five female directors nominated in categories outside the main field including in Outstanding Debut. Greta Gerwig’s awards favorite Lady Bird earned her an Original Screenplay nomination, but it failed to impact the Director or Film categories, collecting only two further nods, for Saoirse Ronan and Laurie Metcalf.\n\nSays Fellner, “I think we should all try harder to find more opportunities for women to direct more movies. That is something we are going to continue to do at Working Title and I’m sure we’re going to see that in the industry.”\n\nIn other notable categories, the Foreign Language race includes 2017’s Globe winner Elle and Oscar winner The Salesman as well as this year’s shortlisted Loveless. In the Documentary race, National Geographic scored its first ever BAFTA Film nomination for Jane.\n\nSee here for the full list of nominees. The BAFTAs will be handed out at London’s Royal Albert Hall on February 18.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F01%2Fbafta-nominations-surprises-snubs-diversity-analysis-1202239082%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202239082&comment_count=3", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/10/blade-runner.jpg?w=1024"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/10/blade-runner.jpg?w=1024", "keywords": [], "authors": ["Nancy Tartaglione"], "canonical_link": "https://deadline.com/2018/01/bafta-nominations-surprises-snubs-diversity-analysis-1202239082/", "title": "BAFTA Nominations Show Love For ‘Shape Of Water’, ‘Blade Runner’ & British Films; Shut Out ‘The Post’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "There's much to chew on in this morning's BAFTA Film Awards nominations. The 6,500-strong British Academy of Film and Television Arts tossed a lot of love towards titles with UK-centric stories and/or pedigrees while embracing Guillermo del Toro's lyrical fantasy The Shape Of Water.", "news_keywords": "Analysis, BAFTA, Blade Runner 2049, Darkest Hour, Dunkirk, The Post, The Shape Of Water", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "BAFTA Nominations Show Love For ‘Shape Of Water’, ‘Blade Runner’ & British Films; Shut Out ‘The Post’", "url": "https://deadline.com/2018/01/bafta-nominations-surprises-snubs-diversity-analysis-1202239082/", "description": "There’s much to chew on in this morning’s BAFTA Film Awards nominations. The 6,500-strong British Academy of Film and Television Arts tossed a lot of love towards titles with UK-centric…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/10/blade-runner.jpg?w=1024", "width": 1200, "height": 801}, "locale": "en_US"}, "article": {"published_time": "2018-01-09T11:53:28+00:00", "modified_time": "2018-01-09T11:53:28+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "BAFTA Nominations Show Love For ‘Shape Of Water’, ‘Blade Runner’ & British Films; Shut Out ‘The Post’"}, "image": "https://pmcdeadline2.files.wordpress.com/2017/10/blade-runner.jpg?w=1024", "card": "summary_large_image", "creator": "@DeadlineNancy", "title": "BAFTA Nominations Show Love For ‘Shape Of Water’, ‘Blade Runner’ & British Films; Shut Out ‘The Post’", "description": "There’s much to chew on in this morning’s BAFTA Film Awards nominations. The 6,500-strong British Academy of Film and Television Arts tossed a lot of love towards titles with UK-centric…"}, "author": "Nancy Tartaglione", "content_type": "Article", "post_id": 1202239082, "title": "BAFTA Nominations Show Love For 'Shape Of Water', 'Blade Runner' & British Films; Shut Out 'The Post'", "published_at": "2018-01-09 03:53:28", "image": "https://pmcdeadline2.files.wordpress.com/2017/10/blade-runner.jpg?w=296&h=166&crop=1", "comment_count": 3, "tags": "The Shape Of Water", "topics": "International", "body": "There's much to chew on in this morning's BAFTA Film Awards nominations. The 6,500-strong British Academy of Film and Television Arts tossed a lot of love towards titles with UK-centric stories and/or pedigrees while embracing Guillermo del Toro's lyrical fantasy The Shape Of Water. The Fox Searchlight film, for which del Toro won the Directing Golden Globe on Sunday, scored a leading 12 nominations.\r\n\r\nThe group entirely snubbed Steven Spielberg's The Post, a serious and timely Oscar candidate, giving it zero mentions. (Is it notable that the American story walked away from Sunday's Golden Globes empty-handed, despite a gag at the top of the show that anticipated a sweep?)\r\n\r\nBlade Runner 2049, a critically-lauded movie that nevertheless faltered, also appears to be a favorite with BAFTA voters (the film's biggest offshore box office market is the UK). When Denis Villeneuve's name was listed among Best Director nominees this morning, there was cheering from the press corps at 195 Piccadilly in London. The Sony/Alcon sci-fi sequel otherwise largely scored nods in the tech categories with a total of eight mentions.\r\n\r\nWarner Bros' Dunkirk from Christopher Nolan also scored eight nominations including Best Film and Director along with tech nods. Working Title/Focus' Darkest Hour, which follows Winston Churchill against the backdrop of the crisis faced on the beaches at Dunkirk, has nine mentions including in the Best Film, Best British Film, Leading Actor and Supporting Actress fields. Gary Oldman as Churchill is seen as the frontrunner this awards season while this is the first major nomination for Kristin Scott Thomas in Darkest Hour.\r\n\r\nEric Fellner, co-chief of Working Title which nabbed a total 12 noms today, says of Darkest Hour, \"The name I see on all of these nominations is Joe Wright\" who did not score a directing bid. For Fellner, \"A film can't get this kind of recognition without a brilliant creative visionary at the head of it, that was our director.\"\r\n\r\nIn a bit of trivia, Scott Thomas last won a BAFTA in 1995 for Four Weddings And A Funeral, the same year that Hugh Grant also last won, and for the same film. He's nominated for Supporting in Paddington 2 this time around, the box office smash that's got further nods for Adapted Screenplay and Best British Film.\r\n\r\nAlthough set in the U.S. midwest, Fox Searchlight's nine-time BAFTA nominee Three Billboards Outside Ebbing Missouri was co-financed by the UK's Film4 and is written and directed by the British/Irish filmmaker Martin McDonagh. He scored nods today while the movie was also recognized in the Best Film, British Film, Cinematography, Supporting Actor and Actress races. It scooped the Globe on Sunday in the drama category, and also picked up Best Actress for Frances McDormand, among other wins. McDormand is also nominated at BAFTA but, in a surprise, won't be up against Judi Dench for Victoria And Abdul, with that film scoring just one BAFTA mention today for Hair & Make-Up.\r\n\r\nEntering the Leading Actress BAFTA race is Annette Bening for Film Stars Don't Die In Liverpool, another title with a British background that also picked up a surprise Leading Actor nod for Jamie Bell who last won in 2001 for Billy Elliot.\r\n\r\nBAFTA Chief Executive Amanda Berry says more British films were entered this year and points out that eight of the 20 performance nominees are British, repping a higher number than in recent memory.\r\n\r\nThe BAFTA's faced some criticism last year for a perceived lack of diversity among its nominees. Dee Rees' Mudbound was shut out this year, and the conversation might turn around a lack of female directors in the main category. Berry says, however, that BAFTAs new talent schemes are seeing increasing diversity. “Change is definitely happening.” There are also, she notes, five female directors nominated in categories outside the main field including in Outstanding Debut. Greta Gerwig's awards favorite Lady Bird earned her an Original Screenplay nomination, but it failed to impact the Director or Film categories, collecting only two further nods, for Saoirse Ronan and Laurie Metcalf.\r\n\r\nSays Fellner, \"I think we should all try harder to find more opportunities for women to direct more movies. That is something we are going to continue to do at Working Title and I'm sure we're going to see that in the industry.\"\r\n\r\nIn other notable categories, the Foreign Language race includes 2017's Globe winner Elle and Oscar winner The Salesman as well as this year's shortlisted Loveless. In the Documentary race, National Geographic scored its first ever BAFTA Film nomination for Jane.\r\n\r\nSee here for the full list of nominees. The BAFTAs will be handed out at London's Royal Albert Hall on February 18.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1515498808.0, "source": "https://deadline.com", "summary": ""}