{"url": "https://www.businessinsider.com/diane-kruger-in-the-fade-golden-globes-winner-2018-1", "text": "Diane Kruger talked about her career-defining performance in \"In the Fade,\" which won the Golden Globe for best foreign language film.\n\nShe could earn an Oscar nomination for the role.\n\nThe actress prepared for the role for six months leading up to filming.\n\nShe made the movie during the \"darkest time\" in her life as her stepfather had recently died.\n\n\n\nGerman actress Diane Kruger has built an impressive career, but after working steadily for 16 years, her new movie is getting her recognition she never thought she'd ever receive.\n\nOn Sunday, \"In the Fade\" (now playing in theaters) won the Golden Globe for best foreign language film. From German filmmaker Fatih Akin, it's highlighted by Kruger's tour-de-force performance. Playing Katja Sekerci, whose life collapses when her husband and son are victims of a terrorist bombing, we follow Katja as she takes illegal drugs to numb the pain, and then sitting in court to watch the two suspects, who turn out to be neo-Nazis, go through the trial for the bombing. That's when things get even more intense for Katja.\n\nWhen Business Insider sat down with Kruger at the Toronto International Film Festival in September, she didn't hold back when talking about the pain she dealt with to pull off this gut-wrenching performance, which won her the best actress prize at this year's Cannes Film Festival and garnered instant Oscar buzz.\n\nJason Guerrasio: How did you connect with Fatih Akin? Did you know him?\n\nDiane Kruger: No, I was just a fan. He's a big director in Germany — I grew up with his films. So when I became an actress and I left Germany 25 years ago, I always waited for this part to come out of Germany. I mean, I don't have an agent there, so I never get any offers from there. Five years ago, I was a jury member at Cannes, and he had a documentary playing there, so I went to his party to meet him. I told him I loved his work and if he ever wanted to make a movie with me, that would be amazing. So years later, he remembered and called me.\n\nGuerrasio: Did he talk to you over the phone about the part, or did he ask if he could send the script over?\n\nKruger: He kind of told me what it was about, and then he said he didn't want to send me the script — he wanted to come and meet me. So he came to Paris to meet me. And I was really nervous because I didn't think, upon meeting me, that he would think that I'm right for this part. This isn't typically the part I get offered. [Laughs.] And just judging from his voice over the phone, I don't think he was 100% sure I could do it either. So he came to my house, and I wore no makeup, and I really tried to dress down and be as raw as possible, and we just had this amazing talk. And I told him I was really, really scared of this part. I told him I wasn't sure I could do it.\n\nGuerrasio: But at the same time, was this a role you had been wishing for? Something to show your range?\n\nKruger: I just knew something felt right. I was really scared. Fatih told me I couldn't take another role until we shot this because he wanted me to prep for it. I mean, he is known for casting unknowns in his movies, so I think he got a lot of backlash at first for casting me. But I jumped off that cliff with him. It was a lonely time prepping for the movie. I didn't do anything else. I was living in Germany, meeting with victims of families that weren't necessarily suffering from terrorist attacks but murder and other brutal things, and I just allowed myself to be overcome by the grief that I felt.\n\nKruger in \"In the Fade.\" Magnolia\n\nGuerrasio: And this is the first German-produced movie you've ever starred in?\n\nKruger: That's right.\n\nGuerrasio: That's surprising. Was that because you got into modeling so early in your life?\n\nKruger: I left when I was 16, and I wasn't an actress then.\n\nGuerrasio: So was there a feeling with this movie that you wanted to be a part of something to show your talents to your home country?\n\nKruger: Yes and no. I wanted to do a German film that felt really German but also had an international presence. And Fatih, who is German but of Turkish descent, he himself has an international flavor. And this movie has such a universal feel. The focus is neo-Nazis, but it could have been jihadis, just some crazy person, whatever.\n\nGuerrasio: I think Americans will certainly relate to this movie. The grieving mother is universal.\n\nKruger: Exactly.\n\nGuerrasio: What did you want to get out of meeting victims? Did you take notes? Did you just want to interact with them?\n\nKruger: I guess the one thing I will never forget is that energy. More than individual stories, there was this energy that mothers especially having lost children had that I wasn't quite prepared to really take on. It was a wall of blackness. And that's regardless of how long ago it happened or how much or how little they talked to me about it — that energy was there. And it got more intense as time went on and the more people I met.\n\nGuerrasio: How long were you talking to victims?\n\nKruger: I started six months before shooting started.\n\nGuerrasio: Wow. Did it get to a point where you felt you had enough and just wanted to get started with shooting?\n\nKruger: Yeah. There definitely came a point where I was like, I can't take it anymore. And, unfortunately, when we started to film, my stepdad passed away. So honestly, it was probably the darkest time in my life, having to play that much grief and then coming home and feeling that on a personal level. It's a personal film because of that. We also shot in order, so you can imagine the first three weeks were just awful. There were scenes when I didn't even feel like I was acting. There were moments when I felt this movie is going to break me. I couldn't work for six months afterwards. I can still feel it.\n\nGuerrasio: So you haven't been able to kick this character yet?\n\nKruger: I still dream about it. I feel like a little bit is always going to be with me. What I take away most of it is this connection with people talking about loss. The empathy I felt — and maybe because we live in a time where these stories have become so common, but I'm reminded of how many Katjas every week are being created. I sometimes just sit in front of the TV, and I just sob uncontrollably.\n\nKruger after winning best actress at the Cannes Film Festival for \"In the Fade.\" Pascal Le Segretain/Getty\n\nGuerrasio: Has doing a role like this changed the parts you want to take on going forward in your career?\n\nKruger: To be honest, the two films I'm working on right now I signed on before \"In the Fade\" came out, and I haven't taken anything since. I'm sort of debating what I want to do next.\n\nGuerrasio: Is it hard to promote this film, seeing as you have to continue talking about the process of creating this character, which obviously wasn't pleasant?\n\nKruger: No, I want to. I think it's a very important film in my life. I feel it's my baby. I've never been invested in anything like this. I think it's an inspiring movie. In Cannes, which was the first time I saw it with an audience, I was so taken aback by the reaction. There must be pictures of me just looking shocked. It's weird because, in the past, people have come up to me and said they love my work, like for \"Inglourious Basterds,\" but I feel this is my first big starring role.", "images": ["https://i.insider.com/59b892219803c5df008b52c2?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/59b943849803c5b3308b4e1c?width=1200&format=jpeg", "https://i.insider.com/59b88ffb9803c578288b4d26?width=24&format=jpeg&auto=webp", "https://i.insider.com/59b8932e38d20d2b008b5458?width=600&format=jpeg&auto=webp", "https://i.insider.com/59b88ffb9803c578288b4d26?width=600&format=jpeg&auto=webp", "https://www.businessinsider.com/diane-kruger-in-the-fade-golden-globes-winner-2018-1?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/59b943849803c5b3308b4e1c?width=1200&format=jpeg", "keywords": [], "authors": ["Jason Guerrasio"], "canonical_link": "https://www.businessinsider.com/diane-kruger-in-the-fade-golden-globes-winner-2018-1", "title": "Diane Kruger's new movie won the Golden Globe for best foreign film — and it was so emotionally devastating she couldn't work for 6 months", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Diane Kruger's new movie won the Golden Globe for best foreign film — and it was so emotionally devastating she couldn't work for 6 months", "date": "2018-01-08", "news_keywords": "Movies, Prime, BI Graphics, Diane Kruger, In the Fade, Toronto International Film Festival 2017, Toronto International Film Festival, Golden Globes 2018, Jason Guerrasio", "description": "Diane Kruger's movie \"In the Fade\" won a Golden Globe, and the Oscar hype for her performance builds.", "author": "Jason Guerrasio", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Entertainment", "og": {"title": "Diane Kruger's new movie won the Golden Globe for best foreign film — and it was so emotionally devastating she couldn't work for 6 months", "description": "Diane Kruger's movie \"In the Fade\" won a Golden Globe, and the Oscar hype for her performance builds.", "type": "article", "url": "https://www.businessinsider.com/diane-kruger-in-the-fade-golden-globes-winner-2018-1", "image": "https://i.insider.com/59b943849803c5b3308b4e1c?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Diane Kruger's new movie won the Golden Globe for best foreign film — and it was so emotionally devastating she couldn't work for 6 months", "sailthru.date": "2018-01-08", "sailthru.tags": "Movies, Prime, BI Graphics, Diane Kruger, In the Fade, Toronto International Film Festival 2017, Toronto International Film Festival, Golden Globes 2018, Jason Guerrasio", "sailthru.description": "Diane Kruger's movie \"In the Fade\" won a Golden Globe, and the Oscar hype for her performance builds.", "sailthru.author": "Jason Guerrasio", "sailthru.verticals": "thewire, media", "sailthru.image.full": "https://i.insider.com/59b892219803c5df008b52c2?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/59b892219803c5df008b52c2?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@EntInsider"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "variant", "back-to-top": "control", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "control", "subscribe-smallest-price": "variant"}, "viking-id": "5a539e7a3225ded5018b4f46", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": ["https://www.youtube.com/embed/UyjnzhXJlHU"], "publish_date": 1515340800.0, "source": "https://www.businessinsider.com", "summary": ""}