{"url": "https://www.brides.com/story/chrissy-teigen-and-john-legend-are-having-the-best-time-at-the-grammys", "text": "Hollywood's most adorable celebrity lovebirds John Legend and Chrissy Teigen seem to fall more in love with each other every day—and us with them! We rounded up some of the power couple's sweetest marriage quotes as they celebrate their fifth wedding anniversary. Narrowing down the list to was no easy feat as the incredibly affectionate duo is always gushing about life together, from their beautiful daughter and adorable son to their highly enviable date nights. Whether they are lighting up the red carpet, or enjoying a lazy Sunday in bed, the couple constantly shows us the depth of their love for one another (and makes our romantic hearts melt!).\n\nChrissy and John make us swoon almost daily with their adoration of each other, and they are not afraid to show their love on social media. For John's 37th birthday, Chrissy took to Instagram to post a romantic portrait of the pair dressed to the nines—John suited up in a gorgeous tux and Chrissy in a sleek black dress and stilettos—with unmistakable passion in their eyes. Chrissy captioned the quote with the following loving words:\n\n\"Another year with you has flown by and I am so proud of what you've accomplished. Every year, I wonder how things can even get better but you always find a way.\n\nHappy 37th birthday to the most wonderful, hard-working, loving being I, and anyone who has ever met you, have ever known.\n\nWe love you, my handsome old man. Also I'm sorry I thought you were 37 all year.\"\n\nWith life together getting better each year, it's no wonder that these two are madly in love.\n\nChristopher Polk\n\nThe couple's loving comments are not limited to Instagram on special occasions. The couple has plenty of cute things to say about each other all the time. In one particular Twitter Q&A, John shared one of the keys to what makes their marriage so sweet, saying:\n\n\"We support each other in everything that we do. I love seeing her succeed at the things she loves to do and she loves seeing me succeed at things that I love to do. That's the way you should be with your partner.\" We couldn't agree more!\n\nThe couple is known to speak candidly about their marriage, giving us a real look into the lows as well as the highs of any relationship. Following the birth of their daughter Luna, Chrissy bravely opened up about her battle with postpartum depression, and her husband was right by her side with unwavering support of her well-being and recovery, stating the below in an interview with PEOPLE Magazine:\n\n“For me as a husband, it was my job to do the best I could to support her and understand what she was going through and do whatever I could do to help her. I feel like that’s the least I could do.\" He went on to say, \"It’s a difficult thing to be a new father and for my wife to be a new mother. [Parenting] advances the level of partnership you share. It’s exciting to see how we as a couple grow together and learn how to react to the challenges and the joys.”\n\nThrough thick and thin, John and Chrissy always have each other's back.\n\nKevin Mazur\n\nAfter six months of marriage, John and Chrissy sat down for an interview with A Drink With, wherein they discussed their take on the often finite nature of celebrity marriages, noting their devotion and commitment to each other. John gave his take:\n\n“I think a lot of it is because when you’re in our position you’re used to having everything you want right away and not having to compromise. I think some people don’t want to put in the work during the hard times to make it work. I have reached the pinnacle of the perfect girl for me... You really just have to decide that you’re not going to get divorced and then make it work.”\n\nThese two are clearly in it for the long haul, so we will undoubtedly see many more adorable moments from the pair as the years go by.", "images": ["https://www.brides.com/thmb/Hwv_OGe6Fx2u9VORzjL8rqajcKI=/500x350/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__59b98ef11bd66a546299c188__11-93afbd2e94d845529ffb3216485bf81f.jpeg", "https://www.brides.com/thmb/CeVxXoIFMvMfO1pmsxHuN7TYT0Y=/2432x1368/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__59b98ef11bd66a546299c188__169-87968c54122a4e3582052fb6d5a1cd65.jpeg", "data:image/svg+xml,%3Csvg width=%274142%27 height=%273249%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%274265%27 height=%272839%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://:0"], "top_img": "https://www.brides.com/thmb/CeVxXoIFMvMfO1pmsxHuN7TYT0Y=/2432x1368/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__59b98ef11bd66a546299c188__169-87968c54122a4e3582052fb6d5a1cd65.jpeg", "keywords": [], "authors": ["Ariella Goldsmith"], "canonical_link": "https://www.brides.com/story/john-legend-and-chrissy-teigen-love-quotes", "title": "The Cutest Things John Legend and Chrissy Teigen Have Said About Marriage", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Celebrating Hollywood's most adorable lovebirds, John Legend and Chrissy Teigen, on their wedding anniversary", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Ariella Goldsmith", "sailthru.tags": "news,weddings-and-celebs", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/story/john-legend-and-chrissy-teigen-love-quotes", "title": "The Cutest Things John Legend and Chrissy Teigen Have Said About Marriage", "description": "Celebrating Hollywood's most adorable lovebirds, John Legend and Chrissy Teigen, on their wedding anniversary", "image": "https://www.brides.com/thmb/CeVxXoIFMvMfO1pmsxHuN7TYT0Y=/2432x1368/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__59b98ef11bd66a546299c188__169-87968c54122a4e3582052fb6d5a1cd65.jpeg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "The Cutest Things John Legend and Chrissy Teigen Have Said About Marriage", "description": "Celebrating Hollywood's most adorable lovebirds, John Legend and Chrissy Teigen, on their wedding anniversary", "image": "https://www.brides.com/thmb/Bo5noaHYfnl1jrvsqzKNnv7biLg=/2436x2436/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__59b98ef11bd66a546299c188__11-93afbd2e94d845529ffb3216485bf81f.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.56.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.56.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.56.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.56.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.56.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}