{"url": "https://deadline.com/2017/11/amazon-the-lord-of-the-rings-tv-series-multi-season-commitment-1202207065/", "text": "In its quest to launch a hit fantasy series of the Game of Thrones caliber, Amazon has closed a massive deal — said to be close to $250 million — to acquire global TV rights to The Lord of the Rings, based on the fantasy novels by J.R.R. Tolkien. The streaming service has given a multi-season commitment to a LOTR series in the pact, which also includes a potential spinoff series.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nThe LOTR original series, a prequel to Tolkien’s The Fellowship of the Ring, will be produced by Amazon Studios in cooperation with the Tolkien Estate and Trust; HarperCollins; and New Line Cinema, a division of Warner Bros. Entertainment, which produced the hugely successful LOTR movie franchise.\n\nNo details about the deal were disclosed, but it believed to be dwarfing any TV series pact to date with a whopping price tag attached.\n\nAmazon, Netflix and HBO had been approached by the Tolkien estate, who had been shopping the project. It came with an upfront rights payment said to be in the $200 million-$250 million range, and I hear Amazon landed the rights by paying close to $250 million. That is just for the rights, before any costs for development, talent and production, in proposition whose finances industry observers called “insane.” It is a payment that is made sight unseen as there is no concept, and there are no creative auspices attached to the possible series. On top of that, the budget for a fantasy series of that magnitude is likely to be $100 million-$150 million a season.\n\n“The Lord of the Rings is a cultural phenomenon that has captured the imagination of generations of fans through literature and the big screen,” said Sharon Tal Yguado, Head of Scripted Series at Amazon Studios. “We are honored to be working with the Tolkien Estate and Trust, HarperCollins and New Line on this exciting collaboration for television and are thrilled to be taking The Lord of the Rings fans on a new epic journey in Middle Earth.”\n\nSet in Middle Earth, the television adaptation will explore new storylines preceding Tolkien’s The Fellowship of the Ring. I hear that there are some creative restrictions imposed by the rights holders on what can be done and what can’t be done in a LOTR TV series.\n\n“We are delighted that Amazon, with its longstanding commitment to literature, is the home of the first-ever multi-season television series for The Lord of the Rings,” said Matt Galsor, a representative for the Tolkien Estate and Trust and HarperCollins. “Sharon and the team at Amazon Studios have exceptional ideas to bring to the screen previously unexplored stories based on J.R.R. Tolkien’s original writings.”\n\nGiven Amazon’s mandate to launch a big fantasy series of the scope of Game of Thrones, which comes directly from honcho Jeff Bezos and Amazon’s deep coffers, the company was considered the leading contender for a Lord of the Rings series. Bezos has been hands-on involved in the matters of entertainment division Amazon Studios following the purge of its top executives, led by Roy Price, and has been taking meetings and making calls to agents.\n\nThe Lord of the Rings deal eclipses some big-ticket series commitments Amazon has made during the past couple of years: $80 million for the six-episode Woody Allen show Crisis in Six Scenes, $70 million-plus for Matt Weiner’s eight-episode The Romanoffs and $160 million for two seasons of David O. Russell’s series, which now has been axed after about $40 million spent. (The last two series originally came from The Weinstein Co., which no longer has involvement in The Romanoffs)\n\nThe Tolkien estate and publisher HarperCollins filed the massive lawsuit in November 2012 against Warner Bros., its subsidiary New Line and Middle-earth Enterprises — a division of Rings’ Hobbit rightsholder the Saul Zaentz Co. — claiming copyright infringement and breach of contract over video games, online slot machines and other digital merchandising.\n\nWith the $80 million lawsuit settled in July, the two sides have gotten on better terms following the bitter feud. The Tolkien estate shopped the TV series with reps for feps for New Line Cinema. Warner Bros. TV, which would’ve been a logical partner, is not a studio on the LOTR series, which will be produced by Amazon Studios. I hear Amazon wanted to produce the series itself.\n\nA LOTR TV series will provide corporate synergy for Amazon, the world’s leading book seller. The Lord of the Rings novels was named Amazon customers’ favorite book of the millennium in 1999. Still, that world already has been extensively explored on-screen with three great Lord of the Rings movies and three Hobbit films.\n\nLaunched at the 2001 Cannes Film Festival with The Lord of the Rings: The Fellowship of the Ring, Peter Jackson’s LOTR trilogy was a global phenomenon. Starring Elijah Wood, In McKellen, Liv Tyler, Sean Bean, Viggo Mortensen, Sean Astin, Cate Blanchett, Orlando Bloom and others, the three films combined to gross more than $2.9 billion worldwide. LOTR: The Two Towers was released in 2002, and The Return of the King arrived the following year, becoming only the second film to top $1 billion worldwide. That third installment won 11 Oscars, including Best Picture, Director and Adapted Screenplay. The previous two combined to win six Academy Awards in crafts categories.", "images": ["https://pmcdeadline2.files.wordpress.com/2017/02/lotr.jpg?w=1024", "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F11%2Famazon-the-lord-of-the-rings-tv-series-multi-season-commitment-1202207065%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202207065&comment_count=98", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pmcdeadline2.files.wordpress.com/2016/09/amazon-featured.jpg?w=343&h=193", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/02/lotr.jpg?w=1024", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2017/11/amazon-the-lord-of-the-rings-tv-series-multi-season-commitment-1202207065/", "title": "Amazon Sets ‘The Lord of the Rings’ TV Series In Mega Deal With Multi-Season Commitment", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "In its quest to launch a hit fantasy series, Amazon has acquired the TV rights to The Lord of the Rings with a multi-season commitment.", "news_keywords": "Amazon, The Lord Of The Rings", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Amazon Sets ‘The Lord of the Rings’ TV Series In Mega Deal With Multi-Season Commitment", "url": "https://deadline.com/2017/11/amazon-the-lord-of-the-rings-tv-series-multi-season-commitment-1202207065/", "description": "In its quest to launch a hit fantasy series of the Game of Thrones caliber, Amazon has closed a massive deal — said to be close to $250 million — to acquire global TV rights to The Lord…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/02/lotr.jpg?w=1024", "width": 1024, "height": 530, "alt": "Lord Of The Rings: Return Of The King"}, "locale": "en_US"}, "article": {"published_time": "2017-11-13T18:09:50+00:00", "modified_time": "2017-11-14T02:45:34+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Amazon Sets ‘The Lord of the Rings’ TV Series In Mega Deal With Multi-Season Commitment"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/02/lotr.jpg?w=1024", "alt": "Lord Of The Rings: Return Of The King"}, "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "Amazon Sets ‘The Lord of the Rings’ TV Series In Mega Deal With Multi-Season Commitment", "description": "In its quest to launch a hit fantasy series, Amazon has acquired the TV rights to The Lord of the Rings with a multi-season commitment."}, "author": "Nellie Andreeva", "content_type": "Article", "post_id": 1202207065, "title": "Amazon Sets 'The Lord of the Rings' TV Series In Mega Deal With Multi-Season Commitment", "published_at": "2017-11-13 10:09:50", "image": "https://pmcdeadline2.files.wordpress.com/2017/02/lotr.jpg?w=296&h=166&crop=1", "comment_count": 98, "tags": "The Lord Of The Rings", "topics": "TV", "body": "In its quest to launch a hit fantasy series of the Game of Thrones caliber, Amazon has closed a massive deal -- said to be close to $250 million -- to acquire global TV rights to The Lord of the Rings, based on the fantasy novels by J.R.R. Tolkien. The streaming service has given a multi-season commitment to a LOTR series in the pact, which also includes a potential spinoff series.\r\n\r\nThe LOTR original series, a prequel to Tolkien’s The Fellowship of the Ring, will be produced by Amazon Studios in cooperation with the Tolkien Estate and Trust; HarperCollins; and New Line Cinema, a division of Warner Bros. Entertainment, which produced the hugely successful LOTR movie franchise.\r\n\r\nNo details about the deal were disclosed, but it believed to be dwarfing any TV series pact to date with a whopping price tag attached.\r\n\r\n\r\n\r\nAmazon, Netflix and HBO had been approached by the Tolkien estate, who had been shopping the project. It came with an upfront rights payment said to be in the $200 million-$250 million range, and I hear Amazon landed the rights by paying close to $250 million. That is just for the rights, before any costs for development, talent and production, in proposition whose finances industry observers called “insane.” It is a payment that is made sight unseen as there is no concept, and there are no creative auspices attached to the possible series. On top of that, the budget for a fantasy series of that magnitude is likely to be $100 million-$150 million a season.\r\n\r\n“The Lord of the Rings is a cultural phenomenon that has captured the imagination of generations of fans through literature and the big screen,” said Sharon Tal Yguado, Head of Scripted Series at Amazon Studios. “We are honored to be working with the Tolkien Estate and Trust, HarperCollins and New Line on this exciting collaboration for television and are thrilled to be taking The Lord of the Rings fans on a new epic journey in Middle Earth.”\r\n\r\nSet in Middle Earth, the television adaptation will explore new storylines preceding Tolkien’s The Fellowship of the Ring. I hear that there are some creative restrictions imposed by the rights holders on what can be done and what can't be done in a LOTR TV series.\r\n\r\n“We are delighted that Amazon, with its longstanding commitment to literature, is the home of the first-ever multi-season television series for The Lord of the Rings,” said Matt Galsor, a representative for the Tolkien Estate and Trust and HarperCollins. “Sharon and the team at Amazon Studios have exceptional ideas to bring to the screen previously unexplored stories based on J.R.R. Tolkien’s original writings.”\r\n\r\nGiven Amazon’s mandate to launch a big fantasy series of the scope of Game of Thrones, which comes directly from honcho Jeff Bezos and Amazon’s deep coffers, the company was considered the leading contender for a Lord of the Rings series. Bezos has been hands-on involved in the matters of entertainment division Amazon Studios following the purge of its top executives, led by Roy Price, and has been taking meetings and making calls to agents.\r\n\r\nThe Lord of the Rings deal eclipses some big-ticket series commitments Amazon has made during the past couple of years: $80 million for the six-episode Woody Allen show Crisis in Six Scenes, $70 million-plus for Matt Weiner’s eight-episode The Romanoffs and $160 million for two seasons of David O. Russell’s series, which now has been axed after about $40 million spent. (The last two series originally came from The Weinstein Co., which no longer has involvement in The Romanoffs)\r\n\r\nThe Tolkien estate and publisher HarperCollins filed the massive lawsuit in November 2012 against Warner Bros., its subsidiary New Line and Middle-earth Enterprises — a division of Rings’ Hobbit rightsholder the Saul Zaentz Co. — claiming copyright infringement and breach of contract over video games, online slot machines and other digital merchandising.\r\n\r\nWith the $80 million lawsuit settled in July, the two sides have gotten on better terms following the bitter feud. The Tolkien estate shopped the TV series with reps for feps for New Line Cinema. Warner Bros. TV, which would've been a logical partner, is not a studio on the LOTR series, which will be produced by Amazon Studios. I hear Amazon wanted to produce the series itself.\r\n\r\nA LOTR TV series will provide corporate synergy for Amazon, the world's leading book seller. The Lord of the Rings novels was named Amazon customers’ favorite book of the millennium in 1999. Still, that world already has been extensively explored on-screen with three great Lord of the Rings movies and three Hobbit films.\r\n\r\nLaunched at the 2001 Cannes Film Festival with The Lord of the Rings: The Fellowship of the Ring, Peter Jackson’s LOTR trilogy was a global phenomenon. Starring Elijah Wood, In McKellen, Liv Tyler, Sean Bean, Viggo Mortensen, Sean Astin, Cate Blanchett, Orlando Bloom and others, the three films combined to gross more than $2.9 billion worldwide. LOTR: The Two Towers was released in 2002, and The Return of the King arrived the following year, becoming only the second film to top $1 billion worldwide. That third installment won 11 Oscars, including Best Picture, Director and Adapted Screenplay. The previous two combined to win six Academy Awards in crafts categories.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1510596590.0, "source": "https://deadline.com", "summary": ""}