{"url": "https://www.townandcountrymag.com/society/tradition/a20745869/prince-harry-meghan-markle-wedding-breaking-royal-tradition-protocol/", "text": "Prince Harry and Meghan Markle's wedding has been one for the history books—in part because of how the couple chose to do things their own way.\n\nHere are all the ways their celebration broke from royal tradition:\n\nMeghan is divorced.\n\nGetty Images\n\nThere was a time when a senior royal having a relationship with a divorcee was seen as disastrous. Just 17 years after Edward VIII abdicated in order to marry the twice-divorced Wallis Simpson, Princess Margaret was forced to give up her love affair with Group Captain Peter Townsend.\n\nAnd over half a century later, Prince Charles was able to finally marry his divorced long-term partner Camilla Parker-Bowles because of new ruling from the Church of England, but there was still public conflict surrounding the couple’s union.\n\nBut no more! Meghan has been welcomed into the Royal Family with open arms, and the British public approves of its new princess.\n\nThere wasn't a kiss on the Buckingham Palace balcony.\n\nEver since the weddings of Queen Victoria’s children, it has been customary for royal couples to take to the balcony at Buckingham Palace to acknowledge the crowds below.\n\nThen in 1981, Charles and Diana were the first royal couple to share a kiss in front of the cheering crowds, later followed by Andrew and Sarah, and William and Kate. Because Harry and Meghan aren’t getting married in London, there was no balcony appearance–but that didn't stop them from sharing a kiss for the cameras in Windsor.\n\nGetty Images\n\nThe bride and groom spent the night before their wedding in separate hotels.\n\nCliveden House Courtesy Cliveden House\n\nRoyal couples usually spend the night before their wedding at royal residences.Prince Charles and Prince Andrew both stayed at Buckingham Palace the night before their weddings, and their brides nearby at royal residence Clarence House. Although Kate stayed with her family at The Goring Hotel, William was at Clarence House the night before his big day, along with his brother Harry.\n\nHowever it’s all different this time around. While there are several residences on the Windsor estate that could have served as a last-night base for Harry and Meghan, they chose to stay at Coworth Park and Cliveden House luxury hotels respectively.\n\nThe cake flavor came out of left field.\n\nRoyal weddings cakes are usually multi-tiered and highly traditional rich fruit cakes encased in marzipan and a thick crust of white icing, however Harry and Meghan have gone for lemon and elderflower cake covered with buttercream and fresh flowers, to capture the ‘bright flavours of Spring.’\n\n🎥 Watch as baker Claire Ptak begins work on the #RoyalWedding Cake! pic.twitter.com/OTdcF9hc0a — The Royal Family (@RoyalFamily) May 18, 2018\n\nBridesmaids and pageboys weren't just from the royal side.\n\nGetty Images\n\nThe royal protocol card is a pretty hefty one, and it has meant in the past that it trumps every aspect of a royal wedding. This usually means that most if not all of the bridesmaids and page boys are pulled from the royal pool.\n\nApart from Pippa Middleton, this was even the case as recently as William and Kate’s wedding in 2011, where all seven of the junior attendants were connected to William. However with Harry and Meghan, it was an entirely even split, with three of the six bridesmaids and two of the four page boys connected to the bride.\n\nThe bride wasn't be given away by her father.\n\nGetty Images\n\nLest we forget. . . This is the one rule-bend that Harry and Meghan most definitely didn’t want, but the rollercoaster of events relating to Meghan’s side of the family in the lead up to her big day meant that there was a significant departure from the royal norm. Meghan’s father Thomas Markle was due to walk his daughter down the aisle, but after suffering a heart-attack and undergoing subsequent surgery three days before the wedding, he wasn’t well enough to fly, and in a surprise twist it was be Prince Charles who did the honors.\n\nA very star-studded guest list\n\nGetty Images\n\nThere is often a smattering of familiar faces at a royal wedding, but Harry and Megan’s big day was filled with a who’s who of celebrities from both side of the Atlantic, including George and Amal Clooney, Oprah Winfrey, Idris Elba, Tom Hardy, Serena Williams, David and Victoria Beckham, James Corden, Carey Mulligan and Marcus Mumford, and the cast of Suits.\n\nHarry is wearing a wedding ring\n\nNeither Harry’s grandfather Prince Philip nor brother Prince William wear wedding bands, and his father Prince Charles chooses to wear a signet ring on his pinkie finger, but Harry himself has chosen a platinum band which he will wear on his ring finger.\n\nA ceremony with a significant multicultural content\n\nGetty Images\n\nThe address given by the presiding bishop of the American Episcopal Church, Bishop Michael Curry, and he gave a rousing speech all about the power of love, opening with the words of civil rights leader Martin Luther King Jr, “We must discover the power of love, the redemptive power of love. And when we do that, we will be able to make of this old world a new world. Love is the only way.” Later in the service, gospel singers the Kingdom Choir raised the roof with their rendition of the Ben E. King classic Stand By Me.\n\nA spot of hand-holding\n\nGetty Images\n\nHarry and Meghan have already broken the royal mold on their royal engagements by holding hands as they arrive, and their tender physical interaction was also seen during the service. The couple broke with traditional royal protocol by holding hands throughout.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=1.00xw:0.796xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-943716302-1526635948.jpg?crop=1.00xw:0.752xh;0,0.139xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960052704-1526729835.jpg?crop=1xw:0.7496339677891655xh;center,top&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=1.00xw:0.796xh;0,0&resize=1200:*", "keywords": [], "authors": ["Marcia Moody", "Marcia Moody Has Been Reporting On The Royal Family For Six Years", "Is The Author Of Kate", "A Biography", "Harry", "A Biography."], "canonical_link": "https://www.townandcountrymag.com/society/tradition/a20745869/prince-harry-meghan-markle-wedding-breaking-royal-tradition-protocol/", "title": "All the Ways Prince Harry and Meghan Markle's Wedding Broke Royal Tradition", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "All the Ways Prince Harry and Meghan Markle's Wedding Broke Royal Tradition", "description": "From the flavor of the cake to who's in the royal wedding party.", "url": "https://www.townandcountrymag.com/society/tradition/a20745869/prince-harry-meghan-markle-wedding-breaking-royal-tradition-protocol/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=1.00xw:0.796xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-05-19 09:14:55", "published_time": "2018-05-19 05:53:00", "section": "Heritage", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=1.00xw:0.796xh;0,0&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "All the Ways Meghan Markle's Wedding Is Breaking Royal Tradition - Royal Wedding Breaking Protocol", "description": "Prince Harry and Meghan Markle aren't afraid to bend the rules a little bit. Here are all the ways the royal wedding is breaking tradition.", "keywords": "prince harry, meghan markle, royal wedding, meghan markle wedding, royal wedding traditions, royal protocol, breaking protocol", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=0.630xw:1.00xh;0.167xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Society,society,tradition", "sailthru.date": "2018-05-19T17:53:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=1.00xw:0.796xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960088046-1526742410.jpg?crop=0.630xw:1.00xh;0.167xw,0", "sailthru.socialtitle": "All the Ways Prince Harry and Meghan Markle's Wedding Broke Royal Tradition", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1526680380.0, "source": "https://www.townandcountrymag.com", "summary": ""}