{"url": "https://www.washingtonpost.com/news/business/wp/2018/05/02/boy-scouts-drop-the-boy-as-they-welcome-girls-to-scouts-bsa/", "text": "“Scouts BSA perfectly represents the new, inclusive program for older Scouts that the Boy Scouts of America is proud to offer,” said Effie Delimarkos, a spokeswoman.\n\nChief Scout Executive Michael Surbaugh told the Associated Press that many names were considered and that the ultimate goal was “to land on something that evokes the past but also conveys the inclusive nature of the program going forward.” Surbaugh said he expects that kids enrolled in Scouts BSA would refer to themselves just as “scouts,” without “girl” or “boy” identifiers.\n\nAD\n\nAD\n\nIn October, Boy Scouts of America announced it would allow girls into the Cub Scouts program, a step in allowing them to earn the coveted Eagle Scout ranking. So far, 3,000 girls have joined roughly 170 Cub Scout packs in the first rollout of the new policy. Scouts BSA will begin admitting female members next year.\n\nAlso on Wednesday, Scouts BSA announced a new campaign for the Cub Scouts, “Scout Me In,” that features female Cub Scouts.\n\nThe organization has been forced to find new ways of bringing kids and their families into scouting, especially as its membership has dropped by about a third since 2000. But the changes also reflect shifting social and cultural norms that expect programs to be equally available to boys and girls.\n\nAD\n\nStill, Girl Scouts of the USA, a separate organization, which has opposed efforts by Boy Scouts of America to recruit girls to its ranks, said the name change was not much more than that — noting that it came without any new girl-focused programming.\n\nAD\n\n“We proudly own the ‘Girl’ in Girl Scouts,” a spokesperson said. “Since our inception, Girl Scouts of the USA have been about putting girls front and center, ensuring that everything we do is not only with their best interests in mind but equips them to be the fearless leaders and change makers who our 50 million alumnae prove to be.”\n\nScouts BSA, the program for 11-to-17-year-olds, will stay divided along gender lines. Single-sex troops will have the chance to work toward the Eagle Scout rank.\n\nAD\n\nSurbaugh told the AP that having separate units for boys and girls would address concerns that girls joining the program for the first time might start off behind in the long climb to leadership opportunities.\n\nThe group’s umbrella organization will still be called Boy Scouts of America, and the program for younger children will keep the Cub Scouts moniker.\n\nAD\n\nSome were not impressed with the new name. One Twitter user wrote that “political correctness ruins everything in life. It destroys even the most innocent of institutions.” Another wrote that “Boys belong in BOY scouts. Girls belong in GIRL Scouts.”\n\nThe Boy Scouts of America has more than 2.4 million youth participants and nearly 1 million adult volunteers, according to its website.\n\nAD\n\nIn 2013, the Boy Scouts ended its prohibition on openly gay youths. Two years later, it said it would allow gay scout leaders as well.\n\nIn January 2017, the Boy Scouts said it would allow transgender children to join its programs.\n\n“As we enter a new era for our organization, it is important that all youth can see themselves in Scouting in every way possible,” Delimarkos said.\n\nRead more:", "images": ["https://www.washingtonpost.com/resizer/VO_FRAtrCtvpXOhsvcEV-X7LWdQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IQAHUS6FHY74ZMBZ3XNKCJNVDI.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/99364408-8c15-40fa-a769-daa2aa15a1c4.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XSEWQ3ZUOA66BPFDFDXCKF55VI.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/VO_FRAtrCtvpXOhsvcEV-X7LWdQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IQAHUS6FHY74ZMBZ3XNKCJNVDI.jpg", "keywords": [], "authors": ["Rachel Siegel", "National Business Reporter"], "canonical_link": "https://www.washingtonpost.com/news/business/wp/2018/05/02/boy-scouts-drop-the-boy-as-they-welcome-girls-to-scouts-bsa/", "title": "Boy Scouts drop the ‘boy’ as they welcome girls to Scouts BSA", "meta_data": {"description": "The group has made moves to include girls in its ranks over the past few years, most recently by giving them entry into the Cub Scouts.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/business/wp/2018/05/02/boy-scouts-drop-the-boy-as-they-welcome-girls-to-scouts-bsa/", "image": "https://www.washingtonpost.com/resizer/VO_FRAtrCtvpXOhsvcEV-X7LWdQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IQAHUS6FHY74ZMBZ3XNKCJNVDI.jpg", "title": "Boy Scouts drop the ‘boy’ as they welcome girls to Scouts BSA", "description": "The group has made moves to include girls in its ranks over the past few years, most recently by giving them entry into the Cub Scouts."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Boy Scouts drop the ‘boy’ as they welcome girls to Scouts BSA", "description": "The group has made moves to include girls in its ranks over the past few years, most recently by giving them entry into the Cub Scouts."}, "last_updated_date": "2019-03-28T20:57:25.084Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1525190400.0, "source": "https://www.washingtonpost.com", "summary": ""}