{"url": "https://web.archive.org/web/20180919171522/https://www.newsweek.com/total-divas-season-8-lana-nia-jax-natalya-paige-return-1128849", "text": "The eighth season of the popular WWE and E! reality series, Total Divas, is looking like the biggest of the show’s history.\n\nLana, Nia, Natalya, Naomi, Nikki and Brie return to give viewers a look at the lives of the women of the WWE, starting at WrestleMania 34. And after an extended hiatus, Paige returns to the show and looks to make up for lost time with her fellow superstars.\n\nBut the “Divas” are in the midst of the Women’s Revolution, and all eyes are on them as they continue to make history for the female superstars of the WWE.\n\nNewsweek got to speak with Natalya, Nia Jax and Lana about the upcoming season of Total Divas.\n\nTotal Divas Season 8 premieres Wednesday, Sept. 19 at 8 p.m. on E!\n\nEditor’s Note: This interview has been lightly edited for clarity and length.\n\nWhat are you most excited for everyone to see this season?\n\nSee all of the best photos of the week in these slideshows\n\nNia Jax: I’m excited to see all of us women participate in it. Some of us had a bit of a wardrobe malfunction [laughs]. Paige’s comeback, we’re so excited about that.\n\nNatalya: There’s so much this season. I was saying to the girls earlier that this could be three seasons combined. Because you never know what’s going to happen in the span of six months when we’re taping the show. Life happens. And so much life happened during this six months—hardships and hugs, tears and meltdowns, breakups, fights and laughters, vacations, celebrations and barbeques.\n\nI had a barbeque from hell that Lana was a part of, I won’t get into that, but Titus O’Neil found a sticker on a tomato that I used for a salad. I didn’t mean to NOT wash the tomato and he called me out.\n\nLana: It was a barbeque where the barbeque didn’t work.\n\nNatalya: And then the air conditioner broke and my mom and dad came back with Lana four hours later after going to Publix that’s only 10 minutes away.\n\n\n\nLana: We had a good time.\n\n\n\nNatalya: My parents are obsessed with Lana.\n\nNia: You’ll have to watch this season, it’s jam-packed. But Nattie’s been on, and I’ve heard from Lana and Nikki that this is the best season they’ve been a part of. Really excited for it.\n\nE!\n\nDoes the travel and being with each other so much make working with each other easier or better on the show?\n\nNia: We go through our ups and downs. Just like when Lana was on RAW, we clicked immediately. Then she moved to SmackDown and I miss her a lot, even though she drives me nuts. We’re crazy sisters. Sometimes I’m sick of them, but at the end of the day we love each other.\n\nNatalya: It’s a sisterhood. We can bash each other but nobody else can bash us. I can say Lana drives me crazy but no one else can. It’s like our parents, they love us even though we drive them crazy.\n\nHow was it to have Paige back with the crew?\n\nNia: Oh gosh, take it away Lana. [laughs]\n\nLana: I think it’s amazing. Paige and I are VERY opinionated human beings. And we stand up for our beliefs and opinions. Throughout our friendship and years of knowing each other, we’ve butted heads and had drag out fights and then we make up and apologize. That’s a real thing that’s happened with Paige and I, and you’re going to see that, and a moment that’s intense.\n\nIt was really hard, because to be honest sometimes what sisters should be is a reflection of a mirror and real friends. Paige said some things to me that hurt me, but were true. And I kind of had to be honest with myself like “yea I can be a brat and selfish” and can put myself first. And the truth hurts, but sometimes the only way we can change is by hearing the truth and I love Paige with all my heart and I’m glad to have a friend like that even if she goes a little AWOL at times.\n\nE!\n\nNia: [laughs] trust me you’re going to love this. It starts off psychotic and everybody’s all like “where is this going to go?” When we were in the middle of it, me and Nattie were like “I feel like we just walked into a big shitstorm.”\n\nLana: And I’m bawling at one point.\n\nNia: And towards the end of the trip it’s probably the best vacation I’ve ever been on, the most uplifting. I told Lana and Nattie that it changed me as a person and made us all better.\n\nLana: Even with Paige and I, we got so much closer because of this. And I think it’s important to realize that we come from all different backgrounds and cultures and different families. And we have to take a step back and say “ok, you act this way because of your background and family and I act this way because of mine” and that’s an important life lesson. But Paige and I are closer than ever.\n\nNia: Not as close as me and Paige but whatever [laughs].\n\nLana: Even seeing the first few episodes about Paige’s retirement. Get your tissue boxes out.\n\n\n\nNatalya: It’s heart-wrenching.\n\n\n\nLana: She gives hope to people. Because if one chapter ends another chapter can begin, and she will be back. She will wrestle again, mark my words. I believe in miracles.\n\n\n\nNia: Just look at Daniel Bryan, they told him he would never wrestle again.\n\n\n\nLana: I’m a big believer of living life forward and understand it backward. Certain things happen that may close one door just to open a new one.\n\nNatalya: My husband is a perfect example of that. I never knew TJ would like anything as much as wrestling. He wrestled for 20 years. It was his passion and ,very much like Paige, he did it since he was young. And just the other day he said, “I think I like producing even more than wrestling.” Because he gets to work so closely with the people that make the company go.\n\nIt’s so cool to see the chairman’s vision and to work closely with him and there’s so much more to the business than what happens in the ring. He’s working with people like Fitt Finley, Dean Malenko, Jamie Noble, all these great minds and they’re all coming together and he’s like “this is so cool.” He’s actually liking that.\n\nPaige’s role as GM, she’s the best GM we’ve ever had. You never know, life takes you in different directions. It’s cool to see Paige thriving.\n\nYou bring up your husband and the different path he took after wrestling. Have you thought about your life after you hang them up?\n\nNatalya: I think about it everyday. I’m a planner, and always have my ducks in a row. The biggest thing for me, I learned a lot from my dad, and what he told me a lot especially at the end of his life was about living your life in the moment. Do what makes you happy. Guess what? Tomorrow something else makes me happy. Every single day I have different things that makes me happy.\n\nWith my dad, we learned a lot about living in the moment. With TJ, you know what? A few years ago wrestling was the only thing that made him happy, but now our life has taken this different direction and it’s so good. What makes me happy is being with my family, making memories with my friends, our trip to Lake Tahoe. Seeing Paige happy, hugging Nikki Bella, looking at Brie with her baby. Seeing Nia win the women’s championship at WrestleMania in front of 80 thousand people. Body slamming Lana on top of a ladder.\n\nFor me I just want to enjoy those moments. Yes I’m planning for my retirement, we should all be thinking about it. But right now I’m just thinking about which Louis Vuitton shoes are the cutest on the runway right now.\n\nE!\n\nWhat were your reactions to Renee Young becoming a full-time RAW commentator?\n\nNia: We are so over the moon. Nattie was saying that she was loved by everyone: male, female, backstage, everyone loves her. She’s a great human being and she’s incredibly talented. Now she gives a voice to the women on the commentary team, a point of view that none of the fans have heard.\n\nLana: Renee, coming from an acting background, she’s one of the most talented people. People don't’ realize how talented she is, she can do stand-up, she can do improv. She’s an incredible, talented person. So the fact that she has this opportunity shows all her hard work, and I’m really proud of her.\n\nI remember a couple of years ago, they said “we are not interested in women commentating” so the fact that she is breaking a glass ceiling, being a part of making history with the women. It’s important that as women we make history not just in the ring, not just having longer matches, not just main eventing WrestleMania - which we will do. Not just just having a tag team division, which we will do. Not just having people on commentary, having people like Paul Heyman on the mic. That is the true women’s revolution when we are seeing women in all aspects. More women writers in the back, women producers, women in places of power. That is a women’s movement.\n\nNia: Somebody we never talk about is Stephanie McMahon. She is such a huge power influence in our company. She is always pushing us to go the limit and she doesn’t take much credit for what she’s done. She was in the ring taking hits and doing it for over 20 years behind the scenes. And she’s making sure she leaves a legacy for her daughters. Lana is right, when it’s from top to bottom it’ll be a true women’s revolution.\n\nNatalya: One thing about Steph and what people don’t see is that she is our boss and we do respect her, but no one knows what she does behind the scenes when no one is around. When my father passed away, she came unannounced. And she had a signing for Connor’s Cure in New York City; she had to be at that charity at 6pm. And she still came and talked to every single person. She was talking to the funeral director and everybody. She’s Stephanie McMahon and she has an appearance in New York in two hours but she’s here in Tampa. For me, people don’t even know the kind of stuff that Steph does. So she’s there for us girls, and she has our backs.\n\nLana: We are where we’re at because of her. Just fighting for opportunities for us. I wanted to be in WWE because of watching Stephanie McMahon.\n\nNatalya: Just don’t get slapped by her [Laughs].\n\n\n\nNia: I’ve always wanted to. I told her “Steph, anytime you want to get in the ring and slap me.” When it was me and Ronda at the contract signing. I wanted her to slap me.\n\nNatalya: I remember that day, Nia was like “I wish she would just slap me.”\n\nYou’re all currently in what the WWE calls the “women’s revolution” but where do you see women superstars going from an in-ring perspective?\n\nNatalya: Nia said something earlier that I thought was very profound. Soon we’re going to have a women’s division in the WWE that all the things men do will be normal for us, like main event WrestleMania.\n\nNia: We want to get to the point where it’s not “the first ever women’s” anything. I just want things to be normal. I always spread my message of body positivity and fashion for everybody. I just want it to be normal for every fashion label to have all sizes. Completely inclusive, that’s how it should be. We are fighting for the next generation so they won’t have to fight. Obviously, the next step is main event WrestleMania and whatever's next, people take account all the talent and art we are telling. And hoping they really appreciate all the talent.\n\nLana: I would love to see a tag team division and tag team titles. That’s a dream of mine. I would say to team-up with Naomi and be called the Ravishing Glow. Be the tag team champions, is my secret dream. And then we can face Tamina and Nia and Beth Phoenix and Nattie. For me when I say that’s going to happen, it’s going to happen. I just pray it’s when I’m still here, and I believe that it will.", "images": ["https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/thumbnail/public/2018/09/18/braun-strowman-fight-wwe.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/19/gettyimages-627846684.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/19/rtstda5.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/07/09/25-most-powerful-passports-world.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/02/21/worlds-highest-paid-actors_29.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/18/josh-groban.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/19/nup1825120770.JPG", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/19/antarctica-stock.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/07/08/swaggy-c-bb20.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/thumbnail/public/2018/08/31/wwe-lana-cj-perry.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/embed-lg/public/2018/09/19/natty-total-divas.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2018/09/19/wwedivasinterview-total-divas-lana-nia-jax-natalya.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/07/16/image-00_0.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/19/rtx3za2t.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/embed-lg/public/2018/09/19/nia-jax-total-divas.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/06/22/image-00_2.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/09/19/rts1q9ng.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/embed-lg/public/2018/09/19/lana-total-divas.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/05/11/trailer-large-image_0.jpg", "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/sm/public/2018/05/15/queen-elizabeth-ii-slideshow-cover.jpg"], "top_img": "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2018/09/19/wwedivasinterview-total-divas-lana-nia-jax-natalya.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180919171522/https://www.newsweek.com/total-divas-season-8-lana-nia-jax-natalya-paige-return-1128849", "title": "‘Total Divas’ Season 8: Nia Jax, Lana and Natalya Talk Paige’s Return and What to Expect", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1, user-scalable=no", "news_keywords": "total divas season 8, lana, nia jax, natalya, paige’s return, wwe, e network, season premiere", "fb": {"app_id": 245537789135954, "pages": 18343191100}, "og": {"type": "article", "site_name": "Newsweek", "url": "https://web.archive.org/web/20180919171522/https://www.newsweek.com/total-divas-season-8-lana-nia-jax-natalya-paige-return-1128849", "title": "'Total Divas' stars Lana, Nia Jax and Natalya preview Season 8 and life in WWE's Women's Revolution", "description": "WWE Superstars Nia Jax, Lana and Natalya say that “Total Divas” Season 8 is like “three seasons in one.", "image": "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2018/09/19/wwedivasinterview-total-divas-lana-nia-jax-natalya.jpg"}, "article": {"publisher": "https://www.facebook.com/Newsweek", "section": "Culture", "modified_time": "2018-09-19T12:45:02-04:00", "published_time": "2018-09-19T11:13:30-04:00"}, "twitter": {"site": "@newsweek", "card": "summary_large_image", "title": "'Total Divas' stars Lana, Nia Jax and Natalya preview Season 8 and life in WWE's Women's Revolution", "url": "https://web.archive.org/web/20180919171522im_/https://www.newsweek.com/total-divas-season-8-lana-nia-jax-natalya-paige-return-1128849", "description": "WWE Superstars Nia Jax, Lana and Natalya say that “Total Divas” Season 8 is like “three seasons in one.", "image": "https://web.archive.org/web/20180919171522im_/https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2018/09/19/wwedivasinterview-total-divas-lana-nia-jax-natalya.jpg"}, "msapplication-TileColor": "#ff0000", "msapplication-TileImage": "https://s.newsweek.com/sites/www.newsweek.com/themes/newsweek/favicons/mstile-144x144.png", "msapplication-config": "https://s.newsweek.com/sites/www.newsweek.com/themes/newsweek/favicons/browserconfig.xml", "com.silverpop.brandeddomains": "www.pages06.net,aidataconf.com,amp.ibtimes.co.uk,e-amp.newsweek.com,e-sns.newsweek.com,europe.newsweek.com,events.newsweek.com,ibt-dev.co.uk,ibtimes.co.uk,ibtimes.com,idigitaltimes.com,latintimes.com,medicaldaily.com,newsweek.com,player.one,sns.europe.newsweek.com,sns.ibtimes.co.uk,subscription.newsweek.com,www.ibt-dev.co.uk,www.ibtimes.co.uk,www.ibtimes.com", "description": "WWE Superstars Nia Jax, Lana and Natalya say that “Total Divas” Season 8 is like “three seasons in one."}, "movies": [], "publish_date": 1537370010.0, "source": "https://web.archive.org", "summary": ""}