{"url": "https://medium.com/@GovGaryJohnson/theres-another-choice-5d1f14b742d5#.gsyzpehxp", "text": "When it comes to electing their next president, Americans want a candidate to vote for — not just someone to vote against.\n\nAmerican voters want the perspective of an outsider who can bring an entrepreneurial perspective to the White House. They aren’t opposed to experience in governing — so long as it doesn’t bring with it an addiction to crony capitalism and the fruits thereof.\n\nAnd they want a candidate who looks after American interests and doesn’t use war to destabilize already volatile regions of the world like the Middle East.\n\nI’m running for President to offer that alternative. I am a successful businessman, and grew my construction business to employ more than 1,000 workers.\n\nI was the Republican governor of the heavily Democratic state of New Mexico. I focused on good government and I got it done — just like my running mate, former Massachusetts Gov. Bill Weld. The people of New Mexico reelected me by a comfortable margin. Ditto for Weld.\n\nThink of it this way: I’m someone you would trust to run your household and to keep it safe while you went away on a trip or a vacation. I could even fix a few things around the house. After all, the construction company I founded began as a one-man handy-man operation. Can you say the same for Hillary Clinton or Donald Trump?\n\nI’ve balanced budgets and cut taxes. I’ve also spoken my mind about where the country needed to go on personal freedoms and marriage equality. In 1999, I became the only sitting governor to publicly advocate the legalization of marijuana. Senator Bernie Sanders came to that viewpoint — a position that most Americans support — 16 years later.\n\nI’m also a strong believer in our Constitutional rights to civil liberties and privacy. Our government should not be spying on the electronic communications of American citizens. Nor should our iPhones or Android devices be subject to unreasonable searches and seizures.\n\nAnd I understand that, as a nation and as a society, we have unfinished business to right the wrongs of injustice suffered by minorities. Blacks are 30 percent more likely that white to be apprehended by the police; they are three times more likely to be searched; they are arrested twice as often as whites; and they are 75 percent more likely to be charged with offenses carrying mandatory minimum sentences.\n\nIt is not surprising that there is tangible mistrust, tension and frustration between the police and African-Americans, particularly black males. We need to speak honestly about these issues in order to address them. Let’s be honest. We have healing to do.\n\nOne of the biggest concerns that many voters have with both Hillary Clinton and Donald Trump, but particularly with Ms. Clinton, is the sense that she uses government power to advance her personal and political interests.\n\nShe is the very status quo. Americans want that changed. She talks about progressivism, but lines her bank accounts with speaking fees from banks and special interests. That’s what crony capitalism is all about. Americans recognize pay-to-play when they see it, and they are really, really weary of it.\n\nHaving been governor of New Mexico, I know that legislation gets passed to benefit those who have money and influence. Then they buy more money and influence. That’s one reason why, as governor, I vetoed more than 750 bills and thousands of line items.\n\nI did it to keep crony capitalism away from government.\n\nAnother big difference between Hillary Clinton and myself is that I’m for our national tradition of peace, commerce and honest friendship with all nations — while being extremely skeptical of committing ourselves and our armed forces to foreign conflicts.\n\nAs a Senator, she endorsed ill-advised foreign interventions. As Secretary of State, she was the architect of tragic and counter-productive policies in Libya, in Egypt and in Syria. These should not be America’s wars, and we ought not be prompting regime changes that serve only to replace bad actors with even worse actors and instability that makes us less safe.\n\nInstead, our nation need the confidence that its president will be predictable, yes, but also skeptical of engaging in international shenanigans all around the world.\n\nAmericans can find sanity and principle by voting Johnson/Weld in 2016.", "images": ["https://miro.medium.com/fit/c/160/160/0*JZj77A4yDjqhdGNI.jpg", "https://miro.medium.com/max/60/1*bS-AOEWLQTK_Jkg-SrgqOw.jpeg?q=20", "https://miro.medium.com/max/1290/1*bS-AOEWLQTK_Jkg-SrgqOw.jpeg", "https://miro.medium.com/max/645/1*bS-AOEWLQTK_Jkg-SrgqOw.jpeg", "https://miro.medium.com/fit/c/96/96/0*JZj77A4yDjqhdGNI.jpg"], "top_img": "https://miro.medium.com/max/645/1*bS-AOEWLQTK_Jkg-SrgqOw.jpeg", "keywords": [], "authors": ["Gov. Gary Johnson"], "canonical_link": "http://thehill.com/blogs/pundits-blog/presidential-campaign/290530-exclusive-gary-johnson-op-ed-theres-another-choice", "title": "There’s another choice", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/5d1f14b742d5"}}, "title": "There’s another choice", "site": "@Medium", "description": "When it comes to electing their next president, Americans want a candidate to vote for — not just someone to vote against.", "image": {"src": "https://miro.medium.com/max/645/1*bS-AOEWLQTK_Jkg-SrgqOw.jpeg"}, "card": "summary_large_image", "creator": "@GovGaryJohnson", "label1": "Reading time", "data1": "3 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/5d1f14b742d5"}, "android": {"package": "com.medium.reader", "url": "medium://p/5d1f14b742d5", "app_name": "Medium"}, "web": {"url": "https://medium.com/@GovGaryJohnson/theres-another-choice-5d1f14b742d5"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "There’s another choice", "description": "When it comes to electing their next president, Americans want a candidate to vote for — not just someone to vote against.", "url": "https://medium.com/@GovGaryJohnson/theres-another-choice-5d1f14b742d5", "image": "https://miro.medium.com/max/645/1*bS-AOEWLQTK_Jkg-SrgqOw.jpeg"}, "article": {"published_time": "2016-08-08T18:23:25.006Z", "author": "https://medium.com/@GovGaryJohnson"}, "title": "There’s another choice - Gov. Gary Johnson - Medium", "description": "When it comes to electing their next president, Americans want a candidate to vote for — not just someone to vote against. American voters want the perspective of an outsider who can bring an…", "author": "Gov. Gary Johnson", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "5d1f14b742d5"}, "movies": [], "publish_date": 1470680605.006, "source": "https://medium.com", "summary": ""}