{"url": "www.express.co.uk/entertainment/films/750758/Ryan-Gosling-La-La-Land-Blade-Runner-Emma-Stone-when-is-it-out-review-best-moments-films", "text": "Ryan Gosling is about to star in two of the most anticipated films of recent years. First up in the extraordinary La La Land alongside Emma Stone, which has been receiving rave reviews and huge awards season buzz. Then we'll see him opposite Harrison Ford in Ridley Scott's return to the world of Blade Runner. We know he leaves many of his fans rather breathless and light-headed so we suggest you are sitting as we take a look at his greatest movie moment to date and what makes him so incredible.\n\nGETTY Ryan Gosling is about to star in La La Land and Blade Runner\n\n1. Crazy, Stupid, Love – because he’s a true gent. Gosling’s performance as a bachelor in Crazy, Stupid, Love changes the way we view the world when he instigates the re-enactment of the famous Dirty Dancing Scene with Emma Stone. FUN FACT: Did you know that when shooting the scene, Emma panicked during the lift and accidentally kicked Ryan in the throat? It seems like Ryan is a true gent and didn’t take it to heart as the pair have remained firm friends and went on to work together in Gangster Squad. We can’t wait to see the winning duo reunited again in La La land.\n\n2. The Place Beyond The Pines – because he doesn’t take himself too seriously. Ryan’s electric performance in The Place Beyond the Pines blends toughness and vulnerability as he plays a bank robber determined to provide for his son. FUN FACT: They shot the bank robbery scene using real bank staff and customers. Don’t worry, they were told they were going to be in a movie before the heist took place… What makes us love this on screen moment even more is that Ryan didn’t take himself too seriously; he tells MSN “I think I spotted someone filming me on their camera phone as I robbed the place”.\n\nRyan Gosling in pictures Tue, November 12, 2013 Here are Ryan Gosling's hottest pictures on and off set for you to feast your eyes on. Play slideshow REUTERS 1 of 30 Ryan Gosling and Emma Stone pose with their Golden Globe awards\n\n3. Drive – because he can hold you captive without saying a word. If you haven’t seen the opening scene of Drive, you’re seriously missing out. Drive is a pulp thriller where Gosling plays a cool stunt driver who secretly works for criminals as a getaway driver. The opening scene is one of the most edge-of-your-seat cinematic moments you’ll experience. Gosling’s character has just picked up his latest comrades from burgling a jewellery store and driving them to safety. The greatest thing about the scene is the suspense. It’s held without any dialogue between the getaway driver and the criminals. All that is heard is the police radio as the police officers try and locate the getaway car.\n\n4. Blue Valentine - because his ukulele performance will melt your heart. Ryan plays a character called Dean in Blue Valentine, which depicts the relationship between him and Cindy played by Michelle Williams. It shows the unravelling of their marriage and flashing back to their courtship. Ryan puts on an endearing performance of “You Always Hurt the One You Love” where he sings and plays the Ukulele whilst Michelle tap dances. FUN FACT: Most people don’t know that both actors were asked to perform a special talent but neither knew what the other would do. So, when the scene played out, the actors discovered each other’s surprising abilities at the same time as the film’s audience.\n\n5. Half Nelson - because he shows his acting skills are as great as his looks. As well as his good looks and dazzling charm, we can’t forget that Ryan can seriously act. A momentous scene takes place in Half Nelson where Ryan plays an inner-city teacher who is found taking crack cocaine in a store cupboard by a young student. FUN FACT: The result of such a performance landed him an Oscar nomination for Best Actor in Leading Role. 6. The Big Short - because he came back. After Ryan announced his break from acting in March 2013, we were all heartbroken. But thankfully he came back and appeared in The Big Short, giving the best explanation of the housing market collapse in America using Jenga. His great performance alongside Steve Carell, Brad Pitt, Christain Bale and Marisa Tomei won six Oscar Nominations for the film.", "images": ["http://t.co/i/adsct?txn_id=l4f18&p_id=Twitter", "https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.express.co.uk/img/covers/70x91/front_2020-04-17.jpg", "https://cdn.images.express.co.uk/img/dynamic/36/285x190/742575_1.jpg", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://cdn.images.express.co.uk/img/dynamic/galleries/x701/205950.jpg", "https://analytics.twitter.com/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/page/preloaderbig.gif", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0", "https://cdn.images.express.co.uk/img/dynamic/36/750x445/750758.jpg", "https://cdn.images.express.co.uk/img/dynamic/79/285x190/741388_1.jpg"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/750758.jpg", "keywords": [], "authors": ["Stefan Kyriazis"], "canonical_link": "https://www.express.co.uk/entertainment/films/750758/Ryan-Gosling-La-La-Land-Blade-Runner-Emma-Stone-when-is-it-out-review-best-moments-films", "title": "Why we are all going La La for Ryan Gosling – His 7 greatest movie moments ever", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "RYAN GOSLING is about to stun the world in La La Land and Blade Runner, but we already loved him in Drive, The Notebook and Crazy, Stupid, Love. Here are his greatest moments.", "fb": {"pages": 129617873765147, "app_id": 823607694325129}, "og": {"title": "Why we are all going La La for Ryan Gosling – His 7 greatest movie moments ever", "type": "article", "url": "https://www.express.co.uk/entertainment/films/750758/Ryan-Gosling-La-La-Land-Blade-Runner-Emma-Stone-when-is-it-out-review-best-moments-films", "image": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/750758.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "entertainment,celebrities,movies,tv,headlines,world,ctp_video,autoplay_video,ryan gosling,ryan gosling movies,ryan gosling films,la la land,blade runner,drive,the notebook,crazy,stupid love,greatest moments,emma stone,ryan gosling greatest moments,UploadExpress,", "section": "Films", "description": "RYAN GOSLING is about to stun the world in La La Land and Blade Runner, but we already loved him in Drive, The Notebook and Crazy, Stupid, Love. Here are his greatest moments."}, "news_keywords": "entertainment,celebrities,movies,tv,headlines,world,ctp_video,autoplay_video,ryan gosling,ryan gosling movies,ryan gosling films,la la land,blade runner,drive,the notebook,crazy,stupid love,greatest moments,emma stone,ryan gosling greatest moments,UploadExpress,", "article": {"tag": "UploadExpress", "published_time": "2017-01-05T19:24:00+00:00", "modified_time": "2017-01-05T20:39:59+00:00", "expiration_time": "2017-02-04", "section": "Films", "image_count": 1, "video_count": 1, "word_count": 872, "internal_link_count": 3, "external_link_count": 0}, "author": "Stefan Kyriazis", "twitter": {"card": "summary_large_image", "image": {"src": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/750758.jpg"}, "title": "Why we are all going La La for Ryan Gosling – His 7 greatest movie moments ever", "description": "RYAN GOSLING is about to stun the world in La La Land and Blade Runner, but we already loved him in Drive, The Notebook and Crazy, Stupid, Love. Here are his greatest moments."}, "video_autoplay": "true", "headline_short": "Why we are all going La La for Ryan Gosling – His 7 greatest movie moments ever", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "robots": "noodp,noydir,all"}, "movies": ["https://www.youtube.com/embed/YRcKrkhOYUo", "https://www.youtube.com/embed/vdqbdEKeJ_4", "https://www.youtube.com/embed/VNZgUM542VI", "https://www.youtube.com/embed/9eACebMOtv8"], "publish_date": 1483644240.0, "source": "http://www.express.co.uk", "summary": ""}