{"url": "https://www.bbc.com/news/entertainment-arts-44614012", "text": "Image copyright George Kraychyk Image caption Offred (Elisabeth Moss) is facing eight more gruelling years\n\nThe Handmaid's Tale could last for 10 seasons, according to the boss of streaming service Hulu.\n\nThe first series of the dystopian drama was based on Margaret Atwood's 1985 novel, but it went beyond the book's plot for the current second season.\n\nA third has been commissioned and Hulu chief executive Randy Freer said the show could last well beyond that.\n\n\"I hope, as success goes, there's 10 seasons of The Handmaid's Tale,\" he told Variety.\n\nHe revealed that writers had already started work on the scripts for season three.\n\n\"The creative process will determine, is it a fourth season, is it five seasons?\" he said.\n\n\"And I think that's one of the benefits for creators in the streaming world - shows can take a natural progression, they can live for as long as they should live or they can end.\"\n\nThe first series of the drama, shown on Channel 4 in the UK, won five Emmy Awards last year, including best drama series and best actress for Elisabeth Moss.\n\nBut it's not necessarily a good thing for hit shows to be prolonged for as long as possible.\n\nImage copyright George Kraychyk Image caption Nina Kiri and Elisabeth Moss in The Handmaid's Tale\n\nCaroline Crampton, co-host of The New Statesman's culture podcast Srsly, said she was \"absolutely not\" relishing the prospect of another eight seasons of The Handmaid's Tale.\n\n\"I'm barely on board with the fact that they've made a second series, to be honest,\" she said.\n\n\"I think they've lost the reason why people loved the first series and indeed loved the book - it had this very well-constructed narrative arc. When it got to the natural ending point of that person's story, it stopped.\n\n\"There's not always necessarily a reason to keep going just because people are watching it.\"\n\nFor TV executives, however, it's \"a long-running temptation\" to keep a show going for commercial reasons.\n\nBut she adds: \"If you're looking purely from the quality point of view and what the right thing to do by the story is, then I don't think it does make sense.\"\n\nIn Emmy Awards history, shows are most likely to be nominated for outstanding drama series for their second series, and the likelihood of being shortlisted - an indicator of quality - drops off after that.\n\nFour shows that kept up the quality\n\nImage copyright Sky/HBO\n\nGame of Thrones\n\nThe final season is coming in 2019... and the show's ratings and levels of obsession have gone up with each of the seven seasons so far.\n\nIt bucked the usual Emmy trend by winning its first best drama series award relatively late, for season five, and retained the trophy the following year.\n\nLaw & Order\n\nThis is the only modern show to be nominated for the outstanding drama series Emmy beyond series seven. In fact, the landmark New York crime drama was nominated 11 times, the last for its 12th season in 2002.\n\nThat 12th series was also a high point for the ratings - although it did carry on for eight more series before being cancelled. However its life has carried on through various spin-offs.\n\nThe Wire\n\nThe Baltimore-set show kept things fresh by expanding its horizons to focus on a new aspect of gritty city life in every season, following the drug trade, the port, politics, schools and the press.\n\nDoctor Who\n\nWhat better way to rejuvenate a TV show than to regenerate its star (and showrunner) every few years? That has kept Doctor Who going strong for 55 years (albeit with a long gap in the 1990s and 2000s).\n\nFour shows that went off the boil\n\nImage copyright FOX\n\nGlee\n\nGlee was an uplifting and enlightened phenomenon when it began in 2009, and continued to be must-see for three years - but lost its way (and much of its audience) when the class graduated, and was finally silenced in 2015.\n\nThe Simpsons\n\nEverybody has a soft spot for The Simpsons, but it's hard to deny that they just couldn't live up to their own high standards for all 29 seasons (and counting). Most fans agree that it hit its peak of comedic genius around seasons three and four in the early 1990s.\n\nLost\n\n...the plot. The mystery about the plane crash on a mysterious desert island was groundbreaking and captivating when it started in 2004, but in an attempt to spin out its success it went down too many rabbit holes and created too many questions and not enough answers.\n\nWestworld\n\nWestworld has only been going for two seasons - the second of which has just reached a climax - but after the acclaimed opening series, the follow-up has left lots of viewers scratching their heads and struggling to care. There will be a series three. Of course.\n\nYou might also be interested in:\n\nFollow us on Facebook, on Twitter @BBCNewsEnts, or on Instagram at bbcnewsents. If you have a story suggestion email entertainment.news@bbc.co.uk.", "images": ["https://ichef.bbci.co.uk/news/1024/branded_news/10DCE/production/_102207096_cut.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/10DCE/production/_102207096_cut.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=entertainment_and_arts::news.entertainment_and_arts.story.44614012.page&x1=[urn:bbc:cps:747cd744-5f15-1349-825c-8fbb6dadfebd]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/10DCE/production/_102207096_cut.jpg", "keywords": [], "authors": ["Ian Youngs", "Arts", "Entertainment Reporter"], "canonical_link": "https://www.bbc.com/news/entertainment-arts-44614012", "title": "The Handmaid's Tale could go on for 10 seasons", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Does it really make sense to string out hit shows?", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 123321485, "og": {"title": "Handmaid's Tale 'could last 10 seasons'", "type": "article", "description": "Does it really make sense to string out hit shows?", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/entertainment-arts-44614012", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/10DCE/production/_102207096_cut.jpg", "alt": "BBC News. Homer Simpson and Elisabeth Moss in The Handmaid's Tale"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Entertainment & Arts"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Handmaid's Tale 'could last 10 seasons'", "description": "Does it really make sense to string out hit shows?", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/10DCE/production/_102207096_cut.jpg", "alt": "Homer Simpson and Elisabeth Moss in The Handmaid's Tale"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/entertainment-arts-44614012?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}