{"url": "www.inquisitr.com/4608233/khloe-kardashian-forced-by-tristan-to-follow-strict-pregnancy-diet-after-cookies-ice-cream-binge/", "text": "Khloe Kardashian once was known as the chubby Keeping Up with the Kardashians sister. But after putting herself on a strict diet and fitness plan, Khloe achieved a 40-pound weight loss and a stunning revenge body, as the Inquisitr reported.\n\nAfter facing rumors for years about her desire to become a mom like her sisters Kourtney and Kim Kardashian, Khloe reportedly has become pregnant. Kardashian’s boyfriend, Tristan Thompson, who has begun appearing on episodes of Keeping Up with the Kardashians, is her alleged baby daddy. And while Khloe previously has been shown exercising intensely and sticking to her strict diet, now she is rumored to have let go of her weight-loss program. But in response to Kardashian’s rumored binges of ice cream and cookies, Tristan has taken action and ordered her to follow a strict pregnancy diet, an insider told OK! Magazine.\n\nTristan Thompson Puts Khloe Kardashian On Pregnancy Diet\n\nSince learning that Khloe is expecting her first baby with Thompson, she reportedly has enjoyed eating all that junk food she surrendered during her 40-pound weight-loss program. The source claims that the NBA star won’t tolerate those sugar-and-starch-filled binges.\n\n“[Tristan] intervened with Khloe Kardashian’s pregnancy routine, telling her he won’t stand for unhealthy habits!”\n\nThompson is reportedly giving Kardashian strict guidelines when it comes to what she can eat and what she must avoid. But it’s not easy for Khloe, who craves fattening foods, added the insider.\n\nRefusing to indulge Kardashian, Tristan has created a new routine for Khloe after putting himself in charge of her diet, according to the source.\n\nKhloe Kardashian Gives Up Revenge Body Weight Loss For Baby?\n\nThe insider revealed that Thompson knows of Kardashian’s fondness for fattening foods. But he is so into nutrition and fitness that he is now supervising Khloe’s diet and exercise. The source also shared what Kardashian was enjoying before Tristan’s diet intervention.\n\n“Khloe was snacking really badly on Kettle chips, chocolate chip cookies, and ice cream.”\n\nWhile it might sound harsh for Kardashian’s baby daddy to force her to avoid her favorite fattening foods, the insider clarified that Thompson doesn’t want her to “beat up on herself by overindulging.” According to the source, the NBA star has provided a “great influence” when it comes to helping Khloe get back on track with a nutritional diet.\n\nKhloe Kardashian flaunts her revenge body weight loss. Has she given up on dieting because she's pregnant? [Image by Dia Dipasupil/Getty Images]\n\nKhloe Kardashian Gets Baby Bump Style Tips From Tristan Thompson\n\nTristan even helps Kardashian choose her clothes, she told E! News.\n\n“Tristan actually has impeccable style.”\n\nKhloe revealed that she sometimes asks her boyfriend if she should wear certain accessories, including shoes. Thompson is enthusiastic about advising his pregnant girlfriend on her style.\n\n“Where I’ll say, like tonight, ‘Babe, should I wear these socks or not?’ And he’s like, ‘No, you look cute,'” she admitted.\n\nKardashian praised Tristan as having “such good taste” that she takes his style tips “all day long.” Thompson’s style preferences seem to have influenced their cute couple Halloween outfit.\n\n????Game Of Thrones ???? thank you for everything @styledbyhrush @andrewfitzsimons @bryanhearns @missjilljacobs !! Happy Halloween ???? ???????? A post shared by Khloé (@khloekardashian) on Oct 31, 2017 at 2:36pm PDT\n\nFans, however, ignored the ornate costumes and focused on just one question.\n\n“Where’s the baby bump?” demanded several of Khloe’s followers.\n\nKylie Jenner, Khloe Kardashian Share Pregnancy Cravings\n\nCelebrity Insider also quoted sources claiming that Tristan has put Kardashian on a strict pregnancy diet. The insiders said that Khloe no longer is concerned with gaining weight. Instead, the Keeping Up with the Kardashians star is reportedly focused on having a healthy baby. Thompson wants to help, said one of the sources.\n\nIn addition to chips, cookies, and ice cream, Kardashian has been eating a lot of peanut butter and pickles, said another insider. Khloe reportedly shares those pregnancy cravings with her pregnant sister Kylie Jenner.\n\n“Pregnant sisters Khloe and Kylie are sharing some odd similar food cravings during their pregnancies.”\n\nJenner and Kardashian reportedly were “shocked” to discover that both have been indulging in peanut butter and pickles. Khloe has reportedly swapped her revenge body weight loss for a healthy baby, eating peanut butter right out of the jar.\n\nThe insider said that in contrast, Kylie is piling peanut butter on everything, from cookies to celery. The shared pregnancy cravings reportedly have brought the sisters closer together.\n\nTristan Thompson Too Strict With Khloe Kardashian’s Diet?\n\nGossip Cop investigated the allegations that Tristan has ordered Khloe to follow a “strict pregnancy diet.” The insider also claimed that Thompson is focusing his entire life around nutrition and fitness.\n\n“Tristan lives and breathes nutrition as well as fitness and he’s put himself in charge of Khloe’s entire diet.”\n\nGossip Cop speculated that “most” of the report is likely not true. Kardashian stars in her own show, Revenge Body, to inspire others to follow her healthy lifestyle. Khloe’s nutritionist has said that Kardashian’s diet features fruit, vegetables, chicken breast, and fish.\n\nAlthough Khloe does allow herself to have a weekly cheat day, an insider told Gossip Cop that Thompson is not ordering Kardashian to follow a strict diet. Rumors that Khloe is afraid that Tristan will dump her in the delivery room also are not true.\n\n[Featured Image by Jamie McCarthy/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/11/Khloe-Kardashian-Baby-Bump-Pregnancy-Diet.jpg", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/Khloe-Kardashian-Pregnancy-Diet-Tristan-Thompson.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4608233/khloe-kardashian-forced-by-tristan-to-follow-strict-pregnancy-diet-after-cookies-ice-cream-binge/", "title": "Khloe Kardashian Forced By Tristan To Follow ‘Strict’ Pregnancy Diet After Cookies & Ice Cream Binge?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}