{"url": "www.inquisitr.com/3573812/robert-pattinson-fka-twigs-expecting-a-baby/", "text": "Great news for Robert Pattinson’s fans. Recent rumors suggest that Twilight alum and FKA Twigs are expecting their first child.\n\nGamenguide reported earlier that the Remember Me star is currently suffering from depression and that’s why he has canceled his wedding with Twigs. Now the publication has reported about their pregnancy.\n\nAccording to Gamenguide, there are reports that Robert Pattinson and Tahliah Debrett Barnett are planning to have a baby so they could save their failing relationship. According to the reports, the couple is now very desperate to fix their relationship and that’s why they have decided to have a baby\n\nIf these speculations about Kristen’s ex-boyfriend were not enough, other sources previously claimed that the engaged couple might be headed for an end. Hollywood Life reported that Twigs and Pattinson were spotted fighting at Los Angeles Airport. The publication further noted that the couple seemed visibly upset with each other.\n\n[Image by Larry Busacca/Getty Images]\n\nAt the same time, iTechPost explained that the fall between the couple is because of Kristen Stewart. Patrick Wachsberger, a Lionsgate chairman, recently confirmed the possibility of a Twilight sequel, and recent rumors suggest that the actor is seriously considering to share the screen with his ex-girlfriend again.\n\nSo, there are chances that Pattinson’s decision to feature in Twilight’s reboot with Stewart has caused the rife between him and Twigs.\n\nMeanwhile, Twigs was not sporting her engagement ring during their recent trip and many are believing that they have officially parted their ways. InTouch also reported that the couple’s friends think that things are not going too well between them as she is very dominating.\n\n“[She] isn’t the girl for him. She’s very jealous and he was sick of having to explain himself,” the insider added. “He’s still young and just decided he wasn’t ready to settle down.”\n\nshadow creeper fam. A photo posted by FKA twigs (@fkatwigs) on Aug 14, 2016 at 2:54pm PDT\n\nRobert was recently under media radar when there were rumors that the reason why he is not marrying Tahliah is because he is gay. A hoax website claimed that Little Ashes star has come out as gay. The website, which apparently later deleted the post, falsely claimed that he cannot accept the fact that Kristen is thinking to settle down with Alicia Cargile.\n\n“I completely fell for this guy and at first I thought I was confused with my emotions and I did not want to let my female fans down. But after careful consideration, I felt it was best to come out to the public and confirm that I am gay,” the website claimed that the actor told to an imaginary news station.\n\nApart from this fabricated news, the publication went on to claim that Gay Times magazine has offered him “a multi-million dollar modeling contract.”\n\nPersonal Shopper actress, Kristen Stewart, came out as a lesbian in July when she officially talked about her ongoing relationship with Cargile. During her recent interview, she talked about her sexuality and her approach towards dating.\n\n“When I was dating a guy I was hiding everything that I did because everything personal felt like it was immediately trivialized, so I didn’t like it,” she further said. “We were turned into these characters and placed into this ridiculous comic book, and I was like, ‘That’s mine. You’re making my relationship something that it’s not.’ I didn’t like that. But then it changed when I started dating a girl. I was like, ‘Actually, to hide this provides the implication that I’m not down with it or I’m ashamed of it, so I had to alter how I approached being in public. It opened my life up and I’m so much happier.'”\n\n[Image by Jamie McCarthy/Getty Images]\n\nSo, according to the hoax site, if Kristen can realize about her sexual preferences then Robert can also come out as a gay.\n\nRobert Pattinson and FKA Twigs’ representatives have not commented on the recent reports about the pregnancy or about their split, so fans should consider the pregnancy reports as only speculations.\n\nDo you think that Robert Pattinson and FKA Twigs will have a child out of wedlock? Sound off in the comments below.\n\n[Featured Image by Mike Coppola/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2016/10/kristen-stewart-and-robert-pattinson-wedding.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2016/10/robert-pattinson-movies.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/2796d5da17c476cbb25029169dfc079c?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2016/10/robert-pattinson-wife-kristen-stewart.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Viraj Mahajan"], "canonical_link": "https://www.inquisitr.com/3573812/robert-pattinson-fka-twigs-expecting-a-baby/", "title": "Robert Pattinson, FKA Twigs Expecting A Baby?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}