{"url": "www.the-magician.co.uk/harry-potter-london-locations.htm", "text": "THE FINAL PART OF YOUR HARRY POTTER JOURNEY\n\nThe final part of your journey through the London of Harry Potter will take you to the ultimate location for all fans of the boy wizard and his fellow members of the magic community - Platform 9¾ at King's Cross Station.\n\nHowever, several locations around King's Cross were used for the filming, and you'll get to visit many of them - albeit, since the wall that was used as the entrance Platform 9¾ is, in fact, located between Platforms 4 and 5, you will need to gaze at it from the other side of the ticket barriers, unless, that is, you happen to be boarding a train from either of those platforms.\n\nSo, as you read this, your Piccadilly Line train from Leicester Square, should just be pulling into King's Cross Station.\n\nIMPORTANT There are several exits from the Piccadilly Line at King's Cross, so you will need to follow the directions carefully to ensure that you go out of the correct one for the tour. DIRECTIONS On arrival at the Piccadilly Line platform at King's Cross Station, turn right off the train, following the platform signs for \"Euston Road British Library. Walk to the end of the platform, go left through the exit, then turn right go up the escalator. At the top, keep straight, and exit through the ticket barrier. Once through the barrier, keep straight ahead and go up the steps, at the top of which turn left, and then go right through the tunnel, following the signs for St Pancras International. Be sure to keep to the left side of this tunnel. You will come to a flight of stairs on the left, signed \"Stairs to street level.\" Go up them and, at the top, turn left, and walk past the Boots shop, after which go left, following the \"Way Out, Euston Road\" sign. Go right along Euston Road, and, just before the red phone box, turn right, pause by the black lamppost, and look across at the large arch of the red-brick building on the other side of the roadway.\n\nST PANCRAS STATION - KING'S CROSS EXTERIOR\n\nAlthough Harry Potter and his schoolmates board the Hogwarts Express at King's Cross Station, the exterior used in the films was, in fact, the one that now looms over you, St Pancras Station.\n\nTHE CHAMBER OF SECRETS\n\nIt was on the corner of the courtyard to the right of the arch that the Weasleys parked the Ford Anglia in Harry Potter and the Chamber of Secrets.\n\nDIRECTIONS Walk towards the St Pancras Renaissance Hotel, but do not cross to it, instead, follow the pavement as it swings right. Keep ahead (the red-brick hotel should be to your left) and, on arrival at the cobbled roadway, look up at the clock tower.\n\nA GREAT ESCAPE\n\nIn Harry Potter and the Chamber of Secrets , when Harry and Ron find themselves unable to pass through the wall on to Platform nine-and-three-quarters, because Dobbie has sealed it, they return to the Ford Anglia and fly off over the station. The clock that towers over you to your right is shown in this flight scene.\n\nDIRECTIONS Cross the cobbled road and head down the flight of stairs behind the three brown bollards. Keep ahead over the traffic light crossing, and, on the other side, veer left and head for the two large arched-windows, with the clock tower over them, all of which are clearly visible. As you approach, you will see the sign for Platform 5. Although you cannot actually enter through this door, you can position yourself to be able to see Platforms 4 and 5, and, in particular, the walls between them.\n\nTHE ENTRANCE TO PLATFORM NINE-AND-THREE-QUARTERS\n\nKing's Cross Station has appeared in every Harry Potter film because the journey to Hogwarts, aboard the Hogwarts Express, starts from King's Cross Platform 9¾, which is invisible to the eyes of Muggles, and which is reached by walking through the wall between platforms 9 and 10.\n\nHowever, King's Cross Station posed a slight problem for the film makers in that Platforms 9 and 10 weren't actually adjacent to one another.\n\nThe problem was overcome by re-numbering Platforms 4 and 5. Thus Platform 9¾ is in fact situated between these two platforms ahead of you, which are separated by brick arches.\n\nIn the Harry Potter films the Hogwarts Express pulls into the far end of the platform.\n\nHARRY CAN'T GET THROUGH\n\nIn Harry Potter and the Chamber of Secrets , Mr and Mrs Weasley pass through the portal but when Harry and Ron try to do so they just hit the wall and fall to the ground. A nearby porter eyes them suspiciously and asks what they think they're doing, to which Harry replies, \"sorry lost control of trolley.\"\n\nRealising that they can't get on to the platform they hurry back to the forecourt (St Pancras which you visited earlier) and take off in the Ford Anglia.\n\nOUR FINAL GLIMPSE of HARRY, RON AND HERMIONE\n\nIt is on the platforms ahead that we catch our last glimpse of Harry, Ron and Hermione in Harry Potter and the Deathly Hallows Part Two when they bring their children here to pass through the wall and onto Platform 9¾ to begin their first journey to Hogwarts.\n\nWHY J. K. ROWLING CHOSE KING'S CROSS STATION\n\nKing's Cross Station was a special place for Joanne Rowling, since her parents actually met on a train from King's Cross to Arbroath, so the station always had a special significance for her.\n\nDIRECTIONS As you face the doors, turn left and walk towards the entrance to King's Cross St Pancras Underground Station, passing to the left of it. Turn right, and enter King's Cross Station. Keep ahead, passing the ticket office on your right, and pass to the right of the sign that reads \"Toilets and Baby care\", and ahead of you, under the footbridge, you will see an unsightly scrum of people. This is the line waiting to be photographed pushing the trolley through the wall at the designated Platform 9¾.\n\nPLATFORM NINE-AND-THREE-QUARTERS\n\nAlthough not an actual film location, the brown brick wall to your right has become a magnet to Harry Potter fans from all over the world.\n\nThey come to photograph the sign, which the station authorities have obligingly put up in honour of the station's most famous passenger.\n\nEven more obliging is the fact that they have also taken the trouble of placing a luggage cart against the wall, which looks as though it is half way in to the wall, as though some young witch or wizard is proceeding on their way to board the Hogwarts Express!\n\nSadly, if you wish to have your photograph taken here, you have no choice but to join the line, where the wait can be upwards of 30 to 40 minutes. Don't be tempted to try and push in as, believe you me, the combined effects of both the Cruciatus Curse and the killing curse will pale into insignificance when compared to the cursing that will come your way should you attempt to jump the queue!\n\nThe trolley is under the control of the enthusiastic staff from the nearby Harry Potter Shop At Platform 9¾ Shop, and they watch over the line with Dolores Umbridge-like officiousness.\n\nThere is also an official photographer on hand, who will snap your endeavours at getting through the wall, and you can then purchase your photograph at the shop, should you so desire. However, you can also take your own photos.\n\nDIRECTIONS Continue past Platform 9¾ and, a little further along on the right, is the Harry Potter Shop.\n\nTHE HARRY POTTER SHOP AT PLATFORM 9¾\n\nStyled to resemble Ollivander's wand shop, complete with wooden panelling and lots of draws, the Harry Potter Shop has something for everyone.\n\nYou can, if you wish, splash out and purchase exact replicas of the wands used in the films by Harry, Ron or Hermione; there is a selection of jumpers in the various House colours; or you can marvel at a display of Horcruxes.\n\nIf your tastes incline more towards the discreet and understated, then you can choose from a selection of hoodies in a variety of colours, all with Platform 9¾ emblazoned on them.\n\nAnd, if you're seeking a more modestly priced souvenir then you can plum for a selection of board games, Key rings, mugs, soft toys or action figures.\n\nTHE END OF YOUR HARRY POTTER TOUR\n\nAs you enjoy this last treat on what I hope has been an eventful and enjoyable day, your tour of the Harry Potter London locations tour draws to a close.\n\nYou can now, apparate back to any location of your choosing, or simply walk back to the entrance to King's Cross St Pancras underground Station that you passed earlier.\n\nThe choice is yours, for I must leave you now.\n\nFarewell my Muggle friends!", "images": ["http://www.the-magician.co.uk/images/trolley-platform-nine-and-three-quarters.jpg", "http://www.the-magician.co.uk/images/ford-anglia-parking.jpg", "http://www.the-magician.co.uk/images/platform-nine-and-three-quarters-sign.jpg", "http://www.the-magician.co.uk/images/hp-sticky2.png", "http://www.the-magician.co.uk/images/st-pancras-station.jpg", "http://www.the-magician.co.uk/images/platforms-4-and-5.jpg", "http://www.the-magician.co.uk/images/hp-logo-3.png", "http://www.the-magician.co.uk/images/st-pancras-clock.jpg"], "top_img": "http://www.the-magician.co.uk/images/trolley-platform-nine-and-three-quarters.jpg", "keywords": [], "authors": ["Richard Jones"], "canonical_link": "https://www.the-magician.co.uk/harry-potter-london-locations.htm", "title": "Platform Nine-And-Three-Quarters, King's Cross Station.", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "author": "Richard Jones", "description": "The final section of the Harry Potter London tour heads to King's Cross Railway Station where you can pose at the entrance to Platform Nine-and-Three-Quarters."}, "movies": [], "publish_date": null, "source": "http://www.the-magician.co.uk", "summary": ""}