{"url": "https://www.elitedaily.com/p/this-photo-of-kanye-west-kissing-saint-chicago-captures-the-sweetest-father-daughter-moment-13140937", "text": "I have been in desperate need of some lighthearted, uplifting news recently. I mean really fluffy stuff — puppies learning how to walk, epic marriage proposals, and literally anything to do with babies. Fortunately, I have a celebrity family who truly understands my needs and is here to deliver. I'm talking about Kim Kardashian and Kanye West and their adorable little family, obvi! Every now and then, they take to social media to show us photos or videos of their growing family and, for that, I am eternally grateful. And now, the world is #blessed with a photo of Kanye West kissing Chicago, and it is exactly what I needed to elevate my mood today.\n\nKanye West has definitely been stirring the pot recently with... well, pretty much everything. But the one thing that has always remained constant is how much he clearly adores his children. And on Tuesday, Nov. 13, Kim Kardashian shared the sweetest photo of the \"Lift Yourself\" rapper giving their 9-month-old daughter, Chicago, a kiss on Instagram.\n\nCaptioning it with a simple happy face emoji, the photo shows Kardashian's rapper husband giving Chicago a kiss on the top of her tiny lil' head. Chicago, who's wearing a white tee (perhaps to match her dad) and a grey bib is giving her best \"stare off into the distance\" look, and to say that it's too pure for words is an understatement:\n\nCAN YOU EVEN TAKE THE CUTENESS?\n\nI can't choose which photo is cuter: Chicago and Kanye West having a precious moment together, or the photo that Kim Kardashian posted of her with her three children, North, Saint, and Chicago (or Chi, if you're trying to feel ~in the know~ with things).\n\nJust a few days ago, the Keeping Up With The Kardashians star posted the picture to Instagram, showing herself smizing with Chicago on her lap staring directly into the camera like the perfect little model. Saint is sitting (laying?) next to her giving the camera his very best profile, and North is sitting down on Kim's other side, looking like she has better things to be doing than posing for a picture. Kardashian aptly captioned the photo, \"North is always a mood 😂,\" and I've never heard a more accurate statement.\n\nIt was nice to see some sort of update with Kanye West, though, even if it wasn't regarding his new music. In case you missed it, West pushed back his Yandhi album release date once more, after initially delaying the Sept. 29 debut to Nov. 23. If you're looking to find when exactly his new album will be released, you're going to be pretty disappointed. West has yet to confirm when exactly Yandhi will drop, and on Monday, Nov. 12, he took to Twitter to open up to his fans about his new music.\n\nAfter his performance with rapper Kid Cudi at Camp Flog Gnaw, West explained that he's holding off on debuting his new album because it's not quite ready yet.\n\nHe wrote,\n\nIt felt so good being on the stage last night with my brother Cudi. After performing again, I realize the new album I’ve been working on isn’t ready yet. I’ll announce the release date once it’s done. Thank you for understanding\n\nWell, if I can't get new Kanye West music, I will absolutely settle for more Kanye West family photos, so keep 'em coming, Kim!", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/8/b47cc3b6-d313-4b09-b396-8fb0f48d2b13-getty-1205807538.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/11/14/52bff8cb-a4ed-4637-afd5-eccac6f7f7e0-getty-88438921.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/11/14/52bff8cb-a4ed-4637-afd5-eccac6f7f7e0-getty-88438921.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/10/b5088cc2-b75c-439b-818a-871f93e3532e-getty-1209679085.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/11/14/52bff8cb-a4ed-4637-afd5-eccac6f7f7e0-getty-88438921.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/this-photo-of-kanye-west-kissing-saint-chicago-captures-the-sweetest-father-daughter-moment-13140937", "title": "This Photo Of Kanye West Kissing Saint Chicago Captures The Sweetest Father-Daughter Moment", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/this-photo-of-kanye-west-kissing-saint-chicago-captures-the-sweetest-father-daughter-moment-13140937", "type": "article", "title": "Kim K Shared The Sweetest Photo Of Kanye West Kissing Chicago That'll Melt Your Heart", "description": "I have been in desperate need of some lighthearted, uplifting news recently. I mean really fluffy stuff — puppies learning how to walk, epic marriage proposals, and literally anything to do with babies. Fortunately, I have a celebrity family who…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/11/14/52bff8cb-a4ed-4637-afd5-eccac6f7f7e0-getty-88438921.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "I have been in desperate need of some lighthearted, uplifting news recently. I mean really fluffy stuff — puppies learning how to walk, epic marriage proposals, and literally anything to do with babies. Fortunately, I have a celebrity family who…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}