{"url": "https://people.com/human-interest/zander-venezia-surfer-dead-hurricane-irma/", "text": "A teenage budding pro surfer died Tuesday while riding the mega-swell waves in Barbados during Hurricane Irma, multiple outlets report.\n\nZander Venezia — of Bridgetown, Barbados — was surfing a heavy break known as “Box by Box” on the Caribbean island’s east side when he was caught by a closeout set that drove him into the shallow, rocky bottom where he hit his head on the reef, was knocked unconscious and drowned, Surfline reported.\n\nGet push notifications with news, features and more.\n\nThe 16-year-old’s death comes just two weeks after he won the $250 top prize at the Rip Curl Grom Search in North Carolina.\n\nVenezia was in Barbados with fellow surfers Nathan Florence, Dylan Graves, Balaram Stack and Asher Nolan as well as photographers Daniel Russo and Jimmy Wilson, Stab Magazine reported — who had all flown in to island to surf Irma’s swell.\n\nRELATED VIDEO: Miami-Dade County Issues Mandatory Evacuation Ahead of Hurricane Irma\n\nThey were all hitting the waves Tuesday morning when Florence first spotted Venezia’s board floating in the water, the magazine said. Rushing over to see what was wrong, he found Venezia’s limp body still underwater being hammered by the building surf.\n\nFormer Bajan pro-turned-surf instructor Alan Burke told Surfline Florence shouted for help, trying to get a bleeding and unresponsive Venezia to shore. “They tried to get him to the beach quickly, which was difficult,” Burke said. “Box by Box is a tough place to get in and out of, even if you have the ability. There’s lots of big rocks around, and some stick out of the water.”\n\nImage zoom Zander Venezia/Instagram\n\n“When they finally did get him in, they performed CPR on the beach,” Alan continued. “The ambulance came really swiftly from Speightstown, and the whole drive Nathan Florence, Dylan Graves and the paramedics continued to try and revive him. But once they got him to the hospital, Zander was breathing, but not responsive. From the time Nathan got to him in the water to when they arrived at the hospital, it was about 75 minutes of nonstop CPR.”\n\nVenezia died later at the hospital, where his family — parents Lisa and Louis Venezia and sister Bella — had joined him. Autopsy results reported Wednesday said he suffered no fractures, Surfline reported.\n\nAfter his death, Venezia’s friends took to social media to share their memories of the young athlete.\n\n“I’m going to miss you so much Zander!” said Nolan, who watched Venezia’s last surf, on Instagram. “You had such an amazing session today. Surfed for 4 hours. You were charging and had the happiest smile on your face every time I saw you. You were a humble, respectful, full of positive energy that every kid should look up too and live the way you did.”\n\n“Gone too soon,” he continued. “My heart is heavy. The Venezias always treated me like family and it hurts that they have to go through losing someone so special.”\n\n“This saddens me in a way that my stomach actually hurts,” said friend Patrick Ruddy. “I’m floored by the news this morning that our good friend @zandervenezia passed away doing what we all love, surfing at home and enjoying the ocean. It’s times like this I reflect on how fragile life really is, and how quickly it can be taken away. Zander you’re gonna be really f—— missed!”\n\nRELATED VIDEO: Hurricane Irma Strikes Puerto Rico Before Moving Toward Florida. Here’s What to Know\n\n“I feel empty,” Burke told Surfline in tears. “We are in shambles over here. … Zander was such a good, funny kid. He was always joking, and he just loved surfing. He was so jovial, such a joy to be around. I just can’t believe he’s gone. I’m a mess, man. We’re all a mess over here.”\n\nBurke also revealed what was believed to be Zander’s last words, spoken to friend Dylan Graves before his final surf.\n\n“He told Dylan, ‘I just got the best wave of my life’ ” Burke said.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=655&h=343&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fzander-venezia.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fzander-venezia.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=655&h=343&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fzander-venezia.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/human-interest/zander-venezia-surfer-dead-hurricane-irma/", "title": "Zander Venezia Dies Surfing in Barbados During Hurricane Irma", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Human Interest News,Hurricanes,News", "news_keywords": "Human Interest News,Hurricanes,News", "description": "Teenage surfer Zander Venezia died Tuesday while riding the mega-swell waves in Barbados during Hurricane Irma", "og": {"title": "Zander Venezia Dies Surfing in Barbados During Hurricane Irma", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/human-interest/zander-venezia-surfer-dead-hurricane-irma/", "description": "A teenage budding pro surfer died Tuesday while riding the mega-swell waves in Barbados during Hurricane Irma, multiple outlets report. Zander Venezia — of Bridgetown,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=655&h=343&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fzander-venezia.jpg", "width": 655, "height": 343}}, "pinterest": {"url": "https://people.com/human-interest/zander-venezia-surfer-dead-hurricane-irma/", "description": "Teenage surfer Zander Venezia died Tuesday while riding the mega-swell waves in Barbados during Hurricane Irma", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fzander-venezia.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/human-interest/zander-venezia-surfer-dead-hurricane-irma/", "title": "Zander Venezia Dies Surfing in Barbados During Hurricane Irma", "description": "Teenage surfer Zander Venezia died Tuesday while riding the mega-swell waves in Barbados during Hurricane Irma", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=655&h=343&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fzander-venezia.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}