{"url": "https://www.wordstream.com/blog/ws/2016/10/19/get-more-instagram-followers", "text": "Instagram quickly outgrew its first impression as a fun app for kids and has become a serious content marketing, selling, networking and audience building tool for individuals and brands. It's one of the most popular social networking sites on the planet, with over 200 million active monthly members sharing 60 million images and 1.6 billion likes per day.\n\nJust how awesome is it? Engagement rates for brands on most social networks are less than 0.1%, but Instagram blows them all away. The average Instagram engagement rate for brands in a 2014 Forrester study was an epic 58 times higher than on Facebook.\n\nYou can't argue with numbers like that. But that's just average. And as I advocate across all manners of online marketing, you don't want to be average! It's not a dream or a goal.\n\nSure, 58 times greater engagement than Facebook sounds great, but you can do so much better than that on Instagram. Whether you're a big brand or maybe just wondering how to become Instagram famous, I don't want you to strive for average; I want you to reach for the stars and become an Instagram unicorn. A digital unicorn is that magical, rare creature that outperforms all others by orders of magnitude.\n\nAnd you're going to accomplish this by working these eleven amazing Instagram hacks into your social strategy. Check out these attention-getting ideas for your Instagram captions, hashtags, profile, and more, and see what to post on Instagram to get more followers and way more visibility and engagement too.\n\n1. Cross-promote your dedicated hashtag.\n\nThat's nice that you created a #joesgarage hashtag for your company, but who knows to use it to share content about you? Make sure it's in your profile, but take the game offline and have it printed on your receipts, in print ads, on signage in your store and at relevant events.\n\nIf you're on radio and TV, direct people to use your hashtag. Integrate online and offline campaigns by ensuring it's listed on your other social profiles, on your website, and in your email blasts. Don't just hope people will find it.\n\n2. Get creative with hashtagging.\n\nWhen it comes to Instagram caption ideas, you need to look beyond the one-word, obvious hashtags. Sure, you want to use those, too, but mix it up and use hashtags to tell part of your story. Be funny, ironic, or outrageous--just don't be BORING. Collaborative workspace company WeWork is great at this, and they include a fun mix of Instagram content, too.\n\n3. Participate in massively popular conversations.\n\nFor every post, use a mix of topically relevant hashtags such as #woodworking for a carpentry company, for example, as well as trending, super-popular hashtags wherever you can.\n\nThe really specific hashtags are like long-tail keywords in that they show more intent and help you find the right people, but the universally trending hashtags like #instagood, #tbt, #photooftheday or even plain old #fun get you in front of more people in general. You need both to make it on a social network as big and noisy as Instagram.\n\n4. Make the most of your bio URL.\n\nIt's prime real estate on your Instagram profile... do you really want your bio to only link to your website homepage, now and forever? Yawn. Change it up at least bi-weekly and use that clickable link in your bio to drive traffic to your newest or most popular content.\n\n5. Get descriptive with your captions.\n\nA picture is worth a thousand words, but you can't skip the words entirely. National Geographic is fantastic at using storytelling alongside their Instagram photos to generate engagement and sharing. While traditional media brands have dropped like flies, NatGeo has thrived across digital and become one of the top brands on Instagram, with over 50 million followers.\n\nLike the other Instagram hacks I've included here, this is something you'll want to commit to working into your strategy over time, so don't worry if it feels weird at first. Your writing will improve as you find your brand's Instagram voice.\n\n6. Go all in on influencer marketing.\n\nVisit the profiles of each person you've identified as an influencer in your space (AKA a person who influences the people you want to get in front of) and \"Turn On Post Notifications\" to be notified every time they share new content. You can then interact with them regularly and become one of their favorite people or brands.\n\n7. Remove unwanted tagged photos of you from your profile.\n\nIf you only want to feature the best user-generated content about you or your brand on your Instagram profile, you can. Now, you can't remove the tagged photos from the site entirely, by choosing \"Edit Tags,\" selecting the ones you want to remove and choosing \"Hide from Profile\" (you may need to confirm). It does the trick.\n\n8. Approve photo tags before the content shows on your profile.\n\nSpeaking of giving you greater control over which tagged photos appear on your profile, you can change your Instagram setting so tagged photos won't show unless you approve them first. You'll find this under \"Options,\" \"Photos of You,\" and \"Add Manually.\"\n\nI'm trying to think of a reason why any company would NOT want to do this... Nope. I've got nothing. You should absolutely set this up to avoid potentially embarrassing situations.\n\n9. Develop your own Instagram style.\n\nIt's human nature to want to fit in, but on Instagram, you want to stand out. Indian beverage brand Frooti has developed such a unique visual content style, it's instantly recognizable every time a user sees a Frooti post in their newsfeed. Check it out:\n\n10. Get local.\n\nSee what's going on in a specific area (say, your neighborhood, a city you're targeting in ads, or even an event in a certain location) by going to the search page and choosing the Places tab. Then, type in the name of the place to see all geotagged posts for that location.\n\nCheck out more big trends in local social marketing here.\n\n11. Remember your calls to action!\n\nInstagram, like other social networks, is a conversation, not a broadcasting platform. What action do you want people to take on your post? If you don't know that, start over and figure it out. Staples is great at generating engagement by letting people know exactly what they expect them to do with their posts (bonus points if you make it sound fun). Often, that call to action cleverly gets people to share or virally spread Staples' content.\n\nHow to Get More Followers on Instagram [Summary]\n\nTo get more followers on Instagram do the following things:\n\nPromote your dedicated hashtag on your other social profiles, on your website, and your email blast. Get creative with your hashtags. Be funny, ironic, or outrageous – but never boring! Watch topically relevant and trending hashtags. Join these conversations to get in front of more people. Use your bio link to drive traffic to your newest or most popular content. Write descriptive captions. Storytelling will help generate engagement and sharing. Interact with top influencers in your space and try to become one of their favorite people or brands. Don't want a tagged photo of you or your brand on your profile? Edit Tags to hide images from your profile. Adjust your settings so any potentially embarrassing tagged photos won't show without your approval. Develop your own unique, recognizable visual style. Figure out how you want to stand out and make it so! Visit the Places tab to see what's happening locally - your neighborhood, a city you're targeting in ads, or an event in a certain location. Use a call to action to tell people what you want them to do with your posts. Find clever ways to get people to share your content.\n\nAre you marketing your business on Instagram? Do you have a favorite Instagram hack or trick to share? Leave yours in the comments below!\n\nThis article was originally published at Inc.com. It is republished here with permission.", "images": ["https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/Twitter.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/person/lkim-3.JPG", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/yt_footer_icon.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/instagram%20story%20ad%20polls%20dunkin_0.png?a3kFnxCDHejVhH9fxtzWVbycCTC9e7zk", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/travel-marketing-on-instagram-airy-indonesia.jpg?qU9F.Jg05oN.TpEjASkDtNq0umRsV2tw", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/media/images/11-hacks-to-become-instagram-famous-frooti.jpg?78k0Ee_ZOTTLzY6x56eY6tc3LjF0vP2t&itok=_Rr2uZ2Z", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/facebook-marketing-partner.png", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/fb_grader_sidebar_icon.png", "https://www.wordstream.com/themes/custom/icecream/logo.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/microsoft-badge.png", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/muse.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/11-hacks-to-become-instagram-famous-woodworking-hashtag.png?oPxMZtoFnWsvV_vNMfnpUsc0DbUfYDEp&itok=9da6na-a", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/11-hacks-to-become-instagram-famous-instagram-add-photo-manually.jpg?7Ut8gRBM8A9mai.z4LS7IA9B5WUpw4x_&itok=aYVCkpLL", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/11-hacks-to-become-instagram-famous-project-runway-billboard.jpg?Y4y2Jh.Q69ea1D3uRESrBy4Vrxbh6zvD&itok=d8AI5XC_", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/instagram-carousel-ads-copy.jpg?_DEqVPEocjhmU0MjdZiuW1SmORRRXVZz", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/facebook.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/instagram%20bios.png?UvMZR._mgblez4B_Dr6RelqEMxZhA_qX", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/get-instagram-famous-fast.gif?Qjrl0DH0s_N22v_1E3qzJEjin1Z4YVeR&itok=4Ap_z8LI", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/small_120x120/public/images/person/lkim-3.JPG?sq8quBSnZ7zS3H9K2.vmSmomGN13I9sL&itok=KT9cPD5i", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/11-hacks-to-become-instagram-famous-turn-on-post-notifications.png?wlQlE2KBFDWQdaA8H4J1xxSMsC0CmNN2&itok=RZhkDfpg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/Linked%20in.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/media/images/11-hacks-to-become-instagram-famous-national-geographic-instagram.jpg?0Yk37hut6efTDOFmwNq0K7pKxYx4H5UD&itok=0sp8UVy6", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/media/images/11-hacks-to-become-instagram-famous-location-tagging-2.jpg?XbgN7z1fwAdETwVisKOv5DGuV9Zv8nNs&itok=NEl5RT-f", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/media/images/11-hacks-to-become-instagram-famous-get-local.jpg?0.KMaWu3gAI1Q24oT2IsGk8DIisBya_u&itok=K16VaGup", "https://www.wordstream.com/themes/custom/icecream/images/icons/social/instagram_authorcard.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/icons/instagram_footer_icon.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/", "https://www.wordstream.com/themes/custom/icecream/images/icons/social/twitter_authorcard.svg", "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/styles/simple_image/public/images/11-hacks-to-become-instagram-famous-wework-hashtags.png?wxiocsPoigx90ZJIQrbEspfPKUSomuC3&itok=oM2-HdIz"], "top_img": "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/", "keywords": [], "authors": ["Larry Kim"], "canonical_link": "https://www.wordstream.com/blog/ws/2016/10/19/get-more-instagram-followers", "title": "11 Ways to Get More (Real!) Instagram Followers", "meta_data": {"description": "Want more Instagram followers? Want to drive higher engagement and funnel droves of users to your profile? Check out Larry Kim's top 11 hacks and ascend to Instagram stardom faster than ever!", "og": {"type": "article", "url": "https://www.wordstream.com/blog/ws/2016/10/19/get-more-instagram-followers", "title": "11 Ways to Get More (Real!) Instagram Followers", "description": "Instagram quickly outgrew its first impression as a fun app for kids and has become a serious content marketing, networking and audience building tool for individuals and brands. It's...", "image": "https://wordstream-files-prod.s3.amazonaws.com/s3fs-public/images/media/images/"}, "abstract": "Instagram quickly outgrew its first impression as a fun app for kids and has become a serious content marketing, networking and audience building tool for individuals and brands. It's...", "keywords": "Instagram", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1476806400.0, "source": "https://www.wordstream.com", "summary": ""}