{"url": "https://www.elitedaily.com/p/video-of-chrissy-teigen-john-legends-new-puppy-is-so-adorable-itll-melt-your-heart-2808131", "text": "If her hilarious tweets and Instagram posts (oftentimes at the expense of her good-natured hubby, John Legend) weren't enough to make you google \"How to become best friends with Chrissy Teigen,\" then I'm sure the arrival of their daughter, Luna Simone, probably was. Seriously, you'll take one look at Luna and wonder how anyone ever accurately used the word \"adorable\" before she was born. If you're still looking for reasons to hop on the Teigen train, then look no further than this cuddly video of Chrissy Teigen & John Legend's new puppy.\n\nAccording to People, the banana bread maven and her Grammy-winning husband have added a new puppy to their brood. Thankfully, there are adorable pictures and videos to prove it. Teigen first posted news of their new bulldog puppy to Instagram on Friday night, Oct. 6. The photo of Luna and Pepper — the new pup's name and Vilailuck Teigen's (Teigen's mom) nickname — naturally began raking in the likes.\n\nIn the first pic, you only really get a glimpse of the pup as Pepper hides out behind Luna, who is sporting her toddler-chic ensemble (OK, it's just a diaper but she really pulls it off flawlessly). Chrissy captioned it with:\n\nwhat happens at lip sync battle does not always stay at lip sync battle @caseypattersontv @llcoolj\n\nI'm not quite sure how Pepper and Lip Sync Battle are connected (People wasn't either), but I'll pretend I know what's happening just so the Cravings cookbook author doesn't think I'm an out-of-the-loop nerd.\n\nTeigen, being the social media master that she is, probably knew that the people would want more pup... and oh, did she deliver.\n\nHere is the first glimpse of Pepper.\n\nAww, look at Luna bonding with her new pup. This family is no stranger to dogs, either. According to People, Teigen and Legend already have three other dogs: two French Bulldogs named Penny and Pippa, and an English Bulldog named Puddy.\n\nOK, now that you've got some background, I think you're ready for some video of Pepper in action. But really... prepare yourselves, you guys, because it has everything.\n\nNot only are there puppy-sized yips, but there're also what looks like a little Luna stepping into the shot in the peripheral. One of the other dogs gets in on the fun, and Pepper is being called by her namesake, Teigen's mom, in the video.\n\nYou'll watch this video no less than five times.\n\nI mean... I didn't think it was possible for the Teigen-Legend crew to get any cuter, yet they just did.\n\nIf you thought that was the end of it, hold on, because Teigen posted another gem to Instagram on late Friday night, Oct. 6. There are no puppies, but you will not be disappointed.\n\nTeigen captioned it with, \"baby John = baby Luna,\" and one you get a look at the pic, you'll see that her math is spot-on. Seriously, they could be twins. First, let's get another look at baby Luna, so you are fully prepared to make an educated comparison (also, like who doesn't want see Luna?)\n\nHere she is straight killing the chilling-in-a-wicker-chair game.\n\nHere is the photo of baby John.\n\nNot that you need it spelled out for you, but Legend is the one front-and-center in the photo. Now, Luna might be giving more a full-on smile in her pic, but the resemblance is pretty much uncanny. I'd bet seeing that makes Legend feel like one proud papa.\n\nEven though they're both very successful, Teigen and Legend are not raising Luna with silver spoon in her mouth. From the looks of Teigen's Instagram, Luna is definitely going to help when it comes to taking care of the dogs.\n\nLuna nailed that whole \"first chore\" thing.\n\nWell, that's all the Teigen-Legend news I have for you today, which I'm sure is fine by you, because you'll probably just go rewatch that Pepper video now.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2017/10/7/bcf83e7b-06bb-486b-b69f-3aa59ef44507-chrissy-teigen-new-bulldog.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/fa7b860b-a00d-495b-a51d-bc1aa651007a-getty-1189601393.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/0b309ce1-1d9c-4d09-88b8-c3c937db183e-getty-1206937594.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/10/f33f50b3-05a0-4572-8753-146b561ab4ce-screen-shot-2020-04-10-at-32544-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2017/10/7/bcf83e7b-06bb-486b-b69f-3aa59ef44507-chrissy-teigen-new-bulldog.png?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/image/2017/10/7/bcf83e7b-06bb-486b-b69f-3aa59ef44507-chrissy-teigen-new-bulldog.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/video-of-chrissy-teigen-john-legends-new-puppy-is-so-adorable-itll-melt-your-heart-2808131", "title": "Video Of Chrissy Teigen & John Legend's New Puppy Is So Adorable It'll Melt Your Heart", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/video-of-chrissy-teigen-john-legends-new-puppy-is-so-adorable-itll-melt-your-heart-2808131", "type": "article", "title": "Chrissy Teigen And John Legend Got A New Puppy And He's So, So Adorable — VIDEO", "description": "If her hilarious tweets and Instagram posts (oftentimes at the expense of her good-natured hubby, John Legend) weren't enough to make you google \"How to become best friends with Chrissy Teigen,\" then I'm sure the arrival of their daughter, Luna…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/10/7/bcf83e7b-06bb-486b-b69f-3aa59ef44507-chrissy-teigen-new-bulldog.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "If her hilarious tweets and Instagram posts (oftentimes at the expense of her good-natured hubby, John Legend) weren't enough to make you google \"How to become best friends with Chrissy Teigen,\" then I'm sure the arrival of their daughter, Luna…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}