{"url": "https://ca.hellomagazine.com/royalty/02018052545326/meghan-markle-friend-janina-gavankar-reveals-royal-wedding-details", "text": "Actress Janina Gavankar reveals the cutest detail of Prince Harry and Meghan's exclusive wedding reception By Clare Douglas\n\nDetails about Prince Harry and Meghan Markle'sexclusive nighttime reception following their royal wedding have been the couple's best-kept secret… until now. The bride’s close friend Janina Gavankar was one of 200 guests to score an invite to the bash and has since revealed some of her favourite highlights from the evening. \"We all danced until the wee hours. We partied and celebrated and ate sliders at 2 in the morning,” shared the actress, adding that the party inside Frogmore House was the perfect ending to a “powerful day in history.\"\n\nSpeaking to Town and Country, the former True Blood star let slip a few secrets, including the adorable nod the couple paid to their homelands. Each table was named after a food that is pronounced differently in the UK than in the U.S. \"Potato, potato, tomato, tomato, oregano, oregano,\" explained Janina, adding that it was one of many “nods to the beautiful mashup of two cultures.\" Another moment the 37-year-old will not soon forget is the touching speech Prince Harry delivered to his new wife. “The speech was so funny, self deprecating, filled with love, and that guy just has her back. I left feeling so solid for them,\" she told the publication.\n\nRelated: Ben Mulroney reflects on his twins' role in royal wedding\n\nThe culmination of the moving ceremony, luncheon hosted by the Queen and romantic reception left the stunning star, “feeling so confident that these two will put their combined power into the world for good.” She is also excited to see the positive change the couple will make as a joint force. \"They did it apart. They’ve done it apart their entire lives. Imagine what they can do together.\"\n\nAfter winning style points in a vintage orange caped-dress at the wedding ceremony, Janina slipped into a canary yellow mermaid gown for the formal reception. The actress created the looks with help for her stylist Niki Schwan, who revealed that she was unable to secure any fashion designers to dress her client. \"We requested several designer brands & showrooms (for her to wear to the wedding) who either denied us or just ignored us,\" wrote Niki on Instagram. In the end, the duo was granted access to the archives a the Western Costume Co., where they found Janina's bespoke ensemble.", "images": ["https://ca.hellomagazine.com/images/stories/0/2018/05/25/000/592/127/featured_5_3.jpg", "https://www.himgs.com/css/hello/img/logo.png", "https://ca.hellomagazine.com/royalty/02018052545326/\nhttps:/www.facebook.com/tr?id=1728383620790976&ev=PageView&noscript=1", "https://certify.alexametrics.com/atrk.gif?account=HS7uq1SZw320l9", "https://www.himgs.com/imagenes/hello-canada/common/sjc-black.png"], "top_img": "https://ca.hellomagazine.com/images/stories/0/2018/05/25/000/592/127/featured_5_3.jpg", "keywords": [], "authors": ["Hello"], "canonical_link": "https://ca.hellomagazine.com/royalty/02018052545326/meghan-markle-friend-janina-gavankar-reveals-royal-wedding-details", "title": "Meghan Markle's friend Janina Gavankar reveals royal wedding reception details", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Meghan Markle's friend Janina Gavankar reveals royal wedding reception details | HELLO! Canada", "description": "Meghan Markle's close friend opened up about the evening reception at Frogmore House, including cute details about the table settings and Prince Harry's speech!", "keywords": "Royal wedding, Prince Harry, Meghan markle, Prince Harry and Meghan, British royals, Janina Gavankar, Royalty, Home, royal wedding reception, royal wedding party", "dc.title": "Meghan Markle's friend Janina Gavankar reveals royal wedding reception details | HELLO! Canada", "origen": "ca.hellomagazine.com", "author": "HELLO! Canada", "DC.Creator": "HELLO! Canada", "organization": "HELLO! Canada", "DC.Language": "English", "lang": "en-CA", "Locality": "Ottawa, CA", "distribution": "global", "resource-type": "document", "fb": {"pages": 69132375226}, "og": {"title": "Meghan Markle's friend Janina Gavankar reveals royal wedding reception details | HELLO! Canada", "description": "Meghan Markle's close friend opened up about the evening reception at Frogmore House.", "site_name": "ca.hellomagazine.com", "image": "https://ca.hellomagazine.com/images/stories/0/2018/05/25/000/592/127/featured_5_3.jpg"}, "twitter": {"card": "summary", "site": "https://ca.hellomagazine.com", "creator": "HelloCanada", "url": "/royalty/02018052545326/meghan-markle-friend-janina-gavankar-reveals-royal-wedding-details", "title": "Meghan Markle's friend Janina Gavankar reveals royal wedding reception details | HELLO! Canada", "description": "Meghan Markle's close friend opened up about the evening reception at Frogmore House.", "image": "https://ca.hellomagazine.com/images/stories/0/2018/05/25/000/592/127/featured_5_3.jpg"}, "p": {"domain_verify": "64e5ad43640404508ca81965e23ed045"}}, "movies": [], "publish_date": 1527177600.0, "source": "https://ca.hellomagazine.com", "summary": ""}