{"url": "https://www.slashfilm.com/hocus-pocus-remake-no-original-cast/", "text": "The cult classic Disney movie that became a staple of Halloween night marathons for millennials across the country is getting its highly demanded resurrection — but probably not as Hocus Pocus fans would have liked.\n\nHocus Pocus is returning from the grave as a TV movie remake without any of the original cast. Which…feels more like a trick than a treat.\n\nThe Hocus Pocus remake will be a reimagining of the 1993 live-action classic, which originally starred Bette Midler, Sarah Jessica Parker, and Kathy Najimy as the fabulous, scene-stealing witches who terrorize the children of Salem after they were accidentally resurrected. Disney Channel is currently developing the remake with The Royals’ Scarlett Lacey working on the screenplay and original movie producer David Kirschner on board to executive produce, according to Deadline.\n\nBut it seems like in addition to the cast, none of the original crew are involved in the remake either, despite Hocus Pocus co-writer Mick Garris excitedly discussing the prospect of a Hocus Pocus sequel earlier this week. Director Kenny Ortega – who has since helmed massive Disney Channel hits like High School Musical and Descendants – isn’t involved either.\n\nThis news is a little disappointing for fans of the Sanderson Sisters, especially since the promise of a fully reunited Hocus Pocus 2 had been bouncing around Hollywood for decades — and as recently as yesterday!\n\nIt’s taken so long that Midler’s enthusiasm for the project waned, saying in 2015, “After all these years and all the fan demand, I do believe I can stand and firmly say an unequivocal no.” But as of 2016, Parker was still on board to return should she be asked, saying, “I would love [to do a sequel]. I think we’ve all been fairly vocal about being very keen but that hasn’t created any groundswell of movement.”\n\nAnd in his recent interview in which he mentioned that the sequel would be made for TV, Garris said that he expected the three original actresses to return: “If they don’t do that I think it would be a big mistake because all three of them are still so incredibly potent and powerful and great performers and who else can recreate those characters?”\n\nAlas, it is not meant to be, and we’ll likely see some younger and more Disney Channel-friendly stars step into those crooked, magical dancing shoes. Let’s hope if they do a musical sequence, it can live up to Bette Midler’s iconic rendition of “I Put a Spell On You.”", "images": ["https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/hocus-pocus-e1506611572143-700x340.jpg", "https://www.slashfilm.com/siteimages/pm-comments.jpg", "https://d13ezvd6yrslxm.cloudfront.net/authors/43.jpg", "https://sstatic1.histats.com/0.gif?1648144&101", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/hocus-pocus-e1506611572143.jpg"], "top_img": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/hocus-pocus-e1506611572143.jpg", "keywords": [], "authors": ["Hoai-Tran Bui"], "canonical_link": "https://www.slashfilm.com/hocus-pocus-remake-no-original-cast/", "title": "Hocus Pocus Remake in the Works Without the Original Cast", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 254451208349115}, "description": "Disney Channel is developing a Hocus Pocus remake helmed by Kenny Ortega without original stars Bette Midler, Sarah Jessica Parker, and Kathy Najimy.", "news_keywords": "bette midler, hocus pocus, kathy najimy, kenny ortega, mick garris, sarah-jessica-parker, scarlett lacey, movies, film, tv", "original-source": "https://www.slashfilm.com/hocus-pocus-remake-no-original-cast/", "og": {"locale": "en_US", "type": "article", "title": "Hocus Pocus Remake in the Works Without the Original Cast", "description": "Disney Channel is developing a Hocus Pocus remake helmed by Kenny Ortega without original stars Bette Midler, Sarah Jessica Parker, and Kathy Najimy.", "url": "https://www.slashfilm.com/hocus-pocus-remake-no-original-cast/", "site_name": "/Film", "updated_time": "2017-09-28T08:55:55-07:00", "image": {"identifier": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/hocus-pocus-e1506611572143.jpg", "secure_url": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/hocus-pocus-e1506611572143.jpg", "width": 1400, "height": 679}}, "article": {"publisher": "https://www.facebook.com/slashfilm", "tag": "Scarlett Lacey", "section": "Remakes", "published_time": "2017-09-28T09:00:38-07:00", "modified_time": "2017-09-28T08:55:55-07:00"}, "twitter": {"card": "summary_large_image", "description": "Disney Channel is developing a Hocus Pocus remake helmed by Kenny Ortega without original stars Bette Midler, Sarah Jessica Parker, and Kathy Najimy.", "title": "Hocus Pocus Remake in the Works Without the Original Cast", "site": "@slashfilm", "image": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/hocus-pocus-e1506611572143.jpg", "creator": "@slashfilm"}, "msapplication-TileImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/cropped-ZZ46A5EC75-270x270.jpg"}, "movies": ["https://www.youtube.com/embed/zaC-WDrvmUQ?feature=oembed"], "publish_date": 1506614438.0, "source": "https://www.slashfilm.com", "summary": ""}