{"url": "https://www.latintimes.com/el-senor-de-los-cielos-star-fernanda-castillo-suffers-family-deaths-after-earthquake-424264", "text": "Fernanda Castillo unfortunately lost two family members in the earthquake that struck Mexico this week. The \"El Señor de los Cielos\" star had posted on Twitter she was looking for her cousin and her husband following the temblor. \"If anyone has info of Florencia Lorandi Castillo or Martín Velez Tenorio that were in Edimburgo street, their families are looking for them\", she plead. Castillo then took to Instagram to echo her plea writing: \"Please, any information you may have, they were in the Edimburgo building and we can't contact them.\"\n\nHours later it was Fernanda's brother, Pablo, that confirmed they had been found dead. \"It hurts my soul,\" he wrote in an Instagram post. \"I will always have them in my heart. My siblings and partners. They left together and they will be forever together.\"\n\nIn a follow up post, Pablo wrote: \"They filled my life with light and I will never be able to fill that void they left. We can only live and follow their example. Always in my heart, Martin and Florencia.\"\n\nFernanda Castillo has not posted anything regarding her family members but we can only imagine how devastated she might be. She has been using her social media networks to update everyone on where help is needed.\n\nMany stars have been using their fame to benefit the victims of the earthquake like Ana Brenda, that started a crowdsourcing effort to help everyone that was affected. \"Hi, I'm Ana Brenda and I am an actress that lives in the city of Mexico,\" she wrote on the GoFundMe site. \"I saw the catastrophe in the Roma neighborbood and saw how much help is needed. I am starting a campaign to help our beloved Mexico on this sad day. Please help. I will be buying supplies and personally delivering them. I will show proof of receipts on social networks. We need to unite. Love you. Ana.\"\n\nAna Brenda was touched by the success of the campaign and updated her followers with the following note: \"Good morning everybody. Help is needed fast. Thank you all for your donations I am profoundly moved. I know I said I would donate it to the Red Cross but supply is needed fast. I hope you don't get upset that I go buy supply and personally deliver your donations. I will upload receipts and proof of everything.\"\n\nSalma Hayek is also doing her part as she opened an account on CrowdRise, which is part of GoFundMe to help her native country Mexico after the devastating earthquakes. Hayek also donated $100,000 to the campaign. “The people of my country have now suffered three natural disasters in a row,” said Hayek on her campaign. “Many children and families are hurt and in terrible need. I'm contributing $100,000 now to UNICEF which has teams on the ground responding. Please join me and contribute what you can and thank you.”", "images": ["https://images.latintimes.com/sites/latintimes.com/files/2017/09/21/fernanda-castillo.jpg"], "top_img": "https://images.latintimes.com/sites/latintimes.com/files/2017/09/21/fernanda-castillo.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latintimes.com/el-senor-de-los-cielos-star-fernanda-castillo-suffers-family-deaths-after-earthquake-424264", "title": "'El Señor De Los Cielos' Star, Fernanda Castillo, Suffers Family Deaths After Earthquake In Mexico", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1, user-scalable=no", "news_keywords": "fernanda castillo, el senor de los cielos, earthquake, mexico, death", "fb": {"app_id": 229373533940657, "pages": 492371650790156}, "og": {"type": "article", "site_name": "Latin Times", "url": "https://www.latintimes.com/el-senor-de-los-cielos-star-fernanda-castillo-suffers-family-deaths-after-earthquake-424264", "title": "Fernanda Castillo Lost 2 Family Members In Earthquake", "description": "The telenovela star suffered a huge tragedy in the aftermath of the earthquake that struck México this week.", "image": {"identifier": "https://images.latintimes.com/sites/latintimes.com/files/2017/09/21/fernanda-castillo.jpg", "secure_url": "https://images.latintimes.com/sites/latintimes.com/files/2017/09/21/fernanda-castillo.jpg", "height": 751, "width": 1200, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/thelatintimes", "section": "Entertainment", "modified_time": "2017-09-21T21:32:17-04:00", "published_time": "2017-09-21T21:32:17-04:00"}, "twitter": {"site": "@thelatintimes", "card": "summary_large_image", "title": "Fernanda Castillo Lost 2 Family Members In Earthquake", "url": "https://www.latintimes.com/el-senor-de-los-cielos-star-fernanda-castillo-suffers-family-deaths-after-earthquake-424264", "description": "The telenovela star suffered a huge tragedy in the aftermath of the earthquake that struck México this week.", "image": "https://images.latintimes.com/sites/latintimes.com/files/styles/large/public/2017/09/21/fernanda-castillo.jpg"}, "msapplication-TileColor": "#17323f", "msapplication-config": "https://images.latintimes.com/sites/latintimes.com/themes/lt/favicons/browserconfig.xml", "theme-color": "#17323f", "keywords": "fernanda castillo, el senor de los cielos, earthquake, mexico, death", "description": "The telenovela star suffered a huge tragedy in the aftermath of the earthquake that struck México this week."}, "movies": [], "publish_date": 1506043937.0, "source": "https://www.latintimes.com", "summary": ""}