{"url": "https://en.wikipedia.org/wiki/Wallis_Simpson", "text": "Wife of Edward VIII of the United Kingdom\n\n\"Duchess of Windsor\" redirects here. For the ducal title, see Duke of Windsor\n\nDuchess of Windsor (more)\n\nWallis Simpson (born Bessie Wallis Warfield; 19 June 1896[1] – 24 April 1986), later known as the Duchess of Windsor, was an American socialite divorcée whose intended marriage to the British king Edward VIII caused a constitutional crisis that led to Edward's abdication.\n\nWallis grew up in Baltimore, Maryland. Her father died shortly after her birth and she and her widowed mother were partly supported by their wealthier relatives. Her first marriage, to U.S. naval officer Win Spencer, was punctuated by periods of separation and eventually ended in divorce. In 1931, during her second marriage, to Ernest Simpson, she met Edward, then Prince of Wales. Five years later, after Edward's accession as King of the United Kingdom, Wallis divorced her second husband to marry Edward.\n\nThe King's desire to marry a woman who had two living ex-husbands threatened to cause a constitutional crisis in the United Kingdom and the Dominions, and ultimately led to his abdication in December 1936 to marry \"the woman I love\".[2] After abdicating, the former king was created Duke of Windsor by his brother and successor, King George VI. Wallis married Edward six months later, after which she was formally known as the Duchess of Windsor, but was not allowed to share her husband's style of \"Royal Highness\".\n\nBefore, during, and after the Second World War, the Duke and Duchess of Windsor were suspected by many in government and society of being Nazi sympathisers. In 1937, they visited Germany and met Adolf Hitler. In 1940, the Duke was appointed governor of the Bahamas, and the couple moved to the islands until he relinquished the office in 1945. In the 1950s and 1960s, the Duke and Duchess shuttled between Europe and the United States living a life of leisure as society celebrities. After the Duke's death in 1972, the Duchess lived in seclusion and was rarely seen in public. Her private life has been a source of much speculation, and she remains a controversial figure in British history.\n\nEarly life [ edit ]\n\nWallis Warfield before 1936\n\nAn only child, Bessie Wallis (sometimes written \"Bessiewallis\") Warfield was born in Square Cottage at Monterey Inn, a hotel directly across the road from the Monterey Country Club, in Blue Ridge Summit, Pennsylvania.[3] A summer resort close to the Maryland–Pennsylvania border, Blue Ridge Summit was popular with Baltimoreans escaping the season's heat, and Monterey Inn, which had a central building as well as individual wooden cottages, was the town's largest hotel.[4][5]\n\nHer father was Teackle Wallis Warfield, the fifth and youngest son of Henry Mactier Warfield, a flour merchant described as \"one of the best known and personally one of the most popular citizens of Baltimore\" who ran for mayor in 1875.[6] Her mother was Alice Montague, a daughter of stockbroker William Latane Montague. Wallis was named in honour of her father (who was known as Wallis) and her mother's elder sister, Bessie (Mrs D. Buchanan Merryman), and was called Bessie Wallis until at some time during her youth the name Bessie was dropped.[7]\n\nAccording to a wedding announcement in the Baltimore Sun (20 November 1895), her parents were married by C. Ernest Smith at Baltimore's Saint Michael and All Angels' Protestant Episcopal Church on 19 November 1895,[8] which suggests she was conceived out of wedlock. Wallis claimed that her parents were married in June 1895.[9] Her father died of tuberculosis on 15 November 1896.[10] For her first few years, she and her mother were dependent upon the charity of her father's wealthy bachelor brother Solomon Davies Warfield, postmaster of Baltimore and later president of the Continental Trust Company and the Seaboard Air Line Railway. Initially, they lived with him at the four-story row house, 34 East Preston Street, that he shared with his mother.[11]\n\nIn 1901, Wallis's aunt Bessie Merryman was widowed, and the following year Alice and Wallis moved into her four-bedroom house on West Chase Street, Baltimore, where they lived for at least a year until they settled in an apartment, and then a house, of their own. In 1908, Wallis's mother married her second husband, John Freeman Rasin, son of a prominent Democratic party boss.[12]\n\nOn 17 April 1910, Wallis was confirmed at Christ Episcopal Church, Baltimore, and between 1912 and 1914 her uncle paid for her to attend Oldfields School, the most expensive girls' school in Maryland.[13] There she became a friend of heiress Renée du Pont, a daughter of Senator T. Coleman du Pont of the du Pont family, and Mary Kirk, whose family founded Kirk Silverware.[14] A fellow pupil at one of Wallis's schools recalled, \"She was bright, brighter than all of us. She made up her mind to go to the head of the class, and she did.\"[15] Wallis was always immaculately dressed and pushed herself hard to do well.[16] A later biographer wrote of her, \"Though Wallis's jaw was too heavy for her to be counted beautiful, her fine violet-blue eyes and petite figure, quick wits, vitality, and capacity for total concentration on her interlocutor ensured that she had many admirers.\"[17]\n\nFirst marriage [ edit ]\n\nIn April 1916, Wallis met Earl Winfield Spencer Jr., a U.S. Navy aviator, at Pensacola, Florida, while visiting her cousin Corinne Mustin.[18] It was at this time that Wallis witnessed two airplane crashes about two weeks apart, resulting in a lifelong fear of flying.[19] The couple married on 8 November 1916 at Christ Episcopal Church in Baltimore, which had been Wallis's parish. Win, as her husband was known, was a heavy drinker. He drank even before flying and once crashed into the sea, but escaped almost unharmed.[20] After the United States entered the First World War in 1917, Spencer was posted to San Diego as the first commanding officer of a training base in Coronado, known as Naval Air Station North Island; they remained there until 1921.[21]\n\nIn 1920, Edward, the Prince of Wales, visited San Diego, but he and Wallis did not meet.[22] Later that year, Spencer left his wife for a period of four months, but in the spring of 1921 they were reunited in Washington, D.C., where Spencer had been posted. They soon separated again, and in 1922, when Spencer was posted to the Far East as commander of the Pampanga, Wallis remained behind, continuing an affair with an Argentine diplomat, Felipe de Espil.[17] In January 1924, she visited Paris with her recently widowed cousin Corinne Mustin,[23] before sailing to the Far East aboard a troop carrier, USS Chaumont (AP-5). The Spencers were briefly reunited until she fell ill, after which she returned to Hong Kong.[24]\n\nWallis toured China, and while in Beijing stayed with Katherine and Herman Rogers, who were to remain her long-term friends.[25] According to the wife of one of Win's fellow officers, Mrs Milton E. Miles,[26] in Beijing Wallis met Count Galeazzo Ciano, later Mussolini's son-in-law and Foreign Minister, had an affair with him, and became pregnant, leading to a botched abortion that left her infertile.[27] The rumour was later widespread but never substantiated and Ciano's wife, Edda Mussolini, denied it.[28] The existence of an official \"China dossier\" (detailing the supposed sexual and criminal exploits of Wallis in China) is denied by historians and biographers.[29] Wallis spent over a year in China, during which time—according to the socialite Madame Wellington Koo—she only managed to master one Chinese phrase: \"Boy, pass me the champagne\".[30][31] By September 1925, she and her husband were back in the United States, though living apart.[32] Their divorce was finalised on 10 December 1927.[33]\n\nSecond marriage [ edit ]\n\nBy the time her marriage to Spencer was dissolved, Wallis had become involved with Ernest Aldrich Simpson, an Anglo-American shipping executive and former officer in the Coldstream Guards.[34] He divorced his first wife, Dorothea (by whom he had a daughter, Audrey), to marry Wallis on 21 July 1928 at the Register Office in Chelsea, London.[35] Wallis had telegraphed her acceptance of his proposal from Cannes where she was staying with her friends, Mr and Mrs Rogers.[36]\n\nThe Simpsons temporarily set up home in a furnished house with four servants in Mayfair.[37] In 1929, Wallis sailed back to the United States to visit her sick mother, who had married legal clerk Charles Gordon Allen after the death of Rasin. During the trip, Wallis's investments were wiped out in the Wall Street Crash, and her mother died penniless on 2 November 1929. Wallis returned to England and with the shipping business still buoyant, the Simpsons moved into a large flat with a staff of servants.[38]\n\nThrough a friend, Consuelo Thaw, Wallis met Consuelo's sister Thelma, Lady Furness, at the time the mistress of Edward, Prince of Wales.[39] On 10 January 1931, Lady Furness introduced Wallis to the Prince at Burrough Court, near Melton Mowbray.[40] The Prince was the eldest son of King George V and Queen Mary, and heir apparent to the British throne. Between 1931 and 1934, he met the Simpsons at various house parties, and Wallis was presented at court. Ernest was beginning to encounter financial difficulties, as the Simpsons were living beyond their means, and they had to fire a succession of staff.[41]\n\nRelationship with Edward, Prince of Wales [ edit ]\n\nThe Prince of Wales and Wallis in Kitzbühel , Austria, February 1935\n\nIn January 1934, while Lady Furness was away in New York City, Wallis allegedly became the Prince's mistress.[42] Edward denied this to his father, despite his staff seeing them in bed together as well as \"evidence of a physical sexual act\".[43] Wallis soon ousted Lady Furness, and the Prince distanced himself from a former lover and confidante, the Anglo-American textile heiress Freda Dudley Ward.[44]\n\nBy the end of 1934, Edward was irretrievably besotted with Wallis, finding her domineering manner and abrasive irreverence toward his position appealing; in the words of his official biographer, he became \"slavishly dependent\" on her.[17] According to Wallis, it was during a cruise on Lord Moyne's private yacht Rosaura in August 1934 that she fell in love with Edward.[45] At an evening party in Buckingham Palace, he introduced her to his mother—his father was outraged,[46] primarily on account of her marital history, as divorced people were generally excluded from court.[47] Edward showered Wallis with money and jewels,[48] and in February 1935, and again later in the year, he holidayed with her in Europe.[49] His courtiers became increasingly alarmed as the affair began to interfere with his official duties.[50]\n\nIn 1935, the head of the Metropolitan Police Special Branch told the Metropolitan Police Commissioner that Wallis was also having an affair with Guy Marcus Trundle, who was \"said to be employed by the Ford Motor Company\".[51] Claims of an affair were doubted, however, by Captain Val Bailey, who knew Trundle well and whose mother had an affair with Trundle for nearly two decades,[52] and by historian Susan Williams.[53]\n\nAbdication crisis [ edit ]\n\nOn 20 January 1936, George V died at Sandringham and Edward ascended the throne as King Edward VIII. The next day, he broke royal protocol by watching the proclamation of his accession from a window of St James's Palace, in the company of the still-married Wallis.[54] It was becoming apparent to Court and Government circles that the new King-Emperor meant to marry her.[55] The King's behaviour and his relationship with Wallis made him unpopular with the Conservative-led British government, as well as distressing his mother and his brother the Duke of York.[56] The British media remained deferential to the monarchy, and no stories of the affair were reported in the domestic press, but foreign media widely reported their relationship.[57] After the death of George V, before her divorce from her second husband, Simpson reportedly said, \"Soon I shall be Queen of England\".[58]\n\nThe monarch of the United Kingdom is Supreme Governor of the Church of England—at the time of the proposed marriage, and until 2002, the Church of England disapproved of, and would not perform, the remarriage of divorced people if their former spouse was still alive.[59] Constitutionally, the King was required to be in communion with the Church of England, but his proposed marriage conflicted with the Church's teachings.[60] Additionally, at the time both the Church and English law only recognised adultery as a legitimate ground for divorce. Since she had divorced her first husband on grounds of \"mutual incompatibility\", there was a possibility that her second marriage, as well as her prospective marriage to Edward, would be considered bigamous if her first divorce had been challenged in court.[61]\n\nThe British and Dominion governments believed that a twice divorced woman was politically, socially, and morally unsuitable as a prospective consort.[62] She was perceived by many in the British Empire as a woman of \"limitless ambition\"[63] who was pursuing the King because of his wealth and position.[64]\n\nWallis had already filed for divorce from her second husband on the grounds that he had committed adultery with her childhood friend Mary Kirk and the decree nisi was granted on 27 October 1936.[65] In November, the King consulted with the British prime minister, Stanley Baldwin, on a way to marry Wallis and keep the throne. The King suggested a morganatic marriage, where he would remain king but Wallis would not be queen, but this was rejected by Baldwin and the prime ministers of Australia, Canada, and the Union of South Africa.[62] If the King were to marry Wallis against Baldwin's advice, the Government would be required to resign, causing a constitutional crisis.[66]\n\nWallis's relationship with the King had become public knowledge in the United Kingdom by early December. She decided to flee the country as the scandal broke, and was driven to the south of France in a dramatic race to outrun the press.[67] For the next three months, she was under siege by the media at the Villa Lou Viei, near Cannes, the home of her close friends Herman and Katherine Rogers,[68] whom she later thanked effusively in her ghost-written memoirs. On her instructions, according to Andrew Morton on the basis of an interview with Rogers's stepdaughter-in-law 80 years later,[69] the ghost-writer made no mention of her confession that Herman Rogers was actually the love of her life.[70] At her hideaway, Wallis was pressured by Lord Brownlow, the King's lord-in-waiting, to renounce the King. On 7 December 1936, Lord Brownlow read to the press her statement, which he had helped her draft, indicating Wallis's readiness to give up the King.[71] However, Edward was determined to marry Wallis. John Theodore Goddard, Wallis's solicitor, stated: \"[his] client was ready to do anything to ease the situation but the other end of the wicket [Edward VIII] was determined.\" This seemingly indicated that the King had decided he had no option but to abdicate if he wished to marry Wallis.[72]\n\nThe King signed the Instrument of Abdication on 10 December 1936, in the presence of his three surviving brothers, the Duke of York (who would ascend the throne the following day as George VI), the Duke of Gloucester and the Duke of Kent. Special laws passed by the Parliaments of the Dominions finalised Edward's abdication the following day, or in Ireland's case one day later. On 11 December 1936, Edward said in a radio broadcast, \"I have found it impossible to carry the heavy burden of responsibility, and to discharge my duties as King as I would wish to do, without the help and support of the woman I love.\"[2]\n\nEdward left Britain for Austria, where he stayed at Schloss Enzesfeld, the home of Baron Eugen and Baroness Kitty de Rothschild. Edward had to remain apart from Wallis until there was no danger of compromising the granting of a decree absolute in her divorce proceedings.[73] Upon her divorce being made final in May 1937, she changed her name by deed poll to Wallis Warfield, resuming her maiden name.[74] The couple were reunited at the Château de Candé, Monts, France, on 4 May 1937.[73]\n\nThird marriage: Duchess of Windsor [ edit ]\n\nWallis and Edward married one month later on 3 June 1937 at the Château de Candé, lent to them by French millionaire Charles Bedaux.[75] The date would have been King George V's 72nd birthday; Queen Mary thought the wedding had been scheduled for then as a deliberate slight.[76] No member of Edward's family attended. Wallis wore a \"Wallis blue\" Mainbocher wedding dress.[77] Edward presented her with an engagement ring that consisted of an emerald mount in yellow gold set with diamonds, and the sentence \"We are ours now\" was engraved on it.[78] While the Church of England refused to sanction the wedding, Robert Anderson Jardine, Vicar of St Paul's, Darlington, offered to perform the service, an offer that was accepted by the couple.[79] Guests included Randolph Churchill, Baron Eugène Daniel von Rothschild, and the best man, Major Fruity Metcalfe.[79] The marriage produced no children. In November, Ernest Simpson married Mary Kirk.[80]\n\nEdward was created Duke of Windsor by his brother King George VI prior to the marriage. However, letters patent, passed by the new king and unanimously supported by the Dominion governments,[81] prevented Wallis, now the Duchess of Windsor, from sharing her husband's style of \"Royal Highness\". George VI's firm view that the Duchess should not be given a royal title was shared by Queen Mary and George's wife, Queen Elizabeth (later the Queen Mother).[82] At first, the British royal family did not accept the Duchess and would not receive her formally, although the former king sometimes met his mother and siblings after his abdication. Some biographers have suggested that Wallis's sister-in-law, Queen Elizabeth, remained bitter towards her for her role in bringing George VI to the throne (which she may have seen as a factor in his early death)[83] and for prematurely behaving as Edward's consort when she was his mistress.[84] These claims were denied by Queen Elizabeth's close friends, such as the Duke of Grafton, who wrote that she \"never said anything nasty about the Duchess of Windsor, except to say she really hadn't got a clue what she was dealing with.\"[85] Queen Elizabeth was said to have referred to Simpson as \"that woman\",[86] while the Duchess of Windsor referred to Queen Elizabeth as \"Mrs Temple\" and \"Cookie\", alluding to her solid figure and fondness for food, and to her daughter, Princess Elizabeth (later Queen Elizabeth II), as \"Shirley\", as in Shirley Temple.[87] The Duchess bitterly resented the denial of the royal title and the refusal of the Duke's relatives to accept her as part of the family.[17][88] Within the household of the Duke and Duchess, the style \"Her Royal Highness\" was used by those who were close to the couple.[89]\n\nAccording to the wife of former British Union of Fascists leader Oswald Mosley, Diana Mitford, who knew both Queen Elizabeth and the Duchess of Windsor but was only friendly with the latter, the Queen's antipathy toward her sister-in-law may have resulted from jealousy. Lady Mosley wrote to her sister, the Duchess of Devonshire, after the death of the Duke of Windsor, \"probably the theory of their [the Windsors'] contemporaries that Cake [a Mitford nickname for the Queen Mother, derived from her delighted exclamation at the party at which Deborah Devonshire first met her] was rather in love with him [the Duke] (as a girl) & took second best, may account for much.\"[90]\n\nThe Duke and Duchess of Windsor with Adolf Hitler , 1937\n\nThe Duke and Duchess lived in France in the pre-war years. In 1937, they made a high-profile visit to Germany and met Adolf Hitler at the Berghof, his Berchtesgaden retreat. After the visit, Hitler said of Wallis, \"she would have made a good Queen\".[91] The visit tended to corroborate the strong suspicions of many in government and society that the Duchess was a German agent,[17] a claim that she ridiculed in her letters to the Duke.[92] U.S. FBI files compiled in the 1930s also portray her as a possible Nazi sympathiser. Duke Carl Alexander of Württemberg told the FBI that she and leading Nazi Joachim von Ribbentrop had been lovers in London.[93] There were even rather improbable reports during the Second World War that she kept a signed photograph of Ribbentrop on her bedside table.[94]\n\nSecond World War [ edit ]\n\nAs the German troops advanced, the Duke and Duchess fled south from their Paris home, first to Biarritz then to Spain in June. She told United States ambassador to Spain Alexander W. Weddell that France had lost because it was \"internally diseased\".[95] The Duke and Duchess moved to Portugal in July and stayed at the home of Ricardo do Espírito Santo e Silva, a banker who was suspected of being a German agent.[96]\n\nIn August 1940, the Duke and Duchess travelled by commercial liner to the Bahamas where he was installed as governor.[97] Wallis performed her role as the Bahamas' first lady competently for five years; she worked actively for the Red Cross and in the improvement of infant welfare.[98] However, she hated Nassau, calling it \"our St Helena\" in a reference to Napoleon's final place of exile.[99] She was heavily criticised in the British press for her extravagant shopping in the United States, undertaken when Britain was enduring privations such as rationing and blackout.[17][100] She referred to the local population as \"lazy, thriving niggers\" in letters to her aunt, which reflected her upbringing in the Jim Crow South.[101][102] Prime Minister Winston Churchill strenuously objected in 1941 when she and her husband planned to tour the Caribbean aboard a yacht belonging to Swedish magnate Axel Wenner-Gren, whom Churchill said was \"pro-German\", and Churchill complained again when the Duke gave a \"defeatist\" interview.[103] Another of their acquaintances, Charles Bedaux, who had hosted their wedding, was arrested on charges of treason in 1943 but committed suicide in jail in Miami before the case was brought to trial.[104] The British establishment distrusted the Duchess; Sir Alexander Hardinge wrote that her suspected anti-British activities were motivated by a desire for revenge against a country that rejected her as its queen.[105] The couple returned to France and retirement after the defeat of Nazi Germany.[17]\n\nLater life [ edit ]\n\nThe Duke and Duchess of Windsor at the White House for dinner with U.S. President Richard Nixon in 1970\n\nIn 1946, when the Duchess was staying at Ednam Lodge, the home of the Earl of Dudley, some of her jewels were stolen. There were rumours that the theft had been masterminded by the royal family as an attempt to regain jewels taken from the Royal Collection by the Duke, or by the Windsors themselves as part of an insurance fraud—they made a large deposit of loose stones at Cartier the following year. However, in 1960, career criminal Richard Dunphie confessed to the crime. The stolen pieces were only a small portion of the Windsor jewels, which were either bought privately, inherited by the Duke, or given to the Duke when he was Prince of Wales.[106]\n\nIn 1952 they were offered the use of a house by the Paris municipal authorities. The couple lived at 4 route du Champ d'Entraînement in the Bois de Boulogne, near Neuilly-sur-Seine, for most of the remainder of their lives, essentially living a life of easy retirement.[107] They travelled frequently between Europe and America aboard ocean liners. They bought a second house in the country, Moulin de la Tuilerie or \"The Mill\" in Gif-sur-Yvette, where they soon became close friends of their neighbours, Oswald and Diana Mosley.[108] Years later, Diana Mosley claimed that the Duke and Duchess shared her and her husband's views that Hitler should have been given a free hand to destroy Communism;[109] as the Duke wrote in the New York Daily News of 13 December 1966: \"it was in Britain's interest and in Europe's too, that Germany be encouraged to strike east and smash Communism forever ... I thought the rest of us could be fence-sitters while the Nazis and the Reds slogged it out.\"[110]\n\nIn 1965, the Duke and Duchess visited London as the Duke required eye surgery for a detached retina; Queen Elizabeth II and Princess Marina, Duchess of Kent, visited them. The Duke's sister, the Princess Royal, also visited just 10 days before her death. They attended her memorial service in Westminster Abbey.[111] Later, in 1967, the Duke and Duchess joined the royal family in London for the unveiling of a plaque by Elizabeth II to commemorate the centenary of Queen Mary's birth.[112] Both Queen Elizabeth II and Prince Charles visited the Windsors in Paris in the Duke's later years, the Queen's visit coming only shortly before the Duke died.[113]\n\nWidowhood [ edit ]\n\nUpon the Duke's death from throat cancer in 1972, the Duchess travelled to the United Kingdom to attend his funeral,[114] staying at Buckingham Palace during her visit.[115] The Duchess became increasingly frail and eventually succumbed to dementia, living the final years of her life as a recluse, supported by both her husband's estate and an allowance from the Queen.[116] She suffered several falls and broke her hip twice.[117]\n\nAfter Edward's death, the Duchess's French lawyer, Suzanne Blum, assumed power of attorney.[118] Blum sold items belonging to the Duchess to her own friends at lower than market value[119] and was accused of exploiting her client in Caroline Blackwood's The Last of the Duchess, written in 1980 but not published until 1995, after Blum's death.[120] Later, royal biographer Hugo Vickers called Blum a \"Satanic figure ... wearing the mantle of good intention to disguise her inner malevolence\".[121]\n\nIn 1980, the Duchess lost the power of speech.[122] Toward the end, she was bedridden and did not receive any visitors, apart from her doctor and nurses.[123]\n\nDeath [ edit ]\n\nThe Duchess of Windsor died on 24 April 1986 at her home in the Bois de Boulogne, Paris, aged 89.[3] Her funeral was held at St George's Chapel, Windsor Castle, attended by her two surviving sisters-in-law – the Queen Mother and Princess Alice, Duchess of Gloucester – and other members of the royal family.[124] The Queen, the Duke of Edinburgh, and the Prince and Princess of Wales attended both the funeral ceremony and the burial.[125]\n\nShe was buried next to Edward in the Royal Burial Ground near Windsor Castle, as \"Wallis, Duchess of Windsor\".[125] Until an agreement with Queen Elizabeth II in the 1960s, the Duke and Duchess had previously planned for a burial in a purchased cemetery plot at Green Mount Cemetery in Baltimore, where the Duchess's father was interred.[126]\n\nIn recognition of the help France gave to the Duke and Duchess in providing them with a home, and in lieu of death duties, the Duchess's collection of Louis XVI style furniture, some porcelain, and paintings were made over to the French state.[127] The British royal family received no major bequests. Most of her estate went to the Pasteur Institute medical research foundation, on the instructions of Suzanne Blum. The decision took the royal family and the Duchess's friends by surprise, as she had shown little interest in charity during her life.[128]\n\nIn a Sotheby's auction in Geneva, in April 1987, the Duchess's remarkable jewellery collection raised $45 million for the Institute, approximately seven times its pre-sale estimate.[129] Blum later claimed that Egyptian entrepreneur Mohamed Al-Fayed tried to purchase the jewels for a \"rock bottom price\".[130] Al-Fayed bought much of the non-financial estate, including the lease of the Paris mansion. An auction of his collection was announced in July 1997 for later that year in New York.[131] Delayed by his son's death in the car crash that also claimed the life of Diana, Princess of Wales, the sale raised more than £14 million for charity in 1998.[125]\n\nLegacy [ edit ]\n\nWallis was plagued by rumours of other lovers. Gay American playboy Jimmy Donahue, an heir to the Woolworth fortune, claimed to have had a liaison with her in the 1950s, but Donahue was notorious for his inventive pranks and rumour-mongering.[132] Wallis's memoirs The Heart Has Its Reasons were published in 1956, and biographer Charles Higham said that \"facts were remorselessly rearranged in what amounted to a self-performed face-lift\". He describes the Duchess as \"charismatic, electric and compulsively ambitious\".[133]\n\nFictional depictions of the Duchess include the novel Famous Last Words (1981) by Canadian author Timothy Findley, which portrays her as a manipulative conspirator,[134] and Rose Tremain's short story \"The Darkness of Wallis Simpson\" (2006), which depicts her more sympathetically in her final years of ill health.[135] Hearsay and conjecture have clouded assessment of the Duchess of Windsor's life, not helped by her own manipulation of the truth. But there is no document which proves directly that she was anything other than a victim of her own ambition, who lived out a great romance that became a great tragedy. In the opinion of her biographers, \"she experienced the ultimate fairy tale, becoming the adored favourite of the most glamorous bachelor of his time. The idyll went wrong when, ignoring her pleas, he threw up his position to spend the rest of his life with her.\"[136] The Duchess herself is reported to have summed up her life in a sentence: \"You have no idea how hard it is to live out a great romance.\"[137]\n\nTitles and styles [ edit ]\n\n19 June 1896 – 8 November 1916: Miss Bessie Wallis Warfield\n\n8 November 1916 – 21 July 1928: Mrs Earl Winfield Spencer Jr.\n\n21 July 1928 – 7 May 1937: Mrs Ernest Aldrich Simpson\n\n7 May 1937 – 3 June 1937: Mrs Wallis Warfield\n\nWallis resumed her maiden surname by deed poll on 7 May 1937,[138] but continued to use the title \"Mrs\".[74]\n\n3 June 1937 – 24 April 1986: Her Grace The Duchess of Windsor\n\nThe Duchess of Windsor was unofficially styled Royal Highness within her own household.[89]\n\nNotes and references [ edit ]\n\nBibliography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Royal_Monogram_of_The_Duke_and_Duchess_of_Windsor.svg/170px-Royal_Monogram_of_The_Duke_and_Duchess_of_Windsor.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/38px-Wikisource-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Nixon_and_the_Windsors.jpg/220px-Nixon_and_the_Windsors.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Cand%C3%A9_Castle.jpg/220px-Cand%C3%A9_Castle.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/33/Wallis_Simpson_-1936.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/6/64/Wallis_Simpson_signature_1963.svg/125px-Wallis_Simpson_signature_1963.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Wallis_Simpson_and_Prince_1935.jpg/250px-Wallis_Simpson_and_Prince_1935.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b8/Duke_and_Duchess_of_Windsor_meet_Adolf_Hitler_1937.jpg/220px-Duke_and_Duchess_of_Windsor_meet_Adolf_Hitler_1937.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/USS_Chaumont_AP-5_off_Shanghai_1937.jpg/220px-USS_Chaumont_AP-5_off_Shanghai_1937.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Wallis_Simpson_headshot.jpg/170px-Wallis_Simpson_headshot.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Wallis_Simpson_-1936.JPG/220px-Wallis_Simpson_-1936.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/33/Wallis_Simpson_-1936.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wallis_Simpson", "title": "Wallis Simpson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/33/Wallis_Simpson_-1936.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}