{"url": "https://www.usatoday.com/story/life/tv/2018/05/09/ncis-recap-how-pauley-perrettes-abby-exited-after-15-seasons/591738002/", "text": "Spoiler alert: If you haven't watched Tuesday's NCIS episode \"Two Steps Back,\" put your headphones on, crank up some Goth rock, refill your Caf-Pow cup and come back after you've seen it.\n\nLeave it to NCIS forensics genius Abby Sciuto (Pauley Perrette) to solve what first appeared to be her own murder.\n\nTuesday's \"Two Steps Back,\" which marked the final episode for Perrette after 15 seasons and more than 350 episodes, opened with Abby on the verge of death after a suffering a gunshot wound during a street holdup at the end of last week's episode.\n\nMoments later, it appeared she was dead, as medical examiner Ducky Mallard (David McCallum) approached a covered body on the exam table and spoke about performing an autopsy on a colleague.\n\nBut, in a big fakeout, it was Clayton Reeves (Duane Henry), the big-hearted NCIS colleague who was with Abby when she was robbed, who had been killed.\n\nInvestigate: The common thread connecting Pauley Perrette's favorite 'NCIS' episodes\n\nMore: Perrette says fans will need 'a couple boxes of tissues' for Abby's 'NCIS' exit\n\nAs team leader Jethro Gibbs (Mark Harmon), special agent Tim McGee (Sean Murray) and Dr. Jimmy Palmer (Brian Dietzen) took turns standing vigil over a comatose Abby, her colleagues searched for the killer.\n\nBlood found on Reeves led Gibbs and agent Ellie Bishop (Emily Wickersham) to the home of the shooter. They found him murdered, along with evidence that he had been hired to kill Abby.\n\nSince Abby's sleuthing skills had put so many bad guys away, there were many suspects to consider. The hit CBS drama took a trip down its own villainy lane, as agents interrogated embezzler Terry Spooner (from Season 3's \"Bloodbath,\" one of Perrette's favorite episodes) and Alejandro Rivera (seen in several episodes, starting with Season 10's \"Obsession\"), a Mexican Justice Department official and brother of a drug lord.\n\nFinally, the agents tracked down their man, former Marine Corps Sgt. Major Robert King (Peter Jason), who had tricked Abby into developing a bioweapon until she stopped him in 2009's \"Toxic.\"\n\nIn the meantime, Abby's healing abilities appeared to be even more amazing than her scientific skills: She was out of her coma and back in her cool, Goth-inspired apartment — the first time it had been seen on the show — before the fourth commercial break, ready to help the investigation.\n\nAbby, now working from a computer in her kitchen, figured out that last week's mysterious restaurant invitation, which she shared with Reeves, was planned by her assailant. She tracked King's computer to a public wi-fi system, but pulled a fast one on Gibbs & Co., sending them to the wrong address.\n\nIn one of TV's longest-running cliches, which finds the hero refusing backup to face a killer alone, Abby — who had locked special agent Nick Torres (Wilmer Valderrama) in her coffin — went to the real address and confronted King, who had put a hit on her after escaping prison. She told him she was tired of her heroes dying, listing former colleagues Caitlin Todd, Jenny Shepard, Ned Dorneget, Ziva David and Reeves, while villains survived.\n\nAs King prepared to leave, Abby told him she put cyanide in his coffee, offering an antidote if he confessed. It wasn't exactly a move that would stand up in court, but it worked. (It also wasn't cyanide, as Abby gave King crushed Caf-Pow pills to trigger a caffeine jolt.) Gibbs and Torres arrested King.\n\nLater, Abby returned to her lab and surprised her colleagues — minus Gibbs — with news that she was leaving NCIS immediately to oversee the charity that Reeves planned to start in honor of his late mother.\n\nThey reluctantly accepted her decision, although Palmer, speaking for his colleagues and many fans, said: \"The thought of you not being here, I just can't imagine it.\"\n\n\"You guys are my family and this is my home, but you have to go with your gut and my gut is telling me I have to go,\" she explained. (Perrette announced she was leaving in October.)\n\nTearful hugs followed, with especially long embraces for McGee and Ducky. She left the tiniest hint of a return but may have been humoring McGee when she said, \"It's not goodbye for good. It's goodbye for now.\"\n\nThe episode featured flashbacks focusing on the almost father-daughter bond between Gibbs and Abby, but Harmon and Perrette never appeared together in Abby's finale.\n\nGibbs was seen solo and from behind in Abby's hospital room, but never face to face , and Abby said a heartfelt goodbye via a letter left at his door. The NCIS leader eventually spotted her from his window standing across the street and the two shared virtual hugs and spoke in sign language as the camera cut back and forth between them. It was an odd and unsatisfying goodbye after such a long, deep relationship.\n\nAbby ended the episode in her true NCIS home, her lab, packing up some dolls and leaving a copy of Abby's Lab for Dummies for the next forensics specialist. Those will be some huge boots to fill.", "images": ["https://www.gannett-cdn.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2018/05/08/USATODAY/USATODAY/636613879116850649-NCIS352-SG1.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2018/05/08/USATODAY/USATODAY/636613879116850649-NCIS352-SG1.jpg?width=1912&height=1080&fit=crop&format=pjpg&auto=webp", "http://www.gannett-cdn.com/-mm-/04b4c4ef73f5f775b0fea1a3171862458651b2ae/c=0-0-4610-2604&r=1280x720/local/-/media/2017/10/13/USATODAY/USATODAY/636434901813027813-3BD-Pauley-Perrette.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2018/05/08/USATODAY/USATODAY/636613879116850649-NCIS352-SG1.jpg?width=1912&height=1080&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/05/09/ncis-recap-how-pauley-perrettes-abby-exited-after-15-seasons/591738002/", "title": "'NCIS' recap: How Pauley Perrette's Abby says goodbye, after a big twist and lots of flashbacks", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "'NCIS' recap: How Pauley Perrette's Abby says goodbye, after a big twist and lots of flashbacks", "description": "Find out how goth lab tech extraordinaire Abby Sciuto (Pauley Perrette) departed the long-running CBS military procedural. (Spoilers ahead!)", "url": "https://www.usatoday.com/story/life/tv/2018/05/09/ncis-recap-how-pauley-perrettes-abby-exited-after-15-seasons/591738002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2018/05/08/USATODAY/USATODAY/636613879116850649-NCIS352-SG1.jpg?width=1912&height=1080&fit=crop&format=pjpg&auto=webp", "width": 1912, "height": 1080}, "type": "article"}, "article": {"author": "Bill Keveney", "content_tier": "free", "opinion": "false"}, "description": "Find out how goth lab tech extraordinaire Abby Sciuto (Pauley Perrette) departed the long-running CBS military procedural. (Spoilers ahead!)", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2018/05/08/USATODAY/USATODAY/636613879116850649-NCIS352-SG1.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "'NCIS' recap: How Pauley Perrette's Abby says goodbye, after a big twist and lots of flashbacks", "description": "Find out how goth lab tech extraordinaire Abby Sciuto (Pauley Perrette) departed the long-running CBS military procedural. (Spoilers ahead!)"}}, "movies": [], "publish_date": 1525795200.0, "source": "https://www.usatoday.com", "summary": ""}