{"url": "https://www.glamour.com/story/greys-anatomy-brought-back-familiar-faces", "text": "After more than 300 episodes, Grey's Anatomy still has the powerful ability to make me cry out like few other shows on television can. And last night I really didn't see it coming.\n\nThe main medical case featured a girl named Flora who needs intestinal surgery, performed by the titular Meredith Grey (Ellen Pompeo). But Grey's being Grey's, the case of the week is never just about the medicine. Meredith has also been informed by Dr. Richard Weber that her estranged father, Thatcher, has leukemia and only weeks to live. Mer struggles with whether or not to contact her father throughout the episode. During the surgery, she tells her bestie Alex Karev, \"I don’t really need to grieve him because he’s been a ghost for years.” While the surgery goes off without a hitch, the whole concept of death and grieving is way more complicated, as much as Meredith wishes it wasn't.\n\nIt also happens to be Day of the Dead or Dia de los Muertos—the Mexican holiday that celebrates and honors loved ones who have passed away. Flora's family has a makeshift altar with photographs of family members who have died in her hospital room, which Meredith admires with the little girl's grandmother. When Mer says she's sorry for all her loss, the grandmother replies, \"Don't be. They are here with us now.\" The grandmother then gives Mer a marigold for her hair, which she says helps guide our ancestors' spirits back to us. \"The veil between our world and the spirit world is very thin,\" she explains. \"The marigolds, the photos, the mementos, they help guide them to us.\"\n\nGREY'S ANATOMY - \"Flowers Grow Out of My Grave\" Ð Meredith has a patient whose family is celebrating Day of the Dead, making the doctors remember loved ones they have lost. Richard shares unexpected news with Meredith about her father, Thatcher. Meanwhile, Teddy tries to tell Owen that she is pregnant but they get sidetracked, and Jo encourages Link to pursue one of the doctors, on \"GreyÕs Anatomy,\" THURSDAY, NOV. 1 (8:00-9:01 p.m. EDT), on The ABC Television Network. (ABC/Mitch Haaseth)ELLEN POMPEO Mitch Haaseth\n\nAnd just like that, the ghosts of Meredith's past are right there on our television screens once more as a Spanish-language version of Snow Patrol's \"Chasing Cars\" plays in the background. We see George O'Malley in his blue scrubs calling out to his old friend. Lexie Grey is behind the admin desk as Meredith says goodbye to a nurse. Her mother, Dr. Ellis Grey, watches her leave, as Doc the dog follows her down the hallway to…Derek, who says simply, \"Hey\" before Mark Sloane also appears beside him. Ahhhhh, McDreamy and McSteamy together again. I'm not crying—you're crying.\n\nIt was good to see them all again, but it also drives home how many important people Meredith has lost over the years. It's incredible that she's still a functional human. Showrunner Krista Vernoff talked to The Hollywood Reporter about the impetus for the episode's little twist. \"I loved the idea because after 15 seasons, it's exciting to be airing on a holiday we've never done an episode about—and because it's the holiday of the community that is being attacked in our country right now by our government and misrepresented,\" she said. \"The holiday is delightful. I had just seen Coco with my daughter—whose name is Coco—and the idea that our loved ones who died can come visit us on this one day of the year was moving. I suggested Meredith's dead people come back and visit her in this episode.\"\n\nI was not alone in feeling an emotional gut punch, as evidenced by reactions on social media.\n\nShe also reveals that an earlier cut of the episode featured Denny Duquette and Kyle Chandler's bomb squad character, but they didn't feel authentic and were cut. But don't expect to keep seeing those beloved faces regularly. \"This was a Day of the Dead, one-time-only thing,\" Vernoff tells THR. \"The holiday is about the dead visiting the living and the living inviting the dead to come for a visit. So it felt like the perfect opportunity to see the people Meredith has lost.\"\n\nWhen the episode ends, Meredith hasn't called her father…yet. It looks like she's heading in that direction, but as her voice-over notes, she's allowed to handle the situation however she wants. \"Every religion, every country, every culture, death means something different to all of us,\" she says. \"They all have different ideas about how to honor the dead. Different ideas of how to grieve. Different ways of moving on. Well, I may not be an expert but I do have some experience with losing people I love. And I say the right way to grieve is however the hell you want.\"", "images": ["https://www.glamour.com/verso/static/glamour/assets/logo-reverse.b2ce20427c8d415381a18834c479e653848cc926.svg", "https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/16:9/w_1280,c_limit/150505_3996.jpg", "https://www.glamour.com/verso/static/glamour/assets/logo-header.aeb2e510354d524c42a87c5d0a97d0a73c5d7581.svg", "https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/16:9/w_2560%2Cc_limit/150505_3996.jpg", "https://media.glamour.com/photos/5bdc55dfc1fcd07b9d83bd25/master/w_1600%2Cc_limit/150505_0015.jpg"], "top_img": "https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/16:9/w_1280,c_limit/150505_3996.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.glamour.com/story/greys-anatomy-brought-back-familiar-faces", "title": "Grey's Anatomy Brought Back a Bunch of Familiar Faces for Last Night's Episode", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Abby Gardner", "copyright": "Copyright (c) Condé Nast 2020", "description": "Derek, Mark, Lexie, George, Meredith's mom, and even Doc the dog made appearances in the latest 'Day of the Dead' episode of 'Grey's Anatomy. '", "id": "5bdc4392c1fcd07b9d83bd1f", "keywords": "entertainment,tv,grey's anatomy,shonda rhimes,shondaland,ellen pompeo", "news_keywords": "entertainment,tv,grey's anatomy,shonda rhimes,shondaland,ellen pompeo", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5bdc4392c1fcd07b9d83bd1f", "parsely-metadata": "{\"description\":\"Derek, Mark, Lexie, George, Meredith's mom, and even Doc the dog made appearances in the latest 'Day of the Dead' episode of 'Grey's Anatomy. '\",\"image-16-9\":\"https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/16:9/w_1000,c_limit/150505_3996.jpg\",\"image-1-1\":\"https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/1:1/w_1000,c_limit/150505_3996.jpg\"}", "og": {"description": "We're not crying—you're crying.", "image": "https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/16:9/w_1280,c_limit/150505_3996.jpg", "site_name": "Glamour", "title": "'Grey's Anatomy' Brought Back a Bunch of Familiar Faces for Last Night's Episode", "type": "article", "url": "https://www.glamour.com/story/greys-anatomy-brought-back-familiar-faces"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@glamourmag", "description": "We're not crying—you're crying.", "domain": "https://www.glamour.com", "image": {"src": "https://media.glamour.com/photos/5bdc559d04bbf50c79af64da/16:9/w_1280,c_limit/150505_3996.jpg?mbid=social_retweet"}, "site": "@glamourmag", "title": "'Grey's Anatomy' Brought Back a Bunch of Familiar Faces for Last Night's Episode"}, "fb": {"app_id": 101358874221, "pages": 26815555478}}, "movies": [], "publish_date": null, "source": "https://www.glamour.com", "summary": ""}