{"url": "https://www.cosmopolitan.com/uk/reports/a21760683/life-after-reality-tv/", "text": "\"Everyone deceived me here.”\n\n\n\n“I don’t think I was made for this game.”\n\n“It’s bringing me back to a place I don’t want to go.”\n\nGia Allemand had just fallen out with her best friend. She was het up, in that way you are after an argument. Unsure if you’ve made the right decision, with blood rushing through your ears, clouding your judgement. In the heat of the moment, she’d walked out of the house she’d been living in; it was a snap decision and then she couldn’t stop crying.\n\nWere the tears real or not? We’ll never know. Gia was a contestant on Bachelor Pad – a US reality TV show, where former contestants of The Bachelor hole up in a mansion, supposedly in the quest for love, but also for the $250,000 prize, and our entertainment.\n\nGia, far left and Lex, far right Getty Images\n\nThree years later, the 29-year-old took her own life. She’d been suffering from PMDD, a severe and disabling form of premenstrual syndrome that she’d been hiding throughout her time on television. Two-and-a-half years later, Gia’s The Bachelor co-star Lex McAllister did the same. She was 31 years old.\n\nThese aren’t isolated incidents. In the past decade, 21 US reality TV stars have committed suicide. They include Joseph Cerniglia, a 39-year-old chef who took his own life in 2010. Three years before, he’d appeared on Kitchen Nightmares, when Gordon Ramsay had yelled at him, “Your business is about to f*cking swim down the Hudson.” Then in 2011, Russell Armstrong, husband of Real Housewives Of Beverly Hills star Taylor Armstrong, committed suicide. His marriage had broken down, and he was about to face a $1.5 million lawsuit. This all played out on, and off, television. In the weeks running up to his death, Russell spoke of his time on the show: “It just takes [the pressure] to a whole new level; we were pushed to extremes.”\n\nIn the UK, we heard over the weekend that 26-year-old Mike Thalassitis, a contestant on the 2016 series of Love Island, had taken his own life. With 32-year-old Sophie Gradon, another former Love Island star, having also ended her life back in June 2018, it has sparked a discussion among fellow Love Island stars about the importance of addressing mental health.\n\nOver the years, reality TV has evolved. It’s no longer gentle people-watching out of anthropological curiosity. Instead, it’s five-star entertainment. Our deteriorating attention spans mean we need something to happen every second, or we’ll switch over. For months, we watch every moment of the lives of these ‘characters’, with their loves, triumphs and defeats. Then we forget them, like they were never there at all.\n\n“It was the biggest regret of my life\"\n\nRemember Zara Holland? She’s a 22-year-old fashion brand owner from Hull. She’s also the woman who was stripped of her Miss Great Britain title after having sex on Love Island in 2016, a show watched by an average of 1.4 million people. She left the island to find countless headlines and opinion pieces devoted to her behaviour. “It was the biggest regret of my life – I think about it every day,” she says. “I’m still so embarrassed. I went on the show thinking I’d never do anything like that, but it all happened so quickly. I remember waking up the next day and just staying in the beach hut for hours wondering what I’d done.”\n\nShe adds, “The worst thing was that I felt I’d let my family down. I worked so hard to get my Miss Great Britain title, I was so proud and did a lot of charity work that was then forgotten. I’d love to go back in time and not be known as the girl who lost her Miss Great Britain title for having sex on TV.”\n\nAntonio Petronzio\n\nWhen Channel 4 first aired Big Brother, in 2000, we watched people like us: office managers, builders, teachers. The most controversial thing that happened was ‘nasty’ Nick sneaking in a pen and paper and attempting to influence nominations. But, after viewers labelled season four ‘boring’, things changed. During series five, a violent argument broke out, and police were called. Series six saw a contestant seemingly masturbate using a wine bottle. Then a former anorexic had to play games to win food in series seven. All this happened while Big Brother was at its peak, averaging five million viewers a night.\n\nTV production companies recognised viewers’ hunger. Today, you can watch Naked Attraction, Married At First Sight or Sex Box, and on shows like Love Island or Geordie Shore, getting drunk and having sex is the norm. On the latter, Charlotte Crosby peed herself most nights, had sex and a near-threesome on TV. She’s now worth £1.6 million. Love Island’s Olivia Buckland had sex 30 times on the show. She now has her own clothing line and countless beauty endorsements. ‘Reality TV star’ has become a desired profession, and this year’s Love Island received over 60,000 applicants within 24 hours.\n\n\"Since appearing on the show, I’ve had to work much harder for jobs\n\nKimberly Davis, an entrepreneur from New York, thought going on the UK version of The Apprentice would be an asset to her CV. “I think my series [five] was the first one where the show started to be known for its crazy characters. Previously, it had been about the best business minds, which is why I initially applied,” she says. “Before the show I ran a successful business, but ever since appearing on it, I’ve had to work much harder for jobs and really persuade people to work with me rather than relying on my credentials alone. I have to say, ‘Please don’t hold it against me’. I was so proud to be on it, and it turned out to be an embarrassment.”\n\nKimberly Davis Antonio Petronzio\n\nSarah Goodhart, a 24-year-old beautician, thought TV offered a passport to another life. She’d dropped out of school before her A-levels, and after appearing on Ex On The Beach, was approached by Geordie Shore producers. “At the time, it seemed like a good idea,” she says now.\n\nShe thought she would become a well-paid regular on the show, so quit her job. She ended up on just one series, then had to apply for work, but she stood out from the others on the job hunt – and not in a good way. In one interview, she was certain everyone in the room knew exactly who she was. “I really felt like they’d only asked me in so they could laugh at me; I don’t think they had any intention of hiring me.” Sarah didn’t get that role, or the six she applied for after that, and began to fear she was unhirable.\n\n\"I really felt like they’d only asked me in so they could laugh at me\"\n\nSarah did what everyone does on Geordie Shore: she got drunk, wore revealing clothing, fought over men. It is, she says, a far cry from how she is in real life, describing herself as ‘an introvert’. This could be hard to believe, considering she’s been on reality TV twice. But editing plays its part, and we now live in an age of scripted shows. Sarah claims Geordie Shore is one of them. “[Producers] told me I had to make a very crude comment about a co-star’s penis. It wasn’t the sort of thing I’d ever say, but they said this part had been written for me,” she recalls.\n\nSarah in her Geordie Shore days Getty Images\n\nA celebrity agent who looks after a host of reality TV stars says this is not uncommon. “The producers have a storyboard of characters, and they recruit people to fit into that,” they say, asking to remain anonymous. “In casting meetings [for other reality shows], I’ve overheard producers telling the stars, ‘Lots of shagging tonight please.’ And on others they get extra money for things like nudity, sex and cat fights,” they say, adding that “in some shows, they’ll ply you with alcohol to make the behaviour more outrageous”.\n\nSarah, who struggled with anxiety and depression before Geordie Shore, says her experience on the show deepened her mental-health issues. At one point, she says she felt pushed to ‘near insanity’: “I felt exploited and traumatised, and it affects me to this day.” She believes producers must have seen how ‘unstable’ she was becoming. When we contacted Geordie Shore, they declined to comment.\n\nBut Gladeana McMahon, one of the first psychologists on Big Brother, who has set out ethical guidelines for reality shows to abide by, says there are still those who do not stick to them. “The difficulty is that nobody wants to watch boring people, so you have to find characters. However, there are characters and then there are problems,” she explains. “After a few years at Big Brother, I left, because I didn’t like the way it was going. I’ve seen production companies whose values I’m not happy with.” Endemol Shine, the production company behind Big Brother, says it offers psychological assessments for the housemates before entering, with a dedicated welfare team on hand and once the series is off air. But still questions remain for all shows.\n\nSarah now Antonio Petronzio\n\nShould Stephanie Davis have been accepted for Celebrity Big Brother, just months after being fired from Hollyoaks for being ‘unfit for work’? She later admitted to being an alcoholic. Or how about Ceri Rees, the widow who was humiliated on The X Factor just after her husband died? Her family are taking legal action against the show. And you probably don’t even remember Shahbaz Chaudhry, from series seven of Big Brother, who was monitored by psychologists after threatening to kill himself live on air.\n\nThe answer is, of course, probably not. While a pre-existing mental-health issue should never become a barrier, there’s no doubt shows like these change lives – and not always for the better. There are countless examples of reality TV having an extreme, detrimental effect that the contestant simply wasn’t prepared for. We could blame the producers, or the stars themselves, but maybe we should also look at ourselves. Our hunger for that window into people’s lives is now insatiable. We spend our lunch breaks watching Instagram stories of influencers we’ve never met, and in the evening, we watch these shows, making snap judgements about yet more strangers. If there wasn’t demand, these shows wouldn’t be as extreme. Ask yourself, ‘Would we watch if everyone on them were stable, sober and secure?’ If we regulated the psychological side of things too much, we may not have reality TV at all. And it’s up to us to decide what’s more important.\n\nThis article originally featured in the July 2018 issue of Cosmopolitan.\n\nIf you or someone you know is struggling with depression or suicidal thoughts, call the Samaritans helpline at any time 24 hours a day, 7 days a week, on 116 123.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sophie-gradon-dead-love-island-tribute-1529661386.jpg?crop=1.00xw:0.892xh;0,0.0756xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Annabelle Lee"], "canonical_link": "https://www.cosmopolitan.com/uk/reports/a21760683/life-after-reality-tv/", "title": "What happens to reality TV stars when the cameras stop rolling: “It was the biggest regret of my life\"", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "“It was the biggest regret of my life\": What happens to reality TV stars when the cameras stop rolling", "description": "Thousands apply every year. Only a precious few are chosen. But what happens once their 15 minutes of fame are up?", "url": "https://www.cosmopolitan.com/uk/reports/a21760683/life-after-reality-tv/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2019-03-18 11:25:05", "published_time": "2019-03-18 11:22:00", "section": "News & Politics", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "What happens to reality TV stars when the cameras stop rolling: “It was the biggest regret of my life\"", "description": "Thousands apply every year. Only a precious few are chosen. But what happens once their 15 minutes of fame are up?", "keywords": "Mike Thalassitis, Mike Thalassitis death, Mike Thalassitis suicide, Love Island suicide, sophie gradon mental health, life after reality tv, reality tv stars, sophie gradon love island, zara holland love island, what do reality tv stars do after the show, how do you make a living after reality tv, how reality stars make a living, are reality tv stars happy?, does starring in reality tv make people happy?, psychologists mental health, reality stars mental health", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=0.502xw:1.00xh;0.498xw,0&resize=320:*", "sailthru.contenttype": "long-form-article", "sailthru.tags": "News & Politics,reports", "sailthru.date": "2019-03-18T11:22:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/zara-reality-tv-1529664257.jpg?crop=0.502xw:1.00xh;0.498xw,0", "sailthru.socialtitle": "“It was the biggest regret of my life\": What happens to reality TV stars when the cameras stop rolling", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1552879320.0, "source": "https://www.cosmopolitan.com", "summary": ""}