{"url": "en.wikipedia.org/wiki/Wonder_Wheel_(film)", "text": "2017 film by Woody Allen\n\nWonder Wheel is a 2017 American period drama film written and directed by Woody Allen and starring Jim Belushi, Kate Winslet, Juno Temple, and Justin Timberlake. Set in the early 1950s at an amusement park on Coney Island, the film takes its title from the park's Ferris wheel. The story follows the second wife and the estranged daughter of a carousel operator as they both pursue affairs with a lifeguard.[4]\n\nThe film served as the closing night selection at the 55th New York Film Festival on October 14, 2017,[5] and was released on December 1, 2017 by Amazon Studios.[6] The film received mixed reviews, but with praise for Winslet's performance and the cinematography.\n\nPlot [ edit ]\n\nMickey Rubin, a Coney Island lifeguard who aspires to be a playwright like Eugene O'Neill, narrates through the fourth wall. Carolina, the daughter of Humpty Rannell, arrives at the boardwalk looking for Ginny Rannell, her father's second wife who works as a waitress at the clam shack. She begs Ginny to let her live with them, but Ginny leaves it up to Humpty, who angrily kicked her out when she married her mobster boyfriend Frank and threw away her college education and chance for a better life. Carolina tells him she is on the run from Frank, who she believes wants to kill her because she gave evidence of mob activity to the FBI. Humpty lets her stay on the condition that she save money to return to college and better her life. Ginny gets her a waitressing job where she works.\n\nGinny used to be an actress and was happily married, but her infidelity caused her husband to divorce her. She and Humpty are raising her young son Ritchie, a troubled boy who habitually gets into trouble by setting fires. She is unhappy with Humpty and life on the boardwalk, and has been carrying on an affair with Mickey for a few months. Humpty is an angry and loud recovering alcoholic who runs the carousel and goes fishing with his friends to bring home dinner. He finds joy and patience for life with Carolina around, and he pays for her to attend night school.\n\nMickey is attracted to Ginny's maturity and experience, and views her as a damsel in need of saving. He and Carolina accidentally meet some time later, and he becomes attracted by Carolina's story. He thinks he is in love with her, but is conflicted about his feelings for Ginny. Ginny steals money from Humpty to buy Mickey an expensive watch as a birthday present, which he refuses to accept. By this time, Ginny has become suspicious of Mickey's feelings for Carolina and is jealous.\n\nMobsters Angelo and Nick come around, asking Humpty and the owner of the clam shack about Carolina's whereabouts. Carolina takes Mickey on a date to a Brooklyn pizza parlor, and her boss innocently tells this to Angelo and Nick. Ginny telephones the pizza parlor to warn Carolina but begins to stammer, realizing her opportunity to take Carolina away from Mickey, and hangs up. Mickey tells Carolina the truth about his feelings for her and his affair. Instantly feeling compassion for everyone involved, Carolina walks home alone to process the information and decide what to do, not wanting to hurt Ginny or her father or Mickey. We see Angelo and Nick's car following her as she leaves the pizza parlor.\n\nWhen Carolina does not come home, Humpty asks Mickey the next day if he saw her after the date. Mickey investigates and learns Ginny called the pizza parlor but did not speak. Piecing it together, he confronts Ginny, who has started drinking and getting made up in one of her glamorous stage costumes. She pulls a knife out of the drawer and asks Mickey to kill her, but he leaves. Humpty comes back, sinking back into alcoholism after the police find no trace of Carolina, and tells Ginny he needs her help again to function in life. He tries to find a positive outlook and invites her to meet his friends' wives on a fishing trip, but she coldly refuses, keeping their life in its rut.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nCasting [ edit ]\n\nKate Winslet was the first actor who came on board for the film, in July 2016,[7][8] followed by Juno Temple and Jim Belushi.[9] Describing the casting process, Allen said, \"The first person I cast was Kate Winslet, then I cast a young girl named Juno Temple who I thought very much of,\" and \"I cast Jim Belushi who I thought was absolutely perfect for it.\"[10] Talking about the film, Winslet – who was previously attached to Allen's 2005 drama film Match Point but left the project to spend more time with her family – said, \"I play the lead. My character is called Ginny, and she's a waitress in a clam house ... It was probably like the second most stressful part I've ever played, but the experience itself was just utterly incredible.\"[11]\n\nAllen later signed Justin Timberlake in the role of a lifeguard,[12][13] saying that \"I was doing this film and I thought, who could I get that would be an interesting guy to play a lifeguard in about 1950? I was sitting and talking with my brain trust. Someone said, 'What about Justin Timberlake?'\"[10] On August 19, 2016, Tony Sirico joined the cast.[14] In September 2016, Jack Gore, Steve Schirripa, and Max Casella rounded out the cast of the film.[15][16][17]\n\nFilming [ edit ]\n\nPrincipal photography began in Coney Island on September 15, 2016.[18] On the same day, filming took place at Vinegar Hill, Brooklyn around Hudson Avenue and Gold Street.[19]\n\nRelease [ edit ]\n\nThe film premiered as the closing film of the New York Film Festival on October 14, 2017. It was theatrically released on December 1, 2017, on Allen's 82nd birthday.[6]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nWonder Wheel grossed $1.4 million in the United States and Canada, and $14.5 million in other territories, for a worldwide total of $15.9 million.[3]\n\nIn the United States the film made $125,570 from five theaters in its opening weekend (an average of $25,114), marking a 61% drop from Café Society's debut the previous year.[20]\n\nIn France, the film was released on January 31, 2018 and sold 20,147 tickets on its opening day, marking the lowest of any Allen film in over 15 years.[21]\n\nCritical response [ edit ]\n\nOn review aggregator Rotten Tomatoes, the film has an approval rating of 31% based on 188 reviews, with an average rating of 5/10. The website's critical consensus reads, \"Wonder Wheel gathers a charming cast in an inviting period setting, but they aren't enough to consistently breathe life into a Woody Allen project that never quite comes together.\"[22] On Metacritic, the film has a weighted average score of 45 out of 100, based on 40 critics, indicating \"mixed or average reviews\".[23]\n\nGraham Fuller for Screen International wrote a positive review, praising Allen, \"It would be going too far to say Wonder Wheel is an instant Woody Allen classic, but it’s a reminder that he’s still a force to be reckoned with.\"[24]\n\nPeter Travers of Rolling Stone gave Wonder Wheel three out of four stars, and lauded Winslet's performance, writing \"there are valid criticisms of Wonder Wheel as a film that feels more like a stage play – its claustrophobic atmosphere can be stifling. But even covering familiar ground, Allen finds the blunt truth at its core. As Ginny is stripped of her fantasies and exposed to the harsh glare of reality, Winslet stands her ground, as if to say attention must be paid. It should be. Her performance is absolutely astounding.\"[25]\n\nWriting for Entertainment Weekly, Chris Nash found the film to be relatively weak, giving it a C- rating and stating, \"The love triangle is stagy and unfolds with way too many complications and betrayals. It's undercooked even by the filmmaker's own late-career standards. Yes, Coney Island has never looked more gorgeously golden-hued (thanks to cinematographer Vittorio Storaro), but Allen has seldom been less sharp.\"[26]\n\nAccolades [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://upload.wikimedia.org/wikipedia/en/2/2a/Wonderwheelfilmposter.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/2/2a/Wonderwheelfilmposter.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/2/2a/Wonderwheelfilmposter.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wonder_Wheel_(film)", "title": "Wonder Wheel (film)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/2/2a/Wonderwheelfilmposter.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}