{"url": "https://www.thestar.com/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor.html", "text": "Call it the sweet revenge of Daniel Dae Kim.\n\nPerhaps best known as Chin Ho on CBS’s Hawaii Five-0, Kim, along with co-star Grace Park, left the show after producers controversially refused to give the actors equal pay to their Caucasian co-stars.\n\nBut it seems Kim wasn’t standing still and his principled position left time to concentrate on other projects that allowed for a giant measure of retribution, Hollywood-style.\n\nThe Korean-American actor, who first rose to stardom in J.J. Abrams’ survivalist drama Lost, had long been fond of the weepy but compelling soap operas that are a staple in his native land. He decided to take a chance and optioned a popular series that debuted in 2013 about an autistic young doctor trying to navigate his way through his first job at a hospital.\n\nThe plot didn’t seem a likely fit with American network television. Moreover, apart from the long-standing Grey’s Anatomy, hospital dramas since the halo era of George Clooney in ER were no longer in vogue.\n\nWhich makes The Good Doctor one of this television season’s most intriguing success stories. It underlines the big-money politics of creating a hit in the era of peak television where perseverance, talent, the burden of race and not a little luck can make or break a show. And the story also has a key Canadian connection in showrunner David Shore, who adapted the series for American audiences.\n\nIn his first attempt as an executive producer, Kim produced a massive hit right out the gate. Or perhaps more appropriately in the afterglow of the Olympics in Pyeongchang, the rookie scored pure television gold.\n\nThe show is the most watched drama on network TV. In Canada, it beats out other highly hyped drama juggernauts such as This Is Us. In recent ratings it was the fourth most watched show in Canada after the Academy Awards, Big Bang Theory and Young Sheldon. The season finale airs Monday at 10 p.m. on CTV.\n\nYOU MIGHT BE INTERESTED IN...\n\n“At this point I couldn’t be happier,” says the soft-spoken Kim, 49, in an interview. “I realize how difficult it is to get any show on the air, let alone one as successful as this one. I’ve been knocking on wood every day.”\n\nBut Kim says the show really started to develop quickly with the input of London, Ontario’s Shore, who viewers may remember from the last medical series he created, House starring Hugh Laurie as the acerbic Dr. Gregory House.\n\nThe Good Doctor “didn’t strike me as a Korean show that I could turn into an American show. It struck me as a good universal story,” says Shore, 58, in an interview. “It’s an amazing thing that people really tell stories in very similar ways. We are not as different as we think.”\n\n“I had never seen a character living with autism on American TV. The humanity of those characters on the Korean show was what I was interested in, not just living with autism,” says Kim. “He was a three-dimensional human being, not a polemic. And I was lucky to be working with David, who really put everything into focus. When we brought him on board that’s when it became a competitive situation.”\n\nIronically, even with Shore on board, the show was turned down by CBS, the same seemingly tone-deaf network that refused to give Kim an equal pay raise, even though he brought the series there first. It was ABC that gave Kim a chance.\n\nYOU MIGHT BE INTERESTED IN...\n\nWhen all was said and done, CBS lost a talented actor and potential hit to a competitor. But when asked if he sees any irony in the outcome, Kim is diplomatic.\n\n“I really don’t think of it in those terms. My work as an actor is completely separate from my work as a producer,” he says. “If I had still been working as an actor and it had gone another way I could still have been out there trying to produce this. Maybe things work out for a reason.”\n\nLeaving the successful Hawaii Five-0 wasn’t an easy decision for Kim. The actor has been low key in interviews discussing his resignation. But the Star asked whether he thinks it’s time for Hollywood to be called out over its representation of women and people of colour. Recently, Variety reported that The Crown star Claire Foy, who played the Queen, was paid less than Matt Smith, who played Prince Philip.\n\n“The idea of parity and equality is something that is resounding throughout the industry,” says Kim. “Not just in the form of race, but in gender equality and in general equality of treatment everywhere. It’s part of a larger awareness of simply treating people with respect. If what happened to me last year is a small part of that conversation, then I’m happy about that.”\n\nIt took three years for Kim to develop the story of young Dr. Shaun Murphy, the good doctor of the title. Murphy, played with earnestness by Bates Motel’s Freddie Highmore, is endlessly curious, never mean-spirited. He could well be the alter ego of Dr. House, a darker creature with a deep well of cynicism topped by intellectual arrogance.\n\n“I certainly didn’t want to do the House character again,” says Shore, who won an Emmy Award for his writing on that show. “In fact I didn’t want to do a medical series again. I felt I had told those stories. But then it was about responding to a character and exploring the world through that character in a different way through different eyes. They have diametric points of view. But they are asking similar questions.”\n\nAs one of Hollywood’s most successful producers, Shore is typically inundated with project ideas, but somehow he managed to find time to watch most of the original Korean soap opera.\n\n“It’s certainly not something I always get. I don’t normally watch the tapes. But I phoned up the development executive and immediately said I wanted to do the show,” says Shore.\n\nIn some ways the success of the show also speaks to the need for “feel-good” dramas in a tough and divisive political environment in the United States.\n\nGet more of the Star in your inbox Never miss the latest news from the Star. Sign up for our free newsletters to get today's top stories, your favourite columnists and lots more in your email inbox Sign Up Now\n\n“I like to think a good story is a good story. But we are living in a time that we’re living in,” says Shore, a trained lawyer who graduated from the University of Toronto law school. “And perhaps it is relevant that people are responding to something that is somewhat hopeful. There is so much uncertainty out there.”\n\nWith the chart-topping viewership of The Good Doctor, you can pretty much expect a slew of copycat medical dramas over the next few seasons. But whatever the reason for the show’s hit status, producer Kim seems to have found one way to create his own personal success.\n\n“I think what’s important is for people of colour to be creating story and to get into positions of power,” he says. “And I’m not saying that’s an easy thing. But we have to remember how important that is, to create our own stories so we don’t perpetuate the cycle or become victims in our own industry, to go out there and push for your own vision.”", "images": ["https://analytics.twitter.com/i/adsct?txn_id=nuz9l&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://images.thestar.com/OG3PyCw6ld6akyXK5a9Gm5t8j-I=/1086x724/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/thestar/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor/daniel_dae_kim_on_the_set_of_the_good_doctor.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=3005674&cv=2.0&cj=1", "https://images.thestar.com/27YPp6ezkT4MonFTZHXJ9pbKs5g=/1200x800/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/thestar/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor/daniel_dae_kim_on_the_set_of_the_good_doctor.jpg", "https://images.thestar.com/aRj6-aIaR_5zGtFk8-GpCPVg-14=/100x100/smart/https://www.thestar.com/content/dam/thestar/columnist_logos/Wong_Tony_logo2015.JPG", "https://www.thestar.com/assets/svg/app-store.svg", "https://www.thestar.com/assets/svg/brandmark-thestar.svg", "https://www.thestar.com/assets/svg/google-play.svg", "https://www.thestar.com/assets/img/loading-spinner.svg", "https://www.thestar.com/assets/svg/logo-thestar.svg", "https://t.co/i/adsct?txn_id=nuz9l&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0"], "top_img": "https://images.thestar.com/27YPp6ezkT4MonFTZHXJ9pbKs5g=/1200x800/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/thestar/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor/daniel_dae_kim_on_the_set_of_the_good_doctor.jpg", "keywords": [], "authors": ["Tony Wong", "Television Critic"], "canonical_link": "https://www.thestar.com/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor.html", "title": "Daniel Dae Kim left Hawaii Five-0 over a pay dispute. He came back to produce TV’s biggest drama, The Good Doctor", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=2.0, user-scalable=yes", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/favicon-thestar-144.png", "msapplication-square70x70logo": "/favicon-thestar-70.png", "msapplication-square150x150logo": "/favicon-thestar-150.png", "msapplication-square310x310logo": "/favicon-thestar-310.png", "apple-itunes-app": "app-id=379481068", "apple-mobile-web-app-title": "thestar.com", "application-name": "thestar.com", "fb": {"pages": 134392236659479}, "storyuuid": "cb43a542-88d6-42ad-9324-009ad8ec3ad2", "description": "The Good Doctor is this season’s biggest hit, with a Canadian connection: Torontonian David Shore of House fame is the creator. A look at race and equ...", "keywords": "The Good Doctor,freddy highmore,Daniel Dae Kim,David Shore,Bates Motel,television,Freddie Highmore", "news_keywords": "The Good Doctor,freddy highmore,Daniel Dae Kim,David Shore,Bates Motel,television,Freddie Highmore", "article": {"publisher": "https://www.facebook.com/torontostar", "published_time": "2018-03-23", "modified_time": "2018-03-23T15:13:57.037Z", "section": "Television"}, "og": {"title": "Daniel Dae Kim left Hawaii Five-0 over a pay dispute. He came back to produce TV’s biggest drama, The Good Doctor", "type": "article", "url": "https://www.thestar.com/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor.html", "description": "The Good Doctor is this season’s biggest hit, with a Canadian connection: Torontonian David Shore of House fame is the creator. A look at race and equ...", "site_name": "thestar.com", "image": "https://images.thestar.com/27YPp6ezkT4MonFTZHXJ9pbKs5g=/1200x800/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/thestar/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor/daniel_dae_kim_on_the_set_of_the_good_doctor.jpg", "images": "https://www.thestar.com/assets/img/thestar-ribbon.png"}, "twitter": {"card": "summary_large_image", "domain": "thestar.com", "site": "@TorontoStar", "title": "Daniel Dae Kim left Hawaii Five-0 over a pay dispute. He came back to produce TV’s biggest drama, The Good Doctor", "description": "The Good Doctor is this season’s biggest hit, with a Canadian connection: Torontonian David Shore of House fame is the creator. A look at race and equ...", "image": "https://images.thestar.com/27YPp6ezkT4MonFTZHXJ9pbKs5g=/1200x800/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/thestar/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor/daniel_dae_kim_on_the_set_of_the_good_doctor.jpg", "creator": "Tony Wong"}, "parsely-title": "Daniel Dae Kim left Hawaii Five-0 over a pay dispute. He came back to produce TV’s biggest drama, The Good Doctor", "parsely-link": "https://www.thestar.com/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor.html", "parsely-type": "post", "parsely-author": "Tony Wong", "parsely-image-url": "https://images.thestar.com/4F5uLVlu7fCSRo5dqOLAeRtxE1A=/93x62/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/thestar/entertainment/television/2018/03/23/daniel-dae-kim-left-hawaii-five-o-over-a-pay-dispute-he-came-back-to-produce-tvs-biggest-drama-the-good-doctor/daniel_dae_kim_on_the_set_of_the_good_doctor.jpg", "parsely-pub-date": "2018-03-23T14:00:00.000Z", "parsely-section": "Television", "parsely-tags": "The Good Doctor, freddy highmore, Daniel Dae Kim, David Shore, Bates Motel, television, Freddie Highmore, word count: >1200 words, source: in-house", "parsely-metadata": "{\"storyuuid\": \"cb43a542-88d6-42ad-9324-009ad8ec3ad2\"}"}, "movies": [], "publish_date": 1521734400.0, "source": "https://www.thestar.com", "summary": ""}