{"url": "http://www.thefashionspot.com/style-trends/566985-how-to-wear-yoga-pants/", "text": "Can you believe yoga pants are one of the most divisive pieces of clothing in a woman’s wardrobe? If you wear them outside the gym, everyone and their mother has an opinion, even lawmakers. In February 2015, for example, Montana state representative David Moore (R-Missoula) introduced a bill to expand the state’s indecent exposure law by outlawing any piece of clothing that “gives the appearance or simulates” the pelvic area, buttocks, genitals or female nipple — this would include yoga pants. If the bill passed, a third indecent exposure fraction would have warranted a $5,000 fine and up to five years in jail. Thankfully, the House Judiciary Committee rejected the proposal.\n\n“Yoga pants should be illegal in public anyway,” Moore told the Associated Press. “I want Montana to be known as a decent state.”\n\n[ How to Master the Athleisure Trend Like Gigi Hadid ]\n\nDespite Moore’s loony war on yoga pants, U.S. sales for yoga clothes have increased 45 percent year over year. At the same time, participation in the sport only increased 4.5 percent, which means that more and more women are adopting athleisure wear into their daily uniform. And why not? They’re versatile, seasonless and most of all, comfortable. But that doesn’t mean we can all wear them willy-nilly. There’s a time and a place for everything.\n\nNeed a review? Here are the dos and don’ts on how to wear yoga pants around town without getting the side-eye.\n\nDO: Learn from Lululemon’s sheer pants recall. Make sure you select a pair that is truly opaque. Test them out in broad daylight or under bright lights.\n\nDON’T: Wear them to work. Ever. “Dress Pant Yoga Pants” is an oxymoron.\n\nDO: Invest in the correct size. It sounds like a no-brainer, but often women will purchase a size down to get a tighter fit or a longer shelf life since yoga pants stretch out. In reality, all you end up with is “camel toe.” Avoid at all costs.\n\nDON’T: Show your panty lines. If thongs aren’t your thing, Commando and Zobha make great full-coverage bikini bottoms that are undetectable.\n\nDO: Layer up! Throwing on a leather jacket or a dark trench over your yoga pants and T-shirt will instantly dress up your look when you’re running from bikram to brunch.\n\nDON’T: Keep wearing your favorite pair after the expiration date. Unlike jeans, yoga pants don’t age well. Toss them when they’re overly faded, stretched or ripped.\n\nDO: Accessorize! Nothing pulls together athleisure wear like a statement handbag and a pair of sunglasses.\n\nDON’T: Try to pull off your zaniest tie-dye yoga pants outside your ashtanga class. Stock up on neutral colors — navy, black, charcoal — that will go with anything.\n\nDO: Consider your tight-fitting yoga pants a thicker alternative to leggings in the wintertime. On the weekends, pair with knee-high boots and an oversized sweater, or wear them underneath a dress. No one will know the difference.\n\nTo shop the best yoga pants on the market, click on the slideshow below.\n\n[ Next: 11 Best Yoga Pants to Buy Now, According to Reviews ]", "images": ["https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/gplus-icon.svg", "https://cdn1-www.thefashionspot.com/assets/uploads/2014/09/maria-denardo.jpg", "https://cdn3-www.thefashionspot.com/assets/uploads/2018/06/logo_tfs.svg", "https://cdn3-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/pinterest-icon.svg", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/tfs.svg", "http://secure-au.imrworldwide.com/cgi-bin/m?ci=au-evolve&cg=0&cc=1&ts=noscript", "https://cdn2-www.thefashionspot.com/assets/uploads/2018/06/logo_tfs_small.svg", "https://cdn1-www.thefashionspot.com/assets/uploads/2016/04/kendall-jenner-gigi-hadid-yoga-pants.jpg", "https://cdn2-www.thefashionspot.com/assets/uploads/2019/11/tfs.png", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/twitter-icon.svg", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/instagram-icon.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=6036161&cv=2.0&cj=1", "https://cdn1-www.thefashionspot.com/wp-content/themes/tfs-b/images/svg/facebook-icon.svg"], "top_img": "https://cdn2-www.thefashionspot.com/assets/uploads/2019/11/tfs.png", "keywords": [], "authors": ["Maria Denardo", "Read More About Maria Denardo Articles..."], "canonical_link": "https://www.thefashionspot.com/style-trends/566985-how-to-wear-yoga-pants/", "title": "How to Wear Yoga Pants", "meta_data": {"p": {"domain_verify": "857ed4595f63223069d7704498ec6eaf"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "description": "Your ultimate guide on how to wear yoga pants around town and still look good.", "og": {"locale": "en_US", "type": "article", "title": "How to Wear Yoga Pants - theFashionSpot", "description": "Your ultimate guide on how to wear yoga pants around town and still look good.", "url": "https://www.thefashionspot.com/style-trends/566985-how-to-wear-yoga-pants/", "site_name": "theFashionSpot", "updated_time": "2016-10-18T10:11:09+00:00", "image": {"identifier": "https://cdn2-www.thefashionspot.com/assets/uploads/2019/11/tfs.png", "secure_url": "https://cdn2-www.thefashionspot.com/assets/uploads/2019/11/tfs.png", "width": 800, "height": 600}}, "article": {"tag": "yoga pants", "section": "Style", "published_time": "2016-04-15T11:39:25+00:00", "modified_time": "2016-10-18T10:11:09+00:00"}, "fb": {"app_id": 153652024698919}, "twitter": {"card": "summary_large_image", "description": "Your ultimate guide on how to wear yoga pants around town and still look good.", "title": "How to Wear Yoga Pants - theFashionSpot", "site": "@fashion_spot", "image": "https://cdn1-www.thefashionspot.com/assets/uploads/2016/04/kendall-jenner-gigi-hadid-yoga-pants.jpg", "creator": "@fashion_spot"}}, "movies": [], "publish_date": 1460720365.0, "source": "http://www.thefashionspot.com", "summary": ""}