{"url": "https://web.archive.org/web/20161223100012/http://www.fashionisers.com/hands-nails/halloween-nail-art-designs/", "text": "Celebrate autumn with fun and spooky Halloween nails! In this article I have some nail care tips for you, as well as 50 awesome Halloween nail art design ideas.\n\nAre you as excited for Halloween as I am? If I could dress up in a costume every day of October, I would. Unfortunately, once you reach a certain age that’s not exactly appropriate. Instead, I can interject some Halloween spirit with Halloween nail art designs. Sometimes, Halloween nails can also really improve my costume – bloody nails for a zombie costume, long, pointy nails for a witch costume, or animal-print nails to go with a jungle creature costume.\n\nSalon or DIY for your Halloween Nails?\n\nAre you unsure whether you should do your nails at home, or get them done by a professional? First decide what kind of nails you want, and how steady your hand is. For some Halloween nail designs, doing it yourself at home is totally doable. All you need is a few Halloween-themed nail stickers, and some orange and black nail polish. You’ll also see some simple bloody Halloween nail design ideas, which would be pretty easy to achieve.\n\nOn the other hand, if the design you want is very complicated, or requires a nail printer, going to a salon might be for the best. In every city there are at least a few nail artists that are pros at creating really unique designs. Additionally, Halloween is a great time to go out of your comfort zone, with gel nails or pointy acrylics – you can simply use them to accentuate a cat or witch costume.\n\nGreat Halloween Nails Are Healthy Halloween Nails!\n\nTo make sure your Halloween manicure looks truly fabulous (or that you have enough space to draw all those intricate designs), make sure your nails are strong and healthy. This is doubly important if you’re going to do something more intense, like acrylics.\n\n• Make sure to regularly moisturize your nail beds with coconut oil or shea butter.\n\n• Get enough calcium and vitamin B in your diet, or take a supplement.\n\n• File your nails with an emery board, instead of trimming them.\n\n50 Spooky Halloween Nail Art Designs\n\nSo your nails look good? I have some cute, some stylish, and some straight up scary Halloween nail design ideas coming your way!\n\n1. Ghouls and Pumpkins Halloween Nails\n\nYou don’t have to have long nails for cute Halloween nail art ideas! You can give each finger a cute Halloween character or motif, like the ghouls, pumpkins, mummies, and spider webs in this design.\n\n2. This is Halloween Nails\n\nThe Nightmare Before Christmas is a quirky Halloween classic, so pay homage to it with your nails! Jack Skellington’s face is undeniably Halloween even for the uninitiate, while Sally’s tattered ragdoll dress design is chic and abstract.\n\n3. Creepy Crawly Nails\n\nThese insect Halloween nail designs are weirdly sophisticated. The bugs are hand drawn with a graphic flourish, and the matte finish only adds to the biologist’s sketchbook effect.\n\n4. Cutie Crawly Nails\n\nSo spiders are not technically insects, but they also don’t smile this wide normally! There are plenty of cute Halloween nail art ideas, like these purple nails with spider and spider webs on the accent nails, and large chunks of glitter on the rest of the nails.\n\n5. Classy Witch Nails\n\nYou don’t dig the obvious Halloween nail designs? Try something more abstract, with these sharp witchy nails. Dark colors, lots of creepy jewels, and pentagrams on the pinkies are high fashion creepy.\n\n6. Skeletons and Roses Nails\n\nWho said skeletons can’t be pretty? Add a touch of femininity to your badass skeleton Halloween nails, with 3D roses, some jewels, and a glittery skeleton sticker.\n\n7. Tarantula Nails\n\nReal spiders can be big, so why contain your spider Halloween nail designs to just one nail? On these nails we have a greyish white base, and black tarantula designs on each finger. Oh, and don’t forget the spider web!\n\n8. Ghosty Nails\n\nThese Halloween nails show a few different ways of playing with ghost designs. We’ve got a creepy, abstract ghost on the ring finger, some cuter ghosts on the thumb, and a smiling ghost face on the middle finger. My favorite design here, though, is the black and white swirly pumpkin.\n\n9. Bloody Ouija Nails\n\nWhat’s a good Halloween party without a séance? Channel some departed spirits, with Ouija Halloween nail art designs. But be careful, because an angry spirit can get vengeful and bloody, as the nails on the right show us. If you’re opting for a gory Halloween costume, you can just borrow that nail stuck in a bloody Halloween nail design.\n\n10. Nanananananananananana Batnail!\n\nBats are perfect for Halloween nail design ideas! They’re easy to draw, and not too spooky. For a touch of sparkle, draw your bats flying through a shimmery night skin. Add some jewels to represent the glittery stars.\n\n11. Toothy Monster Nails\n\nReal horror connoisseurs would appreciate these horrifying Halloween nail design ideas. Black base, big red mouth, and a lot of sharp white teeth… Is it the nails that have teeth? Do they represent the gaping maw of a monster? Either way, it’s an easy nail design that is sure to horrify.\n\n12. Dia de Los Muertos Nails\n\nInject some color into your Halloween nails with some sugar skulls! These cute skulls made of candy are part of the Mexican Day of the Dead traditions, and they are either given to children or placed on altars as offerings to those who died. They’re cute and lovely, rather than spooky Halloween nail art ideas.\n\n13. Matte Black and White Halloween Nails\n\nSomething about the matte finish makes any nail design seem more high fashion and mature, and these Halloween nails are no different. Matte black nails, with white Halloween symbols including the moon, bats, and some spider webs make for an artistic style.\n\n14. Scary Cinema Nails\n\nCelebrate your favorite creepy film characters, with these Frankenstein and Addam’s Family Halloween Nail Designs. For such a realistic design, you would have to go to a nail salon that has a nail printer, but the effect is totally worth it.\n\n15. Witchy Moon Matte Nails\n\nChannel your inner witch, with some creepy magical symbols. The full and crescent moon designs add a touch of mystery and fantasy to these matte black, white, and grey Halloween nails.\n\n16. Night Sky Eye of Horus Nails\n\nNail piercings add the perfect bit of flare to acrylic nails. A golden Eye of Horus adds a bit of mysticism to these shimmery night’s sky Halloween nails.\n\n17. Friday the 13th Nails\n\nThese creepy Jason Voorhees nails are excellent for your horror movie marathon! Even if you don’t have access to a salon with a nail printer, those blood spatter accent nails could be even done at home!\n\n18. Frida Scaro Nails\n\nThe great thing about a lot of Halloween nail design ideas is that they really let you get creative. Channel a Mexican tradition with a Mexican idol, with these quirky Frida Kahlo sugar skull accent nails.\n\n19. Cycle of the Moon Nails\n\nCelebrate October, darkness, and everything mysterious and edgy with some awesome night sky inspired Halloween nail designs. The different stages of the cycle of the moon, represented in a manicure, are artistic and seasonally appropriate.\n\n20. Trick or Treat Nails\n\nThese Halloween nail art designs actually give you a few cute options. Moon and star appliques give a touch of glam that is perfect for Halloween. Bright colors like purple and orange, along with silly looking pumpkin and ghost designs make for an adorably spooky manicure.\n\n21. Galaxy Talons\n\nThere is no better time for sharp acrylics, than the Halloween season! Just paint your pointed acrylics a dark color, and you’re good to go. For an extra measure, the nail artist here added a gorgeous galaxy design.\n\n22. Graveyard Matte Manicure\n\nThese graveyard Halloween nails are perfect for a night of telling ghost stories. The accent nails have a gray to black nail gradient, which was then embellished with gravestones. The matte finish makes the design look a little bit more realistic.\n\n23. Ghostie Cutie Nails\n\nThe scary Halloween nail design ideas are just not your thing? Conquer your fear of the supernatural with some friendly, adorable ghosts. This is actually a really easy nail design, which you can keep to just the accent nails.\n\n24. Frankenstein’s French Manicure\n\nThis is a great, subtle take on the French manicure, perfect for those looking for easy Halloween nail art ideas. Simply give yourself a shiny French manicure, and add lines of black for the stitches.\n\n25. Orange Pumpkin Cat Nails\n\nThese Halloween nail designs have all the effect of a Halloween pumpkin, lit from within, but they don’t require a ton of work! Simply paint your nails a pumpkin orange, and add creepy cat figures with swirls of orange and yellow polish, for the fire effect.\n\n26. Third Eye Nails\n\nBreanna Robak is the queen of abstract yet creepy Halloween nail art designs. Gold, black, and teal polishes are not the traditional Halloween colors, but add a few mysterious eyes and the scary effect is all there.\n\n27. Gore and Glam Nails\n\nThe easiest way to get ultra scary but glamorous Halloween nails is with awesome nail appliques, like these skeleton hand and skull pieces. Simply paint your nails a dark color, pop on the nail sticker, and you’re good to go.\n\n28. Cute Bride of Frankenstein Monster Nails\n\nAccent monster nails are probably the funniest of the Halloween nail art designs. Paint most of your nails gray, deep mauve and blue colors, but stick to green on the accent nails, leaving the black for hair, and using black and white for a cute face.\n\n29. Glitter Slime Nails\n\nThese Halloween nails are straight out of an R.L. Stine novel. Use a matte black polish all over the nails, and then add a shimmery forest green to the base of the nail, in an oozing design, for a look that is kind of gross but also kind of fashionable.\n\n30. Candy Corn Nails\n\nWe can’t have a list of Halloween nail design ideas without some candy corn manicures! The candy corn is emblematic of autumn, even if it’s the one treat no ones wants in their bag. Thankfully, all it requires is a yellow, to orange, to white gradient.\n\n31. Halloween Polka Dot Manicure\n\nSometimes simple is best, and polka dots make for excellent Halloween nail designs. Simply Paint your nails alternating shades of orange, black, and white, and then layer polka dots of the same colors on top.\n\n32 Trick or Treat Nails\n\nAre you too old to go trick or treating? Channel your inner child with cute Halloween costume nail designs. The ghost and witch are classic, but the flower pot costume design breaks the mold and adds extra creativity.\n\n33. Sparkly Spider Nails\n\nThese sparkly Halloween nails show how nice a simple top coat can look over negative space nail art. The black spider webs are a fairly easy design, so you can go all out with a spider on the accent nail.\n\n34. Multi Sparkle Pumpkin Manicure\n\nJazz up your Halloween nail art designs with a lot of shimmer. As long as the main colors are traditional orange and black, no one will misunderstand your intent if you add a bit of colorful sparkle. Draw a pumpkin outline on the accent nail, and you’re good to go.\n\n35. Scary Pumpkin Face Nails\n\nThis is another look that carries the design over multiple Halloween nails. While the scary face silhouette is pretty creepy, my favorite thing about this design is the way the glittering purple shines on the ring finger.\n\n36. Graphic Zombie Nails\n\nZombies are a horror movie classic, and perfect for your Halloween nail art ideas! This is a more of a comic book take, in black and white, with blood spatters and some text.\n\n37. Walking Dead Nails\n\nBe on trend and pay homage to the most popular horror TV show, with stylish Halloween nail designs. The white to dark red gradient, with black silhouettes is really striking, and a matte finish keeps it on trend.\n\n38. Bloody Nails\n\nAdd a touch of gore to your glam with bloody Halloween nail art designs! A pointed acrylic is extra monstrous, and the blood red on white is very striking.\n\n39. Black and Red Moon Nails\n\nThese Halloween nails really play with negative space, by alternating black moon touches with red full moons on black background.\n\n40. Suicide Squad Nails\n\nSome Halloween nail design ideas are all about the gore, but this one mixes it up with a bit of sci-fi. Metallic and ombre nails with the famous movie characters dripping from the nail beds look like a body horror science experience gone wrong, but in a glamorous way.\n\n41. Infected Nails\n\nIf your nails are long and healthy, then even the grossest Halloween nail design ideas will look cool. For the infected nail manicure, speckle red nail polish over a green base.\n\n42. Burning Witch Nails\n\nThis Halloween nail design incorporates dark colors like black and gray with really awe-inspiring burning witch and spider web silhouettes on all the five nails.\n\n43. Nightmare before Christmas Nails\n\nAre these Halloween nail art designs just an opportunity to play outside the box? Are you going as a nightmare before Christmas for Halloween? These heavily printed nails are the perfect accent to a costume.\n\n44. Negative Space Halloween Nails\n\nFor the base gradient space mani, you can simply draw some geometric figures with a black polish! The cute red rose on black Halloween nail designs, however, require a bit more effort or a nail stamping plate.\n\n45. Midnight on Halloween Nails\n\nThis Halloween nail design really paints a picture, of a late night, a spooky graveyard, witches, and trees that seem to have come to life. The black and gray are offset in this look, with a few sparkles that represent the stars.\n\n46. Scary Cute Halloween Faces\n\nThe fun thing about Halloween nails is that you can get abstract, like in this manicure. While we have some Jack Skellington-type faces on the accent nail, the pumpkin and ghost French tips on the other nails are mostly just adorable.\n\n47. Water Marble Mummies\n\nThe water marble effect is really useful in these mummy Halloween nail art designs. Keep your nails naked, painting just one of them in a deep night sky blue, and then add a couple of mummy characters and you have some adorable mummies!\n\n48. Cute Christmas Monster Nails\n\nThese adorable nails are super unique! Two lovely monster illustrations are all it takes to make a friendly, adorable Halloween design. You can keep the other nails a solid color, or play with embellishments like the big rhinestones.\n\n49. Le Chat Noir Manicure\n\nInstead of black cats, why not go for a black base coat with big scary cat eyes popping on the black background? Black cat eyes are perfect for lovely, adorable Halloween nail designs!\n\n50. Harry Potter Halloween Nails\n\nYou know that moment in Scooby Doo when the lights are off, and all you can see are the characters’ eyes? Kinda scary, kinda cute, kinda funny – exactly what these Harry Potter Halloween nails are. It’s easy to design, and perfect for the holiday of the tricksters!\n\nPhotos courtesy of Instagram\n\nDon’t miss: 80 Classy Nail Art Designs for Short Nails\n\n50 Terrifyingly Creative Halloween Makeup Ideas To Try", "images": ["https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas11.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas22.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/12/Goddess_braids_hairstyles_ideas_tips-355x220.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas43.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas28.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas3.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas35.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas14.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas29.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas_52.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas49.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/12/Roberto_Cavalli_spring_summer_2017_campaign1-355x220.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/12/end_of_year_2016_fashion_sales-355x220.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/12/Christian_Dior_spring_summer_2017_ad_campaign5-355x220.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas47.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas_51.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/12/Chanel_cruise_2018_show_in_Paris-355x220.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas39.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas25.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas23.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas19.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas50.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas8.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas32.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas4.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas48.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas12.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas_54.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas33.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas41.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas24.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas37.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas21.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas44.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/06/fav_new.png", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas13.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas6.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas_53.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/12/Givenchy_spring_summer_2017_campaign1-355x220.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas16.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas40.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas7.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas1.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas15.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas17.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas26.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas45.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/06/logof.png", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas18.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas36.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas5.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas27.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas9.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas30.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas10.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas46.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas42.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas2.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas20.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas31.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas38.jpg", "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas34.jpg", "https://web.archive.org/web/20161223100012im_/https://www.facebook.com/tr?id=1181073548621133&ev=PageView&noscript=1"], "top_img": "https://web.archive.org/web/20161223100012im_/http://cdn.fashionisers.com/wp-content/uploads/2016/06/fav_new.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20161223100012/http://www.fashionisers.com/hands-nails/halloween-nail-art-designs/", "title": "50 Awe-Inspiring Halloween Nail Art Designs", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "In this article I have some nail care tips for you, as well as 50 awesome Halloween nail art design ideas.", "keywords": "halloween nail designs,halloween nail art designs,halloween nail art ideas,halloween nails", "pubexchange": {"image": "http://cdn.fashionisers.com/wp-content/uploads/2016/10/Halloween_nail_art_designs_ideas47-300x283.jpg", "title": "50 Awe-Inspiring Halloween Nail Art Designs"}}, "movies": [], "publish_date": 1476217635.0, "source": "https://web.archive.org", "summary": ""}