{"url": "https://people.com/music/grammys-2018-lady-gaga-performance/", "text": "There wasn’t a dry eye in the house as Lady Gaga performed a stirring rendition of “Joanne” and one of her other biggest hits at the Grammy Awards.\n\nSitting at a white grand piano covered in feathers made to look like angel wings, the star played while singing the powerful lyrics of her album’s title track while Mark Ronson strummed a guitar.\n\nGet push notifications with news, features and more.\n\n“This is for my father’s late sister, Joanne,” she said, before beginning. “This is for love and compassion even when you can’t understand.”\n\nAfter a brief pause — and a call out to “Time’s up” — Gaga segued into her hit single “Million Reasons,” eventually leaving the piano seat to belt out the high notes. She concluded the performance by lying backward onto the fluffy instrument.\n\nBe sure to check out PEOPLE’s full Grammys coverage to get the latest news on music’s big night.\n\nJust hours before the show, Gaga shared a touching message on social media about how she was hoping to transform the “deep grief” that inspired Joanne into “hope and healing.”\n\n“I have carried a deep grief in my heart over my family’s tragedy,” she wrote, referring to her late aunt, Joanne Stefani Germanotta, who died of lupus complications at age 19.\n\nImage zoom\n\n“The loss of Joanne affected my father so deeply that it affected me. When he cried, I cried. When he was angry, I was angry. When he was hurt, I hurt,” she continued.\n\nTo donate to the Time’s Up Legal Defense Fund, which will provide subsidized legal support to women and men in all industries who have experienced sexual harassment, assault, or abuse in the workplace, visit its GoFundMe page. Learn more about Time’s Up, an organization of women in entertainment combating sexual harassment and inequality, on its website.\n\nShe added, “Today I transform this grief to hope and healing. After 10 years with you I still get nervous before the Grammys, but I know I have an angel with me.”\n\nGaga, who is nominated for best pop solo performance and best pop vocal album in addition to taking the stage, had previously shared how “honored” she felt to be performing from her deeply personal album at the award show.\n\n“I’m so honored to be singing from #Joanne,” she wrote on Saturday, adding, “This album and moment with [my] little monsters means so much to me.”\n\nRELATED: The Most Iconic Grammys Performances Ever\n\nThough the pop star was born nearly 12 years after Joanne’s death, she remains one of Gaga’s biggest influences.\n\n“When Mark and I wrote it, the decision to name the album that was in tribute to my father’s sister who died when she was 19,” she told Beats 1’s Zane Lowe of her poet/painter aunt in September 2016, one month before her album’s release.\n\nRELATED VIDEO: Here’s the List of Nominees for the 2018 Grammy Awards\n\nShe went on to reveal that the album encompassed “everything about Joanne, which also happens to be my middle name.”\n\n“It’s all the toughness of the pain of losing her that made us all strong and made us who we are,” Gaga added. “She is the woman of my past who is becoming and helping me bring more of my honest woman self into the future.”\n\nRELATED: Grammys 2018: Check Out the Complete Winners List!\n\nThe singer, 31, was among the first celebrities to arrive on the red carpet at Madison Square Garden, and she was a standout in a custom Armani Privé black lace, long-sleeved jumpsuit, plus a dramatic black skirt with a high leg slit and statement train that according to eye-witnesses on the carpet, required three people to carry.\n\nImage zoom Jamie McCarthy/Getty\n\nThe singer accessorized her look with statement danglers and an engagement-like pink diamond ring (surrounded by a halo of smaller white diamonds on a gold band) that she’s been seen wearing for the last few months. And while the star has not announced any engagement news, she was seen out with boyfriend Christian Carino on Saturday ahead of the awards show.\n\nIn addition, the singer accented her all-black look with a white rose to show solidarity in the movement against sexual harassment and assault.\n\nRELATED: Why Are Stars Wearing White Roses to the Grammys?\n\nThe 60th annual Grammy Awards, hosted by James Corden, were broadcast live on CBS from Madison Square Garden in New York City.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fgaga21-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=749&h=392&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Flady-gaga9.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Flady-gaga9.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=749&h=392&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Flady-gaga9.jpg", "keywords": [], "authors": ["Maria Pasquini"], "canonical_link": "https://people.com/music/grammys-2018-lady-gaga-performance/", "title": "Lady Gaga Performs Stirring Tribute to Her Late Aunt During the Grammys and Calls Out Time's Up", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Awards Shows,Grammy Awards,Lady Gaga,Music News,News", "news_keywords": "Awards Shows,Grammy Awards,Lady Gaga,Music News,News", "description": "Wearing an ethereal pink gown, Lady Gaga performed the title track from her album Joanne", "og": {"title": "Lady Gaga Performs Stirring Tribute to Her Late Aunt During the Grammys and Calls Out Time's Up", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/grammys-2018-lady-gaga-performance/", "description": "There wasn’t a dry eye in the house as Lady Gaga performed a stirring rendition of “Joanne” and one of her other biggest hits at&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=749&h=392&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Flady-gaga9.jpg", "width": 749, "height": 392}}, "pinterest": {"url": "https://people.com/music/grammys-2018-lady-gaga-performance/", "description": "Wearing an ethereal pink gown, Lady Gaga performed the title track from her album Joanne", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Flady-gaga9.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/grammys-2018-lady-gaga-performance/", "title": "Lady Gaga Performs Stirring Tribute to Her Late Aunt During the Grammys and Calls Out Time's Up", "description": "Wearing an ethereal pink gown, Lady Gaga performed the title track from her album Joanne", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=749&h=392&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Flady-gaga9.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}