{"url": "https://www.independent.co.uk/arts-entertainment/films/news/wonder-woman-james-cameron-lynda-carter-patty-jenkins-dc-criticism-a7973251.html", "text": "Lynda Carter, the original star of Wonder Woman, has criticised James Cameron for his negative views on the Patty Jenkins-directed blockbuster that was released earlier this year.\n\nCarter, who famously played the character in the 1975 television series, hit out at the Avatar director on Facebook branding him a “poor soul.”\n\n“Your thuggish jabs at a brilliant director, Patty Jenkins, are ill advised,” she wrote. “This movie was spot on. I know, Mr. Cameron - because I have embodied this character for more than 40 years. So - STOP IT.”\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nCameron sparked controversy following his initial criticism of the DC film in which he called the film “a step backwards“ questioned Gal Gadot's portrayal of the character when compared with Sarah Connor, a character from his very own Terminator franchise.\n\nShape Created with Sketch. 33 Superhero films set for release between 2016 and 2020 Show all 34 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 33 Superhero films set for release between 2016 and 2020 1/34 1. Captain America: Civil War Release date: 6 May 2016. Iron Man and Captain America are set to face off in this superhero blockbuster that will feature nearly all the Avengers but won’t be an Avengers film. It will also mark the first time Spider-Man will feature in the Marvel Cinematic Universe, with Sony having made a deal with Marvel Studios. 2/34 2. X-Men: Apocalypse Release date: 27 May 2016. Following the success of Days of Future Past, Apocalypse will follow the young X-Men team as the battle against Oscar Isaac’s titular villain as he gathers his four horsemen; Magneto (Fassbender), Angel (Hardy), Storm (Shipp), and Psylocke (Munn). Expect carnage and no Wolverine. 3/34 3. Suicide Squad Release date: 5 August 2016. The first ‘supervillain’ film, Suicide Squad is also based in the DCEU (DC Extended Universe, where Batman and Superman live) and will introduce the world to Margot Robbie’s Harley Quinn and Jared Leto’s Joker. One of the more exciting upcoming DC films that’s for sure. 4/34 4. Doctor Strange Release date: 4 November 2016. Benedict Cumberbatch will debut in the MCU (Marvel Cinematic Universe, where Captain America and Iron Man live) as the Sorcerer Supreme. The film already has an incredible cast, including Chiwetel Ejiofor, Rachael McAdams and Tilda Swinton. 5/34 5. Untitled Lego Batman film Release date: 20 February 2017. Kicking off 2017 is the Lego version of Batman, who will lead his own spin-off, having already featured in the amazing Lego Movie. Will Arnett voices the titular character, while Zach Garfianakis - from the Hangover - will voice The Joker. But will he better than Leto? 6/34 6. Untitled Wolverine film Release date: 3 March 2017. Having not starred in X-Men: Apocalypse, Wolverine will return to the big screen in a solo film which was recently made R-Rated following the success of Deadpool. It is expected to be Hugh Jackman’s last outing as the titular character. Fox 7/34 7. Guardians of the Galaxy Vol. 2 Release date: 5 May 2017. Chris Pratt and the crew are returning to space in the sequel to the surprisingly successful Guardians of the Galaxy. According to director James Gunn, the film will not feature Thanos, even though he will to play a major role in phase MCU Phase 3. Cast includes newcomers Kurt Russell and Pom Klementieff, as well as, rumour has it, Sylvester Stallone. 8/34 8. Wonder Woman Release date: 23 June 2017. Gal Gadot is returning to the DCEU in her very own film, marking the first female-led superhero film on this list. Chris Pine is on board to play Wonder Woman’s love interest. 9/34 9. Untitled Spider-Man reboot Release date: 7 July 2017. Yes, it is another Spider-Man reboot, having previously been redone with Andrew Garfield as the lead. However, this time it is part of the MCU, with Tom Holland as the titular character, and a heavily rumoured cameo by Iron Man could be in the pipeline. We can dream. 10/34 10. Untitled Fox film Release date: 6 October 2017. In a strange announcement, Fox decided to withhold the release of Gambit until a future, as-yet unannounced date, which could be here, or this could be a completely separate project. Many suspect Deadpool 2 could nicely fit here, Fox capitalising on the success of the first film. 11/34 11. Thor: Ragnarok Release date: 3 November 2017. Chris Hemsworth will be returning as the Norse God in his third solo MCU film. Flight of the Conchords’ Taika Waititi is on board to direct, and promises a fun adventure that will likely lead into Marvel’s next project, Infinity War. 12/34 12. Justice League Part One Release date: 17 November 2017. Hot on the heals of Thor comes Justice League Part One, the first DCEU team-up flick which will see Batman, Superman, Wonder Woman, The Flash, Aquaman and Cyborg work together to fight bad guys. 13/34 13: Untitled Fox film Release date: 12 January 2018. Kicking off 2018 will likely be the second Deadpool film, but then again, this could very well be another X-Men team-up. There’s also talk of an X-Force film, with Deadpool and other mutants teaming up to fight evil. 14/34 14. Black Panther Release date: 16 February 2018. The first non-white male-led superhero film in the MCU comes in the form of Black Panther, with Chadwick Boseman reprising the titular role, having also starred as the Panther in Civil War. Creed’s Ryan Coogler is on to direct what could be a very exciting film. 15/34 15. The Flash Release date: 16 March 2018. The Flash will be the first DCEU film since Justice League, and sees Ezra Miller take the lead. Phil Lord and Chris Miller were supposed to pen the film before Disney snapped them up for the Han Solo-film, leaving Seth Grahame-Smith to take charge. 16/34 16. Avengers: Infinity War Part 1 Release date: 4 May 2018. And so, we finally get to the point of all these Infinity Stones! Thanos will be the big bad, with the Avengers needing to team up to defeat their biggest foe yet. It has previously been described as “the end of the Avengers as we know it”. 17/34 17. Ant-Man and The Wasp Release date: 6 July 2018. Peyton Reed will be back to direct this surprise sequel to one of the better received MCU films. While the name is ridiculous, at least Marvel are finally having a leading female superhero. 18/34 18. Untitled Fox film Release date: 13 July 2018. Again, not much word on this one except it is thought to be X-Men spin-off New Mutants, something Josh Boone has been hit up to write. 19/34 19. Animated Spider-Man Film Release date: 20 July 2018. Avi Arad, Matt Tolmach, and Amy Pascal - the team behind the live-action Spider-Man films - are producing this ‘unrelated’ animated adaptation of the hero. Because you can never have too much Spider-Man, right? 20/34 20. Aquaman Release date: 27 July 2018. Another Justice League spin-off, Jason Momoa plays the leading man. Furious 7’s James Wan is on to direct, but little else is known about the film. 21/34 21. Captain Marvel Release date: 8 March 2019. We’ve hit 2019, and the first confirmed superhero film will be the first proper female-led MCU film. No-one is confirmed to be in the titular role of Carol Danvers just yet. 22/34 22. Shazam Release date: 5 April 2019. Dwayne Johnson stars as the villain in this DCEU film which will be somewhat separate to the other DC films. 23/34 23. Avengers: Infinity War Part 2. Release date: 3 May 2019. The conclusion to the long drawn MCU saga. Expect a big finish with at least a few planets being destroyed. 24/34 24. Justice League Part Two Release date: 14 June 2019. Soon after the Infinity War story reaches its conclusion, so will the Justice League’s. Not much is known, except Darkseid will likely be the villain for at least one of the parts. 25/34 25. Inhumans Release date: 12 July 2019. The concept of Inhumans (or Marvel’s mutants) has already been introduced in TV, through Marvel’s Agents of Shield, yet the film is expected to introduce the Royal Family who have yet to be seen in the show. 26/34 26. Cyborg Release date: 3 April 2020. Having debuted in Justice League Part One three years previously, Cyborg will finally be making his own outing, with Ray Fisher as the titular character. 27/34 27. Untitled MCU film Release date: 1 May 2020. The first of three untitled Marvel films. There are a couple of contenders, the first is a likely sequel to Spider-Man with Sony, or a third Guardians of the Galaxy film, thus finishing the trilogy. 28/34 28. Green Lantern Corps. Release date: 19 June 2020. Before you start to worry, this has nothing to do with the Ryan Reynolds-starring flick that hit cinemas a little while ago. Instead, this will be another DCEU film that will likely spin-off from Justice League after the Green Lantern Corps cameo in one of the parts. 29/34 29. Untitled MCU film Release date: 10 July 2020. As well as Spider-Man or Guardians of the Galaxy sequels, a Doctor Strange or Black Panther one could fit in nicely here. Or perhaps Black Widow may finally get the solo-film she deserves. 30/34 30. Untitled MCU film Release date: 6 November 2020. Some speculators also think a Blade film could fit in here, marking over 20 years since the first Blade. But many believe the character may be better suited to a Netflix series, as with Daredevil and Jessica Jones. There’s also talk of a Runaways film reaching cinemas at some stage. 31/34 31. Untitled Ben Affleck Batman film Release date: TBA. Now we’re onto the TBA release dates, the first of which is a Batman solo film, written and directed by Ben Affleck. When this is due, no one is quite sure but expect it sooner rather than later if Batman v Superman is a success. 32/34 32. Suicide Squad 2 Release date: TBA (rumoured 2017). A sequel to Suicide Squad is expected to come in 2017 according to recent reports, but nothing has been confirmed. If the first is successful, it should come as no surprise for Warner Bros to rearrange their schedule to fit in this surefire hit. 33/34 33. Venom Release date: TBA. This is an odd one, as it has been confirmed Sony are wanting to release a Venom film completely unrelated to the upcoming Spider-Man reboot. Venom, as you may know, is a Spider-Man villain, intrinsically linked to Spider-Man, so it seems odd they would release a film unrelated to the rebooted project and not linked to the MCU. 34/34 Anything else? Well, now you mention it, there’s also that sequel to Fantastic Four that has seemingly been dropped by Fox. Plus, there’s the Gambit film which has been put on hold (but will likely fill an untitled Fox slot so we haven’t added it extra). Then again, it could be shoehorned in somehow… Marvel 1/34 1. Captain America: Civil War Release date: 6 May 2016. Iron Man and Captain America are set to face off in this superhero blockbuster that will feature nearly all the Avengers but won’t be an Avengers film. It will also mark the first time Spider-Man will feature in the Marvel Cinematic Universe, with Sony having made a deal with Marvel Studios. 2/34 2. X-Men: Apocalypse Release date: 27 May 2016. Following the success of Days of Future Past, Apocalypse will follow the young X-Men team as the battle against Oscar Isaac’s titular villain as he gathers his four horsemen; Magneto (Fassbender), Angel (Hardy), Storm (Shipp), and Psylocke (Munn). Expect carnage and no Wolverine. 3/34 3. Suicide Squad Release date: 5 August 2016. The first ‘supervillain’ film, Suicide Squad is also based in the DCEU (DC Extended Universe, where Batman and Superman live) and will introduce the world to Margot Robbie’s Harley Quinn and Jared Leto’s Joker. One of the more exciting upcoming DC films that’s for sure. 4/34 4. Doctor Strange Release date: 4 November 2016. Benedict Cumberbatch will debut in the MCU (Marvel Cinematic Universe, where Captain America and Iron Man live) as the Sorcerer Supreme. The film already has an incredible cast, including Chiwetel Ejiofor, Rachael McAdams and Tilda Swinton. 5/34 5. Untitled Lego Batman film Release date: 20 February 2017. Kicking off 2017 is the Lego version of Batman, who will lead his own spin-off, having already featured in the amazing Lego Movie. Will Arnett voices the titular character, while Zach Garfianakis - from the Hangover - will voice The Joker. But will he better than Leto? 6/34 6. Untitled Wolverine film Release date: 3 March 2017. Having not starred in X-Men: Apocalypse, Wolverine will return to the big screen in a solo film which was recently made R-Rated following the success of Deadpool. It is expected to be Hugh Jackman’s last outing as the titular character. Fox 7/34 7. Guardians of the Galaxy Vol. 2 Release date: 5 May 2017. Chris Pratt and the crew are returning to space in the sequel to the surprisingly successful Guardians of the Galaxy. According to director James Gunn, the film will not feature Thanos, even though he will to play a major role in phase MCU Phase 3. Cast includes newcomers Kurt Russell and Pom Klementieff, as well as, rumour has it, Sylvester Stallone. 8/34 8. Wonder Woman Release date: 23 June 2017. Gal Gadot is returning to the DCEU in her very own film, marking the first female-led superhero film on this list. Chris Pine is on board to play Wonder Woman’s love interest. 9/34 9. Untitled Spider-Man reboot Release date: 7 July 2017. Yes, it is another Spider-Man reboot, having previously been redone with Andrew Garfield as the lead. However, this time it is part of the MCU, with Tom Holland as the titular character, and a heavily rumoured cameo by Iron Man could be in the pipeline. We can dream. 10/34 10. Untitled Fox film Release date: 6 October 2017. In a strange announcement, Fox decided to withhold the release of Gambit until a future, as-yet unannounced date, which could be here, or this could be a completely separate project. Many suspect Deadpool 2 could nicely fit here, Fox capitalising on the success of the first film. 11/34 11. Thor: Ragnarok Release date: 3 November 2017. Chris Hemsworth will be returning as the Norse God in his third solo MCU film. Flight of the Conchords’ Taika Waititi is on board to direct, and promises a fun adventure that will likely lead into Marvel’s next project, Infinity War. 12/34 12. Justice League Part One Release date: 17 November 2017. Hot on the heals of Thor comes Justice League Part One, the first DCEU team-up flick which will see Batman, Superman, Wonder Woman, The Flash, Aquaman and Cyborg work together to fight bad guys. 13/34 13: Untitled Fox film Release date: 12 January 2018. Kicking off 2018 will likely be the second Deadpool film, but then again, this could very well be another X-Men team-up. There’s also talk of an X-Force film, with Deadpool and other mutants teaming up to fight evil. 14/34 14. Black Panther Release date: 16 February 2018. The first non-white male-led superhero film in the MCU comes in the form of Black Panther, with Chadwick Boseman reprising the titular role, having also starred as the Panther in Civil War. Creed’s Ryan Coogler is on to direct what could be a very exciting film. 15/34 15. The Flash Release date: 16 March 2018. The Flash will be the first DCEU film since Justice League, and sees Ezra Miller take the lead. Phil Lord and Chris Miller were supposed to pen the film before Disney snapped them up for the Han Solo-film, leaving Seth Grahame-Smith to take charge. 16/34 16. Avengers: Infinity War Part 1 Release date: 4 May 2018. And so, we finally get to the point of all these Infinity Stones! Thanos will be the big bad, with the Avengers needing to team up to defeat their biggest foe yet. It has previously been described as “the end of the Avengers as we know it”. 17/34 17. Ant-Man and The Wasp Release date: 6 July 2018. Peyton Reed will be back to direct this surprise sequel to one of the better received MCU films. While the name is ridiculous, at least Marvel are finally having a leading female superhero. 18/34 18. Untitled Fox film Release date: 13 July 2018. Again, not much word on this one except it is thought to be X-Men spin-off New Mutants, something Josh Boone has been hit up to write. 19/34 19. Animated Spider-Man Film Release date: 20 July 2018. Avi Arad, Matt Tolmach, and Amy Pascal - the team behind the live-action Spider-Man films - are producing this ‘unrelated’ animated adaptation of the hero. Because you can never have too much Spider-Man, right? 20/34 20. Aquaman Release date: 27 July 2018. Another Justice League spin-off, Jason Momoa plays the leading man. Furious 7’s James Wan is on to direct, but little else is known about the film. 21/34 21. Captain Marvel Release date: 8 March 2019. We’ve hit 2019, and the first confirmed superhero film will be the first proper female-led MCU film. No-one is confirmed to be in the titular role of Carol Danvers just yet. 22/34 22. Shazam Release date: 5 April 2019. Dwayne Johnson stars as the villain in this DCEU film which will be somewhat separate to the other DC films. 23/34 23. Avengers: Infinity War Part 2. Release date: 3 May 2019. The conclusion to the long drawn MCU saga. Expect a big finish with at least a few planets being destroyed. 24/34 24. Justice League Part Two Release date: 14 June 2019. Soon after the Infinity War story reaches its conclusion, so will the Justice League’s. Not much is known, except Darkseid will likely be the villain for at least one of the parts. 25/34 25. Inhumans Release date: 12 July 2019. The concept of Inhumans (or Marvel’s mutants) has already been introduced in TV, through Marvel’s Agents of Shield, yet the film is expected to introduce the Royal Family who have yet to be seen in the show. 26/34 26. Cyborg Release date: 3 April 2020. Having debuted in Justice League Part One three years previously, Cyborg will finally be making his own outing, with Ray Fisher as the titular character. 27/34 27. Untitled MCU film Release date: 1 May 2020. The first of three untitled Marvel films. There are a couple of contenders, the first is a likely sequel to Spider-Man with Sony, or a third Guardians of the Galaxy film, thus finishing the trilogy. 28/34 28. Green Lantern Corps. Release date: 19 June 2020. Before you start to worry, this has nothing to do with the Ryan Reynolds-starring flick that hit cinemas a little while ago. Instead, this will be another DCEU film that will likely spin-off from Justice League after the Green Lantern Corps cameo in one of the parts. 29/34 29. Untitled MCU film Release date: 10 July 2020. As well as Spider-Man or Guardians of the Galaxy sequels, a Doctor Strange or Black Panther one could fit in nicely here. Or perhaps Black Widow may finally get the solo-film she deserves. 30/34 30. Untitled MCU film Release date: 6 November 2020. Some speculators also think a Blade film could fit in here, marking over 20 years since the first Blade. But many believe the character may be better suited to a Netflix series, as with Daredevil and Jessica Jones. There’s also talk of a Runaways film reaching cinemas at some stage. 31/34 31. Untitled Ben Affleck Batman film Release date: TBA. Now we’re onto the TBA release dates, the first of which is a Batman solo film, written and directed by Ben Affleck. When this is due, no one is quite sure but expect it sooner rather than later if Batman v Superman is a success. 32/34 32. Suicide Squad 2 Release date: TBA (rumoured 2017). A sequel to Suicide Squad is expected to come in 2017 according to recent reports, but nothing has been confirmed. If the first is successful, it should come as no surprise for Warner Bros to rearrange their schedule to fit in this surefire hit. 33/34 33. Venom Release date: TBA. This is an odd one, as it has been confirmed Sony are wanting to release a Venom film completely unrelated to the upcoming Spider-Man reboot. Venom, as you may know, is a Spider-Man villain, intrinsically linked to Spider-Man, so it seems odd they would release a film unrelated to the rebooted project and not linked to the MCU. 34/34 Anything else? Well, now you mention it, there’s also that sequel to Fantastic Four that has seemingly been dropped by Fox. Plus, there’s the Gambit film which has been put on hold (but will likely fill an untitled Fox slot so we haven’t added it extra). Then again, it could be shoehorned in somehow… Marvel\n\nHe re-emphasised his views in a new interview earlier this week, saying: “She's absolutely drop-dead gorgeous. To me, that's not breaking ground.”\n\nAt the time, Jenkins - who is now the highest-paid female director after steering Wonder Woman to a $800 haul earlier this summer - replied to Cameron's comments, calling them “unsurprising” considering he is not a woman. She's yet to comment on his latest remarks.\n\nCameron is currently working on four Avatar sequels, the first of which will be released in 2020.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/29/08/lynda-carter-wonder-woman.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/29/08/lynda-carter-wonder-woman.jpg", "keywords": [], "authors": ["Jacob Stolworthy"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/news/wonder-woman-james-cameron-lynda-carter-patty-jenkins-dc-criticism-a7973251.html", "title": "Wonder Woman star Lynda Carter hits out at 'poor soul' James Cameron", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/films/news/wonder-woman-james-cameron-lynda-carter-patty-jenkins-dc-criticism-a7973251.html", "title": "Original Wonder Woman actress hits back at James Cameron", "description": "'Your thuggish jabs at a brilliant director are ill advised'", "updated_time": "2017-09-29T09:17:28+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/29/08/lynda-carter-wonder-woman.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7973251"}, "description": "Lynda Carter, the original star of Wonder Woman, has criticised James Cameron for his negative views on the Patty Jenkins-directed blockbuster that was released earlier this year. Carter, who famously played the character in the 1975 television series, hit out at the Avatar director on Facebook branding him a “poor soul.”", "keywords": "Wonder Woman, James Cameron, Lynda Carter, News, Film, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Wonder Woman", "published_time": "2017-09-29T08:23:00+01:00", "modified_time": "2017-09-29T09:17:28+01:00", "section": "News", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 210, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 5, "external_link_count": 2}, "twitter": {"title": "Original Wonder Woman actress hits back at James Cameron", "description": "Lynda Carter, the original star of Wonder Woman, has criticised James Cameron for his negative views on the Patty Jenkins-directed blockbuster that was released earlier this year. Carter, who", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1506669780.0, "source": "https://www.independent.co.uk", "summary": ""}