{"url": "https://en.wikipedia.org/wiki/Bode_Miller", "text": "Samuel Bode Miller ( ; born October 12, 1977) is an American former World Cup alpine ski racer. He is an Olympic and World Championship gold medalist, a two-time overall World Cup champion in 2005 and 2008, and the most successful male American alpine ski racer of all time. He is also considered one of the greatest World Cup racers of all time with 33 race victories and being one of five men (and last to date) to win World Cup events in all five disciplines.[1] He is the only skier with five or more victories in each discipline. In 2008, Miller and Lindsey Vonn won the overall World Cup titles for the first U.S. sweep in 25 years.\n\nMiller won six medals in the Winter Olympics, the most of any U.S. skier − two silvers (giant slalom and combined) in Salt Lake City 2002, a gold (super combined), a silver (super-G) and a bronze (downhill) in Vancouver 2010 and a bronze (super-G) in Sochi 2014. Miller is one of 5 skiers who have won Olympic medals in 4 different disciplines, matching the feats of Kjetil André Aamodt and female racers Anja Pärson, Janica Kostelić and Katja Seizinger.[2]\n\nMiller ended his career with six discipline World Cup titles and also won four World Championships titles in four different disciplines (giant slalom, combined, super-G and downhill) and one silver medal in super-G. While his skiing career was coming to an end, Miller had switched his attention and investment to horse racing.[3] He officially retired from ski racing in October 2017.\n\nEarly years [ edit ]\n\nBorn in Easton, New Hampshire to Jo Kenney and Woody Miller, Miller grew up in nearby Franconia, a small community in the heart of New Hampshire's White Mountains that comprises the Cannon Mountain Ski Area. His family, including older sister Kyla, younger sister Wren (short for Genesis Wren Bungo Windrushing Turtleheart), and younger brother Chelone (full name Nathaniel Kinsman Ever Chelone Skan),[4] lived on 450 acres (1.8 km2) of land in a forest, where his parents celebrated solstices, in a log cabin without electricity or indoor plumbing. He was raised a vegetarian.[5] He was homeschooled until the third grade, but after his parents divorced, he began attending public school.[citation needed] He applied for and got a scholarship to the Carrabassett Valley Academy, a ski racing academy in Maine. His mother's parents owned and started the Tamarack Tennis Camp, and he has played tennis and soccer since childhood.[citation needed]\n\nMiller first gained widespread recognition after winning two silver medals at the 2002 Salt Lake City Winter Olympics in the giant slalom and combined events, though he had been known to skiing fans since he burst onto the international scene as an 18-year-old in 1996. Miller is known for his reckless style, often risking crashes to increase his chances of winning a given race; in his book, Bode: Go Fast, Be Good, Have Fun, Miller stated that his goal as a skier was not to win medals, but rather to ski \"as fast as the natural universe will allow.\" In 2006, Miller also became famous for his reclusive (but outspoken) personality and his attention-getting statements.[citation needed]\n\nSki racing career [ edit ]\n\nThe Beginnings (1998–2001) [ edit ]\n\nMiller not only first appeared in the World Cup during the 1998 season but also represented the United States in the 1998 Nagano Olympics, competing in both of the technical disciplines (giant slalom and slalom).[6] In 1999, he also competed in super-G (which is considered a speed discipline, not a technical one) and represented the U.S. in all three events at the World Ski Championships at Beaver Creek, with a best finish of 8th in slalom. He finally achieved a podium in a giant slalom at Val d'Isère on December 17, 2000 (placing third), but then only competed in super-G at the 2001 World Ski Championships; he crashed during the downhill portion of the combined and tore knee ligaments, which ended his competition.[7]\n\nDouble Silver (2002) [ edit ]\n\nDuring this season, Miller began regularly competing in downhill, making him a five-event skier on the World Cup circuit, although he was still considered a technical specialist. Miller won his first World Cup race on December 29, 2001, taking the giant slalom at Val-d'Isère, and then followed it up the next day with another win in the slalom at Madonna di Campiglio. He would go on to win two more slalom races in January 2002, along with a pair of silver medals at the 2002 Winter Olympics in February, thus establishing himself as the top racer on the U.S. Ski Team.\n\nMiller won his first ever Olympic medal on February 13, in the combined event. He was 15th after the downhill portion losing 2.44 seconds to Kjetil André Aamodt. He then put a remarkable second run of the slalom portion to finish second overall just 0.28 behind Aamodt. Later on Miller won a second silver medal, this time in the giant slalom where he lost only to Stephan Eberharter of Austria. Miller was on a verge of winning medals in all disciplines he had entered at the Olympics, while he was second after first run of the slalom race. At the starting gate before his final run Miller had already a huge advantage of 1.79 seconds over then leading Sébastien Amiez. Instead of having a careful run to secure at least another silver medal, Miller decided to push for a gold. The tactics resulted in a fall and missed gate, which caused him to finish far behind the medal positions.[8]\n\nThis was his final season on Fischer skis; he switched to Rossignol following the season's completion.\n\nBecoming a World Cup Champion (2003–2005) [ edit ]\n\nMiller challenged for the 2003 World Cup overall title but fell just short, finishing second to Stephan Eberharter of Austria. At the 2003 World Championships in St. Moritz, Switzerland, Miller won three medals: gold in giant slalom and combined, and silver in super-G. He also won two other giant slaloms during the season.\n\nIn the 2004 season, Miller won World Cup titles in two disciplines: giant slalom and combined, but placed fourth in the competition for the overall title. He won six World Cup races: three giant slaloms, two combineds and one slalom. After the season, Miller switched to Atomic skis.\n\nMiller won his first overall World Cup title in 2005, defeating Austrians Benjamin Raich and Hermann Maier. He made history early in the season by winning at least one race in each of the four standard World Cup disciplines: slalom, giant slalom, super-G and downhill. In winning a slalom in Sestriere on December 13, he joined Marc Girardelli of Luxembourg, who had been the first man to accomplish this feat in 1989. Miller accomplished the feat in less time than any previous ski racer, male or female; the victory was his sixth of the season after only ten races. At the 2005 World Championships in Bormio, Italy, he won two gold medals, in super-G and downhill. In the downhill portion of the combined, he lost a ski 16 seconds into the race, but decided to continue down the course nevertheless at speeds up to 83 km/h on one ski, before sliding out near the bottom nearly two minutes later.[9]\n\nDisappointment (2006) [ edit ]\n\nDespite the hype surrounding Miller prior to the 2006 Winter Olympics, every one of Miller's five medal bids in the Turin Games fell short: he finished a disappointing 5th in the downhill, was disqualified – while in first place at the time – during the second leg of the combined event, failed to finish the super-G, tied for 6th in the giant slalom, and had another DNF after missing a gate in the first run of the slalom. Nevertheless, Miller won two races during the season (a giant slalom and a super-G) and placed third for the season's overall World Cup title. At the 2006 U.S. National Championships following the World Cup season, Miller won the downhill and giant slalom titles. He switched to Head skis following the season's completion. Miller had prolotherapy treatments, an alternative treatment that has shown no effect in clinical trials, to the ligaments in his knee or knees in February 2006, with other ski team members, Bryon Friedman and Eric Schlopy.\n\nIndependent World Cup Champion (2007–2009) [ edit ]\n\nMiller had four first-place finishes (two downhills and two super-Gs) in the early going of the 2007 World Cup. For the season, Miller finished 4th overall and won the super-G title. On May 12, 2007, Miller announced that he was leaving the U.S. Ski Team. He followed the precedent set by slalom skier Kristina Koznick, who left the U.S. Ski Team following the 2000 season and raced the next six years for the U.S. as an independent.\n\nIn 2008 Miller clinched his second overall championship at the World Cup finals in Bormio, Italy. He missed a chance to also win the season's downhill title when bad weather prevented the season's last race from being run. Miller got his first win of the season at the Stelvio downhill in Bormio in December. On January 13, he won for the second year in a row the legendary Wengen downhill, matching Phil Mahre as the most successful American skier with 27 World Cup victories. On January 20, he broke this record by winning the Hahnenkamm combined event at Kitzbühel. On January 27, he won the first super combined in his career in Chamonix and took the lead in the World Cup standings. On February 3, he won the super combined in Val d'Isère, France, and took the combined title. On March 1, Bode got his sixth win of the season at Kvitfjell, Norway, cementing his lead in the overall standings and closing to 5 points on Didier Cuche in downhill. At the end of this impressive season he was crowned overall champion.\n\nMiller responded to his World Cup success in 2008 with the worst season of his professional career, leading some to speculate that he might be \"burned out.\"[10] Miller failed to win a race for the first time in eight years and had only two official podium finishes, both seconds in downhill, to show for his season. Miller suffered a torn ligament in his left ankle in a December fall at Beaver Creek, which may have been a factor in his performance.[10] He took a four-week break from competition in February and March, the first World Cup races that he had failed to start in three years, and missed the end of the World Cup season, although he still had a chance to win the season's downhill title.[11] He said that \"the fire goes away after a while\",[10] and he hinted at retirement.[11]\n\nReunited for Olympic Triple (2010) [ edit ]\n\nAfter returning to the U.S. Ski Team, Miller missed much of the early part of the 2010 season due to an ankle sprain which he suffered during a volleyball game with other members of the team.[12] However, he returned by winning a World Cup super-combined event in Wengen on January 15, 2010, for his first victory in nearly two years.[13]\n\nHe made the U.S. team for the 2010 Winter Olympics in late 2009 and was selected to compete in all five events, despite his lack of training.[14] In his first race, after several delays due to warm weather and poor snow conditions, Miller won a bronze medal in the downhill, the first American to win an Olympic medal in downhill since Tommy Moe won gold in 1994. Miller's time was 1:54.40, nine hundredths of a second behind gold medalist Didier Défago, and two hundredths behind Aksel Lund Svindal, who took the silver; the time difference between the gold and bronze medals was the smallest in Olympic downhill history.[15] He then won a silver in the super-G, giving him four Olympic medals, more than any other American alpine racer.[16] On February 21, 2010, he won his first Olympic gold medal in the super combined. After the downhill portion of the race, Miller was in seventh place, but finished third in the slalom portion, giving him a total time of 2:44.92 to finish first overall.[17] Miller then failed to finish both the giant slalom and the slalom, and took the rest of the season off due to continuing problems with his ankle injury.[18]\n\nLast victory and a break (2011–2013) [ edit ]\n\nMiller followed his Olympic success with the mediocre season, but still managed to finish Top 3 in three occasions. He was third at the city event in Munich, second to Didier Cuche at Kitzbuehel's downhill and third in super-G at Hinterstoder. He started World Championships in Garmisch-Partenkirchen with typical Bode-like fashion at super-G race. He was leading the field despite losing a pole midway through the course, however he lost his balance coming out of a bend at the bottom, slowed down and stood up as he crossed the finish line on 12th position.[19]\n\nMiller earned the 33rd World Cup win of his career with a downhill victory in Beaver Creek. He topped young Swiss sensation Beat Feuz with four hundredths of a second. He also managed to finish 2nd in super-G at Val Gardena, 3rd in a super-combined event in Wengen and 2nd in a downhill race in Chamonix, where he was one hundredth of a second behind Klaus Kroell.[20]\n\nAfter undergoing a knee surgery in spring 2012, Miller decided not to rush his comeback to the slopes and announced in January 2013 that he would skip the entire season to ensure a completely healthy run for his fifth Olympics in 2014.[21]\n\nComeback for Bronze (2014) [ edit ]\n\nAt the beginning of his comeback season, Miller unexpectedly finished second at Beaver Creek's giant slalom, only behind fellow American Ted Ligety, which was his first podium in the discipline since 2007. Miller's hopes of winning his first downhill race at Kitzbühel came up short after he made a significant mistake in the middle section of the course to eventually finish third. Next day he ended up second only behind Didier Défago in super-G at the same mountain.\n\nMiller began the Winter Olympics by winning two out of three training sessions before the downhill. However, as sunny conditions of the training days changed into a cloudy race day, he was not able to keep up the momentum and finished in eighth position.[22] He was then unable to defend his title from the previous Olympic Games as he finished sixth in the super combined event. On February 16, 2014, Miller became the oldest Olympic medalist in alpine skiing history, by winning a bronze medal in the super-G race.[23] He shared a third place podium with Jan Hudec of Canada. By collecting his sixth Olympic medal, Miller moved to the second position on the all-time list of Olympic male medalists in alpine skiing, only behind Kjetil André Aamodt who won eight medals. In his last race of the Olympics, Miller finished 20th in the giant slalom, won by U.S. teammate Ligety.\n\nAfter the Olympics, Miller decided to continue competing until the end of the season for the first time since 2008. At the World Cup finals in Lenzerheide, he gained his fourth podium of the season while finishing 3rd in the super-G race. Miller finished the season ranked eighth overall, his best in 6 years.\n\nInjuries, ski legal dispute & retirement (2015–2017) [ edit ]\n\nOn November 17, 2014, Bode Miller announced that he would undergo outpatient back surgery to alleviate the pain and discomfort he had felt since the end of the previous season.[24] After attending official trainings to the downhills in both Wengen and Kitzbühel, but skipping the races, Miller was trying to make a comeback for the 2015 World Championships held at Vail / Beaver Creek, Colorado. On February 5, he crashed during the super-G race, after catching a gate.[25] During the crash his leg was cut by an edge of his ski and he suffered a torn hamstring tendon. The injury forced him to withdraw from the rest of the championships.[26]\n\nAfter celebrating the birth of his son, his first child with Morgan Beck, Miller announced in October that he would skip another season with the intention of spending more time with his family and to focus on his new-found passion of horse training.[27] Even though some people started to suspect that this might mean the end of his skiing career, Miller denied it in December, stating that although he would never do the full circuit again, there was a likelihood that he'd return to racing occasionally.[28] He terminated his contract with HEAD early under the restriction that he would not compete with other skis than HEAD on the World Cup circuit or in the World Alpine Ski Championships. He was then able to sign a deal with US-based ski manufacturer Bomber Ski, which also made Miller the brand's part owner.[29]\n\nAt the end of 2016, Miller wanted to make another comeback to the tour and compete with Bomber skis. HEAD, however, blocked the attempt, stating that Miller had agreed not to compete with other ski brands for 2 years from the moment their agreement had been terminated. While Miller argued that HEAD's action illegally prevented him from competing to earn a living, HEAD rejected that argument and showed disappointment in Miller for not honoring his word by trying to race with different skis.[30][31]\n\nOn October 31, 2017, Miller announced his retirement from competition.[citation needed] He was also inducted into the US Ski and Snowboard Hall of Fame, Class of 2018.\n\nWorld Cup results [ edit ]\n\nSeason titles [ edit ]\n\n8 titles – (2 overall, 2 super-G, 1 giant slalom, 3 combined)\n\nSeason standings [ edit ]\n\nSeason Age Overall Slalom Giant\n\nSlalom Super G Downhill Combined 1998 20 95 — 36 — — — 1999 21 38 23 23 — — — 2000 22 90 — 31 44 — — 2001 23 42 — 15 34 55 — 2002 24 4 2 7 49 — 4 2003 25 2 17 2 12 13 1 2004 26 4 5 1 25 23 1 2005 27 1 15 2 1 2 — 2006 28 3 32 9 10 5 2 2007 29 4 55 6 1 8 28 2008 30 1 29 13 8 2 1 2009 31 15 16 35 27 7 — 2010 32 20 43 — 18 17 5 2011 33 14 — 24 14 12 22 2012 34 15 53 31 16 5 16 2013 35 Injured: out for entire season 2014 36 8 49 22 5 8 16\n\nOlympic results [ edit ]\n\nMiller is one of the most successful alpine ski racers in Olympic history. He participated in five Winter Olympics, from 1998 through 2014. Miller had 19 starts in all five alpine disciplines and won six medals, including one gold in the super combined event in 2010. He is the only American ski racer in history to win medals at three different Olympics.\n\nWorld Championships results [ edit ]\n\nPublicity, press and promotions [ edit ]\n\n2002 Olympics [ edit ]\n\nMiller's fame was partly spawned by his 2002 Winter Olympics slalom performance. He had already won two silver medals and was in line for a third when he missed a gate. Instead of stopping, he hiked back up the course to retry the gate and finish.[32] That performance established Miller's reputation as a competitor who cares more about the way he skis rather than winning medals. He admitted that after the race:\n\nIt's the Olympics, you know. If I had backed off and I came down in fifth place or sixth place, I think I would have been really disappointed. I was going for the win. If it was somewhere else, maybe I would have had the ability to hold back a little bit more. But I want to go out and race my best race in front of my home crowd.[8]\n\n2006 Olympics controversy [ edit ]\n\nThe good feeling generated by Miller's 2002 Olympic performance was quickly dissipated in 2006. On the program 60 Minutes, in January 2006, Miller described the act of skiing \"wasted\" and compared it to lawlessly driving while intoxicated.[33] Throughout the Olympics, Miller said, \"I'm just trying to ski in a way that's exciting for me.\" In an interview shortly after his last race, he said that it had \"been an awesome two weeks,\" and that he \"got to party and socialize at an Olympic level.\" After an unapologetic Miller interview with Tom Brokaw, Bob Costas concluded in a primetime editorial that Miller might finally get what he wanted: to be unceremoniously forgotten. Miller received negative coverage in the American and international media; editorials focused on his attitude of simply not caring about the Olympics or about his performance.\n\nMany perceived his \"party at an Olympic level\" attitude as a violation of the \"Olympic Spirit.\" When Nike's 2006 advertising campaign urged consumers to \"Join Bode,\" Washington Post sportswriter Sally Jenkins asked, \"Where? At the bar?\" in reference to his well-publicized nights on the town in Sestriere.[34] He was even called the \"biggest bust in Olympic history\" for his performance.[32] Some have argued that Miller's management and PR team were partly to blame for his crash-and-burn publicity, pointing out that they facilitated the media blitz in the months leading up to the Olympics. This overexposure was bound to backfire, given Miller's known uneven commitment to performing. Miller himself said:\n\n[The Olympic hype] is going to be a tough thing for me to manage. My actions are not always consistent. I'm super-mellow and laid back, but I'm always thinking and running 100,000 scenarios through my head. Sometimes I'm disciplined, but I like to be a total slacker, too. I party hard, but I train hard. People are going to try to figure me out and figure out my motivations, and it's going to be a circus.[35]\n\n2010 Olympics success [ edit ]\n\nMiller's success in the 2010 Olympic Games has been contrasted with his 2006 results. Miller's explanation for his belated success was simple: \"Most likely it’s because I decided that’s what I wanted to do.\"[16] At the 2010 games, his coaches stated that he \"helps inspire [them],\" a very different attitude from that of four years previously.[36] Miller himself said that the difference was that in 2006, his role as \"poster boy\" for the Olympics, after the corruption scandals associated with the 2002 Winter Olympics (bid scandal and figure skating scandal), was \"the absolute thing I despise the most in the world\" and \"really draining on my inspiration, my level of passion.\" Ultimately, the publicity \"had been happening for a year, and it was just too much.\"[36] By contrast, in 2010, he noted that he was not so proud of the medals themselves but of the \"absolutely amazing\" feeling when \"you ... magically ski at your absolute best.\"[36] He ended the 2010 Olympic Games as the most successful American skier and athlete overall.\n\nMiller was nominated for the Associated Press' Male Athlete of the Year award for 2010, but finished second to Drew Brees of the New Orleans Saints football team thanks to votes cast for Kobe Bryant of the Los Angeles Lakers basketball team who finished third.\n\n2014 Olympics emotions [ edit ]\n\nMiller's surprisingly dominating performance in training for the downhill race helped to create a hype among press and fans, with his teammate Marco Sullivan saying that it was \"his race to lose\" and rival Kjetil Jansrud describing Miller's performance in trainings as \"epic\". Just a day before the race, Miller himself claimed that \"The idea is to be unbeatable\" and \"I want to win\".[37] After finishing a disappointing 8th in the race, Miller pointed to various reasons for his failure including warmer temperatures, poor visibility, and his need for an eye surgery while U.S. Ski Team coach Sasha Rearick suggested that \"Bode wanted it too much\".[38] The change in Miller's attitude compared to that in his previous Olympic appearances showed after he won a bronze medal at the super-G race when he admitted that \"some days, like I said, medals don’t matter. Today was one of the days where it does matter\".[39] After the race, NBC's reporter Christin Cooper caused some controversy by repeatedly asking Miller about his dead brother until he broke down in tears. Miller however defended Cooper afterwards in several occasions saying that \"I know she didn’t mean to push\" and \"I don’t blame her at all\".[40]\n\nSelected press reaction [ edit ]\n\nAccording to John Canzano, Oregonian reporter, Miller is generally unpopular with American reporters who cover skiing.[41] One referred to him in 2009 as \"a tedious bore given to statements that smack of hypocrisy.\"[42] Another said that Miller's behavior had alienated him from \"pretty much everyone but those who mindlessly celebrate rebels simply for their rebellion, however misplaced it might be.\"[43]\n\nIn book, film, and game [ edit ]\n\nMiller's autobiography, Bode: Go Fast, Be Good, Have Fun, co-written with his friend Jack McEnany, was published by Villard/Random House on October 18, 2005. Miller also became the first American alpine skier since Tommy Moe to endorse a video game when Bode Miller Alpine Racing was released for mobile phones on January 30, 2006,[44] followed by Bode Miller Alpine Skiing for PlayStation 2 and Windows.[45][46] In 2006 Miller was the subject of a biographical film produced by the Coruway Film Institute, Flying Downhill, which looks at the people and the place Miller comes from, and where exactly each fits within his philosophy.\n\nMiller has used a variety of skis during his World Cup career. He originally started off on K2 skis, then raced on Fischer through the 2002 season. He switched to Rossignol for two seasons (2003 and 2004), then Atomic for the following two (2005 and 2006). In June 2006, he moved over to Head, along with Hermann Maier of Austria and Didier Cuche of Switzerland.\n\nTeam America [ edit ]\n\nIn May 2007, Miller left the US Ski Team[47] and raced independently for his personally financed Team America for two seasons. This allowed him more control of his training, equipment, staff, and sponsors. With fewer distractions, increased autonomy, and responsibility, Miller improved his focus and won his second overall title. However, the next season (2009) was the worst of his career after he crashed hard in the Beaver Creek Downhill, injuring his heel, and Miller folded Team America at the end of 2009. Miller departed the 2009 season before its completion and rejoined the US Ski Team in October 2009.\n\nOther sports [ edit ]\n\nMiller while playing for the Nashua Pride in 2007\n\nIn 2002, Miller won ABC Sports' Superstars competition, a televised event that pits athletes from different sports against one another in a series of athletic contests. In 2009, he competed in a Superstars team competition, which paired an athlete with a celebrity. Miller was paired with Paige Hemmis and they finished in second place.\n\nOn July 29, 2006, Miller signed a one-day contract to play baseball for the Nashua Pride (Canadian-American League). He went 0–2 with two strikeouts, however he did make an acrobatic catch in left field, which earned national attention by being featured by ESPN,[48] among others. The team said it would donate at least $5,000 from ticket sales for the game to Miller's Turtle Ridge Foundation, which will give the money to the Lance Armstrong Foundation.\n\nOn July 23, 2007, Miller again signed a one-day contract, to play the first three innings July 24, 2007, for the Nashua Pride, to raise money for charity.[49]\n\nIn April 2010, Miller opened the Boston Red Sox's baseball season by throwing out the ceremonial first pitch at Fenway Park.\n\nOn June 3, 2010, Miller competed for a spot in the 2010 US Open through the new national playoff system introduced by the USTA. The winner of the men's and women's playoff championships received a wild-card entry into the Open qualifying tournament.[50][51] He lost 6–4, 6–2 to Erik Nelson-Kortland in an opening match at sectional playoffs in Hawaii.[52]\n\nPersonal life [ edit ]\n\nMiller has a daughter, Neesyn Dace (born 2008), with Chanel Johnson and son, Samuel Bode Nathaniel “Nate” Miller-McKenna (born 2013) with Sara McKenna.[53][54]\n\nOn October 7, 2012, Miller married professional beach volleyball player and model Morgan Beck.[55] Their son, Edward Nash Skan Miller, was born in 2015,[56] and daughter, Emeline \"Emmy\" Grier, was born in 2016.[57] In April 2018, the couple announced that they were expecting their third child together. On June 10, 2018, 19-month old Emeline died after drowning in a swimming pool at a neighbor's house in Orange County, California.[58] Their second son, Easton Vaughn Rek Miller, was born on October 5, 2018.[59][60] On August 12, 2019, both Bode and Morgan announced they were expecting twin boys on NBC's Today Show. Bode spoke about how, when younger, he had a premonition that he would have twin boys.[61] The twin boys were born November 8, 2019 and are named Asher and Aksel.[62]\n\nMiller's younger brother Chelone was a snowboarder who competed in the 2010 Winter X Games in the Snowboard X event. He suffered a traumatic brain injury in a 2005 dirt-bike crash and subsequently suffered from seizures, leading to his death in 2013 at age 29.[63]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nMedia related to Bode Miller at Wikimedia Commons Quotations related to Bode Miller at Wikiquote\n\nArticles [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/22px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/2010_Winter_Olympics_Bode_Miller_in_downhill.jpg/220px-2010_Winter_Olympics_Bode_Miller_in_downhill.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Flag_of_Liechtenstein.svg/15px-Flag_of_Liechtenstein.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Flag_of_Luxembourg.svg/23px-Flag_of_Luxembourg.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/20px-Flag_of_Switzerland.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/15px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/23px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/22px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/22px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/15px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/15px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/15px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Germany_%281935%E2%80%931945%29.svg/22px-Flag_of_Germany_%281935%E2%80%931945%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/22px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/22px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Bodemiller1.JPG/170px-Bodemiller1.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/15px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Civil_Ensign_of_Switzerland.svg/15px-Civil_Ensign_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/16px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Germany_%281935%E2%80%931945%29.svg/23px-Flag_of_Germany_%281935%E2%80%931945%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Bode_Miller_Hinterstoder_2011.jpg/200px-Bode_Miller_Hinterstoder_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/7/74/Bode_Miller_Hinterstoder_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Flag_of_Luxembourg.svg/15px-Flag_of_Luxembourg.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/2010_Olympics_-_Mens_Super_Combined_Medals_cropped.jpg/220px-2010_Olympics_-_Mens_Super_Combined_Medals_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Flag_of_Liechtenstein.svg/23px-Flag_of_Liechtenstein.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/15px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/JO_B_Miller.jpg/200px-JO_B_Miller.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/15px-Flag_of_the_United_States.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/7/74/Bode_Miller_Hinterstoder_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bode_Miller", "title": "Bode Miller", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/7/74/Bode_Miller_Hinterstoder_2011.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}