{"url": "https://www.cnet.com/news/twin-peaks-david-lynch-laura-palmer-showtime-complete-guide/", "text": "ABC\n\nWARNING: THE OWLS ARE NOT WHAT THEY SEEM, BUT THE SPOILERS BELOW ARE!\n\n\"Twin Peaks\" ostensibly was a murder mystery about a homecoming queen named Laura Palmer. Her sad story was entangled with secrets kept by her best friend, family, classmates, lovers and psychiatrist. But there was always more to it than just Laura's troubled life.\n\nWhen FBI Agent Dale Cooper came to investigate her death, he found an impressive array of suspects, ranging from drug-dealing trucker Leo to a possessed one-armed man. There was the eccentric Log Lady, as well as an extra-dimensional evil place called the Black Lodge, a dancing backward-talking dwarf, owls that weren't owls, a creepy entity named Bob and endless doughnuts, cherry pies and really good coffee. In short, \"Twin Peaks\" was like no procedural we'd ever seen.\n\nWhen Laura's creepy doppelganger in the red-draped Black Lodge told Agent Cooper \"I'll see you again in 25 years,\" we got chills. Now that time has come.\n\nWith the \"Twin Peaks\" revival (18 hours in all) set to debut on Showtime with a two-hour premiere Sunday, fans have just a few days left to look back and gather clues about what's in store for Agent Cooper and the quirky citizens of the Pacific Northwest town. (Disclosure: Showtime is owned by CNET parent company CBS.)\n\nThe original \"Twin Peaks\" lasted two seasons, a total of 30 episodes, on ABC from 1990 to 1991 and was followed by the 1992 prequel film \"Twin Peaks: Fire Walk with Me.\"\n\nA few books added to the lore. \"The Secret Diary of Laura Palmer\" was a 1990 spinoff novel written by Lynch's daughter Jennifer Lynch. \"Twin Peaks: An Access Guide to the Town\" by David Lynch included everything from Norma Jenning's cherry pie recipe to the type of tree the Log Lady's log came from. And most recently, in 2016, \"Twin Peaks\" co-creator Mark Frost penned \"The Secret History of Twin Peaks,\" which would set the scene for the new series.\n\nBecause it's easy to get lost for weeks, if not years, obsessing over \"Twin Peaks,\" here's a handy guide to highlights from the original TV series, the prequel movie (with deleted scenes) and books that might be important to the upcoming series on Showtime. Keep in mind this is only a tiny sample of what happens to the characters.\n\nTV series\n\nOriginal \"Twin Peaks\"\n\nSeason 1:\n\n(Suggested episodes worth rewatching -- the pilot, 3, 8)\n\nHigh school student Laura Palmer (Sheryl Lee) is found dead, naked and wrapped in a plastic sheet by the edge of a lake.\n\nFBI Special Agent Dale Cooper (Kyle MacLachlan) comes to Twin Peaks to investigate the murder. He often leaves recorded messages on a mini cassette recorder for Diane, his secretary back at FBI headquarters in DC.\n\nLaura's best friend Donna (Lara Flynn Boyle) and her secret boyfriend James Hurley (James Marshall) decide to investigate Laura's murder on their own.\n\nLaura's actual boyfriend Bobby Briggs (Dana Ashbrook) is having a secret affair with Double R Diner waitress Shelly Johnson (Mädchen Amick), unbeknownst to her abusive husband Leo Johnson (Eric DaRe).\n\nSuspects include Bobby Briggs, Bobby's pal Mike Nelson (Gary Hershberger), Laura's psychiatrist Dr. Lawrence Jacoby (Russ Tamblyn), Leo Johnson, James Hurley, One-Eyed Jacks casino employee Jacques Renault (Walter Olkewicz) and The One-Armed Man Phillip Michael Gerard (played by Al Strobel), who's possessed by an entity named Mike.\n\nAgent Cooper has a series of bizarre dreams that take place in the \"Red Room\" in the Black Lodge. Laura's doppelgänger is there along with a dancing dwarf referred to as The Man from Another Place played by Michael J. Anderson.\n\nLaura's mother Sarah Palmer (Grace Zabriskie) has a horrifying vision of Bob hiding behind Laura's bed.\n\nAgent Cooper is shot by an unknown assailant in his hotel room.\n\nDr. Jacoby is assaulted by a masked man.\n\nJacques Renault is smothered to death by Laura's dad Leland.\n\nThere's still no answer to who killed Laura Palmer.\n\nVideo screenshot by Bonnie Burton/CNET\n\n\n\nSeason 2:\n\n(Suggested episodes worth rewatching -- 1, 7, 22)\n\nA giant man speaks riddles to Agent Cooper from a parallel universe.\n\nLeland Palmer's hair turns white overnight.\n\nDonna, Maddy and James find Laura's secret diary.\n\nAgent Cooper learns more about the evil parasitic spirit called Bob (Frank Silva) who possesses people and makes them do horrible things like murder.\n\nAgent Cooper suspects hotel owner Ben Horne (Richard Beymer) of killing Laura.\n\nLeland as Bob murders Laura's twin-like cousin Maddy Ferguson (also played by Sheryl Lee).\n\nLaura's murderer is finally revealed as her father Leland Palmer (Ray Wise) who has been possessed by Bob ever since he was a kid. Leland kills himself in jail, which then frees Bob to find another host.\n\nLeland is also found to be responsible for the earlier murder of Teresa Banks (Pamela Gidley).\n\nCooper's old FBI partner Windom Earle (Kenneth Welsh), who murdered his own wife Caroline when he discovered Cooper was having an affair with her (a storyline that happens before Twin Peaks), escapes from a mental asylum and shows up to get revenge.\n\nCooper falls in love with ex-nun Annie (Heather Graham).\n\nCooper chases Earle, who kidnaps Annie, into the mysterious Black Lodge, where Bob ends up killing Earle. But the lodge is full of duality, which means doppelgangers of various characters are found inside. Annie is injured, and Cooper escapes with her.\n\nCliffhanger moments in the series finale:\n\nLeo's tied up and left to die in a room full of deadly spiders.\n\nAudrey Horne, Andrew Packard and Pete Martell are all inside the bank when it blows up.\n\nAgent Cooper is trapped inside the Black Lodge, but his doppelganger escapes to the outside world and is possessed by Bob.\n\nAfter escaping the Black Lodge, Agent Cooper hits his head on purpose against the bathroom mirror, laughing maniacally as Bob laughs in his place in the mirror's reflection. Cooper/Bob asks \"How's Annie?\" over and over. Uh-oh.\n\nMovies\n\n\"Twin Peaks: Fire Walk With Me\" (1992)\n\nThe film, \"Twin Peaks\" co-creator and director David Lynch said in interviews, is \"very important\" to understanding the new series. I suggest watching the full movie for any possible clues as to what's ahead.\n\nThe key to this prequel isn't just seeing how all the pieces from the last week of Laura's life fit together before she's murdered. It also serves as an introduction to how Bob came to possess her father, and why Laura demanded her father kill her rather than be Bob's next unwilling host.\n\nThe big clue to pay close attention to is the Owl Cave Ring that murder victim Teresa Banks wears on her ring finger. Laura Palmer wears it. Then Annie. The ring also shows up in dream sequences that take place in the Black Lodge. Bob seems to kill anyone who wears it. The ring wearer also loses feeling in the left arm, which could refer to the ring's former owner the One-Armed Man known as Mike.\n\nIf you really want to delve deeper into more history of the ring, check out this wiki page explaining the Owl Cave symbol carved into the ring.\n\n\n\n\"The Missing Pieces\" (deleted scenes from \"Fire Walk With Me\")\n\nAfter watching \"Fire Walk With Me,\" be sure to watch \"Missing Pieces,\" which strings along all the deleted and extended scenes -- 90 minutes worth -- from the film into its own bizarre narrative.\n\n\"The Missing Pieces\" is available as a bonus feature in the \"Twin Peaks\" Blu-ray box set, but various scenes are also scattered around YouTube.\n\nOne of the key scenes shows how Bob tried to possess Laura. Frank Silva, who played Bob, died in 1995. But as we can see in this deleted scene, when Laura goes from her sweet smile into Bob's eerie grimace -- perhaps this will be a hint of how Agent Cooper will channel Bob in the new Showtime series.\n\nOther deleted scenes with Laura show her snorting cocaine from a bag with a key inside, and hiding in the bushes from her father Leland, who creepily looks right in her direction, among other sad moments.\n\nThere's a segment where Laura dreams about Cooper and Annie in the Black Lodge, which ties the series to the film, especially when Annie tells her in the dream to write in her diary that \"the good Dale\" is trapped in the Black Lodge.\n\nAlso, that Owl Cave ring shows up again when a nurse takes it off of Annie's finger while she's sleeping in her hospital bed, recovering from injuries sustained in the Black Lodge.\n\nBooks\n\n\"The Secret Diary of Laura Palmer\"\n\nLaura's diary is discovered by her best friend Donna during the TV series, but we really see what it meant to Laura in \"Fire Walk With Me\" when she finds that pages have been ripped out of it. This is the diary without those pages. It's a mix of high school memories, secret lovers including the very adult Ben Horne, and darker confessions of drugs, sexual abuse and an obsession with death. The diary begins when Laura is 12 years old, when she's first terrorized by the demonic entity from the Black Lodge known as Bob.\n\n\"Twin Peaks: An Access Guide to the Town\"\n\nThis book offers not only the coveted cherry pie recipe -- perfect for any \"Twin Peaks\" viewing party -- but maps of the town, which could come in handy for keeping track of where important events took place. While this book isn't chock-full of clues for the new series, it is a fun reference of the people and places that make the show so special.\n\n\"The Secret History of Twin Peaks\"\n\nThis book doesn't read like a typical novel, but instead tells the backstories of various characters through fictional newspaper clippings, government case files, photos, drawings, letters and detailed notes by \"The Archivist.\" The book also has notes written by an FBI investigator known as T.P., or Tamara Preston.\n\nThe book gives an extensive history of the town and how it came to be. The most important takeaway is the list of characters who don't make it out alive, and thus are probably not going to have cameos in the new series. Though some eagle-eyed (or maybe owl-eyed?) fans found quite a few contradictions in the book that don't add up with the TV series and film, and there's a very detailed Google doc listing all the errors.\n\nHere are some highlights from \"The Secret History of Twin Peaks\" book:\n\nAudrey Horne survived the blast at Twin Peaks Savings & Loan, but she's in a coma. Andrew Packard and Pete Martell died in the explosion. Catherine Martell becomes a recluse.\n\nElderly newspaper owner Dougie Milford is revealed to be a chameleon-like occult figure who stumbled upon the Black Lodge as a kid, then was stationed at UFO hub Roswell in the Air Force as an adult. He became kind of an \"X-Files\" Fox Mulder-type investigator and headed up the classified Listening Post Alpha project, which monitored paranormal activity in the woods around Twin Peaks.\n\nMajor Garland Briggs, Bobby Briggs' dad, replaces Milford on Listening Post Alpha. He's also \"The Archivist.\" He meets with Bob-possessed Agent Cooper to tell him about Listening Post Alpha but realizes something isn't quite right and doesn't give him any details. Briggs' dossier ends with the ominous word \"MAYDAY\" and leaves another secret message in the book that when decoded says \"Fear the Double,\" meaning Cooper. Since the actor who played Briggs (Don S. Davis) died in 2003, there's little chance we'll see him in the revival.\n\nFBI Agent Tamara Preston notes in the book that what happened to Agent Cooper and Major Briggs is considered \"many levels above top secret.\"\n\nDr. Jacoby loses his license to practice psychology in Washington state and moves to Hawaii. Though since the actor who plays him is in the cast list, chances are we'll see him in Twin Peaks again.\n\nHank Jennings (Norma's no-good husband) is sent back to prison, where he dies in a fight.\n\nThe owls in the woods of Twin Peaks are really aliens.\n\nEven more secret messages can be found in the book, and fans have been trying to suss them out on Reddit.\n\nNow that we have the new revival series on Showtime to obsess over, here's hoping we get a few more answers than questions. We've been waiting for 25 years, after all.\n\nTech Culture: From film and television to social media and games, here's your place for the lighter side of tech.\n\nSolving for XX: The industry seeks to overcome outdated ideas about \"women in tech.\"\n\n", "images": ["https://cnet1.cbsistatic.com/img/YUg1I3fGSWQSm9ZpAXIqIM5qNW8=/756x425/2017/03/01/ed9e5080-b6cc-4c5d-97f7-66e3184be321/twinpeakswelcomesign.jpg", "https://i-amlg-prod.appspot.com/display?id=b50d87b5-0550-46be-94cd-03e80b10342b", "https://cnet2.cbsistatic.com/img/wfIhm2GYhjFGYeDu65VRvbHEA_4=/1092x0/2017/05/20/a9a7362e-5215-4970-8f01-de745a3aec0c/bobcooper2.jpg", "https://cnet1.cbsistatic.com/img/O5paak3VK87zcw6zMlTG4wkcxJw=/1092x0/2016/02/16/98a9a9ec-8cce-4605-9fb0-b64c8800d727/twinpeakscast.jpg", "https://cnet1.cbsistatic.com/img/mVc29sRBILS8TxRqonaZMNU0Gow=/756x425/2017/08/21/18aa8681-dd20-4139-8fc9-8c2ea6a414e9/runaways-marvel-hulu.jpg", "https://cnet3.cbsistatic.com/img/Vb0LWmWH8BH1LM58n-aO6qsK6LE=/756x567/2014/10/03/ee971930-d32a-4471-b98d-18e14fcddcdf/twinpeaks1.jpg", "https://cnet4.cbsistatic.com/img/nfHgeKhTbo1wnNV88bkzWmc4jic=/84x84/2019/11/14/a28a2e58-35d7-4cc9-b64d-eb95a5c85e87/bonbraids.jpg"], "top_img": "https://cnet3.cbsistatic.com/img/Vb0LWmWH8BH1LM58n-aO6qsK6LE=/756x567/2014/10/03/ee971930-d32a-4471-b98d-18e14fcddcdf/twinpeaks1.jpg", "keywords": [], "authors": ["Bonnie Burton"], "canonical_link": "https://www.cnet.com/news/twin-peaks-david-lynch-laura-palmer-showtime-complete-guide/", "title": "'Twin Peaks' is back: Here's everything you need to know", "meta_data": {"theme-color": "#B80000", "author": "Bonnie Burton", "description": "Here's every hair-whitening, mind-bending, pie-swallowing thing you need to know about \"Twin Peaks.\" Warning: spoilers!", "og": {"site_name": "CNET", "title": "Everything you need to know to go back to 'Twin Peaks'", "description": "Here's every hair-whitening, mind-bending, pie-swallowing thing you need to know about \"Twin Peaks.\" Warning: spoilers!", "image": "https://cnet3.cbsistatic.com/img/Vb0LWmWH8BH1LM58n-aO6qsK6LE=/756x567/2014/10/03/ee971930-d32a-4471-b98d-18e14fcddcdf/twinpeaks1.jpg", "type": "article", "url": "https://www.cnet.com/news/twin-peaks-david-lynch-laura-palmer-showtime-complete-guide/"}, "msapplication-task": "name=Forums; action-uri=http://forums.cnet.com/; icon-uri=https://www.cnet.com/favicon.ico", "msapplication-TileImage": "https://cnet4.cbsistatic.com/fly/bundles/cnetcss/images/core/icon/mstile-144.png", "msapplication-square70x70logo": "https://cnet2.cbsistatic.com/fly/bundles/cnetcss/images/core/icon/mstile-70.png", "msapplication-square150x150logo": "https://cnet4.cbsistatic.com/fly/bundles/cnetcss/images/core/icon/mstile-150.png", "msapplication-wide310x150logo": "https://cnet4.cbsistatic.com/fly/bundles/cnetcss/images/core/icon/mstile-310x150.png", "msapplication-square310x310logo": "https://cnet3.cbsistatic.com/fly/bundles/cnetcss/images/core/icon/mstile-310.png", "fb": {"app_id": 16995676698, "admins": 100001036810388, "pages": 7155422274}, "article": {"publisher": "https://www.facebook.com/cnet", "author": "https://www.facebook.com/BonnieBurtonAuthor", "opinion": "false", "content_tier": "free"}, "twitter": {"account_id": 30261067, "card": "summary_large_image", "url": "https://www.cnet.com/news/twin-peaks-david-lynch-laura-palmer-showtime-complete-guide/", "title": "Everything you need to know to go back to 'Twin Peaks'", "description": "Here's every hair-whitening, mind-bending, pie-swallowing thing you need to know about \"Twin Peaks.\" Warning: spoilers!", "image": "https://cnet3.cbsistatic.com/img/Vb0LWmWH8BH1LM58n-aO6qsK6LE=/756x567/2014/10/03/ee971930-d32a-4471-b98d-18e14fcddcdf/twinpeaks1.jpg", "site": "@CNET", "creator": "@bonniegrrl"}, "google-site-verification": "wNWLoFvk5wsdZQ-u75uCNiaHNa7FLFmNtH2t7dZbXmQ", "p": {"domain_verify": "47524839a64b83c951afca9ef6c838e0"}, "msapplication-TileColor": "#ffffff", "msapplication-tooltip": "Product reviews and prices, software downloads, and tech news - CNET", "msapplication-starturl": "https://www.cnet.com/", "msapplication-window": "width=1024;height=768", "msapplication-navbutton-color": "#424244", "viewport": "width=device-width"}, "movies": [], "publish_date": null, "source": "https://www.cnet.com", "summary": ""}