{"url": "https://web.archive.org/web/20081202093502/http://afp.google.com:80/article/ALeqM5i2cTbnZTDVHPcifBpEzmkfqOOtlg", "text": "McCain renews attacks on Obama links to radical\n\nMIAMI, Florida (AFP) — Republican John McCain renewed his attacks on Barack Obama's ties to a 1960s radical here Wednesday as he targeted voters in the key battleground state of Florida.\n\nMcCain, who has refrained from linking Obama to Bill Ayers during recent campaign speeches, went back on the offensive six days before the November 4 polls in an interview with a Spanish-language radio station in Miami.\n\n\"I think this whole issue of the relationship with Bill Ayers needs to be known by the American people,\" he told Radio Mambi. \"Senator Obama said it was just a guy in the neighborhood. We know much more than that.\"\n\nAyers was a member of the \"Weathermen\" movement, classified by the FBI as a \"domestic terrorist organization,\" which carried out a series of attacks to protest the Vietnam War, including on the Pentagon and US Capitol.\n\nObama met Ayers early in his political career in 1995 but his campaign has said he has not spoken by phone or exchanged e-mail messages with him since Obama became US senator in 2005.\n\nMcCain went on to accuse the Los Angeles Times of refusing to publish a video it had obtained of Ayers attending an event with a member of the Palestine Liberation Organization (PLO).\n\n\"I don't care much about an old, washed-up unrepentant terrorist, and his wife who was on an FBI top 10 wanted list,\" McCain said.\n\n\"But we should know about their relationship, including apparently information that is held by the Los Angeles Times concerning an event that Mr Ayers attended with a PLO spokesman.\"\n\nMcCain appeared to be referring to a Los Angeles Times article from April which said Obama knew and attended a farewell party for Rashid Khalidi, a former PLO spokesman, during his academic career in Chicago. The article makes no mention of Ayers's presence at the event.\n\n\"The Los Angeles Times refuses to make that videotape public. I'm not in the business of talking about media bias but what if there was a tape with John McCain with a neo-Nazi outfit being held by some media outlet?\n\n\"I think the treatment of the issue would be slightly different,\" he said, saying Ayers had a \"long relationship\" with Obama, who was eight years old when the Weathermen were waging their radical campaign.\n\n\"It's not that Barack Obama was eight years old when Mr Ayers was committing acts of terror, it's all about the long relationship on foundations, for his book and launching his political career in Mr Ayers living room,\" McCain said.\n\nThe interview was one of several given by the 72-year-old senator to local radio in Miami as he attempts to woo the influential Hispanic vote in Florida , a state he almost certainly must win in order to take the White House.\n\nLater McCain took aim at recent comments by former Cuba president Fidel Castro, who had ridiculed the former pilot's low grades at naval academy.\n\n\"I notice in the past couple of days that Fidel has made his preferences known in the campaign and had some very unkind things to say about me,\" McCain said. \"My feelings are hurt.\"\n\nMore than one million Cuban-Americans live in Florida, and McCain said he was acutely aware of the group's possible influence in the election race.\n\nHe attempted to tap into anti-Castro sentiment by vowing to \"restore freedom and democracy\" on the island, criticizing Obama for advocating a policy of diplomatic engagement.\n\n\"I think we all know that the Cuban-American vote can be vital to whether I win Florida or not,\" McCain said. \"So I do want to say again that we will never waver in our mission to restore freedom and democracy.", "images": ["https://web.archive.org/web/20081202093502im_/http://afp.google.com/media/ALeqM5g985RNRZkgsvvvjqMNgBzikRwYMQ?size=s", "https://web.archive.org/web/20081202093502im_/http://afp.google.com/hostednews/img/google-logo-hosted.gif", "https://web.archive.org/web/20081202093502im_/http://afp.google.com/hostednews/img/afp_logo.gif?hl=en", "https://web.archive.org/web/20081202093502im_/http://afp.google.com/hostednews/img/vertical-space.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "AFP: McCain renews attacks on Obama links to radical", "meta_data": {"googlebot": "noarchive"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}