{"url": "https://medium.com/@bobcrane_55517/breaking-news-fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents-bc33994a4286", "text": "Breaking News: FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents\n\nAnonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump is an agent of the FSB (formerly the KGB). An unknown portion of these voters may have had their minds controlled by a Russian space-beam, agents close to the investigation say.\n\nThe allegation that 62 million Americans appear to be employed by Russian intelligence services has rocked the Bureau, and it is reported that multiple agents have taken their own lives, given that realizing just how deep this Russian hacking conspiracy runs blew their minds — literally.\n\nThis shocking new revelation comes after it was confirmed as a fact that Russia did Wikileaks because Donald Trump personally called Vladimir Putin and asked him to. It was also revealed earlier this week that Alex Jones (real name “Alexi Jonesinov”) is a Russian sleeper agent who was ordered by the FSB (formerly the KGB) to post news articles on the internet saying that Donald Trump would be a good President.\n\nHowever, the revelation that 62 million Americans are taking orders directly from the Kremlin is a revelation of a whole other order, which FBI agents are struggling with how to deal with.\n\nIt was determined by Puerto Rican federal judge Mizu Tomazaki that it is a crime to support Donald Trump or to post positive things about him on the internet. 9th circuit judges Weinberg, Steinman and Goldenstein upheld the ruling. Despite this, the logistics of rounding up 62 million people and locking them in prison present a difficult task to overcome.\n\nIt may also be that not every voter is a direct agent of the FSB (formerly the KGB), and some may have been under the control of a mind control beam in space.\n\n“We have not determined for sure that everyone who voted for Trump was paid directly by the Kremlin, given that it is highly possible that the Russians used a space-beam from a satellite to control their brains from a facility in St. Petersburg, and moved their bodies like puppets to the polls to check the Trump box,” one current agent familiar with the investigation told the times, describing the process of using a satellite-mounted space-beam to control people’s actions as “Russian neuro-brain hacking.”\n\nWhen asked for comment on these reports by The Times, Kremlin Spokesman Dmitry Peskov said the allegations of space-beam mind control by the FSB (formerly the KGB) were “ridiculous,” “outrageous” and “goofy.” However, Peskov suspiciously asked “vere is Moose and Squirrel?”\n\nNSA chief Mike Rogers said that though it is a well-established fact that going all the way back to Soviet times, the Russians have used space-beams to control people’s brains, he’s “never seen anything on this scale before.”\n\nThe Times also sought comment from President Trump; however, when asked about these allegations, he began screaming in Russian and jumped in a big truck and drove off down the road.\n\nYou are all nuts…almost 1/2 of America voted to make Trump the legal president, and you keep teling us we don’t matter. Install Hillary by force or some other act of politics, and you will have a civil war on your hands. And just in case you haven’t noticed, Trump’s people have most of the guns.", "images": ["https://miro.medium.com/fit/c/160/160/0*z2fZ_AZMwya0CYRu.", "https://miro.medium.com/fit/c/96/96/0*z2fZ_AZMwya0CYRu.", "https://cdn-images-1.medium.com/fit/c/152/152/1*8I-HPL0bfoIzGied-dzOvA.png"], "top_img": "https://cdn-images-1.medium.com/fit/c/152/152/1*8I-HPL0bfoIzGied-dzOvA.png", "keywords": [], "authors": ["Robert Crane"], "canonical_link": "https://medium.com/@bobcrane_55517/breaking-news-fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents-bc33994a4286", "title": "Breaking News: FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/bc33994a4286"}}, "title": "Breaking News: FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents", "site": "@Medium", "description": "Anonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump…", "card": "summary", "label1": "Reading time", "data1": "3 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/bc33994a4286"}, "android": {"package": "com.medium.reader", "url": "medium://p/bc33994a4286", "app_name": "Medium"}, "web": {"url": "https://medium.com/@bobcrane_55517/breaking-news-fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents-bc33994a4286"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "Breaking News: FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents", "description": "Anonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump…", "url": "https://medium.com/@bobcrane_55517/breaking-news-fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents-bc33994a4286"}, "article": {"published_time": "2017-07-17T13:06:07.681Z", "author": "https://medium.com/@bobcrane_55517"}, "title": "Breaking News: FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents", "description": "Anonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump is an agent of the FSB (formerly the KGB). An unknown…", "author": "Robert Crane", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "bc33994a4286"}, "movies": [], "publish_date": 1500296767.681, "source": "https://medium.com", "summary": ""}