{"url": "www.etonline.com/why-brad-pitt-is-not-looking-to-leap-into-a-serious-relationship-right-now-exclusive-105042", "text": "Brad Pitt is solely focusing on his family and work.\n\nA source tells ET that the 54-year-old actor is “in a great place personally and professionally” as he heads back to the set of his upcoming movie, Once Upon a Time in Hollywood, after recently spending time with his six kids in London.\n\n“He’s happy to be back in Los Angeles filming,” the source says. “He’s good-natured and professional on set. He is warm and authentic with everyone around. When he isn’t filming, he spends most of his time away in his trailer.”\n\nThe source notes that Pitt’s children with Angelina Jolie -- Maddox, Pax, Zahara, Shiloh, and the twins Knox and Vivienne -- have not visited their father during the film's production. In August, when Pitt was filming Ad Astra, a source told ET, “He's a movie star in the best way, prepared, on time and friendly. All the things you want a person to be… he is that. He's always ready to work.”\n\nThe Real Story Behind Brad Pitt's Relationship With MIT Professor Neri Oxman This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart The Real Story Behind Brad Pitt's Relationship With MIT Professor Neri Oxman\n\nAs far as dating goes, despite continued reports that Pitt is dating Massachusetts Institute of Technology professor Neri Oxman, the source assures ET that he is single.\n\n“He has gone on dates but he’s not looking to leap into a serious relationship at the moment,\" the source reveals. \"He is content on his own and enjoys the quality time he spends with the children when he isn’t working.\"\n\nThe source adds that Pitt “is focused on two of the most important things he should be focused on, and those are his children and his work. Being a father is his number one job and he knows that. He will always be there for those children.”\n\nAdditionally, the source also mentions that when Pitt is not with the kids or on the set, “He’s spending more time out and about socializing with his close friends, but he also is still a homebody and appreciates hanging around his place.”\n\nInside Brad Pitt and Angelina Jolie's Post-Split Lives This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Inside Brad Pitt and Angelina Jolie's Post-Split Lives\n\nMeanwhile earlier this month, Jolie was ordered by a judge to help repair their children's relationship with their dad. According to court documents obtained by ET, a judge determined that the kids \"not having a relationship with their father is harmful to them.\"\n\nIn addition, the judge determined that it is \"critical that each of them have a healthy and strong relationship\" with both their parents.\n\nSee more in the video below.\n\nRELATED CONTENT:\n\nAngelina Jolie Ordered to Give Brad Pitt More Time With Kids in New Temporary Custody Agreement\n\nWhy Brad Pitt and Angelina Jolie's New Custody Agreement Is a 'Breakthrough' for Them (Exclusive)\n\nBrad Pitt Is All Smiles While Leaving 'Once Upon a Time in Hollywood' Table Read With Leonardo DiCaprio\n\nAngelina Jolie Ordered to Give Brad Pitt More Time With Kids This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/brad_pitt_926146458_0.jpg?h=79d1e0cd&itok=UvqOhLDG", "http://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-06/gettyimages-988303756.jpg?h=25a2d821&itok=FLVKWkzg", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/brad_pitt_926146458_0.jpg?h=79d1e0cd&itok=UvqOhLDG", "keywords": [], "authors": ["Liz Calvario"], "canonical_link": "https://www.etonline.com/why-brad-pitt-is-not-looking-to-leap-into-a-serious-relationship-right-now-exclusive-105042", "title": "Why Brad Pitt Is 'Not Looking to Leap Into a Serious Relationship' Right Now (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Why Brad Pitt Is 'Not Looking to Leap Into a Serious Relationship' Right Now (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/why-brad-pitt-is-not-looking-to-leap-into-a-serious-relationship-right-now-exclusive-105042", "title": "Why Brad Pitt Is 'Not Looking to Leap Into a Serious Relationship' Right Now (Exclusive)", "description": "A source tells ET that the 54-year-old actor is solely focusing on his kids and work.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/brad_pitt_926146458_0.jpg?h=79d1e0cd&itok=UvqOhLDG", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "A source tells ET that the 54-year-old actor is solely focusing on his kids and work.", "title": "Why Brad Pitt Is 'Not Looking to Leap Into a Serious Relationship' Right Now (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Liz Calvario‍", "url": "https://www.etonline.com/why-brad-pitt-is-not-looking-to-leap-into-a-serious-relationship-right-now-exclusive-105042", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/brad_pitt_926146458_0.jpg?h=79d1e0cd&itok=UvqOhLDG"}, "description": "A source tells ET that the 54-year-old actor is solely focusing on his kids and work.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Brad Pitt", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.etonline.com", "summary": ""}