{"url": "https://en.wikipedia.org/wiki/Second_Wives_Club", "text": "Second Wives Club Genre Reality television Starring Shiva Safai\n\nVeronika Obeng\n\nMorisa Surrey\n\nShawna Craig\n\nKatie Carzorla\n\nTania Mehra Country of origin United States Original language(s) English No. of seasons 1 No. of episodes 8 Production Production location(s) Los Angeles, California Camera setup Multi-camera Running time 42 minutes Production company(s) All3Media Studio Lambert Distributor NBCUniversal International Television Production Release Original network E! Picture format 1080i HDTV Original release May 4 –\n\nJune 12, 2017 External links Website\n\nSecond Wives Club is an American reality television series that premiered on the E! Network on May 4, 2017. The show documents the personal and professional lives of a group of several women who are already or are to become the second, third, fourth or fifth wives of wealthy and successful men.\n\nCast [ edit ]\n\nGuest Appearances [ edit ]\n\nEli Hammond - Himself, (a Certified Family Law Specialist, from Claery & Hammond, LLP.) Note: Attorney Hammond appeared as a guest on Second Wives Club, Season one, Episode 8, \"Game Over\".[7]\n\nProduction [ edit ]\n\nThe show was announced and production began in 2015. Since then, it has undergone name changes but is now officially called Second Wives Club.[8]\n\nThe trailer was released in April 2017. The show premiered on May 4, 2017.\n\nOn October 5, 2017 it was announced the show had ended after one season. A fan asked cast member Katie Cazorla on Twitter if there would be a second season and she stated that \"I think E! is going in a different direction. So we're not coming back. It sucks because we rated well in the end and have awesome fans.\"[9]\n\nEpisodes [ edit ]\n\nNo. in\n\nseries Title Original air date U.S. viewers\n\n(million) 1 \"Don't Save the Date\" May 4, 2017 ( ) N/A 2 \"Mermaid Meltdown\" May 11, 2017 ( ) N/A 3 \"We're Going to Need a Big Boat\" May 18, 2017 ( ) N/A 4 \"Billionaire Matchmaker\" May 25, 2017 ( ) N/A 5 \"Fightin' Words\" June 1, 2017 ( ) N/A 6 \"Unhappy Campers\" June 4, 2017 ( ) N/A 7 \"Trouble in Paradise\" June 11, 2017 ( ) N/A 8 \"Eli Hammond\" June 12, 2017 ( ) N/A\n\nLawsuit [ edit ]\n\nMichael Obeng says his wife Veronika Obeng agreed to do the series which originally was called Second Wives Club in 2015. Michael agreed to participate in the show in hopes to promote his business, and because he thought it would spotlight their happy marriage. Veronika officially filed for divorce in 2016. Michael filed a lawsuit against the network in January 2016. The lawsuit states \"The series was nothing about the couple's happy marriage.\" Obeng claimed that he was required to display an \"unrealistic and manufactured personality\" which could harm his business if the show is allowed to air. In a letter from his lawyer which was sent to E! Entertainment in August 2016, Obeng demanded that his children not to be included in the show. The letter identified the show under a new name Famously Married. Obeng is suing NBCUniversal the parent company of the E! Network. The suit seeks an injunction barring the network from airing or promoting the episode in which Obeng appears.[10]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Second_Wives_Club", "title": "Second Wives Club", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}