{"url": "http://www.nbcnews.com/id/4625213/ns/health-pet_health/t/puppy-love----its-better-you-think/", "text": "Those big brown eyes gazing at you with complete adoration. The cool, wet nose nudging bare feet in the early morning. That tireless wagging tail that symbolizes pure joy in your presence.\n\nWe know that dogs are dedicated companions that offer unquestioning attachment and acceptance. In the past several years, mounting scientific evidence suggests that they benefit us even beyond eager devotion. Numerous studies have shown that dogs -- one of the earliest domesticated animals -- can help lower blood pressure, ease the loneliness of the elderly in nursing homes, and help children overcome allergies.\n\nNow there's new research from the University of Missouri-Columbia suggesting the hormonal changes that occur when humans and dogs interact could help people cope with depression and certain stress-related disorders. Preliminary results from a study show that a few minutes of stroking our pet dog prompts a release of a number of \"feel good\" hormones in humans, including serotonin, prolactin and oxytocin.\n\nIn addition, petting our pooches results in decreased levels of the primary stress hormone cortisol, the adrenal chemical responsible for regulating appetite and cravings for carbohydrates.\n\n\"The notion that serotonin increased with their own dog is a very powerful thing. Could a dog help mediate serotonin levels in order to help depressed patients?\" asks Dr. Rebecca Johnson, a nursing professor and associate director at the Center for Animal Wellness, Missouri University College of Veterinary Medicine, who is heading the study with collaborator Richard Meadows.\n\nWhy does Spot make us feel better?\n\nDog owners may not be surprised to hear about the emotional benefits of stroking a beloved pet, but for researchers like Johnson, it's important to understand why Spot makes us feel better.\n\nTherapy dogs have been used to visit nursing homes, calm traumatized children and help ease pain in people undergoing physical rehabilitation, but the field of animal-assisted therapy is still in its infancy, Johnson says. Researchers are trying to determine which types of people would best benefit from being with pet animals and how often they need to interact with them to get results.\n\nVideo: Pet therapy \"By showing how interacting with pets actually works in the body to help people, we can help animal-assisted therapy become a mainsteam medically-accepted intervention that would be prescribed to patients and, in the long run, be reimbursed by insurance companies,\" says Johnson. The University of Missouri-Columbia study was funded by The Skeeter Foundation, a group headed by Dr. Jack Stephens, founder of Veterinary Pet Insurance, a nationwide insurer of pet medical coverage.\n\nJohnson's study expanded on research conducted in 1999 by South African scientists who found that 15 minutes of quietly stroking a dog caused hormonal changes that were beneficial to both the dog and the human.\n\nBut the South African study was small, involving only 18 people and a few friendly dogs, and didn't test for serotonin, the brain chemical strongly linked with depression. Increased levels of the neurotransmitter serotonin make us more mentally alert, improve sleep and can make us less sensitive to pain.\n\nComparable to eating chocolate\n\nIn the larger Missouri study, 50 dog owners and 50 non-dog owners over the age of 18 sat in a quiet room for 15 to 39 minutes with their own dog, a friendly but strange dog, and a robotic dog. The robotic dog was included because electronic pooches, such as Sony's AIBO, are being studied as a possible resource for the elderly who can't look after a live animal.\n\nEach session involved calm stroking or petting. Researchers checked blood samples of both the humans and dogs at the beginning of each session and monitored their blood pressure every five minutes. The dogs' blood pressure dropped as soon as they were petted. The humans' blood pressure dropped by approximately 10 percent about 15 to 30 minutes after they began petting the animal, at which point blood was again drawn.\n\nJohnson's study found that serotonin levels increased when interacting with the human's own dog, but not with the unfamiliar animal. And serotonin actually decreased when interacting with the robotic dog.\n\nDr. Alan Beck, director of the Center for the Human-Animal Bond at Purdue University, says the serotonin changes reveal the \"mechanism\" of how pets influence our health.\n\n\"It shows that there is a physiological mechanism [to relaxing with a pet], that it really is comparable to other things we know cause relaxation, like eating chocolate,\" says Beck.\n\nNot just learned behavior\n\nIn other words, the warm feeling we get from our dogs and other pets isn't just a learned behavior, Beck says, but something that's hard-wired into humans so that the presence of animals can help us stay well and even recover from illnesses.\n\nIt's a theory that's been gaining notable scientific support for some time:\n\nIn 1995, Erika Friedman at the University of Maryland Hospital conducted a study involving 392 people, which found that heart attack patients with dogs were eight times more likely to be alive a year later than people without dogs.\n\nIn 1999, the State University of New York at Buffalo conducted a study involving 24 stock brokers taking medication for high blood pressure. The researchers found that adding a dog or cat to the stock brokers' lives helped stabilize and reduce their stress levels.\n\nIn 1999, Swedish researchers reported that children exposed to pets during the first year of life had fewer allergies and less asthma.\n\nRecently, separate studies reported that walking a dog contributed to a person's weight loss and that dog walking can be a catalyst for social interaction with other people, a benefit that can help improve our sense of well-being -- or even help us meet a future spouse.\n\nStudies involving other pets\n\nWhile Johnson doesn't advise patients to throw away their antidepressants and instead get a dog, she says animal therapy could be used as an adjunct to depression treatment.\n\n\"It gives us answers about who would be the most likely to benefit from owning a dog or how often someone would need to visit with a dog to get the beneficial effect,\" she says.\n\nAnd it's not just dogs that are being studied for their therapeutic power. Currently Beck and other researchers at the Center for the Human-Animal Bond, in conjunction with the National Science Foundation and the University of Washington, are exploring how the \"inborn attraction to nature\" can help patients with dementia. For instance, people with Alzheimer's disease often suffer from weight-loss problems because they're unable to focus long enough to eat. But when they sit in front of aquariums with brightly colored fish, the elderly patients are able to pay attention long enough to get their meals down.\n\nAs scientific research continues to validate the importance of animals to human health, Beck expects to see more community funding for public dog runs, for example, as well as more widespread acceptance of animal care as a legitimate healthcare expense.He also hopes more insurance policies will begin offering coverage for services such as veterinary care for pets of the elderly, and that eventually pet owners will receive insurance discounts similar to the deals given to non-smokers.\n\nJust as we recognize that exercise is important to our health, it's becoming clearer that animals can also improve the quality of our lives, Beck says.\n\n\"We still haven't realized that [owning a pet] isn't just some kind of hobby.\"", "images": ["http://www.polls.newsvine.com/_vine/images/av/60x60/vine.jpg", "http://media4.s-nbcnews.com/j/MSNBC/Components/Video/__NEW/__News%20Channel/nc_nascar0408a_500kmsnbc_120408.thumb-m.jpg", "http://media1.s-nbcnews.com/j/MSNBC/Components/Video/tdy_fat_cat_120603.thumb-m.jpg", "http://media1.s-nbcnews.com/j/MSNBC/Components/Photo/_new/tdy-130514-jolie-bertrand.grid-2x2.jpg", "http://ad.doubleclick.net/activity;src=2183402;type=count651;cat=msnbc778;ord=1;num=1", "http://media4.s-nbcnews.com/j/msnbc/Components/Photos/040330/040330_petbond_hmed10a.standard.jpg", "http://media2.s-nbcnews.com/j/MSNBC/Components/Video/__NEW/__News%20Channel/nc_fatdog0413_500kmsnbc_120413.thumb-m.jpg", "http://media3.s-nbcnews.com/j/MSNBC/Components/Video/__NEW/__News%20Channel/nc_petsp0409_500kmsnbc_120409.thumb-m.jpg", "http://media3.s-nbcnews.com/j/MSNBC/Components/Photo/_new/100716-bulldog-plane.thumb-s.jpg", "http://media4.s-nbcnews.com/j/msnbc/Components/Photos/040330/040330_petbond_hmed10a.grid-6x2.jpg"], "top_img": "http://media4.s-nbcnews.com/j/msnbc/Components/Photos/040330/040330_petbond_hmed10a.standard.jpg", "keywords": [], "authors": ["Jane Weaver"], "canonical_link": "http://www.nbcnews.com/id/4625213/ns/health-pet_health/t/puppy-love----its-better-you-think/", "title": "Puppy love -- it's better than you think", "meta_data": {"generator": "SkyPad Rendering", "viewport": "width = 1030", "og": {"url": "http://www.nbcnews.com/id/4625213/ns/health-pet_health/t/puppy-love----its-better-you-think/", "title": "Puppy love -- it's better than you think", "site_name": "msnbc.com", "type": "article", "image": "http://media4.s-nbcnews.com/j/msnbc/Components/Photos/040330/040330_petbond_hmed10a.standard.jpg", "description": "It's well-known that pets, especially dogs, offer their owners many health benefits.  Now there's new research suggesting that the hormonal changes that occur when humans and their dogs interact could help people cope with depression."}, "title": "Puppy love -- it's better than you think  - Health - Pet health - msnbc.com", "article": {"author": "http://www.nbcnews.com/id/32027560/", "section": "Pet health", "modified_time": "2004-04-08T19:06:20", "published_time": "2004-04-08T19:06:20"}, "Search.Image": "/msnbc/Components/Photos/040330/040330_petbond_hmed10a.jpg", "Search.ImageSource": "Anderson Independent-Mail file", "fb": {"app_id": 10150138890205613}, "description": "It's well-known that pets, especially dogs, offer their owners many health benefits.  Now there's new research suggesting that the hormonal changes that occur when humans and their dogs interact could help people cope with depression.", "Search.Update": "Thu, 08 Apr 2004 19:06:20 GMT", "twitter": {"card": "summary", "site": "@NBCNews"}}, "movies": [], "publish_date": 1081422380.0, "source": "http://www.nbcnews.com", "summary": ""}