{"url": "https://www.romper.com/p/chrissy-teigen-shares-why-her-second-pregnancy-is-harder-than-her-first-moms-can-totally-relate-8902692", "text": "Ask any woman who has had multiple kids and she'll tell you that every pregnancy is different. No one carries their baby the same exact way each time, or experiences the same cravings, or aches and pains as before. For Chrissy Teigen, her second pregnancy is \"harder\" than her first for a reason that so many moms of multiple young kids probably will know all too well.\n\nNo, this pregnancy hasn't made Teigen feel more sick or brought on some new weird cravings than when she carried her first child, 2-year-old daughter, Luna. Instead, Teigen recently revealed to E! News that what makes this pregnancy much harder than her first is that she didn't have an adorable and energetic toddler who needed constant attention during her first pregnancy.\n\n\"You realize your second pregnancy is harder because you have a kid already,\" Teigen said during an interview with E! News. Teigen's husband, John Legend, added in the same interview, \"You have to divide your energy between raising a kid and carrying one as well.\"\n\nGiven how adorable and full of personality little Luna seems to be from Teigen's Instagram account, it's probably a bit challenging for Teigen to keep up with her when her energy is already drained from being pregnant.\n\nTeigen isn't alone in thinking the second pregnancy is much harder than the first for this reason. There are so many reasons why moms believe this to be true — a lot of women feel more tired because they have another human to take care of, in addition to caring for the one growing in their stomach, according to Today's Parent.\n\nAnd Legend is right — pregnancy does require a lot of energy from moms, and not just because they're doting on another kid. Pregnant women might experience a lack of energy from hormonal and physical changes that occur, according to the American Pregnancy Association, in addition to the amount of planning that goes into preparing for another child. This can (understandably) leave some women drained. Add a toddler into the mix and you've got a whole new reason to feel exhausted.\n\nBut there are a lot of things different about this second pregnancy for Teigen than her first. For starters, she is expecting a boy, which she announced in January, two months after announcing her pregnancy last November. But since this is her second child, she already has a few items in her house to help with the baby's arrival (unlike her first pregnancy when she had to start from scratch). In an interview with Entertainment Tonight on Tuesday, Teigen joked that her son will be on the receiving end of Luna's hand-me-downs. \"We're kind of just using Luna's old things,\" Teigen said. \"It will be fine.\"\n\nAnother thing that is harder about this pregnancy? In the time that has elapsed since her first pregnancy, Teigen has become an even bigger social media star. Because of this, she has so many more people following her pregnancy, criticizing her decisions, and pestering her about her due date, according to Yahoo!, which has taken its toll on Teigen. According to Yahoo!, Teigen asked her Twitter followers this past week to \"mind their own uteruses\" when talking about her decisions as a pregnant woman and told Instagram commenters that she wanted to \"hide and get this baby ready for the world.\" Can you blame her?\n\nBut once her pregnancy is over, there will be a whole new set of challenges that Teigen will have to deal with — like having two young children in the house. Teigen told E! News last month that she is fearful Luna won't be the best at sharing her things with her baby brother. The good news is, Teigen doesn't have to worry just yet — her baby isn't due until June, according to E! News, giving her plenty of time to give Luna all of her attention (and exhaust herself a bit more) until her baby boy's arrival.\n\nCheck out Romper's new video series, Bearing The Motherload, where disagreeing parents from different sides of an issue sit down with a mediator and talk about how to support (and not judge) each other’s parenting perspectives. New episodes air Mondays on Facebook.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/4/25/515e7bec-273b-4188-8be0-394d0593124b-getty-943530944.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/c1f38a41-bf30-4378-bd69-e4123f2dc68d-getty-980975138.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/4/25/515e7bec-273b-4188-8be0-394d0593124b-getty-943530944.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/2/5dc0d0df-fc94-488a-a43c-802302d67954-getty-929466816.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/25/515e7bec-273b-4188-8be0-394d0593124b-getty-943530944.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/chrissy-teigen-shares-why-her-second-pregnancy-is-harder-than-her-first-moms-can-totally-relate-8902692", "title": "Chrissy Teigen Shares Why Her Second Pregnancy Is \"Harder\" Than Her First, & Moms Can Totally Relate", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/chrissy-teigen-shares-why-her-second-pregnancy-is-harder-than-her-first-moms-can-totally-relate-8902692", "type": "article", "title": "Chrissy Teigen Shares Why Her Second Pregnancy Is \"Harder\" & Moms Can Totally Relate", "description": "Ask any woman who has had multiple kids and she'll tell you that every pregnancy is different. No one carries their baby the same exact way each time, or experiences the same cravings, or aches and pains as before. For Chrissy Teigen, her second…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/25/515e7bec-273b-4188-8be0-394d0593124b-getty-943530944.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "Ask any woman who has had multiple kids and she'll tell you that every pregnancy is different. No one carries their baby the same exact way each time, or experiences the same cravings, or aches and pains as before. For Chrissy Teigen, her second…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}