{"url": "https://www.wrestlinginc.com/news/2017/05/total-divas-season-finale-recap-626066/", "text": "Total Divas On The E Network\n\nSeason 6 Episode 16: \"Total Summerslam\"\n\nBehind the scenes of the most epic Summerslam ever. Watch the #TotalDivas season finale WEDNESDAY at 9|8c, only on E! pic.twitter.com/higzC5aFZM \u0097 Total Divas (@TotalDivas) May 8, 2017\n\n\n\nHere is the synopsis for the season finale of 'Total Divas':\n\nThe Superstars take New York by storm during Summerslam week; Nicole comes to terms with not being able to make the comeback of her dreams; SummerSlam gets thrown into disarray when Eva becomes suspended days before the event.\n\nA quote from Nikki Bella appears on screen to start the show. It reads: \"Anything That I Accomplish, Everyone Assumes It's Because She's John Cena's Girlfriend\"\n\nThe episode begins in Brooklyn, New York at The Barclays Center for SummerSlam. Natalya and Naomi are backstage discussing their match. They haven't been told by WWE management, who their mystery partner will be tonight for their 6 woman tag team match..... The show then flashes back to 2 weeks prior to SummerSlam..... We are first taken to Maryse & The Miz's home in California. The married couple are in their backyard. Miz is using his leaf blower and Maryse asks him to use it on her, so that she can take a better selfie. Miz obliges and then Maryse returns the favor for her husband. In between their silliness, Maryse suggests that they throw one of their trademark \"Chateau MarMiz\" parties in New York during SummerSlam week. The couple have a history of throwing extravagant theme driven parties in the past. The Miz likes his wife's idea and is curious about what the theme of this party could end up being.\n\nTrue love is helping your girl get the perfect selfie. #TotalDivas pic.twitter.com/iAtfxPtt7P \u0097 Total Divas (@TotalDivas) May 11, 2017\n\n\n\n\n\n\n\nThe next scene takes place at Nicole and John Cena's beach house in San Diego. Brie is with her sister. Nikki tells her that she was going to go to WWE television to see if they needed her. Instead, Nikki was informed by the WWE's VP of Talent Relations, Mark Carrano that she probably won't be needed until after SummerSlam. Nikki feels like she has been forgotten by the company. Brie tries to reassure Nikki, that the WWE is probably just being cautious with her because of her neck injury.\n\nAt Smackdown Live in Austin, Texas. Renee Young, Eva, Natalya, Naomi and Maryse are shown arriving to the arena. Renee talks about how close they are to SummerSlam and how important these upcoming shows are..... Maryse is seen talking to Natalya in catering. She suggests that since the talent is off on a Saturday, that she would like to throw another one of her \"MarMiz\" parties. Both women go over potential themes for the party. Natalya ends up suggesting a prom theme. Nattie says that she was never invited to her own prom, so she would love to actually go to one. Maryse loves the idea and is all for it. She thinks that it would be great for everyone to go back to when they were 18 years old. Later on, Nattie and Maryse meet up with the other superstars in catering. They tell them about the prom themed party. Maryse asks Miz to the prom. He jokingly boasts that he went to the prom twice. When Dolph Ziggler overhears the conversation, He asks if he can bring his cousin to the prom, like he did in high school. Renee and the women get a kick out of Dolph's joke, which Ziggler claims really happened.\n\nLater on that evening at the final Smackdown Live before SummerSlam. Natalya is shown in ring teaming up with Alexa Bliss against Becky Lynch and Carmella. Nattie is scheduled to team with Bliss and Eva Marie at SummerSlam against Lynch, Naomi and Carmella. During this Smackdown match, Eva Marie's music plays and she makes her way to the ring. Naomi runs out and chases Eva Marie around the ring.... Off screen, Eva Marie talks about how happy she is about her upcoming involvement in SummerSlam. How just a year ago, she was sent down to developmental. Eva talks about the pressure that she is feeling right now.\n\nJust millions of people, in hundreds of countries, watching your every move. NBD. ?? #TotalDivas pic.twitter.com/2Lup2PxHQT \u0097 Total Divas (@TotalDivas) May 11, 2017\n\n\n\nAt SummerSlam weekend in New York City. The WWE superstars are seen checking into a hotel. Some fans mob them outside for autographs. The Big Show plays a prank on Miz and lifts up his car while he is still in it.... Lana off screen talks about how SummerSlam has become the second biggest show of the year for the company and how excited she is... Later on that day, Mike and Maryse head out to lunch. Maryse wants to know if her husband is still on board with her prom themed party. Miz admits that he thought that she was joking about the concept. Maryse ends up telling Miz, that she was dumped by her boyfriend two hours before she was scheduled to go to the prom. This story by Maryse motivates her husband and Miz asks her to go to the prom with him. Miz is on board with the concept now and Maryse texts all her friends, to let them know that the prom party is on. When Maryse checks her phone, She sees that the news has just broken on WrestlingInc.com that Eva Marie has failed her wellness test. Eva Marie has been sent home and will not be a part of SummerSlam. Maryse and Miz are shocked with the news. Miz says that Eva Marie was doing so well. Maryse calls it horrible timing and is stunned because Eva doesn't drink or do drugs.\n\nWe now check in with Eva Marie at the hotel in New York. Eva is seen in the hotel lobby telling someone, that she is not ready to be filmed. She walks out of the hotel and storms into her car..... When the show returns from the break, Eva Marie comments on her suspension. She says that she can't even describe how she feels at the moment. Eva says that she has been on a certain prescription medication that wasn't approved by the WWE's wellness policy. Eva claims that she has been on the medication since high school and that she failed the wellness test because the paperwork to get permission to take this unnamed medication, was not received by the WWE before she was tested. So in essence, Eva failed the test because she had a banned substance in her system and didn't have the WWE clear her to take it. Eva says that her suspension is heartbreaking but she promises that she will be clean and back in 30 days when her suspension expires. \"See You In 30 Days\" is the direct quote from Eva Marie..... That didn't go according to plan.\n\n\n\nLana is now shown meeting up in the hotel lobby with Brie Bella and Daniel Bryan. Lana tells Brie that she is going shopping with Naomi for Maryse's prom party. She then informs Brie about Eva Marie's suspension. Brie and Bryan are both shocked. Brie off screen says that the WWE is very strict and that she feels bad for Eva..... Later on, Lana is shown with her sister Hadassah in the city. Lana actually tells her sister about Eva's suspension and how it could potentially be an opening for her. How the 6 women's tag match just lost a \"bad guy\" and that Lana feels that she could be a replacement for Eva Marie in that match. Despite being on a different brand... Lana says that she is the \"baddest of the bad guys\" on the roster and would be a great replacement.\n\n\n\nBrie and Bryan are now shown in a restaurant in New York. Brie talks about being surrounded by pregnant women and how she is still not pregnant yet.... This was obviously filmed over 9 months ago and the word's already out on this. Brie Bella gave birth last night to her new daughter Birdie. Congrats to her and Bryan Danielson. With a name like Birdie, She's destined for a career in the ring. Just don't steal Koko's gimmick.\n\nCongrats to Superstar parents Brie Bella and Daniel Bryan! Birdie is one very lucky baby! ?? ?? pic.twitter.com/PLm7VcZ7qO \u0097 Total Bellas (@Total_Bellas) May 10, 2017\n\n\n\nBack to this show, During Brie and Bryan's conversation at lunch. Brie asks Daniel for a favor. She asks him if he can suggest Nikki being used at SummerSlam. Bryan promises to bring it up to the writers on the creative team. Brie is happy that she can help Nikki with her career.\n\nBack to Lana, She's shopping for Maryse's prom. Lana tries on some dresses but comes up with the idea of being different and wearing a tuxedo at the prom. Naomi joins Lana and her sister. Lana tells Naomi that she is going to be wearing a tuxedo because there will be a break dancing competition at the prom. Lana then challenges Naomi to a dance off at the prom. Naomi laughs at Lana's bragging and is looking forward to beating her. Naomi says that she has trained for 10 years in tap, dance, jazz, hip hop and ballet and that she is not scared of Lana.\n\nThe Bella sisters are now together. They are indulging in sweets at a local bakery. Nikki is in New York to do promotional work for the WWE. Brie informs Nikki that she asked Daniel Bryan to put in a word for her with the creative team, to get her used at SummerSlam. Nikki does not respond well to this. She gets upset with Brie and tells her to not interfere with her career. Nikki fears that it will make her look bad with the company, by having her brother in-law Bryan push for her to be used. Nikki says that she doesn't need people's help to get on the show. Brie thinks that Nikki is being ungrateful because she was just looking out for her.\n\nLana, Renee Young, Natalya, Alicia Fox, Naomi, Alexa Bliss and Summer Rae are all together at a Tapout Fitness club in New York. They are all scheduled to be there as part of an promotional appearance leading into SummerSlam. The women are supposed to lead the members of the gym in a workout. Lana sees this as a chance to train and prepare for her dance challenge with Naomi at the prom..... Naomi is shown off screen, She talks about Eva's suspension and the mystery surrounding who will replace her at SummerSlam in the six person match. Naomi hears that Lana could be a possibility. Back to the club, Lana trash talks Naomi about their upcoming challenge. Naomi says that she is going to have a dance partner in Jon. Lana picks Natalya for her team and says that she is so good that she will train Nattie to dance well.... Later on Lana takes Natalya to a studio to give her some dance training. Nattie gets on Lana's nerves for having no structure and dancing so poorly during the session.\n\nDancing is like 95% confidence, right' Nattie's busting an (awkward) move on #TotalDivas TOMORROW! pic.twitter.com/tv4dCxM1Gj \u0097 Total Divas (@TotalDivas) May 9, 2017\n\n\n\nDaniel Bryan and Brie Bella are in their hotel room. Brie tells Bryan about the argument, she had with Nikki earlier in the day. Brie tells Bryan that Nikki wasn't happy that she was interfering with her career. Bryan says that he was under the impression that Nikki told Brie to ask him to make a pitch to management. After talking it over, Bryan gets Brie to admit that she was wrong in this situation. How he would not have liked it if Nikki had John Cena ask management to make Bryan the GM of Smackdown Live. Brie sees the error in her ways and promises to apologize to Nikki...... The next day, Brie and Nikki are having a business meeting for their brand \"Birdie Bee\". Brie ends up apologizing to Nikki for interfering with her career. Nikki explains to her sister that she already gets a lot of heat because of her relationship with John Cena. How people hate on her because they think, she has only had success because of him. Nikki doesn't want Brie to add to that perception. She accepts Brie's apology but tells her to not interfere with her career ever again.\n\nThe Miz and Maryse are now together in their hotel room. Miz shows Maryse the dress, he has bought for her to wear at the prom. He has her try it on and then opens up a box of gloves for her to wear with the dress. Miz slams the box shut on Maryse's hand. This cracks her up. Miz says that he just \"Pretty Womaned\" her.\n\n\n\nLater on, Everyone arrives for the Miz and Maryse's prom party. Maria Menounos is one of the guests at the party. Some WWE superstars and employees are on hand for this \"2016 Prom\" like The Big Show and Dana Brooke. The Miz has gone all out with the theme by having a photo area and things like ice sculptures. The Miz has even hired a principal for this prom and it's Dennis Haskins. Known as \"Mr. Belding\" from Saved By The Bell fame.\n\n\n\n\"Mr. Belding\" mentions how Mike told him that Maryse was dumped on the night of her original prom. Belding says that tonight, they are going to announce a prom king and queen. He shows the ballot box for the vote and Jimmy Uso starts trying to rig it by voting for himself multiple times when everyone isn't looking. A pretty funny video montage follows using the Saved By The Bell opening theme with clips of the cast members dancing and acting goofy. Nattie compares Miz to Zack, Maryse to Kelly and Big Show to Screech..... The dance off begins between Naomi and Jon against Lana and Natalya. Jimmy Uso starts things off \"popping and locking\" and throws in a moonwalk. Nattie barely dances. Lana does her own moonwalk and an impressive looking split. Naomi does her usual dance moves, twerks a bit, dabs and drops Belding's mic. Just for that, she should be disqualified. Mr. Belding rules the dance off a tie. The entire silly sequence can be seen in the video below.\n\nMr. Belding then goes on to announce the prom king and queen. He says that he has found a problem with the votes. With 30 people at the party. Jon has received a mysterious 35 votes all for himself. He is disqualified so The Miz is voted Prom King and Maryse is announced as the Prom Queen.\n\n\n\nWe have now arrived back to SummerSlam. The women don't know who is replacing Eva on the show. Lana asks Becky Lynch if she knows. Becky doesn't know either. Lana hopes that it is her.... 5 of the 6 women are then shown making their ring entrances. The sixth woman is revealed to be Nikki Bella. (Coincidental or not, Nikki replaced Eva Marie just days after the suspension).... Nikki Bella makes her entrance as superstars are shown backstage watching like Shane McMahon and John Cena. Nikki is very happy with the reaction she got. The action is shown from the match with Nikki and Naomi commenting on where they are in their careers right now. The finish of the match is shown with Nikki Bella revealing her new finisher \"Rack Attack 2.0\" on Carmella and pinning her. Backstage the women are greeted with a standing ovation. Brie Bella is backstage and she talks about all the hardship, her sister went through to get to this point and how happy she is for Nikki.\n\n3 weeks later in Phoenix, Arizona. At Brie and Bryan's house. Brie finds out that she is pregnant. Her and Bryan hug and kiss. The episode ends on this note.\n\nA Total Bellas Season 2 trailer airs. In the trailer, The focus is on Brie's pregnancy, Bryan's GM role with the WWE and John Cena's relationship with Nikki Bella. The show is scheduled to return in the fall.", "images": ["http://i1.ytimg.com/vi/vDuefAsztEI/maxresdefault.jpg", "https://www.wrestlinginc.com/assets/ui/images/layout/winc-logo.png", "https://www.wrestlinginc.com/assets/lib/counters/news.asp?newsId=626066", "https://www.wrestlinginc.com/assets/ui/images/general/clear.gif", "https://www.wrestlinginc.com/assets/ui/images/layout/f-logo-s.png", "https://www.wrestlinginc.com/assets/ui/images/footer/google-play.png", "https://cdn.relaymedia.com/ping?url=https%3A%2F%2Fwww%2EWrestlingInc%2Ecom%2Fnews%2F2017%2F05%2Ftotal%2Ddivas%2Dseason%2Dfinale%2Drecap%2D626066%2F", "https://www.wrestlinginc.com/assets/ui/images/footer/ios-app.png", "https://c.statcounter.com/256370/0//1/"], "top_img": "http://i1.ytimg.com/vi/vDuefAsztEI/maxresdefault.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.WrestlingInc.com/news/2017/05/total-divas-season-finale-recap-626066/", "title": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "title": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return", "description": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return", "keywords": "eva marie, wwe news, wrestling news", "image": "http://i1.ytimg.com/vi/vDuefAsztEI/maxresdefault.jpg", "medium": "article", "article": {"published_time": "2017-05-10T20:29:31 -0400", "tag": "eva marie, wwe news, wrestling news"}, "og": {"type": "article", "site_name": "Wrestling Inc.", "image": "http://i1.ytimg.com/vi/vDuefAsztEI/maxresdefault.jpg", "url": "https://www.WrestlingInc.com/news/2017/05/total-divas-season-finale-recap-626066/", "title": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return - Wrestling Inc.", "description": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return"}, "fb": {"app_id": 123325808288224, "pages": 225021057526395}, "twitter": {"site": "@WrestlingINC", "url": "https://www.WrestlingInc.com/news/2017/05/total-divas-season-finale-recap-626066/", "title": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return", "description": "Total Divas Season Finale Recap (5/10): Eva Marie's Suspension, Brie's Pregnancy, Nikki's Return", "card": "summary_large_image", "image": "http://i1.ytimg.com/vi/vDuefAsztEI/maxresdefault.jpg", "app": {"name": {"iphone": "Wrestling Inc.", "ipad": "Wrestling Inc.", "googleplay": "Wrestling Inc."}, "id": {"iphone": 1102820164, "ipad": 1102820164, "googleplay": "com.rumble.wrestlinginc"}}}, "msapplication-TileImage": "/assets/ui/images/icons/icon-144x144.png"}, "movies": ["https://www.youtube.com/embed/xnYOqY30CSo", "https://www.youtube.com/embed/nNB20_AfdLI", "https://www.youtube.com/embed/vDuefAsztEI", "https://www.youtube.com/embed/Eophnx4Z17c", "https://www.youtube.com/embed/XuULhLC3z2I"], "publish_date": 1494462571.0, "source": "https://www.wrestlinginc.com", "summary": ""}