{"url": "https://news.sky.com/story/who-is-jack-brooksbank-princess-eugenies-fiance-11218826", "text": "Princess Eugenie of York will marry Jack Brooksbank on Friday in the second royal wedding of 2018.\n\nMr Brooksbank, 32, was introduced to Eugenie, 28, while they were skiing at the royal hotspot of Verbier in Switzerland in 2010.\n\nHe described it as \"love at first sight\".\n\nWhile on holiday in Nicaragua in January this year, Mr Brooksbank proposed to Eugenie, the youngest daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York.\n\nThe wedding will take place at St George's Chapel in Windsor at 11am this Friday.\n\nAdvertisement\n\nEugenie: An 'incredible' proposal\n\nIn the limelight since birth, a lot is known of Princess Eugenie - but who is Jack Brooksbank?\n\n:: Family\n\nHe is the son of company director and chartered accountant George and his wife Nicola, who are both in their sixties.\n\nMr Brooksbank has a younger brother, Thomas, who is his best man.\n\nHis grandmother on his mother's side, Joanna Newton, 91, told The Sun her grandson was a \"charming boy\" but \"not the most intelligent\". She added that: \"Jack has always had lovely manners and has always been a good egg.\"\n\nSince 2001, the family's home has been an apartment in a gated period conversion in Wandsworth.\n\nMr Brooksbank is reportedly distantly related to Princess Eugenie.\n\nAccording to The Daily Telegraph, the Duchess of York is the great-great granddaughter of Lady Julia Coke, who is the daughter of Mr Brooksbank's great-great grandfather, Thomas Coke.\n\nImage: Mr Brooksbank says meeting Eugenie was 'love at first sight'\n\nHe is well loved by Eugenie's parents, with the Duchess of York posting a black and white photo of the happy couple on the day the engagement was announced, with the caption: \"Total joy!!\"\n\nPrince Andrew, who has said he is \"absolutely overjoyed\" about the pairing, has called Jack \"an absolutely outstanding young man\".\n\nImage: The second royal wedding of 2018 will be held in October\n\n:: Education and work\n\nMr Brooksbank was educated at Stowe School in Buckinghamshire, but he opted not to attend university.\n\nInstead he went straight into the hospitality industry.\n\nHe worked at the Admiral Codrington pub in Chelsea before being poached by Piers Adam, the millionaire owner of some of London's most trendy venues, to join the Chelsea gastropub Markham Inn.\n\nHe spent three years there and was introduced to Prince Harry during that time.\n\nThink Jack said something funny! A post shared by Princess Eugenie (@princesseugenie) on Mar 9, 2018 at 10:42am PST\n\nAmong his other workplaces was Mayfair's Mahiki, but he is now brand ambassador for Casamigos tequila.\n\nCasamigos was founded by actor George Clooney, along with two other men, but was sold last year to Diageo.\n\nMr Brooksbank has previously spoken about an ambition to run his own business, telling the Daily Mail: \"I want to create a chain of pubs.\n\n\"It has been my dream since I was 18.\n\n\"I have fond memories of Sunday roasts in pubs with log fires, and it's something I want to recreate.\"", "images": ["https://e3.365dm.com/18/01/512x512/skynews-princess-eugenie-jack-brooksbank_4212064.jpg", "https://e3.365dm.com/18/01/768x432/skynews-princess-eugenie-jack-brooksbank_4211766.jpg?20180122101331", "https://e3.365dm.com/18/01/768x432/skynews-princess-eugenie-jack-brooksbank_4212069.jpg?20180122165011", "https://e3.365dm.com/18/01/768x432/skynews-princess-eugenie-jack-brooksbank_4211779.jpg?20180914201900", "https://news.sky.com/resources/sky-news-logo.png?v=1?bypass-service-worker", "https://news.sky.com/resources/sky-spectrum-logo.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6035677&cv=2.0&cj=1", "https://e3.365dm.com/18/01/1600x900/skynews-princess-eugenie-jack-brooksbank_4211779.jpg?20180914201900", "https://e3.365dm.com/18/08/768x432/skynews-princess-eugenie-of-york_4378149.jpg?20180802095436"], "top_img": "https://e3.365dm.com/18/01/1600x900/skynews-princess-eugenie-jack-brooksbank_4211779.jpg?20180914201900", "keywords": [], "authors": [], "canonical_link": "https://news.sky.com/story/who-is-jack-brooksbank-princess-eugenies-fiance-11218826", "title": "Who is Jack Brooksbank, Princess Eugenie's fiance?", "meta_data": {"apple-itunes-app": "app-id=316391924", "description": "Jack Brooksbank proposed to Princess Eugenie earlier this year and the pair will marry on Friday after eight years together.", "robots": "NOODP,INDEX,FOLLOW", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "format-detection": "telephone=no", "HandheldFriendly": "True", "twitter": {"card": "summary_large_image", "site": "@skynews", "title": "Who is Jack Brooksbank, Princess Eugenie's fiance?", "description": "Jack Brooksbank proposed to Princess Eugenie earlier this year and the pair will marry on Friday after eight years together.", "image": {"identifier": "https://e3.365dm.com/18/01/768x432/skynews-princess-eugenie-jack-brooksbank_4211779.jpg?20180914201900", "alt": "General views on day three of the Qatar Goodwood Festival at Goodwood Racecourse on July 30, 2015 in Chichester, England."}, "app": {"country": "GB", "id": {"iphone": 316391924, "ipad": 316391924, "googleplay": "com.bskyb.skynews.android"}}}, "fb": {"app_id": 744976955573926}, "og": {"site_name": "Sky News", "locale": "en_GB", "title": "Who is Jack Brooksbank, Princess Eugenie's fiance?", "description": "Jack Brooksbank proposed to Princess Eugenie earlier this year and the pair will marry on Friday after eight years together.", "url": "https://news.sky.com/story/who-is-jack-brooksbank-princess-eugenies-fiance-11218826", "type": "article", "image": "https://e3.365dm.com/18/01/1600x900/skynews-princess-eugenie-jack-brooksbank_4211779.jpg?20180914201900"}}, "movies": [], "publish_date": null, "source": "https://news.sky.com", "summary": ""}