{"url": "https://www.bustle.com/p/famously-single-season-3-could-happen-because-celebrities-have-feelings-too-75842", "text": "The ultimate way celebrities are just like us is that even fame can't guarantee love. And for celebrities who want to figure out why true love has evaded them, there's Famously Single, the reality series that's spent two seasons collecting a group of stars and attempting to give them the skills they need for better romantic relationships. Will Famously Single return for Season 3 with another bunch of lovelorn celebs?\n\nThe series' second season is coming to an end, and the couples that have formed will return to the real world and discover whether or not their unions are strong enough to weather normal life. The show hasn't always had the best track record with helping its participants find lasting love, but at it's core, Famously Single is about them doing the emotional work required to get over the issues that are keeping them away from relationships — and, of course, getting in entertaining arguments with other celebrities along the way.\n\nNow, the only thing to wait for is the word from E!, the network that needs to decide if they want a 2018 edition of the show. In 2016, the network didn't announce Famously Single would return for Season 2 until November, when the series was already filming. Perhaps E! is waiting until Famously Single finalizes a new cast, gets them together, and begins production before announcing the third season. It will be hard to find a group with more challenges than the Season 2 cast, which featured three members who have already been on at least one reality show looking for love before. But the best way to draw new celebrities to Famously Single is to show how much things have improved for the ones who have stayed in the loft and done the show. So, let's see how the Season 2 cast fared.\n\nMalika Haqq\n\nAccording to an interview with E! News, Malika is currently single — her relationship with Ronnie didn't last. And while she said she's looking to date, she also said, \"It's not a quick, instantaneous thing and I just need to take my time.\"\n\nRonnie Magro-Ortiz\n\nSo, his relationship with Malika is done, but it looks like Ronnie is at least open to dating, based on a few suggestive Instagram pics. Hey, he's a single guy, and it doesn't seem like there's any bad blood between the former Jersey Shore star and Malika.\n\nChad Johnson\n\nChad is now dating model Zoe Baron, according to the Instagram accounts of both members of this new couple. Their relationship is still new, but according to Chad's Instagram posts, as of just a week before the Famously Single finale, the two are happily promoting dietary supplements together.\n\nKarina Smirnoff\n\nNeedless to say, Karina's relationship with Chad during the season has not lasted. But Karina arrived at the Famously Single house still smarting from her second broken engagement, and now, she seems a little more confident being single, traveling and spending time with coworkers like hair and makeup artist Boyko Ivanov.\n\nDorothy Wang\n\nSo, after spending most of the season not pursuing anyone and eating constantly (very relatable), Dorothy Wang is still single, according to E! News. Post-show, Dorothy said \"I'm looking for someone that is very driven, that kind of has their own thing going on, that is motivated, hard working, but fun and can also kind of keep my interest.\" Until then, she has an adorable baby neice and the money that makes her a former #Rich Kids of Beverly Hills star to have fun with.\n\nNew York (aka Tiffany Pollard)\n\nShe once had an entire series dedicated to finding a partner, so New York/Tiffany is no stranger to concepts like this one. But since she returned from Famously Single, she does not have a new significant other in sight — though she has gotten a little close with some fellow celebs like Love & Hip Hop's Safaree and reminiscing about rapper Aktion Jackson, who is reportedly Tiffany Pollard's longtime boyfriend, according to The Daily Mail. It's not clear what she meant by this IG post of the two, captioned \"Woke up MISSIN' my dude ... Guess there's some ppl I just CAN'T do [without].\"\n\nDavid Mcintosh\n\nAfter an early hookup with New York, it looks like David left Famously Single still single, and spending most of his time perfecting that impressive physique — though he's not unable to find a date \"to my boys['] movie premiere\" if his male friends fall through, as he captioned the above photo.\n\nCalum Best\n\nSince Season 1 of Famously Single, according to The Sun, Calum broke up with Lindsey Pelas, his now ex-girlfriend, and aside from the odd Instagram post with a fellow reality star like Celebrity Big Brother's Marissa Jade, he seems to be content spending his time playing the field offline.\n\nFor now, Famously Single Season 3 is still uncertain. But so long as celebrities still have problems finding love, just like the rest of us, then there will always be more fodder for additional seasons.", "images": ["https://imgix.bustle.com/uploads/image/2017/8/11/d731a4f5-647d-4a1e-8a2a-0b044265f08d-nup_178850_0635.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/e63196c0-5c55-422a-983e-a47a17c8ee71-getty-1204296980.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/8/11/d731a4f5-647d-4a1e-8a2a-0b044265f08d-nup_178850_0635.JPG?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/cbae4fb9-7857-4a5b-9742-f0ebc0c0e973-153499_3661.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/436a4d24-0503-4050-a54f-0367f1974937-getty-919969056.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/8/11/d731a4f5-647d-4a1e-8a2a-0b044265f08d-nup_178850_0635.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/famously-single-season-3-could-happen-because-celebrities-have-feelings-too-75842", "title": "'Famously Single' Season 3 Could Happen, Because Celebrities Have Feelings Too", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/famously-single-season-3-could-happen-because-celebrities-have-feelings-too-75842", "type": "article", "title": "'Famously Single' Season 3 Could Happen Because Money Can't Buy Love", "description": "The ultimate way celebrities are just like us is that even fame can't guarantee love. And for celebrities who want to figure out why true love has evaded them, there's Famously Single, the reality series that's spent two seasons collecting a group…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/8/11/d731a4f5-647d-4a1e-8a2a-0b044265f08d-nup_178850_0635.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The ultimate way celebrities are just like us is that even fame can't guarantee love. And for celebrities who want to figure out why true love has evaded them, there's Famously Single, the reality series that's spent two seasons collecting a group…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}