{"url": "https://stylecaster.com/bella-thorne-bisexual-dating-girls/", "text": "Sitting down with Bella Thorne, there’s an immediate intimacy that makes an interview feel more like a long talk with a best friend rather than a celebrity. Thorne and I sat together cross-legged on the floor of a soundstage in Los Angeles earlier this year to talk about life, and though girlfriend is only 19 years old, she often comes off as older than her years, thanks to her refreshing honesty.\n\nThe event was to celebrate Thorne’s partnership with SIX:02 and the launch of a video in which Thorne thanks her haters, because, as she put it in the video, “I totally would be here without you, but it wouldn’t be so much fun.”\n\nThorne and I discussed what it’s like to be cyberbullied and her best strategies to survive internet trolls. Turns out, she approaches her haters much like she approaches the rest of her life—with a frankness that cuts straight to the source and doesn’t try to take the easy way out by pretending it’s not happening.\n\nThe “Famous in Love” actress, dressed head to toe in athleisure gear from SIX:02, also went on the record about why it’s so hard to date women, why she’s a strong proponent of the no-makeup selfie, what she does to fall asleep (hint: it may or may not involve weed), and her celebrity girl crushes. If there’s anything I can say definitively about Thorne, it’s that she DGAF what anyone thinks.\n\nSTYLECASTER: Do you always do your own makeup?\n\nBella Thorne: Pretty much on all my films, I do my own makeup. When I go to most events, I do my own makeup. When I did all the “Famous in Love” press, I did all of my shit myself, except my hair. I did my styling myself—I just picked out random shit.\n\n“ Don’t judge me by my Instagram page, because you don’t know me. ”\n\nSC: Do you wear makeup on your days off?\n\nBT: If I can go without wearing makeup, I am not wearing makeup…and I definitely do go out of my way to show people what my skin really looks like.\n\nA lot of times you see people on social and everybody just looks so perfect like, “Oh my god. Look at that girl. How is she even so beautiful? Why aren’t I that pretty?” For me, I’m just like, what you see on social isn’t real. Don’t judge me by my Instagram page, because you don’t know me.\n\nSo I do go out of my way to be like, “Yo, I take off my makeup” and “Look at what I look like in the mirror every day before I put on my makeup and after I take it off.” It’s not great. I struggle with it every day. I feel like most people at some point in their lives go through acne. There’s really nobody that’s like, “Oh, I’ve never had a pimple.” Shut up—yes, you have.\n\nSC: What do you do when you can’t sleep?\n\nBT: When I can’t sleep, I smoke a J. Sometimes I do a lot of night shoots, and I’m going to bed at 8 a.m. And then I’m getting up and I’m working from 4 p.m. until 10 a.m. It totally fucks up my schedule, so when I get back, it’s lights out. Sometimes I can’t fall asleep because my mind’s spinning so fast, so I’ll go and write about it. I’m writing a blog or I’ll write my series, and I’ll put something new that I’m thinking about into there. I just find a way to channel it into something.\n\nSC: You’ve talked about wanting to date girls—how is that going?\n\nBT: It’s so hard. I can’t tell if a girl is trying to be best friends with me or if she wants to get with me or if she just wants social media followers. I’m just so confused when a girl talks to me. Girls can be very flirtatious, so I don’t want to make a move, and then you be like, “Whoa, girl. Not what I was thinking, I don’t roll that way.”\n\nThen it’s so awkward. So I end up usually dating more guys, because with guys, I know if a guy’s hitting me up. They’re not just texting me to be my bestie. I know they want something, of some sort.\n\n“ I can’t tell if a girl is trying to be best friends or if she wants to get with me. ”\n\nI have this girl that’s always, like, “OMG, you’re so gorgeous,” and she’s always hitting on me, and I’m like, “I don’t know. I don’t want to make a move and then you’re, like, ‘Oh, I’m not gay,’ and then I’m, like, ‘Oh, this is so awkward. Nw you feel like I just ruined our friendship because it’s just too weird.’”\n\nI like when girls are upfront with me. This Brazilian girl contacts me on Instagram and she’s, like, “Yo, I wanna date you. Like, I straight up want to fuck with you. Like, I think you’re so hot.” And I was, like, “This is awesome. Hell yeah, this is so cool.” But when a girl just hits me up and they’re like, “OMG, babe. Let’s hang out. You’re so beautiful. Let’s take a Snapchat”—I’m like, “What do you want?”\n\nSC: If you keep putting it out there that you’re open to dating men and women, maybe it’ll get easier as time passes.\n\nBT: If I like somebody, they know. It doesn’t matter if you’re a guy or a girl. I’m always, like, “Yo, I literally would get with you. I will tell you right now. I don’t want to make this awkward, but you are so hot. Please, come up on me. I want to take you on a date.”\n\nOr, I’ll get a lot of girls that randomly write me. I’ve got this one girl that writes me and she’s like, “Hey, I wanna fuck you. Like, hey, come to me baby. What’s up?” I know her through a social setting, and she’s always coming at it so hard, and I’m, like, “Yes, girl, you are just being so upfront, but can we hold up? Can I take you on a date? Because I would really like to do that.” And this girl is, like, “Just come to me, baby. I wanna kiss.”\n\nI’m like, “We can do that, but can I also open the door for you? I wanna take you out.” And some girls are just, like, “No, you can’t,” because a lot of girls are not out, especially if they’re in the industry, which is most of the people that I know. Then they’re, like, “Oh, no. We can’t date. We can hook up.” I’m like, “I don’t hook up with people. I’m not gonna just waste my time here. I want a relationship—what are you doing?”\n\n“ I don’t hook up with people, I’m not gonna just waste my time here. I want a relationship. ”\n\nSC: Who are your girl crushes?\n\nBT: Demi Lovato. That’s an obvious one. I love Demi. We’re close. She’s amazing, just such a beautiful person inside and out. Love everything she stands for. Kristen Stewart—I’m like, “Please.” She’s so hot. Oh. My. God. You put on those fucking Converse, girl. You put on that rock shirt, and you come to mommy. I literally love Kristen Stewart.\n\nWho else is super hot? Oh, Camila Cabello. I think she’s so hot. I just saw her at a party the other night, but she was with a guy, so I wasn’t gonna hit on her because she was with a date.\n\nSC: You can slip into her DMs later.\n\nBT: Seriously! To this person, I was like, “Hey, I follow you on Insta,” and he was, like, “Oh, you want the Insta follow-back?” And I was like, “No, I really just want the DM, if you know what I’m saying, DM me, bro. Come at me.” I’m pretty honest.\n\nSC: Speaking of social media, what would you tell your followers to do if they’re being harassed online?\n\nBT: Everybody goes through bullying. It doesn’t matter what point in your life it is—you will be bullied. You may be bullied throughout your whole entire life, because the world is a mean place, and people like to hate. You got to be open because anybody you talk to is going to say, “You know what, I have experienced that, and here’s what I think about it.”\n\n“ Everybody goes through bullying. It doesn’t matter what point in your life it is—you will be bullied. ”\n\nAnd the more conversation goes on about it, the more positivity you can spread with other people. If that negative experience that’s happened to you can actually help somebody else, that is what is beautiful. That is taking something ugly, and that is saying, “Fuck you, I’m gonna make this happy anyway, and I’m not gonna let it affect me. I’m going to help somebody else somewhere in the world.” Which is what I try to do, and hopefully other people see that on my socials, and they try it too.", "images": ["https://scstylecaster.files.wordpress.com/2015/12/bibi-dietz.jpeg?resize=%2C", "https://scstylecaster.files.wordpress.com/2017/10/thorne2.jpg?w=477&h=670", "https://scstylecaster.files.wordpress.com/2020/04/chris-harrison.png?w=120&h=120&crop=1", "https://scstylecaster.files.wordpress.com/2017/10/bella-thorne-interview.jpg", "https://scstylecaster.files.wordpress.com/2020/03/tiger-king-netflix-1.png?w=120&h=120&crop=1", "https://scstylecaster.files.wordpress.com/2020/04/blackpink-jisoo.jpg?w=120&h=120&crop=1", "https://scstylecaster.files.wordpress.com/2017/10/thorne5.jpg?w=477&h=670", "https://www.facebook.com/tr?id=1130306277008218&ev=PageView&noscript=1", "https://scstylecaster.files.wordpress.com/2017/10/thorne1.jpg?w=477&h=670", "https://scstylecaster.files.wordpress.com/2020/02/prince-harry.png?w=120&h=120&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=stylecaster.com&path=%2Fbella-thorne-bisexual-dating-girls%2F&ct=article&lob=&loc=us&env=desktop&post_id=695151", "https://scstylecaster.files.wordpress.com/2017/10/thorne7.jpg?w=477&h=670"], "top_img": "https://scstylecaster.files.wordpress.com/2017/10/bella-thorne-interview.jpg", "keywords": [], "authors": ["Bibi Deitz"], "canonical_link": "https://stylecaster.com/bella-thorne-bisexual-dating-girls/", "title": "The Relatable Reason Bella Thorne Dates More Men Than Women", "meta_data": {"description": "In an interview with StyleCaster, Bella Thorne opens up about her biggest issue with dating girls as a bisexual, smoking weed to help her fall asleep, why she posts no-makeup selfies on Instagram, and how she overcame her cyberbullies. More here.", "keywords": "bella thorne, bisexual, dating, girls, sex, no makeup, bullying, cyberbullying, weed, marijuana, smoking", "msvalidate.01": "7A34A1C1904BAFB83691E8B3718CA9A2", "article": {"publisher": "https://www.facebook.com/stylecaster", "published_time": "2017-10-05T19:00:53+00:00", "modified_time": "2018-11-04T17:23:50+00:00", "author": "Bibi Deitz", "section": "Entertainment", "tag": "working out"}, "google-site-verification": "yB_5UwT5pPNnn93Mba5HIaFkNtbrafDQWP_Rj34Iw08", "news_keywords": "bella thorne, bullies, celebrity interview, Dating, sleep, working out", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "generator": "WordPress.com", "author": "Bibi Deitz", "application-name": "StyleCaster", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Style News, Fashion Trends & Beauty Tips", "msapplication-task": "name=Subscribe;action-uri=https://stylecaster.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/f95e80beb275448b98a924f84cc3473a?s=16", "onesignal": "wordpress-plugin", "og": {"site_name": "StyleCaster", "type": "article", "locale": "en_US", "url": "https://stylecaster.com/bella-thorne-bisexual-dating-girls/", "title": "The Relatable Reason Bella Thorne Dates More Men Than Women", "description": "The actress talks smoking weed, no-makeup selfies, and why she has trouble dating women.", "image": {"identifier": "https://scstylecaster.files.wordpress.com/2017/10/bella-thorne-interview.jpg", "width": 960, "height": 540}}, "fb": {"app_id": 134683123322801, "pages": 48566051011, "article_style": "scdefault"}, "twitter": {"card": "summary_large_image", "site": "@stylecaster", "creator": "@stylecaster", "title": "The Relatable Reason Bella Thorne Dates More Men Than Women", "description": "The actress talks smoking weed, no-makeup selfies, and why she has trouble dating women.", "image": "https://scstylecaster.files.wordpress.com/2017/10/bella-thorne-interview.jpg", "account_id": 55678606}}, "movies": [], "publish_date": 1507230053.0, "source": "https://stylecaster.com", "summary": ""}