{"url": "www.inquisitr.com/4848172/angelina-jolie-not-demanding-brad-pitt-dump-jennifer-aniston-reports-gossip-cop/", "text": "Angelina Jolie demanding her estranged husband Brad Pitt dump Jennifer Aniston in order to continue seeing his six children is nothing but a bogus claim by a news outlet. The absurd claim made by NW was recently debunked by Gossip Cop.\n\nBrad Pitt, Jennifer Aniston, And Angelina Jolie’s Private Lives\n\nIn September 2016, the entertainment world woke with the news of Brad Pitt and Angelina Jolie parting ways for good. Prior to the release of their official statement, there were rumors that due to Brad’s closeness with Marion Cotillard, Angelina Jolie decided to end her two-year marriage with Pitt. However, that was not the case and Marion herself debunked the false claims.\n\nOver the next few months, there were several reports suggesting Brad was moving on with Sienna Miller and other known Hollywood actresses. Not only this, there were absurd claims by many known media publications that even Angelina Jolie was getting married for the fourth time. Despite all the speculation, Brad Pitt and Angelina Jolie remained single.\n\nEver since Jennifer Aniston announced her separation with Justin Theroux, many speculated that Brad Pitt and Jennifer Aniston will rejoin as a couple. There was a recent claim that suggested Brad Pitt and Jennifer Aniston are reuniting as business partners. However, like always, these claims were later debunked.\n\nFeatured image credit: Jonathan Leibson Getty Images for Audi\n\nEarlier this week, NW falsely claimed that Brad Pitt and Jennifer Aniston secretly got married in Paris. On the magazine’s cover, NW used an old picture of Brad and Angelina, in which the actress’s head is swapped with Jennifer’s. The new photoshopped image allegedly looked like Brad was kissing Jen.\n\n“It’s Jen or the kids.”\n\nAccording to an accompanying article, Angelina Jolie is not at all happy with Brad’s happiness and cannot stand that her six children would be around Jennifer and be calling her stepmom.\n\n“Brad’s assured Jen he’s not taking Ange’s ultimatum seriously. There’s no way a judge would give in to her demands,” asserted the source.\n\nGossip Cop has debunked all these claims and reported that there is nothing going on between Brad Pitt and Jennifer Aniston. The former couple got in touch very casually and occasionally. There has not actually been any confirmation on a Brad-Jen reunion as a couple. Despite all the bogus reports, the only factual accuracy is that Brad Pitt and Angelina Jolie are still working on their divorce settlement, which includes the future of their six children.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/03/brad-pitt-jennifer-aniston-marriage-paris-picture.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2018/03/brad-pitt-angelina-jolie-divorce-news-2018-latest.jpg", "https://secure.gravatar.com/avatar/2796d5da17c476cbb25029169dfc079c?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Viraj Mahajan"], "canonical_link": "https://www.inquisitr.com/4848172/angelina-jolie-not-demanding-brad-pitt-dump-jennifer-aniston-reports-gossip-cop/", "title": "Angelina Jolie Not Demanding Brad Pitt To Dump Jennifer Aniston, Reports ‘Gossip Cop’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}