{"url": "https://www.seventeen.com/celebrity/celebrity-couples/a20661786/bella-hadid-the-weeknd-signs-getting-back-together-cannes-2018/", "text": "When Bella Hadid and The Weeknd broke up, you maybe sorta probs shed a tear. I mean, they were pretty damn cute. And when Abel seemingly moved on with Selena Gomez, people were still rooting for a Bella-and-The-Weeknd reunion.\n\nAnyway, it seems your inkling at a destined make-up has finally become a reality. Here are all of the biggest signs that Bella and The Weeknd are going to be a couple again...\n\n1. They Took the Cutest Selfie While in NYC Together\n\nThe Weeknd and Bella Hadid were having a great time with one another as they hit the Big Apple. The Weeknd was playing at the Global Citizen Festival in Central Park and Bella was right there with him. He posted several pictures from a dinner they were both at together and even sneaked a selfie of the two of them at the end.\n\n2. They Hit Up Kylie's 21st Birthday Together\n\nAin't no party like a Kardashian party and Bella took the perfect date for Kylie's big bash. Bella and The Weeknd were spotted together at the party and there are plenty of cute pics of the two of them together to prove it.\n\nBella and The Weeknd were also spotted together in Chicago for Lollapalooza, where The Weeknd was headlining. Bella was in the crowd supporting her beau and even sang along to some of his biggest hits.\n\n3. Sources Say They're Back Together\n\nAccording to a source from E!, the couple is \"exclusively dating and are in a great place.\" The source went on to say, \"Abel realized once he started dating around, that he actually is still in love with Bella, and they reconnected.\" Aw!\n\nApparently, no one close to the couple is surprised they reunited. \"Everyone around them always knew it was a matter of time, and knew the undeniable bond that they had when they were together,\" said the source. In light of this summer's crazy engagement circus...let the proposal countdown begin!\n\n4. Bella Called The Weeknd Her Muse\n\nThe two are certainly getting very cozy together lately and while they haven't officially confirmed their relationship, Bella is not shying away from rumors. She posted videos of her and The Weeknd as they walked past an art installation.\n\nThe Weeknd was featured in the last one on her Instagram story and she captioned it, \"muse forever.\" If that doesn't mean their back together, then we don't know what does.\n\nInstagram\n\n5. They were spotted together in Tokyo.\n\nIt looks like it's finally happening as the couple were spotted taking in the sights in Tokyo, Japan together. Fans took videos of Bella and The Weeknd as they walked out of a store and checked out arcades throughout Tokyo.\n\nThey don't seem to be hiding their rekindled relationship after The Weeknd posted a video featuring Bella on his Instagram story.\n\nBella still hasn't featured The Weeknd on her page, but it's only a matter of time before she confirms they're back together again.\n\n6. Bella Posted The Weeknd's Lyrics on Instagram\n\nIt looks like Bella just can't get The Weekend out of her mind and it's even more obvious after she posted a new photo of herself from her trip to Italy with some of his lyrics.\n\nThe lyrics \"as long as u know that when I land ur mine\" are from his song \"Pretty\" from his first album, Kiss Land.\n\nIt looks like The Weekend enjoyed the throwback lyrics from his ex as he liked the photo, even though he doesn't currently follow her on Instagram.\n\nInstagram\n\nIt looks like The Weeknd took back the like as it seems like his like doesn't appear anymore, even after searching through the photos likes. What's more interesting though is how he found the photo in the first place. Looks like The Weeknd might be looking at Bella's page more than he would like us to think.\n\n7. Bella and The Weeknd spend a few days cuddled up inside his mansion.\n\nYou don't need to be in the CIA to solve this mystery: Where did Bella Hadid and Abel spend a recent weekend? Well, they spent it together at his mansion, of course! How do we know? Instagram tells no lies.\n\nAbel posted a pic of him standing on the balcony of his stunning mansion with his two dogs looking up lovingly at him. Obvi, this pic is too far away to be taken from a selfie stick.\n\nSo who was behind the camera for this shot?\n\nWell, that answer became obvious once you meandered over to Bella's IG account where she shared a zoomed out version of the same image on her IG stories. Her only addition to the pic: A tiny black heart emoji placed in the center of all the action.\n\nInstagram\n\n8. They went on an official date months ago.\n\nNothing makes it seems like you're back with ex quite like when you're spotted out on a date with them. And the former couple didn't just go for any old dinner date. They went on a dinner date in PARIS, the most romantic city in the world (or so I've heard). A fan took a photo of them at a small restaurant having drinks. Bella couldn't help but beam at The Weeknd. But the creeping fan wasn't the only person to capture the moment. The Weeknd himself shared an Instagram story during their date time.\n\nAnd if you thought that was enough for you to hop aboard the Abella ship, then you'll be happy to know that the two were photographed by paparazzi cuddling in the street. So cute!\n\n9. They totally made out in public.\n\nYour reunion dreams came true in the form of a make-out sesh during a party yesterday in Cannes, France. The two were photographed kissing at the Magnum party and generally being cuddly all night.\n\nSPLASH NEWS\n\nPics show the pair close-talking.\n\nSPLASH NEWS\n\nSPLASH NEWS\n\nOne even captures Bella affectionately touching Abel's face.\n\nSPLASH NEWS\n\nDo you think she's grabbing his face to kiss him again? Or maybe she's just teasing him about something? Whatever the reason, the two certainly look VERY comfortablee touching each other.\n\n10. Their Cannes hang-out went WELL into the evening hours.\n\nE! reports that the couple was photographed leaving together. What do you think that means, huh?\n\n11. Bella and The Weeknd have been secretly hanging out recently.\n\nThis isn't the first time a rumored reunion has come to light. E! reported last month that Hadid and The Weeknd had been \"secretly seeing each other recently\" but weren't official. \"They are just getting back to a good place,\" a source told the outlet. \"She loves hanging out with Abel and they always have fun together and is very hopeful of their future relationship.\"\n\n12. They were totally spotted kissing at Coachella.\n\nJust a few weeks ago, reports came out saying that Bella and The Weeknd were spotted kissing at Coachella, but Bella quickly squashed those comments. On E! News' Instagram post about the rumored smooch, she commented a simple, \"It wasn’t me.\"\n\nInstagrams\n\nUs Weekly originally reported that The Weeknd and Bella \"were completely all over each other\" at the festival. People said they were \"sitting on each other’s laps and all over each other all night long.\"\n\n13. Bella kept her eye on Abel while he was dating Selena Gomez.\n\nRight after The Weeknd and Selena broke up, there was all that stuff with someone who looked like Bella on a Victoria's Secret flight lurking on IG pics of Abe the babe.\n\n14. The Weeknd's song \"Wasted Times\" is likely about Bella.\n\nWhen The Weeknd's song came out, people were CONVINCED that it was all about his relationship with Bella. There's one lyric in particular that seems to point to Bella. “You were equestrian, so ride it like a champion,\" he sings in the song. Bella is an accomplished equestrian. Interestingggggg.\n\nIn the song, he also sings about \"reminiscin' how you felt.\" Then, he goes off about feeling jealous...\n\n\"And now I'm askin', who do you belong to now?\n\nWho you give that love to now?\n\nWho you pullin' up on?\n\nWho you gettin' sprung for now?\n\nAnd what they got that I ain't got?\n\n'Cause I got a lot\"\n\nLooks like Bella and The Weeknd 2.0 is seriously in the works.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Alison Caporimo", "Digital Deputy Editor", "As The Digital Deputy Editor Of Seventeen", "I Help Our Site Director Oversee Content On The Site", "Across All Of Our Social Media Platforms."], "canonical_link": "https://www.seventeen.com/celebrity/celebrity-couples/a20661786/bella-hadid-the-weeknd-signs-getting-back-together-cannes-2018/", "title": "14 Signs Bella Hadid and The Weeknd Are Getting Back Together", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Bella Hadid and The Weeknd Look Super In Love In New Cuddly Instagram Selfie", "description": "They're hitting up the Big Apple together!", "url": "https://www.seventeen.com/celebrity/celebrity-couples/a20661786/bella-hadid-the-weeknd-signs-getting-back-together-cannes-2018/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2018-10-09 05:50:19", "published_time": "2018-10-01 04:24:00", "section": "Celeb Couples", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "14 Signs Bella Hadid and The Weeknd Are Getting Back Together - Bella and The Weeknd Kissing at Cannes 2018", "description": "After months of hanging out, Bella Hadid and The Weeknd are spotted kissing at a party in Cannes, France. Now, she's posting pics on Instagram of Abel's mansion, where she's been spending some serious time. Here are all of the biggest signs that Bella and The Weeknd are going to be a couple again.", "keywords": "bella hadid, bella hadid the weeknd, cannes 2018, bella hadid and the weeknd kissing, bella and abel, bella hadid and the weeknd kiss, bella Hadid and the weeknd back together", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,celebrity-couples", "sailthru.date": "2018-10-01T16:24:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/landscape-1431018408-bella-weeknd-1526050117.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Bella Hadid and The Weeknd Look Super In Love In New Cuddly Instagram Selfie", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1538339040.0, "source": "https://www.seventeen.com", "summary": ""}