{"url": "www.billboard.com/articles/columns/pop/8465069/blake-shelton-gwen-stefani-relationship-timeline", "text": "Blake Shelton (L) and Gwen Stefani attend the 2016 Pre-Grammy Gala and Salute to Industry Icons honoring Irving Azoff at The Beverly Hilton Hotel on Feb. 14, 2016 in Beverly Hills, Calif.\n\nGwen Stefani and Blake Shelton have been going strong for years now. From overcoming hard times together and collaborating on romantic duets to dealing with constant wedding rumors, here's a look at how one of the cutest couples in music came together.\n\nApril 2014: First Encounter\n\nNo Doubt frontwoman-turned-solo star Gwen Stefani joins Adam Levine, Pharrell Williams and Blake Shelton as a coach on The Voice.\n\nNovember 2014: Flirty Friends\n\nStefani posts her first picture with Shelton, a selfie captioned “[heart] him.\"\n\n--him @blakeshelton @nbcthevoice gx A post shared by Gwen Stefani (@gwenstefani) on Nov 25, 2014 at 5:37pm PST\n\nJuly 2015: Blake & Miranda Lambert Divorce\n\nThe stars call it quits after a four-year reign as one of country music's hottest couples. With heavy hearts, they announced, \"We are real people, with real lives, with real families, friends and colleagues. Therefore, we kindly ask for privacy and compassion concerning this very personal matter.\"\n\nAugust 2015: Gwen Splits From Gavin Rossdale\n\nAfter 13 years together, the rocker couple ended their marriage soon after Shelton and Lambert. Their joint statement read, \"While the two of us have come to the mutual decision that we will no longer be partners in marriage, we remain partners in parenthood and are committed to jointly raising our three sons in a happy and healthy environment.\"\n\nSeptember 2015: Another Sweet Selfie\n\nThe pair lean on each other during mutual hard times, relating through the struggle of divorce.\n\n--Gx A post shared by Gwen Stefani (@gwenstefani) on Oct 20, 2016 at 2:07pm PDT\n\nOctober 2015: Clearly Chemistry\n\nStefani and Shelton appear on The Tonight Show Starring Jimmy Fallon and perform a duet rendition of Drake's \"Hotline Bling.\" The performance is packed with chemistry and perhaps some tension in Gwen's voice on the lyric \"late night when you need my love.\"\n\nLater that month, the are-they-or-aren't-they couple are reportedly spotted at George Clooney's Halloween celebration before heading over to Jared Leto's. A source told E! News the pair was holding hands and eventually left together.\n\nNovember 2015: It's Official\n\nA rep for Shelton finally confirms the romance, saying, \"Gwen and Blake are longtime friends who have very recently started dating.\" Stefani later told Ryan Seacrest, \"To be super honest, it is kind of crazy we both went through the same thing at the same time,\" adding that they bonded through their divorces.\n\nJanuary 2016: Horsing Around\n\nOklahoma native Shelton gives Stefani a horse for her birthday. Perks of dating a cowboy. Shelton told ET, \"I got her a horse and I got myself a horse at the same time. Gwen, she loves riding and she loves horses. It's actually so funny that people are so shocked by that, but if you can name me one girl on the planet that doesn't love horses or just thinks that they are beautiful.\"\n\nFebruary 2016: Red-Carpet Debut\n\nGwen and Blake finally make their public debut as a couple at the Vanity Fair 2016 Oscars afterparty. Gwen performed at the event and wowed in red.\n\n@markseliger #vanityfairoscarparty #wow gx A post shared by Gwen Stefani (@gwenstefani) on Mar 1, 2016 at 11:55pm PST\n\nMay 2016: Duet Performance at the Billboard Music Awards\n\nBlake and Gwen beamed in love during a sweet performance of “Go Ahead and Break My Heart” at the BBMAs. They ended the song hand in hand.\n\nJune 2016: Blake Opens Up to Billboard\n\nShelton opened up about heartbreak and new love in his cover-story interview, revealing, “Gwen saved my life. Who else on earth could understand going through a high-profile divorce from another musician? You can’t even imagine the similarities in our divorces.”\n\nSeptember 2016: Rumors Arise\n\nEllen asks Gwen point blank about wedding plans, and the smitten singer simply giggles along saying, \"I'll let you know.\"\n\nFeb 2017: Gwen Gushes Over All Things Blake\n\nOn The Tonight Show Starring Jimmy Fallon, Gwen talks about Shelton's love of the woods and all things camo, plus taking him to Disneyland. She gushes through the entire interview, and it's cute.\n\nOctober 2017: Adam Levine Weighs In\n\nLevine told Howard Stern the couple was “so in love it's disgusting.” The Maroon 5 singer added, “It's so funny. They found each other at really interesting times in their lives. It's really beautiful. Because it's in the public eye, a lot of people want to have their own bullshit opinions about it, but I'm, like, there. I see it every day. I have a pretty unique perspective on it, and it's real, man.\"\n\nNovember 2017: Blake Shelton Crowned People Magazine's Sexiest Man Alive.\n\nAfter her beau earned the Sexiest Man Alive title, Stefani told Ellen, “He doesn’t even like to do a photo shoot. You can never convince him to do it. So he just called me like, ‘They want me to do this.’ And I was like, ‘You should totally do it! You’re so sexy!’”\n\nDecember 2017: Holiday Cheer\n\nThe couple unites for a cheerful performance of their duet \"You Make It Feel Like Christmas.\" They stare into each other's eyes and look so in love, it hurts.\n\nApril 2018: More Wedding Rumors\n\nGwen sits down with Ellen and admits that she thinks about getting married all the time. Hint-hint, Blake.\n\nJune 2018: Supportive BF\n\nBefore kicking off her Las Vegas residency, Shelton caught his girlfriend rehearsing, and shouted her praises on Twitter. She responded with the hashtag, #Bestboyfriendever.\n\nSetting here watching @gwenstefani rehearsals it continues to shock me the amount of GIANT hits this girl has written... I highly recommend y’all catch her Vegas show if you can get tickets!!! — Blake Shelton (@blakeshelton) June 14, 2018\n\nOn opening night of the residency, Gwen posted an adorable photo series, with youngest son Zuma snuggled on Blake's lap.\n\nJuly 2018: 'Super In Love'\n\nIn an interview with In Style, Gwen admits that her look is more feminine than ever before. She adds, \"It’s probably because I’m super in love and have a really manly man [Blake Shelton]. I enjoy letting that part of me come out.\"", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?5483f7d85ab28d1d2c44"], "top_img": "https://static.billboard.com/files/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548-1024x677.jpg", "keywords": [], "authors": ["Sofia Mele"], "canonical_link": "http://www.billboard.com/articles/columns/pop/8465069/blake-shelton-gwen-stefani-relationship-timeline", "title": "A Timeline of Gwen Stefani & Blake Shelton's Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-07-11T21:31:07-04:00", "published_time": "2018-07-11T21:31:07-04:00"}, "description": "Pop-rockstar Gwen Stefani and country crooner Blake Shelton have been going steady for years now. From overcoming hard times together and collaborating on romantic duets, to dealing with constant wedding rumors, here's a look back at one of the cutest couples in music.", "og": {"description": "Pop-rockstar Gwen Stefani and country crooner Blake Shelton have been going steady for years now. From overcoming hard times together and collaborating on romantic duets, to dealing with constant wedding rumors, here's a look back at one of the cutest couples in music.", "image": {"identifier": "https://static.billboard.com/files/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Gwen Stefani & Blake Shelton's Relationship: A Timeline | Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/pop/8465069/blake-shelton-gwen-stefani-relationship-timeline", "site_name": "Billboard"}, "title": "A Timeline of Gwen Stefani & Blake Shelton's Relationship", "twitter": {"card": "summary_large_image", "description": "Pop-rockstar Gwen Stefani and country crooner Blake Shelton have been going steady for years now. From overcoming hard times together and collaborating on romantic duets, to dealing with constant wedding rumors, here's a look back at one of the cutest couples in music.", "image": "https://static.billboard.com/files/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548-1024x677.jpg", "title": "A Timeline of Gwen Stefani & Blake Shelton's Relationship", "site": "@billboard"}}, "movies": [], "publish_date": 1531359067.0, "source": "http://www.billboard.com", "summary": ""}