{"url": "https://www.zerohedge.com/news/2016-07-02/un-official-accidentally-crushes-own-throat-right-testifying-against-hillary-clinton", "text": "Submitted by Mac Slavo via SHTFPlan.com,\n\nCall it conspiracy theory, coincidence or just bad luck, but any time someone is in a position to bring down Hillary Clinton by testifying they wind up dead. In fact, there’s a long history of Clinton-related body counts, with scores of people dying under mysterious circumstances.\n\nPerhaps the most notable is Vince Foster. Foster was a partner at Clinton’s law firm and knew the inner workings of the Clinton Machine. Police ruled that death a suicide, though it is often noted that Foster may have been suicided.\n\nNow, another official has found himself on the wrong end of the Clintons. That John Ashe was a former President of the United Nations General Assembly highlights the fact that no one is safe once in their sights.\n\nAnd as you might have guessed, there are major inconsistencies with Ashe’s death. It was not only conveniently timed because Ashe died just a few days before being set to testify against Clinton in a corruption case, but official reports indicated he died of a heart attack.\n\nThe problem, however, is that police on the scene reported Ashe died when his throat was crushed during a work-out accident.\n\nThe New York Post’s Page Six reported that after Ashe was found dead Wednesday, the U.N. claimed that he had died from a heart attack. Local police officers in Dobbs Ferry, New York, later disputed that claim, saying instead that he died from a workout accident that crushed his throat. Adding to the mysterious nature of Ashe’s death was the fact that he had been slated to be in court Monday with his Chinese businessman co-defendant Ng Lap Seng, from whom he reportedly received over $1 billion in donations during his term as president of the U.N. General Assembly. And then there was this: During the presidency of Bill Clinton, Seng illegally funneled several hundred thousand dollars to the Democrat National Committee. Source: The Conservative Tribune via The Daily Sheeple\n\nIt must be coincidence, right?\n\nIf former Secret Service agent Gary Byrne is to be believed, this is business as usual for the Clintons. Excerpt via Zero Hedge:\n\nBYRNE: I feel so strongly that people need to know the real Hillary Clinton and how dangerous she is in her behavior. She is not a leader. She is not a leader. SEAN: She does not have the temperament? BYRNE: She doesn’t have the temperament. She didn’t have the temperament to handle the social office when she was First Lady, she does not have the temperament. SEAN: She’s dishonest. BYRNE: She’s dishonest, she habitually lies, anybody that can separate themselves from their politics and review her behavior over the past 15 years…\n\nByrne is the author of the newly published book Crisis Of Character – a first-hand Clinton exposé.", "images": ["https://www.zerohedge.com/themes/zerohedge/images/logo_full.svg", "https://www.zerohedge.com/themes/zerohedge/images/live_commentary_button_big.png", "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/thumbnail/public/pictures/picture-5.jpg?itok=LY4e264-", "https://www.zerohedge.com/themes/zerohedge/images/logo_mobile.svg", "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/images/user3303/imageroot/20160702_ashe.jpg?itok=xjdjMNdN", "http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2016/07/01/20160702_ashe.jpg"], "top_img": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/images/user3303/imageroot/20160702_ashe.jpg?itok=xjdjMNdN", "keywords": [], "authors": [], "canonical_link": "https://www.zerohedge.com/news/2016-07-02/un-official-accidentally-crushes-own-throat-right-testifying-against-hillary-clinton", "title": "U.N. Official 'Accidentally' Crushes Own Throat Right Before Testifying Against Hillary Clinton", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@zerohedge", "description": "John Ashe, a former President of the United Nations General Assembly, was found dead Wednesday just a few days before being set to testify against Clinton in a corruption case. While the U.N. claimed that he had died from a heart attack, local police officers in Dobbs Ferry, New York, later disputed that claim, saying instead that he died from a workout accident that crushed his throat.", "title": "U.N. Official 'Accidentally' Crushes Own Throat Right Before Testifying Against Hillary Clinton", "url": "https://www.zerohedge.com/news/2016-07-02/un-official-accidentally-crushes-own-throat-right-testifying-against-hillary-clinton", "image": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/images/user3303/imageroot/20160702_ashe.jpg?itok=xjdjMNdN"}, "og": {"site_name": "Zero Hedge", "type": "Article", "url": "https://www.zerohedge.com/news/2016-07-02/un-official-accidentally-crushes-own-throat-right-testifying-against-hillary-clinton", "title": "U.N. Official 'Accidentally' Crushes Own Throat Right Before Testifying Against Hillary Clinton", "image": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/images/user3303/imageroot/20160702_ashe.jpg?itok=xjdjMNdN"}, "description": "John Ashe, a former President of the United Nations General Assembly, was found dead Wednesday just a few days before being set to testify against Clinton in a corruption case. While the U.N. claimed that he had died from a heart attack, local police officers in Dobbs Ferry, New York, later disputed that claim, saying instead that he died from a workout accident that crushed his throat.", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff"}, "movies": ["https://www.youtube.com/embed/WZSD2cUjGOE"], "publish_date": 1467388800.0, "source": "https://www.zerohedge.com", "summary": ""}