{"url": "https://www.etonline.com/why-lisa-vanderpump-wont-officiate-jax-taylor-and-brittany-cartwrights-wedding-exclusive-115016", "text": "Brittany Cartwright and Jax Taylor’s big day is coming together.\n\nThe Vanderpump Rules lovebirds have landed on a date and location for their wedding, planning to tie the knot next summer at the Kentucky Castle, a boutique hotel located in Versailles, Kentucky, designed to look like a European palace. It’s where Brittany, a Kentucky native, says she’s always wanted to get married.\n\n“It’s actually, knock on wood, it’s running smoother than expected,” Jax shares of wedding planning. It’s also, seemingly, been easier than expected. Brittany confesses to finding her dream wedding dress on the first day she went out shopping!\n\n“I did not mean to, but the very first place I went to I actually found a dress,” she recalls. “I'm not gonna just announce the designer and stuff just yet because I don't want [Jax] to know anything about it. Whenever I walk down the aisle, that's gonna be the first time he sees it or knows anything about what it looks like.”\n\nThe 29-year-old says fans will get to see part of her wedding dress experience on season seven of VPR, but she made sure cameras were off when she said yes to the dress. The pair has also put asks out to their bridal party -- expect lots of Vanderpump co-stars flanking the couple at the altar -- and is finalizing their guest list.\n\n“I think our cap is gonna be around 200, 220 [guests], something like that,” Brittany shares.\n\n“It’s a destination wedding, so we’re gonna have some people who won’t be able to make it,” Jax adds. “I mean, we’ve got some people that have never been to Kentucky before that are coming.”\n\nOne person they know for sure won’t snag an invite is James Kennedy, who burnt any bridge he had with the couple after “freestyling” a rap about Jax cheating on Brittany.\n\n'Vanderpump Rules': Jax Shares Secrets Behind His Proposal to Brittany (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'Vanderpump Rules': Jax Shares Secrets Behind His Proposal to Brittany (Exclusive)\n\n”They made it look like it was just a one-time thing, where he said a line in a 'freestyle,’” Brittany recalls. “It was a much bigger deal, and we all know it’s not a freestyle. James does not freestyle. I’m sure he can’t actually freestyle.”\n\nAll that’s left to do for the couple is nail down their menu, cake and an officiant. While co-stars Katie Maloney and Tom Schwartz asked Lisa Vanderpump to conduct their 2016 wedding ceremony, Jax and Brittany plan to let Lisa just sit back and enjoy their day.\n\n“We love Lisa, so it’s not like we would be like, ‘No, wouldn’t want that!’” Brittany explains. “It’s very important to my family that we have somebody from the church.”\n\n“It’s important to me, too,” Jax chimes in. “I thought what [Tom and Katie] did with Lisa was really cool and very awesome, for them … I thought what they did was really amazing. I think it just worked. You know, Brittany is a Christian girl, and I literally just started going to church again this year.”\n\n“I’m gonna ask somebody that I went to church with when I was a little girl,” Brittany says of picking their officiant. “He’s known me my whole life, and he’s a great speaker. Just so down to earth, so cool.”\n\nFor more Jax and Brittany, tune into Vanderpump Rules every Monday at 9 p.m. ET on Bravo.\n\nRELATED CONTENT:\n\n'Vanderpump Rules' Cast Promises Surprise-Packed Season 7 (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\n‘Vanderpump Rules’ Season 7: the SUR-vers Break Down What You Need to Know (Exclusive)\n\n‘Vanderpump Rules’: Jax Shares Special Meaning Behind Restaurant Where He Proposed to Brittany (Exclusive)\n\n‘Vanderpump Rules’ Star Stassi Schroeder Explains Why Boyfriend Beau Clark Is ‘the One’ (Exclusive)", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/eto_jaxbrittwedding_120318vp.png?h=a20a8a77&itok=ST6WE__k"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/eto_jaxbrittwedding_120318vp.png?h=a20a8a77&itok=ST6WE__k", "keywords": [], "authors": ["Brice Sander"], "canonical_link": "https://www.etonline.com/why-lisa-vanderpump-wont-officiate-jax-taylor-and-brittany-cartwrights-wedding-exclusive-115016", "title": "Why Lisa Vanderpump Won’t Officiate Jax Taylor and Brittany Cartwright’s Wedding (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Why Lisa Vanderpump Won’t Officiate Jax Taylor and Brittany Cartwright’s Wedding (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/why-lisa-vanderpump-wont-officiate-jax-taylor-and-brittany-cartwrights-wedding-exclusive-115016", "title": "Why Lisa Vanderpump Won’t Officiate Jax and Brittany's Wedding", "description": "The ‘Vanderpump Rules’ stars explain to ET why they want their boss to be a guest at their big day, but not a part of the ceremony.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/eto_jaxbrittwedding_120318vp.png?h=a20a8a77&itok=ST6WE__k", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The ‘Vanderpump Rules’ stars explain to ET why they want their boss to be a guest at their big day, but not a part of the ceremony.", "title": "Why Lisa Vanderpump Won’t Officiate Jax and Brittany's Wedding", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Brice Sander‍", "url": "https://www.etonline.com/why-lisa-vanderpump-wont-officiate-jax-taylor-and-brittany-cartwrights-wedding-exclusive-115016", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/eto_jaxbrittwedding_120318vp.png?h=a20a8a77&itok=ST6WE__k"}, "description": "The ‘Vanderpump Rules’ stars explain to ET why they want their boss to be a guest at their big day, but not a part of the ceremony.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, TV, Vanderpump Rules, Lisa Vanderpump, Jax Taylor, Brittany Cartwright, Weddings", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}