{"url": "https://people.com/tv/kim-kardashian-no-karjenner-christmas-card-2018-drama/", "text": "The KarJenners are staying away from the drama this holiday season — or at least, they’re trying to.\n\nKim Kardashian West told E! News at the KKW Beauty pop-up shop in the South Coast Plaza mall on Tuesday the reason her family is forgoing its epic, annual Christmas photoshoot this year. And fans who have been watching the current season of Keeping Up with the Kardashians won’t be surprised by the answer.\n\nGet push notifications with news, features and more.\n\n“I have to say, thanks to last year’s Christmas card, that really did just f— us over,” the mom of three, 38, told the outlet. “That was so dramatic. Kris Jenner has given up. She’s just like, ‘I don’t have the energy to wrangle all my kids anymore and their kids.’ ”\n\nThe reality star also revealed another big change in family traditions for 2018.\n\nRELATED: Kim Kardashian Pokes Fun at Her Accidental Nip Slip on The Cher Show Opening Night Red Carpet\n\n“This year is the first year ever that Kanye and I are having our Christmas Eve party at our house,” Kim told E!, adding that after her younger sister Khloé, 34, didn’t make it home for Thanksgiving, she hopes she’ll be able to stop by for the festive gathering — pending her boyfriend, NBA player Tristan Thompson‘s game schedule.\n\n“I don’t know what the schedule is like, but I know that she will spend Christmas Eve with us,” Kim said during the interview. “She usually spends the party with us, and then she’ll go out.”\n\nThe heartwarming photos from the 2017 KarJenner Christmas card, which the family revealed day by day, were overshadowed by all the sibling fighting surrounding the shoot — as the premiere of the 15th season of the family’s hit show revealed.\n\nImage zoom Kim Kardashian West at the KKW Beauty Pop-Up Stefanie Keenan/Getty\n\nIt all started with scheduling issues relating to Kourtney Kardashian, 39. The mother of three wanted to prioritize her kids over the rest of the family.\n\n“No one wants you in the f—ing shoot. Get the f— out of here and go,” snapped Kim. “I need Kourtney to not be so f—ing annoying with a stick up her a— like she f—ing runs this s—, because she doesn’t. She’s the least exciting to look at.“\n\nRELATED: Kim Kardashian Says Sister Kourtney Is the Most Likely to Sue Her: ‘She Is Ruthless’\n\nKourtney stormed off, but the argument continued over the phone.\n\n“I’m not here to be mistreated by my f—ing bitch family,” Kourtney said on speakerphone in the episode, sobbing. “Kim saying that I’m the least interesting to look at — who even speaks like that? You don’t say things like that. You guys just have really different values than me. I choose to be a mother to my three kids. I’m not here looking for another job. I already work enough — more than I would like to. What’s natural to me is being a mother. And I don’t expect everyone to have the same interests.”\n\n“You would honestly think that we have more jobs, so [you should] work around our schedule,” Kim fired back. “You do whatever the f— you want to do and you don’t do s—, so be accommodating to the people that actually do s—.”\n\n“All everyone f—ing says is, ‘What’s your job?’ ” Kourtney said. “If I had enough money, I wouldn’t work. I wouldn’t do the show. I would be a full time mom. That’s what I want to do. The guilt I carry every day from not being at home when they get in from school, not doing homework — my kids suffer. Honestly, it’s like, we have a disgusting family. I’m ashamed to be a part of [it]. It’s just gross.”\n\nLater, Kim acknowledged that she’d been rude, but refused to back down.\n\n“That was rude, but I wanted to be rude. Because she’s so f—ing rude all the time. Everything revolves around her,” Kim fumed. “I’m not going to tolerate her f—ing rudeness. I’ll be 10 billion times ruder back to her, every single time. Until she just cries when she sees me. Everyone walks on f—ing eggshells around her. She’s f—ing rude. She’s so goddamn entitled. She’s such a mess. Gremlin. I’m not going to play around with her anymore.”\n\nRELATED: The Kardashians’ Very Merry Christmas Cards Through the Years\n\nRELATED VIDEO: Kim Kardashian Says Rewatching Drama on KUWTK Is ‘Awkward’ for Tristan Thompson\n\nWhen Kourtney returned to talk things over a few hours later, she was still upset.\n\n“I’m not going to spend my time, whether it’s my sister or not, with anybody that talks to me that way or thinks that way about me. Everybody has different priorities,” she said during the episode. “At the end of the day, when you die and when I die, it doesn’t matter how much money is in our bank account. What matters to me is my memories. I don’t give a f—.”\n\n“I’m not going to be around people that bring me down on a daily basis,” she continued, crying. “I’m just doing my best.”\n\nKhloé, in an attempt to mediate, suggested that the sisters all “stop judging each other” and pointed to her own recent move to Cleveland.\n\n“I will move to another state at some point, or another country,” Kourtney interjected. “I cannot wait for that day and hopefully just won’t have to have these fake relationships.”\n\nEventually, Kim rearranged her meetings to accommodate Kourtney’s schedule and the photo shoot came to fruition — even though the tension between the sisters was clearly lingering.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim-kardashian1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim-kardashian1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim-kardashian1.jpg", "keywords": [], "authors": ["Maura Hohman"], "canonical_link": "https://people.com/tv/kim-kardashian-no-karjenner-christmas-card-2018-drama/", "title": "Kim Kardashian West Says There Won't Be a KarJenner Christmas Card This Year — Here's Why", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Christmas,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,News,TV", "news_keywords": "Christmas,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,News,TV", "description": "The Kardashian-Jenner family won't put out a Christmas card in 2018, Kim Kardashian West says", "og": {"title": "Kim Kardashian West Says There Won't Be a KarJenner Christmas Card This Year — Here's Why", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kim-kardashian-no-karjenner-christmas-card-2018-drama/", "description": "The KarJenners are staying away from the drama this holiday season — or at least, they’re trying to. Kim Kardashian West&nbsp;told&nbsp;E! News at the KKW&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim-kardashian1.jpg", "width": 1310, "height": 686}}, "pinterest": {"url": "https://people.com/tv/kim-kardashian-no-karjenner-christmas-card-2018-drama/", "description": "The Kardashian-Jenner family won't put out a Christmas card in 2018, Kim Kardashian West says", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim-kardashian1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kim-kardashian-no-karjenner-christmas-card-2018-drama/", "title": "Kim Kardashian West Says There Won't Be a KarJenner Christmas Card This Year — Here's Why", "description": "The Kardashian-Jenner family won't put out a Christmas card in 2018, Kim Kardashian West says", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim-kardashian1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}