{"url": "https://web.archive.org/web/20090113114854/http://thepage.time.com:80/obamas-full-remarks-at-chicago-credit-cards-event/", "text": "A fact sheet on Senator Obama's plan to protect consumers is available HERE\n\nRemarks of Senator Barack Obama\n\nCredit Cards Event\n\nWednesday, June 11, 2008\n\nChicago, Illinois\n\nBefore we begin, I just wanted to say a word about the flooding devastating so many communities. We were scheduled to be holding this event in Iowa, but we decided to cancel it because we didn't want to divert state resources from going to help with flood relief.\n\nMy heart goes out to the families in Iowa, Wisconsin, Illinois and across the Midwest, who have been forced to flee their own homes, and leave their businesses and communities behind. Right now, many of them are wondering when they'll be able to return, and what they'll find when they get there. Well, we cannot assure them that their communities will be rebuilt overnight, but we can assure them that they will be rebuilt – because we'll work to ensure that the full resources of our state and federal government are there to help. And I will do everything in my power to see to it that those resources get to the people who need them as swiftly as possible.\n\nYou know, over the next two weeks, I'm going to be talking a lot about what we can do to build an economy that works for all Americans. Because for families all across this country, our economy hasn't been working for quite some time. I've met Americans who are doing everything right – who are working that extra shift, or taking on that extra job – but are still struggling just to make ends meet. And a big part of the reason is that they're paying $4 a gallon for gas, and skyrocketing costs for groceries, health care, and college tuition – at a time when their wages have stayed the same.\n\nAs a result, many of them are falling deeper and deeper into debt, and a lot of that debt is being put onto credit cards. Over the past 15 years, average household credit card debt has tripled. The typical family is now nearly $10,000 in the red. And bankruptcy rates have steadily climbed over the past year.\n\nNow, let's be honest. Part of why our debt crisis is so bad is that some folks are making reckless decisions – racking up big credit card bills by purchasing flat-screen TVs and other luxury goods that they know they can't afford. And they should have to face the consequences of those decisions.\n\nBut many more Americans aren't falling into debt because they made an irresponsible decision; they're falling into debt because credit card companies are pushing them over the edge. For too long, credit card companies have been using unfair and deceptive practices to trick Americans into signing agreements they can't afford. The contracts you sign when you get a card have gone from being one page-long a few decades ago to more than thirty pages-long today. And they're often filled with traps and fine print that only a credit card executive could understand. These companies have been crossing the line to boost their bottom line.\n\nBut rather than stop this outrage, Washington has let them get away with it. And it's no wonder – because the credit card companies have spent millions in recent years financing political campaigns and lobbying Congress to get laws written to their liking. In the first quarter of this year alone, one such industry group spent nearly $800,000 on lobbying.\n\nThis has to stop. We cannot let the rules of the game continue to be rigged against ordinary Americans. We need a President who will look out for the interests of hardworking families, not just their big campaign donors and corporate allies.\n\nAnd that will be a real difference in this election, because when it comes to Washington letting credit card companies get away with all this, John McCain has been part of the problem. When he had the chance to help families avoid falling into debt, John McCain sided with the credit card companies. When he had the chance to protect teenagers and college students from deceptive credit card practices, he sided with the credit card companies. And when I fought against the credit card industry's bankruptcy bill that made it harder for working families to climb out of debt, he supported it – and he even opposed exempting families who were only in bankruptcy because of medical expenses they couldn't pay.\n\nJust look at the proposals he's been making on this campaign. He's calling for nearly $2 trillion in corporate tax cuts over the next decade, but he hasn't even proposed a single measure to protect hardworking Americans from credit card companies that are trying to take advantage of them.\n\nWell, that's not the kind of change that the folks I've met are looking for. They're looking for a President who will fight for them, and restore fairness to our economy. That's the kind of President I'll be. I'll put a middle class tax cut into the pockets of hardworking families – a tax cut that will give 95% of all families $1,000 in relief.\n\nI'll eliminate income taxes for seniors making less than $50,000 a year. And I'll protect the rights of ordinary Americans by cracking down on companies that are trying to deceive them.\n\nThat's why back in November, I proposed a plan to help ensure that credit cards don't become the next subprime crisis. It starts with making sure that we have a system that's open and transparent. To help you understand the risks that are involved in signing up for a credit card, I'll create a five-star rating system. That way, Americans can compare credit card companies and avoid those that are stacking the deck against them.\n\nNow, don't get me wrong. We all have a responsibility to pay what we owe. But we have to ensure that the amount we're paying is fair. That's why I've proposed a Credit Card Bill of Rights. The first thing we'll do under this bill of rights is ban unilateral changes to credit card agreements. You should pay the rate you signed up for. If the credit card company wants to raise that rate, you should be able to opt out of the agreement.\n\nSecond, we'll ban rate changes on past debt. If a credit card company wants to raise interest rates, then that new, higher rate should apply to the debt you add going forward, not what you already owe. The store can't change the price of what you bought after you bought it and neither should your credit card. Third, we'll ban interest on transaction fees. If you're late in making a payment, you have to pay a late fee. But you shouldn't be paying a fee for paying a fee.\n\nIt's time Washington established some rules of the road to level the playing field for hardworking families. It's time we had an economy that worked for companies and consumers alike. That's what my campaign is all about. So the American people will have a clear choice in November: you can choose an approach that sides with the credit card companies when it really counts; or you can choose to finally have a President who looks out for Main Street, not just Wall Street; a President who fights each day to put the American dream within reach for all Americans. And that's the kind of President I intend to be. Thank you.", "images": ["https://web.archive.org/web/20090113114854im_/http://pixel.quantserve.com/pixel/p-18-mFEk4J448M.gif", "https://web.archive.org/web/20090113114854im_/http://s2.wordpress.com/wp-content/themes/vip/markhalperin/images/pic121.jpg", "https://web.archive.org/web/20090113114854im_/http://adremote.timeinc.net/image.ng/site=time&channel=cm&adsize=336x15&pagepos=cmarticlepagebtf", "https://web.archive.org/web/20090113114854im_/http://img.timeinc.net/time/favicon.ico"], "top_img": "https://web.archive.org/web/20090113114854im_/http://img.timeinc.net/time/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "by Mark Halperin", "meta_data": {"generator": "WordPress MU", "keywords": "TIME Magazine, News Magazine, Current Events, Top News Stories, Top News, News Stories, World News, Current News Articles, Global News", "description": "The Page by Mark Halperin.  Politics updated by the minute."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}