{"url": "https://cmch.tv/13-reasons-why/", "text": "Share this: email\n\nQ: My daughter is 13 and an eighth grader in middle school. Her friends have recently become obsessed with the Netflix show, 13 Reasons Why. I haven’t read the book or watched the show, but have been seeing a few news articles that worry that the show may be dangerous for kids to watch graphic depictions of suicide, bullying and forced sex. My daughter feels that it is only “drama” (in the teen use of the word), and she’s been feeling left out of the conversation with her friends. Is it ok for me to let her watch it?\n\n~ Just One Reason Why Not, USA\n\nA: Dear Just,\n\nYour question is timely. Many parents (and educators, judging from the flurry of school-parent communication around the country) have been concerned about the content of 13 Reasons Why and its massive popularity among pre-teens and teens. It is currently the most popular Netflix show on social media, in part because it is being heavily marketed to adolescents, with a personal social media campaign from Executive Producer and powerful teen influencer, Selena Gomez. The show’s subject matter is titllating because it is, as your daughter says “teen drama”. The problem is that she and her peers may not yet be neurodevelopmentally capable of processing that “drama” in healthy, safe ways.\n\nAlthough it is based on a popular YA novel (for readers 12-18), 13 Reasons Why is rated TV-MA (unsuitable for viewers under 17) and several episodes are preceded by an onscreen “graphic content” warning. As you’ve seen with your own daughter, media made for older adolescents and adults are attractive to younger kids. Younger kids’ media consumption is aspirational, meaning that they look to older kids, including media representations, to see how they should act, dress, and behave in the strange new worlds of high school, summer camp, and college. There is a real difference between your 13-year-old daughter reading the book and watching an adult filmmaker’s graphic recreation of the book. And selling an admittedly TV-MA show to a YA readership is just as concerning as cross-marketing children’s action figures based on R-rated movies like Deadpool.\n\nBecause of the normal stage of development at age 13, the decision whether and how your daughter should watch 13 Reasons Why is an important one. The intense emotions, confusion, and behaviors of the show’s characters can be disturbing to any viewer. But younger viewers, who are looking for clues on how to be a teenager and have limited life experience to reference, are especially vulnerable to being upset and activated. As her parent, you know best what your daughter can and cannot handle when it comes to seeing emotionally intense content created by adults whose life experience and brain development provide them perspective and resilience that a 13-year-old does not yet have. If you feel that your daughter isn’t ready to process graphic images of substance abuse, suicide, rape, and physical assault in a healthy and safe way, 13 Reasons Why is not for her.\n\nMore concerning than its graphic visuals is the show’s narrative and how it may be interpreted by young viewers. This is in part because children and teens will not develop brain executive functions such as impulse control and future thinking for more than a decade. Because the plot of 13 Reasons Why revolves around suicide and many of the characters grapple with suicidal thoughts and hurting themselves, this may be interpreted by young viewers as normal adolescent behavior. While teen suicide is the second leading cause of adolescent death in this country, it is fortunately a relatively rare occurrence, and far from “normal” teen behavior. From an adult sensibility, it has been argued that 13 Reasons Why provides an opportunity to bring hush hush subjects like teen suicide, substance use, and rape out into the open. Unfortunately, while the premise and title of 13 Reasons Why claim that it presents the reasons why the main character, Hannah, takes her life, the show neglects the primary reason for her suicide, which is Hannah’s mental health at a time when she has not fully developed impulse control, proving to be a deadly combination.\n\nSuicide primarily results from depression, the most common, and commonly missed, chronic illness. Despite the story presented by 13 Reasons Why, suicide is not a reaction to (or revenge for) what others do to or do not do for someone like Hannah, but arises from depression, her sense of hopelessness and helplessness to make life better. This is the fundamental reality of suicide that is, unfortunately, never addressed in the show. 13 Reasons Why sends a harsh and untrue message that Hannah’s classmates actually cause her death. In the show’s final episodes, the teens note again and again that they killed Hannah. Particularly unnerving is Hannah’s final reason why – she sought help from the school counselor and received none.\n\n13 Reasons Why concludes with the main protagonist’s realization that a “change” in terms of how he and his peers treat each other is needed – but specific changes are never mentioned. This missed opportunity to describe how depression feels and how it looks to others is the show’s greatest failure. Not only could it have opened the meaningful discussion of teen suicide that the producers sought, but it would have given viewers the tools to recognize depression, support and care for their friends, and seek care for themselves when they need it.\n\nEvery young person and viewer is going to respond to 13 Reasons Why differently. If you are going to allow your daughter to watch it, discuss some of the themes beforehand. Ask her why she wants to watch the show and what her friends have been saying about it. Then sit down and watch the show together. Help her to process it by discussing ways Hannah could have reached out to her friends, her parents, and her teachers – and the different outcomes that might have resulted had she done so. Think together about what Hannah’s friends could have noticed, what they might have done had they known about her depression, and to whom they might have reached out. Explicitly note that the school counselor is not an accurate portrayal of a responsible mental health professional. Make sure your daughter knows that you are there for her, and that others are there for her as well. Identify the people in your daughter’s life to whom she can turn when she feels sad, lonely, or helpless. Finally, recognize that 13 Reasons Why is a work of fiction, made more compelling by suggesting you could wreak revenge on peers who have bullied you or that the boy or girl you had a crush on will pine for you and avenge your death. But these are emotionally manipulative and unrealistic clichés of entertainment that glamorize and romanticize “teen drama.” There is no glamor or romance in the tragedy of a child taking her own life. None.\n\nEnjoy your media and use them wisely,\n\n~ The Mediatrician®\n\nAdditional resources:", "images": ["https://cmch.tv/wp-content/themes/bootstrap-media/library/img/youtube.png", "https://secure.gravatar.com/avatar/b8147bf2094809c008386f2dccd56636?s=75&d=mm&r=g", "https://secure.gravatar.com/avatar/4d5a0f2773e8d64cb3f9998a086aba42?s=75&d=mm&r=g", "https://cmch.tv/wp-content/themes/bootstrap-media/library/img/HMS_Affiliate_Logo_42.png", "https://cmch.tv/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/facebook.png", "https://cmch.tv/wp-content/plugins/simple-share-buttons-adder/buttons/simple/twitter.png", "https://cmch.tv/wp-content/themes/bootstrap-media/library/img/cmch-logo-hd.png", "https://cmch.tv/wp-content/plugins/simple-share-buttons-adder/buttons/simple/facebook.png", "https://cmch.tv/wp-content/themes/bootstrap-media/library/img/instagram.png", "https://cmch.tv/wp-content/uploads/Untitled-1-750x300.png", "https://cmch.tv/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/twitter.png", "https://secure.gravatar.com/avatar/4e0f483884980e28ef1b9c307025db3f?s=75&d=mm&r=g", "https://cmch.tv/wp-content/themes/bootstrap-media/library/img/BCHlogomotto_inline_42.png", "https://secure.gravatar.com/avatar/eab88a1144abe9b91609716d88f55046?s=75&d=mm&r=g", "https://secure.gravatar.com/avatar/bfd15efb9d81b2c0719c0829aa36cbcf?s=75&d=mm&r=g", "http://cmch.tv/wp-content/uploads/2013/08/dr-rich-2to1-300x150.jpg", "https://cmch.tv/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/email.png", "https://secure.gravatar.com/avatar/3ca21a7a2e4a5d53c67149c42deb504a?s=75&d=mm&r=g", "https://cmch.tv/wp-content/themes/bootstrap-media/favicon.png", "https://cmch.tv/wp-content/themes/bootstrap-media/library/img/orange-gift.png", "https://secure.gravatar.com/avatar/3077420d935a5f6ea0d5f5893e81ca82?s=75&d=mm&r=g"], "top_img": "https://cmch.tv/wp-content/themes/bootstrap-media/favicon.png", "keywords": [], "authors": [], "canonical_link": "https://cmch.tv/13-reasons-why/", "title": "Should I let my child watch the Netflix show, 13 Reasons Why?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "MasterSlider 3.5.8 - Responsive Touch Image Slider | avt.li/msf"}, "movies": [], "publish_date": null, "source": "https://cmch.tv", "summary": ""}