{"url": "http://time.com/money/5359764/bethenny-frankel/", "text": "Bethenny Frankel has a beef with Postmates.\n\nA recent order placed with the delivery service was simple enough. Just a bagel, muffin, and cup of coffee. But this modern-day convenience backfired. Her bag contained just a muffin and the bagel. Coffee? Nonexistent. Cream cheese? Not a schmear in sight.\n\n“Ridiculous,” Frankel says, lifting her hands in the air at her SoHo apartment as she reaches for a piece of vegan sushi. “I’m still mad.”\n\nWhether in business or in life, Frankel, 47, expects perfection. In fact, that may be the secret to her success. The brash Real Housewives of New York City star’s relentless hustle has lifted her from a financially insecure childhood spent around racetracks throughout New York to her current status as a multimillionaire entrepreneur.\n\nAnything less than the best gives her a headache. In 2011, when she sold her Skinnygirl cocktail line to Beam Global for a reported $100 million, she was careful to retain the right to license the brand name for other products, a move that allows her to profit from a constantly growing line of Skinnygirl spinoffs.\n\nFrankel’s famous work ethic has helped her forge an unusual path to riches. She’s a businesswoman who demands to be taken seriously—and a reality star who trades in quips and jabs (“Bethenny-isms,” as her fan base calls them) on a television show not exactly known for serious business. Her daily Instagram stories track this dichotomy. One minute, she’s in full glam, commanding the Skinnygirl offices in Manhattan; the next, she’s at home in bed with her dogs, stripped of her makeup, her hair in a messy bun. When we met this summer, Frankel seamlessly displayed these complexities—with her desire for flawlessness shining through more than anything else.\n\n“If I’m not going to give it my all, then I’m not doing it,” Frankel tells me, draped in T.J. Maxx sweats inside her apartment. “If I make you a drink, I’m going to be sure it’s the best drink you’ve ever had.”\n\nShe sets her sights on what is immediately in front of her.\n\n“Whoever made this brownie,” she says of her post-sushi dessert, “does not share my philosophy. It’s disgusting.”\n\nPerhaps the greatest result of this consistent drive toward greatness is what Frankel calls her “financial freedom.” Looking back on a career that saw her parlay an appearance on The Apprentice into a starring role on Housewives and now a coveted guest-investor gig on Shark Tank, Frankel laid out for MONEY the four most important steps to financial independence.\n\nShe’s still hustling—and she wants others to learn to do the same.\n\nDaily Money Sign up to receive the latest updates and the smartest advice. View Sample Sign Up Now\n\nControl Your Debt\n\nFrankel couldn’t be the businesswoman she is today if she hadn’t learned a lesson or two about debt. For much of her adulthood, she says, debt hindered her from becoming her best self.\n\n“Until my late thirties, everything was just an anxiety and a struggle,” she says. “It’s like the way people feel when they eat something and they don’t feel good about it.” There were awkward dates where she didn’t want to pay any part of the bill. She felt shame while shopping, with pangs of guilt coursing through her every time she bought a new item, even if it was on sale. All told, she says, she had $20,000 in credit card debt and was no stranger to bouncing checks. “I’d be on the phone begging to get the [fees] reduced,” she recalls.\n\nFrankel at Boston University in 1988 courtesy of Bethenny Frankel\n\nBefore Frankel found financial security, she could barely afford her New York City rent. She would walk to events rather than take a cab or the subway and had no money management skills, aside from simply trying not to spend too much.\n\nFrankel’s skewed approach to spending left her throwing money away on frivolous items. If she had cash in her purse, she says, it would find its way to street vendors, balloons at a fair—anything, really. “Somehow, all the cash would go,” she says.\n\nThat mentality devolved into a nasty habit with credit cards—a mechanism Frankel once thought would make spending easier and, ultimately, cursed her with guilt. “I used to think the credit card didn’t count,” she says. “Then I consolidated all my credit cards and got a strategic plan to pay more than the minimum each month. That was a concerted effort.”\n\nNow that she has more money than she could ever have imagined, Frankel still hears that “money noise,” as she likes to call it—it’s just not that loud. Her biggest advice, to herself and to others, is to stay out of the red whenever possible. And when you do take on debt, you should have a large enough safety net to be able to pay those bills—whether a monthly mortgage or credit card balances—at a moment’s notice. “You can’t put yourself in a position where, if the s–t hit the fan, you couldn’t pay all of your bills at one time,” she says. “If the world came to an end, I would be able to pay for everything. I might not be left with much, but I can afford what I have.”\n\nAs for many of her Housewives costars? Frankel isn’t optimistic. “They can’t afford the lives they’re living,” she says. “And if the music stops, they’re going to get in some trouble.”\n\nBethenny Frankel with the cast of The Real Housewives of New York City in 2009 Andrew Eccles—Bravo TV/Courtesy of Everett Collection.\n\nMake Work Work for You\n\nFrankel’s philosophy toward work is quite simple: Work hard, and don’t waste anyone’s time. That’s easy enough, theoretically, but Frankel says most employees can fall into a trap of becoming lazy or procrastinating. “Most people are moving papers around a desk, pretending they’re working,” she says. “If you are a really hard worker, you know it. And you will soar.”\n\nNowadays, Frankel’s best employees get the job done accurately and quickly; those working overtime aren’t impressing anyone. She learned that when she worked at an event production company owned by Merv Griffin, where a former colleague would stick around until 9 p.m. because he procrastinated all day. “The owner used to say, ‘Why are you leaving? He’s still here,’ ” Frankel scoffs. “And I said, ‘It’s because he didn’t get his work done.’ ”\n\n“I don’t lollygag,” she adds. “You know if you’re that person who’s really going to be Michael Phelps and not look to the left or to the right and just get to that wall before anybody else.”\n\nWorking efficiently also makes you a more valuable asset to any business you’re working for or any project you’re working on—and could result in faster promotions and better wages. But mobility within your own career has a lot to do with pushing to get what you want and knowing your worth. “Try to create a situation where you add value, and the whole thing comes from a place of yes,” she says of asking for a raise or promotion. And reading the room is critical. “I’ve had people come in and ask me for too much, too often,” she says. “Asking for a raise is a very psychological and emotional thing. It has to be done at a reasonable time.”\n\nMaking work work for you isn’t just about negotiating a raise or getting that long-awaited promotion. It’s finding that perfect combination of a job you enjoy—and something you’re good at. Even if you feel stuck in the same old nine-to-five, there are still ways you can make it your own and speed past your coworkers. “Most people are lazy, sit back, and wait for things to happen for them, and complain when they don’t get them,” Frankel says. “So don’t be that person.”\n\nFrankel on the L.A. set of 'Saved by the Bell' as a production assistant Courtesy of Bethenny Frankel.\n\nFrom gig to gig throughout her adulthood, Frankel took each job seriously and consistently searched for ways to impress others. It was the early experience at the event production company that made her realize she was good at working hard, making money, and doing so with little oversight. She managed multimillion-dollar budgets and didn’t work typical days in an office environment.\n\n“That’s when I really started to blossom,” she recalls.\n\nInvest in Your Hustle\n\nWhen Frankel was approached to join the cast of what would become The Real Housewives of New York City, she wasn’t the typical New York City socialite. And as an unmarried woman, she was certainly not a housewife. But Frankel saw Housewives as a one-of-a-kind business opportunity, long before anyone else thought to do the same with reality television as a platform.\n\nWhile paid just $7,250 for the show’s first season in 2008, Frankel made a key decision that set the stage for her financial success. She refused to sign a portion of the contract that would have required her to give TV network Bravo a percentage of the profits she earned from the businesses she promoted on the show. Though neither she nor Bravo knew it at the time, that excised portion of her contract—now known as the “Bethenny clause”—made Frankel’s Skinnygirl fortune all the more lucrative.\n\n“Everybody else just had to try to play catch-up after they saw what I did,” Frankel says proudly.\n\nBut this wasn’t an out-of-the-box fluke.\n\nFrankel was born into a hustler’s paradise. She quite literally grew up on the racetracks, with a father and stepfather both horse trainers, surrounded by gambling and “unsavory characters.” “You’re prepared for anything,” she says. “There’s competition there; there’s speed; there’s money; the stakes are high.”\n\nThat intense environment set the tone for Frankel’s career. Whether it was charging a fee at the door for high school parties or opening her own baking business years later, Frankel has always tried out new projects and businesses. It wasn’t until Skinnygirl, a brand she developed in her late thirties, that she crossed the finish line, in a sense.\n\n“I’ve failed so many times,” she says. “But I’ve always learned more from my mistakes.”\n\nIf one business didn’t work out, then it was on to the next one. If she was presented with a not-so-perfect opportunity, she would turn it into one. When she came in second on Martha Stewart’s version of The Apprentice in 2005 before appearing on Housewives, it only drove her further to push idea after idea and, eventually, to develop the right recipe for success. As a guest investor on Shark Tank, she now encourages others to do the same. On the show, she focuses on investing in women- and minority-run businesses, whose owners tend to receive significantly less in venture capital funding than their white male counterparts.\n\nStill, despite that $100 million deal with Beam Global under her belt and millions more coming in each year that could easily fund Frankel for the rest of her life, she’s setting the bar high for herself. When we spoke about Skinnygirl’s expansion into other products—snacks, seltzers, and, most recently, size-inclusive jeans—Frankel was eager to hype “possibly the biggest business deal” to date for Skinnygirl down the road—but wouldn’t disclose the exact details. In true hustler fashion, she’s keeping her cards close to her chest on this one.\n\nSpend Wisely — and Give Back\n\nFinding financial freedom isn’t as simple as controlling your debt, finding success at work, and keeping your hustle mentality alive. Spending your money wisely is paramount—and when you do splurge, do so responsibly.\n\nFor Frankel, who came into a lot of money very quickly, she’s been careful about what she spends it on—and what she invests in. She still considers herself frugal and hates frivolous spending. “Even if it’s buying a diamond—which I’ve done—I’d like to be able to get a good deal on it,” she says. “I don’t like to be robbed.”\n\nFor her, the ultimate cornerstone of financial freedom is having the agency to invest in experiences or products that make her life and those of her loved ones more enjoyable, without the headache or anxiety spending once brought her. She’s constantly on the hunt to find fun, new adventures for her and her 8-year-old daughter, Bryn. She brings her along to events that can double as a work/life excursion, like an appearance she booked at Disneyland. And the jacuzzi she installed at her home in the Hamptons? That’s for her daughter to enjoy with her friends—and Frankel to relax in after a workout. “The best money I ever spent,” she says.\n\nFinancial freedom for her also means giving those without it a possible leg up. Last year, Frankel’s B Strong charity program partnered with Delivering Good, a New York City–based nonprofit, to charter more than 50 planes and bring millions of dollars’ worth of food, water, gift cards, and emergency supplies to those affected by the hurricanes in Puerto Rico. In the fall of 2017, she used Twitter to ask fellow celebrities and fans for larger donations and traveled to Puerto Rico several times herself, donning a shirt from her charity that read “#thisisacrisis.” She has continued to work on relief efforts in recent months, visiting Guatemala after that country was devastated by a deadly volcanic eruption.\n\nFrankel in 2017 in Puerto Rico, where she has spearheaded relief efforts through her charity Courtesy of Bethenny Frankel.\n\nIn raising money for relief efforts, Frankel worried that donors would be concerned about where exactly their money was going. To give them financial empowerment, she says, her team would provide donors with a list detailing how the charity was spending the money. And Frankel says that just enticed them to give more.\n\n“People now are so much more educated, and they want to know where their money is going. Even if it’s a dollar. Is it a bottle of water, a nail, a piece of wood? And I gave them that,” Frankel says. “I gave them that financial freedom and power to say you’re giving money, and here’s where it’s going.”", "images": ["http://time.com/images/newsletter-money.png", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-featured.jpg?quality=85", "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-real-housewives-new-york-city.jpg", "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-saved-by-the-bell.jpg", "https://moneydotcomvip.files.wordpress.com/2018/08/money-cover.jpg?quality=85", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-puerto-rico.jpg", "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-boston-university.jpg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-featured.jpg?quality=85", "keywords": [], "authors": ["Jennifer Calfas"], "canonical_link": "https://money.com/bethenny-frankel/", "title": "'Everything Was a Struggle.' Bethenny Frankel on How She Went From $20,000 in Credit Card Debt to a $100 Million Skinnygirl Deal", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "celebrity", "news_keywords": "celebrity", "description": "Skinnygirl CEO and Shark Tank investor Bethenny Frankel talks to MONEY on debt management, procrastination, work/life balance and investing.", "og": {"title": "'Everything Was a Struggle.' Bethenny Frankel on How She Went From $20,000 in Credit Card Debt to a $100 Million Skinnygirl Deal", "type": "article", "site_name": "Money", "url": "https://money.com/bethenny-frankel/", "description": "She found her financial freedom and so can you.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-featured.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/bethenny-frankel/", "description": "Skinnygirl CEO and Shark Tank investor Bethenny Frankel talks to MONEY on debt management, procrastination, work/life balance and investing.", "media": "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-featured.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/bethenny-frankel/", "title": "'Everything Was a Struggle.' Bethenny Frankel on How She Went From $20,000 in Credit Card Debt to a $100 Million Skinnygirl Deal", "description": "She found her financial freedom and so can you.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/08/180807-bethenny-frankel-featured.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}