{"url": "https://www.independent.co.uk/arts-entertainment/films/features/solo-star-wars-alden-ehrenreich-harrison-ford-ron-howard-a8363121.html", "text": "Before Alden Ehrenreich took on the biggest role of his life, he took a trip out to Death Valley in California. He hired a high-end tepee, drank green juice and contemplated what playing the young Han Solo would mean.\n\n“I wanted to make sure I was really choosing to do this myself. And it wasn’t just because everybody in my life would think I was a lunatic if I said I didn’t want to.” It was time well spent, even if his conclusion was hardly surprising. “When I really looked at it, I really wanted to do it.”\n\nIt’s Thursday morning at the Cannes Film Festival, where Solo: A Star Wars Story was unveiled to the world’s media two nights earlier. Ehrenreich, a sleepy-looking soul in a red lumberjack shirt and black jeans, has been living with taking over from Harrison Ford in one of the most recognisable roles in the Star Wars universe for two and a half years now.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nNot that this makes it any easier. The roguish space pirate Solo has been Ford’s role alone for four decades.\n\n“I’m lucky enough that this is happening after I’ve been working for 14 years,” he says. “For me, starting out and having less experience was more intense. This is intense but I have a certain set of tools at this point as far as coping.\n\n“What do I have control over? I have control over my job, and my part and how much work I do on it. I don’t have control over how well it turns out, how good the movie is, what anybody thinks or what anybody I’m working with thinks.”\n\nCertainly the 28-year-old Ehrenreich is no beginner. A Los Angeles native, he’s already been to Cannes before with his debut, Francis Ford Coppola’s 2009 road movie Tetro (they reunited for the horror Twixt two years later).\n\n“I sat down with Francis and auditioned for him for about five months and then he went and put me in his film,” he recalls. “We went and filmed in Argentina together. No trailers. It was just me sitting on his lap asking questions! It was a film school.”\n\nSince then, he’s worked for South Korean director Park Chan-wook on the psychological thriller Stoker and popped up in Woody Allen’s Oscar-winning Blue Jasmine. More significantly, he was a co-lead in Warren Beatty’s Howard Hughes biopic Rules Don’t Apply and memorable in the Coen Brothers’ 1950s Hollywood comedy Hail, Caesar! as a rope-swirling TV cowboy.\n\n“I’ve been so insanely lucky,” he drawls, “The real gratification is that you get to be shoulder to shoulder [with these people] and be the beneficiary of their brilliance.”\n\nThere are even strange connections to his casting in Solo, which is directed by Ron Howard (A Beautiful Mind), who once starred with Harrison Ford in 1973’s American Graffiti, the film George Lucas made before directing the first Star Wars instalment. Coppola produced American Graffiti and it was cast by Fred Roos, who was also responsible for putting Ehrenreich in Tetro some 35 years later.\n\nEven before Tetro, Ehrenreich had contact with Lucas and Coppola’s old buddy, Steven Spielberg. “My mum [Sari, an interior designer] never wanted me to act professionally,” he explains. “And I really didn’t want to. I wanted a normal childhood and whatnot.”\n\nBut then he and a friend made a video for their pal’s bar mitzvah – which was attended by Spielberg. “He liked me from the video, so he introduced me to DreamWorks. I got an agent through them and started acting professionally.”\n\nTo complete this circle of Hollywood’s Movie Brats, Ehrenreich met Lucas, who came to the Solo set. Crucially, he also spent time with Ford before the shoot commenced, at an airplane hanger in Santa Monica where they had lunch. Naturally, they talked about the character, although the typically reticent Ford swore Ehrenreich to secrecy.\n\n“Harrison said, ‘If anyone asks, tell them I taught you everything you need to know and you’re not allowed to say anything!’”\n\nWhatever he told him, it worked. Ehrenreich captures Solo’s gruff charms and misplaced confidence in embryonic form.\n\nHe went back to the original movies to watch Ford, but didn’t set out to imitate him or copy a signature move, whether it’s cocking his head or giving a wry smile. “I don’t really work in that sense. You’re trying to make the thing feel as real as possible and really live through the scenes you’re given.”\n\nSet a decade or so before the original Star Wars, Ehrenreich’s Solo is a wannabe pilot living on his grimy home planet and dreaming of escape with his girlfriend Qi’ra (Game of Thrones’ Emilia Clarke). What follows is one of the more freewheeling adventures in the Star Wars canon, as Han is mentored by Woody Harrelson’s bandit Tobias Beckett and he meets his future Wookie copilot Chewbacca (Joonas Suotamo) and smuggler friend Lando Calrissian (Donald Glover).\n\nIt’s not been smooth sailing, however, with the production parting company with original directors, The Lego Movie’s Phil Lord and Christopher Miller. One report by online site Vulture claimed the pair haphazardly shot dozens of takes.\n\n“The original version of what we were going to do didn’t work out so of course there is disappointment and I loved working with them,” says Ehrenreich, diplomatically. “But then we were just so lucky to have Ron come in.”\n\nSo what was the first version like? Was it more broadly comic? “I don’t think so,” he continues. “There’s obviously speculation that their version was this goofy whatever… we were still doing all the scenes.”\n\nThere was improvisation with Lord and Miller but also with Howard. “I’m not a great person to speak to that because I wasn’t seeing any of that cut together. I never saw what their version would’ve been, so I don’t really know.”\n\nCritics have been kind to Ehrenreich (“enduringly watchable” said Variety) but how does he feel about the next step – losing his anonymity?\n\n“I don’t know when that thing happens,” he shrugs. “Is it the day the movie comes out? Is it when the posters go up? I don’t know when all that happens or how that happens.\n\n“It’s totally unappealing to me in and of itself. I’m not at all looking forward to that in any kind of way if that happens. But you do this and you sign up for it. It’s another one of these things you learn to live with.”\n\nWhile there is talk of further Solo instalments (Ehrenreich is signed up for three films and is more than willing to continue as Han), he’s also editing a short film he’s directed. “I think I will make one more short and do a feature some time, within the next year and a half. It’s a matter of finding the right story, gathering material. I’m in the process of looking at a bunch of different stories right now, and finding a writer and putting it together like that.”\n\nAs for his private life, he keeps it very quiet. At one point he was rumoured to be dating actor Kelsey McNamee (who had a tiny role in the Reese Witherspoon rom-dram Water For Elephants). And now – is there a special someone in his life?\n\n“It’s a good question,” he says, with a smirk. “Probably Chewbacca!”\n\n‘Solo: A Star Wars Story’ opens 24 May", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/22/12/alden-ehrenreich.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/22/12/alden-ehrenreich.jpg", "keywords": [], "authors": ["James Mottram"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/features/solo-star-wars-alden-ehrenreich-harrison-ford-ron-howard-a8363121.html", "title": "Alden Ehrenreich on playing Han Solo: Harrison Ford taught me 'everything I need to know'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/films/features/solo-star-wars-alden-ehrenreich-harrison-ford-ron-howard-a8363121.html", "title": "Alden Ehrenreich on playing Han Solo: Harrison Ford taught me 'everything I need to know'", "description": "The actor talks candidly about entering the Star Wars universe, Solo’s change of director, and dealing with fame", "updated_time": "2018-05-22T14:21:55+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/22/12/alden-ehrenreich.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8363121"}, "description": "Before Alden Ehrenreich took on the biggest role of his life, he took a trip out to Death Valley in California. He hired a high-end tepee, drank green juice and contemplated what playing the young Han Solo would mean.  “I wanted to make sure I was really choosing to do this myself. And it wasn’t just because everybody in my life would think I was a lunatic if I said I didn’t", "keywords": "Solo: A Star Wars Story, Star Wars, Alden Ehrenreich, Ron Howard, Harrison Ford, Features, Film, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Solo: A Star Wars Story", "published_time": "2018-05-22T13:03:00+01:00", "modified_time": "2018-05-22T14:21:55+01:00", "section": "Features", "author_name": "James Mottram", "content_type": "story", "word_count": 1341, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 0}, "twitter": {"title": "Alden Ehrenreich on playing Han Solo: Harrison Ford taught me 'every…", "description": "Before Alden Ehrenreich took on the biggest role of his life, he took a trip out to Death Valley in California. He hired a high-end tepee, drank green juice and contemplated what playing the young", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1526990580.0, "source": "https://www.independent.co.uk", "summary": ""}