{"url": "https://www.bustle.com/p/john-krasinskis-new-the-office-reboot-comments-show-how-badly-he-wants-to-be-in-the-cast-8613460", "text": "When news of an Office reboot broke last December, Dunder Mifflin devotees did whatever the virtual version of holding a victory parade is. Some were wary though. When TVLine reported that Steve Carell wouldn't return as Michael Scott, it was only natural to wonder about the rest of the cast. Fortunately, John Krasinski wants to return for The Office reboot, he's just still not sure about all of the details. In a recent interview with IndieWire, the actor who played Jim Halpert — who you might say was the most down-to-earth character from the show — reassured everyone that he truly does want to take part in a reboot.\n\n\"It’s one of those things where I’m sure people don’t believe me when I say I would totally do it, because the truth is I would totally do it,\" Krasinski told IndieWire. It seems like he shares Jim's inimitable common sense. This isn't the first time that the actor expressed his interest in returning to Scranton, Pennsylvania either.\n\nKrasinski, who most recently directed and starred in the new thriller A Quiet Place, appeared on The Ellen Show last month and shocked everyone when he revealed that he had not been contacted about an Office revival. \"Guess who didn’t get a call? Me. What does that say? NBC is like, ‘You know who we didn’t like? Jim,'\" Krasinski told Ellen DeGeneres. Cue the Michael Scott hissy fit.\n\nNBC/YouTube\n\nYou would probably expect that after Krasinski's appearance on The Ellen Show, he would have received an immediate phone call from NBC's head honchos, but the actor told TheWrap that he's starting to doubt if the whole reboot was a giant rumor in the first place. \"I still have yet to get a call. I am surprised that after Ellen and all that — I haven’t gotten a call, so I haven’t heard anything about it, other than on the internet,\" Krasinski said. Then he joked, \"The internet is making the show. Twitter is shooting the Office reboot. I don’t know if any of us are going to be a part of it.\" Cue Dwight Schrute's face when he's being pranked.\n\nIt's true that not much is known about a 2018 reboot of The Office, but after TVLine reported that a reboot is in the works, the internet has become rife with speculations as to who will come back and who won't. In Krasinski's interview with IndieWire, the actor made a revival seem plausible just based on the fact that he and his Dunder Mifflin buddies have such a tight bond.\n\n\"Right until the end, we were a family, we were emotionally connected, we all cried our eyes out on the last day. Yeah, we were all moving on to other things, but not because we wanted to get off the show. It was sort of a magical existence,\" Krasinski told IndieWire. At the end of The Office's ninth and final season, Jim and his wife Pam (played by Jenna Fischer) moved to Austin Texas, which might complicate the couple's involvement in a Pennsylvania-centered reboot. Still, if there's a will, there's a way, and Krasinski has expressed that he definitely has a will to return to the hallowed halls of Dunder Mifflin.\n\n\"I think the U.K. thing that I always have pitched and wanted to do is that Christmas special thing, where we do a Christmas special this year and then two years from now, or three years from now, we do another one,” Krasinski told IndieWire. He continued “I love that idea coming back finding out where everybody is. I would totally be down for that.\"\n\nConsidering what a staple Jim was to that zany paper company, plenty of fans would also be excited about his return to The Office in any capacity.", "images": ["https://imgix.bustle.com/uploads/image/2018/3/27/c8ee553c-eae5-4efb-a3e9-ec3e4dffd2ff-screen-shot-2018-03-27-at-110806-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/3/27/c8ee553c-eae5-4efb-a3e9-ec3e4dffd2ff-screen-shot-2018-03-27-at-110806-am.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/630a9d05-b742-4adb-82c5-030cd815d6dc-fh_101_02597r1.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/af2e6901-e5ed-4ac0-aab9-f8c9e3176b4e-lizzie-mcguire-lizzie-gordo-photo.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/7/fa7c4b20-a0b1-4d5b-81f0-3b12babe6b25-getty-1181285233.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/30/03f83cfa-f58a-46f3-9458-f89e3a878b8b-getty-1211408233.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/3/27/c8ee553c-eae5-4efb-a3e9-ec3e4dffd2ff-screen-shot-2018-03-27-at-110806-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/john-krasinskis-new-the-office-reboot-comments-show-how-badly-he-wants-to-be-in-the-cast-8613460", "title": "John Krasinski’s New ‘The Office’ Reboot Comments Show How Badly He Wants To Be In The Cast", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/john-krasinskis-new-the-office-reboot-comments-show-how-badly-he-wants-to-be-in-the-cast-8613460", "type": "article", "title": "John Krasinski Says He Actually REALLY Wants To Join 'The Office' Reboot", "description": "When news of an Office reboot broke last December, Dunder Mifflin devotees did whatever the virtual version of holding a victory parade is. Some were wary though. When TVLine reported that Steve Carell wouldn't return as Michael Scott, it was only…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/3/27/c8ee553c-eae5-4efb-a3e9-ec3e4dffd2ff-screen-shot-2018-03-27-at-110806-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "When news of an Office reboot broke last December, Dunder Mifflin devotees did whatever the virtual version of holding a victory parade is. Some were wary though. When TVLine reported that Steve Carell wouldn't return as Michael Scott, it was only…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}