{"url": "metro.co.uk/2018/05/02/kate-middleton-age-birthday-children-net-worth-compares-meghan-markles-7515859/", "text": "What royal title Meghan Markle will have has been a topic of debate ever since Prince Harry confirmed their engagement in November last year.\n\nWill she be Princess Meghan? What about Duchess Meghan like Kate Middleton? How about Lady Meghan?\n\nOne thing's for sure: when Meghan - whose full name is Rachel Meghan Markle - marries Prince Harry, she will no longer simply be known as 'Meghan Markle'.\n\nPrince Harry and Meghan Markle will marry on Saturday 19 May (Picture: AFP/Getty Images)\n\nWhile the Royal Family are yet to confirm whether Harry will become a Duke upon marriage, historians have speculated what her name will change to when she marries Prince Harry on 19 May this year.\n\nIf Harry retains his current rank - His Royal Highness Prince Henry of Wales - it's believed Meghan will take on the feminine version of his title, becoming known as Her Royal Highness Princess Henry of Wales.\n\nBut if Harry becomes a Duke upon marriage, as he is widely expected to, Meghan will therefore become a Duchess, just like Kate Middleton became Catherine, Duchess Of Cambridge upon marriage to Prince William, Duke Of Cambridge.\n\nPrince Harry and Meghan Markle will marry on Saturday 19 May 2018 (Picture: Chris Jackson/Getty Images for the Invictus Games Foundation )\n\nRoyal Historian Marlene Koenig wrote on the blog Royal Musings that Meghan is most likely to become the Meghan, Duchess Of Sussex if, as it is widely believed, Harry takes the vacant rank of Duke Of Sussex.\n\n'Meghan would be HRH the Duchess of Sussex,' Joenig has previously told Royal Contral. 'Her rank would be a princess by marriage of the United Kingdom, Great Britain and Northern Ireland.'\n\nThis view is actually shared by a number of experts who previously predicted the title, that has sat vacant since 1843, would be given to Prince William before he became the Duke of Cambridge.\n\nOther titles available are Clarence and Buckingham.\n\nPrince Harry is currently busy prepared for his spring wedding (Picture: REUTERS/Joe Giddens/Pool)\n\nCatherine, Duchess Of Cambridge - who was just known as Kate Middleton before she married Prince William, Duke Of Cambridge in April 2011 - could also go by the name of HRH Princess William of Wales if she wished.\n\nSo why won't Meghan be given a Princess title?\n\nWhile she will become a princess by marriage, for someone to assume the title of Princess, they must be born into the Royal Family, just like Princess Charlotte is a Princess because of her father's status.\n\nHowever, if Harry and Meghan were to have children, they would not automatically be called Prince or Princess as there's another layer to the Princess rule.\n\nThe Prince of Wales is delighted to announce the engagement of Prince Harry to Ms. Meghan Markle. pic.twitter.com/zdaHR4mcY6 — Clarence House (@ClarenceHouse) November 27, 2017\n\nMeghan and Harry's children would be given the title of Lord or Lady, taking the surname Mountbatten-Windsor - a nod to Prince Philip's family name.\n\nIn 1960, the Queen passed a ruling which only entitled the children or the grandchildren of the sovereign to take the title of Prince or Princess.\n\nHowever, for the grandchildren to take the titles, they must be born to the sovereign's son - not daughter.\n\nIn the case of Zara and Peter Phillips, for example, they are the children of Princess Anne. Anne is the Queen’s daughter and as the children of the monarch’s daughter, they do not hold a royal title.\n\nZara Phillips, pictured with husband Mike Tindall, is not a Princess as she was born to the Queen's daughter - not a son (Picture: Max Mumby/Indigo/Getty Images)\n\nAll of their cousins are children of the monarch’s sons – Charles, Edward and Andrew – so their children do get the royal titles, such as Prince Andrew and Sarah, Duchess Of York's children Princess Beatrice and Princess Eugenie.\n\nHowever, in the case of Prince Edward, his and Sophie, Countess Of Wessex's children are not Prince or Princess.\n\nInstead, their daughter Louise, 14, is known as Lady Louise Windsor and their son James, 10, is known as James Viscount Severn.\n\nPrince Edward, Earl of Wessex, Sophie, Countess of Wessex, Lady Louise Windsor and James, Viscount Severn (Picture: Max Mumby/Indigo/Getty Images)\n\nWith Edward being given the Earl Of Wessex title upon marriage, he and Sophie decided to give their children the titles usually given to Earls' children to somewhat shield them from the royal spotlight.\n\nWhen Louise and James are older there is no law that would stop them from taking up the Prince and Princess titles, if they wish.\n\nSo why are Prince George, Princess Charlotte and Prince Louis allowed to carry the coveted titles?\n\nA 1917 ruling stated that HRH titles were limited to the Monarch, the Monarch's children and grandchildren and the Monarch's eldest-born's first grandson.\n\nThat would mean that only Prince George could have legally been called a Prince, while Charlotte and Louis would be Lady Charlotte Mountbatten-Windsor and Lord Louis Mountbatten-Windsor.\n\nPrince Louis in his mother's arms (Picture: PA)\n\nHowever, in 2012 - one year after Kate and William married - the Queen allowed all children of William and Kate - her great-grandchildren - to take the Prince or Princess titles too.\n\nThe ruling does mean, however, that Princess Charlotte's children are unlikely to be called Prince or Princess, just like Princess Anne's children were not.\n\nHarry and Meghan's prospective children could be upgraded to Prince or Princesses when the line of succession to the throne changes as Prince Charles ascends the throne.\n\nPrince Harry would then likely become HRH The Prince Henry, meaning Meghan would become HRH The Princess Henry.\n\nOf course the Queen may also choose to make an exception for Harry's children, like she did for William.", "images": ["https://d17fy28x8ov4h8.cloudfront.net/190x/images/a/ASOSLogo_9.png", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/g/groupon_9.png", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/a/AO_9.png", "https://metro.co.uk/wp-content/themes/metro-parent/img/fallback.png", "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=0px%2C111px%2C1625px%2C854px&resize=1200%2C630&zoom=1&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6034964&cv=2.0&cj=1", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/n/nord_logo_square_1x_9.png", "https://d17fy28x8ov4h8.cloudfront.net/210x/images/a/adidas_logo_BD1_9.png", "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&zoom=1&resize=644%2C408&ssl=1"], "top_img": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=0px%2C111px%2C1625px%2C854px&resize=1200%2C630&zoom=1&ssl=1", "keywords": [], "authors": ["Amy Duncan"], "canonical_link": "https://metro.co.uk/2018/05/02/kate-middleton-age-birthday-children-net-worth-compares-meghan-markles-7515859/", "title": "Kate Middleton age, children and net worth compared to Meghan Markle", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "format-detection": "telephone=no", "robots": "max-image-preview:large", "google-site-verification": "NRfCb8mBNAy5_f17NpvLZYoY38EzM2dgpcOh_Am9yps", "twitter": {"widgets": {"csp": "on"}, "image": {"src": "https://metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=0px%2C111px%2C1625px%2C854px&resize=1200%2C630"}, "title": "Kate Middleton age, children and how her net worth compares to Meghan Markle's", "description": "Which sister-in-law is worth more?", "card": "summary_large_image", "site": "@MetroUK", "account_id": 138749160}, "ir-site-verification-token": 422605026, "description": "Kate Middleton might be a senior member of the Royal Family but she's certainly not got her feet up. She's mother to Prince William's three children - Prince George, who...", "news_keywords": "kate middleton, duchess of cambridge, william and kate, meghan markle, princess kate, duchess kate, kate middleton wedding dress, kate middleton children, kate middleton birthday, kate middleton age", "msvalidate.01": "11110DC8D42E74E13F24B3A18E7CFB8A", "generator": "WordPress 5.4", "fb": {"pages": "117118184990145,427889824264313", "app_id": 176908729004638}, "ia": {"markup_url": "https://metro.co.uk/2018/05/02/kate-middleton-age-birthday-children-net-worth-compares-meghan-markles-7515859/?ia_markup=1"}, "theme-color": "#000000", "apple-mobile-web-app-title": "Metro", "sailthru.date": "2018-05-02 15:22:44", "sailthru.title": "Kate Middleton age, birthday, children and how her net worth compares to Meghan Markle’s", "sailthru.tags": "kate middleton duchess of cambridge, meghan markle duchess of sussex, prince harry, prince william duke of cambridge, royal family, royal wedding", "sailthru.description": "Which sister-in-law is worth more?", "sailthru.image.full": "https://metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=298px%2C0px%2C1032px%2C1031px&resize=150%2C150", "sailthru.image.thumb": "https://metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=298px%2C0px%2C1032px%2C1031px&resize=150%2C150&w=50", "og": {"locale": "en_GB", "title": "Kate Middleton age, children and how her net worth compares to Meghan Markle's", "type": "article", "url": "https://metro.co.uk/2018/05/02/kate-middleton-age-birthday-children-net-worth-compares-meghan-markles-7515859/", "description": "Which sister-in-law is worth more?", "site_name": "Metro", "image": {"identifier": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=0px%2C111px%2C1625px%2C854px&resize=1200%2C630&zoom=1&ssl=1", "secure_url": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/05/628629432-e1525270470780.jpg?quality=90&strip=all&crop=0px%2C111px%2C1625px%2C854px&resize=1200%2C630&zoom=1&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MetroUK", "section": "News", "tag": "Royal wedding", "published_time": "2018-05-02T15:22:44+0000", "modified_time": "2019-12-12T17:28:11+0000"}, "msapplication-TileImage": "https://metro.co.uk/wp-content/uploads/2020/03/cropped-m-icon-black-9693.png?w=270"}, "movies": [], "publish_date": 1525190400.0, "source": "http://metro.co.uk", "summary": ""}