{"url": "https://people.com/music/lil-peep-memorial-service-family-friends/", "text": "Friends, fans and family gathered to pay tribute to late rapper Lil Peep during a memorial service on Saturday.\n\nLil Peep (whose real name was Gustav Åhr) died on Nov. 15 from a suspected drug overdose, although a definitive cause of death will not be determined until full toxicology results are published. He was 21.\n\nGet push notifications with news, features and more.\n\nThe service, which took place in the rapper’s hometown of Long Beach, New York, was announced on the late rapper’s official Instagram account, and promised to be a celebration of his “fascinating colorful life.”\n\nPeep’s grandmother Jenny Kastner began the memorial — which you can watch in the video above — by commenting on the number of fan letters she’d read since his passing, and how touched she was by how many of the rapper’s fans seemed to “really get him.”\n\n“I don’t know of any famous person that’s let the outside regular people like me, that aren’t famous, into their lives,” wrote one fan. “He was completely unique, a gift from God that was handed to us for a short period of time to change the world for the better.”\n\nWhile another fan wrote that: “He wasn’t the modern-day Kurt Cobain, by the way. He is the first and only Lil Peep, and arguably left behind a legacy that will have a far greater impact. His kindness will live on through lots of people.”\n\nLater in the service, Peep’s mother, Liza Womack, pointed out that despite appearances, her son was vulnerable too.\n\n“He hurt terribly when his friends said he was no longer welcome in their homes. Once he had stopped performing well in school and had stopped playing sports,” she said. “Long before that though, Gus understood that many good people suffered injustice because of what they looked like or how much money they had.”\n\n“He saw how the cool kids who lived in the fancy neighborhoods looked down on his friends — and looked down on his own family who lived in an apartment and drove an old Nissan. Gus got fed up with that world. He rejected it and he rejected being molded into a box,” she continued. “[And] when he locked himself in the garage and got his first tattoo, he began to make his rejection of the box public.”\n\nImage zoom Lil Peep Swan Gallet/WWD/REX/Shutterstock\n\nHis mother implored his fans not to “make assumptions about people or events in ignorance.” Womack added, “Ask yourself these questions: ‘Do I really know this person? Have I sat down face to face and asked him to tell me about himself? … Am I dismissing this person because he does not match my definition of a “good kid” ?’ ”\n\nShe also shared a detail about her son that even his most loyal fans might find surprising. “Gus and his housemates had a weekly Frank Sinatra night,” she added. “His favorite song to sing was ‘Fly Me to the Moon,’ and he was f—ing good at singing it.”\n\nRELATED VIDEO: Lil Peep Dead At 21: Emotional Bella Thorne Mourns Rapper Ex as Celebs Pay Tribute\n\nImage zoom Lil Peep Venturelli/WireImage\n\nEmma Harris, a longtime friend — and former girlfriend — of the deceased rapper, talked about how she started falling in love with him in the fifth grade because she had “never met anyone who colored his hair more than me.”\n\n“He’d make me laugh until I cried,” she said. “I don’t think it’s physically possible to shed more tears for anyone.”\n\nShe also added that before his career took off, Peep “always knew he’d be something more. And I can truly say that I don’t think anybody who knew him doubted that.”\n\nImage zoom Lil Peep Scott Dudelson/Getty\n\nIt was recently reported that police are investigating whether the powerful opioid drug fentanyl may have played a role in Peep’s death.\n\nPolice are said to have received “multiple tips” that Peep was in possession of “incredibly toxic drugs laced with the potent opioid.” The Tucson Police Department have not yet confirmed the reports.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Flil-peep-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-21.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=888&h=465&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-bella-5.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=888&h=465&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-bella-5.jpg", "keywords": [], "authors": ["Maria Pasquini"], "canonical_link": "https://people.com/music/lil-peep-memorial-service-family-friends/", "title": "Lil Peep Remembered Through Emotional Memorial Service", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Death,Lil Peep,Music News,News", "news_keywords": "Death,Lil Peep,Music News,News", "description": "On Saturday, an emotional memorial service was held for rapper Lil Peep in his hometown of Long Beach, New York", "og": {"title": "Lil Peep Remembered in Emotional Memorial Service by His Family and Friends", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/lil-peep-memorial-service-family-friends/", "description": "Friends, fans and family gathered to pay tribute to late rapper Lil Peep&nbsp;during a&nbsp;memorial service&nbsp;on Saturday. Lil Peep (whose real name was Gustav Åhr) died&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=888&h=465&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-bella-5.jpg", "width": 888, "height": 465}}, "pinterest": {"url": "https://people.com/music/lil-peep-memorial-service-family-friends/", "description": "On Saturday, an emotional memorial service was held for rapper Lil Peep in his hometown of Long Beach, New York", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-bella-5.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/lil-peep-memorial-service-family-friends/", "title": "Lil Peep Remembered in Emotional Memorial Service by His Family and Friends", "description": "On Saturday, an emotional memorial service was held for rapper Lil Peep in his hometown of Long Beach, New York", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=888&h=465&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Flil-peep-bella-5.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}