{"url": "https://en.wikipedia.org/wiki/Billy_Ray_Cyrus", "text": "American singer-songwriter, actor and film producer\n\nBilly Ray Cyrus (born August 25, 1961)[1][2] is an American singer-songwriter and actor.[3][4][5] He has released 16 studio albums and 53 singles since 1992, and is known for his number one single \"Achy Breaky Heart\", which became the first single ever to achieve triple platinum status in Australia. It was also the best-selling single in the same country in 1992.[6][7] Due to the song's music video, the line dance rose in popularity.[8][9][10][11]\n\nCyrus, a multi-platinum selling recording artist, has scored a total of eight top-ten singles on the Billboard Hot Country Songs chart. His most successful album to date is his debut Some Gave All, which has been certified 9× Multi-Platinum in the United States and is the longest time spent by a debut artist at number one on the Billboard 200 (17 consecutive weeks) and most consecutive chart-topping weeks in the SoundScan era.[12][13] It is the only album (from any genre) in the SoundScan era to log 17 consecutive weeks at number one and is also the top-ranking debut album by a male country artist. It ranked 43 weeks in the top 10, a total topped by only one country album in history, Ropin' the Wind by Garth Brooks.[14] Some Gave All was also the first debut album to enter at number one on the Billboard Top Country Albums chart.[15] The album has also sold more than 20 million copies worldwide and is the best-selling debut album of all time for a solo male artist. Some Gave All was also the best-selling album of 1992 in the US with 4,832,000 copies.[16][17] In his career, he has released 36 charted singles, of which 17 charted in the top 40. In 2019, Cyrus earned his first number-one single on the US Billboard Hot 100 as a featured artist on a remix of Lil Nas X's song \"Old Town Road\", which has spent a record-breaking nineteen consecutive weeks at the top spot (eighteen of them credited to Cyrus). It also spent a record-breaking twenty consecutive weeks (nineteen of them credited to Cyrus) at the top spot on the Billboard Hot R&B/Hip-Hop Songs and Billboard Hot Rap Songs.[18][19][20] Thanks to the song, Cyrus won his first two Grammy Awards, in the categories Best Pop Duo/Group Performance and Best Music Video.[21]\n\nFrom 2001 to 2004, Cyrus starred in the television show Doc. The show was about a country doctor who moved from Montana to New York City. From 2006 to 2011, he co-starred in the Disney Channel series Hannah Montana with his daughter Miley Cyrus. From 2016 to 2017, he starred as Vernon Brownmule on the CMT sitcom Still the King.\n\nEarly life\n\nBilly Ray Cyrus[1] was born on August 25, 1961 in Flatwoods, Kentucky, to Ron Cyrus, a politician and former steelworker,[22] and his wife, the former Ruth Ann Casto.[23][24] Cyrus started singing at the age of four. His parents divorced in 1966. His grandfather was a Pentecostal preacher. Growing up, he was surrounded by bluegrass and gospel music from his family. His right-handed father played guitar, however left-handed Cyrus tried to play his father's guitar, but could not. He attended Georgetown College on a baseball scholarship before changing to music. He dropped out of Georgetown during his junior year, realized he wanted to become a musician after attending a Neil Diamond concert, and set a 10-month goal to start a career.[22] In the 1980s, he played in a band called Sly Dog, before signing a record contract with Mercury Nashville Records.[25] Sly Dog was named after a one-eyed dog that Cyrus owned.[22]\n\nMusic career\n\nThe Mercury Records years\n\nWhile trying to get a recording contract in Los Angeles, Cyrus suffered many hardships including living in his neighbor's car. However, in 1990, he was signed to PolyGram/Mercury. That same year, he opened for Reba McEntire.[22] Cyrus began to record and write music for his debut album, released in 1992.\n\nSome Gave All was released in 1992. The album became an instant chart and sales success. It debuted at No. 1 on the Billboard Top Country Albums, Billboard 200, Canadian Country Albums chart, Canadian Albums Chart, and on the charts of several other foreign countries. The album featured four consecutive top 40 singles on the Hot Country Songs chart from 1992 to 1993, including an album cut, the title track. The most successful single released was \"Achy Breaky Heart\". It reached No. 1 on the Hot Country Songs chart and was also a hit on the Billboard Hot 100, where it reached No. 4. Uniquely for a country music song it also became an international success, reaching number 1 in Australia and number 3 on the UK Singles Chart. Thanks to the video of this hit, there was the explosion of the line dance into the mainstream, becoming a global craze.[8] Although the song was the only number one single, \"Could've Been Me\" reached No. 2, \"Wher'm I Gonna Live?\" reached No. 23, and \"She's Not Cryin' Anymore\" reached No. 6. Some Gave All was certified 9× Multi-Platinum in the United States in 1996, and has sold over 20 million copies worldwide.\n\n[26] Cyrus singing at the Spirit of America tour, October 5, 2005\n\nIn 1993, Cyrus and Mercury Records quickly released Cyrus' second studio album, It Won't Be the Last. The album featured four singles; however, only three made the top 40. The album debuted at No. 1 on the Country charts, and No. 3 on the Billboard 200. By the end of the year, It Won't Be the Last was certified Platinum by the RIAA. The highest charting single, the lead-off single, \"In the Heart of a Woman\", charted to No. 3, with \"Somebody New\" charting to No. 9, \"Words By Heart\" at No. 12, and \"Talk Some\" at No. 63. Also in 1993, Cyrus appeared on Dolly Parton's single \"Romeo\"; though the single only reached 27 on the country singles charts, the accompanying video was popular on CMT.\n\nCyrus' third studio album, Storm in the Heartland, was released in 1994. It was the final album he recorded for PolyGram, as they closed their doors in 1995. The album was not as successful as its predecessors. It only reached No. 11 on the Country albums chart, and only the title track made the top 40 of the Country singles chart. \"Deja Blue\" was the second single released; however, it only managed to chart to No. 66, and the third and final single, \"One Last Thrill\", failed to chart at all.\n\nThe album only managed to be certified Gold in the U.S. Before Cyrus started on his next album, he was transferred to Mercury Nashville.\n\nAlso in 1994, Cyrus contributed the song \"Pictures Don't Lie\" to the AIDS benefit album Red Hot + Country produced by the Red Hot Organization.\n\nCyrus' most critically acclaimed album was 1996's Trail of Tears on Mercury Records. The album debuted at No. 20 on the Country chart when released. Only two songs made the cut to radio, although neither one hit the top 60. The title track and \"Three Little Words\" reached No. 69 and No. 65 respectively. The album failed to reach any certification, and was on and off the charts after only four weeks.\n\nIn 1998, Cyrus released his last album for Mercury Records Shot Full of Love. The album became his lowest-peaking album, debuting at No. 32. The first single, \"Under the Hood\", failed to chart, \"Time for Letting Go\" hit No. 70, \"Busy Man\" charted No. 3, and \"I Give My Heart to You\" reached No. 41. After the single fell from the charts, Cyrus left Mercury's roster and signed with Monument Records in 1999.\n\nHis debut album for Monument, Southern Rain, was released in 2000. It debuted at No. 13 on the Country albums chart and No. 102 on the Billboard 200. Five singles were released and all five charted. The lead-off single, \"You Won't Be Lonely Now\", was the highest-peaking single from the album, charting to No. 17. Other singles include \"We the People\" (#60), \"Burn Down the Trailer Park\" (#43), \"Crazy 'Bout You Baby\" (#58), and the title track (#45).\n\nShift to Christian music\n\nAfter the singles from Southern Rain finished their chart runs, Cyrus recorded two Christian albums. Both albums, Time Flies and The Other Side, were released in 2003. The first album debuted and peaked at a low No. 56 on the Country album charts. Three singles were released; however, only the final single reached the charts. \"Bread Alone\", \"What Else Is There\", and \"Back to Memphis\" were released, and \"Back to Memphis\" charted to No. 60.\n\nThe second Christian album, The Other Side, was recorded while Cyrus filmed his PAX series, Doc. It debuted at No. 5 on the Top Christian Albums chart, No. 18 Top Country Albums, and No. 131 on Billboard 200. Two of three singles charted – \"Face of God\" (#54) and \"The Other Side\" (#45) – while \"Always Sixteen\" did not chart.\n\nDisney Entertainment\n\nThe album Wanna Be Your Joe was Billy Ray's first country album since 2000's Southern Rain. As with its preceding albums, it too, was recorded on a new record label: New Door/UMe Records. It was released while Cyrus was filming the show Hannah Montana. Wanna Be Your Joe made it to No. 24 on the Country charts and No. 113 on the all-genre charts. The album initially sold well, but no hit-single was released. The title track was released as the first single, and was followed by \"I Want My Mullet Back\", both of which were ignored by country radio. Although not released as a single, a music video was made for the track \"Stand\", a duet with daughter Miley Cyrus.\n\nAlso in 2006, Billy Ray appeared with metal-rock group Metal Skool (now Steel Panther), and performed several songs including \"Rebel Yell\" by Billy Idol, and the song \"I Want My Mullet Back\", which appears on Wanna Be Your Joe.[27]\n\nHe also sang \"The Star Spangled Banner\" at Game 5 of the 2006 World Series in St. Louis, Missouri.\n\nCareer re-launch\n\nIn mid-2007, Cyrus was a celebrity contestant on the 4th season of the show Dancing with the Stars. Cyrus was partnered with Karina Smirnoff. He quickly became a fan favorite. Cyrus and Smirnoff made it to the semi-finals, where they finished in 5th place.\n\nFrom Cyrus's exposure on Dancing with the Stars and Hannah Montana, his record label pushed up the release date by a month for his new album. Home at Last was released in July 2007 on Walt Disney Records. It debuted at No. 3 on the country charts, making it Cyrus' first top 5 entry since 1993. Beginning sales for the album were very strong; however, the album failed to be certified. The single \"Ready, Set, Don't Go\", was initially released as a solo single. The solo version made it to No. 33 on the Hot Country Songs chart.\n\nIn October 2007, Cyrus and his daughter Miley performed a duet version of the song on Dancing with the Stars. The duet of the song debuted at No. 27 on the Country charts and eventually peaked at No. 4 in 2008, giving Billy Ray his first top 5 single since 1999, as well as Miley's first top 5 on any Billboard chart.\n\nCyrus was a part of the Disney collection Country Sings Disney in 2008. Two of his songs, \"Ready, Set, Don't Go\" and the Sheryl Crow-penned song \"Real Gone,\" appeared on the album. Billy Ray's version of \"Real Gone\" was also made into a music video that is in rotation on both CMT and GAC; the song also appears on Back to Tennessee.\n\nNew label and newfound chart success\n\nKids Inaugural Event on January 19, 2009 Cyrus singing at theon January 19, 2009\n\nIn late 2008, his website confirmed that a new studio album would be released by the end of the year from Lyric Street Records, entitled Back to Tennessee. The album was originally planned to be released on October 21, 2008, but was pushed back to November 18. When the album was not released, it was announced for a January 13, 2009 release.[28] The first single, \"Somebody Said a Prayer\", debuted at No. 53 in August 2008 and reached No. 33 in November of that year. On March 14, 2009, the album's title track debuted at No. 59 on the country singles chart and a month later on April 7, Back to Tennessee was released. The song only charted to No. 47 after 11 weeks. A third single, \"A Good Day\", debuted at No. 60 on the country charts for the chart week of September 5, 2009.\n\nIt was less successful in its first week out as Home at Last. It only reached No. 13 on the charts and only sold approximately 14,000 copies in its opening week. The album's release date coincided with the release of Hannah Montana: The Movie. The song \"Back to Tennessee\" was included on the movies soundtrack, as well as a duet with Miley Cyrus, entitled \"Butterfly Fly Away\". The latter song would peak at No. 56 on the Billboard Hot 100 and at No. 50 and Canadian Hot 100.\n\nOn November 12, 2008, Billy Ray and Miley presented the \"Song of the Year\" award at the 42nd Annual Country Music Association Awards. Prior to the award show, both Billy Ray and Miley performed on Good Morning America. In December 2008, Cyrus made a cameo in Metro Station's video, \"Seventeen Forever\".[29]\n\nShortly after the chart debut of Back to Tennessee's third single, \"A Good Day\", Cyrus and Lyric Street Records parted ways after only one album.[30]\n\nCyrus, Phil Vassar, Jeffrey Steele, and John Waite then formed a new supergroup together in early 2009 called Brother Clyde.[31] On Twitter, Cyrus confirmed the supergroup, saying they just cut the first single from the new album, Lately.[32]\n\nOn June 30, 2010, Cyrus said about the new alternative rock group, Brother Clyde, that the old members would be substituted by Samantha Maloney, Jamie Miller, Dan Knight, and Dave Henning. Also, he said that their single, \"Lately\", was available on iTunes and that their debut album would be out on August 10, 2010.[33]\n\n2010–2019: Post-Brother Clyde\n\nIn late 2010, Cyrus suspended his activities in the band Brother Clyde, and announced the release of his new solo patriotic album, entitled I'm American. Initially scheduled to be released in November 2010, it was pushed back to a May 24, 2011 release with a re-recording of \"Some Gave All\" that featured guest vocals from Darryl Worley, Jamey Johnson and Craig Morgan being released as the lead-off single. However, in April 2011, the single was changed to \"Runway Lights\". I'm American was released on June 28, 2011. A second single, \"Nineteen\", was released in August 2011. The song entered the Hot Country Songs chart for the week of October 8, 2011, where it debuted at number 58, becoming Cyrus' first charted single since \"A Good Day\" in 2009.\n\nCyrus released the album Change My Mind on October 23, 2012. Its first single, the title track, was released on September 6.\n\n2019: \"Old Town Road\" remix and popular resurgence\n\nAfter Billboard removed American rapper Lil Nas X's country-rap song \"Old Town Road\" from their Country chart, Cyrus was featured in the remix.[34] The remix rose to number one on the Billboard Hot 100, unseating the original mix of the song and giving Cyrus his first number one song on the Hot 100.[35] The song was nominated for various Grammy Awards, winning Best Pop Duo/Group Performance and Best Music Video.[21]\n\nActing career\n\nCyrus starred in the 1999 independent film Radical Jack. He also had a small part in David Lynch's 2001 film Mulholland Drive as Gene, a pool cleaner who had been having an affair with the wife of Adam Kesher (Justin Theroux). In 2001, Cyrus played the lead role on the PAX (now ION Television) comedy-drama Doc, which became the network's highest-rated show. In 2005, Cyrus expanded his acting career in a stage production of Annie Get Your Gun in Toronto, appearing in the role of Frank Butler.[36]\n\nCyrus' television credits include The Nanny, Diagnosis Murder, Love Boat, The Next Wave, and TNN's 18 Wheels Of Justice. In 2004, he guest-starred as a limo driver in the episode \"The Power of Love\" of the Canadian teen drama Degrassi: The Next Generation. Cyrus has also been the subject of many television specials that detail his rise to fame and his career. These include two ABC documentaries, Billy Ray Cyrus: Dreams Come True and Billy Ray Cyrus: A Year on the Road, a VH1 exclusive, as well as the TNN specials I Give My Heart To You, and The Life and Times of Billy Ray Cyrus. In late 2005, Cyrus and his daughter Miley Cyrus began co-starring in the Disney Channel original television series, Hannah Montana, which premiered on March 24, 2006.\n\nIn March 2007, Cyrus joined several other celebrities to take part in the fourth season of the US version of Dancing with the Stars.[37] He and his partner Karina Smirnoff, were eliminated in the eighth week (May 8, 2007) after having also placed in the \"bottom two\" the week before.[38]\n\nCyrus also starred in Jackie Chan's movie The Spy Next Door. It was shot in Albuquerque, New Mexico and released in January 2010.\n\nCyrus sits on the advisory board of a conservative group called the Parents Television Council.[36]\n\nIn 2010, it was announced that he and his son Trace Cyrus would take part in a new Syfy reality series called UFO: Unbelievably Freakin' Obvious.[39][40][41]\n\nPersonal life\n\nFrom 1986 to 1991, Cyrus was married to Cindy Smith, with whom he co-wrote the songs \"Wher'm I Gonna Live?\" and \"Some Gave All\", both of which were featured on his 1992 debut album Some Gave All.[22] They divorced.\n\nDuring the time he was single, Cyrus had relationships with Kristin Luckey and Leticia \"Tish\" Finley. He fathered two children, who were both born in 1992: his first child Christopher Cody (born April 1992), who was raised by his mother Kristin in South Carolina;[42] and Miley Cyrus, born November 1992. Cyrus had pledged to Luckey to support her and their child.[43][44][45]\n\nOn December 28, 1993, Cyrus secretly married \"Tish\" Finley (born May 13, 1967), against his record company's advice. She was pregnant with their second child, son Braison.[43][2][46][43][44][45] They have three children together: Miley Ray (born as Destiny Hope in 1992), Braison Chance (born 1994), and Noah Lindsey Cyrus (born 2000). He also adopted the two young children whom Finley brought to the marriage: daughter Brandi (born 1987); and son Trace (born 1989).[47][47] Brandi has had some acting roles, and Trace is now the singer/guitarist for Metro Station.\n\nThe family lived for a time on a 500-acre (2.0 km2) farm in Thompson's Station, Tennessee, near Nashville.[48] They moved to Los Angeles for the filming of the series Hannah Montana, in which daughter Miley starred. Brandi Cyrus also had roles in the series: in the episode, \"Yet Another Side of Me,\" as Customer No. 1 and in the season 4 episode, \"Been Here All Along\", as the Guitarist.[49]\n\nOn October 26, 2010, Cyrus filed for divorce in Tennessee, citing irreconcilable differences.[50] But the next year, in March 2011, Cyrus said he had dropped the divorce.[51]\n\nOn June 13, 2013, Tish filed for divorce after 19 years of marriage, citing irreconcilable differences with Cyrus.[52] In July 2013 the couple was reported to be in therapy and dropped the divorce.[53] In 2017, the second divorce case was officially dismissed by the court since the couple failed to appear.[54]\n\nAlthough Cyrus's song \"We the People\" was used as a campaign song by Republican George W. Bush in his 2000 presidential campaign, Cyrus was reported as saying that he had been a lifetime Democrat.[55]\n\nDiscography\n\nStudio albums\n\nCompilation albums\n\nFilmography\n\nFilm\n\nTelevision\n\nProducer Year Title Notes 2009 Hannah Montana: The Movie 2011 Surprise Homecoming 8 episodes 2016 Still the King 26 episodes\n\nSee also\n\nReferences\n\nFurther reading", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Billy_Ray_Cyrus_2009_%28cropped%29.jpg/220px-Billy_Ray_Cyrus_2009_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Billy_Ray_Cyrus_at_Kids_Inaugural_Concert.jpg/220px-Billy_Ray_Cyrus_at_Kids_Inaugural_Concert.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Billy_Ray_Cyrus_2009_%28cropped%29.jpg/1200px-Billy_Ray_Cyrus_2009_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Billy_Ray_Cyrus_Tour.jpg/220px-Billy_Ray_Cyrus_Tour.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/First_Lady_Melania_Trump_Meets_with_Billy_Ray_Cyrus_and_the_Smith_Family_%2849118308978%29.jpg/220px-First_Lady_Melania_Trump_Meets_with_Billy_Ray_Cyrus_and_the_Smith_Family_%2849118308978%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Billy_Ray_Cyrus_2009_%28cropped%29.jpg/1200px-Billy_Ray_Cyrus_2009_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Billy_Ray_Cyrus", "title": "Billy Ray Cyrus", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Billy_Ray_Cyrus_2009_%28cropped%29.jpg/1200px-Billy_Ray_Cyrus_2009_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}