{"url": "https://io9.gizmodo.com/the-biggest-winners-and-losers-of-san-diego-comic-con-2-1827827459", "text": "Comic-Con 2018 has come to a close, and whether io9 staff were seeing it up close and personal in San Diego or watching from afar back home, we experienced a lot. There was good and bad this year, as always, but we have to admit this time around we were pleasantly surprised by just how great the convention was.\n\nAdvertisement\n\nWe’re all still recovering from the exhausting convention, so forgive our uneven distribution of “winners” and “losers” among the staff—we don’t all fall in either “fangasm” or “grumpy Gus” territory. Overall, we thoroughly enjoyed ourselves. Without further ado, here are io9's winners and losers of Comic-Con 2018.\n\nWinners\n\nThe Clone Wars Is Saved!\n\nThere was no greater surprise this year at Comic-Con than the announcement that was made at the 10th anniversary panel for the beloved Clone Wars animated series. Fans had long accepted the series as having come to a close, even if it didn’t quite get to end the way Lucasfilm Animation had planned it to. And yet, there were no leaks, no real solid rumors that it was even possible the show could get one last hurrah—after all, Rebels only just ended earlier this year, and Resistance is on the way. So to see a trailer announcing 12 brand new episodes of the series, building on ideas the Clone Wars crew have been teasing for years at this point, was simply mindblowing. Ahsoka Tano was right: It has been awhile, but it was worth the wait to get this incredible news. —James Whitbrook\n\nIron Fist Looks...Good?\n\nDespite the fact that he’s the titular hero of the series, Danny Rand was one of the most disappointing parts of Iron Fist’s first season for a number of different reasons, one of the most egregious being that you could clearly tell actor Finn Jones really hadn’t committed himself to learning his fight choreography. With the first season still clearly in everyone’s minds, the anticipation during the show’s panel at this year’s San Diego Comic-Con wasn’t exactly high, but as Marvel’s head of television Jeph Loeb gave the audience a look at a number of scenes from Iron Fist’s second season, it became immediately clear that Jones got it together. Not only are Danny’s fights going to be slicker, more technically complicated, and gorgeous to watch, everyone who’s coming back this season is working on a higher level that’s going to make the next chapter of the Iron Fist saga something to legitimately get hyped about. —Charles Pulliam-Moore\n\nTGIF Playlist: 4/20 Weekend Vibes Read on The Inventory\n\nDoctor Who’s Jodie Whittaker Had a Blast\n\nDoctor Who fans were already quivering with excitement that the show’s Comic-Con presence would give us our first-ever glimpse of the next season, and a chance to see the show’s first female Doctor strut her stuff. But beyond that stunning trailer, Comic-Con 2018 was also the first major chance for Whittaker to interact with Who fandom at large, and she grabbed that chance with both hands. From the fun video heralding her arrival at the panel, to surprising audiences at the Her Universe Fashion Show, to meeting the cutest little cosplayers and kicking ass at Entertainment Weekly’s annual all-women panel celebrating female heroes, it was clear: The Doctor was in, and we loved her. —James\n\nAdvertisement\n\nCastle Rock’s Introduction to Stephen King’s Amalgam Universe\n\nHollywood has long had a deep love for Stephen King, but the hunger for adaptations of the horror author’s works has escalated mightily thanks to the blockbuster success of It. Hulu series Castle Rock has an offbeat premise that sets it apart from the rest: it tells an original story inspired by King’s favorite fictional small town, a place where the top employer is Shawshank prison and nearly every household’s hiding a few grisly secrets. Diehard King fans will enjoy the Easter eggs that weave into the narrative, but anyone who digs slow-burn, creepy psychological horror will want to tune into the show, which had its world-premiere screening at Comic-Con. —Cheryl Eddy\n\n\n\nAdvertisement\n\nStar Trek: Discovery Loosens Up\n\nThe first season of Star Trek: Discovery could get a little too grim and self-serious for its own good, but what we saw of the show’s second season at Comic-Con gave us a lot of hope that the bright optimism of Star Trek would shine strongly for the Discovery’s sophomore outing. Questionable use of Lenny Kravitz aside, the trailer was filled with fun humor and a grand sense of adventure and exploration—especially thanks to Anson Mount’s arrival as the pre-Kirk Captain of the Enterprise, Christopher Pike, who seems to be having the time of his life both in front of and behind the Trek cameras. —James\n\nAdvertisement\n\nJamie Lee Curtis at the Halloween Panel\n\nAnyone who has attended a Comic-Con panel knows that the portion of the event that’s set aside for audience questions is usually pretty forgettable, if not downright excruciating. That was not the case at the Halloween panel, where one fan stepped up to the Hall H mic and shared an incredible, deeply personal story about how he survived a very scary situation by drawing inspiration from Jamie Lee Curtis’ character in the horror classic. The man (who was wearing a “Haddonfield High” t-shirt) received a standing ovation from the audience, and Curtis herself got up from the stage to give him a hug. It was one of Comic-Con’s emotional high points, not just this year but any year. —Cheryl\n\nAdvertisement\n\nSupergirl’s Historic Announcement\n\nSupergirl’s upcoming fourth season will focus on how the world begins to accept racist anti-alien sentiment in the wake of a devastating invasion that pushes Supergirl to her limits. While that story is particularly timely given our political climate, the show is also making a powerful statement about the importance of on-screen representation with the introduction of Nia Nil, a reimagined version of the Legion of Superheroes character Dream Girl, who next season will be a transgender reporter played by transgender actress and activist Nicole Maines. While the fact that Nia is trans might not play a huge role in her character’s arc this season, her introduction in the show is momentous because she’ll be the first transgender superhero on network television. Not only that, but Supergirl just single-handedly proved something we should all know to be true: It’s not at all hard to actually cast transgender people to play transgender characters. —Charles\n\nAdvertisement\n\nPeople Outside of the Convention Center\n\nThere were thousands and thousands of fans crammed into the San Diego Convention Center every day of Comic-Con, taking in panels and roaming the main floor, but some of the most fun and creative activities were actually the off-site pop-up events. While everything in and around Comic-Con requires waiting in line, this year it was actually worth it for those who ventured out to eat at Taco Bell’s Demolition Man restaurant, shop for supplies at the Purge City Emporium, totally immerse themselves in the DC Universe’s new streaming shows, or join a group therapy session to work through their lingering grief over the end of Avengers: Infinity War. Sure, it’s all marketing, but when it’s this clever, fun, and/or tasty, we can’t really complain. —Cheryl\n\nAdvertisement\n\nAmazing Animation\n\nEven though there were a number of epic trailers for live-action movies that got everyone excited during this year’s Comic-Con, the animation presentations held their own and really demonstrated just how much more bold and imaginative the medium is in general right now. Nickelodeon’s upcoming Teenage Mutant Ninja Turtles show is getting back to the original series’ more mystical roots while also reimagining the iconic characters in a dynamic way that makes them feel fresh and fun. Voltron’s giving the fandom the representation it craves by introducing Shiro’s boyfriend Adam and teasing that a new Lion might be in the works that would completely transform the Legendary Defender. As impressive as the lines for Hall H were, the energy in the Steven Universe line was palpable—and the show’s panel delivered tens across the board with a surprise presentation of the newest episode “Legs From Here to Homeworld” and the announcement of a forthcoming movie that’ll see the Crystal Gems facing a new foe. Hell, Invader Zim’s coming back, Disenchantment actually looks kinda good, and The Dragon Prince is definitely a series to look out for. We’re living in a golden age of television and a lot of it in the near future is going to be animated. —Charles\n\nAdvertisement\n\nWarner Bros.’ DC Movies Seize the Moment\n\nAt a Comic-Con with no major Marvel Studios presence, Warner Bros. and DC Entertainment had an opportunity they couldn’t afford to squander—a great chance to get fans really hyped for their next few movies. They didn’t just take the chance, they reveled in it, delivering a disarmingly charming first look at Shazam! (which looks like a lovingly goofy movie that strikes at the heart of the DC movieverse’s “grimdark” reputation) and an epic pulpy trailer for Aquaman, bright and bold and jam-packed with underwater action. If that wasn’t enough, fans in attendance got to bring the house down for an extremely early glimpse of the still-weeks-into-filming Wonder Woman 1984, and it sounds like was an absolute blast. DC came out of Comic-Con like royalty, and it deserved to. —James\n\nAdvertisement\n\nKevin Smith Pays Tribute to Jon Schnepp\n\nNot all news at Comic-Con this year was happy—Wednesday brought word that writer-director Jon Schnepp, the architect behind The Death of Superman Lives and Metalpocalypse, tragically passed away after suffering a stroke. Schnepp’s legacy in pop culture criticism was honored by Kevin Smith at his Hall H panel on Sunday, a fitting tribute to a writer and director beloved by many. —James\n\nAdvertisement\n\nLosers\n\nHashtag Hall H Problems\n\nHall H was a bit of a mess this year. Thousands of fans waited for hours, or even overnight, in order to get a coveted spot at San Diego Comic-Con’s main showcase room. But in some cases, they might not have needed to. There were reports that the hall had tons of empty seats and people were just walking in at different times of the day. Of course, that wasn’t always happening, even at times when it should. Fans shared that sometimes they were kept out of Hall H—even when dozens of seats were still empty inside! And that’s not even getting into the problems with people holding spots in line for their friends, or line cutters who weren’t stopped by security. —Beth Elderkin\n\nAdvertisement\n\nThe Fantastic Beasts panel\n\n\n\nWhile the new trailer for Fantastic Beasts sequel The Crimes of Grindelwald was magical on its own, Warner Bros.’ decision to bring controversial star Johnny Depp onstage— in character as evil wizard Grindewald—was not. It was a surprise, sure, but not the nice kind of surprise, since nobody in the audience (especially those that were heard booing the actor) was about to forget who was under that wig and make-up. Plus, there was the added uncomfortable subtext that the panel for Aquaman (which included Amber Heard, Depp’s ex-wife) was the next to take the stage. —Cheryl\n\nAdvertisement\n\nThat Bozo Who Asked Amber Heard to Untie Him\n\nAfter the uncomfortable situation that was having Heard appear on stage right after Fantastic Beasts, an audience member dressed in bondage gear had the gall to tell Heard during a Q&A that he needed her help to get out of his fetish outfit. Behavior like this is sadly more common than it should be—and by that, I mean it should never happen at all. Don’t be the person who tries to coerce a celebrity (or really anyone at conventions) into participating in your sex stuff without their enthusiastic consent. Never be that person. —Beth\n\nAdvertisement\n\nSony, For Sharing Almost Nothing\n\nNobody could have predicted the James Gunn news (the timing of which meant the fired Guardians of the Galaxy director did not appear as part of Sony Pictures’ showcase panel as planned). But even beyond that, Sony was a pretty big disappointment. The studio’s current projects have enormous fan interest, especially Spider-Man: Into the Spider-Verse and Venom, and those few thousand who were lucky enough to score a seat in Hall H got glimpses of both. If you were watching from afar, however, you had to content yourself with breathless descriptions of the footage, which still has yet to be shared online. —Cheryl\n\nAdvertisement\n\nMarvel Movie Fans\n\nAs we mentioned, San Diego Comic-Con 2018 was a great year for DC, but fans of the Marvel Cinematic Universe were treated to a whole heap of nothing. No trailers, no announcements, not even any surprise appearances. It was a ghost con. Marvel announced earlier this year that it wouldn’t be appearing at this year’s con, and I mean, it makes sense—Captain Marvel only recently finished filming, and any question about the Infinity War sequel would have to be met with stony awkward silence. However, it did mean that one of the two largest comic book film franchises in the galaxy was nowhere to be found at the greatest fan event of the year. —Beth\n\nAdvertisement\n\nJeph Loeb\n\nSpeaking of Marvel, executive Jeph Loeb moderated a number of the studio’s panels at this year’s Comic-Con, and while the panelists themselves all did excellent jobs at representing their respective shows, Loeb himself made a number of inappropriate gaffes at different panels that were insensitive in a way that made one wonder if he was actively trying to be offensive. Even though the next season of Iron Fist looks better than the first, it’s still really disappointing that Netflix decided to cast Danny Rand as a white guy but hey, there’s no changing that at this point. That being said, there was absolutely no reason for Loeb to moderate the panel wearing gi and making jokes about Mr. Miyagi. What’s more, kicking off the Cloak & Dagger panel by asking the audience to split into gender groups in order to chant is...just weird, especially when you go on to misgender a fan during the Q&A portion of a panel. It’s obvious that Loeb likes being up on stage and so long as Marvel’s shows come to conventions, it’s likely that he’ll be the one to introduce them to fans—but in the future, it’d probably be best if he kept his “jokes” to himself. —Charles\n\nAdvertisement\n\nThe Buffy Reboot Non-Announcement\n\nThe possibility of a Buffy the Vampire Slayer TV show reboot has been talked about for months. Years, even. While fans might be divided on whether or not we need a reboot of a reboot—I personally don’t see a point, given how the show works best within the context of its time—there’s no doubt that it could be one of the most-talked-about reboots of the past decade. With that said, the announcement was a ridiculous blunder. It was teased in a story from The Hollywood Reporter during San Diego Comic-Con, but nothing was announced at San Diego Comic-Con. And creator Joss Whedon was at the con this year, appearing on the Dr. Horrible panel, so why didn’t he have something prepared? One can only speculate—I personally think it’s possible the reboot team is not super confident fans are going to respond well. But no matter the cause, it definitely left a mark that might be hard for the new show to brush off. —Beth\n\nAdvertisement\n\nTitans’ Gritty Arrival\n\nConsidering how much flack Warner Bros. gets for how gritty its big-screen adaptations of DC Comics’ heroes have been, we weren’t expecting Titans—based around characters made extra popular by a fun animated children’s show—to go that route. But go it did, and hugely so, in its first trailer. I never expected Dick Grayson to say the words “Fuck Batman” but well, now I’ll never un-hear them. We have to admit, where we were once excited by the show anchoring WB’s original content on its DC Universe streaming service (which is shaping up better than expected!), we’re now super hesitant. At least we’re still very excited about the Teen Titans Go! movie making fun of the DC film universe.—Jill Pantozzi", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/sbinfvuauf8rlq98c4jr.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/sbinfvuauf8rlq98c4jr.png", "keywords": [], "authors": [], "canonical_link": "https://io9.gizmodo.com/the-biggest-winners-and-losers-of-san-diego-comic-con-2-1827827459", "title": "The Biggest Winners and Losers of San Diego Comic-Con 2018", "meta_data": {"google-site-verification": "Y4KzRYvFDIszZROrGQfpcKGpEMqT5ncYtgHhRW8D7P0", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eh1hvjxamru5z6aobgwc.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/eh1hvjxamru5z6aobgwc.png", "keywords": "San Diego Comic-Con, Comic-Con 2018, Marvel, Warner Bros, NetFlix, Streaming, DC Universe, Animation, Horror, io9", "news_keywords": "San Diego Comic-Con, Comic-Con 2018, Marvel, Warner Bros, NetFlix, Streaming, DC Universe, Animation, Horror, io9", "twitter": {"url": "https://io9.gizmodo.com/the-biggest-winners-and-losers-of-san-diego-comic-con-2-1827827459", "card": "summary_large_image", "site": "@io9", "title": "The Biggest Winners and Losers of San Diego Comic-Con 2018", "description": "Comic-Con 2018 has come to a close, and whether io9 staff were seeing it up close and personal in San Diego or watching from afar back home, we experienced a lot. There was good and bad this year, as always, but we have to admit this time around we were pleasantly surprised by just how great the convention was.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/sbinfvuauf8rlq98c4jr.png"}, "description": "Comic-Con 2018 has come to a close, and whether io9 staff were seeing it up close and personal in San Diego or watching from afar back home, we experienced a lot. There was good and bad this year, as always, but we have to admit this time around we were pleasantly surprised by just how great the convention was.", "og": {"title": "The Biggest Winners and Losers of San Diego Comic-Con 2018", "type": "article", "url": "https://io9.gizmodo.com/the-biggest-winners-and-losers-of-san-diego-comic-con-2-1827827459", "description": "Comic-Con 2018 has come to a close, and whether io9 staff were seeing it up close and personal in San Diego or watching from afar back home, we experienced a lot. There was good and bad this year, as always, but we have to admit this time around we were pleasantly surprised by just how great the convention was.", "locale": "en_US", "site_name": "io9", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/sbinfvuauf8rlq98c4jr.png"}, "fb": {"app_id": 44615671688}}, "movies": [], "publish_date": null, "source": "https://io9.gizmodo.com", "summary": ""}