{"url": "https://web.archive.org/web/20170522143036/https://www.washingtonpost.com/lifestyle/style/the-case-against-bill-cosby-explained/2017/05/22/ab36e518-397b-11e7-9e48-c4f199710b69_story.html", "text": "\n\nBill Cosby faces charges of drugging and sexually assaulting a former Temple women’s basketball team official. He’s shown here leaving a pretrial hearing in July 2016. (Matt Rourke/AP)\n\nThe Bill Cosby trial starts today with jury selection in Pittsburgh. Here’s everything you need to know about the case against the 79-year-old entertainer, whose career imploded 2½ years ago as more and more women came forward alleging he drugged and sexually assaulted them.\n\nWhat are the criminal charges against Cosby?\n\nHe faces three felony counts of “aggravated indecent assault” for allegedly drugging and sexually assaulting Andrea Constand, a former Temple University women’s basketball staffer, at his suburban Philadelphia home in early 2004. Each count carries a maximum prison sentence of 20 years.\n\n[Three years and 60 accusers later, Bill Cosby’s trial begins. But only one woman will decide his fate.]\n\nWhy is the trial starting in Pittsburgh?\n\nCosby is being prosecuted in Montgomery County, Pa., outside of Philadelphia. But his defense team persuaded the judge in the case to select a jury from Pittsburgh, some 300 miles west in Allegheny County, by arguing that potential jurors in Montgomery County were tainted by intense pretrial publicity.\n\nA big part of the defense argument centered on the publicity generated when Montgomery County District Attorney Kevin Steele, who is prosecuting Cosby, promised to reopen the investigation of the comedian during his 2015 campaign.\n\nThe defense failed, however, to get the trial moved out of Montgomery County. Once jurors have been chosen in Pittsburgh, they will be transported to the suburban city of Norristown, Pa., where they will be sequestered after testimony begins in the trial, which is scheduled to start June 5 at the Court of Common Pleas and to last two weeks.\n\n\n\nAndrea Constand, a former Temple University women’s basketball official, says Bill Cosby offered to help her with her career, then drugged and sexually assaulted her. (Mark Blinch/Reuters)\n\nWhat’s the strongest evidence against Cosby?\n\nCosby gave extraordinary testimony in 2005 and 2006 during a civil lawsuit filed against him by Constand. (The case was eventually settled for an undisclosed amount.) Over the course of four days of questioning, Cosby admitted to acquiring Qualuudes, a powerful sedative, to give to women with whom he wanted to have sex.\n\nHe also testified in sometimes cringe-inducing detail about his sexual contact with Constand, including graphic descriptions of how he penetrated her vagina with his finger and touched her breasts. He characterized their sexual contact as consensual. In the deposition, Cosby acknowledged giving pills to Constand, but said they were the over-the-counter allergy medication Benadryl.\n\nProsecutors are expected to argue that Constand would not have consented to sexual contact with Cosby because she is gay.\n\n[Bill Cosby’s legacy, recast]\n\nWhat are the biggest weaknesses of the prosecution case?\n\nThere appears to be no physical evidence to support Constand’s allegations. She was not examined by a doctor after the alleged incident. She did not contact police until a year later, and there are several inconsistencies in her statements to investigators that could be used to undercut her credibility.\n\nAnd, though the criminal case was filed just before the expiration of Pennsylvania’s statute of limitations, it will be going to trial more than 13 years after the alleged incident.\n\nWhy are the charges related to only one woman?\n\nAt least 60 women have publicly accused Cosby of rape, sexual assault or sexual harassment between the 1960s and the 2000s. The statutes of limitation have expired for most of their cases, preventing them from seeking criminal charges.\n\nProsecutors wanted to call 13 Cosby accusers to testify during the trial in hopes of establishing a pattern of similar behavior that would support Constand’s allegations. But, in an emphatic defeat for the prosecution, Judge Steven T. O’Neill ruled that only one other accuser would be allowed to testify.\n\nThat woman appeared on camera for a news conference in January 2015 using the pseudonym “Kacey.” She said she worked as an assistant for Cosby’s personal appearances agent at the William Morris Agency in Los Angeles. Prosecutors say Cosby drugged and sexually assaulted the woman in 1996 at the Hotel Bel-Air when she was about 35.\n\nWill Cosby testify?\n\nDefendants are not required to testify, and Cosby said in a recent interview on SiriusXM radio that he is unlikely to testify, nor does he want to on advice from his attorneys. The one slim caveat is that Cosby is extremely adept at charming audiences, and the defense could decide that the risks of testifying would be outweighed by the benefits of having the lifelong entertainer — once known as “America’s Dad” — speak directly to the jury. Cosby also could earn sympathy points because he claims to be legally blind.\n\n\n\nBill Cosby, shown here with his attorney Brian McMonagle and his former attorney Monique Pressley, says he’s legally blind. (Matt Rourke/AP)\n\nWill his accuser testify?\n\nConstand, who was 30 when the alleged assault took place and is a massage therapist in Canada, is almost certain to testify because the prosecution case relies heavily on her memories of the encounter with Cosby, according to legal experts.\n\nWho are the main courtroom players?\n\nCosby has a high-powered defense team. It’s led by Brian McMonagle, a prominent Philadelphia attorney whose clients have included NBA star Allen Iverson, a Catholic archbishop and a city deputy mayor cleared of corruption charges; and Angela Agrusa, a seasoned and ultra-aggressive Los Angeles attorney who formerly headed the California litigation department for BakerHostetler, one of the nation’s largest law firms.\n\nThe prosecution is headed by Steele, a veteran prosecutor who was elected as district attorney in 2015. Steele, a Democrat, defeated Bruce Castor, a previous district attorney who made the decision not to prosecute Cosby in the Constand case in 2005.\n\nJudge O’Neill is a former Montgomery County prosecutor who has been on the bench since 2002 and was elected to a second 10-year term on the court in 2014.\n\nOnce a verdict is reached, will that be the end of Cosby’s legal troubles?\n\nFar from it. Cosby has racked up a series of victories in civil cases filed against him by accusers. But many civil cases remain. He’s facing defamation lawsuits or appeals of defamation suits in Massachusetts and California, all filed by accusers who say their reputations were damaged when Cosby or his representatives said they weren’t telling the truth. He also faces a sexual battery lawsuit in California.", "images": ["https://web.archive.org/web/20170522143036im_/https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://web.archive.org/web/20170522143036im_/https://www.washingtonpost.com/wp-stat/advertising/subscribe.png", "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/wp-apps/imrs.php?src=http://wp-eng-static.washingtonpost.com/author_images/roigfranziam.jpg?ts=1406839697715&w=180&h=180", "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_480w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg?uuid=caLFpFznEeadL7GjVkGBoQ", "https://web.archive.org/web/20170522143036im_/https://me.effectivemeasure.net/em_image", "https://web.archive.org/web/20170522143036im_/https://www.washingtonpost.com/pb/resources/img/thewashingtonpost-white-2x.png", "https://web.archive.org/web/20170522143036im_/https://images.washingtonpost.com/?url=https://img.washingtonpost.com/pb/resources/img/spacer.gif&op=resize&w=1&h=1&filter=nearest&fmt=png", "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_480w/2010-2019/WashingtonPost/2017/05/15/Style/Images/2015-12-30T184024Z_01_MDB03_RTRIDSP_3_PEOPLE-COSBY-RHUG-3578.jpg?uuid=ZF8UPDmcEeegWN27I8ddgg", "https://web.archive.org/web/20170522143036im_/https://www.washingtonpost.com/pb/resources/img/push_notifications/notification_denied_v1.png", "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_480w/2010-2019/WashingtonPost/2016/05/20/Style/Graphics/promocosby3b.jpg?uuid=d-3mFB6UEeaCwqfcsxMofQ", "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_480w/2010-2019/WashingtonPost/2017/05/15/Style/Images/Cosby_Deposition_Guide-0cee3-FHZB.jpg?uuid=zEk8NjmbEeegWN27I8ddgg", "https://web.archive.org/web/20170522143036im_/https://images.washingtonpost.com/?url=https://amsarkadium-a.akamaihd.net/assets/global/game/webgl-candy-mahjongg/66600ba9-e698-4d41-8515-225e149a8781/292x194.jpg&op=noop", "https://web.archive.org/web/20170522143036im_/https://www.washingtonpost.com/pb/resources/img/washingtonpost_black_32.png", "https://web.archive.org/web/20170522143036im_/https://images.washingtonpost.com/?url=https://amsarkadium-a.akamaihd.net/assets/global/game/webgl-word-wipe/262d00aa-51c8-4e67-8424-037e6ab7d538/148x148.png&op=noop", "https://web.archive.org/web/20170522143036im_/https://images.washingtonpost.com/?url=https://img.washingtonpost.com/pb/resources/img/spacer.gif&op=resize&w=3&h=2&filter=nearest&fmt=png", "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg", "https://web.archive.org/web/20170522143036im_/https://images.washingtonpost.com/?url=https://amsarkadium-a.akamaihd.net/assets/80A67319-A53A-42DF-AFBE-56492553AF10/game/mahjongg-dimensions/0a940cd6-fbf6-49e5-951e-24729023f2cc/320X320.png&op=noop"], "top_img": "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg", "keywords": [], "authors": ["Manuel Roig-Franzia Is A Writer In The Washington Post S Style Section. His Long-Form Articles Span A Broad Range Of Subjects", "Including Politics", "Power", "The Culture Of Washington", "As Well As Profiling Major Political Figures"], "canonical_link": "https://web.archive.org/web/20170522143036/https://www.washingtonpost.com/lifestyle/style/the-case-against-bill-cosby-explained/2017/05/22/ab36e518-397b-11e7-9e48-c4f199710b69_story.html", "title": "The case against Bill Cosby, explained", "meta_data": {"eomportal-uuid": "ab36e518-397b-11e7-9e48-c4f199710b69", "object-hash": 1495463114, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Cosby, Bill Cosby, Andrea Constand, Cosby trial, Bill Cosby trial, Kacey: Who are Cosby's accusers: What are the charges against Bill Cosby?, Where is the Bill Cosby trial?: When is the BillCosby trial?, Brian mcMonagle: Angela Agrusa, Who is the Bill Cosby judge?, Steven O'Neill, Who is the Bill Cosby prosecutor?, Who is Bill Cosby's defense attorney?", "news_keywords": "Cosby, Bill Cosby, Andrea Constand, Cosby trial, Bill Cosby trial, Kacey: Who are Cosby's accusers: What are the charges against Bill Cosby?, Where is the Bill Cosby trial?: When is the BillCosby trial?, Brian mcMonagle: Angela Agrusa, Who is the Bill Cosby judge?, Steven O'Neill, Who is the Bill Cosby prosecutor?, Who is Bill Cosby's defense attorney?", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@RoigFranzia"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://web.archive.org/web/20170522143036/https://www.washingtonpost.com/lifestyle/style/the-case-against-bill-cosby-explained/2017/05/22/ab36e518-397b-11e7-9e48-c4f199710b69_story.html", "image": "https://web.archive.org/web/20170522143036im_/https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg", "title": "The case against Bill Cosby, explained", "description": "Breaking down the background of the charges before “America’s Dad” goes on trial May 22."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "author": "https://www.facebook.com/manuel.roigfranzia"}, "fb": {"admins": 500835072, "app_id": 41245586762}, "zeusAds": "true", "description": "Breaking down the background of the charges before “America’s Dad” goes on trial May 22.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/manuel.roigfranzia"}, "movies": [], "publish_date": 1495382400.0, "source": "https://web.archive.org", "summary": ""}