{"url": "https://www.independent.co.uk/life-style/rebel-wilson-vogue-australia-cover-photoshop-fat-shaming-doctored-a8365746.html", "text": "Rebel Wilson has spoken out about claims made regarding her Vogue Australia cover, which fans have accused as being doctored in a bid to make her appear slimmer.\n\nFronting the title’s June issue, the Pitch Perfect star insisted that the images hadn’t been “slimmed down” via photoshop, crediting her figure to a healthy diet and exercise regime.\n\nHowever, criticisms were also made with regards to the magazine’s styling choices, with some people arguing that Wilson’s plus-size figure had been intentionally covered-up in baggy clothing for the cover.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nClad in a full-length brown overcoat and a black gown, fans expressed disappointment at the magazine’s sartorial decisions, with some suggesting that the loose-fitting aesthetic was not at all flattering.\n\n“Shame about that massive jacket,” wrote one person, “I bet that stunning dress would of shown off your gorgeousness without the need for cover-up.”\n\n“Rebel, is that you? I can’t see you under all those layers!” added another.\n\n“Couture or not, it looks like a tent and doesn’t do you justice.”\n\nFurther critics argued that the title’s styling team had “drowned” the actress in fabric.\n\nOthers contested the authenticity of the images, claiming that her figure had been digitally-altered:\n\n“She doesn’t even have recognizable wrists,” one person commented on Twitter, “they widened her smile and she was always naturally beautiful.”\n\n“Why is it that every time a ‘plus-size’ woman makes it to the cover of a fashion magazine, they wrap them in the heaviest coats imaginable?” asked another.\n\nWilson personally responded to one tweet which described her as “slimmed down”, writing: “Nope, not slimmed down! I just ate healthy and exercised for the month before the shoot x but then immediately after ate brownies!”\n\nThe actress followed her tweet up by uploading a side-by-side image of one of the raw photographs featured in the magazine alongside the published version to show that it hadn’t been “heavily photoshopped” as fans had claimed.\n\nWhile criticisms were rife, the majority of comments regarding Wilson’s cover were hugely complimentary, with fans lauding the Australian actress for her beauty and talent.\n\n“You look amazing and you are a true role model,” enthused one fan on Instagram.\n\n“You shouldn't have to explain yourself you look absolutely amazing hun,” added another, “and i love the outfits.”", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/23/16/31941496-311693419364978-5803894014092509184-n.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/23/16/31941496-311693419364978-5803894014092509184-n.jpg", "keywords": [], "authors": ["Olivia Petter"], "canonical_link": "https://www.independent.co.uk/life-style/rebel-wilson-vogue-australia-cover-photoshop-fat-shaming-doctored-a8365746.html", "title": "Rebel Wilson defends Vogue Australia cover after fans claim images were 'slimmed down'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/life-style/rebel-wilson-vogue-australia-cover-photoshop-fat-shaming-doctored-a8365746.html", "title": "Rebel Wilson defends Vogue cover following claims images were doctored", "description": "'Rebel, is that you?'", "updated_time": "2018-05-24T09:01:31+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/23/16/31941496-311693419364978-5803894014092509184-n.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8365746"}, "description": "Rebel Wilson has spoken out about claims made regarding her Vogue Australia cover, which fans have accused as being doctored in a bid to make her appear slimmer.", "keywords": "Rebel Wilson, Vogue, Body positive, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Rebel Wilson", "published_time": "2018-05-24T09:00:00+01:00", "modified_time": "2018-05-24T09:01:31+01:00", "section": "Lifestyle", "author_name": "Olivia Petter", "content_type": "story", "word_count": 564, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 1, "external_link_count": 8}, "twitter": {"title": "Rebel Wilson defends Vogue cover following claims images were doctor…", "description": "Rebel Wilson has spoken out about claims made regarding her Vogue Australia cover, which fans have accused as being doctored in a bid to make her appear slimmer.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1527148800.0, "source": "https://www.independent.co.uk", "summary": ""}