{"url": "https://ny.eater.com/2017/12/11/16759540/mario-batali-sexual-misconduct-allegations", "text": "About 10 years ago, at the after-party for a wine auction in New Orleans, a woman in her 20s walked up to Mario Batali to introduce herself. As a chef, she was excited to meet one of the most revered figures in the restaurant industry. When they started talking, she recalls, she realized that he’d been drinking and he became what she characterized as “creepy” — “just giving me this provocative, icky feeling.”\n\nMinutes into their conversation, she recalls, he told her, “Come work for me, I’ll pay you double what you’re making.” Moments later, someone bumped her glass, spilling wine all over her chest and down her scooped-neck shirt. She alleges that Batali began rubbing her breasts with his bare hands while saying something like, “Let me help you with that,” as he groped her chest. “He just went to town, and I was so shocked,” the chef says. “Jaw on the ground, I just stepped back from him in utter disgust and walked away.”\n\nThe chef is one of four women who allege that Batali touched them inappropriately in a pattern of behavior that appears to span at least two decades. Three of the women worked for Batali in some capacity during their careers. One former employee alleges that over the course of two years, he repeatedly grabbed her from behind and held her tightly against his body. Another former employee alleges that he groped her and that, in a separate incident, he compelled her to straddle him; another alleges that he grabbed her breasts at a party, though she no longer worked for him at the time. The woman whose allegations are described above has never worked for Batali, though she works in the restaurant industry.\n\nBatali was reprimanded for inappropriate behavior in the workplace as recently as two months ago. According to a spokesperson for Batali & Bastianich Hospitality Group — the restaurant-management services company that provides support to around 24 restaurants owned by, among others, Batali and Joe Bastianich — in October 2017, a B&B restaurant employee officially reported inappropriate behavior by Batali to the company. It was the first formal complaint about Batali, who was reprimanded and required to undergo training, according to the company.\n\nIn a statement to Eater, Batali said that he is stepping away from the day-to-day operations of his businesses for an unspecified period of time. ABC, where Batali has co-hosted the daytime show The Chew since 2011, has also asked the chef to step away from the show “while we review the allegations that have just recently come to our attention,” a spokesperson said.\n\nBatali did not deny all the allegations, saying that they “match up” with ways he has behaved.\n\n“I apologize to the people I have mistreated and hurt. Although the identities of most of the individuals mentioned in these stories have not been revealed to me, much of the behavior described does, in fact, match up with ways I have acted. That behavior was wrong and there are no excuses. I take full responsibility and am deeply sorry for any pain, humiliation or discomfort I have caused to my peers, employees, customers, friends and family.\n\n“I have work to do to try to regain the trust of those I have hurt and disappointed. For this reason, I am going to step away from day-to-day operations of my businesses. We built these restaurants so that our guests could have fun and indulge, but I took that too far in my own behavior. I won’t make that mistake again. I want any place I am associated with to feel comfortable and safe for the people who work or dine there.\n\n\"I know my actions have disappointed many people. The successes I have enjoyed are owned by everyone on my team. The failures are mine alone. To the people who have been at my side during this time — my family, my partners, my employees, my friends, my fans — I am grateful for your support and hopeful that I can regain your respect and trust. I will spend the next period of time trying to do that.”\n\nBatali remains an owner of his individual restaurants, according to the B&B spokesperson. In a statement to Eater, B&B said that while the company has had sexual harassment training and policies for more than 10 years, it will now also enlist an independent, outside corporate investigations firm for any staffers wishing to make claims against owners of the restaurants.\n\n“We take these allegations very seriously. We pride ourselves on being a workplace for our employees where they can grow and deliver great service with equal opportunity and free from any discrimination. We have strong policies and practices in place that address sexual harassment. We train employees in these policies and we enforce them, up to and including termination,” B&B’s statement reads in part. “Mr. Batali and we have agreed that he will step away from the company’s operations, including the restaurants, and has already done so.”\n\nJoe Bastianich said in a statement, “Right now, I’m just focused on ensuring that our more than 1,000 employees continue to have a safe and positive work environment.” An ABC spokesperson said in a statement, “ABC takes matters like this very seriously as we are committed to a safe work environment. While we are unaware of any type of inappropriate behavior involving him and anyone affiliated with the show, we will swiftly address any alleged violations of our standards of conduct.”\n\nAlthough B&B has been sued for sexual harassment before, Batali’s own alleged inappropriate sexual misconduct has not previously been the subject of a lawsuit. Each of the women who spoke to Eater asked to remain anonymous in part for fear of retaliation — Batali, a celebrated and powerful chef, holds enormous sway in the restaurant world and beyond. Eater is granting them anonymity but has corroborated their stories with friends, family members, or colleagues who were informed of the incidents, as well as with publicly available information.\n\nMany of the people who spoke with Eater said they were afraid of retribution for speaking out. A woman who claims she was inappropriately touched while she worked for Batali in the late ’90s told Eater, “He has clear intent on being threatening when he is wronged. And the level of vindictiveness is very chilling. So, it never occurred to me to share tales out of school.”\n\nThe multiple accusations of inappropriate touching and other misconduct emerged from an Eater investigation that included interviews with dozens of industry professionals who have had interactions with the chef, including nearly three dozen current and former Batali employees.\n\nBatali, who became a star as the host of one of Food Network’s first hit TV shows, Molto Mario, has risen to the very top of the restaurant industry since starting out in a New Jersey sandwich shop in the early ’80s as a college student. Along with Joe Bastianich and Lidia Bastianich, he is the force behind Batali & Bastianich Hospitality Group, which notably includes the New York City restaurants Del Posto and Babbo, each of which holds one Michelin star. Five years ago, B&B reported more than $250 million in annual revenue. Batali is also a minority shareholder in the Italian-market chain Eataly USA, which has six locations across the country.\n\nOutside of his restaurants, Batali is the author of numerous cookbooks, the face of nationally distributed jarred pasta sauces and other kitchen products, and the jolly, orange-Crocs-wearing co-host of ABC’s daytime talk and cooking show The Chew. He also founded a child education and empowerment nonprofit and is active in (RED), the nonprofit founded by celebrities Bono and Bobby Shriver. Additionally, Batali owns a small percentage of Ken Friedman and April Bloomfield’s landmark gastropub, The Spotted Pig. People Eater spoke to within the industry often describe him as a friendly, charming, professional, supportive, and frequently generous person.\n\nBut his affable persona belies another, more crude reputation, according to dozens of interviews. Batali’s lewdness, his crass way of speaking about women, and his focus on women’s bodies have been well known within certain circles in the restaurant world, according to people who spoke with Eater.\n\nA former server at Pó, the now-shuttered West Village restaurant where Batali built his reputation throughout the ’90s, alleges that repeated physical harassment took place while Batali was the chef.\n\nSteve Crane, who co-owned Pó with Batali until the chef decamped to start his future empire, confirmed that he was told by multiple staff members of ongoing inappropriate behavior by Batali. Though Crane does not recall any specific details, and was not in the kitchen to personally witness the incidents, he said that he was told by several female staffers that Batali had grabbed them from behind, consistently made a variety of sexual comments, and engaged in behavior like snapping bra straps. “I made it very clear to him that he needed to stop, but I feel ashamed that this happened at Pó, and my staff endured this behavior,” he said. Crane said that because they were partners in the restaurant, he ultimately did not have the power to fire Batali. (Batali, through a spokesperson, denied that Crane ever confronted him.)\n\nThe former server alleges that on multiple occasions Batali grabbed her from behind “like a linebacker, like a disgusting bear hug,” and pressed her body against his. In hours of interviews with Eater, she described nearly two years of inappropriate behavior. The grabbing would often occur while they were alone in a cramped passageway between the dining room and the kitchen, she alleged. “He would breathe on me — and sometimes take a deep inhale, like he was smelling me,” she recalled.\n\nWhen Crane asked Batali to stop, Batali would become more aggressive, the server alleged; some female staff eventually started asking Crane to not confront Batali with their complaints, she added. (Crane confirmed that after some women would complain, they would ask him not to confront Batali because he would only be more aggressive toward them.)\n\nRestaurant culture in the ’90s was generally known for being “bawdy,” and sexual relationships between staff weren’t uncommon, the former server said, but Batali’s behavior was more about degradation than good humor, she alleges: \"This wasn't just some dirty jokes, this was mean, this was about asserting power. He is awful.\"\n\nLee McGrath, a chef who joined Pó a few years after Batali left as chef, told Eater that when he was hired, Crane warned him, “Don’t even think about messing with the waitresses — they’ve been through hell with Mario.”\n\nA different woman, who worked for Batali in the late ’90s, alleges that he touched her inappropriately on two different occasions. The first incident allegedly took place soon after she started her job. One day, while she was in the dining room of the restaurant, she said, Batali came up behind her, catching her unaware, and “put his hand on half of my butt and he squeezed it.” She recalled later gently confronting Batali, who responded, “What are you, a lesbian?”\n\nIn a second incident that took place about three years later, she alleges that while working next to Batali in a small, boxed-in space, he was seated in such a way that he blocked her exit. When she had to get up, he refused to move — leaving her no choice but to straddle him in order to leave the space. According to the woman, she told Batali that she needed to go to the bathroom. Batali, who was reclining with his legs propped up, allegedly told her, “If you want to get up, you’re going to have to climb over me.” When she returned, he was still seated with his legs propped up, again refusing to move; she had to straddle him a second time, she alleges. “It was disappointing, again, to have that happen. And, again, humiliating,” she said.\n\nYet another woman who worked for Batali for about a year in the late aughts alleges that he lunged at her and grabbed her breasts during an industry party in 2011, a few years after she stopped working for him. At the party, she recalled that Batali appeared drunk, and she became concerned for his safety when she spotted him on a balcony standing slumped over. “When I noticed that he looked wobbly, my instinct was concern,” she said. When she walked over and tapped him on the shoulder, “he sprung up, like he was startled,” and with his eyes wide open. Then, immediately, “he lifted his arms straight up and grabbed both of my breasts,” she said. “I took a step back and I pushed him away, and when I did that, I remember he said, ‘Oh, come on.’”\n\n“In that moment I realized, ‘I’m just a body [to him],’” she said of the experience. Though at the time, she no longer worked for Batali, she had worked for him a few years prior and said she believed they shared some mutual respect. “When I’ve seen him over the years, I don’t have a sense that he even remembers,” she said, though she added, “I haven’t spoken to him about it.”\n\nThe chef who alleged being groped at an industry party in New Orleans about 10 years ago, as described earlier, said she remains appalled by his behavior. “He gets wasted, he’s arrogant, and he acts like he’s God’s gift to women,” she said. “This is still your industry, you’re a leader in this industry — if you behave this way, what kind of example are you setting?”\n\nIn addition to the allegations of improper physical contact, several sources said that Batali has a reputation for inappropriately using sexual innuendo in workplace conversation. Multiple people who work at or have worked at Batali restaurants from the early ’90s to now described behavior that ranges from mild creepiness to more severe misconduct, both in interviews with Eater and in publicly available documents.\n\nThe woman who was allegedly groped by Batali on the balcony told Eater, “I remember not being fully surprised that it happened because I’d seen him drunk and flirtatious with women. And that flirting came in the form of talking and sitting really close. I’d never witnessed anything during work hours; it was always post-work.”\n\nBut according to other interviews, his inappropriate behavior happened at work, too. McGrath, the Pó chef who started about a year after Batali left, said that he eventually understood why he was given the warning to not harass the female waitstaff, as two servers, including one who spoke with Eater, began to relay accounts of Batali’s misconduct. “It’s like they had PTSD,” he said. McGrath remembers being told that there was a lot of “hugging from behind” and that Batali would ask about their sex lives, what color underwear they wore, and other inappropriate questions.\n\nAnother former female Pó staffer, who worked at the restaurant earlier than the woman mentioned above, said that Batali could be generally “nasty” and a “bully” to both men and women. He was “constantly making overtly sexual and inappropriate” comments, she alleges. Though she doesn’t remember physical touching, she said that she’s never worked for someone more inappropriate than Batali. At one point, she wanted to take out an ad in the paper to say what “an awful person he was” because she thought it was unfair that he was getting so many accolades considering how terribly he treated people, she said. “Mario is smart and he’s talented, but I don’t think that gives you the right to be disgusting,” she said.\n\nThe employee who Batali allegedly groped shortly after she was hired said that she has witnessed “a lot of gray-area affection with women,” like “a lot of subliminal dissection of women’s bodies, telling women their asses looked good, remarking on boobs.”\n\nThe chef’s boorish side has also been previously documented in the media. In the 2006 book Heat, the writer Bill Buford provides a glimpse at the earlier years of Babbo and Batali’s tenure on the Food Network, noting crass behavior with two female prep chefs, as well as an assistant and a set manager. In one incident detailed in the book, during a food- and wine-filled evening at Batali’s Greenwich Village trattoria Lupa Osteria Romana, Buford writes that Batali said to a female server: “It’s not fair I have this view all to myself when you bend over. For dessert, would you take off your blouse for the others?”\n\nA manager at a B&B restaurant said that while he loves working for Batali — who has been good to the kitchen staff and very professional with both male and female chefs, in his experience — he has seen Batali treat women outside of the kitchen crudely, especially while intoxicated. Eater granted him anonymity, as he is still employed by the company and fears losing his job. “I really like the guy, and every sober interaction has been very professional, but, yeah, he’s gross,” the manager said.\n\n“He was always friendly, but it was in this ‘Oh, you’re a pretty little girl’ kind of way,” Gabriela Acero, a former maitre d’ and floor manager who worked at Batali’s Greenwich Village restaurant Otto from 2012 to 2014, said. “I remember him complimenting my dress, saying something like ‘Oh, don’t you look like the blossoming bosom of spring.’ Even then I was like, ‘Oh, Jesus.’”\n\nBatali’s reputation has left some of the women who’d benefited from his power and influence with mixed feelings about their relationship with him. He’s championed the careers of numerous women; his kitchen at Del Posto is led by a female executive chef and executive pastry chef. (“It’s not because they have a vagina,” he said of the crew while at the Fast Company Innovation Festival in October. “It’s because they’re the smartest people for the job.”)\n\n“I feel very complicated feelings toward him,” the former employee who described two encounters with Batali said. “In some ways, he was very supportive and he used his power and influence to connect me.”\n\nThe former employee who alleged having her breasts grabbed described working for Batali as frequently professional. “I definitely felt way more reverential about him then than I do now,” she said.\n\nThese allegations come as dozens of prominent and powerful men have been toppled by accusations of sexual harassment and inappropriate conduct. In the restaurant industry — notorious for its boys-club culture — chef John Besh was brought down by allegations of rampant sexual harassment in his restaurants, and former Jean-Georges pastry chef Johnny Iuzzini has been accused of sexual harassment by four women.\n\n“I think it says so much about how we just accept and move on, and I think for a long time, I just thought, ‘Well, he didn’t rape me,’” said the woman who alleged being grabbed at an industry party in 2011. “But I remember it vividly, it impacted me, and I feel uneasy recalling it. I just feel this major sense that I’m not the only one. I feel really grateful for the cultural reckoning that’s happening.”\n\nAnyone with information about alleged misconduct in the restaurant world can contact Eater at tips@eater.com or via these secure methods.", "images": ["https://cdn.vox-cdn.com/thumbor/V0ahApnePhPAQWswiY7dp_GMNRg=/0x77:2000x1124/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9845495/Batali_BHB_1.1.png", "https://cdn.vox-cdn.com/thumbor/RN0t4LW7JZfVp1U_xeZh6KIK95A=/0x0:2000x1200/1200x675/filters:focal(840x440:1160x760)/cdn.vox-cdn.com/uploads/chorus_image/image/57930267/Batali_BHB_1.1.0.png"], "top_img": "https://cdn.vox-cdn.com/thumbor/V0ahApnePhPAQWswiY7dp_GMNRg=/0x77:2000x1124/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9845495/Batali_BHB_1.1.png", "keywords": [], "authors": ["Irene Plagianos", "Kitty Greenwald", "Dec"], "canonical_link": "https://ny.eater.com/2017/12/11/16759540/mario-batali-sexual-misconduct-allegations", "title": "Mario Batali Steps Away From Restaurant Empire Following Sexual Misconduct Allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Eater NY", "article": {"publisher": "https://www.facebook.com/eaterny", "published_time": "2017-12-11T08:01:00-05:00", "modified_time": "2017-12-11T08:01:00-05:00"}, "author": "Irene Plagianos", "fb": {"pages": "6029273333,242726355745404,115169205199800,139755792796580,131547960225574,213601342019363,301223156562915,309491225851948,243335249017579,348494641841991,109814609047278,442143005803582,110073695686645,385346484849141,451388614896528,240433149442075,670887879603309,150611155024023,176453365796072,110358775652218,465169560201718,105842919452319,213198508690703,192135047484517,243781239374345,111376838888644", "app_id": 549923288395304}, "style-tools": "https://www.eater.com/style/community/460/8e854614b365852c22dc904bc33a12c0/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Four women accuse the chef of inappropriate touching in a pattern of behavior that spans at least two decades, according to dozens of Eater interviews", "og": {"description": "Four women accuse the chef of inappropriate touching in a pattern of behavior that spans at least two decades, according to dozens of Eater interviews", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/V0ahApnePhPAQWswiY7dp_GMNRg=/0x77:2000x1124/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9845495/Batali_BHB_1.1.png", "alt": "Mario Batali", "height": 630, "width": 1200}, "site_name": "Eater NY", "title": "Mario Batali Steps Away From Restaurant Empire Following Sexual Misconduct Allegations", "type": "article", "url": "https://ny.eater.com/2017/12/11/16759540/mario-batali-sexual-misconduct-allegations"}, "twitter": {"card": "summary_large_image", "url": "https://ny.eater.com/2017/12/11/16759540/mario-batali-sexual-misconduct-allegations", "title": "Mario Batali Steps Away From Restaurant Empire Following Sexual Misconduct Allegations", "description": "Four women accuse the chef of inappropriate touching in a pattern of behavior that spans at least two decades, according to dozens of Eater interviews", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/sth5KE_Xhj0yxiKNQjaHP3IHazg=/0x100:2000x1100/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/9845495/Batali_BHB_1.1.png", "alt": "Mario Batali"}, "site": "EaterNY"}, "sailthru.title": "Mario Batali Steps Away From Restaurant Empire Following Sexual Misconduct Allegations", "sailthru.tags": "general,eater-ny", "sailthru.description": "Four women accuse the chef of inappropriate touching in a pattern of behavior that spans at least two decades, according to dozens of Eater interviews", "sailthru.date": "2017-12-11T08:01:00-05:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/KG2hUlJug7v79NCvnjygWcpxUPY=/0x38:2000x1163/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/57930265/Batali_BHB_1.1.0.png", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/WwhN-nZniBdgmvPFzCcE5LulVVE=/400x0:1600x1200/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/57930265/Batali_BHB_1.1.0.png", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/6253179/apple-touch-icon-144x144.0.png", "msapplication-TileColor": "#e20000"}, "movies": [], "publish_date": 1512921600.0, "source": "https://ny.eater.com", "summary": ""}