{"url": "www.elle.com/culture/career-politics/a19582764/trumps-latest-order-ban-transgender-troops-serving/", "text": "PALM BEACH, Fla. (AP) — President Donald Trump released an order Friday night banning most transgender troops from serving in the military except under \"limited circumstances,\" following up on his calls last year to ban transgender individuals from serving.\n\nThe White House said retaining troops with a history or diagnosis of \"gender dysphoria\"—those who may require substantial medical treatment—\"presents considerable risk to military effectiveness and lethality.\"\n\nTrump surprised the Pentagon's leadership in a 2017 tweet when he declared he would reverse an Obama-era plan to allow transgender individuals to serve openly. His push for the ban has been blocked by several legal challenges, and four federal courts have ruled against the ban. The Pentagon responded by allowing those serving to stay in the military, and began allowing transgender individuals to enlist beginning Jan. 1.\n\n\"This new policy will enable the military to apply well-established mental and physical health standards — including those regarding the use of medical drugs — equally to all individuals who want to join and fight for the best military force the world has ever seen,\" White House Press Secretary Sarah Huckabee Sanders said Friday.\n\nThe new policy was promptly assailed by congressional Democrats and civil rights groups. House Democratic leader Nancy Pelosi tweeted, \"No one with the strength & bravery to serve in the U.S. military should be turned away because of who they are. This hateful ban is purpose-built to humiliate our brave transgender members of the military who serve with honor & dignity.\"\n\nThe Human Rights Campaign, the nation's largest LGBT civil rights organization, accused the Trump administration of pushing \"anti-transgender prejudices onto the military.\"\n\n\"There is simply no way to spin it, the Trump-Pence Administration is going all in on its discriminatory, unconstitutional and despicable ban on transgender troops,\" said HRC President Chad Griffin.\n\nJoshua Block, a senior staff attorney at the American Civil Liberties Union LGBT & HIV Project, said the policy \"effectively coerces transgender people who wish to serve into choosing between their humanity and their country, and makes it clear that transgender service members are not welcome.\"\n\nTrump received recommendations from Defense Secretary Jim Mattis in February for dealing with transgender individuals serving in the military. The White House said Mattis and Homeland Security Secretary Kirstjen Nielsen agreed with the policy.\n\nEarlier Friday, Maj. David Eastburn, a Pentagon spokesman, said the announcement of a new policy would have no immediate practical effect on the military because the Pentagon is obliged to continue to recruit and retain transgender people in accordance with current law.\n\nThe issue has become mired in a complicated string of political statements, court decisions and policy reviews since Trump first stunned his administration with his tweets last July. It's unclear how much impact the court decisions will have on Trump's decision. Activist groups had worried the administration could enact such strict enlistment and health care restrictions that it would become all but impossible for transgender troops to join or continue serving.\n\nUnder guidelines presented in December, the Pentagon could disqualify potential recruits with gender dysphoria, those with a history of medical treatments associated with gender transition and those who underwent reconstruction. Such recruits could be allowed in if a medical provider certified they've been clinically stable in the preferred sex for 18 months and are free of significant distress or impairment in social, occupational or other important areas.\n\nTransgender individuals receiving hormone therapy must be stable on their medication for 18 months.\n\nThe requirements make it challenging for a transgender recruit to pass. But they mirror conditions laid out by President Barack Obama's administration in 2016, when the Pentagon initially lifted its ban on transgender troops serving openly in the military.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.9996564754379939xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/800-1514667018.jpeg?crop=1.00xw:0.752xh;0,0.151xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/2560x1280/landscape-1488040367-gettyimages-499841262.jpg?resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.9996564754379939xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Associated Press"], "canonical_link": "https://www.elle.com/culture/career-politics/a19582764/trumps-latest-order-ban-transgender-troops-serving/", "title": "Trump's Latest Order Bans Majority of Transgender Troops from Serving", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Trump's Latest Order Bans Majority of Transgender Troops from Serving", "description": "The Human Rights Campaign has accused the Trump administration of pushing \"anti-transgender prejudices onto the military.\"", "url": "https://www.elle.com/culture/career-politics/a19582764/trumps-latest-order-ban-transgender-troops-serving/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.9996564754379939xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-03-24 02:03:43", "published_time": "2018-03-24 01:58:00", "section": "Political News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.9996564754379939xw:1xh;center,top&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Trump's Latest Order Bans Majority of Transgender Troops from Serving", "description": "The Human Rights Campaign has accused the Trump administration of pushing \"anti-transgender prejudices onto the military.\"", "keywords": "trump, transgender military, trans military ban, trump order, transgender troops, trans army, transgender troops banned from serving, president trump, donald trump, trump trans, trump trans rights", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.4998282377189969xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,career-politics", "sailthru.date": "2018-03-24T13:58:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.9996564754379939xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/trump-order-1521899564.jpg?crop=0.4998282377189969xw:1xh;center,top", "sailthru.socialtitle": "Trump's Latest Order Bans Majority of Transgender Troops from Serving", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1521827880.0, "source": "http://www.elle.com", "summary": ""}