{"url": "https://web.archive.org/web/20071016232328/http://frontpagemagazine.com:80/Articles/Read.aspx?GUID=5541E159-6AD5-4CC9-B24D-38374624608C", "text": "Go to www.hillaryclinton.com and check out Bill Clinton's syrupy five minute ad for Hillary. He introduces the commercial by saying that he wants to share some things we may not know about Hillary's background. His version of her biography is about as reliable as if it appeared in Pravda!\n\n\n\nSo, I wanted to make a few corrections:\n\nBill says: Hillary never wanted to run for public office, but she did want to work at public service.\n\nThe true facts are: When Clinton was considering not running for another term as Governor of Arkansas in 1990, Hillary said she would run if he didn't. She and Bill even had me take two surveys to assess her chances of winning. The conclusion was that she couldn't win because people would just see her as a seat warmer for when Bill came back licking his wounds after losing for president. So she didn't run. Bill did and won. But there is no question she had her eye on public office, as opposed to service, long ago.\n\n\n\nBill says: In law school Hillary worked on legal services for the poor.\n\nThe true facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal.\n\n\n\nBill says: Hillary spent a year after graduation working on a children's rights project for poor kids.\n\n\n\nThe true facts are: Hillary interned with Bob Truehaft, the head of the California Communist Party. She met Bob when he represented the Panthers and traveled all the way to San Francisco to take an internship with him.\n\n\n\nBill says: Hillary could have written her own job ticket, but she turned down all the lucrative job offers.\n\n\n\nThe true facts are: She flunked the DC bar exam and only passed the Arkansas bar. She had no job offers in Arkansas and only got hired by the University of Arkansas Law School at Fayetteville because Bill was already teaching there. She only joined the prestigious Rose Law Firm after Bill became Attorney General and made partner only after he was elected Governor.\n\n\n\nBill says: President Carter appointed Hillary to the Legal Services Board of Directors and she became its Chairman.\n\n\n\nThe true facts are: The appointment was in exchange for Bill's support for Carter in his 1980 primary against Ted Kennedy. Hillary became chairman in a coup in which she won a majority away from Carter's choice to be chairman.\n\n\n\nBill says: She served on the board of the Arkansas Children's Hospital.\n\nThe true facts are: Yes she did. But her main board activity, not mentioned by Bill, was to sit on the Wal-Mart board of directors, for a substantial fee. She was silent about their labor and health care practices.\n\n\n\nBill says: Hillary didn't succeed at getting health care for all Americans in 1994 but she kept working at it and helped to create the Children's Health Insurance Program (CHIP) that provides five million children with health insurance.\n\n\n\nThe true facts are: Hillary had nothing to do with creating CHIP. It was included in the budget deal between Bill Clinton and Republican Majority Leader Senator Trent Lott. I helped to negotiate the deal. The money came half from the budget deal and half from the Attorney Generals' tobacco settlement. Hillary had nothing to do with either source of funds.\n\n\n\nBill says: Hillary was the face of America all over the world.\n\n\n\nThe true facts are: Her visits were part of a program to get her out of town so that Bill would not appear weak by feeding stories that Hillary was running the White House. Her visits abroad were entirely touristic and symbolic, and there was no substantive diplomacy on any of them.\n\n\n\nBill says: Hillary was an excellent Senator who kept fighting for children's and women's issues.\n\n\n\nThe true facts are: Other than totally meaningless legislation like changing the names on courthouses and post offices, she has passed only four substantive pieces of legislation. One set up a national park in Puerto Rico. A second provided respite care for family members helping their relatives through Alzheimer's or other conditions. And two were routine bills to aid 9-11 victims and responders which were sponsored by the entire NY delegation.\n\n\n\nHere is what bothers me more than anything else about Hillary Clinton. She has done everything possible to weaken the President and our country when it comes to the war on terror:\n\n\n\n1. She wants to close GITMO & move the combatants to the USA where they would have access to our legal system.\n\n2. She wants to eliminate the monitoring of suspected Al Qaeda phone calls to/from the USA.\n\n3. She wants to grants constitutional rights to enemy combatants captured on the battlefield.\n\n\n\n4. She wants to eliminate the monitoring of money transfers between suspected Al Qaeda cells & supporters in the USA.\n\n5. She wants to eliminate the type of interrogation tactics used by the military & CIA where coercion might be used when questioning known terrorists even though such tactics might save American lives.I can't think of a single bill Hillary has introduced or a single comment she has made that would tend to strengthen our country in the War on Terror. But, I can think of a lot of comments she has made that weakens our country and makes it a more dangerous situation for all of us........She goes hand in hand with the ACLU on far too many issues where common sense is abandoned. She is a disaster for all Americans.", "images": ["https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_logotop.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_c4hfpmwd.gif", "https://web.archive.org/web/20071016232328im_/http://frontpagemagazine.com/images/fntbig.gif", "https://web.archive.org/web/20071016232328im_/http://frontpagemagazine.com/images/prev-paperclip.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_c4hsymposiums.gif", "https://web.archive.org/web/20071016232328im_/http://frontpagemagazine.com/images/fntsml.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_logo2.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fp_back_hRTarrow.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/media/4CDF1CEC-779C-4699-A123-A8992F4D9219/66c186e4-a729-47c8-be50-379d922e32bd.jpg", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemagazine.com/media/advertisements/hc1.jpg", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fp_barticles_bemail.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/favicon.ico", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fp_barticles_bcomment.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_back_c2hstudent4afree.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fp_barticles_bvcomment.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fp_barticles_bprint.gif", "https://web.archive.org/web/20071016232328im_/http://buttons.googlesyndication.com/fusion/add.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/images/fpm_index_c4hemail3.jpg", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_r5_c1.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/rss_button.gif", "https://web.archive.org/web/20071016232328im_/http://myfeeds.aolcdn.com/vis/myaol_cta1.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_c4hinterviews.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_logo1.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/fpm_index_c4hblogs.gif", "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/images/fpm_index_bhelp.gif"], "top_img": "https://web.archive.org/web/20071016232328im_/http://www.frontpagemag.com/Images/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "FrontPage Magazine", "meta_data": {"description": "A cutting edge magazine of politics and culture from David Horowitz and The Center for the Study of Popular Culture", "keywords": "Frontpage, Front, Page, David Horowitz, Ann Coulter, Lowell Ponte, Center Study Popular Culture, Individual Rights Foundation, Wednesday Morning Club, Larry Elder, Conservative, Hating Whitey, liberals"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}