{"url": "https://abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571", "text": "Meghan Markle has chosen wedding dress designer, has fitting at Kensington Palace: Source Markle, 36, will wed Harry, 33, on May 19, 2018.\n\n\u0097 -- With four months to go until Prince Harry's wedding to Meghan Markle, the bride-to-be has had her first fitting with the designer making her wedding dress, royal reporter Omid Scobie told ABC News.\n\n“We have a wedding dress designer,\" said Scobie, also a royal biographer. \"Meghan flew in her close friend and bridal stylist Jessica Mulroney from Toronto to London last weekend where she attended a top-secret fitting at Kensington Palace with the designer.\"\n\nPrince Harry and Meghan Markle during a visit to Cardiff Castle, Jan. 18, 2017, in Wales, UK. i-Images/Polaris\n\nHe added, \"They've tried on a number of different designs and are currently whittling it down to pick the best design for the day.”\n\nMarkle invited Mulroney, her best friend and stylist, to her new home with Harry -- Nottingham Cottage on the grounds of Kensington Palace -- to create a bespoke, custom-made dress for her wedding day.\n\nJessica Mulroney and actress Meghan Markle attend the World Vision event held at Lumas Gallery, March 22, 2016, in Toronto. George Pimentel/Getty Images\n\n“During the process, Meghan expressed the desire to wear something simple and classy and very elegant,\" Scobie said. \"I think we'll see her go down that route for the wedding day as well.”\n\nMulroney’s four-day visit to Kensington Palace last week also allowed Markle and Mulroney to start reviewing plans for the May 19, 2018, wedding and reception. Mulroney, also a bridal planner, is assisting Markle in the entire design and concept of the wedding party outfits and look for the reception.\n\n“Jessica Mulroney has a rich history when it comes to ... wedding planning and bridal styling,\" Scobie said. \"It's not just the dress she's involved in. She's actually helping with a number of elements for the big day and I think Meghan is really relying heavily on her expertise and a lot of the decision she has to make, and there are many.\"\n\nHarry, the fifth in line to the throne, has \"made himself scarce\" when it comes to the wedding planning, Scobie said.\n\nPrince Harry and Meghan Markle visit Cardiff Castle, an iconic building with a history dating back 2,000 years, Jan. 18, 2018, in Cardiff, Wales. Tim Rooke/REX/Shutterstock\n\n“Harry made himself scarce, giving the girls plenty of private time to kind of have their meetings with the designers and, of course, choose other wedding elements,\" he said. \"Harry's kind of made it clear that he wants to make this about Meghan.\"\n\nThe bride and groom have yet to send out formal wedding invitations but they have been telling close friends to save the date.\n\nPrince Harry and Meghan Markle a street dance class during their visit to Star Hub, a community and leisure center in the Tremorfa area of the city, Cardiff, Wales, Jan. 18 2018. Geoff Pugh/REX/Shutterstock\n\nAmong the high-profile guests who could attend Harry and Markle's wedding at Windsor Castle are Barack and Michelle Obama, Canadian Prime Minister Justin Trudeau and first lady Sophie Gregoire Trudeau and some of Markle's celebrity friends, including actress Priyanka Chopra, designer Misha Nonoo and tennis star Serena Williams.\n\nPrince William and Princess Kate invited Ellie Goulding to perform at their wedding reception in 2011.\n\n\"Harry has actually put on the top of his list his good friend Ed Sheeran to perform at the after-party,\" US Weekly magazine editor-in-chief Jennifer Peros told \"Good Morning America.\"\n\nAs for the bridal party, Prince William and Kate's children -- Prince George and Princess Charlotte -- will take center stage as page boy and flower girl, respectively, as they did at the 2017 wedding of their aunt, Pippa Middleton.\n\n\"Another surprise will be Jessica Mulroney's daughter, Ivy, who I heard will be a flower girl on the day,\" Scobie said.\n\nWho is Jessica Mulroney?\n\nMeghan Markle and Jessica Mulroney attend the Instagram Dinner held at the MARS Discovery District, May 31, 2016, in Toronto, Canada. George Pimentel/Getty Images\n\nMulroney is Canada’s best-known stylist. She represents not only Markle but also assists Canada's first lady Sophie Gregoire Trudeau and many members of Canada’s elite.\n\nMarkle lived in Toronto during her seven-season run on the TV drama \"Suits,\" which films in the Canadian city.\n\nMarkle's much-emulated style and the so-called \"Meghan effect,\" where anything she wears quickly crashes websites and sells out, is largely because of the collaboration and vision between Mulroney and Markle.\n\nMulroney has been seen at Markle's side at yoga outings together and at her most important public appearances. Mulroney was invited into the private box at the closing ceremony of last year's Invictus Games alongside Markle and Harry as well as Markle's mom and her other confidante, Markus Anderson.\n\nMulroney also helped Markle with her look on \"Suits,\" most notably the wedding dress Markle wore as her character Rachel Zane.\n\nMeghan Markle wears a wedding dress as the character Rachel Zane in Suits. USA Network\n\nSince Markle's engagement to Harry, Mulroney has worked with the future royal to select the iconic Parosh dress and Line the Label coat Markle wore on the day the couple's engagement was announced in November. Mulroney was also at Markle's side advising her on the stunning Ralph and Russo gown and Victoria Beckham cashmere sweater Markle wore for her intimate engagement photos with Harry.\n\nIn this photo released by Kensington Palace, Dec. 21, 2017, Britain's Prince Harry and Meghan Markle pose an official engagement photo, at Frogmore House, in Windsor, England. Alexi Lubomirski via AP\n\nIn this photo released by Kensington Palace, Dec. 21, 2017, Britain's Prince Harry and Meghan Markle pose for one of two official engagement photos, at Frogmore House, in Windsor, England. Alexi Lubomirski via AP\n\nMarkle's selection of outfits that are a nod to her Canadian ties and U.S. and now British roots has also come with the help of Mulroney. The nod to selecting styles from designers with local roots, often called diplomatic dressing, is also done by Princess Kate on official royal diplomatic tours.\n\n\"One thing to really take into account is that Megan has always been very conscious of where she's going when she dresses,\" Scobie said. \"Of course we've seen her make nods to the locations she's at or the country she's in with the style choices she's made.\"\n\nLooking ahead to Markle's wedding day, Scobie added, \"I think on the day of the wedding we'll very much see her kind of make a nod to the different places that she feels are important to her.\"\n\nMulroney is the wife of Ben Mulroney, whose father is a former prime minister of Canada. The couple is one of Canada's best-known power couples and are often considered Canadian royalty in Toronto.\n\nBen Mulroney and Jessica Mulroney arrive for the David Foster Foundation Gala at Rogers Arena, Oct. 21, 2017, in Vancouver, Canada. Andrew Chin/Getty Images\n\nIn addition to her role as stylist to the stars in Canada, Jessica Mulroney is also a bridal consultant for Kleinfeld Bridal and a contributing editor for Wedding Vacations.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s.abcnews.com/images/Entertainment/meghan-markle-wales-gty-mem-180119_16x9_992.jpg"], "top_img": "https://s.abcnews.com/images/Entertainment/meghan-markle-wales-gty-mem-180119_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Carolyn Durand", "Katie Kindelan", "January", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571", "title": "Meghan Markle has chosen wedding dress designer, has fitting at Kensington Palace: Source", "meta_data": {"keywords": "meghan markle, prince harry, wedding, dress, stylist, royals, london", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Meghan Markle has chosen wedding dress designer, has fitting at Kensington Palace: Source", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571", "title": "Meghan Markle has chosen wedding dress designer, has fitting at Kensington Palace: Source", "image": "https://s.abcnews.com/images/Entertainment/meghan-markle-wales-gty-mem-180119_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-01-19T15:39:14Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,52459571", "ipad": "abcnewsipad://link/story,52459571", "googleplay": "https://abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Meghan Markle has chosen wedding dress designer, has fitting at Kensington Palace: Source", "url": "https://abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/meghan-markle-wales-gty-mem-180119_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,52459571", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,52459571", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/meghan-markle-chosen-wedding-dress-designer-fitting-kensington/story?id=52459571"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}