{"url": "https://cookiesandsangria.com/2017/06/16/onion-ring-instagrams-and-other-secret-celebrity-accounts/", "text": "Celebrities, they’re just like us.\n\nThe MSM (Mainstream Media, you dummies) has been under a lot of heat from the current administration, and maybe it’s about time they look to international news outlets, where they’re getting down to the nitty gritty.\n\nPerhaps they can learn a thing or two from New Zealand’s news site Newshub, which was the first outlet to report that their native daughter Lorde may just be secretly running a food-related Instagram account.\n\nI can’t breathe Lorde has been exposed for running an onion ring instagram pic.twitter.com/yYjFuUGUu7 — tony (@tohneigh) June 13, 2017\n\nWhile the state of our nation continues to slowly disintegrate into tatters of the United States constitution, the MSM has at least one priority straight – the alleged secret Instagram account run by Taylor Swift’s BFF Lorde.\n\nNew Zealand news site Newshub first reported the story on Tuesday, with the headline “Is this Lorde’s secret onion ring Instagram account?”, noting they received a tip from a 17-year-old fan. The account, @onionringsworldwide, seemed fairly new, with only four posts and 24 followers, including Lorde and a number of her friends.\n\nWhile @onionringsworldwide, whose bio read, “Every onion ring I encounter, rated”, only had four posts, those four posts each gave plenty of clues leading back to Lorde, according to this 17-year-old fan. Like any good food Intagrammer, each caption included the name of the restaurant said onion ring was acquired from, and a review of the ring. That alone, plus knowing where Lorde is on her promotional tour (and knowing the look of her nails?), helped the fan build a strong case that this account was actually run by Lorde.\n\nEven more evidence that this account was run by non-Royal Lorde? Newshub reached out to her management and they didn’t respond. Instead? The account has since been deleted.\n\nNewshub contacted Lorde’s management to ask whether Lorde likes onion rings, whether she prefers a light batter on her onion rings, and whether she runs the account.\n\nManagement had not responded at the time of writing, but shortly after questions were sent through, we’re sad to report the onionringsworldwide account was removed from Instagram.\n\nA few things about this: A) why does it matter if she secretly runs this innocent account? It’s not going to effect her popularity. Why are they treating this like she ran a pro-life Instagram? B) why didn’t her management give a statement or respond at all to Newshub? C) She reviewed a Burger King onion ring, and that just seems like a lost cause.\n\nListen, if Lorde wants to have some semblance of normality in her life, let her just have an anonymous account, maintaining it while she flies private between Bonaroo and Bev Hills. But she can’t be the only celeb who has a secret social media account, right? I don’t know for sure, but here are my best guesses as to what type of accounts these famous people are managing under the shroud of internet secrecy.\n\nEDIT: LORDE IS ON JIMMY FALLON AS I’M WRITING THIS AND SHE CONFIRMED IT WAS HER ACCOUNT.\n\nShe said, “I sort of naively didn’t realize it would be a thing.. it was like a good past time… I deleted it because now people are going to be throwing onion rings (at me) on tour… I don’t think they get enough credit for how delicious they are.”\n\nUgh. Well, I’m guessing fans are still going to throw onion rings at you. But enjoy this post anyways.\n\nTaylor Swift // Bughead Tumblr\n\nWhen Taylor is active on her official Tumblr, it’s actually her and she knows how to use those hashtags, so it would only make sense if she had another Tumblr. I imagine she’s one of those hardcore shippers on the site, maybe for Riverdale, specifically for OTP Bughead aka Betty and Jughead. It’s mainly a fanfic site, but she’ll RB a gifset or two – maybe even featuring her own song lyrics.\n\nKylie Jenner // LOL GOP Twitter\n\nThe guy who spent 6 years demanding a birth certificate is so sick of witch hunts. — LOLGOP (@LOLGOP) June 15, 2017\n\nI have no doubt Kylie can be savage af, but it would delight me to no end if she was super into politics and anti-GOP to the core enough to run this account.\n\nZooey Deschanel // Miniature Food on YouTube\n\nIt’s just so twee, just like Zooey’s whole aesthetic.\n\nAdam Scott // Fat Jewish-esque Instagram\n\nIf you follow Adam Scott on Twitter, you know two things about him: 1) he’s not afraid to say how much trump sucks balls. 2) he is ridiculous and absurdly funny. I will never forget this dumb peanut butter and jelly joke that lasted lit’rally two years. So it’s not entirely out of his realm to run a comedy/meme account on Instagram.\n\nRosie O’Donnell // Toy Review on YouTube\n\nWe love Rosie. We loved her talk show. As tweens, we were enamored with her love for not only kids like us, but she had a kidlike quality that enabled her to constantly shoot koosh balls in the audience without it being awkward or gimmicky. Plus she loves a good nostalgia item, so these reviews of old toys would be right up her alley.\n\nBJ Novak // His Teen Sister’s Twitter\n\nWalking around with a phone charger looking for an outlet is probably the closest I'll ever get to knowing what it's like to be a guy — Keough A.F. Novak (@KeoNovak) February 10, 2015\n\nWell, OK, this is actually true. BJ has been running an account under the name “Keough Novak”, who is supposedly his snarky teen sister. I started following her years ago, when I noticed that BJ’s BFF/Soup Snake Mindy Kaling had been tweeting at her a lot. I obvs stalked her profile and thought she was funny, and it wasn’t until like 2 years later that I found out that BJ had been running the account with his two brothers – I grew suspicious after realizing she wasn’t getting older an was a perpetual 16 year old. BJ said of the account, “If I have a thought that’s superficial or immature, that’s a good thing for Keough to say.” Not only that, but HE DOESN’T EVEN HAVE A SISTER. Lies. Deceit. Hilarity too. Bless.\n\nKanye West // Slime Shop on Instagram\n\nHe may have quit Twitter, but for a guy who calls Steve Jobs one of his idols, I hardly believe he’s completely off social media. Plus, given his love for art, and creativity, I can picture him making these popular slime videos – and perhaps even selling tubs of them out of their Bel-Air mansion.\n\nBarack Obama // Secret Snapchat\n\nIn general, he just has a secret Snapchat account. Followers include Malia, Sasha, Joe Biden and Jay Z (who also has a secret account).", "images": ["https://cookiesandsangria.files.wordpress.com/2013/04/lisa-frank.jpg?resize=200%2C200", "http://2.bp.blogspot.com/-IhBQdkADqUQ/VJsg5r8MJrI/AAAAAAAABVE/j_9uU_R3HbQ/s1600/email.jpg", "https://cookiesandsangria.files.wordpress.com/2016/01/insta-icon.png", "https://cookiesandsangria.files.wordpress.com/2014/09/tnc.jpg?resize=200%2C200", "https://cookiesandsangria.files.wordpress.com/2013/06/fnl-screening.jpg?resize=200%2C200", "https://pixel.wp.com/b.gif?v=noscript", "https://tracileigh27.files.wordpress.com/2014/02/twitter-icon_edit1.png", "https://i1.wp.com/www.newshub.co.nz/home/entertainment/2017/06/is-this-lorde-s-secret-onion-ring-instagram-account/_jcr_content/par/image.img.full.high.jpg/v0.jpg", "https://cookiesandsangria.files.wordpress.com/2017/06/onion-rings.jpg?w=749", "http://myrottingbrain.files.wordpress.com/2011/04/vlcsnap-2011-04-22-00h31m08s154.png?resize=200%2C200", "http://4.bp.blogspot.com/-k-z2kcTxsJg/VoePGPP_9uI/AAAAAAAABd8/7hxR7JUSdX0/s1600/Polaroid_2016.jpg", "https://cookiesandsangria.files.wordpress.com/2014/02/harding.jpg?resize=200%2C200", "https://s1.wp.com/i/badges/freshly-pressed-circle.png", "https://cookiesandsangria.files.wordpress.com/2014/03/test-header_circle.jpg", "https://tracileigh27.files.wordpress.com/2014/02/facebook-icon_edit1.png", "https://i2.wp.com/www.newshub.co.nz/home/entertainment/2017/06/is-this-lorde-s-secret-onion-ring-instagram-account/_jcr_content/par/image_1627135154.img.full.high.jpg/v0.jpg", "https://cookiesandsangria.files.wordpress.com/2015/06/trw_no.jpg?resize=200%2C200", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://tracileigh27.files.wordpress.com/2014/02/tumblr-icon_edit1.png"], "top_img": "https://cookiesandsangria.files.wordpress.com/2017/06/onion-rings.jpg?w=749", "keywords": [], "authors": [], "canonical_link": "https://cookiesandsangria.com/2017/06/16/onion-ring-instagrams-and-other-secret-celebrity-accounts/", "title": "Onion Ring Instagrams and Other Secret Celebrity Accounts", "meta_data": {"viewport": "width=device-width", "google-site-verification": "U_T-5igUC7VTrJEByEZqf_7VsIi3v5nWYli_cd0Ff8c", "generator": "WordPress.com", "og": {"type": "article", "title": "Onion Ring Instagrams and Other Secret Celebrity Accounts", "url": "https://cookiesandsangria.com/2017/06/16/onion-ring-instagrams-and-other-secret-celebrity-accounts/", "description": "Celebrities, they’re just like us. The MSM (Mainstream Media, you dummies) has been under a lot of heat from the current administration, and maybe it’s about time they look to internati…", "site_name": "Cookies + Sangria", "image": {"identifier": "https://cookiesandsangria.files.wordpress.com/2017/06/onion-rings.jpg?w=749", "width": 749, "height": 1200}, "locale": "en_US"}, "article": {"published_time": "2017-06-16T16:14:29+00:00", "modified_time": "2017-06-16T08:17:04+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"creator": "@cookiessangria", "site": "@cookiessangria", "text": {"title": "Onion Ring Instagrams and Other Secret Celebrity Accounts"}, "image": "https://cookiesandsangria.files.wordpress.com/2017/06/onion-rings.jpg?w=640", "card": "summary_large_image"}, "theme-color": "#ffffff", "application-name": "Cookies + Sangria", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=WordPress.com Forums;action-uri=http://forums.wordpress.com/;icon-uri=https://s1.wp.com/i/favicon.ico", "description": "Celebrities, they're just like us. The MSM (Mainstream Media, you dummies) has been under a lot of heat from the current administration, and maybe it's about time they look to international news outlets, where they're getting down to the nitty gritty. Perhaps they can learn a thing or two from New Zealand's news site Newshub, which…"}, "movies": ["https://www.youtube.com/embed/97Z6E9Zk43I?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/ltO_H0CM3bs?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/xvSPtTxhV6g?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1497542400.0, "source": "https://cookiesandsangria.com", "summary": ""}