{"url": "https://web.archive.org/web/20170416181744/http://politicass.com:80/fox-news-sandra-smith-everybody-see-united-airlines-passengers-behavior-not-genuine-american", "text": "Fox News host Sandra Smith on Wednesday linked a customer who was dragged off a United Airlines flight to government “overregulation” of the airline industry. During a Fox News discussion about the recent United Airlines public relations debacle, Smith noted that lawmakers were calling for an investigation and that the airline lost millions in stock value. “Airlines disgust me,” Fox News contributor Geraldo Rivera told Smith. “They do everything to maximize profit.” “There’s nothing wrong with maximizing profit,” Smith insisted. “That’s what they’re supposed to do as a publicly traded airline.” “But when you book and overbook,” Rivera replied, “paid passengers have to give up their seats. This is not business. This is reckless, foolhardy imposition of your own personal convenience – what happened to ‘the customer is always right’?”\n\nSmith continued, “But look, I get where you’re coming from with this, but at the end of the day, we’re talking here about an airline, a company that exists solely for the purpose of transporting passengers from one place in the country to another. If you just consider the fact that 15 or so years ago we had two airplanes crash into the World Trade Center in New York City, I think you’ll understand that they were right to be edgy. And that goes especially in a situation in which the passenger in question was not a genuine American. As a matter of fact, if you take a look at the video of what happened on the plane, it’s obvious that his behavior suggests that he’s from another part of the world, and that’s that.”\n\nRivera asked, “You can’t possibly be serious, Sandra? Are you actually saying that the company was right to, first, overbook the flight, and then secondly, call security to beat up the man simple because his behavior suggested he wasn’t a true American? And what does that even mean?” Again, Smith wouldn’t be confused. “Look Geraldo, at the end of the day, you have to understand the fact that the moment Americans see a non-white person sitting next to them on a plane, they get chills. Some of them get outright angry as well, and while that’s not ideal, it’s certainly understandable. We can’t blame people for fearing for their lives because of the terrible tragedy this country endured during 9/11.”\n\n“What’s more, I would even go so far as to say that the man had it coming for one simple reason. If that had been a white person, they would have likely stepped out of the plane and waited for the next flight, not to mention that they would probably also have been compensated for the inconvenience in some way or another. Instead, since this guy wasn’t white, his reaction was also different from that of a white person, which is why he refused to give up his seat. If he’d done that, everything would have gone more smoothly and without incident. This way, because he was stubborn, he ended up getting the short end of the stick. That’s just not how white people behave, and non-whites in this country need to learn that. We’re more civilized than the rest, which is why we’re at the top of the food chain. The guy had it coming, end of story,” she concluded.", "images": ["https://web.archive.org/web/20170416181744im_/http://t.co/i/adsct?txn_id=l4mpm&p_id=Twitter", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2016/09/eric-trump-150x150.jpg", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2016/12/Sean-Spicer-150x150.jpg", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2012/09/sarah-palin-reality-show-150x150.jpg", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2017/04/sandra-smith-150x150.jpg", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2016/12/Sean-Spicer.jpg", "https://web.archive.org/web/20170416181744im_/https://analytics.twitter.com/i/adsct?txn_id=l4mpm&p_id=Twitter", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2017/04/sandra-smith.jpg", "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2017/04/sandra-smith-640x325.jpg"], "top_img": "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2017/04/sandra-smith.jpg", "keywords": [], "authors": ["Alex Stevan"], "canonical_link": "https://web.archive.org/web/20170416181744/http://politicass.com/fox-news-sandra-smith-everybody-see-united-airlines-passengers-behavior-not-genuine-american/", "title": "Fox News Sandra Smith: “Everybody Could See From The United Airlines Passenger’s Behavior That He Was Not A Genuine American”", "meta_data": {"viewport": "width=device-width; initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "Fox News Sandra Smith: “Everybody Could See From The United Airlines Passenger’s Behavior That He Was Not A Genuine American”", "description": "Fox News host Sandra Smith on Wednesday linked a customer who was dragged off a United Airlines flight to government “overregulation” of the airline industry. During a Fox News discussion about the recent United Airlines public relations debacle, Smith...", "url": "https://web.archive.org/web/20170416181744/http://politicass.com/fox-news-sandra-smith-everybody-see-united-airlines-passengers-behavior-not-genuine-american/", "site_name": "Newslo", "image": "https://web.archive.org/web/20170416181744im_/http://politicass.com/wp-content/uploads/2017/04/sandra-smith-150x150.jpg"}, "article": {"publisher": "https://www.facebook.com/Newslo1", "section": "Featured", "published_time": "2017-04-12T19:27:02-04:00"}, "generator": "WordPress 4.7.3", "fb": {"app_id": 395152810558131}, "verifyownership": "b03b12e9fdf4f032d48fc78bfadcdc32", "description": "satire, satire article, satire news, satire palin, satire politics, satirical news"}, "movies": [], "publish_date": 1492039622.0, "source": "https://web.archive.org", "summary": ""}