{"url": "https://www.latimes.com/entertainment/tv/showtracker/la-et-st-2018-emmy-reactions-20180712-story.html", "text": "It’s Emmy nominations morning, and Hollywood is overflowing with stars celebrating their recognition.\n\nFrom social media missives to statements from publicists, everyone was excited to be embraced by the Television Academy.\n\nComedian Tiffany Haddish, who was nominated for her work hosting “Saturday Night Live,” slyly suggested that she might buy a new dress for the occasion. (Does that mean she’s retiring that famous Alexander McQueen dress she got plenty of use out of during last awards season?)\n\nTheater all-star Lin-Manuel Miranda went low-key with his appreciation for the nomination for a guest turn on “Curb Your Enthusiasm,” referencing the show’s famous catchphrase and calling himself, “Pretty, pretty, pretty grateful.”\n\nAdvertisement\n\nStay tuned for more celebrity reactions throughout the day.\n\nOVERJOYED to be nominated for an #Emmy for when I hosted @nbcsnl!! I might even splurge for a new dress for this one!! Thank you everyone for your love and support! #sheready — Tiffany Haddish (@TiffanyHaddish) July 12, 2018\n\n“My genuine gratitude to the Emmy Voters. ‘Godless’ was Scott Frank’s triumph. Thrilled to be a part of it. Plus I got to ride a horse.” — Jeff Daniels, supporting actor in a limited series\n\nAdvertisement\n\n“I’m honored and so thankful to the Television Academy for thinking of us. A big thank you to truTV and the writers, cast and crew for making our show possible. As this is my first Emmy nomination, I feel compelled to ask, does this include a cash prize? I’m asking for a friend.” — Amy Sedaris, variety sketch series\n\n“Making ‘RuPaul’s Drag Race’ is a labor of love. The fact that members of the Television Academy have recognized that passion by nominating us for 12 Emmys is a true honor. It takes a village, people. I want to recognize the hard work and dedication of my partners at VH1 and World of Wonder, our dedicated cast and crew, and most of all, the amazing queens that help us celebrate the heart and soul of drag. Condragulations to our fellow nominees.” — RuPaul Charles, reality competition series\n\nAdvertisement\n\nWhat an honor, @TelevisionAcad. Thank you so much. Truly. Wow. And a huge congrats to my fellow cast and crew of @ACSFX! @MrRPMurphy does it again! pic.twitter.com/T8Wzn8Od5e — Darren Criss (@DarrenCriss) July 12, 2018\n\n“Of course it’s thrilling to see [‘The Assassination of Gianni Versace: American Crime Story’] attract so much recognition, and I am forever grateful to Tom Rob Smith for his brilliant take, to my producing partners Nina Jacobson, Brad Simpson and Brad Falchuk for their collaboration and friendship, and to our talented cast who breathed such humanity into these characters. This was a heartbreaking story to tell, made more so by the fact that we continue as a culture to grapple with homophobia and shame and intolerance.” — Ryan Murphy, limited series\n\nyay #TheAmericansFX nominated for best drama!! congrats every one♥️ #emmys — holly taylor (@HollyTaylor97) July 12, 2018\n\n“I hope that I’m holding an Emmy for Best Comedy soon. It can happen because ‘Curb Your Enthusiasm’ was nominated. Now I just have to convince Larry to go. #itwontbehardbutitwilltakeaneffort #itreallyisanhonortobenominated” — Jeff Garlin, comedy series\n\nAdvertisement\n\nThat moment your show gets nominated for 4 Emmys!!! What an honor!!! Couldn’t have done it without the people you see here plus all the rest of our family at @netflix, @itv_america, and @scout.productions #emmys #emmy https://t.co/8dCh5JWQ1h pic.twitter.com/m9mm6oUYJJ — Bobby Berk (@bobbyberk) July 12, 2018\n\n“12 nominations for our show!! I love this cast and crew so much and I’m beyond thrilled to see how much ‘Stranger Things’ has been embraced by our peers and The Academy. It’s incredibly special and rewarding. I’m the luckiest girl....” — Millie Bobby Brown, supporting actress in a drama\n\nWowzas! Humbled #Emmys2018 Huge shout out to EVERYONE who worked so hard @WestworldHBO and to every single person who uses art as a force for good xxx T pic.twitter.com/f5MLKtcK29 — Thandie Newton OBE (@thandienewton) July 12, 2018\n\n“It’s truly an honor to be nominated, and especially nice not to be the oldest person in the category. Thanks, Larry [David].” — Ted Danson, supporting actor in a comedy\n\nAdvertisement\n\n“I couldn’t have asked for a more talented, dedicated and tasteful group of people to work alongside on ‘Ozark.’ Every person, in every department, has a hand in earning these Emmy nominations and we are so grateful that the Academy, and the public, has found and embraced our show. A big thank you from all of us.” — Jason Bateman, lead actor in a drama\n\n“I am completely over the moon and so happy. This recognition from my peers for my life’s work and my show, ‘Better Things.’ Filled with gratitude. Thank you.” — Pamela Adlon, lead actress in a comedy\n\nAdvertisement\n\nJust a normal picture of how everyone was all together when we got the news. Thanks @TelevisionAcad!! #emmys pic.twitter.com/RJvOXbzjNA — Full Frontal (@FullFrontalSamB) July 12, 2018\n\n“I am incredibly honored to have been recognized by the Television Academy, and want to thank Ryan Murphy and the entire cast and crew of [‘American Horror Story: Cult’], with a particular shout out to the magnificent Evan Peters, who inspires me and makes me want to be a better actor.” — Sarah Paulson, lead actress in a limited series or movie\n\nI am truly humbled and appreciative of this Emmy nomination. I am thankful and grateful to @ABC for giving us a platform to share our stories. I say OUR because I would not be in this moment right now without without my cast mates who push me as an actor, my amazing writers who pic.twitter.com/8pEdejum0A — Anthony Anderson (@anthonyanderson) July 12, 2018\n\n, redirecting my career, and changing our narrative! I am forever indebted and eternally grateful! ❤️ #Emmys — Anthony Anderson (@anthonyanderson) July 12, 2018\n\nAdvertisement\n\n“I am beyond flattered and honored to be nominated, especially amongst such an inspiring group of directors. Making ‘Atlanta’ is truly a family affair, and I’m so grateful to Donald [Glover] and FX and to the writers, actors, and crew that make this show possible.” — Hiro Murai, directing for a comedy\n\nYes yes yes!!!!!! I’m so happy and humbled about this nomination. I think my head is about to explode. Joy joy joy THIS IS CRAZY!!! Thank you @MrRPMurphy https://t.co/GZvYKlVQ2l — Ricky Martin (@ricky_martin) July 12, 2018\n\n“On Sunday, I promised myself I’d take a drinking hiatus, but that’s cancelled now. So grateful to Prentice Penny, our ‘Insecure’ family and to HBO for putting so much faith in our show. — Issa Rae, lead actress in a comedy\n\nAdvertisement\n\n“My deepest thanks to the Emmy voters and of course, the brilliant Ryan Murphy for the gift of being a part of this culture changing production [‘The Assassination of Gianni Versace: American Crime Story’]; thanks to Brad Simpson, Nina Jacobson, the crew, cast, hair, makeup, wardrobe, Tom Rob Smith for his remarkable script, Gwyneth Horder Payton and Dan Minahan for their glorious direction. My gratitude to all of them and FX is beyond words or measure. — Judith Light, supporting actress in a limited series or movie\n\nGLOW was nominated for an EMMY!! And so was our INCREDIBLE #BettyGilpin!!! So proud of all my girls and of our fantastic show! 💖 https://t.co/zc8LCluuMp — Alison Brie (@alisonbrie) July 12, 2018\n\nBeing on set with our extraordinary cast and crew was the most wonderful way to receive and celebrate the news today. I am beyond excited that the entire ‘Maisel’ team was recognized for their insane talents and hard work. This was a MARVELOUS boost to power us through the rest of Season 2.” — Rachel Brosnahan, lead actress in a comedy\n\nAdvertisement\n\nSo honored to be included with such an amazingly talented group of women. Thank you @televisionAcademy for this wonderful honor. Of course, none of this would be possible without the entire @MomCBS family. Love you guys! #Emmys pic.twitter.com/WY5eBk21Pd — Allison Janney (@AllisonBJanney) July 12, 2018\n\n“This was such a personal one [‘The Defiant Ones’] for me, having literally grown up ‎in the business with these two forces of nature. I’m incredibly grateful to both the television academy and the public for having embraced so fully their journey.” — Allen Hughes, documentary or nonfiction series\n\nFuller House just got an Emmy nomination!!!! I’m so so so proud of our team!!! Congratulations 🎉 everyone!! https://t.co/9l4Fg0wOhC — Candace Cameron Bure (@candacecbure) July 12, 2018\n\nlibby.hill@latimes.com\n\nAdvertisement\n\nTwitter: @midwestspitfire\n\nUPDATES:\n\n1:35 p.m.: This article was updated with additional reactions.\n\n12 p.m.: This article was updated with additional reactions.\n\nAdvertisement\n\n11:10 a.m.: This article was updated with additional reactions.\n\nThis article was originally published at 10:20 a.m.", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/8999d99/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Fb6%2F78236c522e6f3783567d376fa087%2Fla-1531413083-cu5fguagg5-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/62eb022/2147483647/strip/true/crop/1152x1152+448+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F93%2F43%2F4350c5602c3c519f993460c8f79f%2Fimg-55e4ae33-turbine-la-bio-libby-hill", "https://ca-times.brightspotcdn.com/dims4/default/2fedd22/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Fb6%2F78236c522e6f3783567d376fa087%2Fla-1531413083-cu5fguagg5-snap-image", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/2fedd22/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Fb6%2F78236c522e6f3783567d376fa087%2Fla-1531413083-cu5fguagg5-snap-image", "keywords": [], "authors": ["Libhill Is A Former Television Reporter For The Los Angeles Times. Her Tv Analysis Has Appeared At Salon", "Vulture", "Rolling Stone", "The New York Times. Hill", "A Native Of South Dakota", "Has A Passel Of Cats", "Too Many Books", "A Perpetually Full Dvr."], "canonical_link": "https://www.latimes.com/entertainment/tv/showtracker/la-et-st-2018-emmy-reactions-20180712-story.html", "title": "Lin-Manuel Miranda, RuPaul, Tiffany Haddish and more react to Emmy nominations", "meta_data": {"og": {"title": "Lin-Manuel Miranda, RuPaul, Tiffany Haddish and more react to Emmy nominations", "url": "https://www.latimes.com/entertainment/tv/showtracker/la-et-st-2018-emmy-reactions-20180712-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/2fedd22/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Fb6%2F78236c522e6f3783567d376fa087%2Fla-1531413083-cu5fguagg5-snap-image", "url": "https://ca-times.brightspotcdn.com/dims4/default/2fedd22/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Fb6%2F78236c522e6f3783567d376fa087%2Fla-1531413083-cu5fguagg5-snap-image", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "la-1531413083-cu5fguagg5-snap-image"}, "description": "It’s Emmy nominations morning, and Hollywood is overflowing with stars celebrating their recognition.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/staff/libby-hill", "content_tier": "metered", "published_time": "2018-07-12T20:35:00", "opinion": "false", "section": "Television"}, "twitter": {"card": "summary_large_image", "description": "It’s Emmy nominations morning, and Hollywood is overflowing with stars celebrating their recognition.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/79d9ffa/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Fb6%2F78236c522e6f3783567d376fa087%2Fla-1531413083-cu5fguagg5-snap-image", "alt": "la-1531413083-cu5fguagg5-snap-image"}, "site": "@latimes", "title": "Lin-Manuel Miranda, RuPaul, Tiffany Haddish and more react to Emmy nominations"}, "fb": {"app_id": 119932621434123, "pages": 5863113009}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "RuPaul, Sterling K. Brown and Tiffany Haddish were among Thursday morning's Emmy nominees who shared their joy and gratitude with fans.", "keywords": "RuPaul, Lin-Manuel Miranda, Tiffany Haddish,emmys, Sterling K. Brown", "brightspot.contentId": "00000169-0cba-dbbe-a16f-4efad5480000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1531398900.0, "source": "https://www.latimes.com", "summary": ""}