{"url": "www.usatoday.com/story/news/world/2017/11/27/london-prince-harry-meghan-markle-engagement-reactions/898194001/", "text": "LONDON — People around the world — from celebrity Kim Kardashian to regular folks — rushed to congratulate Prince Harry and American actress Meghan Markle on their engagement Monday. But many here, where the royal family resides, reacted in British ho-hum fashion.\n\n\"I'm happy for the geezer, but I don't care,\" John Hedge, 42, said on a street in Streatham, a mixed-income neighborhood in south London.\n\nThat low-key response, expressed by others in the British capital, matched the way Harry said he popped the big question: while they were cooking a roast chicken during a \"standard, typical night\" at their cottage on the grounds of Kensington Palace.\n\n\"Not interested,\" said Tony Jones, a commuter rushing to a train at London's Victoria station Monday evening.\n\nOther Britons took to social media to ask whether the engagement would mean an extra day off — it won't. \"Give us the bank holiday or else,\" wrote Owen Jones, a left-wing newspaper columnist who believes the monarchy should be abolished.\n\nPrime Minister Theresa May's office said the wedding day — sometime in the spring — will not be a national holiday, in contrast to the 2011 nuptials of Harry's older brother and future king, Prince William and Duchess Kate.\n\nMore:Palace: Prince Harry and Meghan Markle announce engagement\n\nMore:Prince Harry: Princess Diana 'would be over the moon'\n\n\"Me thinking about the monarchy on a normal day V me realising we might get a bank holiday for the Royal Wedding,\" said a Twitter user with the handle @Gamble1878. Posted with the tweet was a picture of a protester holding a sign that said \"down with the monarchy\" next to a separate image of a man dressed in a suit emblazoned with the Union Jack, the flag of the United Kingdom.\n\nOthers were more upbeat, despite what some described as \"royal wedding and baby fatigue,\" referring to William and Kate's marriage and their two children, Prince George and Princess Charlotte, with a third on the way.\n\n\"I love Harry,\" said carpenter Jerry Walsh, 61, outside a pub in south London. \"He's the most natural of them (the royal family). They can do their own thing — let them live their lives. She's a beautiful girl — good luck to them. When his mum (Princess Diana) died, I felt for them.\"\n\nMore:See Meghan Markle's engagement ring with diamonds from Princess Diana\n\nMore:Prince Harry and Meghan Markle: 10 things to know about the royal engagement\n\nMarie Elleston, a housewife in her 60s, described the news as \"lovely.\" \"I heard it on the news today,\" she said. \"She's very nice — she's a beautiful woman,\" she added about Markle, 36, a Los Angeles native who met Harry, 33, last year when he launched the Invictus Games in Toronto, where her TV show Suits is filmed.\n\n\"I'm happy,\" said Kathleen Connell, 78, adding that Markle is \"different from everyone else.\"\n\n\"It's fantastic,\" she added.\n\nReaction outside Buckingham Palace, a top draw for tourists worldwide, was also relatively low-key.\n\n\"I think it's perfectly fine for her to marry into the royal family,\" said Kieran Verseim, a medical lab technician from Denver. \"Anybody should be able to chose who they want to marry regardless of background,\" she said.\n\nMarkle, who is biracial, will be the first non-white person to marry into the royal family in modern history, a fact that sparked debate about interracial marriages in the United Kingdom. About 1 in every 10 people are in racially mixed relationships in the U.K., according to the latest census data.\n\n\"We don't know too much about the royal family in Turkey,\" said Tarik Dogan, 42, an engineer from Istanbul as he marveled at the queen's official residence.\n\n\"The little ones, the children, they are sweet,\" he added, referring to Prince George and Princess Charlotte.\n\nUnlike some locals, the tourism industry reacted with glee about the next royal wedding. Visit London, the official city guide, congratulated Harry and Meghan and said the royal family are \"so important for tourism in London.\"\n\nTourism across the U.K. linked to the royal family generates more than $666 million a year and attracts more than 2.7 million visitors, according to Visit London.\n\nLast year saw a record for international visitors to London, the tourism group said. \"And royal heritage was a big part of driving that.\"\n\n\n\n", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5660483374001_5660466363001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/4b782950733bcc517eb3928532e4ffe0f922274f/c=4-0-1989-1122/local/-/media/2017/11/27/USATODAY/USATODAY/636473865078412994-AP-BRITAIN-ROYAL-ENGAGEMENT-95627889.JPG?width=660&height=374&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/4b782950733bcc517eb3928532e4ffe0f922274f/c=4-0-1989-1122/local/-/media/2017/11/27/USATODAY/USATODAY/636473865078412994-AP-BRITAIN-ROYAL-ENGAGEMENT-95627889.JPG?width=1985&height=1122&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/4b782950733bcc517eb3928532e4ffe0f922274f/c=4-0-1989-1122/local/-/media/2017/11/27/USATODAY/USATODAY/636473865078412994-AP-BRITAIN-ROYAL-ENGAGEMENT-95627889.JPG?width=1985&height=1122&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/news/world/2017/11/27/london-prince-harry-meghan-markle-engagement-reactions/898194001/", "title": "We ask Londoners about Prince Harry and Meghan Markle. Their responses may surprise you", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "We ask Londoners about Prince Harry and Meghan Markle. Their responses may surprise you", "description": "\"I'm happy for the geezer, but I don't care,\" said John Hedge, 42.", "url": "https://www.usatoday.com/story/news/world/2017/11/27/london-prince-harry-meghan-markle-engagement-reactions/898194001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/4b782950733bcc517eb3928532e4ffe0f922274f/c=4-0-1989-1122/local/-/media/2017/11/27/USATODAY/USATODAY/636473865078412994-AP-BRITAIN-ROYAL-ENGAGEMENT-95627889.JPG?width=1985&height=1122&fit=crop&format=pjpg&auto=webp", "width": 1985, "height": 1122}, "type": "article"}, "article": {"author": "Kim Hjelmgaard and Jane Onyanga-Omara", "content_tier": "free", "opinion": "false"}, "description": "\"I'm happy for the geezer, but I don't care,\" said John Hedge, 42.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/4b782950733bcc517eb3928532e4ffe0f922274f/c=4-0-1989-1122/local/-/media/2017/11/27/USATODAY/USATODAY/636473865078412994-AP-BRITAIN-ROYAL-ENGAGEMENT-95627889.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "We ask Londoners about Prince Harry and Meghan Markle. Their responses may surprise you", "description": "\"I'm happy for the geezer, but I don't care,\" said John Hedge, 42."}}, "movies": [], "publish_date": 1511712000.0, "source": "http://www.usatoday.com", "summary": ""}