{"url": "www.cheatsheet.com/entertainment/kim-kardashian-and-kanye-west-surprising-secrets-their-body-language-reveals-about-their-relationship.html/", "text": "Kim Kardashian and Kanye West seem to have perfectly curated their public image as a couple. We may know that they’re one of Hollywood’s most fashionable duos, but we have no idea what they’re really like together behind-the-scenes.\n\nLuckily, we can find out a lot about a couple based off of how they interact in public. Experts have shared just what their body language reveals, including why West always stands behind Kardashian in photos (page 5), and proof that they go through bad days just like any other couple (page 7).\n\n1. Stealing a kiss\n\nThis moment is a pure example of their love. | Dimitrios Kambouris/Getty Images for EMM Group This moment is a pure example of their love. | Dimitrios Kambouris/Getty Images for EMM Group\n\nOne thing is for sure: Kardashian and West are genuinely in love. According to body language expert Blanca Cobb, West took everyone off guard with his kiss (John Legend and Chrissy Teigen didn’t even have time to react!), but in the sweetest way. “He didn’t want to wait!,” Cobb explained.\n\n“You can tell [Kardashian is] enjoying it from the look on her face — she’s holding back a smile as she puckers up,” she added. “She could have stood up, but Kanye finds her instead, showing he was really feeling love for her in that moment.”\n\nNext: It’s crazy how connected they appear in this photo.\n\n2. Can’t keep her hands to herself\n\nKim Kardashian is clearly crazy about her husband. | Harry How/Getty Images Kim Kardashian is clearly crazy about her husband. | Harry How/Getty Images\n\nKardashian just couldn’t keep her hands to herself while courtside at a Los Angeles Lakers game. With not one, but two hands around West’s arm, Cobb explains that it’s a way of “maintaining [their] connection.” She added, “[It’s] a silent way of saying, ‘I like you, I want to be with you, you mean something to me.’ You use two hands when you feel extra affectionate toward a person.”\n\nWest is showing his love for Kardashian, too, but in a different way. According to Cobb, his right shoulder is leaning into Kardashian to show he likes the feeling of her touch. Plus, both of their big smiles are completely genuine, which is revealed by their raised cheeks and looks of love on their faces.\n\nNext: We can’t get over this look on their faces.\n\n3. They’re all smiles\n\nKanye West only has eyes for Kim Kardashian. | Jamie McCarthy/Getty Images| Jamie McCarthy/Getty Images Kanye West only has eyes for Kim Kardashian. | Jamie McCarthy/Getty Images| Jamie McCarthy/Getty Images\n\nWest is notorious for keeping a straight face in public, but sometimes, he just can’t help but be all smiles around Kardashian. With West’s hand resting on Kardashian’s backside, we can definitely classify this as a glimpse into an intimate moment between the couple.\n\nAccording to Cobb, Kardashian seems comfortable with West getting a little touchy-feely in public. Cosmopolitan adds that it “requires a high level of trust and comfort on Kim’s part.”\n\nNext: This is how West really makes Kardashian feel.\n\n4. Giving her confidence\n\nThey’re confident on their own, and being together just boosts this feeling. | Neilson Barnard/Getty Images They’re confident on their own, and being together just boosts this feeling. | Neilson Barnard/Getty Images\n\nKardashian is looking seriously confident in this photo, and it could very well have something to do with her company. WIth the powerful look of her hand in her pocket and her self-assured gaze at the paparazzi, you can tell she’s feeling good.\n\nCobb explained, “When you’re proud of who you’re with, you can draw confidence from both your partner and from within.”\n\nNext: This is why West is always standing behind Kardashian.\n\n5. She’s the center of attention\n\nWest puts his wife first — literally. | Timothy A Clary/AFP/Getty Images West puts his wife first — literally. | Timothy A Clary/AFP/Getty Images\n\nIf you’ve noticed that West almost always stands behind Kardashian in photos — he’s doing it on purpose. According to body language expert Darren Stanton, “Kanye has chosen to significantly shield his body behind Kim’s.”\n\nHe added, “He makes himself appear smaller and more subservient as he is being careful not to steal any of the attention. Kanye is using Kim as a proactive barrier, allowing him to sink into his surroundings and take the emphasis off himself.”\n\nWest does often make sure to have his hand resting on Kardashian, even when he’s letting her have the limelight. The move allows him to assert himself in the relationship, which, according to Cobb, “is part of who they are as a couple.”\n\nNext: They aren’t always happy with each other.\n\n6. Feelings of coldness\n\nThey aren’t on the same page here. | Bryan Bedder/Getty Images for Harper’s Bazaar They aren’t on the same page here. | Bryan Bedder/Getty Images for Harper’s Bazaar\n\nAlthough West and Kardashian seem completely obsessed with each other most of the time, they’ve had moments where they come across as cold or disconnected. Take this photo above, for example. Even though they’re close, it gives body-language expert Patti Wood an “unusual” feeling.\n\nShe explained to Elite Daily, “It’s all the cues together in a sentence that says, ‘I don’t really want to be seen connected to her. I’m forward to her. I’m closed. I’m not touching her. [My] fingers are curled upward rather than touching. It’s very awkward. It’s very unusual.”\n\nKardashian is looking particularly disconnected in this photo, according to Wood. “She’s got [the] front of her body up and just barely touching him,” Wood described. “But she’s not giving him weight … and what [that] shows is a lack of connection on her part.”\n\nShe added, “If you look at her left arm that’s toward the camera, it could so easily be touching his body or surrounding his body, [and the placement shows] a subconscious choice not to do that.”\n\n\n\nNext: This proves they’re just like any other couple.\n\n7. They have bad days just like any other couple\n\nTheir expressions look forced in this photo. | Their expressions look forced in this photo. | PeopleStyle via Twitter\n\nWood is a bit skeptical about how the couple is posing in this photo. Upon first glance, you might think they look just as close as they normally do. However, when she looked at it closer, she saw more of a pose than she did chemistry.\n\n“You see his head lean, but if you look at the expression on his face, the facial expression is a sadness combined with that dead-eyed stare forward,” Wood explained. “Usually, you draw comfort leaning in and resting on your mate’s head. I typically see serenity and happiness. I don’t see that here.”\n\nKardashian is giving off similar vibes, according to Wood. “Her hand is very stiffly placed around his shoulder with a strange wrist bend. It’s not relaxed … and the fingers are not curled around him.”\n\nKardashian and West might not seem totally happy in every photo, but in reality, it just proves they’re like any other couple. Sure, they might have their bad days, but overall, we can see that Kardashian and West are a team.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/03/Harpers-Bazaar-Celebrates-ICONS-By-Carine-Roitfeld-Presented-By-Infor-Laura-Mercier-And-Stella-Artois-Inside-e1522426744180.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/John-Legend-Celebrates-His-Birthday-And-The-10th-Anniversary-Of-His-Debut-Album-Get-Lifted-At-CATCH-NYC-624x500.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/03/2016-MTV-Video-Music-Awards-Arrivals-e1522426627969.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/03/John-Legend-Celebrates-His-Birthday-And-The-10th-Anniversary-Of-His-Debut-Album-Get-Lifted-At-CATCH-NYC-624x500.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/kim-kanye-7.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Charles-James-Beyond-Fashion-Costume-Institute-Gala-Candids-640x427.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Denver-Nuggets-v-Los-Angeles-Lakers-Game-Seven-e1522426552401.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/10/Kim-Kardashian-and-Kanye-West.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/03/John-Legend-Celebrates-His-Birthday-And-The-10th-Anniversary-Of-His-Debut-Album-Get-Lifted-At-CATCH-NYC-624x500.jpg", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/entertainment/kim-kardashian-and-kanye-west-surprising-secrets-their-body-language-reveals-about-their-relationship.html/", "title": "Kim Kardashian and Kanye West: Surprising Secrets Their Body Language Reveals About Their Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/kim-kardashian-and-kanye-west-surprising-secrets-their-body-language-reveals-about-their-relationship.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Kim Kardashian and Kanye West's body language reveals a lot more than you would think about their marriage.", "og": {"locale": "en_US", "type": "article", "title": "Kim Kardashian and Kanye West: Surprising Secrets Their Body Language Reveals About Their Relationship", "description": "Kim Kardashian and Kanye West's body language reveals a lot more than you would think about their marriage.", "url": "https://www.cheatsheet.com/entertainment/kim-kardashian-and-kanye-west-surprising-secrets-their-body-language-reveals-about-their-relationship.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-23T17:27:05-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/03/John-Legend-Celebrates-His-Birthday-And-The-10th-Anniversary-Of-His-Debut-Album-Get-Lifted-At-CATCH-NYC-624x500.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/03/John-Legend-Celebrates-His-Birthday-And-The-10th-Anniversary-Of-His-Debut-Album-Get-Lifted-At-CATCH-NYC-624x500.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "reality TV", "section": "Entertainment", "published_time": "2018-06-23T17:27:00-04:00", "modified_time": "2018-06-23T17:27:05-04:00"}, "twitter": {"card": "summary_large_image", "description": "Kim Kardashian and Kanye West's body language reveals a lot more than you would think about their marriage.", "title": "Kim Kardashian and Kanye West: Surprising Secrets Their Body Language Reveals About Their Relationship", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/03/John-Legend-Celebrates-His-Birthday-And-The-10th-Anniversary-Of-His-Debut-Album-Get-Lifted-At-CATCH-NYC-624x500.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529789220.0, "source": "http://www.cheatsheet.com", "summary": ""}