{"url": "www.inquisitr.com/4279012/katie-holmes-jamie-foxx-spending-millions-to-hide-their-alleged-romance-from-the-mummy-actor/", "text": "Tom Cruise’s ex-wife Katie Holmes is allegedly spending millions of dollars to keep her rumored romance with Jamie Foxx a secret. According to the latest speculation into Katie and Jamie’s personal lives, the alleged couple is spending way too much money during this courtship.\n\nAfter Katie Holmes decided to end her troubled marriage with the Top Gun star, rumors started to surface that she is having an on-and-off relationship with former Dawson’s Creek’s co-star Joshua Jackson. After that, her name was linked with How I Met Your Mother star Jason Segel. If that was not it, there were several rumors that indicated her inclination toward her The Kennedys: After Camelot co-star Matthew Perry. From the past three years, there are rumors that the 38-year-old Katie is having a secret and serious relationship with 49-year-old Jamie Foxx.\n\nAccording to an insider who spoke to Life & Style, the alleged couple has put a lot of work into keeping their romance out of the media. Their secret romance is all about secret trips, sworn secrecy, and disguises. Not only this, they have even asked their close friends not to reveal their relationship among the paparazzi.\n\n“Their relationship is warm and passionate and very, very private. Only their closest friends are privy to their love affair,” the source told the outlet.\n\n[Image by Dimitrios Kambouris/Getty Images]\n\nAs previously reported by different media outlets, the real reason behind all the secrecy is Tom Cruise. According to them, Tom will feel betrayed that his old friend and Collateral co-star got involved with his ex-wife.\n\n“Katie would go to Jamie’s house and lie down in the back of a car so she wouldn’t be seen on the way in. Jamie and Katie also felt safe on yachts because no one would see them out on the water. [The secrecy] added passion.”\n\nIt was previously reported by the Inquisitr that when Jamie was asked by a reporter at LAX about his alleged relationship with Katie Holmes, the Django Unchained movie star responded by coyly, calling the rumors of his dating life nothing but “fake news.” Similar to this, both Katie and Jamie were photographed together at a romantic restaurant in New York City in April. In the leaked pictures, they both tried to go incognito by sporting sunglasses and hats.\n\nThe insider went on to suggest that after having a tough time dealing with the Church of Scientology and her troubled marriage to Tom Cruise, the Batman Begins actress wanted her personal life to go as smoothly as possible. The recent attempts by Jamie are making her extremely anxious, but given the fact that she is deeply in love with him, she is willing to spend $100,000 per year just to have a background check on everyone they hang out with.\n\n“This is not at all how Katie saw her life going. But she will take this over nothing. Katie’s friends are telling her that if he isn’t willing to step up and be there for her as a true partner, it’s time for her to move on,” the insider said. “But she really loves him and can’t seem to let go.”\n\n[Image by Michael Kovac/Getty Images for Prive Eyewear]\n\nA lot has been said and published about the personal lives of Katie Holmes and Jamie Foxx. There were once rumors that Katie was pregnant, then there were rumors indicating that due to her contractual marriage with Tom Cruise, she is not allowed to publicly date until 2017. Now there are these rumors suggesting that the alleged couple is spending millions just to maintain privacy from the media and Tom Cruise.\n\nFans of both Katie Holmes and Jamie Foxx should remember that neither the stars nor their representatives have confirmed the news about their relationship. So, it is safe to say that Tom Cruise’s ex-wife is currently not involved with the Horrible Bosses star.\n\n[Featured Image by Dimitrios Kambouris/Getty Images and Theo Wargo/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/06/katie-holmes-jamie-foxx-marriage-pictures.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/jamie-foxx-katie-holmes-relationship-news.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/2796d5da17c476cbb25029169dfc079c?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/katie-holmes-jamie-foxx-relationship-news.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Viraj Mahajan"], "canonical_link": "https://www.inquisitr.com/4279012/katie-holmes-jamie-foxx-spending-millions-to-hide-their-alleged-romance-from-the-mummy-actor/", "title": "Katie Holmes, Jamie Foxx Spending Millions To Hide Their Alleged Romance From ‘The Mummy’ Actor", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}