{"url": "https://www.tvinsider.com/gallery/fear-the-walking-dead-troy-daniel-return-season-5/", "text": "Like Troy, Daniel could be a staple in the show’s flashbacks. If the showrunners’ intent is to explore what happened during the time jump we never saw during Season 4, bringing Daniel back makes perfect sense. Of course, that poses another tricky question. Daniel and Nick, presumably, made it out of the dam together as it crumbled; if that’s indeed the case, how will Daniel’s story be told without Nick? Could the flashbacks move further forward in time to avoid that complication?\n\nSeason 4 ended with Team Morgan vowing to take in those who needed help in Texas, largely through looking back at Al’s tapes. In theory, if Fear opts for another time jump, Season 5 could start with Daniel already at the factory, settled into a new life. There’s only one problem with this — it would require him to set aside his bad blood with Strand.\n\nMuch like Troy could be trying to get revenge on the Clark family for what Madison did to him, Daniel could be after vengeance for the dam. Undoubtedly, he blames Strand for Lola and Ephrain’s deaths and the demise of the sanctuary the dam had become — and that nasty gunshot wound to his cheek. It would be in-character for Daniel to have not forgiven or forgotten, and even before Season 3, he and Strand were on shaky footing. It would be neat to see the saga of Strand and Daniel continue to unfold in Season 5.\n\nThis could also be likely to happen, though it’d be disappointing. Fans had been hoping to see Daniel come back throughout last season, and if the only glimpse they get of him is on Al’s camera, it could impede him serving a meaningful role in the story going forward. Since Al talked to Madison, it’s not impossible that Daniel might have made it to Texas, too. But let’s hope for a more significant role for one of the final original cast members of Fear .\n\nNot sure how plausible this is in show canon, considering Troy was pretty directly responsible for Ofelia’s death. But if Fear is leaning into the idea of forgiveness and “no one’s gone until they’re gone,” maybe Daniel forgave Troy and…nursed him back to health after finding him floating, barely alive, in the wreckage of the dam? That would have required him to get over his daughter’s death in a very short amount of time, and Daniel Salazar doesn’t seem the type to relinquish such grudges.\n\nThis could also be cool, if Fear decides to ignore the Season 3 finale. Troy could return not on a one-man mission for revenge, but with a whole new group of people in an attempt to sabotage the factory or the community Morgan and his crew have built there. This would risk retreading old ground depending how similar it could end up being to Season 4’s less-than-well-received Vultures, but Troy — unlike Mel and Ennis — proved he knew how to lead an organized, deadly team.\n\nSuspend disbelief for a moment. And the cinematography of his last scene. And the fact that Madison hit him twice, hard , in the head with a hammer. Wouldn’t it be cool to have Troy back? And let’s face it: this is The Walking Dead universe. People survive things that don’t make sense. With that said, who’s to say he isn’t an ally of Team Morgan now? That might be a total betrayal of his character depending on how it’s done, but at least he’d still be back in the array of characters, adding some familiarity to the new faces.\n\nHow would he make it all the way to Texas? Who knows! If the show is banking on the finality of Madison having killed Troy in the Season 3 finale, it’s possible he could come back as a walker for an episode. But for a fan favorite character like him, that would be quite a bummer of a cameo.\n\nAside from the hallucination theory, this makes the most sense. As Comicbook’s Brandon Davis and many fans have speculated, if Troy’s alive, he could definitely come back to haunt Alicia and her new friends if he blames her for what happened to him at the dam. If that would be the case, it would be interesting to see how he’d react to learning about Madison’s and Nick’s deaths; especially the latter, considering the interesting bond that formed between them in Season 3.\n\nThis doesn’t make a whole lot of sense — shouldn’t Alicia hallucinate Jake, if she’s going to see an Otto brother? — but if the writers aren’t going to be bringing Troy back from the dead, it might be the most likely option. Alicia is the only character left who had any kind of meaningful interaction with the less-than-stable Otto sibling. If Troy’s coming back in a vision or a nightmare, it’s possible Alicia could dream about the downfall of the ranch and Troy’s role in it.\n\nNo, Madison Clark isn't being resurrected — but for fans of Fear The Walking Dead's earlier seasons, this is certainly welcome news. Two beloved characters are scheduled to make a return in the show's upcoming fifth season: Daniel Salazar and Troy Otto.\n\nBoth characters, played by Ruben Blades and Daniel Sharman, respectively, were last seen in the two-part Season 3 finale \"Things Bad Begun\" and \"Sleigh Ride.\" Those tense hours saw Troy (seemingly) meet his demise as Madison delivered two swift, strong blows to his head with a hammer once she learned the role he played in destroying Brokejaw Ranch, while Daniel was last seen on the bridge where Nick Clark intended to make his last stand. It was implied they'd escape the crumbling, flooded structure together.\n\nDaniel will be easy enough to bring back; after all, he was very much still alive the last time he was seen. Troy will be a little tougher considering his death seemed pretty conclusive — and in theory, Fear wouldn't have to revive him in order for him to show up again.\n\nClick through the gallery above for 10 ways we could see Troy and Daniel resurfacing in Season 5.\n\nFear the Walking Dead, Season 5, 2019, AMC", "images": ["https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_201_RF_0113_0090-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_307_RF_0315_0153-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_307_RF_0315_0601-RT-1-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner2.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner3.png", "http://b.scorecardresearch.com/p?c1=2&c2=19587797&cv=2.0&cj=1", "https://www.tvinsider.com/wp-content/uploads/2017/02/logo-tvinsider.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/comfort-tv-logo.gif?x=1", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-footer.png", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_304_RF_0210_2704-RT-1014x570.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.tvinsider.com/wp-content/uploads/2020/03/tvi-white.png", "https://www.tvinsider.com/wp-content/uploads/2018/03/fear-the-walking-dead-crossover-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner1-38x32.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/Bosch-Season-6-304x195.jpg", "https://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif", "https://www.tvinsider.com/wp-content/uploads/2017/08/OnDISH_Mini-Logo.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/party-of-five-reboot-freeform-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_307_RF_0316_2090-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner6.png", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_304_RF_0210_2616-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/Untitled-design-8-2-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_306_RF_0303_0910-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_301_MD_0106_152-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_201_RF_1218_0274-RT-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner4.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/whats-on.png", "https://www.tvinsider.com/wp-content/uploads/2018/12/FTWD_304_RF_0207_0127-RT-1014x570.jpg"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/12/Untitled-design-8-2-1014x570.jpg", "keywords": [], "authors": ["Emily Hannemann", "Meaghan Darwish", "Matt Roush", "Samantha Bergeson", "Meredith Jacobs"], "canonical_link": "https://www.tvinsider.com/gallery/fear-the-walking-dead-troy-daniel-return-season-5/", "title": "'Fear the Walking Dead' Bringing Troy & Daniel Back?! 10 Ways They Could Return (PHOTOS)", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "pocket-site-verification": "c2d9d3d73032bf0b0959f31688efb2", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "These two fan-favorite characters are going to show up again in Season 5 — but how?", "url": "https://www.tvinsider.com/gallery/fear-the-walking-dead-troy-daniel-return-season-5/", "title": "'Fear the Walking Dead' Bringing Troy & Daniel Back?! 10 Ways They Could Return (PHOTOS)", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/12/Untitled-design-8-2-1014x570.jpg", "width": 1014, "height": 570}}, "theme-color": "#00aeef", "title": "'Fear the Walking Dead' Bringing Troy & Daniel Back?! 10 Ways They Could Return (PHOTOS)", "description": "These two fan-favorite characters are going to show up again in Season 5 — but how?", "author": "Emily Hannemann", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/gallery/fear-the-walking-dead-troy-daniel-return-season-5/", "title": "'Fear the Walking Dead' Bringing Troy & Daniel Back?! 10 Ways They Could Return (PHOTOS)", "creator": "@tvinsider", "description": "These two fan-favorite characters are going to show up again in Season 5 — but how?", "image": "https://www.tvinsider.com/wp-content/uploads/2018/12/Untitled-design-8-2-1014x570.jpg?164", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "https://www.tvinsider.com", "summary": ""}