{"url": "https://www.digitaltrends.com/movies/lauren-cohan-walking-dead-leaving/", "text": "Just a week after rumors abounded that lead actor Andrew Lincoln would be leaving The Walking Dead halfway through season 9, it has been confirmed that another longtime cast member will be hanging up her boots: Lauren Cohan, who plays Maggie Rhee, will appear in only the first six episodes of the new season before her character is written off.\n\nFans have had high hopes for the character of Maggie, who is with child, and seeking revenge for the brutal killing of her husband Glenn (Steven Yeun). Season 8 (spoiler alert) ended with Rick Grimes sparing the life of villain Negan (Jeffrey Dean Morgan), an act that only further infuriated Maggie — Negan is the one responsible for killing her husband and father to her unborn child.\n\nWhile the reason she will be departing hasn’t been disclosed, there have been rumors that the actor was in negotiations for a pay raise to sit closer to other longtime cast members, including Lincoln, who plays Grimes, and Norman Reedus, who plays Daryl Dixon. All three have had plenty of screen time, though Lincoln has been the clear lead, and Reedus an obvious fan-favorite character. Though the latest storylines suggested that Maggie would have a bigger role in the series, with more screen time.\n\nWhile Cohan will be saying goodbye, Reedus will potentially become the show’s new lead, and subsequently one of the highest-paid actors on TV.\n\nIt might not be about money, though. Cohan, who has starred on the apocalyptic AMC series since its second season, has been tapped to lead a new ABC comedy called Whiskey Cavalier, which has already received a full season order.\n\nA report by Collider suggested that Lincoln, too, would only appear in the first six episodes of season 9, suggesting that perhaps things will come to a head. Will Maggie and Rick actually take each other out? (Note, however, that AMC has still not officially confirmed that Lincoln will be leaving, though The Hollywood Reporter cites sources that have reportedly confirmed the news.)\n\nLate last year, original cast member Chandler Riggs, who played Rick’s son Carl, was killed off. Lennie James, who plays Morgan, left the series to play a crossover role in spin-off series Fear the Walking Dead, which is about to air its season 4 midseason finale. The only remaining original cast members are Reedus and Melissa McBride (Carol); along with Danai Gurira (Michonne), who joined in season 3.\n\nA premiere date for season 9 of The Walking Dead has not yet been set, but it’s likely to air sometime in the fall.\n\nEditors' Recommendations", "images": ["https://icdn2.digitaltrends.com/image/digitaltrends/the-walking-dead-episode-801-rick-lincoln-maggie-cohan-600-1200x630-c-ar1.91.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://icdn2.digitaltrends.com/image/digitaltrends/the-walking-dead-episode-801-rick-lincoln-maggie-cohan-600-1200x630-c-ar1.91.jpg", "keywords": [], "authors": ["Christine Persaud", "June"], "canonical_link": "https://www.digitaltrends.com/movies/lauren-cohan-walking-dead-leaving/", "title": "‘The Walking Dead’ season 9 will say goodbye to another main character", "meta_data": {"description": "Just a week after rumors suggested that Andrew Lincoln would only appear in a half of the next season of The Walking Dead, it has been confirmed that Lauren Cohan, who plays Maggie, will also only appear in the first six episodes of season nine.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'The Walking Dead' Season 9 Will Say Goodbye to Another Main Character", "description": "Just a week after rumors suggested that Andrew Lincoln would only appear in a half of the next season of The Walking Dead, it has been confirmed that Lauren Cohan, who plays Maggie, will also only appear in the first six episodes of season nine.", "url": "https://www.digitaltrends.com/movies/lauren-cohan-walking-dead-leaving/", "site_name": "Digital Trends", "image": {"identifier": "https://icdn2.digitaltrends.com/image/digitaltrends/the-walking-dead-episode-801-rick-lincoln-maggie-cohan-600-1200x630-c-ar1.91.jpg", "secure_url": "https://icdn2.digitaltrends.com/image/digitaltrends/the-walking-dead-episode-801-rick-lincoln-maggie-cohan-600-1200x630-c-ar1.91.jpg", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/digitaltrends", "author": "https://www.facebook.com/christine.persaud", "tag": "walking dead", "section": "Movies & TV", "published_time": "2018-06-05T17:44:19+00:00"}, "twitter": {"card": "summary_large_image", "description": "Just a week after rumors suggested that Andrew Lincoln would only appear in a half of the next season of The Walking Dead, it has been confirmed that Lauren Cohan, who plays Maggie, will also only appear in the first six episodes of season nine.", "title": "'The Walking Dead' Season 9 Will Say Goodbye to Another Main Character", "site": "@digitaltrends", "image": "https://icdn5.digitaltrends.com/image/digitaltrends/the-walking-dead-episode-801-rick-lincoln-maggie-cohan-600-510x0.jpg", "creator": "@christineTechCA"}, "apple-itunes-app": "app-id=500266645, affiliate-data=11lnN7", "fb": {"app_id": 61377565444}, "onesignal": "wordpress-plugin", "theme-color": "#0095da", "viewport": "minimum-scale=1, initial-scale=1, width=device-width, shrink-to-fit=no"}, "movies": [], "publish_date": 1528220659.0, "source": "https://www.digitaltrends.com", "summary": ""}