{"url": "https://en.wikipedia.org/wiki/Gal_Gadot", "text": "Israeli actress and model\n\nGal Gadot[1][3][4] (Hebrew: גל גדות‎, [ˈɡal ɡaˈdot];[5] born 30 April 1985)[6] is an Israeli actress, model, and producer. At age 18, she was crowned Miss Israel 2004. She then served two years in the Israel Defense Forces as a fitness/combat readiness instructor, after which she began studying law and international relations at IDC Herzliya college while building up her modeling and acting careers.[7][2][8]\n\nGadot's first international film role came as Gisele Yashar in Fast & Furious (2009), a role she reprised in subsequent installments of the film franchise. She went on to earn worldwide fame for portraying Wonder Woman in the DC Extended Universe, beginning with Batman v Superman: Dawn of Justice (2016), followed by the solo film Wonder Woman and the ensemble Justice League (both 2017).[9][10] In 2018, Gadot was included on Time's annual list of the 100 most influential people in the world, and she was listed among the highest-paid actresses in the world.[11][12]\n\nEarly life\n\nGal Gadot was born in Petah Tikva, Israel,[1] and raised in its neighboring city of Rosh HaAyin.[13] In Hebrew, her first name means \"wave\" and her surname means \"riverbanks\".[14] Her parents are Irit (née Weiss), a teacher, and Michael Gadot, an engineer.[15] Both her parents were born in Israel, and they Hebraized their surname from \"Greenstein\" to \"Gadot\" prior to her birth.[16][17] Her father is a sixth-generation Sabra.[18] Her maternal grandparents were born in Europe; her grandfather, who was imprisoned in the Auschwitz concentration camp, survived the Holocaust, and her grandmother left before the Nazi invasion.[18][19][20] She has stated that she was brought up in a \"very Jewish, Israeli family environment\".[15] Gadot's family is of Ashkenazi Jewish (Polish-Jewish, Austrian-Jewish, German-Jewish, and Czech-Jewish) descent.[2] She has one younger sister named Dana.[21]\n\nAs an adult, Gadot started studying law and international relations at the IDC Herzliya college.[2][8]\n\nGadot completed her two mandatory years of service in the Israel Defense Forces, enlisted as a combat instructor.[22] Gadot says that her background helped her to win the role of Gisele in Fast & Furious: \"I think the main reason was that the director Justin Lin really liked that I was in the military, and he wanted to use my knowledge of weapons.\"[23]\n\nCareer\n\nModeling and pageant career\n\nAt age 18, Gadot won the 2004 Miss Israel beauty pageant[24] and next competed in the Miss Universe 2004 pageant in Ecuador. She carried out her mandatory two-year military service from the age of 20, then studied law.[25]\n\nGadot has led international campaigns as a model for Miss Sixty, Huawei smartphones, Captain Morgan rum, Gucci fragrances and Vine Vera skincare ranges, and Jaguar Cars. In 2015, she became the face of Gucci's Bamboo perfume brand.[26] She has been featured as the covergirl on Cosmopolitan, Glamour, Bride Magazine, Entertainment Weekly, UMM, Cleo, Fashion, Lucire, FHM. Gadot has been the main model for fashion brand Castro in 2008–16.[27] In 2013, her combined annual modelling and acting salary was estimated at NIS 2.4 million.[28]\n\nIn 2007, 21-year-old Gadot was in the Maxim photo shoot, \"Women of the IDF\", and was then featured on the cover of the New York Post.\n\nActing\n\nAfter Gadot had completed her first year of college, a casting director contacted her agent to have Gadot audition for the part of Bond girl Camille Montes in the spy film Quantum of Solace.[25] Although the part eluded her, a few months later, Gadot starred in the 2008 Israeli drama Bubot. Three months later, the casting director from her Quantum of Solace audition chose Gadot over six other actresses for the role of Gisele Yashar in the action film Fast & Furious, the fourth film in the Fast & Furious franchise.[29][30] Gadot performed her own stuntwork in those films.[31]\n\nIn 2010, she had small roles in the action-comedy Date Night and the action-adventure comedy Knight and Day.[32] 2011 brought her back to the Fast & Furious franchise, reprising her role as Gisele in Fast Five, and in 2013's Fast & Furious 6.[33]\n\nGadot portrayed Wonder Woman in the superhero film Batman v Superman: Dawn of Justice (2016). Gadot received swordsmanship, Kung Fu, kickboxing, capoeira and Brazilian jiu-jitsu training in preparation for the role.[34] Gadot's performance as the superhero, which was the character's first appearance in film, was hailed as one of the best parts of the film.[35]\n\nAlso in 2016, she had a small role in John Hillcoat's crime-thriller Triple 9, where she starred along with Kate Winslet and Aaron Paul.[36] Later that year, she co-starred in the action crime thriller film Criminal, as the wife of Ryan Reynolds' character,[37] alongside Kevin Costner, Gary Oldman, and Tommy Lee Jones.[38] Her final film of 2016 was the action comedy Keeping Up with the Joneses, in which she played a secret agent, alongside Zach Galifianakis, Jon Hamm, and Isla Fisher.[39]\n\nIn 2017, Gadot starred in a solo film for her character, Wonder Woman. She reprised the role in the ensemble film Justice League, which was released in November 2017, and was her third DC Extended Universe instalment.[40][41][42] In 2017 Gadot was invited to become a member of the Academy of Motion Picture Arts and Sciences.[43]\n\nGadot provided the voice of Shank in the Walt Disney Animation Studios' film Ralph Breaks the Internet.[44]\n\nGadot will star alongside Dwayne Johnson and Ryan Reynolds in Netflix's upcoming thriller Red Notice, written and directed by Rawson Marshall Thurber.[45]\n\nProducer\n\nIn October 2019, Gadot formed a production company, Pilot Wave, with her husband Jaron Varsano. She is set to star in and co-produce a Showtime limited series about actress and inventor Hedy Lamarr, as well as the Warner Bros. historical thriller film Irena Sendler, about humanitarian Irena Sendler.[46][47]\n\nOther work\n\nGadot, fellow Wonder Woman actress Lynda Carter, DC Entertainment President Diane Nelson, Wonder Woman director Patty Jenkins and U.N. Under-Secretary General Cristina Gallach appeared at the United Nations on 21 October 2016, the 75th anniversary of the first appearance of Wonder Woman, to mark the character's designation by the United Nations as its \"Honorary Ambassador for the Empowerment of Women and Girls\".[48][49] The gesture was intended to raise awareness of UN Sustainable Development Goal No. 5, which seeks to achieve gender equality and empower all women and girls by 2030.[48][49][50] The decision was met with protests from UN staff members who stated in their petition to UN Secretary-General Ban Ki-moon that the character is \"not culturally encompassing or sensitive\" and served to objectify women. As a result, the character was stripped of the designation, and the project ended 16 December.[50]\n\nGadot was featured in the music video for Maroon 5's single \"Girls Like You\" featuring Cardi B.[51] In July 2018, during a break in filming Wonder Woman 1984, Gadot visited a Virginia children's hospital in costume as Wonder Woman.[52][53][54]\n\nGadot was named as pitchwoman for Smartwater in 2020, replacing Jennifer Aniston who had served in that role since 2008.[55] In March 2020, Gadot and a number of other celebrities performed an online version of the John Lennon song \"Imagine\", intended to raise morale in the face of the 2019–20 coronavirus pandemic.[56] The performance was poorly received by audiences,[by whom?] many of whom criticized it for being an ineffectual response to the pandemic.[57][58]\n\nPersonal life\n\nGadot married Israeli real estate developer Yaron Varsano in 2008.[59] They have two daughters, one born in 2011,[60] and another in 2017.[61][33][62]\n\nGadot and her husband owned a boutique hotel in Tel Aviv, which she helped to run.[63] They sold their hotel to Roman Abramovich in 2015 for $26 million.[64]\n\nFilmography\n\nKey Denotes productions that have not yet been released\n\nFilms\n\nTelevision\n\nMusic videos\n\nCommercials\n\nPageants\n\nYear Title Status Notes 2004 Miss Israel 2004 Herself Winner 2004 Miss Universe 2004 Miss Israel Participant\n\nAwards and nominations\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/15px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Flag_of_Ecuador.svg/15px-Flag_of_Ecuador.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Gal_Gadot_2016_lighting_corrected.jpg/170px-Gal_Gadot_2016_lighting_corrected.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Gal_Gadot_cropped_lighting_corrected_2b.jpg/220px-Gal_Gadot_cropped_lighting_corrected_2b.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Gal_Gadot_cropped_lighting_corrected_2b.jpg/1200px-Gal_Gadot_cropped_lighting_corrected_2b.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/15px-Flag_of_Ukraine.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Flag_of_Malaysia.svg/15px-Flag_of_Malaysia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/15px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Flag_of_Chile.svg/15px-Flag_of_Chile.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/15px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/15px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/15px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/15px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Flag_of_Panama.svg/15px-Flag_of_Panama.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/15px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Flag_of_Venezuela.svg/15px-Flag_of_Venezuela.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Colombia.svg/15px-Flag_of_Colombia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Flag_of_Paraguay.svg/15px-Flag_of_Paraguay.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/15px-Flag_of_Puerto_Rico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/15px-Flag_of_Greece.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Flag_of_Ghana.svg/15px-Flag_of_Ghana.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_the_Dominican_Republic.svg/15px-Flag_of_the_Dominican_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/15px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Flag_of_the_Bahamas.svg/15px-Flag_of_the_Bahamas.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/15px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/15px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/15px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/15px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/15px-Flag_of_Spain.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/15px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/15px-Flag_of_Thailand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Flag_of_Nigeria.svg/15px-Flag_of_Nigeria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/15px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Gal_Gadot_at_the_2018_Comic-Con_International_12_%28cropped%29.jpg/170px-Gal_Gadot_at_the_2018_Comic-Con_International_12_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Gal_Gadot_cropped_lighting_corrected_2b.jpg/1200px-Gal_Gadot_cropped_lighting_corrected_2b.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gal_Gadot", "title": "Gal Gadot", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Gal_Gadot_cropped_lighting_corrected_2b.jpg/1200px-Gal_Gadot_cropped_lighting_corrected_2b.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}