{"url": "https://www.vulture.com/2016/12/chrissy-metz-golden-globe-nomination-this-is-us.html", "text": "Less than three hours after This Is Us actress Chrissy Metz learned she was nominated for a Golden Globe, she was still trying to make sense of it. “I feel like I’m in a dream. Like, what’s happened? Am I tired? It’s slowly processing,” she told Vulture. “Viola Davis made this beautiful speech last night [at the Critics’ Choice Awards]. It was so moving and I was in tears. To be the unconventional actress or finally [to have] art catching up to life, it really means a lot because there were times where I was like, Maybe I’m not gonna be able to do this.”\n\nMetz learned she was nominated, along with her TV mother, Mandy Moore, for best supporting actress in a TV drama while watching the announcements on Facebook Live with her agent Nick Roses, who arrived at her home at 4:30 a.m. This Is Us, the fall’s biggest broadcast hit, was also nominated for best drama.\n\n“I would have been elated to have our show nominated especially because we’re contending with really heavy cable hitters,” Metz said. Co-star Sterling K. Brown, who was nominated for his role on FX’s American Crime Story: People v. O.J., texted the cast from set, where he is filming scenes this morning. “Of course, we’re all on a group chat,” Metz said. “Sterling was very excited. Emoji, emoji, and we’re sending all kinds of GIFs to each other. It’s very cute.”\n\nSince the show’s fall finale aired last week, everyone’s been stopping Metz to ask what happens to Toby, Kate’s boyfriend, played by Chris Sullivan. The episode ended with Toby having a heart attack during the family’s Christmas celebration and flatlining in the emergency room — scenes Metz says were especially difficult, considering how much fun she usually has working with Sullivan.\n\n“Chris actually made a joke several episodes before pretending to have a heart attack and one of the directors was like, That’s actually gonna be foreshadowing so we can’t do that, as funny as that is,” Metz said. “And we were like, Wait, what does that mean? You know, with every drama, with every TV show, there’s highs and lows, so you never know what they’re gonna write. I wasn’t ready and I still wasn’t ready even after shooting it and then seeing it. I’m like, #PrayforToby. That’s all I can tell you.”\n\nKate has been struggling all season to find herself after her twin brother, Kevin (Justin Hartley), moves to New York, and she falls in love with Toby, who she meets in a weight-loss program. The show has been critiqued for defining Metz’s character too much by her weight, but Metz says that as the season develops, this won’t remain the focal point. “She has been living in the shadow of her brother and never feeling adequate and not as beautiful and thin as her mother,” Metz says. “These are demons she has to battle. Once she gets that under her belt and gets over that, then she can really become the woman she’s meant to be. It definitely will evolve.”\n\nMetz says she is grateful that NBC and 20th Century Fox, the studio that owns the show, took a chance on hiring a “real plus-size woman, not just a size 6 or 8” for a series regular role. “As an actor you use who you are and what you look like in your roles, and this is what I took on and this is who I am in some capacity,” she says. “But it’s not all that I am. Kate is a true woman who is really contending with that. She can still be sexy or exciting or fun, but really vulnerable. It’s really a gift.”", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2016/12/12/12-Chrissy-Metz-chatroom-silo.w330.h412.png", "https://pixel.nymag.com/imgs/daily/vulture/2016/12/12/12-Chrissy-Metz-chatroom.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2016/12/12/12-Chrissy-Metz-chatroom.w1200.h630.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vulture.com/2016/12/chrissy-metz-golden-globe-nomination-this-is-us.html", "title": "This Is Us’ Chrissy Metz on Her Golden Globe Nomination: ‘To Be the Unconventional Actress, It Really Means a Lot’", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "This Is Us’ Chrissy Metz on Her Golden Globe Nomination: ‘To Be the Unconventional Actress, It Really Means a Lot’", "url": "https://www.vulture.com/2016/12/chrissy-metz-golden-globe-nomination-this-is-us.html", "description": "There were times where I was like, <i>Maybe I&rsquo;m not gonna be able to do this</i>.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2016/12/12/12-Chrissy-Metz-chatroom.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "This Is Us’ Chrissy Metz on Her Golden Globe Nomination: ‘To Be the Unconventional Actress, It Really Means a Lot’", "description": "There were times where I was like, <i>Maybe I&rsquo;m not gonna be able to do this</i>.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2016/12/12/12-Chrissy-Metz-chatroom.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "description": "There were times where I was like, <i>Maybe I&rsquo;m not gonna be able to do this</i>.", "article": {"tag": "golden globes 2017, tv, this is us, chrissy metz, mandy moore, sterling k. brown, golden globes", "publisher": "https://www.facebook.com/Vulture"}, "sailthru.tags": "golden globes 2017, tv, this is us, chrissy metz, mandy moore, sterling k. brown, golden globes", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1481568120.0, "source": "https://www.vulture.com", "summary": ""}