{"url": "https://en.wikipedia.org/wiki/Melania_Trump", "text": "First Lady of the United States\n\nMelania Trump ( ; born Melanija Knavs; [mɛˈlaːnija ˈknaːu̯s], Germanized to Melania Knauss; April 26, 1970) is a Slovenian-American former fashion model and the current first lady of the United States, as the wife of the 45th president of the United States Donald Trump.[2]\n\nMelanija Knavs was born in Novo Mesto, and grew up in Sevnica, in the Yugoslav republic of Slovenia.[3] She worked as a fashion model through agencies in Milan and Paris, and moved to New York City in 1996.[4] Her modeling career was associated with Irene Marie Models and Trump Model Management.[5]\n\nIn 2001, Knavs became a permanent resident of the United States.[6] She married Donald Trump in 2005 and obtained U.S. citizenship in 2006. She is the second first lady (after Louisa Adams) born outside the United States,[7] the first one to be a naturalized citizen[8] and the first whose native language is not English.[9]\n\nEarly life\n\nMelanija Knavs was born in Novo Mesto, Slovenia (then part of Yugoslavia), on April 26, 1970.[10][11] Her father, Viktor Knavs (born March 24, 1944), was from the nearby town of Radeče and managed car and motorcycle dealerships for a state-owned vehicle manufacturer.[12][13] Her mother Amalija (née Ulčnik) (born July 9, 1945) came from the village of Raka and worked as a patternmaker at the children's clothing manufacturer Jutranjka in Sevnica.[14][15] As a child, Melania and other children of workers at the factory participated in fashion shows that featured children's clothing.[16] She has an older sister, Ines, who is an artist and her \"longtime confidant\",[17][18][19] and an older half-brother—whom she reportedly has never met—from her father's previous relationship.[20][21]\n\nKnavs grew up in a modest apartment in a housing block in Sevnica, in the Lower Sava Valley.[2][22] Her father was in the League of Communists of Slovenia, which espoused a policy of state atheism.[23] As was common, however, he had his daughters secretly baptized as Catholics. When the Trumps met Pope Francis at the Vatican in 2017, Melania brought her rosary and asked the Pope to bless it.[24][25]\n\nWhen Knavs was a teenager, she moved with her family to a two-story house in Sevnica.[26] As a high-school student, she lived in a high-rise apartment in Ljubljana. She attended the Secondary School of Design and Photography in Ljubljana[27] and studied architecture and design at the University of Ljubljana for one year before she dropped out.[28][29][30]\n\nCareer\n\nMelania Trump at QVC Red Carpet Style Party, 2011\n\nKnavs began modeling at five years old and started doing commercial work at sixteen when she posed for the Slovenian fashion photographer Stane Jerko.[31][32] When she began working as a model, she adapted the Slovene version of her last name \"Knavs\" to the German version \"Knauss\".[33]\n\nAt eighteen, Knauss signed with a modeling agency in Milan, Italy.[34] In 1992, she was named runner-up in the Jana Magazine \"Look of the Year\" contest, held in Ljubljana, which promised its top three contestants an international modeling contract.[10][35]\n\nAfter attending the University of Ljubljana for one year,[36] Knauss modeled for fashion houses in Paris and Milan, where in 1995 she met Metropolitan Models co-owner Paolo Zampolli, a friend of her future husband Donald Trump, who was on a scouting trip in Europe. Zampolli urged her to travel to the United States, where he said he would like to represent her.[16]\n\nIn 1996, Knauss moved to Manhattan.[16][35][34][37] Zampolli arranged for her to share an apartment with photographer Matthew Atanian in Zeckendorf Towers in Union Square.[16]\n\nKnauss was featured in a sexually explicit photoshoot for the January 1996 issue of Max, a now-defunct French men's magazine, with another female model.[38] She also posed nude for the January 2000 edition of GQ magazine, appearing on the cover naked but for diamond jewelry, reclining on fur, aboard Trump's custom-fitted Boeing 727.[39] Asked about the photos in 2016, Donald Trump said: \"Melania was one of the most successful models, and she did many photo shoots, including for covers and major magazines. [The Max photo] was a picture taken for a European magazine prior to my knowing Melania. In Europe, pictures like this are very fashionable and common.\"[40][41]\n\nIn 2010, Trump launched her own line of jewelry, Melania Timepieces, and Jewelry, for sale on QVC. She also marketed a Melania Skin Care Collection, sold in high-end department stores.[42] According to a financial filing in 2016, her businesses brought in between $15,000 and $50,000 in royalties that year.[43] In 2017, the two companies that manufactured her jewelry and skincare products under license said they had terminated their relationship with her.[44] On inauguration day her companies and products were listed in her official White House biography, but they were quickly removed.[45] A White House spokesperson said her companies are no longer active and \"the First Lady has no intention of using her position for profit and will not do so.\"[44]\n\nU.S. citizenship\n\nKnauss came to the United States from Slovenia in 1996. She resided in the U.S. briefly on a visitor's visa and then obtained H-1B work visas. In 2000 she petitioned for a right to permanent residency under the EB-1 program, a program designed for people with \"extraordinary abilities.\" According to information from the Migration Policy Institute, only 2 percent of people in their field would be expected to qualify. The Washington Post reports that at that time Knauss's credentials included \"runway shows in Europe, a Camel cigarette billboard ad in Times Square and — in her biggest job at the time — a spot in the swimsuit edition of Sports Illustrated, which featured her on the beach in a string bikini, hugging a six-foot inflatable whale.\"[46]\n\nDuring the months that she campaigned with her husband prior to his successful bid for presidency, she defended his hard-line on immigration practices and laws by stating that her own path and achievement of citizenship had been legal, unlike those of the individuals Donald Trump was campaigning against. However, investigative reporting done by the Associated Press revealed that she had been paid for 10 modeling jobs she had done before she had obtained her H-1B (work visa) and was still living in the U.S using her visitor visa. The Associated Press commented that \"Foreigners are not allowed to use a visitor visa to work for pay in the U.S. for American companies. Doing so would violate the terms of that visa and could prohibit a foreigner from later changing his or her immigration status in the U.S. or bar the foreigner from the United States again without special permission to come back.\"[6]\n\nMelania Trump obtained her citizenship in 2006. According to media reports she sponsored her parents, Viktor and Amalija Knavs, who went through the immigration process using \"chain migration\", a route that the president has repeatedly criticized.[47][48]\n\nRelationship with Donald Trump\n\nEarly relationship\n\nIn September 1998, Knauss met real estate mogul Donald Trump at a party and the couple began dating[49] while Trump was in the process of divorcing his second wife, Marla Maples. The divorce was finalized in 1999.[50][51] Knauss continued her modeling career[16] with her American magazine cover shoots, including In Style Weddings,[52] New York magazine, Avenue,[53] Philadelphia Style,[54] Vanity Fair,[55] and Vogue.[56] In 1999, the couple gained attention after a lewd interview with Shock jock Howard Stern on his show.[13][57]\n\nKnauss appeared with Trump while he campaigned for the 2000 Reform Party presidential nomination. When she was asked by The New York Times what her role would be if Donald Trump were to become president, she replied: \"I would be very traditional, like Betty Ford or Jackie Kennedy.\"[58]\n\nMarriage\n\nKnauss and Donald Trump became engaged in 2004. On January 22, 2005, they married in an Anglican service at the Episcopal Church of Bethesda-by-the-Sea in Palm Beach, Florida, followed by a reception in the ballroom at her husband's Mar-a-Lago estate.[59][60] The marriage was her first and his third. The event was attended by celebrities such as Katie Couric, Matt Lauer, Rudy Giuliani, Heidi Klum, Star Jones, P. Diddy, Shaquille O'Neal, Barbara Walters, Conrad Black, Regis Philbin, Simon Cowell, Kelly Ripa, then-Senator Hillary Clinton, and former president Bill Clinton.[60][61] At the reception, Billy Joel serenaded the crowd with \"Just the Way You Are\" and supplied new lyrics to the tune of \"The Lady Is a Tramp\".[60] The Trumps' wedding ceremony and reception were widely covered by the media.[37] She wore a $200,000 dress made by John Galliano of the house of Christian Dior.[60]\n\nOn March 20, 2006, she gave birth to their son, Barron William Trump.[62] She chose his middle name, while her husband chose his first name.[63]\n\n2016 presidential campaign\n\nMelania gives the thumbs up at a campaign event with her husband Donald and son Barron, November 2015\n\nIn November 2015, she was asked about her husband's presidential campaign and replied: \"I encouraged him because I know what he will do and what he can do for America. He loves the American people and he wants to help them.\"[64] She played a relatively small role in her husband's campaign, which is atypical of spouses of presidential candidates.[65][66][67]\n\nIn 2016, she told CNN her focus as first lady would be to help women and children. She also said she would combat cyberbullying, especially among children.[68]\n\nIn July 2016, her official website was redirected to trump.com. On Twitter, she stated that her site was outdated and did not \"accurately reflect [her] current business and professional interests\".[69]\n\n2016 RNC and plagiarism concerns\n\nOn July 18, 2016, she gave a speech at the 2016 Republican National Convention. The speech contained a paragraph that was nearly identical to a paragraph of Michelle Obama's speech at the 2008 Democratic National Convention.[70][71][72] When asked about the speech, Melania said she wrote the speech herself \"with as little help as possible.\"[73] Two days later, Trump staff writer Meredith McIver took responsibility and apologized for the \"confusion\".[74]\n\nLawsuit against Daily Mail and General Trust\n\nIn February 2017, she sued Daily Mail and General Trust, the owner of British tabloid, the Daily Mail, seeking $150 million in damages over an August 2016 article that alleged that she had worked for an escort service during her modeling days. The Mail retracted the article, apologized, and printed the retraction from the blogger they were quoting, who said: \"I had no legitimate factual basis to make these false statements and I fully retract them\".[75] The lawsuit stated the article had ruined her \"unique, once-in-a-lifetime opportunity\" to establish \"multimillion dollar business relationships for a multi-year term during which Plaintiff is one of the most photographed women in the world\".[76] Her claim raised potential ethical questions with its implication that she intended to profit from being first lady.[77]\n\nOn February 18, 2017, the lawsuit was amended, removing the language about her earning potential and focusing instead on emotional distress.[78] In April 2017, the parties settled the lawsuit and the Daily Mail issued a statement that said, \"We accept that these allegations about Mrs. Trump are not true and we retract and withdraw them.\" The Mail agreed to pay her $2.9 million.[79][80]\n\nStatement on bullying\n\nFive days before the election, she told a crowd of supporters in Pennsylvania: \"Our culture has gotten too mean and too rough, especially to children and teenagers. It is never OK when a 12-year-old girl or boy is mocked, bullied, or attacked. It is terrible when that happens on the playground. And it is absolutely unacceptable when it is done by someone with no name hiding on the Internet.\"[81] Regarding the contrast of her platform with her husband's use of Twitter during his campaign, Melania said shortly after the election that she had rebuked him \"all the time\" but that \"he will do what he wants to do in the end\".[82]\n\nFirst Lady of the United States\n\nMelania on Inauguration Day\n\nDonald and Melania at the Liberty Ball on Inauguration Day, January 20, 2017\n\nShe assumed the role of first lady of the United States on January 20, 2017.[83][84] She continued living in Manhattan at the Trump Tower with their son, Barron, until the end of his 2016–2017 school year at Columbia Grammar & Preparatory School.[85][86] They moved into the White House in Washington, D.C., on June 11, 2017.[87] Her Secret Service code name is \"Muse\" (beginning with the same letter as Trump's code name, \"Mogul\", per Secret Service tradition).[88] Her staff of 13 (as of January 2018) is smaller than that of the two previous first ladies after one year of their husbands' administration.[89]\n\nShe is the second foreign-born woman to hold the title of first lady, after Louisa Adams, wife of John Quincy Adams, who was born in 1775 in London to a father from Maryland and an English mother.[90][91] She is also the first naturalized citizen (rather than birthright citizen) to hold the title, and the first whose native language is not English.[92]\n\nFrench President Macron greets Melania by kissing her hand, 2018\n\nOn March 8, 2017, she hosted her first White House event, a luncheon for International Women's Day. She spoke to an audience of women about her life as a female immigrant, and about working towards gender equality both domestically and abroad, noting the role of education as a tool against gender inequality.[93][94][95]\n\nIn January 2018, The Wall Street Journal reported that during a three-month period where she lived in New York in 2017, she took Air Force jet flights between New York City, Florida and Washington at a cost of more than $675,000 to taxpayers.[96][97] In comparison, former first lady Michelle Obama's solo travel cost an average of about $350,000 a year.[96][97]\n\nOn March 13, 2018, Trump scheduled a March 20 meeting with policy executives from technology companies, including Amazon, Facebook, Google, Snap, and Twitter, to address online harassment and Internet safety, with a particular focus on how those issues affect children.[98] Trump's office has avoided the use of the term \"cyberbullying,\"[98] and Trump has come under criticism for championing Internet civility while her husband's Internet behavior has been noted as uncivil.[98][99] Trump attended the roundtable event, focusing on how children are affected by modern technology. Trump said: \"I am well aware that people are skeptical of me discussing this topic,\" but \"that will not stop me from doing what I know is right.\"[100]\n\nMelania took an active role in planning the Trump administration's first state dinner on April 23, 2018, to honor French president Emmanuel Macron.[101] With Brigitte Macron, the French president's wife, Trump visited a Paul Cézanne exhibit at the National Gallery of Art in Washington the day before.[102][103][104]\n\nMelania Trump express her condolences to the family of El Paso shooting victims Jordan and Andre Anchondo on August 7, 2019\n\nIn October 2018, Trump took a four-country, solo tour of Africa, without her husband, focusing on conservation and children and families, visiting Ghana, Malawi, Kenya, and Egypt.[105]\n\nThe Trumps at the announcement of the First Lady's Be Best initiative, May 2018\n\nOn November 13, 2018, Trump issued an \"extraordinary\" public statement calling for the firing of Deputy National Security Advisor Mira Ricardel. She had reportedly been privately pushing for Ricardel's ouster for weeks. The next day it was announced that Ricardel would \"transition to a new role within the Administration.\"[106] It was described as unusual for a first lady to be publicly involved in White House personnel decisions.[107]\n\nDuring the El Paso shooting in Texas on August 3, 2019, a lone gunman killed 22 people and injured 24 others. Melania and President Trump visited the hospital where eight of the survivors were being cared for. The president and first lady met with the families of survivors, hospital staff and first responders, and posed with a baby who had been orphaned when both of his parents were killed. The White House had asked that the child be brought in and he was accompanied by his uncle.[108][109]\n\nDuring the 2020 State of the Union Address, President Trump awarded the Presidential Medal of Freedom to Rush Limbaugh, who was sitting right beside Melania in the gallery and she presented the medal to him.[110][111]\n\nBe Best campaign\n\nOn May 7, 2018, Trump formally started the Be Best public awareness campaign, which focused on well-being for youth and advocated against cyberbullying and drug use.[112] The campaign was accompanied by a booklet that was promoted as having been written \"By First Lady Melania Trump and the Federal Trade Commission [FTC]\", but it was nearly identical to a document prepared in 2014 by the FTC.[113] The similarities prompted accusations of plagiarism, to which her office responded by admonishing the press for reporting on the issue.[114] The fact-checking site Snopes found the charge of plagiarism \"Mostly False\" saying, \"Melania Trump did not claim she had written the pamphlet herself, and she contributed an introduction to a slightly revised version of the booklet. The FTC was always credited for the creation of the booklet and supported its inclusion in the first lady's 'Be Best' campaign.\"[115]\n\nImmigration\n\nMelania, President Trump and other world leaders attend the D-Day commemorations on June 5, 2019\n\nOn June 17, 2018, Melania was referring to the Trump administration's \"Zero Tolerance\" immigration policy under which children were separated from their parents when she stated that she \"hates to see children separated from their families\" and wants there to be \"successful immigration reform.\"[116] On June 21, she made a hastily planned trip to Texas to get a firsthand look at the crisis affecting immigrant families at the U.S. border. She attended a roundtable with doctors, medical staff, social workers and other experts at Upbring New Hope Children's Shelter.[117]\n\nFashion\n\nTrump became a fashion icon almost immediately after her husband's inauguration on January 20, 2017, with various media outlets reporting on her fashion choices. Vogue has compared Trump's wardrobe as first lady to that of Jacqueline Kennedy and Nancy Reagan, noting that she closely works with designer Hervé Pierre and prefers \"strongly tailored pieces\" in bold colors and almost exclusively wears high-end designers.[118][119]\n\nPersonal life\n\nReligion\n\nMelania Trump with Pope Francis in Vatican in May 2017\n\nWhen the president and first lady visited Vatican City in May 2017, she identified as Catholic. She is the first Catholic to live in the White House since President John F. Kennedy and his wife Jacqueline and is the second Catholic first lady of the United States.[120][121] When she visited the Vatican, Pope Francis blessed her rosary beads, and she placed flowers at the feet of a statue of Mary at the Vatican's children's hospital.[122]\n\nHer husband describes himself as Presbyterian, and Melania and Donald Trump were married at Bethesda-by-the-Sea Episcopal Church.[123][124][125] Their son Barron was baptized there as well.[126]\n\nHealth\n\nOn May 14, 2018, she underwent an embolization, which is a minimally invasive procedure that deliberately blocks a blood vessel,[127] in order to treat a benign kidney condition. The procedure was successful and there were no reported complications.[128]\n\nCultural depictions", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Bill_Clinton_and_Donald_Trump_at_the_U.S._Open_in_2000%2C_Flushing_Meadows%E2%80%93Corona_Park.jpg/220px-Bill_Clinton_and_Donald_Trump_at_the_U.S._Open_in_2000%2C_Flushing_Meadows%E2%80%93Corona_Park.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Melania_Trump_2011.jpg/170px-Melania_Trump_2011.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Obama_hands_over_presidency_to_Trump_at_58th_Presidential_Inauguration_170120-D-NA975-0526.jpg/222px-Obama_hands_over_presidency_to_Trump_at_58th_Presidential_Inauguration_170120-D-NA975-0526.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/First_Lady_Melania_Trump_speaking_in_2015_%28cropped2%29.jpg/220px-First_Lady_Melania_Trump_speaking_in_2015_%28cropped2%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/The_President_and_First_Lady_in_the_U.K._%2848014320113%29.jpg/220px-The_President_and_First_Lady_in_the_U.K._%2848014320113%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Melania_Knauss-Trump_signature.svg/128px-Melania_Knauss-Trump_signature.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Donald_Trump_and_Melania_Trump_at_the_announcement_of_the_First_Lady%E2%80%99s_Be_Best_initiative.jpg/220px-Donald_Trump_and_Melania_Trump_at_the_announcement_of_the_First_Lady%E2%80%99s_Be_Best_initiative.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Donald_Trump_and_Melania_Trump_at_Liberty_Ball_Inauguration_2017.jpg/221px-Donald_Trump_and_Melania_Trump_at_Liberty_Ball_Inauguration_2017.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Melania_Trump_official_portrait.jpg/220px-Melania_Trump_official_portrait.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Arrival_Ceremony_-_The_Official_State_Visit_of_France_%2839892884320%29.jpg/220px-Arrival_Ceremony_-_The_Official_State_Visit_of_France_%2839892884320%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/8/82/Melania_Trump_official_portrait.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/President_Trump_and_the_First_Lady_in_El_Paso%2C_Texas_%2848491139652%29.jpg/220px-President_Trump_and_the_First_Lady_in_El_Paso%2C_Texas_%2848491139652%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Donald_Trump_Pope_Francis_Melania_Trump_in_2017.jpg/220px-Donald_Trump_Pope_Francis_Melania_Trump_in_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Coat_of_arms_of_the_President_of_the_United_States.svg/70px-Coat_of_arms_of_the_President_of_the_United_States.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/82/Melania_Trump_official_portrait.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Melania_Trump", "title": "Melania Trump", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Melania_Trump_official_portrait.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}