{"url": "https://ftw.usatoday.com/2018/05/whats-going-on-with-john-cena-nikki-bella-relationship-timeline", "text": "The storybook romance of WWE stars John Cena and Nikki Bella fell apart just weeks before the couple expected to get married, but both parties are now hopeful they can get back together following Cena’s shocking confession on national television.\n\nWhat’s going on with John Cena and Nikki Bella, and will they reconcile their differences? We went back to 2012 and charted the course of their relationship, and the couple has been divided over two big issues for years.\n\n2012 – The first date\n\nAfter working together for years, John Cena surprised Nikki Bella by asking her out in 2012, months after filing for divorce from his first wife.\n\nVia Cosmopolitan:\n\n“The first opening line was, ‘Hey, do you want to go to dinner with me?’ and I was kind of like, ‘What? With me?'” Bella said. “It just kind of started out like a dinner date and I have to admit we were friends for so many years, but then when you make it romantic, I couldn’t even say a word to him.”\n\nLate 2013 – Nikki Bella moves in with John Cena after signing a 75-page agreement\n\nAs was documented on Total Divas, Nikki Bella moved into Cena’s home in Tampa, Florida, but only after she signed a 75-page contract Cena drew up to protect himself.\n\nWe learned more about the contract in an episode of Total Bellas in 2016. Reflecting on his failed first marriage, Cena revealed on the second episode of Total Bellas that Nikki Bella had to sign a 75-page contract before she was able to move in with him.\n\n“Having been through that process, here is how I view it. It is like buying a handgun for home defense. It gives you a sense of security, and it gives you a failsafe in case something happens. And those who buy a handgun for self defense pray, pray they never have to use it. Without it, it’s a dog fight. I had to have your sister sign an agreement to live in the house. And that’s – it wasn’t a one-page, it’s a 75-page agreement.”\n\n(We should note here that John Cena and Nikki Bella have put their relationship on display on reality television for years, and it’s up to you whether you want to believe the scenes are genuine or not.)\n\nMay 18th, 2014 – Nikki Bella reveals her hidden first marriage\n\nNikki Bella married a high school sweetheart at the age of 20, and the couple got divorced when she was 23. She hid the marriage from her entire family, and did not tell Cena. Nikki Bella eventually spilled the beans on an episode of Total Divas.\n\n“When the focus of most of our problems has to do with that one subject,” Cena said, “maybe I should know that stuff.”\n\nSeptember 7th, 2014 – The Time Bomb: John predicts the future\n\nIn a Total Divas clip that’s almost eerie to watch in 2018, John Cena foresees the future as he and Nikki Bella discuss the prospect of marriage and becoming parents.\n\nCena: “Let’s just say I was to ask you to marry me, and we get married. Would that be enough?” Bella: “I don’t know, it’s something you just can’t answer. It’s like saying ‘hey, do you want to be a mother or not? And answer right now, in two seconds.’ You can’t just say that to a woman.” Cena: “I’m trying to be a realist. I’ve told you that I don’t want to get married and I don’t want to have kids, and you do want to get married and you do want to have kids. So I feel like this is a time-bomb over my head.” Bella: “Well jeez, if you feel like you have a time bomb over your head, are you sure you’re happy?” Cena: “I’m extremely happy, I love you to death. But I don’t know where the line is? I feel like someday you’re just going to wake up and be like ‘this is not what I want.'”\n\nSeptember 29th, 2015 – Cena says the thought of having kids gives him ‘the sweats’\n\nVia EOnline:\n\nIn an exclusive clip from Sunday’s season finale of Total Divas, it’s no surprise he gets extremely anxious when Nikki Bella brings up babies at the dinner table. “Why don’t we talk about how pregnant all my friends are?” she asks him.\n\n“Because that makes me get the sweats,” he responds. “It seems like I get a different sonogram photo every week. I don’t know where all these kids are coming from.”\n\nLate 2015/Early 2016 – Dolph Ziggler offers ‘marriage, babies’ to Nikki Bella\n\nIn a shocking development, Nikki Bella revealed that WWE star Dolph Ziggler, who dated prior to Bella’s relationship with Cena, wants to marry her.\n\n“Dolph pulled me aside at work and told me that he wants to give me marriage and babies. And then he tried to kiss me.”\n\nZiggler had approached Bella back in 2015 to tell her that he still had feelings for her. Prior to WrestleMania 33, The Miz roasted Cena – who “stole his girlfriend from Dolph Ziggler” – on an episode of Talking Smack.\n\nApril 21st, 2016 – Cena confirms he’s still opposed to marriage and to having children in a Rolling Stone profile\n\nRolling Stone profiled Cena just after WrestleMania 32, and he went public with some very strong views on marriage and having kids.\n\nVia Rolling Stone:\n\n“Just because everyone else is happy with children doesn’t mean that’s how I have to live,” Cena said. “I’ve been upfront about this. I just have things I need to get done. It’s not negotiable. We’ve been to therapy over it. I don’t think it will ever be over with. I’m stubborn as [expletive] and extremely selfish as well. I don’t want kids, I don’t want marriage. That’s me just saying, ‘Hey, this is my life and this is how I’m going to live.”\n\nOctober 5th, 2016 – The Total Bellas premiere\n\nCena came off as an extremely rigid creature of habit when television cameras entered his home. Here’s a personal favorite moment from the first show, when Cena is explaining the house rules to Daniel Bryan and Brie Bella.\n\n“After formal dinner the ladies will retreat to the drawing room together. The men will go to the cigar room. Every morning we will have coffee together. We will have an evening fire outside.”\n\nApril 2nd, 2017 – The proposal\n\nJohn Cena and Nikki Bella teamed up for a feud with The Miz and Maryse that culminated at WrestleMania 33 in Orlando. After winning a mixed tag match, Cena dropped down to one knee and proposed in the middle of the ring in front of more than 70,000 people.\n\nMarch 29th, 2018 – Cena says he wishes he popped the question sooner\n\nIn an appearance on NBC’s TODAY, Cena opened up on how he’s changed since the start of his relationship, and said that if he could do it over, he’d ask Nikki Bella to marry him years ago.\n\n“Now when I look at what I had done then as to what I would do now, I just wish I had asked her to marry me then. I guess I wasn’t [ready], but I was ready for her to live in the space I call mine and share everything and do all that…. That didn’t start out like that. I was very abrasive and stern and she had to sign this huge, crazy agreement to come in the front door. So since then I’ve kind of softened.”\n\nApril 6th, 2018 – Cena talks wedding plans\n\nIn an interview with People, Cena called himself the “final checkpoint.”\n\nVia People:\n\n“I want it yesterday, but we have a date” The former Dancing With the Stars contestant, 34, has been taking the lead when it comes to wedding planning. “All that information rests on her shoulders,” Cena says. “I’m involved in every single step of the process, but I am like the last checkpoint. So, let’s say, décor will be chosen. And then I’ll be given three options but be nudged to like number two. I will politely agree to number two, but I am very much actively a part of the process.”\n\nApril 15th, 2018 – The breakup\n\nOn a Sunday night, Nikki Bella tweeted out a short statement, announcing that she and Cena had split as a couple and called off their engagement just before their wedding.\n\nWe love you all ❤️ N pic.twitter.com/ooACLFXeMv — Nikki & Brie (@BellaTwins) April 16, 2018\n\nApril 19th, 2018 – Brie Bella squashes report that Nikki wants to “kill” Cena\n\nBrie Bella, Nikki Bella’s sister, responded to a People.com report on Instagram. In the story, a source claimed that “Brie wants to kill him.” Brie Bella refuted the report, and said that Cena will “always be family.”\n\n“I’d never say this and I’ll always love John Cena like a brother. He’ll always be family. My heart is hurting for he and my sister.”\n\nMay 6th, 2018 – Total Bellas teaser shows the moment John and Nikki called it off\n\nIt seems like the breakup was caught on camera and will be aired later in the season.\n\nCena: “I would never force you not to be a mom.” Bella: “I thought I could really sacrifice that, and I just can’t.” Cena: “I’m not sure we should go through with this.”\n\nMay 8th, 2018 – Nikki Bella thanks fans, reveals she’s moved in with Brie and Daniel Bryan\n\n“I’ve just kind of been hiding out, but I wanted to reach out to you all and just thank you all for all your love and support. I can’t tell you how much it’s meant to me, especially through a really difficult time.”\n\nMay 14th, 2018 – Cena announces he still wants to marry Nikki Bella on TODAY\n\nIn a guest host appearance on NBC’s TODAY Show, Cena made his feelings clear, and said he’s willing to have children.\n\n“For anyone out there speculating on what I am doing with my life now, I still love Nicole, I still would love to marry Nicole, I still would love to have a family with Nicole. There was an unfortunate set of circumstances where our relationship ended. There has been a lot of speculation recently about me being seen in public and everybody is thinking like, ‘Oh, John Cena is enjoying the single life.’ No, I was supposed to be married and having honeymoon over these two weeks. …. “So I’m willing to go back on all of these things that I say, and a lot of them I would hang onto just out of stubbornness. ‘I won’t have kids,’ and it took a very strong look in the mirror for me to be like, ‘Why? This is person is my number one and it’s something that’s very valuable to her. Of course we can do this, and I think it would be wonderful.'”\n\nMay 14th – Nikki Bella says there is “hope” for the couple\n\nAfter Cena went public with his intentions, Nikki Bella responded while at at event later in the day.\n\nVia People:\n\n“John is such an amazing man. He really is the love of my life. I truly hope one day that we can work it out and get back together,” admitted Bella. “I think there is hope.”\n\nMay 15th, 2018 – Total Bellas promos document the downfall of the relationship\n\nNikki: “What’s hard at times, what people don’t realize about my relationship is I’m alone a lot… To be honest, since we’ve gotten engaged, John and I have probably shared our bed together maybe 30 days total out of six months? Or 40 days? So hearing Brie and Lauren, J.J. and Bryan all talk about their family stuff and their kids just makes it sink in a little bit more of how lonely it will be and how lonely it gets.”\n\nIn another clip, Brie Bella confronts her sister over making too many sacrifices for Cena.\n\nBrie: “Some times you just tiptoe around John to not make him angry, and I think that’s [expletive].” Nikki: “Isn’t that what wives are supposed to do?” Brie: “[Expletive] no. I tell Bryan exactly how I feel all the time. I don’t hold back, ever.”\n\nMay 16th, 2018 – Nikki Bella opens up on ‘sacrifice’\n\nNikki Bella appeared on NBC’s TODAY days after Cena’s confession and explained what contributed to the breakup.\n\nNikki Bella: “I think, a lot of us that go through the wedding planning process, I think we kind of have to face and get forced to face all these issues that we have hiding deep down inside. I just know that a healthy me will be a healthy us. I do have hope for our future, but I know right now I have to work on me. And before I do say those vows and walk down that aisle, I just don’t want to be hesitant. I don’t want to be regretful.” Kathie Lee Gifford: “So you think you were just getting married too soon before you had those conversations that you needed to have, to have that peace of mind walking forward?” Nikki Bella: “Correct. I think when you sacrifice for so long, it’s like you can give so much and then you get tired of giving. And then someone wants to give it back and you already feel exhausted.”\n\nMay 17th, 2018 – Nikki Bella addresses speculation that the breakup is a publicity stunt\n\n“I think sometimes people don’t realize how you could affect them. It’s kind of like when we try to talk to cyberbullies and tell them ‘you have no idea how you’re affecting people.’ I’m a human being. I’m a human being that literally went through a breakup. Everyone’s been through a breakup, and think of how we feel. Mine has been blown up, and then people all started telling me I’m faking it, so you’re now saying that my heartache is fake and that makes it even harder. It’s just like… what can I do right?”\n\nMay 30th, 2018 – Total Bellas reveals that the couple had initially called off the wedding in January\n\nA teaser for an upcoming episode of Total Bellas, showing footage that was shot in January, revealed that Nikki Bella had called off the wedding months before the couple had publicly split, leading to a short separation. Cena and Bella reunited at the Raw 25 special later that month.\n\nMay 31, 2018 – John and Nikki are reportedly back together\n\nAccording to Us Weekly, the couple has reunited at last.\n\nJuly 30th, 2018 – John and Nikki have parted ways\n\nNikki told People that the relationship is over.", "images": ["https://usatftw.files.wordpress.com/2017/11/gronk1.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2015/11/logo-ftw.png", "https://usatftw.files.wordpress.com/2020/04/zabit.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2013/12/nick1.jpg?w=48&h=48&crop=1", "https://usatftw.files.wordpress.com/2015/11/logo-usat-bar.png", "https://usatftw.files.wordpress.com/2015/11/ftw-icon-section-head.png", "https://usatftw.files.wordpress.com/2020/04/butler.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2020/04/gronk1.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2020/04/wm36_cg_25125.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2020/04/mcmahon.png?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2020/04/lamartrump.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/05/john1.jpg?w=1000&h=576&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://usatftw.files.wordpress.com/2020/04/screen-shot-2020-04-18-at-5.44.02-pm.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2020/04/otis.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2020/04/fifa.png?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/05/john1.jpg?w=1000&h=600&crop=1"], "top_img": "https://usatftw.files.wordpress.com/2018/05/john1.jpg?w=1000&h=576&crop=1", "keywords": [], "authors": ["Nick Schwartz", "Ftw Staff", "May"], "canonical_link": "https://ftw.usatoday.com/2018/05/whats-going-on-with-john-cena-nikki-bella-relationship-timeline", "title": "What's going on with John Cena and Nikki Bella? A timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Will John Cena and Nikki Bella get back together?", "keywords": "john cena, nikki bella, whats going on with john cena and nikki bella, john cena nikki bella breakup, nikki bella engagement, john cena marriage,", "fb": {"app_id": 451360081611296, "admins": 1651440013}, "google-site-verification": "no3A69hVM5ut63_reMWqC5VegUmDtCMsgeO4Wh_iBY8", "msvalidate.01": "6C7AFE373C691E833D6444FFA7F6E8A2", "generator": "WordPress.com", "og": {"type": "article", "title": "What's going on with John Cena and Nikki Bella? A timeline", "url": "https://ftw.usatoday.com/2018/05/whats-going-on-with-john-cena-nikki-bella-relationship-timeline", "description": "Will John Cena and Nikki Bella get back together?", "site_name": "For The Win", "image": {"identifier": "https://usatftw.files.wordpress.com/2018/05/john1.jpg?w=1000&h=576&crop=1", "width": 1000, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-05-31T19:45:42+00:00", "modified_time": "2018-07-31T15:29:34+00:00", "publisher": "https://www.facebook.com/usatodayftw", "author": "https://facebook.com/schwartznick"}, "twitter": {"creator": "@ForTheWin", "site": "@forthewin", "text": {"title": "What's going on with John Cena and Nikki Bella? A timeline"}, "image": "https://usatftw.files.wordpress.com/2018/05/john1.jpg?w=640", "card": "summary_large_image"}, "gdpr": "false", "sop-property": "581b62d42a2cc300124a6a6e", "application-name": "For The Win", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "What fans are talking about.", "msapplication-task": "name=Subscribe;action-uri=https://ftw.usatoday.com/feed;icon-uri=https://secure.gravatar.com/blavatar/2ef498b87825ac1e90fb08b478c63932?s=16"}, "movies": ["https://www.youtube.com/embed/OkalERYw9iw?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/mBoNT54NRPE?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/0VQqjuN3eOw?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/uqYMDvF9qhk?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/Ino_ZpzVR4s?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/4_aR3HqFrr0?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/-T3Z3h3YFIg?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/xs-X_sj7C54?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1527795942.0, "source": "https://ftw.usatoday.com", "summary": ""}