{"url": "https://nypost.com/2017/10/20/alexa-bliss-on-her-sudden-wwe-rise-anorexia-battle-and-total-divas/", "text": "WWE superstar and Raw women’s champion Alexa Bliss locks up with The Post’s Joseph Staszewski for some Q&A before her match with Mickie James at the TLC pay-per-view Sunday on the WWE Network and the premiere of E!’s Total Divas on Nov. 1 at 9 p.m.\n\nQ: Where did the inspiration for the Alexa Bliss character come from? She seems like the mean, popular girl from school.\n\nA: That’s exactly what I wanted to do. I remember telling my mom, because my mom used to help me out with my character a lot. I was telling her I want to be that mean girl that everyone knew in high school. Everyone knew that girl. There was always that one girl that was rude that was mean, but everyone still wants to know what’s going on with her. I get a lot of inspiration from a lot of different villains and different movies.\n\nQ; Do you think that is why everyone connects with Alexa Bliss, because everyone has met someone like that in their life?\n\nA: Absolutely, I take inspiration from people who were not nice to me in high school (laughs), try to focus that. I feel like that is something everyone can relate too, even if you were that girl. People knew who that was and how to relate to it.\n\nQ: You said you take inspiration from different villains. You are a fan of cosplay. What made you go with the Harley Quinn look? That was the one that took off.\n\nA: I did a lot of cosplay when I was with (Wesley) Blake and (Buddy) Murphy when I was in NXT. We had a Harley Quinn and Joker trio outfit that we never got to do. I remember saying to (my fiancée) Murphy, ‘I really want to still do this Harley Quinn one’ and he was like ‘you should’. So we worked on the outfit and got it all together.\n\nHe actually came up with the pose with the belt (behind my neck and right shoulder), which is funny. That has transitioned into how I hold the title. That was where it came from. It was an idea we had in NXT. Everyone knows I can do the cosplay thing on the main roster. I went for it and it worked out pretty well.\n\nQ: You didn’t take the traditional path to wrestling. You were a Division I cheerleader, body builder. You applied online for a WWE tryout. What made you take that chance at 22?\n\nA: I had watched wrestling grow up. I found it amazing. I loved watching wrestling. I was so focused into sports and everything growing up, after college one of my trainers was telling me that WWE was having a tryout. When I found that out I said, ‘My gosh I have to tryout.’ I knew it was an opportunity that I didn’t want to pass up.\n\nI remember sending in a video, thinking probably nothing will come of it, but I still had high hopes. I got a call, got a tryout and I’ve been wrestling for the last four years.\n\nQ: When you walk into that tryout and you’re 5-foot-1, never wrestled before and you’re in a room with these big athletes and model types, what’s going through your mind as things are getting started there?\n\nA: When I went it was in L.A. and it was all these models. They were real tall, real thin, beautiful women. I remember texting my mom like, ‘Well I tried.’ I was like, clearly they are looking for something, looking for a specific look and I am walking in 5-foot. I had never done like modeling, modeling. I was just like, ‘Oh man. Fantastic.’\n\nQ: Was there a point where you relax and think, OK this is not as bad as I thought it would be?\n\nA: I think once I started talking because we got to go in and start talking to everyone. They were just trying to get a feel for our personalities. A lot of the girls that were there I feel like didn’t have a lot of knowledge about wrestling because they told me they didn’t.\n\nI remember just going and just talking and Triple H was there and I was like, ‘Oh my gosh this is so cool.’ I just started talking and I am a talker. I just started talking about my family watching wrestling. I started to talk about the knowledge I had of wrestling, storylines and everything like that.\n\nThey told us they would call us back if we got a 30-day tryout. When I was on the flight home from that tryout, they were like it’s a 30-day tryout, and in-ring tryout and they would take girls from there. Then I get a call about two weeks later, saying, ‘Well you are not going to the 30-day tryout.’ I’m like, ‘Oh no.’ ‘We are going to sign you and you are going to move down [to Florida] in four months and we are going to give you your medical next week. I’m like, ‘Oh gosh.’ ‘Just hope you are as athletic as you look.’ Oh my gosh, no pressure.\n\nQ: What do you think made them change their mind and sign you right away?\n\nA: I’m not sure. I’d be really interested to know, but I am not sure. Maybe it was because I didn’t stop talking. I don’t know.\n\nQ: When you are holding some of those titles, do you ever think back to where this started, from never wrestling to the first person to hold the Raw and SmackDown women’s titles?\n\nA: It’s been an amazing journey that I’ve had with WWE. I always think about the first day I came to FCW at the time. I remember walking in and I had sparkly-sequence UGG boots on, sparkly-sequence jacket on and matching sequence backpack. The head instructor, Bill Dumont, goes. ‘What are you?’ I was just like, ‘I’m Lexi.’ I didn’t know what else to say.\n\nYou could probably see me from space. I was very just like not knowing anything and watching the girls on the first day. I was like, ‘Oh my gosh, they are so good.’ That day I didn’t think I would ever be able to get to their level and to have the opportunity to be champion has been absolutely incredible.\n\nQ: Even before that, you had to deal with anorexia as a teenager. In what ways did it take over your life?\n\nA: Oh gosh, I was a completely different person. It controls you and it consumes you in so many different ways.\n\nI remember my mom sitting me down and telling me I was in the hospital and she was like, ‘You are probably going to die from this’ because the doctors were telling her 1 in 4 people die from it and I was going to be that one because my body wasn’t responding. My heart wasn’t responding. Everything was just going downhill and I didn’t see it. Your brain doesn’t see it. I remember being in the hospital and not knowing why.\n\nI looked in the mirror and said, ‘I’m fine. I look fine’ and my mom is telling me you are going to die from this and I just literally looked at her blankly and said, ‘I don’t care.’\n\nIt’s one of those things you don’t know who you are. You become something completely different and it consumes you entire life. It consumes everything about you.\n\nThat is why I try to be so open about it because people going through it, it consumes them and you tell them it doesn’t have to. You can move past your eating disorder and not let it have control over your life anymore.\n\nQ: How did you overcome it?\n\nA: I went through treatment so many times. At one point I was in rounds of five different doctors a day. That was my deal to be able to get out of the hospital, which was I had to see five different doctors every day. I literally spent every day at the doctors. I remember, you have to get better when you want to get better. I’d have phycologists and physiatrists telling me ways to try to get better. It is something you have to try to do on your own.\n\nI remember my friend Erin telling me she had been in the hospital with me every day. She was there when I got admitted and after I was released. She said, ‘If you think you are fat Lexi, what do you think I look like?’ And then I noticed she was starting to pick her food apart like me. She was starting to count calories like me and it just broke my heart because I never wanted to influence anyone to go through what I am going through and that’s exactly what I had done. That was the moment where I knew I needed to get better.\n\nIt was for me and it was for people around me because it doesn’t just affect you, it affects people around you. That fact that I was literally taking my best friend and morphing her into that bad path, it wasn’t OK with me.\n\nMy parents put me back in touch with my trainers Mike [Davies] and Natalie [Calland]. They told me I was going to compete [in body building]. I was like 80 pounds and they were like, ‘You are going to be on stage in six weeks. You can either be skinny and embarrass yourself or look healthy and do well, but regardless you are getting on stage in six weeks.’ That was kind of the kick in the butt. Their diets got me comfortable eating food again. It was a very, very long process because this was like a four or five year battle.\n\nQ: How tough was it to earn the respect of room in NXT or FCW when you had not wrestled before and had not gone through the indies?\n\nA: Oh god, I don’t know if I still have it now. It’s one thing coming in, not being a part of the indies stuff like that and doing well. It’s another to now be part of the indies and be champ. It’s an ongoing thing, but the girls that I work with now are amazing.\n\nWhen I came up to SmackDown I was super nervous. I never really worked with these girls before. I have to say, the group of women I was drafted with to “SmackDown Live” were the most welcoming and most amazing women I’ve ever worked with.\n\nWe would go on tours, we would go have dinners together and hang out and everyone was so sweet. It was the most refreshing locker room I had ever been in and it is still the best locker room I’ve even been in. Just having Nikki [Bella] there we had so much fun.\n\nQ: Did anyone help you transition to the world of reality TV with Total Divas?\n\nA: I texted Nikki Bella asking her like, ‘Oh gosh what do I do.’ She was just like, ‘Have fun with it. You’re with (your best friend) Nia (Jax) so just kind of be you because we are crazy anyway. Just have fun with it.’ The real stuff is awesome, but don’t be afraid to open up and just be fun.\n\nQ: What will people see from Total Divas’ Alexa Bliss that is different from the person they see on Raw?\n\nA: Oh gosh. You probably won’t see me be mean as much. That is probably the biggest difference. I’m not nearly as mean. You get to see how the schedule affects me and Murphy and you will get to see that I get a (pet mini) pig Larry-Steve. You will see pretty much everything about Nia and I’s friendship.\n\nQ: It feels like Larry-Steve is starting to take off. He’s getting is own social media accounts. How fun has it been to have him?\n\nA: It’s so much fun. He is such a little ham for the camera, no pun intended. If you pull out a camera, he knows exactly what it is. He comes up and sniffs it and like pose. It’s the funniest thing ever. He’s super smart. He has just been so fun to have and see how he interacts with (our) dogs.\n\nQ: When you did the Bayley: This is Your Life segment on Raw, why didn’t that work and did it bother you and Bayley?\n\nA: We kind of knew going into it that it wasn’t going to be The Rock and Mick Foley. We pretty much took what we had. We knew the direction. We knew it was going to go really well or really bad. I knew if it was gonna go bad and it wasn’t going to be responsive to the audience, I was just going to have fun with it. So I was like you know what, there was nothing we could do about it, we are going to have fun and just make the best of it as we can.\n\nSometimes there is those segments that no matter what you do they are going to turn out how they are gonna turn out. I don’t think it was the writing or anything like that. I feel like it was, I’m not The Rock. She’s not Mick Foley. It’s never going to be the same as something that was done before.\n\nI started like messing with actors, just slap her and call her like Slaps McGaps or something like that. I just started playing around with it and just having fun with it. Because I was like, if they’re not going to like it than I am going to have fun with it.\n\nIt’s wasn’t really something we beat ourselves up over. It was just like, ‘Well, it is what it is. Looking forward to next week.’ I think it is funny that WWE joked about it ever since.\n\nQ: It was the next week\n\nA: Yea, the next week and weeks after that they have me keep mentioning like, ‘Oh hey this is your life. Just kidding.’ Stuff like that. It’s been the butt of every joke. It is fun, but you are never (always) gonna have amazing segments and it was deemed like the worst segment in Raw history, so I feel like I had some really good segments in Raw and the worst segment in Raw history so I am pretty much well rounded then.\n\nQ: You and Mickie James seem to have good chemistry. What is it like having veterans like her and Natalya in the locker room to bounce things off of?\n\nA: I love having Mickie in the locker room. When I was on SmackDown, I always worked with Nattie and she’s awesome and I love Nattie to death. We always have our makeup and Sephora brushes. She actually texted me the other day about her Sephora trip, we compare Sephora trips.\n\nMickie has been a lot of fun to work with. I am looking forward to our match at TLC. When Mickie first came back she was on my side as La Luchadora and helped me retain my SmackDown title in a cage match against Becky (Lynch). To kind of switch roles and have us against each other has been a lot of fun. She is always fun to work with and she has all this information and it’s just fun to pick her brain.\n\nQ: Asuka is making her main roster debut at TLC. What was it like working with her in NXT and how does her style from Japan make things a little different?\n\nA: At first her style was very, very different, but I’ve worked with her so many times now that I am kind of used to her style, used to the aggression, used to how to make it work. I know because if you have two conflicting styles you can have an amazing match or it could be a hot mess. I love working with Asuka. I am really excited she’s coming to the roster. She is what this next step of the women’s revolution needs.\n\nQ: How did you and Nia become friends? Why did you hit it off so quickly?\n\nA: They have the NXT talent help out with the tryouts in NXT and I helped out with her and it was in the middle of their lunch break, she comes up and starts talking to me when I was doing cardio. And we just hit it off and we have been best friends ever since.\n\nQ: If WWE didn’t’ work out, what would Alexa Bliss be doing?\n\nA: I went to college (at Akron) for diet and nutrition, so I would probably be a nutritionist.", "images": ["https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=1200", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://thenypost.files.wordpress.com/2018/11/sidebarwidget_sportsodds_promo_image_280x180.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://thenypost.files.wordpress.com/2020/04/mani-kit-feature.jpg?quality=90&strip=all&w=300&h=200&crop=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0"], "top_img": "https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["October"], "canonical_link": "https://nypost.com/2017/10/20/alexa-bliss-on-her-sudden-wwe-rise-anorexia-battle-and-total-divas/", "title": "Alexa Bliss on her sudden WWE rise, anorexia battle and ‘Total Divas’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "WWE superstar and Raw women’s champion Alexa Bliss locks up with The Post’s Joseph Staszewski for some Q&A before her match with Mickie James at the TLC...", "generator": "WordPress.com", "og": {"type": "article", "title": "Alexa Bliss on her sudden WWE rise, anorexia battle and ‘Total Divas’", "url": "https://nypost.com/2017/10/20/alexa-bliss-on-her-sudden-wwe-rise-anorexia-battle-and-total-divas/", "description": "WWE superstar and Raw women’s champion Alexa Bliss locks up with The Post’s Joseph Staszewski for some Q&A before her match with Mickie James at the TLC pay-per-view Sunday on the WWE Network a…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2017-10-20T18:44:53+00:00", "modified_time": "2017-10-20T22:19:50+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypostsports", "site": "@nypost", "text": {"title": "Alexa Bliss on her sudden WWE rise, anorexia battle and ‘Total Divas’"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2017/10/bliss2.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Alexa Bliss on her sudden WWE rise, anorexia battle and 'Total Divas'", "description": "WWE superstar and Raw women’s champion Alexa Bliss locks up with The Post’s Joseph Staszewski for some Q&A before her match with Mickie James at the TLC pay-per-view Sunday on the WWE Network"}, "fb": {"pages": 225343690812937}, "nypost-section": "Sports", "parsely-metadata": "{\"post_id\":\"nypost-11340436\"}", "keywords": "Sports,Entertainment,alexa bliss,anorexia,pro wrestling,wwe", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": ["https://www.youtube.com/embed/aU7LVcQFvn8?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/q5mKkkCw1F4?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/Q8_d4lQUsjU?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1508428800.0, "source": "https://nypost.com", "summary": ""}