{"url": "https://web.archive.org/web/20180727143132/http://houstonpost.co/2018/06/26/red-hen-owner-just-issued-sick-threat-to-sarah-sanders-after-biz-was-destroyed-by-booting-her/", "text": "Among the far-left liberal owners of the Red Hen Restaurant in Lexington, Virginia apparently did not learn her lesson once she chose to throw Sarah Huckabee Sanders out of her restaurant on Friday evening, then coming under assault of a complete army of”Deplorables.”\n\nRegardless of all the backlash, Stephanie Wilkinson has doubled down and is now claiming she does not repent what she did Friday.\n\nAll this mess started when Press Secretary Sarah Sanders, together with her Husband along with six other friends decided to go out to dinner this past Friday night in the Red Hen Restaurant.\n\nAs Sanders along with the rest inside her celebration nibbled in what we can only surmise as mediocre crackers and cheese, the owner of the restaurant has been called to the institution where she asked Sanders to return to the terrace with her.\n\nWhen they got to the patio Wilkerson told her the restaurant had”certain criteria” like”honesty, and empathy, and collaboration.” So she asked Sanders to depart.\n\nShe agreed because Sanders is a lady. She gathered up her stuff and left, together with the rest of her celebration.\n\nVice noted:\n\nBut despite all the backlash she’s gotten from the right, Stephanie Wilkinson says she does not regret a thing.\n\n“We simply felt there are moments in time when folks need to live their own convictions. This appeared to be one.”\n\nWhen Sanders came to the Red Hen along with her husband along with six other people on Friday night, the boxer called Wilkinson to mention the team was”a little concerned,” Wilkinson told the Post.\n\nShe headed to the restaurant, and–while Sanders and her friends munched on cheeseboards–called the team to a huddle in the kitchen, and asked if they wanted Sanders to leave. According to the Article, a handful of her workers are gay, and many others are revulsed by Sanders’ treatment of this emergency at the boundary. They wanted her gone.\n\nWilkinson took Sanders out into the patio and asked her to leave, telling her why the restaurant had”certain criteria” like”honesty, and compassion, and collaboration,” Wilkinson told the Post. Sanders agreed to proceed, gathered up her things, and headed out, followed by the remainder of her party, whose meal Wilkinson comped.\n\nFollowing the White House Press Secretary identified the place by name on Twitter, President Trump called it”filthy,” and a army of his assistants got busy screwing with its business–beginning a campaign to make a bunch of bogus dinner reservations and tanking its score on Yelp.\n\nI always had a guideline, if a restaurant is filthy on the outside, it’s dirty on the inside!\n\nThe restaurant’s Yelp page has been bombarded with over 11,000 one-star reviews, leaving it in a sound one-and-a-half.\n\nPiggybacking on Trump’s dig on the area being”filthy,” several pissed-off reviewers have claimed to have discovered roaches in their food because Sanders was kicked out, but some have compared Wilkinson to a Nazi and called her and her staff”un-American hateful bigots.”\n\n“I’ve a company, and I want the company to flourish. This feels just like the moment in our democracy when people need to make uncomfortable actions and decisions to maintain their morals.”\n\nSaturday afternoon the Press Secretary hadn’t any difficulty in telling her story and actually named the establishment on Twitter, which was followed by President Trump calling it”filthy” on his Twitter page.\n\nWhich in turn led to a military people deplorables wasting no time whatsoever in creating our feelings heard on social networking, on Yelp and by creating fake dinner reservations in demonstration. The Restaurant’s Yelp page currently has the company at one star and a half.\n\nWhile on the other side, liberals were pleased to leave this slum a 5-star rating although they threw a hissy fit every time a Christian baker didn’t need to bake a cake for a homosexual wedding a few years back.\n\nWilkerson went on to confirm to the Article she feels like this is the moment in our democracy when people have to make uncomfortable decisions and actions to maintain their morals.\n\nOdd which she’d cite morals as it pertains in the side that amuses a sexual predator such as Bill Clinton and his wife Hillary who dragged his accusers through the mud in order to conserve her own political ambitions.\n\nFeatured Image Source H/T: RWNOfficial", "images": ["https://web.archive.org/web/20180727143132im_/http://houstonpost.co/wp-content/themes/twentyseventeen/assets/images/header.jpg", "https://web.archive.org/web/20180727143132im_/http://1.gravatar.com/avatar/1c9db04d4336b38ca23ddd3d8a0f21b6?s=100&d=mm&r=g", "https://web.archive.org/web/20180727143132im_/http://houstonpost.co/wp-content/uploads/2018/06/stephanie-wilkinson-red-hen-owner-fb-sanders-1200x630.jpg", "https://web.archive.org/web/20180727143132im_/https://i1.wp.com/houstonpost.co/wp-content/uploads/2018/06/stephanie-wilkinson-red-hen-owner-fb-sanders-1200x630.jpg?resize=1200%2C630"], "top_img": "https://web.archive.org/web/20180727143132im_/http://houstonpost.co/wp-content/uploads/2018/06/stephanie-wilkinson-red-hen-owner-fb-sanders-1200x630.jpg", "keywords": [], "authors": ["Shirley Freeland", "Shira Yashin"], "canonical_link": "https://web.archive.org/web/20180727143132/http://houstonpost.co/2018/06/26/red-hen-owner-just-issued-sick-threat-to-sarah-sanders-after-biz-was-destroyed-by-booting-her/", "title": "Red Hen Owner Just Issued Sick Threat To Sarah Sanders After Biz Was Destroyed By Booting Her", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"type": "article", "title": "Red Hen Owner Just Issued Sick Threat To Sarah Sanders After Biz Was Destroyed By Booting Her", "description": "They did not learn their lesson.", "image": {"identifier": "https://web.archive.org/web/20180727143132im_/http://houstonpost.co/wp-content/uploads/2018/06/stephanie-wilkinson-red-hen-owner-fb-sanders-1200x630.jpg", "width": 1200, "height": 630}, "url": "https://web.archive.org/web/20180727143132/http://houstonpost.co/2018/06/26/red-hen-owner-just-issued-sick-threat-to-sarah-sanders-after-biz-was-destroyed-by-booting-her/", "site_name": "My Blog", "updated_time": "2018-06-26T20:31:39+00:00"}, "article": {"published_time": "2018-06-26T20:31:39+00:00", "modified_time": "2018-06-26T20:31:39+00:00"}, "twitter": {"card": "summary_large_image", "title": "Red Hen Owner Just Issued Sick Threat To Sarah Sanders After Biz Was Destroyed By Booting Her", "description": "Among the far-left liberal owners of the Red Hen Restaurant in Lexington, Virginia apparently did not learn her lesson once she chose to throw Sarah Huckabee Sanders out of her restaurant on Friday evening, then", "image": "https://web.archive.org/web/20180727143132im_/http://houstonpost.co/wp-content/uploads/2018/06/stephanie-wilkinson-red-hen-owner-fb-sanders-1200x630.jpg"}, "generator": "WordPress 4.9.7"}, "movies": [], "publish_date": 1529942400.0, "source": "https://web.archive.org", "summary": ""}