{"url": "https://en.wikipedia.org/wiki/List_of_Girls_episodes", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date US viewers\n\n(millions)\n\n53 1 \"All I Ever Wanted\" Lena Dunham Lena Dunham & Jenni Konner February 12, 2017 ( ) 0.519[52]\n\nSeveral months later, after her piece about Jessa and Adam's relationship is published in The New York Times, Hannah is sent on an assignment to a surf camp in the Hamptons by a magazine publisher. Although she initially dislikes it, she soon loosens up when she pursues a sexual tryst with her free-spirited instructor, Paul-Louis. Back in New York City, Marnie struggles to come to terms with her divorce from Desi, particularly after watching Ray and Shoshanna's friendly, affectionate interactions. At the same time, Ray decides to crash at Adam and Jessa's apartment despite both of them being deeply and sexually involved with each other.\n\n54 2 \"Hostage Situation\" Lena Dunham Lena Dunham February 19, 2017 ( ) 0.708[53]\n\nHannah reluctantly agrees to accompany Marnie and Desi on a weekend trip to Poughkeepsie, in order to provide Ray with a cover story. There, Marnie discovers that Desi has been addicted to Oxycontin for a year, resulting in a violent argument. After shutting Desi out of the house, Hannah gently explains to Marnie that she didn't notice Desi's drug addiction because she spends too much time thinking about herself; something that Hannah admits she understands all too well. She reaffirms their friendship, and eventually helps her take Desi home. Meanwhile, Elijah agrees to accompany Shoshanna to a networking event organised by two former college friends of Shosh's, who started their own clothing line. To her dismay, Jessa invites herself along. There, her former friends confront her over her having bailed on their Spring Break trip to Aruba with only six hours notice, and for subsequently abandoning them in order to pursue friendships with Jessa's circle. Outside, a seething Shoshanna snaps at her cousin, accusing her of ruining her life, and eventually orders her to get out of her face.\n\n55 3 \"American Bitch\" Richard Shepard Lena Dunham February 24, 2017 ( ) (online) [54]\n\nFebruary 26, 2017 ( ) (HBO) 0.383[55]\n\nHannah visits the upscale apartment of Chuck Palmer, a famed, prize-winning writer, who has summoned her after reading an article that she wrote accusing him of coercing college students into having sex with him, and desiring to give her his side of the story. The two engage in a long and tense debate about Chuck's shortcomings in his interactions towards women (as he appears unaware of the impact of the power imbalance between him and the college girls Hannah quoted) and Hannah's journalistic mistake (since most of her sources for the article were Tumblr blog posts, and therefore relied on hearsay). Eventually, they begin to bond over their shared literary preferences, and their perceived insecurities. However, after Hannah apologizes for writing the article, Chuck manipulates her into grabbing his penis, and Hannah finally understands who he really is. Hannah reluctantly avoids making a scene by agreeing to listen to a flute recital by Chuck's visiting daughter, and leaves, looking visibly ashamed, humiliated and enraged.\n\n56 4 \"Painful Evacuation\" Jesse Peretz Lena Dunham & Jenni Konner March 5, 2017 ( ) 0.571[56]\n\nEmotionally rejected by Marnie (who remains privately embroiled in her drama with Desi and his recovery), Ray is beginning to feel disillusioned about their relationship, particularly when she rejects his effort to just hang out with her. Later, when one of his regular customers collapses and dies after Ray is brusque with him, Ray and Hermie get into an argument over the idea that Ray is wasting his potential. Later, when Shoshanna helps Ray to realize Hermie is only trying to help, Ray goes to his friend's apartment to apologize, only to find that he has also died. Elsewhere, after Adam angrily quits working on a film set, he and Jessa decide to make a movie together, based on their situation with Hannah. Meanwhile, Hannah is suffering from a yet another urinary tract infection due to her HPV, and eventually decides to go to the emergency room to get some antibiotics; there, she has a surprise encounter with Joshua, her doctor fling from \"One Man's Trash\". Joshua then drops another unexpected bombshell, that Hannah is pregnant. On her way home, Hannah is confronted in her stairwell by Jessa and Adam, who ask her for permission to make their movie; irritated and still in shock from her discovery, Hannah mutters her consent.\n\n57 5 \"Gummies\" Jesse Peretz Sarah Heyward March 12, 2017 ( ) 0.703[57]\n\nLoreen (Hannah's mother) has come to visit Hannah for a few days, and Hannah informs her of her pregnancy. Although Loreen appears happy with the news, it becomes clear that she has become addicted to cannabis and she is struggling to cope with being alone after her divorce, and the news of Hannah's baby only worsens her growing fatalism. After a fight with her daughter at a laundromat while high, Loreen disappears. After hours of looking, Elijah and Hannah find Loreen binging at a Chinese restaurant. There, Loreen breaks the news of Hannah's pregnancy to Elijah, who does not take it well, and bluntly tells Hannah she would be a terrible mother because she is selfish and self-obsessed. Meanwhile, a grieving Ray is going through Hermie's apartment with an obviously disinterested Marnie. Finally fed up with her self-absorbed behaviour, Ray tells her he wants to break up. Elsewhere, Adam and Jessa are making progress on their film. Jessa becomes worried by some of the lines of dialogue about Hannah and Adam's relationship, which Jessa realizes more accurately reflects their own.\n\nHannah finally informs Marnie of her pregnancy, and although she reacts positively, she quickly annoys her by insisting that she has to tell the father. This puts Hannah in a dilemma about whether to do so. Hannah then visits her father and his boyfriend offer her both sides of the argument. Meanwhile, Marnie struggles to convince Desi to perform at a club in New Jersey as a favor to her mother. Desi ultimately turns up high, and Marnie is forced to perform with her mother who soon does a terrible job. Adam starts asking Hannah to watch the first cut of his film, saying he wants her to confirm its accuracy, and when he won't stop bothering her, she shocks him by revealing her pregnancy. Subsequent to this, Jessa turns up at Hannah's apartment and confronts her for not telling her herself. Despite Hannah making clear that she wants nothing to do with her, Jessa tells her that she cannot just erase everything that they went through. Eventually, Hannah makes a half-hearted attempt to contact Paul-Louis, but doesn't succeed. In frustration, she decides to watch Adam's film – and is caught off guard by its surprisingly raw, emotional opening scene. Elsewhere, Elijah, working in retail at his second job, realizes his thespian talent when he agrees to read lines from a play that his co-worker is auditioning for.\n\n59 7 \"The Bounce\" Richard Shepard Murray Miller & Tami Sagher March 26, 2017 ( ) 0.675[59]\n\nTaking the advice of his department store colleague, Elijah decides to attend a workshop audition for a stage remake of the 1992 sports comedy White Men Can't Jump, while Hannah is waiting to hear back from Paul-Louis. On his way out, Elijah is surprised by the arrival of his former boyfriend, Dill Harcourt – who is trying to hide from some paparazzi due to a recent scandal involving him trying to adopt a baby on the black market. Hannah agrees to keep an eye on him at the apartment while Elijah leaves. At the audition, Elijah initially tries to bail, but then meets a young woman named Athena, who persuades him to stay, and the two bond. Elijah's audition initially goes well, although it soon emerges he has no control over the basketball he has been given. Meanwhile, upon learning of Hannah's dilemma with her baby, Dill firmly tells her that not having a father figure when he grew up was the reason he couldn't bring himself to love anybody. Later, Paul-Louis finally calls Hannah back where she finally tells him of her pregnancy. Although he is genuinely surprised, and offers some emotional support, he admits he is not ready to be a father. After the call, Hannah breaks into tears, and an also-crying Dill comforts her. Elijah returns from the audition to find the two bonding over television and pizza, and after initially standing up to Dill, Elijah invites him to his room for sex. The next morning, he receives a phone call from the producers, offering him a part in the play – on the condition he is kept well away from the basketball. Concurrently, Marnie is broke, and has just received an eviction notice. Unable to get support from her mother, other than a place to sleep, she goes to pawn some of her jewellery, only to discover that all of the seemingly precious jewellery that her parents gave her was fake. When this revelation causes Marnie to throw yet another narcissism-laced tantrum, the appraiser rolls his eyes at her, and tells her that she is merely trying to blame other people for her predicament; the only liar in her life is herself. Deeply affected by this encounter, and realizing that she needs to take responsibility for her life, Marnie leaves a message on Desi's voicemail expressing regret at the way she treated him throughout their marriage.\n\n60 8 \"What Will We Do This Time About Adam?\" Jesse Peretz Judd Apatow & Lena Dunham April 2, 2017 ( ) 0.765[60]\n\nHaving given in to his nostalgia, Adam asks Hannah if he can help her raise the baby. Despite her fear that Adam will leave her for good, Jessa offers no resistance and has sex with a stranger in a bar instead. Adam tracks Hannah down and makes his pitch; still riding her wave of loneliness after Paul-Louis's phone call, Hannah invites him home for sex. Appearing to have reconciled, Hannah starts making plans for raising the baby with Adam. However, by the day's end, both have come to the realization that their enthusiasm for their relationship has already gone, and end up returning home separately. Discovering he doesn't have his key, Adam phones a relieved Jessa to buzz him in to their apartment, while Hannah lies on her bed weeping... her fears of having to raise her baby alone now returned. Meanwhile, Ray and Shoshanna meet for lunch with Shosh's friend and former boss, Abigail. To Shosh's dismay, Ray and Abigail hit it off quickly, and decide to work together to continue Hermie's pet project of documenting the effects of gentrification. The two later share a kiss while riding a merry-go-round that evening.\n\n61 9 \"Goodbye Tour\" Nisha Ganatra Jenni Konner & Lena Dunham April 9, 2017 ( ) 0.734[61]\n\nHannah interviews for a position at an unnamed college upstate. She meets with Phaedra, a dynamic creative writing professor who discovered Hannah's work online. Heading back to the city, Hannah receives a job offer. Elijah doesn't understand why Hannah wants to leave New York. He tries his best to convince her to stay, but she's focused on finding a better environment for her baby, and that this is her chance to finally leave the city. In need of advice about her move, Hannah heads to Shoshanna's apartment only to find the other girls there celebrating Shosh's engagement; Hannah was intentionally left uninvited. Seeing the looming threat of a fight, Marnie calls a group meeting in the bathroom, hoping to resolve their friendship issues. The conversation isn't productive, as everything the four girls have to say to each other was already said two years previously in the \"Beach House\" episode, and it ends with Shoshanna declaring she has moved on and no longer wants to be friends with any of them by telling Hannah, Marnie and Jessa that they have held her back from her life and career long enough. Later, when Jessa attempts to make her feel better, Hannah is willing to listen, and they finally make their peace. In one final hurrah, the girls end the night dancing in the apartment, albeit individually. The episode ends as Hannah finally leaves the city and moves into her new home upstate.\n\n62 10 \"Latching\" Jenni Konner Lena Dunham & Jenni Konner & Judd Apatow April 16, 2017 ( ) 0.741[62]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Girls-logo.svg/1200px-Girls-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Girls-logo.svg/225px-Girls-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/api/rest_v1/page/graph/png/List_of_Girls_episodes/0/fb2e00682090d87194a46183bef7fca6fca2a666.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Girls-logo.svg/1200px-Girls-logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Girls_episodes", "title": "List of Girls episodes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Girls-logo.svg/1200px-Girls-logo.svg.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}