{"url": "http://www.cmt.com/news/1794445/jason-aldean-florida-georgia-line-and-carrie-underwood-are-top-nominees-for-2018-cmt-music-awards/", "text": "Little Big Town Hosts the Show Live from Nashville on June 6 at 8 p.m. ET\n\nThe 2018 CMT Music Awards show promises to be one of the most genre-bending ceremonies to date with at least eight collaborative videos featuring pop artists, R&B legends, Americana favorites and more making the final nominees list.\n\nLittle Big Town will host the event live from Nashville on June 6 at 8 p.m. ET. Jason Aldean, Florida Georgia Line and Carrie Underwood lead the nominees with four nominations each.\n\nVoting to determine the winners in each category is underway at CMT.com through 12:01 a.m. ET on June 4. The top five video of the year finalists will be announced the morning of the show, and fans will be able to vote for their favorites in the category all day and throughout the special via Twitter.\n\nUnderwood is the record-holder for the most CMT Music Award wins with 17 trophies. The video for her Ludacris collaboration, “The Champion,” is nominated in three categories including the night’s top honor of video the year, and she shares a nod for CMT performance of the year with Keith Urban for “The Fighter” from the 2017 CMT Music Awards.\n\nFlorida Georgia Line and Bebe Rexha share nominations for video and collaborative video of the year for “Meant to Be,” while the Brian Kelley-co-directed “Smooth” video is up for duo video, and “Everybody” from FGL’s CMT Crossroads with the Backstreet Boys is nominated for CMT performance of the year. Aldean’s four nominations are also in the video, male video and CMT performance of the year categories.\n\nFollowing Aldean, FGL and Underwood with three nominations each are Little Big Town, Chris Stapleton, Lauren Alaina and Thomas Rhett.\n\nAdditionally, the 2018 nominations mark the first time pop musicians Rexha, Ludacris and Justin Timberlake are recognized in the video of the year category along with videos from Rhett, Blake Shelton, Brett Young, Brothers Osborne, Dan + Shay, Kane Brown featuring Alaina, Kelsea Ballerini and Luke Combs.\n\nAndra Day, Backstreet Boys, Carly Pearce, Common, Derek Trucks, Devin Dawson, High Valley, LANco, Russell Dickerson, Walker Hayes and Earth, Wind & Fire are also among the CMT Music Awards’ first-time nominees.\n\nBallerini helped announce the nominees in three categories during Tuesday’s (May 8) Today show on NBC. Other categories were announced by the Associated Press.\n\nJoin the conversation by following @CMT on Twitter and Instagram, using hashtag #CMTawards and liking the CMT Music Awards on Facebook.\n\nHere is a complete list of nominees for the 2018 CMT Music Awards.\n\nVideo of the Year\n\nBest video of the year; awarded to the artist (male, female, group/duo or collaboration) and the video director. Final nominees announced the morning of the show, with final voting held on Twitter during the live telecast.\n\nBebe Rexha feat. Florida Georgia Line, “Meant To Be”\n\nBlake Shelton, “I’ll Name The Dogs”\n\nBrett Young, “Mercy”\n\nBrothers Osborne, “It Ain’t My Fault”\n\nCarrie Underwood feat. Ludacris, “The Champion”\n\nDan + Shay, “Tequila”\n\nJason Aldean, “You Make It Easy”\n\nJustin Timberlake feat. Chris Stapleton, “Say Something”\n\nKane Brown feat. Lauren Alaina, “What Ifs”\n\nKelsea Ballerini, “Legends”\n\nLuke Combs, “When It Rains It Pours”\n\nThomas Rhett, “Marry Me”\n\nMale Video of the Year\n\nBest video by a male artist; awarded to the artist\n\nBlake Shelton, “I’ll Name The Dogs”\n\nDustin Lynch, “Small Town Boy”\n\nJason Aldean, “You Make It Easy”\n\nJon Pardi, “Heartache On The Dance Floor”\n\nLuke Bryan, “Light It Up”\n\nThomas Rhett, “Marry Me”\n\nFemale Video of the Year\n\nBest video by a female artist; awarded to the artist\n\nCarly Pearce, “Every Little Thing”\n\nCarrie Underwood feat. Ludacris, “The Champion”\n\nKelsea Ballerini, “Legends”\n\nLauren Alaina, “Doin’ Fine”\n\nMaren Morris, “I Could Use A Love Song”\n\nMiranda Lambert, “Tin Man” From 2017 ACM Awards\n\nDuo Video of the Year\n\nBest video by a duo; awarded to the artists\n\nBig & Rich, “California”\n\nBrothers Osborne, “It Ain’t My Fault”\n\nDan + Shay, “Tequila”\n\nFlorida Georgia Line, “Smooth”\n\nHigh Valley, “She’s With Me”\n\nTim McGraw & Faith Hill, “Speak To A Girl”\n\nGroup Video of the Year\n\nBest video by a group; awarded to the artists\n\nLady Antebellum, “You Look Good”\n\nLANco, “Greatest Love Story”\n\nLittle Big Town, “When Someone Stops Loving You”\n\nMidland, “Make A Little”\n\nOld Dominion, “No Such Thing As A Broken Heart”\n\nRascal Flatts, “Yours If You Want It”\n\nZac Brown Band, “My Old Man”\n\nBreakthrough Video of the Year\n\nBest video from an artist’s major breakthrough album; awarded to the artist (male, female or group/duo)\n\nCarly Pearce, “Every Little Thing”\n\nDanielle Bradbery, “Sway”\n\nDevin Dawson, “All On Me”\n\nLANco, “Greatest Love Story”\n\nRussell Dickerson, “Yours”\n\nWalker Hayes, “You Broke Up With Me”\n\nCollaborative Video of the Year\n\nBest video from a collaboration; awarded to the artists\n\nBebe Rexha feat. Florida Georgia Line, “Meant To Be”\n\nCarrie Underwood feat. Ludacris, “The Champion”\n\nCole Swindell feat. Dierks Bentley, “Flatliner”\n\nJustin Timberlake feat. Chris Stapleton, “Say Something”\n\nKane Brown feat. Lauren Alaina, “What Ifs”\n\nThomas Rhett feat. Maren Morris, “Craving You”\n\nCMT Performance of the Year\n\nMusical performance on a television show, series or variety special on CMT; awarded to the artist (individual, group or duo)\n\nAndra Day, Common, Little Big Town, Lee Ann Womack and Danielle Bradbery, “Stand Up For Something” (From 2017 CMT Artists of the Year)\n\nBackstreet Boys and Florida Georgia Line, “Everybody” (From CMT Crossroads)\n\nCharles Kelley, Jason Aldean, Darius Rucker and Derek Trucks, “Midnight Rider” (From 2017 CMT Music Awards)\n\nEarth, Wind & Fire and Lady Antebellum, “September” (From CMT Crossroads)\n\nJason Aldean, Keith Urban, Chris Stapleton and Little Big Town, “I Won’t Back Down” (From 2017 CMT Artists of the Year)\n\nKeith Urban feat. Carrie Underwood, “The Fighter” (From 2017 CMT Music Awards)", "images": ["http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:650392?quality=0.8&format=jpg&width=480&height=270", "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:650392?width=1200&height=675&.jpg"], "top_img": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:650392?width=1200&height=675&.jpg", "keywords": [], "authors": ["Lauren Tingle"], "canonical_link": "http://www.cmt.com/news/1794445/jason-aldean-florida-georgia-line-and-carrie-underwood-are-top-nominees-for-2018-cmt-music-awards/", "title": "Jason Aldean, Florida Georgia Line and Carrie Underwood Are Top Nominees for 2018 CMT Music Awards", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0", "reporting": {"beacon_url": "http://mb.mtvnservices.com/data/collect/v1/mb.gif", "beacon_topic": "cmt.com"}, "ao": {"mgid": "mgid:wordpress:post:articles.cmt.com:1794445"}, "og": {"site_name": "CMT News", "title": "Jason Aldean, Florida Georgia Line and Carrie Underwood Are Top Nominees for 2018 CMT Music Awards", "url": "http://www.cmt.com/news/1794445/jason-aldean-florida-georgia-line-and-carrie-underwood-are-top-nominees-for-2018-cmt-music-awards/", "image": {"identifier": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:650392?width=1200&height=675&.jpg", "width": 1440, "height": 810}, "type": "article", "description": "Little Big Town will host the event live from Nashville on June 6 at 8 p.m. ET. Voting to determine the winners in each category is underway at CMT.com through 12:01 a.m. ET on June 4."}, "twitter": {"description": "Little Big Town will host the event live from Nashville on June 6 at 8 p.m. ET. Voting to determine the winners in each category is underway at CMT.com through 12:01 a.m. ET on June 4.", "title": "Jason Aldean, Florida Georgia Line and Carrie Underwood Are Top Nominees for 2018 CMT Music Awards", "image": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:650392?quality=0.8&format=jpg&width=500&height=375", "url": "http://www.cmt.com/news/1794445/jason-aldean-florida-georgia-line-and-carrie-underwood-are-top-nominees-for-2018-cmt-music-awards/", "card": "summary_large_image"}, "description": "Little Big Town Hosts the Show Live from Nashville on June 6 at 8 p.m. ET", "thumbnail": "http://cmt.mtvnimages.com/uri/mgid:file:http:shared:cmt.com/news/uploads/sites/3/2018/05/cmtma_logo_1920x1080-1525731728-300x169.jpg?quality=0.8&format=jpg"}, "movies": [], "publish_date": null, "source": "http://www.cmt.com", "summary": ""}