{"url": "https://deadline.com/2018/01/harvey-weinstein-rose-mcgowan-emails-jill-messick-ben-affleck-sexual-assault-1202274875/", "text": "While leaning on a boilerplate denial, disgraced film mogul Harvey Weinstein has for the most part kept quiet as dozens and dozens of women came forward to describe in detail a series of sexual assaults and harassment they said he perpetrated against them. But he has made an exception as Rose McGowan started her press tour to promote a new E! show and the publication of her book Brave.\n\nMcGowan has long maintained that Weinstein raped her, and has made her account of an assault at his hands at the Sundance Film Festival in 1997 a major part of the book. Weinstein’s lawyer, Ben Brafman, is disputing McGowan’s version of what happened in that hot tub being non-consensual, and what happened in its aftermath.\n\nRelated Story Harvey Weinstein Hit With New Sexual Battery Charge By L.A. District Attorney\n\nWeinstein’s lawyer has offered as evidence emails from McGowan’s former manager Jill Messick and Ben Affleck, latter of whom McGowan said she told of the assault moments after it happened, eliciting an angry response from the actor/director. Worth noting that Affleck’s email was sent to Weinstein on July 26, long before the New York Times and the New Yorker broke stories on the avalanche of actresses, assistants and others who claimed they were assaulted by Weinstein, who became a pariah overnight. Baring the emails solicited before either Messick or Affleck knew what was coming or even why Weinstein asked for them, is embarrassing for both Affleck and Messick. But we have long passed the point of decorum in this ongoing tawdry saga that has shaken Hollywood to its core.\n\nNo comment from Affleck, who on November 17 said he believed McGowan and supported her, when he appeared on the Today Show. Attempts to reach Messick (who later worked as an executive for Weinstein at TWC) were unavailing.\n\nAs for McGowan, she responded in characteristic unvarnished fashion in a tweet just now, with a spokesman telling Deadline there would be no further comment:\n\nFuck you you fucking douche bag loser from hell. You will burn. You will be an empty suit coffin. You go fall off the planet you fuck. #RoseArmy BREATHE FIRE let motherfucker but https://t.co/tJq4M5lwiH — rose mcgowan (@rosemcgowan) January 31, 2018\n\nWhat follows is the statement by Weinstein’s lawyer:\n\nBen Brafman: “As a general matter, Harvey Weinstein and his attorneys have refrained from publicly criticizing any of the women who have made allegations of sexual assault against Mr. Weinstein despite a wealth of evidence that would demonstrate the patent falsity of these claims. Watching the “performance” by Rose McGowan as she looks to promote her new book however, has made it impossible to remain quiet as she tries to smear Mr. Weinstein with a bold lie that is denied not only by Mr. Weinstein himself, but by at least two witnesses, including Ms. McGowan’s own Manager at the time who Ms. McGowan claims to have confided in the day after the alleged assault and an A-list actor Ben Affleck who Ms. McGowan claims to have also told about her encounter with Mr. Weinstein shortly after the incident she now describes as “rape”, but which in 1997 she described to her Manager as a “consensual” act of sex.\n\n“In an email to Mr. Weinstein regarding the encounter, Jill Messick says the following, “When we met up the following day, she hesitantly told me of her own accord that during the meeting that night before she had gotten into a hot tub with Mr. Weinstein. She was very clear about the fact that getting into that hot tub was something that she did consensually and that in hindsight it was also something that she regretted having done.”\n\n“Ben Affleck expressed the following in an email to Mr. Weinstein, “She never told me nor did I ever infer that she was attacked by anyone. Any accounts to the contrary are false. I have no knowledge about anything Rose did or claimed to have done.”", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pmcdeadline2.files.wordpress.com/2018/01/harvey-weinstein-rose-mcgowan.jpg?w=630", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F01%2Fharvey-weinstein-rose-mcgowan-emails-jill-messick-ben-affleck-sexual-assault-1202274875%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202274875&comment_count=231"], "top_img": "https://pmcdeadline2.files.wordpress.com/2018/01/harvey-weinstein-rose-mcgowan.jpg?w=630", "keywords": [], "authors": ["Mike Fleming Jr"], "canonical_link": "https://deadline.com/2018/01/harvey-weinstein-rose-mcgowan-emails-jill-messick-ben-affleck-sexual-assault-1202274875/", "title": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Deny Rose McGowan Claims", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Refute Rose McGowan Claims", "news_keywords": "Ben Affleck, Harassment, Harvey Weinstein, Jill Messick, Rose McGowan", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Deny Rose McGowan Claims", "url": "https://deadline.com/2018/01/harvey-weinstein-rose-mcgowan-emails-jill-messick-ben-affleck-sexual-assault-1202274875/", "description": "While leaning on a boilerplate denial, disgraced film mogul Harvey Weinstein has for the most part kept quiet as dozens and dozens of women came forward to describe in detail a series of sexual ass…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/01/harvey-weinstein-rose-mcgowan.jpg?w=630", "width": 630, "height": 423, "alt": "Harvey Weinstein Rose McGowan"}, "locale": "en_US"}, "article": {"published_time": "2018-01-31T02:35:22+00:00", "modified_time": "2018-01-31T05:03:08+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Deny Rose McGowan Claims"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/01/harvey-weinstein-rose-mcgowan.jpg?w=630", "alt": "Harvey Weinstein Rose McGowan"}, "card": "summary_large_image", "creator": "@DeadlineMike", "title": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Deny Rose McGowan Claims", "description": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Refute Rose McGowan Claims"}, "author": "Mike Fleming Jr", "content_type": "Article", "post_id": 1202274875, "title": "Harvey Weinstein Uses Emails From Jill Messick, Ben Affleck To Deny Rose McGowan Claims", "published_at": "2018-01-30 18:35:22", "image": "https://pmcdeadline2.files.wordpress.com/2018/01/harvey-weinstein-rose-mcgowan.jpg?w=296&h=166&crop=1", "comment_count": 231, "tags": "Rose McGowan", "topics": "TV", "body": "While leaning on a boilerplate denial, disgraced film mogul Harvey Weinstein has for the most part kept quiet as dozens and dozens of women came forward to describe in detail a series of sexual assaults and harassment they said he perpetrated against them. But he has made an exception as Rose McGowan started her press tour to promote a new E! show and the publication of her book Brave.\r\n\r\nMcGowan has long maintained that Weinstein raped her, and has made her account of an assault at his hands at the Sundance Film Festival in 1997 a major part of the book. Weinstein's lawyer, Ben Brafman, is disputing McGowan's version of what happened in that hot tub being non-consensual, and what happened in its aftermath.\r\n\r\nWeinstein's lawyer has offered as evidence emails from McGowan's former manager Jill Messick and Ben Affleck, latter of whom McGowan said she told of the assault moments after it happened, eliciting an angry response from the actor/director. Worth noting that Affleck's email was sent to Weinstein on July 26, long before the New York Times and the New Yorker broke stories on the avalanche of actresses, assistants and others who claimed they were assaulted by Weinstein, who became a pariah overnight. Baring the emails solicited before either Messick or Affleck knew what was coming or even why Weinstein asked for them, is embarrassing for both Affleck and Messick. But we have long passed the point of decorum in this ongoing tawdry saga that has shaken Hollywood to its core.\r\n\r\nNo comment from Affleck, who on November 17 said he believed McGowan and supported her, when he appeared on the Today Show. Attempts to reach Messick (who later worked as an executive for Weinstein at TWC) were unavailing.\r\n\r\nAs for McGowan, she responded in characteristic unvarnished fashion in a tweet just now, with a spokesman telling Deadline there would be no further comment:\r\n\r\nhttps://twitter.com/rosemcgowan/status/958530158755024896\r\n\r\nWhat follows is the statement by Weinstein's lawyer:\r\n\r\nBen Brafman: \"As a general matter, Harvey Weinstein and his attorneys have refrained from publicly criticizing any of the women who have made allegations of sexual assault against Mr. Weinstein despite a wealth of evidence that would demonstrate the patent falsity of these claims. Watching the \"performance\" by Rose McGowan as she looks to promote her new book however, has made it impossible to remain quiet as she tries to smear Mr. Weinstein with a bold lie that is denied not only by Mr. Weinstein himself, but by at least two witnesses, including Ms. McGowan's own Manager at the time who Ms. McGowan claims to have confided in the day after the alleged assault and an A-list actor Ben Affleck who Ms. McGowan claims to have also told about her encounter with Mr. Weinstein shortly after the incident she now describes as \"rape\", but which in 1997 she described to her Manager as a \"consensual\" act of sex.\r\n\r\n\"In an email to Mr. Weinstein regarding the encounter, Jill Messick says the following, “When we met up the following day, she hesitantly told me of her own accord that during the meeting that night before she had gotten into a hot tub with Mr. Weinstein. She was very clear about the fact that getting into that hot tub was something that she did consensually and that in hindsight it was also something that she regretted having done.”\r\n\r\n\"Ben Affleck expressed the following in an email to Mr. Weinstein, “She never told me nor did I ever infer that she was attacked by anyone. Any accounts to the contrary are false. I have no knowledge about anything Rose did or claimed to have done.”", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1517366122.0, "source": "https://deadline.com", "summary": ""}