{"url": "time.com/5233865/chrissy-teigen-john-legend-relationship-timeline/", "text": "Thanks to their abundant talents, hilarious online personas and adorable kids, Chrissy Teigen and John Legend have risen to the top of the Hollywood power couple ranks over the past few years.\n\nIn fact, it’s hard to imagine a world in which these two aren’t a main fixture on the celebrity scene. So with their second baby—a boy—born, let’s take a look back at some of the most memorable moments of these lovebirds’ 11-year relationship.\n\nHere’s everything you need to know about their famous romance.\n\nThe Music Video Meeting\n\nChrissy Teigen and John Legend first met on the set of Legend’s 2007 music video for “Stereo.” Teigen starred as Legend’s love interest in the video and later revealed that when the shoot was over, they went back to Legend’s hotel room, ate In-N-Out burgers and hooked up.\n\n“We did the music video, we were together for like 12 hours,” she told Wendy Williams in 2014. “We spent the entire day together, me in my underwear and him in a full suit, and I went to go say goodbye to him, to his hotel and we didn’t ever say goodbye that night.”\n\nHowever, the pair didn’t officially get together until some months later, with Legend heading out on tour shortly after their first encounter.\n\n“I let him be himself for a while,” Teigen told Cosmopolitan in 2014. “The worst thing you can do is try to lock someone like that down early on, then have them think, ‘There’s so much more out there.’ I played it cool for a long time. Never once did I ask, ‘What are we?’ Marriage was never my goal, because I’ve never been very traditional. I was just happy to be with him.”\n\nThe Mini Break-Up\n\nAfter spending some time texting and talking on the phone, Teigen joined Legend on tour early in their relationship.\n\n“I fell in love with her over the phone because she is good with those 140 characters,” Legend joked to ET in 2016. “[At the beginning of our relationship] we were texting a lot, and I started to see her sense of humor. We would talk on the phone, and I started to fall in love with how engaging and witty and funny she is.”\n\nHowever, Legend apparently had a brief lapse of judgement and tried to break up with Teigen at some point in this time period.\n\n“I was on tour with him and he’d gotten sick,” Teigen later revealed to Cosmo. “He was feeling really bummed and stressed out. He was like, ‘I can’t be in a relationship right now.’ That lasted for one day. Literally, a day. I knew it came from a place other than us not working. It was the stress of him having to maybe cancel a show, and he had never been in a real relationship—or so he says now. I always joke, ‘Remember when you tried to break up with me?’ He’s like, ‘Yes, sorry. Big mistake.'”\n\nThe First Lake Como Trip\n\nThe couple took their first trip to Lake Como, Italy—the future site of their wedding and filming location for the “All of Me” music video—in 2007, according to Teigen. And it was during that getaway that she knew she wanted to spend the rest of her life with Legend.\n\n“Back to where it all began – Lake Como, Italy – first came here in 2007,” she captioned a July 2016 Instagram post. “A boat tour guide took us to a little spot on the lake and told us to make a wish. I asked for this to be the man I marry and have children with. I think John asked for the most perfect bite of cacio e pepe. Both came true, and here we are.”\n\nThe Proposal\n\nAfter around four years of dating, Legend proposed to Teigen during a Maldives vacation in December 2011. But things didn’t exactly go as planned.\n\nNot only did they get in a fight on the way to the airport, but TSA almost ruined the surprise before they could even get on their flight.\n\n“I remember we got into a very big fight in the car on the way to the airport because we had opened our presents beforehand, and he had only gotten me a cookbook and a Crock-Pot,” Teigen explained on an episode of FABLife that aired on the couple’s second wedding anniversary.\n\n“[The ring] was in my carry-on bag going through airport security, and security wanted to look through my bag and they wanted to look in that particular box,” Legend added during a 2013 appearance on Oprah’s Next Chapter. “And Chrissy was standing right next to me and I was, like, ‘Oh, my God. I’ve hid it so well this whole time. Now as we’re just about to get to the Maldives she’s going to find out I have a ring in this box and it’s going to ruin the surprise and I’ll have to get on my knees in the airport.'”\n\nLuckily, everything turned out just fine in the end.\n\n“We get to the Maldives and he had planned this beautiful Christmas. He knows how much I love Christmas…And this waiter comes out with a silver dome for dessert…So he opens up the dome and a ton of arugula falls out and then I kind of fish in it…And I see the little box and then you know, your heart stops and you get so excited,” Teigen said. “There was no big grand speech or anything. I think it was just very lovely and sweet.”\n\n“All of Me”\n\nLegend debuted “All of Me”—a new song dedicated to his then-fiancée —during a June 2013 performance on Oprah’s Next Chapter. But that wasn’t Teigen’s first time hearing the emotional love ballad. In an interview with the Huffington Post a month earlier, she revealed that the song had brought her to tears when Legend originally played it for her.\n\n“I did cry when I heard it,” she said. “I’m emotional, but like I don’t really don’t cry at things like that so yeah, it was beautiful. And live it’s pretty unreal.”\n\nTeigen also starred alongside Legend in the music video for the song, which was shot in Lake Como leading up to their wedding and ends with actual footage from the romantic day.\n\nThe Wedding\n\nChrissy and John’s wedding took place on September 14, 2013 in Lake Como. But they legally tied the knot at an NYC courthouse a day before traveling to Italy.\n\n“We actually got married after going to a couple Fashion Week shows at Vera Wang, ironically who actually did my dress, but we got married at the courthouse right after,” Teigen told E! News. “We are dumb and didn’t realize that our Italian wedding would not be recognized unless we had a real ceremony in New York City. So Irina Shayk was our witness—the most beautiful woman on earth!”\n\nLuna Simone Stephens\n\nAfter opening up about their struggles with fertility during an episode of FABLife, Chrissy announced that she and John were expecting their first child on Oct. 12, 2015.\n\n“John and I are so happy to announce that we are pregnant :),” she captioned a post on Instagram. “As many of you know, we’ve been trying to have a baby for a while now. It hasn’t been easy, but we kept trying because we can’t wait to bring our first child into the world and grow our family. We’re so excited that it’s finally happening. Thank you for all your love and well wishes. I look forward to all the belly touching!”\n\nTeigen gave birth to their daughter, Luna Simone Stephens, on April 14, 2016. “To everyone asking, john is healing perfectly,” she joked on Twitter.\n\nThe couple both shared the first official photos of baby Luna on Instagram a few days later.\n\nLuna’s First Lake Como Trip\n\nIn July 2016, Chrissy and John took the then 3-month-old Luna to Italy for her first Lake Como trip.\n\n“Went back to the ‘all of me’ house with Luna,” Teigen captured an Instagram video of she and Legend recreating the scene from the music video when they stare at each other through the estate’s floor-length windows. “Lol 3 years later.”\n\nTeigen also shared an adorable shot of Luna living her best vacation life while hanging out in an armchair.\n\nBaby No. 2\n\nTeigen revealed she was pregnant with she and Legend’s second child in an adorable Instagram video that featured Luna telling the world there was a baby in her mom’s stomach.\n\nTeigen later revealed that they were expecting a boy, as the only embryo left from their IVF treatment was male.\n\nOn May 16, Teigen announced that baby No. 2 had arrived. However, as of Teigen’s February appearance on Ellen, the couple had yet to come up with a name.\n\n“Boy names are really tough and I don’t think he will even have a middle name because we can’t even come up with a first name,” she told DeGeneres.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Megan McCluskey at megan.mccluskey@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/03/meghan-markle-narrate-disney-film.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2020/04/Adam-Schesinger-Coronavirus.jpg?quality=85&w=500", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2018/04/chrissy-teigen-john-legend-relationship-timeline.jpg?quality=85&w=594&h=395&crop=1", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/04/chrissy-teigen-john-legend-relationship-timeline.jpg?quality=85&w=594&h=395&crop=1", "keywords": [], "authors": ["Megan Mccluskey"], "canonical_link": "https://time.com/5233865/chrissy-teigen-john-legend-relationship-timeline/", "title": "Chrissy Teigen and John Legend's Relationship: A Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "chrissy teigen, john legend, john legend chrissy teigen, twitter chrissy teigen, chrissy teigen baby, who is john legend wife, john legend last name, all of me, all of me john legend, john legend wife", "news_keywords": "chrissy teigen, john legend, john legend chrissy teigen, twitter chrissy teigen, chrissy teigen baby, who is john legend wife, john legend last name, all of me, all of me john legend, john legend wife", "description": "Chrissy Teigen and John Legend are one of Hollywood's most beloved couples. Here's everything we know about their 11-year relationship.", "og": {"title": "A History of Chrissy Teigen and John Legend's Relationship", "type": "article", "site_name": "Time", "url": "https://time.com/5233865/chrissy-teigen-john-legend-relationship-timeline/", "description": "The complete guide from music video to married", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/04/chrissy-teigen-john-legend-relationship-timeline.jpg?quality=85&w=594&h=395&crop=1", "width": 594, "height": 395}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5233865/chrissy-teigen-john-legend-relationship-timeline/", "description": "Chrissy Teigen and John Legend are one of Hollywood's most beloved couples. Here's everything we know about their 11-year relationship.", "media": "https://api.time.com/wp-content/uploads/2018/04/chrissy-teigen-john-legend-relationship-timeline.jpg?quality=85&w=594&h=395&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5233865/chrissy-teigen-john-legend-relationship-timeline/", "title": "A History of Chrissy Teigen and John Legend's Relationship", "description": "The complete guide from music video to married", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/04/chrissy-teigen-john-legend-relationship-timeline.jpg?quality=85&w=594&h=395&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": ["https://www.youtube.com/embed/ZGC2Zk2fIOc", "https://www.youtube.com/embed/k55sMcKYPH4", "https://www.youtube.com/embed/450p7goxZqg"], "publish_date": null, "source": "http://time.com", "summary": ""}