{"url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/04/13/outrage-after-survivor-outing-why-havent-you-told-anyone-here-youre-transgender/", "text": "Perhaps most cold — and memorable — was the masterfully manipulative “Jonny Fairplay,” who faked his grandmother’s death (she was actually at home “watching Jerry Springer”) so his tribe mates would pity him and forfeit the coveted family visit challenge.\n\nAD\n\nBut even “Survivor” die-hards, who invest an hour a week cheering on backstabbing adults, have their limits.\n\nAnd on Wednesday night’s episode, during tribal council, those limits were tested when one contestant, an openly gay man and former news anchor, apparently outed another contestant as transgender in a cutting, last-ditch effort to stay in the game.\n\nAD\n\nPlayer Jeff Varner insinuated that Zeke Smith, known for his storytelling abilities and zany button-up shirts, was deceptive for choosing not to disclose his gender identity to the rest of the tribe.\n\nThe backlash from viewers at home was swift, and across social media outraged LGBT advocates condemned Varner’s actions as “low,” an “act of violence” and the “worst thing anybody has done in 34 seasons.”\n\nAD\n\nBut skeptics also wondered: If outing Smith on national television was so hurtful, why didn’t the “Survivor” producers choose to leave the reveal on the cutting room floor?\n\nThe answer, it seems, is as nuanced as the way the outing unfolded during Wednesday night’s episode.\n\nFirst, let’s set the scene, keeping in mind that the “reality” in “reality show” is a term of art. The show is filmed far in advance of broadcast and sees only an edited and condensed version of all that actually unfolds before the camera.\n\nAD\n\nIn “Survivor,” each episode builds to the tension-filled tribal council, where contestants trudge through the darkness to some kind of hut, carrying firelit tiki torches meant to signify their life in the game.\n\nAD\n\nThey are greeted in this hut, where there is more fire, by long-running host and producer Jeff Probst.\n\nProbst usually takes the contestants’ temperature, asking probing questions about their mood, who is angry at whom that week and which contestants think they’re heading home. The tension and drama is often orchestrated.\n\nIn Wednesday’s episode, Varner immediately volunteered that he was on the chopping block, then alluded there was widespread “deception” among the group.\n\n“There is deception here,” Varner said. “Deception on levels, Jeff, that these guys don’t even understand.”\n\nHe added: “There’s more.”\n\nAD\n\n“Continue,” Probst urged in the cool tone of an arbiter who had moderated tribal councils for 17 years.\n\nAD\n\nVarner turned to his left, where Smith was sitting quietly, and said: “Why haven’t you told anyone you’re transgender?”\n\nTheir five fellow tribe members — two men and three women — were visibly shocked and quickly came to Smith’s defense, scolding Varner for choosing to out someone without their consent.\n\nThey shouted and Smith’s gender history was “personal” and had “nothing to do with the game.”\n\n“Jeff, I’m arguing for my life,” Varner retorted. “I feel like I have to throw everything at the wall.”\n\n“By outing somebody?” contestant Tai Trang, who is gay, fired back.\n\nEven Probst appeared rattled and told Varner it was a “giant leap of logic” to argue that Smith was being deceptive.\n\nAD\n\nSeveral of the contestants cried in a seemingly authentic display of empathy for Smith.\n\nAD\n\nAnd as his tribe members remained defiant and united against his dirty trick, Varner began to slowly realize the grave mistake he had made.\n\nEventually, the camera fixed on Smith, who with surprising poise, considering what appeared to have transpired, explained that his friends and family at home knew he was transgender, but that he chose not to make it a part of his “Survivor” narrative because he wanted to be known for his prowess as simply a player, not the show’s first transgender player.\n\nSmith explained that revealing his gender history to people since he transitioned often “sort of overwhelms everything else they know about you.”\n\nAD\n\nVarner began to profusely apologize. Smith said he hoped it all “would lead to a greater good.”\n\nAnd in what appears to be a “Survivor” first, Probst didn’t even call for a formal tribal council vote — where contestants walk to a confessional-like room in the hut, write their vote on a paper ballot and often offer colorful commentary on their choice.\n\nAD\n\nInstead, Probst just called for a raise of hands, and Varner was unanimously eliminated.\n\n“I’m so sorry,” Varner said, crying, as he hugged Smith.\n\n“It’s okay man,” Smith said. “It’s going to be okay.”\n\nThen Varner grabbed his tiki torch and exited the hut.\n\nIt was a dramatic 14 minute segment that left many viewers aghast.\n\nAD\n\nThe motto is Outwit, Outplay, Outlast not plain Out!!! #SurvivorGameChangers #survivor — Randy Sangha (@RandySangha) April 13, 2017\n\nJohnny Fairplay faking his grandma's death to get ahead on survivor is nothing compared to Varners move tonight #SurvivorGameChangers — Kaitlyn Stelzer (@KaitlynStelzer) April 13, 2017\n\nBut soon after the episode aired, a coordinated public relations campaign between the CBS showrunners, Probst, Varner, Smith and representatives from GLAAD, the LGBT advocacy organization, deployed.\n\n“Zeke Smith, and transgender people like him, are not deceiving anyone by being their authentic selves, and it is dangerous and unacceptable to out a transgender person,” Nick Adams, director of GLAAD’s Transgender Media Program, said in a statement. “It is heartening, however, to see the strong support for Zeke from the other people in his tribe. Moments like this prove that when people from all walks of life get to know a transgender person, they accept us for who we are.”\n\nAD\n\nThe media program worked with show producers and Smith for months before the episode to make sure the reveal was handled with sensitivity, namely ensuring that Smith had an opportunity to tell his own story on his terms, according to the statement.\n\nAD\n\nLate Wednesday, the Hollywood Reporter published a lengthy guest column from Smith. He described his transitioning process, how competing on “Survivor” helped him prove his “manliness” to himself and what it felt like to be outed on national television.\n\nSmith wrote:\n\n” … In calling me deceptive, Varner invoked one of the most odious stereotypes of transgender people, a stereotype that is often used as an excuse for violence and even murder. In proclaiming “Zeke is not the guy you think he is” and that “there is deception on levels y’all don’t understand,” Varner is saying that I’m not really a man and that simply living as my authentic self is a nefarious trick. In reality, by being Zeke the dude, I am being my most honest self — as is every other transgender person going about their daily lives.”\n\nIn a Q&A with Probst that also dropped late Wednesday, the show host told Entertainment Weekly that Smith’s transgender identity was never going to be a part of the show unless Smith made it one.\n\nProbst said:\n\nZeke was fully aware someone might suspect it or bring it up and he said, “I will deal with it as it arises.” And I have to add it was never a question of Zeke being worried his story would come out. Zeke is a massive Survivor fan and his point with us was very clear — he wanted to be seen as a Survivor player. Not the first transgender Survivor player. I really respected that distinction and I understood it.\n\nVarner also released a statement on social media after the episode aired, again apologizing for his actions and calling it “the worst decision of my life.”\n\nAD\n\n“Let me be clear, outing someone is assault,” Varner said. “It robs a strong, courageous person of their power and protection and opens them up to discrimination and danger. It can leave scars that haunt for a lifetime. I am profoundly sorry.”\n\nIn a tweet, Probst said the showrunners hoped something greater would come from the controversy.\n\n“Our hope is that this emotional and powerful conversation will bring awareness and understand,” he said, “and ultimately effect change.”", "images": ["https://www.washingtonpost.com/resizer/puTNYmO2V4lD72BckoJaMK2A4lk=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FGVOZ2B6BMZDJAJYGPQ3C4SICU.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/05aaf951-1996-4c85-81cd-049d7a6fd7ca.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/puTNYmO2V4lD72BckoJaMK2A4lk=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FGVOZ2B6BMZDJAJYGPQ3C4SICU.jpg", "keywords": [], "authors": ["Katie Mettler", "Reporter Covering Breaking News"], "canonical_link": "https://www.washingtonpost.com/news/morning-mix/wp/2017/04/13/outrage-after-survivor-outing-why-havent-you-told-anyone-here-youre-transgender/", "title": "Outrage after ‘Survivor’ outing: ‘Why haven’t you told anyone here you’re transgender?’", "meta_data": {"description": "It was a dramatic 14-minute segment that left many viewers aghast.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/04/13/outrage-after-survivor-outing-why-havent-you-told-anyone-here-youre-transgender/", "image": "https://www.washingtonpost.com/resizer/puTNYmO2V4lD72BckoJaMK2A4lk=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FGVOZ2B6BMZDJAJYGPQ3C4SICU.jpg", "title": "Outrage after ‘Survivor’ outing: ‘Why haven’t you told anyone here you’re transgender?’", "description": "It was a dramatic 14-minute segment that left many viewers aghast."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Outrage after ‘Survivor’ outing: ‘Why haven’t you told anyone here you’re transgender?’", "description": "It was a dramatic 14-minute segment that left many viewers aghast."}, "last_updated_date": "2019-04-29T23:13:26.868Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1492012800.0, "source": "https://www.washingtonpost.com", "summary": ""}