{"url": "https://people.com/tv/kardashians-answer-tough-questions-media-training-session/", "text": "It’s hard to believe, but one of America’s most famous families was never officially media-trained.\n\nOn Sunday’s midseason finale of Keeping Up with the Kardashians, Kim convinced her mom and sisters to meet with a communications coach so that they could each figure out how to answer the questions they tend to avoid during interviews — and no stone was left unturned.\n\nGet push notifications with news, features and more.\n\nKourtney and Khloé Butt Heads\n\nThey document their workouts almost every day on Snapchat, but Kourtney, 38, and Khloé, 33, decided they wanted to produce something a little more professional for their fans: a full workout video. The idea quickly took on a life of its own, and somehow, the two agreed to start a fitness line together as well — forcing Khloé to put her already-in-the-works athleisure line with her clothing company, Good American, on hold.\n\nBut Kourtney struggled to commit fully to the massive responsibility of the project, and soon enough, her sister had had it.\n\n“Kourtney and I are a nothing brand right now. We’re just not seeing eye-to-eye,” she said. “Sometimes I love having a partner, but when you’re just not in sync, it’s a little frustrating.”\n\nEventually, she realized she wasn’t going to get what she needed from Kourtney, who herself acknowledged that the two sisters have different priorities.\n\n“I was hoping you and I could do something together, but it doesn’t really seem like this train is moving at the speed I want it to move,” said Khloé. “For now, I think it’s smart for me to move forward with Good American in doing this kind of stuff.”\n\n“Go for it, girl,” said Kourtney, admitting that she’s not “the fastest-moving person” and tends to “procrastinate.”\n\n“You’re like Nate Dogg — you’re only good for hooks,” quipped Khloé. “You can’t sell your own album.”\n\nMedia Training\n\nAfter undergoing her own media training, Kim realized how beneficial it was and asked her family to give it a shot.\n\n“I just think it’ll be a really good idea to get prepared and have everyone face our fears,” she said. “I don’t think you could ever be too prepared. It was so helpful for me just to be aware of the things I’m saying — I don’t think the answer is to retreat. You have be prepared that some day, you might be asked a question you don’t want to answer.”\n\nAfter some coaxing, Kim convinced Kris, Kourtney, Khloé and Kendall to meet with two communications coaches from Clarity media training. (Kylie, whom multiple sources have confirmed to PEOPLE is pregnant and expecting her first child with rapper Travis Scott next year, has been largely absent from this season thus far and did not partake in the training.)\n\nThroughout the session, the family underwent an on-camera mock group interview followed by individual ones, then re-watched the tapes to critique their answers — and suffice it to say that the coaches did not hold back. After opening their line of questioning by bringing up Kim’s sex tape, they went on to cover everything from Kendall’s Pepsi commercial to Rob’s explosive behavior, forcing Kris and her daughters to answer some of the most uncomfortable and personal questions about their family.\n\nFor the momager, that focused almost entirely on her strained — and today, essentially nonexistent — relationship with her ex-spouse Caitlyn Jenner. After Kendall, 22, admitted that she and her sister Kylie, 20, “kept a lot” of their father’s secrets over the years from Kris, she confessed that that was what hurt her the most.\n\n“There were things that happened that they didn’t tell me, because they were told not to,” said Kris, 62, in reference to any signs that Caitlyn (formerly known as Bruce) wanted to be a woman.\n\n“I’m not resentful about it, it just makes me really sad,” she continued. “Because I’m a protective mom — I would do anything for my kids. And had I known some of the things they were experiencing … it just broke my heart, hearing some of that stuff.” (Kris also said her ex’s tell-all memoir was “full of inaccuracies.”)\n\nWhen asked about her protest-themed Pepsi commercial — which the company pulled days after it was accused of trivializing the Black Lives Matter movement following its release in April — Kendall prickled, but acknowledged it was definitely a “huge learning lesson.”\n\n“There were a lot of things that were blinding me,” she said. “A lot of people I had faith in, a lot of things I had trust in.”\n\nAfter commenting on her defensive body language, the coaches suggested Kendall tackle the topic more directly in the future.\n\n“I have learned so much over the last four years of my career,” she said. “I’ve learned that the only person that’s ever going to truly, truly look out for me is me. It is really hard work.”\n\nThe coaches decided to ask Khloé about her reclusive brother Rob, 30, who is known to make headlines for his contentious relationship with his ex Blac Chyna, 29.\n\n“Rob definitely wears his heart on his sleeve, and when he loves he loves really, really hard,” she responded. “With that being said, when he gets hurt, he hurts really, really badly.”\n\nFor Kourtney, the coaches focused their questions on her ex Scott Disick — and the mother of three flailed helplessly, giving up altogether at one point and laughing nervously. But ultimately, all of the women walked away from the experience with newfound confidence and knowledge.\n\n“Well, that wasn’t fun,” admitted Kris. “But I truly do see some value in this whole process. We live our entire lives in front of the whole world and questions like this are going to keep coming for as long as I can foresee, so it really does help to have some skills under my belt to convey what I’m trying to say.”\n\nKendall and Kylie Drama\n\nMeanwhile, Kendall and her noticeably absent sister Kylie were going through some issues of their own. The two were trying to arrange a birthday party for a friend and wound up at each other’s throats over their “two completely different ideas.”\n\nIn the middle of the media training session, Kendall stormed out, driven almost to tears over the situation — but within hours, they had worked it out off-camera.\n\n“It’s crazy because Kylie and I, there’s always something,” said Kendall. “We fought, and then she literally came over that night and helped me make a whole dinner for me and 20 of my friends. So we end up butting heads sometimes, but at the end of the day, she’s my sister.”\n\nThe spotlight on Kris\n\nTo cap off the episode, Kris decided to put her media training to use for an interview conducted by basketball legend Kareem Abdul-Jabbar for The Hollywood Reporter, answering questions spanning everything from the “sexual nature” of her daughters’ photos (“I’m very comfortable if they’re comfortable”) to their influence on plastic surgery trends (“If something … makes you feel better about yourself, then why not? I think everybody has to make their own choice.”).\n\nHer final word of advice for anyone squirming away from certain topics? “Expect the tough questions” — and have “some sense of preparedness” so that you feel confident in answering them.\n\nKeeping Up with the Kardashians returns Jan. 7 at 9 p.m. ET on E!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkhloe-kardashian.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkhloe-kardashian.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/kardashians-answer-tough-questions-media-training-session/", "title": "Kim Kardashian & Sisters Undergo Intense Media Training on KUWTK", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Caitlyn Jenner,Keeping Up with the Kardashians,Kendall Jenner,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,Kylie Jenner,News,Rob Kardashian,TV", "news_keywords": "Caitlyn Jenner,Keeping Up with the Kardashians,Kendall Jenner,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,Kylie Jenner,News,Rob Kardashian,TV", "description": "Keeping Up with the Kardashians returns Jan. 7 at 9 p.m. ET on E!", "og": {"title": "Kim's Sex Tape! Caitlyn's Book! Kardashian Family Answers Tough Questions During Intense Media Training", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kardashians-answer-tough-questions-media-training-session/", "description": "It’s hard to believe, but one of America’s most famous families was never officially media-trained. On Sunday’s midseason finale of&nbsp;Keeping Up with the Kardashians, Kim&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkhloe-kardashian.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/kardashians-answer-tough-questions-media-training-session/", "description": "Keeping Up with the Kardashians returns Jan. 7 at 9 p.m. ET on E!", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkhloe-kardashian.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kardashians-answer-tough-questions-media-training-session/", "title": "Kim's Sex Tape! Caitlyn's Book! Kardashian Family Answers Tough Questions During Intense Media Training", "description": "Keeping Up with the Kardashians returns Jan. 7 at 9 p.m. ET on E!", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkhloe-kardashian.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}