{"url": "https://www.elitedaily.com/p/kanye-west-got-rid-of-his-phone-so-thats-why-hes-not-returning-your-texts-9099306", "text": "It’s no secret that Kanye West is causing a swarm of media speculation about his strange behavior. From calling slavery “a choice” to openly supporting President Trump, West has sparked just as much outrage as there is intrigue surrounding his celebrity. Basically, it’s been two weeks of wild behavior and lots of questions. And now there’s even more of that to contemplate. So, what’s happened now? Well, Kanye West got rid of his phone, so he’s not answering anyone’s text messages.\n\nThe news of West’s phone abandonment comes from West himself via is Twitter account. West took to the social media platform to explain his lack of communication to friends, family, and business associates:\n\nFor anyone who’s tried to text or call me in the past 2 weeks I got rid of that phone so I could focus on these albums\n\nWest is currently in Jackson Hole, Wyoming, trying to focus all his energy on his upcoming album. So, basically, he has ditched mobile communication in favor of cultivating his inherent talent and musical genius. Can’t blame him for drowning out the noise to focus on the music. He’s clearly committed to his craft.\n\nHere’s a look at what West tweeted about getting rid of his cell phone:\n\nWest’s wife, Kim Kardashian, reportedly joined the 40-year-old rapper in Wyoming in early May 2018. At the time, a source close to the family told People that Kardashian was content to join him as he worked:\n\nKim happily joined Kanye in Jackson Hole. She wants to be supportive so he can finish his album. The album has caused Kanye a lot of stress. He is a perfectionist and wants the music to be amazing.\n\nWest’s dedication to his music is truly admirable and it’s great that Kardashian is there to support him in this effort. A lot of fantastic and interesting music is sure to come out of it.\n\nIn addition to supporting West’s creative pursuits, Kardashian is also reportedly worried about his health, especially in light of his recent erratic and scandalous behavior. According to People’s source, Kardashian headed out to Wyoming to make sure he’s in a good place:\n\nKim is absolutely concerned about Kanye. She likes being in Jackson Hole so she can keep an eye on his health. She wants to make sure he eats and sleeps enough. She doesn’t want him to push himself beyond his limits. She wants a healthy Kanye.\n\nHow sweet and supportive of her! It’s so obvious how much West and Kardashian love and value each other. You have to give them credit for always having each other’s backs, even in light health issues and media scandals.\n\nHopefully, none of that will overshadow West's music. On Tuesday, May 15, West previewed some of his new music on Twitter. The rapper posted a video of himself sitting at a keyboard while a beat plays in the background. Here’s a look at what West is working on:\n\nIn the video, you can also see what seem to be sample tracklists on whiteboards above his head and to his right. These tracklists look to be part of multiple projects that he’s working on at the moment. Among the tracks listed are “Extacy”, “Wouldn’t Leave”, “Reborn”, and “4th Dimension.”\n\nSo, it’s pretty clear that West is hard at work and making all that studio magic happen. Dedicated fans of the rapper are waiting anxiously to see what types of tracks he’s going to drop. If the preview on Twitter is a hint of what’s to come, then his fans are definitely going to be happy!", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/11/4361046b-c022-4e61-931f-cfafa2baaa60-getty-1153778216.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/5/15/ac797990-cf78-4ca5-b690-797c8db864e4-getty-486015758.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/15/ac797990-cf78-4ca5-b690-797c8db864e4-getty-486015758.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/11/cf0dcb3d-21fa-43da-aa1e-dcac3adb7bb1-getty-1042108086.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/959d0fb8-50a7-4da1-aaa8-a61da167c25a-getty-1181284940.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/15/ac797990-cf78-4ca5-b690-797c8db864e4-getty-486015758.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kanye-west-got-rid-of-his-phone-so-thats-why-hes-not-returning-your-texts-9099306", "title": "Kanye West Got Rid Of His Phone, So That's Why He's Not Returning Your Texts", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kanye-west-got-rid-of-his-phone-so-thats-why-hes-not-returning-your-texts-9099306", "type": "article", "title": "Kanye West Isn’t Returning Text Messages & The Reason Why Is Surprisingly Clever", "description": "It’s no secret that Kanye West is causing a swarm of media speculation about his strange behavior. From calling slavery “a choice” to openly supporting President Trump, West has sparked just as much outrage as there is intrigue surrounding his…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/15/ac797990-cf78-4ca5-b690-797c8db864e4-getty-486015758.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "It’s no secret that Kanye West is causing a swarm of media speculation about his strange behavior. From calling slavery “a choice” to openly supporting President Trump, West has sparked just as much outrage as there is intrigue surrounding his…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}