{"url": "http://www.pewforum.org/2008/09/19/pastors-to-protest-irs-rules-on-political-advocacy/", "text": "On Sept. 28, pastors from 20 states will give politically based sermons from the pulpit as part of a protest organized by the Alliance Defense Fund, a conservative legal-advocacy group. The protest will challenge an Internal Revenue Code restriction that limits the political activities of charitable organizations – including churches and other religious groups – that are exempt from taxation. According to the Internal Revenue Code, religious groups may lose their tax-exempt status if they officially endorse a political candidate. The ADF says that if its protest leads the Internal Revenue Service to penalize houses of worship for their pastors’ political advocacy, ADF will bring a lawsuit challenging the constitutionality of these penalties.\n\nTo discuss the ADF protest and IRS restrictions on the political activities of religious organizations, the Pew Forum turns to church-state scholar Robert W. Tuttle.\n\nFeaturing:\n\nRobert W. Tuttle, David R. and Sherry Kirschner Berz Research Professor of Law and Religion, The George Washington University Law School\n\nInterviewer:\n\nJesse Merriam, Research Associate, Pew Forum on Religion & Public Life\n\nQuestion & Answer\n\nBefore 1954, section 501(c)(3) of the Internal Revenue Code permitted nonprofit organizations to endorse political candidates while remaining exempt from federal income tax. But in 1954, the U.S. Congress amended this part of the code to say that a charitable organization loses its tax-exempt status if it intervenes in a political campaign. Why did Congress add this restriction?\n\nMany members of Congress, including Lyndon B. Johnson, a senator at the time, voted for the amendment because they were concerned about nonprofit organizations funding their opponents’ political campaigns. But because there was little debate over the amendment or how it would influence churches, we don’t know precisely why Congress enacted the amendment.\n\nNotably, the 1954 amendment is often misunderstood as limiting political advocacy, but the rule’s actual purpose has to do with political contributions. Under the Internal Revenue Code, there are many different kinds of tax-exempt organizations. For example, section 527 of the code exempts all sorts of political organizations from federal income tax. But organizations that qualify as charitable groups under section 501(c)(3) are special because donors to these organizations may deduct their contributions from their own federal income taxes. So a primary purpose of the 1954 amendment was to prevent donors from deducting political contributions from their taxes.\n\nWhy is the Alliance Defense Fund so interested in eliminating this restriction?\n\nThe ADF opposes the restriction because the rule requires churches to choose between actively participating in political campaigns, on the one hand, and accepting tax-deductible donations, on the other hand. As a result, if a church wanted to promote or oppose a particular political candidate, the church would be required to create a separate organization to do so. Although this separate organization would be exempt from taxes, contributors could not take a tax deduction for their donations to this organization.\n\nThe ADF believes that this restriction takes political activity out of the heart of a congregation’s life. For example, a congregation that wanted to retain its tax exemption under section 501(c)(3) could not include political activity in its worship service unless the worship service was financed by a separate organization. Moreover, ADF believes that because IRS officials must examine the content of sermons or other religious messages to determine whether a church has improperly engaged in political advocacy, IRS enforcement of the rule entangles the government in the operation of religious organizations.\n\nIf ADF’s protest leads to a constitutional challenge in court, what arguments might ADF make?\n\nThe ADF would almost certainly argue that the 1954 amendment violates the First Amendment’s Free Exercise Clause, which prohibits the government from regulating religious organizations more strictly than their secular counterparts. Similarly, ADF will likely argue that the amendment violates the Religious Freedom Restoration Act, a 1993 federal statute that prohibits the federal government from imposing a “substantial burden” on a religious organization unless the government demonstrates that it must impose that burden to achieve a “compelling government interest.” The ADF will also likely argue that the restriction violates the First Amendment’s Free Speech Clause, which prohibits the government from regulating speech on the basis of its content. Finally, ADF might also claim that IRS enforcement of the 1954 amendment violates the First Amendment’s Establishment Clause by requiring the IRS to scrutinize sermons or other religious messages, thus excessively entangling government and religion.\n\nHow might the government defend the 1954 amendment?\n\nThe government will likely defend the 1954 amendment by arguing that the rule does not violate congregations’ rights under the Free Exercise Clause or RFRA because the restriction treats religious organizations just like other charitable and educational organizations. Moreover, the government would say, the restriction does not bar congregations from participating in campaigns; it only prohibits donors from making tax-deductible political contributions. Likewise, the government will likely argue, the restriction does not violate the Free Speech Clause because the restriction does not prohibit the congregations from making political statements; it only bars them from using tax-deductible donations to do so. Finally, in response to ADF’s Establishment Clause argument, the government will likely argue that there is no excessive entanglement of government and religion because the IRS does not need to evaluate a sermon’s theological merit to determine whether the sermon promotes a politician.\n\nHow do you think a court might evaluate these arguments?\n\nIt’s always difficult to predict how a court might decide a hypothetical case because a court’s decision often turns on a case’s particular facts. But past decisions give us a pretty good basis for guessing that a court would uphold the constitutionality of the 1954 amendment’s application to religious organizations.\n\nThe most relevant case on this issue is Branch Ministries v. Rossotti (2000), a case in which the U.S. Court of Appeals for the District of Columbia Circuit upheld the 1954 amendment’s constitutionality. That case arose after a congregation advocated for a presidential candidate, prompting the IRS to revoke the congregation’s 501(c)(3) status. The congregation claimed that this revocation violated the Free Exercise and Free Speech clauses. But the D.C. Circuit Court rejected both of these arguments on the ground that the congregation was still free to engage in political speech and activities.\n\nThe D.C. Circuit Court’s reasoning in this case relied heavily on two U.S. Supreme Court decisions, Regan v. Taxation with Representation (1983) and Jimmy Swaggart Ministries v. Board of Equalization (1990). In Regan, the high court held that 501(c)(3) status provides a monetary benefit to certain tax-exempt organizations because it allows their donors to take a tax deduction for contributions. Therefore, the court concluded, the 1954 amendment does not violate the Free Speech Clause because the amendment merely withholds a speech subsidy rather than restricts speech.\n\nSimilarly, in the Jimmy Swaggart Ministries case, the Supreme Court held that a tax imposed equally on all organizations does not violate the Free Exercise Clause. The court held that although the tax may increase the cost of religious activity, the tax does not impose a “substantial burden” on religious exercise because it does not prevent religious organizations from engaging in religious activity.\n\nIf ADF challenged the 1954 amendment’s application to religious organizations, I think it is very likely that a court would agree with the Branch Ministries decision and reject the challenge. In the years since the Regan and Jimmy Swaggart Ministries cases, there have been a number of important changes in free exercise and free speech law, but those changes have only reinforced these decisions.\n\nIf the 1954 amendment was lifted for religious organizations but not for other charitable organizations, would that raise a problem under the First Amendment’s Establishment Clause, which generally prohibits the government from favoring religion over nonreligion?\n\nThis is an even more difficult and complicated question than the previous one, and I could see a court going either way. On the one hand, courts usually uphold legislative efforts to relieve burdens on religious activity, even if those burdens are not so “substantial” as to require an exemption under RFRA. So if Congress lifted the 1954 amendment, courts might be inclined to defer to the legislative judgment that the amendment should not apply to religious organizations.\n\nOn the other hand, courts might be more skeptical of such a religion-specific exemption from the 1954 amendment because this exemption would potentially provide religious organizations with a very significant benefit not extended to other charitable organizations. Indeed, if the 1954 amendment applied to all 501(c)(3) organizations except religious ones, those who contribute to congregations engaged in political activity would be allowed to take an income tax deduction for their contributions – thus offsetting some of the actual cost of the donation – while contributors to other political organizations would not be allowed to deduct their contributions. In other words, the government would effectively subsidize the political activities of congregations.\n\nSuch a subsidy raises serious questions under the Establishment Clause. In Texas Monthly v. Bullock (1989), the Supreme Court held that a Texas law that exempted religious publications but not other publications from sales taxes violated the Establishment Clause because the exemption effectively subsidized religious publications. The court explained that although the government may alleviate special burdens on religious activity, the sales tax did not present such a special burden because it applied equally to both religious and nonreligious publications.\n\nSo the Texas Monthly decision strongly suggests that lifting the 1954 amendment only for religious organizations would violate the Establishment Clause. But that doesn’t mean that the present Supreme Court would definitely find a constitutional violation if Congress lifted the restriction only for religious organizations. Indeed, because the present court has a much narrower view of the Establishment Clause than the court that decided Texas Monthly, the present court might be willing to overrule the Texas Monthly decision. The ADF is no doubt hoping that this will be the case. As I said, it’s very difficult to guess how a court would decide this issue.", "images": ["https://www.pewforum.org/wp-content/plugins/pew-refactor-shim/assets/img/logos/desktop-header.svg", "https://www.pewforum.org/wp-content/plugins/pew-refactor-shim/assets/img/logos/desktop-footer.svg", "https://www.pewforum.org/wp-content/uploads/sites/7/2018/10/religion.png"], "top_img": "https://www.pewforum.org/wp-content/uploads/sites/7/2018/10/religion.png", "keywords": [], "authors": [], "canonical_link": "https://www.pewforum.org/2008/09/19/pastors-to-protest-irs-rules-on-political-advocacy/", "title": "Pastors To Protest IRS Rules on Political Advocacy", "meta_data": {"viewport": "width=device-width", "date": 20080919, "description": "On Sept. 28, pastors from 20 states will give politically based sermons from the pulpit as part of a protest organized by the Alliance Defense Fund, a", "robots": "NOODP", "og": {"locale": "en_US", "type": "article", "title": "Pastors To Protest IRS Rules on Political Advocacy", "description": "On Sept. 28, pastors from 20 states will give politically based sermons from the pulpit as part of a protest organized by the Alliance Defense Fund, a", "url": "https://www.pewforum.org/2008/09/19/pastors-to-protest-irs-rules-on-political-advocacy/", "site_name": "Pew Research Center's Religion & Public Life Project", "updated_time": "2019-12-31T04:40:14+00:00", "image": {"identifier": "https://www.pewforum.org/wp-content/uploads/sites/7/2018/10/religion.png", "secure_url": "https://www.pewforum.org/wp-content/uploads/sites/7/2018/10/religion.png", "width": 640, "height": 321}}, "article": {"publisher": "https://www.facebook.com/pewresearch", "section": "Publications", "published_time": "2008-09-19T04:00:00+00:00", "modified_time": "2019-12-31T04:40:14+00:00"}, "twitter": {"card": "summary_large_image", "description": "On Sept. 28, pastors from 20 states will give politically based sermons from the pulpit as part of a protest organized by the Alliance Defense Fund, a", "title": "Pastors To Protest IRS Rules on Political Advocacy", "site": "@PewReligion", "image": "https://www.pewforum.org/wp-content/uploads/sites/7/2018/10/religion.png", "creator": "@PewReligion"}, "generator": "WordPress 5.4", "topics": "Religion and U.S. Politics", "formats": "Transcript", "share": {"appID": {"fb": 686513701498767}}, "wp-parsely_version": "2.0", "theme-color": "#4FA9CE", "msapplication-TileImage": "https://www.pewforum.org/wp-content/uploads/sites/7/2018/09/favicon_128x128.png?w=128"}, "movies": [], "publish_date": 1221753600.0, "source": "http://www.pewforum.org", "summary": ""}