{"url": "https://abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734", "text": "'Dancing With the Stars' season 25 celebrity cast: Frankie Muniz, Barbara Corcoran, Nick Lachey and more The cast also includes a Paralympic swimmer, an NBA star and a WWE star.\n\n'Dancing With the Stars' celebs Frankie Muniz, Barbara Corcoran, Nick Lachey and more dish on the competition\n\n'Dancing With the Stars' celebs Frankie Muniz, Barbara Corcoran, Nick Lachey and more dish on the competition\n\n\u0097 -- Actor Frankie Muniz, \"Shark Tank\" star Barbara Corcoran, former Paralympic athlete Victoria Arlen and WWE superstar Nikki Bella will be battling one another on the dance floor during season 25 of \"Dancing With the Stars.\"\n\nDebbie Gibson, who sang her way to fame in the 1980s, will also compete this season, alongside Nick Lachey, who made his name in the '90s as the frontman of 98 Degrees.\n\nLachey, now a father of three, and pro dancer Peta Murgatroyd will face off against his wife, Vanessa Lachey, who is paired with Maks Chmerkovskiy, Murgatroyd's husband.\n\n\"I've actually moved out of the house for the duration of the season, just to keep the peace,\" Nick Lachey joked.\n\nThe celebrity cast members and their partners were announced live on \"Good Morning America\" today.\n\nSeason 25 of \"DWTS\" will feature Drew Scott, Sasha Pieterse, Barbara Corcoran, Derek Fisher, Victoria Arlen, Jordan Fisher, Nikki Bella, Terrell Owens, Frankie Muniz, Debbie Gibson, Lindsey Stirling, Vanessa Lachey and Nick Lachey.\n\nReigning Mirror Ball champ Rashad Jennings surprised the cast this morning by blending in with the \"GMA\" studio audience.\n\n\"A piece of advice I would give to everybody is, don't take yourself too serious,\" he said. \"Have fun. It's an experience of a lifetime. And don't let the judges get under your skin. Embrace it all, really. Truly embrace it all.\"\n\nThe new season premieres on Monday, Sept. 18, 2017, at 8 p.m. ET on ABC. See the full list of celebrities and pro pairings below.\n\nDrew Scott with Emma Slater\n\nDrew Scott will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nScott was the first celebrity cast member to be announced for the upcoming season of \"DWTS.\" He and his twin brother have charmed viewers for years with their long-running reality HGTV show, \"Property Brothers,\" which follows them as they flip houses. Scott will be competing with last season's pro Mirror Ball winner, Slater.\n\nDrew Scott and pro dancer Emma Slater will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nSasha Pieterse and Gleb Savchenko\n\nSasha Pieterse will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nPieterse skyrocketed to fame after starring in the hit Freeform series \"Pretty Little Liars.\" In addition to acting, she has released original music. She will be dancing with Gleb Savchenko.\n\n\"It's so fun to be doing something different,\" she said. \"This is really a new chapter.\"\n\nSasha Pieterse and pro dancer Gleb Savchenko will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nBarbara Corcoran and Keo Motsepe\n\nBarbara Corcoran will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nCorcoran is a businesswoman and investor who rose to fame as one of the Sharks on the hit TV show \"Shark Tank.\" She is a co-founder of the Corcoran Group, a New York City–based real estate agency. She will partner with Keo Motsepe, who has competed in five seasons of the show but has yet to win the competition.\n\nBarbara Corcoran and pro dancer Keo Motsepe will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nDerek Fisher and Sharna Burgess\n\nDerek Fisher will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nA former National Basketball Association star and coach, Fisher will be dancing with Sharna Burgess. He played for the Los Angeles Lakers, the Golden State Warriors, the Utah Jazz, the Oklahoma City Thunder and the Dallas Mavericks during his long career in the NBA. More recently, he has worked as a coach for the New York Knicks.\n\n\"This is amazing, the opportunity to be a part of such a great franchise and show,\" he said.\n\nDerek Fisher and pro dancer Sharna Burgess will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nVictoria Arlen and Val Chmerkovskiy\n\nVictoria Arlen will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nArlen is a former Paralympic swimmer who won three silver medals and one gold medal during the London 2012 Paralympic Games. She developed two rare medical conditions that resulted in her losing her ability to speak, walk and move, according to her website. She says she was forced to relearn even these most basic skills. More recently she has worked as a sportscaster for ESPN. She will compete with fan-favorite pro dancer Val Chmerkovskiy.\n\n\"This means everything,\" she said. \"It's a dream come true, and it's something I always wanted to do but never really knew if I was ever going to have that chance, just given circumstances and everything. I can honestly say, though, that learning to walk was easier than learning to ballroom dance.\"\n\nVictoria Arlen and pro dancer Val Chmerkovskiy will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nJordan Fisher and Lindsay Arnold\n\nJordan Fisher will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nFisher, 23, is a singer and actor who rose to fame for his role in the Broadway smash hit \"Hamilton.\" He will compete with Lindsay Arnold, who was the competition's runner-up pro last season.\n\n\"I started in gymnastics. That's really what sparked the whole thing,\" he said.\n\nJordan Fisher and pro dancer Lindsay Arnold will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nNikki Bella and Artem Chigvintsev\n\nNikki Bella to appear on the new season of \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nBella, whose birth name is Stephanie Nicole Garcia-Colace, is a wildly popular professional wrestler. She made headlines this year when she became engaged to fellow wrestler John Cena, who proposed to her during WrestleMania 33. She will partner with Artem Chigvintsev, who won in his first season on the British version of the show but has not taken the Mirror Ball in five seasons of competing on the U.S. version.\n\nNikki Bella and pro dancer Artem Chigvintsev will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nTerrell Owens and Cheryl Burke\n\nTerrell Owens to appear on the new season of \"Dancing With The Stars.\" Heidi Gutman/ABC\n\nTerrell Owens, 43, is a six-time Pro Bowler who played for the San Francisco 49ers, Dallas Cowboys and Philadelphia Eagles, among others, during his 15-year NFL career. He has modeled and written children's and fitness books in his post-football career.\n\nHe will dance with Cheryl Burke, a fan favorite and two-time \"DWTS\" champion who is returning to the show for season 25.\n\nTerrell Owens and pro dancer Cheryl Burke will dance together on the new season of \"Dancing With The Stars.\" Heidi Gutman/ABC\n\nFrankie Muniz and Witney Carson\n\nFrankie Muniz will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nMuniz is an Emmy Award–nominated actor who rose to fame for his starring role on the hit TV show \"Malcolm in the Middle.\" In addition to acting, he has dabbled in racecar driving, competing in the Champ Car Atlantic Championship. He will dance with Witney Carson, who won the Mirror Ball trophy during season 19 of the show with Alfonso Ribeiro.\n\nFrankie Muniz and pro dancer Witney Carson will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nDebbie Gibson and Alan Bersten\n\nDebbie Gibson will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nGibson is an actress and a singer-songwriter who has sold more than 16 million albums worldwide. She is also a Guinness world record holder for being the youngest female to write, produce and perform a No. 1 song, according to her website. She has more recently starred in Broadway musicals, including \"Les Miserables,\" as Eponine. She will partner with Alan Bersten, who was a troupe member and filled in for Maksim Chmerkovskiy during season 24 when Chmerkovskiy was sidelined with a calf injury. This is Bersten's first season competing full time as a pro.\n\n\"I've been dealing with some health challenges with Lyme disease, and that's part of the reason why I kind of came out of hiding,\" she said. \"It's kind of a big, bold way to do it ... Alan has been so nurturing, so supportive.\"\n\nDebbie Gibson and pro dancer Alan Bersten will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nLindsey Stirling and Mark Ballas\n\nLindsey Stirling to appear on the new season of \"Dancing With The Stars.\" Heidi Gutman/ABC\n\nStirling is an internationally famous violinist who is well known for her unique violin-driven electronic music. She has been sharing her music on her YouTube channel since 2007 and has over 9 million subscribers. Her most recent album, \"Brave Enough,\" debuted at No. 5 on Billboard's album chart. She will be partnering with Mark Ballas, who is back this season after taking a two-season hiatus.\n\nLindsey Stirling and pro dancer Mark Ballas will dance together on the new season of \"Dancing With The Stars.\" Heidi Gutman/ABC\n\nNick Lachey and Peta Murgatroyd\n\nNick Lachey will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nNick Lachey, who will be paired with Peta Murgatroyd, heard from his brother Drew Lachey, the celeb winner of season 2.\n\n\"I sure hope you beat Vanessa, because if you don't, she is never going to let you hear the end of it,\" Drew Lachey joked.\n\nNick Lachey and pro dancer Peta Murgatroyd will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nVanessa Lachey and Maks Chmerkovskiy\n\nVanessa Lachey will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nVanessa Lachey, who won Miss Teen USA in 1998, is a television personality who hosted the wildly popular \"Total Request Live\" on MTV. She also worked as a correspondent for \"Entertainment Tonight.\" She will dance with Maks Chmerkovskiy.\n\nVanessa Lachey and pro dancer Maksim Chmerkovskiy will compete for the mirror ball title on the new season \"Dancing With The Stars.\" Craig Sjodin/ABC\n\nThe official \"Dancing With the Stars\" Fantasy League, an online game that allows players to predict which couple will win, launches for the upcoming season on abc.com/dfl.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s.abcnews.com/images/Entertainment/lachey-corcoran-muniz-dwts-abc-jef-170901_16x9_992.jpg"], "top_img": "https://s.abcnews.com/images/Entertainment/lachey-corcoran-muniz-dwts-abc-jef-170901_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "September", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734", "title": "'Dancing With the Stars' season 25 celebrity cast: Frankie Muniz, Barbara Corcoran, Nick Lachey and more", "meta_data": {"description": "The cast also includes a Paralympic swimmer, an NBA star and a WWE star.", "keywords": "Dancing With the Stars, reveal, cast, celebrity", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'Dancing With the Stars' season 25 celebrity cast: Frankie Muniz, Barbara Corcoran, Nick Lachey and more", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734", "title": "'Dancing With the Stars' season 25 celebrity cast: Frankie Muniz, Barbara Corcoran, Nick Lachey and more", "description": "The cast also includes a Paralympic swimmer, an NBA star and a WWE star.", "image": "https://s.abcnews.com/images/Entertainment/lachey-corcoran-muniz-dwts-abc-jef-170901_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2017-09-07T14:05:58Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,49603734", "ipad": "abcnewsipad://link/story,49603734", "googleplay": "https://abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'Dancing With the Stars' season 25 celebrity cast: Frankie Muniz, Barbara Corcoran, Nick Lachey and more", "description": "The cast also includes a Paralympic swimmer, an NBA star and a WWE star.", "url": "https://abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/lachey-corcoran-muniz-dwts-abc-jef-170901_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,49603734", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,49603734", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/dancing-stars-season-25-celebrity-cast-frankie-muniz/story?id=49603734"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}