{"url": "https://www.loudersound.com/features/the-10-most-american-songs-ever", "text": "Here’s the thing, there’s basically two Americas. One half loves Kid Rock. I mean, they cannot get enough of the guy. The other half thinks the half that likes Kid Rock are fucking morons. That’s basically it.\n\nLast time America had an election, Kid Rock won. So it's four years of barbecues and California dreamin’ and Waffle House dust-ups and pick-up trucks blasting Lynyrd Skynyrd.\n\nSure man, we did hire a total screwball to run the country – and he may or may not hasten the apocalypse – but let us not condemn the US for its picadillos, let us instead give thanks for some of the fantastic shit we invented, like bubblegum and Evel Knievel and action movies… and rock’n’roll.\n\nDavid Lee Roth - Yankee Rose\n\nIn 1986 David Lee Roth found himself untethered from Van Halen and to celebrate, he wrote a song about wanting to have sex with America. The whole country. All at once. And that’s pretty much what he did. Say what you will, but we really nailed it when we created Diamond Dave.\n\nNight Ranger - You Can Still Rock In America\n\nThis one always gets short shrift since it’s on the same album as the undeniably amazing power-ballad Sister Christian, but good ol’ Ranger perfectly captured the plastic-fantastic mall-crawling faux-fun of mainstream 80’s America on this one. Night Ranger was never cool, and neither is this song, really, but not everybody was cool back then. The squares needed a rock anthem too. This is it.\n\nDon Mclean - American Pie\n\nAn eight minute epic that begins with the plane crash that killed Buddy Holly and ends with the entire history of rock’n’roll, Mclean’s masterful ode to America’s greatest contribution to culture is so good nobody can ever turn it off until it’s over. Seriously, there are people sitting in their driveways right now letting dinner get cold, waiting for the ‘Did you write the book of love?’ part.\n\nGrand Funk - We’re An American Band\n\n1973 was probably the greatest year in rock’n’roll history and this was pretty much the greatest hit of 1973 so, I mean, you do the math. The beauty of this song is that it doesn’t matter who or where you are when you hear it, it just draws you in. You’re part of it. For its duration, we’re all an American band, man.\n\nJohn Cougar Mellencamp - Pink Houses\n\nThis dude hasn’t been working class since 1980 at least, but Mellencamp understands small-town America better than just about anybody, and this enduring gem from his breakout ‘83 album Uh-Huh remains an inspiration for any Americans optimistic enough to think things’ll get better someday. It could happen.\n\nTom Petty - American Girl\n\nHardly jingoistic, American Girl is a rambunctious little ditty about a mid 70’s girl with wanderlust. Hell, it might even be a tragedy (“God it’s so painful when something that’s so close is still so far out of reach”), but Tom Petty’s plaintive power-pop has always struck a deep rootsy chord with US audiences, and this one just feels like home.\n\nBruce Springsteen - Born in the USA\n\nWe all know it’s actually a protest song. You don’t have to keep telling us that. We still like it. Born in the USA endures because it is entirely emblematic of the country it’s singing about: conflicted, wounded, weary, worried and ragged, but still standing. Our modern national anthem, basically.\n\nLyrnyrd Skynyrd - Freebird\n\nThere is a fairly reasonable argument that “real” America can’t be found in our crowded, bustling cities on the coasts, that the authentic, true-blue, soaring eagle America is boiling away down south. And if you wanna know what that sounds like, it sounds like fucking Freebird. People request it at every gig regardless of the band on stage for a reason. It’s magnificent. And this bird you cannot change.\n\nNeil Young - Rockin’ in the Free World\n\nAs with Springsteen’s tune, this is another America-centric song that wraps troubled verses around a soaring chorus. And once again, we’re aware. You get three hundred million people together, a couple of them are going to put babies in garbage cans. But the rest of us? We’re still - that’s right - rockin’ in the free world.\n\nKid Rock - American Bad Ass\n\nListen, I get it. I’m part of that other half I mentioned in the intro. Out of all the terrible ideas the USA has had, rap-metal has to be in the top five. But Kid Rock is so quintessentially American that he basically bleeds Coca-Cola. And this song is so quintessentially American that it needs to tell you it’s American over and over. I mean, love it or leave it, man.", "images": ["https://www.facebook.com/tr?id=230404523817416&ev=PageView&noscript=1", "https://www.loudersound.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/NqW3SnyAZXHxqwHgWAdxTR-320-80.jpg", "https://cdn.mos.cms.futurecdn.net/PeeLCYtpQNunfWCmjTdKKM-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/PeeLCYtpQNunfWCmjTdKKM-1200-80.jpg", "keywords": [], "authors": ["Classic Rock"], "canonical_link": "https://www.loudersound.com/features/the-10-most-american-songs-ever", "title": "The 10 most American songs ever", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2019-07-04T12:38:02+00:00", "description": "10 classic tracks celebrating America in all its star-spangled and/or faded glory", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://www.loudersound.com/174424/apple-touch-icon.png", "og": {"title": "The 10 most American songs ever", "site_name": "Classic Rock Magazine", "url": "https://www.loudersound.com/features/the-10-most-american-songs-ever", "description": "10 classic tracks celebrating America in all its star-spangled and/or faded glory", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/PeeLCYtpQNunfWCmjTdKKM-1200-80.jpg", "width": 1200}, "type": "article"}, "article": {"publisher": "https://www.facebook.com/ClassicRockMagazine/", "author": "https://www.facebook.com/ClassicRockMagazine/"}, "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@ClassicRockMag", "title": "The 10 most American songs ever", "description": "10 classic tracks celebrating America in all its star-spangled and/or faded glory", "creator": "@ClassicRockMag", "image": "https://cdn.mos.cms.futurecdn.net/PeeLCYtpQNunfWCmjTdKKM-1200-80.jpg", "account_id": 15560223}, "google-site-verification": "8YCPNbGtymiD3k0H7gqevgAN-a7OhH_3GVeHZgw5byA", "p": {"domain_verify": "7746212808ec7b4a7e3417956fbc5b73"}, "taboola": {"url": "https://www.loudersound.com/features/the-10-most-american-songs-ever"}, "botify-site-verification": "85bzcw0uLuAVyGMWlaV6vnzlAf5gmw8t", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "parsely-type": "post", "parsely-post-id": "3x5HA9XauPPXzxjFVe2Ln3", "parsely-pub-date": "2019-07-04T12:38:02Z", "parsely-title": "The 10 most American songs ever", "parsely-link": "https://www.loudersound.com/features/the-10-most-american-songs-ever", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/NqW3SnyAZXHxqwHgWAdxTR.jpg", "parsely-section": "Music listening", "parsely-tags": "Category: Music listening,Category: Feature,American,Classic Rock,channel_music_listening,type_listicle,serversidehawk", "parsely-author": "Sleazegrinder"}, "movies": [], "publish_date": 1562243882.0, "source": "https://www.loudersound.com", "summary": ""}