{"url": "www.rollingstone.com/movies/movie-news/casey-affleck-sexual-harassment-allegations-interview-709732/", "text": "Casey Affleck talked about the #MeToo movement in the actor’s first interview since resurfaced sexual harassment allegations forced him to avoid participating in this year’s Oscars.\n\nSpeaking to the Associated Press, Affleck discussed his decision to break tradition and skip this year’s Academy Awards, where – as winner of Best Actor for Manchester by the Sea the previous year – he was scheduled to present Best Actress; past winners Jodie Foster and Jennifer Lawrence instead presented the award.\n\n“I think it was the right thing to do just given everything that was going on in our culture at the moment,” Affleck said. “And having two incredible women go present the best actress award felt like the right thing.”\n\nThe allegations against Affleck stem from a pair of sexual harassment civil lawsuits he faced while director of the 2010 Joaquin Phoenix quasi-documentary I’m Still Here. Although Affleck denied any wrongdoing, he ultimately settled both lawsuits.\n\nThe allegations of the harassment resurfaced during Affleck’s Best Actor campaign for Manchester by the Sea; following his Oscars win, actress Brie Larson and others refused to clap for Affleck.\n\n“First of all, that I was ever involved in a conflict that resulted in a lawsuit is something that I really regret. I wish I had found a way to resolve things in a different way. I hate that. I had never had any complaints like that made about me before in my life and it was really embarrassing and I didn’t know how to handle it and I didn’t agree with everything, the way I was being described, and the things that were said about me, but I wanted to try to make it right, so we made it right in the way that was asked at the time. And we all agreed to just try to put it behind us and move on with our lives, which I think we deserve to do, and I want to respect them as they’ve respected me and my privacy. And that’s that,” Affleck told the AP.\n\n“Over the past couple of years, I’ve been listening a lot to this conversation, this public conversation, and learned a lot. I kind of moved from a place of being defensive to one of a more mature point of view, trying to find my own culpability. And once I did that I discovered there was a lot to learn. I was a boss. I was one of the producers on the set. This movie was [shot in 2008, 2009] and I was one of the producers. And it was a crazy mockumentary, [a] very unconventional movie. The cast was the crew and the crew was kind of the cast and it was an unprofessional environment and, you know, the buck had to stop with me being one of the producers and I have to accept responsibility for that and that was a mistake.”\n\nWith Affleck back as director on his upcoming film Light of My Life, he also talked about how the #MeToo and Time’s Up campaigns have impacted Hollywood.\n\n“I think bigger picture, in this business women have been underrepresented and underpaid and objectified and diminished and humiliated and belittled in a bazillion ways and just generally had a mountain of grief thrown at them forever. And no one was really making too much of a fuss about it, myself included, until a few women with the kind of courage and wisdom to stand up and say, ‘You know what? Enough is enough,'” Affleck said.\n\n“Those are the people who are kind of leading this conversation and should be leading the conversation. And I know just enough to know that in general I need to keep my mouth shut and listen and try to figure out what’s going on and be a supporter and a follower in the little, teeny tiny ways that I can.”\n\nAffleck next appears in The Old Man & The Gun, which also marks Robert Redford’s final acting role.", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmovies%2Fmovie-news%2Fcasey-affleck-sexual-harassment-allegations-interview-709732%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=709732", "https://www.rollingstone.com/wp-content/uploads/2018/08/shutterstock_9786374b.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/08/shutterstock_9786374b.jpg", "keywords": [], "authors": ["Daniel Kreps", "Daniel Kreps'S Most Recent Stories", "Hear John Legend S Uplifting New Pop Song", "Bigger Love", "See Black Crowes", "Robinson Brothers Perform Three-Song Acoustic Set", "Willie Nelson To Host", "Come", "Toke It", "Livestream Variety Show On"], "canonical_link": "https://www.rollingstone.com/movies/movie-news/casey-affleck-sexual-harassment-allegations-interview-709732/", "title": "Casey Affleck Talks #MeToo, Harassment Allegations in New Interview", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Casey Affleck talked about the #MeToo movement in his first interview since sexual harassment allegations forced him to skip the Oscars.", "news_keywords": "Casey Affleck, sexual harassment", "og": {"type": "article", "title": "Casey Affleck Talks #MeToo, Harassment Allegations in New Interview", "url": "https://www.rollingstone.com/movies/movie-news/casey-affleck-sexual-harassment-allegations-interview-709732/", "description": "“In this business, women have been underrepresented and underpaid and objectified and diminished and humiliated and belittled in a bazillion ways,” actor says", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/08/shutterstock_9786374b.jpg", "width": 1024, "height": 693, "alt": "Casey Affleck poses for a portrait at the Four Seasons Hotel in Los Angeles to promote his upcoming film \"The Old Man & The Gun,\" in theaters on Sept. 28Casey Affleck Portrait Session, Los Angeles, USA - 03 Aug 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-08-10T13:00:19+00:00", "modified_time": "2018-08-10T13:04:48+00:00"}, "twitter": {"text": {"title": "Casey Affleck Talks #MeToo, Harassment Allegations in New Interview"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/08/shutterstock_9786374b.jpg?w=1024", "alt": "Casey Affleck poses for a portrait at the Four Seasons Hotel in Los Angeles to promote his upcoming film \"The Old Man & The Gun,\" in theaters on Sept. 28Casey Affleck Portrait Session, Los Angeles, USA - 03 Aug 2018"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Casey Affleck Talks #MeToo, Harassment Allegations in New Interview", "description": "Casey Affleck talked about the #MeToo movement in his first interview since sexual harassment allegations forced him to skip the Oscars."}, "generator": "WordPress 5.4", "author": "Daniel Kreps", "content_type": "Article", "post_id": 709732, "title": "Casey Affleck Talks #MeToo, Harassment Allegations in New Interview", "published_at": "2018-08-10 09:00:19", "image": "https://www.rollingstone.com/wp-content/uploads/2018/08/shutterstock_9786374b.jpg?w=1024", "comment_count": 0, "tags": "sexual harassment", "topics": "Movies", "body": "Casey Affleck talked about the #MeToo movement in the actor's first interview since resurfaced sexual harassment allegations forced him to avoid participating in this year's Oscars.\r\n\r\nSpeaking to the Associated Press, Affleck discussed his decision to break tradition and skip this year's Academy Awards, where – as winner of Best Actor for Manchester by the Sea the previous year – he was scheduled to present Best Actress; past winners Jodie Foster and Jennifer Lawrence instead presented the award.\r\n\r\n\"I think it was the right thing to do just given everything that was going on in our culture at the moment,\" Affleck said. \"And having two incredible women go present the best actress award felt like the right thing.\"\r\n\r\nThe allegations against Affleck stem from a pair of sexual harassment civil lawsuits he faced while director of the 2010 Joaquin Phoenix quasi-documentary I'm Still Here. Although Affleck denied any wrongdoing, he ultimately settled both lawsuits.\r\n\r\nThe allegations of the harassment resurfaced during Affleck's Best Actor campaign for Manchester by the Sea; following his Oscars win, actress Brie Larson and others refused to clap for Affleck.\r\n\r\n\"First of all, that I was ever involved in a conflict that resulted in a lawsuit is something that I really regret. I wish I had found a way to resolve things in a different way. I hate that. I had never had any complaints like that made about me before in my life and it was really embarrassing and I didn’t know how to handle it and I didn’t agree with everything, the way I was being described, and the things that were said about me, but I wanted to try to make it right, so we made it right in the way that was asked at the time. And we all agreed to just try to put it behind us and move on with our lives, which I think we deserve to do, and I want to respect them as they’ve respected me and my privacy. And that’s that,\" Affleck told the AP.\r\n\r\n\"Over the past couple of years, I’ve been listening a lot to this conversation, this public conversation, and learned a lot. I kind of moved from a place of being defensive to one of a more mature point of view, trying to find my own culpability. And once I did that I discovered there was a lot to learn. I was a boss. I was one of the producers on the set. This movie was [shot in 2008, 2009] and I was one of the producers. And it was a crazy mockumentary, [a] very unconventional movie. The cast was the crew and the crew was kind of the cast and it was an unprofessional environment and, you know, the buck had to stop with me being one of the producers and I have to accept responsibility for that and that was a mistake.\"\r\n\r\nWith Affleck back as director on his upcoming film Light of My Life, he also talked about how the #MeToo and Time's Up campaigns have impacted Hollywood.\r\n\r\n\"I think bigger picture, in this business women have been underrepresented and underpaid and objectified and diminished and humiliated and belittled in a bazillion ways and just generally had a mountain of grief thrown at them forever. And no one was really making too much of a fuss about it, myself included, until a few women with the kind of courage and wisdom to stand up and say, 'You know what? Enough is enough,'\" Affleck said.\r\n\r\n\"Those are the people who are kind of leading this conversation and should be leading the conversation. And I know just enough to know that in general I need to keep my mouth shut and listen and try to figure out what’s going on and be a supporter and a follower in the little, teeny tiny ways that I can.\"\r\n\r\nAffleck next appears in The Old Man & The Gun, which also marks Robert Redford's final acting role.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1533906019.0, "source": "http://www.rollingstone.com", "summary": ""}