{"url": "https://web.archive.org/web/20161007194921/https://www.dni.gov/index.php/newsroom/press-releases/215-press-releases-2016/1423-joint-dhs-odni-election-security-statement", "text": "Joint DHS and ODNI Election Security Statement\n\nFriday, October 07, 2016\n\nDIRECTOR OF NATIONAL INTELLIGENCE\n\nWASHINGTON, DC 20511\n\n\n\nOctober 07, 2016\n\n\n\nJoint Statement from the Department of Homeland Security\n\nand Office of the Director of National Intelligence\n\non Election Security\n\nThe U.S. Intelligence Community (USIC) is confident that the Russian Government directed the recent compromises of e-mails from US persons and institutions, including from US political organizations. The recent disclosures of alleged hacked e-mails on sites like DCLeaks.com and WikiLeaks and by the Guccifer 2.0 online persona are consistent with the methods and motivations of Russian-directed efforts. These thefts and disclosures are intended to interfere with the US election process. Such activity is not new to Moscow—the Russians have used similar tactics and techniques across Europe and Eurasia, for example, to influence public opinion there. We believe, based on the scope and sensitivity of these efforts, that only Russia's senior-most officials could have authorized these activities.Some states have also recently seen scanning and probing of their election-related systems, which in most cases originated from servers operated by a Russian company. However, we are not now in a position to attribute this activity to the Russian Government. The USIC and the Department of Homeland Security (DHS) assess that it would be extremely difficult for someone, including a nation-state actor, to alter actual ballot counts or election results by cyber attack or intrusion. This assessment is based on the decentralized nature of our election system in this country and the number of protections state and local election officials have in place. States ensure that voting machines are not connected to the Internet, and there are numerous checks and balances as well as extensive oversight at multiple levels built into our election process.Nevertheless, DHS continues to urge state and local election officials to be vigilant and seek cybersecurity assistance from DHS. A number of states have already done so. DHS is providing several services to state and local election officials to assist in their cybersecurity. These services include cyber “hygiene” scans of Internet-facing systems, risk and vulnerability assessments, information sharing about cyber incidents, and best practices for securing voter registration databases and addressing potential cyber threats. DHS has convened an Election Infrastructure Cybersecurity Working Group with experts across all levels of government to raise awareness of cybersecurity risks potentially affecting election infrastructure and the elections process. Secretary Johnson and DHS officials are working directly with the National Association of Secretaries of State to offer assistance, share information, and provide additional resources to state and local officials.", "images": ["https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/flickr_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/linkedin_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/email_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/twitter_off_2.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/components/com_phocapdf/assets/images/pdf_button.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/tumblr_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/podcast_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/facebook_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/scribd_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/templates/dni_newsroom/images/email_subscribe.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/templates/dni_newsroom/favicon.ico", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/rss_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/youtube_off.png", "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/files/images/socialmediabuttons/google_off.png"], "top_img": "https://web.archive.org/web/20161007194921im_/https://www.dni.gov/templates/dni_newsroom/favicon.ico", "keywords": [], "authors": ["Jaclyn Tran"], "canonical_link": "", "title": "Joint DHS and ODNI Election Security Statement", "meta_data": {"keywords": "DNI, ODNI, Office, Director, National, Intelligence, DNI.gov", "author": "Jaclyn Tran", "generator": "Joomla! - Open Source Content Management"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}