{"url": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)", "text": "American television series\n\nThe Handmaid's Tale is an American dystopian tragedy web television series created by Bruce Miller, based on the 1985 novel of the same name by Canadian author, Margaret Atwood. The series was ordered by the streaming service Hulu as a straight-to-series order of 10 episodes, for which production began in late 2016. The plot features a dystopia following a Second American Civil War wherein a totalitarian society subjects fertile women, called \"Handmaids\", into child-bearing slavery.[6]\n\nThe first three episodes of the series premiered on April 26, 2017; the subsequent seven episodes were released every Wednesday. In May 2017, the series was renewed for a second season; which premiered on April 25, 2018.[7] In May 2018, Hulu renewed the series for a third season,[8] which premiered on June 5, 2019.[9] In July 2019, the series was renewed for a fourth season.[10] In September 2019, it was announced that Hulu and MGM were developing a sequel series, to be based on Atwood's 2019 novel The Testaments.[11]\n\nThe Handmaid's Tale's first season won eight Primetime Emmy Awards from thirteen nominations, including Outstanding Drama Series. It is the first show produced by Hulu to win a major award as well as the first series on a streaming service to win an Emmy for Outstanding Series.[12] It also won the Golden Globe Award for Best Television Series – Drama. Elisabeth Moss was also awarded the Golden Globe for Best Actress.\n\nPlot [ edit ]\n\nIn a world where fertility rates have collapsed as a result of sexually transmitted diseases and environmental pollution,[13] the totalitarian, theonomic government of Gilead establishes rule in the former United States in the aftermath of a civil war.[14][15][16] Society is organized by power-hungry leaders along with a new, militarized, hierarchical regime of fanaticism and newly created social classes, in which women are brutally subjugated. By law, women in Gilead are forced to work in very limited roles, including some as natal slaves, and they are not allowed to own property, handle money, or read.[16]\n\nWorldwide infertility has led to the enslavement of fertile women in Gilead determined by the new regime to be \"fallen women\", citing an extremist interpretation of the Biblical account of Bilhah; these women often include those who have entered multiple marriages (termed \"adulteresses\"), single or unmarried mothers, lesbians (homosexuals being termed \"gender traitors\"), non-Christians, adherents of Christian denominations other than the Sons of Jacob, political dissidents and academics. These women, called Handmaids,[16] are assigned to the homes of the ruling elite, where they must submit to ritualized rape (referred to as \"the ceremony\") by their male masters (\"Commanders\") in the presence of their wives, in order to become impregnated and bear children for them. Handmaids are given names created by the addition of the prefix Of- to the first name of the man who owns them. When they are transferred, their names are changed accordingly.\n\nAlong with the Handmaids, much of society is now grouped into classes that dictate their freedoms and duties. Women are divided into a small range of social categories, each one signified by a plain dress in a specific color. Handmaids wear long red dresses, heavy brown boots and white coifs, with a larger white coif (known as \"wings\") to be worn outside, concealing them from public view and restricting their own vision. Marthas (who are housekeepers and cooks, named after the biblical figure) wear long, loose-fitting muted green garments and cover their hair with headwraps. The Wives of Commanders (who are expected to run their households beautifully) wear elegant, tailored dresses in blue and turquoise, cut in styles evoking the 1950s. They wear high heels, their hair is carefully coiffed, and they wear gloves and hats when outdoors.[17]\n\nEconowives, the lower-class women who still have minimal agency, wear shades of gray (a departure from the book in which Econowives wear clothing striped with the aforementioned colors). Female prisoners are called Unwomen and, wearing rags, are worked to death clearing toxic waste in the Colonies.\n\nAnother class of women, Aunts, who wear brown, train, oversee and discipline the Handmaids as well as organize \"particicutions” (public executions involving the coerced participation of Handmaids). They are the only class of women in Gilead permitted to read, albeit specifically to fulfill the administrative role of their caste. Jezebels, often former career professionals or academics unwilling or unable to accept any role in Gilead, are forced into prostitution in secret brothels catering to the elite ruling class as an alternative punishment to being executed or sent to the Colonies. They wear otherwise forbidden evening clothes, costumes, and lingerie from “before”.\n\nAmong the men of Gilead other than the Commanders, the Eyes are secret police watching over the general populace for signs of rebellion, Hunters track down people attempting to flee the country, Guardians are responsible for civilian policing and Economen are responsible for menial labor. Men, regardless of status or position, often wear black.\n\nJune Osborne, renamed Offred (Elisabeth Moss), is the Handmaid assigned to the home of the Gileadan Commander Fred Waterford (Joseph Fiennes) and his wife Serena Joy (Yvonne Strahovski). The Waterfords, key players in the formation and rise of Gilead, struggle with the realities of the society they helped create.\n\nDuring \"the time before\", June was married to Luke and had a daughter, Hannah. At the beginning of the story, while attempting to flee Gilead with her husband and daughter, June was captured and forced to become a Handmaid because of the adultery she and her husband committed. June's daughter was taken and given to an upper-class family to raise, and her husband escaped into Canada. Much of the plot revolves around June's desire to be reunited with her husband and daughter.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nElisabeth Moss as June Osborne / Offred / Ofjoseph, a woman who was captured while attempting to escape to Canada with her husband, Luke, and daughter, Hannah. Due to her fertility, she is made a Handmaid to Commander Fred Waterford and his wife, Serena Joy as \"Offred\". Now she is with Commander Joseph Lawrence as \"Ofjoseph\".\n\nJoseph Fiennes as Commander Fred Waterford, a high-ranking government official and June's former master. Both he and his wife were instrumental in Gilead's founding. He wishes to have more contact with June outside of what is lawful between a Handmaid and her master, and starts inviting her to play nightly games of Scrabble .\n\n. Yvonne Strahovski as Serena Joy Waterford, Fred's wife and a former conservative cultural activist. She appears to have accepted her new role in a society that she helped create. She is poised and deeply religious, but capable of great cruelty and is often callous to June. She is desperate to become a mother.\n\nAlexis Bledel as Dr. Emily Malek Ph.D. / Ofglen #1 / Ofsteven / Ofroy / Ofjoseph #1, June's shopping partner. Although June is initially wary of her, it is revealed she is not as pious as she seems, and the two become friends. Emily has a wife and son living in Canada and was a university lecturer in cellular biology. Being homosexual is punishable by death in Gilead, and while most intellectuals are worked to their deaths in the Colonies or executed, Emily, as \"Ofglen\", was spared and later converted into a Handmaid, due to her having \"two viable ovaries\". She was later captured and cruelly punished as a \"gender traitor\" for her lesbian relationship with a Martha, and is sent to another household where she becomes \"Ofsteven\". She is involved with a resistance movement called \"Mayday\". She was in the process of being worked to death in the toxic fields of the Colonies until the attack on the Red Center had her, Janine, and several others returned to Gilead to resume service as handmaids. After attacking Aunt Lydia at the Lawrence household, she as \"Ofjoseph\" fears execution, until Commander Lawrence sends her away in a truck with the baby Nichole, whom June hands to her before ditching them to free her other daughter Hannah. Both Emily and Nichole manage to flee to Canada, where Emily is soon reunited with her wife and son with the latter in the care of Luke and Moira.\n\nMadeline Brewer as Janine Lindo / Ofwarren / Ofdaniel / Ofhoward, a Handmaid who entered the Red Center for training at the same time as June, and considers June a friend due to her kind treatment. Initially non-compliant, Janine has her right eye removed as a punishment. She becomes mentally unstable due to her treatment and often behaves in temperamental or childlike ways. She gives birth to a child for Warren and Naomi Putnam, whom they name \"Angela\", but Janine insists the baby's name is \"Charlotte\". Janine is later reassigned and becomes \"Ofdaniel\". She was temporarily admitted to the Colonies until a bombing leveled the new Rachel and Leah Center on the day of its christening.\n\nAnn Dowd as Aunt Lydia / Lydia Clements, a woman in charge of overseeing the Handmaids in their sexual reeducation and duties. She is brutal and subjects insubordinate Handmaids to harsh physical punishment, but she also cares for her charges and believes deeply in the Gileadean mission and doctrine. She appears to have a soft spot for Janine and even goes so far as to address her by her given name on occasion. Before Gilead, she was a religious elementary school teacher named Miss Clements.\n\nO. T. Fagbenle as Luke Bankole, June's husband from before Gilead. Because he is divorced (he and June began their relationship before his divorce from his first wife), their union is nullified in this new society. June is considered an adulteress and their daughter, Hannah, is deemed illegitimate. Initially, June believes he was killed, but it is later revealed Luke managed to escape to Canada.\n\nMax Minghella as Commander Nick Blaine, Commander Waterford's driver and a former drifter from Michigan who has feelings for June. June and Nick develop an intimate relationship and she eventually discovers that he is an Eye, a spy for Gilead. In season 3, he is promoted to Commander.\n\nSamira Wiley as Moira Strand, June's best friend since college. She is already at the Red Center when June enters Handmaid training but escapes before being assigned to a home. She is recaptured and becomes \"Ruby\", a Jezebel. She seems to have given up hope of ever being free, but on meeting June again regains the conviction to escape. She is now living her life in Canada as a refugee.\n\nAmanda Brugel as Rita (main season 2–present, recurring season 1), a Martha at the Waterford house. She had a son named Matthew, who died fighting in the civil war when he was 19 years old. [18]\n\nBradley Whitford as Commander Joseph Lawrence (main season 3-present, recurring season 2), the founder of the Colonies and architect behind Gilead's economy. He is on and off with Mayday.[19][20]\n\nRecurring [ edit ]\n\nStephen Kunken as Commander Warren Putnam. He's the first known Commander of Janine. He had his left hand amputated by the Council after being found guilty of adultery.\n\nEver Carradine as Naomi Putnam, Commander Warren Putnam's wife.\n\nTattiawna Jones as Lillie Fuller / Ofglen #2 (seasons 1–2), who replaces Emily in the position after Emily is captured by the Eyes. She initially follows the rules and does not wish to upset the status quo, but this is because she believes her life as a Handmaid is better than the difficult, impoverished life she led prior to Gilead, rather than out of religious piety. After refusing to stone Janine, she was clubbed with a rifle by a Guardian, and her tongue (according to Alma) was cut out. After that, she sacrifices herself to bomb a new Red Center on the day of its christening. 26 Commanders and 31 Handmaids were killed as a result.\n\nNina Kiri as Alma / Ofrobert, another Handmaid who trained at the Red Center with June, Moira, and Janine. She is frank and chatty, and often trades gossip and news with June. She is also involved with Mayday and becomes June's first contact with the resistance group.\n\nJenessa Grant as Dolores / Ofsamuel, a local Handmaid with a friendly and talkative nature.\n\nBahia Watson as Brianna / Oferic, another local Handmaid who is friends with June.\n\nJordana Blake as Hannah Bankole / Agnes MacKenzie, June and Luke's daughter. She is later renamed Agnes MacKenzie.\n\nEdie Inksetter as Aunt Elizabeth, a fellow Aunt who works closely with Aunt Lydia at the Red Center.\n\nKristen Gutoskie as Beth (season 1, season 3-present), formerly a Martha at Jezebel's. She had an arrangement with Nick whereby she traded illegal alcohol and other contraband for drugs, which the Jezebels use. She has a casual sexual relationship with him and is aware that he is an Eye. She later becomes a Martha in Joseph Lawrence's household.\n\nErin Way as Erin, a young, apparently mute, woman who was being trained to become a Handmaid but managed to escape to Canada. [21]\n\nClea DuVall as Sylvia (season 2–present), Emily's wife. [22]\n\nCherry Jones as Holly Maddox (season 2–present), June's mother, an outspoken feminist. [23]\n\nSydney Sweeney as Eden Blaine (née Spencer) (season 2), a pious and obedient girl who was married off to Nick during a ceremony in episode 5 of season 2. She and Guardian Isaac were executed for \"infidelity\" by being drowned in a swimming pool. [24]\n\nSam Jaeger as Mark Tuello (season 2–present), an operative of the United States of America's government in exile whom Serena encounters in Canada.\n\nGreg Bryk as Commander Ray Cushing (season 2)\n\nRohan Mead as Isaac (season 2), a Guardian who was assigned to the Waterford home. He was executed alongside Eden in a swimming pool.\n\nJulie Dretzin as Eleanor Lawrence (seasons 2–3), the mentally unstable wife of Commander Lawrence.\n\nOrdena Stephens-Thompson as Frances (seasons 2–3), the Martha who was assigned to the MacKenzie household. She, along with a few others, was executed for \"endangering a sacred child\".\n\nAshleigh LaThrop as Natalie / Ofmatthew (season 3), a devoted Handmaid whose loyalty to Gilead causes divisive tensions amongst her peers. [25]\n\nSugenja Sri as Sienna (season 3), a new Martha in the Lawrence household.\n\nJonathan Watton as Commander Matthew Calhoun (season 3), the assigned Commander of Natalie/Ofmatthew.\n\nChristopher Meloni as High Commander George Winslow (season 3), a High Commander stationed in Washington, D.C. He was killed in self-defense by June Osborne at Jezebels and his body was cremated by Marthas there. [26]\n\nElizabeth Reaser as Olivia Winslow (season 3), [26] the wife of High Commander Winslow.\n\nthe wife of High Commander Winslow. Sarah McVie as Lena (season 3), a Swiss diplomat negotiating the hostile conflict between Gilead and Canada over Nichole.\n\nGuest [ edit ]\n\nZabryna Guevara as Mrs. Castillo (season 1), an ambassador from Mexico who visits Gilead to see the effectiveness of the regime.\n\nChristian Barillas as Mr. Flores (season 1), Mrs. Castillo's assistant.\n\nRosa Gilmore as Zoe (season 1), the daughter of a US army soldier and the leader of the group of survivors whom Luke encounters after being separated from June and Hannah.\n\nTim Ransom as Mr. Whitford (season 1), a friend of June's mother who helps June, Luke, and Hannah attempt to cross the border.\n\nMarisa Tomei as Mrs. O'Conner (season 2), a Commander's wife who is exiled to the Colonies as punishment for committing a sin of the flesh. [27]\n\nYahya Abdul-Mateen II as Omar (season 2), a man who helps June attempt to escape.\n\nJohn Carroll Lynch as Dan (season 2), Emily's boss at the university where she worked.\n\nKelly Jenrette as Annie (season 2), Luke's ex-wife who was after June for cutting her out of her marriage to Luke prior to Gilead's rise.\n\nRebecca Rittenhouse as Odette (season 2), a doctor and Moira's deceased fiancée.\n\nOprah Winfrey (uncredited) as Newsreader (season 2) on a car radio. [28]\n\nAmy Landecker as Mrs. MacKenzie (season 3), Hannah's placement mother in Gilead.\n\nLaila Robins as Pamela Joy (season 3), Serena Joy's mother.\n\nEmily Althaus as Noelle (season 3), a young single mother whose son Aunt Lydia taught before the rise of Gilead.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released First released Last released 1 10 April 26, 2017 ( ) June 14, 2017 ( 2017-06-14 ) 2 13 April 25, 2018 ( ) July 11, 2018 ( 2018-07-11 ) 3 13 June 5, 2019 ( ) August 14, 2019 ( 2019-08-14 )\n\nProduction [ edit ]\n\nHulu's straight-to-series order of The Handmaid's Tale was announced in April 2016, with Elisabeth Moss set to star.[29] Based on the 1985 novel of the same name by Margaret Atwood, the series was created by Bruce Miller, who is also an executive producer with Daniel Wilson, Fran Sears, and Warren Littlefield.[29] Atwood serves as consulting producer, giving feedback on some of the areas where the series expands upon or modernizes the book.[29][30] She also played a small cameo role in the first episode.[31] Moss is also a producer.[32]\n\nIn June 2016, Reed Morano was announced as director of the series.[33] Samira Wiley, Max Minghella, and Ann Dowd joined the cast in July 2016.[34][35][36] Joseph Fiennes, Madeline Brewer, and Yvonne Strahovski were cast in August 2016,[37][38][39] followed by O. T. Fagbenle and Amanda Brugel in September 2016.[40][41] In October 2016, Ever Carradine joined the cast,[42] and Alexis Bledel was added in January 2017.[43]\n\nFilming on the series took place in Toronto, Mississauga, Hamilton, Burlington, Oakville, and Cambridge, Ontario, from September 2016 to February 2017.[44][45] Hulu released the first full trailer of the TV series on YouTube, on March 23, 2017.[46] The series premiered on April 26, 2017.[47]\n\nOn May 3, 2017, The Handmaid's Tale was renewed for a second season to premiere in 2018.[48] Moss told the news media that the subsequent episodes would cover further developments in the story, filling in some of the unanswered questions and continuing the narrative already \"finished\" in the book.[49] The second season consists of 13 episodes and began filming in fall 2017. Alexis Bledel returned as a series regular.[50] Showrunner Bruce Miller stated that he envisioned 10 seasons of the show, stating, \"Well, you know, honestly, when I started, I tried to game out in my head what would ten seasons be like? If you hit a home run, you want energy to go around the bases, you want enough story to keep going, if you can hook the audience to care about these people enough that they're actually crying at the finale.\"[51]\n\nSeason 2 was filmed in Ontario, primarily in Toronto, but some scenes were shot in Hamilton and Cambridge.[52]\n\nSeason 3 started production in Toronto in October 2018.[53][54] Scenes for season 3 were also filmed in Cambridge and Hamilton, Ontario as well as in Washington, D.C.[55][56][57] Season 3 saw the show's long-serving Director of Photography, Colin Watkinson, make his directorial debut with the episode \"Unknown Caller\".\n\nSeason 4 starts production in March 2020. It will consist of ten episodes and is set to air in the fall of 2020.[58]\n\nBroadcast and release [ edit ]\n\nThe first three episodes of the series premiered on April 26, 2017; the subsequent seven episodes were released on a weekly basis.[47][59] In Canada, the series is broadcast weekly by CTV Drama Channel and the streaming service Crave; the first two episodes premiered on April 30, 2017.[60] In Scandinavia, the series is available on HBO Nordic.[61] In the United Kingdom, the series premiered on May 28, 2017, on Channel 4.[62]\n\nIn New Zealand, the series was released on the subscription video on demand service Lightbox on June 8, 2017.[63] In Australia, the series premiered on the TV channel SBS's video streaming service SBS on Demand, on July 6, 2017.[64]\n\nIn Ireland, the series premiered on February 5, 2018 on RTÉ2, with a showing of the first two episodes.[65] RTÉ also became the first broadcaster in Europe to debut Season 2 and Season 3 following its broadcast in the US and Canada.[66] In Brazil and Latin America, the series premiered on March 7, 2018, on Paramount Channel.[67]\n\nThe first season was released on Blu-ray and DVD on March 13, 2018.[68] The second season was released on Blu-ray and DVD on December 4, 2018.[69] The third season was released on Blu-ray on November 19, 2019.[70]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nIn 2019, The Handmaid's Tale was ranked 25th on The Guardian's list of the 100 best TV shows of the 21st century.[71]\n\nSeason Critical response Rotten Tomatoes Metacritic 1 94% (124 reviews) 92 (41 reviews) 2 89% (99 reviews) 86 (28 reviews) 3 82% (56 reviews) 67 (13 reviews)\n\nSeason 1 [ edit ]\n\nOn Rotten Tomatoes, the first season has an approval rating of 94% based on 124 reviews, with an average rating of 8.72/10. The site's critical consensus reads, \"Haunting and vivid, The Handmaid's Tale is an endlessly engrossing adaptation of Margaret Atwood's dystopian novel that's anchored by a terrific central performance from Elisabeth Moss.\"[72] On Metacritic, it has a weighted average score of 92 out of 100 based on 41 critics, indicating \"universal acclaim\".[73]\n\nDaniel Fienberg of The Hollywood Reporter called it \"probably the spring's best new show\".[74] Jen Chaney of Vulture gave it a highly positive review, and wrote that it is \"A faithful adaptation of the book that also brings new layers to Atwood's totalitarian, sexist world of forced surrogate motherhood\" and that \"this series is meticulously paced, brutal, visually stunning, and so suspenseful from moment to moment that only at the end of each hour will you feel fully at liberty to exhale\".[75]\n\nThere was much debate on whether parallels could be drawn between the series (and by extension, the book it is based on) and American society during the Presidency of Donald Trump.[76][77] A comparison has also been made to the Salafi/Wahabbi extremism of ISIL, under which enslaved women of religious minorities are passed around and utilized as sex objects and vessels to bear new jihadis.[78][79][80]\n\nSeason 2 [ edit ]\n\nOn Rotten Tomatoes, the second season has an approval rating of 89% based on 99 reviews, and with an average rating of 8.33/10. The site's critical consensus reads, \"Beautifully shot but dishearteningly relevant, The Handmaid's Tale centers its sophomore season tightly around its compelling cast of characters, making room for broader social commentary through more intimate lenses.\"[81] On Metacritic, it has a weighted average score of 86 out of 100 based on 28 critics, indicating \"universal acclaim\".[82]\n\nHowever, other critics perceived the second season's depictions of violence as excessive. Sophie Gilbert wrote: \"There came a point during the first episode where, for me, it became too much.\"[83] Lisa Miller of The Cut wrote: \"I have pressed mute and fast forward so often this season, I am forced to wonder: 'Why am I watching this'? It all feels so gratuitous, like a beating that never ends.\"[84] The Daily Telegraph's Rebecca Reid admitted she had an anxiety attack watching an episode of the show.[85]\n\nSeason 3 [ edit ]\n\nOn Rotten Tomatoes, the third season has an approval rating of 82% based on 53 reviews, with an average rating of 6.91/10. The site's critical consensus reads, \"The Handmaid's Tale's third season reins in its horrors and inspires hope that revolution really is possible – if only the story would stop spinning its wheels and get to it already.\"[86] On Metacritic, it has a weighted average score of 67 out of 100 based on 13 critics, indicating \"generally favorable reviews\".[87]\n\nKelly Lawler of USA Today gave it a positive review, scoring it three out of four stars. She claimed it is an improvement over the second season, \"that rights many – though definitely not all – of Season 2's wrongs.\" Overall, she wrote, \"The new season is more propulsive and watchable, although it doesn't quite reach the heights of that first moving season. But Handmaid's regains its footing by setting off on a new path\".[88]\n\nDaniel Fienberg of The Hollywood Reporter wrote a generally positive review, praising Elisabeth Moss' performance and the cinematography, but criticized the plot \"that has become frustratingly repetitive\". Overall, he wrote, \"Still occasionally powerful, but rarely as provocative\".[89]\n\nAwards [ edit ]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/250px-The_Handmaid%27s_Tale_intertitle.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)", "title": "The Handmaid's Tale (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}