{"url": "www.washingtonpost.com/news/arts-and-entertainment/wp/2018/08/23/do-we-need-to-know-so-much-about-ben-affleck/", "text": "And then Wednesday night, a miserable-looking Affleck in the back seat of a car driven by his equally unhappy-looking estranged wife, Jennifer Garner. TMZ, People, Us Weekly and E! reported that Garner was taking him to rehab to receive treatment for alcohol addiction. (Affleck’s publicist did not return a request for comment.) This comes after more bleak pictures of Affleck, who did a second stint in rehab last year, accepting an apparent liquor delivery at his home this week.\n\nOn one hand, it’s surprising to see such drama between two A-listers play out so publicly: While paparazzi are crafty, there are presumably many ways for stars to conduct their private business away from the cameras. And yet both Affleck and Garner seem uniquely aware of the power of public image — which for many celebrities is just as important as their actual career.\n\nAffleck’s zigzag trajectory as an actor and director has always moved in parallel to his relationships. As he broke out with “Good Will Hunting” and “Armageddon” in the late 1990s, he hooked up with Gwyneth Paltrow, fresh off her Oscar for “Shakespeare in Love.” His bombs such as “Gigli” and disappointments such as “Daredevil” in the early 2000s coincided with his becoming a tabloid punchline as one half of Bennifer, in a frenzied, much-discussed relationship with Jennifer Lopez.\n\nAD\n\nAD\n\nWhen he wed Garner in 2005, it ushered in a new era. Suddenly, they were the golden couple with the adorable children — spotted all over Los Angeles, on ice cream runs and playing in the park — and Affleck started to earn acclaim again for smaller roles (“Hollywoodland,” “State of Play”) and for directing movies such as “The Town.” In 2012, he directed the Oscar-winning “Argo.”\n\nThus the question that was raised when Affleck and Garner separated in June 2015: What happens to your career when the star-powered marriage that helped propel it is over? Garner, 46, brilliantly continued to cement her narrative as a wholesome, protective mom to her three children. She has starred in family-friendly films such as “Miracles From Heaven” and “Nine Lives” while targeting critical acclaim with HBO’s upcoming comedy “Camping.” Her popular Instagram account is filled with goofy videos of reading books to her dog, filming episodes for her “Pretend Cooking Show” or promoting her organic baby food company, Once Upon a Farm.\n\nIt’s a stark contrast to Affleck’s ups and downs over the past three years. “Batman v Superman: Dawn of Justice” made him millions, though his performance as Batman drew scorn. “Sad Affleck” became a meme after his wistful expression when an interviewer asked about the lousy reviews. This past fall, his press tour for “Justice League” kept turning into discussions about sexual harassment, as he was asked about “Good Will Hunting” producer Harvey Weinstein. And as the Me Too movement picked up steam, he apologized for his on-air groping of a young MTV host, Hilarie Burton, in 2003.\n\nAD\n\nAD\n\nAffleck also made for some more positive headlines, via his relationship with Shookus, a well-liked “Saturday Night Live” producer. Despite speculation about when exactly their relationship started, they became a tabloid-favorite couple, frequently snapped walking their dogs or shopping or hiking; the Cut catalogued 47 times they were photographed getting iced coffee. Affleck may have just been trying to live his best life as a 46-year-old separated dad — but at this point, he was clearly savvy enough to know that fans find inexplicable joy in seeing celebrities go about their mundane activities happily.\n\nThroughout their split, Affleck and Garner have been open about co-parenting and trying to keep life as normal as possible for their kids. They give friendly interviews about each other. Two months after Garner filed for divorce in spring 2017, the family went on vacation to the Caribbean together.\n\nSo it raised eyebrows last month when The Blast revealed that the couple have still not officially divorced; the court has threatened to dismiss the case “for delay in prosecution.” A source “exclusively” told Us Weekly that it was because Garner has concerns about Affleck’s sobriety and how it could affect their kids. Then over the past week, it emerged that Affleck and Shookus had broken up, and he was photographed with Shauna Sexton, the young Playboy model who, as multiple articles made sure to point out, has been quoted as saying that she loves drinking whiskey.\n\nAD\n\nAD\n\nNow, as Affleck is reportedly headed back to rehab, observers once again have a front-row seat. Knowing how Affleck has been covered in the past, it’s likely it will all be carefully chronicled once again.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JH4QI2QTEY2RBEEWP6DBTW5SYM.jpg&w=150", "https://www.washingtonpost.com/resizer/VNF42cbZz6kFte_iGO7aUYJVrSA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TQZEDWCVUE6YTI2QA6GZF6INKY.jpg"], "top_img": "https://www.washingtonpost.com/resizer/VNF42cbZz6kFte_iGO7aUYJVrSA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TQZEDWCVUE6YTI2QA6GZF6INKY.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/08/23/do-we-need-to-know-so-much-about-ben-affleck/", "title": "Do we need to know so much about Ben Affleck?", "meta_data": {"description": "As the actor reportedly heads back to rehab for a third time, his personal life is playing out publicly once again.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/08/23/do-we-need-to-know-so-much-about-ben-affleck/", "image": "https://www.washingtonpost.com/resizer/VNF42cbZz6kFte_iGO7aUYJVrSA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TQZEDWCVUE6YTI2QA6GZF6INKY.jpg", "title": "Analysis | Do we need to know so much about Ben Affleck?", "description": "As the actor reportedly heads back to rehab for a third time, his personal life is playing out publicly once again."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Do we need to know so much about Ben Affleck?", "description": "As the actor reportedly heads back to rehab for a third time, his personal life is playing out publicly once again."}, "last_updated_date": "2018-08-24T17:37:01.903Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1534953600.0, "source": "http://www.washingtonpost.com", "summary": ""}