{"url": "http://time.com/5249833/mckayla-maroney-reported-larry-nassar-abuse/", "text": "Olympic gymnast McKayla Maroney revealed that she told a USA Gymnastics coach and several fellow gymnasts in 2011 that she had been sexually abused by team doctor Larry Nassar. Nothing happened, she said, and the abuse carried on for another five years.\n\nMaroney, who won gold and silver at the 2012 Olympic Games in London as part of the “Fierce Five,” said in an interview with NBC’s Dateline that she was in a car with coach John Geddert and other gymnasts when she told them, “Last night, it was like Larry was fingering me.”\n\nMaroney, now 22, said Geddert did not react, while the other gymnasts appeared surprised. One of the gymnasts criticized Maroney for making the statement at the time and later told NBC that the incident did not happen. Dateline reported that three other witnesses corroborated Maroney’s story.\n\nGeddert was suspended by USA Gymnastics in January after numerous gymnasts accused him of verbal and physical abuse. Geddert has not commented on the allegations.\n\nMaroney said Nassar abused her the first time she met him, at the Karolyi ranch in Houston, Texas, which was the U.S. national training center. She said the abuse happened every time she saw him after that — “hundreds” of times. At the world championships in Tokyo in 2011, she said Nassar “went overboard.” She told NBC that she was naked with Nassar on top of her, and “I thought I was going to die.”\n\nFour of Maroney’s “Fierce Five” teammates have reported that they were abused by Nassar. Maroney was the first to publicly reveal the abuse, in a tweet in October 2017. She said Nassar started to abuse her when she was 13 and continued, even during the 2012 Olympic Games until she left gymnastics in 2016.\n\nHer teammates Aly Raisman, Gabby Douglas, and Jordyn Wieber have also accused Nassar of sexual abuse. Raisman and Wieber are suing USA Gymnastics, the U.S. Olympic Committee, and Michigan State University, where Nassar was on the faculty, for failing to protect them from Nassar’s behavior.\n\nNassar abused the gymnasts under the pretext of medical care. An osteopath, he told the girls that the procedures would ease whatever pain they were sent to him to relieve, and would help them to continue training.\n\n“He told me he was going to do a checkup on me and that was the first day I was abused,” Maroney said during the interview. “He said that nobody would understand this and the sacrifice that it takes to get to the Olympics, so you can’t tell people this.”\n\nMaroney said that Nassar won the favor of the gymnasts by being friendly, bringing them food when they were afraid to eat while under the watchful eye of coaches and national team coordinator Martha Karolyi. “Your coaches are just always watching you. And wanting to keep you skinny,” she said. “I would’ve starved at the Olympics if I didn’t have him bring me food.”\n\nMartha and Bela Karolyi respond to allegations\n\nMartha and Bela Karolyi, the famed Romanian coaches credited with bringing U.S. women’s gymnastics to world championship and Olympic glory, spoke publicly for the first time since the accusations against Nassar were revealed last fall. They said they were not aware of Nassar’s abuse, and were saddened to learn of his behavior.\n\nSeveral gymnasts have said the abuse occurred on the Karolyi ranch, which doubled as the national training center, where elite gymnasts came once a month to live and train. USA Gymnastics cut ties with the Karolyi ranch in January amid the Nassar scandal.\n\n“Any child who is violated by Nassar, it’s a crime and it’s so sad,” Martha said. “It is very much hurtful,” Martha said of the abuse allegations. But she said she was not aware of Nassar’s sexual abuse of the gymnasts. “I heard during the testimonies that some of the parents were in the therapy room with their own child and Larry Nassar was performing this,” said Martha. “And the parent couldn’t see. How I could see?”\n\nThe Karolyis have been named in several lawsuits related to Nassar’s abuse. Nassar is currently serving 175 years in prison on state charges of criminal sexual activity and federal charges of child pornography.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2016/02/mckayla-maroney-gymnastics-retirement-olympics.jpg", "https://api.time.com/wp-content/uploads/2019/11/aly-raisman-time-100-next-2.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2019/09/larry-nassar-michigan-state-fine.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2016/02/mckayla-maroney-gymnastics-retirement-olympics.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2016/02/mckayla-maroney-gymnastics-retirement-olympics.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Alice Park"], "canonical_link": "https://time.com/5249833/mckayla-maroney-reported-larry-nassar-abuse/", "title": "McKayla Maroney Says She Tried to Sexual Abuse in 2011", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Crime,Gymnastics,onetime", "news_keywords": "Crime,Gymnastics,onetime", "description": "Olympic medalist McKayla Maroney says she revealed to a coach and teammates sexual abuse by team doctor Larry Nassar in 2011.", "og": {"title": "Gymnast McKayla Maroney Says She Revealed Sexual Abuse in 2011", "type": "article", "site_name": "Time", "url": "https://time.com/5249833/mckayla-maroney-reported-larry-nassar-abuse/", "description": "The abuse continued until she left gymnastics in 2016", "image": {"identifier": "https://api.time.com/wp-content/uploads/2016/02/mckayla-maroney-gymnastics-retirement-olympics.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5249833/mckayla-maroney-reported-larry-nassar-abuse/", "description": "Olympic medalist McKayla Maroney says she revealed to a coach and teammates sexual abuse by team doctor Larry Nassar in 2011.", "media": "https://api.time.com/wp-content/uploads/2016/02/mckayla-maroney-gymnastics-retirement-olympics.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5249833/mckayla-maroney-reported-larry-nassar-abuse/", "title": "Gymnast McKayla Maroney Says She Revealed Sexual Abuse in 2011", "description": "The abuse continued until she left gymnastics in 2016", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2016/02/mckayla-maroney-gymnastics-retirement-olympics.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}