{"url": "https://variety.com/2017/tv/news/daniel-dae-kim-reaction-hawaii-five-0-pay-dispute-1202487565/", "text": "Daniel Dae Kim has broken his silence, following news that he won’t be returning to “Hawaii Five-0” next season amid salary drama.\n\n“By now many of you have heard the news, and I’m sad to say it is true. I will not be returning to ‘Hawaii Five-0’ when production starts next week. Though I made myself available to come back, CBS and I weren’t able to agree to terms on a new contract, so I made the difficult choice not to continue,” the actor posted Wednesday morning on Facebook.\n\nLast week, Variety reported that Kim and his co-star Grace Park would be departing the CBS procedural ahead of its eighth season, due to a dispute with CBS Television Studios to reach pay equality with co-stars Alex O’Loughlin and Scott Caan. Insiders said Kim and Park’s final offer from the studio was 10-15% less than O’Loughlin and Caan, who each also each have lucrative back end deals on the show.\n\nSince the announcement of the duo’s departure, fans have been critical of CBS’s failure to reach parity with the series’ two Asian actors, while keeping two Caucasian stars on the show. The social media chatter comes after critics have targeted CBS for its lack of diverse leading roles for women and actors of color, in comparison to the other broadcast networks.\n\nIn Kim’s Facebook message, the actor thanked his fans, while addressing Hollywood’s diversity problem, specifically for Asian American actors.\n\nHe wrote, “As an Asian American actor, I know first-hand how difficult it is to find opportunities at all, let alone play a well developed, three dimensional character like Chin Ho. I will miss him sincerely. What made him even more special is that he was a representative of a place my family and I so dearly love. It has been nothing short of an honor to be able to showcase the beauty and people of Hawaii every week, and I couldn’t be prouder to call these islands home. To my local community, mahalo nui loa.”\n\nHe continued to write, “I’ll end by saying that though transitions can be difficult, I encourage us all to look beyond the disappointment of this moment to the bigger picture. The path to equality is rarely easy. But I hope you can be excited for the future. I am.”\n\nKim has starred on “Hawaii Five-0” as Chin Ho Kelly since the drama’s debut in 2010 and was a series regular for seven seasons. Prior to the CBS series, he became known to television audiences for his starring role on “Lost.” While he won’t be returning to the small screen this upcoming TV season, Kim’s production company, 3AD, has its first major series coming up with “The Good Doctor” on ABC on which he’ll serve as an executive producer.\n\nRead Daniel Dae Kim’s full Facebook message here:", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2016/01/daniel-dae-kim-e1502043219192.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fdaniel-dae-kim-reaction-hawaii-five-0-pay-dispute-1202487565%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202487565&comment_count=44", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2016/01/daniel-dae-kim-e1502043219192.jpg?w=1000", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2017/tv/news/daniel-dae-kim-reaction-hawaii-five-0-pay-dispute-1202487565/", "title": "Daniel Dae Kim Breaks Silence After ‘Hawaii Five-0’ Pay Dispute: ‘The Path to Equality Is Rarely Easy’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Daniel Dae Kim has broken his silence, following news that he won't be returning to \"Hawaii Five-0\" next season amid salary drama.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202487565, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-07-05T10:37:51"}, "pmc-tag": "Daniel Dae Kim,Hawaii Five-0", "title": "Daniel Dae Kim Breaks Silence After ‘Hawaii Five-0’ Pay Dispute: ‘The Path to Equality Is Rarely Easy’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Daniel Dae Kim Breaks Silence After ‘Hawaii Five-0’ Pay Dispute: ‘The Path to Equality Is Rarely Easy’", "url": "https://variety.com/2017/tv/news/daniel-dae-kim-reaction-hawaii-five-0-pay-dispute-1202487565/", "description": "Daniel Dae Kim has broken his silence, following news that he won’t be returning to “Hawaii Five-0” next season amid salary drama. “By now many of you have heard the news, a…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/01/daniel-dae-kim-e1502043219192.jpg?w=1000", "width": 1000, "height": 563, "alt": "Daniel Dae Kim Hawaii Five-0 exit"}, "locale": "en_US"}, "article": {"published_time": "2017-07-05T17:37:51+00:00", "modified_time": "2017-07-05T18:11:11+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "Daniel Dae Kim Breaks Silence After ‘Hawaii Five-0’ Pay Dispute: ‘The Path to Equality Is Rarely Easy’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/01/daniel-dae-kim-e1502043219192.jpg?w=1000", "alt": "Daniel Dae Kim Hawaii Five-0 exit"}, "card": "summary_large_image", "title": "Daniel Dae Kim Breaks Silence After ‘Hawaii Five-0’ Pay Dispute: ‘The Path to Equality Is Rarely Easy’", "description": "Daniel Dae Kim has broken his silence, following news that he won't be returning to \"Hawaii Five-0\" next season amid salary drama."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202487565, "title": "Daniel Dae Kim Breaks Silence After 'Hawaii Five-0' Pay Dispute: 'The Path to Equality Is Rarely Easy'", "published_at": "2017-07-05 10:37:51", "image": "https://pmcvariety.files.wordpress.com/2016/01/daniel-dae-kim-e1502043219192.jpg?w=1000", "comment_count": 44, "tags": "Hawaii Five-0", "topics": "News", "appeared_in_print": "No", "body": "Daniel Dae Kim has broken his silence, following news that he won't be returning to \"Hawaii Five-0\" next season amid salary drama.\r\n\r\n\"By now many of you have heard the news, and I’m sad to say it is true. I will not be returning to 'Hawaii Five-0' when production starts next week. Though I made myself available to come back, CBS and I weren’t able to agree to terms on a new contract, so I made the difficult choice not to continue,\" the actor posted Wednesday morning on Facebook.\r\n\r\nLast week, Variety reported that Kim and his co-star Grace Park would be departing the CBS procedural ahead of its eighth season, due to a dispute with CBS Television Studios to reach pay equality with co-stars Alex O’Loughlin and Scott Caan. Insiders said Kim and Park's final offer from the studio was 10-15% less than O’Loughlin and Caan, who each also each have lucrative back end deals on the show.\r\n\r\nSince the announcement of the duo's departure, fans have been critical of CBS's failure to reach parity with the series' two Asian actors, while keeping two Caucasian stars on the show. The social media chatter comes after critics have targeted CBS for its lack of diverse leading roles for women and actors of color, in comparison to the other broadcast networks.\r\n\r\n\r\n\r\nIn Kim's Facebook message, the actor thanked his fans, while addressing Hollywood's diversity problem, specifically for Asian American actors.\r\n\r\nHe wrote, \"As an Asian American actor, I know first-hand how difficult it is to find opportunities at all, let alone play a well developed, three dimensional character like Chin Ho. I will miss him sincerely. What made him even more special is that he was a representative of a place my family and I so dearly love. It has been nothing short of an honor to be able to showcase the beauty and people of Hawaii every week, and I couldn’t be prouder to call these islands home. To my local community, mahalo nui loa.\"\r\n\r\nHe continued to write, \"I’ll end by saying that though transitions can be difficult, I encourage us all to look beyond the disappointment of this moment to the bigger picture. The path to equality is rarely easy. But I hope you can be excited for the future. I am.\"\r\n\r\nKim has starred on \"Hawaii Five-0\" as Chin Ho Kelly since the drama's debut in 2010 and was a series regular for seven seasons. Prior to the CBS series, he became known to television audiences for his starring role on \"Lost.\" While he won't be returning to the small screen this upcoming TV season, Kim's production company, 3AD, has its first major series coming up with \"The Good Doctor\" on ABC on which he'll serve as an executive producer.\r\n\r\nRead Daniel Dae Kim's full Facebook message here:", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1499276271.0, "source": "https://variety.com", "summary": ""}