{"url": "https://en.wikipedia.org/wiki/List_of_dragons_in_popular_culture", "text": "Name Game Notes\n\nAlduin The Elder Scrolls V: Skyrim A fearsome, powerful, black dragon. Also known as \"The World Eater\", \"Nordic God of Destruction\" and \"Bane of Kings\". Claimed as first-born of Akatosh (the Dragon God of Time). Ambitions of world-domination.\n\nAlexstrasza, The Life Binder Warcraft, Heroes of the Storm Aspect of the Red Dragon Flight. The guardian of all life in the world of Azeroth. She was one of five great dragons chosen by the titans to be empowered with a portion of the Pantheon's power and rule over her flight while they watched over Azeroth and its inhabitants. The titans also appointed her queen of all dragons\n\nArchdemons Dragon Age: Origins Archdemons possess intelligence far beyond the average dragon and are purely evil creatures.\n\nAurene Guild Wars 2 A crystal dragon, scion of Glint, player's character companion.\n\nBahamut Final Fantasy Series Known by many titles, he is revered as the lord of the sky in Final Fantasy. His destructive MegaFlare can consume multiple cities in one attack.\n\nDarby Darby the Dragon A green dragon who bears the title Dragon Prince and goes on a quest to restore his shrunken sister Sparkle.\n\nDeathwing, The Destroyer World of Warcraft: Cataclysm, Heroes of the Storm Known as 'the Destroyer' and originally as 'Neltharion the Earth-Warder'. Once a kind benevolent dragon, but was driven mad by the Old Gods and came to inspire fear and contempt.\n\nDracolich Dungeons & Dragons An undead dragon called Dragotha,[6] formerly consort to Tiamat, who was given his undead powers by the deity Kyuss. It is unknown whether other dracoliches exist in Greyhawk.\n\nDragon Knight Heroes of the Storm Dragon Knight is a Playable Character Transformation on the Dragon Shire battleground. Heroes can liberate the Dragon Knight by activating the shrines and interacting with the Knight's statue in the middle lane of the battleground, taking control of him temporarily.\n\nDraigoch Lord of the Rings Online An evil red dragon found in the mountains of the Enedwaith. He has Arch-Nemesis rank and approximately 9,000,000 hit points. A raid party of 12 - 24 is required. Pictures of him put him at about the same size as Smaug. He speaks, has wings and breathes fire.\n\nElvarg Runescape Elvarg is a female green dragon and is considerably stronger than most others of her kind. Elvarg lives on the island of Crandor and is found underground, in a cave that is connected to Karamja through a series of tunnels. During the quest Dragon Slayer, players must slay her and bring her head to Oziach in order to earn the right to wear the rune platebody, blue dragonhide body armor and mystic robe top.\n\nEnder Dragon Minecraft A giant black dragon with glowing purple eyes that lives in The End Dimension.\n\nEnywas Darkmere An evil destructive dragon who constantly slaughtered villagers until Prince Ebryn killed her for good.\n\nFeyrbrand Legend of Dragoon A dragon that appears as you start the game that is controlled by Emperor Doel. Known as \"The Green-Tusked Dragon,\" it chases the protagonist at the start of the game until saved by another character known as Rose.\n\nFlammie Secret of Mana A white dragon that is found and rescued by the main characters early in the game, and rapidly grows into a full-size dragon capable of carrying at least three people on its back. Later in the game, Flammie is revealed to be the legendary \"Mana Beast\", and battles the characters in the game's finale.\n\nGrigori Dragon's Dogma An enormous red dragon who gruesomely tears out the heart of the \"chosen one\" who is known as an Arisen and steals it in Dragon's Dogma. The Arisen is destined to destroy the dragon to regain his/her heart. He takes refuge in the Tainted Mountain, waiting for the current Arisen to challenge him. He and his dragon apprentices appear without warning, ferociously terrorizing villages and the people of Cassardis. There isn't enough evidence to make any sort of theory about the dragons’ purpose. It's possible to think that the dragons are fulfilling some sort of role or duty.\n\nGrima Fire Emblem Awakening Also known as the \"fell dragon,\" Grima is the manifestation of the corrupted earth dragon tribe seeking the genocide of all living creatures. He was sealed away in what is referred to as \"The Dragon's Table\" by the manakete queen, Naga. He is revered by a cult of fanatics known as \"The Grimleal\" who long for nothing more than his return. However, returning him to the world is not as easy as it sounds as he requires one particular person to serve as his vessel...\n\nKalameet Dark Souls One of the remaining ancient dragons, one fearsome enough to be feared by Anor Londo the city of the gods, found in the skies of ancient Oolacile.\n\nKasimir Æthelinde Warhearts A small red wyvern sworn to the Dominion as a Devout. In his juvenile state, he takes a humanoid form and is known for chili and other hot flavoured beverages that soothe his fiery soul\n\nMalygos, The Spellweaver Warcraft He was the Aspect of the Blue Dragon Flight and one of the most ancient creatures living on Azeroth and the eldest of the Aspects. Norgannon, the titan master-magician and keeper of lore, granted Malygos a portion of his vast power. From then on, Malygos would be known as the Spell-weaver, the guardian of arcane magic and hidden arcanum.\n\nMinerva Fire Emblem Minerva is a name that appears more than once in Fire Emblem Lore, most recently in Fire Emblem Awakening, which is ridden by the recruitable character Cherche and her son.\n\nNaga Fire Emblem Awakening Naga is the queen of the six dragon tribes that ruled over the land 3,000 years before the events of Fire Emblem Awakening. Even after her \"suicide,\" she still watches over humanity to protect them from any threats that are beyond their control. When Grima threatens to destroy the entire world, she changes time itself to help the army of heroes stop the impending holocaust. Even with her divine intervention, the conflict quickly becomes more complex than anyone could have imagined. She had not prevented the world-ending threat like she had hoped, but with her interference, she manages to give mankind a fighting chance against impossible odds.\n\nNecrosan Primal Rage A deathly, zombie-like dragon with no skin to cover his muscular structure. Little is known about Necrosan other than his design, given that he was going to debut in the sequel to Primal Rage, which ended up being cancelled. However, we do know that he is the God of Death, and supposedly controls massive amounts of the undead as an army rather than the typical natives that willingly worshipped the other Gods. He also supposedly hatches from the \"asteroid\" which causes the Catyclisms.\n\nNightshade The Palace of Deceit Nightshade is one of the rare dragons who escapes the Palace dungeons and vows to kill the evil wizard Garth before he can wipe out dragonkind completely.\n\nNozdormu, The Timeless One Warcraft Aspect of the Bronze Dragon Flight and guardian of time, is one of the former Dragon Aspects empowered by the titans to watch over Azeroth. He fought against the demons during the War of the Ancients. Following this intervention, he retreated into seclusion, immersing himself in his duties. He emerges only infrequently when events require his direct presence. He intervened in the defeat of Deathwing at the hands of Krasus and his allies, one of the few times he has been seen in the skies of Azeroth.\n\nPaarthurnax The Elder Scrolls V: Skyrim A wise old dragon met at the Throat of the World. Alduin's younger brother who helps the player defeat him by helping him to learn the shout, Dragonrend. It is optional in the game to kill Paarthurnax, but doing so is not recommended. He is also the master of the Greybeards and their \"Way of the Voice\".\n\nRidley Metroid Portrayed in different ways in separate Metroid titles, with varying size and sometimes capable of speech. Shown to be male and to have purple skin and glowing eyes, and resembling a pterodactyl in Super Metroid. Also has cyborg and robotic forms.[7] Ridley has been described as the last of his species, native to Zebes.\n\nSeath the Scaleless Dark Souls An albino dragon who helped Gwyn, Nito, and the Witch of Izalith destroy the everlasting dragons. Seath was born without the everlasting scales, making him mortal and an outcast. After the fall of the everlasting dragons, he founded sorcery which sparked animosity between him and Havel the Rock. He resides in the Duke's Archives and the crystal caves where he researches and protects the Primordial Crystal.\n\nSinge Dragon's Lair Captor of Princess Daphne and foe of heroic knight Dirk the Daring. Created by Rick Dyer and animator Don Bluth in 1983.\n\nSpyro Spyro the Dragon & Skylanders Throughout the original series, Spyro is portrayed as energetic and curious, with little regard for his own safety. He is also described as a courageous hero, despite his small size. Spyro is also known for his cocky attitude and can be stubborn at times. In Skylanders, Spyro's representing the Magic element and his catchphrase is \"All Fired Up!\"\n\nSynn Dungeons & Dragons: Shadow over Mystara A gigantic red wyrm dragon who takes the form of an Incantatrix and hungers to conquer the lands of Darokin. Portrayed as the final boss of the game.\n\nTathamet, The Prime Evil Diablo He was a seven-headed dragon of all darkness and vileness. It was known as the Prime Evil and was created as a cast-off of all the dark attributes within Anu long before Sanctuary came into existence. Separated from one being, Tathamet and Anu were both trapped within the same place and they battled with each other for an indefinite length of time. Eventually, the evenly matched adversaries destroyed each other, causing the universe to come into being. After its death, Tathamet gave birth to the seven Great Evils, each being formed from one of Tathamet's heads while its body became the foundation of the Burning Hells.\n\nTiamat Dungeons & Dragons A multi-headed dragon whose heads can breathe Fire, Ice, poison and lightning. The arch enemy of Venger.\n\nTrag'Oul Diablo He is a mysterious dragon-like being who guards Sanctuary and maintains the Balance between the High Heavens and the Burning Hells. In Richard A. Knaak's The Sin War trilogy, he is depicted as a constellation of stars, in each of which, a different part of life is shown - past, present, and future choices to be made, so one cannot see a definite future. Trag'Oul's exact origins are unknown, although it is hinted that he is not a unique being, that other worlds have guardians similar to him. He has not been seen since the Sin War ended. He is worshipped by the Necromancers of the Cult of Rathma.\n\nTweek the Dragon Fur Fighters Tweek is a dragon born in Royston Vasey, Wales to Gwynth the Fur Fighter. He is the youngest of the Fur Fighters at 0.002 years. His special skill is Gliding.\n\nUr Dragon Dragon's Dogma A dragon with a gray/lavender palette. However, unlike The Dragon, the Ur-Dragon has thirty \"hearts\" located all over his body, which will glow as the Arisen or their Pawns approach the area. Each time a heart is destroyed, the area around it will rot and fall, revealing the Ur-Dragon's true form.\n\nVolvagia The Legend of Zelda: Ocarina of Time A corrupt dragon, who previously slept in the Fire Temple, whom Ganondorf awoke and unleashed. Killed by the hero Link.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Dragon_Harley_MS_3244.png/150px-Dragon_Harley_MS_3244.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Smaug_par_David_Demaret.jpg/330px-Smaug_par_David_Demaret.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Smaug_par_David_Demaret.jpg/1200px-Smaug_par_David_Demaret.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Smaug_par_David_Demaret.jpg/1200px-Smaug_par_David_Demaret.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_dragons_in_popular_culture", "title": "List of dragons in popular culture", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Smaug_par_David_Demaret.jpg/1200px-Smaug_par_David_Demaret.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}