{"url": "www.metacritic.com/feature/angelina-jolie-best-and-worst-movies", "text": "Low risk, high reward\n\nAverage Metascore 48 Films Starring Angelina Jolie Average User Score 6.5 Average Gross $44.7m Highest-Grossing Film\n\n$186.3m Mr. and Mrs. Smith (2005) 55 Best Opening Weekend $50.9m Wanted (2008) 64\n\nSince winning a Golden Globe for her daring performance in the HBO movie Gia back in 1998, Angelina Jolie has become one of the biggest movie stars in Hollywood. So it's interesting that, when you look at her filmography, many of her roles after her Oscar-winning performance in 1999's Girl, Interrupted 51 are actually not much to write home about. From The Bone Collector 45 to Taking Lives 38 to Tomb Raider 33, Jolie seemed content to be just another pretty face, playing the token female in predictable thrillers and action movies.\n\nIn 2004 and 2005, she started to break out of this mediocre streak with her role in Sky Captain and the World of Tomorrow 64 and her amusing take as a hit woman against Brad Pitt in the action comedy Mr. and Mrs. Smith 55. When Pitt and Jolie became romantically involved in real life, Jolie's stardom soared as she became the queen of tabloid gossip rags. At the same time Jolie began taking on more serious roles with A Mighty Heart 74 and Changeling 63. Over the past five years Jolie has shown she can play tough, vulnerable and complex characters, while in her public life she's become more and more involved in humanitarian aid and has also built quite a family with Pitt, all of which have continued to expand her celebrity.\n\nExactly how much of Jolie's fame comes from her acting talent versus the public's interest in her social life is debatable, but Hollywood is betting that her popularity will result in major ticket sales this weekend when Salt opens wide. Originally written for a man as the lead (with Tom Cruise very close to playing the role), Salt was re-written for Jolie. Hoping to duplicate the success of the Jason Bourne films, Jolie plays a government agent who may be a Russian spy. We'll see on Friday if Jolie's star power is enough to help Salt avoid the summer slump that seems to have plagued so many action vehicles this year; early reviews are mixed so far.\n\nBelow, we look at the five best and five worst Angelina Jolie movies.\n\nAngelina Jolie's 5 Best-Reviewed Movies Movie Year Netflix Metascore Users 1 A Mighty Heart 2007 74 7.5 \"The film belongs to Jolie. She won an Oscar for 1999's 'Girl, Interrupted,' but this is by far her best performance.\"\n\n-- Peter Travers, Rolling Stone Nominated for multiple awards including a Golden Globe, Jolie's portrayal of Marianne Pearl -- the widow of murdered journalist Daniel Pearl -- has been praised by critics as one of her best performances. As Marianne Pearl's personal choice to play the part, Jolie delivers an emotionally heavy performance, losing herself so completely in the role that the audience forgets she's Angelina Jolie and instead sees a woman struggling to come to terms with the loss of her husband. Budget: $16m U.S. Gross: $9.2m 2 Sky Captain and the World of Tomorrow 2004 64 5.6 \"If anyone in the cast is having a good time, it’s Angelina Jolie ... Resplendent in jackboots and eye patch, she’s also every fanboy’s Ilsa fetish come to life.\"\n\n-- Pete Vonder Haar, Film Threat Jolie stars as Commander Franky Cook in Kerry Conran's homage to sci-fi pulp stories of the past. With her eye patch firmly in place, Jolie plays her part straight, smirking with the movie rather than at it, never letting the part slide into campy stupidity. While audiences may not have gotten what Sky Captain wanted to do, there's no question that Jolie definitely did. Budget: $70m U.S. Gross: $37.8m 3 Wanted 2008 64 6.4 \"Fox is a perfect role for Jolie, a sort of fancified extension of her Mrs. Smith that allows her to be a tough babe and also gently send up the caricature.\"\n\n-- Todd McCarthy, Variety Adapted from the Mark Millar (Kick-Ass) comic, Wanted features Jolie doing what she does so well: being mysterious, sexy, and lethal. As Fox, a higher-up in a league of assassins, Jolie keeps the part from becoming just another cookie-cutter action role by bringing real emotion to the character's damaged core. A surprise hit with both critics and audiences, rumors continue to swirl that Jolie will (somehow) be back for the sequel. Budget: $75m U.S. Gross: $135m 4 Changeling 2008 63 8.1 \"Eastwood creates a tone that's at once stately and unsettling, allowing a lot of breathing room for Jolie's sad, unyielding performance. She anchors a film that needs an anchor the further it goes along.\"\n\n-- Keith Phipps, A.V. Club Receiving her second Oscar nomination, Jolie delivers a strong, heartbreaking performance as a woman determined to get her son back in Clint Eastwood's drama. Based on true events, Changeling showcases Jolie's raw vulnerability alongside bold determination as she proves just how powerful a mother's love can be. Budget: $55m U.S. Gross: $35.7m 5 The Good Shepherd 2006 61 6.6 \"Jolie... jazzes up the movie considerably when she enters it, although the indistinctness of her role eventually grinds her down.\"\n\n-- Stephanie Zacharek, Salon.com Jolie shows she's not afraid to be unlikable as Margaret Russell, a woman who has forced CIA operative Edward Russell (Matt Damon) into a marriage he didn't want. Telling the story of the formative days of the agency, The Good Shepherd is filled with an all-star cast, but Jolie makes sure she's never lost in the fray by remaining true to her character and not trying to make her conventionally sympathetic. Budget: $85m U.S. Gross: $60m\n\nAngelina Jolie's 5 Worst-Reviewed Movies Movie Year Netflix Metascore Users 1 Life or Something Like It 2002 31 5.7 \"Beyond the curious miscasting of Jolie, who can't quite turn lazy flirtatiousness into existential longing, Life or Something Like It offers few diversions.\"\n\n-- Mark Holcomb, Village Voice Jolie starred in a string of forgettable movies from 2000 to 2004, and Life of Something Like It is typical of that period. When a prophet (Tony Shalhoub) tells TV reporter Lanie Kerrigan (Jolie) she has only a week to live, she goes on a predictable journey of self-discovery ... with Edward Burns. Jolie's performance has been noted as one of the few highlights in this shallow story of a materialistic person learning what life is all about. Budget: $40m U.S. Gross: $14.4m 2 Beyond Borders 2003 32 4.7 \"As kitsch, however, it's pretty enjoyable. Jolie and Owen perform with such conviction, and the film -- blissfully unaware of its own badness -- takes its paperback-romance shenanigans with such goofy gravity, that it's easy to get caught up in the whole, soap-opera thrust of the thing. \"\n\n-- Scott Foundas, LA Weekly Jolie plays Sarah Jordan, a sheltered woman who is compelled to leave her easy life and help Clive Owen care for children in Ethiopia, in the uninspired Beyond Borders. Most likely drawn to the project due to her own involvement in humanitarian aid, Jolie delivers a performance as clichéd as the movie itself. A bloated, self-serving snoozer, Beyond Borders is another example of how an actress' passions don't always translate to the big screen. Budget: $35m U.S. Gross: $4.4m 3 Original Sin 2001 33 7.8 \"It's hard to keep a straight face just thinking of Mr. Banderas and Ms. Jolie in the same shot, but \"Original Sin\" will bore the giggles right out of you.\"\n\n-- Elvis Mitchell, The New York Times Once again it turns out that the beautiful woman is not all she seems in Original Sin, with Jolie staring as the femme fatale between Antonio Banderas and Thomas Jane. Jolie brings nothing new to this film noir retread. Notable only for almost receiving a NC-17 rating, Original Sin (along with Lara Croft: Tomb Raider that same year) earned Jolie the first of her many Razzie nominations for worst actress, though she has yet to win. Budget: $42m U.S. Gross: $16.5m 4 Lara Croft: Tomb Raider 2001 33 6.0 \"Remarkably joyless, even though Ms. Jolie is a formidable presence with the potential for becoming a witty one.\"\n\n-- Joe Morgenstern, Wall Street Journal Jolie seemed like the perfect actress to play videogame heroine Lara Croft, and, indeed, she does get the accent down and fits flawlessly into all the right outfits for the part. But everything else about Lara Croft: Tomb Raider is wrong, from a nonsensical plot to a forced father/daughter subplot allowing Jolie's real life dad Jon Voight to share screen time with his daughter. Jolie reprised the role in a superior 2003 sequel (Lara Croft Tomb Raider: The Cradle of Life 43), but her dedication to the part was not enough to bring audiences back for more. Budget: $115m U.S. Gross: $131m 5 Gone in 60 Seconds 2000 35 9.1 \"Even in as nothing a role as the hero's ex, Jolie doesn't have enough to do.\"\n\n-- Charles Taylor, Salon.com In yet another generic action/car chase movie from the house of Bruckheimer, Jolie does what she can as Sway, the clichéd \"one that got away\" from hero Nicolas Cage. Almost no one shines in Gone in 60 Seconds, where the parts are all interchangeable and all that stands out for Jolie is her bizarre hair. It was a poor choice as a follow up to her Oscar-winning role in Girl Interrupted. Budget: $90m U.S. Gross: $102m\n\nWhat do you think?\n\nWhich Jolie films are your favorites -- or least favorites? Are you looking forward to Salt? Let us know in the comments section below.", "images": ["https://static.metacritic.com/images/features/media/thumbs/angelinajolie/salt-180.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/salt.jpg", "https://static.metacritic.com/images/features/main/peacock202004-28.jpg", "https://static.metacritic.com/images/products/tv/1/e951216810bf9b9c61f45b87bdcbf5d8-98.jpg", "https://static.metacritic.com/images/products/tv/8/5a6f27965ef2e3b9c6c41d7ba2cb7e19-98.jpg", "https://static.metacritic.com/images/products/movies/8/49c291191b4b6d4686707f8c802e4462-98.jpg", "https://static.metacritic.com/images/features/main/best_games_2019_residentevil2-28.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/main/decade_best_games_breathofthewild-28.jpg", "https://static.metacritic.com/images/features/main/starz202003-50.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/wanted.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/beyondborders.jpg", "https://static.metacritic.com/images/products/music/9/913ead22b9fdf9f19229581e3914c2b0-98.jpg", "http://www.metacritic.com/images/icons/mc-mustplay-sm.svg", "https://static.metacritic.com/images/features/main/fullyear_movies3-28.jpg", "https://static.metacritic.com/images/features/main/disneyplus202003-50.jpg", "https://static.metacritic.com/images/products/music/5/03fa2f48e7537482619037aa9936c1e8-98.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/skycaptain.jpg", "https://static.metacritic.com/images/features/main/peacock202004-180.jpg", "https://static.metacritic.com/images/products/games/2/0c6d00c4427046c3d07cc2555b943d32-98.jpg", "http://www.metacritic.com/images/icons/mc-mustwatch-sm.svg", "https://static.metacritic.com/images/features/main/coronavirusdelays-180.jpg", "https://static.metacritic.com/images/features/main/amazon202004-50.jpg", "http://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/products/tv/1/b15171baa9dc05e4ed73098b885c3eb4-98.jpg", "https://static.metacritic.com/images/products/movies/0/3a6527d4d2499240200465561fc7b4a7-98.jpg", "http://www.metacritic.com/images/icons/metacritic-icon.svg", "https://static.metacritic.com/images/products/tv/4/2f5d95e7c790ba802ca147105966cb8e-98.jpg", "https://static.metacritic.com/images/products/music/4/ff948221ddeb6cc42360a2e2506f7b69-98.jpg", "https://static.metacritic.com/images/features/main/netflix202004-50.jpg", "https://static.metacritic.com/images/features/main/gamesscorecard2020Q1alt-180.jpg", "http://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/products/music/6/3fac9024d9a862da5cb23f87a4853448-98.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/lifeorsomethinglikeit.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/originalsin.jpg", "https://static.metacritic.com/images/features/main/dvd_2020_04-180.jpg", "https://static.metacritic.com/images/features/main/appletvplus202003-50.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/gonein60seconds.jpg", "https://static.metacritic.com/images/products/movies/0/e2d70ac851a1bbdebc986fe443a4b3ba-98.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/tombraider.jpg", "https://static.metacritic.com/images/products/movies/1/66f6608a0310cf4a3e4c7f2190d18763-98.jpg", "https://static.metacritic.com/images/products/tv/7/23cf7c77f75f932de5ad18fa0142c724-98.jpg", "https://static.metacritic.com/images/features/main/hbo202004-50.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/goodshepherd.jpg", "https://static.metacritic.com/images/products/music/0/5ab703f43374c176ca247856465dccad-98.jpg", "https://static.metacritic.com/images/products/movies/1/dadac636aa14c3b9b9feea1ce09fb43e-98.jpg", "https://static.metacritic.com/images/products/games/5/f174e5f35cf726f0e75fa90ca3d9f83b-98.jpg", "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg", "https://static.metacritic.com/images/features/main/dvd_2020_04-50.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/changeling.jpg", "https://static.metacritic.com/images/features/main/peacock202004-50.jpg", "https://static.metacritic.com/images/features/main/coronavirusdelays-28.jpg", "http://www.metacritic.com/media/thumbs/angelinajolie/mightyheart.jpg", "https://static.metacritic.com/images/products/games/2/fc2b1036e9ce9e224d11e32d5571a5bc-98.jpg", "https://static.metacritic.com/images/products/games/5/e5d85ca5a8ec5a987c8d6fd04625ec14-98.jpg"], "top_img": "https://static.metacritic.com/images/features/media/thumbs/angelinajolie/salt-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/angelina-jolie-best-and-worst-movies", "title": "Angelina Jolie: All Films Considered", "meta_data": {"description": "While the star of this week's \"Salt\" might be one of Hollywood's best-known actors, her filmography is surprisingly short on quality movies. We look at the best and worst films of her career so far.", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "og": {"title": "Angelina Jolie: All Films Considered", "type": "article", "url": "https://www.metacritic.com/feature/angelina-jolie-best-and-worst-movies", "image": "https://static.metacritic.com/images/features/media/thumbs/angelinajolie/salt-180.jpg", "site_name": "Metacritic", "description": "While the star of this week's \"Salt\" might be one of Hollywood's best-known actors, her filmography is surprisingly short on quality movies. We look at the best and worst films of her career so far."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/media/thumbs/angelinajolie/salt-180.jpg"}}, "movies": [], "publish_date": null, "source": "http://www.metacritic.com", "summary": ""}