{"url": "https://deadline.com/2018/01/scandal-how-to-get-away-with-murder-crossover-shonda-rhimes-kerry-washington-viola-davis-htgawm-creator-qa-1202234080/", "text": "EXCLUSIVE: TGIT fans can rejoice – Scandal creator Shonda Rhimes and How to Get Away with Murder creator Peter Nowalk just confirmed our scoop that the two Shondaland drama series will be staging a crossover event this season. Rhimes and Nowalk posted the same screen shot of a page from a crossover script featuring both Kerry Washington’s Scandal character, Washington fixer Olivia Pope, and Viola Davis’ How To Get Away with Murder character, law professor Annalise Keating. It appears to reveal the women’s first meeting. “People. It’s happening,” Rhimes captioned her post (you can see it below), with both using hashtags, #TGITCrossover and #HowtoGetAwaywithScandal.\n\nIn an exclusive interview with Deadline, Nowalk shares as many details as he could without spoiling the stunt for the fans, including who will be part of the crossover and will Washington and Davis share scenes, something the script excerpt confirms. He also provides clues about the storyline’s setting and the event’s timing.\n\nRelated Story Charles Gregory Ross Dies Of COVID-19: Ava DuVernay, Tyler Perry, Lee Daniels, Viola Davis And More Pay Tribute To Legendary Hairstylist\n\nDEADLINE: How did the idea about a Scandal-How To Get Away With Murder crossover come about?\n\nNOWALK: At the beginning of the season, my writers and I were planning out Viola’s entire arc and something in her story organically came up that was very appropriate for Scandal. When I went to Shonda, she heard it. I said, we don’t have to do it, Viola’s arc doesn’t need this, but it’s possible that their stories could cross really organically. She actually pulled up a clip of something from Scandal and their side of the story coalesced perfectly. So it was one of those serendipitous things where we both realized it was good for both characters, and it almost felt like we had been planning it since last season.\n\nAt that point, we just thought about it because we didn’t want it to feel forced, and we just wanted it to happen really naturally. And then if anything bumps along the way, we just won’t do it. We kept getting closer and closer, and it just made more and more sense. I will say, the Scandal read-through, I, as an audience member, just found it so refreshing and fun, and it really felt like Annalise fit in that episode really well. So now the pressure for us for Murder is just to match that level of excitement that they created.\n\nDEADLINE: I assume that the episodes will be tied together in a two-hour block on the same night, with the story starting on Scandal and finishing on How To Get Away With Murder?\n\nNOWALK: Yes.\n\nDEADLINE: Will we see both Olivia on How To Get Away With Murder and Annalise on Scandal as well as on their own shows?\n\nABC\n\nNOWALK: I’ll say the whole two hours takes place in the same setting, and they have that arc over those two hours together.\n\nDEADLINE: One show is set in Philadelphia, the other one in Washington, DC. If the setting is the same throughout the crossover, is that setting Washington, DC, Philadelphia, or a third location?\n\nNOWALK: All I’ll say is that the setting for each of them is consistent. The storyline for Olivia and Annalise takes place in one location.\n\nDEADLINE: Are the events in the two episodes continuous? Is there a gap between what happens on Scandal and Murder?\n\nNOWALK: There’s not much of a gap, and in case someone watches one show on Netflix and not the other, the episodes make sense for each character on their own.\n\nDEADLINE: Will there be scenes with Kerry’s Olivia and Viola’s Annalise together?\n\nNOWALK: Yes, Annalise and Olivia will be in scenes together.\n\nDEADLINE: Will each of them also interact with other characters on the other show?\n\nNOWALK: There will be some of that.\n\nDEADLINE: Is it fair to say that Annalise and Olivia will team up to do something together?\n\nNOWALK: I don’t think we want to give that away yet. If I were a viewer, the thing I would want to see is Kerry and Viola in a scene together, that was really the reason to do it. To have storyline together and really shed light on both of their characters in a new way. That, of course, means that Annalise is in Olivia’s world during the Scandal episode, so she’ll be meeting the Scandal characters, and Olivia is in the Murder world, and she’ll be meeting some of the Murder characters. You’ll see that crossover.\n\nDEADLINE: Will there be any other Scandal and Murder actors crossing over besides the two leads?\n\nNOWALK: Yes, but we are not ready to reveal which ones yet.\n\nDEADLINE: When will the crossover air? Is it going to be close to the series finale of Scandal?\n\nNOWALK: It will be airing a few episodes before the finale,\n\nDEADLINE: Will the crossover be self-contained? Will there be fallout from what happens in it for each of the shows going forward?\n\nNOWALK: Yes, I think why we both agreed to do it, Shonda and I, is it fit into our longer arc. So it’s not like a procedural where it just stands alone and it has nothing to do with the rest of their arcs for the season. They’re actually both very pivotal to each other’s storylines.\n\nDEADLINE: How was it writing for the character of Olivia? You worked on Scandal before creating HTGAWM, right?\n\nNOWALK: I did work on Scandal right before Murder, I worked on it for half of a season, and it’s really fun. You’re getting me where I’m in the middle of it with my writers, and the challenge of this, of course, is writing someone else’s character, which I did for Shonda for years, but I still have that old, staff writer desire to want to make sure that Olivia sounds right and that she’s in keeping with what Shonda has created for her. I kind of was kicking myself when I realized how stressful it would be, but I think it’s really fun to write her, but it’s also really fun to write her with Annalise. I think there’s so much story to mine there between these two very different characters who are powerful in really different ways.\n\nDEADLINE: Who’s writing and directing each of the two crossover episodes?\n\nNOWALK: For the Scandal episode, it’s one of their key writers, Raamla Mohamed, writing and co-star Tony Goldwyn directing. Then we have two of our writers on staff here, Sarah Thompson and Morenike L. Balogun, they’ve been taking lead and working on this for a really long time, because we had to obviously strategize and have all of our ducks in a row and plan really well to make this work. Zetna Fuentes is directing.\n\nDEADLINE: What was the reaction of Kerry and Viola, of the writers on the two shows to the news of a crossover?\n\nNOWALK: What’s lovely about working with the writers on Scandal and vice versa is that we all know each other, and we all have worked together, and so, for me, it was really fun to get to see what their process is and get to just hang out with my old friends who we never get to see each other because we’re all so busy.\n\nShutterstock\n\nFor the actors, I’ve heard secondhand that Kerry was really excited when Shonda told her. Viola had an instant smile on her face, and I think they’ve wanted to work together for a really long time outside of doing publicity. So I think it was really fun for both of them, even though I will say I have to give them both credit. They’re working double stories in these episodes because they added a whole other episode to their schedule. So they’re very tired right now, as they should be, but I think in the end, it will be something really memorable for Shondaland, and I’m loving it. It feels like a boost of energy for us.\n\nDEADLINE: Currently, there is a big mystery on Scandal, a cliffhanger about Quinn. Will Annalise will be involved in the search for Quinn?\n\nNOWALK: I can’t speak to anything about Scandal. You know Shonda. All I know is the episode that Annalise is in about Scandal. So, you know, I like to keep my job here, so I’m not going to answer any Scandal questions.\n\nDEADLINE: Anything else you can tell me about the the making of the crossover, the level of security in how you’ve been planning it?\n\nNOWALK: Well, we thought the security was really good, but you’re also really good at your job, so you found out, but this is as secure as we get with this episode. Scripts are really under lock, and that really is just about maintaining the fun for the audience, because the thrill of these shows is the surprise a bunch of the time, and I think that’s the really good surprise.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pmcdeadline2.files.wordpress.com/2017/10/scandal-4.jpg?w=359&h=240", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pmcdeadline2.files.wordpress.com/2017/12/kerry-washingon-viola-davis-2.jpg?w=630", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/09/147214_05161.jpg?w=359&h=240", "https://pmcdeadline2.files.wordpress.com/2018/01/shutterstnowalkdavis.jpg?w=281&h=281", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F01%2Fscandal-how-to-get-away-with-murder-crossover-shonda-rhimes-kerry-washington-viola-davis-htgawm-creator-qa-1202234080%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202234080&comment_count=2", "https://pmcdeadline2.files.wordpress.com/2018/01/peternowalk.jpg?w=204&h=319"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/12/kerry-washingon-viola-davis-2.jpg?w=630", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/01/scandal-how-to-get-away-with-murder-crossover-shonda-rhimes-kerry-washington-viola-davis-htgawm-creator-qa-1202234080/", "title": "‘Scandal’/’How To Get Away With Murder’ Crossover: Get Details On Big Shondaland Event From ‘HTGAWM’ Creator – Q&A", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Scandal creator Shonda Rhimes and How to Get Away with Murder creator Peter Nowalk confirm a crossover event this season.", "news_keywords": "How To Get Away With Murder, Kerry Washington, Scandal, Shonda Rhimes, Viola Davis", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Scandal’/’How To Get Away With Murder’ Crossover: Get Details On Big Shondaland Event From ‘HTGAWM’ Creator – Q&A", "url": "https://deadline.com/2018/01/scandal-how-to-get-away-with-murder-crossover-shonda-rhimes-kerry-washington-viola-davis-htgawm-creator-qa-1202234080/", "description": "EXCLUSIVE: TGIT fans can rejoice – Scandal creator Shonda Rhimes and How to Get Away with Murder creator Peter Nowalk just confirmed our scoop that the two Shondaland drama series will be staging a…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/12/kerry-washingon-viola-davis-2.jpg?w=630", "width": 630, "height": 423}, "locale": "en_US"}, "article": {"published_time": "2018-01-03T20:04:06+00:00", "modified_time": "2018-01-04T17:26:00+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘Scandal’/’How To Get Away With Murder’ Crossover: Get Details On Big Shondaland Event From ‘HTGAWM’ Creator – Q&A"}, "image": "https://pmcdeadline2.files.wordpress.com/2017/12/kerry-washingon-viola-davis-2.jpg?w=630", "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "‘Scandal’/’How To Get Away With Murder’ Crossover: Get Details On Big Shondaland Event From ‘HTGAWM’ Creator – Q&A", "description": "Scandal creator Shonda Rhimes and How to Get Away with Murder creator Peter Nowalk confirm a crossover event this season."}, "author": "Nellie Andreeva", "content_type": "Article", "post_id": 1202234080, "title": "'Scandal'/'How To Get Away With Murder' Crossover: Get Details On Big Shondaland Event From 'HTGAWM' Creator - Q&A", "published_at": "2018-01-03 12:04:06", "image": "https://pmcdeadline2.files.wordpress.com/2017/12/kerry-washingon-viola-davis-2.jpg?w=296&h=166&crop=1", "comment_count": 2, "tags": "Viola Davis", "topics": "TV", "body": "EXCLUSIVE: TGIT fans can rejoice – Scandal creator Shonda Rhimes and How to Get Away with Murder creator Peter Nowalk just confirmed our scoop that the two Shondaland drama series will be staging a crossover event this season. Rhimes and Nowalk posted the same screen shot of a page from a crossover script featuring both Kerry Washington's Scandal character, Washington fixer Olivia Pope, and Viola Davis' How To Get Away with Murder character, law professor Annalise Keating. It appears to reveal the women's first meeting. \"People. It's happening,\" Rhimes captioned her post (you can see it below), with both using hashtags, #TGITCrossover and #HowtoGetAwaywithScandal.\r\n\r\nIn an exclusive interview with Deadline, Nowalk shares as many details as he could without spoiling the stunt for the fans, including who will be part of the crossover and will Washington and Davis share scenes, something the script excerpt confirms. He also provides clues about the storyline’s setting and the event's timing.\r\n\r\nDEADLINE: How did the idea about a Scandal-How To Get Away With Murder crossover come about?\r\n\r\n\r\n\r\nNOWALK: At the beginning of the season, my writers and I were planning out Viola’s entire arc and something in her story organically came up that was very appropriate for Scandal. When I went to Shonda, she heard it. I said, we don’t have to do it, Viola’s arc doesn't need this, but it’s possible that their stories could cross really organically. She actually pulled up a clip of something from Scandal and their side of the story coalesced perfectly. So it was one of those serendipitous things where we both realized it was good for both characters, and it almost felt like we had been planning it since last season.\r\n\r\nAt that point, we just thought about it because we didn't want it to feel forced, and we just wanted it to happen really naturally. And then if anything bumps along the way, we just won’t do it. We kept getting closer and closer, and it just made more and more sense. I will say, the Scandal read-through, I, as an audience member, just found it so refreshing and fun, and it really felt like Annalise fit in that episode really well. So now the pressure for us for Murder is just to match that level of excitement that they created.\r\n\r\nDEADLINE: I assume that the episodes will be tied together in a two-hour block on the same night, with the story starting on Scandal and finishing on How To Get Away With Murder?\r\n\r\nNOWALK: Yes.\r\n\r\nDEADLINE: Will we see both Olivia on How To Get Away With Murder and Annalise on Scandal as well as on their own shows? \r\n\r\n\r\n\r\nNOWALK: I’ll say the whole two hours takes place in the same setting, and they have that arc over those two hours together.\r\n\r\nDEADLINE: One show is set in Philadelphia, the other one in Washington, DC. If the setting is the same throughout the crossover, is that setting Washington, DC, Philadelphia, or a third location?\r\n\r\nNOWALK: All I’ll say is that the setting for each of them is consistent. The storyline for Olivia and Annalise takes place in one location.\r\n\r\nDEADLINE: Are the events in the two episodes continuous? Is there a gap between what happens on Scandal and Murder?\r\n\r\nNOWALK: There’s not much of a gap, and in case someone watches one show on Netflix and not the other, the episodes make sense for each character on their own.\r\n\r\nDEADLINE: Will there be scenes with Kerry's Olivia and Viola's Annalise together?\r\n\r\nNOWALK: Yes, Annalise and Olivia will be in scenes together.\r\n\r\nDEADLINE: Will each of them also interact with other characters on the other show?\r\n\r\nNOWALK: There will be some of that.\r\n\r\nDEADLINE: Is it fair to say that Annalise and Olivia will team up to do something together?\r\n\r\nNOWALK: I don’t think we want to give that away yet. If I were a viewer, the thing I would want to see is Kerry and Viola in a scene together, that was really the reason to do it.  To have storyline together and really shed light on both of their characters in a new way. That, of course, means that Annalise is in Olivia’s world during the Scandal episode, so she’ll be meeting the Scandal characters, and Olivia is in the Murder world, and she’ll be meeting some of the Murder characters. You'll see that crossover.\r\n\r\nDEADLINE: Will there be any other Scandal and Murder actors crossing over besides the two leads?\r\n\r\nNOWALK: Yes, but we are not ready to reveal which ones yet.\r\n\r\nDEADLINE: When will the crossover air? Is it going to be close to the series finale of Scandal?\r\n\r\nNOWALK: It will be airing a few episodes before the finale,\r\n\r\nDEADLINE: Will the crossover be self-contained? Will there be fallout from what happens in it for each of the shows going forward?\r\n\r\nNOWALK: Yes, I think why we both agreed to do it, Shonda and I, is it fit into our longer arc. So it’s not like a procedural where it just stands alone and it has nothing to do with the rest of their arcs for the season. They’re actually both very pivotal to each other’s storylines.\r\n\r\n\r\n\r\nDEADLINE: How was it writing for the character of Olivia? You worked on Scandal before creating HTGAWM, right?\r\n\r\nNOWALK: I did work on Scandal right before Murder, I worked on it for half of a season, and it’s really fun. You’re getting me where I’m in the middle of it with my writers, and the challenge of this, of course, is writing someone else’s character, which I did for Shonda for years, but I still have that old, staff writer desire to want to make sure that Olivia sounds right and that she’s in keeping with what Shonda has created for her. I kind of was kicking myself when I realized how stressful it would be, but I think it’s really fun to write her, but it’s also really fun to write her with Annalise. I think there’s so much story to mine there between these two very different characters who are powerful in really different ways.\r\n\r\nDEADLINE: Who’s writing and directing each of the two crossover episodes?\r\n\r\nNOWALK: For the Scandal episode, it’s one of their key writers, Raamla Mohamed, writing and co-star Tony Goldwyn directing. Then we have two of our writers on staff here, Sarah Thompson and Morenike L. Balogun, they’ve been taking lead and working on this for a really long time, because we had to obviously strategize and have all of our ducks in a row and plan really well to make this work. Zetna Fuentes is directing.\r\n\r\nDEADLINE: What was the reaction of Kerry and Viola, of the writers on the two shows to the news of a crossover? \r\n\r\nNOWALK: What’s lovely about working with the writers on Scandal and vice versa is that we all know each other, and we all have worked together, and so, for me, it was really fun to get to see what their process is and get to just hang out with my old friends who we never get to see each other because we’re all so busy.\r\n\r\n\r\n\r\nFor the actors,  I’ve heard secondhand that Kerry was really excited when Shonda told her. Viola had an instant smile on her face, and I think they’ve wanted to work together for a really long time outside of doing publicity. So I think it was really fun for both of them, even though I will say I have to give them both credit. They’re working double stories in these episodes because they added a whole other episode to their schedule. So they’re very tired right now, as they should be, but I think in the end, it will be something really memorable for Shondaland, and I’m loving it. It feels like a boost of energy for us.\r\n\r\nDEADLINE: Currently, there is a big mystery on Scandal, a cliffhanger about Quinn. Will Annalise will be involved in the search for Quinn?\r\n\r\nNOWALK: I can’t speak to anything about Scandal. You know Shonda. All I know is the episode that Annalise is in about Scandal. So, you know, I like to keep my job here, so I’m not going to answer any Scandal questions.\r\n\r\nDEADLINE: Anything else you can tell me about the the making of the crossover, the level of security in how you’ve been planning it?\r\n\r\nNOWALK: Well, we thought the security was really good, but you’re also really good at your job, so you found out, but this is as secure as we get with this episode. Scripts are really under lock, and that really is just about maintaining the fun for the audience, because the thrill of these shows is the surprise a bunch of the time, and I think that’s the really good surprise.\r\n\r\nhttps://www.instagram.com/p/Bdf_2U7D-cU/?hl=en&amp;amp;taken-by=shondarhimes", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1515009846.0, "source": "https://deadline.com", "summary": ""}