{"url": "https://en.wikipedia.org/wiki/Colin_Jost", "text": "American comedian, actor, and writer\n\nColin Kelly Jost ( , born June 29, 1982) is an American comedian, actor and writer.[1][2] He has been a writer for Saturday Night Live since 2005 and \"Weekend Update\" writer since 2014. He also served as one of the show's co-head writers from 2012 to 2015; Jost came back as one of the show's head writers in 2017.[3][4][5][6]\n\nEarly life [ edit ]\n\nColin Jost was born and raised in the Grymes Hill[7] neighborhood of Staten Island, New York, the elder of two boys. [8][9][10] His brother, Casey Jost, had a role in Staten Island Summer and is a writer for Impractical Jokers.[11] His mother, Kerry J. Kelly, was the chief medical officer[12] for the New York City Fire Department, and his father, Daniel A. Jost, is a former teacher at Staten Island Technical High School.[13][14] Raised Roman Catholic, he attended Regis High School in Manhattan, where he was the editor of the school newspaper The Owl,[11] and Harvard University,[8] where he studied the History and Literature of Russia and Britain and was president of the Harvard Lampoon.[9][15] During his freshman year there, he lived in Greenough Hall.\n\nCareer [ edit ]\n\nWhile at Harvard, Jost won $5,250 on a college edition of Weakest Link. After graduation, he was hired as a writer at NBC's Saturday Night Live (SNL) in 2005.[8]\n\nFrom 2009 to 2012, Jost was SNL's writing supervisor. He was co-head writer from 2012 to 2015, and regained that status in late 2017.[16] He often collaborates with fellow SNL co-head writer Rob Klein.[17] During the summer hiatus following the 2012–13 season, executive producer Lorne Michaels asked Jost if he could do the \"Weekend Update\" feature,[8] as co-anchor Seth Meyers would soon be leaving to host Late Night With Seth Meyers. Jost accepted and replaced Meyers on the March 1, 2014, episode.[18]\n\nJost names Norm Macdonald as a primary influence for his Update anchor work, as Macdonald's tone was the one Jost grew up with in high school. He also names Tina Fey as an influence.[8] In addition to Weekend Update, Jost made a brief cameo appearance as Ohio Governor John Kasich in a Republican presidential debate sketch.[19]\n\nAs a stand-up comedian, Jost has appeared on Late Night With Jimmy Fallon as well as on TBS and HBO.[20] He was selected as a \"New Face\" at the Montreal Just for Laughs festival in 2009,[21] and has since appeared at the Chicago Just for Laughs festival in 2011 and 2012 and the Montréal festival in 2010 and 2012. Jost has published four \"Shouts and Murmurs\" pieces in The New Yorker magazine, in addition to writing for The New York Times Magazine, The Huffington Post, The Staten Island Advance and Radar.[22] Jost wrote the screenplay of and played a minor role in the 2015 comedy film Staten Island Summer. He also had a minor role as Paul in the 2016 romcom feature How to Be Single.[23]\n\nIn late 2018, Jost and Green Bay Packers quarterback Aaron Rodgers appeared in an advertising campaign for Izod.[24]\n\nJost, along with Michael Che, appeared on the March 4, 2019 episode of WWE's Monday Night Raw, where both were announced as special correspondents for WrestleMania 35 on April 7. That same episode, they got involved in a storyline with wrestler Braun Strowman, eventually resulting in both Jost and Che becoming participants in the André the Giant Memorial Battle Royal at WrestleMania.[25][26] At the event, Jost and Che went under the ring for the majority of the match, and then tried to eliminate Strowman while he was trying to do the same to the Hardy Boyz. Jost attempted to calm the situation by using his therapist, but Strowman chokeslammed him and eliminated the comedians in quick succession, winning the battle royal.[27]\n\nPersonal life [ edit ]\n\nJost began a relationship with actress Scarlett Johansson in May 2017.[28] It was confirmed in May 2019 that Jost and Johansson were engaged.[29]\n\nJost was involved in controversy in April 2019 when Uproxx writer Steven Hyden published an article detailing the public backlash against him.[30] This caused Jost's Weekend Update co-anchor Che to criticize Hyden, including vandalizing Hyden's Wikipedia page.[31]\n\nJost was dorm-mates with 2020 Democratic presidential candidate Pete Buttigieg while the two lived in Leverett House at Harvard.[32] In 2015, Jost donated $100 to Buttigieg's mayoral reelection campaign.[33][34] Subsequently, amid Buttigieg's presidential campaign, Jost portrays Buttigieg during the 45th season of SNL.[32][35]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nBibliography [ edit ]\n\nAwards and honors [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Colin_Jost_in_2019_%28cropped%29.jpg/220px-Colin_Jost_in_2019_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/7/78/Colin_Jost_in_2019_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Colin_Jost_at_Citi_Field%2C_2015.jpg/170px-Colin_Jost_at_Citi_Field%2C_2015.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/7/78/Colin_Jost_in_2019_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Colin_Jost", "title": "Colin Jost", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/7/78/Colin_Jost_in_2019_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}