{"url": "deadline.com/2018/06/johnny-depp-fraud-lawsuit-no-delay-rolling-stone-interview-1202415951/", "text": "EXCLUSIVE: Warner Bros escaped a potential Fantastic Beasts PR nightmare today as Johnny Depp was denied an attempt to push back the trial over his $25 million fraud suit against his former business managers.\n\nThe rejection came this morning from a Los Angeles Superior Court judge for the Pirates of the Caribbean star after a lengthy profile in Rolling Stone that was far more of a train wreck than testimonial for Depp, who has been faced with many lawsuits as of late. What is perhaps equally unusual is that this is Depp’s lawsuit.\n\nIn a role much more commonly assumed by defendants, the plaintiff actor was trying to delay the suit that he instigated. It was a pose that Depp repeatedly also tried with the deposition he finally gave to lawyers at Kinsella Weitzman Iser Kump & Aldisert LLP in late May.\n\nHaving flown in from Washington D.C., Depp’s primary lawyer Benjamin Chew sought to have the August 15 jury proceedings shoved another 60 days — which would be in mid-October. If the ex parte application had been successful, it could have had the unanticipated consequence of throwing rotten egg on the now AT&T-owned WB, the studio of Fantastic Beasts: The Crimes of Grindelwald which is set for a November release.\n\nAlready forced to weather more than a little controversy over Depp’s participation in the JK Rowling’s franchise and now under new bosses, the last thing WB would have wanted was the possible waft of Depp’s dirty laundry — financial and otherwise — to come out during their peak press period for the tentpole pic.\n\nFortunately for the studio, who had nothing to do with today’s actions, the Honorable Teresa Beaudet wanted to stick to the schedule and get things dealt with sooner rather than later. “The ex parte application is denied at this time,” the LASC Judge wrote in longhand on the proposed order Friday.\n\nShe added, “The parties are to work with the discovery referee to create a schedule to complete the discovery prior to the FSC (final status conference).”\n\n“The parties have agreed to and scheduled a mediation on July 14, 2018 before the Honorable Peter Lichtman (Ret.) of JAMS,” noted Chew in the unsuccessful application with the court today. Chew is now with DC’s Brown Rudick. Prior to that, he was with repping Depp at Manatt, Phelps & Phillips LLP.\n\n“That date was the first available date that the parties and Judge Lichtman could conduct a mediation,” Chew added. “In light of the close proximity of that mediation date to the August 15th trial date and the related pre-trial filing dates which back up from the August 3, 2018 Final Status Conference, without a trial continuance the parties will effectively had been required to complete virtually all of their discovery and trial preparation prior to attending the mediation. A brief trial continuance would enable the parties to some extent to conserve the resources which would otherwise be devoted to completing discovery and trial preparation to be used for settlement purposes at the mediation.”\n\nNot so much, retorted the other side.\n\n“Although the parties have scheduled a private mediation for July 14, 2018—the first available date because of Depp’s current rock n’ roll tour—continuing the trial date prior to the mediation would be counter-productive,” said Team TMG.\n\n“There is no reason to assume that the action will settle at the mediation, and continuing the trial date will only decrease the odds of settlement,” the defense lawyers declared. “The discovery grounds upon which the Depp Parties seek a trial continuance are the result of their own gamesmanship, delay and lack of diligence.”\n\nNow battling ex-bodyguards who claim drug abuse and owed pay as well as a countersuit from his former longtime attorney, Depp first sued The Management Group back in January 2017.\n\nAt the time and since, the actor alleged that, despite making hundreds of millions of dollars, he was feeling the financial pinch because of having been swindled in the Hollywood accounting shell game by those he trusted and the much-respected TMG.\n\nThe Management Group swung back with a countersuit of their own in early 2017 over unpaid commissions and tales of excess and irresponsibility — to put it very mildly. The suit proclaimed that the actor, who banks upt $20 million a picture plus a share of profits, had spending habits that were the real cause of his emptying bank accounts. Among the various residences, dozens of vehicles, tens of thousands a month on wine, guitar collection, artwork, hangers-on, sibling provisions, security, acting assistants and other indulgences, TMG’s reaction revealed that the Fear and Loathing In Las Vegas star paid out $3 million to have Hunter S. Thompson’s ashes shoot out of a cannon in 2005 and forks out more $2-million in monthly expenses.\n\nDoing himself a few favors as custodian of his own funds, Depp bragged to Rolling Stone that the cost for the tribute to Thompson was actually closer to $5 million and that he blew a lot more than $30,000 a month on wine.\n\nLate last year, before Depp started shedding lawyers faster than Jack Sparrow does goodwill, TMG add another lawsuit to the pyre. “Depp listened to no one, including TMG and his other advisors, and he demanded they fund a lifestyle that was extravagant and extreme,” the business managers stated in foreclosure filings against the actor for a $5 million loan TMG said they made to him to bail him out a few years back.\n\nAs the summer trial seems certain to occur, Depp himself was not in court today. Playing a set tonight at the Hellfest in Clisson, France, the guitar-strumming actor is on a summer tour with Alice Cooper, Aerosmith’s Joe Perry and other members of the Hollywood Vampires band – livin’ the dream, for now.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F06%2Fjohnny-depp-fraud-lawsuit-no-delay-rolling-stone-interview-1202415951%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202415951&comment_count=146", "https://pmcdeadline2.files.wordpress.com/2018/03/fantastic-beasts-the-crimes-of-grindelwald-poster.jpg?w=320&h=474", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "http://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pmcdeadline2.files.wordpress.com/2011/05/johnny_depp_penelope_cruz_pirates4_20110520175138-e1305913972899.jpg?w=340&h=216", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2018/06/johnny-depp-june-19.jpg?w=1024"], "top_img": "https://pmcdeadline2.files.wordpress.com/2018/06/johnny-depp-june-19.jpg?w=1024", "keywords": [], "authors": ["Dominic Patten"], "canonical_link": "https://deadline.com/2018/06/johnny-depp-fraud-lawsuit-no-delay-rolling-stone-interview-1202415951/", "title": "Johnny Depp Loses Bid To Delay $25M Fraud Trial On Heels Of Train Wreck Rolling Stone Profile", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "After a disastrous magazine profile was published yesterday, 'Fantastic Beasts' actor Johnny Depp got more bad news in court on Friday", "news_keywords": "Fantastic Beasts: The Crimes Of Grindelwald, Johnny Depp, Pirates of the Caribbean, The Management Group, Warner Bros", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Johnny Depp Loses Bid To Delay $25M Fraud Trial On Heels Of Train Wreck Rolling Stone Profile", "url": "https://deadline.com/2018/06/johnny-depp-fraud-lawsuit-no-delay-rolling-stone-interview-1202415951/", "description": "EXCLUSIVE: Warner Bros escaped a potential Fantastic Beasts PR nightmare today as Johnny Depp was denied an attempt to push back the trial over his $25 million fraud suit against his former busines…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/06/johnny-depp-june-19.jpg?w=1024", "width": 1200, "height": 703, "alt": "Johnny Depp"}, "locale": "en_US"}, "article": {"published_time": "2018-06-23T01:06:08+00:00", "modified_time": "2018-06-24T20:35:08+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Johnny Depp Loses Bid To Delay $25M Fraud Trial On Heels Of Train Wreck Rolling Stone Profile"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/06/johnny-depp-june-19.jpg?w=1024", "alt": "Johnny Depp"}, "card": "summary_large_image", "creator": "@DeadlineDominic", "title": "Johnny Depp Loses Bid To Delay $25M Fraud Trial On Heels Of Train Wreck Rolling Stone Profile", "description": "After a disastrous  magazine profile was published yesterday, 'Fantastic Beasts' actor Johnny Depp got more bad news in court on Friday"}, "author": "Dominic Patten", "content_type": "Article", "post_id": 1202415951, "title": "Johnny Depp Loses Bid To Delay $25M Fraud Trial On Heels Of Train Wreck Rolling Stone Profile", "published_at": "2018-06-22 18:06:08", "image": "https://pmcdeadline2.files.wordpress.com/2018/06/johnny-depp-june-19.jpg?w=296&h=166&crop=1", "comment_count": 146, "tags": "Warner Bros", "topics": "Film", "body": "EXCLUSIVE: Warner Bros escaped a potential Fantastic Beasts PR nightmare today as Johnny Depp was denied an attempt to push back the trial over his $25 million fraud suit against his former business managers.\r\n\r\nThe rejection came this morning from a Los Angeles Superior Court judge for the Pirates of the Caribbean star after a lengthy profile in Rolling Stone that was far more of a train wreck than testimonial for Depp, who has been faced with many lawsuits as of late. What is perhaps equally unusual is that this is Depp’s lawsuit.\r\n\r\nIn a role much more commonly assumed by defendants, the plaintiff actor was trying to delay the suit that he instigated. It was a pose that Depp repeatedly also tried with the deposition he finally gave to lawyers at Kinsella Weitzman Iser Kump & Aldisert LLP in late May.\r\n\r\n\r\n\r\nHaving flown in from Washington D.C., Depp’s primary lawyer Benjamin Chew sought to have the August 15 jury proceedings shoved another 60 days — which would be in mid-October. If the ex parte application had been successful, it could have had the unanticipated consequence of throwing rotten egg on the now AT&T-owned WB, the studio of Fantastic Beasts: The Crimes of Grindelwald which is set for a November release.\r\n\r\nAlready forced to weather more than a little controversy over Depp’s participation in the JK Rowling's franchise and now under new bosses, the last thing WB would have wanted was the possible waft of Depp’s dirty laundry — financial and otherwise — to come out during their peak press period for the tentpole pic.\r\n\r\nFortunately for the studio, who had nothing to do with today's actions, the Honorable Teresa Beaudet wanted to stick to the schedule and get things dealt with sooner rather than later. “The ex parte application is denied at this time,” the LASC Judge wrote in longhand on the proposed order Friday.\r\n\r\nShe added, \"The parties are to work with the discovery referee to create a schedule to complete the discovery prior to the FSC (final status conference).\"\r\n\r\n\"The parties have agreed to and scheduled a mediation on July 14, 2018 before the Honorable Peter Lichtman (Ret.) of JAMS,\" noted Chew in the unsuccessful application with the court today. Chew is now with DC's Brown Rudick. Prior to that, he was with repping Depp at Manatt, Phelps & Phillips LLP.\r\n\r\n\"That date was the first available date that the parties and Judge Lichtman could conduct a mediation,\" Chew added. \"In light of the close proximity of that mediation date to the August 15th trial date and the related pre-trial filing dates which back up from the August 3, 2018 Final Status Conference, without a trial continuance the parties will effectively had been required to complete virtually all of their discovery and trial preparation prior to attending the mediation. A brief trial continuance would enable the parties to some extent to conserve the resources which would otherwise be devoted to completing discovery and trial preparation to be used for settlement purposes at the mediation.\"\r\n\r\nNot so much, retorted the other side.\r\n\r\n\"Although the parties have scheduled a private mediation for July 14, 2018—the first available date because of Depp's current rock n' roll tour—continuing the trial date prior to the mediation would be counter-productive,\" said Team TMG.\r\n\r\n\"There is no reason to assume that the action will settle at the mediation, and continuing the trial date will only decrease the odds of settlement,\" the defense lawyers declared. \"The discovery grounds upon which the Depp Parties seek a trial continuance are the result of their own gamesmanship, delay and lack of diligence.\"\r\n\r\n\r\n\r\nNow battling ex-bodyguards who claim drug abuse and owed pay as well as a countersuit from his former longtime attorney, Depp first sued The Management Group back in January 2017.\r\n\r\nAt the time and since, the actor alleged that, despite making hundreds of millions of dollars, he was feeling the financial pinch because of having been swindled in the Hollywood accounting shell game by those he trusted and the much-respected TMG.\r\n\r\n\r\n\r\nThe Management Group swung back with a countersuit of their own in early 2017 over unpaid commissions and tales of excess and irresponsibility — to put it very mildly. The suit proclaimed that the actor, who banks upt $20 million a picture plus a share of profits, had spending habits that were the real cause of his emptying bank accounts. Among the various residences, dozens of vehicles, tens of thousands a month on wine, guitar collection, artwork, hangers-on, sibling provisions, security, acting assistants and other indulgences, TMG’s reaction revealed that the Fear and Loathing In Las Vegas star paid out $3 million to have Hunter S. Thompson’s ashes shoot out of a cannon in 2005 and forks out more $2-million in monthly expenses.\r\n\r\nDoing himself a few favors as custodian of his own funds, Depp bragged to Rolling Stone that the cost for the tribute to Thompson was actually closer to $5 million and that he blew a lot more than $30,000 a month on wine.\r\n\r\nLate last year, before Depp started shedding lawyers faster than Jack Sparrow does goodwill, TMG add another lawsuit to the pyre.  “Depp listened to no one, including TMG and his other advisors, and he demanded they fund a lifestyle that was extravagant and extreme,” the business managers stated in foreclosure filings against the actor for a $5 million loan TMG said they made to him to bail him out a few years back.\r\n\r\nAs the summer trial seems certain to occur, Depp himself was not in court today. Playing a set tonight at the Hellfest in Clisson, France, the guitar-strumming actor is on a summer tour with Alice Cooper, Aerosmith’s Joe Perry and other members of the Hollywood Vampires band - livin' the dream, for now.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1529715968.0, "source": "http://deadline.com", "summary": ""}