{"url": "http://tasteofcountry.com/tim-mcgraw-faith-hill-speak-to-a-girl-video/", "text": "Tim McGraw and Faith Hill turn the heat up in their \"Speak to a Girl\" video.\n\nThe country couple have released a number of steamy duets and videos over the years, but none more so than this one, which shows the superstars in private moments, sharing kisses, fingers intertwined, Hill laying with her head in her husband's lap. There are also shots of her sitting in his lap facing him, caressing his face while singing the lyrics directly to him, and later they face each other while passionately delivering the lyrics to the bridge, highlighting the natural chemistry that has no doubt helped keep them together for 20 years.\n\nThough the video doesn't show any real skin or overtly sexual themes, its moody lighting — paired with the crackling attraction between the two superstars and the glimpse viewers get into their intimate moments — make \"Speak to a Girl\" the sexiest video of the year so far.\n\nSee Tim McGraw and Faith Hill Through the Years\n\nThe couple have recorded many hit duets over the years, but \"Speak to a Girl\" is the lead single from their first-ever joint album, which is expected later in 2017. The song bears a special message that both singers relate to, especially as parents to daughters.\n\n\"The message of the song is just so profound. It just meant a lot to both of us I think about what it said,\" McGraw says. \"And the day and age that we live in, sometimes in all the noise, how you speak to someone person-to-person and face-to-face gets lost.\"\n\n\"It’s really about how we communicate period in general as human beings,\" Hill adds. \"We just have to speak the truth, it’s as simple as that, you either lie or you speak the truth.\"\n\nMcGraw and Hill are also touring together in 2017 for the first time in a decade, which also marks Hill's first national tour during that time. Their 2017 Soul2Soul Tour kicked off in April and is slated to run all the way through October.", "images": ["https://townsquare.media/site/204/files/2017/06/tim-mcgraw-faith-hill-speak-to-a-girl-video-still.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "http://townsquare.media/site/204/files/2018/04/toc-logo-high-rez.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6665296&cv=2.0&cj=1"], "top_img": "https://townsquare.media/site/204/files/2017/06/tim-mcgraw-faith-hill-speak-to-a-girl-video-still.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Sterling Whitaker"], "canonical_link": "https://tasteofcountry.com/tim-mcgraw-faith-hill-speak-to-a-girl-video/", "title": "Tim McGraw, Faith Hill Get Sexy in 'Speak to a Girl' Video [Watch]", "meta_data": {"instagram_profile": "tasteofcountry", "description": "Tim McGraw and Faith Hill turn the heat up in their new video for their current duet, Speak to a Girl.", "keywords": "tim mcgraw faith hill speak to a girl, tim mcgraw faith hill speak to a girl video, tim mcgraw faith hill speak to a girl song, tim mcgraw faith hill new video duet, tim mcgraw faith hill joint album", "fb": {"app_id": 193351250697247, "admins": 8802808, "pages": 173910492638623}, "og": {"title": "Tim McGraw, Faith Hill Get Sexy in 'Speak to a Girl' Video [Watch]", "description": "Tim McGraw and Faith Hill turn the heat up in their new video for their current duet, Speak to a Girl.", "url": "https://tasteofcountry.com/tim-mcgraw-faith-hill-speak-to-a-girl-video/", "site_name": "Taste of Country", "type": "article", "image": "https://townsquare.media/site/204/files/2017/06/tim-mcgraw-faith-hill-speak-to-a-girl-video-still.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@tasteofcountry"}, "sailthru.description": "Tim McGraw and Faith Hill turn the heat up in their new video for their current duet, Speak to a Girl.", "sailthru.date": "2017-06-06 11:28:00", "sailthru.title": "Tim McGraw + Faith Hill’s ‘Speak to a Girl’ Video Is So Hot, We Feel Guilty Watching", "sailthru.tags": "tsmsite-tasteofcountry, tsmmarket-national, tsmtype-national, faith-hill, tim-mcgraw, country-music-news, country-music-videos, official-music-videos", "sailthru.author": "sterlingwit", "sailthru.image.full": "https://townsquare.media/site/204/files/2017/06/tim-mcgraw-faith-hill-speak-to-a-girl-video-still.jpg", "sailthru.image.thumb": "https://townsquare.media/site/204/files/2017/06/tim-mcgraw-faith-hill-speak-to-a-girl-video-still.jpg", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "google-site-verification": "e19BTQtucrkVk-O5axdlPIIJWMrqGU-QRWcldJZvxnA", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1496719680.0, "source": "http://tasteofcountry.com", "summary": ""}