{"url": "www.hollywoodreporter.com/news/jennifer-garners-trainer-launches-wellness-app-called-bbs-1101013", "text": "Celeb-beloved Body By Simone founder Simone De La Rue and nutritionist-to-the-stars Kelly LeVeque collaborated on BBS, using artificial intelligence to customize fitness and nutrition programs for users.\n\nLeave it to two A-list wellness gurus to democratize customized fitness and nutrition programs for the world. The dream team of Body By Simone personal trainer Simone De La Rue and nutritionist Kelly LeVeque — whose client list includes the likes of Jennifer Garner, Emmy Rossum, Jessica Alba and Molly Sims — have just released an app that gives users access to their expertise for a very nominal monthly fee.\n\nBut it’s not just an app stuffed with content — more than 900 minutes of video and hundreds of recipes — that leaves users to their own devices to navigate and motivate. For $19.99/month, the platform actually uses artificial intelligence software to create customized workout plans and nutrition programs for each individual, taking into consideration their specific goals. It tracks progress via measurements and weekly photos, and reminds users via push notifications to work out. “It is programmed to provide the customization of a personal workout with me,” says De La Rue, adding, “This has never been done before in a fitness app.”\n\nBut while it may seem the app approach speaks only to the general population, De La Rue says hers and LeVeque’s celebrity clients are “very excited, especially as they are often on set or traveling. They can have their dream team in their pocket.” The impetus for the app was a desire to have a platform available to anyone in the world, since the Aussie trainer on E’s Revenge Body can’t be everywhere at once. For a more 360-degree approach, she wanted to include a nutritionist, and because of their several shared clients (Garner and Rossum among them) and complementary beliefs and philosophies, LeVeque was the ideal fit.\n\nWhen it comes to nutrition, protein and plants are at the core. Recipes run the gamut and might include Jen Garner’s Chocolate Blueberry #fab4smoothie, with collagen, almond butter, spinach, flax and other nutritious ingredients. Says LeVeque of their approach: “Protein ups collagen, muscle tone and metabolism. Fat benefits hormones, skin and cellular health and does not store as fat as simple carbs do. Fiber for gut microbiome proliferation and detoxification, and greens or veggies deep in color to fight inflammation.” These “fab four” foods are at the core of her recipes.\n\nThe workouts mix up methodology to keep things interesting, and never use props so they can be done literally anywhere. De La Rue’s favorite currently: dance cardio. “It’s an incredible workout, burns calories, teaches you coordination, challenges your brain to learn choreography and it’s fun and joyous,” she says. The pair’s one-stop-shop app also doles out motivational words and advice, since that’s key to many people’s success with a new wellness plan.\n\nLeVeque suggests users get up and exercise first thing in the morning, since a fasted workout has the same benefits as intermittent fasting, which causes a surge in human growth hormone and testosterone to help burn fat. Additionally, she advocates for early dinners, before dark — which seems decidedly un-Hollywood but has very Hollywood ramifications. “An early dinner allows for the body to digest the meal, balance blood sugar and clear excess insulin before you head to bed,” says LeVeque, “so you can benefit from a fat-burning, belt-shrinking night of sleep!” We see why Garner and Rossum swear by these ladies.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2018/04/screen_shot_2018-04-09_at_10.40.35_am_2_-_h_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/04/screen_shot_2018-04-09_at_10.40.35_am_2_-_h_2018.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/04/screen_shot_2018-04-09_at_10.40.35_am_2_-_h_2018.jpg", "keywords": [], "authors": ["Kathryn Romeyn", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/jennifer-garners-trainer-launches-wellness-app-called-bbs-1101013", "title": "Jennifer Garner's Trainer Launched a Wellness App That Uses Artificial Intelligence", "meta_data": {"viewport": "width=device-width", "description": "Celeb-beloved Body By Simone founder Simone De La Rue and nutritionist-to-the-stars Kelly LeVeque collaborated on BBS, using artificial intelligence to customize fitness and nutrition programs for users.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/jennifer-garners-trainer-launches-wellness-app-called-bbs-1101013", "domain": "https://www.hollywoodreporter.com/", "title": "Jennifer Garner's Trainer Launched a Wellness App That Uses Artificial Intelligence", "description": "Celeb-beloved Body By Simone founder Simone De La Rue and nutritionist-to-the-stars Kelly LeVeque collaborated on BBS, using artificial intelligence to customize fitness and nutrition programs for users.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/04/screen_shot_2018-04-09_at_10.40.35_am_2_-_h_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Jennifer Garner's Trainer Launched a Wellness App That Uses Artificial Intelligence", "description": "Celeb-beloved Body By Simone founder Simone De La Rue and nutritionist-to-the-stars Kelly LeVeque collaborated on BBS, using artificial intelligence to customize fitness and nutrition programs for users.", "url": "https://www.hollywoodreporter.com/news/jennifer-garners-trainer-launches-wellness-app-called-bbs-1101013", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/04/screen_shot_2018-04-09_at_10.40.35_am_2_-_h_2018.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Jennifer Garner's Trainer Launched a Wellness App That Uses Artificial Intelligence", "sailthru.description": "Celeb-beloved Body By Simone founder Simone De La Rue and nutritionist-to-the-stars Kelly LeVeque collaborated on BBS, using artificial intelligence to customize fitness and nutrition programs for users.", "sailthru.author": "Kathryn Romeyn", "sailthru.vertical": "Style", "sailthru.date": "2018-04-09 10:51:38", "sailthru.tags": "Style"}, "movies": [], "publish_date": 1523242298.0, "source": "http://www.hollywoodreporter.com", "summary": ""}