{"url": "https://people.com/music/demi-lovato-simply-complicated-documentary-highlights/", "text": "Image zoom Demi Lovato/Youtube\n\nDemi Lovato has always been honest with her fans, but the singer has never been more real about the first quarter of her life — until now.\n\nThe 25-year-old star’s new documentary, Simply Complicated, which premiered on YouTube on Tuesday, provides an in-depth look at her career trajectory through never-before-seen home videos and candid talks.\n\nGet push notifications with news, features and more.\n\nFrom the making of her latest album, Tell Me You Love Me, and the continuing battle with her eating disorder to the aftermath of her breakup from ex-boyfriend Wilmer Valderrama and a revelation on her sexuality, Lovato holds nothing back during the seven months of filming in early 2017.\n\nDirected by Hannah Lux Davis, the 78-minute film also revisits Lovato’s ups and downs of her road to recovery and sobriety from the first-person point of view in addition to confessionals from members of her inner circle, including longtime friends Nick and Joe Jonas.\n\nHere are the six most revealing moments from Simply Complicated:\n\nImage zoom Jon Kopaloff/FilmMagic\n\n“I Was Either Craving Drugs or on Drugs”\n\nFrom the opening scene of the film, Lovato reveals she was doing cocaine for the majority of filming her last documentary, Stay Strong. The singer says her first encounter with drinking and partying was in high school, but it all escalated during her Disney Channel days. “I loved it,” she recalls of her past drug use, starting at age 17.\n\n“I felt out of control the first time I did it. My dad was an addict and an alcoholic. Guess I always searched for what he found in drugs and alcohol because it fulfilled him and he chose that over a family,” Lovato says.\n\nThe Grammy nominee has been vocal about her struggles with addiction, receiving inpatient treatment for the first time in 2011 after punching her backup dancer Alex “Shorty” Welch, who outed her for using Adderall during the Colombian leg of the Camp Rock 2 Tour. The incident led to a two-month “bender” when Lovato was “using daily.”\n\n“I just came to a breaking point; the next 12 months were extremely difficult,” she says about entering treatment at 18. However, relapsing was imminent.\n\n“I was using while I had a sober companion and I went through like 20 sober companions. I was either craving drugs or on drugs. I was not easy to work with,” she recalls of life post-treatment. “It’s embarrassing to look back at the person that I was.”\n\nRELATED GALLERY: Everything Demi Lovato Has Said About Her Sobriety Journey\n\nImage zoom Demi Lovato/Youtube\n\n“I Was Helping Her Back to Being the Demi We Love”\n\nMany of Lovato’s loved ones helped her get to the sober lifestyle she leads today, including Nick Jonas, who costarred in the Camp Rock franchise from 2008 – 2010 and experienced the Disney Channel era alongside her when they were both 15.\n\n“It was actually the Jonas Brothers waving the flag, and saw Demi veering in a different direction,” Lovato’s manager John Taylor says of her drug and alcohol abuse.\n\n“While we were on tour Demi and Joe’s relationship had become really complicated so I was playing the bridge,” Nick, 25, admits about his 28-year-old brother’s brief romance with Lovato, who says she “friggin’ fell in love with [Joe], in real life,” though the courtship only lasted “like a month or two.”\n\nNick continues, “It became really good you know between she and I for a while and growing closer than we’ve ever been. I remember thinking in my head I felt a bit of pride about it, like selfishly maybe I was helping her back to being the Demi we know and love. She’s not going to do anything crazy, she’ll be fine and then this episode happened.” (The “episode” Nick refers to is Lovato’s punching incident, which Kevin Jonas Sr. had to step in and supervise.)\n\nMike Bayer, who is Lovato’s personal-development coach and founder of Cast Centers, remembers the lowest point in her downward spiral when her management team threatened to walk away if things didn’t change for the better. “The most important fear to Demi is losing people, is losing people that she cares about and that love her. That’s the most important thing to Demi,” Bayer tells viewers.\n\nOn the act of surrender in recovery, Lovato remembers: “That’s when the change is going to happen.”\n\nImage zoom Demi Lovato/Instagram\n\n“My Heart Is Always with Wilmer”\n\nThe pop star and the That ’70s Show alum, 37, announced on Instagram in June 2016 that they had ended their relationship after almost six “loving and wonderful” years together, but the love she has for Valderrama has yet to fade.\n\n“I’ve never loved anybody like I loved Wilmer and I still love him,” Lovato tells viewers, even sharing the exact date she first laid eyes on the actor. “I met him on Jan. 11, 2010. I thought ‘I have to have him,’ but I was only 17 and he was like, ‘Get away from me,'” she jokes, though she adds: “When I turned 18 we started dating. I think it was love at first sight, we connected on a level that I’ve never connected with anybody before, he was just my rock, my everything.”\n\nAnd for the first time, Lovato dissects the breakup and gives insight into why they split.\n\n“The sparks never faded but there are issues that I haven’t conquered yet that I know I won’t conquer if I’m relying on somebody else to take care of the loneliness. I just wasn’t ready and there was so much in my life that I hadn’t explored yet … That was one of the reasons why we broke up because I’ve never been alone,” she explains. “It had nothing to do with falling out of love, we decided together we just probably are better as friends.“\n\nEven still, there are times when Lovato thinks what if. “I do have moments where it’s late at night and I’m lonely and I wonder if I made the right decision because love is a gamble. I don’t know if I’ll lose him for the rest of my life,” she says. “I think my heart is always with Wilmer, I think it was with Wilmer, I think it is with Wilmer, I think it will be. Because you don’t share six years with somebody and not give them a piece of your heart and vice versa. I’m pretty sure that I’m not going to meet anybody that compares to him but I’m trying to keep an open heart and open mind when it comes to that.”\n\nImage zoom Demi Lovato/Youtube\n\n“Food Is Still the Biggest Challenge in My Life”\n\nThough Lovato is extremely proud of abstaining from drugs and alcohol for nearly six years, she has yet to effectively treat her eating disorder.\n\n“When I was in a relationship with Wilmer I went three years without purging and when we broke up that’s one of the first things I did,” she admits to manager and confidant Phil McIntyre. “The less I have to think about food, the easier it is to go about having a normal life and I don’t want to let anybody down so when I do have moments when I slip up, I feel very ashamed. What started the relapse was missing Wilmer. And when I feel lonely my heart feels hungry and I end up binging.”\n\nLovato traces back her struggles with food to her childhood\n\n“The food came first, when I was 8 years old and my little sister was born, a lot of the attention was taken off me and onto my little sister,” she says of sibling Madison de la Garza. “I had started working at that time and was under a lot of stress so I would bake cookies for my family and I would eat all of them and nobody would have any to eat. That was my first memory of food being that medicine for me.”\n\nFast forward to the present, Lovato confesses “food is still the biggest challenge in my life” though she does not disclose the date of her latest purge.\n\n“I don’t want to give it the power that it controls my every thought but it’s something that I’m constantly thinking about,” she says. “Body image, what I wish I could be eating, what I wish I could be eating next, what I wish I didn’t eat, you know it’s just constant. I get envious towards people who don’t struggle with an eating disorder because I think my life would be so much easier.”\n\nImage zoom\n\n“I Am on a Dating App with Both Men and Girls”\n\nDuring a fitting, Lovato tells her stylist Avo Yermagyan that she has been using the secret and exclusive dating app Raya, which is nicknamed the Tinder for Illuminati and the famous person’s Listserv.\n\n“I am on a dating app with both men and girls,” she says. “I am open to human connection so whether that’s through a male or female, it doesn’t matter to me. … I do like athletes, there is something sexy about someone putting in all of their physical strength into their passion.“\n\nThe star relates to her Lovatics fandom when she talks about first-date jitters and playing mind games and power plays with crushes over text. “There’s a certain stigma around women having casual sex and for me, I feel it’s my body, it’s my choice. It’s exciting. It’s a connection with somebody and it’s fun,” she says.\n\nAnd to future suitors, Lovato warns: “When I’m comfortable in my own skin, I feel confident and when I feel confident, I feel sexy and when I feel sexy, watch out.”\n\nImage zoom Dennis Leupold\n\n“I’m Learning How to Be a Voice and Not a Victim”\n\nSimply Complicated is merely a chapter in Lovato’s lifestyle of being an open book. She’s just 25 after all, but she’s already lived through a lot.\n\n“Looking back it was hard on anyone, let alone a kid,” Lovato says of growing up in the spotlight. Manager McIntyre chimes in: “Looking back at it, I could connect the dots and see that there was an immense amount of pressure. She was living two lives. Here she was squeaky clean on the Disney Channel, all types of moral clauses and just intensity around behavior. Once the camera stops rolling she’s living another life she couldn’t really be herself she couldn’t be a normal teenager.“\n\nFrom booking Camp Rock at 15 to confronting demons with addiction and living with mental illness, Lovato doesn’t need a documentary to remember what she’s overcome.\n\n“The last decade has taught me a lifetime of lessons. I’ve learned that secrets make you sick, I’m learning how to be a voice and not a victim, I’ve learned sex is natural, I’ve learned that love is necessary, heartbreak is unavoidable and loneliness is brutal. I’ve learned that the key to being happy is to tell your truth, and be okay without all the answers,” she says.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-2-2000-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-prem-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fdemi-lovato.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-21.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fnick-jonas-2000-1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-1-2000.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/music/demi-lovato-simply-complicated-documentary-highlights/", "title": "Demi Lovato Documentary Highlights: Drug Addiction, Heartbreak, Eating Disorder", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Demi Lovato,Health,Music News,News,Rehab", "news_keywords": "Demi Lovato,Health,Music News,News,Rehab", "description": "The star’s new documentary provides an in-depth look at her career trajectory through never-before-seen home videos and candid talks", "og": {"title": "Demi Lovato Documentary Highlights: Drug Addiction, Heartbreak, Eating Disorder", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/demi-lovato-simply-complicated-documentary-highlights/", "description": "Demi Lovato&nbsp;has always been honest with her fans, but the singer has never been more real about the first quarter of her life — until&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/demi-lovato-simply-complicated-documentary-highlights/", "description": "The star’s new documentary provides an in-depth look at her career trajectory through never-before-seen home videos and candid talks", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/demi-lovato-simply-complicated-documentary-highlights/", "title": "Demi Lovato Documentary Highlights: Drug Addiction, Heartbreak, Eating Disorder", "description": "The star’s new documentary provides an in-depth look at her career trajectory through never-before-seen home videos and candid talks", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fdemi-lovato-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}