{"url": "https://web.archive.org/web/20170901064818/http://hermoments.com:80/actors-describe-their-sex-scenes/", "text": "entertainment\n\nTo be a successful actor means you have to be very brave. You need to be prepared to let everything hang out for the world to see.\n\nThat doesn’t just mean exposing your emotional vulnerabilities, either. Actors often have to peel off their clothes and pretend to get intimate with folks who are, for the most part, strangers.\n\nIf you’ve ever wondered what’s going through an actor’s head when they’re filming sex scenes, you’re not alone. Thankfully, more than one actor has spoken out about this strange situation. Keep going to hear what they have to say about filming sex scenes!\n\n1. Rosamond Pike on Gone Girl: “You are alone with a man who’s not your husband; he’s in his underwear, you’re in your underwear, and you’re sort of dry humping on a bed… we think, ‘OK, we should be professional about this. We should film this on an iPhone and see how it looks.’ Then you watch this thing back and it looks like we’re making some sort of super creepy home porn movie.”\n\n2. Justin Timberlake on Friends With Benefits: “It’s actually kind of annoying. You’re there for 12 hours; it’s exhausting,” Timberlake told BBC Newsbeat. “All those scenes revolve around the dialogue and physical humor is so tiring.”\n\n3. Amy Schumer on Trainwreck: “The sex scenes that are funny, I don’t care, but the ones that are actually sexual, it’s like these people are seeing me be really vulnerable,” Schumer told The New York Times. “Frank, who’s holding the boom, is seeing, ‘Oh, this is what Amy is like when she really means business.’ In between every single take, I think I screamed, ‘It’s so embarrassing!'”\n\n4. Michael Fassbender on Shame: “You talk with your partner and say, ‘What are you comfortable with? What are you not comfortable with?’ And then you go for it. You try and throw away the safety nets and not worry where the camera’s gonna be or how you’re gonna look or worry about looking ugly.”\n\n5. Jennifer Lopez on The Boy Next Door: “Those scenes are embarrassing. They are uncomfortable, but your job as an actress or an actor is to make it believable, and this movie in particular … hinges on if that was believable, that it was enough to make this guy go insane.”\n\n6. Hugh Grant on Four Weddings and a Funeral: “The conventional response to sex scenes is that they’re horrible and not sexy and it’s all so unnatural. But I’ve always found filming sex scenes to be quite a turn-on. I like the experience of being in a sexual position when you’re not supposed to be in one.”\n\n7. Mindy Kaling on The Mindy Project: Kaling isn’t afraid to get real about fake sex. “Obviously on-screen sex is not actual penetrative sex, but as any religious high-schooler will tell you, simulating sex can be pretty damn enjoyable as well.”\n\n8. Jake Gyllenhaal on Love & Other Drugs: “It’s not awkward; it’s our job,” he said with loads of sarcasm in a recent interview. “That’s the tough life of being an actor in the movie business nowadays. It’s exhausting.” It must be, Jake; most of us will never know.\n\n9. Jennifer Lawrence on Passengers: “I called my mom, and I was like, ‘Will you just tell me it’s OK?’ It was just very vulnerable. And you don’t know what’s too much. You want to do it real, you want everything to be real, but then… that was the most vulnerable I’ve ever been.”\n\n10. Ashton Kutcher on No Strings Attached: “There is sort of always this awkward state of, ‘Is this OK? Is that OK?’ And then in between, it’s like, just, ‘Let’s act like nothing happened.’ And then you see how good of an actor you really are.”\n\n11. Dakota Johnson on Fifty Shades of Grey: “Filming a sex scene is not a sensual or pleasurable environment. It’s really hot—not in a steamy, sexual way. It’s just sweaty and it’s not very comfortable. And on top of that, my hands and legs were tied, and I was blindfolded, and I was being hit with this bizarre tool.”\n\n12. Ryan Reynolds on The Change-Up: “The scene is over now… And I reflexively, like an idiot, just put my hands right back on her breasts. And I think I’m doing it to cover them up, but I’m realizing now that it’s a very fine line between chivalry and, you know, workplace sexual assault.”\n\n13. Issa Rae on Insecure: “Young black people have sex. Sometimes it’s good sex, sometimes it’s bad sex, sometimes it’s revenge sex. There’s so many different facets. It’s such a privilege to show that and it feels so real. The writer in me is always excited to write those scenes.”\n\n14. James McAvoy on Wanted: He’s one of the male stars who gets nervous. “It’s sweaty and uncomfortable. My paranoia is, the girl I’m doing the sex scene with will think I’m getting off on her, I have nightmares about that, I really do.\n\n15. Kristen Stewart on The Twilight Saga: Breaking Dawn, Part 2: “On Twilight we had to do the most epic sex scene of all time. It had to be transcendent and otherworldly, inhuman, better sex than you can possibly ever imagine, and we were like, ‘How do we live up to that?’ It was agony. Which sucks, because I wanted it to be so good.”\n\n16. Dave Franco on Neighbors: “You meet each other and then you’re grinding—you don’t even know her name, barely. You have 20 crew members who are also watching you do it. And then, of course, for me, I woke up that morning and I had a giant pimple on my ass… It sucks, right?”\n\n17. Mila Kunis on Black Swan: “It’s hard to have a sex scene, period. It doesn’t matter if it’s a friend, a male, a female. You’re with 100-something crew members, lighting you, re-positioning you, there’s no comfort whatsoever.”\n\n18. Jonathan Rhys Meyers on Dracula: “Sex scenes, first of all, are very easy to do, because you’re usually given somebody to work with who is very beautiful and attractive, so that makes it much easier, do you know what I mean? I’m telling you, you do two days of shooting sex scenes on a film set, you’ll be exhausted after it.”\n\n19. Viola Davis on How to Get Away With Murder: “If I’m in a sex scene, I want to play the sex scene. I want to say, ‘This is why I’m attracted to you. It’s gotten to this point. This is what my body looks like. I saw it as an opportunity way bigger than doing good work. I saw it as an opportunity for a dark-skinned actress of 50 to be in a role that’s sexualized, not sexy.”\n\n20. Ryan Gosling on Blue Valentine: “Actors become very professional and proficient about watching out for each other’s light and not stepping on each other’s lines. All of these things are artificial, and you have to strip that away if you’re going to achieve a sense of intimacy.”\n\n\n\n\n\n21. Natalie Dormer on Game of Thrones: “The choreography of sex scenes is so unsexy and un-glamourous. It’s all about camera angles; you have to recreate the moment so many times. It’s just timing and technical.” It seems like the same things some actors hate, others love…\n\n22. Henry Cavill on The Tudors: “It’s actually acutely uncomfortable being naked in a roomful of people. The very last thing it is is sexy. The actual physicality is very uncomfortable. All you’re doing is smacking your nuts against someone, and nothing is going in.”\n\n23. Margot Robbie on The Wolf of Wall Street: For Margot, it’s all in a day’s work. “It’s just like, ‘This is what you need to do. Get on with it.’ The sooner you do it, the sooner you can stop doing it. It’s so awkward.”\n\n24. Charlie Hunnam on Sons of Anarchy: “I try to be sensitive to the fact that we’re doing something intimate, but also keep a clear boundary. Because I’m in a very committed relationship, and I’m also cognizant that it’s not my girlfriend’s favorite part of my job.”\n\n25. Lena Dunham on Girls: “I used to wear this patch, but… this patch—you glue it over your vagina. It gets sweaty and always falls off. My male co-stars, at the end of the day, don’t care… I never understand when people say, ‘Sex scenes are so mechanical; it doesn’t feel like anything.’ It feels like someone f–king you! It’s confusing.”\n\n\n\n\n\n26. Jon Hamm on Bridesmaids: “I mean, sure, there’s an awkwardness about being in a weird flesh-colored thong, bouncing on top of an actress. And I am not a small human being. I weigh at least 200 pounds and I’m 6-foot-2.”\n\n27. Emilia Clarke on Game of Thrones: “I get a lot of crap for having done nudes scenes and sex scenes. That, in itself, is so antifeminist. Women hating on other women is just the problem. That’s upsetting, so it’s kind of wonderful to have a scene where I was like, ‘There you go!'”\n\n28. Liam Hemsworth on The Dressmaker: “It’s always pretty awkward when you have to take off your pants in front of the crew and other actors and all that stuff. During the scene, it’s fine. You don’t feel uncomfortable whilst the cameras are rolling.”\n\n29. Nicole Kidman on Big Little Lies: “The worst is a sex scene where the sex is non-consensual. I was just lying there, sort of broken and crying, and I remember at one point my director coming over and just sort of placing a towel over me because I was just lying there in half-torn underwear and just basically on the ground with nothing on.”\n\n30. Luke Evans on The Girl on the Train: “I got us drunk before our big sex scene. I thought we should have a little drink just to take the edge off. We were tipsy. We were show-tunes-singing-drunk while having fake sex. We sang Lion King.”\n\n31. Anne Hathaway on Love & Other Drugs: “These are people who have no trouble taking their clothes off—in a way their bodies are their currency. But they’re terrified of exposing their vulnerability—of becoming emotionally naked.”\n\n32. Daniel Radcliffe on Kill Your Darlings: “The toughest was my first gay sex scene. Basically, gay sex, especially for the first time, is really f–king painful. And my director said that he had never seen that portrayed accurately on film before. He wanted it to look like an authentic loss of virginity.”\n\n33. Kristen Dunst on The Beguiled: “I don’t like it. I don’t like it. To be honest, I’m like, ‘Let’s get this over with as fast as possible.’ At least my last director was like, ‘We’re going to get this done quick. We’re just gonna shoot it here, we’ll do three takes, be done.'”\n\nIt sounds like shooting a sex scene on camera is, for the most part, kind of awkward—but also fun in certain ways. Will you ever look at sex scenes the same way?\n\nShare this post with your friends below!", "images": ["https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x683-170728085240-1024.jake-gyllenhaal.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2015515/rs_1024x759-150615152706-1024.jon-hamm-bridesmaids.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x759-170728085604-1024.hugh-grant.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017316/rs_1024x759-170416190411-1024.Lena-Dunham-Girls-Finale.kg.041617.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2014928/rs_1024x759-141028181513-1024.Sons-of-Anarchy-Charlie-Hunnam.ms.102814.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x683-170728085902-1024.jennifer-lopez.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x730-170728090412-1024.ryan-reynolds.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x649-170728085443-1024.ashton-kutcher.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/logo.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x708-170728085836-1024.james-mcavoy.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2016224/rs_1024x759-160324100926-1024.the-mindy-project-1.ch.032416.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/uploads/sites/14/2017/08/actor-1-664x442.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/20131124/rs_1024x759-131224133759-1024.WolfofWallStreet-jmd-6-122413.jpg", "https://web.archive.org/web/20170901064818im_/https://www.facebook.com/tr?id=780958225275101&ev=PageView&noscript=1", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x677-170728085529-1024.henry-cavill.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x683-170728085102-1024.jennifer-lawrence.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/share_mail.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017530/rs_1024x759-170630105216-1024.game-of-thrones-3.ch.063017.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/201682/rs_1024x759-160902075436-1024.dressmaker5.cm.9316.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/star.png", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/mobile-logo.png", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/share_facebook.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x681-170728085137-1024.justin-timberlake.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x683-170728090316-1024.natalie-dormer.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/logo_grey_scroll_down.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017612/rs_1024x727-170712142610-1024.insecure-1.71217.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/201516/rs_1024x759-150206155417-1024-1fifty-50-shades-of-grey.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x682-170728085947-1024.jonathan-rhys-meyers.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017613/rs_1024x683-170713091031-1024-nicole-kidman-big-littlelies-071317.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2016828/rs_1024x554-160928071410-1024.luke-evans.92816.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/201292/1024.BreakingDawn9.mh.100212.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/share_twitter.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x682-170728090249-1024.mila-kunis.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x681-170728090018-1024.michael-fassbender.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x576-170728085507-1024.dave-franco.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2015615/rs_1024x759-150715071831-1024.Bill-Hader-Amy-Schumer-Trainwreck.jl.071515.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x683-170728090438-1024.viola-davis.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/logo_white.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017521/rs_1024x683-170621165558-1024.Beguilded-Movie-Photos-1.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x682-170728090348-1024.ryan-gosling.72717.jpg", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x576-170728093055-1024.daniel-radcliffe.72817.jpg", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/themes/hermoments/images/hm_icon_email.png", "https://web.archive.org/web/20170901064818im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017628/rs_1024x683-170728085213-1024.anne-hathaway.72717.jpg", "https://web.archive.org/web/20170901064818im_/https://sp.analytics.yahoo.com/spp.pl?a=10000&.yp=10018916", "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/uploads/sites/14/2017/08/rose2.png"], "top_img": "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/uploads/sites/14/2017/08/rose2.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170901064818/http://hermoments.com/actors-describe-their-sex-scenes/", "title": "33 actors dish on all of the sex scenes they've ever shot", "meta_data": {"description": "If you've ever wondered what it's like to film sex scenes, these 33 actors have you covered. They share everything you've ever wanted to know!", "og": {"locale": "en_US", "type": "article", "title": "33 Famous Actors Reveal What It's Really Like to Shoot a Sex Scene", "description": "And they don't hold anything back.", "url": "https://web.archive.org/web/20170901064818/http://hermoments.com/actors-describe-their-sex-scenes/", "site_name": "Her Moments", "updated_time": "2017-08-30T17:48:35+00:00", "image": {"identifier": "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/uploads/sites/14/2017/08/rose2.png", "width": 700, "height": 370}}, "article": {"author": "https://www.facebook.com/pg/HerMoments-695680793974842/", "tag": "sex scenes", "section": "Entertainment", "published_time": "2017-08-30T17:47:55+00:00", "modified_time": "2017-08-30T17:48:35+00:00", "category": "Entertainment"}, "twitter": {"card": "summary", "description": "If you've ever wondered what it's like to film sex scenes, these 33 actors have you covered. They share everything you've ever wanted to know!", "title": "33 actors dish on all of the sex scenes they've ever shot", "image": "https://web.archive.org/web/20170901064818im_/http://hermoments.com/wp-content/uploads/sites/14/2017/08/rose2.png"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "generator": "WordPress 4.8", "visibility_mode": "non-hidden"}, "movies": [], "publish_date": 1504115275.0, "source": "https://web.archive.org", "summary": ""}