{"url": "https://www.nme.com/blogs/nme-blogs/american-horror-story-cult-episode-3-whats-the-deal-with-those-chemical-trucks-2142861", "text": "As if American Horror Story: Cult wasn’t already creepy enough, yet another alarming element has been thrown into the mix. Not only do the residents of Brookfield Heights, Michigan have to contend with a gang of killer clowns and a power-hungry angry young man in Kai Anderson, but now their streets are also being sprayed with a mysterious chemical by people in black haz mat suits, riding around in a truck that glows a very eerie green.\n\nOf course, the first of all the residents to notice the peculiar vehicle is Ally Mayfair-Richards. She’s so perturbed by its sudden appearance on her street that, the second time it appears, she races outside and stands in its path, only to have to jump out of its way at the last second when it becomes clear she’ll be mown down if she doesn’t.\n\nthis bitch really thinks that jumping in front of a chemical truck and screaming at it is really gonna work #ahscult pic.twitter.com/sJPgl3Yzh4 — em • loverfest east! (@feverdreamlover) September 20, 2017\n\nAdvertisement\n\nFans on Reddit are suggesting the gas being sprayed in her neighbourhood could be symbolic. So far, her wife Ivy has tried to convince her that every sighting of clowns she’s reported is in her head. Are these newcomers mocking the fact that she’s effectively being gaslighted by her partner?\n\nThe green glow of the truck is also notable. In a happier scene in this week’s episode, Ally, Ivy and son Oz are eating ice cream in the couple’s restaurant. Ivy comments that nobody’s tried the mint green tea flavour before feeding some to her wife. Is it coincidence that the ice cream is the exact same shade of bright green as the lights on the truck? Or is this yet another subtle signifier that Ivy has already been initiated into the cult and is now part of a plot against Ally?\n\nDid ya notice that \"mint green tea\" is the same color as that green chemical they spraying. allys wife is in on it shes in the cult #AHSCult pic.twitter.com/dyyGocqJoW — Macho Man Geo Savage ?? (@WavyDonDada) September 20, 2017\n\nMaybe whatever is being sprayed from the truck has already got to Ally’s head because, as frustrated fans have pointed out on Twitter, she doesn’t even think to use any of the modern technology at her disposal to try and help her figure out who the truck belongs to or where it’s come from. Instead of using the phone in her hand to film the vehicle as it drives past, she opts for the obviously much brighter idea of walking right up to one of the suited-up sprayers, screaming at them and pulling at their outfits until they remove their mask to reveal another mask with a smiley face just like the one the clowns have painted on their victims’ homes. We’d probably pass out too faced with that unexpected reveal.", "images": ["https://www.nme.com/wp-content/uploads/2017/09/01_SARAH_MASTER-BEDROOM_0141_EXPANDED_RGB_F-696x442.jpg", "https://www.nme.com/wp-content/uploads/2017/09/01_SARAH_MASTER-BEDROOM_0141_EXPANDED_RGB_F.jpg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg", "https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/09/01_SARAH_MASTER-BEDROOM_0141_EXPANDED_RGB_F.jpg", "keywords": [], "authors": ["Rhian Daly"], "canonical_link": "https://www.nme.com/blogs/nme-blogs/american-horror-story-cult-episode-3-whats-the-deal-with-those-chemical-trucks-2142861", "title": "‘American Horror Story: Cult’ episode 3: fans think there’s significance in the green ice cream", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "There's yet another creepy element arrived in Ally's formerly quiet neighbourhood", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "'American Horror Story: Cult' episode 3: fans think there's significance in the green ice cream | NME", "description": "There's yet another creepy element arrived in Ally's formerly quiet neighbourhood", "url": "https://www.nme.com/blogs/nme-blogs/american-horror-story-cult-episode-3-whats-the-deal-with-those-chemical-trucks-2142861", "site_name": "NME Music News, Reviews, Videos, Galleries, Tickets and Blogs | NME.COM", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/09/01_SARAH_MASTER-BEDROOM_0141_EXPANDED_RGB_F.jpg", "secure_url": "https://www.nme.com/wp-content/uploads/2017/09/01_SARAH_MASTER-BEDROOM_0141_EXPANDED_RGB_F.jpg", "width": 1000, "height": 635}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "tag": "American Horror Story", "section": "NME Blogs", "published_time": "2017-09-20T10:42:08+00:00"}, "twitter": {"card": "summary_large_image", "description": "There's yet another creepy element arrived in Ally's formerly quiet neighbourhood", "title": "'American Horror Story: Cult' episode 3: fans think there's significance in the green ice cream | NME", "site": "@nme", "image": "https://www.nme.com/wp-content/uploads/2017/09/01_SARAH_MASTER-BEDROOM_0141_EXPANDED_RGB_F.jpg", "creator": "@nme"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1505904128.0, "source": "https://www.nme.com", "summary": ""}