{"url": "https://variety.com/2018/film/features/keira-knightley-colette-metoo-directing-1202663863/", "text": "Keira Knightley speaks her mind.\n\nWhile most movie stars frequently offer up anodyne responses to reporters’ inquiries and deploy an army of publicists and image makers to ensure they never say anything remotely controversial, Knightley refuses to dodge tough questions. She’s ostensibly talking to Variety about “Colette,” a historical drama centering on the legendary French novelist that will premiere Jan. 20 at the Sundance Film Festival, but Knightley is more comfortable holding forth on the topical subjects of feminism, sexism and the lack of opportunities for female directors than she is talking about her creative process.\n\nThat’s what makes the 32-year-old actress a natural fit for the title role in the indie production. The mononymous Colette, perhaps best known for her novella “Gigi,” was a barrier breaker. A woman who had romances with women and men, and who rose to the top of belle époque society by writing stories, such as “Chéri” and the Claudine novels, that had a refreshing sexual candor. But some glass ceilings proved difficult to shatter for the literary sensation. She was involved in an exploitative relationship with her husband, a writer known as Willy (played in the film by Dominic West), who passed Colette’s work off as his own, reaping both the critical acclaim and financial rewards for himself.\n\nNadav Kander for Variety\n\n“Colette” hits Sundance looking for a U.S. distributor. It should attract interest from buyers thanks to Knightley’s compelling central performance — and because it’s a portrait of a feminist pioneer that seems tailor-made for the #MeToo and #TimesUp moments.\n\n“It’s definitely hashtag Colette too,” says director and co-writer Wash Westmoreland. “Her story of a man trying to shut up a woman and a woman being stifled by a man’s ego is still going on today and has been going on throughout history. There have been seismic changes at various points, where you have things like the suffragette movement, and we’re having another tectonic shift right now. Women are saying, ‘No more. We’re not putting up with predatory bullshit.’”\n\nKnightley intends to be one of those actresses pushing for change, even as her career is busier than ever. “Colette” is one of four films she’s appearing in this year, the others being the historical drama “The Aftermath,” the anthology entry “Berlin, I Love You,” and the Disney fantasy “The Nutcracker and the Four Realms.” The actress says she was motivated to throw herself back into work after taking more than a year off to give birth to and bond with her daughter, Edie.\n\nBefore heading to the mountains of Park City, Knightley sat down with Variety to talk about Hollywood’s sexual harassment crisis, the downside of celebrity and why it was “traumatic” becoming a star in “Pirates of the Caribbean” at age 18.\n\nWhy did you want to portray Colette?\n\nIt’s wonderful to play inspiring women and to get their stories and their voices out there. Within her writing, Colette was questioning the idea of gender and the idea of what was naturally feminine as opposed to society’s take on being feminine. The 1890s in France, the belle époque, is interesting to look back on because there was a lot of sexual freedom. Colette had female lovers and had what I suppose we would call a transgender lover. She felt that it was her right to experience pleasure and to give pleasure. That’s still a revolutionary idea for women.\n\nWould Colette’s behavior be scandalous today?\n\nWe’ve come very far, but if you had a very famous writer or actress today who was living in the way that she did, there would still be a sense of scandal about it. As much as the 1960s were a period of male sexual liberation and definitely a period where we got the pill and there was a sense of freedom, I think that women’s sexual liberation is still a process. What’s interesting is she was experiencing that and writing about that at the end of the 19th century.\n\nNadav Kander for Variety\n\nIn the film, Colette revels in her celebrity. Do you have a different relationship with fame?\n\nI think in a funny way I’ve gone exactly the opposite direction, which is again why I sort of really enjoy playing these total extroverts. … I enjoy that kind of quality of somebody that wants to stand in the center of the room and go, ‘Look at me, look at me, look at me.’ Because I’m the one at the side of the room, normally trying to get out the door or hiding in the bathroom. As an actor you sometimes get to be the person that you want to be as opposed to the person you are.\n\nWhen you’re playing a role, do you mind being the center of attention?\n\nThere’s always a wall that I have to try to smash through to get over what is basically stage fright. I’m never totally at ease putting on somebody else’s skin, because I know that I’m being watched doing it. But there’s a joy in the bravado once you’re doing it. You don’t always get there. Sometimes you’re very aware that it’s you out there and lots of people are looking at you and you’re doing something quite strange, but there are moments where you do get lost in the character.\n\nDo you still get stage fright?\n\nIt’s better. I know what it is now. I know that it’s a step that I have to get through. For me, theater work was incredibly helpful because it actually made me go, ‘Oh, that’s what this feeling is.’ In a funny way, when you’re on a film set you don’t understand that it’s stage fright because you’re not onstage, you’re on a set, and it’s just a camera and not an audience. But actually it’s still a very vulnerable thing to do with a lot of people looking at you.\n\n“Colette” may have been conceived years ago and shot months ago, but her struggle has a greater resonance in the #MeToo and #TimesUp era. Do you see parallels between the barriers that Colette faced and the rights that women are advocating for today?\n\nThere certainly are parallels. The fact that the movie is coming out right now isn’t a surprise.\n\nWash, the director, and his late partner [the writer and director Richard Glatzer] were trying to get this movie made for about 15 years. I don’t think it’s a surprise that it managed to get funding in the last few years when it had never managed to get funding before. Women’s stories are suddenly viewed as important.\n\nAre companies backing more female-dominated stories?\n\nWith the rise of Netflix and Amazon we’re seeing some strong female characters and female stories on streaming services. I don’t know about films as much. I don’t really do films set in the modern day because the female characters nearly always get raped. I always find something distasteful in the way women are portrayed, whereas I’ve always found very inspiring characters offered to me in historical pieces. There’s been some improvement. I’m suddenly being sent scripts with present-day women who aren’t raped in the first five pages and aren’t simply there to be the loving girlfriend or wife.\n\nWhat are your thoughts on the harassment scandal that’s engulfed Hollywood?\n\nWhat’s been really interesting is that it’s not just this industry — it’s in every industry. I was surprised by some of the specifics. But I was aware of the culture of silencing women and the culture of bullying them, and I knew that men in the industry were allowed to behave in very different ways than women. That was obvious. What was fascinating about the #MeToo movement was I was sitting with friends who weren’t in the industry, and there wasn’t one of us who hadn’t been assaulted at some point. We’d never had that conversation before. That was an eye-opener.\n\n“I was sitting with friends who weren’t in the industry, and there wasn’t one of us who hadn’t been assaulted.”\n\nKeira Knightley\n\nHave you ever been harassed or assaulted while working on a film?\n\nI’m fortunate that I’ve never been sexually abused professionally or harassed on a film set, but in my personal life, when I’ve been in bars, I can count four times when I’ve been what I’d say was assaulted in a minor way. I think everyone has battled their fair share of monsters. It’s not just actresses. It’s teachers; it’s lawyers. I’m not talking about rape, but I’m talking about the people who had been grabbed in pubs or their breasts had been fondled by somebody they didn’t know or they’d had someone shove a hand up their skirt.\n\nFor too long, you really did go, ‘Oh, this is just normal.’ It’s terrifying that was our response. It must have been awful for all of those brave women who have come forward and spoken publicly about their experiences. There’s been a lot of pain and a lot of suffering. We’re in a period of time in which it all has to come out. Then we need to move forward and figure out how to make sure that it doesn’t happen again.\n\nYou made movies like “Begin Again” and “The Imitation Game” with The Weinstein Co. Harvey Weinstein, the studio’s co-founder, has been accused of harassing and abusing dozens of women. What was your experience with him?\n\nMy experience with Harvey Weinstein was always very professional. He was very good on the films we made. I was aware of his reputation of being a bully. He was famous for phoning people in the middle of the night and screaming at them. He didn’t do that to me, and he certainly never asked me for massages or anything like that. I wasn’t aware of any allegations or rape or sexual assault against him. For the first time people are sharing their stories. People have been absolutely terrified to talk about it and were scared of retribution, so I don’t think everybody knew the extent of what was going on.\n\nDo you think the media treats actresses differently than actors?\n\nAbsolutely. Constantly. Why don’t journalists ask men how they balance their home life and their career? Why don’t you ask male actors how they feel being a father and going off to shoot a movie? And yet more times than not, that’s the first question that I’ll be asked — how do you balance motherhood with your career?\n\nWhat about closing the pay gap? Have you demanded to be paid as much as your male co-stars?\n\nFor the first time recently I got paid a little bit more than my male co-stars. I haven’t tried to push back on it much. I think I probably should have. My approach has been not to ask because I would have been really angry, which is stupid. I’ve been putting my head in the sand, I’m afraid.\n\nAre you finding more scripts from female writers, or projects being offered to you with female directors?\n\nThere are quite a few scripts written by women; it’s the directors that have been massively lacking. I’ve worked with a number of female filmmakers, and they’ve all been wonderful. They haven’t always found it easy to get another film off the ground even when the films we’ve done have been very well reviewed. It’s a big problem. When there are female writers and directors and producers, the parts for women are better, and so the way that society views women through drama is much better and much more well rounded.\n\nWhat did you think of “Lady Bird”? That was written and directed by Greta Gerwig and felt like a fresh take on the relationship between mothers and daughters.\n\nIt’s such a wonderful film, but it’s absolutely insane that I’ve never seen something like this on-screen before. I know every intricacy of the relationship between fathers and sons, and even fathers and daughters. The female experience is really not there. So it’s extraordinary that in 2017 that seems revolutionary. You should see a spectrum of female relationships.\n\nDirector Wash Westmoreland directs Keira Knightley in “Colette.”\n\nWould you ever direct?\n\nI have thought about directing. Right now there’s that classic female thing of being too terrified of it not being perfect. It’s a terrible affliction, because really what you should just do is dive in and give it a go. Maybe one day I’ll get over my fear and just do it. I hope there are many more courageous women than me who actually will.\n\nYou have four films coming out this year. Are you a workaholic?\n\nIt’s been busy. I took a year off when I was pregnant and after I had my kid. It was interesting, because when you have a child it’s amazing and fulfilling, but you feel like your identity can in some way be subsumed by being a mother. I had a real feeling of needing to feel like I am still me, so I attached myself to an awful lot of projects, and I got to the last one, which was actually “Colette,” and realized I was absolutely knackered, so I’ve taken the last six months off.\n\nI was the daughter of a working mother, and I know how important it was to me and my sense of self to see my mom working. I want my daughter to see that I’m doing something that I love. I want her to know that whatever field she chooses, she can have a kid and she can still pursue a career.\n\nWhy did you want to do “The Nutcracker”?\n\nYou can’t say no to playing the Sugar Plum Fairy. I’d been doing a lot of work that was quite subtle, and I wanted something that was totally off the wall.\n\nYou have a really outrageous hairdo in the film. What inspired the Sugar Plum Fairy?\n\nThe candy cane hair is because she was a sweetie, but there were also a couple of Tory female politicians that I thought of. She’s Margaret Thatcher meets Marilyn Monroe.\n\nAre you going to do more family films?\n\nNo. My taste is always going to be darker. I love strange, complex characters, and what’s great about my job is I get to try to understand people that I wouldn’t necessarily like.\n\nWould you make the leap to television?\n\nI intend to. I’ve been sent a lot of pilots. It’s a different way of reading scripts because quite often you’re only sent the first script and you’re not sent the rest of the series. Maybe they haven’t written them, but I find it to be a difficult concept. At some point, I’m just going to have to dive in and give it a go. I’m going to go wherever the great roles are.\n\nYou do a lot of period films like “The Duchess” or “Anna Karenina.” Do you like corset roles?\n\nFor years I felt quite guilty about it, like it was something that I should try to shake off. Then I realized that these were the films I’ve always loved watching. I think some people find escapism through science fiction or fantasy, and I suppose my escapism into another world has always been through period drama. It’s nice that in my 30s I can finally admit that.\n\nNadav Kander for Variety\n\nDid you always want to act?\n\nApparently I first asked for an agent when I was 3. My dad was an actor and my mom was a writer, so I was surrounded by it. My parents were hugely part of political theater in the ’70s and the early ’80s, and there was a sense that it was something important. You weren’t just an actor. You were an activist and you could change the world. For a kid to grow up in that, it was intoxicating.\n\nDo you want your daughter to go into acting?\n\nI really, really, really hope that she doesn’t. However, people that do it don’t have a choice. It’s a calling. I hope she’s going to be an environmental lawyer or something spectacular, but I’m going to be the kind of parent where whatever interest she has, I’m going to be supportive.\n\nYou became a star at 18 with “Pirates of the Caribbean.” What was it like to be famous at an age when most people are attending their proms?\n\nI found it pretty horrific. I’m not an extrovert, so I found that level of scrutiny and that level of fame really hard. It was an age where you are becoming, you haven’t become, and you need to make mistakes. It’s a very precarious age, particularly for women. You’re in some ways still a child. It was traumatic, but it set up the rest of my career. So looking back, would I do anything different? No, I wouldn’t because I’m unbelievably lucky now, and my career is in a place where I really enjoy it, and I have a level of fame that’s much less intense. I can deal with it now, and that’s great. But at the time, it was not so great, and took many years of therapy to figure it out.\n\nWhat did you learn from that experience?\n\nWe have to be very careful with our young women. When I work with young actresses, I’m so protective of them. There’s a lot of people who go, ‘Oh, you’re only here because of your face.’ And they belittle them because of the way that they look. I think everyone can be a little kinder.", "images": ["https://pmcvariety.files.wordpress.com/2018/01/wash-westmorel-colette-bts.jpg", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/01/keira-knightly-variety-cover-shoot.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Ffeatures%2Fkeira-knightley-colette-metoo-directing-1202663863%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202663863&comment_count=20", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/01/keira-knightly-variety-cover-shoot.jpg?w=1000", "keywords": [], "authors": ["Brent Lang"], "canonical_link": "https://variety.com/2018/film/features/keira-knightley-colette-metoo-directing-1202663863/", "title": "Keira Knightley on ‘Colette,’ Pushing for Social Change, and if She’ll Ever Direct", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "How Keira Knightley, an actress pushing for social change, was an apt fit for the title role as the French pioneering writer in \"Colette.\"", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202663863, "author": "Brent Lang", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-16T06:00:44"}, "pmc-tag": "Colette,Keira Knightley,Sundance Film Festival", "title": "Keira Knightley on ‘Colette,’ Pushing for Social Change, and if She’ll Ever Direct", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "Features", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Keira Knightley on ‘Colette,’ Pushing for Social Change, and if She’ll Ever Direct", "url": "https://variety.com/2018/film/features/keira-knightley-colette-metoo-directing-1202663863/", "description": "Keira Knightley speaks her mind. While most movie stars frequently offer up anodyne responses to reporters’ inquiries and deploy an army of publicists and image makers to ensure they never say anyt…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/keira-knightly-variety-cover-shoot.jpg?w=1000", "width": 1000, "height": 563, "alt": "Keira Knightley photgraphed for Variety by NAdav Kander in London, England on January 5, 2018."}, "locale": "en_US"}, "article": {"published_time": "2018-01-16T14:00:44+00:00", "modified_time": "2018-01-16T14:00:45+00:00"}, "twitter": {"creator": "@https://twitter.com/BrentALang", "site": "@variety", "text": {"title": "Keira Knightley on ‘Colette,’ Pushing for Social Change, and if She’ll Ever Direct"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/keira-knightly-variety-cover-shoot.jpg?w=1000", "alt": "Keira Knightley photgraphed for Variety by NAdav Kander in London, England on January 5, 2018."}, "card": "summary_large_image", "title": "Keira Knightley on ‘Colette,’ Pushing for Social Change, and if She’ll Ever Direct", "description": "How Keira Knightley, an actress pushing for social change, was an apt fit for the title role as the French pioneering writer in \"Colette.\""}, "author": "Brent Lang", "content_type": "Article", "post_id": 1202663863, "title": "Keira Knightley on 'Colette,' Pushing for Social Change, and if She'll Ever Direct", "published_at": "2018-01-16 06:00:44", "image": "https://pmcvariety.files.wordpress.com/2018/01/keira-knightly-variety-cover-shoot.jpg?w=1000", "comment_count": 20, "tags": "Sundance Film Festival", "topics": "News", "appeared_in_print": "Yes", "body": "Keira Knightley speaks her mind.\r\n\r\nWhile most movie stars frequently offer up anodyne responses to reporters’ inquiries and deploy an army of publicists and image makers to ensure they never say anything remotely controversial, Knightley refuses to dodge tough questions. She’s ostensibly talking to Variety about “Colette,” a historical drama centering on the legendary French novelist that will premiere Jan. 20 at the Sundance Film Festival, but Knightley is more comfortable holding forth on the topical subjects of feminism, sexism and the lack of opportunities for female directors than she is talking about her creative process.\r\n\r\nThat’s what makes the 32-year-old actress a natural fit for the title role in the indie production. The mononymous Colette, perhaps best known for her novella “Gigi,” was a barrier breaker. A woman who had romances with women and men, and who rose to the top of belle époque society by writing stories, such as “Chéri” and the Claudine novels, that had a refreshing sexual candor. But some glass ceilings proved difficult to shatter for the literary sensation. She was involved in an exploitative relationship with her husband, a writer known as Willy (played in the film by Dominic West), who passed Colette’s work off as his own, reaping both the critical acclaim and financial rewards for himself.\r\n\r\n\r\n\r\n“Colette” hits Sundance looking for a U.S. distributor. It should attract interest from buyers thanks to Knightley’s compelling central performance — and because it’s a portrait of a feminist pioneer that seems tailor-made for the #MeToo and #TimesUp moments.\r\n\r\n“It’s definitely hashtag Colette too,” says director and co-writer Wash Westmoreland. “Her story of a man trying to shut up a woman and a woman being stifled by a man’s ego is still going on today and has been going on throughout history. There have been seismic changes at various points, where you have things like the suffragette movement, and we’re having another tectonic shift right now. Women are saying, ‘No more. We’re not putting up with predatory bullshit.’”\r\n\r\nKnightley intends to be one of those actresses pushing for change, even as her career is busier than ever. “Colette” is one of four films she’s appearing in this year, the others being the historical drama “The Aftermath,” the anthology entry “Berlin, I Love You,” and the Disney fantasy “The Nutcracker and the Four Realms.” The actress says she was motivated to throw herself back into work after taking more than a year off to give birth to and bond with her daughter, Edie.\r\n\r\nBefore heading to the mountains of Park City, Knightley sat down with Variety to talk about Hollywood’s sexual harassment crisis, the downside of celebrity and why it was “traumatic” becoming a star in “Pirates of the Caribbean” at age 18.\r\n\r\nWhy did you want to portray Colette? \r\nIt’s wonderful to play inspiring women and to get their stories and their voices out there. Within her writing, Colette was questioning the idea of gender and the idea of what was naturally feminine as opposed to society’s take on being feminine. The 1890s in France, the belle époque, is interesting to look back on because there was a lot of sexual freedom. Colette had female lovers and had what I suppose we would call a transgender lover. She felt that it was her right to experience pleasure and to give pleasure. That’s still a revolutionary idea for women.\r\n\r\nWould Colette’s behavior be scandalous today?\r\nWe’ve come very far, but if you had a very famous writer or actress today who was living in the way that she did, there would still be a sense of scandal about it. As much as the 1960s were a period of male sexual liberation and definitely a period where we got the pill and there was a sense of freedom, I think that women’s sexual liberation is still a process. What’s interesting is she was experiencing that and writing about that at the end of the 19th century.\r\n\r\n\r\n\r\nIn the film, Colette revels in her celebrity. Do you have a different relationship with fame? \r\nI think in a funny way I’ve gone exactly the opposite direction, which is again why I sort of really enjoy playing these total extroverts. … I enjoy that kind of quality of somebody that wants to stand in the center of the room and go, ‘Look at me, look at me, look at me.’ Because I’m the one at the side of the room, normally trying to get out the door or hiding in the bathroom. As an actor you sometimes get to be the person that you want to be as opposed to the person you are.\r\n\r\nWhen you’re playing a role, do you mind being the center of attention?\r\nThere’s always a wall that I have to try to smash through to get over what is basically stage fright. I’m never totally at ease putting on somebody else’s skin, because I know that I’m being watched doing it. But there’s a joy in the bravado once you’re doing it. You don’t always get there. Sometimes you’re very aware that it’s you out there and lots of people are looking at you and you’re doing something quite strange, but there are moments where you do get lost in the character.\r\n\r\nDo you still get stage fright?\r\nIt’s better. I know what it is now. I know that it’s a step that I have to get through. For me, theater work was incredibly helpful because it actually made me go, ‘Oh, that’s what this feeling is.’ In a funny way, when you’re on a film set you don’t understand that it’s stage fright because you’re not onstage, you’re on a set, and it’s just a camera and not an audience. But actually it’s still a very vulnerable thing to do with a lot of people looking at you.\r\n\r\n“Colette” may have been conceived years ago and shot months ago, but her struggle has a greater resonance in the #MeToo and #TimesUp era. Do you see parallels between the barriers that Colette faced and the rights that women are advocating for today?\r\nThere certainly are parallels. The fact that the movie is coming out right now isn’t a surprise.\r\n\r\nWash, the director, and his late partner [the writer and director Richard Glatzer] were trying to get this movie made for about 15 years. I don’t think it’s a surprise that it managed to get funding in the last few years when it had never managed to get funding before. Women’s stories are suddenly viewed as important.\r\n\r\nAre companies backing more female-dominated stories? \r\nWith the rise of Netflix and Amazon we’re seeing some strong female characters and female stories on streaming services. I don’t know about films as much. I don’t really do films set in the modern day because the female characters nearly always get raped. I always find something distasteful in the way women are portrayed, whereas I’ve always found very inspiring characters offered to me in historical pieces. There’s been some improvement. I’m suddenly being sent scripts with present-day women who aren’t raped in the first five pages and aren’t simply there to be the loving girlfriend or wife.\r\n\r\nWhat are your thoughts on the harassment scandal that’s engulfed Hollywood?\r\nWhat’s been really interesting is that it’s not just this industry — it’s in every industry. I was surprised by some of the specifics. But I was aware of the culture of silencing women and the culture of bullying them, and I knew that men in the industry were allowed to behave in very different ways than women. That was obvious. What was fascinating about the #MeToo movement was I was sitting with friends who weren’t in the industry, and there wasn’t one of us who hadn’t been assaulted at some point. We’d never had that conversation before. That was an eye-opener.\r\n\"I was sitting with friends who weren’t in the industry, and there wasn’t one of us who hadn’t been assaulted.”\r\nKeira Knightley\r\nHave you ever been harassed or assaulted while working on a film?\r\nI’m fortunate that I’ve never been sexually abused professionally or harassed on a film set, but in my personal life, when I’ve been in bars, I can count four times when I’ve been what I’d say was assaulted in a minor way. I think everyone has battled their fair share of monsters. It’s not just actresses. It’s teachers; it’s lawyers. I’m not talking about rape, but I’m talking about the people who had been grabbed in pubs or their breasts had been fondled by somebody they didn’t know or they’d had someone shove a hand up their skirt.\r\n\r\nFor too long, you really did go, ‘Oh, this is just normal.’ It’s terrifying that was our response. It must have been awful for all of those brave women who have come forward and spoken publicly about their experiences. There’s been a lot of pain and a lot of suffering. We’re in a period of time in which it all has to come out. Then we need to move forward and figure out how to make sure that it doesn’t happen again.\r\n\r\nYou made movies like “Begin Again” and “The Imitation Game” with The Weinstein Co. Harvey Weinstein, the studio’s co-founder, has been accused of harassing and abusing dozens of women. What was your experience with him?  \r\nMy experience with Harvey Weinstein was always very professional. He was very good on the films we made. I was aware of his reputation of being a bully. He was famous for phoning people in the middle of the night and screaming at them. He didn’t do that to me, and he certainly never asked me for massages or anything like that. I wasn’t aware of any allegations or rape or sexual assault against him. For the first time people are sharing their stories. People have been absolutely terrified to talk about it and were scared of retribution, so I don’t think everybody knew the extent of what was going on.\r\n\r\nDo you think the media treats actresses differently than actors? \r\nAbsolutely. Constantly. Why don’t journalists ask men how they balance their home life and their career? Why don’t you ask male actors how they feel being a father and going off to shoot a movie? And yet more times than not, that’s the first question that I’ll be asked — how do you balance motherhood with your career?\r\n\r\nWhat about closing the pay gap? Have you demanded to be paid as much as your male co-stars?\r\nFor the first time recently I got paid a little bit more than my male co-stars. I haven’t tried to push back on it much. I think I probably should have. My approach has been not to ask because I would have been really angry, which is stupid. I’ve been putting my head in the sand, I’m afraid.\r\n\r\nAre you finding more scripts from female writers, or projects being offered to you with female directors?\r\nThere are quite a few scripts written by women; it’s the directors that have been massively lacking. I’ve worked with a number of female filmmakers, and they’ve all been wonderful. They haven’t always found it easy to get another film off the ground even when the films we’ve done have been very well reviewed. It’s a big problem. When there are female writers and directors and producers, the parts for women are better, and so the way that society views women through drama is much better and much more well rounded.\r\n\r\nWhat did you think of “Lady Bird”? That was written and directed by Greta Gerwig and felt like a fresh take on the relationship between mothers and daughters. \r\nIt’s such a wonderful film, but it’s absolutely insane that I’ve never seen something like this on-screen before. I know every intricacy of the relationship between fathers and sons, and even fathers and daughters. The female experience is really not there. So it’s extraordinary that in 2017 that seems revolutionary. You should see a spectrum of female relationships.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDirector Wash Westmoreland directs Keira Knightley in “Colette.”\r\n\r\n\r\n\r\nWould you ever direct?\r\nI have thought about directing. Right now there’s that classic female thing of being too terrified of it not being perfect. It’s a terrible affliction, because really what you should just do is dive in and give it a go. Maybe one day I’ll get over my fear and just do it. I hope there are many more courageous women than me who actually will.\r\n\r\nYou have four films coming out this year. Are you a workaholic? \r\nIt’s been busy. I took a year off when I was pregnant and after I had my kid. It was interesting, because when you have a child it’s amazing and fulfilling, but you feel like your identity can in some way be subsumed by being a mother. I had a real feeling of needing to feel like I am still me, so I attached myself to an awful lot of projects, and I got to the last one, which was actually “Colette,” and realized I was absolutely knackered, so I’ve taken the last six months off.\r\n\r\nI was the daughter of a working mother, and I know how important it was to me and my sense of self to see my mom working. I want my daughter to see that I’m doing something that I love. I want her to know that whatever field she chooses, she can have a kid and she can still pursue a career.\r\n\r\nWhy did you want to do “The Nutcracker”?\r\nYou can’t say no to playing the Sugar Plum Fairy. I’d been doing a lot of work that was quite subtle, and I wanted something that was totally off the wall.\r\n\r\nYou have a really outrageous hairdo in the film. What inspired the Sugar Plum Fairy?\r\nThe candy cane hair is because she was a sweetie, but there were also a couple of Tory female politicians that I thought of. She’s Margaret Thatcher meets Marilyn Monroe.\r\n\r\nAre you going to do more family films?\r\nNo. My taste is always going to be darker. I love strange, complex characters, and what’s great about my job is I get to try to understand people that I wouldn’t necessarily like.\r\n\r\nWould you make the leap to television?\r\nI intend to. I’ve been sent a lot of pilots. It’s a different way of reading scripts because quite often you’re only sent the first script and you’re not sent the rest of the series. Maybe they haven’t written them, but I find it to be a difficult concept. At some point, I’m just going to have to dive in and give it a go. I’m going to go wherever the great roles are.\r\n\r\nYou do a lot of period films like “The Duchess” or “Anna Karenina.” Do you like corset roles? \r\nFor years I felt quite guilty about it, like it was something that I should try to shake off. Then I realized that these were the films I’ve always loved watching. I think some people find escapism through science fiction or fantasy, and I suppose my escapism into another world has always been through period drama. It’s nice that in my 30s I can finally admit that.\r\n\r\n\r\n\r\nDid you always want to act?\r\nApparently I first asked for an agent when I was 3. My dad was an actor and my mom was a writer, so I was surrounded by it. My parents were hugely part of political theater in the ’70s and the early ’80s, and there was a sense that it was something important. You weren’t just an actor. You were an activist and you could change the world. For a kid to grow up in that, it was intoxicating.\r\n\r\nDo you want your daughter to go into acting?\r\nI really, really, really hope that she doesn’t. However, people that do it don’t have a choice. It’s a calling. I hope she’s going to be an environmental lawyer or something spectacular, but I’m going to be the kind of parent where whatever interest she has, I’m going to be supportive.\r\n\r\nYou became a star at 18 with “Pirates of the Caribbean.” What was it like to be famous at an age when most people are attending their proms? \r\nI found it pretty horrific. I’m not an extrovert, so I found that level of scrutiny and that level of fame really hard. It was an age where you are becoming, you haven’t become, and you need to make mistakes. It’s a very precarious age, particularly for women. You’re in some ways still a child. It was traumatic, but it set up the rest of my career. So looking back, would I do anything different? No, I wouldn’t because I’m unbelievably lucky now, and my career is in a place where I really enjoy it, and I have a level of fame that’s much less intense. I can deal with it now, and that’s great. But at the time, it was not so great, and took many years of therapy to figure it out.\r\n\r\nWhat did you learn from that experience? \r\nWe have to be very careful with our young women. When I work with young actresses, I’m so protective of them. There’s a lot of people who go, ‘Oh, you’re only here because of your face.’ And they belittle them because of the way that they look. I think everyone can be a little kinder.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1516111244.0, "source": "https://variety.com", "summary": ""}