{"url": "https://www.billboard.com/articles/columns/rock/8333553/rock-and-roll-hall-of-fame-induction-ceremony-recap-bon-jovi", "text": "The Cars, Dire Straits, The Moody Blues, Nina Simone & Sister Rosetta Tharpe were also inducted at 33rd annual ceremony.\n\nThe Moody Blues’ Graeme Edge expressed the thoughts of many of the members of the Rock and Roll Hall of Fame’s class of 2018 during the 33rd annual induction ceremony on Saturday night (April 14) in Cleveland’s Public Auditorium. Acknowledging the Moodys’ long period of eligibility before finally being nominated, thanks in part to aggressive campaigning on behalf of the band’s fans, Edge -- the oldest living inductee of the evening at 77 -- said, “It was so long that we were eligible and didn’t make it that I got a real sour grapes [feeling] for everything about it. … When it actually became something for us all to appreciate and have, I did realize that it means the world to me.”\n\nThe Moodys -- along with fellow inductees Bon Jovi, The Cars and Dire Straits (and the late Nina Simone and Sister Rosetta Tharpe) -- have long been on lists of acts snubbed for Rock Hall induction. Saturday's more than four-and-a-half-hour ceremony set things right with a prevailing atmosphere of sincere appreciation -- including from fans who sat in pouring rain to watch red-carpet arrivals and in the Public Auditorium’s upper level -- with only a few barbs about the long waits for induction.\n\nThe ceremony, which was filmed by HBO for a May 5 premiere, differed from other years in that Rock Hall co-founder Jann Wenner did not address the gathering and there was no finale that brought inductees and presenters together.\n\nThe crowd at Cleveland, Ohio's Public Auditorium did not have to wait long for what was the clear main attraction of the night. Following The Killers' tribute to the late Tom Petty with \"American Girl\" (and a bit of \"Free Falling\"), Bon Jovi's hour-plus presentation was presided over by Howard Stern, who gave the band an epic, envelope-pushing-but-loving tribute that took Rolling Stone magazine and Rock Hall co-founder Jann Wenner to task (\"Jann required years of pondering to decide if this glorious band that sold over 130 million albums should be inducted. What a tough decision.\") and essayed on everything from Jon Bon Jovi's use of hairspray to guitarist Richie Sambora's penis size, as well as the fact that Bon Jovi's sales eclipsed the death tolls from the bubonic plague, the American Civil War and atomic bomb drops.\n\nHe also led the crowd in singing a chorus of \"Wanted Dead or Alive,\" chided Bon Jovi's desire to own a National Football League franchise (New England Patriots owner Robert Kraft and the Dallas Cowboys' Jerry Jones were band guests on Saturday) and told the frontman that \"I'm glad you don't have to sit at home anymore throwing darts at pictures of Jann Wenner.\"\n\nBon Jovi was equally expansive and earnest in his acceptance speech. Following remarks by each of the band members (\"If I wrote a book, it would be [called] The Best Time I Ever Had,\" said Sambora, returning to the ranks after leaving for good in 2013), Bon Jovi delivered a nearly 20-minute aural career history, thanking bandmates, management, record company executives, friends and family. \"I've been writing this speech many days, in many ways -- some days, it's the thank you speech, some days the f--- you speech,\" he noted, acknowledging the group's long and controversial exclusion from the Rock Hall. But he kept things mostly positive and sentimental. \"It's about time -- that has been the theme of my weekend,\" Bon Jovi said, looking at his bandmates. \"I thank my lucky stars for the time I got to spend with each of you. Tonight the band that agreed to do me a favor stands before you so I can make this reality a dream.\"\n\nWith Sambora and original bassist Alec John Such reuniting with the group, Bon Jovi finished with a crowd-pleasing set that included \"You Give Love a Bad Name,\" \"It's My Life,\" \"When We Were Us\" from last year's This House Is Not for Sale album and \"Livin' on a Prayer.\"\n\nWithout a designated presenter, Dire Straits bassist and co-founder John Illsley took it upon himself to do the honors and subsequently make an acceptance speech. He quickly addressed the elephant in the room -- frontman Mark Knopfler's decision not to attend -- cracking that \"I can assure you, it's just a personal thing,\" adding, \"It's for personal reasons, let's just leave it at that. You've got to realize this is really more about a group of people more than one person. It's a collective, a brotherhood, and that's something that needs acknowledging tonight … the many musicians who have worked with Dire Straits over the years and made the band's success possible and led us all the way to Cleveland tonight.\n\nSoft-spoken keyboardist Guy Fletcher noted, \"I never thought of Dire Straits as a particularly cool band. … We weren't really there to be cool.\" He also told the group's fans to \"consider this award yours, but if you don't mind, I'll look after it.\"\n\nThe Cars, inducted after two previous times on the ballot and ushered in by Killers frontman Brandon Flowers (\"The Cars were the first band I truly fell in love with, and you never forget your first\"), spent much of their time paying homage to late bassist/singer Benjamin Orr, a native of Cleveland, much to the delight of the partisan Public Hall crowd. \"When the band first started, Ben was supposed to be the lead singer and I was supposed to be the good-looking guy in the band -- but after a couple of gigs, I kinda got demoted to the songwriter,\" Ric Ocasek, sporting a glittery silver tuxedo jacket, said. \"But obviously it's hard not to notice that Benjamin Orr is not here. He would've been elated to be here on this stage. It still feels strange to be up here without him.\"\n\nThe group's set, with Weezer's Scott Shriner on bass and bushy-bearded drummer David Robinson looking sagely behind his kit, included \"My Best Friend's Girl,\" \"You Might Think,\" \"Moving in Stereo\" -- which Flowers called \"the best song in any movie scene that pictured a girl getting out of a pool taking her top off\" (Fast Times at Ridgemont High) -- and \"Just What I Needed.\"\n\nBoth Nina Simone’s younger brother Dr. Samuel Waymon and inductor Mary J. Blige made unapologetically long speeches, with the former thanking Jon Bon Jovi for giving him license to “take as much time as necessary to say what I need to say” about the iconoclastic, genre-blending singer who was the surprise inclusion in this year’s class. While Blige noted that Simone “could sing anything,” Waymon -- who managed her for many years -- said that “it is the oddest thing for you to induct her because [Simone] is a non-conformist, a non-traditionalist.” He warned artists that “if you’re sampling her, you better pay for it” and added that “she’s sitting next to you. She’s soaring over us tonight.” Andra Day and The Roots followed with renditions of “I Wish I Knew How It Would Feel to Be Free” and a spectacular “I Put a Spell on You,” while Lauryn Hill came on for a long, showstopping set of “Black Is the Color of My True Love’s Hair, ” “Ain’t Got No, I Got Life” and “Feeling Good,” accompanied by video footage of Simone herself.\n\nAlabama Shakes' Brittany Murphy made brief remarks inducting Sister Rosetta Tharpe as this year's Early Influence, calling her \"the godmother of rock 'n' roll\" before delivering a sharp rendition of \"That's All.\"\n\nIn addition to the traditional In Memoriam segment, the ceremony featured two specific tributes. The Killers opened the night playing the late Tom Petty’s “American Girl,” slipping a bit of “Free Fallin’” into the final verse, while Heart’s Ann Wilson and Alice in Chains guitarist Jerry Cantrell performed an emotive duo version of Soundgarden’s “Black Hole Sun” to honor Chris Cornell.\n\nThe Moody Blues closed the evening after a salute from inductor Ann Wilson, who reminded the room that in addition to the group’s heady musicianship and ethereal, philosophical lyricism, “The Moody Blues are and always have been a kick-ass rock 'n' roll band.” Denny Laine, who co-founded the Moodys as a blues group but left after one album, saluted those who came after him, saying, “I’m really pleased to say these guys…went on to other things, and I’m a big fan. There ya go. The Moody Blues, I love you.”\n\nLittle mention was made of co-founder Ray Thomas, who died Jan. 4, but Justin Hayward and John Lodge both thanked American radio disc jockeys who championed the band, while Lodge acknowledged the fans who campaigned so hard for the group, saying, “This is your Rock and Roll Hall of Fame.” Hayward explained that “for us and all the British musicians, this is the home of our heroes. To be celebrated even in the same street, in the same building, even in the same town as Buddy Holly and the Everly Brothers, with the woman who showed us how it all should be done, Nina Simone…it’s a privilege. It means a lot to me.”\n\nThe Moodys then picked up their instruments for a set that included “I’m Just a Singer (In a Rock and Roll Band),” a galvanizing “Nights in White Satin” and “Ride My See Saw.”\n\nSaturday’s ceremony also introduced a new category: The Rock and Roll Hall of Fame Singles honored six songs that Little Steven Van Zandt said \"shaped rock 'n' roll\" by \"artists in the Rock Hall … at the moment.\" The first inductees in the category included “Rocket 88” by Jackie Breston and his Delta Cats (1951), Link Wray and his Ray Men’s “Rumble” (1958), “Louie Louie” by The Kingsmen (1963), Procol Harum’s “A Whiter Shade of Pale” (1967) and Steppenwolf’s “Born to Be Wild” (1968).\n\nRock Hall President and CEO Greg Harris opened the evening pronouncing that \"in a world that is filled with division, rock connects us.\" He also celebrated \"a time of unprecedented growth\" for the museum and announced a $10 million donation from the Key Bank Foundation -- the largest-ever single philanthropic contribution -- which will be detailed later this spring.", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://static.billboard.com/files/media/bon-jovi-richie-sambora-rock-hall-2018-billboard-1548-1024x677.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?c596412deda54d9a807d"], "top_img": "https://static.billboard.com/files/media/bon-jovi-richie-sambora-rock-hall-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": ["Gary Graff"], "canonical_link": "https://www.billboard.com/articles/columns/rock/8333553/rock-and-roll-hall-of-fame-induction-ceremony-recap-bon-jovi", "title": "Reunited Bon Jovi Take Center Stage at 2018 Rock and Roll Hall of Fame Induction Ceremony", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-04-15T00:16:39-04:00", "published_time": "2018-04-14T22:45:37-04:00"}, "description": "The crowd at Cleveland, Ohio's Public Auditorium did not have to wait long for what was the clear main attraction of Saturday night's (April 14) 33rd annual Rock and Roll Hall of Fame induction ceremony: Bon Jovi's hour-plus presentation.", "og": {"description": "The crowd at Cleveland, Ohio's Public Auditorium did not have to wait long for what was the clear main attraction of Saturday night's (April 14) 33rd annual Rock and Roll Hall of Fame induction ceremony: Bon Jovi's hour-plus presentation.", "image": {"identifier": "https://static.billboard.com/files/media/bon-jovi-richie-sambora-rock-hall-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Bon Jovi Reunite With Richie Sambora at 2018 Rock & Roll Hall of Fame Ceremony | Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/rock/8333553/rock-and-roll-hall-of-fame-induction-ceremony-recap-bon-jovi", "site_name": "Billboard"}, "title": "Reunited Bon Jovi Take Center Stage at 2018 Rock and Roll Hall of Fame Induction Ceremony", "twitter": {"card": "summary_large_image", "description": "The crowd at Cleveland, Ohio's Public Auditorium did not have to wait long for what was the clear main attraction of Saturday night's (April 14) 33rd annual Rock and Roll Hall of Fame induction ceremony: Bon Jovi's hour-plus presentation.", "image": "https://static.billboard.com/files/media/bon-jovi-richie-sambora-rock-hall-2018-billboard-1548-1024x677.jpg", "title": "Reunited Bon Jovi Take Center Stage at 2018 Rock and Roll Hall of Fame Induction Ceremony", "site": "@billboard"}}, "movies": [], "publish_date": 1523760337.0, "source": "https://www.billboard.com", "summary": ""}