{"url": "https://www.washingtonpost.com/lifestyle/style/violence-threats-begging-harvey-weinsteins-30-year-pattern-of-abuse-in-hollywood/2017/10/14/2638b1fc-aeab-11e7-be94-fabb0f1e9ffb_story.html", "text": "\n\nHarvey Weinstein in 2011. The powerful producer has been accused of sexual assault and harassment by numerous women, dating back to his earliest years in the movie industry. (John Carucci/AP)\n\nIn 1984, Harvey Weinstein was 32 years old and making one of his first real feature films, on location outside of Scranton, Pa. It was a comedy called \"Playing for Keeps,\" featuring a not-yet- ­famous Marisa Tomei, and the mood on set was anxious. Weinstein was foul-mouthed and domineering. He sparred routinely with his younger brother, Bob, his co-director. At one point, they wanted to shoot two versions of each scene because neither would compromise his vision.\n\nOne day, a young female crew member came to the office of lead producer Alan Brewer, an old high school friend of Harvey's from Queens, and started crying.\n\nWeinstein had asked her to come to his hotel room, ostensibly for work reasons, she told Brewer, but then kissed her. She resisted. Weinstein overpowered her. He forced her on the bed and attempted to perform oral sex on her. Eventually, she got him to stop.\n\nBrewer asked if she wanted to file a police report. (Another crew member heard the woman's account separately at the time, and corroborated Brewer's memories.) No, she said, shaking. She wanted to keep the job — but she wanted the co-director to stay away from her.\n\nWeinstein would go on to become the toast of Hollywood, building a mini-empire and a towering reputation as a cultural kingpin — and then it would all come crashing down with a series of damning stories over the past several days, by the New York Times and New Yorker, alleging years of harassment and criminal sexual abuse against women he encountered in his work as an A-list film producer. On Saturday, just days after being fired from his own company, the Academy of Motion Picture Arts and Sciences Board of Governors voted to expel Weinstein from the Academy, a major denunciation of someone who helped shape Oscar races for decades.\n\nIn interviews with 67 people currently or formerly in Weinstein's orbit, The Washington Post found three previously unreported allegations of sexual or physical assault — and a striking pattern, going back to the dawn of his career, of ruthlessness and ma­nipu­la­tion.\n\nHe was violent toward women and men, and his abuse came in many forms — from screaming and berating to character assassination and nonconsensual advances. His behavior was both an open secret and a secret ritual.\n\nHow SNL went after Harvey Weinstein and sexual harassment in Hollywood\n\nWhen presented with the accounts in this report, Weinstein's representative Sallie Hofmeister reiterated previous statements: \"Mr. Weinstein obviously can't speak to anonymous allegations, but with respect to any women who have made allegations on the record, Mr. Weinstein believes that all of those relationships were consensual,\" she said in an email. \"Any allegations of non-consensual sex are unequivocally denied by Mr. Weinstein.\"\n\nSome, who have known and worked with him for years, are still trying to fathom the severity of the accusations.\n\n\"I'm sad, I'm disgusted,\" said publicity executive Cindi Berger, who represented Weinstein's films over the past two decades but says she never heard of any abusive sexual behavior. \"I learned so much from Harvey. . . . When people say he was a modern-day Louis B. Mayer, he was.\"\n\n\"Everyone knew these stories,\" one Hollywood publicist said. \"Not the specifics. But people knew it was a hostile work environment, and that he was a bully to people. Because he could win you an Oscar, we were all supposed to look the other way.\" (Several sources, who were not authorized to speak publicly or who fear Weinstein's wrath even now, spoke on the condition of anonymity.)\n\nBrewer, Weinstein's long-ago producer, is now 64 and living in Hermosa Beach, Calif. On Tuesday, when the New Yorker published a 2015 audio recording of Weinstein trying to lure a model into his hotel room, Brewer was stopped cold.\n\nIt took him back to the day before the \"Playing for Keeps\" premiere, in Miramax's cramped Manhattan office. Weinstein, enraged that he had been out of pocket for a few hours, lunged at him and began punching him in the head, Brewer said; the skirmish tumbled into the corridor and then the elevator. By the time Brewer reached the street, intent on never associating with the Weinsteins again, he said, Harvey was pleading for him to stay and help ensure that their film got launched.\n\n\"Listening to the audiotape, it gave me this visceral reaction to my experience that day,\" Brewer said by phone Thursday. \"This alternating between violence, threats, commands and then begging, mock-crying, trying anything — any angle to get what he wanted.\"\n\n\n\nStory writers Weinstein, right, and Brad Grey, center, talk with journalist Michael Healy, left, on the set of “The Burning,” outside Buffalo, N.Y. The 1981 film, which Weinstein also produced, was the first release by Miramax.\n\n'He's very seductive\n\nat the start'\n\nThrough sheer force of ambition, Weinstein, now 65, transformed himself from a pudgy kid from Flushing, Queens, into a wealthy mogul who could bend reality to his will. He was a college dropout who turned multiplex audiences on to foreign films and quirky indies; a genius of promotion who persuaded Oscar voters to pick his lighthearted \"Shakespeare in Love\" over epic front-runner \"Saving Private Ryan\" as best picture in 1999.\n\nHe grew up an unathletic honors student sharing a room with his brother in a lower-middle-class housing development. At 15, Harvey started going to foreign films at art-house cinemas. He played cards on Saturday nights with other boys who couldn't get dates. He had a \"funny, whiny\" voice, and was often bullied, according to former classmates, but he was persistent, sure of himself, an operator.\n\nOnce, he crashed a Simon and Garfunkel concert with a friend, knocking on doors to the box seats until someone let them in.\n\n\"He was supremely confident, and not worried about any repercussions,\" the friend recalled. \"It was like, 'Eh, if they catch me, so what, I'll do it again.' \"\n\nAfter attending the University of Buffalo, Weinstein went into business with his brother, first as concert promoters and later, in 1979, in a small film-distribution company that they dubbed Miramax — a fusion of their parents' first names. Around that time, Lauri Githens was fresh out of college and working as a disc jockey. She remembered some unwritten rules of the Buffalo music scene in the early '80s.\n\n\"Don't mention the competition on the air. Don't put two car ads in the same segment,\" she said this past week. \"And, if you're a young woman, don't be alone with Harvey Weinstein.\"\n\n[The growing list of women who have accused Harvey Weinstein of sexual misconduct]\n\nHis job then wasn't to make movies but to discover them and get them into theaters. His forcefulness was a boon for independent and foreign films that lacked bankable names. He would be their star, their champion, deploying a brassy, fearless persona to conduct cutthroat negotiations and impassioned publicity campaigns.\n\n\"Playing for Keeps\" flopped with critics, but Miramax rebounded by seeking out promising projects, buying their rights and packaging them as must-sees for the masses. Miramax distributed the debut features of Steven Soderbergh in 1989 and Quentin Tarantino in 1992.\n\nBy the time \"Pulp Fiction\" exploded a few years later, Miramax had expanded its work into development and production, and its logo symbolized the vanguard of edgy, independent cinema.\n\nAll the while, Weinstein was on the prowl.\n\nIn 1993, Washington arts patron Kay Kendall met Weinstein at the home of the novelist William Styron on Martha's Vineyard in Massachusetts. She told the producer — fresh off a sensational marketing campaign for \"The Crying Game\" — that her 23-year-old daughter Katherine was an aspiring actress. Weinstein offered to help her career.\n\nWithin a week, Katherine Kendall had a meeting at Weinstein's New York office. He invited her to his apartment, where she said he took off his clothes and asked for a massage. Horrified, she said that she made up a story about meeting her boyfriend and tried to leave, but Weinstein insisted that he go with her.\n\n\"Harvey has a bargaining quality, a back-and-forth bullying that makes you just go 'okay,' \" she explained. She jumped out of their taxi blocks later and ran inside a bar, begging the bartender to pretend that he was her boyfriend.\n\nWeinstein sat in the cab, watching.\n\nKatherine Kendall didn't tell anyone in a position of authority. \"There were no cuts or bruises, so what recourse did I have?\" she said. \"So I thought immediately: 'I better shut up. No one is going to care.' \"\n\nThat same year, Warren Leight worked with Weinstein as director on \"The Night We Never Met,\" a romantic comedy starring Matthew Broderick and Annabella Sciorra.\n\n\"He's very seductive at the start,\" Leight said. \"You think he understands you and your destiny is about to change.\"\n\nBut Weinstein's behavior was erratic. Leight said Weinstein pressured him to ask an actress to \"show tit\" on screen, though the script required no nudity. Weinstein bulldozed the editing process, said Leight, who was unhappy with the cuts. He told Weinstein as much.\n\n\"Right now this feels like getting f---ed up the ass without Vaseline,\" Weinstein responded, according to Leight. \"But in 10 years, it's going to seem like the best sex of your life.\" Each outburst, Leight said, would be followed by a gift basket and an apology.\n\nLeight was so worn down that he retreated from the film business, finding success in theater and television. In retrospect, he said, the abusive tactics that Weinstein used with women were in line with those he used with directors and male employees: the domination, the cycle of eruptions followed by contrition, the swagger, accompanied by shows of neediness.\n\n\"It's absolutely the same behavior,\" Leight said.\n\n'A friend of Harvey's'\n\nShow business is known for its comically unbalanced ratio of supply and demand: Hordes of young, aspiring actors and filmmakers scrap over every grunt-level Hollywood position. For a toehold in the industry, hopefuls will endure bad parts, low pay, long hours and a level of mistreatment that might not stand in other professions.\n\nSeveral people interviewed by The Post said that a desire to keep working in the business would prompt many of their colleagues to stay silent about any mistreatment they experienced. And that Weinstein's immense talent and vast power allowed him to keep going.\n\nLouisette Geiss, one of Weinstein's accusers, said that she had heard before she met him that Weinstein could be lewd, but she didn't know the full extent. She felt compelled to meet with him anyway, because as an aspiring screenwriter, she thought it could change the course of her career.\n\n\"You hear about it all the time,\" said Geiss, who has since left show business. \"That one moment when you get to pitch your script — and this is Harvey Weinstein! There's that one moment when you are no one, and then you pitch a script and you are found.\"\n\nInstead, she said, she found herself fending off Weinstein's advances as he physically overpowered her in his hotel room during the 2008 Sundance Film Festival.\n\nThe offices of the Weinstein Co. in Los Angeles are a stark, white-marble edifice on Wilshire Boulevard. One mile west is the Peninsula Beverly Hills hotel, where the New York-based producer often stayed, and where many of his alleged assaults were said to have taken place.\n\nWorking at the Weinstein Co., which the brothers founded after leaving Miramax in 2005, was seen as a launchpad for ambitious Hollywood newcomers. One former employee recently speculated why: \"Because people knew that if you had worked there, you could put up with anything.\"\n\nWest Coast employees employed a system of alerts, passed along by whisper, to prepare for the boss's arrival.\n\nHarvey is coming.\n\nHarvey is five minutes out.\n\nHarvey is on a kick about \"Tulip Fever.\" If you haven't seen it, make sure you do now.\n\nOne preparation — described by multiple individuals and recognized as both practical and ridiculous — was to hide all the office candy bowls.\n\n\"He would take and eat them all and his blood sugar would spike,\" the former employee explained. \"We were trying to control his moods.\"\n\nThe mood swings, the employee said, were frequent and relentless. Workers discussed in hushed tones how to manage them. There was a rumor of one junior-level employee being fired and then rehired in the span of three minutes, and another being dumped unceremoniously on the side of a New York state highway.\n\n\"It was not clear that he was assaulting people,\" the former employee said. \"But was it clear that he was trading his power for sexual favors? Yes.\"\n\nIf an actress was described around the office as \"a friend of Harvey's,\" then it meant that a meeting involving her might be other than professional: She was a person Harvey was courting, or hoping to, and not necessarily there because of her acting talent, the employee said.\n\n\"What you have to understand is, Harvey was somebody who everybody who worked there didn't like,\" another former employee said. \"Talking s--- about Harvey was the normal course of action. He's disgusting. He's rude. He has food on his shirt.\"\n\nIn some ways, the second former employee said, Weinstein's blatant bad behavior managed to mask his more insidious tendencies. In other words, you didn't believe he could be any worse in private than you had seen him behave in public.\n\n\"If I heard another gross thing about him,\" the second former employee said, \"I just wouldn't think that hard about it.\"\n\nSome women who have made claims against Weinstein have alleged that his assistants were facilitators of his behavior, or said they were in the room immediately before he assaulted them. A representative of the Weinstein Co. said that no one knew there was nonconsensual sexual activity going on. The company has nearly 200 employees, the representative said, and very few of them witnessed Weinstein's day-to-day life.\n\n\"I'm upset for the employees of the company,\" said the representative, who spoke on the condition of anonymity. \"There's people saying we aided and abetted him. I understand that narrative, but it's unfair and untrue. The whole industry is as guilty as we are. Ex-employees of his, colleagues everywhere — we all knew the same man. No one knew that he was hurting these women. Which, in hindsight, is pretty stupid.\"\n\n\"I just thought we were seeing the bad end of a bad temper,\" said one industry professional, who often encountered him over several decades. \"I once watched him fire his whole staff at an awards show. It was one of the worst things I've witnessed — they were running away in tears and crying in parking lots.\"\n\nBut people put up with it.\n\n\"Shakespeare in Love\" was a beautiful film.\n\n\"Good Will Hunting\" was a beautiful film.\n\nA parade of beautiful movies followed Harvey Weinstein. Beautiful movies sometimes made by miserable people.\n\n\"Here's a man who would take a little film that couldn't and make it into hits that won Oscars,\" said the publicist who watched Weinstein fire his entire staff. \"He wasn't the only one to do that, but he had a really good track record. Sometimes, to do that, you have to be a steamroller. I don't know if that's right or wrong. I think it's wrong.\" A pause. \"I'm sure it's wrong.\"\n\n'What have you\n\nheard about me?'\n\nWeinstein seemed to be aware of his reputation as both a stubborn lech and a Machiavellian operator. The journalist Kim Masters, who has covered Hollywood for more than 25 years, first met him at a lunch in the 1990s.\n\n\"He said, 'What have you heard about me?'\" Masters said. \"And I said, 'I've heard you rape women.' \"\n\nWeinstein responded, Masters said, \"with neither shock nor anger.\"\n\nNow an editor at large for the Hollywood Reporter, Masters said the magazine tried \"really hard\" to publish a report on Weinstein's sexual behavior a few years ago. But the source backed out, leaving it without on-the-record corroboration of festering rumors.\n\n\"He had this way of bending people to his will,\" said Larry Hackett, former editor of People magazine. \"Michael Eisner didn't call you, Alan Horn didn't call you, but Harvey did. Harvey was the Trump of the movie industry. He knew what was a good story. He knew how it worked. He knew what a deadline was. He knew about the caring and feeding of gossip columns.\"\n\n\n\nJournalist Kim Masters says an earlier attempt, by the Hollywood Reporter, to report Weinstein’s abuse fell short when a source backed out. (Michael Loccisano/Getty Images for Peabody)\n\nAmbra Battilana Gutierrez accused Weinstein of groping her in 2015, and became the subject of items in the New York Post’s Page Six column. (Pier Marco Tacca/Getty Images)\n\nWhen \"Inglourious Basterds\" was coming out in late summer 2009, Weinstein called him.\n\n\"Larry, I want the cover,\" Weinstein said, according to Hackett, who balked at being pitched a bloody Tarantino movie.\n\n\"Harvey, this is People magazine,\" Hackett replied. \"We do Julia Roberts movies.\"\n\nBut Weinstein provided the film's star, Brad Pitt, and People ran him on the cover, five days before the film's opening, with the headline \"Brad opens up to People.\"\n\nNew York journalists said Weinstein — one of the few Hollywood moguls based in the city — was a frequent source of scoops and celebrity gossip for tabloid papers. Many Weinstein-watchers took note of what seemed to be an orchestrated media campaign against Ambra Battilana Gutierrez, the model who accused Weinstein of groping her in a Tribeca hotel room in 2015.\n\nThe New York Post published photos of her in a bikini and labeled her \"Grope Beauty\" on its cover. Its Page Six column reported that a police source said there was no physical evidence for Gutierrez's claim. In fact, Gutierrez had worn a hidden police microphone and recorded Weinstein apologizing to her for the incident.\n\nBut Weinstein had a knack for flattering reporters. He once had his staff put together a mock poster for \"Page Six: The Movie\" — starring George Clooney, Nicole Kidman, Russell Crowe, Mel Gibson and Matt Damon as the column's authors — and sent it to the newsroom.\n\n\"Unfortunately, everyone likes to be around glamour, right?\" said Tina Brown, the veteran New York City editor who oversaw Talk magazine, a much-hyped but short-lived project of Miramax. \"All these favors and goodies were cherished by these reporters. It wasn't worth it to them to disrupt that system.\"\n\nWeinstein was occasionally the subject of stories, which he also tried to control. After reports that he had been spotted with supermodel Gisele Bündchen at a nightclub, he contacted Lloyd Grove, author of the New York Daily News's gossip column from 2003 to 2006. \"He asked me to do a follow-up item saying they were just friends,\" said Grove, who sensed that Weinstein was trying to calm the suspicions of his then-wife, Eve.\n\nOn another occasion, Grove said Weinstein \"cajoled and threatened\" him when he wouldn't kill an item about Weinstein's divorce from Eve. Weinstein first tried to trade the item for another bit of gossip, Grove said, and next threatened to ban him from Miramax's film screenings. Grove said he could buy his own movie tickets.\n\nEventually, Grove said, Weinstein backed down when he realized he had no leverage. But first, he said something Grove said \"should be embroidered on a pillow. He said, 'I'm the scariest m-----f----- you'll ever have as an enemy in this town.' \"\n\n'It's just a kiss'\n\nAs difficult as Weinstein was in private, in public he presented himself as a champion of liberal political campaigns and overlooked causes.\n\n\n\nDirector and actress Lina Esco says that Weinstein pressed her to kiss him — and also presented himself as a champion of women. (VALERIE MACON/AFP/Getty Images)\n\nIn 2014, a young director and actress named Lina Esco gave Weinstein a \"very special thanks to\" credit in her first film, \"Free the Nipple,\" a feminist look at gender inequality and objectification. While making it, she struggled to find the right editor and, at a friend's urging, contacted Weinstein, who offered assistance.\n\nWhat Esco didn't publicly share until she was contacted by The Post last week was a previous interaction she had with Weinstein. Around 2010, they were introduced through a mutual friend, in a casual and platonic setting, and she accepted his invitation to dine with him at the Peninsula. Esco viewed it as a chance to talk with a mentor about film craft. But toward the end of dinner, she said, Weinstein told her: \"I think we should see a movie in the theater, like back in the day, and we should kiss.\"\n\nShe brushed him off by saying she didn't date older guys, but she said he pressed on — \"It's just a kiss\" — and kept pressing.\n\n\"He tried to insinuate that everything would be easier for me if I went along,\" Esco remembered. Increasingly uncomfortable, she tried to speed up the dinner, but assumed it was an isolated incident.\n\nHer story illustrates the complicated vortex of Harvey Weinstein: He'd been inappropriate. But he was the most powerful man she knew. She was a feminist. And he'd presented himself as a champion of women. He implied that she needed him. He'd set up a Hollywood world in which everyone needed him.\n\nLast week, when the allegations started to pour in, Esco realized that her dinner hadn't been an isolated incident. \"It all made me want to puke,\" she said. \"I sat and had dinner with this guy. I had dinner with this guy and it turns out he is everything I stand against.\"\n\nYet within liberal politics, Weinstein was seemingly everywhere: White House state dinners, fundraisers alongside Leonardo DiCaprio, the premiere of \"Shakespeare in Love\" with Hillary Clinton on his arm.\n\nHe called her \"the first lady of all our hearts,\" the New York Times reported at the time.\n\nShe called Weinstein \"my friend Harvey.\"\n\nHis personal giving was dwarfed by that of many other showbiz moguls — only $1.8 million since 1979. But when President Bill Clinton sought help for his legal-defense fund during the Monica Lewinsky saga, Weinstein cut a $10,000 check.\n\n\n\nIn 2012, Secretary of State Hillary Clinton and Weinstein attend the Time 100 Gala in Manhattan. At the premiere of “Shakespeare in Love,” Clinton was on his arm. (Larry Busacca/Getty Images for TIME)\n\n\"It would be almost impossible not to go to something that he convened over the years; he just did so much,\" said longtime Clinton donor Alan Patricof. \"I did a lot of fundraising for the Clintons over the years, but I was throwing pancake breakfasts. His were not pancake breakfasts.\"\n\nOn Oct. 5, as the first allegations of sexual harassment broke in the New York Times, Weinstein issued to the paper a rambling statement of apology that seemed crafted to remind readers of his liberal bona fides, joking about his wish to give President Trump \"a retirement party\" and vowing some form of atonement through political work.\n\n\"I'm going to give the [National Rifle Association] my full attention,\" Weinstein wrote, adding that he would establish a $5 million scholarship foundation at the University of Southern California for women directors.\n\n\"It will be named after my mom,\" he wrote, \"and I won't disappoint her.\"\n\n\n\nWeinstein and Ben Affleck attend the 2013 Producers Guild Awards in Beverly Hills, Calif. Affleck shared an Academy Award with Damon for their screenwriting work on “Good Will Hunting.” (Todd Williamson/Todd Williamson/Invision/AP)\n\n'He's helped out\n\nso many girls'\n\nOver the past two years, powerful men with secret lives have been exposed by women who decided to speak out. In 2015, dozens of women, one after another, accused legendary comedian Bill Cosby of drugging and assaulting them over nearly 50 years. In early 2016, female employees of Fox News, spurred on by high-profile host Gretchen Carlson, accused chief executive Roger Ailes of sexual harassment. He resigned that July. Less than a year later, Fox News host Bill O'Reilly was ousted under similar circumstances.\n\nMeanwhile, Trump — publicly accused of harassing or groping more than a dozen women — achieved the nation's highest office, an event that some women found crushing but also catalyzing.\n\nBrown, who said she had never heard anything but milder rumors about Weinstein, called the election \"a tipping point for a great many women.\"\n\n\"The dam has broken for Mr. Weinstein and for others,\" said the lawyer Gloria Allred. She is representing several of Weinstein's accusers, but said she has \"also been getting calls about other men in Hollywood. Studio executives, A-list actors. Big names. Names you would know.\"\n\nThough she represented more than 30 of Cosby's victims, she said she suspects \"this is going to be bigger. It's a tsunami.\"\n\nOn Tuesday night in Los Angeles, a group of women met for their regular writers group, and they talked about Weinstein. One of the attendees was Cami Delavigne, the co-writer of \"Blue Valentine\" — a searing drama, starring Michelle Williams, that was distributed by the Weinstein Co. At its 2010 premiere, Delavigne approached the producer to thank him for having faith in the movie.\n\n\"What I got from him was a look up and down my body, and a look of disdain, and then I was dismissed,\" Delavigne said. \"And I see that form of dismissal if I look simply at the Weinstein Company's roster.\" The Weinsteins, she said, \"built Soderbergh's career . . . built Tarantino's career, he championed Paul Thomas Anderson, he championed his boys — and there were no female voices in there.\"\n\nThe lack of female voices in Hollywood, Delavigne said, is \"a more entrenched danger, and entrenched culture.\" A common note she receives from producers, during the screenwriting process, is to make her female characters more \"likable.\" That one word, she said, epitomizes the film industry's attitude about women.\n\n\"It is not 'likable' for a woman to say 'no,' to say 'you can't do that,' \" Delavigne said. \"That is not likable. That is not charming. That is not sweet.\"\n\nAnd for 30 years, it was very important for women in Hollywood to be likable to Harvey Weinstein.\n\n\n\nChelsea Skidmore says that she met Weinstein around 2013. She says she had at least four encounters with Weinstein in which, under the pretense of discussing business, he would expose himself or try to coerce her into getting physical with other women.\n\nChelsea Skidmore met Weinstein around 2013, shortly after she moved to Los Angeles to pursue an acting and comedy career.\n\n\"He'd love you,\" she remembers a producer saying. So she met Weinstein for tea in the lobby of the Peninsula. Two assistants joined at first, but he soon dismissed them.\n\n\"We're going upstairs,\" she said he told her.\n\nIn his suite, she said, he asked her for a massage. She tried to laugh it off, saying, \"I'm not very good at massages.\" She said he then began masturbating in front of her. (Skidmore's mother confirmed that her daughter told her about the incident at the time; Geiss made an almost identical claim). And after he finished, while Skidmore sat in shock, Weinstein told her nonchalantly that he'd like her to write a pilot for him.\n\nSkidmore would have at least three other encounters with Weinstein in which, under the pretense of discussing business, she said, he would expose himself or, on two occasions, try to coerce her into getting physical with other women — one of whom, at Weinstein's behest, would try to convince Skidmore to participate by saying, \"Oh, but he's helped out so many girls.\"\n\n\"He had just a very forceful way of going about things,\" Skidmore said in an interview with The Post, the first time she had publicly spoken about these encounters. \"He forces himself on you, talks you into it and doesn't leave you with an option.\"\n\nBefore their final meeting, in 2016, she said he sent her text messages such as \"u r obviously mad at me?\"\n\nDuring that encounter, Skidmore tried again to keep the conversation focused on business, she said, until he walked into another room and returned naked.\n\n\"Can you help me out?\" she said he kept asking. \"Can you help me out? Can you help me out?\"\n\nHe was both needy and abusive, as on the day 30 years earlier when his \"Playing for Keeps\" producer said Weinstein punched him and begged him to stay. Skidmore said he finally forced her to stand in front of the mirror, next to him, while he masturbated.\n\n\"I just grabbed my stuff and walked out and never talked to him again,\" Skidmore remembered. \"I was hysterically crying in the car. Went home really, really upset. Cried for a long time. Like, I'm never, ever, doing that again.\"\n\nShe only decided to share her story after seeing other women's accounts, which made her feel that she wouldn't be alone.\n\nShe is still afraid that speaking out might hurt her career.\n\nHelena Andrews, Bethonie Butler, Alice Crites, Geoff Edgers, Paul Farhi, Emily Heil, Elahe Izadi, Kimberly Kindy, Stephanie Merry, Caitlin Moore, Anu Narayanswamy, Sarah Polus, Roxanne Roberts, Margaret Sullivan, Julie Tate, Ben Terris and Emily Yahr contributed to this report.", "images": ["https://www.washingtonpost.com/resizer/xi7AZU2cv2Dwhp3SVXxaYYZEFNo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GLFC34VQJYI6PG4TXFYEHZL2EI.jpg", "https://www.washingtonpost.com/resizer/TXJKur-cQ3m4AF9lqk_kkjfemkk=/3x2/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1"], "top_img": "https://www.washingtonpost.com/resizer/xi7AZU2cv2Dwhp3SVXxaYYZEFNo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GLFC34VQJYI6PG4TXFYEHZL2EI.jpg", "keywords": [], "authors": ["Monica Hesse", "Style Reporter", "Dan Zak", "Feature Writer", "October", "Monica Hesse Is A Columnist For The Washington Post'S Style Section", "Author Of", "American Fire.", "Dan Zak Is A Reporter For The Washington Post. He Writes A Wide Range Of News Stories", "Narratives"], "canonical_link": "https://www.washingtonpost.com/lifestyle/style/violence-threats-begging-harvey-weinsteins-30-year-pattern-of-abuse-in-hollywood/2017/10/14/2638b1fc-aeab-11e7-be94-fabb0f1e9ffb_story.html", "title": "Violence. Threats. Begging. Harvey Weinstein’s 30-year pattern of abuse in Hollywood.", "meta_data": {"object-hash": 1508338967, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "harvey weinstein, accusers, lina esco, weinstein rape, weinstein assault, weinstein accusers, miramax, bob weinstein, harvey weinstein buffalo, chelsea skidmore", "news_keywords": "harvey weinstein, accusers, lina esco, weinstein rape, weinstein assault, weinstein accusers, miramax, bob weinstein, harvey weinstein buffalo, chelsea skidmore", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@MrDanZak"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/lifestyle/style/violence-threats-begging-harvey-weinsteins-30-year-pattern-of-abuse-in-hollywood/2017/10/14/2638b1fc-aeab-11e7-be94-fabb0f1e9ffb_story.html", "image": "https://www.washingtonpost.com/resizer/xi7AZU2cv2Dwhp3SVXxaYYZEFNo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GLFC34VQJYI6PG4TXFYEHZL2EI.jpg", "title": "Violence. Threats. Begging. Harvey Weinstein’s 30-year pattern of abuse in Hollywood.", "description": "From a 1984 assault in Pennsylvania to goading texts in 2016, accusations appear to show a lasting system of manipulation."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "opinion": "false", "author": "https://www.facebook.com/MrDanZak2/"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "From a 1984 assault in Pennsylvania to goading texts in 2016, accusations appear to show a lasting system of manipulation.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/MrDanZak2/"}, "movies": [], "publish_date": 1507910400.0, "source": "https://www.washingtonpost.com", "summary": ""}