{"url": "https://www.inquisitr.com/4640667/how-dance-moms-star-abby-lee-miller-is-celebrating-her-first-thanksgiving-behind-bars/", "text": "Former Dance Moms mentor Abby Lee Miller, who is currently serving her yearlong sentence at FCI Victorville, is reportedly celebrating this year’s holiday in a totally different way.\n\nIn an exclusive report by Radar Online, it has been alleged that the 51-year-old choreographer will not participate in the traditional Thanksgiving meal organized for the inmates.\n\nAccording to the webloid, Abby Lee Miller is going to skip the holiday dinner because of a special visitor that will drop by to discuss something important to her. Apparently, the inmates will gather for the Thanksgiving dinner around 11:00 — the same time when the former Dance Moms star will be in visitation.\n\nAn insider revealed to the outlet that their Thanksgiving meal will consist of “dried up turkey, canned cranberry juice, canned corn, green beans, mashed potatoes, one roll with a small pad of butter, one slice of pumpkin pie, and one slice of pecan pie.”\n\nDespite missing out on the meal, Abby Lee Miller will still be allowed to get her share of food once her visitor leaves, it has been claimed.\n\n“Unfortunately, by the time Abby gets her meal, it will be cold,” a source told the gossip site.\n\nPreviously, it has been reported that the controversial choreographer has not received any visits at the FCI Victorville in California. According to reports, the ALDC founder has been lonely in the past months, especially with no visitors.\n\nhttps://www.instagram.com/p/BX_lHnhF8vV/?hl=en&taken-by=therealabbylee\n\nHowever, the webloid alleged that Abby Lee Miller has been “looking forward to her Thanksgiving visitor for weeks.” There were even claims that the former Dance Moms star has been “primping” herself just for the special visit.\n\n“She had her hair cut and colored for the visitor using commissary-bought hair dye,” the source added. “She’s even paid an inmate to style her hair for her.”\n\nSo who is the special visitor? Radar Online claimed that Abby Lee Miller is meeting a book publisher who was approved by the BOP to visit her. Apparently, the Pittsburgh native may have landed a book deal despite being locked up in jail.\n\nhttps://www.instagram.com/p/BbcrNF_lx8J/?hl=en&taken-by=therealabbylee\n\nThe outlet also noted that the celebrity dance instructor already has a ghostwriter that will help pen her book.\n\n“It appears that Abby Lee has a book deal in place,” an insider told the webloid, “But she has not written anything since she’s been locked up and has a ghostwriter penning the book.”\n\nAside from a ghostwriter, the former Dance Moms star reportedly has someone who manages her social media accounts as evident in her regular posts and updates online. In fact, Abby Lee Miller’s presence is still very much felt on social media despite being in jail for four months now.\n\n[Featured Image by Rich Fury/Invision/AP Images]", "images": ["https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/Dance-Moms-Abby-Lee-Miller-Thanksgiving.jpg", "https://secure.gravatar.com/avatar/d4beb6dae76d06be0ac3ac9fccf03064?s=250&d=mm&r=g"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Van Bermudez"], "canonical_link": "https://www.inquisitr.com/4640667/how-dance-moms-star-abby-lee-miller-is-celebrating-her-first-thanksgiving-behind-bars/", "title": "How ‘Dance Moms’ Star Abby Lee Miller Is Celebrating Her First Thanksgiving Behind Bars", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}