{"url": "www.inquisitr.com/3859542/kim-kardashian-kris-jenner-feuding-feud-kim-phasing-out-used-her/", "text": "Kim Kardashian is allegedly “phasing out” mom Kris Jenner, particularly when it comes to her responsibilities as her longtime manager, amid reports Kim is ready for a total image overhaul after returning to the spotlight following her October robbery.\n\nThat’s according to a new report by Radar Online, who’s claiming that the mother-daughter duo could be caught in a nasty feud as a source alleged that Kardashian has had somewhat of an epiphany during her time away from the spotlight and allegedly has now opened her eyes to see how Jenner “used her” to build the Kardashian brand.\n\nAccording to the site, Kim is ready to project a very different image from the uber-glamorous money flaunting Kardashian fans used to know and is allegedly ready to kick mom Kris to the curb, at least professionally, in order to do so.\n\nA source alleged to the site this week that Kim now “seems to be thinking that Kris used her to get where she is today,” which Radar Online is alleging could have led to a nasty feud between Jenner and her daughter as well as the reality star reportedly making a pretty big business decision when it comes to her mom.\n\n[Image by Vivien Killilea/Getty Images for Haute Living]\n\n“[Kim] will never think of [Kris] in the same way again,” the source said of Jenner’s supposed drama with her daughter amid reports she believes Jenner has been “using” her for years.\n\nThe site then went on to report that Kim is now in the process of projecting her new toned-down image amid the feud claims with Kris, revealing that Jenner may no longer play such a big part in Kardashian’s career going forward.\n\n“Kim hired a transition team to make sure that she gives off a different image than she did previously,” the source said of Jenner and her daughter potentially parting ways professionally, claiming that “part of this process includes phasing out [Kris’s] management.”\n\nWhile Kris and Kim have not commented on the claims, this isn’t the first time it’s been reported that Kardashian may be looking to distance herself from Jenner, at least professionally, in the wake of her October robbery in Paris.\n\n[Image by Alberto E. Rodriguez/Getty Images]\n\nRadar Online claimed back in October that Kim Kardashian had grown wise to Kris Jenner’s “money making machine” after taking some downtime at the end of 2016, alleging at the time that Kim has been so busy with her career that she’s failed to realize how much Jenner, who is often referred to as her “momager,” had been controlling her life and career.\n\n“Kim never realized how much [Kris] and the money-making machine was controlling her until this robbery,” an insider told the site of Kardashian’s feelings about Jenner at the time, months before it was reported that the Keeping Up with the Kardashians star is allegedly looking to “phase out” Kris from her career.\n\n“Kim is just starting to think that maybe Kris’s intentions were not pure all along,” continued the source in October, adding that Kim has been doing a lot of thinking about her father Robert Kardashian while taking some time away which has allegedly helped her to get wise to Kris’s seemingly relentless pursuit of fame for herself and her family.\n\n[Image by Jason Merritt/Getty Images]\n\n“[Kim] told her family that she wanted to be the girl that her father wanted her to be and not the girl that she became with Kris’s help,” a source revealed last year, just months before it was reported that a feud could be brewing between Kardashian and Jenner.\n\nWhat do you think of reports claiming Kim Kardashian and mom Kris Jenner could be caught in a feud amid claims Kim is attempting to “phase out” her mother’s management?\n\n[Featured Image by Pascal Le Segretain/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/01/GettyImages-460347614.jpg", "https://secure.gravatar.com/avatar/04740ca59ff3a7ed6178872d42206b16?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/GettyImages-459809326.jpg", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/GettyImages-485155908.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/Kim-Kardashian-Kris-Jenner-Feud.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Emily Hutchinson"], "canonical_link": "https://www.inquisitr.com/3859542/kim-kardashian-kris-jenner-feuding-feud-kim-phasing-out-used-her/", "title": "Kim Kardashian & Kris Jenner Feud? Kim Allegedly ‘Phasing Out’ Kris, Believes She ‘Used Her’ Source Says", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}