{"url": "https://www.independent.co.uk/life-style/venus-williams-feminist-labels-identify-elle-uk-interview-us-tennis-player-a8344411.html", "text": "If anyone is the epitome of female empowerment, surely it’s the professional tennis player with four Olympic gold medals under her belt who also happens to be ranked eighth in the world.\n\nHowever, despite stratospheric sporting and entrepreneurial successes and being a fierce advocate for equal pay in her industry, Venus Williams does not identify as a “feminist”, at least not in the lexical sense.\n\nIn an interview with Elle UK, the 37-year-old was eager to distinguish herself from the term: “I don’t like labels, though I do think as women we have much more power and opportunities in our hands than ever before.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n“We truly don't know how powerful we are. There's nothing like a powerful woman walking into a room; her presence is like nothing else.\"\n\nThe seven-time-grand-slam winner went on to laud the powerful women she sees in sport today.\n\n“There are so many emerging forces,” she said, “there's been so much growth for women in sports. It's very exciting.\n\n“You have to be able to stand up for what you believe in and I think I've done a good job. I guess I don't have too many regrets.\"\n\nYounger sister Serena also features in the magazine interview, hailing Venus for her “strong and powerful” qualities, describing her as an “overachiever”.\n\nWilliams isn’t the only high-profile female to distance herself from the feminist label.\n\nDespite espousing feminist values and being strong advocates for equal rights, stars like Katy Perry, Sarah Jessica Parker, Kelly Clarkson and Susan Sarandon have all distanced themselves from the terminology.\n\nSome abhor it as \"old-fashioned\" while others choose to identify with what they perceive to be less loaded terms, opting for the \"humanist\" moniker, which funnily enough has nothing to do with equality at all and is actually a Renaissance philosophy that advocates human agency over supernatural superstitions.\n\nEven Judd Apatow, whose TV series Girls was constantly at the vanguard of important conversations surrounding feminism throughout its five-year-run, doesn’t call himself a “feminist”.\n\nWhat’s in a name? Well, quite a lot, apparently.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/10/09/gettyimages-596412812.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/10/09/gettyimages-596412812.jpg", "keywords": [], "authors": ["Olivia Petter"], "canonical_link": "https://www.independent.co.uk/life-style/venus-williams-feminist-labels-identify-elle-uk-interview-us-tennis-player-a8344411.html", "title": "Venus Williams says she doesn’t identify as a feminist: ‘I don’t like labels’", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/life-style/venus-williams-feminist-labels-identify-elle-uk-interview-us-tennis-player-a8344411.html", "title": "Venus Williams says she doesn’t identify as a feminist: ‘I don’t like labels’", "description": "The iconic tennis star isn't the only woman to distance herself from the term", "updated_time": "2018-05-10T10:44:28+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/10/09/gettyimages-596412812.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8344411"}, "description": "If anyone is the epitome of female empowerment, surely it’s the professional tennis player with four Olympic gold medals under her belt who also happens to be ranked eighth in the world. However, despite stratospheric sporting and entrepreneurial successes and being a fierce advocate for equal pay in her industry, Venus Williams does not identify as a “feminist”, at least not", "keywords": "Feminism, Venus Williams, Serena Williams, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Feminism", "published_time": "2018-05-10T09:51:00+01:00", "modified_time": "2018-05-10T10:44:28+01:00", "section": "Lifestyle", "author_name": "Olivia Petter", "content_type": "story", "word_count": 378, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 5}, "twitter": {"title": "Venus Williams says she doesn’t identify as a feminist: ‘I don’t lik…", "description": "If anyone is the epitome of female empowerment, surely it’s the professional tennis player with four Olympic gold medals under her belt who also happens to be ranked eighth in the world. However,", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1525942260.0, "source": "https://www.independent.co.uk", "summary": ""}