{"url": "https://www.vulture.com/2018/06/the-bold-type-recap-season-2-episode-4.html", "text": "Last we saw Little Jane, she was tearfully walking out of the Scarlet offices after asking for her job back and being rejected by pseudo-mother figure Jacqueline. It was heartbreaking for sure, but also extremely realistic. Jane’s former editor-in-chief may be a goddess divine, but she isn’t going to magically fix every problem her employees may have. The real world is tough, Little Jane. Get used to it.\n\nUnemployment isn’t all bad for Jane, though. At least she has a reason to put on pants and go out into the sunlight: Our girl has a lunch date with Dr. Ben. It is adorable, you guys! He says things like “Tinder application” and admits to being mad that “nerds” are cool now even though he had to suffer through a childhood of being an actual nerd. Dr. Ben is lovely. Here’s the thing: Is he Too Nice and Too Kind and Too Drama-Free to be a viable endgame love interest on this show? I fear that Little Jane likes them complicated. Want some evidence? When their food arrives, Dr. Ben says grace and it completely and utterly freaks Jane out. If she wanted a catch to explain Dr. Ben’s near perfectness, she finds one in this.\n\nWhen she explains the situation to Sutton (“It’s a BIG but!”) and Kat, they wonder if perhaps Jane has some unresolved issues when it comes to Ben’s particular brand of religion and not religion itself. A bread crumb for what’s to come later.\n\nThe next day, Jane takes her unemployment show on the road and ends up at a local coffee shop to work. She spends most of her time annoying the barista by only drinking water and ordering a mini-biscotti. She is contemplating a cat-sitting job posted on the job board when a familiar voice rings in her ears. Pinstripe is back, babies! As much as I adore Dr. Ben, this entire scene, full of some top-notch banter, reminds me just how fun the Jane-Ryan relationship was to watch. They are brimming with chemistry! Can someone please make out in this coffee shop?\n\nThere is a point to their banter, though. Jane learns that Ryan is currently working as a “Page Six” party reporter by night and “working on a novel” by day. Since Jane is in need of a gig, she wonders if she’d be a good fit for “Page Six.” Pinstripe is hesitant — he doesn’t think Jane could hack it on the party-gossip beat — but he’s willing to give her a shot. She can join him at a swanky bar this evening and if she ends up getting some real scoop, he’ll introduce her to his editor.\n\nAs much as Jane insists things with Pinstripe are purely business, even Sutton knows there’s more to it than that, and the proof is in Jane’s choice of underwear for the evening (fancy, not full coverage). Like Sutton, I too enjoy a good love triangle. Jane’s first night with Pinstripe, though, does stay firmly in the business realm. She ends up getting some scoop on a Knicks player changing sneaker endorsements and Ryan is impressed. He invites her to work the party circuit one more time before meeting with his editor. She declines in favor of a date with Dr. Ben. See guys, this really is a triangle! #MoreThanALine\n\nUnfortunately, the Scrabble and take-out date goes downhill fast once Jane catches a glimpse of Dr. Ben’s cross tattoo. They get into the religion thing. She just can’t understand how a man of science and rational thinking could believe in things like prayer being able to heal sick people. It gets awkward and intense, which is definitely not the best second-date vibe. Jane ends up grabbing Sutton and Kat and heading back to the Bronze Bomber to meet up with Pinstripe. Again, she nails it on the gossip hunt and discovers the NY14 reporter who interviewed her not too long ago is cheating on his wife. When Pinstripe informs her that his wife is six months pregnant, which makes the story even more scandalous, Jane wants to call it quits. They’d be destroying lives and there are just some lines she isn’t willing to cross, even if Ryan is. It seems like the triangle is officially blown to bits.\n\nJane runs back into the arms of Dr. Ben. She comes clean about why she got so angry about his faith — it all has to do with her mom. Her mom was religious, and even more so after her cancer diagnosis. Her mom prayed. Jane prayed. But her mom still died. So, yeah, she has a tough time buying into the healing powers of faith. Katie Stevens rips out your heart in this scene, it is so good. Dr. Ben is just as empathetic as you’d imagine, and their relationship gets back on track. Little Jane and Dr. Ben 4Eva!\n\nKat is also navigating some troubling romantic waters in this episode. She and Adena finally end up hanging with some of Adena’s friends — even though Adena is a little reluctant to hop into that whole “New York art-world lesbian” scene. When Kat realizes that many of the ladies at the bar they’re hanging at are Adena’s exes, both curiosity and jealousy get the better of Kat. She wants to know Adena’s number: exactly how many women has she slept with? When Adena tries to change the subject and answers by saying “the past is in the past,” it only agitates Kat more.\n\nShe needs a meeting with her girls. The three best friends that anybody could have chat about their own numbers (Jane’s is 4, Sutton’s is 28), and how they define sex, and it is all very nonjudgmental and frank and funny — basically, it is exactly why this show resonates with so many people. Still, it most definitely does not quash Kat’s fears. She’s not worried about Adena’s actual number of partners, she’s more worried about the number of serious relationships she’s been in. Remember: Adena was dating someone else when she and Kat got together. Kat’s worried it could be a pattern.\n\nFinally, after one more jealous outburst in a club, Kat and Adena Talk About It. Kat hates that Adena is playing dumb about this conversation because it makes Kat feel like a crazy person for wanting to know some basic information about her girlfriend’s dating history. Adena comes clean: She’s avoiding the conversation in an attempt to protect herself and this relationship. She’s living in a country that doesn’t want her here in order to be with Kat. She’s scared all the time and she doesn’t want to jeopardize the relationship and she doesn’t want to scare Kat off admitting that things are so complicated. One thing that is most definitely not complicated, is that both Kat and Adena love each other. They finally say those three little words out loud.\n\nAw, I love when the romantic stuff ends on a happy note.\n\nFrom the Back Page\n\n• Sutton wants to impress “influencer” Brooke Langley, who is being profiled in Scarlet, as a means to move up in the fashion world. The ladies end up at the Bronze Bomber and really hit it off — until Brooke puts $500 dollars worth of cocaine (labeled “miscellaneous”) on Sutton’s company credit card and assures her it’s totally cool and normal. Sutton has reservations, but can’t pass up the invite to an elite fashion-world dinner party. The girl is trying to make some career moves — she’ll be expensing that coke.\n\n• You guys, Oliver makes my heart go pitter-patter. Last week he was voicing his disgust over an ignorant designer, this week he admits to wishing “influencers” were not a thing. Sutton may worship at Brooke’s fashionable feet, but Oliver does not. He’s wonderful!\n\n• Oh, also: his dog’s name is Nacho. That is all.\n\n• SUTTON’S GREEN VELVET BLAZER.\n\n• “Daddy needs his beauty rest.” “Please don’t ever call yourself daddy again.”\n\n• I love that Adena is sitting at home watching Friends on her computer. Fictional characters — they’re just like us!\n\n• “My 28 is a strict interpretation because once you get into oral and hand stuff — I’m gonna need a bigger boat.”", "images": ["https://pyxis.nymag.com/v1/imgs/302/608/acdd88ffe4111d72ed301cb2e90b250414-26-the-bold-type.1x.rsocial.w1200.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/06/26/recaps/26-the-bold-type.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/302/608/acdd88ffe4111d72ed301cb2e90b250414-26-the-bold-type.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Maggie Fremont"], "canonical_link": "https://www.vulture.com/2018/06/the-bold-type-recap-season-2-episode-4.html", "title": "The Bold Type Recap: A Good Triangle", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Bold Type Recap: A Good Triangle", "url": "https://www.vulture.com/2018/06/the-bold-type-recap-season-2-episode-4.html", "description": "Jane’s latest prospect might be too good to be true.", "image": "https://pyxis.nymag.com/v1/imgs/302/608/acdd88ffe4111d72ed301cb2e90b250414-26-the-bold-type.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The Bold Type Recap: A Good Triangle", "description": "Jane’s latest prospect might be too good to be true.", "image": "https://pyxis.nymag.com/v1/imgs/302/608/acdd88ffe4111d72ed301cb2e90b250414-26-the-bold-type.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-06-27T01:01:00.118Z", "tag": "tv, tv recaps, overnights, recaps, the bold type, the bold type season 2, freeform", "publisher": "https://www.facebook.com/Vulture"}, "description": "Jane’s latest prospect might be too good to be true. Kat and Adena’s relationship experiences some growing pains. A recap of The Bold Type Season 2 Episode 4: ‘OMG’", "sailthru.tags": "tv, tv recaps, overnights, recaps, the bold type, the bold type season 2, freeform", "author": "Maggie Fremont", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1530061260.118, "source": "https://www.vulture.com", "summary": ""}