{"url": "https://en.wikipedia.org/wiki/Double_Dutchess", "text": "2017 studio album by Fergie\n\n2017 studio album by Fergie\n\nDouble Dutchess is the second studio album by American singer Fergie. It was released on September 22, 2017.[3] The album is the singer's first to be released under her own imprint, Dutchess Music, in a partnership with Retrofuture Productions and BMG Rights Management, and first since her solo debut, The Dutchess (2006). Promotion for the album began with the release of the album's first single \"L.A. Love (La La)\" in late 2014. \"M.I.L.F. $\" was released as the second single from the album in July 2016, followed by the release of \"Life Goes On\" in November that same year. \"You Already Know\" featuring Nicki Minaj was released as the fourth single on September 12, 2017.\n\nBesides Minaj, the album includes collaborations with YG, Rick Ross, and Fergie's son Axl Jack.\n\nBackground [ edit ]\n\nAfter concluding two worldwide tours with The Black Eyed Peas in support of The E.N.D. (2009) and The Beginning (2010) from 2009 to 2011, Fergie decided to take a break from the group to concentrate on her solo career,[4] mentioning that she had begun writing on her own for her second studio album – a follow-up to The Dutchess (2006) – although she didn't want to \"rush anything out.\"[5] She made her comeback as a solo artist in June 2013 with the song \"A Little Party Never Killed Nobody (All We Got)\", which was included on the soundtrack of Baz Luhrmann's The Great Gatsby (2013). Featuring rappers Q-Tip and GoonRock, the track experienced commercial success.[6][7] In August 2013, Fergie gave birth to her first son with husband Josh Duhamel, Axl Jack. This was followed by an announcement that the singer was in the beginning stages of recording her sophomore solo set in January 2014, scheduled for an early 2015 release. She stated in an interview with radio host Ryan Seacrest that The Black Eyed Peas bandmate and longtime collaborator will.i.am would be handling the production.[8][9]\n\nProduction [ edit ]\n\nFergie desired to have creative control over the album, having co-produced 12 out of 13 tracks on the record and co-written all of them. She stated: \"Becoming a mom and getting pregnant reset me. I just got on my game. I've never taken on this much responsibility and I kept wanting to make it better and better. I wanted to strive for greatness,\"[10] adding, \"You have to at a certain point just let go and say, 'This song is done.'\"[11] That first resulted in \"L.A. Love (La La)\", a DJ Mustard-produced song with hip-hop and pop influences reminiscent of her first record that was released on September 30, 2014. Amid moderate success and mixed reactions to the single, work on the album continued, with Mike Will Made It, RoccStar and Philip \"Hardwork\" Constable all expected to be involved.[11][12] About the sound of the record, RoccStar said it was \"The Dutchess mixed in with Rihanna\", with more edge and ahead of the current musical movement.[13] Charlie Puth revealed he worked with Fergie on a song he defined as a 2015 \"My Humps\",[14] but it did not make the final cut. Despite previous reports, the singer announced in June 2015 that she was still putting the finishing touches on the album and had moved out of her own house to do so without any disruptions.[15][16] She spent some time located in the Morning View Studios living facility, situated inside a mansion on a secluded estate in Malibu, the same location where parts of The Dutchess were recorded about nine years earlier.\n\nIn January 2016, a video of dancers dancing to \"Like It Ain't Nuttin'\" surfaced online along with a still of the video, suggesting the track could be the new lead single off the record. A month later, a demo for the song was leaked. In the meantime, Fergie's husband Josh Duhamel slipped in an interview that the album would be titled Double Dutchess and most likely be out in March of that same year.[17] At that point, due to overall frustration, she had decided to do a video for every song to make up for so many delays.[18] Fergie revealed she had gotten off to Paris and London to shoot art for the album and had shot several videos to coincide with the launch. One of the directors for these videos was Ben Mor, who had worked with the singer previously on the visuals for \"I Gotta Feeling\" and \"Don't Stop the Party\".[19]\n\nFergie performed \"You Already Know\" and \"Love is Pain\" live for the first time during her Rock in Rio Lisboa performance on May 20, 2016. Interludes with new songs \"Just Like You\" and \"Hungry\" were also used, while the latter had its video snippet uploaded to Fergie's Instagram account that same day. A new teaser titled \"Hungry (1st Byte)\" was uploaded to Fergie's VEVO channel on June 9, 2016, being followed by \"Hungry (2nd Byte)\" on June 22, which also confirmed the rumored album title.[20] A few days later it was officially announced that a new song titled \"M.I.L.F. $\" would be released; produced by Polow Da Don, it was made available for purchase on July 1, 2016. Fergie was inspired to write the empowering song after becoming a mother.[21] On November 11, 2016, Fergie released the third single from the record, \"Life Goes On\".[22] In a Facebook Live Q&A, Fergie announced that the album was to be released in January 2017, however it was delayed and was rescheduled to be released in the first quarter of 2017.[23] During the live chat, she stated: \"[I've] put blood, sweat and tears into this album and there's personal stuff, there's pop stuff, hip-hop stuff, throwback stuff – I always like a little throwback – some reggae, R&B, ballads, fun, silly, all of the above. [...] So it's kind of, I'm going to use the word 'cornucopia' again because it's Thanksgiving time.\"[24]\n\nIn May 2017, it was announced that Fergie had parted ways – by mutual decision – with longtime label Interscope and would launch her own imprint, Dutchess Music, as part of a global partnership with BMG, taking her catalogue along with her. In announcing the signing, the label's executive vice president Jon Cohen stated: “What Fergie has put together with Double Dutchess is so inventive it redefines her as an artist. Her prolific output has already made our collaboration one of my most exciting times with BMG and we can't wait for its reveal.”[25] In July, an unfinished version of the entire album leaked onto the internet after the songs were accidentally uploaded to a BMG database in the midst of transitioning to the label.[26] On August 5, Fergie took to social media to respond to the leak, sharing a mysterious teaser with the words \"Exposed, but not fully.\"[27] The album was made available for pre-order from August 25, 2017, with a September 22 release date.[28][29][30]\n\nTitle and artwork [ edit ]\n\nThe album's title Double Dutchess, is a nod to Fergie's first record, going as further to be described as \"The Dutchess part two\", though it goes a bit deeper than that: it also refers to “the duality of my personality, the dark and the light, the hard and the soft, the girl with the mask on with all the frills and stuff, and then taking away that mask and seeing what's underneath all that,” as the singer explained.[31] The album's art was shot by Mert and Marcus in London and styled by Carine Roitfeld. Giovanni Bianco, who collaborated with Madonna on her 2012 The MDNA Tour, artistic-directed the album.[32] The Target exclusive edition cover of the album has a red background unlike the entirely black-and-white standard artwork.\n\nMusic and lyrics [ edit ]\n\nWhen putting the record together, Fergie was influenced by Amy Winehouse, Jhené Aiko, Ed Sheeran, Robert Plant, Guns N' Roses and old-school rap artists.[33] Much like 2006's The Dutchess, Double Dutchess is a mainly pop album that tackles a wide spectrum of sounds, swinging from hip-hop, R&B influences to jazz, reggae vibes along with alternative 80's rock references[citation needed]. The singer further explained the mix and why she refused to stick just to one genre or to follow current musical trends: \"The Dutchess was all over the place too. That album had all kinds of different styles, but the common thread was that they're all organic to me. I can't put out an album of just one style of music — of just what's “on trend.” I would feel like a fraud.\"[34] After giving birth to first son Axl Jack in August 2013, Fergie felt very motherly and casual, far from the tomboy-ish persona the public had came to know with The Black Eyed Peas and her first solo record.[35] She credits Brazilian creative director Giovanni Bianco as being the one who helped her get back in touch with the artist she was back then, pushing her to \"pulling that tough side of me back out.\"[35]\n\n\"I'm pretty much the same crazy girl who has listened to N.W.A all her life. So I don't have any real new boundaries in that way [...] I do like to play with my sexuality. And I like to have a good time, and a lot of it is with a wink.\" —Fergie talks about how experiencing motherhood influenced her songwriting with Billboard[33]\n\nLyrically, the album touches on a variety of empowering, emotional and fun themes, such as motherhood, inner strength, relationships and her former meth (Methamphetamine) addiction. In a Q&A interview for Entertainment Weekly, Fergie explained that \"There was a lot of emotional stuff that I needed to clean out from inside me. I really opened my heart on this album. [...] I would go to these different producers and I'd have this stack of composition notebooks.\"[34] Though she split from husband Josh Duhamel amidst the development process of the record[36] and many songs have dramatic lyrics about love, Fergie insisted that the songs are \"about many different relationships, some of them romantic, some of them not,\"[31] going on to say \"It's kind of like a photo album of the last few years of my life.\"[37]\n\nFergie dedicated the song \"Enchanté (Carine)\" to Carine Roitfeld, whom she worked extensively with in the visuals for the record to approach a more sensual, softer side of herself. \"She's a legend – she knows what she wants, she's very detail-orientated, which I love. [...] She would teach me these chic little things and talk about Brigitte Bardot and such. You can't help but be attracted to that and learn from it,\" she said about the homage.[35] The singer brought home a demo of the song and as she was playing it, her son picked up on it and kept singing the French lyrics from the chorus. Fergie immediately started to follow him around with her phone secretly on recorder until she got a take that was decent and usable, and it ended up on the final version of the track.[38][39]\n\nIn one of the lyrics for \"A Little Work\", the album's most powerful song as described by Fergie,[35] she sings \"I'm gonna rip it open and show the world what's there,\" as she explains: “It's not all pretty all the time. There are laughs, there's crying, there's anger, there's severe happiness, there's flirting, there's having fun. [The album] really encompasses the full me, and the full puzzle that makes up the misfit that I am, that doesn't fit into any one category.\"[31]\n\nFergie described the writing sessions as a therapeutic process, saying: \"I would just say that you need to have therapy somewhere, and be able to express your thoughts and feelings, and for me, it's with pen and paper, and it always has been, and I like the drama of it all, so I like to go into it and create the most dramatic way to express my feelings.”[31]\n\nSingles [ edit ]\n\n\"L.A. Love (La La)\" was released as the lead single on September 29, 2014. A remix of the song featuring Compton rapper YG was released a month later and was included on the album as the main version of the song, also being used in its video.[40] It reached number twenty-seven on the US Billboard Hot 100.[41] \"M.I.L.F. $\" was released as the second single from the album in July 2016. It reached number thirty-four on the Billboard Hot 100.[41] \"Life Goes On\" was released in November that same year, reaching number thirty-nine on the US Mainstream Top 40.[42] The album's fourth single, \"You Already Know\", featuring Nicki Minaj, was made available for purchase on August 25, 2017.[43] It officially impacted contemporary hit and rhythmic radio on September 12, 2017.[44] On October 24, 2017, Fergie performed \"A Little Work\" on The Talk, later on, the song was announced as the album's fifth North American single on Beats 1.[45]\n\nPromotional singles [ edit ]\n\n\"Hungry\", featuring Rick Ross, was released as a promotional single on August 25, 2017.[46] The song and its music video were used as teasers over a year leading up to the release of the album.\n\nDouble Dutchess: Seeing Double [ edit ]\n\nThe visuals for the songs on the album were combined into one film titled Double Dutchess: Seeing Double that premiered exclusively at iPic Theaters throughout the United States, as a one-night only event, on September 20, 2017.[47] The event included a previously recorded special Q&A featurette with Fergie totaling 100 minutes, and each ticket purchase also included an exclusive digital download of the album. The duration of Double Dutchess: Seeing Double itself is 62 minutes and 51 seconds.[48] In Canada, the film premiered simultaneously on both Much and MTV on September 22, 2017.[49]\n\nThe film features segments directed by Bruno Ilogti, Alek Keshishian, Rich Lee, Ben Mor, Chris Marrs Piliero, Fatima Robinson, Colin Tilley, Nina McNeely, Chris Ullens and Jonas Åkerlund.[50][51] There are appearances from Jay Hernandez, Mark Vanderloo, Kendall Jenner and many other personalities. In the \"Like It Ain't Nuttin'\" visual, Fergie wears a dress by Dean and Dan Caten, from Dsquared2's 2015 collection. In \"Save It Til Morning\" she wears a shimmery bodycon dress by Tom Ford. In \"Love is Pain\" the singer's standing on a pedestal wearing a sheer Francesco Scognamiglio lace gown. Styling was done by Carine Roitfeld, guided by the artistic direction of Giovanni Bianco.[52]\n\n\"Tension\" has two videos, both directed by Fatima Robinson, the first video was released on Seeing Double but later removed from streaming services due to censorship, and a second video which has an appearance from Joanne the Scammer was uploaded to Fergie's VEVO account on October 4, 2017; it was later also added to the film as the first version was excluded.\n\n\"You Already Know\" was not initially included in the iTunes film, although it was added later. Notably, it is still missing from the Apple Music version of the film.\n\nCritical reception [ edit ]\n\nDouble Dutchess received generally mixed reviews from critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream publications, the album received an average score of 53, based on 4 reviews.[53] Allan Raible from ABC News stated in his review: \"She's a shape shifter with a fun new album\", adding: \"On her own, Fergie remains a versatile, exciting performer, further establishing her growing clout as an entertainer. This record will have its detractors, but at the very least it provides a fun ride.\"[54] Alexa Camp of Slant Magazine stated in her review: \"Lyrically, the songs on the album rely heavily on braggadocious hip-hop tropes. \"M.I.L.F. $\" is an aggro party track that finds Fergie splitting rapid-fire verses about the size of her bank account and her supposed ability to run the club. Conversely, tracks like \"Just Like You\" and \"A Little Work\" find a happy medium between hard and soft, with heavy beats, melodic pop hooks, and lyrics that aim to empower rather than boast. A handful of Caribbean-flavored songs, including the trap-house-infused \"Enchanté (Carine)\" and the breezy \"Love Is Blind\", further elevate Double Dutchess, lending a fresh, modern twist to what too often feels like an old game.\"[56] In The Guardian's review, they stated: \"Double Dutchess is fun and gloriously confident, cementing Fergie's place in pop royalty.\"[55]\n\nCommercial performance [ edit ]\n\nDouble Dutchess debuted on the Billboard 200 at number 19 with first-week sales of 20,870 units (15,507 in pure album sales) in the United States.[57] In its second week on the chart, the album plummeted to position 131 with sales of 3,572. In its third week, the album fell out of the Top 200 with sales of 1,697. The album has sold over 40,000 copies in the US as of late 2017.[citation needed]\n\nTrack listing [ edit ]\n\nDouble Dutchess – Japanese and Target exclusive edition (bonus tracks) [58][59] No. Title Writer(s) Producer(s) Length 14. \"Diddy Zone\" Duhamel\n\nConstable\n\nSean \"The Pen\" Garrett Constable\n\nGarrett 3:14 15. \"Kleopatra\" Duhamel\n\nYoungblood\n\nTariq Bright\n\nKris Stevens\n\nToney Martinez\n\nAdam Kapit\n\nYacoub Elias Kawaja Youngblood\n\nKapit 3:11 Total length: 62:19\n\nDouble Dutchess iTunes Store Deluxe Visual Experience edition (bonus video) [60] No. Title Length 14. \"Double Dutchess Deluxe Visual Experience\" 1:02:51 Total length: 118:49\n\nNotes\n\nInterludes produced by Terrace Martin and Venus Brown.\n\n^[a] indicates a co-producer\n\nindicates a co-producer ^[b] indicates a vocal producer\n\nindicates a vocal producer ^[c] indicates an additional vocal producer\n\nindicates an additional vocal producer ^[d] indicates an additional producer\n\nSample credits\n\nCharts [ edit ]\n\nRelease history [ edit ]\n\nList of release dates, showing region, edition(s), format(s), record label(s) and reference(s) Region Date Edition(s) Format(s) Label(s) Ref. Various September 22, 2017 Standard\n\nDeluxe Visual Experience CD\n\ndigital download\n\nstreaming Dutchess\n\nRetrofuture\n\nBMG [60][78][79][80] United States November 3, 2017 Standard LP [81][82]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://upload.wikimedia.org/wikipedia/en/f/f0/DoubleDutchessOfficial.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f0/DoubleDutchessOfficial.jpg/220px-DoubleDutchessOfficial.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f0/DoubleDutchessOfficial.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Double_Dutchess", "title": "Double Dutchess", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/f/f0/DoubleDutchessOfficial.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}