{"url": "https://en.wikipedia.org/wiki/Jersey_Shore_(TV_series)", "text": "This article is about the series that aired between 2009–2012. For the 2018 series, see Jersey Shore: Family Vacation\n\nJersey Shore is an American reality television series that ran on MTV from December 3, 2009, to December 20, 2012, in the United States. The series follows the lives of eight housemates at a vacation home: in Seaside Heights, New Jersey in seasons one, three, five and six, South Beach, Florida in season two and Florence, Italy in season four, respectively.\n\nThe show debuted amid controversy regarding its use of the terms \"Guido/Guidette\", its portrayal of Italian-Americans and allegations of perpetuating stereotypes, as well as criticism from locals that the cast members were not residents of the area.[1][2][3][4] (Most were from New York, and at least two of them were not Italian.)\n\nThe show became a pop culture phenomenon, with classes and conferences at universities about the show, and journalists listing it as one of the most notable shows of the time. The Shore franchise spawned several international adaptations in other countries. Four of the Jersey Shore cast members received spin-off shows on MTV, with the most successful being Snooki & JWOWW . Most of the cast would go on to appear in other reality programs or receive their own shows on various networks.\n\nOn August 20, 2017, a one-off television special called Reunion Road Trip: Return to the Jersey Shore aired on the E! network.[5][6] On November 27, 2017, MTV announced that the cast (with the exception of Giancola) would be reuniting in Miami, Florida, for a new reunion series titled Jersey Shore: Family Vacation.[7] The series premiered globally on April 5, 2018. According to MTV, it is considered a new series and not the seventh season of the original show.[7][8]\n\nOverview\n\nSeason Episodes Originally aired First aired Last aired 1 9 December 3, 2009 ( ) January 21, 2010 ( ) 2 13 July 29, 2010 ( ) October 21, 2010 ( ) 3 13 January 6, 2011 ( ) March 24, 2011 ( ) 4 12 August 4, 2011 ( ) October 20, 2011 ( ) 5 11 January 5, 2012 ( ) March 15, 2012 ( ) 6 13 October 4, 2012 ( ) December 20, 2012 ( )\n\nCast\n\nProduction history\n\nVH1 producer Anthony Beltempo proposed the idea of a show focusing on the \"guido\" lifestyle for TV, in the form of a competition series. Executive producer SallyAnn Salsano, who previously worked on A Shot at Love with Tila Tequila, devised a new concept, inspired by her own summers in a Jersey summer shore house, and retained casting director Doron Ofir to find the cast. MTV Networks President Van Toffler felt that the series \"loud, young, bold\" style was better suited to MTV's sensibilities than VH1, and MTV programming executive Tony DiSanto felt that \"[After The Hills], it was time to go for a more authentic approach, like a documentary.\" Van Toffler described the casting process by saying they looked for \"candor, honesty, boldness and a very combustible, chaotic mess. You could honestly say none of these people were traditionally beautiful.\"[17]\n\nPaul \"DJ Pauly D\" DelVecchio and Mike \"The Situation\" Sorrentino during shooting in Florence, Italy in May 2011.\n\nThe series follows the lives of eight housemates spending their summer in a summer share in Seaside Heights, New Jersey, known as The Jersey Shore House. Season 1 followed cast members Angelina Pivarnick, Jennifer Farley, Michael Sorrentino, Nicole Polizzi, Paul DelVecchio, Ronald Ortiz-Magro, Samantha Giancola, and Vincenzo Guadagnino at the Jersey Shore. Jersey Shore premiered on December 3, 2009, with back-to-back episodes, averaging 1.375 million viewers.[43] Although the initial ratings were considered unimpressive to Salsano, they slowly grew in popularity, and was the subject of parody on Saturday Night Live after the third week, a turnaround that MTV executive Tony DiSanto calls \"the fastest 0 to 60 I've ever seen on a show\".[17] Season 1 posted strong growth every week and ranked #1 in its time period versus all cable competition among P12–34 (people 12 to 34 years old) during the first quarter of 2010, with a season high 2.6 rating for the finale.[44] The season 1 finale audience, 4.8 million, was more than triple that of the premiere, an increase of more than 3.4 million, and was MTV's highest rated original series telecast in almost two years.[44] Overall, the season 1 averaged 2.7 million viewers.[45]\n\nIn an article in Rolling Stone, it was mentioned that the house had 35 remote-controlled cameras in fixed locations, 12 hand-held ones, one IMX camera and six DV cameras.[46] Nicole Polizzi said that:\n\nThey have cameras everywhere, all the time ... You're always being watched. You kind of get a little paranoid, because you're like, 'Who's watching me?' ... It's trippy. it messes with your head. But that's why we go crazy. That's why we fight with each other. That's why we drink. We're living in a house for two months with that shit. We can't have cellphones, TV, radio or internet ... There's no normalcy. It's like a prison, with cameras. The only time we're not on camera is when we're in the shower, and that's why we all take three-hour showers, just to get away from it all.[46]\n\nAfter Season 1, the cast negotiated pay raises, though both they and DiSanto explained that it was not contentious, and was given undue weight by the press. Rather than wait until the next New Jersey summer for Season 2, the production moved to Miami.[17]\n\nIn January 2010, MTV announced that a second season consisting of 12 episodes had been ordered and would air that summer.[47][48][49] It would follow all of the first-season cast as they avoided the cold northeast winter[47][48] by relocating to the South Beach, Florida. In May 2010 the cast relocated back to the Jersey Shore for the rest of filming, but it was later determined that the production company had enough footage from the Miami shoot to fill the entire second season,[50] and that the footage to be shot at the Jersey Shore would be used for a third season.[51] The second season premiered on July 29, 2010,[51] averaging 5.252 million viewers.[52] Season 2 was the #1 television series in the P12-34 demographic for the summer of 2010 across all TV and has also posted continued growth every week.[53]\n\nOn July 20, 2010, MTV announced that the cast would return for a third season,[54][55][56] with the exception of Pivarnick.[57] Season 3 returned to the original Jersey Shore summer setting,[54][55] and replaced Angelina with Deena Nicole Cortese, a longtime friend of Polizzi.[58] The season's January 6, 2011 premiere was viewed by a record 8.45 million viewers, making it MTV's most viewed series telecast ever.[59][60] The second episode of the season once again set a series and MTV high at the time, with 8.56 million viewers,[61] only to set another record with the airing of the fourth episode, which garnered 8.87 million viewers.[62]\n\nOn January 25, 2011, it was confirmed that the show had been renewed for a fourth season, to be filmed in Italy during the first half of 2011.[63][64] The fourth season premiered August 4, 2011.[64] MTV confirmed in June 2011 that the fifth season would return to Seaside Heights.[65]\n\nBelieved complications caused by Nicole Polizzi's pregnancy, and several cast members (including Polizzi, DelVecchio, and Farley) receiving spin-offs sparked talk about the future of the series past the fifth season, however on March 19, 2012, MTV officially confirmed that the series would return for a sixth season, with all cast members returning. Filming for the sixth season took place in mid-2012, and featured Polizzi nearly eight months pregnant. MTV said in a statement, \"While things will definitely be a little different this time when they hit the boardwalk, their trademark hilarity and family dysfunction will remain the same\".[66]\n\nJersey Shore house\n\nThe Jersey Shore house is the name given to the house used on MTV show Jersey Shore. Located in Seaside Heights, the house was used during the first season, starting on December 3, 2009, and was used on the show in four out of the six seasons, the exceptions being season 2 (Miami Beach, Florida) and season 4 (Florence, Italy). Since the show's cancellation, the house is currently being rented out for days at a time;[67] it was reported in 2018 that the house was renting for $1200 a night.[68]\n\nThe house was characterized by its unique decor and the hot tub. During the filming of Jersey Shore, the house was decorated with Scarface posters and Cadillac symbols and wheels. The house is also home to the duck phone, a home telephone in the form of a mallard duck.[69] All of the furniture that is seen on the show was brought in by MTV, including the hot tub, for which they needed a permit from Seaside Heights when filming.[70]\n\nWhen filming season three onward, the home was equipped with 35 remote-controlled cameras in fixed locations throughout the home and the camera crew consisted of twelve handheld cameras, one IMX Camera, and six DV Cameras.[71]\n\nEmployment\n\nWhile staying in Seaside Heights, N.J., the cast worked at a local boardwalk store, the \"Shore Store\", which was owned by Danny and Paul Merk. Danny was also the landlord of the cast's summer house. He described Mike Sorrentino, a self-proclaimed slacker,[68] as the laziest guy in the world. However, he added that Mike was the most talented when it came to sales. The cast started off earning $10 an hour, receiving $20 an hour by the end of the series.[72]\n\nThe Miami season saw the group working at the Lecca Lecca Gelato Caffé situated in South Beach. Producers decided on the location due to its Italian roots. The cast 'slaved over cold gelato' working four hour shifts.[73]\n\nIn Florence, the cast worked at the O'Vesuvio pizza parlor located near the Uffizi Gallery.[74]\n\nMedia and merchandise\n\nDVD releases\n\nOn February 23, 2010, Amazon.com and MTV teamed up to release Jersey Shore on DVD.[75] The title theme, \"Get Crazy\" by LMFAO has been changed.[citation needed] Other songs have been changed since their original air date as well.[citation needed] A retail release by Paramount Home Entertainment with added commentary was released on July 20.[76] Although it is claimed the DVDs are uncensored, the video and some audio is still censored.[77] The DVD also includes special features include deleted scenes, the reunion special, \"Tips From The Situation and Snooki\", \"Before the Shore\", and the \"Jersey Shore Makeover with Michael Cera\", amongst others.[78] On December 28, 2010, the Season 2 Uncensored DVD was released. On July 26, 2011, the Season 3 Uncensored DVD was released. On December 27, 2011, the Season 4 Uncensored DVD was released. On August 28, 2012, the Season 5 Uncensored DVD was released.\n\nSoundtrack and literature\n\nA soundtrack to the series was released as Jersey Shore Soundtrack by MTV and Universal Republic on July 20, 2010.[79][80] Aimed to create the perfect summer playlist, the album features songs from a variety of artists including Enrique Iglesias, Pitbull, Taio Cruz, Ludacris, Lil Jon, 3OH!3, David Guetta, Fergie, Chris Willis, Girlicious and LMFAO as well as DJs like Deadmau5, Steve Aoki, Tiësto, Diplo, Paul Oakenfold and Delvecchio.[80] A deluxe edition of the album was also released containing a bonus CD featuring songs inspired from the first season of the show, like LMFAO's \"Get Crazy\".[79] The first single off the album was Enrique Iglesias' \"I Like It\",[79] whose video also featured the Jersey Shore cast.[81] In September 2010, Matthew Wilkening of AOL Radio ranked Delvecchio's rap song off the soundtrack, \"(It's Time to) Beat Dat Beat\", as the #1 Worst Song Ever on the list of the 100 Worst Songs Ever; as a bonus, Wilkening used Delvecchio's quote as the reason for the #1 list: \"Being a guido's a way of life. I don't represent all Italians, I represent myself. I started this whole GTL shit (Gym, Tan, Laundry). You have to stay fresh to death.\"[82]\n\nA quote book titled Gym, Tanning, Laundry: The Official Jersey Shore Quote Book (ISBN 978-1-4391-9682-3) was released by MTV on June 15, 2010.[83] The book also includes a bonus DVD with the most memorable moments from season one of the show.[84] A sticker book titled Jersey Shore Sticker Activity Book ( ISBN 0-7666-3904-5) was also released on the same date,[85] as well as a 2011 wall calendar ( ISBN 0-7407-9797-2) by Andrews McMeel Publishing.[86]\n\nOther merchandise and appearances\n\nOther merchandise relating to the show have also been released, including talking bobblehead dolls of the cast,[87] a beach game set,[88] Halloween costumes,[89] a \"Gym Tanning Laundry (GTL)\"-labeled sports bottle,[90] \"The Situation - Official App\" for iPhone,[91] as well as various T-shirts.[92]\n\nThe cast of Jersey Shore appeared on the 2010 MTV Video Music Awards on September 12, 2010.[93] Nicole Polizzi appeared on TLC's Cake Boss episode \"Snookie, Super Anthony & a Ship\" on November 8, 2010, in which she orders a cake for her mom. Polizzi also appeared on the March 14, 2011 edition of WWE Raw as the guest host and she wrestled a professional wrestling match on April 4, 2011, at WrestleMania XXVII.[94] Jennifer Farley and Angelina Pivarnick appeared on various episodes of TNA Impact in 2011.[95][96] The cast of Jersey Shore appears on MTV's Season 4 of Disaster Date, starring Jen Lilley, Lauren Zima, Cale Hartmann, Jason Karasev, Russell Pitts, Hasan Minhaj, Diarra Kilpatrick, and Kara Luiz.[97] Angelina Pivarnick appeared in the show NY Ink in which she got a tattoo that shows her time in Jersey Shore.\n\nControversy and criticism\n\nUniversity of Chicago and the University of Oklahoma are among the educational institutions that have had classes or conferences about the show.[98][99][100] In 2010, the cast of Jersey Shore were named on Barbara Walters' 10 Most Fascinating People list,[99] and the series has since been exported to dozens of countries worldwide.[54]\n\nIn 2010, MTV received criticism from Italian American organizations for the way in which they marketed the show, as it liberally used the word Guido to describe the cast members.[101] The term \"guido\" is generally regarded as an ethnic slur when referring to Italians and Italian Americans. One promotion stated that the show was to follow \"eight of the hottest, tannest, craziest Guidos\",[102] while yet another advertisement stated that \"[the show] exposes one of the tri-state area's most misunderstood species ... the GUIDO. Yes, they really do exist! Our Guidos and Guidettes will move into the ultimate beach house rental and indulge in everything the Seaside Heights, New Jersey scene has to offer.\"[103]\n\nCast members Snooki and JWoww are not ethnically Italian. Snooki is Chilean, but was adopted as an infant by Italian American parents. Jwoww is of Irish and Spanish descent.[104] Ronnie, Sammi, and Angelina are only of partial Italian descent: Ronnie is part Puerto Rican, Sammi is part Greek, and Angelina is part Polish.[citation needed]\n\nPrior to the series debut, UNICO National formally requested that MTV cancel the show.[105] In a letter to the network, UNICO called the show a \"... direct, deliberate and disgraceful attack on Italian Americans ...\"[106] UNICO National President Andre DiMino said in a statement \"MTV has festooned the 'bordello-like' house set with Italian flags and green, white and red maps of New Jersey while every other cutaway shot is of Italian signs and symbols. They are blatantly as well as subliminally bashing Italian-Americans with every technique possible ...\"[107] Around this time, other Italian-American organizations joined the fight, including the National Italian American Foundation,[108] the Order Sons of Italy in America and the internet watch-dog ItalianAware.[109][110]\n\nMTV responded to the controversy by issuing a press release which stated in part, \"the Italian-American cast takes pride in their ethnicity. We understand that this show is not intended for every audience and depicts just one aspect of youth culture.\"[101] Since the calls for the show's removal, several sponsors have requested that their ads not be aired during the show. These sponsors include Dell, Domino's and American Family Insurance.[111]\n\nGovernor Christie and the series' portrayal of New Jersey\n\nIn a February 2010 interview, New Jersey Governor Chris Christie called the show \"negative for New Jersey\" because most of the cast members are not from the state. According to Christie, the program \"takes a bunch of New Yorkers and drops them at the Jersey Shore and tries to make America feel like this is the real New Jersey\". Governor Christie took action against the series by trying to encourage people to experience the real Jersey Shore for themselves rather than watch it through MTV: \"I can tell people: They want to know what New Jersey really is? I welcome them to come to New Jersey any time.\"[112] A Fairleigh Dickinson University PublicMind poll released in February 2010 showed that 59% of Americans who had seen the show had a favorable view of New Jersey compared to only 44% of those that had not seen the show.[113] The FDU poll repeated the national telephone survey in 2011 and showed similar results.[114] Consequently, poll director Peter Woolley concluded that \"These measures ... suggest the show isn't hurting the nation's view of the state. In fact, it may be promoting one of the state's best features—not Snooki, but the shore itself.\"[115]\n\nNonetheless, in September 2011, Governor Christie vetoed a $420,000 tax incentive awarded to the show by the New Jersey Economic Development Authority, stating: \"As chief executive, I am duty-bound to ensure that taxpayers are not footing a $420,000 bill for a project which does nothing more than perpetuate misconceptions about the state and its citizens.\"[116]\n\nReception\n\nRatings\n\nSeason Timeslot (ET) No of Episodes Premiere Finale TV season Date Viewers\n\n(in million) Date Viewers\n\n(in million) 1 Thursday 10:00 pm 9 December 3, 2009 1.38[43] January 21, 2010 4.83[117] 2009–10 2 13 July 29, 2010 5.25[52] October 21, 2010 6.07[118] 2010 3 13 January 6, 2011 8.45[59] March 24, 2011 7.61[119] 2011 4 12 August 4, 2011 8.78[120] October 20, 2011 6.63[121] 5 11 January 5, 2012 7.60[122] March 15, 2012 4.99[123] 2012 6 13 October 4, 2012 4.69[124] December 20, 2012 3.13[125]\n\nCast spin-offs\n\nOn April 7, 2011, MTV announced it had picked up two spin-off shows featuring cast members Nicole, Jenny and Pauly, picking up twelve episodes of each show. One show focuses on Nicole and Jenny living together in their own apartment and is titled Snooki & JWoww.[126][127] The other show follows Pauly jet-setting around the country for various DJ gigs and is titled The Pauly D Project. Filming for both shows started at the end of 2011 and premiered in 2012. SallyAnn Salsano of 495 Productions (Jersey Shore) is the executive producer of both spin-offs.[126] The Pauly D Project was cancelled after one season, while Snooki & JWoww enjoyed a successful four-season run before ending in 2015.\n\nOther iterations\n\nEight official similar iterations have been made, including two in the United Kingdom, one in Spain, one in Russia, one in Poland, and one in Mexico. An international crossover, MTV Super Shore, was co-produced by MTV South Europe and MTV Latin America.[128]\n\nNumerous pilots were planned by various unrelated production companies focused on groups of friends in other locations or of specific ethnicities. Few made it to series.\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Jersey_shore_guys%2C_shooting_in_Florence%2C_may_2011.JPG/220px-Jersey_shore_guys%2C_shooting_in_Florence%2C_may_2011.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/USA_New_Jersey_location_map.svg/180px-USA_New_Jersey_location_map.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Red_pog.svg/7px-Red_pog.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/0/0f/Jerseyshore.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/0f/Jerseyshore.png/250px-Jerseyshore.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_New_Jersey.svg/24px-Flag_of_New_Jersey.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/0f/Jerseyshore.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jersey_Shore_(TV_series)", "title": "Jersey Shore (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/0/0f/Jerseyshore.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}