{"url": "https://people.com/royals/prince-william-kate-middleton-reveal-royal-baby-name/", "text": "Introducing, Prince Louis!\n\nPrince William and Kate Middleton have revealed the name they’ve chosen for their baby boy.\n\nGet push notifications with news, features and more.\n\n“The Duke and Duchess of Cambridge are delighted to announce that they have named their son Louis Arthur Charles,” Kensington Palace said in a statement Friday. “The baby will be known as His Royal Highness Prince Louis of Cambridge.”\n\nLouis (pronounced “LU-EE”) means “renowned warrior” in French, and is likely a tribute to Prince Philip, whose grandfather was Prince Louis Alexander of Battenberg. Louis is also part of Prince William’s full name of William Arthur Philip Louis and Prince George’s full name of George Alexander Louis. The name holds great meaning to William’s own father, Prince Charles, whose beloved great-uncle and mentor, Earl Louis Mountbatten, was assassinated by the IRA in 1979.\n\nThe royal baby’s middle names of Charles and Arthur also hold special meaning. Charles, of course, is in honor of the baby boy’s grandfather, Prince Charles. And the name Arthur is a family tradition. Both dad William and grandfather Charles have it as a middle name. Arthur was also the name of Queen Victoria’s third son (and seventh child) and was said to be her favorite child.\n\nImage zoom\n\nThe name Arthur, which means “bear” in Celtic, is also rooted in mythology. King Arthur is a legendary figure who was head of the kingdom Camelot and the Knights of the Round Table in medieval times.\n\nWhile Will and Kate waited four days before revealing their new baby’s name, that didn’t keep British oddsmakers from making predictions (Albert and Arthur were early favorites). William also teased his son’s name as he left the hospital. “You’ll find out soon enough,” he said with a smile.\n\nAnd eagle-eyed fans even spotted a suspicious web page on the royal family’s official website with a URL containing the name Prince Albert — one of the top predictions.\n\nThe name Louis comes as a surprise as it was trailing behind in 10th place among oddsmakers. “Prince Louis has caught both bookies and punters by surprise,” Alex Apati of Ladbrokes said. “With it being one of Prince George’s middle names fans didn’t see it as an obvious front runner for Kate and Will’s second son.”\n\nImage zoom Papixs/Abaca/Sipa/AP\n\nBig brother Prince George was also given a name with special meaning by the royal parents after his birth. His full name, George Alexander Louis, was chosen with love and a nod to history.\n\nRELATED VIDEO: Prince William and Kate Middleton Begin Life as a Family of 5: ‘It Completes Them’\n\nThe name George carries a lot of sentimental meaning to William’s grandmother, Queen Elizabeth, as it was the name picked by her beloved father when he became King George VI in 1936. Alexander is believed to have been picked by the couple to honor the Queen, whose middle name is Alexandra. And Louis, of course, is special to the royal family — now the two royal brothers share the name.\n\nImage zoom Tim Rooke/REX/Shutterstock\n\nWatch the full episode of Raising a Royal streaming now on PeopleTV.com, or download the PeopleTV app on your favorite device.\n\nWhen it came to choosing a name for their second-born child, Princess Charlotte, the royal parents paid tribute to William’s late mother, Princess Diana, and the almost 3-year-old princess’s full name is Charlotte Elizabeth Diana.\n\nWill and Kate represented the baby’s grandfather, Prince Charles, by going for the female version of his name. And they included Princess Diana, which was a popular choice with friends and admirers of her legacy. They also added the ultimate nod to great-granny and reigning monarch Queen Elizabeth II.\n\nImage zoom Chris Jackson/Getty Images/PA Wire\n\nCan’t get enough of PEOPLE’s Royals coverage? Sign up for our newsletter to get the latest updates on Kate Middleton, Meghan Markle and more!\n\nThe baby prince was born on Monday at 11:01 a.m. at 8lbs, 7oz. Just seven hours after giving birth to her third child, Kate Middleton appeared (in heels!) on the steps of the Lindo Wing at St. Mary’s Hospital on Monday evening with Prince William by her side to introduce their new baby boy to the world.\n\nKate’s younger sister, Pippa, was one of the royal baby’s first visitors. Pippa, who is reportedly expecting her first child with husband James Matthews, arrived at Kensington Palace just one day after the prince was born.\n\nCarole Middleton arrived at Kensington Palace on Wednesday to meet her newest grandson and to check in on daughter, Kate Middleton.\n\nImage zoom David Fisher/REX/Shutterstock\n\nAfter the royal baby’s birth, Prince Charles released a humorous statement on behalf of himself and wife Camilla, Duchess of Cornwall.\n\n“We are both so pleased at the news,” Charles said in a statement. “It is a great joy to have another grandchild, the only trouble is I don’t know how I am going to keep up with them.”\n\nQueen Elizabeth celebrated the latest addition to her family with a quick horseback ride through the grounds of Windsor Castle, where she is staying with husband Prince Philip, who is still recovering from hip surgery.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-22-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fpri_634944961.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-22-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-b4-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-william-4-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-12-1-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-22-2000.jpg", "keywords": [], "authors": ["Erin Hill"], "canonical_link": "https://people.com/royals/prince-william-kate-middleton-reveal-royal-baby-name/", "title": "Prince William and Kate Middleton Reveal Their Royal Baby Boy's Name!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Baby Archie,Kate Middleton,News,Prince Louis,Prince William,Princess Kate,Royal News", "news_keywords": "Baby Archie,Kate Middleton,News,Prince Louis,Prince William,Princess Kate,Royal News", "description": "Prince William and Kate Middleton have revealed the name they’ve chosen for their newborn prince", "og": {"title": "Prince William and Kate Middleton Reveal Their Royal Baby Boy's Name!", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/royals/prince-william-kate-middleton-reveal-royal-baby-name/", "description": "Introducing, Prince Louis! Prince William and Kate Middleton have revealed the name they’ve chosen for their baby boy. “The Duke and Duchess of Cambridge are&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-22-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/royals/prince-william-kate-middleton-reveal-royal-baby-name/", "description": "Prince William and Kate Middleton have revealed the name they’ve chosen for their newborn prince", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-22-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/royals/prince-william-kate-middleton-reveal-royal-baby-name/", "title": "Prince William and Kate Middleton Reveal Their Royal Baby Boy's Name!", "description": "Prince William and Kate Middleton have revealed the name they’ve chosen for their newborn prince", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fcatherine-22-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}