{"url": "www.redbookmag.com/love-sex/relationships/a13084704/anna-faris-admits-she-was-jealous-of-ex-chris-pratts-co-star-jennifer-lawrence/", "text": "“I’m not not human” is a message Anna Faris wants to make clear in her memoir Unqualified, ($19.50, ), out today. Case in point: The 40-year-old actress reveals she was once jealous of Jennifer Lawrence, 27, when the starlet worked alongside her (now ex) husband Chris Pratt, 38, on a film.\n\nGetty Images\n\nLawrence and Pratt played love interests in the 2016 movie Passengers, and Faris’ publicist warned her that the paparazzi would have a field day with the good-looking co-stars.\n\n\"‘Anna, listen, there are going to be paparazzi all over them,'” Faris recalls her publicist telling her. “'There are going to be shots of them laughing together on their way to set. There are going to be stories circulating, and you have to brace yourself for this.'”\n\nGetty Images\n\nWhile Faris writes in the book that she “didn't think it would bother” her since Pratt had filmed with beautiful women (like Aubrey Plaza and Bryce Dallas Howard) before, she admits that eventually the tabloids did start to affect her. “The coverage, even though it was false rumors, was making me feel insecure,” she writes.\n\nFaris knows all too well how sparks can fly on set. She fell for Pratt while filming 2011's Take Me Home Tonight, and in her memoir, details how she lusted after the actor, even though she was married to another man at the time.\n\nAnna Faris and Chris Pratt at the premiere of Take Me Home Tonight in 2011. Getty Images\n\n\"Sure, I get to proclaim that I didn't f-ck Chris before I left Ben, but what is there to celebrate in that? It didn't make me a hero,\" she writes. \"After all, I wanted to. Desperately. And I had feelings for him, obviously, even if I wasn't honest with myself about what those were.\"\n\nLawrence, however, made her intentions clear to Pratt’s wife and even apologized for the rumors, according to Faris. “She’s awesome,” Faris said of Lawrence. “But of course it’s hurtful and also embarrassing when people are saying your husband is cheating on you – even if it’s patently untrue.”\n\nGetty Images\n\nFaris and Pratt eventually announced their separation in August after eight years of marriage, and fans were quick to speculate that Lawrence was to blame for the breakup. However, the couple released a joint statement that did not allude to any infidelities.\n\nWe are sad to announce we are legally separating. We tried hard for a long time, and we're really disappointed. Our son has two parents who love him very much and for his sake we want to keep this situation as private as possible moving forward. We still love each other and will always cherish our time together.\n\nTwo months later, it appears that Faris has moved on from the relationship. On October 19, it was reported that Faris has begun dating cinematographer Michael Barrett.\n\nFollow Redbook on Facebook.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=1.00xw:0.641xh;0,0.0459xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=1.00xw:0.641xh;0,0.0459xh&resize=1200:*", "keywords": [], "authors": ["Eileen Reslen"], "canonical_link": "https://www.redbookmag.com/love-sex/relationships/a13084704/anna-faris-admits-she-was-jealous-of-ex-chris-pratts-co-star-jennifer-lawrence/", "title": "Anna Faris Admits She Was Jealous of Ex Chris Pratt’s Co-Star Jennifer Lawrence", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Redbook", "title": "Anna Faris Admits She Was Jealous of J. Law When She Was Ex Chris Pratt's Love Interest", "description": "In her memoir Unqualified, the actress talks about dealing with tabloid rumors.", "url": "https://www.redbookmag.com/love-sex/relationships/a13084704/anna-faris-admits-she-was-jealous-of-ex-chris-pratts-co-star-jennifer-lawrence/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=1.00xw:0.641xh;0,0.0459xh&resize=1200:*", "width": 1200, "height": 600}}, "article": {"publisher": "https://www.facebook.com/REDBOOK", "modified_time": "2019-10-23 10:38:00", "published_time": "2017-10-24 06:00:00", "section": "Relationships", "opinion": "false"}, "fb": {"pages": 28984400018}, "twitter": {"site": "@redbookmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=1.00xw:0.641xh;0,0.0459xh&resize=640:*"}, "google-site-verification": "pxYubggO01HJx1UDQZHKjcy54bRW9HJUCPrYEQV4Ntk", "title": "Anna Faris Admits She Was Jealous of Ex Chris Pratt’s Co-Star Jennifer Lawrence", "description": "Anna Faris revealed that the rumors that her husband Chris Pratt was cheating with co-star Jennifer Lawrence made her feel very envious and insecure.", "keywords": "Anna Faris, Chris Pratt, Jennifer Lawrence, unqualified, passengers, anna faris and chris pratt, chris pratt and jennifer lawrence, anna faris and chris pratt split, celebrity cheating rumors, celebrity hookups, celebrity couples, jennifer lawrence and anna faris, j law", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=0.783xw:1.00xh;0.0814xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Love,love-sex,relationships,jennifer lawrence,chris pratt,anna faris", "sailthru.date": "2017-10-24T18:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=1.00xw:0.641xh;0,0.0459xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-629893180-1508865109.jpg?crop=0.783xw:1.00xh;0.0814xw,0", "sailthru.socialtitle": "Anna Faris Admits She Was Jealous of J. Law When She Was Ex Chris Pratt's Love Interest", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1508796000.0, "source": "http://www.redbookmag.com", "summary": ""}