{"url": "time.com/5017724/taylor-swift-reputation-explained/", "text": "Taylor Swift’s sixth studio album Reputation finally dropped, after months of hype. With 15 tracks, produced with pop hitmakers Max Martin, Shellback and Jack Antonoff, Swift’s latest addition to her catalogue appears to mine her past and her present for material, switching moods between unapologetic love letter and defiant clapback. It’s all sung over a series of synth-heavy beats, and sprinkled with tinges of 80s pop, catchy dubstep drops and dance-ready hooks. Read on for our analysis of each song of the new Reputation era.\n\n1. “…Ready For It?”: Starting things off with a thumping bass line and rallying cry, “…Ready For It?” also offers one of Swift’s prettiest melodies. “In the middle of the night, in my dreams, you should see the things we do,” she sings sweetly before switching into her new-era rap-singing. “He can be my jailer, Burton to this Taylor,” she insists, name-checking a famous — and drama-filled — pairing, and setting the scene for the rest of the album’s investigation of the perils of stardom.\n\n2. “End Game” (featuring Ed Sheeran and Future): Swift tapped her good friend Sheeran for this slow-jam-style track, a self-reflective — and self-aware — plea to both the listener and a lover. “I wanna be your end game,” Swift sings off the top, allowing in a little vulnerability — before jumping into a rap-sung chorus. “Big reputation, you and me we got big reputations,” she chants, recognizing the baggage that her stardom brings (and name-checking the album’s title, of course). Of-the-moment rapper Future of “Mask Off” success adds in a slick verse, sticking to the love-against-the-odds theme. Swift goes on to sing she doesn’t want to be an “ex-love” and that she isn’t into the drama; it’s just her burden to bear.\n\nThis is peak Swift: emotionally open, but ready and willing to have some fun with the hype around her own persona. Sheeran’s contribution comes in the form of another rap-sung verse in the same vein, seeming to reference his own relationship and the pitfalls that fame has placed in his path to love. His advice? Ignore the rumors.\n\n3. “I Did Something Bad”: Swift knows that her critics have strong opinions about her; after all, the album is called Reputation. And in the bombastic “I Did Something Bad,” she appears to address some of the narratives that have surrounded her. “I never trust a narcissist, but they love me / So I play them like a violin, and I make it look oh so easy,” she opens this one over a sharp string pluck. “If a man talks s–t then I owe him nothing.” Here is new-era Swift: holding her head high, unapologetic and fiercely protective of her own success.\n\nThen, a funky dubstep drop brings shades of her mega-hit “We Are Never Ever Getting Back Together” into the mix. Heavily electronically manipulated, and punctuated with a strong beat, it’s a banger of a track — and her defiant response to her detractors. “I never trust a playboy, but they love me,” she insists, stating matter of-factly that it’s best to “leave before you get left,” and hinting that maybe her splashy former relationships weren’t all they might have seemed. And then there’s the kicker: “They’re burning all the witches, even if you aren’t one,” she croons on an auto-tuned bridge. “Go ahead and light me up.” Of all the quotable lines in Swift’s oeuvre, this one is right up there at the top for its blazing imagery.\n\n4. “Don’t Blame Me”: If you’re a fan of Avicii or Kygo’s brand of un-rushed atmospheric electro-pop, you might like the rich, vibey notes Swift brings together in “Don’t Blame Me,” a moody, dark song that starts out swinging and pretty, and builds into a gospel-backed EDM anthem. “Don’t blame me, love made me crazy / if it doesn’t you ain’t doin’ it right,” she sings emphatically. “Lord save me, my drug is my baby, I be using for the rest of my life.” Swift has endured criticism for her relationships: the fact that she’s in them, the fact that she sings about them. “Don’t Blame Me” could be a clapback to that criticism, reminding listeners that the heart simply wants what it wants, as her friend Selena Gomez once said.\n\n5. “Delicate”: Swift is, appropriately enough, at her most fragile on “Delicate.” Refreshingly honest, it’s a melodic electro-ballad with a resonant refrain. “My reputation’s never been worse so, you must like me for me,” she muses, her voice a light wisp, in a wry nod to her year in the spotlight before breaking down her insecurities: “Is it cool that I said all that? Is it too soon to do this yet?” Like pretty much anyone dealing with a new crush, Swift sings of moments of doubt. Perhaps even superstars have their sore spots. She couches this sweetly uncertain song in snippets of dates — at a dive bar, in her apartment — but keeps it about her circular internal monologue, always questioning just how much her feelings are being reciprocated.\n\n6. “Look What You Made Me Do”: Swift’s lead single — and immediate chart-topper following its release — “LWYMMD” was a shocking reintroduction to the Swift of Reputation: hard, unapologetic, focused on retribution. Step aside, “Bad Blood,” this song is much more cutting. “I’ve got a list of names, and yours is in red, underlined,” she reminded her haters over a Right Said Fred sample. The propulsive beat and insistence that the old Taylor was “dead” only sharpened her point.\n\n7. “So It Goes…”: Here, she switches things back to romance, reflecting on just how a new love interest might help her out of her fixations: “you make everyone disappear,” she explains in the moody, murky opening segment, which opens into a trap-lite chorus about getting caught up in the moment (and, of course, leaving some signature lipstick “on your face”). But for life with Swift, that’s just how it goes. “I’m yours to keep, and yours to lose. You know I’m not a bad girl, but I’ll do bad things with you,” she adds with a wink; this version of Swift has made a marked departure from her squeaky-clean roots as America’s Nashville sweetheart.\n\n8. “Gorgeous”: Yes, that’s Blake Lively and Ryan Reynolds’s baby daughter James opening up “Gorgeous” with a gurgle. But the rest of the song deals with adult topics. Over a bubbling, chime-like beat, Swift sings about the irresistible power of attraction — even when it’s not the best idea. “You’re so gorgeous, it actually hurts,” she sings with frustration. “There’s nothing I hate more than what I can’t have.” Despondent, she talks of heading home to hang out with her cats — and then, with a wink, invites her object of attention to join her.\n\n9. “Getaway Car”: Told as a dramatic story of a heist and an ill-fated love adventure over shimmering 80s-style production, “Getaway Car” is one of Swift’s most metaphor-driven tracks on the album. “We never had a shotgun shot in the dark,” she sings with a rebellious twang. “Nothing good starts in a getaway car.” Swift’s has often had its fair share of melodrama; remember “Into the Woods”? In “Getaway Car,” though, she calls herself a “traitor” who turns in her erstwhile partner in crime. Looks like Swift might be willing to flirt with the dark side, but she’s no good at following through with crimes — of the legal kind, or of the heart. Instead, she says, she takes the keys and leaves the guy stranded at a motel. It’s no happy ending, but it’s a reminder that Swift isn’t afraid to assert her independence.\n\n10. “King of My Heart”: Taylor Swift has always been good at love songs. In “King of My Heart” she hits her sweet spot, over a synth-heavy track and strategic auto-tune assist. “I’m perfectly fine, I live on my own, I made up my mind I’m better off bein’ alone,” she starts off. But it doesn’t stay that way for long; after meeting a (evidently non-American) paramour who pursues her, the story (and the song) go straight into the romance. “You’re the one I have been waiting for,” she gushes, dissing some other guys with “their fancy cars” who didn’t quite measure up to this new interest. And yes, the character in the title is indeed the king of her heart — and body, and soul.\n\n11. “Dancing With Our Hands Tied”: Although it starts off as a down-tempo, melancholy kind of tune, “Dancing With Our Hands Tied” adds in Swift’s now-rote trap-lite drop to amp up the drama on this will-we-won’t-we tale of star-crossed lovers separated by an unkind fate. “I had a bad feeling,” she suggests about the romantic interest, but she goes on to dance with him anyway; some chemistry just can’t be denied.\n\n12. “Dress”: “I only bought this dress so you could take it off,” Swift sings slyly on “Dress,” her most overtly sexual work yet. She wants her lover to carve his name into her bedpost; her hands shake in anticipation. A breathy, synth-y track with lots of whispery vocals, Swift is unequivocal about her interest in this person as much more than a friend. “Made your mark on me; a golden tattoo,” she sings cryptically. It’s a departure from her usually PG approach to love songs, emblematic of a Swift who’s claiming her maturity more than ever.\n\n13. “This Is Why We Can’t Have Nice Things”: Kicking things off with a siren sound, Swift strips it back to a stomping call-out of the haters, a giddy sister of sorts to dark lead single “Look What You Made Me Do.” “Why’d you have to rain on my parade?” she asks, her voice petulant, sneering with humor and attitude. “This is why we can’t have nice things, darling: because you break them, I have to take them away.” When she tries to go diplomatic — “forgiveness is a nice thing to do” goes one line, sung in an angelic lilt — she breaks the fourth wall with a burst of sharp laughter. Swift is no longer willing to “Shake It Off,” as she once tried to do.\n\n14. “Call It What You Want”: Maybe the most by-the-book Swift song on Reputation, “Call It What You Want” is a slow-burning meditation on the transformative power of relationships, filled with lyrical puns: “All the liars are calling me one,” she sighs at one point. “All my flowers grew back as thorns.” But this is still a love letter, and a reminder that Swift has moved on from the fray around her so-called “reputation.” “My baby’s fly like a jetstream, high above the whole scene,” she sings proudly, making it clear that the baby in question has taken her along for the ride.\n\n15. “New Year’s Day”: Her one acoustic piano ballad on the album, “New Year’s Day” is a tender and intimate love song. The snapshots are sweet and evocative: glitter on the floor after a party, candle wax and polaroids on the hardwood floor, holding hands in the backseat of a taxi. “Hold on to the memories,” she repeats in the chorus, “and I will hold on to you.” Nostalgic for the moment even as it’s happening, it’s a lovely, effecting closer, letting Swift’s voice and earnest message shine without the complications of over-production. She may get her kicks with big pop anthems, but vulnerable ballads like this one are just as much a part of her musical DNA.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Raisa Bruner at raisa.bruner@time.com.", "images": ["http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "https://api.time.com/wp-content/uploads/2017/08/taylor-swift-music-video-01.jpg?quality=85&crop=0px%2C34px%2C1810px%2C947px&resize=1200%2C628&strip", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/04/troye-sivan.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "https://api.time.com/wp-content/uploads/2020/04/GettyImages-1157680922.jpg?quality=85&w=600", "http://time.com/img/loading-circle.gif", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/08/taylor-swift-music-video-01.jpg?quality=85&crop=0px%2C34px%2C1810px%2C947px&resize=1200%2C628&strip", "keywords": [], "authors": ["Raisa Bruner"], "canonical_link": "https://time.com/5017724/taylor-swift-reputation-explained/", "title": "Analyzing Every Song on Taylor Swift's Reputation", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "reputation, taylor swift reputation, taylor swift music, reputation taylor, taylor swift album, taylor swift lyrics, Taylor Swift endgame, endgame taylor, taylor swift getaway, taylor swift dress meaning", "news_keywords": "reputation, taylor swift reputation, taylor swift music, reputation taylor, taylor swift album, taylor swift lyrics, Taylor Swift endgame, endgame taylor, taylor swift getaway, taylor swift dress meaning", "description": "From \"...Ready For It?\" to \"New Year's Day,\" here's an in-depth analysis of all 15 songs on Swift's newest album out Friday.", "og": {"title": "Analyzing Every Song on Taylor Swift's 'Reputation'", "type": "article", "site_name": "Time", "url": "https://time.com/5017724/taylor-swift-reputation-explained/", "description": "From \"...Ready For It?\" to \"New Year's Day,\" here's our take on all 15 songs", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/08/taylor-swift-music-video-01.jpg?quality=85&crop=0px%2C34px%2C1810px%2C947px&resize=1200%2C628&strip", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5017724/taylor-swift-reputation-explained/", "description": "From \"...Ready For It?\" to \"New Year's Day,\" here's an in-depth analysis of all 15 songs on Swift's newest album out Friday.", "media": "https://api.time.com/wp-content/uploads/2017/08/taylor-swift-music-video-01.jpg?quality=85&crop=0px%2C34px%2C1810px%2C947px&resize=1200%2C628&strip"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5017724/taylor-swift-reputation-explained/", "title": "Analyzing Every Song on Taylor Swift's 'Reputation'", "description": "From \"...Ready For It?\" to \"New Year's Day,\" here's our take on all 15 songs", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/08/taylor-swift-music-video-01.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}