{"url": "www.inquisitr.com/3937951/taylor-swift-wants-to-reconcile-her-romance-with-ex-boyfriend-conor-kennedy-after-rumored-drake-romance/", "text": "Is Taylor Swift on the verge of a reunion with one of her famous ex-boyfriends?\n\nMonths after the singer was linked to rapper Drake, a source claims she is hoping to rekindle her past relationship with Conor Kennedy. On January 31, Radar Online shared a news clip that claimed Taylor Swift found her former boyfriend’s recent mug shot to be “sexy.”\n\n“[Taylor Swift]’s confessed she finds him hotter than ever his bad-boy moment,” an insider alleged.\n\nAs the outlet revealed, Taylor Swift and Conor Kennedy reportedly dated for three months in 2012 before splitting amid unconfirmed reports of the Kennedy family disapproving of the singer.\n\nTaylor Swift performs onstage during 'The 1989 World Tour Live' on August 21, 2015 [Image by Christopher Polk/Getty Images]\n\nConor Kennedy was arrested earlier this month in Aspen, Colorado, following a fight that was prompted after a couple of people insulted one of his friends.\n\n“[Taylor Swift] has always regretted the way she and Conor parted ways,” added a pal.\n\nWhile it is unclear whether Taylor Swift and her former boyfriend have been in touch in the years since they split, romance rumors are nothing new for Swift. In fact, Swift often makes headlines for her alleged romances, despite the fact that many of the men she’s been tied to haven’t actually been her boyfriend.\n\nIn 2016, Taylor Swift started her year off with a romance with Calvin Harris, which had begun in 2015 after the former couple were introduced to one another at the Brit Awards. However, months into the year, rumors began swirling in regard to their potential split, and in early June, their breakup was confirmed.\n\n“Adam really liked [Taylor Swift], she was not the type of girl he ever dates and he liked that. He liked how innocent Taylor was and that she had a good caring heart. Taylor’s heart was more in it then he was. He started to lose interest over the past few months, but really tried to not just break up,” a source told E! News at the time.\n\nFollowing the split, Taylor Swift began dating Tom Hiddleston, and the now-ex-couple enjoyed a whirlwind romance throughout the summer months. Then, in early September of last year, an E! News confirmed they had ended their relationship and suggested their breakup was prompted by Hiddleston’s alleged desire to be quite public with their romance.\n\n“[Taylor Swift] was not happy about it and thought it was too much publicity,” a source explained.\n\nTaylor Swift attends the BRIT Awards 2015 on February 25, 2015 [Image by Ian Gavan/Getty Images]\n\nAlthough Taylor Swift never publicly addressed her breakup from Hiddleston, she was quickly tied to rumors of having moved on from their relationship with Drake after attending his birthday celebration in Los Angeles in October.\n\nFollowing her appearance at the event, which was held at celebrity hotspot Delilah in West Hollywood, a report by Page Six claimed that the rapper spent more time with Swift at his bash with any other woman who he was not related to.\n\nA short time later, a source suggested that Taylor Swift and Drake were not actually dating but noted that they were enjoying the ongoing speculation into what was going on between them.\n\n“They both are liking the talk of a potential relationship and will let it continue, but there is no relationship brewing,” a source told Hollywood Life. “Drake would love to do music with her as well and that is certainly a possibility. But right now everything between them is friendly. Working together is a definite future option, but that isn’t happening yet either. Regardless, they are eating up the talk about it.”\n\nTaylor Swift and Drake weren’t seen together again following the appearance at the party, and the rapper has since been linked to Jennifer Lopez.\n\n[Featured Image by Jason Merritt/Getty Images]", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/taylor-swift-dating-1.jpg", "https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/taylor-swift-ex-boyfriend.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/taylor-swift-relationships.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/3937951/taylor-swift-wants-to-reconcile-her-romance-with-ex-boyfriend-conor-kennedy-after-rumored-drake-romance/", "title": "Taylor Swift Wants To Reconcile Her Romance With Ex-Boyfriend Conor Kennedy After Rumored Drake Romance?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}