{"url": "https://www.rollingstone.com/movies/movie-reviews/spider-man-homecoming-review-new-reboot-of-marvel-webslinger-really-is-amazing-200149/", "text": "News Flash: Tom Holland is the best movie Spider-Man ever. He finds the kid inside the famous red onesie and brings out the kid in even the most hardened filmgoer. The last two Spidey epics had “Amazing” in the title, but let’s face it – both films stirred more apathy than amazement. The only suspense came in wondering how long and hard a franchise could be milked. It may be a problem winning back the comic-book fans, but after that extended cameo in Captain America: Civil War and this new solo outing, you finally feel that your friendly neighborhood web-slinger deserves to be a part of the Marvel Cinematic Universe.\n\nSpider-Man: Homecoming feels fresh off the drawing board, as if he was a character with the dew still on him. The movie is as high school as a John Hughes comedy – think The Breakfast Club or Ferris Bueller’s Day Off – in which teens talk like teens instead of old-school Hollywood cynics aching to sound young. Six writers are credited with the script and I’m guessing it was a bloodbath, but what’s onscreen pops with the jumpy, unpolished energy of adolescents on the march through puberty. Homecoming gives his character and his teen trauma genuine context.\n\nHolland, who just turned 21, is a British actor who gets inside the role in ways that go beyond a spot-on American accent and a voice that squeaks when he’s excited. As Peter Parker, the Queens, NY, sophomore who’s crushing on the school’s prettiest senior, Liz (Laura Harrier), Holland finds the agony of simply talking to the object of his affections. Even his genius schoolmate Michelle (Zendaya) laughs at his attempts to be cool. For our hero, the guiding light in his life is his unusually attractive Aunt May (Marisa Tomei). But the film’s core relationship is between Peter and his best friend, Ned (Jacob Batalon), a science nerd who loses his shit when he finds out his buddy is Spider-Man. As for Peter’s mentor Tony Stark (Robert Downey, Jr.), the man known as Iron Man is reluctant to take the training wheels off this hormonal loose cannon. He may have the stuff to be an Avenger. Just not yet.\n\nThat’s the basic plot. It’s teen drama – will with Peter take Liz to the homecoming dance? Will he even find the balls to ask her? – bumping up against larger issues, i.e. will Spider-Man stop the villainous Vulture (a terrific Michael Keaton) from destroying the Washington Monument, the Staten Island Ferry and even the world. Will he even muster the power to do it? (The stunts, by the way, are spectacular.) The movie never forgets that Peter and his alter ego are still the same awkward 15-year-old. Can the webslinger see what we see – that Vulture, with the wings of a birdman (nice touch), was once a working stiff corrupted by capitalist greed? No one sewed maturity into his costume.\n\nPeter is all over the place, like an adolescent feeling his growing pains – and so’s movie, as director Jon Watts wrestles to bring coherence out of naïve, juvenile chaos. The result is a mess, but an exhilarating one … as it should be. It’s no accident that Homecoming is the most fun when it’s flying by the seat of its pants. There’s a spontaneous charge to the film, a euphoric innocence, that makes it a much-needed antidote to stale franchise formula. Watts, whose 2015 indie film Cop Car expertly blended childhood curiosity and terror, has crafted the most audacious web-slinger adventure since Sam Raimi’s Spider-Man 2.\n\nBut he couldn’t have done it without his live-wire leading man. Holland, a dancer and acrobat who headlined on the London stage in Elton John’s Billy Elliot: The Musical, moves with an athlete’s natural grace. It’s Holland who makes us care, not to mention that he did nearly 90 percent of the stunts. This is a star performance given by a born actor (check him out in The Impossible and The Lost City of Z). Spider-Man soars because Holland gives him wings.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmovies%2Fmovie-reviews%2Fspider-man-homecoming-review-new-reboot-of-marvel-webslinger-really-is-amazing-200149%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=200149", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://www.rollingstone.com/wp-content/uploads/2018/06/spiderman-homecoming-movie-review-travers-d032db47-19ce-4a4d-9f88-f363b48abc46.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/spiderman-homecoming-movie-review-travers-d032db47-19ce-4a4d-9f88-f363b48abc46.jpg", "keywords": [], "authors": ["Peter Travers", "Film Critic", "Peter Travers'S Most Recent Stories", "Endings", "Beginnings", "All The Love", "Sex", "Secrets", "Shailene You Desire", "Sergio"], "canonical_link": "https://www.rollingstone.com/movies/movie-reviews/spider-man-homecoming-review-new-reboot-of-marvel-webslinger-really-is-amazing-200149/", "title": "Peter Travers: 'Spider-Man: Homecoming' Really Is Amazing", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "'Spider-Man: Homecoming' is an amazing reboot on the iconic Marvel superhero, thanks to the new Spidey Tom Holland. Read Peter Travers' rave review.", "news_keywords": "Donald Glover, Marisa Tomei, Marvel, Marvel Comics, Michael Keaton, Robert Downey Jr., Spider-Man", "og": {"type": "article", "title": "'Spider-Man: Homecoming': Your New Marvel Webslinger Really Is Amazing", "url": "https://www.rollingstone.com/movies/movie-reviews/spider-man-homecoming-review-new-reboot-of-marvel-webslinger-really-is-amazing-200149/", "description": "Latest take on the iconic superhero comes out swinging – and brings teen heart and soul to your friendly neighborhood Spider-Man", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/spiderman-homecoming-movie-review-travers-d032db47-19ce-4a4d-9f88-f363b48abc46.jpg", "width": 1024, "height": 576, "alt": "'Spider-Man: Homecoming' Review"}, "locale": "en_US"}, "article": {"published_time": "2017-06-29T13:07:00+00:00", "modified_time": "2018-06-25T16:33:58+00:00"}, "twitter": {"text": {"title": "'Spider-Man: Homecoming' Review: New Reboot of Marvel Webslinger Really Is Amazing"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/spiderman-homecoming-movie-review-travers-d032db47-19ce-4a4d-9f88-f363b48abc46.jpg?w=1024", "alt": "'Spider-Man: Homecoming' Review"}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@petertravers", "title": "‘Spider-Man: Homecoming’ Review: New Reboot of Marvel Webslinger Really Is Amazing", "description": "'Spider-Man: Homecoming' is an amazing reboot on the iconic Marvel superhero, thanks to the new Spidey Tom Holland. Read Peter Travers' rave review."}, "generator": "WordPress 5.4", "author": "Peter Travers", "content_type": "Article", "post_id": 200149, "title": "'Spider-Man: Homecoming' Review: New Reboot of Marvel Webslinger Really Is Amazing", "published_at": "2017-06-29 13:07:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/spiderman-homecoming-movie-review-travers-d032db47-19ce-4a4d-9f88-f363b48abc46.jpg?w=1024", "comment_count": 0, "tags": "Spider-Man", "topics": "Movies", "body": "News Flash: Tom Holland is the best movie Spider-Man ever. He finds the kid inside the famous red onesie and brings out the kid in even the most hardened filmgoer. The last two Spidey epics had \"Amazing\" in the title, but let's face it – both films stirred more apathy than amazement. The only suspense came in wondering how long and hard a franchise could be milked.  It may be a problem winning back the comic-book fans, but after that extended cameo in Captain America: Civil War and this new solo outing, you finally feel that your friendly neighborhood web-slinger deserves to be a part of the Marvel Cinematic Universe. \r\nSpider-Man: Homecoming feels fresh off the drawing board, as if he was a character with the dew still on him. The movie is as high school as a John Hughes comedy – think The Breakfast Club or Ferris Bueller's Day Off – in which teens talk like teens instead of old-school Hollywood cynics aching to sound young. Six writers are credited with the script and I'm guessing it was a bloodbath, but what's onscreen pops with the jumpy, unpolished  energy of adolescents on the march through puberty. Homecoming gives his character and his teen trauma genuine context.Holland, who just turned 21, is a British actor who gets inside the role in ways that go beyond a spot-on American accent and a voice that squeaks when he's excited. As Peter Parker, the Queens, NY, sophomore who's crushing on the school's prettiest senior, Liz (Laura Harrier), Holland finds the agony of simply  talking to the object of his affections. Even his genius schoolmate Michelle (Zendaya) laughs at his attempts to be cool. For our hero, the guiding light in his life is his unusually attractive Aunt May (Marisa Tomei). But the film's core relationship is between Peter and his best friend, Ned (Jacob Batalon), a science nerd who loses his shit when he finds out his buddy is Spider-Man. As for Peter's mentor Tony Stark (Robert Downey, Jr.), the man known as Iron Man is reluctant to take the training wheels off this hormonal loose cannon. He may have the stuff to be an Avenger. Just not yet. That's the basic plot. It's teen drama – will with Peter take Liz to the homecoming dance? Will he even find the balls to ask her? – bumping up against larger issues, i.e. will Spider-Man stop the villainous Vulture (a terrific Michael Keaton) from destroying the Washington Monument, the Staten Island Ferry and even the world. Will he even muster the power to do it? (The stunts, by the way, are spectacular.) The movie never forgets that Peter and his alter ego are still the same awkward 15-year-old. Can the webslinger see what we see – that Vulture, with the wings of a birdman (nice touch),  was once a working stiff corrupted by capitalist greed? No one sewed maturity into his costume. Peter is all over the place, like an adolescent feeling his growing pains – and so's movie, as director Jon Watts wrestles to bring coherence out of naïve, juvenile chaos. The result is a mess, but an exhilarating one ... as it should be. It's no accident that Homecoming is the most fun when it's flying by the seat of its pants. There's a spontaneous charge to the film, a euphoric innocence,  that makes it a much-needed antidote to stale franchise formula.   Watts, whose 2015 indie film Cop Car expertly blended childhood curiosity and terror,  has crafted the most audacious  web-slinger adventure since Sam Raimi's Spider-Man 2. But he couldn't have done it without his live-wire leading man. Holland, a dancer and acrobat who headlined on the London stage in Elton John's Billy Elliot: The Musical, moves with an athlete's natural grace. It's Holland who makes us care, not to mention that he did nearly 90 percent of the stunts.   This is a star performance given by a born actor (check him out in The Impossible and The Lost City of Z). Spider-Man soars because Holland gives him wings.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1498741620.0, "source": "https://www.rollingstone.com", "summary": ""}