{"url": "https://web.archive.org/web/20100208181903/http://www.foxnews.com:80/story/0,2933,584664,00.html", "text": "This is a rush transcript from \"On the Record,\" February 2, 2010. This copy may not be in its final form and may be updated.\n\nGRETA VAN SUSTEREN, FOX NEWS HOST: Senator Judd Gregg just blasted the president's budget director, Peter Orszag, about President Obama's proposal to use TARP funds to help community banks lend to small businesses.\n\n(BEGIN VIDEO CLIP)\n\nSEN. JUDD GREGG, R-N.H., BUDGET COMMITTEE: The whole concept of the TARP was that as we recoup the money, it would -- because we were borrowing it from our -- from Americans and from the Chinese -- and as we recoup that money, we would use it to pay down the debt. Now that's not going to happen. We're going to -- it's become a piggy bank.\n\nPETER ORSZAG, OMB DIRECTOR: Well, Senator...\n\nGREGG: It's a piggy bank which adds to our deficit, adds to our debt and gets put (INAUDIBLE) tax.\n\nORSZAG: The degree to which shifting funds would add to our debt or deficits depends on what the net subsidy rate would be on that new activity. And remember, the purpose of TARP was to address problems in our financial markets. One of the -- and it has been remarkably successful in bringing credit spreads back down to normal levels. One of the lingering problems in our financial markets, however, is access to credit for small businesses. It's why in this budget, we're...\n\nGREGG: No, no, no! You can't make that type of statement with any legitimacy!\n\nORSZAG: OK.\n\nGREGG: You cannot make that statement! This is the law!\n\nORSZAG: (INAUDIBLE) they're not suffering from (INAUDIBLE)\n\nGREGG: Let me tell you what the law says!\n\nORSZAG: ... lack of access...\n\nGREGG: Let me read it to you again because you don't appear to understand the law! The law is very clear! \"The monies recouped from the TARP shall be paid into the general fund of the treasury for the reduction of the public debt.\" It's not for a piggy bank because you're concerned about lending to small businesses...\n\nORSZAG: (INAUDIBLE) requirement (INAUDIBLE)\n\nGREGG: ... and you want to get a political event when you go out and make a speech in Nashua, New Hampshire. That's not what this money's for! This money is to reduce the debt of our children!\n\n(END VIDEO CLIP)\n\nVAN SUSTEREN: Ouch! Well, for the inside story on that showdown, we went to Capitol Hill and Senator Gregg went \"On the Record.\"\n\n(BEGIN VIDEOTAPE)\n\nVAN SUSTEREN: Senator, nice to see you, sir.\n\nGREGG: Greta, thank you for having me. Thank you very much.\n\nVAN SUSTEREN: Well, thank you for letting us come to your office.\n\nGREGG: Appreciate you coming in.\n\nVAN SUSTEREN: All right, today you had quite a showdown with the -- with Peter Orszag.\n\nGREGG: Well, you know, they've sent up a budget which by their own terms is unsustainable. It puts us on a path which is basically going to lead us to fiscal insolvency as a nation, in my opinion, and I think in a lot of other people's opinion. It's a huge deficit machine, is what they've proposed, and that leads to debt. And the debt is not sustainable. It gets passed on to our kids, and basically, will lower the quality of life of our children, and that's not fair.\n\nI feel very strongly that when you send a budget like that up, you should also send up some fairly big ideas for how you're going to address it in the out years, how you're going to keep us from going off the road, how you're going to keep us from passing on to our kids a nation that can be afforded. And there are no big ideas in this budget on the issue of fiscal discipline. None. There are some -- there are some ideas, and I support their freeze concept. But the freeze is $10 billion. Compared to a $1.6 trillion deficit, it's really not going to get us there.\n\nVAN SUSTEREN: Well, one of the things that he brought up that, obviously, you were quite heated about, was the whole idea of taking some of the returned TARP money and giving it to community banks to the tune of $30 billion for lending. You say that that's not legal or not authorized by the statute.\n\nGREGG: No. The way TARP was set up, you know, we borrowed this money -- we borrowed it from Americans and we borrowed it from the Chinese, and we took it and we used it to stabilize the financial industry during a severe crisis which would have basically bankrupted Main Street, had all these banks failed.\n\nVAN SUSTEREN: So (INAUDIBLE) just set aside some cash...\n\nGRAHAM: No, this is not in a drawer somewhere. We had to go out and borrow it. And as part of that decision, there is very clear language put in the bill -- I wrote it, that's why I know it was clear -- that said when the money comes back -- and we expected it to come back, and in many cases, coming back with interest, so we're actually making money on it -- the money has to be used, shall be used to reduce the debt. That's what the law says. That's what TARP says. That was intentionally put in there so that the money could not be used as a piggy bank for whatever the initiative is, no matter how good an idea it is.\n\nNow the president is suggesting that he wants to take $30 billion of the paid back funds and use it for some other initiative. Well, that's not consistent with the law and it's not consistent with what we should do, basically. We should reduce the debt with this money. If we -- if we terminated TARP today, which we should, we would reduce the debt over the next couple of years by $200 billion $300 billion. That's a big chunk of debt reduction. And it -- and that's exactly what we should be doing with this TARP money. We shouldn't be using it to create a new program here, a new program there, depending on which way the wind is blowing on some given day.\n\nVAN SUSTEREN: Well, the word that I seized upon in listening to the exchange today is \"shall.\" And when I was in law school, that wasn't a word that gave you any sort of wiggle room. It just must be. How does the -- how does the White House, the administration, justify saying that they can take the returned TARP money and send it out to these community banks, this $30 billion for loans? How do they justify it?\n\nGREGG: Well, the word is \"shall,\" and they can't do it legally.\n\nVAN SUSTEREN: So what happens?\n\nGREGG: So Mr. Orszag, to his credit, said they're going to change the law. You know, I mean, well, that makes no sense at all! I mean, the whole purpose here was to borrow money, put it out, stabilize the financial markets. When it gets paid back, pay down the borrowing so our kids didn't get stuck with the debt. What they're going to do is change the law so that they borrow the money, send it out to the stabilized financial institutions. When it gets paid back, they're going to spend it on something else so the debt is still out there and our kids still have to pay for it.\n\nVAN SUSTEREN: Do you think he knew the word \"shall\" was there before he showed up today?\n\nGREGG: No.\n\nVAN SUSTEREN: Or did you surprise him with \"shall\"?\n\nGREGG: I'm not sure whether he knew it or not, but he pretty quickly confirmed that they were going to change the law. So he probably did know, yes. I guess I probably would have to give him credit for knowing it, yes.\n\nVAN SUSTEREN: So I take it you're not a big fan of the president's proposed budget.\n\nGREGG: No, the budget is a disaster. It really is. It's more government, more spending and more debt. But the real problem isn't the short run. The short run's a problem. But the real problem is in the out years, there's no compression of the delta. Spending continues to go up, and taxes can never catch it because the spending is going up so fast. They're taking the size of the government from 20 percent of the Gross National Product up to 25, 26 percent of the Gross National Product. That's simply not affordable. That means you're adding a trillion dollars of debt to our kids' backs every year for the foreseeable future. And at the end of 10 years, not only is it not coming down, it's still going up!\n\nVAN SUSTEREN: So what -- so if we were having this conversation 10 years from now, what would the economy look like, according to your prediction, assuming the president's proposed budget got passed?\n\nGREGG: I personally think we'll hit the wall long before 10 years. I think within 5 to 7 years...\n\nVAN SUSTEREN: What does that mean, \"hit the wall\"?\n\nGREGG: It means that people have -- the people stop buying our debt or making it very difficult for us to sell debt, that the value of the currency is affected and that you either end up with a significant inflationary event or an event where you have to so significantly raise taxes that you reduce the productivity of the entire economy and you're no longer creating jobs.\n\nThe simple situation -- the simple comparison is this. It's like a family that's been living beyond its means for many, many years and its income can never catch up with its debts. And at some point, the world community says to us, I'm sorry, we're not going to fund your debts any longer. We're simply not going to lend you the money you need.\n\nI mean, we're not operating off our own economy's ability to support us, we're operating because China is willing to lend us money and other nations are willing to lend us money. Well, they're putting up some fairly significant red flags right now that says, We're a little concerned about all your borrowing. And if we continue this borrowing, they're going to put up very severe red flags and say, Hey, maybe we're just not going to lend you anymore, or if we do lend to you, we're going to put a price on the lending which is so expensive that it makes it very hard for you to do much else with your government besides pay down your interest.\n\nVAN SUSTEREN: Senator, thank you, sir.\n\nGREGG: Thank you, Greta.\n\n(END VIDEOTAPE)", "images": ["https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/images/columns/col_head_interviewarchive04.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/fox-business-for-iphone-marketplace.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_nationwide.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_fnshop.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/social/comment_bubble.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/twitter.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_imag.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/feat-shows-blue.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/ucat/images/98282_ureport_90.JPG", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/images/596606/0_61_320_020210_greta_gregg.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/fn-header.jpg", "https://web.archive.org/web/20100208181903im_/http://video.foxnews.com/thumbnails/020810/90/70/020810_OTR_GATES_PREVIEW_FNC_020810_11-37.jpg", "https://web.archive.org/web/20100208181903im_/http://video.foxnews.com/thumbnails/020510/90/70/020510_greta_moore_FNC_020510_16-39.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/images/foxnews_story.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_people.gif", "https://web.archive.org/web/20100208181903im_/http://video.foxnews.com/thumbnails/020510/90/70/020510_greta_beck_FNC_020510_16-38.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_bankrate.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/vid_icon.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/facebook.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_carsdirect.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/myspace.jpg", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/mkt/mkt_fnradio.gif", "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/i/new/close.jpg"], "top_img": "https://web.archive.org/web/20100208181903im_/http://www.foxnews.com/ucat/images/98282_ureport_90.JPG", "keywords": [], "authors": [], "canonical_link": "", "title": "Sen. Gregg: President Obama's Budget Proposal Is a 'Disaster' - Greta Van Susteren", "meta_data": {"description": "Interview: Sen. Gregg: President Obama's Budget Proposal Is a 'Disaster', N.H. senator sounds off on the lack of fiscal responsibility in Obama's $3.8T budget proposal", "keywords": "greta, transcript, sen. judd gregg, president obama, budget, greta, greta van susteren, on the record, on the record with greta", "storyid": 596606, "publish_date": "2010-02-03", "section_name": "On the Record w/ Greta", "dart_sitezone": "fnc/shows/ontherecord"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}