{"url": "https://www.flickr.com/photos/138991380@N06/39028224211/", "text": "Armie Hammer on His First Golden Globe Nomination: I Feel Like I Already Won\n\nIt wasn’t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title.\n\nIn spite of everything, the movie has been a important darling because it debuted on the Sundance M...\n\ntakenews.net/armie-hammer-on-his-first-golden-globe-nomin...\n\ntakenews.net/wp-content/uploads/2017/12/rs_1024x576-17100...\n\nIt wasn’t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title.\n\nIn spite of everything, the movie has been a important darling because it debuted on the Sundance Movie Pageant in January. Hammer and co. have been nominated for dozens of awards, and hope to win on the 2018 Critics’ Alternative Awards and the 2018 Impartial Spirit Awards. Luca Guadagnino‘s film, tailored from André Aciman‘s best-selling novel, is about within the Italian countryside within the early ’80s. And the romantic coming-of-age drama, starring Golden Globe nominee Timothée Chalamet within the lead function, is predicted to be a serious participant all through the 2018 award season.\n\nE! Information spoke to Hammer by telephone Monday, shortly after he discovered of his nomination. “It has been good,” he laughed. “It is all the time an excellent factor when your day peaks at 5:45 within the morning.”\n\nBecause it turned out, Hammer was already awake, as he has two younger youngsters at house. “I’ve to speak quietly, as a result of Harper remains to be sleeping,” the actor stated apologetically. “However I can inform you how the dialog goes to go. She’s going to come back downstairs, and I’ll say, ‘Harper! Daddy received nominated for a Golden Globe!’ She’ll go, ‘Oh. OK…Can I’ve pancakes for breakfast?'” Although his daughter will not be sufficiently old to grasp what a milestone that is, the 31-year-old actor positive is. “I have been on this enterprise lengthy sufficient that I do know what a giant deal it’s, and what an ideal honor it’s to get nominated for a Golden Globe. It is an wonderful honor. It is nice to have your work appreciated and acknowledged, and I would not be right here with out Luca and Timmy and [co-stars] Michael Stuhlbarg and Peter Spears, and André Aciman and [screenwriter] James Ivory. It is nice, particularly once you do one thing that you simply’re happy with.”\n\nHammer hadn’t had an opportunity to talk with Chalamet but. “I attempted calling him,” he revealed, “however I believe he is equally as busy as I’m, doing telephone calls. So, I have never gotten ahold of him.”\n\nThe celebrities have been selling the movie almost a yr, and now that it is receiving a lot consideration, anticipate to see much more of its stars. “It nonetheless appears like we’re proper in the midst of the promotion hurricane, particularly once you get a Golden Globe nomination,” Hammer stated. “To get one for the movie, and for Timmy as nicely, it feels prefer it’s now going to kick us into excessive gear.”\n\nIt hasn’t been that lengthy since principal pictures started, regardless that it might really feel prefer it. Hammer was initially hesitant to star within the movie, however he determined to take an opportunity and put his religion in Guadagnino. “I had that second [of clarity] after I received to Italy, actually. The truth of what we have been going to do and the enterprise that we had forward of us sort of set in,” he stated. “That was actually sort of a fast, passing feeling for me—that artist’s insecurity sort of factor. However as quickly as we received to Italy, I used to be like, ‘I’m so glad I did this. This was clearly the fitting transfer.'”\n\nNow that a lot time has handed since filming, he stated, “I want I used to be again in Italy. Oh, man! I have been again to go to simply because I missed it a lot. I went again to Crema—for no function!”\n\nThe solid and crew have been pretty remoted after they shot Name Me by Your Title, which was international to Hammer, who had beforehand starred in big-budget, would-be blockbusters like The Lone Ranger and The Man From U.N.C.L.E. Going ahead, he hopes to duplicate the expertise he had engaged on the indie. “There are undoubtedly facets that I might love to hunt out—principally simply being challenged and dealing on artwork for the sake of artwork. However on the similar time, each movie is so totally different,” he stated. “I am excited for the way the subsequent one goes to problem me or push me, and the way I’ll react, take care of or interact with the subsequent director that I work with and the subsequent group of co-stars. It is all the time a enjoyable course of to get on a brand new challenge and sort of really feel it out.”\n\nHowever earlier than he traces up one other function, his sights are on the Golden Globes (airing on NBC Jan. 7, 2018). Hammer is nominated in the identical class as Willem Dafoe (The Florida Undertaking), Richard Jenkins (The Form of Water), Christopher Plummer (All of the Cash within the World) and Sam Rockwell (Three Billboards Outdoors Ebbing, Missouri), and he’s significantly keen on Jenkins’ and Rockwell’s performances. “I might be very happy to lose to both of them. And I am excited to see The Florida Undertaking,” Hammer stated. “I have never seen it but however I heard it is wonderful.”\n\nEven when Hammer does not stroll away with a Golden Globe, he is simply completely happy to be a part of the movie. “I already gained by attending to be part of this movie. I already gained as a result of I started working with Luca, I started working with Timmy, I received to shoot a film within the lovely Italian countryside,” he informed E! Information solely. “Something that comes afterward can be icing on an already scrumptious cake.”\n\nBetter of all, award season will present loads of alternatives for Hammer to combine and mingle together with his favourite actors. “It is a fantastic time for actors to get along with their friends. I am truthfully actually sort of enthusiastic about geeking out and being like, ‘Man, Sam Rockwell! That was a tremendous efficiency! Holy s–t, dude!’ It will be enjoyable to get to see all of the individuals that you simply respect and admire their work,” he defined. “It is all the time enjoyable. Each time the Golden Globes comes round, you recognize that you will go to an ideal celebration. You recognize that you will have enjoyable with an ideal assortment of your friends. Deliver it on! I am positive I’ll get up within the morning feeling a little bit bit worse, as a result of I’m a little bit older now—however life goes on!”\n\nDone", "images": ["https://live.staticflickr.com/4647/39028224211_89f418b85b_n.jpg", "https://live.staticflickr.com/4647/39028224211_89f418b85b_b.jpg", "https://live.staticflickr.com/4647/39028224211_89f418b85b.jpg"], "top_img": "https://live.staticflickr.com/4647/39028224211_89f418b85b_b.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.flickr.com/photos/138991380@N06/39028224211", "title": "Armie Hammer on His First Golden Globe Nomination: I Feel Like I Already Won", "meta_data": {"fb": {"app_id": 137206539707334}, "og": {"site_name": "Flickr", "updated_time": "2020-04-18T17:52:44.634Z", "title": "Armie Hammer on His First Golden Globe Nomination: I Feel Like I Already Won", "description": "It wasn’t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title. In spite of everything, the movie has been a important darling because it debuted on the Sundance M...   takenews.net/armie-hammer-on-his-first-golden-globe-nomin...  takenews.net/wp-content/uploads/2017/12/rs_1024x576-17100...  It wasn’t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title. In spite of everything, the movie has been a important darling because it debuted on the Sundance Movie Pageant in January. Hammer and co. have been nominated for dozens of awards, and hope to win on the 2018 Critics’ Alternative Awards and the 2018 Impartial Spirit Awards. Luca Guadagnino‘s film, tailored from André Aciman‘s best-selling novel, is about within the Italian countryside within the early ’80s. And the romantic coming-of-age drama, starring Golden Globe nominee Timothée Chalamet within the lead function, is predicted to be a serious participant all through the 2018 award season. E! Information spoke to Hammer by telephone Monday, shortly after he discovered of his nomination. “It has been good,” he laughed. “It is all the time an excellent factor when your day peaks at 5:45 within the morning.” Because it turned out, Hammer was already awake, as he has two younger youngsters at house. “I’ve to speak quietly, as a result of Harper remains to be sleeping,” the actor stated apologetically. “However I can inform you how the dialog goes to go. She’s going to come back downstairs, and I’ll say, ‘Harper! Daddy received nominated for a Golden Globe!’ She’ll go, ‘Oh. OK…Can I’ve pancakes for breakfast?'” Although his daughter will not be sufficiently old to grasp what a milestone that is, the 31-year-old actor positive is. “I have been on this enterprise lengthy sufficient that I do know what a giant deal it’s, and what an ideal honor it’s to get nominated for a Golden Globe. It is an wonderful honor. It is nice to have your work appreciated and acknowledged, and I would not be right here with out Luca and Timmy and [co-stars] Michael Stuhlbarg and Peter Spears, and André Aciman and [screenwriter] James Ivory. It is nice, particularly once you do one thing that you simply’re happy with.” Hammer hadn’t had an opportunity to talk with Chalamet but. “I attempted calling him,” he revealed, “however I believe he is equally as busy as I’m, doing telephone calls. So, I have never gotten ahold of him.” The celebrities have been selling the movie almost a yr, and now that it is receiving a lot consideration, anticipate to see much more of its stars. “It nonetheless appears like we’re proper in the midst of the promotion hurricane, particularly once you get a Golden Globe nomination,” Hammer stated. “To get one for the movie, and for Timmy as nicely, it feels prefer it’s now going to kick us into excessive gear.” It hasn’t been that lengthy since principal pictures started, regardless that it might really feel prefer it. Hammer was initially hesitant to star within the movie, however he determined to take an opportunity and put his religion in Guadagnino. “I had that second [of clarity] after I received to Italy, actually. The truth of what we have been going to do and the enterprise that we had forward of us sort of set in,” he stated. “That was actually sort of a fast, passing feeling for me—that artist’s insecurity sort of factor. However as quickly as we received to Italy, I used to be like, ‘I’m so glad I did this. This was clearly the fitting transfer.'” Now that a lot time has handed since filming, he stated, “I want I used to be again in Italy. Oh, man! I have been again to go to simply because I missed it a lot. I went again to Crema—for no function!” The solid and crew have been pretty remoted after they shot Name Me by Your Title, which was international to Hammer, who had beforehand starred in big-budget, would-be blockbusters like The Lone Ranger and The Man From U.N.C.L.E. Going ahead, he hopes to duplicate the expertise he had engaged on the indie. “There are undoubtedly facets that I might love to hunt out—principally simply being challenged and dealing on artwork for the sake of artwork. However on the similar time, each movie is so totally different,” he stated. “I am excited for the way the subsequent one goes to problem me or push me, and the way I’ll react, take care of or interact with the subsequent director that I work with and the subsequent group of co-stars. It is all the time a enjoyable course of to get on a brand new challenge and sort of really feel it out.” However earlier than he traces up one other function, his sights are on the Golden Globes (airing on NBC Jan. 7, 2018). Hammer is nominated in the identical class as Willem Dafoe (The Florida Undertaking), Richard Jenkins (The Form of Water), Christopher Plummer (All of the Cash within the World) and Sam Rockwell (Three Billboards Outdoors Ebbing, Missouri), and he’s significantly keen on Jenkins’ and Rockwell’s performances. “I might be very happy to lose to both of them. And I am excited to see The Florida Undertaking,” Hammer stated. “I have never seen it but however I heard it is wonderful.” Even when Hammer does not stroll away with a Golden Globe, he is simply completely happy to be a part of the movie. “I already gained by attending to be part of this movie. I already gained as a result of I started working with Luca, I started working with Timmy, I received to shoot a film within the lovely Italian countryside,” he informed E! Information solely. “Something that comes afterward can be icing on an already scrumptious cake.” Better of all, award season will present loads of alternatives for Hammer to combine and mingle together with his favourite actors. “It is a fantastic time for actors to get along with their friends. I am truthfully actually sort of enthusiastic about geeking out and being like, ‘Man, Sam Rockwell! That was a tremendous efficiency! Holy s–t, dude!’ It will be enjoyable to get to see all of the individuals that you simply respect and admire their work,” he defined. “It is all the time enjoyable. Each time the Golden Globes comes round, you recognize that you will go to an ideal celebration. You recognize that you will have enjoyable with an ideal assortment of your friends. Deliver it on! I am positive I’ll get up within the morning feeling a little bit bit worse, as a result of I’m a little bit older now—however life goes on!”", "type": "article", "url": "https://www.flickr.com/photos/138991380@N06/39028224211/", "image": {"identifier": "https://live.staticflickr.com/4647/39028224211_89f418b85b_b.jpg", "width": 1024, "height": 576}}, "robots": "noarchive", "googlebot": "noarchive", "al": {"ios": {"app_name": "Flickr", "app_store_id": 328407587, "url": "flickr://flickr.com/photos/138991380@N06/39028224211"}}, "twitter": {"app": {"name": {"iphone": "Flickr"}, "id": {"iphone": 328407587}, "url": {"iphone": "flickr://flickr.com/photos/138991380@N06/39028224211/"}}, "site": "@flickr", "card": "photo", "description": "It wasn’t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title. In spite of everything, the movie has been a important darling because it debuted on the Sundance M...   takenews.net/armie-hammer-on-his-first-golden-globe-nomin...  takenews.net/wp-content/uploads/2017/12/rs_1024x576-17100...  It wasn’t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title. In spite of everything, the movie has been a important darling because it debuted on the Sundance Movie Pageant in January. Hammer and co. have been nominated for dozens of awards, and hope to win on the 2018 Critics’ Alternative Awards and the 2018 Impartial Spirit Awards. Luca Guadagnino‘s film, tailored from André Aciman‘s best-selling novel, is about within the Italian countryside within the early ’80s. And the romantic coming-of-age drama, starring Golden Globe nominee Timothée Chalamet within the lead function, is predicted to be a serious participant all through the 2018 award season. E! Information spoke to Hammer by telephone Monday, shortly after he discovered of his nomination. “It has been good,” he laughed. “It is all the time an excellent factor when your day peaks at 5:45 within the morning.” Because it turned out, Hammer was already awake, as he has two younger youngsters at house. “I’ve to speak quietly, as a result of Harper remains to be sleeping,” the actor stated apologetically. “However I can inform you how the dialog goes to go. She’s going to come back downstairs, and I’ll say, ‘Harper! Daddy received nominated for a Golden Globe!’ She’ll go, ‘Oh. OK…Can I’ve pancakes for breakfast?'” Although his daughter will not be sufficiently old to grasp what a milestone that is, the 31-year-old actor positive is. “I have been on this enterprise lengthy sufficient that I do know what a giant deal it’s, and what an ideal honor it’s to get nominated for a Golden Globe. It is an wonderful honor. It is nice to have your work appreciated and acknowledged, and I would not be right here with out Luca and Timmy and [co-stars] Michael Stuhlbarg and Peter Spears, and André Aciman and [screenwriter] James Ivory. It is nice, particularly once you do one thing that you simply’re happy with.” Hammer hadn’t had an opportunity to talk with Chalamet but. “I attempted calling him,” he revealed, “however I believe he is equally as busy as I’m, doing telephone calls. So, I have never gotten ahold of him.” The celebrities have been selling the movie almost a yr, and now that it is receiving a lot consideration, anticipate to see much more of its stars. “It nonetheless appears like we’re proper in the midst of the promotion hurricane, particularly once you get a Golden Globe nomination,” Hammer stated. “To get one for the movie, and for Timmy as nicely, it feels prefer it’s now going to kick us into excessive gear.” It hasn’t been that lengthy since principal pictures started, regardless that it might really feel prefer it. Hammer was initially hesitant to star within the movie, however he determined to take an opportunity and put his religion in Guadagnino. “I had that second [of clarity] after I received to Italy, actually. The truth of what we have been going to do and the enterprise that we had forward of us sort of set in,” he stated. “That was actually sort of a fast, passing feeling for me—that artist’s insecurity sort of factor. However as quickly as we received to Italy, I used to be like, ‘I’m so glad I did this. This was clearly the fitting transfer.'” Now that a lot time has handed since filming, he stated, “I want I used to be again in Italy. Oh, man! I have been again to go to simply because I missed it a lot. I went again to Crema—for no function!” The solid and crew have been pretty remoted after they shot Name Me by Your Title, which was international to Hammer, who had beforehand starred in big-budget, would-be blockbusters like The Lone Ranger and The Man From U.N.C.L.E. Going ahead, he hopes to duplicate the expertise he had engaged on the indie. “There are undoubtedly facets that I might love to hunt out—principally simply being challenged and dealing on artwork for the sake of artwork. However on the similar time, each movie is so totally different,” he stated. “I am excited for the way the subsequent one goes to problem me or push me, and the way I’ll react, take care of or interact with the subsequent director that I work with and the subsequent group of co-stars. It is all the time a enjoyable course of to get on a brand new challenge and sort of really feel it out.” However earlier than he traces up one other function, his sights are on the Golden Globes (airing on NBC Jan. 7, 2018). Hammer is nominated in the identical class as Willem Dafoe (The Florida Undertaking), Richard Jenkins (The Form of Water), Christopher Plummer (All of the Cash within the World) and Sam Rockwell (Three Billboards Outdoors Ebbing, Missouri), and he’s significantly keen on Jenkins’ and Rockwell’s performances. “I might be very happy to lose to both of them. And I am excited to see The Florida Undertaking,” Hammer stated. “I have never seen it but however I heard it is wonderful.” Even when Hammer does not stroll away with a Golden Globe, he is simply completely happy to be a part of the movie. “I already gained by attending to be part of this movie. I already gained as a result of I started working with Luca, I started working with Timmy, I received to shoot a film within the lovely Italian countryside,” he informed E! Information solely. “Something that comes afterward can be icing on an already scrumptious cake.” Better of all, award season will present loads of alternatives for Hammer to combine and mingle together with his favourite actors. “It is a fantastic time for actors to get along with their friends. I am truthfully actually sort of enthusiastic about geeking out and being like, ‘Man, Sam Rockwell! That was a tremendous efficiency! Holy s–t, dude!’ It will be enjoyable to get to see all of the individuals that you simply respect and admire their work,” he defined. “It is all the time enjoyable. Each time the Golden Globes comes round, you recognize that you will go to an ideal celebration. You recognize that you will have enjoyable with an ideal assortment of your friends. Deliver it on! I am positive I’ll get up within the morning feeling a little bit bit worse, as a result of I’m a little bit older now—however life goes on!”"}, "description": "It wasn&#8217;t precisely a shock when Armie Hammer obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the 2018 Golden Globes for his function in Name Me by Your Title.\n\tIn spite of everything, the movie has been a important darling because it debuted on the Sundance M... \n\t\n\t<a href=\"https://takenews.net/armie-hammer-on-his-first-golden-globe-nomination-i-feel-like-i-already-won/\" rel=\"noreferrer nofollow\">takenews.net/armie-hammer-on-his-first-golden-globe-nomin...</a>\n\t\n\t<a href=\"https://takenews.net/wp-content/uploads/2017/12/rs_1024x576-171004072838-1024.jpg\" rel=\"noreferrer nofollow\">takenews.net/wp-content/uploads/2017/12/rs_1024x576-17100...</a>\n\t\n\tIt wasn&#8217;t precisely a shock when <strong>Armie Hammer</strong> obtained a Finest Supporting Actor in a Movement Image nomination—his first!—on the <strong>2018 Golden Globes</strong> for his function in <em>Name Me by Your Title</em>.\n\tIn spite of everything, the movie has been a important darling because it debuted on the Sundance Movie Pageant in January. Hammer and co. have been nominated for dozens of awards, and hope to win on the <strong>2018</strong> <strong>Critics&#8217; Alternative Awards</strong> and the <strong>2018</strong> <strong>Impartial Spirit Awards</strong>. <strong>Luca Guadagnino</strong>&#8216;s film, tailored from <strong>André Aciman</strong>&#8216;s best-selling novel, is about within the Italian countryside within the early &#8217;80s. And the romantic coming-of-age drama, starring Golden Globe nominee <strong>Timothée Chalamet </strong>within the lead function, is predicted to be a serious participant all through the 2018 award season.\n\tE! Information spoke to Hammer by telephone Monday, shortly after he discovered of his nomination. &#8220;It has been good,&#8221; he laughed. &#8220;It is all the time an excellent factor when your day peaks at 5:45 within the morning.&#8221;\n\tBecause it turned out, Hammer was already awake, as he has two younger youngsters at house. &#8220;I&#8217;ve to speak quietly, as a result of <strong>Harper</strong> remains to be sleeping,&#8221; the actor stated apologetically. &#8220;However I <em>can</em> inform you how the dialog goes to go. She&#8217;s going to come back downstairs, and I&#8217;ll say, &#8216;Harper! Daddy received nominated for a Golden Globe!&#8217; She&#8217;ll go, &#8216;Oh. OK…Can I&#8217;ve pancakes for breakfast?'&#8221; Although his daughter will not be sufficiently old to grasp what a milestone that is, the 31-year-old actor positive is. &#8220;I have been on this enterprise lengthy sufficient that I do know what a giant deal it&#8217;s, and what an ideal honor it&#8217;s to get nominated for a Golden Globe. It is an <em>wonderful</em> honor. It is nice to have your work appreciated and acknowledged, and I would not be right here with out Luca and Timmy and [co-stars] <strong>Michael Stuhlbarg</strong> and <strong>Peter Spears</strong>, and André Aciman and [screenwriter] <strong>James Ivory</strong>. It is nice, particularly once you do one thing that you simply&#8217;re happy with.&#8221;\n\tHammer hadn&#8217;t had an opportunity to talk with Chalamet but. &#8220;I attempted calling him,&#8221; he revealed, &#8220;however I believe he is equally as busy as I&#8217;m, doing telephone calls. So, I have never gotten ahold of him.&#8221;\n\tThe celebrities have been selling the movie almost a yr, and now that it is receiving a lot consideration, anticipate to see much more of its stars. &#8220;It nonetheless appears like we&#8217;re proper in the midst of the promotion hurricane, particularly once you get a Golden Globe nomination,&#8221; Hammer stated. &#8220;To get one for the movie, and for Timmy as nicely, it feels prefer it&#8217;s now going to kick us into excessive gear.&#8221;\n\tIt hasn&#8217;t been <em>that</em> lengthy since principal pictures started, regardless that it might really feel prefer it. Hammer was initially hesitant to star within the movie, however he determined to take an opportunity and put his religion in Guadagnino. &#8220;I had that second [of clarity] after I received to Italy, actually. The truth of what we have been going to do and the enterprise that we had forward of us sort of set in,&#8221; he stated. &#8220;That was actually sort of a fast, passing feeling for me—that artist&#8217;s insecurity sort of factor. However as quickly as we received to Italy, I used to be like, &#8216;I&#8217;m so glad I did this. This was clearly the fitting transfer.'&#8221;\n\tNow that a lot time has handed since filming, he stated, &#8220;I want I used to be again in Italy. Oh, man! I have been again to go to simply because I missed it a lot. I went again to Crema—for no function!&#8221;\n\tThe solid and crew have been pretty remoted after they shot <em>Name Me by Your Title</em>, which was international to Hammer, who had beforehand starred in big-budget, would-be blockbusters like <em>The Lone Ranger </em>and <em>The Man From U.N.C.L.E. </em>Going ahead, he hopes to duplicate the expertise he had engaged on the indie. &#8220;There are undoubtedly facets that I might love to hunt out—principally simply being challenged and dealing on artwork for the sake of artwork. However on the similar time, each movie is so totally different,&#8221; he stated. &#8220;I am excited for the way the subsequent one goes to problem me or push me, and the way I&#8217;ll react, take care of or interact with the subsequent director that I work with and the subsequent group of co-stars. It is all the time a enjoyable course of to get on a brand new challenge and sort of really feel it out.&#8221;\n\tHowever earlier than he traces up one other function, his sights are on the Golden Globes (airing on NBC Jan. 7, 2018). Hammer is nominated in the identical class as <strong>Willem Dafoe</strong> (<em>The Florida Undertaking</em>), <strong>Richard</strong> <strong>Jenkins</strong> (<em>The Form of Water</em>), <strong>Christopher Plummer</strong> (<em>All of the Cash within the World</em>) and <strong>Sam</strong> <strong>Rockwell</strong> (<em>Three Billboards Outdoors Ebbing, Missouri</em>), and he&#8217;s significantly keen on Jenkins&#8217; and Rockwell&#8217;s performances. &#8220;I might be very happy to lose to both of them. And I am excited to see <em>The Florida Undertaking</em>,&#8221; Hammer stated. &#8220;I have never seen it but however I heard it is wonderful.&#8221;\n\tEven when Hammer does not stroll away with a Golden Globe, he is simply completely happy to be a part of the movie. &#8220;I already gained by attending to be part of this movie. I already gained as a result of I started working with Luca, I started working with Timmy, I received to shoot a film within the lovely Italian countryside,&#8221; he informed E! Information solely. &#8220;Something that comes afterward can be icing on an already scrumptious cake.&#8221;\n\tBetter of all, award season will present loads of alternatives for Hammer to combine and mingle together with his favourite actors. &#8220;It is a fantastic time for actors to get along with their friends. I am truthfully actually sort of enthusiastic about geeking out and being like, &#8216;Man, Sam Rockwell! That was a tremendous efficiency! Holy s&#8211;t, dude!&#8217; It will be enjoyable to get to see all of the individuals that you simply respect and admire their work,&#8221; he defined. &#8220;It is all the time enjoyable. Each time the Golden Globes comes round, you recognize that you will go to an ideal celebration. You recognize that you will have enjoyable with an ideal assortment of your friends. Deliver it on! I am positive I&#8217;ll get up within the morning feeling a little bit bit worse, as a result of I&#8217;m a little bit older now—however life goes on!&#8221;", "title": "Armie Hammer on His First Golden Globe Nomination: I Feel Like I Already Won", "flickr_photos": {"by": "https://www.flickr.com/people/138991380@N06/"}, "application-name": "Armie Hammer on His First Golden Globe Nomination: I Feel … | Flickr", "msapplication-TileColor": "#FFFFFF", "google": "notranslate", "msapplication-TileImage": "https://combo.staticflickr.com/pw/images/favicons/favicon-144.png"}, "movies": [], "publish_date": null, "source": "https://www.flickr.com", "summary": ""}