{"url": "thefilmexperience.net/blog/2017/9/14/tiff-glenn-close-is-the-wife.html", "text": "Thursday, September 14, 2017 at 8:45PM\n\nour ongoing adventures at TIFF. An abdriged version of this review was originally published in Nathaniel's column at Towleroad.\n\nFilm festivals nearly always provide curious dialogues between films that you weren't expecting. On the same day on the exact same screen at TIFF I managed to see two films about female writers and the male writers in their lives who take up all the oxygen (and praise) in the room. Who would have thought that a film about the origins of Frankenstein (just discussed) and a star vehicle for Glenn Close in Stockholm would have so much in common?\n\nTHE WIFE (Björn Runge)\n\nJoan Castleman (Glenn Close) is a longsuffering wife who would bristle at that very description. She's married to a famous novelist Joe Castleman (Jonathan Pryce) and their homophonic names are no coincidence. The silver-haired couple have been together for nearly half a century and are inseparable if not quite interchangeable...\n\nAs The Wife begins we learn that Joe has just been named the Nobel prize winner in literature and the couple are to travel to Stockholm together for the ceremony. They're so happy they actually jump on their bed together in a singularly charming scene. This slow burn story may start out playful but it deepens as it goes thanks to Close's brilliant work.\n\nthe younger and the older CastlemansAll the principle characters in Joe's orbit also happen to be writers and resent him, if not quite his enormous success, for different reasons: his son David (Max Irons) never gets the encouragement he needs, his wife Joan was a promising writer who set her own career aside when she married him, and then there's Nathaniel (Christian Slater) who's been trailing the family for years trying to get permission to write Joe's biography.\n\nThe cracks in the happy marriage facade begin to show as the Nobel ceremony nears and flashbacks pile up. Annie Starke, Close's own daughter, plays her as a young college student and Elizabeth McGoven gives great cameo as an aggressive lady author who warns her away from the sexist literary world which just won't let women succeed. Björn Runge, a Swedish director making his first English language film, doesn't find many ways to visualize all of the drama - it's mostly two or more characters arguing in rooms, planes, or hotels, but he's great with the actors who all deliver in this adaptation of Meg Wolitzer's bestseller.\n\nThe interpersonal dynamics and face-offs are the savory meat of the film. To my personal astonishment Glenn Close restricts herself to chewing on it rather than the scenery! Put simply it's the best work she's done in over 20 years.\n\nClose's opacity as an actress, the unknowability of that glacial face, has often been disguised by her sheer volume and ferocity in so many gorgon roles. Here in Joan's quieter less sinister register, she's spectacular. You constantly attempt to figure Joan out but Joan will not have it. She prefers to remain a mystery, hiding her true feelings from everyone, including possibly herself. Her mercurial moods will shift within scenes; just when you expect her to double down on anger she'll throw compassion at you, and vice versa, keeping you off balance. At one point in a brilliantly acted private 'date' with that would-be biographer, she says \"I'm shy\" with something like mock flirtation. It sounds like a lie, but it's actually the truth of this mesmerizing character.\n\nThe film isn't quite as coy as Close, eventually revealing its hand. Joan Castleman and her poker face would not approve. But that, in a nutshell, is the satisfying friction of the film, a star vehicle wherein the star keeps threatening to jump from her own limo.\n\nOn set filming The Wife with the stunning and talented Glenn Close and her dog Pip. A post shared by Christian Slater (@realchristianslater) on Nov 16, 2016 at 11:11am PST\n\n\n\nGrades: Glenn Close A; Film B\n\nOscar Potential: A probable Best Actress nomination for Close if the film finds distribution in time.", "images": ["https://www.paypalobjects.com/en_US/i/scr/pixel.gif", "http://thefilmexperience.net/storage/banners/BANNER-grey.jpg", "http://thefilmexperience.net/universal/images/squarespace/blogon-button.png", "http://thefilmexperience.net/storage/2000s/amerpsycho-tux.jpg?__SQUARESPACE_CACHEVERSION=1586964839872", "http://thefilmexperience.net/storage/2017/thewife.jpg?__SQUARESPACE_CACHEVERSION=1505331278570", "http://thefilmexperience.net/storage/2017/thewife-flashbacks.jpg?__SQUARESPACE_CACHEVERSION=1505331752260", "http://thefilmexperience.net/storage/2020/hittman.jpg?__SQUARESPACE_CACHEVERSION=1584301060174", "http://thefilmexperience.net/storage/2020/Screen Shot 2020-04-15 at 11.35.23 AM.png?__SQUARESPACE_CACHEVERSION=1586964945735", "http://thefilmexperience.net/storage/2017/thewife-firststill.jpg?__SQUARESPACE_CACHEVERSION=1505331779903", "http://thefilmexperience.net/universal/images/transparent.png"], "top_img": "http://thefilmexperience.net/storage/2017/thewife.jpg?__SQUARESPACE_CACHEVERSION=1505331278570", "keywords": [], "authors": ["Author", "Author Email", "Optional", "Author Url"], "canonical_link": "", "title": "TIFF: Glenn Close is \"The Wife\"", "meta_data": {"Robots": "index,follow", "og": {"title": "TIFF: Glenn Close is \"The Wife\" - Blog - The Film Experience", "description": "our ongoing adventures at TIFF . An abdriged version of this review was originally published in Na...", "image": "http://thefilmexperience.net/storage/2017/thewife-firststill.jpg?__SQUARESPACE_CACHEVERSION=1505331779903"}}, "movies": [], "publish_date": 1505318400.0, "source": "http://thefilmexperience.net", "summary": ""}