{"url": "https://metro.co.uk/2018/11/01/what-is-happening-with-sofia-vergara-and-nick-loebs-lawsuit-over-her-frozen-embryos-8096847/", "text": "Sofia and Nick have been in a legal dispute for three years\n\nSofia Vergara is still in a legal battle with her own frozen embryos.\n\nYep, it’s just as mind-boggling as it sounds.\n\nFor the past three years, the Modern Family actress has been locked in a bitter legal dispute with her ex-boyfriend Nick Loeb, who filed the lawsuit against Sofia on behalf of her own frozen eggs.\n\nSofia, 46, and Nick, 43, had dated for two years before splitting in May 2014, ending their engagement.\n\nWhile still dating in 2013, the pair signed a document which stated that they could not use the embryos without the other party’s consent.\n\nNick and Sofia dated for two years and was engaged (Picture: WireImage)\n\nBut in 2015, a year after their split, Nick filed a right-to-live lawsuit in California. This was later dropped but he then filed a new suit in Louisiana as it’s a pro-life state and recognises embryos as humans or ‘juridical persons’.\n\nAdvertisement\n\nAdvertisement\n\nIt’s reported that Nick has named the two female embryos “Isabella” and “Emma”.\n\nThe businessman reportedly claims that if the embryos aren’t brought to life, they are being denied the right to an inheritance fund set up in their name.\n\nSofia has successfully blocked Nick from using the embryos and creating life twice but he filed a third lawsuit in April 2018.\n\nAlthough it was reported that Sofia had lost her rights to the eggs in June, the legal battle is still ongoing with no resolve as yet.\n\nSo what have Nick and Sofia said about the embryos?\n\nSofia wants to keep the embryos frozen but Nick says life has already been created (Picture: WireImage)\n\nIn 2015, a rep for Sofia was clear to state that the actress does not want the embryos destroyed but rather, have them remain frozen.\n\nThe rep said: ‘Vergara has never suggested that she wished to have the embryos destroyed … She has always maintained that they be kept frozen, a fact of which Loeb and his counsel have always been aware, despite Loeb’s statements to the contrary.’\n\nThat same year, Sofia herself gave a rare interview about the complex dispute and told Good Morning America: ‘I’ve been working very hard for 20 years to get to this point where I am, enjoying my movie.\n\n‘I promote all my movies, all my work, but I don’t like promoting my private life and I don’t understand why this person… I don’t want to allow this person to take more advantage of my career and try to promote himself and get press for this.’\n\nAdvertisement\n\nAdvertisement\n\nShe added: ‘This shouldn’t be out there for people to give their opinion. There’s nothing to talk about, there’s papers signed.’\n\nCoincidentally, the same week of Sofia’s GMA interview, Nick told Howard Stern that he didn’t ‘hate’ the actress and actually had ‘tremendous respect’ for her.\n\nSofia married Joe in 2015 (Picture: Getty Images)\n\nThe situation took an even more bizarre twist in April 2018 when Nick reportedly compared their legal case to slavery.\n\nAccording to The Blast, the lawsuit reportedly says that this type of legal argument has happened ‘only one other time in United States history from which any legal precedent may be reviewed – the pre-Civil War era’.\n\nIt continues: ‘Under these simple definitions, a human embryo, if believed to be a human being and alive, (which is our contention) would be considered a slave and the parents would be the owners of the slave, particularly in states where they are considered property.\n\n‘There was a question at the time as to whether New York had the jurisdiction to reach into Louisiana and retrieve Northup. But the New York governor discussed it with Louisiana officials and they were allowed to retrieve him.\n\n‘There are also dozens of cases (called the Freedom Suits), where slaves themselves or their family members applied for freedom in slave states and won.\n\n‘The reference to slave cases is to demonstrate the jurisdictional and legal issues arising from this stark difference in how human beings are categorised. In modern day, frozen human embryo disputes and the question of how they are categorised (human being or property) has become more frequent.\n\nAdvertisement\n\n‘Since there is little or no legislation in most states on this issue, state courts are left to decide if embryos are human beings or property or something in between and what to do in cases of dispute.’\n\nMost recently in October 2018, a source told TMZ that Sofia feels Nick is using the embryo lawsuit to come between her marriage with Joe Manganiello whom she tied the knot with in 2015.\n\nSofia’s embryos are currently said to be frozen in a Beverly Hills clinic.\n\nGot a showbiz story? If you've got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: ‘I’m the third wheel’: Writer who is desperate to be a mum admits feeling ‘jealous’ of her surrogate", "images": ["https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/11/sei_37897616-86291.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/j/JL_Brandlines_Logo_Micro_Use_Blk_RGB-100px_9.png", "https://d3tsytm1wtjqo2.cloudfront.net/180x/images/c/currys_9.png", "https://metro.co.uk/wp-content/themes/metro-parent/img/fallback.png", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/v/virgin-media_9.png", "https://i2.wp.com/metro.co.uk/wp-content/uploads/2018/11/sei_37897616-8629.jpg?quality=90&strip=all&zoom=1&resize=644%2C338&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6034964&cv=2.0&cj=1", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/n/nord_logo_square_1x_9.png", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/w/Wickes-Logo_9.png"], "top_img": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/11/sei_37897616-86291.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "keywords": [], "authors": ["Alicia Adejobi"], "canonical_link": "https://metro.co.uk/2018/11/01/what-is-happening-with-sofia-vergara-and-nick-loebs-lawsuit-over-her-frozen-embryos-8096847/", "title": "What's happening with Sofia Vergara and Nick Loeb’s frozen embryos lawsuit?", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "format-detection": "telephone=no", "robots": "max-image-preview:large", "google-site-verification": "NRfCb8mBNAy5_f17NpvLZYoY38EzM2dgpcOh_Am9yps", "twitter": {"widgets": {"csp": "on"}, "image": {"src": "https://metro.co.uk/wp-content/uploads/2018/11/sei_37897616-8629.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630"}, "title": "What's happening with Sofia Vergara and Nick Loeb’s frozen embryos lawsuit?", "description": "Complex legal case has been ongoing since 2015.", "card": "summary_large_image", "site": "@MetroUK", "account_id": 138749160}, "ir-site-verification-token": 422605026, "description": "Sofia Vergara is still in a legal battle with her own frozen embryos. Yep, it’s just as mind-boggling as it sounds. For the past three years, the Modern Family actress...", "news_keywords": "sofia vergara, nick loeb, sofia vergara embryos, sofia vergara eggs, sofia vergara children, nick loeb embryos, sofia vergara boyfriend, sofia vergara husband, joe manganiello, sofia vergara lawsuit,", "msvalidate.01": "11110DC8D42E74E13F24B3A18E7CFB8A", "generator": "WordPress 5.4", "fb": {"pages": "117118184990145,427889824264313", "app_id": 176908729004638}, "ia": {"markup_url": "https://metro.co.uk/2018/11/01/what-is-happening-with-sofia-vergara-and-nick-loebs-lawsuit-over-her-frozen-embryos-8096847/?ia_markup=1"}, "theme-color": "#000000", "apple-mobile-web-app-title": "Metro", "sailthru.date": "2018-11-01 15:08:50", "sailthru.title": "What is happening with Sofia Vergara and Nick Loeb’s lawsuit over her frozen embryos?", "sailthru.tags": "sofia vergara", "sailthru.description": "Complex legal case has been ongoing since 2015.", "sailthru.image.full": "https://metro.co.uk/wp-content/uploads/2018/11/sei_37897616-8629.jpg?quality=90&strip=all&crop=155px%2C7px%2C363px%2C363px&resize=150%2C150", "sailthru.image.thumb": "https://metro.co.uk/wp-content/uploads/2018/11/sei_37897616-8629.jpg?quality=90&strip=all&crop=155px%2C7px%2C363px%2C363px&resize=150%2C150&w=50", "og": {"locale": "en_GB", "title": "What's happening with Sofia Vergara and Nick Loeb’s frozen embryos lawsuit?", "type": "article", "url": "https://metro.co.uk/2018/11/01/what-is-happening-with-sofia-vergara-and-nick-loebs-lawsuit-over-her-frozen-embryos-8096847/", "description": "Complex legal case has been ongoing since 2015.", "site_name": "Metro", "image": {"identifier": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/11/sei_37897616-86291.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "secure_url": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/11/sei_37897616-86291.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MetroUK", "section": "Entertainment", "tag": "Sofia Vergara", "published_time": "2018-11-01T15:08:50+0000", "modified_time": "2018-11-01T15:18:07+0000"}, "msapplication-TileImage": "https://metro.co.uk/wp-content/uploads/2020/03/cropped-m-icon-black-9693.png?w=270"}, "movies": [], "publish_date": 1541001600.0, "source": "https://metro.co.uk", "summary": ""}