{"url": "www.cosmopolitan.com/sex-love/a14428006/kate-and-william-body-language/", "text": "When newlyweds Prince Harry and Meghan Markle cozy up to each other, NBD, but when Kate Middleton tapped the knee of Prince William — her husband of nearly seven years — during an interview in December, the moment was internationally scrutinized. At the royal wedding of the new Duke and Duchess of Sussex, Kate and William took special interest in each other, going so far as to lean over poor Camilla to converse:\n\n\n\nPrince William, Camila, and Kate Middleton in the pews of St George’s Chapel at Prince Harry and Meghan Markle’s May 19, 2018 wedding. Getty Images\n\nAlthough body language typically reflects a couple's emotional connection, you can't fully interpret it without context — particularly when observing how a royal couple behaves in public, according to body language expert Blanca Cobb based in North Carolina. \"They may be more reserved [than other couples] in their public displays of affection, but that doesn’t meant they love each other any less or aren’t excited about each other,\" Cobb says.\n\nTo better understand what *really* goes on behind palace doors, Cobb analyzed a handful of the couple's closest public encounters:\n\n1. When Kate Leans Over Camilla\n\nGetty Images\n\nIn the midst of a royal wedding, there's no such thing as a private moment — but boy do William and Kate try! Above, they attempt to converse, leaning forward to make eye contact without overstepping into Camilla's personal space, Cobb observes. \"William and Kate prefer to be together and share moments privately,\" she says. So much for seating charts!\n\n2. When Kate Tapped William's Knee\n\nKate taps William’s knee during a filmed interview. (December 2017)\n\nDespite the recent hoopla surrounding this exchange, it isn't *really* about affection or romance, according to Cobb, who sees tapping as a way to signal, \"Hey, we can both relate,\" in lighthearted situations. That said, touching doesn't necessarily happen between any two people: \"There's a level of familiarity, comfort, and likability in touch. Through touch you connect with your partner. You let them know that they’re important to you,\" Cobb says. \"Gentle touches, playful moments, and sincere smiles show that they enjoy each other’s company and have fun together.\"\n\n3. When They Walked Arm-in-Arm\n\nThe couple walks together after a rowing race in Germany. (July 2017) Samir Hussein/ Getty Images\n\nCobb says couples who synchronize their movements are emotionally in sync, and in the photo above, Kate and William both lead with their left legs. \"This shows they are in tune with each other,\" Cobb says. Because Kate walks slightly ahead of William in this photo, it's a sign that she may be a dominant force in their relationship, according to Cobb.\n\n4. When They Stood in the Stands\n\nThe couple holds horns while watching the London Marathon. (April 2017) Samir Hussein / Getty Images\n\n\"Body mirroring is another sign you’re really digging your partner,\" Cobb says, pointing out the way Kate and William both lean toward their left, and they both rest their left forearms on the railing.\n\n5. When William Wrapped His Arms Around Kate\n\nWilliam embraces Kate during London 2012 Olympic Games. (August 2012) Pascal Le Segretain / Getty Images\n\n\"You can get a temperature reading of how hot a couple is for one another by their physical proximity and the level of touch,\" Cobb says. Although this doesn't appear to be an intimate moment, since Kate and William aren't locking eyes, \"they’re seizing the moment with physical closeness that brings them closer emotionally,\" Cobb says.\n\n6. When Kate Draped Her Arms Around William\n\nThe couple embraces during the London 2012 Olympic Games. (August 2012) Pascal Le Segretain / Getty Images\n\nCobb isn't concerned that the couples' eyes don't meet during this embrace, since they're watching a sports game. \"Her hands are relaxed on his shoulders, they're standing body-to-body with no air between them, and while his hands fall away from her a little, his fingers look relaxed with no tightness,\" Cobb says. \"They are very relaxed and comfortable expressing themselves the best way they can, as royals.\"\n\nCobb thinks nothing of the way Kate is tilting her hips away from William in the photo above, in part because it's difficult to determine how much room Kate had to shift around in the stands. And because Kate and William tend to act demure around each other, facing each other, hip-to-hip, would seem out of character for them, anyway.\n\n7. When Kate Air Kisses William\n\nKate kisses William on both cheeks after his polo team wins a competition (July 2011). Samir Hussein / Getty Images\n\nKate and William rarely kiss in public, and this cheek kiss would be a rare exception — except that Kate doesn't actually touch her lips to William's face. \"You can't say she doesn't feel emotion for her husband,\" Cobb says. \"There's still no tension here. Kate is reaching out to him, has a relaxed bend in her arm, with her fingers relaxed on shoulder.\"\n\nWilliam, on the other hand, looks less comfortable receiving affection in this context. \"He's body blocking by holding the gift between them,\" Cobb says, although this doesn't mean these partners don't show fondness toward each other. \"It could be that this is the extent of affection they're willing to demonstrate in public.\"\n\n8. When They Were Young\n\nThe couple poses for photo on the day of their university graduation. (June 2005) Middleton Family/Clarence House via GettyImages\n\n\"Putting your hand on someone's stomach is more intimate than placing it on the shoulder or back,\" Cobb says. \"Although it's unclear whether William is trying to hold Kate's hand there or move it away, there's no curvature to his fingers, which means there no tension. He's most likely holding Kate's hand in place — a sign of mutual comfort.\"\n\n9. When Kate and William Lean In\n\nThe couple sits side by side during a graduation ceremony. (October 2018) ARTHUR EDWARDS/AFP/Getty Images\n\n\"Legs can be used as a psychological barrier expressing interest, disinterest, or discomfort,\" Cobb says of decoding lower-body language. \"William crossing his right leg toward Kate allows her into his space, so he's emotionally drawing her in.\"\n\nKate leaning toward William suggests she's equally into him. \"We move toward things we like and are attracted to,\" Cobb says.\n\n10. When William Touched Kate's Lower Back\n\nThe couple attends media event. (December 2017) Karwai Tang/ Getty Images\n\n\"Couples who love each other want to touch each other, since it can convey your love without you having to say a word,\" Cobb says of William placing his hand on Kate's lower back. \"The back placement is a nice, intimate compromise, since if he goes any lower, he goes near the tush, and the shoulder seems too formal.\"\n\n11. When The Newly Marrieds Kissed On The Buckingham Palace Balcony\n\nThe couple kisses on their wedding day. (April 2011)\n\nCobb says the couple's wedding kiss is the least intimate interaction of them all. \"It was their wedding day! They should have been touching and embracing heart-to-heart,\" she says. Instead, they stand apart, without even holding hands, and reach only their lips toward each other to meet.\n\nDuring the kiss, Kate and William open their eyes at different moments before Kate ultimately pulls away. \"It signals a disconnect, since people who are really into each other automatically close their eyes to feel the moment, the breath of the other person, and the sensation of lips touching,\" Cobb says. \"It looks like they're going through the motions. I also get the sense she’s a little shy, embarrassed, or unsure, since she giggles right afterward, and raises her shoulders — it's a nervous moment for her.\" But hey, not everyone gets married in front of thousands of people!\n\nThe Bottom Line:\n\n\"This isn't a typical couple, they're people of royalty with rules to follow on public decorum,\" Cobb says. \"I think what happens behind closed doors can be very different from what you see in public.\"\n\nGet all the health and fitness news directly in your feed. Follow Facebook.com/CosmoBod.\n\nFollow Elizabeth on Instagram and Twitter.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=1.00xw:0.786xh;0,0.156xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=1.00xw:0.786xh;0,0.156xh&resize=1200:*", "keywords": [], "authors": ["Elizabeth Narins", "Senior Fitness", "Health Editor", "Elizabeth Narins Is A Brooklyn", "Ny-Based Writer", "A Former Senior Editor At"], "canonical_link": "https://www.cosmopolitan.com/sex-love/a14428006/kate-and-william-body-language/", "title": "An Expert Reveals What Kate Middleton and Prince William's Body Language Says About Their Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "An Expert Reveals What Kate Middleton and Prince William's Body Language Says About Their Relationship", "description": "And why Kate might be the \"dominant force\" of the couple.", "url": "https://www.cosmopolitan.com/sex-love/a14428006/kate-and-william-body-language/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=1.00xw:0.786xh;0,0.156xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-05-19 06:59:25", "published_time": "2018-05-19 06:59:00", "section": "Sex & Relationships", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=1.00xw:0.786xh;0,0.156xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Kate Middleton and Prince William Body Language, Decoded", "description": "A body language expert analyzed a handful Kate Middleton and Prince Williams' closest public encounters. Here, what the royal couple's body language says about their relationship.", "keywords": "kate middleton, duchess of cambridge, duke of cambridge, duke and dutchess of cambridge, prince william, body langauge", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=0.639xw:1.00xh;0.181xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Sex & Relationships,sex-love", "sailthru.date": "2018-05-19T18:59:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=1.00xw:0.786xh;0,0.156xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/william-and-kate-body-language-royal-wedding-1526754614.jpg?crop=0.639xw:1.00xh;0.181xw,0", "sailthru.socialtitle": "An Expert Reveals What Kate Middleton and Prince William's Body Language Says About Their Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1526684340.0, "source": "http://www.cosmopolitan.com", "summary": ""}