{"url": "www.theguardian.com/books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson", "text": "In February I saw a photo of Meghan Markle and the Duchess of Cambridge sitting next to each other at the Royal Foundation Forum, wearing colour coordinated dresses (lavender for Kate, deep purple-blue for Meghan). It wasn’t their dresses I minded, it was how they sat – legs crossed neatly at the ankle, knees pressed firmly together. It was that dulce et decorum pose passed down to generations of girls and young women expected to demonstrate their good breeding on social occasions – expected to show they are “ladies”. Both Kate and Meghan had folded their hands in their laps, the arms forming a gentle circle, the hands quietly clasped, as if ready to shelter a child or calm a kingdom’s cares. But it was the legs that haunted me – in part because I’d been taught that same bit of etiquette when I was a young black midwestern girl in the 1950s and early 60s, a child of the manners- and achievement-conscious black bourgeoisie, which in those days we called the Negro elite.\n\nIn fact, things turned out better than I’d feared. In a subsequent photo Kate crossed her legs at the knee. And when both women were asked in the video about the causes they planned to take up, Meghan spoke out. The words “MeToo” and “Time’sUp” flowed from her lips. So did the words “I fundamentally disagree”, as in: “What’s interesting is … when speaking about girls’ and women’s empowerment you’ll often hear people say: ‘Well, you’re helping women find their voices,’ and I fundamentally disagree with that. Women don’t need to find a voice, they have a voice, and they need to feel empowered to use it, and people need to be encouraged to listen.”\n\nFacebook Twitter Pinterest Meghan Markle and the Duchess of Cambridge at the Royal Foundation Forum. Photograph: Chris Jackson/AFP/Getty Images\n\nRachel Meghan Markle, for those who have chosen or somehow managed to miss the ceaseless chronicling of her life thus far, is the only daughter of Thomas Markle (white), an Emmy award-winning cinematographer and lighting designer, and Doria Ragland (black), a social worker and yoga instructor who focuses on community mental health. This union of white Hollywood and black social-spiritual activism made her the offspring of a modern and ever more varied biracial bourgeoisie.\n\nThe family settled in Woodland Hills, a prosperous Los Angeles neighbourhood. Prosperous and largely white: Meghan’s mother was regularly mistaken for her nanny there. This must have happened in the 80s and early 90s when she was a young girl; it still happens in the US to every black woman I know who has a mixed-race child.\n\nMeghan’s parents divorced when she was six, and she lived with her mother after that, although she saw her father regularly. There are two half-siblings from his previous marriage, both quite a bit older. Relations with them, at least since the courtship and engagement, have been strained.\n\nTimeline Prince Harry's relationship with Meghan Markle Show Hide\n\nThe pair meet in London through friends and begin a relationship. News breaks that the prince and Markle are dating. Kensington Palace confirms in an unprecedented statement that they are dating. The prince attacks the media over its “abuse and harassment” of his girlfriend.\n\nMarkle reportedly meets the Duchess of Cambridge and Princess Charlotte for the first time in London.\n\nThe engagement looks set when Markle graces the cover of US magazine Vanity Fair and speaks openly about Harry for the first time, revealing: “We’re two people who are really happy and in love.” Markle makes her first appearance at an official engagement attended by the prince when she attends the Invictus Games opening ceremony in Toronto, Canada – although the pair sit about 18 seats apart. It emerges that the prince has taken Markle to meet his grandmother, the Queen, whose permission they need to marry. They met over afternoon tea at Buckingham Palace. The prince’s aides are reported to have been told to start planning for a royal wedding, with senior members of the royal family asked to look at their diaries to shortlist a series of suitable weekends in 2018. Clarence House announces the engagement, and the Queen and Duke of Edinburgh say they are “delighted for the couple and wish them every happiness”.\n\nThe couple marry before a celebrity-studded congregation at St George's Chapel in the grounds of Windsor Castle.\n\nThe couple's first child, Archie Harrison Mountbatten-Windsor, is born in London. They announce that they are to step back from life as 'senior' royals, triggering a row with Buckingham Palace. After a crisis meeting with the Queen, Prince Charles and Prince William at Sandringham, the Queen issues a statement saying the couple will have a 'transition period' before ending their royal duties. It is announced that Harry and Meghan will drop their HRH titles and repay £2.4m of taxpayers money used to refurbish Frogmore Cottage.\n\nMarkle majored in international relations and theatre at Northwestern University, Illinois. Besides becoming an actor, she became a feminist who worked for UN Women as an advocate for political participation and leadership. Yes, she has been praised and criticised as “outspoken”, but her style never risks being “aggressive” or “combative”, or any of the other words thrown at women who are deemed insufficiently graceful when they disagree with men. Even when she makes staunch political statements, her manner astutely – sometimes cloyingly – balances the forthright and the pleasing. She’s learned to use political maxims and assertions very effectively. As in: “It’s time to focus less on glass slippers and more on glass ceilings.” With the word “fairytale” now a ubiquitous tag line for the royal romance, this should be a useful daily mantra.\n\nThe Cinderella story refuses to dwindle into a period piece; in the last 20 years alone there have been six film remakes with white, black and Latina leads. But Markle has not been plucked from poverty or – like the heroines of such romcom adaptations as Pretty Woman and Maid in Manhattan – from the low-status toil and trouble of working-class life. Her net worth as an actor has been estimated at around $5m. An actor’s fortunes can fluctuate, especially when that actor is a woman. But so can the fortunes of a wife. If the royal marriage were to end in divorce, Markle would not have to depend on the Windsor millions nor, like many once-upon-a-time celebrities, design a skincare or jewellery line for QVC.\n\nAny 'commoner' who marries into any royal family ​is seen as marrying up. But Harry is marrying up too, by marrying out\n\nLove that results in the bride’s near magical social ascent is the key element in Cinderella tales. But is Markle automatically marrying up by marrying a prince? In the old school way, yes: any “commoner” who marries into any royal family is seen as marrying up. But Harry is marrying up too. He’s marrying up by marrying out – out of long-entwined bloodlines, out of entrenched rituals and hierarchies, out of a lineage as constricted as it is privileged. We always ascribe social ambitions to commoners, but aristocrats have their own longings for a world elsewhere. Harry is marrying into all the possibilities of postmodernity. It’s a world where – as Zora Neale Hurston said of black folktales and music – hierarchies, styles, sites of social and cultural change are being made and forgotten every day.\n\nIn this world-elsewhere that is here and now, Markle’s identities as a progressive biracial and black feminist are impeccable. When speaking of her role on TV series Suits, as the biracial lawyer with a black father, she said: “Some households may never have had a black person in their house as a guest, or someone biracial. Well, now there are a lot of us on your TV and in your home with you.” And now there are even a few of us in the castles you see on TV.\n\nHow would a global marketer for the royal family describe their marriage? Charles is not going to help the royal brand become fresh and contemporary. William and Kate are contemporary royals – unpretentious, decent and likable. But they do not suggest risk or daring. Today the House of Windsor is like a venerable and all too predictable fashion house. Its cultural currency depends on history packaged as costume drama: The Queen, The Crown, The King’s Speech, Darkest Hour. To flourish it must attract new designers, new ideas and new muses. And let me end my fashion analogy by noting that in March this year, Virgil Abloh, a Ghanaian American designer, was named artistic director of menswear for Louis Vuitton, a fashion house founded in 1854 when Queen Victoria was on the throne and the royal family had yet to be rebranded as the House of Windsor.\n\nFacebook Twitter Pinterest The Prince and Markle pictured at Kensington Palace in November 2017, just after their engagement was announced. Photograph: Toby Melville/Reuters\n\nPerhaps a better genre through which to read the complexities of the Meghan-Harry narrative is the romantic comedy. In the best romcoms, attraction is ignited by tension and difference. Thwarted too. The characters have to learn something from each other and something about themselves; negotiate across troublesome boundaries (gender and class privilege, temperament), and learn to take emotional risks.\n\nFor this union, Harry has had to renounce his protected status as a vivaciously shallow party boy whose transgressions took the form of booze-fuelled pranks, such as showing up at a friend’s birthday party in a Nazi desert uniform with a swastika armband (the party’s theme was “colonial and native”), or hosting a game of strip poker in a Las Vegas hotel room. Reformation followed in three stages, each appealing to a different constituency. He served in Afghanistan. He recently confessed to emotional and mental health problems that began soon after his mother’s death: a shutdown of feelings, bouts of rage and anxiety followed by psychological counselling.\n\nFinally, there came his involvement with Markle. A professional woman, an educated woman, a 36-year-old divorced American woman, a woman of colour and a feminist whose presence in his life would soon require that he forcefully denounce racism and sexism in the British press (and, I trust, among his more un-woke friends and relations). “I’ve never wanted to be a lady who lunches – I’ve always wanted to be a woman who works,” Markle once said. In show business she worked her way up. She didn’t become a Hollywood superstar; she did become a skilled, well-paid lead in a highly rated TV series. She had a social conscience, which she acted on. And now, she is more famous and more influential than she was ever likely to be on her own. It remains the way of the world. Does Amal Clooney have more resources as a human rights lawyer and philanthropist now that she is married to George Clooney? No doubt.\n\nOnce a woman enters a royal family, every aspect and function of her body becomes a site of proprietary fantasy\n\nWhatever we think of her new job requirements, Markle will remain a working woman with a lifetime of public performances ahead. Every word, every gesture, every detail of dress will be scrutinised and read for subtext. The touches of white on her navy J Crew coat? A tribute to the British suffragettes. Bare legs instead of tights for the engagement photos? A subtle flouting of royal dress proscriptions.\n\nOnce a woman enters a royal family, every aspect and function of her body becomes a site of proprietary fantasy. The female body as a nation’s procreative destiny: the only real change through the centuries is that fantasy has replaced realpolitik. For Diana Spencer, that meant her uncle certifying her virgin status in a tabloid newspaper interview shortly after her engagement to Charles. As if his niece’s body parts were a bride price to be flaunted, eliciting leers and cheers.\n\nFor Markle, it means media warnings that she is 36 years old and shouldn’t wait much longer. “Meghan, Oh Baby! Meghan and Harry Planning a Honeymoon Knock-Up” went one headline. Her former husband, producer Trevor Engelson, is also conjuring imaginary children. He has announced plans for a Fox comedy: “Divorce is hard,” goes its pitch. “Sharing custody is harder when an ex-wife marries a British prince. Sharing custody with the British royal family in the unforgiving spotlight of London’s tabloid media is next level.”\n\n“Meghan Markle Looks Gorgeous With Naturally Curly Hair in Childhood.” The published photo was charming, as is the video of her at 11, with a curly frizzy ponytail, chastising the ad industry for its sexism. Many of us used to ask if we’d ever see Michelle Obama in an updated version of the afro she wore in her pre-public figure days. Many of us used to answer that the furore it would cause – the afro as proof of the first lady’s secret allegiance to white-hating black militants – probably wasn’t worth the gesture. And since a small dust-up followed Meghan’s recent appearance in a bun with wavy tendrils around her face, it’s hard alas to imagine how anything, including the claim of biographer Andrew Morton that she is a direct descendant of Robert the Bruce, would atone for a full display of those racially marked curly/wavy/frizzy locks.\n\nFacebook Twitter Pinterest Markle at her aunt’s wedding. Photograph: Mail on Sunday / Solo Syndication\n\nBut if she never wears her version of a natural, she has already done race history a real service. She has helped scuttle false, foolish constructs of “the mulatto” that were developed a few centuries ago to counter the very real threat that mixed-race people posed to the constructs of white supremacy. To serve popular culture, the female mulatto became a source of social and erotic intrigue, a figure who needed strict narrative policing. Stories, novels, plays and early films gave her two options.\n\nShe could be a scheming seductress (see Lydia Brown in DW Griffith’s The Birth of a Nation, the mistress of a gullible white abolitionist played by a panting and grimacing white actress). Or she could be tragic (as in Dion Boucicault’s The Octoroon of 1859, and Charles Chesnutt’s The House Behind the Cedars of 1900), a beautiful, seemingly white woman of faultlessly refined bearing, doomed by the taint of black ancestry. The tragic version attracts the love of a well-born young white man who does not know her secret. She tries – she hopes, she longs – to pass for white, and the ruse works for a time. But, when the innocent gentleman proposes marriage, the plot dictates that her shame be revealed and she must die, by her own hand or from a fatal disease.\n\nDecades of scholarship and memoir have corrected and complicated this narrative, of course. Still it lingers and titillates, a handy tool for condescension, suspicion and breezy sneers. A key theme in these stories is the heroine’s terror that, if she marries her white hero, she might bear a child whose skin colour would reveal the dreaded racial truth. I imagine there’s plenty of spiteful, behind-the-scenes chatter about whether this “touch of the tarbrush” will taint Meghan and Harry’s offspring. Perhaps the “blackamoor” brooch that Princess Michael of Kent was photographed wearing on her way to a royal event with Harry and Meghan was meant to signify such a dread: Meghan as the black ewe tupped by a white ram, who will produce a shamefully black offspring.\n\nAnd surely the Daily Mail was gesturing towards this when it ran a story about the ostensibly tawdry origins of Markle and her mother, titled: “Harry’s girl is (almost) straight outta Compton: Gang-scarred home of her mother revealed – so will he be dropping by for tea?” Doria Ragland was cast as “a dreadlocked African American lady from the wrong side of the tracks”. One whose career as a yoga instructor and social worker suddenly made her the equivalent of the mulatta’s disreputable mother, who gathers roots and practises hoodoo.\n\nEarly rumours had it that Ragland would walk her daughter down the aisle (with her usual dreads, I hoped). Now it’s reported that Markle’s father will, or that they will share the duty. I vote for Ragland alone. Still, to watch a divorced, interracial couple walk the royal red carpet has its own rewards when, once upon a time just 51 years ago, US law forbade their marriage.\n\nLike any black and biracial woman, she has had a lifetime of learning to both confront and navigate codes\n\nIn 2015 Markle wrote an essay for Elle in which she quite eloquently established that she is both biracial and black. She started with the blunt racial slurs of her childhood, which turned, as she grew, into the patronising queries and assumptions favoured by adults who think themselves liberal. A perfect example was the teacher who told her to fill in “white” on a census because “that’s how you look, Meghan”. Intended as a compliment, no doubt. In the essay, she also discussed the institutional racism exposed by the police shootings in Ferguson and Baltimore. She recalled the flurry of racist tweets set off when Wendell Pierce was cast as her African American father on Suits: “Ew, she’s black? I used to think she was hot.” Then, having described both her struggles with, and her pride in, being biracial, she ended the essay with a tribute to her black ancestry.\n\n“You create the identity you want for yourself, just as my ancestors did when they were given their freedom. Because in 1865 (which is so shatteringly recent), when slavery was abolished in the United States, former slaves had to choose a name. A surname, to be exact. Perhaps the closest thing to connecting me to my ever-complex family tree, my longing to know where I come from, and the commonality that links me to my bloodline, is the choice that my great-great-great grandfather made to start anew. He chose the last name Wisdom. He drew his own box.” Excellently done, I thought. She’s refusing to let white readers white out her black identity.\n\nWhen it comes to issues of race, gender, sexuality and class, how much can Meghan Markle say and do? How much does she want to say and do? We simply don’t know yet. Like any black and biracial woman, she has had a lifetime of learning to both confront and dextrously navigate codes that range from the puzzling to the vehemently punitive. Like every actress she’s had to confront misogyny. But she has options that previous generations did not.\n\nThe speech she gave at the 2015 UN women’s conference began in rousing, declamatory mode: “I am proud to be a woman and a feminist”; moved to personal narrative (this part grounded in the story of how she organised her campaign against that sexist television ad at age 11); then built up to inspirational political exhortation. “It is said that girls with dreams become women with vision. May we empower each other to carry out this vision, because it isn’t enough to simply talk about equality, one must believe in it, and it isn’t enough to believe in it, one must work for it.” May the work recommence once the £32m wedding is done.\n\n• On Michael Jackson by Margo Jefferson is published by Granta.\n\n", "images": ["https://i.guim.co.uk/img/media/cede039b2bbf7baa72e6d4431980e43616e0e71f/0_0_3482_2089/master/3482.jpg?width=300&quality=85&auto=format&fit=max&s=6a820e1441e346a0020d854a6d7940d4", "https://i.guim.co.uk/img/media/58ab713c1bf963e71dc36a07514cb1c0a7d50456/126_310_3374_2024/master/3374.jpg?width=300&quality=85&auto=format&fit=max&s=822537e78f200784fbe100552ac3e2b2", "https://i.guim.co.uk/img/media/fa03b291c04241ea0aac0e65fc240fa9ab3a3d38/29_150_3119_1871/master/3119.jpg?width=300&quality=85&auto=format&fit=max&s=84210a9bcf4aa68f64ddebd23b4b3383", "https://i.guim.co.uk/img/media/cae6ba8028607a18b7de3f5c9d07177cda709789/0_91_2107_1264/master/2107.jpg?width=300&quality=85&auto=format&fit=max&s=cdb9511a10d2726322938c692a688498", "https://i.guim.co.uk/img/media/e997c4f483350534ad417f9c483604d3c8aab4ed/0_171_4640_2784/master/4640.jpg?width=300&quality=85&auto=format&fit=max&s=6793bf13833c99c5a1155dafc89ed061", "https://uploads.guim.co.uk/2017/10/09/Simon-Jenkins,-L.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Monarchy%2CBooks%2CRoyal+wedding+2018%2CUK+news%2CMeghan%2C+Duchess+of+Sussex%2CCulture%2CRace%2CWeddings%2CLife+and+style%2CWorld+news", "https://i.guim.co.uk/img/media/03d04f1bce511998bb84872a425528a50fdc5f23/1414_812_2249_2219/master/2249.jpg?width=300&quality=85&auto=format&fit=max&s=ca48f965defe99a8b0d57b6bad69af68", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/cae6ba8028607a18b7de3f5c9d07177cda709789/0_91_2107_1264/master/2107.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b801ef5cd8e4396ea079e9d83948ca", "https://i.guim.co.uk/img/media/82f3c5a9ca8b05a2222fe19dcb40c46b2cd39ab0/594_228_1355_1693/master/1355.jpg?width=300&quality=85&auto=format&fit=max&s=99e4d7c8eac79d732fa5c65ce8c86578"], "top_img": "https://i.guim.co.uk/img/media/cae6ba8028607a18b7de3f5c9d07177cda709789/0_91_2107_1264/master/2107.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b801ef5cd8e4396ea079e9d83948ca", "keywords": [], "authors": ["Margo Jefferson", "Simon Jenkins", "Owen Jones"], "canonical_link": "https://www.theguardian.com/books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson", "title": "No Cinderella: Margo Jefferson on the real Meghan Markle", "meta_data": {"description": "She’s educated, divorced, a woman of colour, a feminist – and a radical addition to the royal family. Will she revolutionise the House of Windsor?", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Margo Jefferson", "thumbnail": "https://i.guim.co.uk/img/media/cae6ba8028607a18b7de3f5c9d07177cda709789/0_91_2107_1264/master/2107.jpg?width=620&quality=85&auto=format&fit=max&s=f91d1df03ffabf43f478c7fea4803832", "keywords": "Monarchy,Books,Royal wedding 2018,UK news,Meghan, Duchess of Sussex,Culture,Race,Weddings,Life and style,World news", "news_keywords": "Monarchy,Books,Royal wedding 2018,UK news,Meghan, Duchess of Sussex,Culture,Race,Weddings,Life and style,World news", "og": {"url": "http://www.theguardian.com/books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson", "image": "https://i.guim.co.uk/img/media/cae6ba8028607a18b7de3f5c9d07177cda709789/0_91_2107_1264/master/2107.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b801ef5cd8e4396ea079e9d83948ca", "description": "She’s educated, divorced, a woman of colour, a feminist – and a radical addition to the royal family. Will she revolutionise the House of Windsor?", "type": "article", "title": "No Cinderella: Margo Jefferson on the real Meghan Markle", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/margo-jefferson", "publisher": "https://www.facebook.com/theguardian", "section": "UK news", "published_time": "2018-05-05T07:00:45.000Z", "tag": "Monarchy,Books,Royal wedding 2018,UK news,Meghan, Duchess of Sussex,Culture,Race,Weddings,Life and style,World news", "modified_time": "2020-01-09T11:57:30.000Z"}, "al": {"ios": {"url": "gnmguardian://books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson", "iphone": "gnmguardian://books/2018/may/05/meghan-markle-royal-wedding-margo-jefferson?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/cae6ba8028607a18b7de3f5c9d07177cda709789/0_91_2107_1264/master/2107.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=878ec95e9ff0b79b73747182c348cf3d", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1525449600.0, "source": "http://www.theguardian.com", "summary": ""}