{"url": "https://www.foxnews.com/food-drink/anthony-bourdains-death-celebrity-chefs-in-complete-shock", "text": "The restaurant world mourned the loss of chef and television personality Anthony Bourdain following his reported suicide Friday morning.\n\nCNN confirmed news that Bourdain, 61, was found unresponsive by close friend and French chef Eric Ripert in a hotel in France. The network said he was working on an upcoming episode of his show “Anthony Bourdain: Parts Unknown.”\n\nWHO IS ERIC RIPERT? 3 THINGS TO KNOW ABOUT THE FAMED FRENCH CHEF\n\nCelebrity chefs and industry insiders reacted with shock to news of Bourdain’s passing, with Ripert himself sharing a statement with the New York Times, and later, to Twitter.\n\n“Anthony was a dear friend,” Ripert, told The New York Times. “He was an exceptional human being, so inspiring and generous. One of the great storytellers of our time who connected with so many. I wish him peace. My love and prayers are with his family, friends and loved ones.”\n\nJosé Andrés, a friend of Bourdain’s who appeared as a guest on “No Reservations,” “Parts Unknown” and also served as a guest judge on “The Taste,” added that he would always keep Bourdain in his heart.\n\n“My friend, I know you are on a Ferry going to somewhere amazing … you still had so many places to show us, whispering to our souls the great possibilities beyond what we could see with our own eyes … you only saw beauty in all people. You will always travel with me.”\n\nNigella Lawson and Ludo Lefebvre, Bourdain’s co-judges on ABC’s “The Taste,” both tweeted that they were \"heartbroken\" to learn of his death, with Nigella saying she would be taking a break from Twitter as a result, and Lefebvre sharing a photo of a spoon tattoo Bourdain and he shared.\n\n“Heartbroken to hear about Tony Bourdain’s death,” Lawson wrote. “Unbearable for his family and girlfriend. Am going off twitter for a while.”\n\n\"I am forever indebted to this passionate great man,\" wrote Lefebvre.\n\nRestaurateur Marcus Samuelsson, who also appeared as a coach/judge alongside Bourdain on \"The Taste,\" added that Bourdain would be \"missed terribly\" and shared the telephone number of a suicide hotline, along with many other mourners.\n\nRestaurateur and “Hell’s Kitchen” star Gordon Ramsay stated that he was “stunned and saddened by the loss” of Bourdain.\n\n“Remember that help is only a phone call away,” he added, also including the number of a suicide hotline.\n\nEmeril Lagasse said he was \"shocked and extremely saddened,\" calling Bourdain an inspiration as well as \"a mentor, a friend, a father and an incredible chef.\"\n\n“Bizarre Foods” host Andrew Zimmern, who, like Bourdain, has had multiple food docuseries on the Travel Channel, called Bourdain a “true friend,\" and said he'd be wearing a pair of Bourdain's boots Friday in honor of the chef.\n\n“A piece of my heart is truly broken this morning. And the irony, the sad cruel irony is that the last year he’d never been happier. The rest of my heart aches for the 3 amazing women he left behind. Tony was a symphony. I wish everyone could have seen all of him. A true friend.”\n\n“Iron Chef” star Michael Symon added that he was “in complete shock” over the news.\n\n\"RIP Tony Bourdain ...Wtf ...in complete shock ... loss for words,\" Symon wrote Friday morning.\n\nFood Network's Tyler Florence added simply that he was \"shattered\" by the news.\n\nAs a guest judge on “Top Chef,” Bourdain was also mourned by its stars, including chef and restaurateur Tom Colicchio and cookbook author and TV host Padma Lakshmi.\n\nColiccio tweeted that for Bourdain, resting in peace was “doubtful” as Bourdain’s “restless spirit will roam the earth in search of justice, truth and a great bowl of noodles.”\n\nLakshmi added that she was “in shock and devastated” over losing one of the wittiest people she knew.\n\n\n\nTV personality and “Top Chef” contestant Carla Hall, formerly of “The Chew,” called Bourdain a “beloved presence in the culinary community” and shared the number of a suicide hotline.\n\nBaker and \"Cake Boss\" star Buddy Valastro also wrote that he was \"gutted\" by Bourdain's passing, and referred those in need of help to the number of a suicide hotline.\n\nRestaurateur David Chang, also the host of Netflix’s “Ugly Delicious,” Instagrammed only a black square alongside the lyrics of the Bonnie ‘Prince’ Billy song “I See a Darkness.”\n\nRenowned chef and cookbook author Thomas Keller said Bourdain's work made the world a \"kinder, more connected place\" and sent his love to Bourdain's family and fans.\n\nThe Travel Channel, which aired Bourdain’s “No Reservations” and “The Layover,” mourned the loss of a “global ambassador” and said his presence will be missed.\n\n“We are stunned and deeply saddened to hear that the world is now without its global ambassador, Anthony Bourdain. He was an incredible talent who shows us beautiful, gritty, complicated and delicious places in every corner of the world. His wit and perspective will be missed. Our thoughts are with his family at this difficult time.”\n\nA number of food critics and reporters were also shocked and saddened at Bourdain's death.\n\n“I loved that Bourdain didn't do a cooking show, he did a culture show. It taught how to think and feel, and how to empathize,” wrote New York Times wine critic Eric Asimov.\n\nKat Kinsman, an author and food editor for Extra Crispy, urged that those in the restaurant industry, specifically, should “be kind to yourself and one another.” She also directed industry workers to a website which shares resources for restaurant workers suffering from stress or mental health issues.\n\nThe Culinary Institute of America also mourned the loss of Bourdain, a graduate of the CIA class of 1978, and praised him sharing his love of food with the world.\n\n\"The CIA is deeply saddened to learn of the passing Anthony Bourdain '78, renowned chef, author, and TV personality. He opened the world of food and different cultures to all through his brilliant storytelling,\" the culinary school wrote.", "images": ["https://static.foxnews.com/foxnews.com/content/uploads/2019/07/fox-news-lifestyle_fox-news-lifestyle.png", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/tiger-cow-2-Jam-Press.jpg?ve=1&tl=1", "http://media2.foxnews.com/BrightCove/694940094001/2018/06/08/694940094001_5795342265001_5795330328001-vs.jpg", "https://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/06/08/931/524/694940094001_5795342265001_5795330328001-vs.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/Tunnel2Towers-on-2020-04-15-at-10.21.00_05_58_13.Still001.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/01/270/152/PlantMillennialIstock.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/Cuomo.png?ve=1&tl=1"], "top_img": "http://media2.foxnews.com/BrightCove/694940094001/2018/06/08/694940094001_5795342265001_5795330328001-vs.jpg", "keywords": [], "authors": ["Michael Bartiromo"], "canonical_link": "https://www.foxnews.com/food-drink/anthony-bourdains-death-celebrity-chefs-in-complete-shock", "title": "Anthony Bourdain's death: Celebrity chefs 'in complete shock'", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0, initial-scale=1.0", "description": "Chefs and admirers across the world are mourning the loss of chef and television personality Anthony Bourdain following his reported suicide Friday morning.", "prism.channel": "fnc", "prism.section": "food-drink", "prism.aggregationType": "subsection", "pagetype": "article", "content-creator": "tiger", "dc.creator": "Michael Bartiromo", "dc.title": "Anthony Bourdain's death: Celebrity chefs 'in complete shock'", "dcterms.abstract": "Chefs and admirers across the world are mourning the loss of chef and television personality Anthony Bourdain following his reported suicide Friday morning.", "dc.type": "Text.Article", "dc.description": "Chefs and admirers across the world are mourning the loss of chef and television personality Anthony Bourdain following his reported suicide Friday morning.", "dc.language": "en-US", "dc.publisher": "Fox News", "dc.format": "text/html", "dc.identifier": "urn:uri:base64:adab8ea6-7320-517c-b90c-68850ea91200", "dc.source": "Fox News", "dc.date": "2018-06-08", "dcterms.created": "2018-06-08T07:53:16-04:00", "dcterms.modified": "2018-06-08T16:19:05-04:00", "og": {"title": "Anthony Bourdain's death: Celebrity chefs 'in complete shock'", "description": "Chefs and admirers across the world are mourning the loss of chef and television personality Anthony Bourdain following his reported suicide Friday morning.", "type": "article", "image": "http://media2.foxnews.com/BrightCove/694940094001/2018/06/08/694940094001_5795342265001_5795330328001-vs.jpg", "url": "https://www.foxnews.com/food-drink/anthony-bourdains-death-celebrity-chefs-in-complete-shock", "site_name": "Fox News"}, "robots": "noarchive, noodp", "twitter": {"card": "summary_large_image", "site": "@foxnews", "title": "Anthony Bourdain's death: Celebrity chefs 'in complete shock'", "description": "Chefs and admirers across the world are mourning the loss of chef and television personality Anthony Bourdain following his reported suicide Friday morning.", "image": "https://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/06/08/1024/512/694940094001_5795342265001_5795330328001-vs.jpg?ve=1&tl=1", "url": "https://www.foxnews.com/food-drink/anthony-bourdains-death-celebrity-chefs-in-complete-shock"}, "fb": {"app_id": 116027085089150}, "article": {"opinion": "false"}, "classification": "/FOX NEWS/FOOD DRINK/FOOD/Celebrity Chefs,/FOX NEWS/FOOD DRINK", "classification-isa": "celebritychefs,food-drink,fooddrink"}, "movies": [], "publish_date": null, "source": "https://www.foxnews.com", "summary": ""}