{"url": "https://web.archive.org/web/20070911181319/http://pol.moveon.org/petraeus.html", "text": "General Petraeus or General Betray Us?\n\nCooking the books for the White House\n\nGeneral Petraeus is a military man constantly at war with the facts. In 2004, just before the election, he said there was “tangible progress“ in Iraq and that “Iraqi leaders are stepping forward.”\n\nWashington Post, “Battling for Iraq,” by David H. Petraeus. 9/26/04 (see below)\n\nAnd last week Petraeus, the architect of the escalation of troops in Iraq , said ”We say we have achieved progress, and we are obviously going to do everything we can to build on that progress.”\n\nThe Australian, “Surge Working: Top US General,” by Dennis Shanahan. 8/31/07\n\nEvery independent report on the ground situation in Iraq shows that the surge strategy has failed.\n\nGAO report, 9/4/07\n\nNIE report, 8/23/07\n\nJones report, CSIS, 9/6/07\n\nYet the General claims a reduction in violence. That’s because, according to the New York Times, the Pentagon has adopted a bizarre formula for keeping tabs on violence. For example, deaths by car bombs don’t count.\n\n“Time to Take a Stand,” by Paul Krugman. 9/7/07\n\nThe Washington Post reported that assassinations only count if you're shot in the back of the head -- not the front.\n\n“Experts Doubt Drop in Violence in Iraq,” by Karen DeYoung. 9/6/07 l\n\nAccording to news reports, there have been more civilian deaths and more American soldier deaths in the past three months than in any other summer we’ve been there.\n\nThe Associated Press, “Violence Appears to Be Shifting from Baghdad.” 8/25/07\n\nNational Public Radio, “Statistics the Weapon of Choice in Surge Debate,” by Guy Raz. 9/6/07\n\nAssociated Press, “Key Figures About Iraq Since the War Began in 2003.” 9/5/07\n\nWe'll hear of neighborhoods where violence has decreased. But we won't hear that those neighborhoods have been ethnically cleansed.\n\nNewsweek, “Baghdad’s New Owners,” by Babak Dehghanpisheh and Larry Kaplow, 9/10/07\n\nIbid from the AP, “Violence Appears to be Shifting From Baghdad”\n\nMcClatchy, “Despite Violence Drop, Officers See Bleak Future for Iraq,” by Leila Fadel. 8/15/07\n\nThe New York Times, “More Iraqis Said to Flee Since Troop Rise,” by James Glanz and Stephen Farrell. 8/24/07\n\nMost importantly, General Petraeus will not admit what everyone knows; Iraq is mired in an unwinnable religious civil war.\n\nWe may hear of a plan to withdraw a few thousand American troops.\n\nThe New York Times, “Petraeus, Seeing Gains in Iraq as Fragile, is Wary of Cuts,” by David Sanger and David Cloud, 9/7/07\n\nThe Washington Post, “Petraeus Open to Pullout of One Brigade,” by Robin Wright and Jonathan Weisman. 9/7/07.\n\nBut we won’t hear what Americans are desperate to hear: a timetable for withdrawing all our troops. General Petraeus has actually said American troops will need to stay in Iraq for as long as ten years.\n\nThe Hill, “Rep. Schakowsky: Petraeus hints at decade-long Iraq presence,” by Patrick FitzGerald. 8/10/07\n\nToday before Congress and before the American people, General Petraeus is likely to become General Betray Us.\n\nThe Washington Post, 9/26/04\n\nBattling for Iraq\n\n\n\nBYLINE: David H. Petraeus\n\n\n\nSECTION: Editorial; B07\n\n\n\nLENGTH: 1239 words\n\n\n\nDATELINE: BAGHDAD\n\nHelping organize, train and equip nearly a quarter-million of Iraq's security forces is a daunting task. Doing so in the middle of a tough insurgency increases the challenge enormously, making the mission akin to repairing an aircraft while in flight -- and while being shot at. Now, however, 18 months after entering Iraq, I see tangible progress. Iraqi security elements are being rebuilt from the ground up.\n\nThe institutions that oversee them are being reestablished from the top down. And Iraqi leaders are stepping forward, leading their country and their security forces courageously in the face of an enemy that has shown a willingness to do anything to disrupt the establishment of the new Iraq.\n\nIn recent months, I have observed thousands of Iraqis in training and then watched as they have conducted numerous operations. Although there have been reverses -- not to mention horrific terrorist attacks -- there has been progress in the effort to enable Iraqis to shoulder more of the load for their own security, something they are keen to do. The future undoubtedly will be full of difficulties, especially in places such as Fallujah. We must expect setbacks and recognize that not every soldier or policeman we help train will be equal to the challenges ahead.\n\nNonetheless, there are reasons for optimism. Today approximately 164,000 Iraqi police and soldiers (of which about 100,000 are trained and equipped) and an additional 74,000 facility protection forces are performing a wide variety of security missions. Equipment is being delivered. Training is on track and increasing in capacity. Infrastructure is being repaired. Command and control structures and institutions are being reestablished.\n\nMost important, Iraqi security forces are in the fight -- so much so that they are suffering substantial casualties as they take on more and more of the burdens to achieve security in their country. Since Jan. 1 more than 700 Iraqi security force members have been killed, and hundreds of Iraqis seeking to volunteer for the police and military have been killed as well.\n\nSix battalions of the Iraqi regular army and the Iraqi Intervention Force are now conducting operations. Two of these battalions, along with the Iraqi commando battalion, the counterterrorist force, two Iraqi National Guard battalions and thousands of policemen recently contributed to successful operations in Najaf. Their readiness to enter and clear the Imam Ali shrine was undoubtedly a key factor in enabling Grand Ayatollah Ali Sistani to persuade members of the Mahdi militia to lay down their arms and leave the shrine.\n\nIn another highly successful operation several days ago, the Iraqi counterterrorist force conducted early-morning raids in Najaf that resulted in the capture of several senior lieutenants and 40 other members of that militia, and the seizure of enough weapons to fill nearly four 71/2-ton dump trucks.\n\nWithin the next 60 days, six more regular army and six additional Intervention Force battalions will become operational. Nine more regular army battalions will complete training in January, in time to help with security missions during the Iraqi elections at the end of that month.\n\nIraqi National Guard battalions have also been active in recent months. Some 40 of the 45 existing battalions -- generally all except those in the Fallujah-Ramadi area -- are conducting operations on a daily basis, most alongside coalition forces, but many independently. Progress has also been made in police training. In the past week alone, some 1,100 graduated from the basic policing course and five specialty courses. By early spring, nine academies in Iraq and one in Jordan will be graduating a total of 5,000 police each month from the eight-week course, which stresses patrolling and investigative skills, substantive and procedural legal knowledge, and proper use of force and weaponry, as well as pride in the profession and adherence to the police code of conduct.\n\nIraq's borders are long, stretching more than 2,200 miles. Reducing the flow of extremists and their resources across the borders is critical to success in the counterinsurgency. As a result, with support from the Department of Homeland Security, specialized training for Iraq's border enforcement elements began earlier this month in Jordan.\n\nRegional academies in Iraq have begun training as well, and more will come online soon. In the months ahead, the 16,000-strong border force will expand to 24,000 and then 32,000. In addition, these forces will be provided with modern technology, including vehicle X-ray machines, explosive-detection devices and ground sensors.\n\nOutfitting hundreds of thousands of new Iraqi security forces is difficult and complex, and many of the units are not yet fully equipped. But equipment has begun flowing. Since July 1, for example, more than 39,000 weapons and 22 million rounds of ammunition have been delivered to Iraqi forces, in addition to 42,000 sets of body armor, 4,400 vehicles, 16,000 radios and more than 235,000 uniforms.\n\nConsiderable progress is also being made in the reconstruction and refurbishing of infrastructure for Iraq's security forces. Some $1 billion in construction to support this effort has been completed or is underway, and five Iraqi bases are already occupied by entire infantry brigades.\n\nNumbers alone cannot convey the full story. The human dimension of this effort is crucial. The enemies of Iraq recognize how much is at stake as Iraq reestablishes its security forces. Insurgents and foreign fighters continue to mount barbaric attacks against police stations, recruiting centers and military installations, even though the vast majority of the population deplores such attacks. Yet despite the sensational attacks, there is no shortage of qualified recruits volunteering to join Iraqi security forces. In the past couple of months, more than 7,500 Iraqi men have signed up for the army and are preparing to report for basic training to fill out the final nine battalions of the Iraqi regular army. Some 3,500 new police recruits just reported for training in various locations. And two days after the recent bombing on a street outside a police recruiting location in Baghdad, hundreds of Iraqis were once again lined up inside the force protection walls at another location -- where they were greeted by interim Prime Minister Ayad Allawi.\n\nI meet with Iraqi security force leaders every day. Though some have given in to acts of intimidation, many are displaying courage and resilience in the face of repeated threats and attacks on them, their families and their comrades. I have seen their determination and their desire to assume the full burden of security tasks for Iraq.\n\nThere will be more tough times, frustration and disappointment along the way. It is likely that insurgent attacks will escalate as Iraq's elections approach. Iraq's security forces are, however, developing steadily and they are in the fight. Momentum has gathered in recent months. With strong Iraqi leaders out front and with continued coalition -- and now NATO -- support, this trend will continue. It will not be easy, but few worthwhile things are.\n\nThe writer, an Army lieutenant general, commands the Multinational Security Transition Command in Iraq. He previously commanded the 101st Airborne Division, which was deployed in Iraq from March 2003 until February 2004.", "images": ["https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/bnav_news_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/nav_signup_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/nav_donate_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/nav_about_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/navrule.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/bnav_contact_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/bnav_home_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/bnav_about_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/PetraeusNYTad.jpg", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/nav_campaigns_static.gif", "https://web.archive.org/web/20070911181319im_/http://pol.moveon.org/images/home/nav_success_static.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "MoveOn.org Political Action: General Petraeus or General Betray Us?", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}