{"url": "www.celebritynetworth.com/richest-celebrities/actors/mar-anthony-net-worth/", "text": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur and producer who has a net worth of $80 million dollars. Marc Anthony is most probably most widely recognized for his music career. Marc is the highest selling salsa artist in history and has won numerous awards, including several Grammy Awards and Latin Grammy Awards. To date, Marc has sold more than 30 million albums worldwide. He was born Marco Antonio Muniz in New York City, New York, in 1968. His father Philipe Muniz was a musician and Anthony would join him in playing for friends and family. His mother Guillerminna was a housewife and mother of seven children, of which, Anthony was the youngest. Anthony was married to Dayanara Torres, a former Miss Universe, from 2000-2004. They have two sons together, Ryan Adrian and Cristian Marcus. He was then married to Jennifer Lopez for seven years. They are the parents of twins, Emme Maribel Muniz and Maximillian David Muniz. Anthony also has a daughter, Arianna, from a previous relationship.\n\nOutside of music, Marc has appeared in several popular movies including Hackers, Man on Fire, In the Time of Butterflies, The Substitute and more. He has also performed on stage in the musical, The Capeman, and has appeared on a couple of episodes of HawthoRNe on TNT. He is also an executive producer of HawthoRNe which ran from 2009-2011. Along with his acting career, Marc Anthony also performs as a recording artist and songwriter, as well as a backing vocalist for other artists, such as, Ann Marie, Menudo, Latin Rascals and others. He is known for his Latin style, salsa and freestyle. In 1993, Anthony released Otra Notra, a song sang in Spanish. He has also recorded many albums, such as, When the Night is Over, Todo a su Tiempo, Contra la Corriente, Libre, El Contante and more. After his recording of Contra la Corriente, Anthony did a television special on HBO, \"Marc Anthony: The Concert from Madison Square Garden.\" His first single hit was Y Hubo Alguien, and was ranked as number one on the Billboard Hot Latin Tracks Chart. At this time he was signed to RMM records, but, in 1999 he left RMM and for Sony. He and Jennifer Lopez recorded a duet on her album, \"On the 6.\" In 2001, his album \"Libre\" became gold and was at the number one place on the Billboard Top Latin Albums Chart for fourteen weeks. In July 2018, Marc purchased a $19 million mansion in Florida. He also owns a multi-million dollar property in Tarzana, California.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1057081139/?value=0&guid=ON&script=0", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/mar-anthony-net-worth/", "title": "Marc Anthony Net Worth", "meta_data": {"description": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur and producer who has a net worth of", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "cnw_share_fb_count": 54, "cnw_share_tw_count": 46, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Marc Anthony Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/mar-anthony-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "site_name": "Celebrity Net Worth", "description": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur and producer who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2018-07-21T19:29:30+00:00", "published_time": "2009-12-21T04:47:09+00:00", "section": "Actors", "tag": "richest singers"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "title": "Marc Anthony Net Worth", "description": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur and producer who has a net worth of"}}, "movies": [], "publish_date": 1261370829.0, "source": "http://www.celebritynetworth.com", "summary": ""}