{"url": "http://www.iheartradio.ca/news/listen-christina-aguilera-demi-lovato-debut-fall-in-line-1.3822763", "text": "Fans have been showing some major concern for Micheal Bublé’s wife Luisana Lopilato due to something that happened while they were on live together. Luisana interrupted Michael and he immediately elbowed her in the side and then grabbed her arm towards him. She stopped talking and apologized right away before he continued. She made a statement on her Instagram story\n\nSelena Gomez is going after Chinese and American software companies and distributors for allegedly using her image in a mobile game. In a lawsuit filed April 14 in Los Angeles, the pop star claims her likeness appears in Clothes Forever - Styling Game, a mobile game where users can be celebrity stylists. She is seeking at least $10 million U.S. in damages.\n\nSo many different celebrities have gotten together to help fight COVID in the best way - The ALL IN Challenge is a website you can go to and pay money to have your name put in a draw to win crazy cool experiences like co hosting the Ellen show and having Justin Bieber show up at your house and sing One Less Lonely Girl!\n\nThere is going to be a surge of new music once this pandemic is all over due to so many artists working away at home. Ariana Grande showed off that she now has a studio set up next to her bed saying its always been something that she’s wanted - and said “it was nice knowing you sleep”\n\nLizzo also showed off her home studio on instagram live and said she has been working on new music from home.\n\nSam Smith and Demi Lovato will release a song tomorrow called “I’m Ready” The two of them have been promoting the track with photos of them dressed up in Olympic gear.\n\nMore artists have been added to the lineup for One World: Together at Home, including Celine Dion, Shawn Mendes and also Alicia Keys, Camila Cabello, Jennifer Lopez, LL Cool J, Pharrell Williams, Sam Smith, Taylor Swift and Usher.\n\nOne World: Together At Home will be hosted by late night hosts Jimmy Fallon, Jimmy Kimmel and Stephen Colbert and will air starting at 8pm eastern tomorrow night. It will also air on CTV, CTV2, TSN, MUCH, MTV and a stream will be available to listen to on the iHeartRadio app.", "images": ["http://www.iheartradio.ca/image/policy:1.3822765:1548372086/christinademi.jpg?f=default&$p$f=e71828b", "https://www.facebook.com/tr?id=490064968479396&ev=PageView&noscript=1", "http://www.iheartradio.ca/img/common/ph-16x9.gif", "http://www.iheartradio.ca/img/common/ph-1x1.gif", "http://www.iheartradio.ca/logger/p.gif?a=1.3822763&d=/2.4828/2.5978&template=base.StandardArticle", "http://www.iheartradio.ca/image/policy:1.3822765:1548372086/christinademi.jpg?a=16%3A9&w=1000&$p$a$w=b274e0a"], "top_img": "http://www.iheartradio.ca/image/policy:1.3822765:1548372086/christinademi.jpg?a=16%3A9&w=1000&$p$a$w=b274e0a", "keywords": [], "authors": ["Bell Média"], "canonical_link": "https://www.iheartradio.ca/news/listen-christina-aguilera-demi-lovato-debut-fall-in-line-1.3822763", "title": "LISTEN: Christina Aguilera, Demi Lovato Debut 'Fall In Line'", "meta_data": {"og": {"title": "LISTEN: Christina Aguilera, Demi Lovato Debut 'Fall In Line'", "description": "The collaboration delivers a powerful message.", "image": "http://www.iheartradio.ca/image/policy:1.3822765:1548372086/christinademi.jpg?a=16%3A9&w=1000&$p$a$w=b274e0a", "sitename": "iHeartRadio", "type": "article", "url": "https://www.iheartradio.ca/news/listen-christina-aguilera-demi-lovato-debut-fall-in-line-1.3822763"}, "description": "The collaboration delivers a powerful message.", "fb": {"pages": 428221510004}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "author": "Bell Média", "locale": "en", "brand-id": "radio", "station-id": "radio", "site-name": "Radio.d", "ajax-timeout": 6000, "apple-itunes-app": "app-id=290638154"}, "movies": [], "publish_date": null, "source": "http://www.iheartradio.ca", "summary": ""}