{"url": "www.etonline.com/news/195783_sofia_richie_11_things_you_need_to_know_about_the_model_rumored_to_be_dating_justin_bieber", "text": "Ever since Sofia Richie made her debut on Justin Bieber's Instagram, the 17-year-old blond beauty has garnered a ton of attention.\n\nThe two sparked romance rumors earlier this month when they were spotted holding hands on the beach in Laguna Beach, California, enjoying a morning hike in Los Angeles and later traveling to Japan together as part of the pop star's Purpose World Tour.\n\n\n\nWATCH: Justin Bieber and Sofia Richie Are Instagram Official!\n\nSo, who is the new lucky lady that's caught the 22-year-old \"Sorry\" singer's eye? We've rounded up 11 things you need to know about Sofia!\n\n\n\n1. Her Family Is Famous\n\n\n\nSofia, who turns 18 on Aug. 24, is the daughter of legendary singer Lionel Richie and his ex-wife, Diana Alexander. Her sister is fashionista and reality star Nicole Richie, who rose to fame by starring in The Simple Life with Paris Hilton. Sofia also has one brother, 22-year-old Miles.\n\n\n\n2. She Once Snapped a Photo With Justin's Famous Ex-Girlfriend, Selena Gomez\n\n\n\nStar Traks Photo\n\nBack in 2009, Sofia attended Selena's debut concert at The Roxy in West Hollywood, California, with her sister and brother-in-law, Joel Madden.\n\nIronically, Selena was one of the people to publicly shade Justin and Sofia's relationship. It all went down after Justin noticed his fans were leaving cruel comments about Sofia on his Instagram. He warned followers that he was going to make his account private if they continued to harass his new love interest. Selena weighed in, leaving a few messages in the comments section before Justin ultimately deactivated his account. She has since apologized over Snapchat, however. Read more on that HERE.\n\n\n\nWATCH: Justin Bieber Deletes Instagram Account Amid Feuds\n\n\n\n3. Her Appearances on Candidly Nicole Were Pretty Adorable\n\n\n\nNicole's VH1 reality show, Candidly Nicole, was filled with cameos by Sofia, who frequently acted like the more responsible Richie gal, despite the fact she's 17 years younger than her sister. One of the best moments from the series was when Sofia pushed a wine-drinking Nicole around in a grocery store shopping cart. \"I don't feel like we'll ever be equals,\" Sofia told Elle magazine back in 2014. \"Nicole will always give me guidance as a big sister. She tells me every day that she's mad that I'm growing up.\"\n\n\n\n4. She's a Model\n\n\n\nSofia began modeling in 2014, and has already appeared in a number of fashion magazine editorials, including Elle, Vanity Fair Italia, Vogue China, Nylon, Lady Gunn,Unleash'd, ES and Who What Wear. She was also the face of Madonna's Material Girl fall 2015 collection.\n\n\n\nWATCH: Are Justin Bieber and Selena Gomez Feuding Over His New Romance With Sofia Richie?\n\n\n\n5. She's Tight With Kylie Jenner's Squad\n\n\n\n\"My girls,\" Sofia captioned a recent black-and-white pic of herself hanging out with the 19-year-old reality star and pals Jordyn Woods and Camila Morrone. She's also close friends with fellow model Bella Hadid.\n\n\n\n6. She's Fearless\n\n\n\nLike Justin, Sofia is also a fan of action sports. Check her out sporting red-hot motocross gear while tearing up the race track on a dirt bike. Go, girl!\n\n\n\n7. Her Brother Is Her Best Friend\n\n\n\nAside from sweet selfies and modeling snapshots, Sofia is always sharing adorable throwback pics of her and her brother to Instagram.\n\n\n\nWATCH: Sofia Richie Continues to Share Personal Pics as Justin Bieber Deletes His Instagram Account\n\n\n\n8. She's a Dog Lover\n\n\n\nSofia is mom to an adorable French bulldog named Cairo Richie. Her \"little nugget\" even has his own Instagram!\n\n\n\n9. Golf Isn't Her Strong Suit\n\n\n\nThe model isn't afraid to publicly embrace her flaws. \"I've honestly never been worse at something in my life,\" she joked in a caption of a photo taken on a golf course.\n\n\n\nNEWS: Justin Bieber Gets Adorable New Puppy Amid Sofia Richie Relationship Drama\n\n\n\n10. Braids Are Her Go-To 'Do\n\n\n\nThe California native constantly sports cool variations of the trendy hairstyle, showing them off over social media. \"Instagram is just a way of showing the world a little piece of what you're like,\" she told POPULAR magazine in April 2015. \"You're not really giving everything away -- it's not like you're making videos every second; you're just giving a little picture of what's happening in your life. No one can really completely figure it out.\"\n\n\n\n11. She Once Dreamed of Becoming a Pop Star\n\n\n\n\"When I was 13, I was saying that I wanted to be signed to a label,\" Sofia explained to ET's Deidre Behar during an exclusive sit-down interview in March. \"I was begging my dad to get me signed with somebody. I'm glad he held me off, because I really found myself and found what I truly wanted to do.\"\n\n\n\nWATCH: Sofia Richie Says She's 'Very Thankful' Dad Lionel Denied Her a Record Deal at 13", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2016-08/1280_sofia_richie_selena_gomez_3676F473024.jpg?itok=JHx1YVXX", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-03/1280_et_intv_sofiarichie_031716.png?itok=DFiiB381"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-03/1280_et_intv_sofiarichie_031716.png?itok=DFiiB381", "keywords": [], "authors": ["Desiree Murphy"], "canonical_link": "https://www.etonline.com/news/195783_sofia_richie_11_things_you_need_to_know_about_the_model_rumored_to_be_dating_justin_bieber", "title": "11 Things You Didn't Know About Sofia Richie, Justin Bieber's New Girl", "meta_data": {"article": {"opinion": "false"}, "title": "11 Things You Didn't Know About Sofia Richie, Justin Bieber's New Girl | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/news/195783_sofia_richie_11_things_you_need_to_know_about_the_model_rumored_to_be_dating_justin_bieber", "title": "11 Things You Didn't Know About Sofia Richie, Justin Bieber's New Girl", "description": "Get to know the 17-year-old model Justin Bieber is rumored to be dating!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-03/1280_et_intv_sofiarichie_031716.png?itok=DFiiB381", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Get to know the 17-year-old model Justin Bieber is rumored to be dating!", "title": "11 Things You Didn't Know About Sofia Richie, Justin Bieber's New Girl", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy", "url": "https://www.etonline.com/news/195783_sofia_richie_11_things_you_need_to_know_about_the_model_rumored_to_be_dating_justin_bieber", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-03/1280_et_intv_sofiarichie_031716.png?itok=DFiiB381"}, "description": "Get to know the 17-year-old model Justin Bieber is rumored to be dating!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Lionel Richie, Selena Gomez, Sofia Richie, Justin Bieber", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.etonline.com", "summary": ""}