{"url": "http://www.brain-sharper.com/entertainment/wwe-wives-yh/", "text": "Professional wrestlers are known for their strength, fearlessness, and ego. These days, it seems that every great wrestler has a beautiful woman supporting them whether they win or lose. Here are some of our favorite wives in the wrestling world. Stephanie McMahon – Triple H What initially began as a scripted relationship blossomed into something real when Hunter Hurst Hemsley, aka Triple H, started a relationship with Stephanie McMahon. The couple first started dating in 2000 and were married by 2003. McMahon and Triple H have now had three daughters together.\n\nAJ Lee – CM Punk We all know the classic WWE love story: Big successful male wrestler meets equally successful female wrestler. The two become an unstoppable wrestling power-couple, get married, retire and have children who also go on to become wrestlers. AJ Lee and CM Punk are well on their way to completing this wrestling love story. The only thing they still need to check off the list is children. Punk and Lee now reside in Chicago, so we figure their house will be full of little wrestlers soon enough!\n\nRebecca Curci – Sean Michaels Prior to tying the knot with WWE legend Sean Michaels, Rebecca Curci was a wrestler in her own right, taking the wrestling alias Nitro Girl. Michaels spotted Nitro Girl and knew he wanted to be with her, despite his reputation as one of the most desirable heartthrobs in all of wrestling. In 1999, the couple eloped to Las Vegas and promptly got married. Since their Vegas marriage, Michaels and Curci have been living a happily married life with two children\n\nBrandi Rhodes – Cody Rhodes Before becoming the female wrestler known as Eden Stiles, Brandi Rhodes was pursuing a career in broadcast journalism. She worked her way up from a news reporter to anchor and eventually became an announcer for the WWE. She first met Cody Rhodes through her job. While she was hesitant at first, not wanting to get involved with a co-worker early in her career, eventually she caved and accepted an invitation to hang out Rhodes. The two have been inseparable ever since.\n\n\n\nMaryse Ouellet – The Miz The Miz and WWE Diva Maryse Ouellet are in love and they want the whole world to know! Maryse and the WWE superstar tied the knot back in February 2014 and have since then loved sharing their romance with the world, constantly posting photos and videos on Instagram, Twitter, and Facebook. After retiring from wrestling in 2011, Maryse now spends most of her time ringside, cheering on her man, coaching him up, and watching The Miz take care of the biz.\n\nKristin Austin – Stone Cold Steve Austin Stone Cold Steve Austin, aka The Texas Rattlesnake, is credited by many for pioneering the golden age of WWE- The Attitude Era. Since beginning his wrestling career in the early 1990s, Stone Cold Steve Austin has had plenty of love interests, relationships, and even three failed marriages. He finally found his stone cold soulmate when he met Kristen Feres. The two have been happily married since 2009 and now split time residing in Marina Del Rey, California, and Tilden, Texas.\n\nMarissa Mazzola – Shane McMahon Shane McMahon boasts an impressive resume as the WWE’s Executive Vice President of Global Media. He is also the son of WWE CEO Vince McMahon, brother of Diva Stephanie, and happens to be in one of the longest standing marriages on our list. McMahon tied the knot with Marissa Mazzola way back on September 14th, 1996 but the couple have been together since high school. They are now happily married, living in New York City with their three sons- Declan, Kenyon, and Rogan.\n\nReby Sky – Matt Hardy Time heals all, and that’s exactly what Matt Hardy needed following his breakup with on again off again ex-girlfriend and WWE Diva, Lita. Eventually, Hardy moved on and found Reby Sky, an aspiring female wrestler who Hardy once trained before the two decided to get married. Their love story has not been simple, however, and involves a couple of domestic disputes and restraining orders. Hardy and Sky have since reconciled and moved on from these issues, realizing what truly matters.\n\nLauryn Laine McBride – Jerry “The King” Lawler Jerry “The King” Lawler has typically used his sense of humor to charm the long list of women he has dated in his lifetime. But none of them stuck with WWE personality until he met Lauryn Laine McBride, who was smitten at the Lawler’s attempts to whoo her. Despite the age difference, McBride said yes to Lawler’s proposal and the two are currently engaged. After three failed marriages, Lawler is hoping this will be the last time he says “I do.”\n\nJackie Gayda-Haas – Charlie Haas The ultimate wrestling power couple, Jackie Gayda and Charlie Haas, tied the knot back in 2005 and have since then added four children to their wrestling squad. Aside from their frequent cameos and appearances in the ring, Haas and Gayda run and operate their own nutrition store in Texas called Custom Muscle Nutrition and Smoothies. Using their remarkable physiques as marketing tools, proving to customers that their products work, it’s no wonder their business is thriving.\n\nNaomi – Jimmy Uso As a talented female wrestler herself, SmackDown Women’s Champion, Naomi, got together with Jimmy Uso, and formed one scary and intimidating couple. Prior to marrying the SmackDown superstar, Naomi starred on the E! reality show, Total Divas. Naomi was unfortunately removed from the show following the news that she married Uso. Naomi is now on the comeback trail following her recovery from some serious injuries she sustained during a battle with the Riott Squad in November 2017.\n\n\n\nLaurel Van Ness – Zack Ryder Up and coming superstar, Zack Ryder has recently taken the WWE by storm, with his girlfriend Chelsea Anne Green by his side every step of the way. Green is also a wrestler, currently trying to make a name for herself in the Global Force Wrestling organization, wrestling under the alias ‘Laurel Van Ness’. The couple have been dating since 2016 with no signs of slowing anytime soon. Ryder has recently been included on the SmackDown roster, giving the couple something to celebrate.\n\nLana – Rusev The WWE’s Lana is actually named Catherine Perry. Before she was slamming opponents in the ring herself, Lana was the manager of Bulgerian wrestler Rusev. While Lana has often taken background role in the double act, with Rusev himself providing the muscle, in recent years she has begun a career of her own inside the ring as a talented and dynamic wrestler. After some time, the pair became more than just business partners and got married in 2016.\n\nSarah Backman – Bo Dallas While Bo Dallas may have spent endless hours in the gym working on his impressive physique, Sarah Backman, the wife of the WWE Raw superstar, is certainly giving him a run for his money. The blonde Swede has also put in some serious work in the weight room and is seeing results. Backman, an eight-time World Arm Wrestling Champion, was recruited to the NXT institution and was on track to becoming a professional wrestler herself. But ultimately, it wasn’t meant to be.\n\nMeredith Whitney – John Layfield While most wrestlers choose to couple up with other wrestlers, announcers, or wrestling managers, John Layfield chose to marry a financial analyst. Meredith Whitney met Layfield back when he went by wrestling aliases Bradshaw and JBL. The two were co-workers on Fox when they began dating one another. It didn’t take long for sparks to fly between the two and they were married by 2005. In 2015, Whitney shut down her business and moved with Layfield to their private residence in Bermuda.\n\nKaren Jarrett – Jeff Jarrett Karen Smedley was, at one point, the wife of the great Olympic medalist, Kurt Angle. Karen left Angle in 2008, and by 2010 she was married to Jeff Jarrett. She took the Jarrett name not only legally but in the ring as well. Today, Jeff and Karen are still happily married with two children. Although she has had a couple of kids, at 45 years young, Karen has somehow maintained the stunning physique she obtained from her days as an exotic dancer.\n\nRenee Young – Dean Ambrose While Dean Ambrose may be the longest running WWE United States Champion of all time, his greater accomplishment is most likely putting a ring on the finger of his dream girl, Renee Young. Renee Young was a journalist when she met Ambrose for an interview. Sparks flew, and the couple instantly wanted more of each other. For the rugged wrestler, it was more that Renee Young’s looks that roped him in. She also has a great sense of humor as an aspiring comedian.\n\nKori Campfield – Kofi Kingston Kofi Kingston is considered by many to be the King of Royal Rumble saves. In 2010 he also became the husband of the beautiful Kori Campfield. The athletic Ghanaian wrestler loves to show off his wife every chance he gets, whether it’s at a WWE event or simply a night out on the town. The married couple share two children together and spend their time between Smackdown events in Tampa, Florida. It seems to be smooth sailing ahead for these lovebirds!\n\nSharmell Sullivan-Huffman – Booker T Following a five-year courtship, Sharmell Sullivan and Booker T got married and decided to assign themselves the titles of King Booker and Queen Sharmell. This duo of wrestling royalty began building a family together in 2005 and retired from wrestling soon after. While their “reign” in the WWE ring may be over, Sullivan and Booker T now rule a whole new domain as parents of twins. Booker T is now attempting to suplex his way into politics, running in the 2019 election for mayor of Houston.\n\nSamantha Rotunda – Bray Wyatt Wingham Lawrence Rotunda, aka Bray Wyatt, married Samantha back in 2012. Their lives seemed to be going according to plan. The couple had been happily married for five years with two children. Everything came crashing to a halt when Samantha found out that Bray had reportedly cheated on her with WWE announcer Jojo Offerman. Feeling abused by his infidelity, Samantha filed for divorce in June 2017. While his personal life may be unstable, Bray Wyatt has remained relevant on WWE Raw.\n\nBrie Bella – Daniel Bryan As half of the Bella Twins duo, Brie Bella chose to marry a fellow professional wrestler in Bryan Danielson, aka Daniel Bryan. Brie didn’t think for a second when Bryan popped the question in 2014. While the Bella Twins may have a reputation as villains inside the ring, its seems as though Bryan brings out the best in Brie. Fans of the Bella Twins also seem to support the wresting couple. In 2017, Brie gave birth to a baby girl named Birdie Joe Danielson.\n\nCatalina Hager – Jack Swagger It came as no surprise to us when Jack Swagger fell in love with Catalina Hager, formerly known as Catalina White. What’s not to love? The beautiful model has been featured in numerous magazines including Maxim, FHM, and Complex Magazine. Meanwhile, Swagger has been signed as a heavyweight to the Bellator MMA promotion in addition to wrestling in the WWE. The couple got married in 2010 and now share two children- a son, Knox Stribling, and a daughter, Presley Pearl.\n\nGiovanna Yannotti – Kurt Angle As one of the biggest household names in all of wrestling, there isn’t a lot that Kurt Angle hasn’t achieved. Angle, a former Olympic gold medalist, came on the WWE scene in 1998. He’s been through two marriages, and his first wife is now married to Jeff Jarrett, another pro wrestler. You won’t see Angle throwing his own pity party, however. He also moved on as well to the beautiful Giovanna Yannotti, marrying the actress in 2012. The two now share three daughters together.\n\nGalina Becker – Roman Reigns Back in his glory days, Roman Reigns, born Leati Joseph Anoa’i, was a king of the campus as a division 1 college football player at Georgia Tech. This is where he met his future wife, Galina Joelle Becker. The couple were engaged for two years before tying the knot in 2014. Not long after their marriage, the couple had a daughter named Joelle and the college sweethearts are still going strong to this day. It truly warms the heart to see such a devoted couple!\n\nWanda Ferraton – Bill Goldberg Back in his prime, there was no name bigger than Goldberg in the WCW. Goldberg dominated anyone and everyone that stood in his way. Following his WCW success, Goldberg wrestled in the WWE for a bit. Goldberg met the woman of his dreams while he was dressed as a twisted version of Santa during filming of the 2005 black comedy horror Christmas film, Santa’s Slay. Wanda Ferraton was a stunt double. The couple now have a son named Gage and reside in California.\n\nPaige – Alberto Del Rio Following rumors of adultery and the bitter, abrupt end of Alberto Del Rio’s marriage to Angela Velkei, the Mexican professional wrestler found a rebound in Saraya-Jade Bevis, also known as the British two-time Divas Champion, Paige. Things seemed to be going great for Paige and Del Rio following the announcement of their engagement in 2016. Unfortunately, the couple called off the engagement in late 2017. We hope the former couple can reconcile and that the break-up won’t shake up their working relationship.\n\n\n\nLauren Hashian – The Rock Can you smell what The Rock is cooking? Lauran Hashian sure can. Most likely “The People’s Champion” is cooking up some Sunday morning pancakes for his family. The couple have been together since 2007 and even have a baby girl together, with another on the way. Dwayne Johnson met Hashian during filming of his 2007 film, The Game Plan. As the daughter of the late drummer for the famous band, Boston, Hashian is a talented singer in her own right.\n\nJessica Lockhart – Chris Jericho Chris Jericho is definitely one of the bigger names on our list. The “Ayatolla of Rock N’ Rollah” has been married to Jessica Lockhart since 2000. Jericho met Lockhart back in high school and together they have certainly dealt with their fair share of rumors and drama, with speculations of infidelity on both sides. Fortunately, both Jericho and Lockhart have denounced any rumors of this kind and have reassured fans that nothing will separate these high school sweethearts. They have three kids together.\n\nMichelle McCool – The Undertaker Since coming onto the scene, The Undertaker has always been a wrestler who remains quiet and takes pride in his mysterious persona. This all changed when his relationship with former Diva Michelle McCool went public. It seems as though McCool has put pressure on the Phenom to share more and more photos of their holidays together in addition to nights out to sports events. In 2010, the couple tied the knot and are now parents to a daughter named Kaia Faith Calaway.\n\nWendy Jones – AJ Styles AJ Styles is another one of the few wrestlers on our list to marry outside of the industry, tying the knot with schoolteacher Wendy Jones in 2000. The happily married couple have four children together and Styles has each of their birth dates tattooed on his torso. Styles also ensured that each of his children would share his A.J. initials naming them Ajay, Avery, Albey and Anney. As a devout Christian, AJ has also passed along his faith to his children.\n\nDenise Hartmann – Christian Cage Sometimes you just have to trust that fate will sort things out. In the case of German Model Denise Hartmann, fate worked in her favor when she met WWE star Christian Cage while on vacation in England. Hartmann just happened to be in the right place at the right time and somehow spotted Cage in a crowd and its been nothing but smiles ever since. The couple tied the knot in December 2001 and have since had a daughter together named Isla.\n\nCandice LeRae – Johnny Gargano Let’s face it, Johnny Gargano and Candice LeRae aren’t the first pair of wrestlers to fall in love. AJ Lee and CM Punk immediately come to mind. They had already come a long way together before making their relationship official, with many encounters both in the ring and behind the scenes. Then, the couple made their bond eternal when they got married in 2016. Despite having lots of drama in the WWE, they are pretty stable in reality.\n\nSasha Banks – Sarath Ton It seems like Sasha Banks has exceeded Sarath Ton in the wrestling department. While the latter became a costume designer, the former has gone on to win the RAW Women’s Championship. In fact, it was just a few days after they got married that she won it for the fourth time at Summerslam. Officially part of the Four Horsewomen who helped usher in the “Diva’s Revolution,” Banks is regarded these days as one of the most talented female wrestlers in the game.\n\n\n\nStephanie Washington – Bret Hart There is no denying the impact that Bret “The Hitman” Hart has had on the wrestling industry. Arguably the most well-respect wrestler to have come out of Canada, the Sharpshooter expert is best known for falling from grace, from the WWE’s ultimate face to one of its heels as a result of a staged wrestling scandal involving Vince McMahon. He married Stephanie Washington in 2010, and although he is twice her age, Brett is hoping this is third-time lucky after two unsuccessful marriages.\n\nStephanie Miller – Heath Slater Alongside teammate Rhyno, Heath Slater officially became part of the first ever Smackdown! Tag Team Champions. With excellent finishing moves such as the Jumping Neckbraker and the Corkscrew Plancha in his arsenal, Slater is so unpredictable in the ring. His private life is a bit more straightforward, having married Stephanie Jean (now Miller.) Heath Slater lives a pretty conventional life with Stephanie in Fort Mill, South Carolina and since tying the knot, the couple had two daughters together.\n\nTamara McMichael -Kevin Nash The master of the powerbomb, Kevin Nash was at his WWE peak in the early 90s under the alias Deisel. It was in the WCW though where Nash truly made a name for himself. Together with Hollywood Hulk Hogan and Scott Hall (known as Razor Ramon in the WWE), the star-studded trio create the New World Order. It seems like his private life has been just as eventful, having married Tamara McMichael in 1988, separating in 2000, and then getting back together shortly after.\n\nSabine Borden – Sting Arguably one of the most iconic wrestlers of WCW, Sting is best known for hardly ever revealing his true self beneath that black and white face paint. After a previous marriage, Sting eventually married Sabine, shortly after Wrestlemania 31. Sabine also came out of another marriage after having two children. The personal trainer fell in love with Sting at first sight, and it seems like the couple will have plenty of time to have fun together. Sting retired in 2016.\n\nAngie Gutierrez – Rey Mysterio One of the ultimate luchadors in the world of wrestling, Rey Mysterio has already done so much in his WWE career. However, you can not ignore his personal life, seeing that he has been married to Angie Gutierrez since 1997. It turns out that Rey’s real name isn’t so Mysterio after all. Angie likes to refer to him by his birth name, Oscar. He has expressed his love for her by having many tattoos of her on his body.\n\nSonia Delbeck – Rob Van Dam It made sense that Rob Van Dam went for such an awesome ring name. He was born Robert Szatkowski, which doesn’t have quite the same ring to it. Since 1998, Van Dam has been married to Sonia Delbeck, who was by his side for many years, traveling with him. This was until the couple decided to divorce after being together for 17 years. Despite citing irreconcilable differences, they have both said that they remain friends to this day.\n\nKimberly Kessler – Randy Orton Though Randy Orton might be one of the biggest and most recognizable names in all of wrestling, his wife, Kimberly Kessler, was merely a fan of the WWE superstar when the couple met back in 2014. As a huge fan of Orton, Kessler was absolutely smitten when he brought her to the WWE Hall Of Fame Induction. Her WWE fangirl dream came true when Orton popped the question in July 2015 and the two tied the knot in 2016.\n\nCaryl J. Peterson – The Iron Shiek The Iron Shiek was unique due to his unique identity. Although he was considered a heel by the fans due to his disdain for America and praise for Iran, the wrestler has remained a household name in the wrestling community since the 80s. In 1976, he married his wife, Caryl, with fellow wrestler Mean Gene Okerlund acting as his best man. His later years have been overshadowed by substance abuse, but Caryl has been by his side through thick and thin.\n\nBeth Britt – Jeff Hardy Best known for his antics with tables, ladders, and chairs, Jeff Hardy made a name for himself as one half the Hardy Boyz, with his brother, Matt. Master of the Swanton Bomb, Hardy has also had a pretty successful solo career. On one fateful night out in a club, he met the love of his life, Beth Britt. The pair hit it off and have been together ever since. They have had two children together, Ruby Claire and Nera Quinn Hardy.\n\nTracy James – Road Dogg There is no denying that Road Dogg is best known for his tag team efforts with Billy Gunn as The New Age Outlawz. These were the tag team representatives of infamous D-Generation X, which also included Sean Michaels, Triple H, X-Pac and the late Chyna. Road Dogg was something of a tag team expert, winning the title five times. He is happily married to wife Tracy, who he has had three kids with. Brian Girard James is a happy man.\n\nJess Watson – Xavier Woods Even since making his WWE debut 2010, Xavier Woods has been quietly making a name for himself even since moving from Total Nonstop Wrestling. After years of hard work, the wrestler is now a member of the New Day, which also consists of Kofi Kingston and Big E. The man from Georgia is still considered an up and coming wrestler, but Jess Watson gave him a new lease of life and together, they had a baby boy in 2017.\n\nJana Perry – Mark Henry It is quite incredible how long Mark Henry has been in the WWE. Starting off with the organization when it was still known as the WWF, Henry has been one of the heavyweights of its rings for the good part of 30 years. Sparring with the likes of Val Venus and The Undertaker, Mark Henry is still a mainstay on the roster, despite all the younger talent. He is happily married to Jana Perry and had two kids with her.\n\nMaria Kanellis – Mike Bennett As a highly charismatic WWE Diva, Maria Kanellis has moved on from major wrestling organizations, finding a home for herself within the independent wrestling industry. Kanellis now spends most of her time managing her husband, wrestler Mike Bennet. While Bennet may be one of the least recognizable names on our list, having never appeared on a major wrestling network, there is no telling what the future holds for the up and coming wrestler, especially with his leading lady by his side calling the shots.\n\nAbigail Rodriguez – Kalisto It’s safe to say that Kalisto has become the heir apparent to Rey Mysterio’s WWE luchador status. The high-flyer, who was born Emanuel Alejandro Rodriguez, is hellbent on not living in the shadows of his predecessor and wants to make a name for himself. Another luchador, Sin Cara, has formed a strong Tag Team partnership with Kalisto and the duo have even won the NXT Tag Team Championship. Since hitting the big time, Kalisto has tied the knot with Abigail Rodriguez.\n\nPamela Killings – R-Truth Many forget that Ronnie Killings, better known these days as R-Truth has had an on-and-off presence in the WWE since the Attitude era. One of his most notable achievements came when he won the Tag Team championship with Road Dogg, of all people. With other appearances in federations such as TNA, R-Truth has been something of a mainstay in the WWE since his return in 2008. In 2011, Killings married his wife Pamela and had a daughter with her in 2014.\n\nColette Christie – Mick Foley The man of many faces, Mick Foley has rarely just been himself during his impressive WWE career. Most of the time, he has either been Dude Love, Cactus Jack, or psychopathic mandible claw feeding Mankind. Despite fluctuating from one character to another, Foley has had to be himself more since marrying Colette Christie back in the 90s. Not only did Foley hit the jackpot with Colette, but they also had three sons and a daughter together.\n\nPaula Sopp – Billy Gunn The second half of the New Age Outlawz, Billy Gunn is one of the least memorable but most experienced wrestlers to have been a part of Degeneration X. Winning King of the Ring in 1999 must’ve been his biggest wrestling achievement. This was eventually followed by true love in 2009 when Gunn married his girlfriend, Paula. Gunn’s wife actually lifted some eyebrows when she took shots at the WWE, saying, “acknowledging someone after they’ve passed away doesn’t make up for how [bad] you were to them while they were alive!” she said.\n\nJennifer Hudson – David Otunga This is a fine example of a wrestler’s partner who is most certainly more famous than the wrestler. Jennifer Hudson has come on in leaps and bounds since her time on American Idol. Despite having her fair share of tragedy with her family, Hudson has managed to find some luck in her love life, meeting wrestler David Otunga. Although the couple have since had a kid and even got engaged at one point, they officially separated in 2017.\n\nNikki Bella – John Cena John Cena got together with Total Divas star Nikki Bella in 2012. Although they’ve dealt with some drama over the past few years, they weathered the storm and are now stronger than ever and even got engaged when Cena popped the question at WrestleMania 33.\n\nCrystal Jacobs – Kane It was an amazing moment when Kane burst onto the scene at WWE’s Bad Blood event in 1997. In the first Hell in a Cell match, Glen Jacobs entered the ring, initiated the pyrotechnics and gave the tombstone piledriver to his in-ring brother, The Undertaker. Despite the black and red mask, Jacobs is actually a really nice guy and has been happily married for over two decades to Crystal Jacobs. The couple had two kids and even founded an insurance company.\n\nSable – Brock Lesnar As one of the original WWE Divas, Sable is an incredibly skilled wrestler in her own right. Having played a significant role during The Attitude Era, Sable decided that only a WWE superstar was worthy of her hand in marriage. She found that in Brock Lesnar, who just happens to be ten years her junior. The couple got married back in 2006 and now share two sons, Turk and Duke. Sable is now 50 years old and as stunning as ever!\n\nBess Katramados – Big Show The Big Show may be a 7-foot-tall modern day equivalent of Andre The Giant, but don’t be fooled. His wife, Bess Katramados definitely wears the pants in their relationship. What she says goes and Big Show is perfectly fine with that. The larger-than-life couple got married on February 11, 2002 and now have two children together. Bess is now enjoying some much-needed family time with her husband and children in following the retirement of her main man in February 2018.\n\nKarina Steen – Kevin Owens On May 18, 2015, NXT champion Kevin Owens delivered a Powerbomb that shook the wrestling world, slamming the legendary John Cena into the canvas like a rag doll. As Cena lied lifeless on the mat, Owens stomped on the WWE superstar’s belt, delivering the message that he’s not going anywhere. While this was definitely a defining moment in the career of Owens, it hails in comparison to the day he met his beautiful wife, Karina Steen, with whom he now shares two children.\n\nNattie Neidhart – Tyson Kidd Nattie Neidhart and Tyson Kiss have had their fair share of drama since getting together way back in 2001. Nattie “Natalya” Neidhart made her mark on the reality show, Total Divas, by providing the show with endless juicy material due to her turbulent personal life. While their relationship certainly hasn’t been a walk in the park, Neidhart and Kidd have always been there for each other, proving that, with a bit of work, true love can withstand anything and everything.\n\nBeth Phoenix – Edge Former WWE Diva Beth Phoenix started dating Adam Copeland, aka Edge, in December 2013. The incredibly strong and beautiful Phoenix was one of the most popular and well-known female wrestlers when she was in her prime, winning a WWE Divas Championship, three WWE Women’s Championships, and becoming the youngest person to ever be inducted into the WWE Hall of Fame. Since starting their romance, Phoenix and Edge have had two daughters together and married in 2016, on Edge’s 43rd birthday.\n\n", "images": ["https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134041/wrester-rewrite-rusev.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140505/wrestler-rewrite-kevin-nash.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140406/wrestler-rewrite-heath-slater.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132717/wrester-rewrite-the-miz.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140824/wrester-rewrite-the-iron-shiek.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141400/wrestler-rewrite-mick-foley.jpg", "https://www.brain-sharper.com/wp-content/themes/unified/images/logo_footer.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131419/wrester-rewrite-john-cena.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140155/wrestler-rewrite-bret-hart.jpeg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140656/wrestler-rewrite-rey-mysterio.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134634/wrester-rewrite-bray-wyatt.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133441/wrestler-rewrite-edge.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134218/wrester-rewrite-bo-dallas.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132800/wrestler-rewrite-stone-cold-steve-austin.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134739/wrestler-rewrite-daniel-bryan.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133749/wrester-rewrite-jerry-lawlor1.jpg", "https://www.brain-sharper.com/wp-content/themes/unified/images/logo_v2.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135310/wrestler-rewrite-the-rock.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131616/wrestler-rewrite-randy-orton.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140739/wrestler-rewrite-rob-van-dam.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141054/wrestler-rewrite-xavier-woods.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134300/wrester-rewrite-john-layfield.jpg", "https://www.facebook.com/tr?id=2297731100247158&ev=PageView&noscript=1", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135204/wrestler-rewrite-alberto-del-rio.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135927/wrestler-rewrite-johnny-gargano.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133629/wrestler-rewrite-matt-hardy.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141148/wrestler-rewrite-mark-henry.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133830/wrester-rewrite-charlie-haas.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141525/wrestler-rewrite-david-otunga.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134843/wrester-rewrite-jack-swagger.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131520/wrester-rewrite-aj-lee.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134518/wrestler-rewrite-kofi-kingston.jpeg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140058/wrester-rewrite-sarath-ton.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141322/wrestler-rewrite-r-truth.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141634/wrestler-rewrite-kane.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133538/wrester-rewrite-big-show.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134920/wrester-rewrite-kurt-angle.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133110/wrestler-rewrite-tyson-kidd.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135046/wrestler-rewrite-bill-goldberg.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135451/wrestler-rewrite-chris-jericho.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141237/wrestler-rewrite-kalisto.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133019/wrestler-rewrite-mike-bennet.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135842/wrestler-rewrite-christian-cage.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134348/wrestler-rewrite-jeff-jarrett.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135005/wrestler-rewrite-roman-reigns.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141004/wrestler-rewrite-road-dogg.jpeg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131826/wrestler-rewrite-brandi-rhodes.jpg", "http://trc.taboola.com/1021215/log/3/unip?en=page_view", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132839/wrestler-rewrite-shane-mcmahon.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132931/wrestler-rewrite-kevin-owens.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141441/wrestler-rewrite-billy-gunn.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134438/wrestler-rewrite-dean-ambrose.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135804/wrestler-rewrite-AJ-styles.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140912/wrestler-rewrite-jeff-hardy.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135630/wrestler-rewrite-the-undertaker.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133910/wrestler-rewrite-jimmy-uso.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131738/wrestler-rewrite-sean-michaels.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141603/wrestler-rewrite-dave-bautista.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135718/wrestler-rewrite-brock-lesner.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135405/wrestler-rewrite-triple-h.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140607/wrestler-rewrite-sting.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134555/wrestler-rewrite-booker-t.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133957/wrestler-rewrite-zack-ryder.jpg"], "top_img": "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg", "keywords": [], "authors": ["Lola James", "Jj Foster", "David Whittaker"], "canonical_link": "https://www.brain-sharper.com/entertainment/wwe-wives-yh/", "title": "The Women Behind The Wrestlers: Meet The WWE Wives", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "The Women Behind The Wrestlers: Meet The WWE Wives", "description": "Professional wrestlers are known for their strength, fearlessness, and ego. These days, it seems that every great wrestler has a beautiful woman supporting them whether they win or lose. Here are some of our favorite wives in the wrestling world. What initially began as a scripted relationship blossomed into something real when Hunter Hurst Hemsley, …", "url": "https://www.brain-sharper.com/entertainment/wwe-wives-yh/", "site_name": "BrainSharper", "updated_time": "2018-04-23T10:12:14+00:00", "image": {"identifier": "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg", "width": 1024, "height": 628}}, "article": {"section": "Entertainment", "published_time": "2020-02-28T03:12:29+00:00", "modified_time": "2018-04-23T10:12:14+00:00"}, "twitter": {"card": "summary", "description": "Professional wrestlers are known for their strength, fearlessness, and ego. These days, it seems that every great wrestler has a beautiful woman supporting them whether they win or lose. Here are some of our favorite wives in the wrestling world. What initially began as a scripted relationship blossomed into something real when Hunter Hurst Hemsley, […]", "title": "The Women Behind The Wrestlers: Meet The WWE Wives", "image": "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1582859549.0, "source": "http://www.brain-sharper.com", "summary": ""}