{"url": "https://www.indiewire.com/2016/06/the-leftovers-season-2-what-changed-mimi-leder-interview-consider-this-1201692270/", "text": "Showrunning director and executive producer Mimi Leder breaks down what changed between seasons of \"The Leftovers.\"\n\n“Mimi Leder can direct the shit out of anything.”\n\nThat’s Justin Theroux describing his showrunning director on “The Leftovers,” but it’s also as close as an opinion can come to being factual — and one supported by this critic. A helmer of giant blockbusters (like “Deep Impact”) and intimate dramas (like “The West Wing”), Leder expertly transformed Damon Lindelof’s wild words — “He has a lot of huevos,” Leder said — into a unique vision that brought them to life like no one else could. And she did it with incredible insight into everything from what makes each character tick to what the audience needed to see in order to access those characters.\n\nSpeaking to Indiewire shortly before starting production on Season 3, Leder dug into how the series developed over its first two seasons, what she brought to the table as a director and why one big scene didn’t make the cut for the brilliant — and nearly feature-length — finale.\n\nREAD MORE: ‘The Leftovers’: An Oral History of the Finale’s Karaoke Scene, from Damon Lindelof & Justin Theroux\n\nPopular on IndieWire\n\nYou came onboard “The Leftovers” as a director and then you moved into the role of co-EP, correct?\n\nDamon asked me to come direct an episode, and I directed “Gladys” how I thought the show should be. It was a brand new show, so — when I came on — I felt very close to it. I felt like I somehow understood it on a much deeper level. Then, while I was editing it, they asked me to stay. There were some growing pains in the beginnings of “The Leftovers.” That’s no secret.\n\nThere’s been a lot of talk about what changed and what didn’t change between Season 1 and Season 2.\n\nMy perspective is that Damon and Tom Perrotta were really discovering what the show was about. You write a story and then your story starts to speak to you, and I believe that they had some growing pains in the beginning. “Who’s point of view is this?” They started doing point of view stories, which they discovered were very successful — which it always is because it’s from your character’s point of view. You immediately, as an audience, get sucked in.\n\n\n\nI think that these point of views became stronger. The visual language — that maybe I brought to it, especially in the second season — helped to define what that was. The first season was very muted, very claustrophobic. And in the second season, we were moving to Austin, Texas, to this little town called Miracle. And I thought it was really important to expand the color palette, to find rich, deep colors to help express our characters’ emotions. I also thought opening up the show visually was important: wider shots, showing the environment more because the environment was very pertinent to the story. So, that’s what I think I helped bring to the show.\n\nIt’s those details that elevate things in such a big way, but it’s hard to just point to it and say, “Well hey, this is what really helped it evolve.”\n\nYou know, it ultimately is a show about family and what it’s like to lose your family — to lose everything in your life that is special to you. And so, how do you visually explore that? How do you dive deep into someone’s soul? We use close-ups very regularly. We get in there, but we also drop back to see the body language. For me, it’s really important to really dig deep into a character’s heart and try and find what’s between those lines. What are those moments when the actor isn’t speaking? What are those moments that help express and take you to the next level? It’s a real privilege to work on this show because of Damon’s writing, and his team of writers are an extraordinary group of thinkers who attach meaning to everything. I am on the continual search for the right look, the right light, the right environment to express that.\n\nDirecting the Season 2 premiere, did you feel it was important for you to be the one to set that tone when you’re starting over, in a way, for Season 2?\n\nOh, absolutely. I mean, I started to open up the show at the end of the first season. I didn’t want it to look like a whole new show. I just wanted it to breathe more, and I think we did that. We had the camera breathe more. We did bigger and bolder things. The most successful shots are ones that you feel and not ones that you are watching. It’s better when you just feel them, and they speak to you.\n\nWhen you were getting ready to shoot or when you were on set shooting “I Live Here Now,” the Season 2 finale, were you at all considering that this could be the series finale? That this could be the end?\n\nYou know, I personally did not think it would be the end, but if it was the end, I felt it was very satisfactory in terms of a man’s journey — Kevin’s journey home to his family. And it certainly could’ve been the end, but I never felt like it was resolved. Personally, I felt there were so many great moments in the finale — I’m sounding egotistical, I don’t mean to — and so many heartbreaking moments.\n\nThat one scene, for example, when Kevin is in the infirmary and John Murphy comes in and finds him and he looks at him and he goes, “I killed you.” And he goes, “Nope.” That scene, to me, was so much about how we live and get through life. Oftentimes, we never know what’s happening. We just don’t know how we’re going to get through life’s challenges.\n\n\n\nThe finale is just packed full of vital scenes. There’s nothing extraneous. There’s no fat on it whatsoever. And yet, it’s almost feature length. It’s about 73 minutes long.\n\nAnd I shot it in 13 days.\n\nThat’s crazy.\n\nIt was so challenging, but we were so organized and so in tune with each other. Just that bridge sequence — the charging of the bridge was obviously emotional, but it was a physically difficult scene to do. That was one of the most heartbreaking scenes to film with hundreds of extras around you, but was that really what is was about? The scene was about Nora saving her baby’s life and holding onto the only thing that felt real to her. So, the scenes for me are always about what the characters are feeling and what they’re expressing.\n\nDid you have to cut anything from the finale?\n\nThere was one scene we cut, but I knew we were going to cut it before I even shot the scene. [laughs] I don’t know if I’m supposed to tell you these things.\n\nI’ll make sure HBO is cool with it. [They are.]\n\nAfter that scene in the infirmary, Kevin and John come out and we had a scene where people had tied the pillar to a truck and were trying to pull it down. And so basically, it was John and Kevin saving the pillar-man from fighting those guys — kind of saving him together.\n\nEmotionally, it just didn’t feel right. I knew it on the page. They need to go from the infirmary to walking up the street [as they do at the end of the episode]. And that’s how I presented it. I mean, I shot the scene, but I presented my cut to Damon without the fight scene in it. He saw the fight scene and he agreed. But rarely does that happen. We do not do reshoots. We never did a reshoot on this second season, and not much is ever cut.\n\nAnd you know, by the way, when we’re filming, we are crying! We are so into it. I look next to me, to my director of photography, Michael Grady — who’s this beautiful big burly guy, tough as can be — and he has tears coming out of his eyes. It’s the most gratifying show to work on because it’s really about something. It really is about something that matters. It’s been a privilege to be a part of it.\n\n[Editor’s Note: Indiewire’s Consider This campaign is an ongoing series meant to raise awareness for Emmy contenders our editorial staff and readership find compelling, fascinating and deserving. Running throughout awards season, Consider This contenders may be underdogs, frontrunners or somewhere in between. More importantly, they’re making damn good television we all should be watching, whether they’re nominated or not.]\n\nStay on top of the latest TV news! Sign up for our TV email newsletter here.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/uploads/2016/06/tl_301_050216_vr_00015.jpg?w=780", "https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "http://www.indiewire.com/wp-content/uploads/2016/06/tl_210_100715_vr_423.jpg", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "http://www.indiewire.com/wp-content/uploads/2016/06/tl_301_050316_vr_0009.jpg", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/uploads/2016/06/tl_301_050216_vr_00015.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2016%2F06%2Fthe-leftovers-season-2-what-changed-mimi-leder-interview-consider-this-1201692270%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201692270&comment_count=1", "https://i1.wp.com/www.indiewire.com/wp-content/uploads/2016/05/ben-travers.jpeg?resize=96%2C96&ssl=1"], "top_img": "https://www.indiewire.com/wp-content/uploads/2016/06/tl_301_050216_vr_00015.jpg", "keywords": [], "authors": ["Ben Travers"], "canonical_link": "https://www.indiewire.com/2016/06/the-leftovers-season-2-what-changed-mimi-leder-interview-consider-this-1201692270/", "title": "‘The Leftovers’ Secret Weapon: How Mimi Leder Revamped Season 2", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Showrunning director and executive producer Mimi Leder breaks down what changed between seasons of \"The Leftovers.\"", "news_keywords": "Awards Season Roundup, Consider This, Emmys, HBO, Mimi Leder, The Leftovers, TV Interviews", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Ben Travers", "content_type": "Article", "post_id": 1201692270, "title": "'The Leftovers' Secret Weapon: How Mimi Leder Revamped Season 2", "published_at": "2016-06-24 09:00:14", "image": "https://www.indiewire.com/wp-content/uploads/2016/06/tl_301_050216_vr_00015.jpg?w=300", "comment_count": 1, "tags": "TV Interviews", "topics": "Television", "body": "\"Mimi Leder can direct the shit out of anything.\"\r\n\r\nThat's Justin Theroux describing his showrunning director on \"The Leftovers,\" but it's also as close as an opinion can come to being factual — and one supported by this critic. A helmer of giant blockbusters (like \"Deep Impact\") and intimate dramas (like \"The West Wing\"), Leder expertly transformed Damon Lindelof's wild words — \"He has a lot of huevos,\" Leder said — into a unique vision that brought them to life like no one else could. And she did it with incredible insight into everything from what makes each character tick to what the audience needed to see in order to access those characters.\r\n\r\nSpeaking to Indiewire shortly before starting production on Season 3, Leder dug into how the series developed over its first two seasons, what she brought to the table as a director and why one big scene didn't make the cut for the brilliant — and nearly feature-length — finale.\r\n\r\nREAD MORE: ‘The Leftovers’: An Oral History of the Finale’s Karaoke Scene, from Damon Lindelof & Justin Theroux\r\n\r\nYou came onboard \"The Leftovers\" as a director and then you moved into the role of co-EP, correct? \r\n\r\nDamon asked me to come direct an episode, and I directed \"Gladys\" how I thought the show should be. It was a brand new show, so — when I came on — I felt very close to it. I felt like I somehow understood it on a much deeper level. Then, while I was editing it, they asked me to stay. There were some growing pains in the beginnings of \"The Leftovers.\" That’s no secret.\r\n\r\nThere’s been a lot of talk about what changed and what didn’t change between Season 1 and Season 2.\r\n\r\nMy perspective is that Damon and Tom Perrotta were really discovering what the show was about. You write a story and then your story starts to speak to you, and I believe that they had some growing pains in the beginning. \"Who’s point of view is this?\" They started doing point of view stories, which they discovered were very successful — which it always is because it’s from your character’s point of view. You immediately, as an audience, get sucked in.\r\n\r\n\r\nI think that these point of views became stronger. The visual language — that maybe I brought to it, especially in the second season — helped to define what that was. The first season was very muted, very claustrophobic. And in the second season, we were moving to Austin, Texas, to this little town called Miracle. And I thought it was really important to expand the color palette, to find rich, deep colors to help express our characters’ emotions. I also thought opening up the show visually was important: wider shots, showing the environment more because the environment was very pertinent to the story. So, that’s what I think I helped bring to the show.\r\n\r\nIt’s those details that elevate things in such a big way, but it’s hard to just point to it and say, \"Well hey, this is what really helped it evolve.\"\r\n\r\nYou know, it ultimately is a show about family and what it’s like to lose your family — to lose everything in your life that is special to you. And so, how do you visually explore that? How do you dive deep into someone’s soul? We use close-ups very regularly. We get in there, but we also drop back to see the body language. For me, it’s really important to really dig deep into a character’s heart and try and find what’s between those lines. What are those moments when the actor isn’t speaking? What are those moments that help express and take you to the next level? It’s a real privilege to work on this show because of Damon’s writing, and his team of writers are an extraordinary group of thinkers who attach meaning to everything. I am on the continual search for the right look, the right light, the right environment to express that.\r\n\r\nDirecting the Season 2 premiere, did you feel it was important for you to be the one to set that tone when you’re starting over, in a way, for Season 2?\r\n\r\nOh, absolutely. I mean, I started to open up the show at the end of the first season. I didn’t want it to look like a whole new show. I just wanted it to breathe more, and I think we did that. We had the camera breathe more. We did bigger and bolder things. The most successful shots are ones that you feel and not ones that you are watching. It’s better when you just feel them, and they speak to you.\r\n\r\nWhen you were getting ready to shoot or when you were on set shooting \"I Live Here Now,\" the Season 2 finale, were you at all considering that this could be the series finale? That this could be the end?\r\n\r\nYou know, I personally did not think it would be the end, but if it was the end, I felt it was very satisfactory in terms of a man’s journey — Kevin’s journey home to his family. And it certainly could’ve been the end, but I never felt like it was resolved. Personally, I felt there were so many great moments in the finale — I’m sounding egotistical, I don’t mean to — and so many heartbreaking moments.\r\n\r\nThat one scene, for example, when Kevin is in the infirmary and John Murphy comes in and finds him and he looks at him and he goes, \"I killed you.\" And he goes, \"Nope.\" That scene, to me, was so much about how we live and get through life. Oftentimes, we never know what’s happening. We just don’t know how we’re going to get through life’s challenges.\r\n\r\n\r\nThe finale is just packed full of vital scenes. There’s nothing extraneous. There’s no fat on it whatsoever. And yet, it’s almost feature length. It’s about 73 minutes long.\r\n\r\nAnd I shot it in 13 days.\r\n\r\nThat’s crazy.\r\n\r\nIt was so challenging, but we were so organized and so in tune with each other. Just that bridge sequence — the charging of the bridge was obviously emotional, but it was a physically difficult scene to do. That was one of the most heartbreaking scenes to film with hundreds of extras around you, but was that really what is was about? The scene was about Nora saving her baby’s life and holding onto the only thing that felt real to her. So, the scenes for me are always about what the characters are feeling and what they’re expressing.\r\n\r\nDid you have to cut anything from the finale?\r\n\r\nThere was one scene we cut, but I knew we were going to cut it before I even shot the scene. [laughs] I don’t know if I’m supposed to tell you these things.\r\n\r\nI'll make sure HBO is cool with it. [They are.]\r\n\r\nAfter that scene in the infirmary, Kevin and John come out and we had a scene where people had tied the pillar to a truck and were trying to pull it down. And so basically, it was John and Kevin saving the pillar-man from fighting those guys — kind of saving him together.\r\n\r\nEmotionally, it just didn’t feel right. I knew it on the page. They need to go from the infirmary to walking up the street [as they do at the end of the episode]. And that’s how I presented it. I mean, I shot the scene, but I presented my cut to Damon without the fight scene in it. He saw the fight scene and he agreed. But rarely does that happen. We do not do reshoots. We never did a reshoot on this second season, and not much is ever cut.\r\n\r\nAnd you know, by the way, when we’re filming, we are crying! We are so into it. I look next to me, to my director of photography, Michael Grady — who’s this beautiful big burly guy, tough as can be — and he has tears coming out of his eyes. It’s the most gratifying show to work on because it’s really about something. It really is about something that matters. It’s been a privilege to be a part of it.\r\n\r\n[Editor’s Note: Indiewire’s Consider This campaign is an ongoing series meant to raise awareness for Emmy contenders our editorial staff and readership find compelling, fascinating and deserving. Running throughout awards season, Consider This contenders may be underdogs, frontrunners or somewhere in between. More importantly, they’re making damn good television we all should be watching, whether they’re nominated or not.]\r\n\r\n\r\n\r\nStay on top of the latest TV news! Sign up for our TV email newsletter here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2016/06/the-leftovers-season-2-what-changed-mimi-leder-interview-consider-this-1201692270/", "title": "‘The Leftovers’ Secret Weapon: How Mimi Leder Revamped Season 2", "description": "Showrunning director and executive producer Mimi Leder breaks down what changed between seasons of \"The Leftovers.\"", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2016/06/tl_301_050216_vr_00015.jpg", "width": 780, "height": 520}}, "article": {"published_time": "2016-06-24T13:00:14+00:00", "modified_time": "2016-09-11T18:11:03+00:00", "author": "https://www.indiewire.com/author/bentravers5/", "section": "Television", "tag": "TV Interviews"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": ["https://www.youtube.com/embed/RkjgPRZEcNE?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1466773214.0, "source": "https://www.indiewire.com", "summary": ""}