{"url": "people.com/tv/khloe-kardashian-probably-wont-leave-tristan-thompson/", "text": "As they prepare to welcome a child together in the wake of ongoing cheating allegations, Khloé Kardashian and Tristan Thompson‘s future together is unclear.\n\n“This is supposed to be the most joyous time in her life and it’s been ruined and that’s probably what hurts most of all,” a family source tells PEOPLE about Kardashian, 33, who is due with her first child — a daughter — with Thompson, 27, any day now.\n\nGet push notifications with news, features and more.\n\nOn Tuesday, photos and videos surfaced of the NBA player allegedly getting close to an unidentified woman at an N.Y.C. lounge over the weekend. TMZ also posted footage recorded in October 2017 allegedly depicting Thompson kissing one woman while a different woman groped him at the Darna hookah lounge outside of Washington D.C.\n\nImage zoom Khloe Kardashian/Instagram\n\nDespite the allegations of infidelity — a source previously told PEOPLE that Thompson is “a serial cheater” — the insider says the mother-to-be is likely to stay with Thompson.\n\n“She’s a hopeless romantic and she’ll try to make this work. She tried forever to make it work with Lamar [Odom]. She’s having a child with Tristan, and she’s going to try to rebuild this,” the source says.\n\nAdds the source: “Khloé could probably convince herself to get over the fact that he maybe, kind of, sort of, hooked up with some groupie while out on the road. But being so indiscreet about it and letting it get splashed all over the place and having it humiliate her? That’s actually even worse.”\n\nPrior to meeting Thompson, Kardashian was in a nearly eight-year relationship with ex-husband Odom. They wed on Sept. 27, 2009 — one month to the day after they met (and nine days after getting engaged) — but the marriage fell apart after the former basketball player’s cheating scandal and drug relapse, which led Kardashian to file for divorce in 2013.\n\nImage zoom JAKE HOLLY/startraksphoto.com\n\nKhloe Kardashian and Lamar Odom\n\n“Khloé spent so much time with Lamar just excusing away the obvious, turning a blind eye to what was so clearly happening, that it would be impossible for her not to feel like a fool if she made the same sort of mistakes again and just ignored that N.Y.C footage [of Thompson[. That’s not the way a man deeply in love with the mother of his child behaves. It’s just not. And Khloé can’t lie to herself and tell herself otherwise,” the source says.\n\nRELATED VIDEO: Did Khloé Kardashian’s Boyfriend Get Too Close to Another Woman Right Before She Gives Birth?\n\n“The thing about Khloé, though, is she’s a big believer in knowing someone’s back story and understanding how it motivates them. With Lamar, her heart broke for everything he’d been through in the past, losing his mom and his grandma and his baby boy, and she used that as a justification for why he struggled so much with addiction and cheating. She’s got a big heart — too big sometimes,” the source shares.\n\nThompson and Kardashian began dating in September 2016, when his ex-girlfriend Jordan Craig was still pregnant with Thompson’s first child, 16-month-old son Prince Oliver. Neither has addressed whether he met Kardashian while still in a relationship with Craig.\n\nWatch the full special Born Kardashian streaming now on PeopleTV.com, or download the PeopleTV app on your favorite device.\n\nImage zoom David Livingston/Getty; Jordan Craig/Instagram\n\nTristan Thompson and Jordan Craig\n\n“With Tristan, she believed his back story that he was never even that committed to her or in love with Jordan, and that he’d never meant to be with Jordan long-term,” the insider explains.”Khloé let herself believe that he’s a really good guy with a good heart. She might still believe that, honestly.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nWith the baby’s arrival imminent, Kardashian has been nesting in Cleveland with the NBA player. A source previously told PEOPLE she planned on giving birth there, and her famous family would fly in, including mother Kris Jenner, who is already in Ohio with Kardashian.\n\nWhile her future with Thompson remains unknown, the Good American jeans founder is focusing her attention on her unborn daughter.\n\n“The only thing Khloe can do now is focus on her baby,” the source says.”What’s happened over the last 24 hours changes a lot of things, but it doesn’t change everything: It doesn’t change that Khloé has dreamed of becoming a mom, already loves her baby so much, and that soon her dream is going to come true.”\n\n“She can’t wait to meet her little girl, can’t wait to hold her,” says the insider, adding, “and so for right now, the focus is just on getting to that day as safely and healthily as possible.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkhloe-kardashian-31.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkhloe-kardashian-31.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fkhloe-kardashian-5.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Ftristan-thompson-jordan-craig.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkhloe-kardashian-31.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/khloe-kardashian-probably-wont-leave-tristan-thompson/", "title": "Khloé Kardashian Probably Won't Leave Tristan Thompson, Source Says: 'She's a Hopeless Romantic'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Couples,Kardashians,Khloé Kardashian,News,Tristan Thompson,TV", "news_keywords": "Babies,Couples,Kardashians,Khloé Kardashian,News,Tristan Thompson,TV", "description": "\"She’ll try to make this work,\" a family source tells PEOPLE about Khloé Kardashian", "og": {"title": "Khloé Kardashian Probably Won't Leave Tristan Thompson, Source Says: 'She's a Hopeless Romantic'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/khloe-kardashian-probably-wont-leave-tristan-thompson/", "description": "As they prepare to welcome a child together in the wake of ongoing cheating allegations, Khloé Kardashian and Tristan Thompson‘s future together is unclear. “This&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkhloe-kardashian-31.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/tv/khloe-kardashian-probably-wont-leave-tristan-thompson/", "description": "\"She’ll try to make this work,\" a family source tells PEOPLE about Khloé Kardashian", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkhloe-kardashian-31.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/khloe-kardashian-probably-wont-leave-tristan-thompson/", "title": "Khloé Kardashian Probably Won't Leave Tristan Thompson, Source Says: 'She's a Hopeless Romantic'", "description": "\"She’ll try to make this work,\" a family source tells PEOPLE about Khloé Kardashian", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkhloe-kardashian-31.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}