{"url": "https://www.rollingstone.com/music/music-news/bobby-brown-i-dont-think-whitney-houston-died-from-drugs-203949/", "text": "One day before his 49th birthday earlier this month, Bobby Brown was relaxing at home watching his New England Patriots lose to the Philadelphia Eagles in Super Bowl LII. “I’m waiting to do the big one when I turn 50,” he says with a smile two weeks later at Brooklyn’s Barclays Center.\n\nLater that night, he’ll headline the Ladies Night R&B Super Jam, a one-off show featuring his former New Edition bandmates Bell Biv DeVoe alongside Faith Evans and Xscape. But for now, he’s relaxing backstage, waiting for some technical issues to be sorted and planning the next chapter of his life.\n\nIf 2018 isn’t the Bobby Brown renaissance, it’s at least the year that content will trump gossip for a singer as well-known for his turbulent private life as his music. Next week, BET begins shooting the Brown-produced The Bobby Brown Story, a follow-up to the channel’s successful 2017 miniseries The New Edition Story set for release this fall. To coincide with the movie, Brown has reunited with producers Teddy Riley and Babyface to work on a new solo album, his first since 2012’s The Masterpiece, and is planning a world tour.\n\nIn addition, Sunday marks the first Celebration of Serenity Gala, a concert and fundraiser to raise money for Brown’s anti–domestic-violence charity Bobbi Kristina Serenity House. Brown says his 2016 memoir Every Little Step: My Story, which detailed his reaction to both the 2012 death of wife Whitney Houston and 2015 death of daughter Bobbi Kristina, was “therapy.” But as the singer tells Rolling Stone, the pain remains even as the future looks optimistic.\n\nYou just turned 49. Have you started thinking about your 50th birthday?\n\nOne of my teachers told me I would never make it to be 17. When [1988’s] Don’t Be Cruel came out, we was on tour so I went up to the school to see her. Her name was Mrs. Schwartz. I didn’t forget her name. She was so elated and shocked to see me, she gave me a big hug. It was a very peaceful meeting, but I was letting her know that not only did I live, but I’m the biggest thing since sliced bread right now.\n\nWas there any part of you that was reluctant to replay the more negative parts of your life in the movie?\n\nNo, no. I’m glad they’re doing it now and not when I’m gone. I have no reason to tell stories. My life has been difficult, but at the same time, I wouldn’t change any part of it for nothing. After writing [my 2016 memoir Every Little Step], I was able to release all of the pressure and all of the things that was eating me up inside. Being able to tell my side of the story is therapeutic for me. I wouldn’t be the man I am right now if, if I regretted anything.\n\n“I don’t think [Whitney] died from drugs. She was really working hard on herself to try to be a sober person.”\n\nWhat would be the one piece of advice you would give to a singer whose career is just starting to ascend?\n\nTake your time. Don’t rush through life with the partying and shit like that. And “Just say no” when somebody [laughs] tries to give you drugs or anything. Just say no. I’ve been clean from narcotics for 15 years. When I think about it, it’s like, “Damn. I wasted so much time doing something that’s fucking absolutely stupid.” Me and my wife have three kids and when they find out when they get old enough, “Daddy used to be like this,” it’ll teach them what not to do. That’s going to be a great thing and a rough one at the same time.\n\nWhat’s been your anchor for sobriety?\n\nThe love for my kids. The love that they give me. My older kids know everything about me and they still love me. [Laughs] The love of my wife for her loving me the way she does and holding me down the way she does has been everything for me. It’s been my rock. When I did get sober, I knew that I wasn’t going to turn back.\n\nHow did you know?\n\n[Beats chest] Just my heart. I was done with trying to kill myself and beating myself up over different things and petty shit.\n\nWhen you see footage of yourself while you were on drugs, does it feel like the same person?\n\n[Pauses] It was a different Bobby Brown, I believe. I was sad. I was married and lonely at the same time and that’s hard to deal with. I’m not lonely anymore. I’m not sad. I have nothing to be sad about. My life has treated me well. After everything I’ve been through – heart attacks, strokes, things like that – I’m still standing. I’m moving on with everything from my past and I accept it. I’ve accepted that shit happens.\n\nJune is the 30th anniversary of Don’t Be Cruel. Did you gravitate to the songs immediately or did it take some getting used to?\n\nI didn’t like some of the songs. “Every Little Step”: hated it. “Don’t be Cruel”: hated it. I wasn’t there. I wasn’t seeing the bigger picture and the vision that everyone had. But when people liked it [laughs] and started jamming to it, I was like, “Fuck it.” I told [producer and label exec] Louis Silas Jr., “Dude, I’ll sing the song, but I got to go work with Teddy [Riley]” and that was the compromise.\n\n“Don’t Be Cruel” is still one of the songs I don’t want to perform [now], but everybody wants me to perform. It’s just like, “What the fuck?” I don’t remember some of the rap sometimes. You forget some of the lyrics. [Laughs] We getting to the song while we performing and sometimes I just get to the point and go, “This is ridiculous. Stop,” and I tell my band to stop and we go into another song.\n\nWhat spurred you to create Serenity House and organize the upcoming Serenity Gala?\n\nDomestic violence is just the worst shit in the world … We started the Serenity House because women will go through it and think they are wrong like it’s their fault. So we’re doing this to build houses like safe havens for women that are being abused to get away from the relationship and get some therapy spiritually and mentally.\n\n“‘Every Little Step’: hated it. ‘Don’t be Cruel’: hated it.”\n\nWe want to let women know that they don’t have to be scared and stay in that relationship. This isn’t a fucking game. You either are going to be healthy or you’re going to end up dying. And I don’t want to see another father or mother have to go through what I went through.\n\nIn 2016, Nick Gordon was ordered to pay $36 million to the estate of your daughter. Do you feel there has been justice related to her death?\n\nNo, not yet.\n\nWhy not?\n\nBecause he’s still walking around free.\n\nWhat does justice look like to you?\n\nJustice? If he was locked up somewhere where somebody can rape him. That’s just how I feel. He raped me by taking my daughter away.\n\nThis month marks the sixth anniversary of Whitney’s death. What do you think was the most misunderstood thing about her?\n\nUm … whoa [long pause] – I don’t think she died from drugs.\n\nYou don’t?\n\nNo, not at all.\n\nWhat do you think it was?\n\nShe was really working hard on herself to try to be a sober person and, um [pauses] she was a great woman.\n\nWhen you say you don’t think she died of drugs, do you mean you don’t think there were drugs in her system at the time?\n\nYes.\n\n[Alicia Etheredge-Brown, wife and manager, interjecting]: There were drugs in her system.\n\nWell, I don’t think so.\n\n[Etheredge-Brown]: You feel that other things played a part …\n\nThat played a part. Yes.\n\nWhat do you attribute her death to if it wasn’t drugs?\n\nJust being broken-hearted.\n\nWhat about yourself? When you look back on your life, what do you think is the most misunderstood thing about you?\n\nHmm. [Pauses] That I’m a bad person. I’ve been through my scrapes and I’ve been through some bad times, but as far as my heart is concerned, my heart is pure.\n\nWhat we learned from the new Whitney Houston documentary ‘Can I Be Me,’ which delves deep into her addiction and brilliant yet troubled career. Watch below.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fbobby-brown-i-dont-think-whitney-houston-died-from-drugs-203949%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=203949", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2018/06/bobby-brown-f862c019-361c-44b5-970f-66af20ed2427.jpg", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/bobby-brown-f862c019-361c-44b5-970f-66af20ed2427.jpg", "keywords": [], "authors": ["Jason Newman", "News Director", "Jason Newman'S Most Recent Stories", "Flashback", "What The Hell Were The Rock Music Awards In", "A", "Big Brother", "Cast Still Doesn T Know About Coronavirus", "A Few Minutes With Billy Idol", "New York S New Ambassador For Parking Violations"], "canonical_link": "https://www.rollingstone.com/music/music-news/bobby-brown-i-dont-think-whitney-houston-died-from-drugs-203949/", "title": "Bobby Brown: I Don’t Think Whitney Houston Died From Drugs", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Bobby Brown says he hopes Nick Gordon, the man found \"legally responsible\" in Brown's daughter's death, goes to prison \"where somebody can rape him.\"", "news_keywords": "Bobby Brown", "og": {"type": "article", "title": "Bobby Brown: I Don't Think Whitney Houston Died From Drugs", "url": "https://www.rollingstone.com/music/music-news/bobby-brown-i-dont-think-whitney-houston-died-from-drugs-203949/", "description": "Singer also hopes Nick Gordon, who was found “legally responsible” in death of Brown’s daughter, gets “locked up somewhere where somebody can rape him”", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/bobby-brown-f862c019-361c-44b5-970f-66af20ed2427.jpg", "width": 1024, "height": 682, "alt": "Singer Bobby Brown performs at UNO Lakefront Arena on February 11, 2017 in New Orleans, Louisiana."}, "locale": "en_US"}, "article": {"published_time": "2018-02-28T15:13:00+00:00", "modified_time": "2018-06-25T16:38:35+00:00"}, "twitter": {"text": {"title": "Bobby Brown: I Don't Think Whitney Houston Died From Drugs"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/bobby-brown-f862c019-361c-44b5-970f-66af20ed2427.jpg?w=1024", "alt": "Singer Bobby Brown performs at UNO Lakefront Arena on February 11, 2017 in New Orleans, Louisiana."}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@jasonrnewman", "title": "Bobby Brown: I Don’t Think Whitney Houston Died From Drugs", "description": "Bobby Brown says he hopes Nick Gordon, the man found \"legally responsible\" in Brown's daughter's death, goes to prison \"where somebody can rape him.\""}, "generator": "WordPress 5.4", "author": "Jason Newman", "content_type": "Article", "post_id": 203949, "title": "Bobby Brown: I Don't Think Whitney Houston Died From Drugs", "published_at": "2018-02-28 15:13:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/bobby-brown-f862c019-361c-44b5-970f-66af20ed2427.jpg?w=1024", "comment_count": 0, "tags": "Bobby Brown", "topics": "Music News", "body": "One day before his 49th birthday earlier this month, Bobby Brown was relaxing at home watching his New England Patriots lose to the Philadelphia Eagles in Super Bowl LII. \"I'm waiting to do the big one when I turn 50,\" he says with a smile two weeks later at Brooklyn's Barclays Center.Later that night, he'll headline the Ladies Night R&B Super Jam, a one-off show featuring his former New Edition bandmates Bell Biv DeVoe alongside Faith Evans and Xscape. But for now, he's relaxing backstage, waiting for some technical issues to be sorted and planning the next chapter of his life.If 2018 isn't the Bobby Brown renaissance, it's at least the year that content will trump gossip for a singer as well-known for his turbulent private life as his music. Next week, BET begins shooting the Brown-produced The Bobby Brown Story, a follow-up to the channel's successful 2017 miniseries The New Edition Story set for release this fall. To coincide with the movie, Brown has reunited with producers Teddy Riley and Babyface to work on a new solo album, his first since 2012's The Masterpiece, and is planning a world tour. In addition, Sunday marks the first Celebration of Serenity Gala, a concert and fundraiser to raise money for Brown's anti–domestic-violence charity Bobbi Kristina Serenity House. Brown says his 2016 memoir Every Little Step: My Story, which detailed his reaction to both the 2012 death of wife Whitney Houston and 2015 death of daughter Bobbi Kristina, was \"therapy.\" But as the singer tells Rolling Stone, the pain remains even as the future looks optimistic.You just turned 49. Have you started thinking about your 50th birthday?One of my teachers told me I would never make it to be 17. When [1988's] Don't Be Cruel came out, we was on tour so I went up to the school to see her. Her name was Mrs. Schwartz. I didn't forget her name. She was so elated and shocked to see me, she gave me a big hug. It was a very peaceful meeting, but I was letting her know that not only did I live, but I'm the biggest thing since sliced bread right now.Was there any part of you that was reluctant to replay the more negative parts of your life in the movie? No, no. I'm glad they're doing it now and not when I'm gone. I have no reason to tell stories. My life has been difficult, but at the same time, I wouldn't change any part of it for nothing. After writing [my 2016 memoir Every Little Step], I was able to release all of the pressure and all of the things that was eating me up inside. Being able to tell my side of the story is therapeutic for me. I wouldn't be the man I am right now if, if I regretted anything.  \"I don't think [Whitney] died from drugs. She was really working hard on herself to try to be a sober person.\"What would be the one piece of advice you would give to a singer whose career is just starting to ascend? Take your time. Don't rush through life with the partying and shit like that. And \"Just say no\" when somebody [laughs] tries to give you drugs or anything. Just say no. I've been clean from narcotics for 15 years. When I think about it, it's like, \"Damn. I wasted so much time doing something that's fucking absolutely stupid.\" Me and my wife have three kids and when they find out when they get old enough, \"Daddy used to be like this,\" it'll teach them what not to do. That's going to be a great thing and a rough one at the same time.What's been your anchor for sobriety? The love for my kids. The love that they give me. My older kids know everything about me and they still love me. [Laughs] The love of my wife for her loving me the way she does and holding me down the way she does has been everything for me. It's been my rock. When I did get sober, I knew that I wasn't going to turn back. How did you know? [Beats chest] Just my heart. I was done with trying to kill myself and beating myself up over different things and petty shit.When you see footage of yourself while you were on drugs, does it feel like the same person?[Pauses] It was a different Bobby Brown, I believe. I was sad. I was married and lonely at the same time and that's hard to deal with. I'm not lonely anymore. I'm not sad. I have nothing to be sad about. My life has treated me well. After everything I've been through – heart attacks, strokes, things like that – I'm still standing. I'm moving on with everything from my past and I accept it. I've accepted that shit happens.June is the 30th anniversary of Don't Be Cruel. Did you gravitate to the songs immediately or did it take some getting used to?I didn't like some of the songs. \"Every Little Step\": hated it. \"Don't be Cruel\": hated it. I wasn't there. I wasn't seeing the bigger picture and the vision that everyone had. But when people liked it [laughs] and started jamming to it, I was like, \"Fuck it.\" I told [producer and label exec] Louis Silas Jr., \"Dude, I'll sing the song, but I got to go work with Teddy [Riley]\" and that was the compromise.\"Don't Be Cruel\" is still one of the songs I don't want to perform [now], but everybody wants me to perform. It's just like, \"What the fuck?\" I don't remember some of the rap sometimes. You forget some of the lyrics. [Laughs] We getting to the song while we performing and sometimes I just get to the point and go, \"This is ridiculous. Stop,\" and I tell my band to stop and we go into another song.What spurred you to create Serenity House and organize the upcoming Serenity Gala?Domestic violence is just the worst shit in the world ... We started the Serenity House because women will go through it and think they are wrong like it's their fault. So we're doing this to build houses like safe havens for women that are being abused to get away from the relationship and get some therapy spiritually and mentally. \"'Every Little Step': hated it. 'Don't be Cruel': hated it.\"We want to let women know that they don't have to be scared and stay in that relationship. This isn't a fucking game. You either are going to be healthy or you're going to end up dying. And I don't want to see another father or mother have to go through what I went through.In 2016, Nick Gordon was ordered to pay $36 million to the estate of your daughter. Do you feel there has been justice related to her death?No, not yet.Why not?Because he's still walking around free.What does justice look like to you?Justice? If he was locked up somewhere where somebody can rape him. That's just how I feel. He raped me by taking my daughter away.This month marks the sixth anniversary of Whitney's death. What do you think was the most misunderstood thing about her?Um ... whoa [long pause] – I don't think she died from drugs.You don't?No, not at all.What do you think it was?She was really working hard on herself to try to be a sober person and, um [pauses] she was a great woman.When you say you don't think she died of drugs, do you mean you don't think there were drugs in her system at the time?Yes.[Alicia Etheredge-Brown, wife and manager, interjecting]: There were drugs in her system.Well, I don't think so.[Etheredge-Brown]: You feel that other things played a part ...That played a part. Yes.What do you attribute her death to if it wasn't drugs?Just being broken-hearted.What about yourself? When you look back on your life, what do you think is the most misunderstood thing about you?Hmm. [Pauses] That I'm a bad person. I've been through my scrapes and I've been through some bad times, but as far as my heart is concerned, my heart is pure.What we learned from the new Whitney Houston documentary 'Can I Be Me,' which delves deep into her addiction and brilliant yet troubled career. Watch below.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1519830780.0, "source": "https://www.rollingstone.com", "summary": ""}