{"url": "www.bbc.com/sport/tennis/40408799", "text": "Media playback is not supported on this device 'I would hope that I would win against Serena'\n\nSerena Williams disputes John McEnroe's claims that she would struggle to be in the world's top 700 if she was on the men's circuit.\n\nBut the male player ranked 701 in the world - Dmitry Tursunov - believes he could beat her.\n\nSpeaking to US radio station NPR, seven-time Grand Slam champion McEnroe said of former world number one Williams, who has won an Open-era record 23 Grand Slams: \"If she played the men's circuit she'd be, like, 700 in the world.\"\n\nHe qualified the comments by saying: \"That doesn't mean I don't think Serena is an incredible player, and I suppose anything's possible; maybe at some point a women's tennis player can be better than anybody.\"\n\nBut he added: \"I just haven't seen that in any other sport, and I haven't seen it in tennis. If she had to just play the men's circuit, it would be an entirely different story.\"\n\nWilliams later responded on Twitter: \"Dear John, I adore and respect you but please please keep me out of your statements that are not factually based.\n\n\"I've never played anyone ranked \"there\" nor do I have time. Respect me and my privacy as I'm trying to have a baby. Good day sir.\"\n\nWilliams, 35, won her 23rd Grand Slam title at the Australian Open in January. It later transpired she was pregnant at the time\n\n'She is pregnant, and I'm not'\n\nTursunov, 34, was once ranked as high as 20th in the world.\n\nThe Russian told BBC World Service Sport he did not think McEnroe was \"trying to talk women's tennis down\" but said \"the reality\" was that \"men are stronger in general\".\n\n\"I would hope that I would win against Serena,\" he added.\n\n\"It would be a similar argument to: who would run faster, the fastest woman or the fastest man? Tennis is becoming more and more a physical sport, so it's going to be hard for a woman to beat the men.\n\n\"It's not black and white, there are lots of factors to take into account. Physically I might not be in the best shape of my life but as an overall package I'm much better than my ranking would suggest. She is pregnant, and I'm not.\n\n\"I've never heard John say anything absolutely stupid - he knows his stuff. What he said about her being an incredible player is correct - explosive, powerful and she puts in a lot of work. But I would hope that I would win.\"\n\nBattle of the sexes\n\nA crowd of 30,000 watched Billie Jean King take on Bobby Riggs in Houston in 1973\n\nTennis matches between men and women have occurred before, mostly notably back in 1973 when Billie Jean King took on fellow American Bobby Riggs.\n\nRiggs, the world number one in the 1940s, retired in 1951 and at the age of 55 believed he could beat any of the top female players.\n\nKing originally declined to play Riggs and Australian Margaret Court - at the time the top female player in the world - stepped in. Riggs won 6-2 6-1.\n\nBut later that year, the top ranked women's player King - 26 years younger than Riggs at 29 - took him on in an exhibition match at the Houston Astrodome and won 6-4 6-3 6-3.\n\nA third 'Battle of the Sexes' match took in 1992 between American former world number one Jimmy Connors, aged 40 at the time, and Czech and American Martina Navratilova, who was 35.\n\nThe match took place under special rules to make it more competitive - Connors was allowed only one serve per point, and Navratilova was allowed to hit into half the doubles court. Connors won 7-5 6-2.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=17986528&cv=2.0&cj=1", "http://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=tennis::sport.tennis.story.40408799.page&x1=[urn:bbc:cps:ca0d7c00-05fd-fb4c-9fbe-a4ed6360cce7]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[SPORT_GNL]&x12=[SPORT]", "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/D9F6/production/_96689755_williams_aus_getty.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/D9F6/production/_96689755_williams_aus_getty.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/sport/tennis/40408799", "title": "Serena Williams: John McEnroe believes she would struggle on men's circuit", "meta_data": {"description": "Serena Williams disputes John McEnroe's claims that she would struggle to be in the world's top 700 if she was on the men's circuit.", "og": {"site_name": "BBC Sport", "url": "https://www.bbc.com/sport/tennis/40408799", "title": "Serena Williams: John McEnroe believes she would struggle on men's circuit", "description": "Serena Williams disputes John McEnroe's claims that she would struggle to be in the world's top 700 if she was on the men's circuit.", "type": "article", "image": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/D9F6/production/_96689755_williams_aus_getty.jpg"}, "rnews": {"datePublished": "2017/06/27 6:37:40"}, "apple-mobile-web-app-title": "BBC Sport", "apple-itunes-app": "app-id=594842980, app-argument=https://www.bbc.com/sport/tennis/40408799", "theme-color": "#ffd230", "application-name": "BBC Sport", "msapplication-TileImage": "https://static.bbc.co.uk/onesport/2.11.755/images/web-icons/bbc-sport-144.png", "msapplication-TileColor": "#ffd230", "twitter": {"site": "@bbcsport", "card": "summary_large_image"}, "article": {"section": "Tennis"}, "fb": {"pages": "1392506827668140,137920769558355,193435954068976,118450564909230,100978706649892,15286229625,21263239760,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739,1033940569952576,857410004307950,624989267645024,1471706783148263,228735667216,317278538359186,958681370814419,260967092113,168895963122035,114010462015043,8251776107,273726292719943,232455204224,1436581493296609,8585725981,8244244903,470911516262605,413132078795966,7519460786,1470145583204829", "admins": 100004154058350}, "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1498516660.0, "source": "http://www.bbc.com", "summary": ""}