{"url": "http://time.com/5020885/aly-raisman-sexual-abuse-usa-gymnastics-doctor-larry-nassar/", "text": "On Jan. 24, 2018, Larry Nassar was sentenced in Michigan state court to 40 years to 175 years in prison on criminal sexual conduct charges. He is also serving a federal sentence of 60 years for possession of child pornography and will be sentenced for additional state charges of sexual conduct with minors in another Michigan court on Jan. 31.\n\nAly Raisman says the knock came at eight o’clock at night. The future Olympic gold medalist was competing in Rotterdam, Netherlands in her first year at the coveted senior level, the group from which world and Olympic teams were selected. She was thousands of miles away from home, nervous about the competition to come, and without her usual support system of her parents and siblings. She opened the door and saw the team doctor for USA Gymnastics, Larry Nassar.\n\n“I thought you could use a massage,” she says he told her. She was 16.\n\nIt wasn’t the first time she says Nassar had appeared at her door at night, offering a massage under the guise of therapy. And it wouldn’t be the last, as Raisman disclosed in an interview with TIME and in her new book, Fierce.\n\nIt first happened several months earlier, when she was competing in Melbourne, Australia. At that meet, an official with USA Gymnastics, the sport’s governing body, saw Raisman wincing through practice with sore heels and an aching back and suggested that she see Nassar. He was a great doctor, Raisman says the official told her, and she should consider herself lucky that he would work with her. So when Nassar appeared at her door again, Raisman opened it and let him and let him “work” on her, the term that USA Gymnastics and the gymnasts used for Nassar’s treatments.\n\nThose treatments, it turns out, weren’t necessarily treatments at all. According to Raisman and other gymnasts who have described the procedures, Nassar’s so-called therapy seemed to consist primarily of invasive massage, touching the girls around their pelvic areas and vagina. Gymnasts were sent to Nassar for any pain — whether it was in the back, hip, or muscle — and he often suggested massage as the treatment, according to interviews with gymnasts. He rarely used gloves when working with the girls, and would touch them with his bare hands, including penetrating their vagina with his fingers.\n\nRaisman is the latest high-profile gymnast to accuse Nassar of sexual abuse. In October McKayla Maroney, her teammate on the squad that won gold at the 2012 London Olympics, said Nassar abused her for years, beginning when she was 13 years old. In all, more than 100 athletes have filed suit against Nassar and USA Gymnastics, alleging that the organization was complicit in not addressing reports of sexual abuse adequately. The plaintiffs in the various lawsuits also include athletes at Michigan State University, where Nassar had been employed.\n\nNassar pleaded guilty to child pornography charges in July and is awaiting sentencing in Michigan. He pleaded not guilty to charges of sexually abusing former patients and a family friend.\n\nNassar resigned from USA Gymnastics in the summer of 2015. When contacted for this story, Nassar’s attorney said a gag order in his client’s pending case prevented him from commenting on Raisman’s claims.\n\nRaisman, 23, opened up about her experiences in a recent interview with TIME at her family home in a quiet wooded neighborhood in Needham, Mass., outside of Boston. A rec room off the kitchen is filled with mementos from her record-setting career: with six medals won at the 2012 and 2016 Games, she’s America’s second-most decorated female Olympic gymnast. But as her mother, Lynn, lit a fire in the living room, Raisman settled into a deep brown leather couch and talked about how it could have all been derailed by abuse.\n\nShe says Nassar often closed his eyes and would be out of breath while working on her. Unaware that she was being molested, and still believing she was receiving medical treatment that would help her, she attributed his behavior to his being tired or jetlagged from the trips to competitions around the world.\n\nNow Raisman says she knows better. “I know people will say ‘Why didn’t she tell her mom? Why didn’t she say anything?’ But those questions are unfair,” she says. “The fact is I didn’t really know it was happening to me. What people don’t get is that he was a doctor. I would never have imagined that a doctor would abuse me or manipulate me so badly.”\n\nAfter years of making excuses for what she calls Nassar’s “weird” behavior during the treatment sessions, in July 2015 — three years after winning three medals at her first Olympics — she says she finally realized that Nassar had been sexually abusing her. Raisman says she received a call from USA Gymnastics president Steve Penny, who asked her to speak to an investigator who would be coming to Raisman’s home. He wouldn’t tell her what the visit was about.\n\nShe says the investigator, who was hired by USA Gymnastics to address complaints about Nassar, asked if Raisman felt safe, and if anyone had been making her feel uncomfortable. Then she asked specifically about Nassar, about what he did, how he treated her, how many times, and whether other people were present during the treatment sessions. At first Raisman continued to make excuses for Nassar, admitting that she often felt uncomfortable but also adding that he was a doctor, and didn’t mean to make her uncomfortable, and frequently brought her and the other girls gifts.\n\nWhen the investigator left, Raisman thought back on her encounters with Nassar and realized that the treatments had not been medical in nature but that she had been sexually abused. She declined to go into detail about the nature of the abuse. When Raisman called USA Gymnastics back the following day and asked to speak to the investigator again, she says she was told that the investigation was ongoing. She also received a text from an official asking her to stop talking about her experiences with Nassar, so as not to jeopardize the investigation. Requests for comment to Penny’s attorney were not immediately answered.\n\nRaisman says that the culture of success at all costs, and the power that USA Gymnastics wields over the gymnasts and their families vying for coveted Olympic spots, can allow sexual abuse to go unchecked as victims feel that it’s easier and potentially beneficial to stay quiet.\n\nRaisman says she now feels betrayed, by both Nassar, whom she trusted as a doctor, and by USA Gymnastics, whom she trusted not to put her in harm’s way.\n\nNassar, who was a licensed osteopath, was a volunteer at USA Gymnastics. Throughout her career, Raisman was told by the organization’s officials that Nassar was a talented doctor, one that the gymnasts were fortunate to work with. She trusted that advice, as did her parents. “When I went to a parents meeting, they would tell us your children are so lucky to have the best doctor, they are so lucky to work with Dr. Larry,” says Lynn Faber Raisman.\n\nNassar went out of his way to exploit that trust, according to Raisman and others who worked with him. He attended many of the elite training camps at the secluded Texas ranch run by the influential coaches Bela and Martha Karolyi, who led the U.S. Olympic team. The camp was invitation only, and a call to attend was considered a top honor for Olympic hopefuls. Once a month during the season, elite teams would gather at the ranch with their coaches and national trainers — but no family — for five days of intensive drills. The gymnasts lived in spartan dorms and their days consisted of little more than training, eating and sleeping. Cell service is spotty, so athletes barely communicated with their families during camp.\n\nIn that setting, Raisman says Nassar became their confidante and cheering squad, bestowing gifts and sweets, and much-needed encouragement and support. For young girls whose entire lives consisted of hours and hours of performing to impress others, Nassar seemed like an ally.\n\n“He was always, always, always on my side,” says Raisman. “He was always that person who would stick up for me and make me feel like he had my back. The more I think about it, the more I realize how twisted he was, how he manipulated me to make me think that he had my back when he didn’t.”\n\nRaisman says she is still processing her experience, and admits to being anxious about seeing male doctors. She has not yet retired from gymnastics, and has not ruled out trying to make a third Olympic team in Tokyo 2020. She hopes that her story, and those of others who have come forward, will change the way USA Gymnastics addresses reports of sexual abuse.\n\nIn response to Raisman’s claims, USA Gymnastics said in a statement, “We are appalled by the conduct of which Larry Nassar is accused, and we are very sorry that any athlete has been harmed during her or his gymnastics career. In the past year, Aly has become an advocate for many issues, and sharing her personal experience of abuse takes great courage. We are committed to doing what is right, and we want to work with Aly and all interested athletes to keep athletes safe.” The organization has adopted a Safe Sport Policy meant to prevent similar instances of abuse, and Steve Penny resigned as president in March 2017. Kerry Perry, a former sports marketing executive, was appointed the new president and CEO beginning Dec. 1.\n\nThose decisions are a start, says Raisman, but she wants to see other steps, including the creation of a separate body independent of USA Gymnastics that is responsible for handling reports of sexual abuse. “One day when I have a daughter I want to put her in gymnastics,” she says. “I want to make the sport fun, and make it safe. I love the sport, but winning doesn’t make the abuse OK.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/11/us-gymnast-aly-raisman-02.jpg", "https://api.time.com/wp-content/uploads/2020/03/AP20083363170829.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2020/04/tokyo-olympic-2021-coronavirus.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/11/us-gymnast-aly-raisman-02.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/us-gymnast-aly-raisman-02.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Alice Park"], "canonical_link": "https://time.com/5020885/aly-raisman-sexual-abuse-usa-gymnastics-doctor-larry-nassar/", "title": "Aly Raisman Opens Up About Sexual Abuse by USA Gymnastics Doctor Larry Nassar", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "nassar, aly raisman nassar, aly raisman 60 minutes, larry nassar, what happened to aly raisman, usa gymnastics doctor, aly raisman, raisman, dr larry nassar, who is larry nassar", "news_keywords": "nassar, aly raisman nassar, aly raisman 60 minutes, larry nassar, what happened to aly raisman, usa gymnastics doctor, aly raisman, raisman, dr larry nassar, who is larry nassar", "description": "Olympic gymnast Aly Raisman is the latest gymnast to accuse USA Gymnastics doctor Larry Nassar of sexual abuse.", "og": {"title": "Aly Raisman Opens Up About Sexual Abuse by USA Gymnastics Doctor Larry Nassar", "type": "article", "site_name": "Time", "url": "https://time.com/5020885/aly-raisman-sexual-abuse-usa-gymnastics-doctor-larry-nassar/", "description": "The Olympic gymnast says she feels betrayed by both Nassar and USA Gymnastics", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/11/us-gymnast-aly-raisman-02.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5020885/aly-raisman-sexual-abuse-usa-gymnastics-doctor-larry-nassar/", "description": "Olympic gymnast Aly Raisman is the latest gymnast to accuse USA Gymnastics doctor Larry Nassar of sexual abuse.", "media": "https://api.time.com/wp-content/uploads/2017/11/us-gymnast-aly-raisman-02.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5020885/aly-raisman-sexual-abuse-usa-gymnastics-doctor-larry-nassar/", "title": "Aly Raisman Opens Up About Sexual Abuse by USA Gymnastics Doctor Larry Nassar", "description": "The Olympic gymnast says she feels betrayed by both Nassar and USA Gymnastics", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/11/us-gymnast-aly-raisman-02.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}