{"url": "https://ew.com/movies/2018/07/17/jude-law-dumbledore-interview/", "text": "Fantastic Beasts: The Crimes of Grindelwald type Movie\n\nRe-castings of iconic beloved roles made famous by other actors are normally met with some degree of fandom skepticism. Yet when Warner Bros. announced Jude Law was stepping into the role of “young” Albus Dumbledore for Fantastic Beasts: The Crimes of Grindelwald, it felt like a perfectly shaped puzzle piece that clicked into place. Subsequent photos of Law as Dumbledore and a trailer showing the Sherlock Holmes and The Young Pope star giving some warm-yet-snappy line delivery as the charismatic future Hogwarts headmaster have subsequently reinforced the feeling that the 45-year-old actor was an unexpected yet ideal choice.\n\nBelow, Law takes our questions about how his Dumbledore differs from the Harry Potter-era character, details some of what author J.K. Rowling told him during their meeting, reveals (somewhat inadvertently) a couple intriguing plot details, and weighs in on the debate about how his character’s sexuality should be depicted.\n\nENTERTAINMENT WEEKLY: So before you took on this role, what research did you do, if any?\n\nJUDE LAW: I knew the books and the Harry Potter films pretty well, my children grew up with them so I grew up as an accompanying adult. And I’d seen and enjoyed the first [Fantastic Beasts] film. Then I had the good fortune and opportunity to sit with [author and screenwriter] J.K. Rowling shortly after we started work on it. She gave me a very good sense of Albus’ life journey and who he was and what was happening in his head and his heart and his world for this particular story.\n\nDid you look at the performances of previous Dumbledore actors Richard Harris and Michael Gambon?\n\nI’m sure they were in the back of my mind, because I’d seen their work and admired both of them as actors, greatly. I talked with [director] David Yates about that and we both decided that it wasn’t necessary to do an impersonation of one of them as a younger man. This is a man with almost 100 years ahead of him before he became that character so we wanted to look at who he was in this moment and construct our own version. It makes me laugh when he’s called “Young Albus” because I’m 45, so I’m more in the middle of a midlife crisis, but I’m happy to hold onto that as long as I can!\n\nI found it funny you went from playing the Young Pope to Young Albus in pop culture.\n\nThe word “Young” has to be in every part I play, it’s contractual.\n\nWhat did Rowling say in terms of the performance or interior life of the character that you found helpful?\n\nWell gosh, there was so much reference to interior life. The one thing that came out was the sense of play. He has a youthful mercurial approach to life, but that there’s something that hangs heavy in his heart, in his past, that underlies all of that. There’s a root of good humor and good heart and sense of self and a sense of past.\n\nHow much say, if any, did you have on how he looks in the film?\n\nWhen you hire [famed costume designer] Colleen Atwood, you know you’re in the hands of someone rather great. There’s no one quite like her in the world of film. She has a very clear vision. It was open and collaborative, there were tweaks here and there, but I was happily corralled into the overall look which was clear from the get-go.\n\nSo what’s Dumbledore like at this age and how different is he than how we know him?\n\nAs I mentioned before, there’s a sense of humor and mischief, a dash of anarchy, a sense of what’s right and what he believes in, and a sense of mystery. There’s also how he comes around to get people onto his way of thinking — which is rather indirectly. He also has a certain heaviness about him that I don’t want to reveal too much about — and that’s something he has to overcome, or hopes to overcome. He’s also got a great passion for sharing his knowledge, he’s a powerful and inclusive teacher.\n\nSo he teaches Transfiguration, right?\n\nHe doesn’t teach Transfiguration, actually, not at this stage.\n\nOh! Because in Potter lore, it was said he used to be a Transfiguration teacher before becoming headmaster…\n\nAt this stage in his career, he’s not. I’m not sure I’m allowed to say what he teaches…[Editor’s note: We think we may have figured it out]\n\nAh, okay. Well, what was your favorite spell to cast?\n\nWell … I ah … I only get to cast one. There’s a lot you don’t know about Albus in this film. And there are certain restrictions in storytelling — you’ll see, it all makes sense. You don’t see him in full flow yet.\n\nInteresting! And if I remember right, Dumbledore doesn’t yet have the infamous Elder Wand, right? So what’s his current wand like?\n\nAlbus doesn’t have the Elder Wand yet, no. I have a wand. It’s very reflective of him, beautiful dark wood root with a stone on one end.\n\nHe calls on Newt to go after Grindelwald. What’s his relationship with his former student?\n\nI think he admires in Newt this sense of moral code that he will always do the right thing because he can’t do anything but the right thing. I think he likes that Newt finds beauty in beasts because I think occasionally Dumbledore feels like a beast. And there’s a master and mentee kind of relationship. And Newt isn’t afraid to say when he thinks Dumbledore is wrong, it’s not servitude.\n\nThere was some uproar earlier this year when director David Yates told EW the character not “explicitly gay” in this film. What’s your take on how apparent Dumbledore’s sexuality should be?\n\nJo Rowling revealed some years back that Dumbledore was gay. That was a question I actually asked Jo and she said, yes, he’s gay. But as with humans, your sexuality doesn’t necessarily define you; he’s multifaceted. I suppose the question is: How is Dumbledore’s sexuality depicted in this film? What you got to remember this is only the second Fantastic Beasts film in a series and what’s brilliant about Jo’s writing is how she reveals her characters, peels them to the heart over time. You’re just getting to know Albus in this film, and there’s obviously a lot more to come. We learn a little about his past in the beginning of this film, and characters and their relationships will unfold naturally which I’m excited to reveal. But we’re not going to reveal everything all at once.\n\nObviously, Dumbledore had a relationship with Grindelwald. What’s that relationship like at this point in time? And what was it like working with Johnny Depp?\n\nI don’t actually have any scenes with Johnny. As I said before, this is only Part 2 of a longer story. I’ve always admired him from afar, but we don’t know each other, and I’ve not yet met him on this. In many ways that suits the relationship as it’s been many years since they’ve seen each other. So there’s complexity in that that’s fun to mine. Again, the past will reveal itself.\n\nFantastic Beasts: The Crimes of Grindelwald opens Nov. 16.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffb-62-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffb-62-2000.jpg", "keywords": [], "authors": ["James Hibberd", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "Maggie Fremont"], "canonical_link": "https://ew.com/movies/2018/07/17/jude-law-dumbledore-interview/", "title": "Jude Law breaks silence on playing Dumbledore", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Harry Potter,Jude Law", "news_keywords": "Harry Potter,Jude Law", "description": "Jude Law's first interview about playing Albus Dumbledore in the Harry Potter franchise movie Fantastic Beasts: The Crimes of Grindlewald", "og": {"title": "Exclusive: Jude Law breaks silence on playing young Dumbledore in 'Fantastic Beasts' sequel", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2018/07/17/jude-law-dumbledore-interview/", "description": "Re-castings of iconic beloved roles made famous by other actors are normally met with some degree of fandom skepticism. Yet when Warner Bros. announced Jude&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffb-62-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/movies/2018/07/17/jude-law-dumbledore-interview/", "description": "Jude Law's first interview about playing Albus Dumbledore in the Harry Potter franchise movie Fantastic Beasts: The Crimes of Grindlewald", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffb-62-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2018/07/17/jude-law-dumbledore-interview/", "title": "Exclusive: Jude Law breaks silence on playing young Dumbledore in 'Fantastic Beasts' sequel", "description": "Jude Law's first interview about playing Albus Dumbledore in the Harry Potter franchise movie Fantastic Beasts: The Crimes of Grindlewald", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffb-62-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1531756800.0, "source": "https://ew.com", "summary": ""}