{"url": "https://io9.gizmodo.com/izombies-10-best-brains-1793908671", "text": "All images: CW\n\nThe major conceit of iZombie, the lovely and addictive CW show about a zombie, her friends, and the crimes they solve, is that the main character eats the brains of murdered people and then starts to act like them. This means that star Rose McIver has a fairly huge acting challenge every week—and some weeks are harder than others.\n\n\n\nAdvertisement\n\nThis isn’t so much a compilation of our favorite episodes—or even of the episodes you must watch before season three premieres tomorrow. (Tip: watch as many of them as you can. They’re on Netflix.) No, this is a list of iZombie’s very best brains.\n\n10) Clive Jordan, “Method Head”\n\nAdvertisement\n\nIn “Method Head,” an actor on Liv’s favorite TV show—Zombie High, natch—dies when a prop knife gun (oops, sorry) is substituted for a real one. Liv eats Jordan’s brain and almost instantly becomes a walking stereotype of actors. She talks about finding “truth” and how to access real emotions for characters. The whole joke was the show making fun of itself and the industry it’s a part of, and it is great. Plus, Liv’s apple-eating mime deserves a 10 out of 10.\n\n\n\n9) The Fog, “Cape Town”\n\nLiv eats the brain of a costumed vigilante and decides to visit the local crime boss in full costume. It’s fun and there’s a bit of bleed through between the idea of a superhero and Liv’s actual, zombie-given powers. Plus, Ravi (Rahul Kohli) has a list of possible names for Liv that are fabulous: “Super Dead,” “Doctor Power,” “Dead Power,” “Doctor Dead,” and “Snow Woman.”\n\n\n\n8) Wendell Gordon Gale, “Grumpy Old Liv”\n\nAdvertisement\n\nThe season two premiere showed that even though some things in Liv’s life were changing, the basic premise of the show would stay the same. And Liv eating the brain of a horrible old racist showed that she was still going to consume brains and solve the murders of not-quite-perfect victims.\n\n\n\n6) Harry Cole, “Max Wager”\n\nAdvertisement\n\nLiv eats the brain of a compulsive gambler, which leads to her wagering on everything. But the scene that really gets to how much the brain drives Liv is when she invents an excuse to go back and place a bet with her meal’s former bookie.\n\n\n\n5) Marvin Webster, “The Exterminator”\n\nAdvertisement\n\nWhat should be a simple brain—that of a family man—becomes much creepier when Liv discovers after eating it that Webster was a hit man and a sociopath. This happened early in season one, and resulted in less of a broad comedy brain than we’d see in later episodes. The sociopath brain not feeling emotional pain also dovetailed nicely with Liv wanting to avoid how she feels about being a zombie.\n\n\n\n4) Chad Wolkof, “Zombie Bro”\n\nAdvertisement\n\nI hate that I still laugh about this. It’s a cliché, sure, but it’s such a fun cliché that I am okay with it. The comedy in this brain is superior and I love it. Liv’s frat bro brain made every scene she was in a comedy master class.\n\n\n\n3) Scott E., “Astroburger”\n\nAdvertisement\n\nScott E. had hallucinations, which lead to one of the best brain episodes ever. The whole episode has Liv working with someone who claims to be related to the victim, giving her information that helps her solve the crime. But, of course, he’s a hallucination, too. I wish the show had done more with the idea that the brains Liv relies on information for aren’t totally reliable. It’s not just the mood swings, it’s that she’s experiencing things as they would, and that’s not always the whole truth.\n\n\n\n2) Taylor Fowler, “Real Dead Housewife of Seattle”\n\nAdvertisement\n\nMcIver does some truly amazing work in this episode, “lunching on a lady who lunches.” There are moments of high comedy in this one—like this slap and her throwing water in the face of her nemesis—that are great. But the brain and Liv herself are also desperately lonely in a way that really gives nice shading to both characters. The twist at the end is lovely in showing how alone Liv feels. This is one of the best connections between brain and underlying emotional arc that show has ever done.\n\n\n\n1) Syd Wicked, “Abra Cadaver”\n\nAdvertisement\n\nI am on record as thinking that there was something truly perfect about the magician episode of iZombie. But the anchor is Liv’s transformation into a magician, courtesy of eating the brains of the totally-not-at-all-inspired-by-Criss-Angel illusionist. All of those gags are great, but it’s the denouement—in the classic “gather all the suspects in the parlor” style of mysteries, where a very dramatic Liv explains things—that makes this the best brain she’s ever eaten.\n\n\n\niZombie returns April 4 to the CW.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/j2dximbzq3brbcfcfca3.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/j2dximbzq3brbcfcfca3.png", "keywords": [], "authors": [], "canonical_link": "https://io9.gizmodo.com/izombies-10-best-brains-1793908671", "title": "iZombie's 10 Best Brains", "meta_data": {"google-site-verification": "Y4KzRYvFDIszZROrGQfpcKGpEMqT5ncYtgHhRW8D7P0", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eh1hvjxamru5z6aobgwc.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/eh1hvjxamru5z6aobgwc.png", "keywords": "superlist, izombie, television, cw, io9", "news_keywords": "superlist, izombie, television, cw, io9", "twitter": {"url": "https://io9.gizmodo.com/izombies-10-best-brains-1793908671", "card": "summary_large_image", "site": "@io9", "title": "iZombie's 10 Best Brains", "description": "The major conceit of iZombie, the lovely and addictive CW show about a zombie, her friends, and the crimes they solve, is that the main character eats the brains of murdered people and then starts to act like them. This means that star Rose McIver has a fairly huge acting challenge every week—and some weeks are harder than others.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/j2dximbzq3brbcfcfca3.png"}, "description": "The major conceit of iZombie, the lovely and addictive CW show about a zombie, her friends, and the crimes they solve, is that the main character eats the brains of murdered people and then starts to act like them. This means that star Rose McIver has a fairly huge acting challenge every week—and some weeks are harder than others.", "og": {"title": "iZombie's 10 Best Brains", "type": "article", "url": "https://io9.gizmodo.com/izombies-10-best-brains-1793908671", "description": "The major conceit of iZombie, the lovely and addictive CW show about a zombie, her friends, and the crimes they solve, is that the main character eats the brains of murdered people and then starts to act like them. This means that star Rose McIver has a fairly huge acting challenge every week—and some weeks are harder than others.", "locale": "en_US", "site_name": "io9", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/j2dximbzq3brbcfcfca3.png"}, "fb": {"app_id": 44615671688}}, "movies": [], "publish_date": null, "source": "https://io9.gizmodo.com", "summary": ""}