{"url": "https://www.bustle.com/p/why-did-nene-leakes-return-to-the-real-housewives-of-atlanta-season-10-brings-back-the-og-georgia-peach-3218094", "text": "Let's face it. The franchise just hasn't been the same since fan favorite NeNe Leakes departed The Real Housewives Of Atlanta after Season 7. But alas the OG peach is returning to the reality series for Season 10 with more fierceness and shadiness than ever before. But after two seasons have come and gone without her, you may be wondering: why is NeNe coming back to RHOA now?\n\nThe explanation for her return is quite simple. NeNe says that she's rejoining the cast for the benefit of her loyal fans. After the network made the official announcement in June 2017 that she was returning to the hit series, NeNe took to Bravo's The Daily Dish in praise of what all of the RHOA love has meant to her over the years. \"I just want to be the person to finally say to my fans who have supported me for so many years... I'm back and ready for Season 10. Let the shade begin, hunni!\" she said.\n\nFans first met the outspoken NeNe in the very first season of RHOA. With her blonde hair and dramatic personality she turned heads whenever she entered a room. From the beginning of the series she was a favorite, as she never hesitated to say exactly what was on her mind. She provided the utmost entertainment through her many witty quotes, comebacks, and side-eye before letting fans know that she sadly wouldn't return for season 8. Though, many fans have continued using her dramatic GIFS, memes, and one-liners in her absence. So she was gone, but not forgotten.\n\nIn 2015 she told People that leaving the show felt like a weight had \"been lifted off of [her] shoulders.\" That's no surprise being that most of the drama and arguments centered around NeNe. But in her defense she didn't start all of them. Nonetheless, NeNe officially traded in her peach in 2015.\n\n“This was definitely a hard decision for me,” Leakes told People at the time. “Me and my husband [Gregg Leakes] have been going back and forth on it for weeks now. But my contract is up and I just think this is the right time. This is my opportunity to spread my wings and do different things.” The announcement for her departure came on the heels of news that Leakes would be focusing on other projects. She had previously guest starred on the hit FOX series Glee and NBC's The New Normal. Soon after leaving RHOA she made her Broadway debut as the wicked stepmother in Cinderella, alongside actress Keke Palmer.\n\nBut regardless of why she originally left the reality series, longtime RHOA viewers are super excited to see NeNe back in the group. She'll be reuniting with fellow Housewives Kenya Moore, Cynthia Bailey, Kandi Burruss, Shereé Whitfield, and Porsha Williams. Also returning to the show, both in a part-time capacity, are Kim Zolciak-Biermann and newcomer model-actor Eva Marcille. Kim was an original Housewife along with NeNe, but unlike Kim, NeNe will resume her place as a full-time Housewife when the series returns on Sunday, Nov. 5.\n\nNBC/Bravo\n\n\"I am back and of course the haters know I'm here,\" NeNe says in Season 10 trailer, which means Atlanta (and particularly Porsha) better watch out. In an exclusive sneak peek on Entertainment Tonight, NeNe wastes no time inserting herself back into the drama when she candidly confronts Porsha over some nasty comments and bad blood at Cynthia's 50th birthday party. And anyone who remembers NeNe's previous seasons on the show knows that she's not one to back down from a (verbal) fight.\n\nSo how will this crew of Southern Belles get along with NeNe back in the building? Find out when RHOA returns for Season 10.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/efcd4f59-9964-4c6d-a6ad-4634b0b09f8a-getty-1156675580.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/11/3/33e88836-9c2d-465d-83db-996a7c207a55-nup_179430_0047.JPG?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/1da7b35e-7e55-4806-af9d-3280aa32eb53-getty-1173358504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/0da7790c-e1c6-4938-8b28-31640686b33f-getty-1209799362.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/11/3/0de8fda1-b4ec-4183-8ed5-a4dc398e2be5-nup_179430_1914.JPG?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/11/3/0de8fda1-b4ec-4183-8ed5-a4dc398e2be5-nup_179430_1914.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/11/3/0de8fda1-b4ec-4183-8ed5-a4dc398e2be5-nup_179430_1914.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/why-did-nene-leakes-return-to-the-real-housewives-of-atlanta-season-10-brings-back-the-og-georgia-peach-3218094", "title": "Why Did NeNe Leakes Return To 'The Real Housewives of Atlanta?' Season 10 Brings Back The O.G. Georgia Peach", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/why-did-nene-leakes-return-to-the-real-housewives-of-atlanta-season-10-brings-back-the-og-georgia-peach-3218094", "type": "article", "title": "NeNe Leakes Came Back To ‘Real Housewives’ Just For You", "description": "Let's face it. The franchise just hasn't been the same since fan favorite NeNe Leakes departed The Real Housewives Of Atlanta after Season 7. But alas the OG peach is returning to the reality series for Season 10 with more fierceness and shadiness…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/11/3/0de8fda1-b4ec-4183-8ed5-a4dc398e2be5-nup_179430_1914.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Let's face it. The franchise just hasn't been the same since fan favorite NeNe Leakes departed The Real Housewives Of Atlanta after Season 7. But alas the OG peach is returning to the reality series for Season 10 with more fierceness and shadiness…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}