{"url": "en.wikipedia.org/wiki/Charles_Manson", "text": "American criminal, cult leader\n\nCharles Milles Manson (né Maddox, November 12, 1934 – November 19, 2017) was an American criminal and cult leader. In mid-1967, he formed what became known as the \"Manson Family\", a quasi-commune based in California. His followers committed a series of nine murders at four locations in July and August 1969. According to the Los Angeles County district attorney, Manson plotted to start a race war, though he and others disputed this motive.[3] In 1971, he was convicted of first-degree murder and conspiracy to commit murder for the deaths of seven people. The prosecution conceded that Manson never literally ordered the murders, but they contended that his ideology constituted an overt act of conspiracy.[4] Manson was also convicted of first-degree murder for the deaths of Gary Hinman and Donald Shea.\n\nManson was an unemployed ex-convict who had spent more than half of his life in correctional institutions at the time when he began gathering his cult following. Before the murders, he was a singer-songwriter on the fringe of the Los Angeles music industry, chiefly through a chance association with Dennis Wilson of the Beach Boys. In 1968, the Beach Boys recorded Manson's song \"Cease to Exist\", retitled \"Never Learn Not to Love\" as the B-side on one of their singles, but without a credit to Manson.\n\nThe Los Angeles district attorney said that Manson was obsessed with the Beatles, particularly their 1968 self-titled album known as the \"White Album\". He claimed to be guided by his interpretation of the Beatles' lyrics and adopted the term \"Helter Skelter\" to describe an impending apocalyptic race war. At trial, the prosecution claimed that Manson and his followers believed that the murders would help precipitate that war. Other contemporary interviews and those who testified during the penalty phase of Manson's trial insisted that the Tate–LaBianca murders were copycat crimes designed to exonerate Manson's friend Bobby Beausoleil.[5][6]\n\nFrom the beginning of Manson's notoriety, a pop culture arose around him and he became an emblem of insanity, violence, and the macabre. Recordings were released commercially of songs written and performed by Manson, starting with Lie: The Love and Terror Cult (1970). Various musicians have covered some of his songs. Manson was originally sentenced to death, but his sentence was commuted to life with the possibility of parole after the California Supreme Court invalidated the state's death penalty statute in 1972. He served his life sentence at California State Prison, Corcoran and died at age 83 in late 2017.\n\n1934–1967: Early life\n\nChildhood\n\nCharles Manson was born on November 12, 1934, to 16-year-old Kathleen Manson-Bower-Cavender,[7] née Maddox (1918–1973),[8] in the University of Cincinnati Academic Health Center in Cincinnati, Ohio. He was first named \"no name Maddox\".[9][10][11] Within weeks, he was called Charles Milles Maddox.[9][12]\n\nManson's biological father appears to have been Colonel Walker Henderson Scott Sr. (1910–1954)[13] of Catlettsburg, Kentucky, against whom Kathleen Maddox filed a paternity suit that resulted in an agreed judgment in 1937. Manson may never have known his biological father.[9][11] Scott worked intermittently in local mills, and also had a local reputation as a con artist. He allowed Maddox to believe he was an army colonel, although \"Colonel\" was merely his given name. When Maddox told Scott she was pregnant, he told her he had been called away on army business; after several months she realized he had no intention of returning.[14]\n\nIn August 1934, before Manson's birth, Maddox married William Eugene Manson (1909–1961), whose occupation was listed on Charles's birth certificate as a \"laborer\" at a dry cleaning business.[15] Maddox went on drinking sprees for days at a time with her brother Luther, leaving Charles with a variety of babysitters. They were divorced on April 30, 1937, when a court accepted Manson's charge of \"gross neglect of duty\".[15]\n\nOn August 1, 1939, Maddox and Luther's girlfriend Julia Vickers spent the evening drinking with Frank Martin, a new acquaintance who appeared to be wealthy. Maddox and Vickers decided to rob him, and Maddox phoned her brother to help. They were incompetent thieves, and were found and arrested within hours. At the trial seven weeks later, Luther was sentenced to ten years in prison, and Kathleen was sentenced to five years.[16] Manson was placed in the home of an aunt and uncle in McMechen, West Virginia.[17] His mother was paroled in 1942. Manson later characterized the first weeks after she returned from prison as the happiest time in his life.[18]\n\nManson's family moved to Charleston, West Virginia, where Manson continually played truant and his mother spent her evenings drinking. She was arrested for grand larceny, but not convicted. After moving to Indianapolis, Maddox started attending Alcoholics Anonymous meetings where she met an alcoholic named Lewis (no first name), whom she married in August 1943.\n\nFirst offenses\n\nIn an interview with Diane Sawyer, Manson said that when he was nine years old, he set his school on fire.[19] Manson also began to get into trouble with the courts, for truancy and petty theft. The court initially tried to place Manson in a foster home, but could not find one. In 1947, at the age of 13, Manson was placed in the Gibault School for Boys in Terre Haute, Indiana, a school for male delinquents run by Catholic priests.\n\nGibault was a strict school, where punishment for even the tiniest infraction included beatings by either a wooden paddle or a leather strap. Manson ran away from Gibault, and slept in the woods, under bridges, and wherever else he could find a place of shelter.[20]\n\nManson fled home to his mother, and spent Christmas 1947 in McMechen, at his aunt and uncle's house.[21] His mother returned him to Gibault. Ten months later, he ran away to Indianapolis.\n\nIn 1948, in Indianapolis, Manson committed his first known crime by robbing a grocery store. At first the robbery was simply to find something to eat. However, Manson found a cigar box containing just over a hundred dollars, and he took the money. He used the money to rent a room on Indianapolis’ Skid Row and to buy food. For a time, Manson tried to go straight by getting a job delivering messages for Western Union. However, he quickly began to supplement his wages by petty theft.[22]\n\nHe was eventually caught, and in 1949, a sympathetic judge sent him to Boys Town, a juvenile facility in Omaha, Nebraska.[23] After four days at Boys Town, he and a student named Blackie Nielson stole a car and somehow obtained a gun. They used it to rob a grocery store and a casino, as they made their way to the home of Nielson's uncle in Peoria, Illinois.[24][25]\n\nNielson's uncle was a professional thief, and when the boys arrived he apparently took them on as apprentices.[26] Manson was arrested two weeks later during a nighttime raid on a Peoria store. In the investigation that followed, he was linked to his two earlier armed robberies. He was sent to the Indiana Boys School, a strict reform school.\n\nAt the school, other students raped Manson with the encouragement of a staff member, and he was repeatedly beaten. He ran away from the school eighteen times.[27] While at the school, Manson developed a self-defense technique he later called the \"insane game\". When he was physically unable to defend himself, he would screech, grimace and wave his arms to convince aggressors that he was insane. After a number of failed attempts, he escaped with two other boys in February 1951.[28][29]\n\nThe three escapees were attempting to drive to California in stolen cars when they were arrested in Utah. They had robbed several filling stations along the way. Driving a stolen car across state lines is a federal crime that violates the Dyer Act. Manson was sent to Washington, D.C.'s National Training School for Boys.[29] On arrival he was given aptitude tests. He was illiterate, but his IQ was 109 (the national average was 100). His case worker deemed him aggressively antisocial.[28][29]\n\nFirst imprisonment\n\nOn a psychiatrist's recommendation, Manson was transferred in October 1951 to Natural Bridge Honor Camp, a minimum security institution.[29] His aunt visited him and told administrators she would let him stay at her house and would help him find work. Manson had a parole hearing scheduled for February 1952. However, in January, he was caught raping a boy at knifepoint. Manson was transferred to the Federal Reformatory in Petersburg, Virginia. There he committed a further \"eight serious disciplinary offenses, three involving homosexual acts\". He was then moved to a maximum security reformatory at Chillicothe, Ohio, where he was expected to remain until his release on his 21st birthday in November 1955. Good behavior led to an early release in May 1954, to live with his aunt and uncle in McMechen.[30]\n\nBooking photo, Federal Correctional Institute Terminal Island, May 2, 1956\n\nIn January 1955, Manson married a hospital waitress named Rosalie Jean Willis.[31] Around October, about three months after he and his pregnant wife arrived in Los Angeles in a car he had stolen in Ohio, Manson was again charged with a federal crime for taking the vehicle across state lines. After a psychiatric evaluation, he was given five years' probation. Manson's failure to appear at a Los Angeles hearing on an identical charge filed in Florida resulted in his March 1956 arrest in Indianapolis. His probation was revoked; he was sentenced to three years' imprisonment at Terminal Island, San Pedro, California.[29]\n\nWhile Manson was in prison, Rosalie gave birth to their son Charles Manson Jr. During his first year at Terminal Island, Manson received visits from Rosalie and his mother, who were now living together in Los Angeles. In March 1957, when the visits from his wife ceased, his mother informed him Rosalie was living with another man. Less than two weeks before a scheduled parole hearing, Manson tried to escape by stealing a car. He was given five years' probation and his parole was denied.[29]\n\nSecond imprisonment\n\nManson received five years' parole in September 1958, the same year in which Rosalie received a decree of divorce. By November, he was pimping a 16-year-old girl and was receiving additional support from a girl with wealthy parents. In September 1959, he pleaded guilty to a charge of attempting to cash a forged U.S. Treasury check, which he claimed to have stolen from a mailbox; the latter charge was later dropped. He received a 10-year suspended sentence and probation after a young woman named Leona, who had an arrest record for prostitution, made a \"tearful plea\" before the court that she and Manson were \"deeply in love ... and would marry if Charlie were freed\".[29] Before the year's end, the woman did marry Manson, possibly so she would not be required to testify against him.[29]\n\nManson took Leona and another woman to New Mexico for purposes of prostitution, resulting in him being held and questioned for violating the Mann Act. Though he was released, Manson correctly suspected that the investigation had not ended. When he disappeared in violation of his probation, a bench warrant was issued. An indictment for violation of the Mann Act followed in April 1960.[29] When one of the women was arrested for prostitution, Manson was arrested in June in Laredo, Texas, and was returned to Los Angeles. For violating his probation on the check-cashing charge, he was ordered to serve his ten year sentence.[29]\n\nManson spent a year trying unsuccessfully to appeal the revocation of his probation. In July 1961, he was transferred from the Los Angeles County Jail to the United States Penitentiary at McNeil Island, Washington. There, he took guitar lessons from Barker–Karpis gang leader Alvin \"Creepy\" Karpis, and obtained from another inmate a contact name of someone at Universal Studios in Hollywood, Phil Kaufman.[32] According to Jeff Guinn's 2013 biography of Manson, his mother moved to Washington State to be closer to him during his McNeil Island incarceration, working nearby as a waitress.[33]\n\nAlthough the Mann Act charge had been dropped, the attempt to cash the Treasury check was still a federal offense. Manson's September 1961 annual review noted he had a \"tremendous drive to call attention to himself\", an observation echoed in September 1964.[29] In 1963, Leona was granted a divorce. During the process she alleged that she and Manson had a son, Charles Luther.[29] According to a popular urban legend, Manson auditioned unsuccessfully for the Monkees in late 1965; this is refuted by the fact that Manson was still incarcerated at McNeil Island at that time.[34]\n\nIn June 1966, Manson was sent for the second time to Terminal Island in preparation for early release. By the time of his release day on March 21, 1967, he had spent more than half of his 32 years in prisons and other institutions. This was mainly because he had broken federal laws. Federal sentences were, and remain, much more severe than state sentences for many of the same offenses.[29] Telling the authorities that prison had become his home, he requested permission to stay.[29]\n\n1968–1971: Cult formation, murders, and trial\n\n1969 mug shot\n\nCult formation\n\nOnce discharged from prison, Manson began attracting a group of followers, mostly young women, from around California. They were later dubbed the Manson Family.\n\nThe core members of Manson's following included Charles 'Tex' Watson, a musician and former actor; former musician and pornographic actor, Robert Beausoleil; Mary Brunner, previously a librarian; Susan Atkins; Linda Kasabian; Patricia Krenwinkel; and Leslie Van Houten.[35][36][37]\n\nMurders\n\nDuring the summer of 1969, Manson told his followers that there would soon be a race war between America's black population and the larger white population. Manson referred to the upcoming war as \"Helter Skelter.\"\n\nIn early August 1969, Manson encouraged his followers to start Helter Skelter, by committing murders in the Los Angeles area, and making the killings appear to be racially motivated. The Manson Family gained national notoriety after the murder of actress Sharon Tate and four others in her home on August 8 and 9, 1969,[38] and Leno and Rosemary LaBianca the next day. Tex Watson and three other members of the Family executed the Tate–LaBianca murders, acting under Manson's instructions.[39][40] While it was later accepted during his trial that Manson never expressly ordered for the murders to occur, his behavior constituted a conviction of first degree, and conspiracy to commit, murder. This was due to the fact that that his ideology of catalyzing a race war by killing those he saw as \"pigs\" was \"a fundamental part of life\" for those involved.[4] Family members were also responsible for other assaults, thefts, crimes, and the attempted assassination of United States President Gerald Ford in Sacramento by Lynette \"Squeaky\" Fromme.[41]\n\nWhile it is often thought that Manson never murdered or attempted to murder anyone himself, there is evidence[further explanation needed] that he shot drug dealer Bernard Crowe and left him for dead on July 1, 1969, although Crowe survived.[9]:91–96, 99–113\n\nTrial\n\nThe State of California tried Manson for the Tate and LaBianca murders in a single trial, with co-defendants, Leslie Van Houten, Susan Atkins, and Patricia Krenwinkel. Co-defendant, Tex Watson would be tried at a later date because he had not yet been extradited from Texas.\n\nThe trial began on July 15, 1970. Manson showed up wearing fringed buckskins, his typical clothing at Spahn Ranch.[42] The three female co-defendants wore short skirts.\n\nOn July 24, 1970 -- the first day of testimony -- Manson appeared in court with an \"X\" carved into his forehead. His followers issued a statement from Manson saying \"I have \"X'd myself from your world.\"[43] The following day, Manson's co-defendants, Van Houten, Atkins, and Krenwinkel, also appeared in court, with an \"X\" carved in their foreheads.\n\nDuring the trial, Manson and his co-defendants repeatedly interrupted the testimony and mocked the proceedings. All of the defendants were repeatedly removed from the trial, and forced to listen to testimony from other rooms in the courthouse.\n\nMembers of the Manson Family camped outside of the courthouse, and held a vigil on a street corner, because they had been excluded from the courtroom for being disruptive. Some of Manson's followers also carved crosses into their heads.[43] One day, members of the Manson Family showed up in saffron robes, and threatened to immolate themselves if Manson was convicted -- just as nuns in Vietnam had done in protest of the war.[44][45][46]\n\nThe State presented dozens of witnesses during the trial. However, its primary witness was Linda Kasabian, who was present during the Tate murders on August 8-9, 1969. Kasabian provided graphic testimony of the Tate murders, which she observed from outside the house. She was also in the car with Manson on the following evening, when he ordered the LaBianca killings. Kasabian spent days on the witness stand, being cross-examined by the defendants' lawyers.[47]\n\nIn early August 1970, President Richard Nixon told reporters that he believed that Manson was guilty of the murders, \"either directly or indirectly.\"[48] Manson obtained a newspaper showing the headline, and held it up to the jury.[49] The defendants' attorneys then moved for a mistrial, claiming that their clients had allegedly killed far fewer people than \"Nixon's war machine in Vietnam.\"[50] Judge Charles H. Older polled each member of the jury separately, to determine whether each juror was able to see the headline, and whether it affected his or her ability to make an independent decision in the case. All of the jurors told the judge that they could still decide independently.[51]\n\nShortly thereafter, the three female defendants -- Atkins, Krenwinkel and Van Houten -- stood up in the middle of the trial and simultaneously chanted, \"Nixon says we are guilty. So why go on?\" Judge Older had the defendants removed from the room.[52]\n\nOn October 5, 1970, Manson attempted to kill Judge Older while the jury was present in the room. Manson first threatened Judge Older, and then jumped over his lawyer's table with a sharpened pencil, in the direction of Judge Older. Manson was restrained before he was able to reach the judge. While he was being led out of the courtroom, Manson screamed at Judge Older, \"In the name of Christian justice, someone should cut your head off!\"[53] Meanwhile, the female defendants -- Atkins, Krenwinkel and Van Houten -- stood up and began chanting something in Latin.[54] Judge Older began wearing a .38 caliber pistol to the trial afterwards.[55]\n\nOn November 16, 1970, the State of California rested its case after presenting twenty-two weeks of evidence. The defendants then stunned the courtroom by announcing that they had no witnesses to present, and rested their case.[56]\n\nManson's testimony\n\nImmediately after defendants' counsel rested their case, the three female defendants, Van Houten, Krenwinkel and Atkins shouted that they wanted to testify. Their attorneys advised the court, in chambers, that they opposed their clients testifying. Apparently, the female defendants wanted to testify and tell the court that Manson had had nothing to do with the murders.[57]\n\nThe following day, Manson himself announced that he too wanted to testify. The judge allowed Manson to testify outside the presence of the jury. He stated as follows:\n\nThese children that come at you with knives, they are your children. You taught them. I didn't teach them. I just tried to help them stand up. Most of the people at the ranch that you call the Family were just people that you did not want.[58]\n\nManson continued, equating his actions to those of society at large:\n\nI know this: that in your hearts and your souls, you are as much responsible for the Vietnam war as I am for killing these people. . . . I can't judge any of you. I have no malice against you and no ribbons for you. But I think that it is high time that you all start looking at yourselves, and judging the lie that you live in.[59]\n\nManson concluded, claiming that he too was a creation of a system that he viewed as fundamentally violent and unjust:\n\nMy father is the jailhouse. My father is your system. . . . I am only what you made me. I am only a reflection of you. . . . You want to kill me? Ha! I am already dead -- have been all my life. I've spent twenty-three years in tombs that you have built.[60]\n\nAfter Manson finished speaking, Judge Older offered to let him testify before the jury. Manson replied that it was not necessary. Manson then told the female defendants that they no longer needed to testify.[61]\n\nOn November 30, 1970, Leslie Van Houten's attorney, Ronald Hughes, failed to appear for the closing arguments in the trial.[62] He was later found dead in a California state park. His body was badly decomposed, and it was impossible to tell the cause of death. Hughes had disagreed with Manson during the trial, taking the position that his client, Van Houten, should not testify to claim that Manson had no involvement with the murders. As a result, many have claimed that Hughes may have been murdered by the Manson Family.[63]\n\nOn January 25, 1971, the jury found Manson, Krenwinkel and Atkins guilty of first degree murder in all seven of the Tate and LaBianca killings. The jury found Van Houten guilty of murder in the first degree in the LaBianca killings.[64]\n\nSentencing phase of trial\n\nAfter the convictions, the court held a separate hearing before the same jury to determine whether the defendants should be sentenced to death.\n\nDuring the penalty phase of the trial, each of the three female defendants, Atkins, Van Houten, and Krenwinkel, took the stand. They provided graphic details of the murders and testified that Manson was not involved. According to the female defendants, they had committed the crimes in order to help fellow Manson Family member Bobby Beausoleil get out of jail, where he was being held for the murder of Gary Hinman. The female defendants testified that the Tate-LaBianca murders were intended to be \"copycat\" crimes, similar to the Hinman killing. Atkins, Krenwinkel and Van Houten claimed they did this at the direction of the state's prime witness, Linda Kasabian.[65]\n\nDuring their testimony, none of these defendants expressed remorse for the killings in response to questions from their own attorneys.[66]\n\nOn March 4, 1971, in the middle of the sentencing phase of the trial, Manson trimmed his beard to a fork and shaved his head, telling the media, \"I am the Devil, and the Devil always has a bald head!\" However, this time, the female defendants did not immediately shave their own heads. The prosecutor, Vincent Bugliosi, later speculated in his book, Helter Skelter, that they refrained from doing so, in order to not appear to be completely controlled by Manson (as they had when they each carved an \"X\" in their foreheads, earlier in the trial).[67]\n\nOn March 29, 1971, the jury announced that it had reached a decision with respect to the death penalty. When the women defendants were led into the courtroom for the decision, each of the women had also shaved their heads, as had Manson. The jury then announced its decision to sentence all four defendants to death.[68] Before leaving the courtroom, defendant Atkins shouted to the jury, \"Better lock your doors and watch your kids.\"[69]\n\nThe Manson murder trial was the longest murder trial in American history when it occurred, lasting nine and a half months. Along with the Lindbergh kidnapping case and the O.J. Simpson case during the 1990s, the case was the most publicized American criminal case of the twentieth century. The jury had been sequestered for 225 days, longer than any jury before it. The trial transcript alone ran to 209 volumes, or 31,716 pages.[70]\n\n1971–2017: Third imprisonment\n\nPost-trial events\n\nManson was admitted to state prison from Los Angeles County on April 22, 1971, for seven counts of first-degree murder and one count of conspiracy to commit murder for the deaths of Abigail Ann Folger, Wojciech Frykowski, Steven Earl Parent, Sharon Tate Polanski, Jay Sebring, and Leno and Rosemary LaBianca.\n\nWhen the death penalty was ruled unconstitutional in 1972, Manson was resentenced to life with the possibility of parole. His original death sentence was modified to life on February 2, 1977.\n\nOn December 13, 1971, Manson was convicted of first-degree murder in Los Angeles County Court for the July 25, 1969 death of musician Gary Hinman. He was also convicted of first-degree murder for the August 1969 death of Donald Jerome \"Shorty\" Shea. A footnote to the conclusion of California v. Anderson, the 1972 decision that neutralized California's death sentences, stated that, \"any prisoner now under a sentence of death ... may file a petition for writ of habeas corpus in the superior court inviting that court to modify its judgment to provide for the appropriate alternative punishment of life imprisonment or life imprisonment without possibility of parole specified by statute for the crime for which he was sentenced to death.\"[71] This made Manson eligible to apply for parole after seven years' incarceration.[72] Accordingly, his first parole hearing took place on November 16, 1978, at California Medical Facility in Vacaville, and his petition was rejected.[73][74]\n\n1980s–1990s\n\nIn the 1980s, Manson gave four interviews to the mainstream media. The first, recorded at California Medical Facility and aired on June 13, 1981 was by Tom Snyder for NBC's The Tomorrow Show. The second, recorded at San Quentin State Prison and aired on March 7, 1986 was by Charlie Rose for CBS News Nightwatch, and it won the national news Emmy Award for Best Interview in 1987.[75] The third, with Geraldo Rivera in 1988, was part of the journalist's prime-time special on Satanism.[76] At least as early as the Snyder interview, Manson's forehead bore a swastika in the spot where the X carved during his trial had been.[77]\n\nNikolas Schreck conducted an interview with Manson for his documentary Charles Manson Superstar (1989). Schreck concluded that Manson was not insane but merely acting that way out of frustration.[78][79]\n\nOn September 25, 1984, Manson was imprisoned in the California Medical Facility at Vacaville when inmate Jan Holmstrom poured paint thinner on him and set him on fire, causing second- and third-degree burns on over 20 percent of his body. Holmstrom explained that Manson had objected to his Hare Krishna chants and verbally threatened him.[80]\n\nAfter 1989, Manson was housed in the Protective Housing Unit at California State Prison, Corcoran, in Kings County. The unit houses inmates whose safety would be endangered by general population housing. He had also been housed at San Quentin State Prison,[75] California Medical Facility in Vacaville,[80] Folsom State Prison and Pelican Bay State Prison.[81][citation needed] In June 1997, a prison disciplinary committee found that Manson had been trafficking drugs.[81] That August he was moved from Corcoran State Prison to Pelican Bay State Prison.[81]\n\n2000s–2017\n\nManson, age 76, June 2011\n\nOn September 5, 2007, MSNBC aired The Mind of Manson, a complete version of a 1987 interview at California's San Quentin State Prison. The footage of the \"unshackled, unapologetic, and unruly\" Manson had been considered \"so unbelievable\" that only seven minutes of it had originally been broadcast on Today, for which it had been recorded.[82]\n\nIn March 2009, a photograph of Manson showing a receding hairline, grizzled gray beard and hair, and the swastika tattoo still prominent on his forehead was released to the public by California corrections officials.[83]\n\nIn 2010, the Los Angeles Times reported that Manson was caught with a cell phone in 2009 and had contacted people in California, New Jersey, Florida and British Columbia. A spokesperson for the California Department of Corrections stated that it was not known if Manson had used the phone for criminal purposes.[84] Manson also recorded an album of acoustic pop songs with additional production by Henry Rollins, titled Completion. Only five copies were pressed: two belong to Rollins, while the other three are presumed to have been with Manson. The album remains unreleased.[85]\n\nIllness and death\n\nOn January 1, 2017, Manson was suffering from gastrointestinal bleeding at California State Prison in Corcoran when he was rushed to Mercy Hospital in downtown Bakersfield. A source told the Los Angeles Times that Manson was seriously ill,[86] and TMZ reported that his doctors considered him \"too weak\" for surgery.[87] He was returned to prison on January 6, and the nature of his treatment was not disclosed.[88] On November 15, 2017, an unauthorized source said that Manson had returned to a hospital in Bakersfield,[89] but the California Department of Corrections and Rehabilitation did not confirm this in conformity with state and federal medical privacy laws.[90] He died from cardiac arrest resulting from respiratory failure and colon cancer at the hospital on November 19.[91][92][93]\n\nThree people stated their intention to claim Manson's estate and body.[94][95][96] Manson's grandson Jason Freeman stated his intent to take possession of Manson's remains and personal effects.[97] Manson's pen-pal Michael Channels claimed to have a Manson will dated February 14, 2002 which left Manson's entire estate and Manson's body to Channels.[98][99] Manson's friend Ben Gurecki claimed to have a Manson will dated January 2017 which gives the estate and Manson's body to Matthew Roberts, another alleged son of Manson.[94][95] In 2012, CNN ran a DNA match to see if Freeman and Roberts were related to each other and found that they were not. According to CNN, two prior attempts to DNA match Roberts with genetic material from Manson failed, but the results were reportedly contaminated.[100] On March 12, 2018, the Kern County Superior Court in California decided in favor of Freeman in regard to Manson's body. Freeman had Manson cremated on March 20, 2018.[101] As of February 7, 2020, Channels and Freeman still had petitions to California courts attempting to establish the heir of Manson's estate. At that time, Channels was attempting to force Freeman to submit DNA to the court for testing.[102]\n\nPersonal life\n\nReligion\n\nIn July 1961, Manson claimed his religion was Scientology,[103] and identified as a Scientologist after studying the religion while incarcerated with the help of fellow inmate Lanier Rayner; however, he was not a member of the Church of Scientology.[104][105][106] Manson completed 150 hours of auditing before declaring Scientology \"too crazy\".[107]\n\nRelationships and alleged child\n\nIn 2009, Los Angeles disk jockey Matthew Roberts released correspondence and other evidence indicating that he might be Manson's biological son. Roberts' biological mother claims that she was a member of the Manson Family who left in mid-1967 after being raped by Manson; she returned to her parents' home to complete the pregnancy, gave birth on March 22, 1968, and put Roberts up for adoption. CNN conducted a DNA test between Matthew Roberts and Manson's known biological grandson Jason Freeman in 2012, showing that Roberts and Freeman did not share DNA.[100] Roberts subsequently attempted to establish that Manson was his father through a direct DNA test which proved definitively that Roberts and Manson were not related.[108]\n\nIn 2014, it was announced[by whom?] that the imprisoned Manson was engaged to 26 year-old Afton Elaine Burton and had obtained a marriage license on November 7.[109] Manson gave Burton the nickname \"Star\". She had been visiting him in prison for at least nine years and maintained several websites that proclaimed his innocence.[110] The wedding license expired on February 5, 2015 without a marriage ceremony taking place.[111] Journalist Daniel Simone reported that the wedding was cancelled after Manson discovered that Burton only wanted to marry him so that she and friend Craig Hammond could use his corpse as a tourist attraction after his death.[111][112] According to Simone, Manson believed that he would never die and may simply have used the possibility of marriage as a way to encourage Burton and Hammond to continue visiting him and bringing him gifts. Burton said on her website that the reason that the marriage did not take place was merely logistical. Manson was suffering from an infection and had been in a prison medical facility for two months and could not receive visitors. She said that she still hoped that the marriage license would be renewed and the marriage would take place.[111]\n\nPsychology\n\nOn April 11, 2012, Manson was denied release at his 12th parole hearing, which he did not attend. After his March 27, 1997 parole hearing, Manson refused to attend any of his later hearings. The panel at that hearing noted that Manson had a \"history of controlling behavior\" and \"mental health issues\" including schizophrenia and paranoid delusional disorder, and was too great a danger to be released.[113] The panel also noted that Manson had received 108 rules violation reports, had no indication of remorse, no insight into the causative factors of the crimes, lacked understanding of the magnitude of the crimes, had an exceptional, callous disregard for human suffering and had no parole plans.[114] At the April 11, 2012, parole hearing, it was determined that Manson would not be reconsidered for parole for another 15 years, i.e. not before 2027, at which time he would have been 92 years old.[115]\n\nLegacy\n\nCultural impact\n\nBeginning in January 1970, the left-wing newspapers Los Angeles Free Press and Tuesday's Child embraced Manson as a hero-figure, and Tuesday's Child proclaimed him \"Man of the Year\". In June 1970, Rolling Stone made him their cover story in \"Charles Manson: The Incredible Story of the Most Dangerous Man Alive\".[116] A Rolling Stone writer visited the Los Angeles District Attorney's office while preparing that story,[117] and he was shocked by a photograph of the \"Healter [sic] Skelter\" that Manson's disciples had written on a wall in their victim's blood.[118] Prosecutor Vincent Bugliosi pointed out the dispute in the underground press over whether Manson was \"Christ returned\" or \"a sick symbol of our times\".[citation needed]\n\nBernardine Dohrn of the Weather Underground reportedly said of the Tate murders: \"Dig it, first they killed those pigs, then they ate dinner in the same room with them, then they even shoved a fork into a victim's stomach. Wild!\"[119] Neo-Nazi and Manson follower James Mason founded the Universal Order, a group that has influenced other movements such as the neo-Nazi terrorist Atomwaffen Division. Universal Order's name and logo is a swastika between scales of justice, remotely designed[clarification needed] by Manson. Bugliosi quoted a BBC employee's assertion that a \"neo-Manson cult\" existed in Europe, represented by approximately 70 rock bands playing songs by Manson and \"songs in support of him\".[120]\n\nMusic\n\nManson was a struggling musician, seeking to make it big in Hollywood between 1967 and 1969. The Beach Boys did a cover of one of his songs. Other songs were publicly released only after the trial for the Tate murders started. On March 6, 1970,[121] LIE, an album of Manson music, was released.[122][123][124] This included \"Cease to Exist\", a Manson composition the Beach Boys had recorded with modified lyrics and the title \"Never Learn Not to Love\".[125][126] Over the next couple of months only about 300 of the album's 2,000 copies sold.[127]\n\nThere have been several other releases of Manson recordings – both musical and spoken. One of these, The Family Jams, includes two compact discs of Manson's songs recorded by the Family in 1970, after Manson and the others had been arrested. Guitar and lead vocals are supplied by Steve Grogan;[128] additional vocals are supplied by Lynette Fromme, Sandra Good, Catherine Share, and others.[129] One Mind, an album of music, poetry, and spoken word, new at the time of its release, in April 2005, was put out under a Creative Commons license.[130][131]\n\nAmerican rock band Guns N' Roses recorded Manson's \"Look at Your Game, Girl\", included as an unlisted 13th track on their 1993 album \"The Spaghetti Incident?\"[120][132][133] \"My Monkey\", which appears on Portrait of an American Family by the American rock band Marilyn Manson, includes the lyrics \"I had a little monkey / I sent him to the country and I fed him on gingerbread / Along came a choo-choo / Knocked my monkey cuckoo / And now my monkey's dead.\" These lyrics are from Manson's \"Mechanical Man\",[134] which is heard on LIE. Crispin Glover covered \"Never Say 'Never' to Always\" on his album The Big Problem ≠ The Solution. The Solution=Let It Be released in 1989.\n\nMusical performers such as Kasabian,[135] Spahn Ranch,[136] and Marilyn Manson[137] derived their names from Manson and his lore.\n\nDocumentaries\n\nFiction inspired by Manson\n\nSee also\n\nATWA, an acronym propounded by Manson and followers, for Air, Trees, Water, Animals and All The Way Alive\n\nDoomsday cult\n\nTrials of the Century\n\nReferences\n\nCitations\n\nWorks cited", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Johnny-automatic-scales-of-justice.svg/24px-Johnny-automatic-scales-of-justice.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/FolsomStatePrison.jpg/220px-FolsomStatePrison.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/5/59/Manson1968.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Wikiversity-logo-en.svg/27px-Wikiversity-logo-en.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Charles_Manson_signature2.svg/150px-Charles_Manson_signature2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/8/85/Charles_Manson_mugshot_FCI_Terminal_Island_California_1956-05-02_3845-CAL.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Manson1968.jpg/220px-Manson1968.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/24px-Audio_a.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Charles-mansonbookingphoto_%28enlarged%29_1971_%28cropped%29.jpg/170px-Charles-mansonbookingphoto_%28enlarged%29_1971_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/28/P_religion_world.svg/23px-P_religion_world.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Manson-June-2011.jpg/170px-Manson-June-2011.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Flag_of_California.svg/24px-Flag_of_California.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_Ohio.svg/24px-Flag_of_Ohio.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/59/Manson1968.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Charles_Manson", "title": "Charles Manson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/5/59/Manson1968.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}