{"url": "https://people.com/style/kourtney-kardashian-poses-nude-v-magazine/", "text": "Kim Kardashian West isn’t the only KarJenner who loves a good nude photoshoot.\n\nKourtney Kardashian, who celebrated her 39th birthday two days ago, stripped it all off for her latest pictorial with V Magazine topromote her Kylie Cosmetics makeup collaboration launching April 24th.\n\nGet push notifications with news, features and more.\n\nThe mom of three showed off her hard earned toned physique and left little to the imagination while posing completely nude with only a hot-pink patent leather trench coat draped over her shoulders and her arm strategically placed to conceal her chest — while still maintaining a subtle hint of side boob.\n\nImage zoom\n\nAnother one of Kardashian’s looks for the shoot was a sexy dominatrix-inspired black leather trench and strappy bra, and she wore the new liquid lipsticks and eye shadows from her limited edition makeup collection she created with the help of sister Kylie Jenner, 20.\n\n“One night when we were at our mom’s house, she had mentioned she had some ideas about a possible collab,” Kardashian told the magazine of how the genesis of their collaboration. Kardashian previously said on Instagram the collection was over a year in the making, because the duo totally changed directions with their concept for the products.\n\n“At the time, it was going to be just lips and we were going back and forth about the packaging, and for both of us in the moment, it didn’t feel fully right. We ended up creating something totally different from what we were talking about before,” the Keeping Up with the Kardashians star said. “We decided to do three eyeshadow palettes and a lip to go with each palette. And then came the packaging, which is also completely different from what we originally imagined last year.”\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\nAlthough Kardashian’s everyday makeup look is “pretty yet neutral with the right amount of shadows in the right areas,” for her collection, the star experimented with daring eye shadow hues like burgundy, emerald and yellow gold.\n\nImage zoom Greg Swales exclusively for V Magazine\n\n“We did a dark green eyeshadow look that I loved [for the shoot], which I think is a very strong Kourtney look that I’d never done before,” she said.\n\nRELATED PHOTOS: UPDATED! Your Comprehensive Guide to Every Swimsuit the Kardashian-Jenners Have Worn Over the Years\n\nHer decision to experiment more with color goes back to how she loved to play with makeup as a teen. “I think using color is something I did a lot in high school. My sisters and I used to do bright colors on our eyelids with eyeshadow. So I think having the red and green colors included in the collection as well as this yellow gold metallic is calling back to makeup that I’ve doing since forever and comes out when I’m in the mood to play with makeup,” Kardashian explained.\n\nBut she also made sure to mix in multiple neutral shades in the three palettes to ensure she could create any look, from the most natural to dramatic.\n\n“Kylie was the one who really wanted to do the three eyeshadow palettes, and I loved that idea because it gave us a chance to be more creative with the whole thing,” Kardashian said.\n\n“Also all of the metallics are so great, and it’s more about how you choose to apply them. You could do a metallic look and then put a gloss over them or really you could apply them and keep them toned down and neutral. I really do think these palettes can do both!”\n\nAs for collaborating with Jenner on the line, Kardashian said her sister is ” very opinionated when it comes to her makeup line” but made sure to incorporate her ideas.”\n\n“With the red color, I was very inspired by geishas because we had just been in Japan and all of the geishas we had met had red eyeshadow,” Kardashian said. “Kylie would say her vision for this collection and then I would chime in with my ideas, and then after we came up with the products, it was easy to tweak here and there without any tension. In the end, we would both agree on everything.”\n\nSo far, no one else in the KarJenner krew has tested out the products, but Kardashian said she’s most excited for her sister Kim to give her feedback on everything.\n\nKardashian said, “I can’t wait to hear their opinions. I think especially Kim because she loves beauty and has her own line, so I can’t wait to give it to her and hear what she thinks.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look1-1-2000.jpg", "keywords": [], "authors": ["Kaitlyn Frey"], "canonical_link": "https://people.com/style/kourtney-kardashian-poses-nude-v-magazine/", "title": "Kourtney Kardashian Poses Nude for V Magazine to Promote Kylie Cosmetics Collaboration", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Beauty,Beauty News,Kardashians,Kourtney Kardashian,Kylie Jenner,Magazine Covers,Makeup,News,Style,Style News", "news_keywords": "Beauty,Beauty News,Kardashians,Kourtney Kardashian,Kylie Jenner,Magazine Covers,Makeup,News,Style,Style News", "description": "Kourtney Kardashian promotes her Kylie Cosmetics collaboration launching April 24 with a nude shoot for V Magazine", "og": {"title": "Kourtney Kardashian Poses Nude for V Magazine to Promote Kylie Cosmetics Collaboration", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/kourtney-kardashian-poses-nude-v-magazine/", "description": "Kim Kardashian West isn’t the only KarJenner who loves a good nude photoshoot. Kourtney Kardashian, who celebrated her 39th birthday two days ago, stripped it&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look1-1-2000.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/style/kourtney-kardashian-poses-nude-v-magazine/", "description": "Kourtney Kardashian promotes her Kylie Cosmetics collaboration launching April 24 with a nude shoot for V Magazine", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look1-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/kourtney-kardashian-poses-nude-v-magazine/", "title": "Kourtney Kardashian Poses Nude for V Magazine to Promote Kylie Cosmetics Collaboration", "description": "Kourtney Kardashian promotes her Kylie Cosmetics collaboration launching April 24 with a nude shoot for V Magazine", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkourtney_v_look1-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}