{"url": "https://www.usatoday.com/story/life/people/2018/09/06/brad-pitt-and-angelina-jolie-could-they-go-trial-over-kids/1197789002/", "text": "Wrap it up.\n\nThat’s what image experts would say to Angelina Jolie and Brad Pitt, the once-golden couple now edging into explosive Hollywood divorce territory occupied by the likes of Woody Allen and Mia Farrow.\n\nToday, \"most celebrities keep their divorces private, they settle them quickly usually with a press release,” says Christopher Melcher, partner of the California firm Walzer Melcher family law. “We rarely see this kind of nastiness that's happened recently.”\n\nBrangelina is now shorthand for textbook anti-conscious uncoupling. Still, resolution – especially when six children are involved – is a thorny endeavor. So could this all end with a messy public spectacle?\n\nAfter a summer of freshly boiled acrimony, the fractured family is back in Los Angeles, and the couple has seemingly recommitted to a previously agreed-upon temporary custody agreement. A scheduled hearing in family court on Aug. 21 was postponed. Pitt is seeing the children regularly.\n\nJolie “continues to support the reconciliation of the children with Brad and everything she does is focused on healing her family,” a source close to Jolie, who was not authorized to speak publicly, tells USA TODAY.\n\nBut what a road to get to this point.\n\nA messy summer\n\nIn June, their divorce made headlines again when the couple's private judge threatened Jolie, saying if the actress doesn't start encouraging her children to forge relationships with her ex, she could be in danger of losing custody.\n\nThe judge further ordered Jolie to arrange a phone call with the kids and their doctors to explain to the children that “the court has determined that each of them are safe with their father.”\n\n“What I imagine is difficult for Angelina is, how can somebody else override a parent’s decision? How can a judge tell her as a mom what’s best for her children? That’s the consequence on not agreeing with the other parent and submitting it to a judge,” says Melcher.\n\nThe lawyer adds: \"Maybe she knows something nobody else does, but the judge did not agree with her. And ultimately, the judge makes these decisions.\"\n\nMore:The highest-paid actresses in the world: Johansson, Jolie, Aniston\n\nAnd so it got uglier. With both stars asserting they wanted to move forward in dissolving their marriage (a process known as bifurcation), Jolie’s new lawyer, Samantha Bley DeJean, accused Pitt of not having paid “meaningful\" child support in court documents.\n\nAs the news went viral, Pitt’s lawyers quickly countered, detailing an $8 million housing loan plus $1.3 million in child care paid since their split. Pitt's lawyer, Lance Spiegel, called the legal maneuvering \"a thinly veiled effort to manipulate media coverage.\"\n\nBut Jolie's lawyer doubled down, indicating that not only was Pitt charging the mother of his children interest on her new home, but he was also not paying half their expenses.\n\nImage-wise, all of this matters: In the past two years, Jolie’s negative Q score, the industry's most commonly used measure of likability, has gone up four points. Pitt's negative score has remained static.\n\n“Whatever’s been happening in the media, he’s been dealing with it better, based on the data,” says Henry Schafer, executive vice president of Q Score. \"It looks like based on consumer reaction that he’s weathering the storm much better than she is.”\n\nThe downfall of Brangelina\n\nThe uber-private, A-list couple married in 2014 after a decade of globe-trotting and children together, but the facade shattered in September 2016, when Jolie filed for divorce citing the \"health of her family\" after a private plane ride in which Pitt was alleged to have had a physical altercation with their eldest child, Maddox, who is now 17.\n\nIn the months that followed, each staffed up with power lawyers and various advisers. Allegations flew in the media and legal documents were leaked from family court. Pitt, who was cleared of child abuse allegations, confessed a serious drinking problem to GQ, saying he was now sober.\n\nThe two appeared to reach a detente in January 2017, releasing a joint statement stating they had agreed to handle their divorce privately and would work together to reunify their family. (California law favors joint custody in divorce cases.)\n\nMore:Lawyer seeks to sue Brad Pitt's Make It Right foundation over houses in New Orleans\n\nThen this June came, with their judge dressing down Jolie for withholding access to their children. (The court is allowing Maddox to decide how much time he wants to spend with his father. Their other five children are Pax, 14; Zahara, 13; Shiloh, 12; and 10-year old twins Vivienne and Knox.)\n\n\"They’re not healing from divorce. They’re healing from some ... from life, from things in life,\" Jolie told Vanity Fair in September 2017.\n\nIn late August, Jolie officially split from her Los Angeles divorce attorney, Laura Wasser, and hired DeJean, a San Francisco-based attorney whose \"expertise is the protection and best interest of children,” said Jolie's rep, Mindy Nyby, at the time.\n\nFamily law attorney Jeffrey Cohen of New York's Cohen Goldstein calls such positioning \"an adversarial stand. This is a sign of the deterioration of the litigation, of the relationships. It looks like it's heading south.\"\n\nAnd it could it get worse. If Jolie and Pitt can’t bury the hatchet, there’s a chance their custody battle could end up at trial, creating a media storm neither star's image will be able to weather.\n\nPitt told GQ in May 2017 he knew such an outcome would be a “spectacular” nightmare for everyone involved.\n\n\"I see it happen to friends – I see where the one spouse literally can't tell their own part in it, and is still competing with the other in some way and wants to destroy them and needs vindication by destruction, and just wasting years on that hatred,\" said Pitt then. \"I don't want to live that way.\"\n\nTo that end, compromise could be around the corner. \"Almost every case is settled in the hallway between the parties,\" says Melcher.\n\nAnd there are a million reasons to go that way.\n\n“If it goes to an open trial (with) public proceedings, this would be as juicy as they come,” says Cohen. “These are two of the most well-known actors on the planet.”", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5763191432001_5763191734001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/09/05/USAT/f0695ff5-8057-44a2-8e8b-2a46dc863a7f-AP_People-Pitt-Jolie-New_Orleans_Home.JPG?crop=1999,1124,x0,y16&width=1999&height=1124&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/09/05/USAT/f0695ff5-8057-44a2-8e8b-2a46dc863a7f-AP_People-Pitt-Jolie-New_Orleans_Home.JPG?width=660&height=497&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/09/05/USAT/f0695ff5-8057-44a2-8e8b-2a46dc863a7f-AP_People-Pitt-Jolie-New_Orleans_Home.JPG?crop=1999,1124,x0,y16&width=1999&height=1124&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/09/06/brad-pitt-and-angelina-jolie-could-they-go-trial-over-kids/1197789002/", "title": "Brad Pitt and Angelina Jolie: Could they go to trial over the kids?", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Brad Pitt and Angelina Jolie: Could they go to trial over the kids?", "description": "Divorce lawyers say resolution – with six kids involved – is a thorny endeavor. But two years in, could it get worse for Brad Pitt and Angelina Jolie?", "url": "https://www.usatoday.com/story/life/people/2018/09/06/brad-pitt-and-angelina-jolie-could-they-go-trial-over-kids/1197789002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/09/05/USAT/f0695ff5-8057-44a2-8e8b-2a46dc863a7f-AP_People-Pitt-Jolie-New_Orleans_Home.JPG?crop=1999,1124,x0,y16&width=1999&height=1124&format=pjpg&auto=webp", "width": 1999, "height": 1124}, "type": "article"}, "article": {"author": "Andrea Mandell", "content_tier": "free", "opinion": "false"}, "description": "Divorce lawyers say resolution – with six kids involved – is a thorny endeavor. But two years in, could it get worse for Brad Pitt and Angelina Jolie?", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/09/05/USAT/f0695ff5-8057-44a2-8e8b-2a46dc863a7f-AP_People-Pitt-Jolie-New_Orleans_Home.JPG?crop=1999,1124,x0,y16&width=1600&height=800&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Brad Pitt and Angelina Jolie: Could they go to trial over the kids?", "description": "Divorce lawyers say resolution – with six kids involved – is a thorny endeavor. But two years in, could it get worse for Brad Pitt and Angelina Jolie?"}}, "movies": [], "publish_date": 1536163200.0, "source": "https://www.usatoday.com", "summary": ""}