{"url": "https://www.bustle.com/articles/148825-9-hacks-to-get-smooth-sleek-hair-from-just-air-drying", "text": "On weekdays, when your schedule is already jam-packed, it might be tempting to forgo your usual styling routine and run out the door with wet hair. But sometimes letting your hair dry naturally can cause your locks to look dry, frizzy, or limp. How do you get smooth, sleek hair from just air drying? It turns out that this is entirely possible, and the practice will give your hair a much-needed break from excess heat styling.\n\nGoing hot tool-free will give your arms a break from the grueling blow drying process, and you'll be able to head outside with strands that are smooth, shiny and healthy. There are plenty of easy styling tricks, like combing through damp hair with a wide-tooth sandalwood comb, that will protect your hair from the elements. Not only that, but you'll also see instant results after you apply a restorative hair serum on your ends to seal them up — resulting in a shiny, frizz-free 'do.\n\nWhile I can't promise you'll be tossing your blow dryer in the trash any time soon, you're definitely about to start air drying like a pro. These nine easy styling habits will get you smooth, sleek hair without the heat.\n\nSeal Ends With An Intensely Moisturizing Ojon Oil\n\nOjon Damage Reverse Instant Restorative Hair Serum, $31, Amazon\n\nYour ends are visible proof of your previous heat styling habits. I say: #nbd. This intense and fast-acting restorative treatment instantly activates after you rub it between your hands. Then, the ojon oil gets to work, treating damaged ends and making hair feel softer and smoother as it dries. One user said the serum eliminated her frizz and added shine, looking \"as if I had flat-ironed my hair, except without losing the softness.\" Bonus: The formula is strong, so one or two drops of this ojon oil serum does wonders — lasting you ages.\n\nEliminate Fly-Aways With A Silkening Shine Spray\n\nKenra Platinum Silkening Mist Spray, $15, Amazon\n\nAir drying can cause a major flyaway situation that I know you don't have time to deal with. To avoid it, spritz this weightless silkening mist on your hair as it starts to dry. Your 'do will be ultra shiny from the hydrolyzed silk and amino acid ingredients, while vitamin B5 will nourish split ends. Several users rave about the amazing smell of this product as compared to other shine sprays they've used, too.\n\nSmooth Fuzzy Ends With Shea Butter, Argan Oil & Lavender\n\nElbahya Smoothing Balm , $20, Amazon\n\nThe hydrating combination of ingredients in this smoothing balm by Elbahya will repair dry and damaged hair, beginning the process of smoothing out rough tresses. The balm's effects make strands appear straighter and sleeker after air drying, and users say they only need a small amount to see amazing smoothing results. The formula is organic and paraben-free, and it's said to improve your hair's overall texture after continued use.\n\nShampoo Your 'Do With A Straightening Product\n\nPhyto Phytolisse Straightening Shampoo, $24, Amazon\n\nThis ultra-smoothing shampoo will protect your hair from humidity post-shower. If your hair is all kinds of unruly, then this shine-inducing, weightless formula (full of hibiscus and fruit extracts) is your first step to achieving that effortless, French girl \"I don't own a blow dryer but my hair's still perfect\" look. Bonus: this shampoo is safe for daily use on hair, and it won't leave tresses feeling dry mid-day.\n\nPrep Hair For Frizz-Free Style With Argan Oil Conditioner\n\nCHI Argan Oil Conditioner, $12, Amazon\n\nA combination of argan oil, moringa oil, vitamin E and omega fatty acids in this nourishing conditioner will seal your cuticles, prepping hair to stay frizz-free and manageable as it dries. When applying it to your hair after shampooing, make sure to focus specifically from mid-hair to your ends to avoid greasy roots. This product is sulfate- and paraben-free, so it will help restore moisture without stripping your hair of anything it needs to look and feel healthy.\n\nShield From Humidity With Weatherproof Spray\n\nKMS California: HairStay Anti-Humidity Seal, $15, Amazon\n\nRemember that Friends episode when Monica's usually smooth and sleek hair goes haywire from tropical humidity? That's what I look like when the weather hits my hair. This 24-hour humidity blocking spray has a light hold, which creates a weather-resistant shield for your strands. You'll no longer have to stress about letting your hair dry outside for 10 minutes in the summertime — one user took this product to Florida and said it stood up against curl-creating humidity.\n\nComb Locks With Sandalwood & Loosely Braid For Softness\n\nBreezelike No-Static Sandalwood Comb, $14, Amazon\n\nWhile hair is damp, use this anti-static sandalwood comb to smooth out tangled strands and separate your hair into two smooth braids. After doing this, you're safe to head outside, keeping hair protected from damaging elements on your commute to work. When you reach the office, remove the braids and your mane will be frizz-free and ready to face the day. Bonus: This comb has a natural fragrance that will make your scalp smell amazing.\n\nDry Shampoo Absorbs Excess Product & Oil\n\nEva NYC Freshen Up Dry Shampoo, $11, Amazon\n\nSweating, using too much serum, over-conditioning, or even touching your hair too much in the morning can cause it to appear oily after it air dries. Keep roots fresh and dry with a cleansing dry shampoo that not only removes excess oils, but gets rid of any unwanted odors. One user called this product \"the best shampoo ever\" for making her mane thicker and fuller as it cleansed her 'do. Let greasy locks inhibit your air drying? Nope, not today!\n\nDab Hair With Microfiber To Fight Frizz\n\nWomen's Bamboo Hair Towel, $10, Amazon\n\nRubbing your wet mane with traditional terrycloth towels can do serious damage to your hair, leaving your strands looking thirsty by the time you're done air drying. This bamboo one will hold any hair length or thickness with its elastic loop feature, which makes it ideal for when you need to wrap your 'do up while you finish getting ready. When you hop out of the shower, these towels will absorb excess water and protect the smooth, sleek look you want to create.\n\nBustle may receive a portion of sales from products purchased from this article, which was created independently from Bustle's editorial and sales departments.\n\nImages: Fotolia (1); Amazon (9)", "images": ["https://imgix.bustle.com/lovelace/uploads/1573/f6016ee0-cf67-0133-736f-0e8f20e97865.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/1b6d71f0-cf63-0133-8309-06e18a8a4ae5.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/adcf8850-cf5e-0133-736b-0e8f20e97865.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/39ecb0d0-cf65-0133-77a3-0e7c926a42af.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/9/13/2a53926c-d697-4f3c-ab2e-7187fc52e833.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/3ca621d0-cf5d-0133-f10e-0a6c20e5e327.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/9/13/2a53926c-d697-4f3c-ab2e-7187fc52e833.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/lovelace/uploads/799/798aaf50-cf81-0133-736e-0e8f20e97865.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/da1f39b0-cf5a-0133-9736-0ec2e53676a1.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/260c3c40-cf5c-0133-8304-06e18a8a4ae5.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1573/5fa324e0-cf60-0133-f10e-0a6c20e5e327.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/2a53926c-d697-4f3c-ab2e-7187fc52e833.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/148825-9-hacks-to-get-smooth-sleek-hair-from-just-air-drying", "title": "9 Hacks to Get Smooth, Sleek Hair From Just Air Drying", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/148825-9-hacks-to-get-smooth-sleek-hair-from-just-air-drying", "type": "article", "title": "9 Hacks to Get Smooth, Sleek Hair From Air Drying", "description": "On weekdays, when your schedule is already jam-packed, it might be tempting to forgo your usual styling routine and run out the door with wet hair. But sometimes letting your hair dry naturally can cause your locks to look dry, frizzy, or limp. How…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/2a53926c-d697-4f3c-ab2e-7187fc52e833.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "On weekdays, when your schedule is already jam-packed, it might be tempting to forgo your usual styling routine and run out the door with wet hair. But sometimes letting your hair dry naturally can cause your locks to look dry, frizzy, or limp. How…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}