{"url": "https://www.cbsnews.com/news/oj-simpson-parole-hearing-net-worth/", "text": "By Laura Woods/GoBankingRates\n\nOn Oct. 3, 1995, a jury acquitted Orenthal James \"O.J.\" Simpson of the murders of his ex-wife Nicole Brown Simpson and Ronald Goldman. The murders -- and resulting O.J. Simpson trial and verdict -- drastically changed many peoples' opinions of the former football sensation.\n\nMore than two decades later, Simpson sits behind bars after being convicted for entirely different crimes. But that could change soon. On Thursday, Simpson will appear before a Nevada judge to make his case for parole. If parole is granted, \"The Juice\" could be on the loose as soon as Oct. 1.\n\nIn anticipation of the hearing, let's take a look at O.J. Simpson's net worth, as well as revisit his infamous murder trial.\n\nEstimated net worth: $250,000\n\nHis bank account was once flush, but O.J. Simpson now has little money left from his days has a high-earning football star. Celebrity Net Worth reports O.J. Simpson's net worth was $10.8 million when he and Nicole Brown Simpson divorced in 1992. That sum is equal to more than $19 million as of May 2017.\n\nThe divorce settlement revealed Simpson was earning $55,000 per month in 1992 — more than $97,000 in May 2017 dollars. Much of this was from car rental company Hertz, where he served as spokesperson for nearly 20 years. Simpson was earning $550,000 per year from the company at the time of his divorce, according to The Washington Post.\n\nFrom the archives: Former \"48 Hours\" reporter Harold Dow goes 1-on-1 with OJ Simpson\n\nMoney has seemingly been tight for Simpson since the Nicole Brown murder trial. Despite being acquitted in the famous criminal case, he was found guilty in a subsequent civil suit and ordered to pay $33.5 million to the Brown and Goldman families in February 1997. In a 2014 interview with CNBC, Goldman's sister Kim said the family has collected less than 1 percent of the judgment.\n\nAlso in 1997, Simpson defaulted on the mortgage of his estate in the Brentwood neighborhood of Los Angeles, and the property went into foreclosure. Simpson purchased the 6,200-square-foot mansion for $650,000 in 1977. The new owner paid $4 million for the house before demolishing it.\n\nFootball career and acting highlights\n\nO.J. Simpson's football career is nothing short of legendary. The Heisman Trophy winner made a name for himself as a member of the University of Southern California football team, when he pulled off a jaw-dropping 64-yard run against UCLA. He was chosen by the Buffalo Bills as the first pick in the 1969 NFL draft. Simpson played for the team for nine seasons.\n\nIn 1973, the running back made history as the first NFL player to rush more than 2,000 yards in a season. Simpson retired from the NFL in 1979, after spending his final two seasons with the San Francisco 49ers. He was inducted into the Pro Football Hall of Fame in 1985.\n\nAlso an actor, Simpson appeared in nearly three dozen films and television shows from 1968 to 2008. Some of his most high-profile works included playing Nordberg in \"The Naked Gun\" movie franchise and T.D. Parker in the television series \"1st and Ten: The Championship.\"\n\nNicole Brown murder trial\n\nIn June 1994, Nicole Brown Simpson and her friend, Ronald Goldman, were found stabbed to death outside her Brentwood condominium. Days later, O.J. Simpson was charged with the murders. After promising to turn himself in, Simpson famously led police on a 60-mile low-speed chase in a white Ford Bronco. He eventually surrendered at his Brentwood home.\n\nRegarded as the trial of the century, the O.J. Simpson trial ran from Jan. 24, 1995 to Oct. 2, 1995. Judge Lance A. Ito allowed cameras in the courtroom, granting the public a front row seat. Some 150 million viewers tuned in to watch the reading of the not-guilty verdict, making it one of the most watched events in history. The country is still divided regarding the O.J. Simpson trial and verdict today.\n\nPrison sentence\n\nO.J. Simpson now sits in a Nevada jail for crimes entirely unrelated to the Nicole Brown murder. This punishment stems from a September 2007 robbery, where Simpson and five other men forced their way into sports memorabilia collector Bruce Fromong's Las Vegas hotel room and robbed him at gunpoint. Simpson said he was trying to reclaim personal items stolen from his home years ago.\n\nThe guilty verdict in this O.J. Simpson court case came on the 13th anniversary of his double murder acquittal. The former athlete and his co-defendant were found guilty on 12 charges, including conspiracy to commit a crime, robbery, assault and kidnapping with a deadly weapon.\n\nAfter this O.J. Simpson trial, \"The Juice\" was sentenced to anywhere from nine to 33 years in prison. The Nevada parole board won't decide his fate until July 20, but the outlook appears to be in Simpson's favor. He already went before the board on five of his charges in July 2013 and was granted parole on those offenses.\n\nIf he's released, Simpson will be able to live on his NFL pension, which is an estimated $25,000 per month. By law, the Brown and Goldman families are unable to touch these funds to settle the judgment against Simpson.\n\nMore from GoBankingRates:", "images": ["https://cbsnews1.cbsistatic.com/hub/i/r/2019/11/19/186936ea-2db7-4a48-b750-74f38f653dc6/thumbnail/640x360/80fb8996993802606d5c971761bf5b42/newsletter-breakingnews.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2017/07/19/03b20c3b-cbd2-466b-ae38-e5c9d0cc4adf/thumbnail/620x349/b44b3d92f9934f42678311636a78b0c8/ap-071116028102.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2017/07/19/da80d9ac-c044-49cb-baf5-dd59b4454096/thumbnail/1200x630/b48802fd83bebb0b27fde916c7302a43/ap-17195672798952.jpg"], "top_img": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/07/19/da80d9ac-c044-49cb-baf5-dd59b4454096/thumbnail/1200x630/b48802fd83bebb0b27fde916c7302a43/ap-17195672798952.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/oj-simpson-parole-hearing-net-worth/", "title": "O.J. Simpson's net worth as he faces parole hearing", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "robots": "index, follow", "description": "Here&#039;s how much of his fortune the former NFL star, now up for parole after a 2008 conviction, is thought to have left", "keywords": "top news, cbs news, oj simpson parole, oj simpson trial, oj simpson, latest news, oj simpson case, business, cbsnews", "news_keywords": "top news, cbs news, oj simpson parole, oj simpson trial, oj simpson, latest news, oj simpson case, business, cbsnews", "al": {"web": {"url": "https://www.cbsnews.com/news/oj-simpson-parole-hearing-net-worth/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/oj-simpson-parole-hearing-net-worth/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/oj-simpson-parole-hearing-net-worth/", "title": "O.J. Simpson's net worth as he faces parole hearing", "description": "Here's how much of his fortune the former NFL star, now up for parole after a 2008 conviction, is thought to have left", "image": {"identifier": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/07/19/da80d9ac-c044-49cb-baf5-dd59b4454096/thumbnail/1200x630/b48802fd83bebb0b27fde916c7302a43/ap-17195672798952.jpg", "width": 1200, "height": 630}, "video": {"url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/757e16f6-9bfe-4283-ad0b-579e8dc85873/pro69.viwindow.mp4", "secure_url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/757e16f6-9bfe-4283-ad0b-579e8dc85873/pro69.viwindow.mp4", "type": "video/mp4", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSMoneyWatch", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/oj-simpson-parole-hearing-net-worth/", "ipad": "cbsnewsapp://cbsnews.com/news/oj-simpson-parole-hearing-net-worth/", "googleplay": "cbsnewsapp://cbsnews.com/news/oj-simpson-parole-hearing-net-worth/"}}, "site": "@cbsmoneywatch", "title": "O.J. Simpson's net worth as he faces parole hearing", "description": "Here's how much of his fortune the former NFL star, now up for parole after a 2008 conviction, is thought to have left", "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/07/19/da80d9ac-c044-49cb-baf5-dd59b4454096/thumbnail/1200x630/b48802fd83bebb0b27fde916c7302a43/ap-17195672798952.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}