{"url": "https://www.cosmopolitan.com/uk/entertainment/a13561434/taylor-swift-joe-alwyn-relationship-timeline/", "text": "Taylor Swift is currently dating actor Joe Alwyn. The couple have done a very good job of keeping their relationship shrouded in mystery. But here's a timeline with as much information as we could find, starting with the latest update. It's been tricky, mind you...\n\n13 February 2020:\n\nTaylor and Joe show some major PDA at the NME Awards, where she wins the award for 'Best Solo Act In The World. Fans capture videos of her and her boyfriend kissing, hugging, and generally just being really cute together:\n\nTaylor and Joe are so precious I’m gonna faint #NMEAwards2020 pic.twitter.com/tRke8KLdtQ — sophie 🌶 (@getlowsoph) February 12, 2020\n\nTaylor winner of Best Solo Act in the World annonced, the hug I’m dying #NMEAwards2020 pic.twitter.com/yaOKMjXiSF — sophie 🌶 (@getlowsoph) February 13, 2020\n\nTaylor winner of Best Solo Act in the World annonced, the hug I’m dying #NMEAwards2020 pic.twitter.com/yaOKMjXiSF — sophie 🌶 (@getlowsoph) February 13, 2020\n\n3 May 2016:\n\nSo where Joe and Tay met isn't 100% clear, which makes the start date to this timeline a tad tricky but, bear with us.\n\nIt's May, 2016 and both attend the Met Gala. I know what you're thinking, this link may seem tenuous given that the whole of Hollywood goes BUT Swift's new song 'Dress' - where she sings: 'Flashback to when you met me/ Your buzz cut/ And my hair bleached' -has provided some fans with the theory that the 2016 event could be significant.\n\nGetty Images\n\nA-ha! At the gala, Joe's hair is certainly shorter and Taylor rocks a bleached blonde bob...\n\n\n\nHowever, this Met Gala is also seemingly full of Taylor-related events as a video of her and (soon to be boyfriend) Tom Hiddleston having a dance-off to Beyonce's Crazy in Love does the rounds on the internet.\n\nJust a month later, she announces she has broken up with boyfriend of a year Calvin Harris and weeks later she's pictured kissing Tom Hiddleston. 'Hiddleswift', as they become to be known, break up in September, 2016.\n\n12 October 2016:\n\nTaylor and a whole load of squad members (Is the squad still a thing?) including Lorde, Cara Delevingne, Dakota Johnson and Martha Hunt attend a secret Kings of Leon concert in New York City. It's widely reported that Joe was also there and this is the place where the couple meet.\n\nTaylor and Dakota Johnson in NYC on October 12, 2016 Getty Images\n\n12 November 2016:\n\nTaylor is papped going to watch a film with her mother and two of the Haim sisters Este and Alana in Los Angeles. And what film is this? Only Joe Alwyn's film Billy Lynn's Long Halftime Walk.\n\nCoincidence orrrrr?\n\n16 May 2017:\n\nUnfortunately, we can't fill you in on what specifically happened over the six months between November 2016 and May 2017 because the couple were so darn good at hiding their relationship.\n\nIn May, the story of their relationship finally breaks. The Sun reports that the pair have been dating in secret for months (seems about right) and that Taylor is \"besotted\" with him.\n\nThey add that she's been spending lots of time in London with him, using wigs, scarves and hats as a disguise.\n\n\"Taylor and Joe are the real deal, this is a very serious relationship,\" a source tells the newspaper. \"...Taylor has flown in via private jets and her security has made it a military-like mission to prevent her from being seen.\"\n\n1 June 2017:\n\nAs well as Taylor's Mission Impossible-style visits to the UK, Joe also flies to see Taylor in New York, reports E! News.\n\n\"Taylor and Joe have really tried to be on lockdown and have spent most of their time together in private locations where they could get to know each other without the pressure of a public relationship and people making judgement calls,\" a source tells the outlet.\n\n2 June 2017:\n\nE! News covers the story a day later, reporting that Joe has finally met... the squad.\n\nTaylor Swift and said ’squad’ at the 2015 VMAs Getty Images\n\nApparently, Selena Gomez and Gigi Hadid, as well as other \"close friends\", had the pleasure of meeting and getting to know their pals' new beau.\n\n5 June 2017:\n\nTaylor and Joe are pictured together for the first time in a paparazzi shot. The two are seen enjoying coffee on a balcony in Nashville, Tennessee and Taylor is smiling. Cute! It's reported that Joe is there to meet the parents. Dun dun dunnnn.\n\nAs well as this, reports that Taylor is house-hunting in London - the city where none other than bloomin' Joe lives - also do the rounds.\n\n26 July 2017:\n\nTaylor and Joe are photographed again, however, this time they're really trying not to be. Pictures in the Mail Online show the couple wearing hoodies and keeping their eyes to the ground as they leave the singer's New York City apartment.\n\n5 September 2017:\n\nTaylor is back with new music and everyone is freaking out trying to guess who and what all the songs are about. After all, she's had a fairly eventful couple of years since her last album.\n\nOne song '...Ready for It?' has fans divided over whether it's about Joe or her former love interest Harry Styles. But then... according to Buzzfeed, Taylor reportedly likes a Tumblr post breaking down the lyrics, with all signs pointing to them being about Joe.\n\n21 September 2017:\n\nThe secret transatlantic visits show no slowing down and they've reportedly been made easier by Taylor's famous mates.\n\nAccording to The Sun, Cara Delevingne hosted the couple at her house in west London so that they could continue to keep the whole thing on the DL while visiting Joe's family and friends.\n\nTaylor and Cara in NYC in September 2016 Getty Images\n\n\"She's trying to keep a low profile with Joe and staying with Cara has let her do that,\" a source told the tabloid. \"... They can even walk Cara's dog round the local park without anyone batting an eyelid.\"\n\n20 October 2017:\n\nAnother song from Taylor's forthcoming album Reputation drops and it's called 'Gorgeous'.\n\nAccording to fans, Taylor told them the song was about Joe during one of her secret listening sessions.\n\nTaylor told fans at the secret sessions that #Gorgeous is about her boyfriend Joe pic.twitter.com/4mxHSz9neL — Taylor Swift News (@TSwiftNZ) October 20, 2017\n\nLyrics include: \"You should take it as a compliment / That I got drunk and made fun of the way you talk / You should think about he consequence / Of your magnetic field being a little too strong /And I got a boyfriend, he's older than us.\"\n\nFirstly, Joe is British and Taylor is American which could explain the whole making fun of the way you talk thing. Secondly, her two previous boyfriends have been in their 30s and therefore older than Joe.\n\n26 October 2017:\n\nTaylor's BFF Ed Sheeran pipes up, telling a radio station he thinks Joe is a \"good dude\".\n\nTaylor and Ed at the 2016 Grammy awards Getty Images\n\nGiving the seal of approval, the 'Shape of You' singer tells Capital London's Breakfast Show: \"He's really nice. Really, really friendly, really good dude\".\n\n3 November 2017:\n\nThe fourth song from Reputation drops and this time it's 'Call It What You Want' which fans think seems to include a mix of references about both the Kimye feud and Joe.\n\nHere are the lyrics which might be about Joe:\n\n\"My baby's fly like a jet stream/ High above the whole scene\" - potentially referencing that Joe is not as famous as some of Swift's previous love interests.\n\n10 November 2017:\n\nTaylor's 15-track album is released in full, proving plenty more lyrics for us to try and dissect. Among the many fan theories pointing to lines about Joe, a couple are:\n\n'Don't Blame Me': \"I've been breaking hearts a long time, and toying with them older guys just to play things for me to use / Don't blame me, your love made me crazy / My drug is my baby / I'll be using for the rest of my life\"\n\nThe fact that Taylor seems to talk about the future in the last line indicates she's singing about a current relationship, i.e. her and Joe.\n\n'Delicate': \"My reputation's never been worse, so you must like me for me / Dark jeans and your Nikes, look at you / Oh damn, never seen that colour blue.\"\n\nIt's fair to say Taylor's public reputation took a bash during the time she met Joe, which she could be hinting at when she describes how the mysterious subject of the song was into her regardless.\n\nHe also has very blue eyes, we might add.\n\n\n\n6 April 2018:\n\nTaylor is reportedly keen to buy a £30m house in north London's Crouch End, so she can \"set down roots\" near where Joe and his family live.\n\nA source told The Sun: “Taylor loves the UK and how she can live a relatively normal life without being disturbed,\" the source said. “Setting down roots is something she’s thought long and hard about. She’s set aside £30million ($42million) to find the house of her dreams, which she hopes to one day settle down in with Joe if their relationship continues to grow.\"\n\n29 September 2018:\n\nTaylor and Joe are spotted hand-in-hand heading towards the singer's New York City apartment together.\n\nJackson Lee Getty Images\n\n22 November 2018:\n\nWould you believe it? Taylor is actually tagging Joe in a post on Instagram! It's all to promote his new movie The Favourite, which he stars in with Olivia Coleman, Emma Stone and Nicholas Hoult. Taylor calls the film \"phenomenal\" and tells her followers to go see it.\n\n11 December 2018:\n\nTaylor Swift managed to slip into the London premiere of Joe's move Mary Queen Of Scots, and no one noticed. Well, until Izuka Hoyle, who plays courtier Mary Seton, shared an Instagram Story of the pair chatting in the cinema's lobby, along with the caption, \"Romeo take me somewhere we can be alone\".\n\nInstagram Stories\n\nWhile fans are desperate for their first official red carpet moment for Joe and Taylor, a source told The Sun the singer didn't want to distract from her boyfriend's achievements.\n\n\"Taylor didn't want to draw attention to herself because it was really Joe's night\", the insider commented. \"But she did want to support him and knew he would appreciate her being there, so she took steps to try and prevent anyone knowing she was there.\n\n\"It worked in the dark of the cinema but by the time they made it to the party afterwards her cover was blown.\"\n\n6 January 2019:\n\nA new year and yet Taylor and Joe still appear to be going strong. The two attended the Golden Globes, separately, of course and then hit up several after-parties following the show.\n\nAll eyes on Taylor at the 2019 InStyle and Warner Bros party Donato Sardella Getty Images\n\nTaylor was spotted at the InStyle/Warner Bros party - where she posed on the red carpet - and then at Fox's and Netflix's soirees, as was Joe. At the Netflix afterparty, \"Taylor Swift, was the star of the party, sitting in a VIP area next to [Netflix CCO Ted] Sarandos. At one point, Sarandos approached Swift and her boyfriend Joe Alwyn to ask for a photo with the star. Swift obliged, but was quickly met with more and more photo requests from other attendees at the party. Security called for backup to her section to give her some privacy, but Swift and Alwyn left the event shortly after,\" per The Hollywood Reporter.\n\nJoe at the FOX, FX And Hulu 2019 Golden Globe Awards After Party Phillip Faraone Getty Images\n\nA reporter for Entertainment Tonight also told his Twitter followers how he'd witnessed \"Joe Alwyn give Taylor Swift a kiss at the Fox afterparty\". Cute!\n\n17 January 2019:\n\nGiven that Joe is in every film under the sun at the start of 2019 (well, it feels like it, he has parts in The Favourite and Mary Queen of Scots) he conducts some interviews to promote these movies.\n\n\n\nIn one with Mr Porter, he objects to being labelled \"strangely private\" over his and Taylor's refusal to discuss their relationship. He tells the magazine he doesn't think he's had to \"fight for his privacy\" more than anyone else in the public eye and it seems like he's just of the opinion he doesn't have to share one of the more personal sides of his life with the rest of the world.\n\n\"I don't think anyone you meet on the streets would just spill their guts out to you, therefore why should I?\" he says. \"And then that is defined as being 'strangely private'. Fine. But I don't think it is. I think it's normal.\"\n\n10 February 2019:\n\nTaylor skipped the Grammys so she could support Joe at the BAFTAs, where his film, The Favourite, won like a million awards. Look how sweet they look together!\n\nGetty Images\n\nGetty Images\n\nPlus, Taylor posted this sweet message on Instagram...\n\n24 February 2019:\n\nTaylor and Joe reportedly attended not one, not two, but THREE pre-Oscars parties together.\n\nThey were spotted at the Night Before party and the CAA bash as well as another event, with Perez Hilton claiming it was \"PDA all over the place\".\n\n\"Taylor Swift hit up three parties with her boyfriend Joe Alwyn,\" Perez told Australian radio show KIIS FM's Kyle & Jackie O.\n\nHe added: \"They went to such great lengths in 2018 to every avoid being seen in public together. Now finally not only are they going to events and supporting each other. But PDA all over the place.\n\nJoe at the 2019 Oscars Getty Images\n\n24 February 2019:\n\nWhile Joe Alwyn attended the Oscars alone, he was later joined by Taylor Swift at the Vanity Fair party. Other party goers went to great lengths to document the singer's presence, with one catching a lowkey moment of PDA between the pair on video. Adorable.\n\n21 March 2019:\n\nDespite it making it very very hard for fans to get updates on how their relationship is going, being secretive is apparently the key to making things work between Taylor Swift and Joe Alwyn.\n\nAccording to a source at People, \"Keeping it private from the beginning really helped their relationship. They were able to get to know each other in peace.\"\n\nGetty Images\n\nWhile there are rumours going around that Joe is planning a proposal, Taylor is apparently just happy to be with him whatever happens. \"Taylor really got lucky to meet Joe, and she is the first one to say it,” a source said. “Joe really is one of a kind.”\n\nThe insider added that \"They have a very special relationship. Joe adores Taylor\", before commenting on the fact they're \"very compatible,\" \"respectful\" of each other’s careers, and \"so sweet\" together.\n\nALRIGHT GUYS. We get it. Anyone else feeling very very single right now?\n\n\n\n17 July 2019:\n\nJoe has been supporting Taylor during all this nasty Scooter Braun business.\n\nA source told Hollywood Life, \"Taylor‘s loved ones have all rallied around her to support her through this battle, she is not alone in this fight. Her boyfriend Joe has been a total rock in all of this, he is very supportive of her taking a stand… he has got a strong backbone.\"\n\nThe source added: \"Taylor has always been pretty fearless when it comes to speaking her truth but having such a solid and healthy relationship makes her feel that much stronger. What she is going through with Scooter is so challenging, but the good news is that her personal life is all smooth sailing. She is very grateful for that.\"\n\n12 August 2019:\n\nTaylor fans think the singer is secretly engaged to Joe, after she shared some particularly telling lyrics from her new album with Vogue.\n\nIn the track, which they describe as both 'haunting' and 'romantic', Taylor sings, \"My heart’s been borrowed and yours has been blue. All’s well that ends well to end up with you.\"\n\nSomething borrowed? Something blue? End up with you? Certainly sounds like a hint towards marriage, doesn't it? Well, Taylor's fans definitely think so, with many taking to Twitter to speculate about whether the singer just announced her engagement.\n\n\"HOLD UP SOMETHING BORROWED SOMETHING BLUE? MS.SWIFT ARE YOU GONNA BE TAYLOR ALWYN?\" one fan wrote, while another added, \"I think Taylor Swift just told us she's engaged. That's it. That's the tweet.\"\n\nA third added, \"If Taylor Swift is secretly engaged to Joe Alwyn I’ll never be calm again.\"\n\nMy heart’s been borrowed and yours has been blue. All’s well that ends well, to end up with you. 💙 pic.twitter.com/CECesxb8do — Taylor Swift (@taylorswift13) August 8, 2019\n\n23 August 2019:\n\nTaylor releases her new album, Lover, and fans are convinced that these songs - and these lyrics in particular are about Joe.\n\nSong: 'Lover'\n\nLyric: \"I've loved you three summers now, honey, but I want 'em all\"\n\nWhy fans think this is about Joe: Rumour has it, Taylor and Joe started dating in summer 2016 aka three summers ago.\n\n\n\nSong: 'I Think He Knows'\n\nLyric: \"He got that boyish look that I like in a man.\"\n\nWhy fans think this is about Joe: I mean, you've seen him, right?\n\nSong: 'London Boy'\n\nLyric: \"Took me back to Highgate, met all of his best mates. So I guess all the rumours are true. You know I love a London boy. Boy I fancy you.\"\n\nWhy fans think this is about Joe: He was born and raised in London. Simple as that.\n\njoe alwyn listening to london boy knowing he’s the london boy pic.twitter.com/hUU9XPkKMX — julia louise coleman (@twinklefists) August 16, 2019\n\n6th October 2019:\n\nAfter Taylor does an amazing job of presenting SNL with Phoebe Waller-Bridge, she's pictures with Joe for the first time in ages. They were snapped leaving Japanese restaurant, Zuma, in New York.\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\n5th January 2020\n\n\n\nTaylor Swift and Joe Alwyn had a very public date night at the Golden Globes awards, where Taylor was nominated for Best Original Song for 'Beautiful Ghosts' from Cats. She lost out to Elton John and Bernie Taupin for '(I’m Gonna) Love Me Again' from Rocketman, but did get to go to a fancy dinner with her boyfriend. So who's complaining?\n\n📹 | Taylor Swift and Joe Alwyn in the audience at the #GoldenGlobes pic.twitter.com/p73tAzzbRy — Taylor Swift News (@TSwiftNZ) January 6, 2020\n\n23 January 2020\n\nJoe Alwyn and Taylor Swift are famously very private about their romance, but fans get to see a different side to their relationship in her Netflix documentary, Miss Americana. In it, not only does Taylor hug Joe backstage at one of her shows, but we also see her tenderly kiss his hand in the back of a taxi.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.458xh;0.00160xw,0.0190xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.458xh;0.00160xw,0.0190xh&resize=1200:*", "keywords": [], "authors": ["Olivia Blair", "Digital News Editor", "Olivia Is Elle'S Digital News Editor Covering Pop Culture", "Royal", "Lifestyle", "Women'S News"], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a13561434/taylor-swift-joe-alwyn-relationship-timeline/", "title": "Taylor Swift and Joe Alwyn", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Taylor Swift & Joe Alwyn show more PDA than ever at NME Awards", "description": "A kiss!", "url": "https://www.cosmopolitan.com/uk/entertainment/a13561434/taylor-swift-joe-alwyn-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.458xh;0.00160xw,0.0190xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2020-02-14 12:06:06", "published_time": "2020-02-14 12:06:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.458xh;0.00160xw,0.0190xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Taylor Swift and Joe Alwyn - Relationship timeline", "description": "A look back at the relationship between Taylor Swift and British actor Joe Alwyn.", "keywords": "Joe Alwyn, Taylor Swift, Taylor Swift's boyfriend, Taylor Swift relationship, Taylor Swift songs about Joe Alwyn, taylor swift joe alwyn house london", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.915xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,Joe Alwyn,taylor swift", "sailthru.date": "2020-02-14T12:06:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.458xh;0.00160xw,0.0190xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-joe-alwyn-relationship-timeline-1-1581681862.jpg?crop=1.00xw:0.915xh;0,0", "sailthru.socialtitle": "Taylor Swift & Joe Alwyn show more PDA than ever at NME Awards", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1581653160.0, "source": "https://www.cosmopolitan.com", "summary": ""}