{"url": "https://www.thecut.com/2018/05/meghan-markle-prince-harry-wedding-guest-list.html", "text": "Meghan Markle and Prince Harry. Photo: Samir Hussein/WireImage\n\nOh hi, were you expecting an invite to Meghan Markle and Prince Harry’s upcoming May 19 wedding? Well, if so, you might want to sit down, because I have some truly troubling news for you. The soon-to-be married couple reportedly cut their royal wedding guest list down by 200 people … all so that they could rearrange the church pews!\n\nWhat Does It Take To Be A Duchess? Inside A Royal Etiquette Class\n\nAccording to E!, the venue where Markle and Prince Harry will tie the very fancy knot — St. George’s Chapel at Windsor Castle — can hold around 800 people. But instead, they’ve decided to only invite 600 to the church ceremony to accommodate an altered seating plan. Per E!:\n\nThe insider tells E! News the couple may spread out the chapel’s pews or arrange them diagonally so guests can get a better view of the altar. The source also claims this seating plan will “look much better” when it comes to those top-down camera shots for people watching the televised event at home.\n\nIn total, the couple has invited 600 people to the public portion of their big day, and only 200 will be invited to the private reception hosted by Prince Charles at Frogmore House. In contrast, Prince William and Kate Middleton had 1,900 guests at their April 2011 wedding’s church ceremony, and an evening reception with 300 guests. E! notes that the reduced guest list means most people with young kids will be leaving them at home.\n\nWhile altering the guest list to make room for different seating arrangements certainly is very thoughtful for the millions of people around the world who will be watching the event from the comfort of their iPhones, it’s also quite upsetting for those of us who were holding out hope that our invitations were just lost in the mail (no, we just weren’t invited! Isn’t that mean?).", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/05/01/01-prince-harry-meghan-markle.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0e9/ea3/b95dae44c85fa3442c9f635f3f360ce1f3-01-prince-harry-meghan-markle.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/0e9/ea3/b95dae44c85fa3442c9f635f3f360ce1f3-01-prince-harry-meghan-markle.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2018/05/meghan-markle-prince-harry-wedding-guest-list.html", "title": "Meghan Markle and Prince Harry Reportedly Cut Down Their Wedding Guest List", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Meghan Markle and Prince Harry Reportedly Cut Down Their Wedding Guest List", "url": "https://www.thecut.com/2018/05/meghan-markle-prince-harry-wedding-guest-list.html", "description": "Does this mean we aren’t getting an invitation?", "image": "https://pyxis.nymag.com/v1/imgs/0e9/ea3/b95dae44c85fa3442c9f635f3f360ce1f3-01-prince-harry-meghan-markle.1x.rsocial.w1200.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Meghan Markle and Prince Harry Cut Their Wedding Guest List", "description": "Does this mean we aren’t getting an invitation?", "image": "https://pyxis.nymag.com/v1/imgs/0e9/ea3/b95dae44c85fa3442c9f635f3f360ce1f3-01-prince-harry-meghan-markle.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2018-05-01T09:53:20.620-04:00", "tag": "royal wedding 2.0, meghan markle, prince harry, culture, celebrity", "publisher": "https://www.facebook.com/cut"}, "description": "E! reports Meghan Markle and Prince Harry cut down their wedding guest list by 200 people. Even though St. George’s Chapel at Windsor Castle can fit 800 people, they will reportedly only have 600 guests at their wedding.", "sailthru.tags": "royal wedding 2.0, meghan markle, prince harry, culture, celebrity", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1525182800.62, "source": "https://www.thecut.com", "summary": ""}