{"url": "https://web.archive.org/web/20110612042856/http://www.cuinsight.com:80/media/news/card_penalty_fees_soften_slightly_in_2010.html", "text": "R.K. HAMMER (805) 499-8548\n\n\n\nClick here for chart\n\nCard industry advisor R.K. Hammer has released its year-end 2010 results for the credit industry penalty fees assessed during the past year. This is the fourth in the Hammer annual series of seven year-end reports, dealing with all aspects of credit card industry trends: risks, costs, and profits. Some of the report highlights are: Card penalty fees assessed during 2010 totaled $22.5 Billion in the latest Hammer model. This is down slightly from year-end 2009 of $22.9 Billion. Reasons for the decline include: fewer card accounts on the books due to recent portfolio purges, and delinquency figures improving through 2010. As you can see, other than 2010, penalty fees in the card business had been on an ever increasing annual climb: 2003: $10.7 B 2004: $11.7 B 2005: $14.8 B 2006: $17.1 B 2007: $18.1 B 2008: $19.0 B 2009: $22.9 B 2010: $22.5 B Company CEO Bob Hammer commented, “It is important to note that increased consumer costs due to raised APR’s for delinquent accounts (often termed “Penalty Pricing) are not included in the annual Hammer fee income model, as that interest charged is reported in the Interest Income category, not in “Non-Interest” (Fee) Income.” “Also, as in the past our fee income model broadly includes interchange income, penalty fees, annual fees, cash advance fees/bal. transfer fees, and enhancement income. Penalty fee income is comprised of late fees, over limit fees and other miscellaneous fee income, the vast majority (90%+) are late fees.” “Interest income for decades has clearly been the largest revenue stream for cards, followed by fee income. Those lines have now almost intersected, and are expected to do so in the next 18 – 24 months, with fee income then becoming the largest component of revenue for card issuers. Recent rule changes and regulation impacting interest cards may charge and how interest rate changes may be implemented have hastened issuers’ direction and refocus toward new fees and repricing current fees.” Hammer forecast for 2011: “Fee Income rising 9% for credit card companies.”- Formed in 1990, R.K. Hammer is an internationally known credit card industry advisor whose clients include some of the world’s largest financial institutions in the U.S. and in 50 countries abroad. Hammer branded research and reports have been used by issuers, processors, national associations, government agencies and regulators for over two decades. Their year-end card industry trend reports and other R.K. Hammer research reports have been published by major press and card industry periodicals over 560 times. More information may be viewed by going to: www.rkhammer.com", "images": ["https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/scripts/formkey.php?key=06282JQE001112", "https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/media/img/banner_momentum_Banner_810.jpg", "https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/media/img/callout_CUNA_CPDOnline_180x150_52311.jpg", "https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/media/img/callout_CULookupCUinsightBadgeAd.gif", "https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/media/img/callout_SWBC_Email_APCUI31411.jpg", "https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/img/head_logo.jpg", "https://web.archive.org/web/20110612042856im_/http://s7.addthis.com/static/btn/sm-plus.gif", "https://web.archive.org/web/20110612042856im_/http://c.statcounter.com/5796122/0/d98baf6b/1/"], "top_img": "https://web.archive.org/web/20110612042856im_/http://www.cuinsight.com/media/img/callout_CUNA_CPDOnline_180x150_52311.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Card Penalty Fees Soften Slightly In 2010", "meta_data": {"description": "You're one stop place for all things Credit Union", "keywords": "credit, union, credit union, credit unions, news, credit union news, credit union compliance, compliance, credit union technology, technology, credit union compliance, compliance credit union, technology, technology, cu community, credit union blogs, blogs, credit union jobs, jobs, credit union events, events, find a credit union, cu resources, credit union resources, credit union vendors, vendors, cu news, Find a credit union,"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}