{"url": "https://web.archive.org/web/20050226122120/http://judiciary.house.gov/legacy/lapierre.htm", "text": "Testimony of Wayne R. LaPierre\n\nExecutive Vice-President, National Rifle Association\n\nbefore the\n\nHouse Judiciary Committee Subcommittee on Crime\n\nU. S. House of Representatives May 27, 1999\n\nOur freedoms are already endangered enough by those who oppose them. But I 've learned that a freedom is most at risk when it 's in the hands of honest people who think, for some perceived common good, they ought to give it up.\n\n\n\nToday we are a country in shock, still bewildered by what confluence of forces could possibly lead young people to hurt each other.\n\n\n\nIn that tender state, good people are vulnerable. They want to do something, anything, for the common good. Indeed, some are so perplexed about what to do that legislators admit from the outset that their legislation could not have prevented the very crimes that provoked drafting it.\n\n\n\nThat's the very definition of a perceived, but fictitious, common good.\n\n\n\nAs this made-for-TV lawmaking gets played out, it needs a villain. So good Americans have been exposed daily to a well-coordinated systematic bashing of the National Rifle Association 's membership as somehow a reckless societal pathogen, a mighty extremist empire opposed to safety, caution, and reason.\n\n\n\nThat is a cruel and dangerous lie.\n\n\n\nBecause nobody --nor any combination of entities you care to add up --has invested even a measurable fraction of what we have invested toward keeping safety and sanity central to the lawful exercise of the Second Amendment.\n\n\n\nAnd nobody is more committed than we are to keeping guns out of criminals 'hands. That's obviously in our best interest. It's just whether you believe you 're more likely to keep guns and criminals apart with new laws you write and ignore, or with existing laws you enforce.\n\n\n\nSome think our insistence on enforcement is unreasonable. Others say we oppose reasonable restrictions on gun ownership. So let's talk about what's reasonable and what's not.\n\n\n\nWe think it 's reasonable to provide mandatory instant criminal background checks for every sale at every gun show. No loopholes anywhere for anyone. That means closing the Hinckley loophole so the records of those adjudicated mental ill are in the system.\n\n\n\nThis isn 't new, or a change of position, or a concession. I've been on record on this point consistently, from our national meeting in Denver, to paid national ads and position papers, to\n\nnews interviews and press appearances. But I 've repeatedly emphasized that this Administration must stop illegally keeping records of lawful gun buyers.\n\n\n\nIn fact, it 's the media 's well-kept secret that the NRA was an early architect and supporter of the National Instant Check System now in place. Congressman McCollum knows we worked with him on instant checks more than a decade ago.\n\nWe think it 's reasonable to provide for instant checks at gun shows just like at gun stores and\n\npawn shops. But what 's unreasonable is how the proposed Lautenberg legislation ignores the 250,000 prohibited people like felons who 've walked away from gun stores --instead of being prosecuted for a federal felony for trying to buy a gun.\n\n\n\nWe think it 's reasonable to prevent all juveniles convicted of violent felonies from owning guns,\n\nfor life. What's unreasonable is how Lautenberg can prevent your law-abiding son from\n\ninheriting his grandpa 's shotgun collection because Lautenberg classifies him as a gun show dealer who must be federally regulated.\n\n\n\nWe think it 's reasonable to prosecute more than just two dozen thugs last year for putting illegal guns in criminals 'hands. What 's unreasonable is that Lautenberg considers legal guns in private hands subject to intrusive federal regulation, even in the privacy of your home.\n\n\n\nFor a century we 've taught it 's not just reasonable but essential to use safety locks, trigger locks, gun safes or any voluntary means appropriate to keep firearms out of the wrong hands. What's unreasonable is that Lautenberg can put you in prison just for failing to keep records on how many guns you own.\n\nWe think it 's reasonable to make gun show instant checks just like gun store instant checks.\n\nWhat's unreasonable is how Lautenberg could define your Walmart, or your uncle 's skeetshooting range, or your next-door firearms collector, or your local sporting clays competition, or\n\nany person or place with 50 or more firearms as a \"gun show \" subject to mtrusive government regulation. That 's crazy!\n\n\n\nWe think it 's reasonable to demand strict prosecution of criminal activity, whether it takes place in\n\na big-city alleyway or small town gun show. What 's unreasonable is that Lautenberg instead demands strict registration of law-abiding gun buyers, b oiving the federal government the name and address, type of gun and serial number ---not of criminals but of Americans deemed NOT to be criminals by the instant check!\n\n\n\nWe think it 's reasonable to provide full funding for the National Instant Check System so it\n\noperates efficiently and instantly. What 's unreasonable is how Lautenberg authorizes an unlimited gun tax on purchases by law-abiding citizens.\n\n\n\nWe think it 's reasonable to expect our government to prosecute more than 24 hoods last year for providing guns to criminals. What 's unreasonable is how Lautenberg makes everyone\n\nprosecutable if you just talk about buying or selling a gun at a gun show --even if you have no gun in your possession!\n\n\n\nWe think it 's reasonable to support the federal Gun-Free School Zones Act. What 's unreasonable is letting 6,000 students caught with illegal guns at school go, prosecuting only 13 of them the past\n\ntwo years.\n\nWe think it 's reasonable to demand that when a lawful gun buyer passes the criminal background check and purchases a firearm, records of that transaction be destroyed immediately. What 's unreasonable is Lautenberg 's decree that we trust government bureaucrats to compile and keep\n\nWe think it 's reasonable is to expect full enforcement of federal firearms laws by the federal government. What 's unreasonable is when the Justice Department claims that federal gun laws are\n\nfor the states to enforce! Reasonable people know that a case made in state court means plea bargains, judge shopping and no mandatory minimum sentencing. Even Mayor Ed Rendell of Philadelphia knows this, even if the Justice Department does not. He said, quote: \"In state court, we average for these types of gun violations a 4-month prison sentence. The federal guidelines are\n\n59 months in prison. That 's a 5 l/2 year difference. Incarcerating convicted felons in possession\n\nof firearms for that length of time will save lives. It will save carnage. It will save people from being maimed. \"\n\n\n\nThat's why we support Project Exile --the fierce prosecution of federal gun laws that has cut crime rates overnight the few places it 's been tried. Even though this Administration resists it, we think\n\nit's reasonable because it works.\n\n\n\nWe only support what works, and our proud list is long. From Project Exile to three-strikesyou're out, to truth in sentencin g, to ten-twenty-life, to mandatory minimums --what 's reasonable is what works; what 's unreasonable is what doesn 't work.\n\n\n\nWhat's unreasonable is further erosion of privacy, further intrusion into private transactions, and further government penalizing of the law-abiding many instead of the lawbreaking few. America will not tolerate further surrender of precious freedoms in return for nothing but perceived but\n\nfictitious promises that make none of us safer.\n\n\n\nThe Lautenberg legislation is not only unreasonable, it is unworkable . . . unacceptable . . . and to\n\nour Founders who gave us the Second Amendment, unthinkable.\n\nAnd finally --somebody's got to say this out loud: It 's reasonable for well-meaning people to convene hearings like this to find and fashion solutions. What 's unreasonable is when a new level of hate rhetoric becomes acceptable because it 's aimed at honest gun owners, as in the violent language of influential film-maker Spike Lee who last week reportedly said about NRA President Charlton Heston, quote, \"Shoot him --with a .44 caliber Bulldog. \" By his defiant silence, instead\n\nof the quick apology most American role models would offer, he sanctions hate and bears his share\n\nof culpability for the kind of violence this body seeks to stop.\n\nOn behalf of millions of gun owners who are NRA members, and tens of millions who are not yet, I am asking you to practice yourselves what is so readily preached to us: Be reasonable.\n\n", "images": [], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "05/27/99 Committee on the Judiciary", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}