{"url": "https://www.etonline.com/kym-herjavec-gushes-over-life-with-twins-and-how-shes-getting-back-in-shape-post-pregnancy", "text": "Kym Herjavec is loving her new life as a mom!\n\nET caught up with the 41-year-old dancer over the phone on Wednesday, where she gushed over how her world has changed since welcoming twins Hudson and Haven with her husband, Robert Herjavec, in April.\n\n\"I'm just so happy,\" she exclaimed. \"I was just hoping that the babies would be healthy... and to have two beautiful, healthy babies is the most incredible thing.\"\n\n\"Robert's been great,\" she added. \"He's been taking care of me and the babies. I saw the picture of [Dwayne] 'the Rock' [Johnson] feeding his girlfriend [while she was breastfeeding], and Robert was doing the same thing to me -- feeding me as I was feeding the babies. It's really nice to see him with the kids.\"\n\nKym admitted that although parenting newborns has been \"a lot of work\" so far, she and Robert are also \"having so much fun.\"\n\n\"We've gotten into a bit of a groove. It takes a while,\" she confessed, telling ET that her mother and friends have also been a big help. \"My girlfriends tell me that you feel like you get into the groove of one thing, and then another stage happens. My mom gave me great advice. She said, 'You have to have a sense of humor,' and she's right. In the beginning, I remember walking down the stairs to see Robert and it was crazy [in the house]. I'd sprung a leak in my boob and I had no idea and he was laughing at me. It's those funny things that happen and you've got to keep a good sense of humor with having babies.\"\n\n\"Being a mom, I have such a different respect for moms now, it's unbelievable,\" she continued. \"You just realize how incredible women are, and we shouldn't put too much pressure on ourselves because everyone's different. And we're all just doing the best we can!\"\n\nAlthough the twins are still very young (only two months old), Kym told us that they \"definitely\" have created their own personalities already.\n\n\"They’re giving me smiles now,\" she shared. \"I was hoping they'd really be interacting with each other, being twins, but they really don't care about each other that much yet, but that will change. It's really great seeing how different they are.\"\n\n\"It's too early to tell [who they resemble more], but Hudson is a little mini-Robert because he's got a ton of hair like Robert,\" she added. \"Haven looks a bit like me [right] now.\"\n\nWhen she's not taking care of her little bundles of joy, Kym has been working on getting back in shape. The mother of two -- who owns her own dance fitness studio, The BOD by Kym, in Beverly Hills, California -- said she was given clearance by her doctors to start working out again six weeks after giving birth.\n\n\"For the first six weeks, I didn't do anything but be with the babies,\" she explained. \"I did lose quite a bit of weight that first six weeks just from sheer exhaustion and taking care of two twins. So, that just happened naturally. I was also wearing some support garments and things like that that they gave me at the hospital, and I think that helped with my stomach muscles. It was just eating well and staying hydrated and the sheer exhaustion of looking after babies in that first six weeks.\"\n\n\"I just started doing some Pilates, which I did throughout my pregnancy,\" she continued. \"I just eased myself [back] into it, because you have to really start all over again, and I love that. I'm starting to feel like I've got abs; I'm starting to feel my abs again. And then I've just been doing a little bit of cardio. I want to start teaching again, so I've been back at my studio, just doing my dance fitness classes. A little bit of dance cardio, nothing too crazy... and some Pilates to engage that core again.\"\n\nKym's also found a way to incorporate her twins into her at-home workouts when she can't make it to the studio or a gym.\n\n\"It is really fun to do little things with the babies, like squats, or even holding the babies is a workout when you’re a new mom,\" she joked. \"Just being at home with them, looking after them is such a workout. [But] it is nice to get that little break... once a week, to get to do a class or something like that. I think it's good for your sanity as well.\"\n\n\"I always promised myself that I wouldn't put too much pressure on myself to get back in shape,\" she added, \"so I'm trying to take it slowly and enjoy the babies. I think that's the key -- not to put too much pressure on yourself and know that your body will come back.\"\n\nBack in February, before the twins were born, Kym told ET that she was receiving mom advice from fellow Dancing With the Stars pro Peta Murgatroyd, who shares a 1-year-old son, Shai, with Maksim Chmerkovskiy.\n\n\"She's been giving me some great advice [on] how she was through her pregnancy and what to expect,\" Kym revealed. \"I mean, she's incredible. I can't believe she went back to being a [DWTS] pro on the show -- I think when the baby was, like, two months old.\"\n\nHear more in the video below.\n\nReporting by Angelique Jackson.\n\nRELATED CONTENT:\n\n‘DWTS’ Pro Kym Herjavec Welcomes Twin ‘Angels’ -- See the Pic!\n\nPregnant Kym Herjavec Shares Mom Advice She Got From 'Dancing With the Stars' Pro Peta Murgatroyd (Exclusive)\n\nEXCLUSIVE: Inside Kym Herjavec's Takeover of Richard Simmons' Studio and How Husband Robert Helped\n\nKym and Robert Herjavec Welcome Twins! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2019-12/celebkids_eod.png?h=dc0df84a&itok=ZFPdSjrT", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-911315122.jpg?h=6b7011a3&itok=n5aiwDVw"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-911315122.jpg?h=6b7011a3&itok=n5aiwDVw", "keywords": [], "authors": ["Desiree Murphy"], "canonical_link": "https://www.etonline.com/kym-herjavec-gushes-over-life-with-twins-and-how-shes-getting-back-in-shape-post-pregnancy", "title": "Kym Herjavec Gushes Over Life With Twins and How She's Getting Back in Shape Post-Pregnancy (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Kym Herjavec Gushes Over Life With Twins and How She's Getting Back in Shape Post-Pregnancy (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/kym-herjavec-gushes-over-life-with-twins-and-how-shes-getting-back-in-shape-post-pregnancy", "title": "Kym Herjavec Gushes Over Life With Twins and How She's Getting Back in Shape Post-Pregnancy (Exclusive)", "description": "The 41-year-old dancer tells ET that she and her husband, Robert Herjavec, are 'having so much fun.'", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-911315122.jpg?h=6b7011a3&itok=n5aiwDVw", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 41-year-old dancer tells ET that she and her husband, Robert Herjavec, are 'having so much fun.'", "title": "Kym Herjavec Gushes Over Life With Twins and How She's Getting Back in Shape Post-Pregnancy (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy‍", "url": "https://www.etonline.com/kym-herjavec-gushes-over-life-with-twins-and-how-shes-getting-back-in-shape-post-pregnancy", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-911315122.jpg?h=6b7011a3&itok=n5aiwDVw"}, "description": "The 41-year-old dancer tells ET that she and her husband, Robert Herjavec, are 'having so much fun.'", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Kym Johnson", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}