{"url": "http://time.com/5015204/harvey-weinstein-scandal/", "text": "Since the New York Times and The New Yorker first published allegations of sexual harassment and rape against Harvey Weinstein by Rose McGowan, Gwyneth Paltrow, Ashley Judd and dozens of others, the disgraced producer has been fired from his company. In May, Weinstein was arrested in New York on charges of rape, criminal sex act, sex abuse and sexual misconduct related to interactions with two women.\n\nA report from Ronan Farrow in The New Yorker also details Weinstein’s alleged and elaborate efforts to silence journalists and accusers. The former movie executive denies the new accusations and “any allegations of non-consensual sex,” but said in a statement to the Times that, “I appreciate the way I’ve behaved with colleagues in the past has caused a lot of pain, and I sincerely apologize for it.”\n\nThe Weinstein scandal has sparked a national conversation about sexual misconduct and prompted others to come forward with accusations ranging from groping to rape against others, including former Gossip Girl actor Ed Westwick, actor Morgan Freeman and former President George H. W. Bush.\n\nThese are the prominent public figures who have been accused of sexual misconduct after the Harvey Weinstein allegations.\n\n144. Conor McGregor\n\nConor McGregor is seen on the sidelines before the NFL game between the Jacksonville Jaguars and Dallas Cowboys at AT&T Stadium on October 14, 2018 in Arlington, Texas. Ronald Martinez—Getty Images\n\nMMA fighter Conor McGregor is under investigation in Ireland after a woman accused him of sexual assault in December, the New York Times reported on March 26. According to the Times, the woman said the alleged incident occurred at the Beacon Hotel in Dublin.\n\nMcGregor has not been charged with a crime as of March 27. The news of the investigation came on the same day after McGregor announced his retirement on Twitter. McGregor has not publicly commented on the allegations, but his publicist released a statement calling his retirement unrelated to reports about the investigation.\n\n“This story has been circulating for some time, and it is unclear why it is being reported now,’’ the statement said, according to the Times. “The assumption that the Conor retirement announcement today is related to this rumor is absolutely false.”\n\nA spokesperson for McGregor didn’t immediately respond to TIME’s request for comment.\n\n143. Ryan Adams\n\nRyan Adams performs in concert on the first day of week one of the Austin City Limits Music Festival at Zilker Park on October 6, 2017 in Austin, Texas. Gary Miller—FilmMagic/Getty Images\n\nThe New York Times reported on Feb. 13 that seven women accused singer Ryan Adams of offering to help their music careers but then pursued them sexually. One woman said Adams sent her inappropriate sexual messages while she was underage. This Is Us star Mandy Moore, who was married to Adams from 2009 to 2016, said the singer was emotionally abusive during their relationship and stifled her own musical ambitions. Singer-songwriter Phoebe Bridgers said Adams became obsessive and controlling during a brief relationship. Once she broke up with Adams, Bridgers said, he rescinded offers to help further her musical career.\n\nIn a statement to the Times, a lawyer for Adams “unequivocally denie[d] that he ever engaged in inappropriate online sexual communications with someone he knew was underage.” In a series of tweets published on Feb. 13, Adams further denied the claims in the article, while apologizing to anyone he had hurt, “however unintentionally.”\n\n“I am not a perfect man and I have made many mistakes. To anyone I have ever hurt, however unintentionally, I apologize deeply and unreservedly,” he wrote. “But the picture that this article paints is upsettingly inaccurate. Some of its details are misrepresented; some are exaggerated; some are outright false.”\n\n142. Cristiano Ronaldo\n\nJuventus player Cristiano Ronaldo during the Serie A match between Juventus and SSC Napoli at Allianz Stadium on September 29, 2018 in Turin, Italy. Daniele Badolato - Juventus FC—Juventus FC via Getty Images\n\nThe Las Vegas police department reopened an investigation on Oct. 1 into whether soccer player Cristiano Ronaldo sexually assaulted Kathryn Mayorga in a hotel room in 2009. Mayorga’s attorney filed a civil complaint regarding her allegation last month, which also alleges that she signed a non-disclosure agreement in 2010 for an out-of-court settlement of $375,000.\n\nIn a statement posted on Twitter, Ronaldo denied Mayorga’s allegation. “I firmly deny the accusations being issued against me. Rape is an abominable crime that goes against everything that I am and believe in. Keen as I may be to clear my name, I refuse to feed the media spectacle created by people seeking to promote themselves at my expense,” he wrote.\n\nRonaldo was left off Portugal’s national soccer team for two November games following the reports. Portugal coach Fernando Santos said he expects Ronaldo to play for Portugal in the future.\n\n141. Brett Kavanaugh\n\nSupreme Court nominee Brett Kavanaugh during his confirmation hearing in the Senate Judiciary Committee on Capitol Hill in Washington, DC on Thursday September 6, 2018. The Washington Post—The Washington Post/Getty Images\n\nChristine Blasey Ford, a professor at Palo Alto University, accused Supreme Court nominee Brett Kavanaugh of attempting to sexually assault her when they were both in high school. In an interview with the Washington Post published on Sept. 16, Blasey Ford said that an intoxicated Kavanaugh pinned her down on a bed and groped her during a party. She said Kavanaugh put his hand over her mouth when she tried to scream. She said she was able to escape when another man at the party jumped on top of both Kavanaugh and Blasey Ford.\n\nIn a statement on Friday sent by the White House to the Post, Kavanaugh said: “I categorically and unequivocally deny this allegation. I did not do this back in high school or at any time.” The White House issued another statement on Monday denying the allegation. “On Friday, Judge Kavanaugh ‘categorically and unequivocally’ denied this allegation,” a White House spokesperson said, according to the Post. “This has not changed. Judge Kavanaugh and the White House both stand by that statement.”\n\nIn a second statement released by the White House on Monday, Kavanaugh said: “This is a completely false allegation. I have never done anything like what the accuser describes — to her or to anyone. Because this never happened, I had no idea who was making this accusation until she identified herself yesterday. I am wiling to talk to the Senate Judiciary Committee in any way the Committee deems appropriate to refuse this false allegation, from 36 years ago, and defend my integrity.”\n\nBlasey Ford initially contacted the Post in July through a tip line, and sent a letter to Democrat Anna Eshoo, her congresswoman, in July. In August, she decided not to come forward, fearing it would negatively affect her life, according to the Post. She changed her mind after The New Yorker reported that a woman sent a letter to Democrats in Congress detailing the alleged incident.\n\n140. Jeff Fager\n\n60 Minutes Executive Producer Jeff Fager accepts the Institutional Award on stage during The 77th Annual Peabody Awards Ceremony at Cipriani Wall Street on May 19, 2018 in New York City. (Photo by Brad Barket/Getty Images for Peabody) Brad Barket—Getty Images for Peabody\n\nJeff Fager, who served as the executive producer of CBS News’ 60 Minutes for more than a decade and previously served as CBS News’ chairman, left the broadcast network on Sept. 12. Fager’s departure comes just days after CBS CEO Les Moonves left the company amid allegations of sexual harassment. In The New Yorker‘s Sept. 9 story about Moonves, six women said that Fager had touched employees at company parties and protected male subordinates accused of sexual harassment. Sarah Johansen told the magazine that Fager groped her at a work party when she was an intern at CBS in the 2000s.\n\nCBS News President David Rhodes said in a statement, according to CNN, that the “action today is not directly related to the allegations surfaced in press reports, which continue to be investigated independently. However, he violated company policy and it is our commitment to uphold those policies at every level.”\n\nIn a statement to CNN, Fager said: “The company’s decision had nothing to do with the false allegations printed in The New Yorker. Instead, they terminated my contract early because I sent a text message to one of our own CBS reporters demanding that she be fair in covering the story. My language was harsh and, despite the fact that journalists receive harsh demands for fairness all the time, CBS did not like it. One such note should not result in termination after 36 years but it did.”\n\nAccording to a report from CBS News, Fager texted CBS News correspondent Jericka Duncan: “If you repeat these false allegations without any of your own reporting to back them up you will be held responsible for harming me. Be careful. There are people who lost their jobs trying to harm me and if you pass on these damaging claims without your own reporting to back them up that will become a serious problem.”\n\nA spokesperson for CBS did not immediately respond to TIME’s request for comment.\n\n139. Gérard Depardieu\n\n(FILES) In this file photo taken on June 25, 2018, French actor Gerard Depardieu waves as he arrives at the Town Hall in Brussels for a ceremony as part of the 'Brussels International Film Festival' (Photo by THIERRY ROGE / BELGA / AFP) / Belgium OUT (Photo credit should read THIERRY ROGE/AFP/Getty Images) THIERRY ROGE—AFP/Getty Images\n\nA French judicial official told the Associated Press that police launched a preliminary investigation into French actor Gérard Depardieu, who starred in Cyrano de Bergerac and La Vie en Rose, concerning rape and sexual assault allegations made by an unnamed 22-year-old woman. The woman filed a criminal complaint Monday, which alleges Depardieu sexually assaulted her on August 7 and August 13 in his home in Paris, according to French newspaper Le Parisien.\n\nDepardieu’s attorney, Herve Temime, said on France’s BFM TV that Depardieu “absolutely denies any rape, any sexual assault, any crime.” Temime did not immediately respond to TIME’s request for comment.\n\n138. Asia Argento\n\nItalian actress Asia Argento in Cannes, southern France on May 19, 2018. Loic Venance— AFP/Getty Images\n\nThe New York Times reported on Aug. 19 that Asia Argento, an Italian actress and one of the first women to publicly accuse of Harvey Weinstein of sexual assault, quietly paid $380,000 to Jimmy Bennett after he accused her of sexually assaulting him in a California hotel room in 2013 when he was 17 and she was 37. The Times story was based on documents the paper received anonymously.\n\nBennett issued his first public statement through his attorney on Aug. 22, which said: “I did not initially speak out about my story because I chose to handle in private with the person who had wronged me. My trauma resurfaced as she came out as a victim herself. I have not made a public statement in the past days and hours because I was ashamed and afraid to be part of the public narrative.”\n\nIn a statement released on Aug. 21, Argento called the allegation “absolutely false” and denied ever having a sexual relationship with Bennett. She said her late partner Anthony Bourdain recommended paying Bennett to avoid “possible negative publicity that such a person, whom he considered dangerous, could have brought upon us.”\n\nThe Los Angeles County Sheriff’s Department said it was aware of the alleged incident, and a spokesperson for the department told TIME that it is attempting to reach out to Bennett and his representatives “in an effort to appropriately document any potential criminal allegations.”\n\nOn Aug. 27, Variety reported that Argento had been fired as a judge from Italy’s X Factor. Argento has not yet commented, and her agent did not immediately respond to TIME’s request for comment.\n\nOn Sept. 5, Argento’s new attorney, Mark Heller, released a statement that said: “As revealed in the text messages published by TMZ, Asia stated, ‘The horny kid jumped me … I had sex with him it felt weird.’ She went on to relate that she became ‘frozen’ when he was on top of her and told her that she had been his sexual fantasy since he was 12 years old. Asia chose at the time not to prosecute Bennett for sexually attacking her.”\n\nThe statement also said that Bourdain only paid Bennett $250,000 of the $380,000 settlement, and Argento will not be making any more payments to Bennett.\n\nBennett’s attorney did not immediately respond to TIME’s request for comment on Heller’s statement.\n\n137. Les Moonves\n\nLes Moonves attends the 2017 American Songbook Gala at Alice Tully Hall, Lincoln Center on February 1, 2017 in New York City. Andrew Toth—FilmMagic\n\nCBS CEO Les Moonves has been accused of sexual harassment spanning three decades, according to a report by Ronan Farrow in The New Yorker. Six women told Farrow that Moonves had behaved inappropriately toward them between the 1980s and late 2000s, including four who alleged that he touched them inappropriately and two who accused him of physical intimidation and threatening behavior.\n\n“Throughout my time at CBS, we have promoted a culture of respect and opportunity for all employees, and have consistently found success elevating women to top executive positions across our Company,” Moonves said in a statement to TIME. “I recognize that there were times decades ago when I may have made some women uncomfortable by making advances. Those were mistakes, and I regret them immensely. But I always understood and respected – and abided by the principle – that ‘no’ means ‘no,’ and I have never misused my position to harm or hinder anyone’s career.\n\nThe New Yorker report also contradicts the first part of Moonves’ statement, suggesting that harassment may have occurred across the organization. Several employees, for example, accused former chairman of CBS News and a current executive producer of 60 Minutes Jeff Fager of inappropriately touching or flirting with colleagues, and of turning a blind eye toward other misconduct, according to the story.\n\nOn Sept. 9, The New Yorker reported six other women accused Moonves of sexual assault or harassment. including allegations that he forced two women to perform oral sex on him.\n\nIn a statement to The New Yorker, Moonves said: “The appalling accusations in this article are untrue. What is true is that I had consensual relations with three of the women some 25 years ago before I came to CBS. And I have never used my position to hinder the advancement or careers of women. In my 40 years of work, I have never before heard of such disturbing accusations. I can only surmise they are surfacing now for the first time, decades later, as part of a concerted effort by others to destroy my name, my reputation, and my career. Anyone who knows me knows that the person described in this article is not me.”\n\nMoonves resigned from CBS hours after the second The New Yorker report was published. In a statement, the network said it would donate $20 million — deducted from severance benefits owed to Moonves — to organizations that support the #MeToo movement. The network’s chief operating officer Joseph Ianniello will serve as CEO and president until a permanent replacement is named. Moonves’ contract stipulated that he could receive $180 million in severance. But CBS’ board said it will wait to determine Moonves’ severance after the conclusion of an external investigation into the allegations against Moonves.\n\n136. Chris Hardwick\n\nChris Hardwick attends the 100th episode celebration off \"The Walking Dead\" at The Greek Theatre on October 22, 2017 in Los Angeles, California. Jason LaVeris—FilmMagic\n\nActor Chloe Dykstra wrote in an essay published on Medium that an ex-boyfriend, whom she identified only as someone who “grew from a mildly successful podcaster to a powerhouse CEO of his own company,” sexually and emotionally abused her. The post was widely believed to be about Chris Hardwick, a TV and podcast host and founder of Nerdist Industries.\n\nIn a statement to CNN, Hardwick said: “I’m devastated to read that she is now accusing me of conduct that did not occur,” he said. “l was blindsided by her post and always wanted the best for her. As a husband, a son, and future father, I do not condone any kind of mistreatment of women.”\n\nAMC said on June 18 that it was suspending Hardwick’s show, Talking with Chris Hardwick. NBC said it would “assess” Hardwick’s role as game show host on The Wall. On July 25, AMC said Hardwick would return to the network. “Following a comprehensive assessment by AMC, working with Ivy Kagan Bierman of the firm Loeb & Loeb, who has considerable experience in this area, Chris Hardwick will return to AMC as the host of Talking Dead and Talking With Chris Hardwick,” the network said in a statement, according to The Hollywood Reporter. “We take these matters very seriously and given the information available to us after a very careful review, including interviews with numerous individuals, we believe returning Chris to work is the appropriate step.”\n\n135. Morgan Freeman\n\nMorgan Freeman accepts the Life Achievement Award onstage during the Screen Actors Guild Awards on January 21, 2018. Christopher Polk—Getty Images for Turner Image\n\nEight women accused the Oscar-winning actor of inappropriate behavior and harassment. The allegations including unwanted touching and suggestive comments, CNN reported.\n\nMorgan Freeman denied the allegations in a statement sent to TIME: “I am devastated that 80 years of my life is at risk of being undermined, in the blink of an eye, by Thursday’s media reports. All victims of assault and harassment deserve to be heard. And we need to listen to them. But it is not right to equate horrific incidents of sexual assault with misplaced compliments or humor.”\n\n134. Junot Díaz\n\nAuthor Junot Diaz poses in Union Square in New York, N.Y. on Oct. 7, 2013. Chicago Tribune—TNS via Getty Images\n\nWriter Zinzi Clemmons wrote on Twitter that Junot Díaz forcibly kissed her when she was a grad student. In an April essay for The New Yorker, Díaz wrote about being raped as a child and said he cheated on girlfriends and “hurt people” in adulthood.\n\nIn a statement to the New York Times, Díaz said: “I take responsibility for my past. That is the reason I made the decision to tell the truth of my rape and its damaging aftermath. This conversation is important and must continue. I am listening to and learning from women’s stories in this essential and overdue cultural movement. We must continue to teach all men about consent and boundaries.”\n\nIn May, Díaz stepped down as the chair of the Pulitzer Prizes amid a review into the allegations, though he remains on the board. MIT, where Díaz served as a professor, cleared him of misconduct in June following an investigation.\n\nIn an interview with The Boston Globe published June 30, Díaz denied the allegations. “I was shocked… I was, like, ‘Yo, this doesn’t sound like anything that’s in my life, anything that’s me,’” he told the paper. “I did not kiss anyone. I did not forcibly kiss Zinzi Clemmons. I did not kiss Zinzi Clemmons.”\n\nHe added that he regretted the statement he sent to the Times after the allegations were made public. “I’ve written a lot of crap in my life,” he said. “One does when one’s a writer. But, definitely, that statement is the worst thing I’ve written, the worst thing I’ve put my name to. Boy, I wish I’d had the presence of mind to rewrite the damn thing.”\n\n133. Tom Brokaw\n\nTom Brokaw has withdrawn as commencement speaker at Sacred Heart University Matt Rourke—AP\n\nTwo women — former NBC journalist Linda Vester and an unnamed woman who previously worked as a production assistant at the network — accused Tom Brokaw of making unwanted sexual advances. Vester said the veteran NBC News anchor tried to forcibly kiss her twice and groped her once, while the production assistant said Brokaw suggestively invited her to his office to discuss her career. Brokaw told the Washington Post that neither incident occurred.\n\nBrokaw said in a statement issued by NBC: “I met with Linda Vester on two occasions, both at her request, 23 years ago, because she wanted advice with respect to her career at NBC. The meetings were brief, cordial and appropriate, and despite Linda’s allegations, I made no romantic overtures towards her, at that time or any other.”\n\n132. John Kricfalusi\n\nTwo women told BuzzFeed News that John Kricfalusi, the creator of popular cartoon Ren & Stimpy, sexually preyed on them as teenagers. Both women said that they reached out to Kricfalusi to mentor them in animation.\n\nKricfalusi’s attorney said in a statement to BuzzFeed: “The 1990s were a time of mental and emotional fragility for Mr. Kricfalusi, especially after losing Ren and Stimpy, his most prized creation. For a brief time, 25 years ago, he had a 16-year-old girlfriend. Over the years John struggled with what were eventually diagnosed mental illnesses in 2008. To that point, for nearly three decades he had relied primarily on alcohol to self-medicate. Since that time he has worked feverishly on his mental health issues, and has been successful in stabilizing his life over the last decade. This achievement has allowed John the opportunity to grow and mature in ways he’d never had a chance at before.”\n\nHe later posted an 11-page apology to the two women on Facebook, writing: “I wish I could have made my apologies directly to you but now that have gone public, it seems this is the only way for me to express myself… There is some general truth in [the BuzzFeed story], some things I remember somewhat differently, some not at all. The writer exaggerated and presented some things out of context for tabloid consumption.”\n\n131. Michael Ferro\n\nMichael Ferro, chairman and chief executive officer of Merrick Ventures LLC, speaks at the Milken Institute Global Conference in Beverly Hills, California, U.S., on Wednesday, May 3, 2017. Bloomberg—Bloomberg via Getty Images\n\nFortune reported in March that two women accused Michael Ferro, an investor and the majority shareholder of publishing conglomerate Tronc, of making inappropriate advances when they sought investments for their companies. Ferro announced he was resigning from Tronc’s board of directors hours before the story was published. In April, Ferro said he would sell his shares in Tronc.\n\nFerro’s spokesperson told Fortune: “Over more than 20 years of leading public companies and other enterprises, Michael Ferro has never had a claim filed against him nor a settlement made on his behalf. Your on-the-record allegations appear to involve private conduct with private individuals who were not employees of tronc or any other company he ran. As recently announced, Mr. Ferro has retired back to private life after leading a financial turnaround of tronc as the non-executive chairman. There will, therefore, be no other comment.”\n\n130. Richard Meier\n\nArchitect Richard Meier arrives for the Robin Hood Foundation gala in New York, U.S., on Monday, May 10, 2010. Bloomberg—Bloomberg via Getty Images\n\nFive women accused Richard Meier, an architect best known for designing the Getty Center in Los Angeles, of sexual harassment, the New York Times reported in March. Two of the women said Meier exposed himself to them, while another said he grabbed her underwear through her dress at a company party.\n\nHe said in a statement to the Times: “I am deeply troubled and embarrassed by the accounts of several women who were offended by my words and actions. While our recollections may differ, I sincerely apologize to anyone who was offended by my behavior.” He added he would take a six-month leave from his architecture firm.\n\n129. Sherman Alexie\n\nSherman Alexie is the writer/director of 'Smoke Signals,' a film about Native American Indians opening next Friday. The Washington Post—Washington Post/Getty Images\n\nIn February, writer Litsa Dremousis tweeted that she had “known about the allegations against Sherman Alexie” from a number of women, without providing specifics.\n\nThe author, best known for The Lone Ranger and Tonto Fistfight in Heaven, responded in a statement, saying he has “done things that have harmed other people, including those I love most deeply. To those whom I have hurt, I genuinely apologize.. There are women telling the truth about my behavior and I have no recollection of physically threatening anybody or their careers.”\n\nBut in the same statement, Alexie said that he denied “the accusations, insinuations, and outright falsehoods” made by Dremousis.\n\n“She has withheld from the public the fact that she and I had previously been consenting sexual partners,” he added. “Ms. Dremousis has continually tweeted and spoken in public about my behavior, making accusations based on rumors and hearsay and quoting anonymous sources.”\n\nA week later, NPR spoke to three women on the record who said Alexie had made inappropriate comments and unwanted sexual advances. Alexie has not commented further on the allegations, and he declined to accept the prestigious Carnegie Medal in March.\n\n128. Philip Berk\n\nPhilip Berk, president of the Hollywood Foreign Press Association, speaks before the nominees for the Golden Globe Awards are announced at the Beverly Hilton in Beverly Hills, California, December 14, 2006. Bloomberg—Bloomberg via Getty Images\n\nThe Mummy star Brendan Fraser told GQ in February that Berk, the former Hollywood Foreign Press Association President, groped his behind in 2003.\n\nBerk, who still serves as a member of the Golden Globes governing body, said that he pinched Fraser’s behind in jest. He said in a statement to GQ: “Mr. Fraser’s version is a total fabrication.”\n\nIn April, Berk took a voluntary six-month leave of absence from the organization following a separate controversy surrounding comments he made about fellow HFPA members in his book, With Signs and Wonders.\n\n127. Lemony Snicket\n\nSeveral writers accused the A Series of Unfortunate Events author, whose real name is Daniel Handler, of making sexually inappropriate comments, the Pacific Standard reported.\n\nIn a statement posted on GwendaBond.com, Snicket wrote: “It has never been my wish to insult any of my professional colleagues. I sincerely, if tardily, apologize… As a survivor of sexual violence, I also know very well how words or behaviors that are harmless or even liberating to some people can be upsetting to others.”\n\n“I am listening and willing to listen; I am learning and willing to learn,” he added.\n\n126. Patrick Demarchelier\n\nSeven women accused the famed fashion photographer of sexual harassment and making unwanted sexual advances, the Boston Globe reported in February.\n\nCondé Nast, which publishes Vogue, Glamour and Vanity Fair, said in February it had stopped working with Demarchelier for the “foreseeable future.”\n\nDemarchelier denied the allegations in a statement to the Globe. “People lie and they tell stories … It’s ridiculous.”\n\n125. Vincent Cirrincione\n\nThe Washington Post reported in February that nine women had accused Cirrincione, a talent manager who has worked with Halle Berry and Taraji P. Henson, of making unwanted sexual advances. Three of the women alleged that Cirrincione told them having sex with him was a condition of representing them, while another woman said that he masturbated in front of her in his office.\n\nCirrincione denied in a statement to the Post that he asked for sexual favors on the condition of representing actors.\n\n“I have had affairs while in committed relationships, ones I am now ashamed to say are coming to light and shading my past and my reputation. I can say without a doubt that I have never used favors, sexual or otherwise, as a reason for managing anyone. I want to make it clear that not one of those relationships were anything but consensual,” he told the Post. “I take responsibility for my part in the situation and I am not here to diminish anyone’s feelings or experiences. I apologize to these women, my past and present partner, my clients and employees for the pain this is bringing them. I was under the impression I was living my life as a supportive man to women. It is with a heavy heart that I see now I was wrong.”\n\nBoth Berry and Henson spoke out against Cirrincione following the Post’s report.\n\n124. Paul Marciano\n\nFashion designer and co-founder of Guess? Inc. Paul Marciano speaks at GUESS Celebrates 35 Years with Opening of Exhibition at the FIDM Museum & Galleries at FIDM Museum & Galleries on the Park on June 5, 2017 in Los Angeles, California. Emma McIntyre—Getty Images for GUESS, Inc.\n\nKate Upton told TIME in February that Marciano, the co-founder and executive chairman of Guess, forcibly kissed her, grabbed her breasts and harassed her when she began modeling for the brand. The photographer on the campaign, Yu Tsai, told TIME he witnessed the harassment.\n\nAt the time, Marciano told TIME that Upton’s allegations were “absolutely false.” He said in a statement: “I have never been alone with Kate Upton. I have never touched her inappropriately. Nor would I ever refer to a Guess model in such a derogatory manner.”\n\nIn June, Guess announced that Marciano stepped down as executive chairman following an investigation into the allegations. He will stay on as chief creative officer and as a member of the board until his contract expires in January, the company said.\n\nThe company’s investigation found that Marciano “exercised poor judgment in his communications with models and photographers and in placing himself in situations in which plausible allegations of improper conduct could, and did, arise.”\n\n123. Scott Baio\n\nScott Baio speaks at the Republican National Convention in Cleveland on July 18, 2016 J. Scott Applewhite—AP\n\nActor Nicole Eggert said in a January interview with Megyn Kelly Today that her Charles in Charge co-star Scott Baio repeatedly sexually abused her on the set of 80s sitcom. Charles in Charge actor Alexander Polinsky said he witnessed inappropriate cuddling between Baio and Eggert on set.\n\nBaio denied Eggert’s allegations, saying they only had one consensual encounter when Eggert was 18. “These are false allegations,” Baio said.\n\nThe Los Angeles County District Attorney’s Office announced in June that it had declined to press charges against Baio, saying the statute of limitations had expired.\n\n122. Steve Wynn\n\nWynn Resorts Chairman and CEO Steve Wynn speaks at the Global Gaming Expo (G2E) 2014 at The Venetian Las Vegas on September 30, 2014 in Las Vegas, Nevada. Ethan Miller—Getty Images\n\nThe Wall Street Journal reported on Jan. 26 that dozens of employees at Wynn’s casinos described a “decades-long pattern of sexual misconduct,” which included forcing some employees to perform sexual acts. In one alleged incident, a manicurist who worked at the Wynn Last Vegas said that casino mogul forced her to have sex. The woman’s supervisor later filed a report to the casino’s HR department, and Wynn later paid the woman a $7.5 million settlement, according to the Journal.\n\nIn a statement to the Journal, Wynn denied the allegations. “The idea that I ever assaulted any woman is preposterous,” he said. “We find ourselves in a world where people can make allegations, regardless of the truth, and a person is left with the choice of weathering insulting publicity or engaging in multi-year lawsuits. It is deplorable for anyone to find themselves in this situation.”\n\nHe added that the allegations were the “continued work of my ex-wife Elaine Wynn, with whom I am involved in a terrible and nasty lawsuit in which she is seeking a revised divorce settlement.”\n\n121. David Copperfield\n\nIllusionist David Copperfield attends 'Now You See Me 2' World Premiere at AMC Loews Lincoln Square 13 theater on June 6, 2016 in New York City. Gilbert Carrasquillo—FilmMagic\n\nThe Wrap reported on Jan. 24 that model Brittany Lewis accused Copperfield of drugging her and sexually assaulting her in 1988 when she was 17. Lewis told the online publication that she met Copperfield at a modeling competition, where the magician served as a judge.\n\nCopperfield’s spokesperson declined to comment to TIME. In a statement released on his Twitter and Instagram pages shortly before The Wrap published its report, Copperfield said: “The #MeToo movement is crucial and long overdue. We all want people who feel they’ve been victims of sexual misconduct to be empowered, and as a rule we should listen, so more will feel comfortable coming forward.”\n\n“But imagine what it’s like, believing in the movement, and having also been falsely accused publicly in the past,” he wrote. “Always listen, and consider everything carefully, but please for everyone’s sake don’t rush to judgment.”\n\nCopperfield’s statement appears to reference a 2007 allegation made by Lacey Carroll, who told authorities Copperfield invited her to his home in the Bahamas and sexually assaulted her. The FBI investigated Carroll’s claims, but the case was closed without charges against Copperfield. Carroll was later arrested for prostitution and providing a false police report in connection with a separate case, in which she accused another man of sexual assault. She denied the charges, but pleaded guilty to obstructing a police officer, according to the Seattle Times.\n\n120. Michael Douglas\n\nActor Michael Douglas attends the premiere of \"Flatliners\" at The Theatre at Ace Hotel on September 27, 2017 in Los Angeles, California. Jason LaVeris—FilmMagic\n\nSusan Braudy, a journalist and author who worked for Douglas’ production company in the 1980s,told The Hollywood Reporter in a Jan. 18 story that Douglas once masturbated in front of her during a one-on-one meeting and repeatedly made inappropriate comments about her appearance.\n\nDouglas denied the allegation. In a statement, Douglas said: “This is a complete lie, fabrication, no truth in it whatsoever.” On Jan. 10, days before Braudy’s allegations went public, Douglas told Deadline that his attorney had been contacted by The Hollywood Reporter regarding allegations, which align with Brady’s, against him. In the interview, Douglas preemptively denied the allegations.\n\n“I felt the need to get ahead of this,” Douglas said. “It’s extremely painful. I pride myself on my reputation in this business, not to mention the long history of my father and everything else… It has caused tremendous stress to me for something I believe I have nothing to regret or feel responsible for.”\n\n119. Ross Levinsohn\n\nNPR reported on Jan. 18 that Levinsohn, the CEO and publisher of the Los Angeles Times, had been a defendant in two sexual harassment lawsuits. Levinsohn, in sworn testimony for one of the suits, admitted to rating the “hotness” of female colleagues and speculating whether a female employee worked as a stripper on the side. Other former colleagues and associates of Levinsohn said they had seen him aggressively kissing a woman at an event.\n\nTronc, the parent company for the Times, said it would investigate Levinsohn. “This week, we became aware of allegations that Ross Levinsohn acted inappropriately. We are immediately launching an investigation so that we have a better understanding of what’s occurred,” A spokesperson said on Tronc’s behalf.\n\nLevinsohn told NPR’s CEO Jarl Mohn that the allegations against him were “lies,” according to NPR.\n\n118. Mario Testino\n\nMario Testino attends the FENTY PUMA by Rihanna Spring/Summer 2018 Collection at Park Avenue Armory on September 10, 2017 in New York City. Kevin Mazur—Getty Images for FENTY PUMA By Rihanna\n\nThirteen male models and assistants who worked with renowned fashion photographer Mario Testino told the New York Times he made unwanted sexual advances toward them, including instances of groping and masturbation.\n\nThe law firm Lavely & Singer, which represents Testino, challenged the character and credibility of those who spoke out. In an email to the Associated Press, Testino’s lawyer Andrew Brettler said, “We are not providing any further comment at this time.”\n\n117. Joel Kramer\n\nActress Eliza Dushku said Joel Kramer, a stunt coordinator, molested her when she was 12 years old while in production for the 1994 film True Lies. Kramer, who was 36 at the time, was involved in her stunt coordination during the production of the film. In a Facebook post, Duskhu said Kramer intentionally injured her in a stunt after she told an adult about the incident.\n\nIn a statement to Deadline, Kramer has denied the accusations, calling them “outlandish” and “manipulated.”\n\n116. James Franco\n\nJames Franco poses for a portrait at the BAFTA Los Angeles Tea Party on Jan. 6, 2018 in Beverly Hills, California. Rich Fury—Getty Images\n\nThe Los Angeles Times reported on Jan. 11 that five women accused Franco of sexually inappropriate behavior. Four of the women were Franco’s former acting students, while another said Franco was her mentor. The allegations came to light after Franco faced criticism for wearing a “Time’s Up” pin at the Golden Globes to show support for a movement launched by Hollywood women to fight sexual harassment and gender inequality.\n\nFranco’s attorney denied the allegations. In an interview with Stephen Colbert on Jan. 9, Franco specifically addressed two allegations made on social media as “not accurate.”\n\n115. Joel Achenbach\n\nThe Washington Post announced on Jan. 10 that it had suspended Achenbach, a reporter, for 90 days without pay following allegations of “inappropriate workplace conduct” with current and former female colleagues. The newspaper did not detail the allegations against Achenbach.\n\nIn a statement to the Post, Achenbach said: “I’m very sorry to say that I’ve behaved badly and have been suspended by The Post for three months for inappropriate workplace conduct. I’ve said and done things that were unprofessional, and I apologize to the women affected by this and acknowledge their courage in speaking out.”\n\n114. James Rosen\n\nNPR reported on Jan. 10 that Fox News fired Rosen, its chief White House correspondent, following allegations of sexual harassment. According to NPR, the allegations include grabbing a colleague’s breast, trying to forcibly kiss a young reporter in an elevator and sending inappropriate messages through the network’s internal messaging system.\n\nRosen declined to comment on the allegations to NPR.\n\n113. Paul Haggis\n\nAfter publicist Haleigh Breest filed a civil lawsuit last month alleging that Haggis, the Academy Award-winning producer and writer of Crash, raped her, the Associated Press reported allegations from three more women on Jan. 5. One woman told the AP that Haggis had raped her, while two others said he kissed them without their consent.\n\nHaggis denied Breest’s allegations at the time. Haggis’ attorney denied the new allegations, telling AP: “He didn’t rape anybody.”\n\n112. Mike Germano\n\nMike Germano speaks onstage at the Nasdaq Innovation Series: Going Vertical panel at Nasdaq MarketSite during 2016 Advertising Week New York on September 28, 2016 in New York City. Roy Rochlin—Getty Images for Advertising Week New York\n\nVice Media announced on Jan. 2 that Germano, Vice’s chief digital officer and the founder and CEO of Carrot Creative, a digital ad agency acquired by the media company in 2013, would remain on leave following allegations of sexual misconduct. The New York Times reported in December that Germano allegedly made inappropriate comments to female staffers and pulled a woman, Gabrielle Schaefer, onto his lap at a work event.\n\nVice Media COO and CFO Sarah Broderick wrote in a memo to staffers that the company’s human resources division and an external investigator will investigate the allegations against Germano.\n\nIn a statement to the Times, Creighton said: “Carrot has been repeatedly recognized as one of the industry’s best places to work, and I do not believe that these allegations reflect the company’s culture — or the way we treat each other. With regards to the incident with Ms. Schaefer, I agreed at that time it was inappropriate, I apologized, and it was resolved with the help of HR.”\n\n111. Andrew Creighton\n\nAndrew Creighton, President of VICE Media Group during the Vice.com Launch Party at Skylight One Hanson on Sept. 15, 2011 in the Brooklyn borough of New York City. Astrid Stawiarz—Getty Images\n\nVice Media announced on Jan. 2 that Creighton, the company’s president, would remain on a leave of absence following allegations of sexual misconduct. The New York Times reported last month that Creighton had paid a $135,000 settlement to a former employee who alleged she was fired after turning down his sexual advances.\n\nIn a statement to the Times, Creighton said that he had occasional, consensual interactions with the woman and denied that he was involved in firing her. “I apologize for the situation, and it has caused much thought in my responsibilities of care for my colleagues, and I will hold myself and others accountable in constructing a respectful workplace environment,” he told the Times.\n\nIn a memo to staff, Vice Media’s COO and CFO Sarah Broderick said that the allegations against Creighton were found to “lack merit” in a prior investigation, but that the company settled to “avoid the expense and distraction of litigation.” She added a special committee of VICE’s board would review the facts and make a recommendation. “In the meantime, Andrew has suggested, and we agree, that he remain out of the office on leave until the recommendation from the committee is made to Sr. management,” she wrote.\n\n110. Peter Martins\n\nNYCB Ballet Master in Chief Peter Martins speaks during the New York City Ballet's 2017 Fall Fashion Gala on September 28, 2017 in New York City. Owen Hoffmann—Patrick McMullan via Getty Images\n\nMartins, the leader of the New York City Ballet, announced on Jan. 1 that he would retire amid allegations of sexual misconduct, the New York Times reported. Martins was accused of sexual harassment in an anonymous letter in December, and five dancers told the Times that Martins verbally and physically abused them.\n\n“I have denied, and continue to deny, that I have engaged in any such misconduct,” Martins wrote in a letter announcing his retirement, according to the Times.\n\n109. Corey Lewandowski\n\nCorey Lewandowski, campaign manager for Republican presidential candidate Donald Trump, waits before the start of a foreign policy speech at the Mayflower Hotel in Washington D.C. on April 27, 2016. Evan Vucci—AP\n\nSinger Joy Villa said on Dec. 27 that she filed a police report against Lewandowski, a former campaign manager for President Donald Trump. Villa, a vocal Trump supporter, alleged that Lewandowski grabbed her behind twice at a party in Washington in November.\n\nIn an interview with Fox Business, Lewandowski said: “There is a due process and there is a process which they will go through to determine a person’s innocence.”\n\n108. Chuck Close\n\nPainter Chuck Close attends the 11th Annual Stand Up for Heroes at The Theater at Madison Square Garden on November 7, 2017 in New York City. Jim Spellman—WireImage\n\nThe New York Times reported on Dec. 20 that several women accused Close, an acclaimed painter and artist, of sexually harassing them while posing for his portraits. Two women said that Close asked them to pose nude, while another woman said Close made inappropriate comments about her body.\n\nIn a statement to the Times, Close denied some of the allegations, but said that he has spoken crudely about woman’s body parts in the past. “Last time I looked, discomfort was not a major offense,” he told the Times. “I never reduced anyone to tears, no one ever ran out of the place. If I embarrassed anyone or made them feel uncomfortable, I am truly sorry, I didn’t mean to. I acknowledge having a dirty mouth, but we’re all adults.”\n\n107. Charles Dutoit\n\nSwiss conductor Charles Dutoit conducting at Avery Fisher Hall on January 1, 1985 in New York City. Waring Abbott—Getty Images\n\nThree opera singers and a classical musician accused Dutoit, the 81-year-old artistic director and principal conductor of London’s Royal Philharmonic Orchestra, of sexual assault and misconduct in interviews with the Associated Press. The women allege that the incidents took place over the course of nearly three decades, from 1985 to 2010, while they were rehearsing and performing in five cities across the United States. They told the AP that they resisted his advances.\n\nDutoit did not respond to requests for comment from the AP; the Royal Philharmonic told the outlet he was on vacation, and they had forwarded requests for comment to him.\n\n106. Jack Latvala\n\nAn investigation, conducted by former Judge Ronald Swanson on behalf of the Florida State Senate, found that Latvala, a Republican state senator, routinely touched a woman in a sexual manner and offered his support for legislation in exchange for sexual favors. Six women had previously accused Latvala of groping them. The Florida State Senate launched the investigation after Rachel Perrin Rogers, a top aide to the State Senate Majority Leader Wilton Simpson, filed a complaint accusing Latvala of inappropriately touching her.\n\nLatvala, who did not immediately respond to TIME’s request for comment, has denied all of the allegations. He told the Miami Herald that he was stunned by the report’s findings. “I just did not foresee this going down this way,” he said. “None of my legal team foresaw this going down this way. I really thought we were in pretty good shape.”\n\n105. T.J. Miller\n\nT.J. Miller arrives at the premiere of 'The Emoji Movie' at Regency Village Theatre on July 23, 2017 in Westwood, California. Axelle/Bauer-Griffin—FilmMagic\n\nOn Dec. 19, The Daily Beast reported that one unnamed woman accused Miller of sexual misconduct in college at George Washington University. The woman told the Daily Beast that Miller choked her, punched her and sexually assaulted her. “He just tried a lot of things without asking me,” she told the Daily Beast.\n\nThe publication reported that five people corroborated some of the details of the woman’s story. The woman took her allegations to George Washington University’s student court at the time. The woman told the Daily Beast that the university told her the issue was resolved after a trial period. George Washington University told the Daily Beast it could not comment on the outcome because of federal privacy law.\n\nOn the same day, Comedy Central announced that it had cancelled Miller’s The Gorburger Show, but a Comedy Central spokesperson told TIME the cancellation happened over the summer and was unrelated to the allegations.\n\nIn a statement posted to Instagram, Miller denied the allegations. “We met this woman over a decade ago while studying together in college, she attempted to break us up back then by plotting for over a year before making contradictory claims and accusations,” the statement said. “We are confident that a full consideration of accounts from and since that time will shed light and clarity on the true nature of not only this person’s character, and also on the real facts of the matter.”\n\n“Sadly she is now using the current climate to bandwagon and launch these false accusations again. It is unfortunate that she is choosing this route as it undermines the important movement to make women feel safe coming forward about legitimate claims against real known predators,” the statement added.\n\n104. Gene Simmons\n\nGene Simmons visits SiriusXM Studios on November 16, 2017 in New York City. Slaven Vlasic—Getty Images\n\nA lawsuit filed on Dec. 15 in Los Angeles County Superior Court alleges that Simmons, a former member of the band KISS, made “sexually offensive contact” with an unnamed TV and radio broadcaster when she interviewed him on Nov. 1. The lawsuit alleges Simmons “forcefully” placed the woman’s hand on his knee and answered her questions with sexual innuendos.\n\nSimmons denied the allegations in a statement. “I intend to defend myself against any alleged charges you may have been reading about in the media,” Simmons said. “For the record, I did not assault the person making these accusations in the manner alleged in the complaint or harm her in any way.”\n\n103. Andrea Ramsey\n\nRamsey, a Democratic Congressional candidate in Kansas, dropped out of the race after a 12-year-old sexual harassment lawsuit resurfaced. Gary Funkhouser alleged Ramsey retaliated against him and fired him from his job at OneLab Inc., where Ramsey worked as vice president, after he turned down her sexual advances.\n\n“Twelve years ago, I eliminated an employee’s position,” Ramsey said in a Dec. 15 Facebook post. “That man decided to bring a lawsuit against the company (not against me). He named me in the allegations, claiming I fired him because he refused to have sex with me. That is a lie.”\n\n“We are in a national moment where rough justice stands in place of careful analysis, nuance and due process,” she wrote. “On balance, it is far more important to me that women are stepping forward to tell their stories and confront their harassers than it is to continue our campaign.”\n\n102. Jerry Richardson\n\nCarolina Panthers owner Jerry Richardson looks on prior to the NFC Championship Game between the Arizona Cardinals and the Carolina Panthers at Bank of America Stadium on January 24, 2016 in Charlotte, North Carolina. Kevin C. Cox—Getty Images\n\nSports Illustrated reported that the NFL’s Carolina Panthers have made at least four confidential payouts to settle complaints related to allegations of workplace misconduct against team owner Jerry Richardson. The allegations include touching female employees, making comments about women’s appearances, asking if he could shave female employees’ legs and using a racial slur.\n\nThe NFL said it will investigate the allegations, while Richardson, who has not personally commented on the allegations, said he would put the team up for sale.\n\n“The Carolina Panthers and Mr. Richardson take these allegations very seriously and are fully committed to a full investigation and taking appropriate steps to address and remediate any misconduct,” Panthers’ spokesperson Steve Drummond told Sports Illustrated.\n\n101. Chris Matthews\n\nTalk show host Chris Matthews attends the Screenwriters Tribute during the 2017 Nantucket Film Festival - Day 3 on June 23, 2017 in Nantucket, Massachusetts. Theo Wargo—Getty Images for Nantucket Film Festival\n\nAn MSNBC spokesperson confirmed on Dec. 17 that a former staffer had received a settlement in 1999 after complaining Matthews, the host of Hardball with Chris Matthews, had sexually harassed her. The woman alleged that Matthews made inappropriate comments about her in front of others. The MSNBC spokesperson said that Matthews was reprimanded at the time. The Daily Caller first reported the settlement.\n\nMatthews has not commented. His agent did not immediately respond to TIME’s request for comment.\n\n100. Brad Kern\n\nVariety reported that CBS TV Studios opened two human resources investigations into allegations of sexual harassment and discrimination against Kern, the showrunner of NCIS: New Orleans, in 2016. The allegations included making sexualized remarks about women, giving women massages without their consent and mocking a nursing mother in front of her colleagues.\n\nVariety reported that CBS found that Kern had made “insensitive” and “offensive” comments, but found no evidence of discrimination, harassment or gender bias. CBS told Variety in a statement: “We were aware of these allegations when they took place in 2016, and took them very seriously. Both complaints were acted upon immediately with investigations and subsequent disciplinary action. While we were not able to corroborate all of the allegations, we took this action to address behavior and management style, and have received no further complaints since this was implemented.”\n\nKern, who was also the executive producer on Charmed, declined to comment to Variety. His agent did not immediately respond to TIME’s request for comment.\n\n99. Andrew Duncan\n\nProducer Andrew Duncan attends the International Premiere of \"Thoroughbreds\" during the 61st BFI London Film Festival on October 9, 2017 in London, England. Jeff Spicer—Getty Images for BFI\n\nVariety reported on Dec. 14 that Duncan, the producer of the critically acclaimed film The Florida Project, stepped down from his production company June Pictures amid allegations that he sexually harassed several people at the company. The allegations, which were detailed in The Hollywood Reporter, included having one employee pay for prostitutes, asking a female producer to have sex with her husband while he watched and kissing a crew member without her consent.\n\n“In light of allegations of misconduct against our investor Andrew Duncan, I am assuming sole ownership and leadership of June Pictures,” June Pictures CEO Alex Saks said in a statement to Variety. “June Pictures is committed to a respectful work environment dedicated to producing quality films. We will continue our projects already in production and development.”\n\nIn a statement to The Hollywood Reporter, Duncan declined the allegations. “It is both a painful and more difficult course of action for me to confront lurid and baseless allegations about my conduct in this detailed way,” Duncan said. “It seems obvious to me that substantiated facts and fairness are utterly absent from this reporting and that instead hidden sources are co-opting the press for their own, ulterior motives. I intend to stand up for my integrity and confront any wrongful allegations of misconduct and also any concealed methods that are taking place to advance those malicious claims.”\n\n98. Morgan Spurlock\n\nDirector Morgan Spurlock speaks on stage during an In Conversation on day six of the 14th annual Dubai International Film Festival held at the Madinat Jumeriah Complex on December 11, 2017 in Dubai, United Arab Emirates. Vittorio Zunino Celotto—Getty Images for DIFF\n\nThe Super Size Me director said in a social media post on Dec. 13 that he had been accused of rape and that he had separately settled a sexual harassment suit with a former assistant. He said the rape allegation stemmed from a one-night stand in college when both he and the woman were drunk and she told Spurlock that she didn’t want to have sex, but they later had sex anyway. Spurlock wrote that the woman later said he had raped her, but there was no investigation or police report. Spurlock also said he verbally harassed his former assistant by calling her “hot pants” and “sex pants.” He said that the suit was settled around eight years ago.\n\n“I am not some innocent bystander, I am also a part of the problem,” Spurlock wrote in his post. “But I am also part of the solution. By recognizing and openly admitting what I’ve done to further this terrible situation, I hope to empower the change within myself. We should all find the courage to admit we’re at fault. More than anything, I’m hopeful that I can start to rebuild the trust and the respect of those I love most. I’m not sure I deserve it, but I will work everyday to earn it back. I will do better. I will be better. I believe we all can.”\n\n97. Tavis Smiley\n\nBroadcaster/Producer Tavis Smiley serves as host and moderator on Courting Justice With Tavis Smiley on December 8, 2016 in Cleveland, Ohio. Earl Gibson III—Getty Images\n\nOn Dec. 13, PBS suspended distribution of Tavis Smiley’s nightly show following an investigation into “multiple, credible allegations” of sexual misconduct. Variety reported that Smiley, who has contributed opinion pieces to TIME, had sexual relationships with subordinates and created a verbally abusive and threatening environment. PBS distributes Smiley’s show, but doesn’t fund its production or employ Smiley.\n\nSmiley told TIME on Dec. 13: “PBS overreacted and conducted a biased and sloppy investigation, which led to a rush to judgment, and trampling on a reputation that I have spent an entire lifetime trying to establish,” he said. “I have the utmost respect for women and celebrate the courage of those who have come forth to tell their truth… To be clear, I have never groped, coerced, or exposed myself inappropriately to any workplace colleague in my entire broadcast career, covering 6 networks over 30 years.”\n\n“If having a consensual relationship with a colleague years ago is the stuff that leads to this kind of public humiliation and personal destruction, heaven help us,” he added.\n\n96. Eric Alexander Hewitt\n\nThe Boston Globe reported that four former Boston Conservatory students said that Hewitt, an influential musician and professor, made unwanted sexual advances toward them. One woman alleged Hewitt sexually assaulted her. The Boston Conservatory at Berklee and Boston College High School ended their relationships with Hewitt, while Phillips Exeter Academy placed Hewitt on leave.\n\nHewitt did not respond to the Globe‘s multiple requests for comment. Hewitt did not immediately respond to TIME’s request for comment.\n\n95. Ken Friedman\n\nKen Friedman attends New York Magazines 3rd Annual Oscar Viewing Party at The Spotted Pig on February 24, 2008 in New York City. Patrick McMullan—Patrick McMullan via Getty Images\n\nThe New York Times reported on Dec. 12 that ten women alleged Friedman, a famed restauranteur, made unwanted sexual advances. Friedman and his business partner, acclaimed chef April Bloomfield, own five restaurants in New York, including the famed Spotted Pig, and two in California. The allegations include groping them in public, making them work all night at parties that included sex and nudity and demanding sex and nude photos. Former employees claimed that Friedman also had consensual relationships with employees and fired or promoted staffers based on physical appearance.\n\nWomen also said that they witnessed Mario Batali, who announced he would step away from his company on Dec. 11 following allegations of sexual misconduct, engage in sexual misconduct at the Spotted Pig with Friedman’s knowledge.\n\nFriedman told the Times: “Some incidents were not as described, but context and content are not today’s discussion… I apologize now publicly for my actions.” He added that his female staffers “are among the best in the business and putting any of them in humiliating situations is unjustifiable.” A spokesperson for Friedman did not immediately respond to TIME’s request for comment.\n\n94. Dan Johnson\n\nKentucky state Rep. Dan Johnson speaks during a news conference outside the Bullitt County courthouse in Shepherdsville, Ky. AP/REX/Shutterstock\n\nThe Kentucky Center for Investigative Reporting reported on Dec. 11 that Maranda Richmond asked Louisville police to reopen a sexual assault investigation into Johnson, who was elected to the Kentucky state legislature in 2016. Richmond alleged that Johnson molested her in 2012 when she was 17. She said she reported it to police in 2013, but said the case was closed without charges.\n\nJohnson, who sparked outrage last year after posting images on Facebook that compared then- President Barack Obama and First Lady Michelle Obama to monkeys, said the allegations are “without merit.” He said he wouldn’t resign, according to the Louisville Courier-Journal.\n\n“The fact of the matter is that we live in a country where people have elections, and people vote people in,” Johnson said. “The people who run for office are just people, and there are no perfect people. … I think there are people who have taken that and used it as political rocks to be thrown.” A spokesperson for Johnson did not immediately respond to TIME’s request for comment.\n\nOn Dec. 13, Johnson was found dead in what police called a “probable suicide.”\n\n93. Eric Davis\n\nEric Davis talks with players after the Pro Bowl practice at Turtle Bay Resort on North Shore Oahu, HI. Icon Sports Wire—Corbis via Getty Images\n\nESPN suspended Davis, a former football player who now hosts a radio show on the sports network, following a lawsuit filed by former NFL Network stylist Jami Cantor. The lawsuit alleges Davis made lewd comments and groped Cantor. “We are investigating and McNabb and Davis will not appear on our networks as that investigation proceeds,” an ESPN spokesman said in a statement, according to the New York Times.\n\nDavis has not commented. TIME could not immediately reach Davis.\n\nIn January, ESPN said it had fired McNabb and Davis.\n\n92. Donovan McNabb\n\nFormer professional football player Donovan McNabb attends the 'Forgotten Four: The Integration Of Pro Football' screening presented by EPIX & UCLA at Royce Hall, UCLA on September 9, 2014 in Westwood, California. Imeh Akpanudosen—Getty Images for EPIX\n\nESPN suspended McNabb, a former NFL quarterback who now hosts a radio show on the sports network, following a lawsuit filed by former NFL Network wardrobe stylist Jami Cantor. The lawsuit alleges McNabb sent sexually inappropriate text messages while he was at NFL Network, which he left in 2013. “We are investigating and McNabb and Davis will not appear on our networks as that investigation proceeds,” an ESPN spokesman said in a statement, according to the New York Times.\n\nMcNabb has not commented. His agent did not immediately respond to TIME’s request for comment.\n\nIn January, ESPN said it had fired McNabb and Davis.\n\n91. Marshall Faulk\n\nFormer NFL running back Marshall Faulk attends the Marshall Faulk Celebrity Golf Champions Dinner Presented by GREY GOOSE held at La Costa Resort & Spa on May 18, 2013 in Carlsbad, California. Jesse Grant—2013 Getty Images\n\nThe NFL Network suspended Faulk, a network analyst and Hall of Fame running back, after the network’s former stylist Jami Cantor filed a lawsuit alleging Faulk and others had sexually harassed her. The network said it would investigate Cantor’s claims. The lawsuit, which was uploaded by Deadspin, alleges that Faulk demanded oral sex during one incident and groped Cantor’s breasts and behind. The lawsuit also alleges that Faulk has her “deeply personal and invasive questions.” Cantor also named Heath Evans, Ike Taylor and Eric Weinberger.\n\nFaulk has not commented. His spokesperson did not immediately respond to TIME’s request for comment.\n\n90. Eric Weinberger\n\nExecutive producer Eric Weinberger speaks onstage at the Variety Sports Entertainment Breakfast at Vibiana on July 14, 2015 in Los Angeles, California. Michael Buckner—Getty Images for Variety\n\nThe Bill Simmons Media Group, which operates the website The Ringer, suspended its president Weinberger following a lawsuit filed by former NFL Network stylist Jami Cantor. The lawsuit alleges that Weinberger, who left his job at the NFL Network in 2015, groped her and put his crotch against her.\n\n“These are very serious and disturbing allegations that we were made aware of today,” a spokesman for the Bill Simmons Media Group told the New York Times. “We are placing Eric on leave indefinitely until we have a better understanding of what transpired during his time at the N.F.L., and we will conduct our own internal investigation.”\n\nWeinberger has not commented.\n\nIn March, the Bill Simmons Media Group and Weinberger announced they had “mutually agreed” that Weinberger would leave the company.\n\n89. Ike Taylor\n\nFormer NFL player Ike Taylor visits the SiriusXM set at Super Bowl LI Radio Row at the George R. Brown Convention Center on February 3, 2017 in Houston, Texas. Cindy Ord—Getty Images for SiriusXM\n\nThe NFL Network suspended Taylor, an analyst for the network and former NFL cornerback, following a lawsuit filed by the network’s former stylist Jami Cantor that alleges he sent her a video that showed him masturbating. The network said it would investigate Cantor’s claims.\n\nTaylor has not yet commented. His spokesperson did not immediately respond to TIME’s request for comment.\n\n88. Heath Evans\n\nFormer NFL player Heath Evans attends the Cedars-Sinai Sports Spectacular at the Hyatt Regency Century Plaza on May 31, 2015 in Century City, California. David Livingston—Getty Images\n\nThe NFL Network suspended Evans, an analyst for the network and former NFL fullback, following a lawsuit filed by the network’s former stylist Jami Cantor that alleges he sent nude photos and propositioned her. The network said it would investigate Cantor’s claims.\n\nEvans has not commented. His spokesperson did not immediately respond to TIME’s request for comment.\n\n87. Ryan Lizza\n\nWashington correspondent for The New Yorker Ryan Lizza attends The New Yorker's annual party kicking off The White House Correspondents' Association Dinner Weekend on April 29, 2016 in Washington, DC. Dimitrios Kambouris—Getty Images for The New Yorker\n\nThe New Yorker announced on Dec. 11 that it had cut ties with its Washington correspondent Lizza for “improper sexual conduct.” “We have reviewed the matter and, as a result, have severed ties with Lizza. Due to a request for privacy, we are not commenting further,” the magazine said in a statement, according to Politico’s Michael Calderone.\n\nIn a statement reported by Calderone, Lizza said: “I am dismayed that The New Yorker has decided to characterize a respectful relationship with a woman I dated as somehow inappropriate. The New Yorker was unable to cite any company policy that was violated. I am sorry to my friends, workplace colleagues, and loved ones for any embarrassment this episode may cause. I love The New Yorker, my home for the last decade, and I have the highest regard for the people who work there. But this decision, which was made hastily and without a full investigation of the relevant facts, was a terrible mistake.” He did not immediately respond to TIME’s request for comment.\n\nLizza also worked as a political commentator at CNN. CNN said in a statement that Lizza “will not appear on CNN while we look into this matter.” Lizza returned to CNN in January after the network’s internal investigation found “no reason to continue to keep Mr. Lizza off the air.”\n\nIn June, Esquire hired Lizza to be its chief political correspondent.\n\n86. Tom Ashbrook\n\n\"On Point\" host Tom Ashbrook at the Edward M. Kennedy Institute for the United States Senate on February 28, 2016 in Boston, Massachusetts. Paul Marotta—Getty Images\n\nWBUR reported on Dec. 11 that several men and women alleged that the On Point host engaged in “creepy” sex talk, touched employees without their consent and directed tirades at young women in the studio. The allegations emerged in a document compiled by 11 women and men, who delivered it to WBUR and its owner Boston University on Dec. 7. Ashbrook was placed on leave pending an investigation.\n\nIn a text message to WBUR, Ashbrook said that he was “stunned that a few former colleagues have apparently come forward with allegations that have not been shared with me. I have no idea what is being alleged, nor by whom.” He added that he was “proud of the many people who have worked with me during my 16 years at WBUR. I have always tried to be a leader and supportive of them, and many of them have gone on to highly successful careers in radio, journalism and other fields… “In the pressure of a live radio environment, I have at times been a tough and demanding boss. We aspire to put out a top-notch show. Many people have thrived in that environment; a few have not.”\n\n“I can’t describe how deeply upsetting this is to me,” he added. “I am sure that once the facts come out that people will see me for who I am – flawed but caring and decent in all my dealings with others.”\n\n85. Mario Batali\n\nChef Mario Batali attends the Food Bank for New York City Can-Do Awards at Cipriani Wall Street on Wednesday, April 19, 2017, in New York. Brent N. Clarke—Brent N. Clarke/Invision/AP\n\nThe celebrity chef announced on Dec. 11 that he would “step away” from his company following allegations of sexual misconduct. Four women told the website Eater that Batali touched them inappropriately, with the allegations stretching back at least two decades.\n\nIn a statement, Batali said: “I apologize to the people I have mistreated and hurt. Although the identities of most of the individuals mentioned in these stories have not been revealed to me, much of the behavior described does, in fact, match up with ways I have acted. That behavior was wrong and there are no excuses. I take full responsibility and am deeply sorry for any pain, humiliation or discomfort I have caused to my peers, employees, customers, friends and family… We built these restaurants so that our guests could have fun and indulge, but I took that too far in my own behavior. I won’t make that mistake again. I want any place I am associated with to feel comfortable and safe for the people who work or dine there.”\n\n84. Cade Hudson\n\nThe Los Angeles Times reported on Dec. 9 that Hudson, a prominent agent at Creative Artists Agency, offered actor Sean Rose sex in exchange for access to directors and a movie star. Rose said he declined the offers, which left him “embarrassed and humiliated.”\n\nIn a statement from his attorney to the Times, Hudson said: “After being my friend on social media for seven years, and liking my posts, Sean is now accusing me of soliciting a sex act from him. My recollection is that he laughed it off and remained my friend on social media. I have the utmost sympathy for victims of harassment and abuse, but this is no such case.”\n\n83. Jon Heely\n\nJon Heely appears at a Disney fan event between July 14-16 at the Anaheim Convention Center in Anaheim, Calif. Image Group LA—Disney via Getty Images\n\nVariety reported on Dec. 8 that Heely, the director of music publishing at Disney, was charged with three felony counts of child abuse. Heely allegedly began abusing one underage girl at age 11, and that abuse continued until she was 15. He allegedly abused another girl when she was 15. A Disney spokesperson said that Heely was suspended on Dec. 8 after being informed of the charges.\n\nHeely’s attorney denied the charges. “He vehemently denies these allegations and we will be fighting until the end to clear his name,” he said. “It’s a shame, that’s all I’ve got to say.” The attorney did not immediately respond to TIME’s request for comment.\n\n82. Joe Alexander\n\nAdWeek reported on Dec. 7 that Alexander, the former chief creative officer at advertising agency, The Martin Agency, in Richmond, Va. left the company amid several allegations of sexual harassment. The allegations, which date back at least to the 1990s, include inviting a female co-worker to have sex on a business trip, commenting on the size of employees’ breasts and referring to a black female employee as “chocolate thunder.”\n\n“There are instances when we’re unable to provide details in deference to the request of individuals who have come forward to report actions of others that are inconsistent with our values and guidelines,” a spokesperson for The Martin Agency told AdWeek. The agency counts Warner Brothers, Chevrolet, Discover, Dunkin Donuts and Oreo among its clients.\n\nAlexander denied the allegations. “The allegations you are reporting on are false. All of them,” he told AdWeek. “The Martin Agency is my family. Rather than a drawn-out, hurtful investigation, resigning was the proper thing to do to protect my family and all the people I’ve worked so closely together with in my 26 wonderful years. I will always love that place and people who make it so special. Please respect my privacy during this very, very sad time.”\n\nOn Dec. 12, the Martin Agency announced it had appointed Kristen Cavallo as its first female CEO, replacing Matt Williams.\n\n81. U.S. Appeals Court Judge Alex Kozinski\n\nNinth Circuit Appeals Court Judge Alex Kozinski looks on during a House Judiciary Committee hearing on March 16, 2017. Justin Sullivan—Getty Images\n\nAt least six women have accused Kozinski, a longtime judge in the U.S. Court of Appeals for the 9th Circuit, of sexual misconduct. A former clerk alleged that Kozinski showed her pornography and asked if she was sexually aroused, while another said the judge told her she should exercise naked in the courthouse gym. Four women spoke to the Washington Post but asked to remain anonymous, while two went on the record.\n\n“I have been a judge for 35 years and during that time have had over 500 employees in my chambers. I treat all of my employees as family and work very closely with most of them. I would never intentionally do anything to offend anyone and it is regrettable that a handful have been offended by something I may have said or done,” Kozinski said in a statement provided to the Post.\n\nOn Dec. 18, Kozinski announced his retirement amid an investigation into the allegations. “I cannot be an effective judge and simultaneously fight this battle,” he said in the statement. “Nor would such a battle be good for my beloved federal judiciary. And so I am making the decision to retire, effective immediately.”\n\n80. Rep. Trent Franks\n\nRep. Trent Franks (R-AZ) listens during a news conference for the launch of the Congressional HIV/AIDS Caucus on Capitol Hill on September 15, 2011 in Washington, DC. Brendan Hoffman—Getty Images\n\nArizona Republican Rep. Trent Franks, who has served in the House of Representatives since 2003, announced on Dec. 7 he would resign amid an ethics inquiry into allegations of sexual harassment. “I have recently learned that the Ethics Committee is reviewing an inquiry regarding my discussion of surrogacy with two previous female subordinates, making each feel uncomfortable,” Franks said in a statement. “I deeply regret that my discussion of this option and process in the workplace caused distress.”\n\nFranks, whose resignation took effect at the end of January, said that he never “physically intimidated, coerced, or had, or attempted to have, any sexual contact with any member of my congressional staff.”\n\n79. Bryan Singer\n\nProducer Bryan Singer attends the premiere of \"Legion\" at Pacific Design Center on January 26, 2017 in West Hollywood, California. Jason LaVeris—FilmMagic\n\nThe X-Men director faces a lawsuit for allegedly raping then-17-year-old Cesar Sanchez-Guzman in 2003. In the suit, which was filed on Dec. 7, Guzman claims that he met Singer at a party on a yacht and the director offered to give him a tour of the boat. In one of the boat’s rooms, Guzman claims, Singer “forced Cesar to the floor, shoved Cesar’s face against his crotch area and demanded Cesar perform oral sex on him.”\n\nSinger denies Guzman’s allegations. In a statement. his representative said: “Bryan categorically denies these allegations and will vehemently defend this lawsuit to the very end. Cesar Sanchez-Guzman apparently claims that he did not remember this alleged incident from 2003 until now. Significantly, when Sanchez-Guzman filed for bankruptcy only a few years ago, he failed to disclose this alleged claim when he was supposed to identify all of his assets, but conveniently, now that the bankruptcy court discharged all of his debts, he is able to recall the alleged events.”\n\nSinger has faced two other civil suits over allegations of sexual harassment in the past. In 2014, Michael Egan claimed in a lawsuit that Singer forced him to have sex in California and Hawaii in the 1990s, which Singer’s then-attorney called “absurd and defamatory.” Egan later dropped the lawsuit because he couldn’t find a new attorney to represent him, but argued his case still had merit.\n\nThat same year, an anonymous man filed a lawsuit against Singer and director Gary Goddard, which alleged that Singer attempted to force him into sex and fondled him when he was 17. Singer denied that allegation at the time and the court dismissed the lawsuit on the grounds that there was “no legal basis” for the suit.\n\n78. Harold Ford Jr.\n\nHarold Ford Jr. arrives at a gala at Lincoln Center on February 11, 2016 in New York City. Dave Kotinsky—Getty Images\n\nHuffPost reported that Morgan Stanley fired Ford Jr., who served as a Democratic representative from Tennessee in the U.S. House of Representatives from 1997 to 2007, after an investigation into allegations of misconduct. A woman told HuffPost that Ford Jr. forcibly grabbed her on one instance and engaged in harassment and intimidation. She said Ford repeatedly asked her to get drinks until she sent him an email asking him not to contact her again. In a reply, according to HuffPost, Ford agreed and apologized.\n\nFord Jr., who comes from a prominent political family in Tennessee, joined Morgan Stanley in 2011 as a managing director. Morgan Stanley confirmed in a statement to HuffPost: “He has been terminated for conduct inconsistent with our values and in violation of our policies.”\n\nIn a statement, Ford Jr. denied the allegation. “This simply did not happen. I have never forcibly grabbed any woman or man in my life. Having dinner and drinks for work is part of my job, and all of my outreach to the news reporter making these false allegations was professional and at the direction of my firm for business purposes. I support and have tremendous respect for the brave women now speaking out in this important national dialogue. False claims like this undermine the real silence breakers. I will now be brining legal action against the reporter who has made these false claims about me as well as Morgan Stanley for improper termination.”\n\nA spokesperson for Ford Jr. did not immediately respond to TIME’s request for comment.\n\nMorgan Stanley said in a statement later in January: “The press has reported that Mr. Ford was terminated for sexual misconduct. He was not. We have not received any internal allegations of sexual harassment or misconduct involving him either before or after his separation became public.”\n\n77. Lorin Stein\n\nLorin Stein attends 'Louder Than Bombs' New York premiere at Crosby Street Hotel on March 30, 2016 in New York City. Noam Galai—WireImage\n\nThe New York Times reported on Dec. 6 that Stein, the longtime editor of The Paris Review, resigned amid an investigation into his behavior toward female employees. According to the Times, the magazine’s board planned to meet Thursday to discuss the investigation. At least two women made complaints about Stein’s behavior. The magazine’s board decided to investigate Stein after he told them that his name appeared on an anonymously crowdsourced list of allegations of sexual harassment and misconduct in media, according to the Times.\n\nIn his statement to the board, Stein admitted that he had sexual contact in the office and that he dated and expressed interest in female Paris Review colleagues, including interns, according to the Times. But he insisted all encounters were consensual and occurred before he wed in 2015.\n\n“At times in the past, I blurred the personal and the professional in ways that were, I now recognize, disrespectful of my colleagues and our contributors, and that made them feel uncomfortable or demeaned,” Stein wrote, according to the Times. “I am very sorry for any hurt I caused them.”\n\n76. Robert Knepper\n\nActor Robert Knepper attends the \"Prison Break\" screening and conversation at The Paley Center for Media on March 29, 2017. Paul Archuleta—FilmMagic\n\nFive women allege that the former Prison Break star sexually assaulted them between 1983 and 2013. Costume designer Susan Bertram told the Hollywood Reporter that Knepper grabbed her crotch “as hard as he could” on the set of Gas Food Lodging in 1991, which prompted four more women to come forward. The other allegations include kissing a woman without her consent and forcing another to perform oral sex.\n\nIn a statement to the Hollywood Reporter, Knepper denied the allegations. He said: “We have come to a time where hard-earned careers are being lost on the basis of accusations. I need to reiterate that these accusations against me are false. We have lost the presumption of innocence; we have lost ‘due process’; and we have lost the ability to review evidence — allowing the media to become both ‘judge and jury.’ Until I can sit down and have a dialogue with my accusers, managed not by the press but by an impartial mediator, I have nothing further to say on this matter. My wife, family and close friends, know me and my true nature and I am grateful for their love and support.”\n\nA spokesperson for Knepper did not immediately respond to TIME’s request for comment.\n\n75. Dylan Howard\n\nThe Associated Press reported that Dylan Howard, the chief content officer at American Media Inc., which oversees the National Enquirer and US Weekly, allegedly forced female employees to watch porn and openly discussed female employees’ sex lives while he was running the company’s Los Angeles office. Howard allegedly said that he wanted to make a Facebook account for one employee’s vagina.\n\nThe allegations led to an outside investigation in 2012. A lawyer for AMI told AP that the investigation did not show “serious wrongdoing.” According to AP, Howard quit after the investigation, but was rehired a year later in an elevated role.\n\nHoward told AP that the claims were “baseless.” He did not immediately respond to TIME’s request for comment.\n\nThe New Yorker reported in November that Howard shared information with Harvey Weinstein in an attempt to discredit Rose McGowan’s allegation that the producer raped her, a claim which Weinstein denies. Howard told the magazine that America Media Inc. had a television-production agreement with Weinstein at the time and that he “had an obligation to protect AMI’s interests by seeking out—but not publishing—truthful information about people who Mr. Weinstein insisted were making false claims against him.”\n\n74. Danny Masterson\n\nDanny Masterson attends the premiere of \"Big Bear\" at The London Hotel on September 19, 2017 in West Hollywood, California. Paul Archuleta—FilmMagic\n\nNetflix confirmed on Dec. 5 that it’s ending its relationship with The Ranch star Danny Masterson following allegations of rape made in March. “As a result of ongoing discussions, Netflix and the producers have written Danny Masterson out of The Ranch,” a spokesperson for the streaming service said, according to Entertainment Weekly. “Yesterday was his last day on the show, and production will resume in early 2018 without him.”\n\n“I am obviously very disappointed in Netflix’s decision to write my character off of ‘The Ranch.’ From day one, I have denied the outrageous allegations against me. I have never been charged with a crime, let alone convicted of one,” Masterson said in a statement to HuffPost. “In this country, you are presumed innocent until proven guilty. However, in the current climate, it seems as if you are presumed guilty the moment you are accused. I understand and look forward to clearing my name once and for all.”\n\nIn March, People reported that the former That 70s Show star was being investigated by the Los Angeles Police Department after three women accused him of sexual assault in the early 2000s. Masterson denied the allegations at the time, and he has not yet been charged with any crime. His spokesperson did not immediately respond to TIME’s request for comment.\n\n73. James Levine\n\nMusic Director of the Metropolitan Opera James Levine speaks at a Metropolitan Opera's press conference in 2011. Alli Harvey—Getty Images\n\nThe Metropolitan Opera suspended James Levine on Dec. 3 following allegations from three men who said the famed conductor sexually abused them when they were teenagers, the New York Times reported. The accusations date back to 1968. One of the men, Ashok Pai, filed a police report to the Lake Forest Police Department in Illinois in 2016. Peter Gelb, the Met’s general manager, told the Times that Levine denied Pai’s allegations at the time and that the Met decided not to take action to wait for a police determination.\n\nThe Metropolitan Opera said on Dec. 2 that it asked an outside law firm to investigate the allegations against Levine, who served as its music director from 1976 to 2016. A spokesperson for Levine did not comment to the Times. Levine’s manager did not immediately respond to TIME’s request for comment.\n\nIn March, the Metropolitan Opera announced it hard fired Levine after its investigation found he engaged in “sexually abusive and harassing conduct.” Levine sued the Met later that month for breach of contract and defamation, with the suit saying that he had “clearly and unequivocally denied any wrongdoing in connection with those allegations.” The Met countersued in May.\n\n72. John Hockenberry\n\nReporter John Hockenberry speaks at the Tribeca Film Festival on April 24, 2014 in New York City. Astrid Stawiarz—2014 Getty Images\n\nThe public radio icon, known for hosting The Takeaway on WNYC for more than 10 years, has been accused of inappropriate behavior by multiple female colleagues. A report published in New York magazine’s the Cutdetails a number of these accusations, ranging from inappropriate email communication to a nonconsensual kiss in his hotel room.\n\nHockenberry left his job at The Takeaway in August. Months before that, in February, former colleague Suki Kim filed a complaint against him, citing multiple inappropriate email messages. After his departure, Kim spoke to multiple other female employees at the show, many of whom described similar behavior. In a statement provided to New York, Hockenberry said: “I’ve always had a reputation for being tough, and certainly I’ve been rude, aggressive and impolite. Looking back, my behavior was not always appropriate and I’m sorry. It horrifies me that I made the talented and driven people I worked with feel uncomfortable, and that the stress around putting together a great show was made worse by my behavior. Having to deal with my own physical limitations [Hockenberry is paralyzed from the waist down] has given me an understanding of powerlessness, and I should have been more aware of how the power I wielded over others, coupled with inappropriate comments and communications, could be construed. I have no excuses.”\n\n71. Bruce Weber\n\nPhotographer Bruce Weber attends the 2017 Gordon Parks Foundation Awards Gala on June 6, 2017 in New York City. Ilya S. Savenok—Getty Images\n\nIn a lawsuit filed in New York State Supreme Court, model Jason Boyce alleged that renowned fashion photographer Bruce Weber forced him to rub his own genitals during a 2014 photoshoot, the New York Post reports. Weber allegedly also sucked on the model’s fingers. At the time of the described incident, Weber was 68 and Boyce was 28.\n\nWeber did not return the Post’s requests for comment.\n\n70. Rep. Ruben Kihuen\n\nRep. Ruben Kihuen, D-Nev., holds a news conference at the Capitol on Wednesday, Nov. 1, 2017. Bill Clark—CQ-Roll Call,Inc.\n\nBuzzFeed reported that a then-25-year-old campaign staffer quit the Democratic lawmaker’s campaign after he allegedly sexually harassed her. The woman said she began working for him in December 2015, and alleged that he propositioned her for sex and touched her thighs twice without her consent. She told BuzzFeed that she quit in April 2016.\n\nIn a statement to BuzzFeed, Kihuen said: “The staff member in question was a valued member of my team. I sincerely apologize for anything that I may have said or done that made her feel uncomfortable. I take this matter seriously as it is not indicative of who I am. I was raised in a strong family that taught me to treat women with the utmost dignity and respect. I have spent my fifteen years in public service fighting for women’s equality, and I will continue to do so.”\n\nIn December, Kihuen announced he wouldn’t seek re-election.\n\n69. Rep. Blake Farenthold\n\nRepresentative Blake Farenthold (R-TX) speaks at an event on June 23, 2016 in Washington, DC. Larry French—Getty Images\n\nPolitico reported that the Texas Republican settled a sexual harassment lawsuit filed by his former communications director, Lauren Greene, for $84,000 (using taxpayer funds). Greene filed her lawsuit in 2014, alleging gender discrimination, sexual harassment and a hostile work environment. Greene alleges that Farenthold told another aide that he had “sexual fantasies” and “wet dreams” about her.\n\nIn a statement, Farenthold said: “While I 100% support more transparency with respect to claims against members of Congress, I can neither confirm nor deny that settlement involved my office as the Congressional Accountability Act prohibits me from answering that question.”\n\nFarenthold resigned from Congress in April.\n\n68. Shervin Pishevar\n\nCo-Founder and Managing Director of Sherpa Capital Shervin Pishevar speaks onstage during Vanity Fair New Establishment Summit Beverly Hills, Calif. on Oct. 3, 2017. Matt Winkelmeyer—Getty Images\n\nBloomberg reported that five women came forward to accuse the Uber investor of sexual assault or harassment. The women told Bloomberg that Pishevar took advantage of their professional connections by using mentorship, an investment or a potential job to make unwanted advances.\n\nIn a statement to Bloomberg, representatives for Pishevar said, “We are confident that these anecdotes will be shown to be untrue.” He did not immediately respond to TIME’s request for comment.\n\nIn November, Forbes reported that Pishevar was arrested — but never charged — in London in May for alleged rape. A spokesperson told Bloomberg: “In May 2017, Mr. Pishevar was detained briefly in London in connection with an alleged sexual assault, an allegation he categorically denied. He fully cooperated with the police investigation which was exhaustive and detailed. In July he was informed that no further action would be taken against him, and he was ‘de-arrested’ (a British legal term).”\n\n67. Geraldo Rivera\n\nPolitical commentator Geraldo Rivera speaks to members of the media in the lobby of Trump Tower in New York, on Jan. 13, 2017. Albin Lohr-Jones—Pool/ Bloomberg Images\n\nAfter Fox News’ Geraldo Rivera tweeted in support of Matt Lauer by saying harassment claims are “criminalizing courtship,” Bette Midler tweeted a clip of her 1991 interview with Barbara Walters. In the interview, she accused Rivera and an unnamed producer of drugging and groping her in the 1970s. Rivera wrote in his 1991 autobiography that he had a “torrid sexual affair” with Midler.\n\n“Geraldo may have apologized for his tweets supporting Matt Lauer, but he has yet to apologize for this,” Midler tweeted.\n\nIn a series of tweets on Dec. 1, he said he remembered the alleged event “much differently” than Midler, but “that oes not change the fact that she has a right to speak out & demand an apology from me, for in the very least, publically [sic] embarrassing her all those years ago. Bette, I apologize.” He did not immediately respond to responded to TIME’s request for comment.\n\n66. Johnny Iuzzini\n\nPastry Chef Johnny Iuzzini poses for a photo during Expo 2015 at Fiera Milano Rho on May 28, 2015 in Milan, Italy. Pier Marco Tacca—Getty Images\n\nMic reported that four former employees — two pastry chefs and two unpaid externs — alleged that the Top Chef: Just Desserts judge sexually harassed them. The allegations include touching employees’ butts with kitchen utensils and sticking his tongue in a woman’s ear.\n\nIn a statement to Mic, Iuzzini said he was “shattered and heartbroken at the thought that any of my actions left members of my team feeling hurt or degraded.” He added: “Many of the other allegations are inaccurate, others I do not recall and none were meant to hurt people. Nonetheless, I must take responsibility if any of the members of my team felt uncomfortable by my words or actions, regardless of my intent or recollection. I must hear that what the women making the accusations are telling me and recognize I caused pain.”\n\nIuzzini did not immediately respond to TIME’s request for comment.\n\n65. Israel Horovitz\n\nPlaywright Israel Horovitz attends the \"Out Of The Mouths Of Babes\" Off-Broadway Photo Opportunity at MTC Rehearsal Studios on May 12, 2016 in New York City. Monica Schipper—Getty Images\n\nThe New York Times reported on Nov. 30 that nine women came forward to accuse the Park Your Car in Harvard Yard playwright and director of sexual misconduct. The allegations included rape and unwanted contact and kissing, and were made by many women who said they sought out Horovitz as a mentor. Horovitz’s son Adam told the Times that he believes the allegations against his father are true.\n\nIn a statement to the Times, Horovitz said that he has “a different memory of some of these events.” But he added: ” I apologize with all my heart to any woman who has ever felt compromised by my actions, and to my family and friends who have put their trust in me. To hear that I have caused pain is profoundly upsetting, as is the idea that I might have crossed a line with anyone who considered me a mentor.” A representative for Horovitz did not immediately respond to TIME’s request for comment.\n\nIn 1993, ten women made allegations of sexual harassment against Horovitz, which he denied at the time.\n\n64. Garrison Keillor\n\nGarrison Keillor performs at City Winery on October 4, 2017 in New York City. Al Pereira—WireImage/Getty Images\n\nThe former host of “A Prairie Home Companion” told the Associated Press that he was fired from Minnesota Public Radio over allegations of “inappropriate behavior.”\n\nIn an email to the Star Tribune, Keillor said the allegation involved him touching a woman’s back. “I put my hand on a woman’s bare back. I meant to pat her back after she told me about her unhappiness and her shirt was open and my hand went up it about six inches. She recoiled. I apologized. I sent her an email of apology later and she replied that she had forgiven me and not to think about it. We were friends. We continued to be friendly right up until her lawyer called,” he said. Keillor originally told the Associated Press that his termination involved “a story that I think is more interesting and more complicated than the version MPR heard.” Keillor did not immediately respond to TIME’s request for comment.\n\nMinnesota Public Radio confirmed his termination in a statement and said it hired an outside law firm to investigate. “Based on what we currently know, there are no similar allegations involving other staff,” the statement said. A spokesperson for Minnesota Public Radio declined to comment beyond its statement. On Nov. 28, the Washington Post published an op-ed by Keillor, in which he argued that Sen. Al Franken shouldn’t resign following several allegations of groping.\n\n63. Matt Lauer\n\nMatt Lauer on set of the Today Show on Nov.16, 2017. Zach Pagano—NBC/NBCU/Getty Images\n\nNBC announced on Nov. 29 that it had fired Lauer, who has co-anchored the Today show since 1997, after it received a detailed complaint about “inappropriate sexual behavior in the workplace.” In a memo send to NBC employees, NBC News Chairman Andrew Lack said: “While it is the first complaint about his behavior in the over 20 years he’s been at NBC News, we were also presented with reason to believe this may not have been an isolated incident.” NBC did not disclose specifics about the allegations.\n\nLauer said in a statement on Nov. 30: “There are no words to express my sorrow and regret for the pain I have caused others by words and actions. To the people I have hurt, I am truly sorry. As I am writing this, I realize the depth of the damage and disappointment I have left behind at home and at NBC. Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed. I regret that my shame is now shared by the people I cherish dearly. Repairing the damage will take a lot of time and soul searching and I’m committed to beginning that effort. It is now my full time job. The last two days have forced me to take a very hard look at my own troubling flaws. It’s been humbling. I am blessed to be surrounded by people I love. I thank them for their patience and grace.”\n\n62. Andy Rubin\n\nFounder and CEO of Essential Products Andy Rubin speaks onstage at a conference in New York City, on June 7, 2017. Brian Ach—Getty Images for Wired\n\nThe Verge reported that Rubin, the founder and CEO of phone startup Essential, took a leave of absence from his company. The announcement follows a report from the Information that alleged Rubin, who created Android, left Google in 2014 after an investigation into an “inappropriate relationship” with a subordinate. The Information reported that the woman filed a complaint with Google’s Human Resources department, which investigated and reportedly found that his behavior was “improper and showed bad judgment.”\n\nRubin’s spokesperson said in a statement to the Information: “Any relationship that Mr. Rubin had while at Google was consensual… Mr. Rubin was never told by Google that he engaged in any misconduct while at Google and he did not, either while at Google or since.” The spokesperson did not immediately respond to TIME’s request for comment.\n\n61. David Sweeney\n\nNPR announced on Nov. 28 that Sweeney, the company’s chief news editor, left the company after at least three women — all current and former NPR journalists — accused him of sexual harassment. “This is a difficult time for our newsroom and I’m committed to supporting all of you as we move forward. I know you appreciate that there are some questions I cannot answer in keeping with our practice to not comment on personnel issues, but I will do my best to address those I can,” NPR’s acting senior vice president of news Chris Turpin said in a statement.\n\nSweeney has not commented publicly. He declined to comment to TIME.\n\n60. Nick Carter\n\nEric McCandless—ABC via Getty Images\n\nThe former member of the Backstreet Boys has been accused of rape by pop singer Melissa Schuman. Schuman, a member of the girl group “Dream,” detailed the encounter in a blog post published earlier this month. She said Carter forcefully took her virginity in 2002, when she was 18 and he was 22, according to The Daily Beast.\n\nRepresentatives for Carter did not immediately return a request for comment from TIME on Wednesday. In a statement to PEOPLE, Carter said: “I am shocked and saddened by Ms. Schuman’s accusations. Melissa never expressed to me while we were together or at any time since that anything we did was not consensual.”\n\n59. John Lasseter\n\nJohn Lasseter attends the premiere of \"Coco\" at El Capitan Theatre on Nov., 2017 in Los Angeles. Jason LaVeris—FilmMagic/Getty Images\n\nThe head of Pixar and Walt Disney Animations Studio is taking a leave of absence following “difficult,” “painful” conversations and “missteps,” he wrote in a letter to staff, according to The Hollywood Reporter. The Toy Story and Toy Story 2 director was reportedly accused of making unwanted advances and remarks on appearances towards colleagues and collaborators.\n\nIn his memo, Lasseter apologized for any actions, saying, “I’ve been giving a lot of thought to the leader I am today compared to the mentor, advocate and champion I want to be. It’s been brought to my attention that I have made some of you feel disrespected or uncomfortable. That was never my intent.”A spokesperson from Disney emailed the following statement to TIME: “We are committed to maintaining an environment in which all employees are respected and empowered to do their best work. We appreciate John’s candor and sincere apology and fully support his sabbatical.”\n\n58. John Conyers\n\nRep. John Conyers, D-Mich., speaks during a Congressional Progressive Caucus news conference in the Capitol Visitor Center to introduce the Deal for All resolution. Tom Williams—CQ-Roll Call/Getty Images\n\nThe top Democrat on the House Judiciary Committee has been accused of making sexual advances toward female members of his staff, according to BuzzFeed News. Affidavits from former staffers published by the news site allege that the longest-serving member in t", "images": ["https://api.time.com/wp-content/uploads/2018/07/les-moonves1.jpg", "https://api.time.com/wp-content/uploads/2017/11/eric-weinberger.jpg", "https://api.time.com/wp-content/uploads/2017/11/gerard-depardieu.jpg", "https://api.time.com/wp-content/uploads/2017/10/roy-price.jpg", "https://api.time.com/wp-content/uploads/2020/04/one-world-together-at-home-lady-gaga-coronavirus.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/10/oliver-stone.jpg", "https://api.time.com/wp-content/uploads/2017/11/sherman-alexie.jpg", "https://api.time.com/wp-content/uploads/2017/11/johnny-iuzzini.jpg", "https://api.time.com/wp-content/uploads/2017/10/ben-affleck-harvey-weinstein.jpg", "https://api.time.com/wp-content/uploads/2017/11/charles-dutoit.jpg", "https://api.time.com/wp-content/uploads/2017/11/james-levine-met-opera1.jpg", "https://api.time.com/wp-content/uploads/2017/11/geraldo-rivera-matt-lauer-fired.jpg", "https://api.time.com/wp-content/uploads/2017/11/david-copperfield.jpg", "https://api.time.com/wp-content/uploads/2017/12/dan-johnson-sexual-assault.jpg", "https://api.time.com/wp-content/uploads/2017/11/ron-jeremy.jpg", "https://api.time.com/wp-content/uploads/2017/11/jameis-winston.jpg", "https://api.time.com/wp-content/uploads/2017/11/marshall-faulk.jpg", "https://api.time.com/wp-content/uploads/2017/11/ronaldo.jpg", "https://api.time.com/wp-content/uploads/2017/11/jerry-richardson.jpg", "https://api.time.com/wp-content/uploads/2017/11/tom-ashbrook.jpg", "https://api.time.com/wp-content/uploads/2017/11/jon-heely.jpg", "https://api.time.com/wp-content/uploads/2017/11/tom-sizemore.jpg", "https://api.time.com/wp-content/uploads/2017/11/israel-horovitz.jpg", "https://api.time.com/wp-content/uploads/2016/06/corey-lewandowski-trump-depart.jpg", "https://api.time.com/wp-content/uploads/2017/11/russell-simmons-sexual-misconduct.jpg", "https://api.time.com/wp-content/uploads/2017/11/john-hockenberry.jpeg", "https://api.time.com/wp-content/uploads/2018/01/gettyimages-902463232.jpg", "https://api.time.com/wp-content/uploads/2017/10/george-h-w-bush.jpg", "https://api.time.com/wp-content/uploads/2017/10/rkelly-allegations.jpg", "https://api.time.com/wp-content/uploads/2017/11/lorin-stein-email.jpg", "https://api.time.com/wp-content/uploads/2018/04/tom-brokaw-allegations.jpg", "https://api.time.com/wp-content/uploads/2017/10/leon-allegations.jpg", "https://api.time.com/wp-content/uploads/2017/11/louis-c-k-roy-moore-matthew-weiner.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2017/11/gettyimages-542433482.jpg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2017/11/bryan-singer.jpg", "https://api.time.com/wp-content/uploads/2017/10/terry-richardson-allegations1.jpg", "https://api.time.com/wp-content/uploads/2017/11/sylvester-stallone.jpg", "https://api.time.com/wp-content/uploads/2017/09/gettyimages-644863218.jpg", "https://api.time.com/wp-content/uploads/2017/11/dallas-clayton.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/11/alex-kozinski.jpeg", "https://api.time.com/wp-content/uploads/2017/11/chris-matthews.jpg", "https://api.time.com/wp-content/uploads/2017/11/harold-ford-jr.jpg", "https://api.time.com/wp-content/uploads/2017/11/ike-taylor.jpg", "https://api.time.com/wp-content/uploads/2017/10/rick-najera.jpg", "https://api.time.com/wp-content/uploads/2017/11/tavis-smiley.jpg", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/11/jeff-fager.jpg", "https://api.time.com/wp-content/uploads/2017/11/john-lasseter-disney-pixar.jpg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/11/george-takei.jpg", "https://api.time.com/wp-content/uploads/2014/12/ryan-seacrest.jpg", "https://api.time.com/wp-content/uploads/2017/10/robert-scoble.jpg", "https://api.time.com/wp-content/uploads/2017/11/andrew-kreisberg.jpg", "https://api.time.com/wp-content/uploads/2017/11/bruce-weber.jpeg", "https://api.time.com/wp-content/uploads/2017/11/richard-dreyfuss.jpg", "https://api.time.com/wp-content/uploads/2017/10/stephen-collins.jpg", "https://api.time.com/wp-content/uploads/2017/11/gettyimages-867271068.jpg", "https://api.time.com/wp-content/uploads/2017/11/andy-dick.jpg", "https://api.time.com/wp-content/uploads/2017/09/gettyimages-853873576.jpg", "https://api.time.com/wp-content/uploads/2017/10/jeremy-piven.jpg", "https://api.time.com/wp-content/uploads/2017/10/david-blaine.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "https://api.time.com/wp-content/uploads/2017/11/garrison-keillor-fired.jpg", "https://api.time.com/wp-content/uploads/2017/10/hamilton-fish.jpg", "https://api.time.com/wp-content/uploads/2017/10/michael-oreskes.jpg", "https://api.time.com/wp-content/uploads/2017/11/tj-miller.jpg", "https://api.time.com/wp-content/uploads/2017/11/nick-carter.jpg", "https://api.time.com/wp-content/uploads/2017/11/steve-jurvetson.jpg", "https://api.time.com/wp-content/uploads/2017/11/jann-wenner.jpg", "https://api.time.com/wp-content/uploads/2017/11/andy-rubin.jpg", "https://api.time.com/wp-content/uploads/2017/11/ken-friedman.jpg", "https://api.time.com/wp-content/uploads/2017/11/michael-ferro.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2018/05/morgan-freeman.jpeg", "https://api.time.com/wp-content/uploads/2017/10/gettyimages-856503114.jpg", "https://api.time.com/wp-content/uploads/2017/11/morgan-spurlock.jpg", "https://api.time.com/wp-content/uploads/2017/11/ed-westwick-sex-assault.jpg", "https://api.time.com/wp-content/uploads/2018/08/gettyimages-960114280.jpg", "https://api.time.com/wp-content/uploads/2017/11/robert-knepper1.jpg", "https://api.time.com/wp-content/uploads/2017/11/chuck-close.jpg", "https://api.time.com/wp-content/uploads/2017/11/al-franken.jpg", "https://api.time.com/wp-content/uploads/2017/11/ryan-lizza.jpg", "https://api.time.com/wp-content/uploads/2018/01/scott-baio-sexual-misconduct.jpg", "https://api.time.com/wp-content/uploads/2017/11/gene-simmons.jpg", "https://api.time.com/wp-content/uploads/2017/11/eric-davis.jpg", "https://api.time.com/wp-content/uploads/2017/11/donovan-mcnabb.jpg", "https://api.time.com/wp-content/uploads/2017/11/mark-schwahn.jpg", "https://api.time.com/wp-content/uploads/2017/11/matthew-weiner.jpg", "https://api.time.com/wp-content/uploads/2017/11/dan-schoen.jpg", "https://api.time.com/wp-content/uploads/2017/11/andre-balazs.jpg", "https://api.time.com/wp-content/uploads/2016/09/jeffrey-tambor.jpg", "https://api.time.com/wp-content/uploads/2020/04/Sergio_00_45_10_00C1.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/11/danny-masterson1.jpg", "https://api.time.com/wp-content/uploads/2017/10/ken-baker-sexual-harassment.jpg", "https://api.time.com/wp-content/uploads/2017/11/heath-evans.jpg", "https://api.time.com/wp-content/uploads/2017/11/ryan-adams-allegations.jpg", "https://api.time.com/wp-content/uploads/2017/11/charlie-rose-john-oliver-sexual-misconduct.jpg", "https://api.time.com/wp-content/uploads/2017/10/knight-sexual-harassment-allegations.jpg", "http://time.com/img/loading-circle.gif", "https://api.time.com/wp-content/uploads/2017/11/adam-venit.jpg", "https://api.time.com/wp-content/uploads/2017/11/shervin-pishevar.jpg", "https://api.time.com/wp-content/uploads/2017/11/glenn-thrush-nyt.jpg", "https://api.time.com/wp-content/uploads/2017/10/ethan-kath.jpg", "https://api.time.com/wp-content/uploads/2017/11/matt-lauer.jpg", "https://api.time.com/wp-content/uploads/2017/11/roman-polanski.jpg", "https://api.time.com/wp-content/uploads/2017/11/mike-germano.jpg", "https://api.time.com/wp-content/uploads/2017/10/john-besh-sexual-harassment.jpg", "https://api.time.com/wp-content/uploads/2017/11/steve-wynn.jpg", "https://api.time.com/wp-content/uploads/2017/11/philip-berk.jpg", "https://api.time.com/wp-content/uploads/2017/11/brett-kavanaugh.jpg", "https://api.time.com/wp-content/uploads/2017/03/gettyimages-655455702.jpg", "https://api.time.com/wp-content/uploads/2017/11/junot-diaz.jpg", "https://api.time.com/wp-content/uploads/2017/11/trent-franks.jpg", "https://api.time.com/wp-content/uploads/2017/11/louis-ck-harassment.jpg", "https://api.time.com/wp-content/uploads/2017/11/richard-meier-e1529594437541.jpg", "https://api.time.com/wp-content/uploads/2018/01/andrew-creighton-vice.jpg", "https://api.time.com/wp-content/uploads/2018/02/guess-paul-marciano.jpg", "https://api.time.com/wp-content/uploads/2017/11/ruben-kihuen.jpg", "https://api.time.com/wp-content/uploads/2017/10/bob-weinstein-allegations.jpg", "https://api.time.com/wp-content/uploads/2017/10/dustin-hoffman.jpg", "https://api.time.com/wp-content/uploads/2017/11/andrew-duncan.jpg", "https://api.time.com/wp-content/uploads/2017/11/john-conyers-sexual-advances-settlement.jpg", "https://api.time.com/wp-content/uploads/2017/11/chris-hardwick.jpg", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "https://api.time.com/wp-content/uploads/2017/11/peter-martins.jpg", "https://api.time.com/wp-content/uploads/2017/10/gettyimages-678145752.jpg", "https://api.time.com/wp-content/uploads/2017/12/171211-mario-battali-finances-b.jpg", "https://api.time.com/wp-content/uploads/2017/11/conor-mcgregor-sexual-assault-allegations.jpg", "https://api.time.com/wp-content/uploads/2017/11/mario-testino.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/louis-c-k-roy-moore-matthew-weiner.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Samantha Cooney"], "canonical_link": "https://time.com/5015204/harvey-weinstein-scandal/", "title": "Here Are All the Public Figures Who’ve Been Accused of Sexual Misconduct After Harvey Weinstein", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "harvey weinstein rose mcgowan, the weinstein company, kevin spacey ed westwick, ed westwick rape, ben affleck, bob weinstein", "news_keywords": "harvey weinstein, harvey weinstein news, harvey weinstein new yorker, harvey weinstein ronan farrow story, harvey weinstein accusers, harvey weinstein scandal, harvey weinstein allegations, new york times harvey weinstein", "description": "These are all the men in Hollywood, politics, business and more accused of sexual assault and harassment since the Harvey Weinstein scandal.", "og": {"title": "Here Are All the Public Figures Who’ve Been Accused of Sexual Misconduct After Harvey Weinstein", "type": "article", "site_name": "Time", "url": "https://time.com/5015204/harvey-weinstein-scandal/", "description": "We will continue to update this list", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/11/louis-c-k-roy-moore-matthew-weiner.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5015204/harvey-weinstein-scandal/", "description": "These are all the men in Hollywood, politics, business and more accused of sexual assault and harassment since the Harvey Weinstein scandal.", "media": "https://api.time.com/wp-content/uploads/2017/11/louis-c-k-roy-moore-matthew-weiner.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5015204/harvey-weinstein-scandal/", "title": "Here Are All the Public Figures Who’ve Been Accused of Sexual Misconduct After Harvey Weinstein", "description": "We will continue to update this list", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/11/louis-c-k-roy-moore-matthew-weiner.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}