{"url": "https://web.archive.org/web/20081204120104/http://www.haysresearch.com/oc072508.htm", "text": "Alaska Statewide 'Opinion Counts' Survey Results Survey conducted 7/24/08 - 7/25/08 Remember to click here and add your email address to our new mailing list and receive survey results in your mailbox every month. We will not share your email address with anyone. Survey Methodology This survey was fielded July 24 -25, 2008 as part of the Hays Research Group Statewide Opinion Counts Survey. 404 completed respondents were interviewed The margin of error for the data collected is +/- 4.86 % for a 404 response survey for the data analyzed in its entirety with a 95% confidence level; meaning that we can be 95% sure that if every resident of the State with working telephone numbers who have at least one member who has voted in at least two of the last four local or state elections was actually surveyed, the results would vary by no more than 4.86% in either direction. The survey sample used was a computer generated random list derived from a database of all households within the State of Alaska with working telephone numbers who have at least one member who has voted in at least two of the last four local or state elections. The sample frame was designed to accurately reflect the actual population percentages. Respondents were screened to confirm they were over 18 and each household was attempted at least four times over a period of several days to account for non-response bias. Data was analyzed utilizing SPSS Quancept Software. Interviews were conducted by trained staff with on-site supervision utilizing state of the art computer assisted telephone interviewing (CATI). Random interviews were monitored to assure quality control measures were followed. Dialing results were analyzed daily to assure statistically accurate distribution of call disposition in order to account for “non-response” variables. Question 1 This question was paid for by Hays Research Group, and not conducted on behalf of any other individual or group. Answered by 404 out of 404 Do you have a very favorable, somewhat favorable, somewhat unfavorable, or very unfavorable impression of Sarah Palin? Very favorable 179/404 44.3% Somewhat favorable 144/404 35.6% Total somewhat + very favorable 323/404 80.0% Somewhat unfavorable 44/404 10.9% Very unfavorable 21/404 5.2% Total somewhat + very unfavorable 65/404 16.1% No Opinion 12/404 3.0% Never heard of 4/404 1.0% Question 2 This question was paid for by Hays Research Group, and not conducted on behalf of any other individual or group. Answered by 404 out of 404 Do you have a very favorable, somewhat favorable, somewhat unfavorable, or very unfavorable impression of Don Young? Very favorable 52/404 12.9% Somewhat favorable 114/404 28.2% Total somewhat + very favorable 166/404 41.0% Somewhat unfavorable 79/404 19.6% Very unfavorable 145/404 35.9% Total somewhat + very unfavorable 224/404 55.4% No Opinion 10/404 2.5% Never heard of 4/404 1.0% Question 3 This question was paid for by Hays Research Group, and not conducted on behalf of any other individual or group. Answered by 404 out of 404 And what about the election for US Congress, if the election were held today and the candidates were [ROTATE] _Ethan Berkowitz or _Sean Parnell, for whom would you vote? Ethan Berkowitz 133/404 32.9% Sean Parnell 120/404 29.7% Don't Know / Refused 151/404 37.4% Question 4 This question was paid for by Hays Research Group, and not conducted on behalf of any other individual or group. Answered by 175 out of 404 * (note: this question was only asked to respondents who identified themselves as Republicans) If primary election for US Congress were held today and the candidates were [ROTATE] _Don Young or _Sean Parnell, for whom would you vote? Don Young 74/175 42.3% Sean Parnell 80/175 45.7% Don't Know / Refused 21/175 12.0% * Only respondents who identified themselves as Republicans in this survey were asked Question 4, therefore the sample size for this particular question is smaller at n=175 resulting in a margin of error of +/- 7.4%. To view the results of other past surveys click here If you would like to have a question included in the next 'Opinion Counts' survey, or to get more information on our Hays Research Group's public opinion research services, please don't hesitate to contact us. Two different programs will be offered in 2008: an Anchorage Municipal program conducted in the months leading up to the Anchorage Municipal Election, and a Statewide program which will be conducted monthly year-round. This is a unique opportunity to include your own questions in each of the polls for a minimal cost by utilizing Hays Research Group's new Opinion Counts program. Space is limited, so reserve your questions soon! We invite you to explore this website and learn more about Opinion Counts, or contact Hays Research group for more information.\n\n\"Information is key to strategic planning. The Hays Research Group's research helped guide our decision making process with fast, reliable and accurate data.\"\n\n- Kirk Duncan, Vice President, Waste Management Inc.", "images": ["https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button606.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button2A7.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/imgF2.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/callers.JPG", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button604.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/buttonE23.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button605.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/hrg400.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/imgC2.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button596.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button2D8.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/img63.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button279.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button595.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/buttonB42.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/button597.jpg", "https://web.archive.org/web/20081204120104im_/http://www.haysresearch.com/img64.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Survey Results from Hays Research Group", "meta_data": {"keywords": "Jake Metcalfe Don Young 2008 election poll survey statewide alaska hays research group opinion counts methodology congressional election", "description": "Hays Research Group Results of a statewide poll 3/12/08 Don Young and Jake Metcalfe head to head.  Alaska Congress."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}