{"url": "https://web.archive.org/web/20091016143946/http://www.msnbc.msn.com:80/id/33253216/ns/meet_the_press/page/3/", "text": "Oct. 11: The debate over the best way forward intensifies in Washington. Two key voices on the Hill and two experienced military leaders weigh in on the direction a new war strategy should take: Sen. Carl Levin (D-MI); Sen. Lindsey Graham (R-SC); Gen. Barry McCaffrey (Ret.); and Gen. Richard Myers (Ret.). Plus a roundtable: Ron Brownstein, Paul Gigot, Katty Kay, Bob Woodward.\n\nGREGORY: Realistically, from both of you generals, what is victory in Afghanistan?\n\nGEN. MYERS: Some sort--in my view, it's some sort of stable government. And back to Senator Levin's point...\n\nGREGORY: So we can't leave. We can't pull troops out of Afghanistan until there's a stable government?\n\nGEN. MYERS: I think it has to be a viable, stable government that the people believe in. And if you're going to have Afghan security forces that are effective, they have to be connected to the central government and feel that there's some connection and some direction coming from their central government. Otherwise it doesn't work; they're just in the field doing what they do but there's no connection to the overall mission of that country. So I think clearly that's, that's part of it. And I think there has to be some economic development to give people there hope that there's something beyond...\n\nGREGORY: Yeah.\n\nGEN. MYERS: ...what they're doing today.\n\nGREGORY: Can we beat the Taliban?\n\nGEN. McCAFFREY: Well, I, I think in 10 years of $5 billion a month and with a significant front-end security component, we can leave a Afghan national army and police force and a viable government and roads and universities. But it's a time constraint that we can't change things in 18 to 24 months. So I think we got to lower expectations. Senator Levin talked about our political resolve; is it there or not? You know, sort of a simplistic lesson I learned as an infantry company commander in combat, you only got three choices. When you're under fire you can hunker down and take casualties--it's bad--you can break contact and withdraw or you can reinforce and attack. That's really the, the challenge facing the Obama administration right now. And the, the politics of it are really tough. The American people do not appear to support large-scale continued intervention in this conflict.\n\nGREGORY: Just with, with very little time left, I want to get to two other issues. The president spoke last night at the Human Rights Campaign dinner and spoke about \"Don't Ask, Don't Tell.\"\n\n(Videotape)\n\nPRES. OBAMA: I'm working with the Pentagon, its leadership and the members of the House and Senate on ending this policy. Legislation has been introduced in the House to make this happen. I will end \"Don't Ask, Don't Tell.\" That's my commitment to you.\n\n(End videotape)\n\nGREGORY: That, of course, the position of the military to expel gays and lesbians from service.\n\nSenator Levin, will the president live up to this pledge? Can he?\n\nSEN. LEVIN: I think he, he will and he can. I think it has to be done in the, in the right way, which is to get a buy-in from the military, which I think is now possible. Other militaries in the West, the British and other Western armies, have ended this discriminatory policy. We can do it successfully. But it ought to be done with thoughtfulness and with care, and with a buy-in from the military.\n\nGREGORY: General Myers, is it time?\n\nGEN. MYERS: I can't talk about whether it's time or not. I think the process that Senator Levin outlined is exactly right, that the senior military leadership needs to be part of this.\n\nGREGORY: Mm-hmm.\n\nGEN. MYERS: The Pentagon needs to be part of it.\n\nGREGORY: Do you have an opinion about whether it's time?\n\nGEN. MYERS: Well, I, I take some exception to what Senator Levin said, because gays can serve in the military, just can't serve openly. And they, they do and there's lot of them. And we are, and we are, and we're the beneficiary of all that.\n\nGREGORY: OK.\n\nGEN. MYERS: So I'll leave it to the current folks to, to decide whether it's time or not.\n\nGEN. McCAFFREY: Well, there's no question it's time to change the policy. The key to it isn't buy-in from the military, it's for Congress to change the law. They ought to do so. And we would--I'm confident the military will move ahead on it.\n\nSEN. LEVIN: And we, I think, will do that, but we'll need the support at least of some of the military to do it.\n\nGEN. MYERS: I think that's right. You can't...\n\nGREGORY: Does the, does the president have the political resolve to make good on his promise?\n\nSEN. LEVIN: Oh, he does, and I think many of us do.\n\nGREGORY: Yeah.\n\nSEN. LEVIN: I thought it was a mistake to begin with.\n\nGREGORY: Right. Congress has the resolve as well to change it?\n\nSEN. LEVIN: I think we will gain that resolve. The way we've made other changes in this country, the military are the ones that ended a discriminatory policy against African-Americans. They can end it here and it will be great progress.\n\nGREGORY: And finally, Senator Graham, on that question, do you think the military should end the policy?\n\nSEN. GRAHAM: Well, it's my belief that if the policy--you don't have buy-in by the military, that's a disservice to the people in the military. They should be included in this. I'm open-minded to what the military may suggest. But I can tell you, I'm not going to make policy based on a campaign rally.\n\nAnd when it comes to time, the one thing I would say again about Afghanistan, history will judge not when we left but by what we left behind. And our national security interests will be determined by what we left behind and not when we left. And if this policy about \"Don't Ask, Don't Tell\" changes, it should be done based not on politics, but on reason.\n\nGREGORY: And, and, finally, Senator Graham, do you think the president deserved the Nobel Peace Prize?\n\nSEN. GRAHAM: If he can successfully turn around Afghanistan, deter Iran from getting a nuclear weapon, I will build a bookcase for him to put it in. It depends on what he does.\n\nGREGORY: Senator Levin?\n\nSEN. LEVIN: I think it was a, a positive statement about hope for America, as well as a recognition of the new direction that he's setting for us.\n\nGREGORY: All right, we are going to leave it there. This debate will continue. Thanks to all of you.\n\nAnd coming next, Afghanistan, health care and jobs; the politics behind it all. Insights and analysis from our roundtable. Plus, our MEET THE PRESS Minute highlighting some eerie similarities between Afghanistan and Vietnam, only on MEET THE PRESS.\n\n(Announcements)\n\nGREGORY: Our roundtable weighs in--Afghanistan, health care and the economy--after this brief commercial break.\n\n(Announcements)\n\nGREGORY: We are back and joined now by BBC America's Katty Kay, The Washington Post's Bob Woodward, National Journal's Ron Brownstein and Paul Gigot of The Wall Street Journal.\n\nWelcome to all of you. So much to get to this week; war and peace, as I said at the outset. But let's talk about the politics of war, and I think it's striking. Here we are in October of 2009, and it was October of 2001 when President Bush made the decision to go to war. In October of 2009, another president has to make another big decision about troops in Afghanistan, and look how the politics have changed. This was a USA Today/Gallup poll about views of sending more troops, and what you see here is a huge political divide: Democrats, 36 percent for it; Republicans, 73 percent for it. Opponents on the Democratic side, 59 percent to 23 percent.\n\nBob Woodward, what's different? What are the politics here for this president?\n\nMR. BOB WOODWARD: Well, I, I think what's interesting, instead of trying to figure out the future, what's going on in the White House now? It's extraordinary series of very long meetings. One of the big criticisms of Lyndon Johnson during Vietnam was he wouldn't listen, and Obama is listening. He's on a listening tour, and everyone is getting their say. And he's got to, he's got to make a giant decision not about troop numbers, but what's the strategy? And I think, you know, this is, this is the test for him. Can he come up with some consensus so the military doesn't feel wounded, so his own party doesn't feel wounded? And if he does that, you know, a lot of people, even if they don't agree with the final decision, will say he did something--again, George W. Bush, in deciding to go into Iraq, the model there was he decided...\n\nGREGORY: Right.\n\nMR. WOODWARD: ...\"We're going to do it.\" All the meetings were about how to do it, never considering other options.\n\nGREGORY: But, but there, there is a real debate about this policy that has broken into the public, and you broke this story with McChrystal's assessment. The vice president is on the cover of Newsweek magazine with his perspective as a, as a counselor to the president on important matters, including this question of Afghanistan. This is played out--we spent a lot of time talking about this in the Bush administration over Iraq. This has really played out publicly.\n\nMR. WOODWARD: But, but--and I think to everyone's benefit, including the president's, including the military and certainly the, the public. Look, if we had had the secret report on WMD in Iraq before the war and published that, history might have been different. It's very important to know, if you can, what these classified memos say. And in the, in this case we have it, and people are talking about something very concrete.\n\nGREGORY: Paul Gigot, the, the question is the president had a strategy. He announced it in March.\n\nMR. PAUL GIGOT: I thought--yeah.\n\nGREGORY: It was clear. This is what Charles Krauthammer wrote on Friday in his column: \"So what does [the] commander-in-chief do now with the war he once declared had to be won but had been almost criminally underresourced by Bush? Perhaps provide the resources to win it? You would think so. ... Obama agonizes publicly and the world watches. Why?\"", "images": ["https://web.archive.org/web/20091016143946im_/http://msnbcmedia.msn.com/i/msnbc/Components/CSS/img/spacer.gif", "https://web.archive.org/web/20091016143946im_/http://msnbcom.112.2o7.net/b/ss/msnbcom/1/H.15.1--NS/0", "https://web.archive.org/web/20091016143946im_/http://msnbcmedia2.msn.com/j/MSNBC/Components/Video/__NEW/mtp_netcast_091011.thumb.jpg", "https://web.archive.org/web/20091016143946im_/http://www.msnbc.msn.com/images/buttons/next/buttonNext.gif", "https://web.archive.org/web/20091016143946im_/http://msnbcmedia.msn.com/i/msnbc/Components/Art/exclamation.jpg", "https://web.archive.org/web/20091016143946im_/http://msnbcmedia.msn.com/i/msnbc/Components/ArtAndPhoto-Fronts/SITEWIDE/apple-touch-icon.png", "https://web.archive.org/web/20091016143946im_/http://c.msn.com/c.gif?NC=1255&NA=1154&PS=70038&PI=7329&DI=305&TP=http%3a%2f%2fmsnbc.msn.com%2fid%2f33253216%2f", "https://web.archive.org/web/20091016143946im_/http://col.stb.s-msn.com/i/96/5146F629B72E6A89B01B5FF61E30B8.gif"], "top_img": "https://web.archive.org/web/20091016143946im_/http://msnbcmedia.msn.com/i/msnbc/Components/ArtAndPhoto-Fronts/SITEWIDE/apple-touch-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Oct. 11: Levin, Graham, McCaffrey, Myers, roundtable", "meta_data": {"description": "Transcript of the October 11, 2009 broadcast of NBC's \"Meet the Press,\" featuring Carl Levin, Lindsey Graham, Barry McCaffrey, Richard Myers, Ron Brownstein, Paul Gigot, Katty Kay and Bob Woodward.", "Search.Document": "story", "Search.Title": "'Meet the Press' transcript for October 11, 2009", "Search.Updated": "Sun, 11 Oct 2009 16:26:31 GMT", "Search.Expires": "Fri, 31 Dec 9999 23:59:59 GMT", "GOOGLEBOT": "unavailable_after: 31-Dec-9999 23:59:59 GMT", "Search.Section": "Meet the Press"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}