{"url": "https://www.hollywoodreporter.com/live-feed/orange-is-new-black-season-6-finale-explained-interview-1130502", "text": "[This story contains major spoilers from the entire sixth season, including the finale, of Netflix's Orange Is the New Black.]\n\nOrange Is the New Black had a lot to say about freedom, time and the current climate with its supersized finale — aptly titled \"Be Free.\"\n\nJenji Kohan's prison dramedy ended its sixth season (which bowed Friday on Netflix) with a game-changing twist for the show's most dedicated viewers: leading inmate Piper Chapman (played by Taylor Schilling) was let out of prison on early release. Despite having five months left on her prison sentence, Piper was pushed to the top of Litchfield's inmate release pile and she gained her freedom back in the final moments of the 84-minute finale.\n\nHer season-six ending stood in stark contrast to the devastating sentences handed down to two non-white, less privileged inmates: Taystee Jefferson (Danielle Brooks) was convicted for the murder of corrections officer Desi Piscatella (Brad William Henke) — one she didn't commit — and will now be serving a life sentence; and Blanca Flores (Laura Gomez) is being transferred to an immigration detention center after mistakenly believing that she, too, was getting out on early release.\n\nExecutive producer Tara Herrmann tells The Hollywood Reporter that Piper's release has long been on the writers' minds, since Orange Is the New Black is based on the story and memoir of the same name by Piper Kerman, who served 13 months of her 15-month sentence in a minimum security prison.\n\n\"Of course the thought of releasing Piper has come up in previous seasons because the real Piper's sentence was 15 months and we want to make sure that we can fully tell the story of what it’s like for Piper on the outside,\" Herrmann tells THR of what's to come. Orange has long been renewed for a seventh season, and will begin production later this summer. \"We just want to make sure we didn’t do it too soon in her complete arc as a series, but it seemed like the time was right. It felt like we had sort of seen her full time in accordance to what the real story was for the real Piper.\"\n\nIndeed, the real Piper wrote a memoir, inspired a TV show and now serves as an advocate for prison reform; she is also a show consultant on Orange. Herrmann says the prison dramedy plans to follow its Piper on the outside just as much as it did on the inside, and that season seven will track Piper's post-prison journey. \"She's the grounding force of the show,\" Herrmann adds of Schilling's Piper staying put.\n\nDespite the early release surprise, Piper exhibited mixed feelings about her freedom. Not only does the idea of assimilation on the outside loom, but she's leaving her new wife Alex Vause (Laura Prepon) behind. To celebrate her release, Alex threw Piper a surprise prison wedding, officiated by fellow inmate Nicky Nichols (Natasha Lyonne). \"As we were thinking of Piper on the outside, having them be married creates a lot more stories for us and possible conflict,\" says Herrmann about the relationship at the center of the show.\n\nBrian Chamberlayne, who wrote the finale, said the wedding was emotional for the cast to film, since it doubled as both Piper's goodbye and the end of Schilling's on-set prison stint. (The episode was directed by castmember Nick Sandow.) \"There was a weird mix of emotion that day for Taylor’s last day shooting in the prison — realizing that she’s really getting out of this place,\" Chamberlayne tells THR. \"There’s excitement but there’s also a sense of loss, and I think that Piper is feeling that as well. That’s something I was trying to portray: the excitement of getting her freedom, but then also leaving Alex and this place behind that she’s become accustomed to.\"\n\nAlex, after all, still has four years left on her sentence. \"What's significant to come out of the wedding is that, in the way that weddings are for most people, it was a statement to each other and to the people around them that they’re going to try their hardest,\" says Chamberlayne of Piper and Alex's future. \"It might not be legal, but it was a big deal that they got to do that. Especially given how long it’s going to be before they see each other again, physically, and have physical contact.\"\n\nPiper's mixed feelings were evident as she watched the kickball game between the inmates of C-block and D-block play out, an activity she fought for in her final days inside — only now, she watched from the other side of the fence. When her brother, Cal Chapman (Michael Chernus), asks her what she is going to do next, she offers no answer and the screen fades to orange.\n\n\"There’s that moment before Piper's release where she’s scanning the cell block and kind of just taking everyone in, and it’s a little bit like how you don’t fully get the understanding of a place until it’s about to go away,\" he explains. \"That’s when you take it all in, and Piper has that moment as well.\"\n\nChamberlayne joined the Orange writers room in season six and, after writing the second episode of the season, \"Sh*tstorm Coming,\" he was given the momentous finale. Not only did the episode need to properly send off Piper, her ending also had to play out parallel to the devastating developments for Taystee and Blanca, two topical story arcs that feel personal in the writers room.\n\n\"This is a huge episode for Piper,\" Chamberlayne says. \"That was really important to me, to Jenji and to the room that we did her a service by portraying her final moments in prison properly. Piper’s story in the finale, especially, and over the course of the season was the one that we honed the most in on to make sure that we were doing justice to her time in prison and showing exactly what she learned and how she’s grown — that she’s not that same person that walked in those prison doors.\"\n\nOne of the scenes that both shows Piper's growth as well as how her story parallels to Taystee's was in the 11th episode, \"Well This Took a Dark Turn\" (which was directed by Prepon), when Taystee and Piper have a conversation about Piper's privilege in the prison hair salon ahead of Taystee's trial.\n\n\"That was, as a room, something we leaned into as one of the most important moments of the season,\" says Chamberlayne. \"Especially for Piper’s arc in prison, to come out of it with this understanding that she got it hard in prison and people didn’t let up on her, but so many of these women have it hard on the outside and that’s part of the reason they went after Piper in prison.\"\n\nHe adds, \"This contrast of her fish-out-of-water story, which is for minorities and people who are underprivileged classes, that’s constant. That’s the world that they inhabit every day. It was important to all of us to make sure that we highlighted that.\"\n\nDespite having the backing of the ACLU and Black Lives Matter, Taystee is convicted for second-degree murder in the death of Piscatella only moments after she explains to former warden Joe Caputo (Sandow) that there is no justice for inmates like her or the late Poussey Washington (Samira Wiley). As a former lawyer who worked on appeals for inmates who had received unjust sentences, writing Taystee's verdict was personal for Chamberlayne.\n\n\"It's important to us for all the characters that we do justice to the people who are going through this experience, who are currently incarcerated or who are dealing with the aftermath of incarceration and what its effect is on their life, so the examination really is of the system,\" says Chamberlayne of reflecting reality through Taystee. \"We’re hoping that, through these stories, we can talk about the issues we have with the system and then also tell the human stories of these peoples’ lives and the struggles that they face.\"\n\nFor three seasons now, the once-lively Taystee has been through a series of heartbreaking endings. \"Danielle is an amazing actress and we like to see her be fun — because she’s so funny as well as being great about the dramatic stuff — but you want to tell the story that’s true to that character and true to the world we live in. We talk about this a lot but you don’t have a choice but to get a little heartbreaking at times,\" he says.\n\nHerrmann adds of the breakout character: \"We’re craving old Taystee but the reality is that this is what happens. It’s out of their control; it’s out of her control. She’s such a light — the character and the actress — so we always hope to show light and darkness. I’m confident that we’ll get to that place again, but for now, this is the reality that she’s living in. Just awful.\"\n\nAnd the same goes for Blanca's storyline, which opens the door for Orange to tackle the U.S. immigration crisis in season seven. The announcement that MCC, now rebranded as PolyCon, was moving into the business of immigration detention centers is a prescient punch — though it was written months ago, the new season dropped only one day after the court-ordered deadline to reunite separated migrant children under the Trump administration's \"zero tolerance\" policy.\n\n\"Jenji came in at the beginning of season six stating that one of the clear things she wanted to do was address immigration detention centers — that’s something she was adamant about,\" says Chamberlayne of plotting the timely deportation storyline. \"We had spoken to some immigration attorneys and the way that Blanca’s story has worked out, it was a perfect opportunity to start to tell that story.\"\n\nFor Chamberlayne, the ending came full circle. His first episode of the season, \"Sh*tstorm Coming,\" provided the first hint that viewers should be worried about Blanca's fate. \"The FBI agent is looking at her case file and saying, 'Wait a second,'\" he recalls. \"Then having this moment, it was absolutely heart-wrenching to write. The actors had really delivered in the way they play Blanca and Diablo's (Miguel Izaguirre) relationship, and I think it’s an important story to be telling, especially now. Very significant. I’m really glad that Jenji came in with that and allowed me to see it through.\"\n\nHerrmann says that Blanca's transfer gives Orange the opportunity to tackle more immigration-related storylines, especially since the show threw out its own timeline so it could play out in the year 2018. \"Things change every day, every minute, in terms of what’s going on with the policies,\" she says. \"So we hope to tell some of those stories in the next season, but because it’s ever-changing, we don’t want to get too detailed in true hopes that by the time our next season airs it’s a whole different thing. We look to be able to organically find these things within the characters and the stories that we’ve already created.\" She adds, \"But immigration has been an issue here in the country since it was born.\"\n\nIn addition to unjust sentences and the immigration crisis, Orange continued to shed light on the country's opioid epidemic with Daya Diaz (Dascha Polanco) developing a heroin addiction now that she, too, is serving out a life sentence for the death of C.O. Humphrey (who viewers will recall, was actually killed by Kukudio, who is now dead). Daya, in a devastating turn, now values drugs and her power relationship with her supplier, new inmate Daddy (Vicci Martinez), over that of any family members on the outside, including her daughter and mother, Aleida (Elizabeth Rodriguez).\n\nAlong with Daya, Alex, Taystee and Nicky, the following inmates are alive and ready to continue serving out their time in max come season seven: Frieda Berlin (Dale Soules), Suzanne Warren (Uzo Aduba), Pennsatucky (Taryn Manning), Cindy Hayes (Adrienne C. Moore), Flaca Gonzales (Jackie Cruz), Maria Ruiz (Jessica Pimentel), Zirconia (Daniella De Jesus) and new villain Badison (Amanda Fuller). Red (Kate Mulgrew) and Gloria Mendoza (Selenis Leyva) are in SHU at the season's end, and Sophia Burset (Laverne Cox) gets out on early release.\n\nMeanwhile, Lorna Morello (Yael Stone) has gone into a worrisome early labor and the villainous Denning sisters, Barb (Mackenzie Phillips) and Carol (Henny Russell), murdered each other, effectively saving the kickball game from turning into a deadly prison gang war. The season also provided glimpses at Lolly Whitehall (Lori Petty) in the max psych ward and a retired Sam Healy (Michael Harney). Caputo, who quit his job, is left morally grappling with Taystee's verdict and leans on new girlfriend Fig (Alysia Reiner), who provided an unexpected foil to MCC's Linda Ferguson (Beth Dover) throughout the season.\n\nA handful of Orange characters, however, were still missing-in-action by the season's end. The season very briefly showed some of the inmates from the other bus from the fifth season finale — Big Boo (Lea DeLaria), Ouija (Rosal Colon) and Helen Van Maele (Francesca Curran) were sent off to a prison facility in Ohio.\n\nBut a handful of memorable inmates never appeared. Most notably, Janae Watson (Vicky Jeudy) and Alison Abdullah (Amanda Stephen), Brook Soso (Kimiko Glenn), Yoga Jones (Constance Shulman), Leanne Taylor (Emma Myles) and Angie Rice (Julie Lake), Kasey Sankey (Kelly Karbacz) and Brandy Epps (Asia Kate Dillon), and, most obvious of all, Maritza Ramos (Danielle Guerrero). Chang's (Lori Tan Chinn) absence signals that the inmate who walked through the hole in the fence during the riot remains an unaccounted-for fugitive.\n\nBoth Herrmann and Chamberlayne spoke about the cast trimming that had been predicted ahead of the season, explaining why it was time to refocus on a core group of characters.\n\n\"The change of location provided the opportunity, in that the first season is Piper being a fish-out-of-water in the prison,\" says Chamberlayne. \"We get to know all these characters around her, so it’s only fitting that when we’re coming to the end of her story in prison that we see those same characters that we met in season one in this new location where they’re all fish-out-of-water. They’re having to make new friendships and bonds and also learn how to survive in a different way. That was another thing that Jenji came in and said at the beginning of the season. She knew that she wanted to do that and I’m really grateful to her for giving us the groundwork.\"\n\nHerrmann has explained the Orange storytelling process of not leaving any extra ideas untold by season's end. Whether or not some of the missing characters will return for season seven will largely depend on what fits with the ideas that come out of the writers room for season seven.\n\n\"If the story takes us there, it has to be organic for us,\" she says. \"We never want to suddenly be in a world that we haven’t set up. But we love those characters and miss them as storytellers for sure, so we hope to always see them.\"\n\nThe 13-episode sixth season of Orange Is the New Black is streaming now on Netflix. Bookmark THR.com/OITNB for more show coverage.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/12/bywcqq0k.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/07/piper_and_taystee_orange_is_the_new_black_-_publicity_-_h_split_2018.jpg", "https://cdn1.thr.com/sites/default/files/2018/07/piper_and_taystee_orange_is_the_new_black_-_publicity_-_h_split_2018.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/07/piper_and_taystee_orange_is_the_new_black_-_publicity_-_h_split_2018.jpg", "keywords": [], "authors": ["Jackie Strause", "Jackie.Strause Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/orange-is-new-black-season-6-finale-explained-interview-1130502", "title": "'OITNB': How Every Inmate's Season 6 Journey Ended", "meta_data": {"viewport": "width=device-width", "description": "'Orange Is the New Black' season six ending explained by executive producer Tara Herrmann and writer Brian Chamberlayne, who go inside the finale and look ahead to season seven.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/orange-is-new-black-season-6-finale-explained-interview-1130502", "domain": "https://www.hollywoodreporter.com/", "title": "'OITNB': How Every Inmate's Season 6 Journey Ended", "description": "Executive producer Tara Herrmann and writer Brian Chamberlayne go inside the supersized finale with the Hollywood Reporter.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/07/piper_and_taystee_orange_is_the_new_black_-_publicity_-_h_split_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'OITNB': How Every Inmate's Season 6 Journey Ended", "description": "Executive producer Tara Herrmann and writer Brian Chamberlayne go inside the supersized finale with the Hollywood Reporter.", "url": "https://www.hollywoodreporter.com/live-feed/orange-is-new-black-season-6-finale-explained-interview-1130502", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/07/piper_and_taystee_orange_is_the_new_black_-_publicity_-_h_split_2018.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'OITNB': How Every Inmate's Season 6 Journey Ended", "sailthru.description": "Executive producer Tara Herrmann and writer Brian Chamberlayne go inside the supersized finale with the Hollywood Reporter.", "sailthru.author": "Jackie Strause", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-07-30 05:00:00", "sailthru.tags": "Live Feed, Television, Orange is the New Black"}, "movies": [], "publish_date": 1532898000.0, "source": "https://www.hollywoodreporter.com", "summary": ""}