{"url": "https://www.nbc.com/world-of-dance", "text": "NBC's hit dance competition series, \"World of Dance,\" is led by a judging team of extraordinary dance superstars - Jennifer Lopez (who also serves as an executive producer), Derek Hough, NE-YO - and host Scott Evans.\n\nThe series, from Universal Television Alternative Studio and Nuyorican Productions, gives dancers the platform to showcase their talents and the opportunity to receive a life-altering grand prize of $1 million.\n\n\n\nIn partnership with preeminent global dance brand World of Dance, the series brings the world's elite dancers together to compete in epic battles of artistry, precision and athleticism. Solo dancers will compete against duos and crews in an unlimited range of dance, including hip-hop, popping, locking, tap, ballet, break dancing, ballroom and more.\n\n\n\nThe contestants are handpicked from qualifying events around the nation and thousands of online submissions. The competitors are divided into four divisions: Junior (17 years and under; 1-4 dancers); Junior Team (17 years and under; 5-15 dancers); Upper (18 years and older; 1-4 dancers); Upper Team (18 years and older; 5-15 dancers). Our panel of experts scores the acts using a precise point system developed by World of Dance, using the following criteria: Performance, Technique, Choreography, Creativity and Presentation. The competition consists of five rounds: The Qualifiers, The Duels, The Cut, Divisional Final and World Final. In the first four rounds, dancers compete only within their division, but in the World Final, the winners from each division will compete against each other for the grand prize.\n\nTo raise the stakes for Season 3, the score to get from The Qualifiers to The Duels has been raised from 80 to 85, meaning many contestants from past seasons wouldn't have made it through the first round this season. Then, in The Duels, judges added a twist called Redemption: Tthe two highest-scoring acts that did not win their head-to-head routine get one last chance to compete for the final spot in The Cut.\n\nFrench duo Les Twins were crowned the first-ever winners of \"World of Dance\" Season 1 and Junior Team hip-hop group The Lab took the crown for Season 2 - both groups took home the $1 million grand prize.\n\n\n\nWorld of Dance is among the most trusted and fastest-growing dance and music entertainment brands, combining a successful digital platform of more than 8 million subscribers with the world's largest international urban dance competition. What began in 2008 as a single event is now a continent-spanning, tour de force of human spirit and sick dance moves. The World of Dance Tour attracts YouTube stars, industry icons and tens of thousands of fans to events in more than 25 countries, spanning the U.S., Europe, South America and Asia. The inspiring performance videos captured from these events drive 30 million monthly views online, making World of Dance the largest dance entertainment channel on YouTube. No language barriers. No animosity. Just pure, awe-inspiring movement.\n\nJennifer Lopez, Elaine Goldsmith-Thomas and Benny Medina executive produce for Nuyorican Productions. Executive producers also include Kris Curry, Matilda Zoltowski, Tina Nicotera Bachmann, Alex Rudzinski, David Gonzalez, Matthew Everitt and Al Hassas. The series is produced by Universal Television Alternative Studio in association with Nuyorican Productions and World of Dance.\n\nCREDITS\n\nDay and Time\n\nSundays at 8/7c, beginning March 3\n\n\n\nSpecial Premiere\n\nTuesday, February 26 at 9/8c\n\nJudges\n\nJennifer Lopez, Derek Hough, NE-YO\n\nHost\n\nScott Evans\n\nExecutive Producers\n\nJennifer Lopez, Elaine Goldsmith-Thomas, Benny Medina, Kris Curry, Matilda Zoltowski, Alex Katz, David Gonzalez, Matthew Everitt, Al Hassas\n\nCo-Executive Producers\n\nClair Breen, Tabitha D'umo, Napoleon D'umo\n\nSupervising Producers\n\nDan Norris, Kelley Parker, Brian Updyke\n\nExecutive in Charge of Production\n\nWylleen May\n\nLine Producer\n\nReilly Oliver\n\nDirector\n\nAlex Rudzinski\n\nSupervising Casting Director\n\nMichelle McNulty\n\nProduction Designer\n\nFlorian Wieder, Dave Edwards\n\nBackstage Production Designer\n\nJames Connelly\n\nCostume Designer\n\nMarina Tobyina\n\nMusic\n\nDistrict 78\n\nOrigination\n\nLos Angeles, California\n\nProduced By\n\nUniversal Television Alternative Studio in association with Nuyorican Productions and World of Dance", "images": ["https://img.nbc.com/sites/nbcunbc/files/images/2019/2/07/WOD_S3-Logo-1920x1080.jpg", "https://cdn.betrad.com/pub/icon1.png"], "top_img": "https://img.nbc.com/sites/nbcunbc/files/images/2019/2/07/WOD_S3-Logo-1920x1080.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nbc.com/world-of-dance", "title": "World of Dance", "meta_data": {"description": "World of Dance - Watch all of Season 3 on NBC.com and the NBC App. Jennifer Lopez, Derek Hough and NE-YO judge the hit dance competition.", "og": {"type": "tv_show", "title": "World of Dance - NBC.com", "description": "World of Dance - Watch all of Season 3 on NBC.com and the NBC App. Jennifer Lopez, Derek Hough and NE-YO judge the hit dance competition.", "image": {"identifier": "https://img.nbc.com/sites/nbcunbc/files/images/2019/2/07/WOD_S3-Logo-1920x1080.jpg", "type": "image/jpg", "width": 1920, "height": 1080}, "site_name": "NBC", "url": "https://www.nbc.com/world-of-dance"}, "al": {"android": {"package": "com.nbcuni.nbc", "url": "nbctve://shows/world-of-dance", "app_name": "NBC"}, "ios": {"app_store_id": 442839435, "app_name": "NBC", "url": "nbctve://shows/world-of-dance"}, "ipad": {"app_store_id": 442839435, "app_name": "NBC", "url": "nbctve://shows/world-of-dance"}, "iphone": {"app_store_id": 442839435, "app_name": "NBC"}, "web": {"url": "https://www.nbc.com/world-of-dance", "should_fallback": "true"}}, "twitter": {"title": "World of Dance - NBC.com", "card": "app", "description": "World of Dance - Watch all of Season 3 on NBC.com and the NBC App. Jennifer Lopez, Derek Hough and NE-YO judge the hit dance competition.", "image": "https://img.nbc.com/sites/nbcunbc/files/images/2019/2/07/WOD_S3-Logo-1920x1080.jpg", "app": {"name": {"iphone": "NBC", "ipad": "NBC", "googleplay": "NBC"}, "id": {"iphone": 442839435, "ipad": 442839435, "googleplay": "com.nbcuni.nbc"}, "url": {"iphone": "nbctve://shows/world-of-dance", "ipad": "nbctve://shows/world-of-dance", "googleplay": "nbctve://shows/world-of-dance"}, "country": "US"}, "site": {"identifier": "@nbc", "id": 26585095}, "url": "https://www.nbc.com/world-of-dance"}, "viewport": "width=device-width, initial-scale=1", "apple-media-service-subscription": "expires=9999, type=free", "fb": {"app_id": 653521154659171}}, "movies": [], "publish_date": null, "source": "https://www.nbc.com", "summary": ""}