{"url": "https://www.kqed.org/pop/28206/how-amber-rose-became-an-unlikely-feminist-icon", "text": "Both are impossible to know, of course. Rose is, after all, an unforgettable-looking woman, one who had been making a name for herself as a video and print model before Kanye had even met her. (He went out of his way to get an introduction after her striking appearance in the \"What Them Girls Like\" video by Ludacris.) As it stands, it is true that real, paparazzi-level celebrity only arrived on Rose's doorstep when Kanye did, and then her relationship with Khalifa kept her in the spotlight as a trophy wife until their split in 2014. During this time, Rose tried her hand at everything from music and random reality TV guest spots, to a clothing line -- all with limited success.\n\nRose appeared, for years, like a genetically-blessed celebrity girlfriend who had little to offer the world other than her stunning style and penchant for fueling gossip. So it's ironic that Rose seemingly only found her footing and her calling once she was single and after she'd been raked over the coals in public one too many times. Remarkably, in the last two years, Amber Rose hasn't just landed on her feet, she's strapped some spiky high-heeled boots on those suckers and trampled over every hater in her vicinity, in an astonishingly defiant manner.\n\nThe shift started when she showed up to 2015's VMAs wearing a body suit covered in female-specific insults. At Rose's side was Blac Chyna wearing a matching dress. \"GOLD DIGGER,\" \"BITCH,\" \"WHORE,\" \"STRIPPER,\" \"HOE,\" their outfits screamed back at a public all too accustomed to directing these slurs at famous women. It was a surprising nod to the feminist riot grrrl movement of the 1990s -- and a stark message that Amber Rose was not going to be shamed out of the way.\n\nLater that year she penned a book, How to Be a Bad Bitch, which sold well. It preached a message of sisterhood, self-acceptance, strength and -- in direct contradiction to the title of the thing -- good manners. It wasn't a flawlessly written feminist tome, but it did throw a couple of middle fingers at a media that is all too fond of pitting women against one another.\n\nThen there was the pièce de résistance: the Amber Rose SlutWalk. Rose didn't invent the SlutWalk, but she has become an important spokesperson for the reasons why we need them. The one she held in Los Angeles in October 2015 was widely reported on in a way that others are not, precisely because she was at the helm, and precisely because she used it as a platform to speak very openly, and emotionally, about her life experiences and the double standards all women face. Photos of the event show her holding signs that read \"FUCK YO 30 SHOWERS\" and \"STRIPPERS HAVE FEELINGS TOO.\"\n\nThe website accompanying the SlutWalk now serves as a space for women to share their own stories of sexist abuse and slut-shaming, and prides itself on being “a completely inclusive space” with “a zero tolerance policy on all hateful language, racism, sexism, ableism, fat-shaming, transphobia, or any other kind of bigotry.”\n\nThe impact has been sizeable, and Rose has since found herself appearing in sketches for both Inside Amy Schumer and Funny or Die that were equal parts hilarious and subversive.\n\nhttps://www.youtube.com/watch?v=68kmBoUru-k\n\nIn addition to all of this, Rose has become a voice for other celebrity women. Just last week, she came to Taylor Swift's aid, when the singer (another woman on the receiving end of Kanye West's wrath -- \"I made that bitch famous\" he raps in \"Famous\") was under scrutiny for having a new love interest.\n\n\"I love Taylor, for sure. Absolutely,\" Rose said. \"And I feel like guys do that all the time — they break up and the next day they’re with another girl and nobody really says anything. But with Taylor it’s, you know what, I’m done with Calvin [Harris] and it didn’t work out, so onto the next... If I’m done, why do I have to sit in the house and be lonely?”\n\nIn her years in the spotlight, Rose has successfully transformed herself from objectified video girl into a bonafide fourth-wave feminist icon. That's no small feat. She now stands as a powerful symbol of what all famous women are subjected to -- and offers an impressive example of how to fight back.", "images": ["https://www.kqed.org/dist/a265318c66315d68a04401d49ccc110f.jpg", "https://ww2.kqed.org/app/uploads/sites/12/2016/06/landscape-1449151858-amberrose-e1467747790857.jpg", "https://www.kqed.org/dist/2ba0d7b880e4258be46ef0988eb43f9a.jpg", "https://ww2.kqed.org/app/uploads/sites/12/2016/06/landscape-1449151858-amberrose-e1467747790857-800x452.jpg", "http://ww2.kqed.org/pop/wp-content/uploads/sites/12/2016/06/Screen-Shot-2016-06-28-at-8.05.06-PM.png"], "top_img": "https://ww2.kqed.org/app/uploads/sites/12/2016/06/landscape-1449151858-amberrose-e1467747790857.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.kqed.org/pop/28206/how-amber-rose-became-an-unlikely-feminist-icon", "title": "How Amber Rose Became an Unlikely Feminist Icon", "meta_data": {"description": "From arm candy to punchline to women's rights advocate, one model personifies the perils of female celebrity.", "og": {"url": "https://www.kqed.org/pop/28206/how-amber-rose-became-an-unlikely-feminist-icon", "type": "article", "title": "How Amber Rose Became an Unlikely Feminist Icon | KQED", "description": "From arm candy to punchline to women's rights advocate, one model personifies the perils of female celebrity.", "image": {"identifier": "https://ww2.kqed.org/app/uploads/sites/12/2016/06/landscape-1449151858-amberrose-e1467747790857.jpg", "width": 850, "height": 480}, "site_name": "KQED"}, "twitter": {"card": "summary_large_image", "title": "How Amber Rose Became an Unlikely Feminist Icon | KQED", "description": "From arm candy to punchline to women's rights advocate, one model personifies the perils of female celebrity.", "image": "https://ww2.kqed.org/app/uploads/sites/12/2016/06/landscape-1449151858-amberrose-e1467747790857.jpg", "site": "@kqed"}, "article": {"tag": "ntv"}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 160023622793, "pages": "11319471190, 107786349295771, 237556148049, 231139070292217, 275956935839231, 143782868990974, 146772588368, 137008446337124, 336039936485067, 110859860231, 354862581256350, 404042812985733, 427314403966954, 273148762716755"}}, "movies": ["//www.youtube.com/embed/3xhED-DLSco", "//www.youtube.com/embed/HeiSx5MNDvg"], "publish_date": null, "source": "https://www.kqed.org", "summary": ""}