{"url": "https://www.bustle.com/p/13-memorable-real-housewives-vacations-that-no-true-fan-will-ever-forget-8506530", "text": "Drama is most certainly the name of the game when it comes to the Real Housewives franchise. While the weekly episodes certainly are chock-full of enough shenanigans to keep fans entertained, it goes without saying that the Real Housewives vacations are some of the best moments in reality television history.\n\nThe ladies definitely go all out when it comes to their group getaways, traveling to some of the most luxurious locales on earth. But while their vacation spots almost always have an air of sophistication and high class, their behavior during those trips is often quite the opposite. With the alcoholic beverages always free flowing, major drama never fails to unfold as soon as the women touch down in their designated destination.\n\nOften the highlight of every Real Housewives season, the vacations are usually aired over a series of several episodes, depending on the length and level of drama that occurs during the getaway. Spreading it out gives fans a huge dose of everything that went down during the trip. With the franchise now in its 12th year of production and currently featuring seven cities, it's almost hard to keep count of the many vacations. So in no particular order, here are some the most memorable Housewives vacations of all time.\n\n1. Turks & Caicos (RHONY, Season 7)\n\nThere was a moment during Real Housewives of New York's Turks & Caicos vacay when Heather Thomson and Carole Radziwill became freaked out about a naked man sleeping in their vacation house. After revealing that the the man was a friend of hers, Luann De Lesseps uttered perhaps one of the most iconic lines in Housewives history, telling the ladies, \"Don't be all, like... uncool\" about the situation.\n\n2. Cape Town, South Africa (RHOA, Season 4)\n\nThe drama was seemingly endless during Real Housewives of Atlanta's trip to Cape Town, South Africa. For starters, there was a huge controversy over whether or not Kim Zolciak \"would hold a black baby,\" despite Kim's absence from the vacation. And who could ever forget Shereé Whitfield and Marlo Hampton's bizarre mimicking match where they mumbled and made weird faces at one another? That moment was truly priceless.\n\n3. Hong Kong, China (RHOBH, Season 7)\n\nAll seemed to be going pretty well during the Real Housewives of Beverly Hills Hong Kong trip – that is, until the final night when with Erika Jayne had major meltdown and Lisa Rinna flat-out questioned Dorit Kemsley about using drugs.\n\n4. Lake George, New York (RHONJ, Season 5)\n\nA major family brawl ensued during this Real Housewives of New Jersey vacation between Joe Giudice and Joe Gorga after Gorga called his sister Teresa Guidice \"scum.\"\n\n5. Costa Rica (RHOC, Season 7)\n\nThis Real Housewives of Orange County trip quickly went south when Tamra Judge, Heather Dubrow, and Gretchen Rossi began confronting Alexis Bellino about her “phoniness.” The attack prompted Alexis to leave after she felt bullied by the other women.\n\n6. Anguilla, BWI (RHOA, Season 5)\n\nThis trip was monumental for so many reasons. Kenya Moore stole the show when she declared herself \"gone with the wind fabulous\" while notoriously twirling out of group's evening gathering. Then there was the moment when Phaedra Parks showcased her \"donkey booty\" for the group with a jaw-dropping mesh dress and thong bikini combo. The now-divorced Cynthia and Peter even renewed their wedding vows during the group vacay.\n\n7. Puerto Vallarta, Mexico (RHONY, Season 9)\n\nRamona Singer and Sonja Morgan kicked off the drama when they attempted to forcefully choose the best room in the house for their joint sleeping quarters. Things got increasingly heated when Ramona later had a nasty exchange of words with Bethenny Frankel. The never-ending flow of tequila also caused Luann to fall not once, but twice during the Mexico getaway.\n\n8. Amsterdam, Netherlands (RHOBH, Season 5)\n\nWhat didn't go wrong during the RHOBH trip to Amsterdam? Brandi Glanville notoriously slapped Lisa Vanderpump in the face. Then, Lisa Rinna threw a full wine glass in Kim Richards' face after Kim threatened to reveal a secret about Lisa's husband, Harry Hamlin. Needless to say, it'd probably be best for these ladies not to vacation together ever again.\n\n9. Napa, California (RHONJ, Season 4)\n\nThe Real Housewives of New Jersey road trip to Napa was seemingly never-ending. Although the drama on this bus trip was seemingly nonstop, the most memorable moment of this vacay came from Joe Giudice, who seemingly forgot that he was being filmed and took a suspicious phone call, infamously telling the person on the other end of the call, \"Hold on. Here comes my b*tch wife.\"\n\n10. St. John, U.S. Virgin Islands (RHONY, Season 3)\n\nPerhaps the most iconic Real Housewives vacations to date, RHONY's Scary Island vacation provided fans with unforgettable moments such as Ramona's \"turtle time\" and Bethenny Frankel yelling, \"Go to sleep!\" The vacation from hell also saw have a major meltdown resulting in her being sent home for her erratic behavior.\n\n11. Riviera Maya, Mexico (RHOA, Season 6)\n\nThis trip was nothing but drama from the start. For starters, Kenya confronted Apollo about his claims that she tried to sleep with him, which totally pissed Phaedra off. (Apollo later apologized and admitted that he was lying all along.) Peter and Gregg Leakes almost came to blows after NeNe told Peter to stop acting like a “b*tch.” The moment signaled the beginning of the end of NeNe and Cynthia’s friend contract.\n\n12. Boca Raton, Florida (RHONJ, Season 6)\n\nThings got extremely ugly during this trip to Florida after Amber Marchese's husband, Jim, accused Teresa Aprea's husband Rino of sleeping with his mother-in-law.\n\n13. St. Barth's (RHONY, Season 5)\n\nThis was the RHONY vacation where Aviva Drescher referred to Sonja and Ramona as \"white trash.\" Although, the twosome were aware that they were being insulted they had to do research to find out what the term actually meant. Drescher later apologized for the comment, telling Us Weekly, \"First and foremost, I am very much against name-calling ... it just slipped out ... I regret ever calling anybody a name like that.\"\n\nAs the ladies continue to take vacations on the show, there certainly will be many more moments to add to this list soon.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/2/948eaa3d-8423-428e-aff3-e7157351d9a6-getty-1205159727.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/3/30/a8f71494-3d49-48a5-955f-5a30d59f4532-bustle_rhony_0327.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/1/6dc93526-49c9-4c5b-b32f-38645f920a36-nup_188810_0841.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/4/2/12922cea-d0de-4746-ac86-741921d99908-nup_177082_1122.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/4/2/12922cea-d0de-4746-ac86-741921d99908-nup_177082_1122.JPG?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/6534f3ff-ed4a-48a5-867b-2a0737fbc057-getty-1154921708.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/4/2/12922cea-d0de-4746-ac86-741921d99908-nup_177082_1122.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/13-memorable-real-housewives-vacations-that-no-true-fan-will-ever-forget-8506530", "title": "13 Memorable 'Real Housewives' Vacations That No True Fan Will Ever Forget", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/13-memorable-real-housewives-vacations-that-no-true-fan-will-ever-forget-8506530", "type": "article", "title": "13 Iconic 'Real Housewives' Vacations That True Fans Will Never Forget", "description": "Drama is most certainly the name of the game when it comes to the Real Housewives franchise. While the weekly episodes certainly are chock-full of enough shenanigans to keep fans entertained, it goes without saying that the Real Housewives vacations…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/4/2/12922cea-d0de-4746-ac86-741921d99908-nup_177082_1122.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Drama is most certainly the name of the game when it comes to the Real Housewives franchise. While the weekly episodes certainly are chock-full of enough shenanigans to keep fans entertained, it goes without saying that the Real Housewives vacations…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}