{"url": "https://articlebio.com/how-much-is-bethenny-frankel-s-ex-husband-jason-hoppy-s-net-worth-details-about-divorce-settlement-and-hoppy-s-income-sources", "text": "Jason Hoppy and reality star Bethenny Frankel finalized their divorce in July 2016 after over four years of negotiations.\n\nHoppy's ex-wife Bethenny Frankel who was listed as the sixth highest paid reality TV star in 2016 has gained the fame and money after starring in series like Bravo and The Real Housewives of New York City. The New York Times-bestselling author is also a founder of an organization called B Strong which helps needy women- recently her organization went to Mexico to help earthquake victims. Frankel also recently sent four planes full of supplies to Puerto Rico for Hurricane Maria victims.\n\nHas the divorce changed Hoppy's net worth? We're discussing Bethenny Frankel's ex-husband Jason Hoppy's sources of income, net worth and divorce here!\n\nHow Much Is Jason Hoppy's Net Worth? What Are His Sources Of Income?\n\nJason Hoppy's estimated net worth is $5 million. The credit to such an impressive net worth goes to his successful career as a real estate agent. He also once served as a pharmaceutical sales executive which helped him grow his net worth.\n\nThe former pharmaceutical sales representative, Hoppy, used his experience in sales to further his career as a real estate agent in New York. He earns huge commissions by selling and buying houses, and other properties.\n\nReal estate agent Jason Hoppy\n\nJason Hoppy appeared on Bravo TV’s reality show The Real Housewives of New York City in 2010 and Bethenny Ever After from 2010-2011, he was paid well for his stint on the shows.\n\nHoppy's ex-wife Bethenny Frankel's estimated net worth is around $ 25 million. She listed as the sixth highest paid reality TV star in 2016. She made around $8.5 million from 2015 to 2016. She was also paid around $40,000 per episode of The Real Housewives of New York City in 2016.\n\nBeing married to a rich spouse is another way to stabilize and increase one's net worth which Jason Hoppy did.\n\nAlso read: Exes Marcus Lemonis and Bethenny Frankel back together? Or are they dating different people?\n\nIn addition, Frankel who was previously married to Peter Sussman is also the author of many best-selling books. Her book Naturally Thin: Unleash Your Skinnygirl and Free Yourself from a Lifetime of Dieting in 2009 was listed at the No. 2 on the “How-To” bestseller list. Her another book “A Place of Yes” landed on The New York Times’ was also listed on the bestseller list in the Hardcover Advice category.\n\nGiven that Hoppy was married to Frankel during the time when books and shows were a big hit, he benefitted quite a lot. And if he hadn't previously benefitted from Frankel's success, Jason Hoppy sure got his share in the divorce settlement.\n\nJason Hoppy And Bethenny Frankel's Married Life\n\nJason Hoppy and her ex-wife Bethenny Frankel had their first encounter at a New York City nightclub, Tenjune. On their first meeting, Hoppy impressed Bethenny with his attitude and confidence.\n\nAlso read: Bethenny Frankel’s Ex-Husband Jason Hoppy’s Arrest :Know the Reason here in Details\n\nThe couple started dating shortly after their first encounter. The real estate agent proposed the actress after dating her for about 11 months. Bethenny Frankel and Jason Hoppy got married secretly in March 2010 at the Four Seasons hotel in NYC. Hoppy and Frankel welcomed their first child, Bryn Hoppy, together on 8 May 2010.\n\nJason Hoppy with his ex-wife and their daughter, Bryn Hoppy\n\nSource: In Touch Weekly\n\nThe couple called it quits after two years of marriage, they separated in 2012 and filed for divorce in January 2013. After four years, the divorce was finalized in 2016.\n\nDetails On Jason Hoppy And Bethenny Frankel's Divorce Settlement\n\nJason Hoppy and Bethenny Frankel's finalized their divorce after over four years of negotiations in July 2016. The divorced was delayed due to issues regarding the custody of their daughter and properties.\n\nJason Hoppy with his ex-wife Bethenny Frankel\n\nSource: People\n\nThe court hasn't revealed the divorce settlement money as it was confidential, however, Frankel previously paid Hoppy around $12,000 per month as a spousal support and $3,00 a month for child support.\n\nThere was also a dispute for their $5.0 million houses in New York City. And, it was also reported that Jason Hoppy was happy after the court announced the settlement, that can only mean one thing-Hoppy got his expected share out of the divorce.\n\nJason Hoppy Quick Facts\n\nJason Hoppy was born on September 10, 1970.\n\nHe is a native of New York City, New York, United States.\n\nHe was born to Robert M. Hoppy and Carol A. Hoppy.\n\nHoppy graduated from the University of Scranton.\n\nHe has a sibling, Bryan Hoppy.\n\nBethenny Frankel Quick Facts", "images": ["https://articlebio.com//uploads/news/2017/08/08/how-much-is-jason-hoppy-s-net-worth-know-about-his-career-and-awards.jpg", "https://articlebio.com/uploads/news/2019/12/02/carly-steel-gets-engaged-to-beau-jacob-andreou-in-front-of-eiffel-tower.jpg", "https://articlebio.com/uploads/news/2019/10/15/why-lyssa-chapman-baby-lyssa-divorced-her-first-husband-brahman-galanti.jpg", "https://articlebio.com/uploads/biography/2020/01/12/simone-ashley-1578823762.jpg", "https://peopledotcom.files.wordpress.com/2017/01/bethenny-frankel-jason-hoppy.jpg?w=2000&h=1333", "https://articlebio.com/uploads/news/image/will-forte-and-his-girlfriend-olivia-modling-are-engaged-after-one-year-of-dating1587105719.jpg", "https://articlebio.com/uploads/biography/2020/01/23/greg-austin-1579769846.jpg", "https://articlebio.com/uploads/biography/2020/01/16/sarah-levy-1579157476.jpg", "https://articlebio.com/uploads/biography/2019/12/20/joe-burrow-1576836732.jpg", "https://articlebio.com/uploads/news/image/tiktok-couple-charli-d-amelio-and-chase-hudson-break-up-after-dating-for-5-months1587022551.jpg", "https://articlebio.com/uploads/news/image/becki-newton-and-chris-diamantopoulos-welcomes-third-child-together1587015177.jpg", "https://articlebio.com/uploads/biography/2020/01/22/karen-robinson-1579684795.jpeg", "https://articlebio.com/uploads/news/2017/08/08/how-much-is-jason-hoppy-s-net-worth-know-about-his-career-and-awards.jpg", "https://images-production.global.ssl.fastly.net/uploads/posts/image/25934/bethenny-frankel-jason-hoppy-court.jpg", "https://articlebio.com/uploads/news/image/russell-dickerson-s-wife-kailey-is-pregnant-expecting-first-child1587019577.jpg", "https://articlebio.com/uploads/news/image/ryan-reynolds-and-blake-lively-have-welcomed-third-child-their-married-life.jpg", "https://articlebio.com/uploads/news/image/rhoc-alum-kara-keough-looses-son-mccoy-during-childbirth1586940899.jpg", "https://2.bp.blogspot.com/-FTpvm14jTeQ/WA2fOUSaSgI/AAAAAAAAWPI/39yliXrzBqQnM8JPQXb7rgYyHy8s_3DJgCLcB/s1600/JasonHoppy.png", "https://articlebio.com/uploads/news/2019/10/16/lyssa-chapman-s-relationship-with-leiana.jpg", "https://articlebio.com/uploads/news/image/paul-nassif-s-wife-brittany-pattakos-is-pregnant-expecting-first-child-together1587117955.jpg", "https://articlebio.com/uploads/biography/2019/12/26/richard-t-jones-1577356551.jpg"], "top_img": "https://articlebio.com//uploads/news/2017/08/08/how-much-is-jason-hoppy-s-net-worth-know-about-his-career-and-awards.jpg", "keywords": [], "authors": [], "canonical_link": "https://articlebio.com/how-much-is-bethenny-frankel-s-ex-husband-jason-hoppy-s-net-worth-details-about-divorce-settlement-and-hoppy-s-income-sources", "title": "How Much is Bethenny Frankel's Ex-Husband Jason Hoppy's Net worth? Details About Divorce Settlement and Hoppy's Income Sources", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://articlebio.com/assets/images/ms-icon-144x144.png", "theme-color": "#ffffff", "keywords": "How Much is Bethenny Frankel's Ex-Husband Jason Hoppy's Net worth? Details About Divorce Settlement and Hoppy's Income Sources", "description": "Jason Hoppy and reality star Bethenny Frankel finalized their divorce in July 2016 after over four years of negotiations. Has the divorce changed Hoppy's net worth? How much did he receive in the divorce settlement?", "atdlayout": "articlepage", "og": {"site_name": "Articlebio", "type": "News", "title": "How Much is Bethenny Frankel's Ex-Husband Jason Hoppy's Net worth? Details About Divorce Settlement and Hoppy's Income Sources", "image": "https://articlebio.com//uploads/news/2017/08/08/how-much-is-jason-hoppy-s-net-worth-know-about-his-career-and-awards.jpg"}, "yandex-verification": "f4f2ef98dc589c96"}, "movies": [], "publish_date": null, "source": "https://articlebio.com", "summary": ""}