{"url": "https://en.wikipedia.org/wiki/The_Flash_(season_4)", "text": "Season of television series\n\nThe fourth season of the American television series The Flash, which is based on the DC Comics character Barry Allen / Flash, premiered on The CW on October 10, 2017, and ran for 23 episodes until May 22, 2018. The season follows a crime scene investigator with superhuman speed who fights criminals, including others who have also gained superhuman abilities. It is set in the Arrowverse, sharing continuity with the other television series of the universe, and is a spin-off of Arrow. The season is produced by Berlanti Productions, Warner Bros. Television, and DC Entertainment, with Andrew Kreisberg and Todd Helbing serving as showrunners.\n\nThe season was ordered in January 2017, and filming began that July. Grant Gustin stars as Barry, with principal cast members Candice Patton, Danielle Panabaker, Carlos Valdes, Keiynan Lonsdale, Tom Cavanagh, and Jesse L. Martin also returning from previous seasons, and are joined by Neil Sandilands. The series was renewed for a fifth season on April 2, 2018.[1]\n\nEpisodes [ edit ]\n\nCast and characters [ edit ]\n\nGuest [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe series was renewed for a fourth season on January 8, 2017,[64] earlier than usual for the series. Executive producer Andrew Kreisberg said on this, \"The great thing about our dear friends at The CW and Mark Pedowitz picking the shows up as early as they did has allowed us to start building the schedules for next season.\"[65] In May 2017, it was announced that Aaron Helbing would not return as an executive producer for season four, with only Greg Berlanti, Andrew Kreisberg, Sarah Schechter, and Todd Helbing returning from previous seasons.[66] Todd Helbing and Kreisberg were slated to serve as the season's showrunners.[67][68] In November 2017, Kreisberg was suspended from his role as executive producer and showrunner on The Flash over allegations of sexual harassment.[69][70] By the end of the month, he had been fired, with his name eventually being removed from the credits from all shows he worked on. In addition, Berlanti would take additional responsibilities working with Helbing to co-showrun the season.[71]\n\nWriting [ edit ]\n\nThe way I see it is, time is non-linear and everything is happening at once in the Speed Force. In some ways he's had an awakening and he's had a rebirth. Our first episode is called 'Reborn,' and it is a rebirth for Barry, but he's kind of scrambled, too, because he's experienced so much so quick over the course of six months, even though for him it was an eternity. He's not Barry when we see him for the first time. —Grant Gustin on the rebirth of Barry in season four.[72]\n\nIn March 2017, Kreisberg confirmed that the main villain for the fourth season would not be a speedster, like the previous three seasons.[73] Executive producers Aaron and Todd Helbing also mentioned that there would be less time travel in the season, with Aaron saying, \"We like playing with the timelines and the different time periods and future and past. For now, I think we're going to focus on the present.\"[74] In June 2017, Clifford DeVoe / Thinker was reported to be the main antagonist of the season. He was first hinted in the third season episode \"Abra Kadabra\" when the titular villain mentions him among the Flash's greatest enemies, and again in the season finale \"Finish Line\" when Savitar mentions facing DeVoe but states that the Flash has not dealt with him yet.[75] At the series' San Diego Comic-Con panel, the speculation was confirmed, with Todd Helbing saying, \"With three Speedsters in a row, this year it's the fastest man alive against the fastest mind alive.\"[28] He added that the writers were \"making a conscious effort this year to get the fun quotient back up\".[76]\n\nRegarding the possibility of Wally West taking on the mantle of the Flash in Barry's absence, Keiynan Lonsdale said that \"It's not something that's on my radar. I feel as though there is so much story to tell and Wally has so much growing to do... We need to see how these characters realistically get to where they are headed for.\"[77] With the action picking up six months after season three, Kid Flash and Vibe are left to protect Central City, with Carlos Valdes saying \"the team is sort of clutching at straws to keep the city together,... there is a unanimous feeling amongst the remaining members that it's just not the same without Barry... So in light of that, Cisco does whatever it takes to get his friends back.\"[78] Valdes also confirmed the return of Cisco's more lighthearted joking manner.[78] Candice Patton explained Iris West's larger role within Team Flash as \"a way of distracting herself,\"[78] adding that \"[Iris] is forced to deal with that anger and resentment and abandonment by kind of focusing on protecting Central City... We're seeing a very different Iris, almost a very hardened Iris.\"[79] Kreisberg also hinted at some major growth for Iris this season, and noted that \"the season premiere is all about Iris and Cisco, not Barry\".[80]\n\nIn July 2017, Sterling Gates, DC Comics comic book writer, joined as a member of the fourth season's writing staff.[81] At the Television Critics Association press tour in August 2017, Pedowitz stated that the fourth season of The Flash is \"going to try to find the lightness... of the Barry Allen of the first two seasons,\"[82] and said that the show was likely \"done with Speedster villains\".[83] Later in the month, Kreisberg confirmed the return of Harry Wells from Earth-2, saying that \"season 4 for Harry is really realizing what he's missing in his life and what it is he needs to become a better, more complete person, and so he's going to be going on a fairly epic emotional journey this season that is tied to the Thinker's plan,\" in addition to confirming the introduction of a new version of the Wells character.[84]\n\nIn September 2017, Helbing noted \"There's a lot of love in the air this season,\" and compared Barry and Iris' reunion to \"somebody going off to war for six months and coming back. There's a lot that Iris experienced that Barry didn't when he was gone, and it's really [about] the fun and the emotional component of making up that time when they weren't together.\" Helbing also explained that the Speed Force \"let [Barry] deal with all of the baggage [from the past three seasons]. When he comes out, he's sort of left that all behind.\"[85] That month, Kreisberg also confirmed that Barry and Iris will be getting married this season,[86] while also revealing that the pair will be going to couples therapy since \"[they] keep comically clashing inadvertently because [both are] used to being in charge, and so they wind up going... to work through it.\" He added, \"The two of them with the therapist is some of the funniest stuff we have ever done on this show, but it also leads to a deepening of their relationship.\"[87]\n\nCasting [ edit ]\n\nMain cast members Grant Gustin, Candice Patton, Danielle Panabaker, Carlos Valdes, Keiynan Lonsdale, Tom Cavanagh, and Jesse L. Martin return from previous seasons as Barry Allen / The Flash, Iris West, Caitlin Snow / Killer Frost, Cisco Ramon / Vibe, Wally West / Kid Flash, Harrison Wells, and Joe West, respectively.[25] Cavanagh primarily portrayed Harry Wells from Earth-2 in the season,[78] in addition to several other versions of Wells in smaller roles: Herr Wells of Earth-12, Wells 2.0 of Earth-22, H. Lothario Wells of Earth-47, Wells the Grey of Earth-13,[88] Sonny Wells of Earth-24 and H. P. Wells of Earth-25.[89] Also returning from earlier in the series is Jessica Camacho as Gypsy.[30] It was revealed that Tom Felton, who joined the cast as Julian Albert in the third season, would not be a series regular in the fourth season, and that there were no plans for him to appear.[90] Julian's absence will be addressed \"pretty quickly — there's a reason why he's no longer with the team,\" said Helbing.[91] In the season premiere, it is revealed that Julian has returned to London.[92] Kreisberg also confirmed that he had put on hold the planned return of Violett Beane as Jesse Quick due to the high number of speedsters on the show, but did not rule out a possible return in the future.[93] Beane eventually appeared as Jesse on the episode \"Luck Be a Lady\".[41] Britne Oldford, who previously appeared as Shawna Baez / Peek-a-Boo in the first season and the web series The Chronicles of Cisco, reprised her role in the season premiere.[37]\n\nIn July 2017, Neil Sandilands was announced to be cast as Clifford DeVoe, a metahuman genius who embarks on a season-long battle with the Flash in order to fix all that he deems wrong with humanity; while Kim Engelbrecht was announced as Marlize DeVoe, DeVoe's right hand and a highly intelligent engineer who designs devices for him; and Danny Trejo as Breacher, a bounty hunter from Earth-19 and the father of Gypsy.[27] Also in June, the series was looking to cast a role that \"should put the visual effects department to the test\",[94] with the role later revealed to be Ralph Dibny / Elongated Man, a metahuman with the ability to stretch his body to superhuman lengths and sizes.[95] Hartley Sawyer was cast in the recurring role that July as the fast-talking private investigator who after discovering his abilities will help Team Flash solve one of Central City's greatest mysteries.[34] The character was previously mentioned in the first season, as one of the fourteen people who seemingly died as a result of the particle accelerator explosion.[96] The next month, Katee Sackhoff was announced in the recurring role of Amunet Black, who operates an underground black market of metahuman supervillains.[35]\n\nFilming [ edit ]\n\nFilming for the season began on July 4, 2017,[97] in Vancouver, British Columbia, and concluded on April 21, 2018. Kevin Smith returned to direct an episode in January 2018.[99]\n\nMusic [ edit ]\n\nIn August 2017, series composer Blake Neely and Nathaniel Blume began to compose the music for the fourth season.[100]\n\nArrowverse tie-ins [ edit ]\n\nIn May 2017, The CW president Mark Pedowitz officially announced plans for a four-show Arrowverse crossover event, crossing over episodes of the television series Supergirl, The Flash, Legends of Tomorrow, and Arrow.[101] The crossover, Crisis on Earth-X, began with Supergirl and a special airing of Arrow on November 27, 2017, and concluded on The Flash and Legends of Tomorrow on November 28. Prior to that, Arrow actress Emily Bett Rickards appears as Felicity Smoak in the fifth episode of the season.[35] Following the crossover, Katie Cassidy (who has previously appeared on The Flash as both Laurel Lance and Black Siren) appears in the nineteenth episode as Siren-X, an alternate version of Laurel from Earth-X.[61] Arrow actor David Ramsey appears as John Diggle in the twenty-second episode.[62]\n\nMarketing [ edit ]\n\nIn July 2017, cast from the series appeared at San Diego Comic-Con International to promote the season, where exclusive footage was shown.[103] During the panel, a trailer for the season was shown, with James Whitbrook at io9 feeling that despite the \"grim\" tone, there was \"some fun signs of the team coming together to protect the city without [Barry],... Sprinkle in a few wacky things, like, say a goddamn Samuroid ripped straight from the comics, and ladies and gents, you've got a good season of The Flash lined up.\"[104] Ben Pearson with /Film felt seeing Iris West deal with the absence of Barry was \"a nice change of pace for that character\", but anticipated that \"Barry [would] be back two or three episodes in at the latest.\"[105] Collider's Allison Keene also noted Iris \"getting an actual storyline\" with Barry gone, and similarly presumed that he \"[would] be back in the fold by the end of the first episode\" alike to Flashpoint in the third season. She added, \"There are some new foes, lots of action, plenty of tech — it's great!\"[106]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nThe season began airing on October 10, 2017, on The CW in the United States, and on CTV in Canada.[108] The season concluded on May 22, 2018. Sky One acquired the rights to air the season in the UK & Ireland, airing it alongside the other Arrowverse shows. The season premiered October 17.[110][111]\n\nHome media [ edit ]\n\nThe season was made available for streaming on Netflix in late May 2018, soon after the season finale aired.[112] It was released on Blu-ray on August 28, 2018.[113]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nCritical response [ edit ]\n\nThe review aggregator website Rotten Tomatoes reported a 79% approval rating with an average rating of 6.95/10 based on 19 reviews. The website's consensus reads, \"After an unsteady turn in season three, The Flash returns to its roots with a fourth season packed with humor, spectacle, and a whole lot of heart.\"[137]\n\nReviewing the first two episodes of the season, Allison Keene writing for Collider.com, felt the premiere \"wipes the slate clean, fixing a lot of the issues that plagued the end of the last season, and setting up a much more toned-down storyline. Most importantly, it's brought back some fun.\" She added that with a \"streamlined team,\" the core characters now have time to interact and have meaningful plot lines. On the second episode, Keene described it as \"truly a delight\" with the show taking \"the time to focus on character relationships, and not just romantic relationships\" and each character \"feeling like a refreshed version of themselves, with new narrative purpose\". She also highlighted the setup of the Thinker \"as an Alchemy-like villain who manipulates evil metas into the Flash's path as part of some kind of masterplan\", saying \"The Flash is a series that truly works best as a procedural, with the team finding creative ways to bring down Villains of the Week.\"[138]\n\nIn reviewing the finale, IGN's Jesse Schedeen gave the episode \"We Are the Flash\" a rating of 4.6/10, opining that, \"As troubled as the series has been this year, it's disappointing but unsurprising to see The Flash's fourth season end on such a bland note.\"[139] Mike Cecchini of Den of Geek! similarly assigned the episode a rating of 2.5/5. In his review, Cecchini felt that the finale was \"the weakest season finale [The Flash] has ever produced,\" and that, \"despite several high points, wasn't really enough to salvage the season.\"[140] In a more positive review from The A.V. Club, Scott Von Doviak gave the finale a B+, praising the light tone and character moments, while adding that \"None of this can make up for the long stretches of mediocrity this year, but at least it doesn’t leave me with a bad taste in my mouth.\"[141]\n\nAccolades [ edit ]\n\nCollider ranked The Flash the second-best superhero series of 2017.[142]\n\nNotes [ edit ]\n\n^ Set during the events of the pilot episode ^ Lonsdale is only credited for the episodes he appears in, and is also credited in the special guest star bill in \"We Are The Flash\". ^ P. Wells of Earth-25, and Cavanagh also portrays—in a less prominent capacity—Herr Wells of Earth-12, Wells 2.0 of Earth-22, H. Lothario Wells of Earth-47, Wells the Grey of Earth-13, Sonny Wells of Earth-24, H.P. Wells of Earth-25, and Eobard Thawne / Reverse-Flash\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/6/6c/The_Flash_season_4.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6c/The_Flash_season_4.jpg/220px-The_Flash_season_4.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/6c/The_Flash_season_4.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Flash_(season_4)", "title": "The Flash (season 4)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/6c/The_Flash_season_4.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}