{"url": "http://time.com/5087585/golden-globes-2018-black-dresses-red-carpet/", "text": "The 75th Golden Globe Awards officially kick off awards season, but this year, the red carpet may create as much conversation as the honors handed out during the ceremony itself.\n\nLast month, reports surfaced that some female actors planned to wear all-black looks on the Golden Globes red carpet to protest sexual misconduct in Hollywood. More recently, some men, including Dwayne Johnson, announced plans to join them. The protest comes after numerous allegations of sexual harassment and assault against men in Hollywood and other industries, beginning with those against movie producer Harvey Weinstein in October.\n\nStylist Cristina Ehrlich told TIME Friday that she would be joining the effort by dressing Penelope Cruz, Greta Gerwig and Laura Dern in black.\n\n“The red carpet is watched globally and is therefore an incredible platform for and the perfect place for this sort of demonstration. Where in the past the red carpet has been about glitz and glamour, this year it isn’t about standing out, it’s about standing together and speaking out,” she said.\n\nThe sartorial choice is being positioned as a way to call attention to the effort to end sexual misconduct. It’s organized by Time’s Up, a new initiative to eradicate sexual harassment and gender inequality in the workplace, which includes the creation of a legal defense fund. Time’s Up, which has also provided pins to be worn on the red carpet, is backed by more than 300 women in the entertainment industry, including Shonda Rhimes, Reese Witherspoon, and Meryl Streep.\n\nThis is not the first time stars have used fashion to start a conversation. Take, for example, the blue ACLU ribbons Karlie Kloss and Barry Jenkins, among others, wore to last year’s Oscars, or the Planned Parenthood pin Emma Stone sported while picking up her Best Actress statuette at the same ceremony.\n\nTIME Person of the Year 2017: The Silence Breakers\n\nThis year’s red-carpet protest has been subject to some criticism, with some suggesting that sporting a dress in solidarity feels like a superficial or passive way to address a problem. Actor Rose McGowan, one of the first women to publicly accuse Harvey Weinstein of sexual assault, sounded off on the protest in a now-deleted tweet: “YOUR SILENCE is THE problem. You’ll accept a fake award breathlessly & affect no real change. I despise your hypocrisy. Maybe you should all wear Marchesa.” (Marchesa is the high-end brand designed by Weinstein’s wife Georgina Chapman, who announced her separation from the producer shortly after the allegations came to light.)\n\nActivist April Reign, who created the viral #OscarsSoWhite hashtag, suggested that it might send a stronger message if the actors didn’t attend the Golden Globes at all.\n\nIn response to the debate, Actor Rashida Jones told InStyle that the choice to wear black dresses on the red carpet is hardly, in her estimation, a “silent protest.” Instead, she said, it’s an opportunity to speak up and demand structural change.\n\n“I don’t think why we wear black is divisive as much as it is being discussed and debated without all the facts,” she said. “Many women on the red carpet will discuss what’s important to them about their choice to protest and wear black. We wear black to stand in solidarity with our sisters and to say time’s up on this imbalance of power and the abuses that come with it, regardless of what industry you work in. It’s time for every workplace to look more like our world, where women have equal representation.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Cady Lang at cady.lang@timemagazine.com.", "images": ["http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/01/rachel-brosnahan1.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2020/02/jr-oseary-oscar-party-featured.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/02/bong-joon-ho.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2018/01/rachel-brosnahan1.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Cady Lang"], "canonical_link": "https://time.com/5087585/golden-globes-2018-black-dresses-red-carpet/", "title": "Golden Globes Red Carpet 2018: Why Is Everyone Wearing Black?", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "why are people wearing black at golden globes, Golden Globes, Golden Globes 2018, Golden Globes red carpet, Golden Globes fashion, Golden Globes 2018 black dresses, 2018 Golden Globes, golden globes time's up, Golden Globes 2018 black dresses, Golden Globes protest", "news_keywords": "why are people wearing black at golden globes, Golden Globes, Golden Globes 2018, Golden Globes red carpet, Golden Globes fashion, Golden Globes 2018 black dresses, 2018 Golden Globes, golden globes time's up, Golden Globes 2018 black dresses, Golden Globes protest", "description": "Actors are wearing black dresses at this year's Golden Globes to protest sexual harassment in the entertainment industry.", "og": {"title": "Why Actresses Are Wearing All-Black On The Golden Globes Red Carpet", "type": "article", "site_name": "Time", "url": "https://time.com/5087585/golden-globes-2018-black-dresses-red-carpet/", "description": "Red carpet fashion will take on new meaning this year", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/01/rachel-brosnahan1.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5087585/golden-globes-2018-black-dresses-red-carpet/", "description": "Actors are wearing black dresses at this year's Golden Globes to protest sexual harassment in the entertainment industry.", "media": "https://api.time.com/wp-content/uploads/2018/01/rachel-brosnahan1.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5087585/golden-globes-2018-black-dresses-red-carpet/", "title": "Why Actresses Are Wearing All-Black On The Golden Globes Red Carpet", "description": "Red carpet fashion will take on new meaning this year", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/01/rachel-brosnahan1.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}