{"url": "https://www.hollywoodreporter.com/news/mira-sorvino-harvey-weinstein-rape-charges-1117655", "text": "\"It’s him finally facing real, real criminal consequences for his criminal behavior and so for that I feel gratified,\" said Sorvino.\n\nMira Sorvino, one of the dozens of women to accuse Harvey Weinstein of sexual misconduct, opened up about the disgraced movie mogul being arrested and charged with rape and committing a criminal sex act, on Wednesday’s episode of Today.\n\n“It feels like a really good first step,” Sorvino said of Weinstein’s arrest. “It’s him finally facing real, real criminal consequences for his criminal behavior and so for that I feel gratified, but honestly last weekend was a very emotional one and I cried many times because just seeing him brings up a lot of bad feelings and he’s raped many people that I love, so it’s not really a happy occasion.” (In response, Weinstein's lawyer Ben Brafman called Sorvino's comment a \"reckless character assassination\" and said Weinstein is \"stunned and outraged\" by the claim to THR.)\n\nShe continued, “I think maybe there will be some celebration when he gets convicted and goes to jail. That is when the process will be complete and we will see justice really being served. But until then, this is a great first step.”\n\nFollowing the arrest when Weinstein turned himself in May 25, Sorvino tweeted, “Sending love to all my sisters today who stood up against a monster...so many emotions...I am proud of and grateful to you all.\"\n\nWeinstein on Tuesday (June 5) pleaded not guilty to the charges and his lawyer vowed to beat the case before it goes to trial.\n\nToday’s Savannah Guthrie praised Sorvino for coming forward after holding onto the secret for a long time. “The funny thing is at the time it happened, I told everyone I knew and a lot of people will tell you that,” said Sorvino. “All these people wrote to me online, ‘I remember you telling me about that.’ Quentin Tarantino corroborated that I told him about it right away that September.”\n\nSorvino previously wrote in a guest column for The Hollywood Reporter that she believed her romantic relationship with Tarantino stopped further advances from Weinstein. “I was just happy that Quentin was my protector. I think that's why Harvey stopped trying with me because he would never mess with the girlfriend of his star director,” she wrote.\n\n“I told everyone I knew. No one said, ‘Hey, this is sexual harassment. You should go to the authorities. You have a case. You should go to the police. Maybe it’s assault.’ No one said anything like that,” she recalled in the Today interview. “I didn’t really understand the law and I didn’t think I was important enough to make a big enough deal over, I just kind of tried to put it to the side and keep working and go on about my life. And I think a lot of people felt that way.”\n\nSorvino admitted that she was shocked to learn how many women Weinstein had harassed. Had she been aware of the other victims, she is confident that she would have spoken out sooner. “I think we would have found strength in numbers and we would have done something a lot sooner,” she said. “But I did try to do something at the time, I even spoke to someone at Miramax about it and nothing happened and it kind of went away and I tried to go on with my life.”\n\nFollowing her abuse from Weinstein, Sorvino suspected that she had been blacklisted by him. Lord of the Rings director Peter Jackson admitted that he was warned not to work with her because she was believed to be difficult. “I didn’t even know what I suspected. I just knew that my career had slumped and I thought, ‘Well maybe it’s my fault. Maybe I’ve had too many children,’” she said. “Sometimes you have bad luck and I was like, ‘OK, maybe it wasn’t meant to be that my career was going to continue at the same level that it had been.”\n\nShe said that reading Jackson’s tweet admitting to blacklisting her and actress Ashley Judd based on Weinstein’s influence was a surprise. “It was like a thunderbolt. It was kind of crazy. I was like, ‘Oh, so it was really this malevolent hand that changed the course of my life and my professional horizons.’”\n\nThe actress then stated that she is proud of the work she’s done throughout her career and has been blessed with a wonderful family. “At the end of the day I’m fine with everything, but to know this was done to me rather that it just being fate was kind of world rocking at the time,” she said.\n\nSorvino elaborated on the downfall of her career in the THR column. “I won an Oscar with Miramax. To not continue and star in their movies much past that doesn't make sense. I felt if I had accepted Harvey's advances, I would have continued to make movies with them, and they were the people winning the Oscars for that decade,” she wrote. “I was not offered any movie roles past 1996. I was still on the fringes of the Miramax family after that, but once Quentin and I broke up, that was it. Radio silence.”\n\nShe told Guthrie, “Right now I’m really excited to be apart of this movement of #MeToo and Time’s Up and I’m working on promoting legislation in California for bills that are among the strongest anti-sexual harassment legislation in the nation.”\n\n“Rape has been with us forever and if we’re at the cusp of this moment where all of this action, all of this legislation, but also this culture changing where we’re working with children, we’re working with high school students, we’re working with men to change the idea of what being a strong man is and how to not do this to people and for women, for boys and girls to know their rights, then all this will have been worth it in some crazy way,” she said. “If culture’s gonna change and less people will be sexually assaulted because of this movement and this outcry among millions across the world, then it was all worth it.”\n\nWatch the full interview below.\n\nJune 6, 1 p.m. Updated with Weinstein lawyer response.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2018/06/mira_sorvino_on_today__screen_shot-h_2018.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/06/mira_sorvino_on_today__screen_shot-h_2018.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/06/mira_sorvino_on_today__screen_shot-h_2018.jpg", "keywords": [], "authors": ["Katherine Schaffstall", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/mira-sorvino-harvey-weinstein-rape-charges-1117655", "title": "Harvey Weinstein Accuser Mira Sorvino Calls Charges a \"Really Good First Step\"", "meta_data": {"viewport": "width=device-width", "description": "\"It’s him finally facing real, real criminal consequences for his criminal behavior and so for that I feel gratified,\" Mira Sorvino said of rape charges against Harvey Weinstein, whom she accused of sexual misconduct, in an interview on NBC's 'Today' show.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/mira-sorvino-harvey-weinstein-rape-charges-1117655", "domain": "https://www.hollywoodreporter.com/", "title": "Harvey Weinstein Accuser Mira Sorvino Calls Charges a \"Really Good First Step\"", "description": "\"It’s him finally facing real, real criminal consequences for his criminal behavior and so for that I feel gratified,\" said Sorvino.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/06/mira_sorvino_on_today__screen_shot-h_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Harvey Weinstein Accuser Mira Sorvino Calls Charges a \"Really Good First Step\"", "description": "\"It’s him finally facing real, real criminal consequences for his criminal behavior and so for that I feel gratified,\" said Sorvino.", "url": "https://www.hollywoodreporter.com/news/mira-sorvino-harvey-weinstein-rape-charges-1117655", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/06/mira_sorvino_on_today__screen_shot-h_2018.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Harvey Weinstein Accuser Mira Sorvino Calls Charges a \"Really Good First Step\"", "sailthru.description": "\"It’s him finally facing real, real criminal consequences for his criminal behavior and so for that I feel gratified,\" said Sorvino.", "sailthru.author": "Katherine Schaffstall", "sailthru.vertical": "Culture", "sailthru.date": "2018-06-06 08:55:52", "sailthru.tags": "Movies,Television,Culture,Harvey Weinstein,Mira Sorvino,nsfs"}, "movies": [], "publish_date": 1528246552.0, "source": "https://www.hollywoodreporter.com", "summary": ""}