{"url": "https://lawandorder.fandom.com/wiki/Noah_Porter-Benson", "text": "Noah Porter-Benson is the biological son of the late Ellie Porter and the late Johnny Drake. His adoptive mother is Olivia Benson. Noah was first played by twins Bradley and Skyler Dubow (mostly by Bradley), then by Jack Nawada-Braunwart and now by Ryan Buggle.\n\nBackground\n\nEllie gave birth to Noah while working for Little Tino, who let her keep the baby as long as she kept working. When she accidentally overdosed, Tino sold Noah to a child pornography producer couple. When Ellie recovered, Tino told her that Noah was dead and she never filed a missing persons report as a result.\n\nOn SVU\n\nNoah was discovered January 22, 2014, by Sergeant Benson and Detective Rollins in the motel room of child pornographers Alexa and Roger Pearson, who were on the run. After a few days of media coverage on all of the children at the Pearsons' house, no one showed up to claim him, and he was called \"Baby Boy Doe\" because no one knew his real name. (SVU: \"Wednesday's Child\")\n\nHe was eventually placed in foster care but suffered from an untreated viral infection in his first foster home. That, coupled with the fact that the foster parents already had two other babies in their care, resulted in him being removed from their custody immediately. (SVU: \"Downloaded Child\")\n\nHe later went through three different foster homes, and at his fourth, the mother filed for a separation and the father had suffered from some sort of relapse. He was removed from their custody and put back into the system. After it was discovered that Baby Boy Doe's mother was named Ellie Porter, they finally learned that his name is Noah. After the truth was revealed to Ellie, she prepared to testify against her pimp and get herself clean so she could regain custody of Noah. Unfortunately, Ellie sneaked out of the group home she was staying at to get high. As she was scoring, she was gang-raped and set on fire. Noah became a Ward of the State again, but Ellie's attorney Trevor Langan appeared to represent Noah's interests in Ellie's memory. Judge Ruth Linden then granted Benson temporary custody of Noah as she worked on finding Ellie's killers. (SVU: \"Spring Awakening\")\n\nHe was seen living with Benson and she hired a nanny named Lucy Huston to help take care of him. He was later targeted as a part of a set of hits connected to his mother's case, but he managed to escape unharmed with Lucy. When all of the people involved in his birth mother's death were caught, Benson returned home and was seen further bonding with Noah. (SVU: \"Girls Disappeared\")\n\nHe continued living with Benson and was shown being taken care of on a daily basis. He was later rushed to the ER for severe respiratory distress. (SVU: \"Producer's Backend\")\n\nIt was discovered that he was suffering from the flu, but the ER doctors discovered old rib fractures and wanted to run some additional tests assuring Benson that they didn't think she was responsible. Noah's case worker Chantal Jackson, however, insinuated Benson was responsible once she was notified and voiced her contempt for leaving Noah in the hospital, even though she had a family friend watching him until she could return to his side. Benson returned to the hospital and hold and kisses Noah after he is better. (SVU: \"Holden's Manifesto\")\n\nBenson and Amaro were later pushing Noah on a swing set while they got information on a case in Chicago. (SVU: \"Chicago Crossover\")\n\nChantal later decided to file a motion for Noah to be removed from Benson's care, despite the case worker's previous negligence in Noah's numerous placements. Noah was being held by Benson as both sides made their cases. In the end, the judge decided to allow Benson to keep Noah, but warned her that she must make the child a priority over her work. (SVU: \"Pattern Seventeen\")\n\nBenson had Noah in her office while she was on the phone with ADA Barba. She later hung up with him to look after Noah. (SVU: \"Agent Provocateur\")\n\nNoah was seen in Benson's apartment as she was getting dressed for an undercover assignment. She left Noah in Lucy's hands yet again. When the assignment was concluded, she returned home and read Noah a story while she let him help turn the pages. Soon after, Benson received a visit from Melinda Warner, who informed her that the sex trafficker they arrested that day was Noah's birth father, Johnny Drake. (SVU: \"Undercover Mother\")\n\nNoah was again seen in Benson's arms as she let Barba in so Benson could discuss Noah's situation. Benson told Barba about Drake's status as Noah's birth father after she got confirmation that he was still imprisoned. At this point, the conversation became hypothetical, and Barba advised her that it was not exculpatory and he never had to know. (SVU: \"December Solstice\")\n\nBenson and Noah were seen at home when Skip Peterson's report on the gang-rape of a girl named Jane aired. (SVU: \"Devastating Story\")\n\nBenson later took Noah to see Dr. Celia Lee for his immunizations. While in the waiting room, they sat next to Gabriel Dole and his mother Colleen and they briefly talked. Lee later discovered that Noah may have been exposed to measles and called Benson over immediately. Lee decided to have Noah quarantined for everyone's safety and Benson took him home. When Lucy noticed he was having a very hard time breathing, Benson rushed Noah to the hospital, where Lee immediately took Noah in to be treated. Noah started showing signs of a severe measles infection and everyone became worried for Noah's health. He later developed a respiratory infection, prompting Lee to start him on antibiotics to fight the infection and later think about conducting a spinal tap. They later decided against it, after which Noah was seen in the ICU recovering, with Benson being able to take him home in a couple of days. (SVU: \"Granting Immunity\")\n\nNoah was later taken by Benson to a Unitarian dedication ceremony, which was attended by Detectives Amaro, Rollins, and Carisi. Noah was officially welcomed into the world and Benson expressed her hope that his life was filled with love, joy, and truth. (SVU: \"Perverted Justice\")\n\nNoah is later dropped off at a daycare facility for the first time and cried when Benson started to leave. Even as she said goodbye lovingly, he continued to cry as she left. (SVU: \"Parents' Nightmare\")\n\nAs Chantal was conducting a home inspection, Noah was tucked in Benson's arm as she and her lawyer, Trevor Langan, informed Chantal of all his developments. After Chantal said she will recommend Benson retain custody of Noah and left, Benson had a change of heart about withholding the name of Noah's father and listed it as Johnny Drake. Drake and his attorney attempted to use this to portray Benson as a cop with a vendetta against the former and later file for custody of Noah. After Drake was killed in a gunfight, Benson went home after visiting Amaro in the hospital, who had been shot by Drake. After a few weeks passed, Benson was officially allowed to adopt Noah and his name was changed to \"Noah Porter-Benson\". Benson and her friends and colleagues celebrated the adoption at her apartment while Benson held Noah in her arms. (SVU: \"Surrendering Noah\")\n\nLucy later took Noah to see Benson at the precinct and Benson said goodbye to the both of them. (SVU: \"Devil's Dissections\")\n\nBenson brought Noah to Rollins' baby shower and introduced him to Rollins' mother Beth (SVU: \"Maternal Instincts\").\n\nBefore Benson and Rollins were called away to investigate the rape of a young model, Noah was shown spending time with Benson, Rollins, Carisi, and Rollins' daughter Jesse on a carousel. (SVU: \"Fashionable Crimes\")\n\nBenson and Ed Tucker walked with Noah in Central Park. (SVU: \"Heartfelt Passages\")\n\nOne day, while Benson was walking Noah to school, she had to answer a call. During this distraction, Noah crossed the road by himself and was almost hit by a passing taxi. Benson grabbed him forcefully, saving him but leaving a bruise. When his teacher spotted the bruise, Noah's school became concerned about it and contacted the police, prompting an investigation into Benson's parenting methods. (SVU: \"Gone Fishin'\")\n\nThe charges against Benson were later dropped, but later on, Noah's grandmother Sheila, who was presumed deceased, was discovered. She met Benson one night at her apartment. (SVU: \"Contrapasso\")\n\nSheila later challenged Benson for custody. (SVU: \"No Good Reason\")\n\nIn court, Sheila brought up her concerns about the recent abuse investigation, which infuriated Benson. Later on, Sheila and Benson met at a cafe, where Benson agreed to let Noah meet Sheila and know that she was his grandmother. (SVU: \"Complicated\")\n\nSheila later babysat Noah one night instead of Benson hiring Lucy, which pleased both Noah and Sheila. (SVU: \"Unintended Consequences\")\n\nWhile taking Noah shopping for clothes, Sheila went to look at some clothes, turning her back on Noah. When she turned around, Noah was gone from the shop and had been kidnapped. (SVU: \"Intent\")\n\nBenson and Sheila searched for Noah, but later, the SVU discovered that Sheila was responsible for Noah's disappearance and that all this time, Sheila had been planning to take him away with her. Benson later found Sheila and Noah in a remote cabin and Sheila was arrested. (SVU: \"Gone Baby Gone\")\n\nNoah and Benson got into a fight one night when Noah didn't want to go to bed and pushed Benson. Benson scolded him and sent him to bed. Later, when Benson told Noah that she still loved him, Noah ignored her. (SVU: \"Man Down\")\n\nNoah and Benson later got into another fight when Noah refused to do his homework on a video chat. Benson told Noah that he was now in the first grade and that he had to do what his teacher gave him, but Noah hung up on her midsentence. (SVU: \"Accredo\")\n\nNoah's bad behavior continued when he refused to eat his dinner. Benson tried to encourage him to eat, by eating an olive and telling him they can have pizza tomorrow night. Noah tried to eat an olive himself, but spat it out and demanded pizza. He banged his fists on the table while demanding pizza, shocking Benson. (SVU: \"Hell's Kitchen\")\n\nAfter Noah played baseball with Peter Stone, Benson got to the root of his behavioral problems: his friend Jeremy asked Noah at school where his father was, and Noah told him his father was in heaven. He then asked Benson if his father ever loved him, and Benson replied that he did, then promised to tell him all about his father. Stone then arrived at Benson's apartment and invited Noah out to another baseball match. (SVU: \"Dear Ben\")\n\nAfter having a drink with rape suspect Rob Miller and picking up Noah from a babysitter, Benson was pulled over by an officer. Noah asked Benson if they were speeding, and Benson denied it. Noah watched anxiously as the officer talked aggressively to Benson. When Benson was asked to step out of the car, Noah became upset, but Benson reassured him and instructed him to stay in the car. Benson later told Dodds that Noah had trouble sleeping and was terrified. (SVU: \"Blackout\")\n\nBenson assisted Noah with his homework one night, helping him spell the word \"believe\". Later on, while having lunch at a cafe with Benson, Noah noticed Miller, who came over and greeted them. Miller introduced himself to Noah, who shook his hand. He then asked Benson if they were friends, and Miller replied that they were. (SVU: \"Assumptions\")\n\nNoah was picked up from school by two officers under the orders of Miller and brought to the SVU precinct. Benson rang Rollins and told her to keep an eye on Noah, telling her that this was Miller's way of saying he could have access to Noah any time he wanted. (SVU: \"End Game\")\n\nNoah eventually quit playing baseball, claiming he didn't like it or want to play it anymore, despite having played with Stone in the past. Instead, he joined a dance class, which he found to be his ideal hobby. (SVU: \"Down Low In Hell's Kitchen\")\n\nNoah attended Billie Rollins' baptism with Benson, Tutuola, and Carisi. (SVU: \"The Burden Of Our Choices\")\n\nNoah and Benson ran into Simon Marsden at the park. Simon said he wished to get to know Noah better, and Benson agreed to meet him for lunch. However, Simon ultimately did not turn up to lunch with Benson and Noah, angering Benson. Eventually, Benson realized this was because Simon had died. (SVU: \"Murdered at a Bad Address\")\n\nNoah informed Benson that he got a part in The Nutcracker and asked her if she wanted to see his solo act. However, Benson got a call from Rollins saying that she was being held captive. (SVU: \"Must Be Held Accountable\")\n\nNoah was riding a scooter with Benson behind him when he spotted a mural that a rape victim had done, saying she was raped and not helped by the police. (SVU: \"She Paints For Vengeance\")\n\nNoah and Benson were at the park when Noah saw a group of kids vaping. He then mentioned that four boys had been suspended from school for vaping in the boys' bathroom at school. Benson instructed Noah not to ever do anything like that. (SVU: \"Eternal Relief From Pain\")", "images": ["https://vignette.wikia.nocookie.net/karlacamilacabello/images/b/b6/Spotlight.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200211045312", "https://vignette.wikia.nocookie.net/hildatheseries/images/0/01/Community-Page-Header.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190914140704", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/5/5a/Kenshin.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200318084702", "https://vignette.wikia.nocookie.net/lawandorder/images/a/af/Noahporterbenson.jpeg/revision/latest/scale-to-width-down/245?cb=20200128050307", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://images.wikia.nocookie.net/__cb14/lawandorder/images/8/89/Wiki-wordmark.png", "https://vignette.wikia.nocookie.net/lawandorder/images/a/af/Noahporterbenson.jpeg/revision/latest?cb=20200128050307"], "top_img": "https://vignette.wikia.nocookie.net/lawandorder/images/a/af/Noahporterbenson.jpeg/revision/latest?cb=20200128050307", "keywords": [], "authors": [], "canonical_link": "https://lawandorder.fandom.com/wiki/Noah_Porter-Benson", "title": "Noah Porter-Benson", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Law and Order,lawandorder,Noah Porter-Benson,Ellie Porter,Johnny Drake,Sheila Porter,Olivia Benson,Simon Marsden,Serena Benson,Bradley Dubow,Jack Nawada-Braunwart,Ryan Buggle,Wednesday's Child", "description": "Noah Porter-Benson is the biological son of the late Ellie Porter and the late Johnny Drake. His adoptive mother is Olivia Benson. Noah was first played by twins Bradley and Skyler Dubow (mostly by Bradley), then by Jack Nawada-Braunwart and now by Ryan Buggle. Ellie gave birth to Noah while...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://lawandorder.fandom.com/wiki/Noah_Porter-Benson", "title": "Noah Porter-Benson | Law and Order | Fandom", "description": "Noah Porter-Benson is the biological son of the late Ellie Porter and the late Johnny Drake. His adoptive mother is Olivia Benson. Noah was first played by twins Bradley and Skyler Dubow (mostly..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Law and Order", "title": "Noah Porter-Benson", "description": "Noah Porter-Benson is the biological son of the late Ellie Porter and the late Johnny Drake. His adoptive mother is Olivia Benson. Noah was first played by twins Bradley and Skyler Dubow (mostly by Bradley), then by Jack Nawada-Braunwart and now by Ryan Buggle. Ellie gave birth to Noah while working for Little Tino, who let her keep the baby as long as she kept working. When she accidentally overdosed, Tino sold Noah to a child pornography producer couple. When Ellie recovered, Tino told her...", "url": "https://lawandorder.fandom.com/wiki/Noah_Porter-Benson", "image": "https://vignette.wikia.nocookie.net/lawandorder/images/a/af/Noahporterbenson.jpeg/revision/latest?cb=20200128050307"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://lawandorder.fandom.com/wiki/Noah_Porter-Benson"}, "movies": [], "publish_date": null, "source": "https://lawandorder.fandom.com", "summary": ""}