{"url": "http://www.wopular.com/jennifer-lawrences-slip-dress-made-lazy-girls-and-more-best-dressed", "text": "Hall of Famers added without ceremony\n\nWhile the Oklahoma Journalism Hall of Fame induction ceremony has been postponed due to COVID-19, the 50th anniversary class officially will become members on Friday. They’ll just have to make do with letters and Hall of Fame pins until the gala, currently rescheduled for October. The 2020 inductees are Clytie Bunyan, Al Eschbach, Rusty Ferguson, Lori Fullbright, Rochelle Hines, Michael McNutt, Michael Sims, Tony Stizza, Scott Thompson and Yvette Walker. Lifetime Achievement Award winners are Bob Blackburn and Robert (Bob) K.\n\nCoronavirus in Oklahoma: Book supports COVID-19 relief for journalists\n\nIn light of the pandemic, the Oklahoma Hall of Fame’s executive committee has decided to donate sales proceeds from “Our Greatest Journalists” to The Coronavirus Storytelling Project, which helps students and journalists affected by the virus. The donations apply only to copies of the book purchased at Edmond’s Best of Books, which is owned by the book’s lead editor, Joe Hight.\n\nIn their own words: CityRep revisits its original 'Oklahoma City Project' with bombing anniversary radio broadcast\n\nBy Brandy McDonnellFeatures writerbmcdonnell@oklahoman.comWhen Ruth Charnay set out to create an original play about the Oklahoma City bombing, she wanted to weave together the stories of survivors, first-responders and journalists using their own words as the main threads. The result was an original theatrical tapestry titled \"The Oklahoma City Project,\" which Oklahoma City Repertory Theatre premiered in 2005 to honor the 10th anniversary of the April 19, 1995, bombing. \"I'm really into making sure that I am telling a true and accurate story, so I like to work in first person.\n\nBeyoncé, Gaga offer hope at all-star event fighting COVID-19\n\nLady Gaga, Stevie Wonder, Lizzo, Shawn Mendes and others sang classic songs brimmed with messages of hope and change during a TV special aimed at fighting the coronavirus\n\nBroadway star Nick Cordero faces leg amputation due to virus\n\nThe wife of Tony Award-nominated actor Nick Cordero, who specialized in playing tough guys on Broadway, says her husband will have to have his right leg amputated after suffering complications from the coronavirus", "images": ["http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_gplus.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_facebook.gif", "http://www.wopular.com/files/wopular_favicon.ico", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_twitter.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/mwb_sidebar_graphic.jpg", "http://www.wopular.com/sites/all/themes/garland/wopular/images/clear.gif", "http://www.wopular.com/files/header_logo.png", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_rss.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/share_email_button.gif"], "top_img": "http://www.wopular.com/files/wopular_favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Jennifer Lawrence's Slip Dress Is Made For Lazy Girls And More Best Dressed", "meta_data": {"description": "Easy does it. Finding a dress for your next formal event can be stressful, but Jennifer Lawrence proves even simple looks can make an impact.", "keywords": "news,headlines,newspapers,news site,news website,aggregated news", "robots": "index,follow", "DC.title": "Jennifer Lawrence's Slip Dress Is Made for Lazy Girls and More Best Dressed", "og": {"title": "Jennifer Lawrence's Slip Dress Is Made for Lazy Girls and More Best Dressed", "site_name": "Wopular"}, "fb": {"admins": 663016824, "app_id": 214168345322701}}, "movies": [], "publish_date": null, "source": "http://www.wopular.com", "summary": ""}