{"url": "https://popculture.com/celebrity/2017/05/16/caroline-manzo-dina-burglary-real-housewives/", "text": "Real Housewives of New Jersey star Caroline Manzo wants justice to be served after her sister, Dina, was brutally beaten during a home invasion this past weekend.\n\nEven though the two had their issues in the past, Dina's sister Caroline has spoken out in support of her sibling.\n\n\"I hope the police get to the bottom of this and whoever is responsible for this gets what's coming to them,\" Caroline said.\n\nDina Manzo, 46, and her millionaire boyfriend, David Cantin, were viciously beaten by two burglars upon entering their Holmdel, New Jersey, townhouse on Saturday. The couple was returning home from a celebration for Teresa Giudice’s daughter, Audriana’s first communion.\n\nThe Holmdel police report says the pair arrived home after the festivities on Saturday night and opened their front door to find two masked individuals inside the house. The robbers then rushed towards the two and struck Cantin with a baseball bat several times. Manzo was punched multiple times.\n\nUp Next: 'Real Housewives of New Jersey' Star Dina Manzo and Boyfriend Dave Cantin Brutally Beaten During Home Robbery\n\nBefore the robbers left Dina's home, they tied her and David up before fleeing with cash and jewelry. The two were able to free themselves and call the police. They were taken to the hospital for treatment with both of them suffering facial injuries.\n\nTwo days after the incident, Chris Laurita, the 47-year-old brother to Dina and Caroline, also addressed the issue.\n\n\"[Dina] is obviously shaken by the whole thing. She's back in California now and seems to be OK,\" he said. \"It's unfortunate what happened. Hopefully they'll get to the bottom of it.\"\n\n\"Dina and David are obviously shaken up from the traumatic and violent home invasion and robbery,\" the attorney representing the couple said in a statement on Monday. \"No one should ever have to go through what they did. They are grateful to law enforcement and the other emergency responders and appreciate everyone's concern and well-wishes.\"\n\nMore: Former 'Real Housewife' Joanna Krupa and Husband Romain Zago Split After Nearly 4 Years of Marriage\n\nAfter receiving word of the incident, Teresa Giudice took to Twitter to ask for prayers for her injured co-star.\n\n\"Please say a prayer tonight for my sister @dinamanzo,\" Giudice wrote.\n\nPlease say a prayer tonight for my sister @dinamanzo 🙏🙏🙏🙏🙏🙏 — Teresa Giudice (@Teresa_Giudice) May 15, 2017\n\nThe police are still investigating the home invasion. Anyone with any information is asked to call Holmdel Township Police (732-946-2820) or the Monmouth County Prosecutor's Office (800-533-7443).\n\n[H/T E! News]", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2017/05/16/caroline-manzo-dina-burglary-real-housewives/", "title": "Caroline Manzo Speaks Out After Sister Dina’s Brutal Burglary, Wants Justice", "meta_data": {"description": "Real Housewives of New Jersey star Caroline Manzo wants justice to be served after her sister, Dina, was brutally beaten during a home invasion this past weekend.Even though the two had their issues in the past, Dina's sister Caroline has spoken out in support of her sibling.'I hope the police [...]", "keywords": "Real Housewives,Crime,Trending", "news_keywords": "Real Housewives,Crime,Trending", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Caroline Manzo Speaks Out After Sister Dina’s Brutal Burglary, Wants Justice", "description": "Real Housewives of New Jersey star Caroline Manzo wants justice to be served after her sister, [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Caroline Manzo Speaks Out After Sister Dina’s Brutal Burglary, Wants Justice", "type": "article", "url": "https://popculture.com/celebrity/2017/05/16/caroline-manzo-dina-burglary-real-housewives/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "Real Housewives of New Jersey star Caroline Manzo wants justice to be served after her sister, [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1494864000.0, "source": "https://popculture.com", "summary": ""}