{"url": "https://en.wikipedia.org/wiki/Gossip_Girl", "text": "2007 American teen drama television series\n\nGossip Girl is an American teen drama television series based on the book series of the same name written by Cecily von Ziegesar. The series, created by Josh Schwartz and Stephanie Savage, originally ran on The CW network for six seasons from September 19, 2007, to December 17, 2012.\n\nNarrated by the omniscient blogger \"Gossip Girl\" (voiced by Kristen Bell), the series revolves around the lives of privileged upper-class adolescents living in Manhattan's Upper East Side (UES). The series begins with the return of Upper East Side teenage \"it girl\" Serena van der Woodsen (Blake Lively) from a mysterious absence. She is reunited with her frenemy Blair Waldorf (Leighton Meester) and her mother Lily (Kelly Rutherford), while she also meets Dan Humphrey (Penn Badgley), an aspiring writer from Brooklyn. Other main characters are played by Chace Crawford, Ed Westwick, Taylor Momsen, Jessica Szohr, Matthew Settle and Kaylee DeFer.\n\nThe success of Gossip Girl led to adaptations outside the United States. The show has received numerous award nominations, winning 18 Teen Choice Awards. The CW officially renewed Gossip Girl for a sixth and final season on May 11, 2012.[1] The final season, consisting of 10 episodes, premiered on October 8, 2012 and ended on December 17, 2012.[2][3]\n\nA sequel series, also titled Gossip Girl, and also headed by original executive producers Schwartz, Savage and Safran, will release in 2020 on the HBO Max streaming service. While set in the same continuity, the series focuses on a new cast of characters from a different perspective in the same setting, likened to that of a shared universe.\n\nCast and characters [ edit ]\n\nMain cast [ edit ]\n\nSelected recurring cast [ edit ]\n\nSeries overview [ edit ]\n\nSeason 1: 2007–2008 [ edit ]\n\nFollowing a mysterious disappearance, Serena Van der Woodsen suddenly returns to the Upper East Side from boarding school to visit her suicidal brother, Eric. Blair Waldorf discovers Serena had slept with her boyfriend, Nate Archibald, the night of her disappearance. Meanwhile, Brooklynite Dan Humphrey and Serena begin dating while Nate struggles with his feelings for Blair. Nate and Blair try to salvage their relationship, driving Blair to lose her virginity to Nate's best friend, Chuck Bass. Jenny Humphrey, Dan's sister, is trying to fit in to the Upper East Side by following around Blair and her friends. Vanessa Abrams, Dan's best friend, returns. It is revealed that Dan had confessed his love for Vanessa in the past, but the two move beyond this as friends. It is discovered that Lily Van der Woodsen, Serena's mother, and Rufus Humphrey, Dan's father, have a romantic past and begin to rekindle their romance but decide to see other people in light of their children's romance. Blair and Nate eventually break up, after finally having sex. Nate discovers Blair's affair, causing a rift with Chuck. Throughout the season, Chuck tries to seduce Blair and the two somewhat come to terms with their feelings for each other. Georgina Sparks, past friend of Serena, returns, pretending to be a woman named Sarah from Portland. Georgina's return reminds Serena of the real reason she left the Upper East Side: she was involved in a drug-related death and felt responsible for the situation. Problems erupt between Dan and Serena, as Serena tries to hide her secret from him. However, the incident is resolved with Serena being absolved of her guilt, and Georgina leaves. Dan and Serena decide to end their relationship. Meanwhile, Lily accepts a marriage proposal from Bart Bass, despite her feelings for Rufus, and the season ends with a Bass wedding and Blair waiting for Chuck at the airport.\n\nSeason 2: 2008–2009 [ edit ]\n\nThe second season mainly explores the senior year of the characters with the premiere at the Hamptons and primarily focused on the relationship between Blair and Chuck, who were labeled \"the heart of GG\" by People magazine.[4] At first, both characters deny their feelings for one another, and go through various schemes and manipulations.\n\nThe first half of the season deals with Serena's growing prominence as a socialite, which draws the attention of Blair as their friendship is tested when the character of Poppy Lifton (Tamara Feldman) arrives, a socialite who inadvertently drives a wedge between Serena and Blair after inspiring Serena to take her place in the spotlight during the early episodes of the season. Serena and Dan get back together for a brief period of time and eventually break up due to complications.[5] Nate faces the aftermath of his father's criminal past and pursues a relationship with Vanessa, who becomes entangled in the world of the Upper East Side. Jenny reignites her rebellious nature by pursuing a career as a fashion designer, thereby challenging Rufus' skills as a parent while Dan's friendship with Nate and relationship with Serena slowly transforms him from a social outcast to an insider. The show finished its first half during the first week of December, with the shocking death of Bart Bass.\n\nThe second half of the season reveals the impact of Bart's death, causing a significant change of character direction for Chuck that subsequently leads to the growth of Rufus and Lily's relationship, the revelation of the two having a son together, and contributing to the decline of Dan and Serena's relationship. John Shea reprised his role as Harold Waldorf during a Thanksgiving episode and becomes entangled in Blair's striving ambition of attending Yale. Desmond Harrington entered the series as Chuck's manipulative uncle, Jack Bass. Feldman returned to the season with Armie Hammer as Serena's new love interest, Gabriel Edwards.[6] Michelle Trachtenberg returned to the role of Georgina Sparks and filmed her scenes during February, also adjoining her character's return to the second season mystery.[7]\n\nA backdoor pilot for a spin-off premiered in May, but was not picked up by The CW, due to the limited number of spots available on their fall line-up.[8]\n\nAs the storylines progressed, the role of \"Gossip Girl\" is slightly decreased. She continues to run her blog, but she keeps the ultimate information for herself, sending it in the final episode as the last blast, where Serena decides to find out who \"Gossip Girl\" really is, but ultimately fails. The season finale ended with a well-received kiss between Blair and Chuck.\n\nSeason 3: 2009–2010 [ edit ]\n\nThe third season focuses on Blair, Dan and Vanessa getting into New York University along with movie star Olivia Burke (Hilary Duff),[9] whom Dan starts dating; Nate getting into Columbia University; Serena taking a year off from school; Jenny becoming Queen Bee at Constance; and Chuck running Bass Industries, along with now adoptive mother Lily van der Woodsen. The first couple of episodes feature part of the summer vacation, respectively the week before the start of University classes and school. The role of \"Gossip Girl\" is slightly decreased throughout the season.\n\nMany guest stars were cast throughout the season including Joanna García as Bree Buckley, a love interest for Nate; America's Next Top Model creator Tyra Banks as Ursula Nyquist, a larger than life actress whom Serena served as a publicist for a short time; William Baldwin as William van der Woodsen, Serena and Eric's father, Lily's ex-husband and Rufus’ long-time rival; and cameos by Lady Gaga, Tory Burch, Jimmy Fallon, Plastiscines, Georgina Chapman and Sonic Youth.[10][11][12]\n\nThe ninth episode of the season caused a significant amount of controversy. Parent groups urged The CW not to air the episode as it contained a threesome. The preview for the episode revolved around an \"OM3\" theme. CW ignored these requests and announced that it was going to air the episode as planned.[13]\n\nRobert John Burke, who played Chuck's father, Bart Bass, returned for A Christmas Carol themed episode in December, while Desmond Harrington returned as Chuck's uncle Jack with a major storyline affecting Chuck and Blair's relationship again and involving Chuck's estranged mother Evelyn Bass Fisher (Laura Harring).[14][15]\n\nThe season focused on Jenny Humphrey's development and downward spiral. She spends a good part of the season alienating herself from Eric, her former best friend, and chasing after Nate, who has his heart set on Serena. At the end of the season, due to her one night stand with Chuck Bass, and new drug dealing habit, Jenny's father and Lily send her to Hudson, New York, to live with her mother. Other story lines include: Blair and Chuck's attempt and ultimate failure at having a successful relationship; Dan and Vanessa moving from friends to something more; and Serena's attempts to find herself through a new job and brief love affairs with Carter, Nate's married cousin Tripp, and eventually Nate himself. The season ends dramatically with Chuck getting robbed and shot.\n\nSeason 4: 2010–2011 [ edit ]\n\nSeason four's main mystery revolves around Juliet Sharp (Katie Cassidy), a secretive girl with an agenda against Serena involving her past. This subplot unravels to reveal that Lily Humphrey, Serena's mother, forged Serena's signature on an affidavit stating that Juliet's brother, Ben, had an intimate relationship with Serena, while Serena was a minor and his student leading to Ben's imprisonment. This relationship was confirmed by Serena to be false. The second half of the season builds on the complications of Serena's new found relationship with her former teacher Colin, Chuck trying to regain control of Bass Industries from Russell Thorpe (Michael Boatman), and Dan and Blair's growing friendship. The season also focuses on Lily's past betrayals coming back to haunt her; Chuck and Blair's tumultuous relationship after their break up; Dan and Vanessa's deteriorating friendship; and the arrival of Serena's cousin Charlie Rhodes (Kaylee DeFer) to the Upper East Side. By the end of the season, Blair has ignored Chuck, Dan has told Vanessa they are no longer friends, and Serena is single.\n\nThe first two episodes of the season took place with Serena, Blair, and Chuck in Paris. While in Paris, Blair meets Prince Louis Grimaldi, to whom she later becomes engaged at the end of the season.\n\nTaylor Momsen, who plays Jenny Humphrey, was absent for the majority of the season but made appearances in \"Easy J\", \"Juliet Doesn't Live Here Anymore\", \"The Witches of Bushwick\", and \"Gaslit\".[16]\n\nSeason 5: 2011–2012 [ edit ]\n\nThe series was renewed by The CW for a fifth season on April 26, 2011.[17]\n\nOn May 9, 2011, it was announced that Taylor Momsen and Jessica Szohr would not be back as series regulars, although both have been invited back as guest stars. Kaylee DeFer, who portrays Ivy Dickens, was promoted to series regular status for season 5.[18]\n\nThe season began in Los Angeles when a re-energized Chuck and Nate decided to pay Serena a visit. Chuck has a newfound philosophy and says \"yes\" to everything, even death defying stunts. Serena continues to work on the movie set, and is offered a full-time job at the end of the episode. Nate begins an affair with an older woman, Diana Payne, who may have an ulterior motive for being with Nate. Back in New York, Dan learns that Vanessa has published one chapter of his novel, and Blair continues to plan her wedding to Louis, and she also learns she is pregnant. After realizing she still had feelings for Chuck, Blair and Chuck decide to go away together, but their car crashes. As a result of the crash Blair loses her baby, Chuck nearly dies, and Blair eventually marries Louis. The season also focuses on Nate running an online gossip site NYSpectator, Blair and Dan's friendship turning into a relationship, Chuck's quest to find his real parents which leads him to discover that his father, Bart, is still alive, and the effects of CeCe's death on Lily and her marriage to Rufus. At the end of the season, Blair makes a choice between Dan and Chuck, and Lily makes a choice between Rufus and Bart. Serena is seen leaving town while Dan decides to write a new book about the Upper East Side, with the help of Georgina.\n\nSeason 6: 2012 [ edit ]\n\nOn May 11, 2012, it was announced Gossip Girl would return for a shortened sixth and final season, which premiered on October 8, 2012.[1][19] During the CW upfronts, network president Mark Pedowitz said the number of episodes had not yet been decided and could consist of 10 episodes with a retrospective, meaning it would end before Christmas.[20]\n\nThe season premiered with 0.78 million viewers tuning in, marking a series low for the show. The following week, there was a further drop in viewership, with only 0.76 million viewers, once again breaking the record for series-low ratings.\n\nOn October 29, 2012, the episode \"Portrait of a Lady Alexander\" was postponed due to the impact of Hurricane Sandy on the Eastern Seaboard. Widespread power outages led to the decision of pushing the new episode back a week and re-airing the previous episode, \"Dirty Rotten Scandal\".[21]\n\nOn December 17, 2012, the series broadcast its finale on U.S. television on the CW network. Actress Kristen Bell, the narrator of the series throughout its run, makes a cameo as herself (but is not revealed as Gossip Girl). Several former Gossip Girl cast members appear in the finale, including Jessica Szohr, who played Vanessa Abrams, and Katie Cassidy, who played Juliet Sharp. Former series regulars Connor Paolo (Eric van der Woodsen) and Taylor Momsen (Jenny Humphrey) each appear also, with one line apiece.\n\nSeason 6 begins with Chuck and Blair who part ways after making a pact that they will unite once they both achieve their individual goals. Chuck goes on his way to try to regain Bass Industries from his father who stole it from him, while Blair tries to find herself and her individuality by taking over her mother's company at her mother's request. Serena pursues a relationship with someone older and who happens to have a 17-year-old daughter, Sage, who will do anything to try to split them up. Nate focuses on trying to get the NYSpectator to become successful and dates Sage. Meanwhile, Dan focuses on completing his second book with Georgina's help. In the end after a surprising turn of events Blair Waldorf (Leighton Meester) and Chuck Bass (Ed Westwick) get married.[22] In the final moments, the series speeds forward five years later where Chuck and Blair are revealed to have had a child and Nate Archibald appears successful and is rumored to be running for mayor of New York. The show ends with the wedding of Serena van der Woodsen and Dan Humphrey, a small ceremony in what looks like Blair and Chuck's home together, where Lily is with Serena and Eric's father, William, while Rufus seems to be happy with another woman (musician Lisa Loeb, who guest-starred in the first season) along with Dorota, Nate, Jack Bass and Georgina (who are now together), and Jenny and Eric. A brief shot of the NYSpectator reveals that Lola Rhodes and Olivia Burke are now starring in a film about Ivy Dickens, based on her best-selling autobiography.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe Gossip Girl book series was originally supposed to be adapted into a film starring Lindsay Lohan with head Gilmore Girls creator Amy Sherman-Palladino.[23] When the film project did not get off the ground, Stephanie Savage and Josh Schwartz took over the project to create a television series. As of October 2006, Schwartz was working on the pilot. He said, \"I was very skeptical. I don't want to do The O.C. NYC. But I thought the books were smart. The characters are worldly in a way that Orange County kids aren't.\"[24] The characteristics for each character in the pilot were based on the first Gossip Girl book.[25] In January 2007, the show was given the green light by The CW.[26]\n\nProduction team [ edit ]\n\nThe O.C. creator Josh Schwartz and fellow writer Stephanie Savage served as the show's executive producers throughout the series' run, followed by Bob Levy and Leslie Morgenstein of Alloy Entertainment, who were assigned in aiding the adaptation of the novels into the series.[26] Following the success of Gossip Girl, Gilmore Girls co-producer, John Stephens was approached by Schwartz and Savage, having previously worked with him on The O.C., and hired him as an executive producer.[27] Joshua Safran, who started as a writer/consulting producer before becoming co-executive producer, was later added as an executive producer. On April 24, 2012, it was announced that he would leave the show at the end of the fifth season to be the new showrunner of NBC's now-cancelled musical series Smash.[28] To fill in Safran's void, co-executive producer Sara Goodman was promoted to executive producer for the sixth season.[29] Alexandra Patsavas who worked with Schwartz on The O.C. was in charge of the music.[30] Eric Daman was at the head of the costume department; he previously had assisted Patricia Field on Sex and the City.[31]\n\nCasting [ edit ]\n\nVeronica Mars was canceled, the following season of pilots for The CW had been announced, and one was Gossip Girl. I read it, and I knew I was sort of old to play any of the kids. I called Veronica Mars, can I narrate this show? And she said, 'Hey, that's a very good idea.' They knew I had a younger voice, they liked me and they knew I'd show up for work, and I guess that was all I really needed. It was so clear to me how sassy and catty she needed to be. Whenwas canceled, the following season of pilots for The CW had been announced, and one was. I read it, and I knew I was sort of old to play any of the kids. I called Dawn Ostroff -- who was the head of The CW at the time -- and said, 'Hey, I did so much narration on, can I narrate this show? And she said, 'Hey, that's a very good idea.' They knew I had a younger voice, they liked me and they knew I'd show up for work, and I guess that was all I really needed. It was so clear to me how sassy and catty she needed to be. — Kristen Bell on how she landed the narration spot of the show[32]\n\nFeaturing nine regular speaking roles, the majority of the ensemble cast was assembled from February to April 2007. Leighton Meester and Blake Lively–who started auditioning in December 2006[33]–were the first two actresses to be chosen in February for the lead roles of Blair Waldorf and Serena van der Woodsen, respectively.[34] Penn Badgley, who had previously worked with Stephanie Savage on The Mountain,[33] Taylor Momsen, Chace Crawford, Kelly Rutherford, and Connor Paolo also auditioned successfully and landed roles in the series in March, as did Florencia Lozano who appeared only in the pilot, and was later replaced by Margaret Colin.[35][36][37] Badgley at first turned down the part of Dan,[38] as did Lively—who planned to attend college—for the role of Serena.[39] Actors for the roles of Chuck Bass and Rufus Humphrey were found in April when English actor Ed Westwick, and Matthew Settle were cast.[40] Westwick first read for the role of Nate but was then asked to try Chuck.[33] As rumors swirled about the impending cancellation of Veronica Mars, it was revealed at The CW's 2007 Upfronts on May 17, 2007, that Kristen Bell had narrated the pilot, thus making her the title character of another show on the network.[41] Jessica Szohr was signed on to portray the recurring role of Vanessa Abrams and received regular status during the fourteenth episode of the first season.[42][43] Kaylee DeFer joined the series in the eighteenth episode of the fourth season and was promoted to series regular for the show's fifth season.[44]\n\nAt the conclusion of the fourth season, Momsen, who went on an indefinite hiatus during the season while retaining regular billing,[45][46] and Jessica Szohr both left the show.[47] Throughout the series' run, Connor Paolo consistently declined to elevate his recurring role of Eric van der Woodsen to regular status, citing personal reasons for his decision.[48] After becoming a regular on the ABC series Revenge, Paolo confirmed his departure from Gossip Girl in August 2011.[49]\n\nAs the show progressed, numerous recurring guest stars appeared in the show. Michelle Trachtenberg signed on to portray Georgina Sparks.[50] The role had previously been offered to Mischa Barton who declined the role.[50] Francie Swift and Sam Robards took the parental roles of Anne and Howard Archibald, respectively.[51][52] Caroline Lagerfelt portrayed Celia \"CeCe\" Rhodes, Serena and Eric's grandmother and Lily's mother.[53] Sebastian Stan made several appearances as Carter Baizen throughout the show's first three seasons.[54]\n\nFilming locations [ edit ]\n\nPrimarily filming in New York, Gossip Girl has been declared by New York Magazine as the \"Most Restauranty Show Since Sex and the City\", citing the pilot episode filming locales such as the Japanese restaurant, Geisha, the Campbell Apartment where Nate and Serena were filmed having sex and the New York Palace Hotel bar Gilt.[55] Other New York City landmarks and well-known establishments were filmed throughout the first season. Victor/Victrola filmed the fictional infamous Chuck Bass burlesque club, Victrola, at The Box Manhattan, a sister club to The Box Soho in London.[56] The fictional Constance Billard-St.Judes School, based on novel writer Cecil Von Ziegesar's alma mater, Nightingale-Bamford used external shots of the Museum of the City of New York.[57]\n\nThe second season premiered at the Hamptons and began filming in mid-June. The season premiere opening montage showed a scene at Cooper's Beach that was instead filmed in Rockaway Beach followed by an elaborate white party.[58][59] For the sixth episode of the season, Columbia University was used to film the Yale campus, an episode that followed disappointment from Yale fans due to its erroneous portrayal of the admissions process and reliance on Ivy League university stereotypes.[60] During the season's seventh episode, the Brooklyn Inn was integrated into the show.[61] Remaining true to its New York locations, the show filmed at the Russian Tea Room.[62][63]\n\nThe fourth season premiered on September 13, 2010, with the first two episodes filmed in Paris.[64][65] New York Magazine revealed several locations shot at the French University, La Sorbonne in the Latin District (or Quartier Latin) of Paris on July 5.[66][67] Other locations include the Musée d'Orsay, the Eiffel Tower, the Gare du Nord, Avenue Montaigne.[68] and Saint-Germain-des-Prés. Columbia University became the primary filming location for the first few episodes of the season following the Paris story arc.[69]\n\nThe fifth season premiered on September 26, 2011, with the first two episodes filmed in Los Angeles, California.[70]\n\nBecause of its location in New York, executive producer Stephanie Savage said, \"We were quickly told it would be too expensive, too complicated\" at the beginning of the series. She said that it had been proposed to shoot in a Los Angeles studio that would recreate Central Park, but they eventually filmed the series in New York.[71] Savage explained their choice to film there, \"There's no New York City on TV, or there wasn't when we started making the pilot, except what you could see in the background behind the dead bodies on cop shows. We've never seen the city from the point of view of teenagers. It felt like a world with high stakes for young people.\" Schwartz added, \"What's funny about these teenagers is they grew up watching Sex and the City, even though it wasn't about them. And I think they've probably incorporated that into how they mythologize New York. I fought really hard to shoot the show in New York because we want New York to be a character in the show.\"[72] Many scenes were filmed in the Empire Hotel on the Upper West Side.[73]\n\nEpisode format [ edit ]\n\nEach episode begins with the home page of the Gossip Girl website and Serena's picture from the pilot episode. Afterward, a recap of events relevant to the upcoming narrative is shown, which ends again with the home page of the website, only this time with a picture from other character(s) with a text about a recent event connected with the picture.\n\nThe narrator is Gossip Girl, voiced by actress Kristen Bell. She begins the recap with the sentence, \"Gossip Girl here, your one and only source into the scandalous lives of Manhattan's elite,\" and ends the recap with whispered voices saying \"Where has she been?\" and \"Serena.\" Then, the voice of Gossip Girl says, \"And who am I? That's one secret I'll never tell! You know you love me… XOXO, Gossip Girl.\"\n\nDuring each episode, there is always a social event taking place, whether small or large. Joshua Safran explained, \"We structure it [the show] so that every week, the episode leads to an event. I feel like it is much like a procedural.\"[25]\n\nEpisode titles [ edit ]\n\nAll of the episodes' titles are based on the name of a film or a novel.[74] For example, episode \"The Wild Brunch\" evokes western film The Wild Bunch and \"Seventeen Candles\" Sixteen Candles.[74] Episode \"All About My Brother\" refers to Pedro Almodóvar's All About My Mother while \"Pret-a-Poor-J\" came from Prêt-à-Porter.[74] \"There Might Be Blood\" took its title from 2007 film There Will Be Blood.[74] \"The Serena Also Rises\" was titled after novel The Sun Also Rises. The fifth-season episode \"The Big Sleep No More\" was named for the film The Big Sleep and the New York-based production Sleep No More. Episode \"Easy J\" was titled after Emma Stone's hit movie Easy A. Episode \"The Age of Dissonance\", which was titled after Edith Wharton's novel The Age of Innocence, saw a high school production of the novel taking place,[74] and \"The Blair Bitch Project\" was named after The Blair Witch Project. \"Victor, Victrola\" is named after the British-American musical comedy Victor/Victoria. \"Bad News Blair\" was named after the 1976 movie The Bad News Bears.\n\nJoshua Safran said, \"we draw from classic works like Les Liaisons Dangereuses and The Great Gatsby as much as we do from pop culture.\"[25]\n\nProduct placement [ edit ]\n\n\"It was really about showing features on a device. We usually do about between six and eight scenes in a season of 'Gossip Girl' -- you can't get that in many shows -- where the characters are using their devices. Initially, it was just a wireless phone, but eventually that became a smartphone, a tablet, all these other types of technology that took them through their day and showed how they used it to get from one place to the next.\" — Barbra Robin, Senior Vice President, Integrated Marketing[75]\n\nGossip Girl is known for its product placement. The show had a contract with Verizon Wireless for its first five seasons; all the characters were seen with phones chosen by the brand until the deal ended by the sixth season.[76] During their contract, Verizon Wireless offered exclusive Gossip Girl content and created a website where ringtones of the songs featured on the show could be downloaded.[77] In the summer of 2008, executives of VitaminWater approached The CW for a placement deal. During the second season, the drinks were mentioned several times in dialogues. The partnership helped pay the costs of shooting on location in the Hamptons.[78] An HP TouchPad was prominently displayed in an episode of the sixth season.[79] According to OneNewsNow.com, other sponsors have included Procter & Gamble, L'Oreal, Target and Johnson & Johnson, which allowed the series to earn $28.2 million in ad dollars in 2007.[80]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nGossip Girl poster featuring critical review poster featuring critical review\n\nGossip Girl initially received positive reviews. Due to the show's pedigree as an adaptation of The New York Times bestselling novel series, the show was considered to be one of the more anticipated new shows of the 2007–2008 television season. An August 2007 survey by OTX, a global media research and consulting firm, placed the show on the list of top ten new shows that viewers were aware of.[81] Though the pilot was the recipient of many positive reviews from publications such as Variety, The Washington Post, San Francisco Chronicle and the Boston Globe, other reviewers described it as a guilty pleasure rather than an hour's worth of must-watch television.[82][83][84][85] Metacritic gave it a score of 59, based on the reviews of 40 different publications.[86]\n\nToward the conclusion of the first season, Janet Malcolm of The New Yorker criticized the show for its deviations from the novels. She has stated that the series was \"related to the original only in the names and outlines of the characters\". She further asserted that, \"Without von Ziegesar's fast, mocking commentary to propel them, the TV episodes are sluggish and crass—a move from Barneys to Kmart.\"[87] However, author Cecily von Ziegesar has expressed support for the show, noting that all of her major plot points were present in the pilot.[88]\n\nAs the show continued its first season, the response became considerably more positive, and by the second season critical response was favorable. Metacritic gave the new season an improved score of 71. \"Summer's been good to this girl,\" claimed Entertainment Weekly, who awarded the series its highest grade of \"A\".[89] The New York Daily News claimed the show had found its footing by stating \"It knows exactly what it wants and needs its new hybrid product to be. The hockey fights video of teen romance drama.\" Gossip Girl was designated the \"Greatest Teen Drama of All Time\" by New York magazine.[90] The magazine wrote, \"the show has resurrected the potential for scripted dramas to be effective social satire—to present a world more accurately than a \"reality\" program can. Gossip Girl presents a wealth-eye view of the city, but because it is a cartoon we can laugh along with the conspicuousness of the consumption.\"[91]\n\nThe Parents Television Council has shown particular criticism of the series, especially with its \"OMFG\" ad campaign from April 2008.[92] It also named the episode \"Victor/Victrola\" the worst television program of the week in which the episode originally was broadcast.[93] Quotes from the Parents Television Council review, as well as negative quotes from the San Diego Union-Tribune, New York Post and the Boston Herald, were used on various advertisements for the second season. The Hartford Courant chronicled a variety of negative responses to the ads. The ads included quotes like \"Every Parent's Nightmare\", \"Mind-Blowingly Inappropriate\" and \"A Nasty Piece of Work\" in what appears to be an effort to continue the 'rebellious teen' style of the show.[94][95]\n\nWith the approach of the fifth season, New York Magazine reviewed the life expectancy of the show, noting its waning cultural relevancy despite the growing prominence of its actors, and the loss of its status as The CW's No.1 show, having been beaten out in terms of ratings by other shows of the network like Supernatural and 90210. \"The series itself hasn't quite kept up, even if its plotting is as juicy and lunatic as ever.\" and that \"The cast would all rather be making movies, while the showrunners are focusing on launching new projects via their nascent Fake Empire production company (including CW newcomer Hart of Dixie). Barring an unexpected brand reboot or another stab at a spinoff, we're afraid the end is near. XOXO.\"[96] AOL TV ranked Gossip Girl the 20th Best School Show of All Time and the 4th TV's Biggest Guilty Pleasure.[97][98] The show was declared the tenth highest rated show for the first ten years of IMDb.com Pro (2002-2012).[99]\n\nThere was much controversy around Dan being revealed as Gossip Girl in the season finale. Dan had always struggled to be an insider among the Upper East Side and had supposedly created Gossip Girl to gain more power and had been the one \"pulling the strings the whole time\" as mentioned by Serena in the finale. However, there was much speculation and controversy regarding this decision. Penn Badgley, who played Dan, stated in an interview that he himself found it funny that they had decided to make him be Gossip Girl as there were too many loopholes in the show for this to make sense. There were times during the show where he would be alone and read a Gossip Girl post and be completely blown away by it.\n\nCultural influence [ edit ]\n\n[Schwartz and Savage] were spearheading: \"What if the Internet is just a place to judge people? What if that’s what it turns into?\" And they turned out to be Nostradamus. — Kristen Bell on Gossip Girl depicting social media's influence[39]\n\nCW executive Dawn Ostroff later compared Gossip Girl's role as the show that defined its network to House of Cards for Netflix. Its television audience was never very large, but the show was influential on culture; Savage recalled that the crew likened working on it to working for a lifestyle magazine. A hairstylist for the show compared media interest in Lively's hair to that for Jennifer Aniston's \"The Rachel\".[39] In 2008, The New York Times reported the show has had a profound impact on retail, saying Gossip Girl is probably \"the first [show] to have been conceived, in part, as a fashion marketing vehicle\". While it has had middling success in terms of ratings, it \"may well be the biggest influence in the youth culture market\", said a trendspotter.[100] However, for Maheen Humayun of The Tempest, the show emphasized toxic cultural traits, like rape culture, that \"messed up a whole generation.\"[101] According to Zoe Fox of Mashable, the show popularized social media networks and mobile communication, becoming \"a pioneer in its use of mobile\".[102] In 2008, New York Magazine named the series as \"Best Show Ever\".[90] In 2009, Rolling Stone named the series as \"TV's Hottest Show\".[103]\n\nOn January 26, 2012, in honor of the series' 100th episode, New York City Mayor Michael Bloomberg visited the set and proclaimed the date Gossip Girl Day, citing the show's cultural influence and impact on the economy of the city. \"Gossip Girl has made New York a central character. While Gossip Girl is drawing fans in with its plot twists, the show also attracts many of them to visit New York, contributing to our incredible 50.5 million visitors last year. In fact, the economic impact of Gossip Girl and other television shows and films that are made in New York really can be felt directly in all five boroughs. The 100th episode of Gossip Girl is a real landmark, and I want to congratulate the show's cast and crew,\" he stated.[104]\n\nThe popularity of the series was also indirectly responsible for the creation of the reality series NYC Prep, which ran for one season on Bravo.[105][106] The series has been referenced in films such as Fired Up!, Get Him To The Greek, Vampires Suck, Easy A, Just Go With It and Horrible Bosses, and TV series such as Royal Pains, Entourage, Parks and Recreation, Skam, 30 Rock, Skins, and Shameless, among others.[107]\n\nPopular among teenagers and young adults, the Gossip Girl cast has posed on the cover of numerous mainstream magazines, including Rolling Stone, People, Nylon, New York Magazine, TV Guide, New York Post, Vogue, Out Magazine, Details, and Entertainment Weekly.\n\nAwards and accolades [ edit ]\n\nU.S. television ratings [ edit ]\n\nThe series premiere was watched by 3.50 million viewers and achieved a 1.6 Adults 18–49, coming in last place in its 9:00 pm timeslot on Wednesday nights.[128] However, the show was noted to have held the best audience retention of America's Next Top Model.[129] Benefiting from the network rerunning the show during the 2008 WGA strike,[39] the season ended with 3.00 million viewers.[130] The second season premiered with 3.43 million viewers.[131] The second season ended with 2.23 million viewers.[132] The third season premiered with 2.55 million viewers.[133] The third season ended with 1.96 million viewers.[134] The fourth season premiered to 1.83 million viewers and a 1.0 for adults 18–49.[135] Episode 4.04 hit season highs in all categories with a 2.8 rating in The CW's target of Women 18–34, a 1.7 in Adults 18–34 and 1.1 in Adults 18–49.[136] The fourth season ended with 1.36 million viewers.[137] The fifth season premiered with 1.37 million viewers.[138] The fifth season ended with 1.44 million viewers.[139]\n\nDespite this, throughout season five, Gossip Girl continued to see a decrease in viewers. Season six premiered to 0.78 million viewers, making it not only the least viewed season premiere for the series, but also the least viewed episode in show's six-year run. The following episode saw a decrease to 0.76 million viewers, which once again marked a new series low in terms of viewers. The series finale was watched by 1.55 million viewers, the highest viewed episode since season four.\n\nSeason Timeslot Season premiere Season finale TV season Rank U.S. viewers\n\n(in millions) Rating\n\n(adults 18–49) 1 Wednesday 9/8c\n\nMonday 8/7c September 19, 2007 May 19, 2008 2007–08 #196[140] 2.35[140] 1.2[141] 2 Monday 8/7c September 1, 2008 May 18, 2009 2008–09 #168[142] 2.48[142] 1.4[141] 3 Monday 9/8c September 14, 2009 May 17, 2010 2009–10 #135[143] 2.02[143] 1.1[143] 4 September 13, 2010 May 16, 2011 2010–11 #139[144] 1.64[145] 0.8[146] 5 Monday 8/7c September 26, 2011 May 14, 2012 2011–12 #188[147] 1.18[148] 0.6[148] 6 Monday 9/8c October 8, 2012 December 17, 2012 2012–13 #140[149] 0.90[150] 0.5[150]\n\nDVR ratings [ edit ]\n\n2007\n\n2008 [2]\n\n2009\n\n2010 [3]\n\n2011 [4]\n\nOnline ratings [ edit ]\n\nThe series was the 5th most-binged TV series on Subscription Video-on-Demand (SVOD) Services; derived from NPD's VideoWatch Digital, consumer tracker based on data from 313,866 SVOD TV transactions across 26,176 SVOD subscribers that were completed between January 2012 and January 2013.[151]\n\nDistribution [ edit ]\n\nGossip Girl aired on The CW on Mondays.[152] In addition to the television broadcast of the show, episodes of Gossip Girl have also been released on the Internet. In October 2011, The CW signed a deal allowing all Gossip Girl episodes to be streamed on Netflix.[153] The same month, the network signed a deal with Hulu. Both CWTV.com and Hulu streamed episodes for free, but only the five most recent installments were available for viewing.[154] All seasons of Gossip Girl are also available through the iTunes Store and Amazon Video where each episode can be purchased separately or in complete season sets.\n\nAs of 2012, the series was broadcast in 197 countries.[33]\n\nSyndication [ edit ]\n\nOn July 25, 2012, Style Network announced that it had acquired the off-network rights to Gossip Girl and started airing repeats of the show on August 15, 2012.[155]\n\nMerchandise [ edit ]\n\nHome media [ edit ]\n\nThe DVD sets of each season were released in various regions after their television broadcast.\n\nDVD Name Release dates Technical details Bonus Features Region\n\n1 Region\n\n2 Region\n\n3 Region\n\n4 The Complete First Season August 19, 2008 August 18, 2008 October 22, 2008 April 15, 2009 5-Disc Set\n\nAspect ratio: 1.78:1\n\nLanguage: English\n\nSubtitles: Chinese, English, French, Korean, Portuguese, Spanish, Thai\n\nRunning time: 810 minutes Unaired Scenes\n\nThe Beginning, XOXO: Concept to Execution Featurette\n\nGossip Girl Couture Featurette;\n\nCouture Featurette; A Gossip Girl Wedding Featurette\n\nWedding Featurette LOL: Gag Reel\n\nThe Pierces \"Secret\" and \"Boring\" Music Videos\n\nDownloadable Audiobook of the Original Best-selling Novel, read by Christina Ricci. The Complete Second Season August 18, 2009 September 28, 2009 October 2, 2009 October 28, 2009 7-Disc Set\n\nAspect ratio (image): 1.78:1\n\nLanguage: English\n\nSubtitles: English, French, Spanish, Chinese, Thai\n\nRunning time: 810 minutes 5th Ave. Meets Gossip Girl : Tour the Gossip Girl Crowd's Favorite Haunts\n\n: Tour the Crowd's Favorite Haunts Faces Behind the Design: Creative Forces Behind the Show's Art and Fashion\n\nChasing Dorota Webisodes\n\nWebisodes Gag Reel\n\nDownloadable Audiobook of the Best-selling Novel Gossip Girl, You Know You Love Me by Cecily von Ziegesar, read by Christina Ricci; *Unaired Scenes The Complete Third Season August 24, 2010 August 23, 2010 October 2, 2010 September 1, 2010 5-Disc Set\n\nAspect ratio: 1.78:1\n\nLanguage: English\n\nSubtitles: English, French, Spanish\n\nRunning time: 935 minutes Gossip Girl Mode: Interactive Viewing Experience on Episode 16, \"The Empire Strikes Jack\"\n\nMode: Interactive Viewing Experience on Episode 16, \"The Empire Strikes Jack\" A Gossip Girl Fabulous Affair: Throwing a Party Gossip Girl-Style\n\nFabulous Affair: Throwing a Party Gossip Girl-Style Lady Gaga \"Bad Romance\" and Plastiscines \"Bitch\" Music Videos\n\nGag Reel\n\nUnaired Scenes The Complete Fourth Season August 23, 2011 August 15, 2011 September 2011 September 7, 2011 5-Disc Set\n\nAspect ratio: 1.77:1\n\nLanguage: English\n\nSubtitles: Chinese, French, Portuguese, Spanish\n\nRunning time: 935 minutes Bisoux a Paris!: Go Abroad on a Spree in Paris with the Cast and Creative Teams\n\nExposing Gossip Girl : The Making of Episode 18: The Complete Lowdown on the Creative Processes Behind \"The Kids Stay in the Picture\"\n\n: The Making of Episode 18: The Complete Lowdown on the Creative Processes Behind \"The Kids Stay in the Picture\" Gag Reel\n\nUnaired Scenes The Complete Fifth Season September 25, 2012 September 3, 2012 October 12, 2012 September 12, 2012 5-Disc Set\n\nAspect ratio: 1.77:1\n\nLanguage: English\n\nSubtitles: Chinese, French, Portuguese, Spanish\n\nRunning time: 1032 minutes 5 Years of Iconic Style\n\nGossip Girl Turns 100\n\nGag Reel\n\nUnaired Scenes The Complete Sixth and Final Season[156] February 12, 2013 February 18, 2013 July 19, 2013 February 27, 2013 3-Disc Set\n\nAspect ratio: 1.77:1\n\nLanguage: English\n\nSubtitles: Spanish, French, Korean\n\nRunning time: 430 minutes \"A Big Farewell and XOXO to the Upper East Siders\" Featurette\n\nGossip Girl Prequel: It Had To Be You (Audiobook)\n\nGag Reel\n\nUnaired Scenes The Complete Series[156] February 12, 2013 February 18, 2013 July 19, 2013 TBA 121 Episodes\n\n30-Disc Set\n\nAspect ratio: 1.77:1\n\nLanguage: English\n\nSubtitles: Spanish, French, Korean, Chinese, Portuguese Same Bonus Features as the Individual Season Sets\n\nNotes:\n\nIn Australia there is alternative cover art for Season 1. There are also three different versions of Season 2 (the standard edition, a special 8-disc edition, and an alternative cover art—which is the same cover art used for Season 2, Part 2 in the UK).\n\nSeason 2 was first released in two parts in Region 2. Part One was released on April 13, 2009, and Part Two was released on August 10, 2009, while the complete season was released later, on September 28, 2009.\n\nSoundtrack [ edit ]\n\nThe first soundtrack of the TV series, OMFGG – Original Music Featured On Gossip Girl, No. 1 was released digitally on September 2, 2008, and in stores on October 28, 2008.[157]\n\nFashion [ edit ]\n\nMerchants, designers and trend consultants say that \"Gossip Girl\" ... is one of the biggest influences on how young women spend. Fans stride into boutiques bearing magazine tear sheets that feature members of the cast and ask for their exact outfits. Or they order scoop-neck tops and hobo bags by following e-commerce links from the show’s Web site. The New York Times, 2008[100]\n\nGossip Girl was very influential on fashion for teenage and young adult women. The show was intended in part as a way for fashion companies to market their products. Some brands paid a fee, and the show's Web site provided referral links so viewers could purchase items they saw on television.[100] In 2009, Anna Sui created a line inspired by Gossip Girl.[158] Daman, who based his costumes on what Manhattan private-school students wore,[100], said that by the sixth season the show was \"getting one-of-a-kind couture from Paris\", because \"they wanted their wares on Blake Lively\".[159]\n\nOn September 16, 2011, it was announced that Warner Bros. and label Romeo & Juliet Couture had partnered to create Gossip Girl's official clothing line inspired by lead characters Serena van der Woodsen and Blair Waldorf.[160] The launch of the fashion line took place on September 26, 2011, the same day as the premiere of the fifth season.[161]\n\nCosmetics online retailer Birchbox and Gossip Girl have teamed up to create a special Birchbox edition filled with beauty products inspired by the show. The products were chosen by Gossip Girl's makeup department head, Amy Tagliamonti, and hair department head, Jennifer Johnson.[162]\n\nInternational adaptations [ edit ]\n\nGossip Girl spawned several adaptations in other countries. The Turkish version is known as Küçük Sırlar (Little Secrets).[163] On March 5, 2012, it was reported that Warner Bros. International Television and Metan Development Group would produce a Chinese teen drama series called China Girl inspired by Gossip Girl. Production was set to start in June 2012 with the show airing in November. The show will follow the lives of students at a university instead of a high school.[164] No news of the actual broadcast followed.\n\nA Mexican version of the series was produced by Mexican producer Pedro Torres as Gossip Girl: Acapulco.[165] The show stars Sofía Sisniega, Oka Giner, Jon Ecker, Vadhir Derbez, Diego Amozurrutia, and Macarena Achaga.[166] Filming of the Mexican adaptation began in January 2013 and the series aired in July 5, 2013, on Televisa.[167][168] The show also aired in the United States on Univision in 2014.[169] It was not renewed for a second season.\n\nAnother version of Gossip Girl aired in Thailand on Channel 3 beginning July 16, 2015, dubbed as Gossip Girl: Thailand.[170]\n\nAn Indonesian adaptation of the show has been announced during the launch of GoPlay, a video-on-demand service by the country's popular ridesharing app, Gojek, with Nia Dinata as its showrunner, set to premiere on the platform in 2020.[171]\n\nSequel [ edit ]\n\nA sequel to the series is scheduled to be released on WarnerMedia's upcoming streaming service HBO Max.[172] The new series has received a 10-episode order and picks up eight years after the original Gossip Girl site went dark, as a new generation of private school teens are introduced to the watchful eye of Gossip Girl.[173] Josh Schwartz confirmed the new series will be a continuation rather than a reboot.[174] Leighton Meester, the actress who played Blair Waldorf, confirmed on Good Morning America that she would not be a part of the sequel. When asked, Meester answered, \"I was not asked to be on it, so no.\"[175] Chace Crawford also confirmed that he had not been asked to be a part of the sequel; however, he noted he would be open to making an appearance.[176] In November 2019, it was announced Kristen Bell would be returning as the voice of Gossip Girl in the new series.[177]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Gossip_Girl_title_card.jpg/250px-Gossip_Girl_title_card.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/8c/Gossip_Girl_title_card.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Gossip_Girl_filming_in_Paris%2C_France%2C_30_December_2011.jpg/250px-Gossip_Girl_filming_in_Paris%2C_France%2C_30_December_2011.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c9/Gossip_inappropriate.jpg/180px-Gossip_inappropriate.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Gossip_Girl_title_card.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gossip_Girl", "title": "Gossip Girl", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Gossip_Girl_title_card.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}