{"url": "https://en.wikipedia.org/wiki/Becky_G", "text": "American singer, songwriter and actress\n\nRebbeca Marie Gomez[1][2] (born March 2, 1997),[2] also known as Becky G, is an American singer, songwriter and actress. Gomez first gained recognition in 2011 when she began posting videos of herself covering popular songs online. One of her videos caught the attention of producer Dr. Luke, who subsequently offered her a joint record deal with Kemosabe Records and RCA Records. While working on her debut effort, Gomez collaborated with artists will.i.am, Cody Simpson and Cher Lloyd. Her official debut single, \"Becky from the Block\" (2013), received a positive reception upon its release. She released her debut extended play, Play It Again (2013), later that same year. Her second single, \"Can't Get Enough\" (2014), featured guest vocals from Pitbull and went on to top the Latin Rhythm Airplay chart in the United States.\n\nGomez achieved mainstream success with the release of \"Shower\" (2014), which went on to enter the top twenty of the Billboard Hot 100 chart. The single would go on to receive a multi platinum certification from the Recording Industry Association of America (RIAA), denoting two million units sold in the country. Following the success of \"Shower\", Gomez released \"Can't Stop Dancin'\" (2014), \"Lovin' So Hard\" and \"Break a Sweat\" (2015) as singles from her forthcoming album. She embarked on a co-headlining tour with J Balvin throughout September and October 2015, spanning throughout the United States. She portrayed Valentina Galindo in two episodes of the musical television series Empire, contributing two new songs to the soundtrack of the series called \"Do It\" and \"New New\". Gomez was featured on the song \"Superstar\" (2016) with Pitbull. She released her first Spanish song \"Sola\".\n\nIn July 2017, she released her single \"Mayores\", with rapper Bad Bunny, which topped the charts in Spain, Ecuador, Chile and El Salvador, while reaching number three on the Billboard Hot Latin Songs chart. Her success led her to collaborate with artists such as Daddy Yankee, French Montana and David Guetta, in addition to being the opening act for girl group Fifth Harmony, for the Latin American leg of their PSA Tour, with shows in Argentina, Chile, and Mexico, that same year. In April 2018, she released another hit single \"Sin Pijama\" with Dominican singer Natti Natasha, which also entered the top five of the Hot Latin Songs, peaked at number one in Spain and the top 10 in several countries. In July 2018, Gomez released \"Zooted\", featuring French Montana and Farruko, as her first English-language song in three years. On September 27, 2019, she featured on the \"Chicken Noodle Soup\" remix by South Korean rapper and dancer J-Hope of BTS.\n\nLife and career [ edit ]\n\n1997–2011: Early life and career beginnings [ edit ]\n\nRebbeca Marie Gomez[1][2] was born on March 2, 1997,[2] in Inglewood, California.[3] She is the daughter of Alejandra \"Alex\"[1] and Francisco \"Frank\" Gomez. All four of her grandparents are from Jalisco, Mexico, while her parents and most of her family were born in the US.[8] Gomez has two brothers, and a younger sister.[9] In December 2017, she revealed she has a half-sister who was eighteen years old.[10] Gomez grew up in Moreno Valley, and at the age of nine her family lost their home and moved into the converted garage of her grandparents' house due to financial problems.[1] Gomez began working part-time jobs to help support her family, doing commercials and voice over work.[1] She had what she described as a \"mid-life crisis\" when she was nine years old, and decided she wanted to pursue a music career.[1] She was quoted as stating \"That was literally my mid-life crisis when I was nine years old. That's when I felt like, 'OK, I gotta get my life together. What am I gonna do?' I pushed that on myself at a younger age than the average kid because at the time my family had lost our home. I've always been more mature for my age, so I was already understanding what they were going through. And I just thought, 'How can I help them?'\"[11] She initially attended public school, though had to undergo home schooling due to issues with bullying.[11] She claimed that at one point she was jumped by multiple girls while in the restroom, and was a frequent target due to her jobs in the entertainment industry.[12]\n\nGomez appeared in the short film El Tux (2008) as Claudia Gómez and as Nina in the Discovery Channel television film La estación de la Calle Olvera (2008).[13][14] She became a member of a girl group named G.L.A.M. in 2009,[15][16] and later joined B.C.G., another girl group.[17] She filmed a music video as part of G.L.A.M. for a song titled \"JellyBean\" in 2009. During this time, Gomez also began recording herself singing and rapping songs using Garageband, and created a YouTube account to post covers of popular songs online.[11] She also began writing her own songs, and by the age of thirteen had taught herself how to play guitar.[1] Gomez befriended production duo The Jam when she was thirteen, who liked Gomez's written work.[12] The trio began working on material together, resulting in the covers of the songs \"Otis\" (2011), \"Lighters\" (2011), \"Novacane\" (2011) \"Take Care\" (2011), \"Boyfriend\" (2011), and an original song \"Turn the Music Up\".[12] These songs were meant to be part of a mixtape, titled @itsbeckygomez, though this project never came to fruition.[1] Her cover of \"Otis\" caught the attention of producer Dr. Luke, who had worked with artists including Britney Spears and Miley Cyrus, among others.[1] Luke scheduled a meeting with Gomez, and asked her to play guitar for him; he later signed her to his Kemosabe Records record label, through RCA Records.[12] In reference to her video clip for \"Otis\", Luke claimed \"I would have signed her off that video alone. I was 100 percent in. She has so much personality and her voice just pops out of the speakers. Then I met her and discovered she could also sing and play the guitar and I thought, 'This is even better.' Then I found out she could write and it was like, 'What else are you going to tell me, that you’re also Van Gogh?' Her potential is limitless.\"[12] Shortly after signing with the label, Gomez began work on her debut album.[1]\n\n2012–2015: Commercial success with music and acting [ edit ]\n\nIn August, while working on her debut album, Gomez released her first song, \"Problem\", featuring will.i.am, which was subsequently remixed into \"Problem (The Monster Remix)\" in September, for the Sony Pictures Animation film Hotel Transylvania; the song served as a promotional single and also appeared in the movie in the end credits.[18] Gomez and will.i.am filmed a music video for the song; it features both artists in a hotel while scenes from the movie also appear.[1] She is featured on Cody Simpson's song \"Wish U Were Here\" (2012), serviced as the second single from his debut studio album on August 7.[19] She worked with Cher Lloyd on the song \"Oath\", released on October 2 as the fourth single from her debut album.[20] The single had some commercial success, becoming Gomez's first song to chart on the Billboard Hot 100.[21] The track was later certified gold by the Recording Industry Association of America (RIAA), denoting sales of 500,000 copies in the country.[22] She also worked with Michel Teló on a remix of his song \"Ai Se Eu Te Pego\" on his UK EP on October 14. Gomez is featured on a remix of Kesha's top ten single \"Die Young\" (2012) alongside Juicy J and Wiz Khalifa; the remix was featured on the Japanese deluxe edition of Kesha's second studio album, Warrior (2012).[23]\n\nBecky G performing in Chicago in December 2013\n\nOn April 8, 2013, Gomez released \"Becky from the Block\" as her official debut single.[24] The song is a cover of Jennifer Lopez's 2003 single \"Jenny from the Block\".[25][26] Gomez filmed a music video in her neighborhood, with Lopez herself making a cameo in the clip.[27] Entertainment Tonight described the version to have \"give[n] Jenny's NY-based tune a West Coast slant\".[28] Later, on May 6, Gomez released a new song, \"Play It Again\", for digital download.[29] The track served as a promotional single, and was not an official single released by Gomez. On July 13, Gomez released her debut extended play, also titled Play It Again.[30] The album contained five songs on the standard edition, and its name was chosen by Gomez's fans. Gomez later filmed a music video for the song \"Built For This\", released on November 13, which she directed on her own. In October 2013 she confirmed that she was already recording her debut album. \"Cant Get Enough\", which features a guest rap from Pitbull, was serviced as the lead single from Play It Again, released on June 4. The song went on to top the Latin Rhythm Airplay chart in the United States, marking her first number one single on a Billboard chart.[11] Spanglish and Spanish versions for \"Play It Again\" and \"Can't Get Enough\" were released to digital platforms. Gomez performed the former on the 2013 Premios Juventud ceremony, where she was also nominated for \"Revelación Juvenil\" (Revelation Young).[31] She recorded the song \"Quiero Bailar (All Through the Night)\" (2013) with 3Ball MTY, which sees Gomez rap-singing in both English and Spanish.[32] The song was intended to be used for their second studio album.\n\nBecky G in 2014.\n\nGomez released the single, \"Shower\" (2014), as the initial lead single from her then upcoming English debut studio album on April 23.[33] The song proved to be a success for Gomez, entering the top twenty of the Billboard Hot 100 chart in the United States.[34][35] The song achieved chart success in numerous other countries as well, most notably reaching number eleven in both Australia and Sweden.[36] The single went on to receive a multi platinum certification from the Recording Industry Association of America (RIAA), denoting two million units sold in the country.[37] Gomez began representing CoverGirl in July 2014.[38] As the spokeswoman for the company, she filmed commercials to promote the brand and featured their products in her music videos.[38] \"Can't Stop Dancin'\" (2014) was serviced as the next single from the album on November 4.[39] The song failed to match the success of her prior single, peaking at number eighty-eight on the Hot 100.[40]\n\nGomez opened for Demi Lovato and Katy Perry on select dates of their Demi and Prismatic world tours (2014–15) in both the United States and Mexico.[41] Gomez is featured on the song \"Como Tú No Hay Dos\" (2015) by Mexican singer Thalía.[42] Gomez released a song titled \"Lovin So Hard\" (2015), along with a music video consisting of homemade footage of Gomez and Austin Mahone, whom she briefly dated.[43][44] On June 26, Gomez debuted a song titled \"We Are Mexico\" in solidarity with the Latin community in response to Donald Trump's remarks against illegal Mexican immigrants.[45] She also performed at a tribute concert for the late Jenni Rivera.[46] She released another song, \"Break a Sweat\" (2015), the fourth single to be released from her debut album.[47] Gomez embarked on a co-headlining tour with Colombian reggaeton singer J Balvin beginning on September 23 and ending on October 25; the tour spanned across the United States.[48][49] Gomez also released a remix with J Balvin for her single \"Can't Stop Dancin\". She later collaborated with Yellow Claw on the songs \"Wild Mustang\" and \"For the Thrill\" (2015).[50] She released \"You Love It\" (2015) as a promotional single prior to the release of her debut album.[51] That same day Gomez was cast as Trini in the film Power Rangers (2017).[52][53] She also appeared as Valentina Galindo in two episodes of Empire adding the singles \"Do It\" and \"New, New\" (2015).[1]\n\n2016–2018: Crossover to Latin music and films [ edit ]\n\nPower Rangers Becky G with the cast of\n\nGomez traveled to Vancouver, British Columbia, Canada to film Power Rangers.[54][55] Filming occurred from February 29 to May 28, 2016.[56][57] Gomez collaborated once more with Pitbull on the song \"Superstar\".[58] The song served as the official anthem for the Copa América Centenario.[59] On June 24, 2016, Gomez released the single \"Sola\".[60] The song serves as her first to be sung solely in Spanish.[60] The song achieved success on Spanish radio, reaching number twenty-four on the Latin Pop Songs chart in the United States.[61] She is featured in Lil Jon's single \"Take It Off\", which also features vocals from Yandel.[62] On October 7, 2016, Gomez released \"Mangú\", her second Spanish song and follow-up to her single \"Sola\".\n\nGomez talked about being influenced by Selena and that she is proud of her Mexican heritage.[63] Gomez was featured on Play-N-Skillz's both Spanglish and English remake versions of the song \"Si Una Vez\" (1994) by late Tejano singer Selena, alongside Frankie J and Kap G. The singles were released on February 24 and April 7, 2017, respectively.[64] On February 20, 2017, Gomez teased the release of her single, \"Todo Cambio\", after posting a photo of herself wearing a wedding dress on social media. The song was released on March 3, 2017, and serves as the third single from her debut album.[65][66] On March 24, Power Rangers was released, marking Gomez's feature film debut. She received public attention after it was revealed that her character, Trini, is queer, being the first superhero to be from the LGBT community.[67] She collaborated with Argentine singer Axel, on the single \"Que Nos Animemos\" from his album Ser. On July 8, Gomez began a countdown on Twitter for her single \"Mayores\", featuring Bad Bunny. The song was released as the first single from her debut album on July 14.[68][69] Gomez stated that \"Mayores\" will mark the beginning of a \"new era\". On September 21, it was confirmed that Gomez would be the opening act for girl group Fifth Harmony, for the Latin American leg of their PSA Tour, with shows in Argentina, Chile, and Mexico.[70] During the group's performance in Argentina, Gomez was pulled off the stage by security after being confused for a fan when attempting to cover member Dinah Jane with the country's flag when her outfit was ripping apart.[71][72] Gomez joined singer Leslie Grace on the song \"Díganle\", released on September 28.[73][74] Gomez also collaborated with Lindsey Stirling as the featured vocalist on the track \"Christmas C'mon\", from Stirling's Christmas album, Warmer in the Winter, released on October 20, 2017.[75]\n\nBecky G in 2017\n\nOn February 9, 2018, duo Mau y Ricky released a remix of their song \"Mi Mala\" with Karol G featuring Gomez, Leslie Grace and Lali.[76][77] On the 16th of the same month, Jamaican rapper Sean Paul and French DJ David Guetta released \"Mad Love\" also featuring Gomez.[78][79] On April 20, she released \"Sin Pijama\" with singer Natti Natasha.[80][81] Gomez returned to the English-speaking market after three years with the release of \"Zooted\" featuring French Montana and Farruko, which was made available for download on July 20. On August 5, she released \"Cuando Te Besé\" with Paulo Londra.[82][83] On August 16, Gomez and Grace released a remix of \"Díganle\", featuring Latin boy band CNCO. A week later, Gomez starred in the sci-fi adventure film A.X.L., which was filmed in late 2017; the movie received negative reviews from critics and like Power Rangers, was a box-office disappointment. Gomez starred in the lead role in the animated fantasy film Gnome Alone, alongside Josh Peck; it was originally slated for release in theaters, but was only released in Latin America, Europe and Asia in April 2018. It was made available in Netflix on October of the same year. On October, Mexican singer Joss Favela released a duet with Gomez, titled \"Pienso en Ti\". Later that month, Spanish singer C. Tangana released the song \"Booty\" with Gomez, featuring Alizzz. Gomez featured in \"Lost in the Middle of Nowhere\" from Kane Brown's second album, Experiment. In December 5, 2018, Gomez released a makeup collection called \"Salvaje\" with cosmetics brand ColourPop.[84] On December 20, Gomez was featured in a remix of \"Mala Mía\" by Colombian singer Maluma, alongside Brazilian singer Anitta.\n\n2019–present: Mala Santa [ edit ]\n\nOn January 18, 2019, Gomez officially made her return to English music with the release of \"LBD\", along with its lyric video. On March 22, she released her next single \"Green Light Go\" to digital download and streaming.[85] Gomez embarked in her self-titled tour, visiting Spanish-speaking countries.[86] On March 28, Kane Brown released a Spanish version of \"Lost in the Middle of Nowhere\" with Gomez, along with a music video, and a behind-the-scenes clip with the English version.[87] On April 19, Gomez released the single \"La Respuesta\" with Maluma.[88][89]\n\n\"Un Mundo Ideal\", a bilingual version of \"A Whole New World\", was performed by Zayn Malik and Gomez for the soundtrack to the 2019 remake of Aladdin. The song was released on May 17, 2019.[90] She collaborated with Myke Towers with the song \"Dollar\" a music video was released July 12, 2019.[91]\n\nOn September 6, 2019, Akon released \"Cómo No\" featuring Gomez, as the lead single from El Negreeto.[92][93] On September 27, 2019, she featured on J-Hope's song \"Chicken Noodle Soup\". The song contains lyrics in Spanish, English, and Korean, which both were involved writing in their respective languages. The music video for \"Chicken Noodle Soup\" also featured 50 dancers from different nationalities.\n\nGomez released her debut studio album Mala Santa on October 17, 2019.[94]\n\nOn November 10, 2019, Gomez was part of the song \"Giants\", as Qiyana, by a virtual hip-hop group True Damage in League of Legends for the 2019 World Championship.[95] On the same day, she was part of its live performance for the opening ceremony of the finals.[96]\n\nPersonal life [ edit ]\n\nIn June 2016, it was confirmed that Gomez is in a relationship with American professional soccer player Sebastian Lletget.[97][98][99]\n\nWhile on tour with Fifth Harmony in October 2017, Gomez suffered an \"out-of-control fan attack\" while in Mexico City. When exiting the hotel, her security guard tried to hold the fans back. She was pulled by several fans who wanted to take pictures with her. Gomez took to Snapchat to speak about the incident and also revealed that she has been dealing with anxiety, explaining why she ran during the commotion.[100][101]\n\nDiscography [ edit ]\n\nFilmography [ edit ]\n\nFilm Year Title Role[102] Notes 2008 El Tux Claudia Gómez Short film 2011 House of Sin Rosalia 2017 Power Rangers Trini (Yellow Ranger) 2018 Gnome Alone Chloe Voice role 2018 A.X.L. Sara Reyes\n\nTours [ edit ]\n\nHeadlining\n\nBecky G Tour (2019)\n\nCo-headlining tours\n\nLa Familia Tour with J Balvin (2015)\n\nOpening act\n\nAwards and nominations [ edit ]\n\nBillboard Latin Music Awards Year Category Nominee Result 2015 Artist of the Year[104] Becky G Nominated 2017 Hot Latin Songs Artist of the Year, Female[105] Becky G Nominated 2018 Hot Latin Songs Artist of the Year, Female[106] Becky G Nominated 2019 Hot Latin Songs Artist of the Year, Female[107] Becky G Nominated\n\nLatin American Music Awards Year Category[108] Nominee Result 2016 Favorite Pop/Rock Female Artist Becky G Won 2018 Favorite Female Artist of the Year Becky G Won Favorite Urban Song \"Mayores\" (ft. Bad Bunny) Won Song of the Year \"Mayores\" (ft. Bad Bunny) Nominated 2019 Favorite Female Artist Becky G Won Favorite Pop Song \"Lost in the Middle of Nowhere (Remix)\" with Kane Brown Nominated Favorite Video \"La Respuesta\" (featuring Maluma) Nominated Extraordinary Evolution Award Becky G Honored\n\nLo Nuestro Awards Year Category[111] Nominee Result 2015 Pop Female Artist of the Year Becky G Nominated 2019 Female Urban Artist of the Year Becky G Nominated Urban Song of the Year \"Sin Pijama\" Won \"Dura (Remix)\" Nominated Remix of the Year \"Dura (Remix)\" Nominated Urban Collaboration of the Year \"Mi Mala (Remix)\" Nominated ” Sin Pijama \" Won\n\nGardel Awards Year Category[114][115] Nominee / Work Result 2019 Best Urban/Trap Song or Album \"Cuando Te Besé\" Nominated Best Collaboration Nominated Best Urban/Trap Collaboration Won\n\nNotes [ edit ]\n\n^ [110] \"Best Style\" wasn't a category at the award show, but was chosen by the audience while the event was currently airing live. Gomez managed to win the award, as announced at the end of the ceremony.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Becky_G.jpg/220px-Becky_G.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Mesa_Redonda_con_Becky_G._hablando_con_EDM_RADIO.jpg/170px-Mesa_Redonda_con_Becky_G._hablando_con_EDM_RADIO.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Becky_G_2014.png/170px-Becky_G_2014.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Becky_G_performing_in_December_2013_in_Chicago_alt.jpg/170px-Becky_G_performing_in_December_2013_in_Chicago_alt.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Cast_of_the_Power_Rangers_movie_%28cropped%29.jpg/220px-Cast_of_the_Power_Rangers_movie_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Becky_G.jpg/1200px-Becky_G.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Becky_G.jpg/1200px-Becky_G.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Becky_G", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Becky_G.jpg/1200px-Becky_G.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}