{"url": "graziadaily.co.uk/celebrity/news/questions-re-asking-robert-pattison-s-new-wife/", "text": "Everything You Need To Know About Too Hot To Handle, Netflix's Wild New Dating Show\n\nby Jess Commons |\n\nMeet Laura Adkins, the 25-year-old who’s gone and done what every teenager on the face of this planet has wanted to do for ages – marry Robert Pattinson.\n\nExcept she hasn’t.\n\nSee, what Laura’s REALLY gone and done is marry a cardboard cutout of Edward Cullen. But differentiating between the two things is just splitting hairs, right?\n\nLaura told the Sunday People, ‘People think I’m crazy, but my flat-pack R-Patz is the closest I’ll get to the real thing and he’s the one for me.’\n\n\n\nLauren paid $20 for her 2-D husband whom she married in a Las Vegas chapel back in January in front of 50 guests. ‘The day cost £2,000 but I didn’t care – I wanted to do it properly.’\n\nJust like any newlyweds, the two headed off on a honeymoon afterwards. The couple chose Los Angeles as a destination where Laura was keen to climb up to the Hollywood sign. ‘I had to carry him, and we had to do it at night because he can’t be in the sun, but everyone makes sacrifices for the man they love, right?’ Right.\n\nWhile we’re totally on board with doing whatever makes you happy – even if that something is marrying a cardboard version of a fictional character – there’s a few questions that this story’s left us asking.\n\n\n\nFor instance:\n\nGoing out\n\nAccording to Laura, she regularly takes Edward out to bars where she orders him a beer, and her a gin and tonic. Which is cool and all, but what happens to the beer? Is Laura forced to drink it herself, therefore getting doubly drunk? Or does she pour it down a little hole she’s made in Edward’s mouth, drying his soggy lips off under the handdryer afterwards?\n\nSustainability\n\nBeing the proud owners of a Henry VIII cutout (not even joking), myself and my housemates are basically experts in the lifecycle of such a product, and let me tell you right now, cardboard is not the most substantial of materials. Damp, open flames and general roughhousing have not been kind to Henry and he’s not even a cutout that’s allowed outside. Laura takes Edward on real-life holidays – how much more of a shelf-life can her husband have? Does Laura replace him every three months? Has she covered him in some form of protective laminate material?\n\nIdentity\n\nWhile the cutout is of Robert Pattison playing Edward Cullen in one of the Twilight films (sorry I don’t know which one. I got halfway into the whole werewolf/vampire bro-off and couldn’t handle the angst), Laura refers to it (him?) as ‘R-Patz’ therefore prompting the question; is she in love with Robert or Edward? Or an amalgamation of the two? Are they even different people? Or is Robert Pattinson actually a vampire? Might explain some things.\n\nEr, bonking\n\nSorry to take this to the lowest common denominator but have the two ever consummated their marriage? Is this something that can happen with a cardboard cutout? And if so, how? Is it any good?\n\nHusbandly duties\n\nWhile cardboard isn’t heavy, six feet of it is awkward to carry around. Will Laura ever get annoyed with her husband's lack of mobility? Is there some sort of system she can rig up with a skateboard – like those dogs that lose their back legs – that means she doesn’t have to carry him everywhere? More importantly, without the ability to speak, walk or think, he’s kind of useless as a husband. How’s he going to bring home the bacon? Provide kids? Fix the Netflix when the SCART lead comes unplugged?\n\nGoing forward\n\nPerhaps our biggest question about this whole story is: doesn’t Laura deserve better? She seems like a nice girl. She’s certainly inventive, media savvy and has no qualms about going out and getting exactly what she wants. So what’s she doing with someone (thing?) that can’t tell her how great she is every day? Our advice to Laura? Give old R-Patz the ceremonial bonfire of a goodbye he deserves and get yourself on Tinder.\n\nI mean, really\n\nLike this? Then you might also be interested in:\n\nFollow Jess on Twitter @Jess_Commons", "images": ["http://images.boomsbeat.com/data/images/full/6475/twilight-gif.gif", "https://cdn.onebauer.media/one/lifestyle-legacy/00/9715e/81e4f/d46ad/b441c/8fa15/83a93/LaurenandEdward02_small_zps6f18d3fc_620x349.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "http://graziadaily.co.uk/static/assets/facebook.svg", "http://graziadaily.co.uk/static/assets/twitter.svg", "http://graziadaily.co.uk/static/assets/pinterest.svg"], "top_img": "https://cdn.onebauer.media/one/lifestyle-legacy/00/9715e/81e4f/d46ad/b441c/8fa15/83a93/LaurenandEdward02_small_zps6f18d3fc_620x349.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "keywords": [], "authors": ["Jess Commons"], "canonical_link": "https://graziadaily.co.uk/celebrity/news/questions-re-asking-robert-pattison-s-new-wife/", "title": "A Few Questions We’re Asking About Robert Pattinson’s New Wife", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "og": {"site_name": "Grazia", "type": "website", "url": "https://graziadaily.co.uk/celebrity/news/questions-re-asking-robert-pattison-s-new-wife/", "description": "Bad news Twihards – Edward Cullen is off the market", "title": "A Few Questions We’re Asking About Robert Pattinson’s New Wife", "locale": "en_GB", "image": {"identifier": "https://cdn.onebauer.media/one/lifestyle-legacy/00/9715e/81e4f/d46ad/b441c/8fa15/83a93/LaurenandEdward02_small_zps6f18d3fc_620x349.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "width": 960, "height": 540, "type": "image/jpeg"}}, "twitter": {"title": "A Few Questions We’re Asking About Robert Pattinson’s New Wife", "description": "Bad news Twihards – Edward Cullen is off the market", "card": "summary_large_image", "site": "@GraziaUK", "creator": "@GraziaUK", "image": {"identifier": "https://cdn.onebauer.media/one/lifestyle-legacy/00/9715e/81e4f/d46ad/b441c/8fa15/83a93/LaurenandEdward02_small_zps6f18d3fc_620x349.jpg?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "alt": "LaurenandEdward02_small_zps6f18d3fc"}}, "description": "Bad news Twihards – Edward Cullen is off the market", "next-head-count": 41}, "movies": [], "publish_date": null, "source": "http://graziadaily.co.uk", "summary": ""}