{"url": "https://www.trashtalktv.com/04/08/married-to-medicine-recap-bowling-alley-blues/310925/", "text": "Last season, Dr. Jackie was a mature woman who survived cancer and sought to be a role model for African-American women. Dr. Simone was a doctor who liked to drink, hated exercise and loved her family. Mariah and her Black-adeshi family were at the center of most fights and Quad tried to avoid having sex with her nerdy husband. Oh, and Toya made Kelly Bundy look like a Pulitzer prize winner. Kari was there but she’s undergoing a very personal struggle with her lips and couldn’t be a part of this season.\n\nQuad is back and looking semi-clownish. Her hair is orange, her lips are red and her eyeshadow looks like something out of Face Maker circa 1983. It could be the fact that I’m watching this on a 13 inch TV but all of this color is making my soul hurt. Anyway, she’s shopping at her friend’s store and he brings up the pressure for her to have a child. Okay, is this scene even in English? Quad and Reco sound like the result of James Brown possessing their bodies – if he was resurrected as a gay Southern man. I think the moral of the story is that Quad doesn’t want to have babies yet but let’s get down to the real story. Reco asked Mariah to pose for his magazine but she said she was busy. He told her he wanted to use Quad but Mariah felt it wasn’t right to use someone else in her circle. Quad cries because her BFF is a selfish moron. I can’t believe she was really crying over this so I choose to believe that there’s more to this story. Maybe Mariah tried to show a family vacation slideshow on Quad’s forehead. I don’t know.\n\nDr. Jackie and Dr. Simone meet and discuss fun facts. For instance, some women forget to remove their IUD for decades and it’s up to these brave souls to remove it. That was just the appetizer for the really fun stuff. Dr. Jackie talks about her husband’s regret over not having a son. The first year of her marriage was when she went through her first bout with cancer. She also had a miscarriage so she wants to discuss using donor eggs with his sperm so he can have a child. Dr. Simone warns her not to do it because she’s busy and she’ll have to give stuff up in order to have a child. The conversation ends abruptly when Dr. Simone has to take off to push the eject button on a patient’s uterus.\n\nMariah ruins her daughter’s self-esteem during a family photo shoot when she tells her that she doesn’t know how to give face and takes her place in the family photo. I see a Lauren Manzo in the making. I don’t know what the Black-adeshi equivalent of provolone and egg salad is but order up a 30 year supply. Stat. Mariah’s family, including her infamous mother, is there for dinner and Mariah asks her nephew Ian about being bullied at school. Mariah’s advice to him is to beat up the girl who’s been hitting him. More specifically, “hit it and quit it!” First of all, the girl probably likes him and secondly, has Mariah not heard of school shootings and suicide? Kids are over the top these days. The last thing they need is permission to act out on whatever impulse they have. Third, “hit it and quit it” definitely refers to sex. Perhaps she wants him to continue the reality tradition and be a star on MTV’s Teen Dad: Reality Offspring. Then again this is Mariah. She’d probably love for the kid to have a full meltdown so he can’t overshadow her own kids.\n\nMariah says that she and Quad don’t speak anymore and her sister says that Mariah created Quad. Actually, Suzuki invented quads. Mariah says that Rico Chapple, the dress shop man, got in Quad’s ear about Mariah being jealous of her. Mariah’s mother must’ve read her hate mail last season because she’s dressed like she’s going to an inauguration and she’s got a Hilary Clinton weave. Mariah’s mom is disappointed in Quad so you know what that means. Quad’s getting a beat down with a purse.\n\nDr. Simone gets home late from work. She missed her kid’s game because a patient was in labor. Her husband, Cecil, was able to cover parental duties. She feels like she’s trying to juggle lots of balls and based on her husband’s facial expression, there’s definitely a couple of blue balls in the house. Dr. Simone switched to a new billing system and she was prepared for a 3 month pay delay but not the 6 month one that she’s going through. I love a doctor who can admit she’s broke right now and can call herself a bitch in a loving way. I should have gone to medical school. I’m always calling myself names and avoiding calls from collections.\n\nQuad is making breakfast for her husband, Greg. He’s surprised and she makes the point that she can do this now that she doesn’t work. She’s brilliant! Quit work, do one menial task and justify leeching for as long as possible. Momma Joyce from RHOA would be relieved to know that Kandi’s not the only ‘victim’. I love that she greets her husband politely but says good morning to her dogs like they got a medical degree and give her an eyeshadow allowance. Plus, her husband speaks in a higher pitch than her dogs bark and he doesn’t need to be walked. He might need to be neutered though. She would give him sexy time but he farts in his sleep. I don’t know why we need to hear about this but it makes me understand my perpetual loneliness. Dr. Gregory brings up the baby subject and fails to get her in the mood by basically saying that she’s old. He tells her that she’s on the back-end of thirty and she needs to get started. She laughs it off, says she’s just starting her thirties and secretly pours laxative into his pancake batter.\n\nToya is a stay at home mom. Bravo basically spends 12 seconds catching up on her life of barely taking care of her kids and then has her go over to her dentist and friend’s house. Dr. Heavenly says that Toya isn’t the sharpest knife in the drawer but she likes her spirit…and role on a TV show. Dr. Heavenly is having a soiree for Atlanta’s medial elite and hopes that everyone is on their best behavior. She questions the behavior of Drs. Jackie and Simone at Toya’s sickle cell event. Dr. Jackie offended a plus-sized pageant winner and Dr. Simone was dancing on Toya’s husband. It sounds to me like the two of them went to reality TV school over the hiatus.\n\nDr. Simone borrows a purse from Dr. Jackie for the party and says she’s putting nothing in it. Andy Cohen, please cut this lady a check.\n\n\n\n“Where’s the computer? I need to put this purse on ebay.”\n\nAt the party, Dr. Simone hugs Dr. Heavenly’s husband and asks if it’s okay to touch him. Obviously, she’s gotten word regarding the talk that’s circulating about her actions at Toya’s party. They both squat and get into a pissing contest for wives. Dr. Heavenly brags that she works part-time so she can cook for her husband and be submissive. Dr. Simone mocks her for only being half a doctor and calling her husband “daddy”. Dr. Heavenly even brags that she ironed her husband’s tuxedo. Umm, what?! Did she do that before or after she took it out of the dryer?\n\n\n\n“After I took it out and since we’ve been standing here I gave myself an orgasm so he doesn’t have to do it later.”\n\nSimone’s husband tries to stop the conflict and Simone tells her not to start sh*t with her. Dr. Heavenly says if Simone starts it, she’ll finish it. Heavenly’s husband immediately yanks her leash and reprimands her for using the s-word. They each go to their separate corners. Kari and her lips make an appearance at the event. Quad and Mariah fake kiss and greet each other. Dr. Jackie and Simone are hanging out when Dr. Heavenly comes over for part two of her argument.\n\n\n\nDr. Jackie: There’s nothing angelic about those fat rolls, Dr. Heavenly.\n\nSimone apologizes for Heavenly getting in trouble with her hubby but Dr. Heavenly doesn’t mind being submissive to her husband and says that the two of them know nothing about that. Then, Dr. Heavenly calls Jackie out for criticizing the pageant girl in the bowling alley. She keeps emphasizing that the girl was insulted in a bowling alley and no one wants to be insulted in a bowling alley. I’ll do you one better. No one wants to be in a bowling alley. Why in the hell were Atlanta’s medical elite and random plus-sized beauty queens throwing greasy balls down a lane for charity? Dealing with greasy balls for a wedding ring or green card is one thing but I wouldn’t do that for messed up cells.\n\nJackie takes the women aside to talk about the issue and Mariah makes her way into the conversation. In flashbacks, we see Dr. Jackie lecture Miss Plus-Size Georgia on heart disease, portion control, activity and bob sweat. Dr. Heavenly says that she lost 70 pounds so she knows where the pageant girl was coming from and she didn’t want to hear that stuff in a bowling alley. Dr. Jackie talks about the importance of health and says that Heavenly doesn’t totally get it because she isn’t really a doctor. Dr. Heavenly explains that she is a doctor and Jackie corrects it by saying that she doesn’t deal with hearts just crusty teeth. Meanwhile, Mariah is in the background setting Black-adeshis back 2 years with exclamations of ‘Yes Jesus, hunty, oh Lord!’. They’ve only been around for like 8 years so it’s like a quarter of their history down the drain. Jackie ultimately apologizes for hurting or offending anyone but she says that obesity cam lead to cancer which she’s had.\n\n\n\nDr. Jackie: I am really, truly sorry. I can’t express how sorry I am…that I went to a bowling alley.\n\nDr. Simone jumps into the argument to help defend Jackie and Heavenly threatens to kick her out of the house. Dr. Simone doesn’t mind, in fact she doesn’t feel welcome so she’s ready to leave.\n\n\n\n“I’ve already shoved two bottles of Absolut into my bag.”\n\nAfter that conversation is over, Toya confronts Simone about grinding on her husband at the event. Simone doesn’t recall doing it and then says that Toya couldn’t even see around Eugene so how could she know.\n\n\n\nToya: I had on glasses. They call me five eyes.\n\nDr. Simone is on a roll and I don’t mean those attached to Miss Plus Sized Georgia. She’s angered Dr. Heavenly, made fun of Toya’s dizzy eyes and called Eugene fat. I love her. Dr. Simone storms out and we’re ready to roll for the rest of the season.\n\n\n\nDr. Heavenly: Can I have ice cream tonight, daddy?\n\nHusband: Right after you watch My 600 LB Life and write a 500 word essay on not ever gaining back 70 pounds.\n\nThis season, Jackie and Quad entertain reproduction, Simone has marital issues, Toya gets hit in the head again and no one likes Mariah. What’d you think? It was a decent premiere and I hope it gets even better. The new doctor should be on next week’s episode and why didn’t we get to see the bowling alley, sickle cell fundraiser? It looks like that would’ve been a good season premiere!\n\nWant more TrashTalk? Follow us onTwitter for updates of recaps as they publish, like us on Facebook for a daily update, watch our TV parody vids on YouTube, or for funny TV pics, heart us on Instagram and follow our TV parody boards on Pinterest!", "images": ["https://www.trashtalktv.com/wp-content/uploads/2014/04/Married-to-Medicine-04.06.2014-Dr-Simone.png", "https://www.google.com/images/poweredby_transparent/poweredby_FFFFFF.gif", "https://www.trashtalktv.com/wp-content/uploads/2018/12/marissa.jpg", "https://www.trashtalktv.com/wp-content/uploads/2014/04/Married-to-Medicine-04.06.2014-Dr-Jackie-and-Simone.png", "https://www.trashtalktv.com/wp-content/uploads/2014/04/Married-to-Medicine-04.06.2014-Heavenly-and-husband.png", "https://www.trashtalktv.com/wp-content/uploads/2018/12/IMG_0037.gif", "https://www.trashtalktv.com/wp-content/uploads/2016/04/tttv_icon_icon.png", "https://www.trashtalktv.com/wp-content/uploads/2014/04/Married-to-Medicine-04.06.2014-Heavenly-Bowling-Alley.png", "https://www.trashtalktv.com/wp-content/uploads/2016/02/TTTV-New-Color-Logo.gif", "https://secure.gravatar.com/avatar/8ce4425fc1ea633e3a5aa6066ce90ed1?s=96&d=mm&r=r", "https://www.trashtalktv.com/wp-content/uploads/2014/04/Married-to-Medicine-04.06.2014-Toya.png", "https://www.trashtalktv.com/wp-content/uploads/2014/04/Married-to-Medicine-04.06.2014-mariah-at-argument.png", "https://www.trashtalktv.com/wp-content/uploads/2018/12/tenor-2.gif"], "top_img": "https://www.trashtalktv.com/wp-content/uploads/2016/04/tttv_icon_icon.png", "keywords": [], "authors": ["L Boogie", "Aunt Dorsey", "Classy Drunk"], "canonical_link": "https://www.trashtalktv.com/04/08/married-to-medicine-recap-bowling-alley-blues/310925/", "title": "Married to Medicine Recap: Bowling Alley Blues – TrashTalkTV", "meta_data": {"themify-framework-css": "themify-framework-css", "generator": "WordPress 4.9.13", "viewport": "width=device-width, initial-scale=1", "msapplication-TileImage": "https://www.trashtalktv.com/wp-content/uploads/2015/10/cropped-TTTV-LOGO-2015-Large-sqh-300x300.gif"}, "movies": [], "publish_date": null, "source": "https://www.trashtalktv.com", "summary": ""}