{"url": "https://www.yourtango.com/2018316340/is-khloe-kardashian-pregnant-again-new-rumors-shes-expecting-baby-two-with-tristan-thompson", "text": "She just gave birth 3 months ago.\n\nIs Khloe Kardashian pregnant again? We all know that she has always wanted to be a mother. She’s talked about it candidly on Keeping up with the Kardashians, and has frequently expressed her desire to have a family of her own. After many years of trying, Khloe finally gave birth to her daughter, True, in April.\n\nAround the time of True’s birth, Khloe’s boyfriend, Tristan Thompson, found himself at the center of a cheating scandal in which a video was released with him kissing and groping another woman. There were also salacious text messages he sent to his mistress. Would you really expect anything different from someone who cheated on his then-pregnant girlfriend to be with a Kardashian? Once a cheater, always a cheater?\n\nA post shared by @krazyinlovewithkardashians on Aug 8, 2017 at 2:43pm PDT\n\nIt’s safe to assume Khloe wants more children in the future, but does that mean she’s been trying again with Tristan?\n\nA source has said, “Khloe loved being pregnant, but she’s the first to say how great she feels now that she’s lost the baby weight. That being said, she could find herself pregnant again soon.”\n\nEven so, the two recently took a trip to Mexico together, and according to the source, “they’ve been having tons of wild sex, especially on their trip to Mexico. It’s basically been like a mini honeymoon for them.”\n\nThe source also claims that Tristan wants more children as well and can be very persuasive. “He’s been saying that since they first fell in love he can see them having five or even six kids. That hasn’t changed; he loves being a dad and is even more in love with Khloe now that they have True. Khloe says she’s not ready to be pregnant again yet, but Tristan‘s a convincing guy,” the source revealed.\n\nIs that enough to convince Khloe to try to get pregnant again? After giving birth, women have to wait six weeks before they can have sex again and the couple is well past that date.\n\nBut don’t get too excite because Khloe herself revealed that she’s not quite ready. A fan recently asked if she was having another baby:\n\nNot right now lol True is only 3 months old so give me some time lol https://t.co/TthrxOQdHr — Khloé (@khloekardashian) July 28, 2018\n\nKeep in mind that she just went back to work, and is in the process of fixing her relationship with Tristan. Would she really be in the right state of mind to welcome another child into the world?\n\nWhile she may wait a while, there’s no doubt that she loves being a mom. We just hope she gets her house in order before expanding her family any further.\n\nA post shared by Top Media New Zealand. (@topmedianz) on Aug 16, 2018 at 9:00pm PDT\n\nSamantha Maffucci is an associate editor for YourTango. In her free time, you can find her obsessing about cats, wine, and all things Vanderpump Rules.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/khloe%20kardashian%20pregnant.png?itok=hnzTeq-S", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/khloe%20kardashian%20pregnant.png?itok=wcMrfJC4"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/khloe%20kardashian%20pregnant.png?itok=wcMrfJC4", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018316340/is-khloe-kardashian-pregnant-again-new-rumors-shes-expecting-baby-two-with-tristan-thompson", "title": "Is Khloe Kardashian Pregnant Again? New Rumors She's Expecting Baby #2 With Tristan Thompson", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Taken, Khloe Kardashian, tristan thompson, kardashian family, Pregnancy, Family, Love", "article": {"author": "https://www.yourtango.com/users/samantha-maffucci", "published_time": "2018-08-20T19:36:53", "modified_time": "2018-08-20T19:36:53"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018316340/is-khloe-kardashian-pregnant-again-new-rumors-shes-expecting-baby-two-with-tristan-thompson", "title": "Is Khloe Kardashian Pregnant Again? New Rumors She's Expecting Baby #2 With Tristan Thompson", "description": "She just gave birth 3 months ago.", "updated_time": "2018-08-20T19:36:53", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/khloe%20kardashian%20pregnant.png?itok=wcMrfJC4", "width": 620, "height": 309}}, "description": "Is Khloe Kardashian pregnant? A few days before she gave birth to daughter True, her boyfriend, Tristan Thompson, was caught in a cheating scandal. While she's just getting back to work and trying to fix her relationship, is she ready to add another child to her family?", "abstract": "Is Khloe Kardashian pregnant again? We all know that she has always wanted to be a mother. She’s talked about it candidly on Keeping up with the", "robots": "follow, index, noodp, noydir", "news_keywords": "Is Khloe Kardashian pregnant again, is khloe pregnant again, is khloe pregnant again, khloe kardashian pregnant again, khloe pregnant again, khloe having another baby, khloe k pregnant again, khloe baby bump, khloe baby 2, Khloe Kardashian pregnancy, is khloe pregnant, khloe kardashian, khloe kardashian daughter, tristan thompson, khloe kardashian boyfriend", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018316340/is-khloe-kardashian-pregnant-again-new-rumors-shes-expecting-baby-two-with-tristan-thompson", "title": "Is Khloe Kardashian Pregnant Again? New Rumors She's Expecting Baby #2 With Tristan Thompson", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/khloe%20kardashian%20pregnant.png?itok=wcMrfJC4", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/8vXatQN0MJc"], "publish_date": 1534765013.0, "source": "https://www.yourtango.com", "summary": ""}