{"url": "https://www.psychologytoday.com/us/blog/shrink-wrap/201802/the-impact-abusive-relationship-reese-witherspoon", "text": "Standing up to , whether it is verbal, physical, or both, can be daunting. Actress Reese Witherspoon recently opened up about her struggles with this in a former relationship. She said there were several instances of behavior that led her to eventually remove herself from the situation. This is such an important thing to do, but so often not easy for many reasons.\n\nDomestic abuse is like the common cold in the sense that it appears in so many forms. It usually starts with your partner trying to control you through verbal abuse, and it can remain there or evolve into physical abuse as well. It can be difficult to stand up and protect yourself from your partner, because often they do not act that way all of the time. The bad behavior might be episodic, and, in fact, when he isn’t throwing insults or punches, he may be acting quite loving toward you. He might be sensitive in those moments, and act as though he truly cares about you and is doing everything for your own good, which can make it especially hard to reconcile the two vastly different personas. One nice act or display of kindness can be like a magic marker and erase all the bad things the person has done, which contributes to your denial of how truly distressing your partnership is.\n\nYou also might be sticking around, because you tell yourself that this pattern of abuse and affection is simply the way that your partner shows concern. Their controlling behavior can feel like it is their way of showing you how much they love you, by being so involved and caring about everything you do. If you believe this, you might begin to trust the other person’s judgment and opinion of you over your own, and as a result, your goal becomes to please them. Eventually, it might even become more about avoiding their disapproval and possible wrath than it is about getting their approval. At this point, it is likely that you have relinquished your own voice entirely in order to appease them, and will do anything to avoid their criticism, , and assault of words. You slowly give up all the facets of your life that make them act up.\n\ncan also play a role. To begin with, if you push back in any way, they might accuse you of not being appreciative of all they think they do for you. Their refrain that you are lucky to have them, that nobody else will ever love you as much as they do, can become stuck in your head. In addition, often following an abusive event your partner likely feels remorse and shows that through tears, apologies, and promises that it will never happen again. When the other person gets upset, it can spike your guilt that you made them feel this way.\n\nPractical issues such as money might keep you there, too. If you can’t afford to leave, that makes it all so much harder. In addition, you might want to protect any children involved, either by preserving their other parent’s reputation by hiding what is going on, or by not wanting to disrupt the connection they share.\n\nSo what can you do to get out of a relationship where you do not feel safe? It’s important to know that it’s not about how many times you are devalued or mistreated; it’s about the fact that it is happening at all. If the line is crossed with physical and verbal abuse, that’s the time to take steps to learn how to protect yourself.\n\nStart by taking stock of your partner’s behavior and acknowledging that instead of feeding your soul, it is doing the opposite: It is actually dangerous to your heart, soul, and emotional well-being. Consider the fact that the level of anger they displayed toward you is disproportionate to anything you have done.\n\nShift away from the guilt that makes you want to take care of them, and begin to look out for yourself instead. Stop feeling sorry for them, and feel bad for yourself. Even though there is often so much associated with being abused, try to get out from under it by no longer hiding it. Find someone you trust who can give you valid support — a therapist, teacher, friend, or family member — and speak up and speak out.\n\nAt the same time, take responsibility for yourself by making changes to reclaim your life. Get back in touch with the friends you had to turn away from because your partner didn’t like them. Go back to the gym. Start wearing lipstick again. Reactivate your Facebook account.\n\nLearn how to put boundaries in place, so that instead of avoiding your partner’s temper, you begin to directly address it and what makes it flare up. Hold them accountable, and let them know you are no longer willing to tolerate their hurtful actions anymore.\n\nNow is the “Me Too” time across the board and across the country. Women are speaking up about verbal, physical, and sexual abuse everywhere, and it is no longer okay for men to have their way at the expense of a woman’s safety and . If this is going on in your life, now is the time to use the social movement to join forces and seek the emotional and physical freedom and safety that you deserve. It’s so valuable that celebrity women like Reese are lending their voice and talking about the abuse that they have suffered in the past, because it cuts across all denominations. Nobody is immune to the destructive anger of their partner. Hopefully Reese’s words can serve as a guide to others in similar situations.", "images": ["https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/_stokkete_shutterstock_102076192_sweet_tooth-144x144-191_0-381_381.jpg?itok=MTqiqljd", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-facebook-md.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-twitter-lg.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-twitter.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/narcissistic_leader_tumisu-144x144-15_0-420_420.jpg?itok=JJmhAbKr", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-facebook-lg.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2018-02/shutterstock_656507863.jpg?itok=qIxGJdo6", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-twitter-md.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/profile_bottom/public/Jane-Greer.jpg?itok=L-ZHJeWh", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2020-04/shutterstock_1674180070-144x144-196_0-668_667.jpg?itok=xsE66uD_", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-instagram.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/icons/icon-check-circle-gray.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/profile/public/Jane-Greer.jpg?itok=g4ufzu7Q", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/crowd-144x144-541_0-1279_1280.jpg?itok=55sWXA4e", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-email-md.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-chat-md.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/shutterstock_1674180070-144x144-196_0-668_667.jpg?itok=n0ZCI22m", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2017-11/generous_by_josh_boot_unsplash_licensed_under_cc_by_2-144x144-979_0-3836_3840.0.jpg?itok=crTO7PRO", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2020-04/woman-in-gray-tank-top-looking-serious-3812728-144x144-1180_0-5456_5461.jpg?itok=wUtK7_BA", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_images/2020-04/messyroom.jpg?itok=JxbObNBr", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-email-lg.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2020-04/tai-s-captures-5bskidse_mq-unsplash-144x144-228_564-3389_3396.jpg?itok=8BXPKkKw", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-facebook.svg"], "top_img": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2018-02/shutterstock_656507863.jpg?itok=qIxGJdo6", "keywords": [], "authors": [], "canonical_link": "https://www.psychologytoday.com/us/blog/shrink-wrap/201802/the-impact-abusive-relationship-reese-witherspoon", "title": "The Impact of an Abusive Relationship: Reese Witherspoon", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "alexaVerifyID": "ruuD3Gzrr-EaY185APFbxF69Va4", "google-site-verification": "TW94BxD1361EMEu31uuXtY9b9OZtw-oTmSBh3hWhzis", "y_key": "0f29d521db0a2863", "msvalidate.01": "9AD6650A37790044983CFB6B27D77607", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Psych Today", "twitter": {"creator": "@PsychToday", "description": "It hurts to stay.", "title": "The Impact of an Abusive Relationship: Reese Witherspoon", "site": "@PsychToday", "card": "summary"}, "og": {"title": "The Impact of an Abusive Relationship: Reese Witherspoon", "type": "website", "app_id": 220580041311284, "image": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2018-02/shutterstock_656507863.jpg?itok=qIxGJdo6", "description": "It hurts to stay.", "url": "https://www.psychologytoday.com/blog/shrink-wrap/201802/the-impact-abusive-relationship-reese-witherspoon", "site_name": "Psychology Today"}, "fb": {"app_id": 220580041311284}, "description": "For better or worse?"}, "movies": [], "publish_date": null, "source": "https://www.psychologytoday.com", "summary": ""}