{"url": "https://web.archive.org/web/20171110054355/https://www.flake.senate.gov/public/index.cfm/press-releases?ID=FE6E0D3D-D9AE-4AF2-963B-275C6308D31A", "text": "WASHINGTON – U.S. Sen. Jeff Flake (R-Ariz.), a member of the Senate Judiciary Committee, today spoke on the Senate floor in support of religious freedom. Flake invoked the nomination of Professor Amy Barrett, whose nomination to the federal bench has grown contentious due to insinuations on the part of Democrats and special-interest groups that her Catholic faith would affect her ability to be a judge.\n\n\n\n\n\n“It is no better for Democrats to evaluate a judicial nominee based on how many books are in the Bible on which she swears her oath, than it is for Republicans to judge a congressman for the Quran on which he does the same. To suggest that somehow a Roman Catholic judge would disregard the Constitution in favor of Church doctrine—when she has emphatically and repeatedly said she would not—is as wrong as suggesting that a Muslim judge would be somehow be forced to follow sharia law over the Constitution. Religious liberty must not depend on the religion in question.”\n\n\n\nWhen Barrett’s religion came up in her confirmation hearing, Flake was quick to argue that line of questioning was both inappropriate and bordered on a religious test. To view Flake and Barrett’s exchange at the hearing, click here.\n\nFollowing the speech, Flake voted to confirm Barrett to serve as a judge on the U.S. Court of Appeals for the 7th Circuit. Barrett was confirmed by a vote of 55-43.\n\nTo view Flake’s speech, click here.\n\nA transcript of the prepared remarks can be viewed below.\n\nBackground:\n\nOn Oct. 2, Flake spoke on the Senate floor to warn against a religious test for judicial nominees. To view a video and transcript of Flake’s remarks, click here.\n\n***\n\nI rise today again to discuss the matter of religious liberty. In particular, I would like to continue to urge this body to respect our Constitutional values and avoid any hint of applying religious tests to those who heed the call of government service.\n\nFreedom of religion is as foundational a principle as we have in this country, yet some in this chamber want to take a cabined view of it: If you’re a judicial nominee, it’s fine to attend the occasional worship service, but don’t let on that you take it too seriously.\n\nThat is unacceptable.\n\nFrom the inception of our republic, religious believers have chosen to serve their country in countless ways. Whether through the armed forces, holding elected office, or sitting on the courts, Americans of faith have always answered the call. We should welcome this service. And we should not sit idly by while others question the propriety of their service by suggesting a de facto religious test. The Framers of the Constitution were fearful of this very thinking.\n\nThey understood the importance of religious participation and foresaw the benefits religious believers of all backgrounds would contribute to the common good. They also knew from centuries of war and suffering in Europe the high costs of religious intolerance. That’s why they made it clear in Article VI of the Constitution that no public officers could be subject to a “religious test.” This edict is entirely unambiguous in its language and intent. This country is to be served by people of all faiths, committed to the Constitution and the common good.\n\nIt is up to us to question the qualifications and jurisprudence of nominees, not their religious views. Unfortunately, that is not what is happening to Professor Barrett.\n\nI was at her confirmation hearing, where she faced inappropriate questions and objections based on her religious views. I witnessed a citizen heeding the call to serve her country, face inquiries into her religious beliefs that bordered on ridicule. My friends on the other side of the aisle defend their questions and their conduct, and I don’t doubt their sincerity. But there is little comfort in the defense that it doesn’t matter that Professor Barrett is a Catholic--but somehow it matters what sort of Catholic Professor Barrett is. These are unconstitutional distinctions without differences.\n\nIn addition, otherwise-respectable news outlets have provided sensational reports of Professor Barrett’s personal charismatic religious practices.\n\nAs a member of the United States Senate, I find this troubling. As a person of faith, I find this objectionable. And, above all, as an American, I find this abhorrent.\n\nIt is religious liberty – enshrined in constitutional provisions like Article Six and the First Amendment – that has allowed my faith and so many others to flourish in the United States. And it is religious liberty that is threatened when we seek to evaluate the fitness of nominees for high office based on religious orthodoxy. I have endeavored to be consistent on this issue during time in public service.\n\nWhen the presidential nominee of my Party, the Party of Lincoln, called for a “Muslim ban” it was wrong.\n\nThat’s not what we stand for.\n\nWhen a judge expressed his personal belief that a practicing Muslim shouldn’t be a member of Congress because of his religious faith, it was wrong.\n\nThat this same judge is now my party’s nominee for the Senate from Alabama should concern us all.\n\nReligious tests should have no place in the Senate. Standing up for people of faith, whether Muslim or Catholic, who are facing unfair prejudice should be an act of basic conscience. It should be expected of all of us, regardless of party.\n\nIt is no better for Democrats to evaluate a judicial nominee based on how many books are in the Bible on which she swears her oath, than it is for Republicans to judge a congressman for the Quran on which he does the same.\n\nTo suggest that somehow a Roman Catholic judge would disregard the Constitution in favor of Church doctrine—when she has emphatically and repeatedly said she would not—is as wrong as suggesting that a Muslim judge would be somehow be forced to follow sharia law over the Constitution.\n\nReligious liberty must not depend on the religion in question.\n\nSo I ask, in light of these circumstances – who will stand today against all cases of religious bigotry?\n\nAre there true liberals here who will stand up for the liberal values of religious tolerance?\n\nSome, like Professors Larry Tribe, Noah Feldman, and Chris Eisgruber. They have said, “enough.”\n\nWho here will join them?\n\nThis very body is made up of individuals of near 15 different faiths. Each of us has sworn an oath to the Constitution. Each of us feel we can competently carry out our duties, as do those in the judicial branch who swear a similar oath to uphold the constitution.\n\nMr. President, let us stand together today and without equivocation say “no” to religious intolerance in all its forms by examining the jurisprudential views and professional qualifications of the judicial nominees – not their relationships with the Almighty.\n\n###", "images": ["https://web.archive.org/web/20171110054355im_/https://sdc1.senate.gov/dcsdx1km300000s9q4qi4mdc7_8x1p/njs.gif?dcsuri=/nojavascript&WT.js=No&WT.tv=9.4.0&dcssip=www.flake.senate.gov"], "top_img": "", "keywords": [], "authors": ["United States Senator Jeff Flake"], "canonical_link": "", "title": "Flake: “Religious tests should have no place in the Senate”", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "author": "United States Senator Jeff Flake"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}