{"url": "https://www.cheatsheet.com/entertainment/royal-style-rules-meghan-markle-royal-tour-of-australia.html/", "text": "Last week, Meghan Markle and Prince Harry embarked on their first official royal tour together. The lovebirds — and parents-to-be — headed down under to Australia ahead of the 2018 Invictus Games. And, while they met with athletes, members of the community, and state officials, Meghan Markle wore some of her most stylish (and eco-friendly) looks to date. That said, many of Meghan’s outfits went against the strict royal style rules the queen has in place for official engagements.\n\nHere are some of the royal style rules Meghan Markle broke while on the royal tour of Australia.\n\nMeghan Markle wore a revealing dress while visiting Fraser Island. | Chris Jackson/Getty Images Meghan Markle wore a revealing dress while visiting Fraser Island. | Chris Jackson/Getty Images\n\nNo spaghetti straps\n\nWhile visiting Fraser Island, Meghan Markle stepped out in the ultimate vacation number: A lightweight, spaghetti strap Reformation dress. But, although we love the look, the queen probably didn’t approve of it. According to royal style rules, members of the family must dress modestly when on official family business. That means no spaghetti straps.\n\nMeghan also wore a thin-strapped dress while visiting Bondi Beach earlier in the week.\n\nNo high slits\n\nSpeaking of dressing modestly, Meghan Markle’s Reformation dress also featured a very high, revealing slit. And, when she bent down to greet fans, her thigh was revealed. While it’s not the end of the world, the queen likely won’t approve of the look.\n\nCasual clothing is not permitted, according to royal style rules. | Chris Jackson/Getty Images for the Invictus Games Foundation Casual clothing is not permitted, according to royal style rules. | Chris Jackson/Getty Images for the Invictus Games Foundation\n\nNo casual clothes\n\nThe queen would prefer members of her family to avoid casual clothing while on an official engagement. However, this rule is often broken by her grandchildren (including Kate Middleton) — especially since they like to get involved in sporting events and activities. Meghan Markle was photographed in her most casual look to date while cheering on sailors in the Invictus Games.\n\nMeghan Markle revealed the queen’s most hated shoe while at Bondi Beach. | Ryan Pierse / Getty Images Entertainment Meghan Markle revealed the queen’s most hated shoe while at Bondi Beach. | Ryan Pierse / Getty Images Entertainment\n\nNo wedged-heels\n\nQueen Elizabeth II reportedly hates wedged heels. So, Kate Middleton and Meghan Markle typically avoid wearing them around her majesty. However, while visiting Bondi Beach, Meghan Markle revealed her wedged espadrilles — a bit royal style rules no-no. That said, her sister-in-law regularly breaks this rule, as wedged heels are one of her favorite shoe styles.\n\nKeep your outermost layer on\n\nAccording to royal style rules, women in the family must keep their outermost layer (coats) on at all times. That’s why you always see Kate Middleton, Meghan Markle, Camilla Parker Bowles, and the queen in a jacket — even if it’s warm out. That said, in a series of photos posted on Kensington Palace’s Instagram account, it appears as though Meghan Markle removed her jacket while enjoying a reception for the Invictus Games at Government House in Sydney. However, it is likely she showed up without a jacket and added it later as she got cold.\n\nMeghan also appeared to remove the oversized plaid blazer she wore upon arrival to the Woodleys (a local farming family) in Dubbo earlier that week.\n\nHair must always be neat\n\nThe queen has a thing about unkempt hair. Which is why Kate Middleton often opts for hairnets to keep certain styles in place — especially in the rain. While in Dubbo, the Duke and Duchess of Sussex got caught in the rain (which made for some swoon-worthy pics of them!) and Meghan’s low ponytail appeared to take some of the hit. While it might not be a big deal to most (after all, it’s only hair), the queen would probably have preferred to see Meghan’s hair in a low bun, secured by a hairnet to keep things in place.\n\nThe Duchess of Sussex wore a low-cut neckline while visiting Melbourne. | Phil Noble – Pool/Getty Images The Duchess of Sussex wore a low-cut neckline while visiting Melbourne. | Phil Noble – Pool/Getty Images\n\nNo low-cut necklines\n\nIn royal style rules, modesty is key. Which is why many royals avoid plunging necklines and showing too much skin. But, while visiting the Royal Botanic Gardens in Melbourne on the royal tour of Australia, Meghan appeared in a v-neck dress. While it’s not the most revealing look of the trip — see: the dress she wore to Fraser Island — it is borderline against the queen’s style expectations.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Fraser-Island-1.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Fraser-Island-1.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Royal-Tour-Australia.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Prince-Harry-Bondi-Beach-1.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Prince-Harry-Invuctus-Games-1.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Fraser-Island-1.jpg", "keywords": [], "authors": ["Jessie Quinn"], "canonical_link": "https://www.cheatsheet.com/entertainment/royal-style-rules-meghan-markle-royal-tour-of-australia.html/", "title": "Royal Style Rules Meghan Markle Broke on Her Royal Tour of Australia", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/royal-style-rules-meghan-markle-royal-tour-of-australia.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Last week, Meghan Markle and Prince Harry embarked on their first official royal tour together. The lovebirds — and parents-to-be — headed down under to", "og": {"locale": "en_US", "type": "article", "title": "Royal Style Rules Meghan Markle Broke on Her Royal Tour of Australia", "description": "Last week, Meghan Markle and Prince Harry embarked on their first official royal tour together. The lovebirds — and parents-to-be — headed down under to", "url": "https://www.cheatsheet.com/entertainment/royal-style-rules-meghan-markle-royal-tour-of-australia.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-10-23T19:14:32-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Fraser-Island-1.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Fraser-Island-1.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Meghan Markle", "section": "Entertainment", "published_time": "2018-10-28T12:00:58-04:00", "modified_time": "2018-10-23T19:14:32-04:00"}, "twitter": {"card": "summary_large_image", "description": "Last week, Meghan Markle and Prince Harry embarked on their first official royal tour together. The lovebirds — and parents-to-be — headed down under to", "title": "Royal Style Rules Meghan Markle Broke on Her Royal Tour of Australia", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Meghan-Markle-Fraser-Island-1.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1540742458.0, "source": "https://www.cheatsheet.com", "summary": ""}