{"url": "https://www.inquisitr.com/4214543/zayn-malik-and-gigi-hadid-second-wives-club-star-shiva-safai-dishes-on-the-amazing-kids/", "text": "Zayn Malik and Gigi Hadid, as well as Gigi’s siblings, are “amazing kids,” says Second Wives Club star Shiva Safai. Shiva isn’t just another reality TV star, though, she’s going to be Bella, Anwar, and Gigi’s step mom.\n\nShiva Safai of Second Wives Club, a 35-year-old model, is engaged to Gigi Hadid’s father. Shiva Safai spoke enthusiastically about Zayn Malik and Gigi Hadid to E! News.\n\n“Whatever makes Gigi happy is what we want. As long as she’s happy in a relationship, that’s all we want. So I’m just happy that she’s happy.”\n\nZayn Malik and Gigi Hadid do seem very happy together, after their nearly two-year romance. Shiva Safai has been part of the family’s life for over three years, so Shiva knows Gigi and Zayn Malik quite well. Shiva Safai explains to E! News that Gigi Hadid and Zayn Malik have a great relationship.\n\n“[Zayn Malik is] a great guy and she’s a very smart girl and she’s amazing. They have a great relationship.”\n\nShiva Safai of Second Wives Club mentioned that Gigi Hadid and Zayn Malik travel a lot with their careers. Bella and Anwar also travel quite a bit but it’s all part of success, so dad and future stepmom Shiva take it in stride.\n\n“They travel, I don’t even know how they do it, they are all over the world. It’s crazy but you know they’re young and it’s amazing.”\n\nZayn Malik and Gigi Hadid often try to coordinate their travel so that they are in the same city, but it is often impossible to match up schedules. Often too much is made of Gigi Hadid or Zayn Malik being seen out alone because it is almost always due to schedule conflicts. Zayn Malik and Gigi get along well and have adapted to the constant demands on their lives.\n\nShiva Safai and Mohamed Hadid, proud parents of Bella and Gigi Hadid [Image by Mike Coppola/Getty Images]\n\nSecond Wives Club star Shiva Safai has a great relationship with Mohamed as well, according to her comments. Though there is a 33-year age gap between Shiva Safai and Mohamed, the Second Wives Club star told Fox News she was instantly attracted to Gigi Hadid’s dad, during their first, completely-by-chance meeting in a restaurant. For more on Shiva Safai’s relationship with Gigi Hadid’s father, see this article from the Inquisitr.\n\n“Mohamed was there waiting for his friend and it was an instant attraction. I don’t know if it was his piercing blue eyes that attracted me, but I just found him very different and intriguing. We connected on Facebook after that… He then asked me out on a date and it was just an instant chemistry. Everything felt so right and it was so comfortable. It was so easy… and I felt that we met each other at the right time in our lives.”\n\nShiva Safai sound excited, not just about the Second Wives Club, but to be a member of the family, and Shiva Safai even had nice things to say about Mohamed’s ex-wife. Shiva Safai had a lot of sweet comments about Gigi’s mother Yolanda Hadid.\n\n“They have a wonderful mother who always is their backbone and supports them no matter what. And they are good kids with good heads on their shoulders, good upbringing, they have unconditional love, from the entire family and we are all so, so proud of all their achievements.”\n\nGigi and Bella Hadid Victoria Secret [Image by Pascal Le Segretain/Getty Images]\n\nYolanda and Mohamed Hadid have three children together, Gigi Hadid, Anwar Hadid, and Bella Hadid. All three youngsters have demanding and successful careers.\n\nZayn Malik often mentions his love and respect for his girlfriend Gigi Hadid, Victoria’s Secret angel, supermodel, and Tommy Girl. Recording artist Zayn Malik has even gotten into the fashion business with his own clothing and shoe line. Bella Hadid, like her older sister Gigi, is a promising young model as well.\n\nRELATED REPORTS FROM THE INQUISITR\n\nZayn Malik And Gigi Hadid: Why Is The Former One Direction Singer So Controversial? [Opinion]\n\nShiva Safai Joins ‘Second Wives Club,’ Discusses Engagement To Mohamed Hadid\n\nAre Shiva Safai & Joyce Giraud Joining ‘RHOBH’ For Season 6? They Hang With Lisa Vanderpump Amid Production\n\nGigi Hadid: Gut-Wrenching Wisdom From Zayn Malik’s Supermodel Girlfriend [Video] [Opinion]\n\nJohnny Depp, Zayn Malik, And Thomas Gibson Get Smeared, But Their Fans Don’t Waver [Opinion]\n\nOne Direction’s Unlikely Fraternity: Harry Styles, Zayn Malik, Liam Payne, Louis, And Niall [Opinion]\n\nHarry Styles Explains Why The One Direction Hiatus Wasn’t About Zayn Malik [Opinion]\n\nShiva Safai told Fox News that the Hadid children have made her feel welcome to the Hadid family. Safai extends that welcome to Zayn Malik as well.\n\nGigi Hadid and Zayn Malik have Second Wives Club star Shiva Safai’s seal of approval as long as the relationship makes Gigi happy.\n\n[Featured Image by Frederick M. Brown and Pascal Le Segretain/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/05/Gigi-and-Bella-Hadid-Victorias-Secret.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/Shiva-Safia-and-Mohamed-Hadid-Zayn-Malik-and-Gigi-Hadid.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/f2c888273bc1cfae0a252ea775e39137?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/Shiva-Safai-and-Mohamed-Hadid-proud-parents-of-Bella-and-Gigi-Hadid.jpg"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Kim Mclendon"], "canonical_link": "https://www.inquisitr.com/4214543/zayn-malik-and-gigi-hadid-second-wives-club-star-shiva-safai-dishes-on-the-amazing-kids/", "title": "Zayn Malik And Gigi Hadid: ‘Second Wives Club’ Star Shiva Safai Dishes On The ‘Amazing Kids’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/o480GMqMHfE?feature=oembed", "https://www.youtube.com/embed/C_3d6GntKbk?feature=oembed"], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}