{"url": "https://www.rollingstone.com/music/music-news/jay-zs-mother-comes-out-on-444-song-smile-252950/", "text": "Jay-Z‘s mother Gloria Carter revealed for the first time that she is a lesbian on the 4:44 track “Smile,” with the rapper also opening up about his mother’s sexuality.\n\n“Mama had four kids, but she’s a lesbian / Had to pretend so long that she’s a thespian,” Jay-Z said on the track.\n\n“Had to hide in the closet, so she medicate / Society shame and the pain was too much to take / Cried tears of joy when you fell in love / Don’t matter to me if it’s a him or her.”\n\nFollowing Jay-Z’s verses on “Smile,” Gloria Carter delivers a moving monologue about “living in the shadows” and her eventual coming out.\n\n“Living in the shadow. Can you imagine what kind of life it is to live? In the shadows people see you as happy and free, because that’s what you want them to see. Living two lifes, happy but not free. You live in the shadows for fear of someone hurting your family or someone you love,” Jay-Z’s mother said on “Smile.”\n\n“The world is changing and they say it’s time to be free,” she adds. “But you live with the fear of just being me. Living in the shadow feels like the safe place to be. No harm for them, no harm for me. But life is short, and it’s time to be free. Love who you love, because life isn’t guaranteed.”\n\nGLAAD President and CEO Sarah Kate Ellis issued a statement praising Gloria Carter’s revelation. “Lesbian women are all too often erased or excluded from narratives surrounding LGBTQ people,” she wrote. “By sharing her truth with the world, Gloria Carter is increasing visibility of lesbian women of color at a critical time and sending a powerful message of empowerment to the entire LGBTQ community that is perfectly timed with the end of Pride Month.”\n\nIn a 2012 interview with CNN, Jay-Z spoke out in support of same-sex marriage, the Huffington Post notes.\n\n“I’ve always thought [not allowing same-sex marriages] was still holding the country back,” Jay-Z said at the time. “What people do in their own homes is their business and you can choose to love whoever you love. That’s their business. [It] is no different than discriminating against blacks. It’s discrimination plain and simple.”\n\nThe rapper’s deeply personal 4:44 also finds him apologizing to Beyonce over his past infidelities and lashing out at the Prince estate.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fjay-zs-mother-comes-out-on-444-song-smile-252950%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=252950", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jay-z-gloria-carter-7312d276-9d36-4861-821b-a453bbc649d2.jpg", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jay-z-gloria-carter-7312d276-9d36-4861-821b-a453bbc649d2.jpg", "keywords": [], "authors": ["Daniel Kreps", "Daniel Kreps'S Most Recent Stories", "Taylor Swift Delivers Moving", "Soon You Ll Get Better", "On", "Together At Home", "See Kacey Musgraves Perform", "Rainbow", "One World", "Watch Paul Mccartney S Heartfelt"], "canonical_link": "https://www.rollingstone.com/music/music-news/jay-zs-mother-comes-out-on-444-song-smile-252950/", "title": "Jay-Z’s Mother Comes Out on ‘4:44’ Song ‘Smile’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Jay-Z's mother Gloria Carter revealed for the first time that she is a lesbian on \"Smile,\" with the rapper also opening up about his mom's sexuality.", "news_keywords": "Jay-Z", "og": {"type": "article", "title": "Jay-Z's Mother Comes Out on '4:44' Song 'Smile'", "url": "https://www.rollingstone.com/music/music-news/jay-zs-mother-comes-out-on-444-song-smile-252950/", "description": "“Mama had four kids, but she’s a lesbian / Had to pretend so long that she’s a thespian,” rapper reveals", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jay-z-gloria-carter-7312d276-9d36-4861-821b-a453bbc649d2.jpg", "width": 1024, "height": 864, "alt": "Jay-Z's Mother Comes Out on '4:44' Track 'Smile'"}, "locale": "en_US"}, "article": {"published_time": "2017-06-30T16:25:45+00:00", "modified_time": "2018-06-25T16:40:34+00:00"}, "twitter": {"text": {"title": "Jay-Z's Mother Comes Out on '4:44' Song 'Smile'"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jay-z-gloria-carter-7312d276-9d36-4861-821b-a453bbc649d2.jpg?w=1024", "alt": "Jay-Z's Mother Comes Out on '4:44' Track 'Smile'"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Jay-Z’s Mother Comes Out on ‘4:44’ Song ‘Smile’", "description": "Jay-Z's mother Gloria Carter revealed for the first time that she is a lesbian on \"Smile,\" with the rapper also opening up about his mom's sexuality."}, "generator": "WordPress 5.4", "author": "Daniel Kreps", "content_type": "Article", "post_id": 252950, "title": "Jay-Z's Mother Comes Out on '4:44' Song 'Smile'", "published_at": "2017-06-30 16:25:45", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jay-z-gloria-carter-7312d276-9d36-4861-821b-a453bbc649d2.jpg?w=1024", "comment_count": 0, "tags": "Jay-Z", "topics": "Music News", "body": "Jay-Z's mother Gloria Carter revealed for the first time that she is a lesbian on the 4:44 track \"Smile,\" with the rapper also opening up about his mother's sexuality.\"Mama had four kids, but she's a lesbian / Had to pretend so long that she’s a thespian,\" Jay-Z said on the track. \"Had to hide in the closet, so she medicate / Society shame and the pain was too much to take / Cried tears of joy when you fell in love / Don’t matter to me if it’s a him or her.\"Following Jay-Z's verses on \"Smile,\" Gloria Carter delivers a moving monologue about \"living in the shadows\" and her eventual coming out.“Living in the shadow. Can you imagine what kind of life it is to live? In the shadows people see you as happy and free, because that's what you want them to see. Living two lifes, happy but not free. You live in the shadows for fear of someone hurting your family or someone you love,\" Jay-Z's mother said on \"Smile.\"\"The world is changing and they say it's time to be free,\" she adds. \"But you live with the fear of just being me. Living in the shadow feels like the safe place to be. No harm for them, no harm for me. But life is short, and it's time to be free. Love who you love, because life isn't guaranteed.\"GLAAD President and CEO Sarah Kate Ellis issued a statement praising Gloria Carter's revelation. \"Lesbian women are all too often erased or excluded from narratives surrounding LGBTQ people,\" she wrote. \"By sharing her truth with the world, Gloria Carter is increasing visibility of lesbian women of color at a critical time and sending a powerful message of empowerment to the entire LGBTQ community that is perfectly timed with the end of Pride Month.\"In a 2012 interview with CNN, Jay-Z spoke out in support of same-sex marriage, the Huffington Post notes.\"I've always thought [not allowing same-sex marriages] was still holding the country back,\" Jay-Z said at the time. \"What people do in their own homes is their business and you can choose to love whoever you love. That's their business. [It] is no different than discriminating against blacks. It's discrimination plain and simple.\"The rapper's deeply personal 4:44 also finds him apologizing to Beyonce over his past infidelities and lashing out at the Prince estate.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1498839945.0, "source": "https://www.rollingstone.com", "summary": ""}