{"url": "www.mercurynews.com/2018/06/05/kristen-stewart-and-robert-pattison-spark-reconciliation-rumors-with-l-a-sighting/", "text": "Twihards are having a hard time containing their delight because, as improbable as it sounds, Kristen Stewart and Robert Pattinson were spotted hanging out together at the Chateau Marmont in Los Angeles Saturday night.\n\nAnd six years after their three-year relationship came crashing down over reports that Stewart was cheating on Pattinson with married director Rupert Sanders, rumors have been swirling that the two are considering a reconciliation.\n\nCLICK HERE if you are having trouble viewing the photo gallery on your mobile device.\n\nThis is all according to the Daily Mail, which published grainy photos of Stewart and Pattinson, looking like they were having a chill time together, hanging out by a car outside a party at Chateau Marmont for Lily-Rose Depp.\n\nRobert Pattinson and Kristen Stewart – OUTSIDE OF THE CHATEAU MARMONT, LA 06/02/2018 pic.twitter.com/yozZSAGSIw — Elishia (@multifandomacc5) June 3, 2018\n\nStewart, 28, was wearing a black ensemble and appeared to be smoking, while Pattinson, 32, was wearing jeans, a graphic T-shrirt and black cap.\n\nThe idea of the “Twilight’s” Bella and Edward reconciling romantically in real life seems improbable because of the high-profile humiliation Pattinson likely suffered when Stewart was caught in a cheating scandal.\n\nShe was photographed in an intimate embrace with Sanders, her director for “Snow White and the Huntsman,” who was 19 years her senior. She and Sanders issued a very public apology to Pattinson.\n\nWhen the Twilight series ended in 2012, Stewart and Pattinson seemed to go their separate ways both professionally and romantically.\n\nEach has earned critical praise and International awards consideration for leaving blockbuster fare behind and starring in smaller, indie films. Meanwhile, Stewart came out as bisexual and began seriously dating model Stella Maxwell in late 2016, while Pattinson became engaged to U.K. singer FKA Twigs.\n\nBut Pattinson’s engagement to Twigs reportedly ended in October, while the Daily Mail, citing a report in OK! magazine, said “there’s trouble in paradise,” with regards to Stewart and Maxwell’s relationship.\n\nIn April, the Twilight stars were reported to have “gotten together a few times over the past several weeks,” according to OK!\n\n“They’re trying to keep it low-key, but there’s still chemistry there,” a source told OK! “People in their circles are starting to wonder if they’re considering a reconciliation.”\n\nSupposedly, Stewart hopes Pattinson is “serious” about having forgiven her, an insider told OK!\n\nIf there is the possibility of a reconciliation, Twihards on Twitter can hardly contain their excitement:\n\nRobert Pattinson & Kristen Stewart were photographed together for the 1st time in 5 years and my inner Twihard is really showing pic.twitter.com/1x5myv9GLf — Linds (@Lindsertart19) June 3, 2018\n\n*new pictures of Robert Pattinson and Kristen Stewart hanging out in LA 5 years after breaking up* pic.twitter.com/ymrOlkO1xV — katha 🌸 (@allkindsof_RK) June 5, 2018", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2018/06/PattinsonStewart.jpg?w=1024&h=692", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/06/PattinsonStewart.jpg?w=1024&h=692", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/06/05/kristen-stewart-and-robert-pattison-spark-reconciliation-rumors-with-l-a-sighting/", "title": "Kristen Stewart and Robert Pattinson spark reconciliation rumors with L.A. sighting", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Kristen Stewart and Robert Pattinson have been spotted hanging out together in recent weeks, sparking rumors that the Twilight stars are reconciling.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Kristen Stewart and Robert Pattinson spark reconciliation rumors with L.A. sighting", "url": "https://www.mercurynews.com/2018/06/05/kristen-stewart-and-robert-pattison-spark-reconciliation-rumors-with-l-a-sighting/", "description": "Twihards can hardly contain their delight because, as improbable as it sounds, reports are swirling that real life’s Bella and Edward are getting romantic again.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/06/PattinsonStewart.jpg?w=1024&h=692", "width": 1024, "height": 692}, "locale": "en_US"}, "article": {"published_time": "2018-06-05T13:24:32+00:00", "modified_time": "2018-06-05T23:57:03+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Kristen Stewart and Robert Pattinson spark reconciliation rumors with L.A. sighting"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/06/PattinsonStewart.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1528128000.0, "source": "http://www.mercurynews.com", "summary": ""}