{"url": "www.cosmopolitan.com/health-fitness/a58235/selena-gomez-trainer-amy-rosoff-davis-diet-fitness-tips/", "text": "Last April, Selena Gomez was photographed while on vacation in Mexico. She was wearing a swimsuit, which is normal vacation behavior. But Selena isn't any ordinary human, and internet trolls pounced on the chance to tear Selena apart for looking \"fat\" in paparazzi photos.\n\nShe handled the body-shaming by posting a personal bathing suit shot to Instagram, which she captioned, \"I love being happy with me yall,\" along with the hashtag #TheresMoreToLove.\n\nBut that was last year and this is now. And while she's always looked stunning, at the start of her worldwide solo tour, Selena has visibly less to love.\n\nGetty\n\nGetty\n\nHer changed body is the result of over a year working with trainer Amy Rosoff Davis, who has not only been looking after the singer's fitness but also her diet and lifestyle.\n\nSince starting last spring, Selena has worked out with Amy anywhere from three to five days a week, and in the last couple months before the start of the \"Revival\" tour, they were working out seven days a week for up to two hours at a time — on top of which Selena was doing back-to-back run-throughs of her 90-minute show during rehearsal. While on tour with Selena in Sacramento, California, Amy spoke to Cosmopolitan.com about what Selena did to get the body she has now.\n\nGetty\n\nGetty | Krystalina Tom\n\n1. No weighing. \"I've never weighed her,\" Amy said. \"I don't believe in scales — I just don't think it's healthy.\" But, because she and Selena work so closely together, she can tell when Selena's body changes or when her clothes fit differently, which they have been. \"I can definitely see the difference, and other people can too,\" she said. \"But ultimately, a body that eats well and works is going to look better because it's healthy.\"\n\nGetty\n\n2. No dieting. There's nothing that's off-limits when it comes to food — although that doesn't mean Amy won't encourage better choices — there's just less of it. \"I want to live my life like a French person,\" Amy said. \"I don't believe in denying yourself, but I also believe in moderation. Life is too short not to enjoy food.\"\n\n3. Switch from fast food to whole food. About that: Selena speaks with pride about eating like she's from Texas. \"She loves Tex-Mex and fast food that I would normally not condone,\" Amy said. \"I will walk onto the tour bus and smell fast food, throw it in the trash, and hand her a carrot and hummus.\" Changing Selena's eating habits has helped a lot in shaping her physique, Amy said. \"She responds really quickly. We'll do barely any ab exercises and two days later, I'm like, 'Whoa!'\"\n\nAmy has been incorporating more whole foods and healthy organic ingredients into Selena's meals. Here's a breakdown of what Selena might eat in a day:\n\nBreakfast: Half of a healthy breakfast burrito of scrambled eggs, chorizo, avocado, rice, and beans; or, full-fat Greek yogurt and granola.\n\nCourtesy of Amy Rosoff Davis\n\nLunch: A \"power salad\" of turkey, avocado, beans, with a homemade dressing of red wine vinegar, olive oil, dijon mustard, and lemon juice.\n\nDinner: Teriyaki bowl with Asian-marinated cucumber, salmon or chicken, avocado, and teriyaki sauce over rice; or sushi.\n\nAmy Rosoff Davis\n\nSelena also has a juicer in her dressing room so she can have a juice before she goes on stage. Amy's been making her juices with cucumber, carrot, kale, and ginger. Not that Selena is necessarily into it, but it's what she's doing right now.\n\n4. Never let your body get bored. Selena has been doing cardio, Pilates, and yoga of all kinds.\n\nShe and Amy go on long hikes with some of Selena's crew, where they'll break to do circuit training and \"arm dancing\" and \"side chassés up a hill.\" Amy said, \"I've always believed the best way to keep your muscles active is to mix it up. We switch things up almost every day.\"\n\nCourtesy of Amy Rosoff Davis\n\n5. Stretch. A lot. Amy stresses the importance of having a limber body and says that becoming more flexible has helped Selena \"let go.\" Sometimes, Selena will even do a combined stretching and vocal warmup session.\n\nCourtesy of Amy Rosoff Davis\n\nCourtesy of Amy Rosoff Davis\n\nCourtesy of Amy Rosoff Davis\n\n6. Water, water, water. \"I'm a big water pusher,\" Amy said. \"All the time. I'm always putting a bottle of water in someone's hand.\" It's clearly worked. Selena toldVogue that \"I always have water, tons of water. It's even in my bathroom because I used to be so bad at drinking water and I want to stay hydrated.\"\n\nGetty\n\n7. Sweat it out. Amy introduced Selena to Shape House, an \"urban sweat lodge\" where clients lie for 55 minutes in an \"infrared burrito\" and leave with skin that is \"literally glowing,\" Amy said. According to Shape House's website, one \"typical sweat session burns between 800 to 1,600 calories.\" Selena loves the process of infrared sweating so much that she has a sweat bag for the road.\n\n8. Have a healthy body image. \"When you feel good, you exude confidence, and you feel strong and healthy,\" Amy said. \"You wear it well inside and outside of your skin.\"\n\n9. Nourish the body and soul. While they were in Northern California, Amy researched good spots to hike, and it's a practice she hopes to continue throughout the whole tour. \"We want to find beautiful things in each town that makes it what it is,\" she said. \"You're in a hotel, or you're on a bus or in a show for so much of the time that it's nice to get out in nature where there's no technology and no people.\" After the two-hour hike outside Sacramento, they stopped at a waterfall and stood there for a few minutes to breathe and watch the water. \"It was such a perfect combination of mind, body, and soul,\" Amy said. \"Health, fitness, food — all of it is so important. What we put in our mouths and our souls affects everything.\"\n\nFollow Helin on Instagram.", "images": ["https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x800/landscape-1462914322-gettyimages-528832314.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x800/landscape-1462914322-gettyimages-528832314.jpg?resize=1200:*", "keywords": [], "authors": ["Story Helin Jung", "Helin Jung Is A Writer", "Editor Based In Los Angeles."], "canonical_link": "https://www.cosmopolitan.com/health-fitness/a58235/selena-gomez-trainer-amy-rosoff-davis-diet-fitness-tips/", "title": "9 Things Selena Gomez Did to Get the Body She Has Now", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "9 Things Selena Gomez Did to Get the Body She Has Now", "description": "Her trainer Amy Rosoff Davis is sharing all the details.", "url": "https://www.cosmopolitan.com/health-fitness/a58235/selena-gomez-trainer-amy-rosoff-davis-diet-fitness-tips/", "image": {"identifier": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x800/landscape-1462914322-gettyimages-528832314.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2017-10-09 07:17:52", "published_time": "2016-05-10 10:16:00", "section": "Health & Fitness", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x800/landscape-1462914322-gettyimages-528832314.jpg?resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Selena Gomez Diet and Exercise Tips - 9 Health Tips From Selena Gomez's Trainer", "description": "Selena Gomez's trainer Amy Rosoff Davis shares her tips for getting in the best shape of your life.", "keywords": "Selena Gomez, Selena Gomez diet, Selena Gomez exercise", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x1600/square-1462914322-gettyimages-528832314.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Health & Fitness,health-fitness", "sailthru.date": "2016-05-10T22:16:00Z", "sailthru.image.full": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x800/landscape-1462914322-gettyimages-528832314.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/19/1600x1600/square-1462914322-gettyimages-528832314.jpg", "sailthru.socialtitle": "9 Things Selena Gomez Did to Get the Body She Has Now", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1462846560.0, "source": "http://www.cosmopolitan.com", "summary": ""}