{"url": "https://www.racked.com/2017/9/12/16277802/mindy-project-costumes-fashion", "text": "Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here.\n\nFive years ago, The Mindy Project introduced audiences to the colorful and chaotic world of Dr. Mindy Lahiri, creator and star Mindy Kaling’s alter ego. Since then, we’ve watched Mindy grow both as a working professional and a woman looking for love — and from navigating the New York City dating scene to opening a fertility clinic to becoming a mom, she’s done it all while dressed in some truly memorable clothes.\n\nToday, the sixth and final season premieres on Hulu, and costume designer Salvador Perez went all out for Mindy’s last hurrah. Below, Perez discusses Mindy’s style evolution, dressing the men of Mindy, and what makes the final season’s fashion so special. (Hint: It involves a lot of Dolce & Gabbana.)\n\nHow does it feel to be working on the final season of The Mindy Project?\n\nIt’s bittersweet. I’m a gypsy; I normally do feature films because I like a beginning and an end. I’ve stayed on for six seasons of The Mindy Project because I’ve been having a great time. Part of me thinks, “All good things come to an end,” and part of me is like, “How can I not shop for this character for the rest of my life?” It’s the dream job. I cannot imagine not shopping for Mindy Lahiri ever again. That’s just daunting to me.\n\nDo you think you’ll be out and about and see pieces that make you think of her?\n\nOh my god, I’ve done three features in the middle of the show — I’ve done the Pitch Perfect movies and I did Think Like a Man. The whole time I was shopping for those, I was like, “Oh, this will be great for Mindy.” I’d literally pick something up and realize, “Wait, no, I’m not shopping for that show.” It’s such a natural part of what I do — to shop for that character — that it will take a couple years to break my habit of subconsciously shopping for Mindy.\n\nHow do you think Mindy’s style has — or hasn’t — evolved over the show’s six seasons?\n\nIt’s funny because people always think about Sex and the City as an arbiter of fashion. I’m like, “You’re remembering Sex and the City’s final season. Look at the first six episodes of Sex and the City.” It was not the same show, because you have to find your rhythm. In the first few episodes, you see Miranda in, like, overalls and a parka.\n\nI think it was the same for us. At the beginning of The Mindy Project, it was little cute cardigans layered over a blouse and a skirt. It was color-blocked. But now she’s a full-on fashionista. I mean, the Dolce & Gabbana, the Roksanda, the Prada, the Mary Katrantzou, and all of the custom stuff that we make for her. It’s a completely different show now than it was at the beginning.\n\nI love that you brought up the custom design. I’ve heard that each episode features at least one custom piece.\n\nOne custom outfit. So that means dress and coat. [Laughs]\n\nWhat do you enjoy most about creating those custom looks?\n\nI started out as a fashion designer, and I fell into costume because I could sew. So I’m still a closet fashion designer. To be able to design contemporary fashion for a woman like this is just a dream. It’s what I went to school for. As costume designers, we have many things in our arsenal. I can rent, I can borrow, I can pull. But to be able to build — and building things that don’t exist — is the ultimate. I even have somebody who does hand-knit clothes for us — hand-knit sweaters, skirts, and dresses. That’s how decadent we are on the show.\n\nWhat have been some of your favorite custom pieces?\n\nI love the finale of season 4, which tied into season 5. Mindy wore that little yellow Madeline dress with the collar and black bow with the matching floral coat.\n\nThat was super cute.\n\nIt’s one of my favorite pieces. This season alone we’ve done so much. You haven’t seen the episodes yet, but I found this beautiful cream silk fabric with tassels printed on it. I made a purple coat to go with it, and then we sewed tassels on the coat as an embellishment. To be able to be that decadent and to do couture-level clothing on a half-hour sitcom is unheard of.\n\nWhen we did a flashback to her first day at work, I did a pink jacquard suit lined in a printed silk with a matching silk blouse. Then we trimmed it with pearls and crystals. The fact that I can do that kind of quality work for a TV show is pretty amazing.\n\nColor and embellishment are such a big part of Mindy’s world. Was it a deliberate decision to make her wardrobe so vibrant?\n\nThat’s always been my aesthetic. You can talk to any director I’ve ever worked for. It’s like, “Sal, bring the color down. Sal, less crystals. Sal, less rhinestones.” My whole career has been that way. So to finally have a partner who said, “More crystals, more rhinestones, more color,” has been a gift. Mindy lets me do what I want. If it were my world, everybody would live in color.\n\nOn that note, does Mindy Lahiri actually own any black or neutral clothing?\n\nWe try to keep it special because I think black is such a crutch. I’m like, “No, no — everybody has a little black dress. You can’t wear that.” It’s gotta be chocolate brown or navy blue or hunter green. But every now and then — like at the beginning of season 4, when she had that dream marriage to Matt [Joseph Gordon-Levitt] — I put her in a black plunge dress with crystals. It was appropriate for that. She was in a dream world, and I wanted the dream world to be more black. But I use black very sparingly because I think that’s just the easiest. It’s easy to look great in a black dress. Anybody can do it.\n\nMindy has some really great loungewear, too. Where do all those stylish pajamas come from?\n\nThose PJs are from Bedhead Pajamas. I love their aesthetic. I go into their showroom at the beginning of each season and buy one of everything. And we always have them in our arsenal. People are like, “Do you have 10, 20 pairs?” Try 60. I have 60 pairs of Bedhead Pajamas. They’re luxurious. They’re comfortable. They’re in great colors. There’s an episode where we had one on her and one on Anna [Rebecca Rittenhouse]. They look great on everybody.\n\nHow did you decide that fashionable PJs would be a part of her character’s aesthetic?\n\nAs much as Mindy loves being a chic diva, she also likes being comfortable. But she wants to be comfortable and still be a chic diva. So you would never see her in just a T-shirt and sweats. It would be comfy pajamas, because she’s a diva.\n\nYou’re not going to see her in a ratty T-shirt from high school.\n\n[Only] if it were scripted that way. I did it once when she slept over at Danny’s [Chris Messina]. But as a general rule, no. Her sleepwear is fabulous. And the real Mindy loves it because it’s the most comfortable thing to wear on set, and she just loves being comfortable.\n\nWhat can viewers expect fashion-wise in the final season? Will there be anything particularly outrageous or unique?\n\nLet’s just say that I spent $100,000 on Dolce & Gabbana. And we’re using it. There’s a lot of Gucci. It’s our last season. I figured no one could yell at me. They can’t fire me, so I’m just going to spend like the wind.\n\nWith the real Mindy expecting, what’s the difference between designing and fitting for a fake pregnancy versus a real one?\n\nWhen we had the fake pregnancy, Mindy wrote that episode. When I made the pregnancy vest for her, she was like, “Ugh.” And I said, “What do you mean, ugh? You have to wear this.” She hated fitting in the pregnancy vest.\n\nAs a general rule, [her real pregnancy] shouldn’t affect us too much because we’ll be done hopefully before she starts showing. Some days after lunch, there is a little bit of a belly, but she still looks great.\n\nWhat I liked about the pregnancy storyline was that her maternity style didn’t differ much from her actual style.\n\nWhich is my philosophy as a designer in general. I remember when I was little, my mom, sisters, and cousins would all buy maternity dresses. That’s over. You just buy a little bit of knit and work it. You might have to buy some maternity jeans. But I don’t think you should have to buy maternity clothes. Why spend the money on clothes that you’ll never wear again? We made a very conscious effort to not buy her maternity clothes. There were just lots of knits.\n\nDescribe your conversations with Mindy about designing for the final season. Was there anything she really wanted to see before the show came to an end?\n\nIt’s more like an aesthetic. We go to the designers. What do we see? What do we like? We love what Gucci is doing right now. Dolce & Gabbana always has the best prints, so there’s a lot of Dolce & Gabbana. It’s funny because I used to have to do these mixed-prints things myself, but now I’m finding those pieces [already made]. I found an MSGM dress the other day that had two different prints of orange flowers on the top, and an orange and black plaid skirt. I used to have to put those together, and now I can just buy them because people are doing my aesthetic.\n\nSo you were way ahead of the curve.\n\nI take full credit for it. I was at Nordstrom, and there was a lace pinafore dress over a polka-dotted blouse. I’m like, “Okay, that’s fully us.” Nobody did that before us. That’s great that we are influencing fashion, because people are taking their clothes and wearing them in ways they never planned on before, which gives them more wardrobe.\n\nI’m not trying to have a huge ego here, but the prints and the way we use prints have really exploded since I’ve been on the show. The reason we started building them is because it wasn’t out there, and now it’s out there. So what came first, the chicken or the egg?\n\nMindy, when I first met her, did not want to wear prints or florals. I said, “Well, no — they look good, you have to find the right one.” There has to be movement in the fabric. It can’t be repetitive. There has to be a lot of motion. And now she’s on the cover of InStyle in a floral dress, and I’m like, “Ha!”\n\nIf you absolutely had to pick, what are a few of your favorite looks from the show?\n\nThe green Christmas dress [from season 3]. As a designer, it’s very satisfying to have that idea and to have the resources. I know the beader who beaded [for] Funny Girl and Titanic; she’s a friend of mine, and I got her out of retirement to bead that dress for Mindy. It’s just beautiful. For the fans, seeing the handiwork that was done to that dress is fabulous. Again, the yellow Madeline dress and coat. I love that outfit. It’s the epitome of Mindy’s style — the color-blocking, the floral, the coordination. It’s very Mindy.\n\nThe one that people haven’t seen yet is the purple tassel dress. Again, it’s the workmanship.\n\nAre there any supporting characters’ style that you have really enjoyed designing for?\n\nOh god, yes. People always think of Mindy because the show is called The Mindy Project, but I am very proud of the men on the show. Danny had his little Ralph Lauren look. Jeremy [Ed Weeks] — I mean, I live vicariously through him. If I were to wear a suit every day, I would look like Ed Weeks. He’s a peacock. It’s all purples, blues, and pinks — very put-together and polished. Then they brought in Jody [Garret Dillahunt]. He’s Southern, he wears suspenders, he’s very traditional.\n\nNow that I pull for Jeremy and Jody at the same time, I have to make sure their colors don’t clash and that they aren’t both in blue suits. There’s a little bit of crossover because my whole point is that they were college buddies, so they had to have some similarities. It’s a very funny thing that I’m sure only I notice, but I have a lot of fun with the shirt-and-tie combinations. The men on the show have been equally well-dressed.\n\nThat goes across the board to all of our guest stars. Since Mindy’s clothes are heightened and so special, I couldn’t put everybody else in, you know, Gap. It would look odd. So I really heightened everybody around her. Anna, who’s very steely and wears black and navy, is still couture. It’s Roland Mouret, Hugo Boss, and Theory. She’s the complete antithesis of Mindy: There’s no color. There’s no embellishment. It’s very sleek. It’s icy. But I love having that contrast between her and Mindy.\n\nWhat have you enjoyed most about working on The Mindy Project?\n\nThe collaboration with Mindy. You talk to any costume designer, and the biggest part of our job is begging actors for fittings. They don’t want to do it. They don’t want to take the time. They just want to look fabulous, but nobody wants to take the time for fittings because they’re busy.\n\nMindy has always given me the time. Mindy will give up her lunch break. Mindy will come in on a Saturday. Mindy will stay after work because she understands that fittings are important. I can only make her look that good if I have her try it on, alter it, fit it to her, and accessorize. I will never have a collaborator like Mindy Kaling. She has been there for us and has been a part of the process. She allows me to do my job and inspires me to do my job. She really is my muse.\n\nThe Paley Center for Media is hosting a costume exhibit in honor of the show right now. How did that come about?\n\nHulu had come to us and asked, “Would you consider doing a museum exhibit of the costumes from the show?” And I’m like, “Hello!” It’s a huge honor because the shows that have had exhibits before were Outlander, Hairspray, The Handmaid’s Tale, and American Horror Story — these big, costume-y shows.\n\nThe fact that they’re putting our contemporary show in that same category really speaks to the audience and the appreciation of what we’re doing. People think contemporary clothes just happen. I put the same amount of effort — if not more — into my contemporary shows as most people do into period shows. It’s so detailed. A lot of it is built, a lot of it is remade, and a lot of it is layers. When people think contemporary clothes, they think you pull them from the store and that’s it. No, no, no. When you see what I start with and what I finish with, that’s what costume design is.\n\nThe exhibit’s been called “immersive.” What will that look like for visitors?\n\nI put so much detail into the clothes that you never see on camera. What I’ve found is that when Mindy puts them on, she notices the beautiful silk linings and the handiwork, and it makes her feel special. I think that shows on camera, but the audience never gets to see any of those details. Now they get to see them up close and personal. And the exhibit not only shows my design work and Mindy’s costumes, but [also] my cutter and fitter support, who have made all of these clothes.\n\nI’m so flattered and honored by the response of the fans [to the show’s clothes]. My Instagram following is huge because of The Mindy Project. People have their favorites, but now they get to actually see them in one room and see the details. I think it’ll be a fun opportunity for the fans.\n\nThe Mindy Project season 6 premieres September 12th on Hulu.", "images": ["https://cdn.vox-cdn.com/thumbor/suHN1UnDJiyO1ZAwPR-38g8hRqw=/0x0:3000x2000/1200x0/filters:focal(0x0:3000x2000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9229209/mindy_project_pregnant.jpg", "https://cdn.vox-cdn.com/thumbor/qBS2-DDZ19JVgcUAw2LcB5hZ_3Q=/0x0:2000x3000/1200x0/filters:focal(0x0:2000x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9229295/mindy_project_paley_center.jpg", "https://cdn.vox-cdn.com/thumbor/IbIYHsMc-wrXaBq8RL-3-jemnSc=/0x0:3000x2004/1200x0/filters:focal(0x0:3000x2004):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9223795/mindy_project_pajamas.jpg", "https://cdn.vox-cdn.com/thumbor/-GUQYYJgmOrXCf0--JZPW34o0js=/0x0:1536x1024/1200x675/filters:focal(503x327:747x571)/cdn.vox-cdn.com/uploads/chorus_image/image/56639333/mindy_project_season_6.0.jpg", "https://cdn.vox-cdn.com/thumbor/5jDfpMjfra_ImbFtI9Nkh9ttL1M=/0x0:3000x2000/1200x0/filters:focal(0x0:3000x2000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9229105/mindy_project_anna_jeremy.jpg", "https://cdn.vox-cdn.com/thumbor/ycclL8sUTG59UJXMXkCh4tYbUeY=/0x0:1536x1024/1200x0/filters:focal(0x0:1536x1024):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9229389/mindy_project_season_6_tassels.jpg", "https://cdn.vox-cdn.com/thumbor/nln5ccJIypvCPe4YHRwd2Bk6OBQ=/0x0:2000x3000/1200x0/filters:focal(0x0:2000x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9223833/mindy_project_christmas_dress.jpg", "https://cdn.vox-cdn.com/thumbor/_FVHJj5t_nUbBDdtKWSAQe9T_hY=/0x0:3000x2000/1200x0/filters:focal(0x0:3000x2000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9223751/mindy_project_black_crystal_dress.jpg", "https://cdn0.vox-cdn.com/thumbor/IBIF7DMZlt16slNGRMAZ7_IQRpU=/0x47:1536x851/fit-in/1200x630/cdn1.vox-cdn.com/uploads/chorus_asset/file/9229369/mindy_project_season_6.jpg", "https://cdn.vox-cdn.com/thumbor/MaFzpnfz9WjVTw8ikVgNYxuqYoY=/0x0:3000x2000/1200x0/filters:focal(0x0:3000x2000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9223687/mindy_project_yellow_dress.jpg"], "top_img": "https://cdn0.vox-cdn.com/thumbor/IBIF7DMZlt16slNGRMAZ7_IQRpU=/0x47:1536x851/fit-in/1200x630/cdn1.vox-cdn.com/uploads/chorus_asset/file/9229369/mindy_project_season_6.jpg", "keywords": [], "authors": ["Mekita Rivas", "Sep"], "canonical_link": "https://www.racked.com/2017/9/12/16277802/mindy-project-costumes-fashion", "title": "The Mindy Project’s Final Season Features $100,000 Worth of Dolce & Gabbana", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Racked", "article": {"publisher": "https://www.facebook.com/rackednational", "published_time": "2017-09-12T14:02:01-04:00", "modified_time": "2017-09-12T14:02:01-04:00"}, "author": "Mekita Rivas", "style-tools": "https://www.racked.com/style/community/522/0d59761c475a67bd70b8e919399b75c2/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Plus, costume designer Salvador Perez looks back at Mindy’s best style moments.", "og": {"description": "Plus, costume designer Salvador Perez looks back at Mindy’s best style moments.", "image": {"identifier": "https://cdn0.vox-cdn.com/thumbor/IBIF7DMZlt16slNGRMAZ7_IQRpU=/0x47:1536x851/fit-in/1200x630/cdn1.vox-cdn.com/uploads/chorus_asset/file/9229369/mindy_project_season_6.jpg", "alt": "Mindy Kaling as Mindy Lahiri in season 6 of The Mindy Project.", "height": 630, "width": 1200}, "site_name": "Racked", "title": "The Mindy Project’s Final Season Features $100,000 Worth of Dolce & Gabbana", "type": "article", "url": "https://www.racked.com/2017/9/12/16277802/mindy-project-costumes-fashion"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.racked.com/2017/9/12/16277802/mindy-project-costumes-fashion", "title": "The Mindy Project’s Final Season Features $100,000 Worth of Dolce & Gabbana", "description": "Plus, costume designer Salvador Perez looks back at Mindy’s best style moments.", "image": {"identifier": "https://cdn0.vox-cdn.com/thumbor/IBIF7DMZlt16slNGRMAZ7_IQRpU=/0x47:1536x851/fit-in/1200x630/cdn1.vox-cdn.com/uploads/chorus_asset/file/9229369/mindy_project_season_6.jpg", "alt": "Mindy Kaling as Mindy Lahiri in season 6 of The Mindy Project."}, "site": "Racked"}, "sailthru.title": "The Mindy Project’s Final Season Features $100,000 Worth of Dolce & Gabbana", "sailthru.tags": "general,racked,front-page,shopping,entertainment", "sailthru.description": "Plus, costume designer Salvador Perez looks back at Mindy’s best style moments.", "sailthru.date": "2017-09-12T14:02:01-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/icmK5cRkEatdSmr8K1h_30U6Q78=/0x17:1536x881/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56639331/mindy_project_season_6.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/yenvNoSDmE2xJ15mZxbbMRMZ7zQ=/113x0:1137x1024/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/56639331/mindy_project_season_6.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/10131605/144x144.0.png", "msapplication-TileColor": "#FF0080", "outbrainsection": "shopping"}, "movies": [], "publish_date": 1505145600.0, "source": "https://www.racked.com", "summary": ""}