{"url": "https://popculture.com/celebrity/2017/10/04/miley-cyrus-howard-stern-interview-vmas-liam-hemsworth/", "text": "Miley Cyrus isn't one to hold back when sharing stories, so it's no surprise that the singer's new interview on The Howard Stern Show covered a wide range of topics, including her fiancé, Liam Hemsworth, the MTV VMAs, her new music and marijuana use. The 24-year-old candidly discussed her new album, Younger Now and how she didn't want Hemsworth to listen to it before it premiered, including the fact she won't tour to support the record because of her two pigs. \"Literally the only reason I'm not touring is because of those f--ing pigs,\" she said. \"That's how much I love those pigs.\" Read on to see what else Cyrus had to say.\n\nSlide 1/3 – On Liam Hemsworth While the two are happily together now, they previously broke up in 2013 after calling off their engagement. Hemsworth needed a place to live, so he unknowingly purchased the Malibu home Cyrus had used to record her first album. \"The person [selling the house] hid all the plaques in the garage so he would still buy the house,\" Cyrus explained, according to E! News. \"So then he went to move in and he was like 'F---, I cannot get away, this b---- is all over my f---ing house!\" Now, the two live in the house together, and Cyrus even wrote her song \"Malibu\" about the space. The singer said Hemsworth is \"the most normal NORMAL part of my life.\"\n\nSlide 2/3 – On the VMAs Cyrus famously caused controversy at the 2013 show when she performed with Robin Thicke, gyrating on the singer while wearing a nude latex ensemble and a foam finger. Cyrus explained that the performance showed her own power, which she utilized the next year when she brought a homeless teen to the show. \"I didn't like it because I thought I had done something that was gonna make everyone talk about me. That's not why I liked it,\" she explained. \"The reason why that's the best thing that's ever happened to me in my life is that's when I realized my power. I brought a young homeless teen because I realized my f---ing power there.\"", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2017/10/04/miley-cyrus-howard-stern-interview-vmas-liam-hemsworth/", "title": "The Most Fascinating Facts From Miley Cyrus' Interview With Howard Stern", "meta_data": {"description": "Miley Cyrus isn't one to hold back when sharing stories, so it's no surprise that the singer's new interview on The Howard Stern Show covered a wide range of topics, including her fiancé, Liam Hemsworth, the MTV VMAs, her new music and marijuana use.The 24-year-old candidly discussed her new [...]", "keywords": "Miley Cyrus,Celebrity News,Celebrities,interview,Howard Stern,Howard Stern Show", "news_keywords": "Miley Cyrus,Celebrity News,Celebrities,interview,Howard Stern,Howard Stern Show", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "The Most Fascinating Facts From Miley Cyrus' Interview With Howard Stern", "description": "Miley Cyrus isn't one to hold back when sharing stories, so it's no surprise that the singer's [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "The Most Fascinating Facts From Miley Cyrus' Interview With Howard Stern", "type": "article", "url": "https://popculture.com/celebrity/2017/10/04/miley-cyrus-howard-stern-interview-vmas-liam-hemsworth/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "Miley Cyrus isn't one to hold back when sharing stories, so it's no surprise that the singer's [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1507046400.0, "source": "https://popculture.com", "summary": ""}