{"url": "www.inquisitr.com/4996619/kendall-kylie-jenner-still-close-after-stormis-birth-despite-rumors/", "text": "Kendall and Kylie Jenner are the two youngest members of their family, and very close in age. However, things have drastically changed for the sisters over the years.\n\nAccording to a report by Gossip Cop, rumors have been flying that Kendall and Kylie Jenner are no longer as close as they used to be since Kylie became a mother to her baby girl, Stormi Webster. Sources reportedly claim that since Kylie became a mother, she and Kendall really have nothing in common.\n\nMeanwhile, Kendall Jenner is busy “jet-setting around the world and having fun on the dating scene” as she builds up her modeling career. All the while Kylie is said to be “wrapped up” in being Stormi’s mother, as well as focusing her cosmetic company. The alleged sources went on to claim that Kendall and Kylie can be very competitive with each other, which also causes problems.\n\nHowever, the outlet claims that all of the rumors about Kendall and Kylie Jenner’s relationship are not true, citing that Kendall would have become more distant with sister Khloe Kardashian, who also welcomed a baby this year. However, Khloe and Kendall are very close, and have been spotted hanging out together multiple times since Khloe’s return to L.A. in June.\n\nAs previously reported by the Inquisitr. Kendall and Kylie Jenner recently spent the day together, and even had a sisters photo shoot. The girls took multiple photos together posing for the cameras at different angles.\n\nlove u sister @kendalljenner A post shared by Kylie (@kyliejenner) on Jul 17, 2018 at 2:42pm PDT\n\nHowever, there was a little bit of drama when both Kendall and Kylie posted the photos to their social media accounts, but Kendall cropped Kylie out of the picture and focused on her own face, complete with modeling pose. Fans called Kendall out for cutting her little sister out of the photo, but Kendall soon posted an entire slideshow of the pictures with Kylie Jenner.\n\nMeanwhile, both of the Jenner sisters are very busy these days. Kylie has been adjusting to life as a mother and running her makeup company, which is set to put her over the $1 billion mark very soon. She’s also cultivating her relationship with Travis Scott, who recently appeared on the cover of GQ Magazine with Jenner.\n\nKendall Jenner is also very busy. She is currently one of the highest paid super models in the world, and has contracts to endorse many big companies, including Adidas. She also walks the runway in some of the biggest fashion shows, and is currently dating the NBA’s reigning Rookie Of The Year, Ben Simmons.", "images": ["https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Kendall-and-Kylie-Jenner.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4996619/kendall-kylie-jenner-still-close-after-stormis-birth-despite-rumors/", "title": "Kendall And Kylie Jenner Still Close After Stormi’s Birth, Despite Rumors", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}