{"url": "https://ew.com/tv/2017/04/12/survivor-jeff-probst-zeke-transgender-jeff-varner/", "text": "Survivor type TV Show network CBS genre Reality Where to watch Close Streaming Options\n\nEach week host Jeff Probst will answer a few questions about the most recent episode of Survivor: Game Changers. This week, he gives his on-the-scene and behind-the-scenes insight and reaction to Jeff Varner outing Zeke Smith as transgender.\n\nENTERTAINMENT WEEKLY: Okay, so clearly a lot to unpack here with Jeff Varner outing Zeke as trans on national television. Let’s start with your initial reaction when Jeff said that at Tribal Council.\n\nJEFF PROBST: I’m pretty sure my reaction was the same as viewers watching at home. I saw Jeff Varner turn to Zeke and make what was essentially a statement — vaguely disguised as a question: “Why haven’t you told anyone here you’re transgender?” On one hand, it was such a tiny moment… so simple and quiet… that I wasn’t certain I heard what I heard. My brain had to rewind and play it back. And if you watch the reaction at Tribal, Zeke’s tribemates seemed to go thru the same moment. They heard it… but had to process it… and then once it landed they responded quite vocally. And while they were sharing their feelings with Varner, I was still running it in my head. This… just… happened.\n\nIt seems everyone on the tribe — Tai, Andrea, Ozzy, Debbie, Sarah — had their moment of telling Jeff in very strong language that what he did was completely unacceptable. What did you make of what I would describe as their unified disgust at what had happened?\n\nIn 34 seasons of Survivor, I have rarely, if ever, personally commented on what is said or done in the game. But this is a unique situation that falls outside the normal boundaries. I cannot imagine anyone thinking what was done to Zeke was okay on any level, under any circumstances, and certainly not simply because there was a million dollars on the line. I think the response from the tribe, as it so often does, mirrors what the vast majority of society will feel. You just don’t do that to someone.\n\nWitnessing that moment was so powerful because from my seat at Tribal, I could see it all. Varner was in the middle being attacked by angry tribemates while Zeke sat in the corner, outside of the action in what appeared to be a mild state of shock. It was one of the most surreal moments I’ve ever encountered on the show. From the outside, it looked and sounded like a regular Tribal Council but in reality, it was one of the most raw and painful studies of human behavior that has ever happened on Survivor.\n\nZeke was so composed in his response to what Jeff Varner did. How impressed were you with his reaction?\n\nWe knew Zeke was a tremendous storyteller with an amazing ability to take a specific moment from the game or life and give it a universal perspective. That’s why we asked him back to play a second time. And yet I was still blown away by how he handled the entire situation. It was as if he had been preparing for this absolutely unpredictable, completely public, and incredibly vulnerable moment for his entire life. His composure was astounding. And when he connected the entire event to the word metamorphosis, I distinctly remember thinking — how in the world did you just do that?\n\nI was also very impressed with the compassion Zeke showed Varner. I wonder if some people will say he shouldn’t have hugged him or shouldn’t have forgiven him. But as a viewer to that moment, I found his ability to still find some level of humanity for someone who had just injured him so severely, maybe his crowning moment.\n\nAnd there is another moment that I hope was as inspiring for others as it was for me, and that was when Sarah told Zeke she was glad she got to know Zeke for who Zeke is and would never see him any other way. That moment — when a police officer from a conservative Midwest background without much exposure to the “gay and lesbian and transgender world” realized her own growth, her own metamorphosis, it completed the circle. This is how change and acceptance happens.\n\nWatch PEN Fan Forum: Survivor, on the new PEOPLE/Entertainment Weekly Network (PEN) here, or download the free app on your Smart TV, mobile and web devices. And check out an exclusive deleted scene at the top of this post.\n\nWhen you spoke with Zeke before his first season during the interview process, did the subject ever come up in terms of whether he planned to tell players he was trans and how he would handle it if someone brought it up?\n\nMy story with Zeke goes like this. I met Zeke in casting and loved him. I still have my original notes from that meeting. He was very engaging, gifted in his ability to manipulate with his words, and he wore this crazy Hawaiian shirt and had poofy hair. We knew we were doing Millennials vs. Gen X as a theme and we wanted him on the Millennials tribe immediately. It wasn’t until after he left that I was told he was transgender. From that point forward we agreed that if his story was to be told, he would be the one to decide when, where, and how.\n\nAs for someone else bringing it up, Zeke was fully aware someone might suspect it or bring it up and he said, “I will deal with it as it arises.” And I have to add it was never a question of Zeke being worried his story would come out. ,Zeke is a massive Survivor fan and his point with us was very clear — he wanted to be seen as a Survivor player. Not the first transgender Survivor player. I really respected that distinction and I understood it.\n\nThe tribe was clearly all shaken by this incident. How were you after Tribal Council finished?\n\nI don’t really remember a lot about my own feelings in the moments after Tribal. I remember feeling that Zeke seemed very centered when he left Tribal, despite what he had gone through and I believed his tribemates would help him work through things back at camp. But we were in touch with the producer on the beach that night to just ensure everything was going okay.\n\nAnd then the other concern was Jeff Varner. Although I do not condone on any level what Varner did, I was still aware that he was without any of his support group of family and friends. He would be returning to Ponderosa, where voted out contestants go, after making one of the worst decisions of his life. Fortunately, we have a full-time psychologist on staff who knows all of the contestants and is there to help them through any of the many things that come up on Survivor. I think those sessions in the days after the event helped Varner as he tried to make sense of everything.\n\nHave you spoken to Jeff Varner at all since this incident and do you think he is genuinely mortified by what he did?\n\nI spoke with Varner the day after it happened and I think he was still in a bit of shock. It was clear he was upset and the realization of it all was still washing over him. I do believe he wishes he could take the entire event back. I hope Varner is able to take this moment and turn it into something positive. People make mistakes. Granted this happens to be a pretty severe one, but as you saw even with Zeke — there is hope that something good can come from this. That would be my wish… that Varner will seize this as an opportunity to be a catalyst for positive change by owning his mistake and moving forward in a new direction.\n\nFinally, we always take a sneak peek at what’s coming up. I know we have a merge on the horizon. And I have to imagine the Nuku tribe will still be decompressing from what just happened.\n\nI’m going to break tradition tonight and let the events of this very special episode breathe for a moment. But Survivor will be back next week… and someone will be voted out. The game continues.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fprobst000051-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Fs36_ep14_sg_017b-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fprobst000051-2000.jpg", "keywords": [], "authors": ["Dalton Ross", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd", "Maggie Fremont"], "canonical_link": "https://ew.com/tv/2017/04/12/survivor-jeff-probst-zeke-transgender-jeff-varner/", "title": "Survivor: Jeff Probst reacts to Jeff Varner outing Zeke as transgender", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Jeff Probst", "news_keywords": "Jeff Probst", "description": "'I cannot imagine anyone thinking what was done to Zeke was okay on any level,' says the host about what Jeff Varner did on 'Survivor: Game Changers'", "og": {"title": "'Survivor': Jeff Probst Reacts Strongly to Jeff Varner outing Zeke as Transgender", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/04/12/survivor-jeff-probst-zeke-transgender-jeff-varner/", "description": "Each week host Jeff Probst will answer a few questions about the most recent episode of Survivor: Game Changers. This week, he gives his on-the-scene&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fprobst000051-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2017/04/12/survivor-jeff-probst-zeke-transgender-jeff-varner/", "description": "'I cannot imagine anyone thinking what was done to Zeke was okay on any level,' says the host about what Jeff Varner did on 'Survivor: Game Changers'", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fprobst000051-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/04/12/survivor-jeff-probst-zeke-transgender-jeff-varner/", "title": "'Survivor': Jeff Probst Reacts Strongly to Jeff Varner outing Zeke as Transgender", "description": "'I cannot imagine anyone thinking what was done to Zeke was okay on any level,' says the host about what Jeff Varner did on 'Survivor: Game Changers'", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fprobst000051-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1491926400.0, "source": "https://ew.com", "summary": ""}