{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/08/07/everything-you-need-to-know-about-the-top-chef-extortion-trial/", "text": "The events are said to have transpired in June 2014, and the federal court proceedings, which began on July 31 with the selection of 12 jurors, are expected to last two weeks.\n\nHere’s what we know about the situation:\n\nThe events allegedly took place while taping outside Steele & Rye, a restaurant in Milton, Mass.\n\nAD\n\nProsecutors claim the Teamsters — Robert Cafarelli, John Fidler, Daniel Redmond and Michael Ross — verbally harassed and “chest-bumped” members of the Bravo series’s nonunion crew out of anger that the producers had not hired union drivers, according to ABC News. (Production assistants drove instead.) Prosecutors also allege that a Teamster attempted to block a vehicle carrying Lakshmi from entering Steele & Rye’s driveway, telling the celebrity host something along the lines of, “We’re going to bash your pretty little face in.”\n\nAD\n\nThe jurors have to decide whether the defendants’ actions qualify as extortion.\n\nThe Teamsters had threatened to picket if “Top Chef” producers didn’t hire union drivers, according to the Boston Globe, and defense lawyers have said the union members have a right to picket if they choose.\n\nAD\n\n“This is the life of America. People have a right to organize and demand things from employers,” said Kevin Barron, Ross’s lawyer. “There was no extortion, no crime, no conspiracy. . . . Just five middle-aged truck drivers doing a picket.”\n\nProspective jurors were questioned about their “feelings on organized labor, lewd, sexist and racist language, and law enforcement,” the Globe reported. The Teamsters, if convicted, could face sentences up to 20 years. (Mark Harrington, a fifth Teamster, pleaded guilty to attempted extortion in September and was consequently sentenced to two years probation and six months of confinement.)\n\nAD\n\nProsecutors have questioned the conduct of local police, too.\n\n\n\nAD\n\nProsecutors stated on Friday that local police officers failed to intervene when the Teamsters allegedly harassed the “Top Chef” team, Deadline reported. Multiple witnesses have claimed the officers did nothing — no arrests were made following the incident — and the prosecutors showed photos of slashed tires on vehicles belonging to the “Top Chef” crew members.\n\n“I got bumped from behind,” production assistant Ian Buchanan testified on Friday, according to Deadline. “I didn’t see who hit me. A group of men cornered me. The police saw the skirmish. He told me to leave them alone. I was confused because I didn’t start the altercation.”\n\nLakshmi testified Monday morning that she was “terrified” when she arrived at Steele & Rye.\n\nAD\n\nLakshmi said the Teamsters had formed a line to block the vehicle from driving farther, the Globe reported, and that her driver “looked terrified” as well. One of the men approached the vehicle, verbally threatened Lakshmi and yelled something “derogatory” at the driver, she said. “I just didn’t want to get out of the car, it was an uncomfortable situation to me,’’ she said, according to the Globe.\n\nAD\n\nThe court proceedings do not seem to have affected the show’s future.\n\nThough a premiere date has yet to be announced, Bravo confirmed in March that the 15th season of “Top Chef” would take place in Colorado. Lakshmi will return as the host, according to Entertainment Weekly, along with judges Tom Colicchio, Gail Simmons and Graham Elliot.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9624aab6-2742-4553-9ae0-96a331f3e138.png&w=90&h=90", "https://www.washingtonpost.com/resizer/kj4zfuHIWqkQ7CbW5S2vtOAsPh0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MYSUOVWJ6A5ULLRTXHGNCVP5KE.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MYSUOVWJ6A5ULLRTXHGNCVP5KE.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/kj4zfuHIWqkQ7CbW5S2vtOAsPh0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MYSUOVWJ6A5ULLRTXHGNCVP5KE.jpg", "keywords": [], "authors": ["Sonia Rao", "Pop Culture Reporter"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/08/07/everything-you-need-to-know-about-the-top-chef-extortion-trial/", "title": "Everything you need to know about the ‘Top Chef’ extortion trial", "meta_data": {"description": "\"Top Chef\" host Padma Lakshmi testified on Aug. 7 in a trial that pits the TV show against a group of Teamsters.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/08/07/everything-you-need-to-know-about-the-top-chef-extortion-trial/", "image": "https://www.washingtonpost.com/resizer/kj4zfuHIWqkQ7CbW5S2vtOAsPh0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MYSUOVWJ6A5ULLRTXHGNCVP5KE.jpg", "title": "Everything you need to know about the ‘Top Chef’ extortion trial", "description": "\"Top Chef\" host Padma Lakshmi testified on Aug. 7 in a trial that pits the TV show against a group of Teamsters."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Everything you need to know about the ‘Top Chef’ extortion trial", "description": "\"Top Chef\" host Padma Lakshmi testified on Aug. 7 in a trial that pits the TV show against a group of Teamsters."}, "last_updated_date": "2018-02-26T00:45:29.890Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1502035200.0, "source": "https://www.washingtonpost.com", "summary": ""}