{"url": "www.thisisinsider.com/lady-gaga-fibromyalgia-chronic-pain-2017-9", "text": "Lady Gaga Alberto E. Rodriguez/ Getty Images\n\nThe INSIDER Summary:\n\nLady Gaga's new documentary will discuss her struggles with chronic pain and fibromyalgia.\n\nThe singer has previously spoken about her battle with the disorder on social media.\n\nFibromyalgia causes widespread pain and is not curable.\n\nIn 2016, Lady Gaga revealed an Instagram post is 2016 that she suffers from \"chronic pain\" but never gave more details. But in her upcoming documentary, \"Gaga: Five Foot Two,\" the singer and actress dives a little deeper into the disease she's been battling for some time.\n\nThe singer recently tweeted that the chronic pain she deals with is fibromyalgia, a disorder that is more common than people may think. In the tweet, she wrote that she wants to, \" help raise awareness and connect people who have it,\" CNN reports.\n\nFibromyalgia is a chronic pain disorder that causes tenderness to touch or pain over the body.\n\nAccording to the National Fibromyalgia & Chronic Pain Association, the disease can vary in intensity and affects people \"physically, mentally, and socially.\" People suffering from this disorder, which often manifests itself in adolescence or young adulthood, feel more pain than would be typically expected. Because of this pain, a few common symptoms include fatigue, tenderness, sleep disorders, memory problems, depression, and stiffness.\n\nThe foundation also reports that 10 million Americans suffer from fibromyalgia with a ratio of eight to two ratio, women over men.\n\nThere is no cure for this pain, and it is a lifelong condition.\n\nHaving a frustrating day with chronic pain, but I find myself feeling so blessed to have such strong intelligent female doctors. I think about Joanne too and her strength and the day gets a little easier. Plus I got @wanaynay by my side. \"Hey Girl, we can make it easy if we lift each other.\" 🌸 A post shared by xoxo, Gaga (@ladygaga) on Nov 17, 2016 at 1:49pm PST Nov 17, 2016 at 1:49pm PST\n\nThe disease can occur on its own but has also been linked to stress, repetitive injuries, and other diseases like Lupus, according to the National Institute of Arthritis and Musculoskeletal and Skin Diseases. Researchers are working to determine definitively what causes people to develop this pain in the hopes of finding a cure or better treatment options.\n\nHealthline reports that treatment typically goes beyond medication and focuses on improving quality of life through self-care and lifestyle changes. Medication options vary from antidepressants and sleep aids to pain relievers and narcolepsy drugs.\n\nOther celebs have opened up about their struggle with chronic pain or fibromyalgia.\n\nGeorge Clooney Getty Images/Chip Somodevilla\n\nIn addition to Gaga, Morgan Freeman has specifically spoken about dealing with fibromyalgia. In an interview with Esquire, the actor described the pain. \"Up and down the arm,\" he said. \"That's where it gets so bad. Excruciating.\" The actor doesn't let this pain stop him from doing some of the things he enjoys like golfing or walking, but he can't fly pilot jets or drive.\n\nAccording to ABC, other stars that have suffered from chronic pain include Paula Abdul, George Clooney, and Tobey Maguire.\n\nIn a press conference, Gaga said that the \"pain is a microphone\" and it \"does me no good unless I transform it into something that is,\" Variety reports. Here's hoping \"Gaga: Five Foot Two,\" which will be available on September 22 on Netflix, inspires others suffering to transform the pain.", "images": ["https://i.insider.com/59b938dbe517bd38008b46d4?width=600&format=jpeg&auto=webp", "https://i.insider.com/56d7402edd0895260c8b4696?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "http://www.thisisinsider.com/lady-gaga-fibromyalgia-chronic-pain-2017-9?width=600&format=jpeg&auto=webp", "https://i.insider.com/59c12b9059d82e89358b4971?width=1200&format=jpeg"], "top_img": "https://i.insider.com/59c12b9059d82e89358b4971?width=1200&format=jpeg", "keywords": [], "authors": ["Emily Dinuzzo"], "canonical_link": "https://www.insider.com/lady-gaga-fibromyalgia-chronic-pain-2017-9", "title": "Here's what you should know about fibromyalgia, the chronic pain disorder that forced Lady Gaga to cancel parts of her tour", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Here's what you should know about fibromyalgia, the chronic pain disorder that forced Lady Gaga to cancel parts of her tour", "date": "2017-09-19", "news_keywords": "Health, chronic illness, Lady Gaga, Fibromyalgia, Disease, Pain, Treatment, Documentary, Emily DiNuzzo", "description": "The singer says she's been suffering from fibromyalgia for years, and hopes to raise awareness.", "author": "Emily DiNuzzo", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Health", "og": {"title": "Here's what you should know about fibromyalgia, the chronic pain disorder that forced Lady Gaga to cancel parts of her tour", "description": "The singer says she's been suffering from fibromyalgia for years, and hopes to raise awareness.", "type": "article", "url": "https://www.insider.com/lady-gaga-fibromyalgia-chronic-pain-2017-9", "image": "https://i.insider.com/59c12b9059d82e89358b4971?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Here's what you should know about fibromyalgia, the chronic pain disorder that forced Lady Gaga to cancel parts of her tour", "sailthru.date": "2017-09-19", "sailthru.tags": "Health, chronic illness, Lady Gaga, Fibromyalgia, Disease, Pain, Treatment, Documentary, Emily DiNuzzo", "sailthru.description": "The singer says she's been suffering from fibromyalgia for years, and hopes to raise awareness.", "sailthru.author": "Emily DiNuzzo", "sailthru.verticals": "health, culture", "sailthru.image.full": "https://i.insider.com/59b9606ae517bd1b008b4722?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/59b9606ae517bd1b008b4722?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "Here's what you should know about fibromyalgia, the chronic pain disorder that forced Lady Gaga to cancel parts of her tour": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 200, "back-to-top": "control", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "variant", "subscribe-smallest-price": "variant"}, "viking-id": "59b933a0e517bd1d298b45f7", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1505750400.0, "source": "http://www.thisisinsider.com", "summary": ""}