{"url": "https://hollywoodlife.com/2017/08/17/la-la-anthony-workout-routine-diet-plan-beauty-products-interview/", "text": "Let’s not ignore the obvious — La La Anthony’s never looked better! The ‘Power’ star is sharing her workouts, daily eating schedule and beauty routine, which involves some KKW contouring, of course!\n\nIf there’s one star who’s crushing 2017 so far, it’s La La Anthony, 38. She’s killing it as LaKeisha in the Starz hit show, Power; she has a clothing line with Lorde & Taylor on the way, and she just wrapped filming on a movie, where she stars alongside Whoopi Goldberg, 61. So, it’s no secret that La La’s career is flourishing. And, that’s all due to her hard work ethic and raw talent. But, La La also credits her success to being in the best shape of her life, both mentally and physically. When HL EXCLUSIVELY chatted with the entrepreneur, she took us inside her healthy lifestyle, where she dished on everything from sweating it out at NYC’s star-studded gym, The Dogpound, to her eating and beauty routines, which includes her favorite product, Arm & Hammer Baking Soda!\n\nAnyone who knows La La, knows that she doesn’t half-a-s anything, which is why she takes her high tensity workouts to NYC-based training facility, The Dogpound; also the workout destination for some of Victoria’s Secret’s hottest models, including Adriana Lima, 36. And, La La’s got the VIP in. “The Dogpound is actually close to my house; the owner [CEO and Founder, Kirk Myers] and I are very close friends,” La La tells us. “And, I love to box.” But, the actress, knows that when it comes to looking your best it’s not only about sweating it out in the gym.\n\n“With looking right, it’s mostly about your eating,” she admits. “And, I feel like a lot of us struggle with that. I’m trying to stay consistent in making better choices when it comes to food. I can’t say I’m always great at it, but I try to keep that in mind. You can’t work your a-s off in the gym and then just throw it all away by eating horrible.” Ultimately, La La says she’s just trying to “find the balance” with hustling in the gym, and fueling her body the right way. So, with that being said, she filled us in on her daily food diary. And, it’s not as complicated as you may think…\n\nLa La stays hydrated throughout the entire day, which is also part of her beauty routine [which you will see below]. In the morning, she starts her day with a protein shake. Then, for lunch, La La will have a piece of fish or chicken with vegetables. And, the same goes for dinner. Throughout the day, if she’s hungry and needs a snack, La La will reach for a protein bar of any kind. And, like she said, it’s all about the balance, which she’s still perfecting. So, if it’s one of those days where she either cheats or treats herself, she’ll reach for her weakness, some chocolate; aka, her favorite, Nestle Crunch.\n\nWith physical, comes mental health, and both are equally important. And, no one understands that better than La La, who lives by the saying, “When you look good, you feel good.” Right now, La La’s looking and feeling real good, if she does say so herself. Despite anything going on in her life, including her public split from husband, Carmelo Anthony, 32, La La says she’s in a really good place. The stunning star confesses that working out and eating right have been major factors in getting her there because it’s been “therapeutic.”\n\n“When you’re putting time into yourself and you’re really seeing the work pay off, you just have a different confidence about yourself. I’m definitely in a great place,” La La explains. “I feel confident, I feel happy and I’m just ready for what the next challenge is, as far as work is concerned; especially with acting; whatever that is going to be.”\n\nAnother therapeutic tactic La La has in her life, is finally putting herself first. She explains that it’s OK to focus on yourself in the midst of life’s craziness and caring for others. “When you’re in a good place, you can focus on your kids, your job, your family; you can focus on any relationships you’re in. It’s important to put yourself first and not feel bad about that,” she points out. “Sometimes we worry about everyone else and we feel bad, instead of investing time and energy into ourselves. And, that’s where I’m at right now.”\n\nWith all of the sweat La La sheds from her intense workouts, she really looks forward to her beauty routine. “I’m always staying hydrated,” she says, adding, “It’s all about having great moisturizer and great bronzer, and I think you’re good to go.” And, what other bronzer is La La going to use than her best friend, Kim Kardashian‘s KKW contour kit! “It’s great,” she gushes about Kim’s product. “She’s one of my closest friends. I support anything she does.” And, when Kim dropped her beauty line, La La immediately phoned her for some assistance in the beauty department. “I called her and I was like, ‘You’ve got to send me a complete video tutorial, because I don’t know how to use this.’ Kim’s way more savvy with all of that stuff more than I am.” That’s what friends are for right? When La La called, Kim delivered! “She sent a cool video and the contour sticks are great, I love them!”\n\nWhen we caught up with La La she was with her friends at Arm & Hammer, who she recently partnered with because of her longtime love for the brand. “I’ve seen the brand in my life for as long as I can remember,” she recalls. “I was surprised to know about all of the things you can do with Arm & Hammer Baking Soda, which is amazing. And, lately, I’m always looking up new tricks to use it with. My most recent trick is putting a little bit of it on my toothbrush before I brush my teeth. It helps to give me a really nice, white smile!” Say what? — We had no idea! “Yes!”, La La says excitedly. “It has a million other uses — body scrub and cooking. I’m just fascinated that one product can be used for so many things!” La La, so are we!\n\nBe sure to catch La La on the small screen when Power returns to Starz in September!\n\nHollywoodLifers, what was your favorite tip from La La’s amazing advice?", "images": ["https://i2.wp.com/www.sheknows.com/wp-content/uploads/2020/04/what-i-learned-as-a-17-year-old-girl-in-the-boy-scouts.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/rolling-stones-performance-one-world-nbc-ftr.jpg?w=143&h=80&crop=1", "https://scstylecaster.files.wordpress.com/2020/04/bean-bag-chairs.jpg?resize=230%2C135", "https://pmchollywoodlife.files.wordpress.com/2020/04/lady-gaga-performance-one-world-nbc-ftr.jpg?w=143&h=80&crop=1", "https://pmchollywoodlife.files.wordpress.com/2017/06/jenna_lemoncelli.jpg?w=64&h=64&crop=1", "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128", "https://pmchollywoodlife.files.wordpress.com/2017/08/la-la-anthony-exclusive-interview-ftr.jpg?w=620", "https://pmchollywoodlife.files.wordpress.com/2020/04/taylor-swift-then-vs-now-shutterstock-ftr.jpg?w=143&h=80&crop=1", "https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel?a.1=p-6fKiDaopTGEQg&a.2=p-31f3D02tYU8zY", "https://pixel.wp.com/b.gif?v=noscript", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2020/04/10546188dy.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2017/08/la-la-anthony-exclusive-interview-ftr.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=hollywoodlife.com&path=%2F2017%2F08%2F17%2Fla-la-anthony-workout-routine-diet-plan-beauty-products-interview%2F&ct=article&lob=hollywoodlife&loc=us&env=desktop&post_id=2720992&comment_count=1"], "top_img": "https://pmchollywoodlife.files.wordpress.com/2017/08/la-la-anthony-exclusive-interview-ftr.jpg", "keywords": [], "authors": ["Jenna Lemoncelli", "Melody Fewx", "Lana Parker", "Nick Caruso", "Oscar Hartzog", "Ryan Lattanzio", "News Editor"], "canonical_link": "https://hollywoodlife.com/2017/08/17/la-la-anthony-workout-routine-diet-plan-beauty-products-interview/", "title": "La La Anthony’s Workouts That Have Her In The Best Shape Of Her Life & What She Eats In A Day", "meta_data": {"description": "It's no secret that La La Anthony is in the best shape of her life! And, when HollywoodLife.com EXCLUSIVELY chatted withe 'Power' actress, she revealed her favorite workouts and what she eats in a typical day!", "news_keywords": "La La Anthony", "apple-itunes-app": "app-id=1400650284", "generator": "WordPress.com", "og": {"type": "article", "title": "La La Anthony’s Workouts That Have Her In The Best Shape Of Her Life & What She Eats In A Day", "url": "https://hollywoodlife.com/2017/08/17/la-la-anthony-workout-routine-diet-plan-beauty-products-interview/", "description": "Let’s not ignore the obvious — La La Anthony’s never looked better! The ‘Power’ star is sharing her workouts, daily eating schedule and beauty routine, which involves some K…", "site_name": "Hollywood Life", "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/08/la-la-anthony-exclusive-interview-ftr.jpg", "width": 620, "height": 349}, "locale": "en_US"}, "article": {"published_time": "2017-08-17T23:52:13+00:00", "modified_time": "2017-08-18T01:51:21+00:00"}, "twitter": {"site": "@HollywoodLife", "text": {"title": "La La Anthony’s Workouts That Have Her In The Best Shape Of Her Life & What She Eats In A Day"}, "image": "https://pmchollywoodlife.files.wordpress.com/2017/08/la-la-anthony-exclusive-interview-ftr.jpg?w=620", "card": "summary_large_image", "creator": "@https://twitter.com/jennalemoncelli", "title": "La La Anthony’s Workouts That Have Her In The Best Shape Of Her Life & What She Eats In A Day", "description": "It's no secret that La La Anthony is in the best shape of her life! And, when HollywoodLife.com EXCLUSIVELY chatted withe 'Power' actress, she revealed her favorite workouts and what she eats in a typical day!"}, "author": "Jenna Lemoncelli", "fb": {"pages": 94724837471}, "application-name": "Hollywood Life", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Latest Hollywood Celebrity & Entertainment News", "msapplication-task": "name=Subscribe;action-uri=https://hollywoodlife.com/feed/;icon-uri=https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=16", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128"}, "movies": [], "publish_date": 1502899200.0, "source": "https://hollywoodlife.com", "summary": ""}