{"url": "www.docshop.com/2011/03/16/jennifer-aniston-plastic-surgery", "text": "Date of Birth: February 11, 1969\n\nFebruary 11, 1969 Rumored Procedures: Rhinoplasty, lip injections, breast augmentation\n\nJennifer Aniston first made a name for herself in the 1990s starring as the lovable character Rachel on Friends. She quickly became a household name, even donning a signature haircut otherwise known as \"The Rachel.\" Since her rocket to stardom, Aniston has also made headlines for her love life, marrying and subsequently divorcing Hollywood's leading man, Brad Pitt. Following her divorce, rumors have swirled that Aniston has surgically altered her appearance, including a modest breast enhancement and not-so-modest lip injections. While the actress publicly discusses her tough workout regimens, and declares that she is all-natural, one can't help but wonder: has America's sweetheart undergone cosmetic surgery?\n\nBreast Augmentation\n\nWhile many have speculated that Aniston has undergone breast enhancement, the actress adamantly denies the rumors, even chalking her fuller breasts up to weight gain and a few too many \"cheese boards.\" The rumors were fueled by celebrity magazines that published photos of Aniston's breasts appearing fuller than ever during an appearance on the 2007 People's Choice Awards.\n\nRhinoplasty\n\nA quick look at a \"then and now\" profile of Aniston leads many people to believe that she has undergone not one, but two rhinoplasty surgeries. In photos taken in the early 90s, Aniston's bridge and nostrils appear much wider than they do today. Aniston admitted to having a deviated septum corrected, but said she was unhappy with the results. In February 2007, Aniston made a second attempt to correct the problem, and was quoted as saying, \"best thing I ever did. I slept like a baby for the first time in years.\"\n\nLip Injections\n\nIn 2008, Aniston was photographed with her lips looking a bit plumper than usual. Many magazines speculated that she received lip injection treatments after she emerged with a significantly larger upper lip. Some celebrity plastic surgeons even weighed in, noting a considerable difference. Luckily, Aniston's enhancement fit well with the rest of her features.\n\nChoosing a Cosmetic Surgeon\n\nCelebrities are no strangers to cosmetic surgery. In an environment where youth is highly prized, it would not be unexpected for Aniston, 40, to opt for cosmetic procedures to maintain her look. In fact the actress has stated that she will never rule out the possibility of receiving cosmetic treatments and supports actions that women take to feel better about their appearance. If Aniston has previously received cosmetic surgery, she has avoided criticism about her looks by choosing skilled plastic surgeons. One of the reasons it is so hard to tell if she underwent surgery is because her results are very natural-looking. This has helped keep her name off of any \"worst\" cosmetic surgery lists. No matter what your desired outcome, it is important to find a skilled professional to perform any kind of cosmetic surgery. Doing so will not only maintain the safety of your health, but it will also produce the natural-looking results that you desire.\n\nContact a Plastic Surgeon\n\nProcedures such as rhinoplasty, breast augmentation, and lip injections can enhance your overall appearance. If you are interested in learning more about plastic surgery, contact a plastic surgeon in your area to find out if you are a good candidate for treatment.\n\nImage sources: Jennifer Aniston before and after surgery.", "images": ["http://www.docshop.com/assets/images/favicon.ico", "http://www.docshop.com/assets/images/younger_jen_aniston-1.jpg", "https://d2agh9ata29wb8.cloudfront.net/d/docshop.com/assets/images/logo.png", "http://www.docshop.com/assets/images/jennifer-aniston1.jpg"], "top_img": "http://www.docshop.com/assets/images/favicon.ico", "keywords": [], "authors": ["Megan Gallagher"], "canonical_link": "//www.docshop.com/2011/03/16/jennifer-aniston-plastic-surgery", "title": "Jennifer Aniston Plastic Surgery- Celebrity Cosmetic Surgeries", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Actress Jennifer Aniston may have undergone several plastic surgeries including rhinoplasty, breast augmentation, and lip injections.", "robots": "noydir,noodp", "og": {"site_name": "DocShop", "description": "Actress Jennifer Aniston may have undergone several plastic surgeries including rhinoplasty, breast augmentation, and lip injections.", "type": "article", "author": "Megan Gallagher", "title": "Jennifer Aniston Plastic Surgery- Celebrity Cosmetic Surgeries", "url": "//www.docshop.com/2011/03/16/jennifer-aniston-plastic-surgery", "publisher": "https://www.facebook.com/DocShop", "modified_time": "September 6, 2017"}, "fb": {"admins": "500245829,100001836102804", "app_id": 175082352504354, "page_id": 133699796651791}, "twitter": {"card": "summary", "site": "@docshop", "domain": "docshop.com", "title": "Jennifer Aniston Plastic Surgery- Celebrity Cosmetic Surgeries", "description": "Actress Jennifer Aniston may have undergone several plastic surgeries including rhinoplasty, breast augmentation, and lip injections."}, "syndication-source": "//www.docshop.com/2011/03/16/jennifer-aniston-plastic-surgery", "Copyright": "Copyright DocShop.com 2014. All Rights Reserved."}, "movies": [], "publish_date": 1300204800.0, "source": "http://www.docshop.com", "summary": ""}