{"url": "https://medium.com/@RepJoePitts/one-in-four-6665a7ddffd#.owx09xl56", "text": "One out of every four Pennsylvania households is affected by addiction. More than 2,400 Pennsylvanians died from overdoses last year, making it the leading cause of accidental death in our Commonwealth.\n\nAccording to the Centers for Disease Control and Prevention (CDC), about 120 Americans on average die from a drug overdose every day. Overall, drug overdose deaths now outnumber deaths from firearms. More than 4 million Americans abuse prescription drugs or painkillers; another 435,000 use heroin.\n\nThese facts are shocking, but they reflect the reality right here in our neighborhoods, in Reading, in Lancaster City, and across Pennsylvania. It is happening to Democrats and Republicans, to people of every race and religion. It happens to our friends, family members, and neighbors. We all know them. And we share their pain.\n\nNo one suffers alone. We don’t have the option to think of this as merely a private or personal issue. Every addict comes from a family, and has people who love them and suffer with them. It can be almost unbearable to watch someone you love endure the physical and mental effects of drug abuse. Every addiction hurts not only an addict, but an entire community.\n\nAll of us pay the price of addiction, too, because it keeps people from fulfilling their potential and contributing more fully to our society. Drug abuse contributes to unemployment, homelessness, and sex trafficking. It puts pressure on government programs and budgets.\n\nNinety percent of addicts who need treatment don’t get it. Our health care system is failing not only them, but it is failing all of us. Addiction is treatable. We need to treat it, and we need to educate our young people properly in order to prevent the spread of addiction.\n\nAt a time when political acrimony is reaching a record level, leaders in both parties are coming together to find solutions. At the state level, Governor Wolf has ordered every state police vehicle to carry naloxone, an anti-overdose drug that has already saved hundreds of lives.\n\nCongress likewise is working on a bipartisan basis, with the support of the Obama Administration, to make the system work better.\n\nThis week, the Senate passed comprehensive legislation to address the addiction crisis. The bill was the result of bipartisan effort, and passed with bipartisan support from both of Pennsylvania’s Senators.\n\nIn November, Congress passed and the President signed into law a bipartisan bill, the Protecting Our Infants Act, to review federal programs to help the newborns of heroin and opiate addicts. Tragically, thousands of babies are exposed to and addicted to drugs like codeine, morphine, or heroin before they are even born. Doctors are able to take these babies through the withdrawal process, however. Our new law will require the federal government to develop a strategy to address any gaps in current research or programs.\n\nIn 2015, the Energy and Commerce Committee’s Oversight and Investigations Subcommittee held five hearings on the drug abuse crisis. In October, as Chairman of the Health Subcommittee, I chaired a two-part hearing at which we heard from experts like the Obama Administration’s drug czar Michael Botticelli and Dr. Kenneth Katz of the Lehigh Valley Health Network.\n\nTheir testimony was as chilling as it was informative. Director Botticelli testified that over the past decade, the number of people treated for overdoses each year, and the number of babies born with neo-natal abstinence syndrome have both tripled. Dr. Katz told us about a number of adolescents in Allentown whom he has seen hospitalized and even killed after trying a new synthetic strand of cannabis.\n\nAt the hearing, we discussed seven bipartisan proposals that would improve federal public health policies and help addicts get treatment. Each of these seven bills deals with a different aspect of the epidemic, because we need a comprehensive plan: not just adequate funding, but targeted funding; not just emergency response, but education and prevention.\n\nThese bills would make a number of changes to existing law. They would expand the number of physicians who can prescribe the drug buprenorphine to addicts, develop best practices and a national awareness campaign, ban certain synthetic drugs, help pregnant women who are addicted, and create a patient tracking pilot program.\n\nWe aren’t finished. Congress will continue to take action on behalf of the families and communities across Pennsylvania and across the country being shattered by this public health crisis. We will work until the system works.\n\n###", "images": ["https://miro.medium.com/fit/c/160/160/0*y3aQrKWIfgMx_3hv.jpg", "https://miro.medium.com/fit/c/96/96/0*y3aQrKWIfgMx_3hv.jpg", "https://cdn-images-1.medium.com/fit/c/152/152/1*8I-HPL0bfoIzGied-dzOvA.png"], "top_img": "https://cdn-images-1.medium.com/fit/c/152/152/1*8I-HPL0bfoIzGied-dzOvA.png", "keywords": [], "authors": ["Congressman Joe Pitts"], "canonical_link": "https://medium.com/@RepJoePitts/one-in-four-6665a7ddffd", "title": "One in Four", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/6665a7ddffd"}}, "title": "One in Four", "site": "@Medium", "description": "One out of every four Pennsylvania households is affected by addiction. More than 2,400 Pennsylvanians died from overdoses last year…", "card": "summary", "creator": "@RepJoePitts", "label1": "Reading time", "data1": "3 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/6665a7ddffd"}, "android": {"package": "com.medium.reader", "url": "medium://p/6665a7ddffd", "app_name": "Medium"}, "web": {"url": "https://medium.com/@RepJoePitts/one-in-four-6665a7ddffd"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "One in Four", "description": "One out of every four Pennsylvania households is affected by addiction. More than 2,400 Pennsylvanians died from overdoses last year…", "url": "https://medium.com/@RepJoePitts/one-in-four-6665a7ddffd"}, "article": {"published_time": "2016-03-10T18:11:20.173Z", "author": "https://medium.com/@RepJoePitts"}, "title": "One in Four - Congressman Joe Pitts - Medium", "description": "One out of every four Pennsylvania households is affected by addiction. More than 2,400 Pennsylvanians died from overdoses last year, making it the leading cause of accidental death in our…", "author": "Congressman Joe Pitts", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "6665a7ddffd"}, "movies": [], "publish_date": 1457633480.173, "source": "https://medium.com", "summary": ""}