{"url": "kellyandryan.com/uncategorized/ryan-bio/", "text": "Host and Executive Producer\n\n“Live with Kelly and Ryan”\n\nRyan Seacrest holds preeminent positions in broadcast and cable television as well as nationally syndicated radio and local radio, and he now joins the Emmy-winning team at “Live” as permanent co-host alongside Kelly Ripa.\n\nHis entrepreneurial interests have led to his involvement in a diverse range of media and entertainment companies, while his philanthropic efforts—focused on youth-oriented initiatives—are having a significant impact nationwide.\n\nOn radio, Seacrest is host of “On Air with Ryan Seacrest,” his market-topping #1 nationally-syndicated LA morning drive-time show for iHeart Media’s 102.7 KIIS-FM, as well as a nationally-syndicated Top 40 radio show.\n\nHe is also host and executive producer of ABC’s annual New Year’s Eve program, “Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest” and “E! Live from the Red Carpet” award shows.\n\nSeacrest launched Ryan Seacrest Productions (RSP) in 2006, which has since become an Emmy-winning entertainment production powerhouse creating unscripted, scripted and digital programming. RSP produces the E! hit cable series “Keeping Up with the Kardashians” and its spin-offs, as well as “E! Live from the Red Carpet” award shows, Bravo’s “Shahs of Sunset,” and CMT’s “I Love Kellie Pickler.” Additionally, RSP produces “Shades of Blue,” an NBC drama series starring Jennifer Lopez. The company produced the Emmy Award-winning reality series “Jamie Oliver’s Food Revolution.”\n\nAs an entrepreneur, Seacrest has investments in media and entertainment companies including Civic Entertainment Group, a marketing services company, Pinterest, and attn:, a news media company targeted at millennials through Seacrest Global Group. He has also made independent investments in DigiTour Media, an emerging media and entertainment company that creates and produces IRL (“in real life”) YouTube experiences in the form of concerts, Headspace, a mobile-first wellness brand, as well as the cable network, AXS TV.\n\nIn the fall of 2014, he launched a men’s tailored clothing and accessories collection, Ryan Seacrest Distinction, exclusively at Macy’s. It has become one of the most successful menswear launches at Macy’s in the last decade. This summer, Seacrest plans to launch Polished by Dr. Lancer, a new men’s skincare business formed in partnership with famed Hollywood dermatologist Dr. Harold Lancer. He also has long-standing endorsement relationships with blue-chip brands including Coca-Cola and Ford.\n\nHis philanthropic efforts include serving as chairman of the Ryan Seacrest Foundation (RSF). Over the last eight years, RSF has opened ten broadcast media centers – Seacrest Studios – in pediatric hospitals in cities across the country. Dedicated to inspiring today’s youth through entertainment and education-focused initiatives, Seacrest Studios allow child patients to explore the creative realms of radio, television and new media.\n\nSeacrest also serves on the board of the Los Angeles County Museum of Art (LACMA) and as honorary chair of the Grammy Foundation.", "images": ["https://cdn.origin.dadt.com/live/siteimages/og_image_lwkr.jpg", "https://kellyandryan.com/wp-content/themes/dtci-kellyandryan/images/back_to_top.png", "https://kellyandryan.com/wp-content/themes/dtci-kellyandryan/images/KR_logo.svg", "https://kellyandryan.com/wp-content/themes/dtci-kellyandryan/images/white_logo.svg", "https://kellyandryan.com/wp-content/uploads/2016/05/ryan.jpg?w=742"], "top_img": "https://cdn.origin.dadt.com/live/siteimages/og_image_lwkr.jpg", "keywords": [], "authors": [], "canonical_link": "https://kellyandryan.com/show-info/ryan-bio/", "title": "LIVE with Kelly and Ryan", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"url": "https://kellyandryan.com/show-info/ryan-bio/", "image": "https://cdn.origin.dadt.com/live/siteimages/og_image_lwkr.jpg", "description": "Welcome to the official website for the nationally syndicated talk show LIVE with Kelly and Ryan."}, "sitesectionid": "dadt_live_other", "generator": "WordPress 5.4", "msapplication-TileImage": "https://kellyandryan.com/wp-content/uploads/2017/09/faviconkelly.jpg?w=270"}, "movies": [], "publish_date": null, "source": "http://kellyandryan.com", "summary": ""}