{"url": "https://genius.com/a/here-s-everything-we-know-about-all-of-kanye-west-s-upcoming-albums", "text": "Late Monday night, Kanye West announced the release date for his upcoming album Yandhi, presumed to be something of a sequel to 2013’s Yeezus. The news came shortly after Chance the Rapper shared a clip of Kanye announcing that their upcoming collaborative album will be titled Good Ass Job. Earlier this month, Kanye also teased the existence of Watch the Throne 2 on Twitter. Considering the Chicago rapper already put out two albums this year—June’s ye solo project and Kids See Ghosts with Kid Cudi—the news has taken many fans by surprise.\n\nWith announcements from West coming at a rapid clip, Genius put together a comprehensive breakdown of what we know about each project and what to expect from the Chicago rapper in the next few months.\n\nYandhi\n\nKanye’s next album Yandhi is on its way before the end of the month. Last night, he revealed what’s seemingly a release date for the project: Saturday, September 29. Although this doesn’t line up with the music industry standard of Friday releases, it does coincide with his appearance as the musical guest on the season premiere of Saturday Night Live.\n\nHe also shared what seems to be the project’s cover art. It’s reminiscent of the minimalist artwork for his 2013 album Yeezus, which, along with the title, has led many to believe that Yandhi will be a sequel or spiritual successor to Yeezus. The artwork is a purple MiniDisc, an audio media format that experienced its greatest popularity in the mid-1990s.\n\nTalk of a Yeezus sequel is hardly new. Rick Rubin first told NewsWeek in 2013 that Yeezus 2 “might be” seeing a release date at some point after he insisted on splitting what was originally a 16-track album into two parts. He further elaborated on the possibility in a Genius annotation:\n\nLast November, Genius discovered that CyHi The Prynce’s personal Spotify account contained a playlist of Yeezus 2 songs, further confirming that it existed at some point. However, in the five years since Yeezus dropped, it seems likely that Kanye has released or repurposed at least some of that material. As such, it’s unclear if anything on Yandhi will be drawn from the long-fabled Yeezus 2 music.\n\nKanye’s other 2018 releases all ran exactly seven songs, a trend he could be continuing with his latest release. However, we currently don’t know who is involved with the album or how long it might be. His recent singles “XTCY” and “I Love It” with Lil Pump are potential candidates for inclusion, as is the G Herbo and Ronny J collaboration he recently teased on Instagram:\n\nYoung Thug also teased his involvement in the project:\n\nGood Ass Job\n\nBack in July, Chance the Rapper first announced that he would be linking up with Kanye West in Chicago to work on Chance’s next album. Kanye was since spotted in Chicago doing exactly that, and on Monday night, Chance shared a video clip of Kanye announcing that the project is titled Good Ass Job. “Me and Chance [are] working on a new album. It’s called Good Ass Job. I love you guys very much. We need to go to the studio,” West said.\n\nAlthough we already knew that the project was in the works, the title Good Ass Job makes things more interesting. Kanye first announced in a 2003 interview with MTV that his fourth album, released after Graduation, would be titled Good Ass Job. He ended up releasing 808s & Heartbreak instead, but brought the title back as the “tentative” first name for the 2010 album that would eventually become My Beautiful Dark Twisted Fantasy.\n\nSince then, Kanye had seemingly moved away from using the Good Ass Job title. Chance, however, has shown a keen interest in it for years. After using the phrase on his breakout mixtape Acid Rap, Chance rapped the words “good ass job” on 2016’s “Ultralight Beam,” his first collaboration with Kanye:\n\nI made Sunday Candy, I’m never going to hell\n\nI met Kanye West, I’m never going to fail\n\nHe said, “Let’s do a good ass job with ‘Chance 3’”\n\nI hear you gotta sell it to snatch the Grammy\n\nLater that year, he told Beats 1 that he was trying to connect with Kanye for a project titled Good Ass Job. Now, it seems that Chance’s vision is finally coming to fruition. Considering the title was originally Kanye’s, it’s unclear if he will rap on the album or just do production work. Good Ass Job is slated to be seven songs in length, but its release date and contents are currently unknown.\n\nWatch the Throne 2\n\nKanye West and JAY-Z’s joint album Watch the Throne remains the stuff of rap legend, and now it seems there’s some kind of sequel in the works. Kanye first announced the news with a simple tweet:\n\nThere’s been very little news about the project thus far, although a pair of Instagram posts from Kanye further hinted at Jay’s involvement:\n\nJay’s relationship with Kanye has been strained for the past few years, following Kanye calling out Jay and Beyoncé during a now-infamous rant at the Sacramento stop of his Saint Pablo tour. Since then, Jay has addressed Kanye on songs like “Kill Jay Z,” “LOVEHAPPY,” and “FRIENDS.” Kanye also split with TIDAL over withheld royalty payments last year. The two rappers haven’t been spotted together at all in recent years, although Jay said earlier this year that Kanye is still “like a brother” to him.\n\nIf Jay for some reason isn’t involved in the album, it’s unclear why Kanye would call it Watch the Throne 2. It’s possible that the project is an album-length collaboration with another artist, much like Kids See Ghosts or the original Watch the Throne. At this time, however, not much is known.", "images": ["https://loadus.exelator.com/load/?g=4&j=0&p=1183&page-album_ids=%5B221981%5D%2C%5B462441%5D&page-albums=Good+Ass+Job%2CYandhi&page-artist_ids=%5B2%5D%2C%5B72%5D%2C%5B16751%5D%2C%5B27794%5D&page-artists=JAY-Z%2CKanye+West%2CChance+the+Rapper%2CRick+Rubin&page-type=article&user_signed_in=false", "https://images.genius.com/6f40713d3c3b09ac4b4352cf49416666.700x654x1.jpg", "https://www.facebook.com/tr?id=201983886890479&ev=PageView&noscript=1", "https://i.genius.com/d867b9b1378779c4aaa154d1bf3f4470fadbc067?url=https%3A%2F%2Fscontent-iad3-1.cdninstagram.com%2Fvp%2Fd0d187bb0505327436415b435c702c79%2F5C1B73FE%2Ft51.2885-15%2Fe35%2F41743654_554273438326473_7694494300718208760_n.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=17151659&cv=2.0&cj=1", "https://i.genius.com/67f8220eb471a6e29b36884a1f142b961cffa966?url=https%3A%2F%2Fscontent-iad3-1.cdninstagram.com%2Fvp%2Fa3dfd79889cba4d746b8662c4d3263da%2F5C2BB04F%2Ft51.2885-15%2Fe35%2F41214760_684666791913058_7158275076573246025_n.jpg", "http://pixel.quantserve.com/pixel/p-f3CPQ6vHckedE.gif"], "top_img": "https://images.genius.com/6f40713d3c3b09ac4b4352cf49416666.700x654x1.jpg", "keywords": [], "authors": [], "canonical_link": "https://genius.com/a/here-s-everything-we-know-about-all-of-kanye-west-s-upcoming-albums", "title": "Here’s Everything We Know About All Of Kanye West’s Upcoming Albums", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=709482991", "y_key": "f63347d284f184b0", "og": {"site_name": "Genius", "url": "https://genius.com/a/here-s-everything-we-know-about-all-of-kanye-west-s-upcoming-albums", "title": "Here’s Everything We Know About All Of Kanye West’s Upcoming Albums", "description": "‘Yandhi,’ ’Watch the Throne 2,’ & ‘Good Ass Job’ are all in the works.", "image": "https://images.genius.com/6f40713d3c3b09ac4b4352cf49416666.700x654x1.jpg"}, "fb": {"app_id": 265539304824, "pages": 308252472676410}, "twitter": {"url": "https://genius.com/a/here-s-everything-we-know-about-all-of-kanye-west-s-upcoming-albums", "title": "Here’s Everything We Know About All Of Kanye West’s Upcoming Albums", "description": "‘Yandhi,’ ’Watch the Throne 2,’ & ‘Good Ass Job’ are all in the works.", "image": "https://images.genius.com/6f40713d3c3b09ac4b4352cf49416666.700x654x1.jpg", "site": "@Genius", "card": "summary_large_image", "app": {"name": {"iphone": "Genius"}, "id": {"iphone": 709482991}, "url": {"iphone": "genius://articles/5953"}}}}, "movies": [], "publish_date": null, "source": "https://genius.com", "summary": ""}