{"url": "www.inquisitr.com/4697842/liam-hemsworth-miley-cyrus-engaged-couple-reportedly-having-a-secret-wedding-in-australia-after-christmas/", "text": "Many fans were disheartened when Liam Hemsworth and Miley Cyrus called off their engagement in 2013. The Paranoia star previously claimed that their age and “different directions” were among the reasons why they decided to end their romance four years ago. Now that they are back together, avid followers of the couple are thrilled to see them tie the knot despite the fact that they had been keeping the details of their wedding under wraps.\n\nDaily Mail previously shared that an anonymous NW Magazine insider stated that Liam Hemsworth and Miley Cyrus had planned to tie the knot in a private wedding ceremony in Los Angeles on July 4 last year. The same tipster added that the pair had also scheduled a trip to Australia for their honeymoon. Though these claims remain unconfirmed up to this writing, recent reports have it that the couple is “planning to elope” over the holidays.\n\nSpeculations suggest that The Hunger Games star and his fiancee are flying off to Australia after Christmas. Liam Hemsworth is reportedly celebrating Christmas along with Miley Cyrus in Nashville, Tennessee — the hometown of the Hannah Montana actress. An unnamed source told Us Weekly that the couple would be staying in the “Land Down Under” for a while to spend quality time with Liam’s family.\n\nBecause of this, some fans cannot help but speculate that the pair might secretly get married in Australia. Last year, wedding rumors also sparked after Liam Hemsworth and Miley Cyrus attended a New Year’s Eve party together with their blended families. The Last Song actress even bragged about her attractive fiance at that time.\n\nWhile these elopement rumors could possibly be true, it should be noted that neither Liam Hemsworth nor Miley Cyrus has confirmed anything as of yet. Hence, devoted supporters of the couple should take these speculations lightly until everything is proven true and correct.\n\nMiley Cyrus: Why She's Struggling To Buy The Perfect Holiday Gift For Liam Hemsworth - Hollywood Life https://t.co/bLKIp4LbMm — Miley Cyrus Plaza (@MileyCyrusPlaza) December 16, 2017\n\nMeanwhile, the So Undercover actress has denied that she and her partner are already expecting a baby. Pregnancy rumors sparked after Miley Cyrus shared a photo of herself and her alleged baby bump a few days before this year’s Thanksgiving Day. However, the fiancee of Liam Hemsworth was quick to shut down the malicious reports.\n\n“RUDE!!! Not pregnant just eating a s*** ton of tufurkey,” the singer-songwriter wrote on Twitter. The pair has yet to comment on the reports stating that they are fighting over having babies. Stay tuned for the latest news and updates about Liam Hemsworth and Miley Cyrus!", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/12/liam-hemsworth-miley-cyrus-wedding-in-australia.jpg", "https://secure.gravatar.com/avatar/7203b89913763ccf66c16beb9c3a7020?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Nica Virtudazo"], "canonical_link": "https://www.inquisitr.com/4697842/liam-hemsworth-miley-cyrus-engaged-couple-reportedly-having-a-secret-wedding-in-australia-after-christmas/", "title": "Liam Hemsworth, Miley Cyrus Engaged: Couple Reportedly Having A Secret Wedding In Australia After Christmas", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}