{"url": "https://web.archive.org/web/20090910073834/http://www.whitehouse.gov/the_press_office/Remarks-by-the-President-at-AFL-CIO-Labor-Day-Picnic/", "text": "THE WHITE HOUSE\n\nOffice of the Press Secretary\n\n_______________________________________________________________________\n\nFor Immediate Release September 7, 2009\n\nREMARKS BY THE PRESIDENT\n\nAT AFL-CIO LABOR DAY PICNIC\n\nConey Island\n\nCincinnati, Ohio\n\n1:24 P.M. EDT\n\nTHE PRESIDENT: Hello, Cincinnati! (Applause.) Thank you. Thank you, Ohio! (Applause.) Thank you. Thank you, labor! (Applause.) All-righty. It is good to be back in Cincinnati. (Applause.) It's good to be back in Ohio. (Applause.) It's good to be back among great friends, great leaders. And I want everybody to give a big round of applause to Charlie Dilbert for that great introduction. (Applause.) And I want to thank Kathy Mattea and the band for the entertainment. Give Kathy a big round of applause. (Applause.)\n\nHow you all feeling today? (Applause.) Are you fired up? (Applause.) Are you ready to go? (Applause.) I can't think of a better place to be on Labor Day than at America's biggest Labor Day picnic, and with the workers and families of the Cincinnati AFL-CIO. (Applause.)\n\nI'm so proud to be on the stage with Charlie, because Charlie reminds us that in these tough times, America's working men and women are ready to roll up their sleeves and get back to work. (Applause.)\n\nI want to salute your local AFL-CIO local leaders: Executive Secretary-Treasurer Doug Sizemore -- (applause) -- President Joe Zimmer -- (applause) -- State President Joe Rugola. And your outstanding national leaders: a man who we thank for devoting his life to working Americans -- President John Sweeney. (Applause.) He's right there. And the man who will pick up the mantle, who will take the baton of leadership, who we need to succeed because a strong labor movement is part of a strong economy -- is part of a strong economy -- Secretary-Treasurer Rich Trumka. (Applause.)\n\nAlthough Ohio's wonderful governor and great friend of mine Ted Strickland couldn't be here, we've got Lieutenant Governor Lee Fisher in the house -- (applause) -- Secretary of State Jennifer Brunner -- (applause) -- Attorney General Richard Cordray -- (applause) -- Cincinnati Mayor Mark Mallory -- (applause) -- Hamilton County Commissioner -- Commission President David Pepper. (Applause.)\n\nWe're joined by members of Ohio's outstanding congressional delegation: Congressman Steve Driehaus -- (applause) -- and a great friend who is at the forefront of every fight for Ohio's working men and women, including the battle for health insurance reform, Senator Sherrod Brown. (Applause.)\n\nI'm also proud to be here with a leader who is reenergizing the Department of Labor, who realizes that it's not the Department of Management, it's the Department of Labor -- (applause) -- a daughter of union members, a daughter of a Teamster -- Secretary Hilda Solis. (Applause.) My director of recovery for auto communities and workers, Ed Montgomery, is in the house, and he's doing outstanding work. (Applause.)\n\nNow, Cincinnati, like a lot of Americans, you're having some fun today. Taking the day off. Spending time with the kids. Some of you may be proud of your grilling skills. (Laughter.) Every man thinks he can grill -- (laughter) -- whether he can or not. That's what Michelle says. (Laughter.) Michelle says she's a better griller than me. (Applause.) I don't know. We'll have to have a grill-off someday. But you're enjoying some good music, some good food, some famous Cincinnati chili. (Applause.)\n\nBut today we also pause. We pause to remember and to reflect and to reaffirm. We remember that the rights and benefits we enjoy today weren't simply handed to America's working men and women. They had to be won. They had to be fought for, by men and women of courage and conviction, from the factory floors of the Industrial Revolution to the shopping aisles of today's superstores. They stood up and they spoke out to demand a fair shake and an honest day's pay for an honest day's work. (Applause.)\n\nMany risked their lives. Some gave their lives. Some made it a cause of their lives -- like Senator Ted Kennedy, who we remember today. (Applause.)\n\nSo let us never forget: much of what we take for granted -- the 40-hour work week, the minimum wage, health insurance, paid leave, pensions, Social Security, Medicare -- they all bear the union label. (Applause.) It was the American worker -- men and women just like you -- who returned from World War II to make our economy the envy of the world. It was labor that helped build the largest middle class in history. Even if you're not a union member, every American owes something to America's labor movement. (Applause.)\n\nSo as we remember this history, let's reflect on its meaning in our own time. Like so many Americans, you work hard. You meet your responsibilities. You play by the rules. You pay your bills. But in recent years, the American Dream seems like it's been slipping away, because from Washington to Wall Street, too often a different attitude prevailed. Wealth was valued over work, selfishness over sacrifice, greed over responsibility. The right to organize was undermined rather than strengthened. (Applause.)\n\nThat's what we saw. And it may have worked out well for those folks at the top, but it didn't work out for you and it didn't work out well for our country. That culture -- that culture and the policies that flowed from it -- undermined the middle class and helped create the greatest economic crisis of our time.\n\nSo today, on this Labor Day, we reaffirm our commitment. To rebuild. To live up to the legacy of those who came before us. To combine the enduring values that have served us so well for so long -- hard work and responsibility -- with new ideas for a new century. To ensure that our great middle class remains the backbone of our economy -- not just a vanishing ideal we celebrate at picnics once a year as summer turns to fall. We want it a reality for the families of Ohio and the families of America. (Applause.)\n\nThat's what we've been working to do ever since I took office. Now, I notice some people have already forgotten how bad it was just seven months ago. You notice that? They've got sort of selective amnesia. (Laughter.) So let's just remind them for a second. (Applause.) A financial system on the verge of collapse; about 700,000 workers losing their jobs each month; the worst recession of our lifetimes threatening to become another Great Depression.\n\nThat's what was happening just seven months ago. And that's why we took bold, swift action. That's why we passed an unprecedented Recovery Act, and we did it without the usual Washington earmarks and pork-barrel spending. And, Ohio, it is working. (Applause.)\n\nTimes -- times are still tough. Times are still tough, I know that. But we have given 95 percent of America's working families a tax cut -- 4.5 million families in Ohio, including here in Cincinnati -- a promise we made during the campaign; a promise I kept as President of the United States. (Applause.)\n\nWe cut taxes for small businesses, made new loans to more than 1,000 small businesses in Ohio so they could grow and hire more workers. We extended unemployment benefits for 12 million Americans, including Charlie and nearly 570,000 Ohio citizens. (Applause.) Across America, we've saved the jobs of tens of thousands of state and local workers, including teachers and first responders right here in Ohio. Don't take my word for it. Ask folks here in Ohio what they would have done if we hadn't passed the Recovery Act -- the cuts they would have had to make, the taxes they would have had to raise.\n\nWe're rebuilding America's infrastructure, including improvements to I-75 in Hamilton County, led by a local Cincinnati contractor. (Applause.) We've got more than 200 other highway projects across Ohio, and we're making a historic commitment to innovation -- much of it still to come in the months and years ahead: doubling our capacity to generate renewable energy; building a new smart grid to carry electricity from coast to coast; laying down broadband lines and high-speed rail lines and providing the largest boost in basic research in our history -- all of which will put people back to work. (Applause.) Steelworkers, plumbers, pipe-fitters, engineers, you name it.\n\nSo our recovery plan is working.\n\nQ What about bricklayers?\n\nTHE PRESIDENT: Bricklayers, too. (Applause.) The financial system -- financial system has been saved from collapse. Home sales are up. We're seeing signs of life in the auto industry. Business investment is starting to stabilize. For the first time in 18 months, we're seeing growth in manufacturing. When was the last time you heard that here in the United States of America? (Applause.)\n\nNow, on Friday, we learned that the economy lost another 216,000 jobs in August. And whenever Americans are losing jobs, that's simply unacceptable. But for the second straight month, we lost fewer jobs than the month before, and it was the fewest jobs that we had lost in a year. (Applause.) So, make no mistake, we're moving in the right direction. We're on the road to recovery, Ohio. Don't let anybody tell you otherwise. (Applause.)\n\nAUDIENCE: Yes we can! Yes we can! Yes we can!\n\nTHE PRESIDENT: Yes we will. Yes we are.\n\nAUDIENCE: Yes we will! Yes we will! Yes we will!\n\nTHE PRESIDENT: But -- but, my friends, we still have got a long way to go. We're not going to rest. We're not going to let up. Not until workers looking for jobs can find them -- good jobs that sustain families and sustain dreams. Not until responsible mortgage-owners can stay in their homes. Not until we've got a full economic recovery and all Americans have their shot at the American Dream. (Applause.)\n\nNow, we can't do that if we go back to that old economy -- overleveraged banks, inflated profits, maxed-out credit cards, CEOs and bankers getting multimillion-dollar bonuses --\n\nAUDIENCE: Booo!\n\nTHE PRESIDENT: -- an economy of bubbles and bursts, your wages and incomes stagnant while corporate profits soar. So even as we recover from the recession and work to cut the deficit, we have to build a new foundation for prosperity:\n\nWe need an America with a reformed financial system. We got to have regulations in place that protect consumers so that we never have a crisis like this again. (Applause.) I don't want to have to bail out any more banks. (Applause.) And we got to make sure we've got regulations in place to prevent it. (Applause.)\n\nAn America where energy reform creates green jobs that can never be outsourced and that finally frees America from the grip of foreign oil. (Applause.)\n\nAn America that commits to education because the countries that out-educate us today will out-compete us tomorrow and the best jobs will go to the best educated. (Applause.) So we got to do a better job educating our sons and our daughters. And, yes, I'm going to have something to say tomorrow to our children, telling them to stay in school and work hard -- because that's the right message to send. (Applause.)\n\nWe need an America that once again invests in the middle class, which is why I've created our task force for middle-class working families, led by my outstanding Vice President Joe Biden to make sure that our policies always benefit you, the American worker. (Applause.)\n\nToday we're taking another step. I'm naming Ron Bloom, who's right here -- raise your hand, Ron; he's right down in the front here. (Applause.) I'm naming Ron Bloom to lead our efforts to revitalize the sector that helped build the middle class: American manufacturing. (Applause.) Ron has worked with steelworkers, service employees, and management to create jobs. He helped guide our auto task force. And as my new point person on manufacturing, he's going to help us craft the policies that will create the next generation of great manufacturing jobs and ensure American competitiveness in the 21st century. (Applause.)\n\nOh, and by the way, just in case you were wondering, we're also going to build an America where health reform delivers more stability and security to every American. (Applause.) We are going to reform the system for those who have insurance and those who don't. Now, I'll have a lot more to say about this on Wednesday night. I might have to save my voice a little bit -- not get too excited. I don't want to give anything away. I want you all to tune in.\n\nBut let me just say a few things about this health care issue. We've been fighting for quality, affordable health care for every American for nearly a century -- since Teddy Roosevelt. Think about that -- long time. (Laughter.) The Congress and the country have now been vigorously debating the issue for many months. The debate has been good, and that's important because we've got to get this right. But every debate at some point comes to an end. At some point, it's time to decide. At some point, it's time to act. Ohio, it's time to act and get this thing done. (Applause.)\n\nWe have never been this close. We've never had such broad agreement on what needs to be done. And because we're so close to real reform, suddenly the special interests are doing what they always do, which is just try to scare the heck out of people.\n\nBut I've got -- I've got a question for all these folks who say, you know, we're going to pull the plug on Grandma and this is all about illegal immigrants -- you've heard all the lies. I've got a question for all those folks: What are you going to do? (Applause.) What's your answer? (Applause.) What's your solution? (Applause.) And you know what? They don't have one. (Applause.) Their answer is to do nothing. Their answer is to do nothing. And we know what that future looks like: insurance companies raking in the profits while discriminating against people because of preexisting conditions; denying or dropping coverage when you get sick. It means you're never negotiating about higher wages, because all you're spending your time doing is just trying to protect the benefits that you already fought for.\n\nIt means premiums continuing to skyrocket three times faster than your wages. It means more families pushed into bankruptcy, more businesses cutting more jobs, more Americans losing health insurance -- 14,000 every day. It means more Americans dying every day just because they don't have health insurance.\n\nThat's not the future I see for America. I see reform where we bring stability and security to folks who have insurance today -- where you never again have to worry about going without coverage if you lose your job or you change your job or you get sick. You've got coverage there for you. Where there is a cap on your out-of-pocket expenses, so you don't have to worry that a serious illness will break you and your family even if you have health insurance. (Applause.) Where you never again have to worry -- where you never again have to worry that you or someone you love will be denied coverage because of a preexisting condition. (Applause.)\n\nI see reform where Americans and small businesses that are shut out of health insurance today will be able to purchase coverage at a price they can afford. (Applause.) Where they'll be able to shop and compare in a new health insurance exchange -- a marketplace where competition and choice will continue to hold down costs and help deliver them a better deal. And I continue to believe that a public option within that basket of insurance choices will help improve quality and bring down costs. (Applause.)\n\nI see reform where we protect our senior citizens by closing the gaps in their prescription drug coverage under Medicare that costs older Americans thousands of dollars every years out of their pockets; reforms that will preserve Medicare and put it on a sounder financial footing and cut waste and fraud -- the more than $100 billion in unwarranted public subsidies to already profitable insurance companies.\n\nI want a health insurance system that works as well for the American people as it does for the insurance industry. (Applause.) They should be free to make a profit. But they also have to be fair. They also have to be accountable.\n\nThat's what we're talking about -- security and stability for folks who have health insurance, help for those they don't -- the coverage they need at a price they can afford, finally bringing costs under control. That's the reform that's needed. That's the reform we're fighting for. And that's why it's time to do what's right for America's working families and put aside partisanship, stop saying things that aren't true, come together as a nation, pass health insurance reform now -- this year. (Applause.)\n\nFew have fought harder or longer for health care in America's workers than you -- our brothers and sisters of organized labor. And just as we know that we have to adapt to all the changes and challenges of a global economy, we also know this: In good economic times and in bad, labor is not the problem. Labor is part of the solution. (Applause.)\n\nThat's why Secretary Solis made it her priority at the Labor Department to protect workers -- your safety, your benefits, your right to organize, your right to bargain collectively. (Applause.) That's why some of the first executive orders I issued overturned the previous administration's attempts to stifle organized labor. That's why I support EFCA -- to level the playing field so it's easier for employees who want a union to form a union. (Applause.) Nothing -- nothing wrong with that. Because when labor is strong, America is strong. When we all stand together, we all rise together. (Applause.)\n\nThat's why the first piece of legislation I signed into law was the Lilly Ledbetter Fair Pay Act -- (applause) -- guaranteeing equal pay for equal work. (Applause.) Lilly worked at a factory in Alabama. She did her job and she did it well. And then, after nearly two decades, she discovered that for years she was paid less than her male colleagues for doing the very same work. Over the years, she had lost hundreds of thousands of dollars in wages and in pension and Social Security benefits.\n\nLilly could have just moved on. Instead, this Alabama grandmother made a decision. She said a principle was at stake. She stood up and she spoke out for what was right -- all the way to the Supreme Court, and then Congress, and finally the White House, where she stood next to me as I signed the law that bore her name. (Applause.)\n\nOhio, that's the lesson this day -- that some things are worth fighting for. (Applause.) Equal pay. Fair wages. Dignity in the workplace. Justice on the job. An economy that works for everybody, because in America there are no second-class citizens. An economy where you can make a living and care for your families. Where you're leaving your kids something better. Where we live up to our fundamental ideals. Those words put on paper some 200 years ago -- that we're all created equal, that we all deserve a chance to pursue our happiness -- that's the calling to which we are summoned this Labor Day. That's the cause of my presidency. And that is the commitment we must fulfill to preserve the American Dream for all of America's working families.\n\nBut I'm going to need you to do it. At the beginning of this speech, I talked about whether you were fired up. (Applause.) I know that, over the last couple months, the economy has been bad, the recession has been wearing on folks -- people losing their jobs, people losing their health care, people losing their homes in some cases. It's been the usual bickering in Washington. Doesn't seem like that ever stops. Pundits on TV, they're saying how, oh, this isn't working and that's not working. You know, you start getting into a funk, and whenever I see folks in that negative place, I always think back to a story I told during the campaign. Some of you have heard it. But I just thought I'd say it again. (Applause.)\n\nIt's about where the phrase \"fired up\" comes from. So, this is when we were -- right at the beginning of the campaign for the presidency, nobody gave us a chance -- none of you all could pronounce my name. (Laughter.) And I went down to South Carolina. I went down -- I think I was -- where was I? (Laughter.) I was in Greenville -- am I right? Greenville. And the legislators were having a little banquet and they had invited me to come down to speak. And I sat next to a state representative. I had nobody supporting me back then, so I had to ask everybody. I said, will you support my campaign for the presidency of the United States? And this state rep looked me up and down and she said, \"You know, I will give you my endorsement if you come to my hometown at Greenwood, South Carolina.\"\n\nNow, I had had a glass of wine, so I said right away, I said, okay. (Laughter.) Let's shake on it. Come to find out that Greenwood is about an hour and a half from everyplace else. (Laughter.)\n\nSo about a month later, I fly in -- I've been campaigning for two weeks straight, haven't seen my family, I'm exhausted, I'm tired. Get to the hotel room, I'm dragging my bag into my room, about to go to bed. I get a tap on my shoulder. It's my staff member, says, \"Excuse me, sir.\" I said, \"What?\" (Laughter.) He said, \"You have to be in the car tomorrow at 6:30 a.m. in the morning. I said, \"Why?\" (Laughter.) He said, \"Because we got to go to Greenwood like you promised.\" (Laughter.)\n\nSo the next day, I wake up and I feel worse than when I went to bed. I stagger over the window, open up the blinds -- it's pouring down rain outside; ugly day. I go out, get my newspaper, open it up, there's a bad story about me in The New York Times. I pack up my stuff, I go downstairs. My umbrella breaks and I get soaked. So that by the time I'm in the car, I'm sleepy, I'm wet, and I'm mad. (Laughter.) And we start driving, and we just keep on driving -- we're driving, we're driving, we drive -- goes on forever. Hour and a half we're driving.\n\nFinally we get to Greenwood -- although you don't know that you're in Greenwood right away. (Laughter.) It's kind of -- a lot of fields and -- (laughter.) We pull up next to a little field house in a park and I get back out and I get a little more wet and I go inside. And after this hour-and-a-half drive, lo and behold, there are only 20 people inside. (Laughter.) And most of them are wet and don't look like they really want to be there either. (Laughter.)\n\nSo, you know, I'm a professional. I go and shake everybody's hands and I've got kind of a tight smile on my face. \"How do you do? What do you do? Nice to meet you.\" Suddenly I hear this voice behind me, shouting out -- \"Fired up?\" And I'm surprised. I'm scared, almost. (Laughter.) But everybody else acts like this was normal and they all say, \"Fired up!\" \"Ready to go?\" People around me, they all say, \"Ready to go!\"\n\nI don't know what's going on. I look behind me. There is a little woman. She couldn't be more than 5'2\". Watch out -- you're little, too. (Laughter.) Little lady. She's about 50, 60 years old. She dressed like she just came from church. She got a big church hat. And she's smiling at me. She looks at me and she says, \"Fired up!\"\n\nTurns out this woman is a city council member from Greenwood who is famous for her chant. Every event she goes to, she likes chanting. She goes, \"Fired up? \"Fired up!\" \"Ready to go?\" \"Ready to go!\" And she does a little dance while she's doing it. (Laughter.)\n\nSo for the next five minutes, it seems like, she just keeps on saying this little chant. \"Fired up?\" \"Fired up!\" \"Ready to go?\" \"Ready to go!\" And I'm standing there and I'm thinking, this woman is upstaging me. (Laughter.) I don't know what to do. I'm looking at my staff. I'm thinking, when is this thing going to be over? (Laughter.)\n\nBut here's the thing, Ohio. After about a minute or two, I'm starting to feel kind of fired up. (Laughter and applause.) I'm starting to feel like I'm ready to go. (Applause.) So I start joining in the chant, and it's making me feel good. And for the rest of the day, whenever -- we campaigned the whole day. Whenever I saw my staff, I said, \"Are you fired up?\" They said, \"I'm fired up, boss. Are you ready to go?\" And I'd say, \"I'm ready to go.\"\n\nIt just goes to show you how one voice can change a room. (Applause.) And if it can change a room, it can change a city. (Applause.) And if it can change a city, it can change a state. (Applause.) And if it can change a state, it can change a nation. (Applause.) And if it can change a nation, it can change the world. (Applause.) Your voice can change the world. Your voice will get health care passed. Your voice will make sure that the American worker is protected. You can build America. I need your help.\n\nThank you, Cincinnati. Are you fired up?\n\nAUDIENCE: Fired up!\n\nTHE PRESIDENT: Ready to go?\n\nAUDIENCE: Ready to go!\n\nTHE PRESIDENT: Fired up?\n\nAUDIENCE: Fired up!\n\nTHE PRESIDENT: Ready to go?\n\nAUDIENCE: Ready to go!\n\nTHE PRESIDENT: Fired up?\n\nAUDIENCE: Fired up!\n\nTHE PRESIDENT: Ready to go?\n\nAUDIENCE: Ready to go!\n\nTHE PRESIDENT: I love you. Bye-bye. (Applause.)\n\nEND\n\n1:59 P.M. EDT", "images": ["https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/assets/tout/fy-2010-budget.jpg", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/images/eop/clear.gif", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/assets/tout/smc_nt_04.jpg", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/assets/images/get_connected_01.jpg", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/images/eop/hdr-usa-flag.gif", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/images/eop/sftr-whgov.gif", "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/assets/images/home_touts_03.jpg", "https://web.archive.org/web/20090910073834im_/http://statse.webtrendslive.com/dcs0l9nq800000ctek411lue6_2c8b/njs.gif?dcsuri=/nojavascript&WT.js=No&DCS.dcscfg=1&WT.tv=8.6.0"], "top_img": "https://web.archive.org/web/20090910073834im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Remarks by the President at AFL CIO Labor Day Picnic", "meta_data": {"keywords": "President, Barack Obama, White House, United States of America, 44th President, White House history, President Obama, Barck, Barek, Barak, Barrack, Barrak, Obma, Barack", "description": "WhiteHouse.gov is the official web site for the White House and President Barack Obama, the 44th President of the United States. This site is a source for information about the President, White House news and policies, White House history, and the federal government."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}