{"url": "http://uk.businessinsider.com/game-of-thrones-premiere-after-party-pictures-2017-7", "text": "On July 12, HBO held an exclusive Los Angeles premiere for \"Game of Thrones\" season seven. From a star-studded \"blue\" carpet to the screening of the first episode (followed by an epic after-party), INSIDER was on hand to witness all the magic.\n\nThe cast arrived to the Walt Disney Concert Hall in downtown Los Angeles and hit the blue carpet — aptly colored to match the wintery theme of season seven.\n\nMost of the cast was there, including former members. Kit Harington (Jon Snow) and his girlfriend Rose Leslie (who played his on-screen love Ygritte) looked dapper.\n\nKit and Rose met on the set of \"Game of Thrones\" season two. Neilson Barnard/Getty\n\nHBO unlocked a new Snapchat lens recently, and the \"Game of Thrones\" stars were testing it out on the blue carpet. Here's Sophie Turner (Sansa Stark) doing her best White Walker impression:\n\nTurner spoke with INSIDER about Sansa's evolution and the pending struggle she'll face with being the Lady of Winterfell. \"It's kind of her struggle with newfound power,\" Turner said. \"That's the theme for her — power.\"\n\nAfter the stars made their way through blue carpet, it was time for the screening of season seven's first episode.\n\nThe episode screening\n\nInside the theater, an orchestra and chorus were set up and waiting.\n\n\"It's Always Sunny in Philadelphia\" co-creator and star Rob McElhenney was super excited at the prospect of watching a whole episode scored with a live orchestra.\n\nBut the orchestra wasn't there to play along live with the new episode. Instead, composer Ramin Djawadi came out and led the musicians through a mini version of the \"Game of Thrones\" Live Concert Experience — a musical spectacle that toured for nine months after season six.\n\nThe audience watched as a recap montage of season six was shown, complete with a condensed version of \"The Light of the Seven\" and Cersei's wildfire plot. Then the orchestra left the stage.\n\nThe lights dimmed, and Jon Snow (Kit Harington) spoke over the loudspeakers.\n\n\"Night gathers, and now my watch begins. I shall take no photos, and hold no phones, and spread no rumors on social media,\" Harington said. \"I am the shield that guards the realm from spoilers.\"\n\nThe bit continued, emphasizing the extreme secrecy required by HBO about the episode we were about to see, which means we won't tell you anything here about the episode (other than it was really fantastic and garnered lots of applause, laughs, and awe-struck silence from the audience).\n\nThe epic after-party\n\nAfter the premiere, the cast and guests made their way across the street to a low rooftop, where the view was LA's skyline and the Walt Disney Concert Hall, decorated with elaborate projections.\n\nThe dance floor was a huge map of Westeros. Neilson Barnard/Getty\n\nThe projections were very impressive, sometimes showing Drogon flying and breathing fire:\n\nAt other times the Night King's face was staring down at the party guests, or it was a montage of every cast member's official season seven character poster.\n\nA DJ clad in all-white was blasting jams from right in front of an iron throne replica.\n\nThough the event space was large, there were stars covering every square inch. Jimmy Kimmel, Queen Latifah, and several cast members from HBO's \"Silicon Valley\" (Martin Starr and Jimmy O. Yang) and \"Girls\" (Alex Karpovsky) were in attendance.\n\nQueen Latifah must be a big \"Game of Thrones\" fan. Neilson Barnard/Getty\n\nMost of the cast had turned out for the premiere, from Nikolaj Coster-Waldau (Jaime Lannister) and Gwendoline Christie (Brienne of Tarth) to Alfie Allen (Theon Greyjoy) and Gemma Whelan (Yara Greyjoy).\n\nAllie Teilz (a DJ and girlfriend to Alfie Allen) poses with the \"Game of Thrones\" stars. Neilson Barnard/Getty\n\nSophie Turner brought boyfriend Joe Jonas and his brother Nick Jonas to the after party. Sophie and Joe looked happy and cozy sitting together, while Nick went to the photobooth and fancied himself King in the North.\n\nA post shared by Nick Jonas (@nickjonas) Jul 12, 2017 at 11:11pm PDT\n\nIsaac Hempstead Wright (Bran Stark) looked dapper in a suit next to the stunning Nathalie Emmanuel (Missandei).\n\nNathalie Emmanuel is pulling double duty in franchises. She also stars as Ramsey in the \"Fast and Furious\" movies. Neilson Barnard/Getty\n\nJerome Flynn (Bronn) and Iain Glen (Jorah) were hanging out with Conleth Hill (Varys), while Liam Cunningham (Ser Davos) and Richard Dormer (Beric Dondarrion) posed together for a photo:\n\nSer Davos and Beric have never met on the show, but the two actors seem chummy. Neilson Barnard/Getty\n\nThe most notable absences among the cast were Emilia Clarke (Daenerys Targaryen), Lena Headey (Cersei Lannister), and Peter Dinklage (Tyrion Lannister). But at the end of the night, when everything was winding down (and the badass silver skull centerpieces had all been sneaked away in purses), the Night King was left watching over Los Angeles.", "images": ["https://i.insider.com/5967edafdde18909326f4409?width=1200&format=jpeg", "https://i.insider.com/5967edafdde18909326f440a?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f440c?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f440b?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "http://uk.businessinsider.com/game-of-thrones-premiere-after-party-pictures-2017-7?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f4410?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5967edafdde18909326f440f?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f440e?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f4411?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f440d?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967edafdde18909326f440a?width=24&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5967edafdde18909326f4409?width=1200&format=jpeg", "keywords": [], "authors": ["Kim Renfro"], "canonical_link": "https://www.insider.com/game-of-thrones-premiere-after-party-pictures-2017-7", "title": "Here's what it was like inside the star-studded 'Game of Thrones' season 7 premiere and after-party", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Here's what it was like inside the star-studded 'Game of Thrones' season 7 premiere and after-party", "date": "2017-07-14", "news_keywords": "Game of Thrones, HBO, TV, Red Carpet, Kim Renfro", "description": "We attended HBO's \"Game of Thrones\" season 7 premiere in Los Angeles at the Walt Disney Concert Hall. Here's what it was like inside and at the after-party.", "author": "Kim Renfro", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Entertainment Contributors", "og": {"title": "Here's what it was like inside the star-studded 'Game of Thrones' season 7 premiere and after-party", "description": "We attended HBO's \"Game of Thrones\" season 7 premiere in Los Angeles at the Walt Disney Concert Hall. Here's what it was like inside and at the after-party.", "type": "article", "url": "https://www.businessinsider.com/game-of-thrones-premiere-after-party-pictures-2017-7", "image": "https://i.insider.com/5967edafdde18909326f4409?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Here's what it was like inside the star-studded 'Game of Thrones' season 7 premiere and after-party", "sailthru.date": "2017-07-14", "sailthru.tags": "Game of Thrones, HBO, TV, Red Carpet, Kim Renfro", "sailthru.description": "We attended HBO's \"Game of Thrones\" season 7 premiere in Los Angeles at the Walt Disney Concert Hall. Here's what it was like inside and at the after-party.", "sailthru.author": "Kim Renfro", "sailthru.verticals": "thewire-contributor, thewire", "sailthru.image.full": "https://i.insider.com/5967edafdde18909326f4408?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5967edafdde18909326f4408?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@bi_contributors"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "variant", "back-to-top": "variant", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5967edb0dde18909326f4412", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1499961600.0, "source": "http://uk.businessinsider.com", "summary": ""}