{"url": "https://www.theguardian.com/media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too", "text": "Ronan Farrow, the son of Mia and Woody Allen, is the Pulitzer-prize winning journalist whose exposé triggered #MeToo. Now, he has written an acclaimed book on waning US diplomatic influence – and he’s still only 30\n\n“Thanks for taking the time,” says Ronan Farrow when we meet at a central London hotel. Farrow is the journalist whose exposé of Harvey Weinstein helped kickstart the #MeToo movement. Just 30 years old, he looks, up close, about 13. But he has packed into his three decades more adventures and achievements than most of us could manage in two lifetimes. Of course he had a head start. He was the only biological child of two extremely famous people: Woody Allen, arguably America’s most celebrated living film-maker, and Mia Farrow, herself a child of Hollywood royalty, star of many films and ex-wife of Frank Sinatra.\n\nBy the time that he was five, Ronan had witnessed his parents’ epically bitter break-up, his father’s new relationship with his 22-year-old sister (Farrow’s adopted daughter) Soon-Yi (the cause of the vicious split), and the allegations that his father had sexually abused his seven-year-old adopted sister Dylan Farrow. A court case and custody battle ensued in the relentless glare of the world’s media.\n\nThese were, to say the least, formative experiences, but there were plenty more to come in Ronan’s childhood. First off, his mother adopted five more children after the split with Allen, bringing her brood to 14, some of them disabled or suffering from serious illness. One, named Tam, died of heart failure when Ronan was seven.\n\nBy the time he was 11 the young Farrow was at university studying for a degree, a double major in philosophy and biology. At 16 he was enrolled at the prestigious Yale law school. In the meantime he’d been travelling with his mother to places like Sudan, Liberia and Angola on humanitarian missions.\n\nAllen made a living out of joking about his fears of the world beyond the urban sophistication of Manhattan and spent a lifetime in analysis discussing his neuroses. His son seems made of sterner stuff, but that was still a lot to process for a child. Yet, if anything, the 15 years that followed have been even more incident‑packed.\n\nWhen he’d just turned 21, his sister Lark Previn (adopted by Farrow when she was married to the conductor André Previn), died after a decade-long illness. Finishing his law degree, he worked for former US ambassador to the UN, Richard Holbrooke, when he was special representative to Afghanistan and Pakistan. After Holbrooke died, Farrow became secretary of state Hillary Clinton’s special adviser on global youth issues, before taking a summer role as the “visiting scientist” at the Centre for Disease Control in Nairobi.\n\nNext he won a Rhodes scholarship to Oxford University, where he began a philosophy doctorate. All along he was writing journalism for a variety of publications, and after Oxford he hosted his own TV show, Ronan Farrow Daily, on MSNBC and then an investigative section on NBC’s Today. It was while working on the NBC show that he began looking into rumours and allegations that the film producer Harvey Weinstein had sexually abused a number of women. When NBC showed its reluctance to take on Weinstein, Farrow took his story to the New Yorker, and the rest is history. In any case, for his considerable efforts Farrow and the New Yorker shared with the New York Times a Pulitzer prize, the highest award in American journalism.\n\nAnd if all that’s not enough, Farrow has just published a hefty 400-page book called War on Peace: The End of Diplomacy and the Decline of American Influence. It’s a sober and rather thoughtful account of his experience working for Holbrooke and how the creeping militarisation of US foreign policy has undermined and curtailed diplomatic initiatives with self-defeating results. That’s why he’s sitting before me in the Soho hotel, in a natty black suit and immaculately pressed shirt with sunless white skin and striking blue eyes – to talk about the book.\n\nThe day before I meet Farrow, the New York state attorney general Eric Schneiderman had announced his resignation, after a piece by Farrow and Jane Mayer in the New Yorker documented allegations that Schneiderman, a vocal critic of Weinstein and staunch defender of women’s rights, had himself assaulted several women. Just before that, another story by Farrow had presented evidence that the private intelligence agency Black Cube, which was employed by Weinstein to gather negative information on his accusers, had also been recruited to find damaging information on proponents of the Iran nuclear deal in the Obama administration. A day later President Trump announced that he was withdrawing US support for the deal.\n\nSuddenly global news and Farrow’s preoccupations seem indistinguishable, as if international diplomacy and sexual abuse by powerful men were all part of a great interlocked conspiracy. Did it seem to him that his interests were converging into one enormous story?\n\nFacebook Twitter Pinterest With his mother Mia on a Unicef mission to Sudan in 2004. Photograph: Shehzad Noorani/UNICEF via Getty Images\n\n“I was in a briefing with a number of reporters and a source recently,” he says. “And one of the journalists present said: It’s not stories plural, it’s all one big story. And I think there’s some truth to that. With respect to the reporting I’ve been doing specifically, you’re looking at the very same systems of power and the abuse of power and the suppression of stories that are employed by powerful men in Hollywood and powerful people in politics.”\n\nThe book is a compelling mixture of political analysis and personal anecdote written in a reflective, almost nostalgic tone that betrays none of the doubt and uncertainty or zeal and tunnel vision that are the common characteristics of youth. Instead his sympathetic but critical portraits of Holbrooke and Clinton seem the product of a mind that is old before its time. The prose is steeped in a kind of worked-at maturity, a moral seriousness of the sort that his father instinctively made fun of. If Allen was always the overgrown child, ridiculing the responsibilities of adulthood, then Farrow is the premature grownup, earnestly trying to make the world a better place.\n\nIn his book Farrow records an outburst from the flamboyant Holbrooke in which the veteran diplomat took his acolyte to task for his inflated sense of self. “I know you think you have destiny. That you’ll do great things,” Holbrooke told him. Had he ever thought of himself in those terms? “I think the point was he was really describing himself,” he says.\n\nYes, perhaps, but was he not also describing you? “I don’t particularly view myself as someone who must ascend to a particular status or place in history. I would be foolish to claim that I am not ambitious. I am someone who works around the clock. But it’s a very different kind of ambition to Richard Holbrooke’s. I always have a little voice on my shoulder from my childhood, and probably from my mother and the kind of family she built. It was very much rooted in altruism and I admire that tremendously and I would not have the strength to do it myself, but it did give me this sort of inherited sense of public service.”\n\nHe does indeed appear to be a workaholic. His private life is low-key, when he’s not hanging out with celebrities, though he is said to be in a relationship with former Obama speechwriter and popular liberal podcaster Jon Lovett. But, as he says, it’s public service that he prefers to focus on and one aspect of that is a warning, voiced in his book, that the world is going backwards because of diminishing US foreign influence.\n\nTo many people around the globe that diminishment can only be a good thing. But Farrow makes a strong case for the benefits of long-term strategic American diplomacy of the kind, he says, that is being crushed by the White House. To those who see any American influence, however benign, as a sign of imperialism, Farrow has a chastening message.\n\n“There’s a lot of positive leadership in the world today,” he says, “but the problem is that we’re not witnessing the withdrawal of America from diplomatic leadership and the succession into that space of Angela Merkel. We are witnessing China nipping at the heels of the western powers and coming into its own in a lot of ways in diplomatic leadership but still very much evincing a retrograde set of attitudes on human rights.”\n\nHe talks about China’s leadership deserving close scrutiny, which is a much more restrained turn of phrase than the language he was using back in 2008, when he declared the Beijing Games “the genocide Olympics”, as a result of China’s malign role in Sudan. Now he notes how hard the Chinese are working, making investment in infrastructure in countries around the world where “the US doesn’t even have ambassadors any more”.\n\nFacebook Twitter Pinterest As an infant with, from left, sister Dylan, father Woody Allen and mother Mia Farrow. Photograph: Rex\n\nHe writes in his book of how Trump has accelerated this process, but also how it’s been a growing part of US politics under several administrations, including that of Nobel peace prize winner Barack Obama. Farrow argues that Obama centralised power at the expense of diplomats in the state department, and talks about a “celebrity general” culture, with the military gaining too much influence on decision-making abroad, particularly in Afghanistan and Pakistan. But he also praises Obama for the Iran nuclear deal that Trump has just torn up, the thaw in relations with Cuba that Trump is threatening to reverse and the Paris climate change accords, which Trump has already committed to leave.\n\nAlthough he’s too diplomatic to say it, Trump is the embodiment of everything that Farrow abhors. It seems at best paradoxical that a nation that has been thrown into self-analysis as a result of the Weinstein revelation could have voted for someone who revelled in the language of sexual harassment.\n\n“I think if anything those two facts are closely related and quite consistent,” he says. “I think a lot of survivors of sexual violence and particularly women felt that the election of Donald Trump was a rebuke or a return to a time in which these sorts of stories were not heard or cared about. And I think the political backdrop absolutely informed the frustration of survivors who finally felt they couldn’t wait any longer to speak.”\n\nIt’s typical of the answers he gives during our interview: articulate, heartfelt and yet a little rehearsed. The effect is like listening to a series of right-thinking summaries – perfectly reasoned but a touch preachy.\n\nBut then Farrow has been at the frontline of a moral crusade that has not only inspired millions of women across the world but also features people – mostly women – who have suffered real and sometimes appalling abuse. That position comes with a certain responsibility and Farrow wears it with a solemn authority. For example, when I ask him if he is now being approached by many people with stories of abuse, he says: “I do field a fair amount of incoming leads and I’m profoundly grateful for that, and anyone reading this story, if you have an experience or a bit of knowledge that is of international newsworthiness, please do email me. My email is on my Twitter account.”\n\nThat “international newsworthiness” is not ironic. It’s the plane on which he operates, and he’s not about to pretend otherwise. I suggest that the history and nature of journalism means that the emphasis is on getting the story rather than offering ongoing support to traumatised sources. Can a journalist who often works 18-hour days and admits to never seeing friends really provide much by way of aftercare?\n\n“The answer is I absolutely feel an ongoing obligation to every source that was brave enough to help expose injustice, and that obligation doesn’t end on the day that the story is published. I think if you ask any of the sources who have worked with me on these very difficult stories – and these relationships are not always easy because these stories have an explosive impact on their lives – they’ll tell you I am there for them to take the late-night calls and there to work with them if there is fallout, and my heart breaks for them when there’s a high cost of telling these stories. But mostly I’ve found that I’ve had the opportunity to celebrate them healing as a result of telling these stories.”\n\nFacebook Twitter Pinterest With his mother at a gala event in New York last month. Photograph: Erik Pendzich/Shutterstock\n\nAs Farrow rightly points out, the cases he has reported on involve allegations of serious crimes that should not be confused with the “grey area” of bad dates and misinterpreted signals. He doesn’t agree with some of the more vehement activists who insist that all women who say they have been raped or sexually abused should be automatically believed.\n\n“My job is to interrogate as thoroughly and as sceptically as possible every allegation that is in a story I’m reporting and to, in an almost legalistic way, stress-test those claims. And I have very difficult conversations explaining to the very brave sources in those stories that the best armour that they can have as a source is my sceptical interrogation of their allegations.”\n\nFarrow remains measured and dispassionately meticulous in his analysis as we discuss the various complications that surround issues of sexual abuse – the power and influence of the abuser, the vulnerability of the abused, the harsh legal process. He only begins to look a little flustered when the subject turns to his sister Dylan’s allegations of molestation at the hands of their father, Allen, which Farrow himself introduces into the conversation.\n\nPlay Video 1:31 'I wasn't brainwashed': Dylan Farrow gives first TV interview about Woody Allen claims - video\n\nWhen listing the various antecedents, including the Bill Cosby case, that led up to the #MeToo moment, Farrow cited his sister, who “came forward with a very difficult allegation against a powerful man that she had maintained for years but felt the need to speak about again”. I couldn’t help but notice that the unnamed “powerful man” was Dylan’s own father, Woody Allen, although in this most complicated of families, even that fact is open to question, courtesy of a comment made by Mia Farrow in a 2013 Vanity Fair interview. She told the writer Maureen Orth that Ronan was “possibly” Frank Sinatra’s child.\n\nEver since, people have drawn attention to the resemblance between Ol’ Blue Eyes and Young Blue Eyes. It’s more apparent in photographs than in the flesh, where it’s obvious that the person Farrow most looks like is his mother. In any case Dylan’s allegations, which now date back 26 years, remain the subject of dispute. Allen has always denied them. There isn’t room here to cover all the details, but suffice to say that it centres on a visit Allen paid to Mia Farrow’s home in Bridgewater, Connecticut in August 1992.\n\nDylan said soon afterwards and continues to say that Allen assaulted her in an attic. The Connecticut state attorney investigated but did not press charges and the New York department of social services found “no credible evidence” to support the allegations. However when Allen sought to gain sole custody of Dylan, Ronan and their brother Moses, the judge censured Allen and he was denied visitation rights with Dylan. He was only allowed to see her under strict supervision.\n\nIn such circumstances, where there is no certainty over what took place (the court-appointed child sexual abuse expert at the custody case suggested it was likely that Mia Farrow coached her daughter – but the judge was critical of the expert’s report), I wondered what the responsibility was of society at large.\n\nSince the Weinstein revelations, a number of actors, including Rebecca Hall, Colin Firth and Greta Gerwig, have announced that they would never work with Allen again. Is there a danger, I asked, that the presumption of innocence was being cast aside in a fever of (belated) righteous indignation?\n\nI’ve made too many enemies through my journalism ever to run for political office in the United States\n\n“That’s absolutely not a fair characterisation of the facts,” snaps Farrow, suddenly flashing an inner steeliness. “There is an abundance of evidence that Woody Allen was engaged in a pattern with respect to underage women and that’s in the trove of documents the Washington Post uncovered; it’s in the civil proceedings that happened and the family court proceedings that happened in New York, where there was intense debate about the age of my other sister he was engaging in sexual relations with in our household. This was a serial fixator on underage girls. Now if your suggestion is that every single allegation worth reporting has to be a massive case of serial rape on the scale of Harvey Weinstein, I don’t agree with that premise.”\n\nIt’s relevant though because in the open letter from Dylan that was published online in the New York Times in 2014, in which she reasserted the original allegations against her father, she criticised the actors who stood by Allen and acted in his films. I restate the question, simply noting that there is as far as I’m aware no criminal case being mounted against Allen – so how should society treat him?\n\n“I would say the individuals in that category are many. Harvey Weinstein is in exactly the same category. These are claims that have not been interrogated to the point of a final legal disposition.”\n\nThat’s true, but earlier he had told me that he was “talking to accusers of Harvey Weinstein right now who are being asked by law enforcement in various jurisdictions to be at the heart of criminal proceedings”.\n\nAgain, that doesn’t seem to be the case with Allen.\n\nThose who deplored the persecution of Roman Polanski enabled the likes of Weinstein | Barbara Ellen Read more\n\n“Look, the jig is not up until we all lay down to die. There are going to be criminal repercussions for I think a number of men around whom there has been credible reporting on these kinds of allegations. And Woody Allen is in that category. I think people who ask the kinds of question you just asked very often haven’t read into the investigative reporting around it.\n\n“If you look at Andy Thibault’s exhaustive reporting in Connecticut Magazine back in the day or Maureen Orth’s investigative reporting, it’s very clear that it is towards the end of the most heavily corroborated cases that have emerged publicly. Otherwise I wouldn’t have spoken out in support of my sister.\n\n“I think in terms of society’s obligation to react to individuals who have not been convicted, like a Harvey Weinstein or a Woody Allen or for many years Bill Cosby, it’s absolutely correct to draw the distinction that you’re talking about a man who hasn’t been convicted in a court of law – until they have been. And I always note that distinction. The separate issue of whether people should boycott a person professionally is a personal decision. Clearly many people, including my sister, feel strongly that people shouldn’t work with these individuals. I’ve highlighted that survivors feel that way, and that it makes them feel invisible and marginalised when people validate individuals with a very serious cloud of suspicion over them, but I haven’t particularly called for a boycott of anyone.”\n\nIt’s a great speech, full of conviction and supporting argument. I can’t claim to know whether he’s right or wrong in his assessment of his father. What’s beyond doubt is that Allen acted in a profoundly creepy fashion in starting an affair with Farrow’s sister. It also, one can imagine, would have had a destabilising impact on a young boy working out his place in the world. As Farrow himself once noted: “He’s my father married to my sister. That makes me his son and his brother-in-law. That is such a moral transgression.”\n\nFacebook Twitter Pinterest With Richard Holbrooke (yellow jacket) and top brass in Kabul, 2010. Photograph: Morgan J O'Brien III\n\nAnd Farrow, you sense, is a deeply moral person. He is also a deeply ambitious one. At the moment he’s setting the news agenda with a series of incendiary stories, and there’s talk of him getting his own investigative TV show. But I’m not sure that this young man who has already experienced so much will be content to restrict himself to journalism. If the opportunity arose, would he not prefer to have a big career in politics?\n\nHe’s ready, as ever, with a political answer. “I think quite aside from anything else,” he says, “I’ve made too many enemies through my journalism ever to run for political office in the United States.” In the post‑Trump world, I tell him, no one can say that. “That,” he concedes, laughing, “is possibly a fair point.”\n\n“Thank you for your time,” he says, finishing the interview in the same way as he began it. My time? No, now is very definitely Ronan Farrow’s time.\n\nWar on Peace by Ronan Farrow is published by William Collins (£20). To order a copy for £17 go to guardianbookshop.com or call 0330 333 6846. Free UK p&p over £10, online orders only. Phone orders min p&p of £1.99\n\n• On 13 May 2018 this article was amended to remove the reference to intelligence agency Black Cube denying an allegation made by the New Yorker", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Investigative+journalism%2CUS+politics%2CPolitics%2CHarvey+Weinstein%2CMia+Farrow%2CWoody+Allen%2C%23MeToo+movement%2CCulture%2CRonan+Farrow", "https://i.guim.co.uk/img/media/3f5f91b34942e92474baab2a703a5659e5ebb6b5/157_339_3357_2015/master/3357.jpg?width=300&quality=85&auto=format&fit=max&s=3a830e32d0a4107074d19fc76227ebb1", "https://i.guim.co.uk/img/media/44d3eb5d6818ee59544fbc7a05158104823247cc/0_1182_3840_2303/master/3840.jpg?width=300&quality=85&auto=format&fit=max&s=58e65e1359e72ea8b422106410f3795b", "https://i.guim.co.uk/img/media/a4026c14c77ed4fa03db9c065b4afe1cbb000c95/0_343_4016_5018/master/4016.jpg?width=300&quality=85&auto=format&fit=max&s=f9c1252c4574bc6ab422563271879efb", "https://i.guim.co.uk/img/media/44d3eb5d6818ee59544fbc7a05158104823247cc/0_1182_3840_2303/master/3840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=229d37a48d367c05411f50048da262f8", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://i.guim.co.uk/img/media/608e314c7f0733a0ac18c64ae719344344f13d55/0_232_2848_1708/master/2848.jpg?width=300&quality=85&auto=format&fit=max&s=ddb8c25ffdcf53159c5f50a4f9daab7f", "https://i.guim.co.uk/img/uploads/2018/03/12/Andrew_Anthony,_L.png?width=300&quality=85&auto=format&fit=max&s=74a67348ad6cabb77b334b22fa669671", "https://i.guim.co.uk/img/media/69f20b335a93b6182bdd97960638282dac1d803a/0_0_3008_1804/master/3008.jpg?width=300&quality=85&auto=format&fit=max&s=75466baff585094242af11bae7029707"], "top_img": "https://i.guim.co.uk/img/media/44d3eb5d6818ee59544fbc7a05158104823247cc/0_1182_3840_2303/master/3840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=229d37a48d367c05411f50048da262f8", "keywords": [], "authors": ["Andrew Anthony"], "canonical_link": "https://www.theguardian.com/media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too", "title": "Ronan Farrow: Woody Allen, Harvey Weinstein and me", "meta_data": {"description": "Ronan Farrow, the son of Mia and Woody Allen, is the Pulitzer-prize winning journalist whose exposé triggered #MeToo. Now, he has written an acclaimed book on waning US diplomatic influence – and he’s still only 30", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Andrew Anthony", "thumbnail": "https://i.guim.co.uk/img/media/44d3eb5d6818ee59544fbc7a05158104823247cc/0_1182_3840_2303/master/3840.jpg?width=620&quality=85&auto=format&fit=max&s=846203827c811880124d68250442ee09", "keywords": "Investigative journalism,US politics,Politics,Harvey Weinstein,Mia Farrow,Woody Allen,#MeToo movement,Culture,Ronan Farrow", "news_keywords": "Investigative journalism,US politics,Politics,Harvey Weinstein,Mia Farrow,Woody Allen,#MeToo movement,Culture,Ronan Farrow", "og": {"url": "http://www.theguardian.com/media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too", "image": "https://i.guim.co.uk/img/media/44d3eb5d6818ee59544fbc7a05158104823247cc/0_1182_3840_2303/master/3840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=229d37a48d367c05411f50048da262f8", "description": "Ronan Farrow, the son of Mia and Woody Allen, is the Pulitzer-prize winning journalist whose exposé triggered #MeToo. Now, he has written an acclaimed book on waning US diplomatic influence – and he’s still only 30", "type": "article", "title": "Ronan Farrow: Woody Allen, Harvey Weinstein and me", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/andrewanthony", "publisher": "https://www.facebook.com/theguardian", "section": "Media", "published_time": "2018-05-14T06:45:43.000Z", "tag": "Investigative journalism,US politics,Politics,Harvey Weinstein,Mia Farrow,Woody Allen,#MeToo movement,Culture,Ronan Farrow", "modified_time": "2020-02-24T18:37:08.000Z"}, "al": {"ios": {"url": "gnmguardian://media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too", "iphone": "gnmguardian://media/2018/may/13/ronan-farrow-interview-woody-allen-harvey-weinstein-me-too?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/44d3eb5d6818ee59544fbc7a05158104823247cc/0_1182_3840_2303/master/3840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&s=ee94fa836db1e1c56a285d49cc54035d", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1526140800.0, "source": "https://www.theguardian.com", "summary": ""}