{"url": "www.etonline.com/biggest-celebrity-feuds-2017-92730", "text": "There was no shortage of celebrity beefs in 2017.\n\nWhether the fights were between co-stars or once close friends, the shade just kept coming. Let's take a look back at the most intense celebrity feuds of the year.\n\n1. Blac Chyna vs. Rob Kardashian\n\nBlac Chyna and Rob Kardashian's split turned a new level of nasty when the former couple exchanged wild accusations against one another in a heated, NSFW social media war in June. Kardashian shared graphic naked photos of Chyna, accused her of cheating on him multiple times and also accused her of being on drugs. Meanwhile, Chyna took to Snapchat to accuse Kardashian of also cheating on her and being physically abusive.\n\nOne month later, a judge granted Chyna's request for a temporary restraining order against Kardashian.\n\n\"Revenge porn is a form of domestic abuse,\" Chyna's attorney, Lisa Bloom, said during a press conference.\n\nGreg Doherty/Getty Images\n\nBut the two now appear to be keeping it amicable when it comes to their daughter, 1-year-old Dream. In September, the two reached a custody agreement.\n\n\"Chyna is pleased that Rob has agreed to peacefully co-parent Dream with her, as she has been requesting all along,\" Bloom said in a statement.\n\nKardashian’s attorney, Robert Shapiro, also told ET at the time that \"Rob and Chyna are working together to put the best interest of their child first and have amicably resolved their personal matters.\"\n\nOf course, Chyna is still suing Kardashian, his mom Kris Jenner and sister Kim Kardashian West over the cancellation of E!’s Rob & Chyna.\n\n2. Dwayne Johnson vs. Tyrese Gibson\n\nAlberto E. Rodriguez/Getty Images\n\nThe drama between the Fast and Furious co-stars began in September, when Gibson left a comment on Johnson’s Instagram post, asking him not to let a rumored spinoff film starring Johnson’s character, Agent Hobbs, push back the planned release date of Fast 9.\n\n“I’m simply trying to reach him cause he won’t call me back about this solo #HobbsMovie,” Gibson wrote in the lengthy comment. “I want you to shoot it just not right now cause the #Fast9 release date has already been announced.”\n\nThe feud escalated one month later, when Gibson called out Johnson on Instagram, and slammed his critical and commercial flop, Baywatch.\n\n\n\nJohnson defended himself on Twitter.\n\n\"My goal from day 1 was to come in and create an exciting/fun character for the fans, elevate the franchise and build it out,\" he tweeted.\n\nGibson also took to Twitter, to call his co-star \"selfish.\"\n\n\"The real selfish #CandyA** revealed,\" Gibson wrote. \"And why you on Twitter?? You lost my number right? I'm at you when I see you #Family.\"\n\n\"You still promoting a movie that no one wants to see made you clown,\" he continued.\n\nOf course, Johnson didn't take the shady tweets lying down.\n\n\"Pumped to expand and build out the FAST & FURIOUS universe in a cool, exciting way,\" Johnson captioned yet another Instagram post, adding, \"Thank you UNIVERSAL STUDIOS for being tremendous partners who see the big picture and for coming to us years ago with this spinoff idea.\"\n\n\n\n\"I have a tremendous amount of respect for this franchise that I’ve enjoyed droppin’ blood and sweat in over the years,\" he continued. \"And my vision is to create greater opportunities for not only my fellow FF cast mates, but for other amazing actors as well who want to be a part of something new and cool.The more opportunities we can create the better for the fans. Smart business,\" he argued. \"Let’s have some FUN and to quote, Hobbs the boss, if you don’t like it, we’re happy to beat that a** like a Cherokee drum. #CandyA**esNeedNotApply.\"\n\nAlthough Gibson Instagrammed in November that he was out of the Fast and the Furious franchise if Johnson was in, he later claimed he was \"never mad\" at Johnson .... though continued to slam him.\n\n\"So the Rock how does it feel bro?.... going home to your daughter every night,\" he asked, referencing his highly publicized custody battle over daughter Shayla. \"It was 60 days before I seen my baby..... and all I asked you to do 'privately' was NOT accept a role that would deeply affect us all....... You are simply NOT the people’s champ..... you are a selfish champ.\"\n\n3. Kanye West vs. JAY-Z\n\nGetty Images\n\nThe two close friends and collaborators' falling out continued this year, after West publicly called JAY-Z out during an onstage concert rant last November.\n\n\"You got hurt, because this guy was talking about you on a stage,\" JAY-Z commented in August during an interview with Elliott Wilson and Brian \"B.Dot\" Miller on the Rap Radar podcast. \"But what really hurt me, you can't bring my kid or my wife into it. Like, Kanye is my little brother. He's talked about me a hundred times. He even made a song called ‘Big Brother.' We've gotten past bigger issues, but you brought my family into it, now it's a problem.\"\n\nIn July, West reportedly left JAY-Z’s Tidal over a money dispute.\n\nHowever, there is hope for those wishing for a Watch the Throne part two. During a Q&A with New York Times executive editor Dean Baquet for T: The New York Times Style Magazine in November, JAY-Z had a few conciliatory words for West, whom he still referred to as his \"brother.\"\n\n\"I [talked to] Kanye the other day, just to tell him, like, he's my brother,\" he recalled. \"I love Kanye. I do. It's a complicated relationship with us.\"\n\nStill, JAY-Z admitted that there's currently tension between the two.\n\n\"But that happens,\" he stressed. \"In the long relationship, you know, hopefully when we're 89 we look at this six months or whatever time and we laugh at that. There's gonna be complications in the relationship that we have to get through. And the only way to get through that is we sit down and have a dialogue and say, 'These are the things that I'm uncomfortable with. These are the things that are unacceptable to me. This is what I feel.' I'm sure he feels that I've done things to him as well. I'm not a perfect human being by no stretch.\"\n\n\"[West is] a very compassionate person,\" he added. And a lot of times he get in trouble trying to help others, So, I can identify with it. It's just that there's certain things that happened that's not really acceptable to me. ... And we just need to speak about it. But there's genuine love there.\"\n\n4. Camila Cabello vs. Fifth Harmony\n\nGetty Images\n\nThings turned messy between girl group Fifth Harmony and Camila Cabello pretty quickly after she announced she was leaving the group last December, and the remaining members -- Lauren Jauregui, Ally Brooke, Normani Kordei and Dinah Jane -- claimed in a statement that they only learned of her departure through her representatives.\n\nIn an interview with Billboard in February, Cabello talked about the “intense” split and admitted she hadn’t spoken to her former bandmates.\n\n\"I was always super open [that] I couldn’t just sing other people’s words and be totally happy with that,\" Cabello said of exiting the group. \"You have to follow and honor that inner voice. I always encouraged the girls to do the same.\"\n\n\"I don’t want to get into the details of that, because it was really intense and it’s hard for me to talk about,\" she added about not keeping in touch. \"It makes me sad.\"\n\nIn their own Billboard interview in July, Fifth Harmony wasn’t shy about alluding to the bad blood.\n\n“Let’s just say we’re in a better place now -- there are no secrets in this circle,” Jane said of Cabello's exit.\n\nHowever, the shadiest moment definitely happened at the MTV Video Music Awards in August, when before their performance of \"Angel\" and \"Down,\" a a fifth member of the group -- presumably meant to represent Cabello -- fell backwards off the stage.\n\nThe group later denied they were slamming Cabello during an interview with Good Morning America.\n\n“We get asked all the time if we’re getting a fifth member,” Brooke explained. “And we wanted to show the world in an artistic way that, ‘Hey, the four of us are Fifth Harmony. We are stronger and better than we’ve ever been.\"\n\n5. Kim Cattrall vs. Sex and the City Cast\n\nNew Line Cinema\n\nRumors have floated around for some time now that Kim Cattrall didn't get along with her Sex and the City cast members, and they were pretty much confirmed this year, after Sarah Jessica Parker announced that there would be no Sex and the City 3 film.\n\n\"It's over... we're not doing it,\" she told Extra. “I’m disappointed. We had this beautiful, funny, heartbreaking, joyful, very relatable script and story. It’s not just disappointing that we don’t get to tell the story and have that experience, but more so for that audience that has been so vocal in wanting another movie.”\n\nThe Daily Mail later reported that it was Cattrall's \"demands\" that put a stop to the project, claiming she insisted that Warner Bros. produce other movies she had in development before signing onto SATC 3. Cattrall denied the report on Twitter.\n\nWoke 2 a @MailOnline 💩storm! The only 'DEMAND' I ever made was that I didn't want to do a 3rd film....& that was back in 2016 — Kim Cattrall (@KimCattrall) September 29, 2017\n\nCattrall then specifically called out Parker during an interview with Piers Morgan for ITV's Life Stories.\n\n\"At this very moment, it’s quite extraordinary to get any kind of negative press about something that I’ve been saying for almost a year,\" she noted. \"This is really where I take to task the people from Sex and the City, specifically Sarah Jessica Parker, in that I think she could have been nicer,\" she expressed to Morgan. \"I really think she could have been nicer.\"\n\n\"I don’t know what her issue is, I never have,\" she added.\n\nCattrall also said she was never friends with her SATC co-stars, including Cynthia Nixon and Kristin Davis.\n\n\"We‘ve been colleagues and in some ways, it’s a very healthy place to be because then you have a clear line between your professional life and relationship and your personal,\" she noted. \"They all have children and I am 10 years older, and since, specifically, the series ended, I have been spending most of my time outside of New York, so, I don’t see them. The common ground that we had was the series, and the series is over.\"\n\nThough she did admit that she wishes her co-stars would try harder to keep in touch, after sharing that she couldn't even recall the last time she had spoken to them.\n\n\"That’s another thing that’s really disappointing, is that nobody ever picks up the phone and tries to contact you and say, ‘How you doing?’\" she shared.\n\n…. And it appears the cast is taking sides. Willie Garson -- who portrayed Stanford Blatch, the best friend of Carrie Bradshaw (Parker) in both the TV series and the movies -- posted a cryptic tweet in October that appeared to be aimed at Cattrall. Cattrall repeatedly denied that she ever considered doing a third SATC movie and further claimed that she never began contract negotiations.\n\n\"Dear fans, because I'm \"toxic,\" I'm going to negotiate a contract for 6 months, not come to terms, then say I never wanted to do it anyway,'\" he wrote.\n\nDear fans, because I'm \"toxic\", I'm going to negotiate a contract for 6 months, not come to terms, then say I never wanted to do it anyway. — Willie Garson (@WillieGarson) October 4, 2017\n\n6. Katy Perry vs. Taylor Swift\n\n\n\nGetty Images\n\nThe epic Katy Perry vs. Taylor Swift feud continued with the promotion of both their respective albums this year -- Perry's Witness and Swift's Reputation. Perry didn't hold back during her Carpool Karaoke segment with James Corden in June, addressing the beef head-on.\n\n\"Honestly, it's really like she started it and it's time for her to finish it,\" Perry said after the Late Late Show host asked her to clear things up. \"She wouldn't speak to me. I do the right thing any time that it feels like a fumble. It was a full shutdown and then she writes a song about me and I'm like, 'OK, cool, cool, cool. That's how you wanna deal with it?'\"\n\nIn an interview with NME, Perry gave background on why she decided to address the feud with Corden.\n\n“I mean, I’m not Buddha -- things irritate me,” she said. “I wish that I could turn the other cheek every single time, but I’m also not a pushover, you know? Especially when someone tries to assassinate my character with little girls [her fans]. That’s so messed up!”\n\nThough Swift stayed silent on Perry's comments about her, she let her actions do the talking. Swift surprisingly announced on June 8 that her entire catalog will return to all streaming services at midnight -- just when Perry's Witness dropped.\n\nSwift also took thinly veiled digs at Perry in her \"Look What You Made Me Do\" music video that dropped in August. Swift dresses up very similar to Perry in the shade-filled video and gets into a car crash -- a moment that looks very close to the accident in Perry's \"Unconditionally\" music video. She also pointedly holds a GRAMMY, highlighting that she has 10 accolades, while Perry has zero.\n\nLater, Swift is in a vault, robbing a bank and wearing a sweatshirt that features a glittery tiger, along with a cat mask, seemingly mocking the name of Perry's fanbase, KatyCats.\n\nYouTube\n\n7. Caitlyn Jenner vs. The Kardashians\n\nGetty Images\n\nCaitlyn Jenner's relationship with the Kardashian family deteriorated after the August release of her memoir, The Secret of My Life, which didn't exactly paint the Kardashians in a positive light. Kris Jenner claimed on Keeping Up With the Kardashians that Caitlyn's stories about her were \"all made up.\"\n\n\"My mom has been so fair to Cait, and Cait just has no decency towards my mom whatsoever,\" Kim Kardashian West later told KUWTK cameras, clearly siding with her mother. \"I feel like my mom is carrying this burden and feeling like she had to maintain a relationship with Caitlyn for all the kids. But we're grown up. I don't think my mom has to try anymore. It's time to move on.\"\n\nIn September, Caitlyn said she hadn't spoken to Kris or Kim since the book's release.\n\n“I went overboard to be nice, to be friendly, to be open, but also tell my story and my side of the story,” Caitlyn said during an appearance on Good Morning Britain. “Since the book came out, I’ve never talked to Kris again. Kim, I haven’t talked to in six, nine months, whatever it is.”\n\n\"It’s unfortunate, because actually Kim was the first one I talked to about this issue,” she continued. \"She was very straightforward with me. She’s been very, very good on it. It’s a big loss in my life, not having her there anymore. To me, I mean, that’s sad.\"\n\nCurrently, the relationship is showing no signs of repair.\n\nThe I Am Cait star spoke to students at Cambridge Union in England in November, where amid discussing her 2015 transition and its aftermath, she revealed that she and Kim haven't spoken in \"a year.\"\n\n“It’s been a little bit tough over the last couple of years on the Kardashian side,\" Caitlyn acknowledged. \"To be honest, I don't talk to them anymore. Kim, I haven't talked to in a year.\"\n\n\"They don't want me in their lives, they bashed me pretty badly,\" she continued. \"It's devastating when your kids do that. It really hurt.\"\n\n8. Drake Bell vs. Josh Peck\n\nGetty Images\n\nThe state of the Drake & Josh co-stars' friendship made headlines in June, when Bell made it clear he was upset that he wasn't invited to Peck's wedding to Paige O'Brien. Although Bell wasn't present at the ceremony, Peck's Grandfathered co-star, John Stamos, was, as well as Jason Nash, whom Peck also acted with on Drake & Josh.\n\nIn now deleted tweets, Bell made his feelings known.\n\n\"When you're not invited to the wedding the message is clear…\" Bell tweeted. \"Loyalty is key… ALWAYS remember where you came from.\"\n\n\"True colors have come out today,\" he added. \"Message is loud and clear. Ties are officially cut. I'll miss ya brotha.\"\n\nFor his part, Peck made it clear that he no longer had a close relationship with Bell during his appearance on the Allegedly with Theo Von & Matthew Cole Weiss podcast.\n\nET spoke to Bell in July, when he explained the emotional tweets.\n\n\"We've been together 18 years, Josh and me, me and Josh,\" Bell shared. \"We've been so close, it was just one of those things where, you know, I'd been talking to him, and he's been telling me about the engagement. And then I saw on social media, the wedding, and I didn't hear about it. So, it was just one of those things where it was just like, 'You didn't even tell me?! I had to find out on social media?' And then you're like, 'You know what!? Fine!' and then I'm like, wait, I probably shouldn't have done that.\"\n\n\"Yeah, I said the ties are cut or whatever, but I should have just texted that to him, you know,\" he continued. \"I was just being cranky.\"\n\nTo solidify that the two had no hard feelings, they later reunited at the MTV VMAs in August.\n\n9. Justin Bieber vs. Marilyn Manson\n\n\n\nMatt Winkelmeyer, Kevin Mazur/Getty Images\n\nOne of the most bizarre feuds of the year was between pop star Justin Bieber and goth rocker Marilyn Manson. During an interview with Billboard in September, Manson said he confronted Bieber at a bar when he saw that the \"Sorry\" singer was selling shirts with Manson's face on the front and Bieber's name on the back, as part of his official Purpose World Tour merchandise.\n\n\"I saw a little girl in a pink hoodie with blond hair, and it turns out to be Bieber. I sit down, and I say, 'Hey, so you wore my shirt and everything onstage,'\" Manson recalled. \"He was one of those touchy people that hit you when they talk, and he comes up to about d**k height. Then he goes, 'I made you relevant again.'\"\n\nManson said he got revenge by not showing up to a planned duet between the two at Bieber’s show that he suggested.\n\n\"I reply, 'That was a great idea you had about doing [my song] 'The Beautiful People' at your show at Staples Center tomorrow.' And he goes, 'Yeah, it was,' not knowing that I told him an idea that I had just made up,\" Manson shared. \"His tour manager sat down, and I asked, 'What time is sound check tomorrow? What time should I be there? Because we’re going to do 'Beautiful People.’ Obviously, when 4 p.m. rolled around the next day, I just didn't show.\"\n\nManson later claimed Bieber apologized to him through text during Manson’s appearance on Howard Stern's Sirius XM show.\n\nQuoting Bieber’s supposed texts, Manson read, “Honestly, I totally thought we hit it off. My bad. If I was an a**hole, it wasn't my intention.”\n\n\"I don't really care about the media,\" Manson continued to read from Bieber's supposed texts. \"I just wanna make sure you and I were good. ‘Cause I like you.\"\n\nManson further reflected on their feud.\n\n\"He sassed me and he apologized,\" Manson explained. \"And I said I wouldn't s**t talk him, so I wouldn't s**t talk him.\"\n\n", "images": ["http://www.etonline.com/sites/default/files/styles/970xh/public/images/2010-10/sex_and_the_city_2_640_newlinecinema.jpg?itok=-49Xh-pF", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-06/1280_josh_peck_drake_bell_508238568_062017.jpg?itok=l_dIYojZ", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-12/black_chyna_rob_kardashian_gettyimages.jpg?itok=S9N0fUTI", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/Nick_Cordero_GettyImages-1170627987_300.jpg?h=6c83441f&itok=xKfSx0Z1", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-09/marilyn_manson_justin_bieber_2pic_gettyimages.jpg?itok=FsZQ1klw", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2016-12/1280_fifth_harmony_GettyImages-630220688.jpg?itok=ds2aLERi", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_121417_BiggestFeuds.jpg?h=c673cd1c&itok=cl6XZ3O6", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2016-11/katy_taylor_96288206.jpg?itok=xOvS5E5Z", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2019-03/1280holt.jpg?h=c673cd1c&itok=I5fAM82n", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-12/01-taylor-swift-look-what-you-made-me-do-screenshot-2017-billboard-1240.jpg?itok=6-xSWlqZ", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-12/caitlyn_jenner_kardashian_gettyimages-509642578.jpg?itok=UJkk0rkW", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-09/dwayne_johnson_tyrese_gibson_gettyimages-468312898.jpg?itok=F29ZMS1j", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2015-08/set_kanye_west_jay_z_tidal_launch.jpg?itok=VDP6TMcd"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_121417_BiggestFeuds.jpg?h=c673cd1c&itok=cl6XZ3O6", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/biggest-celebrity-feuds-2017-92730", "title": "The Biggest Celebrity Feuds of 2017", "meta_data": {"article": {"opinion": "false"}, "title": "The Biggest Celebrity Feuds of 2017 | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/biggest-celebrity-feuds-2017-92730", "title": "The Biggest Celebrity Feuds of 2017", "description": "There was no shortage of celebrity beefs in 2017.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_121417_BiggestFeuds.jpg?h=c673cd1c&itok=cl6XZ3O6", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "There was no shortage of celebrity beefs in 2017.", "title": "The Biggest Celebrity Feuds of 2017", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno‍", "url": "https://www.etonline.com/biggest-celebrity-feuds-2017-92730", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_121417_BiggestFeuds.jpg?h=c673cd1c&itok=cl6XZ3O6"}, "description": "There was no shortage of celebrity beefs in 2017.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Blac Chyna, Rob Kardashian, Dwayne Johnson, Tyrese Gibson, Kanye West, Jay Z, Justin Bieber, Marilyn Manson, Sex and the City, Fifth Harmony, Camila Cabello, Best of 2017", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.etonline.com", "summary": ""}