{"url": "https://variety.com/2018/tv/news/sam-rockwell-drops-f-bomb-snl-1202664138/", "text": "Actor Sam Rockwell ensured his debut as host on “Saturday Night Live” was memorable by letting loose with an accidental and unexpected “f-bomb” – the first time such an incident has occurred since NBC began airing the program live across the nation , putting it on in primetime in some parts of the country.\n\nViewers in New York heard the epithet clearly in the first half hour of the January 13th broadcast, during a sketch in which Rockwell played a science teacher on a spoof of a PBS kids program. Cast members Cecily Strong and Mikey Day seemed surprised, but kept the action going. Some people watching the show in Los Angeles and Las Vegas reported on Twitter that NBC bleeped out the profanity, and Rick Ludwin, a former longtime head of NBC’s late-night programming, said on the social-media outlet that the network delays its west coast feed by a few seconds. NBC has broadcast “SNL” live across the nation since mid-Spring.\n\nAn “SNL” spokeswoman said producers declined to comment on the incident.\n\nRockwell’s utterance threatened to distract from a strong broadcast of the program that featured cameos from former cast members Bill Murray and Fred Armisen, as well as a strong opening sketch that made fun of MSNBC morning hosts Joe Scarborough and Mika Brzezinski. And viewers heard other bits of profanity during the program: During “Weekend Update,” co-anchor Colin Jost repeated the word “s—hole” that has become an integral part of the recent news cycle after reports surfaced stating President Trump used the phrase to describe certain foreign countries. NBC bleeped out that word on the west coast as well.\n\nIn an era when TV viewers routinely hear Samantha Bee utter all kinds of profanity on basic-cable’s TBS and listen to all sorts of once-offensive language on networks ranging from FX to HBO, who cares if someone drops a discouraging word on “SNL”? Simply put, the show airs on broadcast TV, and is held to a different standard by the Federal Communications Commission. What’s more, uttering profanity on the venerable series over its past four-plus decades on air has not often been rewarded.\n\nIn February, 1981, cast member Charles Rocket improvised a response to host Charlene Tilton that included the word “f–k,” and the incident that went down in infamy. Rocket was taken off the program. Featured player Jenny Slate inadvertently used a variation of that same word in her debut on the program in September of 2009. While she had a strong first year, and even established herself with a recurring character, she did not return to the program in its next season.\n\nBoth of those mishaps took place well after midnight. Last season, actress Kristen Stewart uttered the word in the midst of her monologue on a broadcast in February of last year. Norm MacDonald and Paul Shaffer are among others who have thrown the word out while on the air.\n\nAt least one person who swore on a live “SNL” telecast escaped punishment. In 1995, cast member Cheri Oteri uttered the word “s–t” while playing irascible character Rita DelVecchio. Host David Schwimmer called attention to the mistake during the episode’s farewell moments, and Oteri placed some money in a “swear jar.” All was forgiven. Oteri stayed with the program until 2000.", "images": ["https://pmcvariety.files.wordpress.com/2018/01/sam-rockwell.jpg?w=826", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fsam-rockwell-drops-f-bomb-snl-1202664138%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202664138&comment_count=26", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/01/sam-rockwell.jpg?w=826", "keywords": [], "authors": ["Brian Steinberg"], "canonical_link": "https://variety.com/2018/tv/news/sam-rockwell-drops-f-bomb-snl-1202664138/", "title": "Sam Rockwell Drops Surprise ‘F-Bomb’ on ‘SNL’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Sam Rockwell Drops ‘F-Bomb’ on SNL", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202664138, "author": "Brian Steinberg", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-13T21:43:48"}, "pmc-tag": "NBC,Sam Rockwell,Saturday Night Live", "title": "Sam Rockwell Drops Surprise ‘F-Bomb’ on ‘SNL’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Sam Rockwell Drops Surprise ‘F-Bomb’ on ‘SNL’", "url": "https://variety.com/2018/tv/news/sam-rockwell-drops-f-bomb-snl-1202664138/", "description": "Actor Sam Rockwell ensured his debut as host on “Saturday Night Live” was memorable by letting loose with an accidental and unexpected “f-bomb” – the first time such an incident has occurred …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/sam-rockwell.jpg?w=826", "width": 826, "height": 464, "alt": "SATURDAY NIGHT LIVE -- \"Sam Rockwell\" Episode 1735 -- Pictured: Host Sam Rockwell during a promo in 30 Rockefeller Plaza -- (Photo by: Rosalind O'Connor/NBC)"}, "locale": "en_US"}, "article": {"published_time": "2018-01-14T05:43:48+00:00", "modified_time": "2018-01-15T16:43:30+00:00"}, "twitter": {"creator": "@https://twitter.com/bristei", "site": "@variety", "text": {"title": "Sam Rockwell Drops Surprise ‘F-Bomb’ on ‘SNL’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/sam-rockwell.jpg?w=826", "alt": "SATURDAY NIGHT LIVE -- \"Sam Rockwell\" Episode 1735 -- Pictured: Host Sam Rockwell during a promo in 30 Rockefeller Plaza -- (Photo by: Rosalind O'Connor/NBC)"}, "card": "summary_large_image", "title": "Sam Rockwell Drops Surprise ‘F-Bomb’ on ‘SNL’", "description": "Sam Rockwell Drops ‘F-Bomb’ on SNL"}, "author": "Brian Steinberg", "content_type": "Article", "post_id": 1202664138, "title": "Sam Rockwell Drops Surprise ‘F-Bomb’ on ‘SNL’", "published_at": "2018-01-13 21:43:48", "image": "https://pmcvariety.files.wordpress.com/2018/01/sam-rockwell.jpg?w=826", "comment_count": 26, "tags": "Saturday Night Live", "topics": "News", "appeared_in_print": "No", "body": "Actor Sam Rockwell ensured his debut as host on “Saturday Night Live” was memorable by letting loose with an accidental and unexpected “f-bomb” - the first time such an incident has occurred since NBC began airing the program live across the nation , putting it on in primetime in some parts of the country.\r\n\r\nViewers in New York heard the epithet clearly in the first half hour of the January 13th broadcast, during a sketch in which Rockwell played a science teacher on a spoof of a PBS kids program. Cast members Cecily Strong and Mikey Day seemed surprised, but kept the action going. Some people watching the show in Los Angeles and Las Vegas reported on Twitter that NBC bleeped out the profanity, and Rick Ludwin, a former longtime head of NBC's late-night programming, said on the social-media outlet that the network delays its west coast feed by a few seconds. NBC has broadcast \"SNL\"  live across the nation since mid-Spring.\r\n\r\nAn \"SNL\" spokeswoman said producers declined to comment on the incident.\r\n\r\nRockwell's utterance threatened to distract from a strong broadcast of the program that featured cameos from former cast members Bill Murray and Fred Armisen, as well as a strong opening sketch that made fun of MSNBC morning hosts Joe Scarborough and Mika Brzezinski. And viewers heard other bits of profanity during the program: During \"Weekend Update,\" co-anchor Colin Jost repeated the word \"s---hole\" that has become an integral part of the recent news cycle after reports surfaced stating President Trump used the phrase to describe certain foreign countries. NBC bleeped out that word on the west coast as well.\r\n\r\nIn an era when TV viewers routinely hear Samantha Bee utter all kinds of profanity on basic-cable's TBS and listen to all sorts of once-offensive language on networks ranging from FX to HBO, who cares if  someone drops a discouraging word on \"SNL\"?  Simply put, the show airs on broadcast TV, and is held to a different standard by the Federal Communications Commission. What's more, uttering profanity on the venerable series over its past four-plus decades on air has not often been rewarded.\r\n\r\nIn February, 1981, cast member Charles Rocket improvised a response to host Charlene Tilton that included the word “f–k,” and the incident that went down in infamy. Rocket was taken off the program. Featured player Jenny Slate inadvertently used a variation of that same word in her debut on the program in September of 2009. While she had a strong first year, and even established herself with a recurring character, she did not return to the program in its next season.\r\n\r\nBoth of those mishaps took place well after midnight. Last season, actress Kristen Stewart uttered the word in the midst of her monologue on a broadcast in February of last year. Norm MacDonald and Paul Shaffer are among others who have thrown the word out while on the air.\r\n\r\nAt least one person who swore on a live “SNL” telecast escaped punishment.  In 1995, cast member Cheri Oteri uttered the word “s–t” while playing irascible character Rita DelVecchio. Host David Schwimmer called attention to the mistake during the episode’s farewell moments, and Oteri placed some money in a “swear jar.” All was forgiven. Oteri stayed with the program until 2000.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1515908628.0, "source": "https://variety.com", "summary": ""}