{"url": "https://www.thewrap.com/ahs-apocalypse-biggest-questions-american-horror-story-episode-nine-mallory-time-travel-anastasia-cordelia-michael-langdon/", "text": "(There are spoilers ahead for “American Horror Story: Apocalypse” through the Nov. 7 episode)\n\nWho knew the end of the world would be this confusing? The ninth — and next-to-last — episode of “American Horror Story: Apocalypse” landed last week, and Michael Langdon (Cody Fern) has finally teamed up with the Cooperative to get the ball rolling on destroying the world in nuclear fire. Still, even with all this major plot movement, it’s hard to believe Ryan Murphy and co. can really bring this crazy story to a close in Wednesday’s finale.\n\nTheWrap has rounded up our biggest questions after watching the first nine episodes of Season 8 below. Here’s hoping they answer them all before the 10-episode run ends tonight.\n\nAlso Read: 'American Horror Story: Apocalypse': Cody Fern Is Psyched for You to See 'Battle Royale' of a Finale\n\nHow in the world are they going to wrap this up with only one more episode?\n\nEven though there’s only one episode left this season, it really doesn’t feel like it at all. A big part of that is the convoluted structure of the story — we still have not gotten back to the present-day part of this whole thing. We got three episodes in the present to start the season, and the past six have all been flashbacks. And yet we still haven’t even gotten back to where we began. Even if the finale is extra long, which it no doubt will be, there’s a ridiculous amount of ground to cover before this is over.\n\nHow much time is left until the apocalypse anyway?\n\nSo way back in the fourth episode, when the flashback portion of the season got underway, there was a title card that declared we were watching events three years before the apocalypse. It’s unclear how much time has passed since then — the flashbacks began with Michael being recruited by the warlocks. But we can presume that at least some months have passed since then, and it could plausibly be a year or two.\n\nWhatever the answer, we’re still a ways away from the nukes falling. When Mutt and Jeff were recruiting Venable to be the leader of Outpost 3, Mutt said it would be a year or two before it happened. And we only just saw the very first planning meeting with Michael and the Illuminati at the close of tonight’s episode. So it’s not imminent.\n\nAlso Read: All the Plot Threads We Need Tied Up in Next Week's 'AHS: Apocalypse' Finale\n\nBut is there enough time for Cordelia, Mallory, Madison and Myrtle to put together a long game? They obviously manage to infiltrate Outpost 3 somehow, but otherwise were they just waiting for Mallory’s brain to be able to do her time travel trick?\n\nWhat exactly is Mallory going to do with her time travel powers?\n\nThe obvious solution to this whole thing is that Mallory will go back in time and prevent the apocalypse from ever happening — and also, consequently, save those witches that Michael and Mead murdered this week. But that seems a little bit too straightforward and predictable for “AHS,” which is typically all about pulling twists on you repeatedly until the last possible moment. And so there has to be some other element to this, some other thing that Mallory is going to have to do.\n\nIf multiple years pass between the events of this week’s episode and the nuclear apocalypse, that’s a lot of time for Mallory to test her powers. Presumably, as they will try out her time travel ability every once in a while to see if her brain has developed the capacity to do what needs to be done — would they just have her keep trying to save Anastasia Romanov or would they try other things?\n\nWhy did they try to save Anastasia Romanov?\n\nAnd speaking of that — why were they trying to save Anastasia in the first place? When they send Mallory back for her first time-traveling trip, it’s to rescue the infamous Russian royal family’s daughter. Myrtle explains Anastasia was one of them — a witch — but is there a bigger reason for this attempted save other than just seeing if Mallory could do it? They had to be picking a specific event that if Mallory changed would transform the world for the better, right? Otherwise why risk the negative effects it would have if she pulled it off? So why Anastasia?\n\nAlso Read: 'American Horror Story': Michael, Cordelia or Mallory? Adina Porter Picks a Side - Kinda (Video)\n\nWhat is up with Dinah Stevens?\n\nDinah has a very mercenary attitude, happy to take money from pretty much anybody. She’s mercenary enough, even, to help the Antichrist murder a bunch of witches. But she doesn’t appear to be on his side after the apocalypse — though she declares also that she won’t take the witches’ side either.\n\nSo, does Cordelia know that Dinah helped Michael murder all her girls? If so, did Dinah do something to atone for that? And if she’s not allied with the witches, then how did she get into Outpost 3 under an identity spell?\n\nWere the other witches hiding in different outposts?\n\nWe don’t know where Cordelia, Madison and Myrtle were during the nuclear apocalypse or the 18 months that followed. Could they have pulled a similar infiltration scheme to whatever Coco, Mallory and Dinah did to get into Outpost 3?\n\nAlso Read: Sorry, Emma Roberts: Your Auntie Julia Is Way Too Scared to Appear on 'American Horror Story'\n\nWhy were those teenagers in Outpost 3?\n\nAmong the residents of the outpost were a pair of teenagers, Timothy and Emily, who were basically kidnapped and brought there, allegedly because of their family history or good genes or whatever. And then they died along with everybody else when they ate the poison apples in the third episode. And there has been absolutely no mention of them since.\n\nThere must me some kind of twist with those two, right? They’re so obviously important in some secret way. But there have been no hints thus far, even though there’s only one episode left.\n\nDid the witches put an identity spell on, well, everybody who lived in Outpost 3?\n\nIt’s not unusual for a single actor to show up as multiple characters in a single season of “American Horror Story,” but it is unusual for it to happen for no reason — usually, that reason is the actor is playing both someone new and also a returning character. But there are multiple instances this season of actors playing multiple new characters: Joan Collins, Evan Peters and Billy Eichner. And we’re starting to think that they might actually not be playing multiple new characters at all.\n\nAlso Read: 'American Horror Story': Taissa Farmiga Explains Tate and Violet's 'Return to Murder House' Ending\n\nFirst, let’s remember some folks from the beginning of the season, before we dove into all these flashbacks that we’re still in the middle of. Specifically: Coco (Leslie Grossman), her boyfriend (Eichner), her hairdresser (Peters), her hairdresser’s grandma (Collins), and her assistant Mallory (Billie Lourd). Coco and Mallory were revealed to secretly have been witches who had been under an “identity” spell that made them think they were someone other than the person they are. Now, if Coco had been living a fake life with a personal assistant doing the same, then it follows, perhaps, that the other people in her life might have been in the same situation.\n\nWe already wondered this when Collins’ second character, Bubbles McGee, was introduced in the seventh episode as a witch who can read people’s thoughts, but why not Peters and Eichner as well? Obviously, the situation with those two — the Satanist robotics engineers who created the Ms. Mead bot — would be a bit different than that of Bubbles, as they are dedicated servants of the Antichrist. But they’re also a couple of dumb guys who could probably be bewitched by the identity spell pretty easily.\n\nComplicating this theory, of course, is that Bubbles was seemingly killed this week when Michael rampaged through the coven. But with seemingly years to go before the apocalypse, and Mallory’s time travel thing in play, it feels like anything is possible.\n\nAlso Read: 'AHS: Apocalypse': Anton LaVey, the 'Black Pope' of the Church of Satan, Was a Real Person\n\nIs Papa Legba going to matter or was that his only appearance?\n\nThe opening portion of the seventh episode saw Cordelia seek out the voodoo queen Dinah Stevens to try to seek the aid of Papa Legba (Lance Reddick). But that meeting didn’t go super well.\n\nAfter revealing he’s had Nan (Jamie Brewer) causing trouble in the underworld for a while, Papa Legba demands that if Cordelia wants his help averting the apocalypse, she’ll have to give up the souls of all the women in her coven. And she obviously wasn’t willing to do that.\n\nAnd that was that. Was this whole thing just so “Apocalypse” could check Nan and Papa Legba off the list of things it has to call back to? Or will they be important again at some point?\n\nWas there a reason they waited until episode seven to reveal how Myrtle came back?\n\n“Apocalypse” loves its flashbacks within flashbacks, but in the seventh one we had a pretty puzzling one, when Cordelia reveals she performed a ritual a while ago to bring back Myrtle Snow (Francis Conroy). But Myrtle has been around since the third episode with nobody acknowledging that she had returned from the dead. Not that resurrections on this show are all that big a deal, as we’ve seen so many this year — but we’re not totally sure what the significance is of putting this reveal here instead of, say, at any point before now.\n\nAlso Read: 'American Horror Story': Here's How Ryan Murphy Got Jessica Lange to Come Back to 'Murder House'\n\nSurely we’re going to see more of the “Murder House” crew, right? Right?\n\nThe “Return to Murder House” episode took place almost entirely inside said Murder House, but it might have been a little bit too tidy. There’s at least three big scenes of characters getting some kind of closure after the catastrophic events of “Murder House” and the various bad things that happened in the years while Michael Langdon was growing up there. These scenes made that made feel more like an epilogue for “Murder House” than a key part of the story of “Apocalypse.”\n\nAnd then, at the end of the episode, Madison (Emma Roberts) and Chablis (Billy Porter) get in their car and leave the house behind. It ends very much with the vibe of “welp, that was the Murder House, time to move on,” similar to the appearance of the Hotel Cortez a couple episodes back. Could the nuclear apocalypse blow up the house and free the ghosts? Or could we return to the house at some point? It is above the entrance to hell, after all. We don’t know the answer, but the way that episode is built it kinda vaguely sorta feels like that’s all we’re getting. But that can’t possibly be right, because surely Constance and Tate and the rest of them will have to be some kind of factor in the resolution to this whole thing since they basically started it.\n\nAlso Read: 'AHS': Sarah Paulson on 'Murder House' Return, 'Apocalypse' Finale and Directing Jessica Lange\n\nIf we had to guess, they’re going to make use of Mallory’s ability to go back to the events of “Murder House” and try to prevent Michael from being born. But that’s just a guess.\n\nSo, who was the Rubber Man in Outpost 3?\n\nOne of the weirdest parts of “Return to Murder House” was the scene in which young Michael dressed up as the Rubber Man and murdered two women who were moving into the house. Which casts further confusion about the identity of the Rubber Man from Outpost 3.\n\nIt seemed pretty clear that that version of the Rubber Man was not Langdon physically wearing the suit, though it’s possible he was doing some sort of magical projection. On the other hand, it could be Tate, who was the Rubber Man back in the day, but Madison seems to think that he’s no longer evil now that Langdon is elsewhere.\n\nBut without knowing anything about what happened to those Murder House ghosts after the apocalypse, it’s hard to have any concrete thoughts about all that just yet.\n\nAlso Read: 'American Horror Story' Refresher: Here's How 'Murder House' Ended\n\nWhere is Misty?\n\nMost of the witches of the coven are dead now, with the exception of Cordelia, Myrtle, Madison, Coco and Mallory. And, conspicuously, Misty — who we haven’t heard from since the episode in which Michael rescued her from hell as part of his Seven Wonders test. She told Cordelia that she was too weak to fight after being in hell so long. So is she just out of the picture, or will she have a part to play in next week’s finale?\n\nIs the Hotel Cortez going to be important for the rest of “Apocalypse” or was that just a fun reference?\n\nIt’s tough to say, but based on the fact that the world has ended and Queenie has been rescued from the Hotel Cortez, it seems unlikely the show intends to cross over more with “Hotel.” It’s true that the place seems so powerful that it exists as both a physical location and some kind of hellish eternal afterlife, but it also wasn’t a threat in “Coven” until Queenie accidentally stayed there. Then again, it seems like just about anything could happen in “Apocalypse,” and magic is running rampant, so who knows if the hotel will pop up again to torture people with endless bad card games.\n\nAlso Read: Leslie Grossman Shares Her Idea for a Future Season of 'American Horror Story' (Video)\n\nWas Michael Langdon messing with everybody’s brains in the outpost before he killed everyone?\n\nA lot of seemingly supernatural things happened in the second episode — the dead snakes coming back to life, the guy in the Rubber Man suit appearing as if from nowhere, Gallant stabbing what he thought was Rubber Man who turned out to actually be his grandma. All of this stuff is really bizarre and there’s no normal explanation for any of it. But given Langdon’s demonstrable skill with magic, it’s not too much of a stretch to think he was responsible for the creepy goings-on.\n\nHowever, we don’t actually know if he’s to be held accountable for it, since there’s seemingly no reason why he would just mess with everyone like that. The three secret witches are also suspects, even though they weren’t aware of their identities as witches — at least we don’t think.\n\nMallory, for example, is clearly powerful enough to use magic subconsciously. And you’ll recall that Dinah is the one who had a snake come back to life in her bowl. When Cordelia and her coven arrive, she outs Dinah as a voodoo queen from a different coven, a fact Dinah was apparently concealing. Was there some kind of weird supernatural battle going on in the second episode that we didn’t have the context for?\n\nAlso Read: 'American Horror Story: Apocalypse': Yes, Mr Langdon Is THAT 'Murder House' Character\n\nWhat does it mean that nobody was flying that plane in the first episode?\n\nThe big cold open sequence in episode one ended with LA getting nuked and Mallory discovering that nobody was flying the plane she was on. The next time we see those characters, they’re in the outpost with nobody mentioning that whole “nobody was flying the plane” thing or any explanation for how they got there. This seems like an important point, and something that will have to come up later.\n\nThe finale of “American Horror Story: Apocalypse” airs Wednesday at 10/9c on FX.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/uploads/2018/09/american-horror-story-murder-house-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2019/02/EndeavorContent-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/BillMaherCOVID-19-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2018/09/AHS-Apocalypse-Michael-Langdon-1-160x105.png", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/09/american-horror-story-apocalypse-ahs-we-have-no-idea-whats-going-on-160x105.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2018/09/American-Horror-Story-Apocalypse-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/Ranjit-Chowdhry-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/lori-loughlin-160x105.jpg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/GettyImages-1207555653-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/uploads/2018/09/american-horror-story-seasons-ranked.jpg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale.jpg", "keywords": [], "authors": ["Phil Owen", "Jennifer Maas", "Ross A. Lincoln", "Daniel Goldblatt", "J. Clara Chan"], "canonical_link": "https://www.thewrap.com/ahs-apocalypse-biggest-questions-american-horror-story-episode-nine-mallory-time-travel-anastasia-cordelia-michael-langdon/", "title": "‘AHS: Apocalypse’ – The Biggest Questions That Need to Be Answered in the Finale", "meta_data": {"parsely-title": "‘AHS: Apocalypse’ – The Biggest Questions That Need to Be Answered in the Finale", "parsely-link": "https://www.thewrap.com/ahs-apocalypse-biggest-questions-american-horror-story-episode-nine-mallory-time-travel-anastasia-cordelia-michael-langdon/", "parsely-type": "post", "parsely-pub-date": "2018-11-14T09:40:49-08:00", "parsely-section": "tv", "parsely-author": "Phil Owen", "parsely-tags": "ahs, ahs-apocalypse, american_horror_story, american-horror-story-apocalypse, connie_britton, dylan_mcdermott, emma_roberts, evan-peters, fx, gabourey_sidibe, jamie-brewer, jessica_lange, lance-reddick, lily_rabe, ryan-murphy, sarah_paulson, taissa_farmiga", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "The ninth episode of \"AHS: Apocalypse\" set the wheels in motion toward the apocalypse -- but we have no clue how they can wrap this up in the finale", "news_keywords": "ahs, ahs: apocalypse, american horror story, american horror story: apocalypse, connie britton, dylan mcdermott, emma roberts, evan peters, fx, gabourey sidibe, jamie brewer, jessica lange, lance reddick, lily rabe, ryan murphy., sarah paulson, taissa farmiga", "original-source": "https://www.thewrap.com/ahs-apocalypse-biggest-questions-american-horror-story-episode-nine-mallory-time-travel-anastasia-cordelia-michael-langdon/", "og": {"locale": "en_US", "type": "article", "title": "'AHS: Apocalypse' - The Biggest Questions That Need to Be Answered in the Finale", "description": "The ninth episode of \"AHS: Apocalypse\" set the wheels in motion toward the apocalypse -- but we have no clue how they can wrap this up in the finale", "url": "https://www.thewrap.com/ahs-apocalypse-biggest-questions-american-horror-story-episode-nine-mallory-time-travel-anastasia-cordelia-michael-langdon/", "site_name": "TheWrap", "updated_time": "2018-11-17T02:50:11-08:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "taissa farmiga", "section": "TV", "published_time": "2018-11-14T17:40:49-08:00", "modified_time": "2018-11-17T02:50:11-08:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "The ninth episode of \"AHS: Apocalypse\" set the wheels in motion toward the apocalypse -- but we have no clue how they can wrap this up in the finale", "title": "'AHS: Apocalypse' - The Biggest Questions That Need to Be Answered in the Finale", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale.jpg", "creator": "@philrowen"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘AHS: Apocalypse’ – The Biggest Questions That Need to Be Answered in the Finale", "sailthru.date": "2018-11-14T17:40:49+00:00", "sailthru.author": "Phil Owen", "sailthru.tags": "fx,dylan mcdermott,jessica lange,emma roberts,gabourey sidibe,connie britton,sarah paulson,lily rabe", "sailthru.category": "tv,culture,news", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/11/ahs-american-horror-story-apocalypse-cordelia-sarah-paulson-biggest-questions-ahead-of-season-finale-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1542246049.0, "source": "https://www.thewrap.com", "summary": ""}