{"url": "https://www.brides.com/story/prince-william-working-on-name-royal-baby", "text": "History was made when Prince William wed Kate Middleton in the biggest Royal Wedding of the century. But, despite this royal couple's lavish \"I dos\" (and future King and Queen status, of course), their relationship actually has pretty humble roots. From the moment they met in college to the birth of their third child 17 years later, here is everything you need to know about Prince William and Kate Middleton's relationship.\n\nPrince William and Kate Middleton first met in 2001 while they were students at the University of St. Andrews in Scotland.\n\nAfter nearly ten years together (although with a break-up in between), the couple announced their engagement in 2010, with the prince proposing with his mother, the late Princess Diana's, iconic sapphire engagement ring.\n\nIn 2011, Will and Kate wed in Westminster Abbey and officially became the Duke and Duchess of Cambridge.\n\nSince their wedding, the couple has welcomed three children: Prince George in 2013, Princess Charlotte in 2015 and Prince Louis in 2018.\n\nSeptember 2001: Two Students in Scotland\n\nThe pair first met at the University of St. Andrews in Scotland in 2001. Kate was studying art history while Prince William was working towards a degree in geography.\n\nApril 2001: The Dress That Started It All\n\nWhile the duo met at the start of school, it wasn't until a fateful spring semester fashion show that Kate really caught the attention of the young prince. The story goes, Kate was modeling a revealing sheer dress for a charity fashion show and Prince William reportedly paid 200 euros for a front-row seat. The rest, as you already know, is history!\n\nOctober 2002: And Then They Were Roommates\n\nFor their second year at university, the couple moved out of their dorm rooms and into a flat together along with two other friends.\n\nJune 2005: A Graduation Celebration\n\nHandout\n\nIn 2005, the young couple graduated from St. Andrews and celebrated their accomplishments together. The Middleton family later shared this adorable throwback from graduation day! Oh, to be young and in love!\n\nMarch 2007: A Brief Break-Up\n\nKate and Will officially crushed our dreams when reports revealed that the young couple broke up in 2007. During their time apart, Kate took a vacation to Ireland and while she was unhappy about their status at the time, she later said that the split was good for both of them. \"You can get consumed by a relationship when you're younger and I really valued that time for me as well, although I didn't think it at the time,\" she said during her engagement interview in 2010.\n\nJuly 2007: Back Together Again\n\nTheir break-up, however, was short-lived and the couple reconciled a few months later. Kate was seen attending a Princess Diana tribute concert with her sister, Pippa, and sat just two rows behind her royal beau.\n\nApril 11, 2008: Another Graduation\n\nIn the spring of 2008, Prince William graduated from the Royal Air Force and, of course, Kate was by his side during the ceremony.\n\nNovember 16, 2010: A Proposal In Kenya\n\nGetty Images\n\nThe moment the world was waiting for, Prince William proposed to Kate Middleton while vacationing in Kenya in the fall of 2010, however, the Palace didn't officially announce the news until a few weeks later. Prince William used his mother's engagement ring, a priceless blue sapphire, to pop the question.\n\nApril 29, 2011: The Wedding of the Century\n\nThousands gathered outside of Westminster Abbey and millions tuned in on TV to witness Kate marry her prince. The bride wore a now-iconic long-sleeve lace gown by Sarah Burton for Alexander McQueen and had her sister and maid-of-honor, Pippa, wear a custom white creation as well. Following the ceremony, the newlyweds stood on the Buckingham Palace balcony to exchange not one, but two kisses in front of the celebratory crowds.\n\nDecember 3, 2012: A Future King Is on the Way\n\nA year and a half after Kate and Prince William became husband and wife, the Palace announced the couple was expecting their first child! The very same day, Kate was hospitalized with acute morning sickness—something she has since suffered from during every pregnancy.\n\nJuly 22, 2013: Prince George Is Born\n\nGetty Images\n\nThe royal couple officially became parents in 2013 when they welcomed their first son, Prince George. Kate gave birth at St. Mary's Hospital in London, and the new parents posed in the exact same spot Prince William's parents, Prince Charles and Princess Diana, did on his birthday.\n\nMay 2, 2015: It's a Girl!\n\nGetty Images\n\nIn 2015, Prince William and Kate welcomed a daughter, Princess Charlotte. Just like they did with Prince George nearly two years before, the couple posed for photos with the newborn, who is now fourth in line to the British throne.\n\nApril 23, 2018: Welcoming Another Prince\n\nGetty Images", "images": ["https://www.brides.com/thmb/XKCqJ97ZBUxc7NgQp1KrF7o4-eY=/1200x630/filters:fill(auto,1)/GettyImages-113287633-d927c1cd21884458b0e76f6a11a906eb.jpg", "data:image/svg+xml,%3Csvg width=%27733%27 height=%271024%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271024%27 height=%27807%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271024%27 height=%27803%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271024%27 height=%27683%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.brides.com/thmb/m6DjG4JTgHAMPUEL1ah0kfsIdC8=/500x350/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-113287633-93b4584a4b3b45d6999970e5383819c1.jpg", "data:image/svg+xml,%3Csvg width=%271024%27 height=%27861%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://:0"], "top_img": "https://www.brides.com/thmb/XKCqJ97ZBUxc7NgQp1KrF7o4-eY=/1200x630/filters:fill(auto,1)/GettyImages-113287633-d927c1cd21884458b0e76f6a11a906eb.jpg", "keywords": [], "authors": ["Maggie Kreienberg"], "canonical_link": "https://www.brides.com/kate-middleton-prince-william-relationship-timeline-4795884", "title": "Everything You Need To Know About Prince William and Kate Middleton's Relationship", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From the moment they met in college to the birth of their children, here is everything you need to know about Prince William and Kate Middleton's relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Maggie Kreienberg", "sailthru.tags": "news,royal-weddings", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/kate-middleton-prince-william-relationship-timeline-4795884", "title": "Everything You Need To Know About Prince William and Kate Middleton's Relationship", "description": "From the moment they met in college to the birth of their children, here is everything you need to know about Prince William and Kate Middleton's relationship.", "image": "https://www.brides.com/thmb/XKCqJ97ZBUxc7NgQp1KrF7o4-eY=/1200x630/filters:fill(auto,1)/GettyImages-113287633-d927c1cd21884458b0e76f6a11a906eb.jpg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Everything You Need To Know About Prince William and Kate Middleton's Relationship", "description": "From the moment they met in college to the birth of their children, here is everything you need to know about Prince William and Kate Middleton's relationship.", "image": "https://www.brides.com/thmb/vUPIlyNmA4V8qBTl5pxYvjxV97Q=/797x1024/filters:fill(auto,1)/GettyImages-113287633-93b4584a4b3b45d6999970e5383819c1.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.56.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.56.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.56.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.56.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.56.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}