{"url": "abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1", "text": "Leslie Mann Shares Her Top 5 Romantic Movies \"Funny People\" actress Leslie Mann on which films get her seal of approval.\n\nAug. 11, 2009\u0097 -- Despite her conventional good looks, Leslie Mann has gravitated toward some very unconventional characters, and her latest role is no exception.\n\nIn \"Funny People,\" now in theatres, Mann balances comedy with drama as her character navigates a complicated relationship with an ex-fiance, a stand-up comedian played by Adam Sandler.\n\nMann's own unusual love story began when she met her writer-director husband, Judd Apatow, on the set of the 1996 film, \"The Cable Guy,\" a dark, somewhat creepy, comedy. At the time, Apatow was a producer.\n\n\"I wasn't attracted to nice boys at the time,\" Mann told ABC News. \"I was at the tail end of that stage. And then Judd somehow worked his way into my life, and it just kind of hit me. It was a great day when I finally realized what was right in front of me.\"\n\nSince then, Mann has starred in several of Apatow's films, gradually taking on larger roles.\n\nBut what kinds of romance movies does Mann most like to watch? Her answers may surprise you.\n\nRecently, Mann shared her five favorite romantic flicks with ABCNews.com -- and they aren't your typical love stories.\n\n\"Harold and Maude\"\n\nWhen ranking romantic comedies, most people probably wouldn't put this 1971 cult classic on their list. But the unique love story definitely delivers romance in addition to dark, slapstick comedy. \"Harold and Maude\" follows the relationship between Harold, a 19-year-old who has a fascination with faking his own death, and Maude, a 79-year-old free spirit who dabbles in things such as stealing hearses and modeling nude for ice sculptures.\n\n\"Tootsie\"\n\nIn \"Tootsie,\" actor Michael Dorsey could have just given up on his dreams when he couldn't find work. Or, he could change genders. In the fashion of \"Mrs. Doubtfire\" and \"Some Like It Hot,\" \"Tootsie\" provides all the hilarious moments that inevitably happen when a Mister becomes a Miss.\n\nEventually, Dorsey, played by Dustin Hoffman, dons a fluffy red wig and a sequined dress to become Dorothy Michaels, lands work and becomes a soap opera sensation.\n\nNot only is this movie hilarious, it was nominated for several Academy Awards. Jessica Lange, who plays Hoffman's love interest, nabbed the Oscar for best supporting actress. Naturally, she thanked her \"leading lady\" in her acceptance speech.\n\n\"Foul Play\"\n\n\"Foul Play\" may not seem like a romantic film at its outset, but through all of the crazy attempted murders and mysterious characters, the two heroes manage to find their one true love. If a movie with an albino hit man, cheesy martial arts and a perplexed Goldie Hawn don't make you laugh, there probably aren't many things that will.\n\nThe plot gets a little crazy and tangled as Hawn and her love interest cop, played by Chevy Chase, uncover a complicated, evil scheme to assassinate a beloved icon who is revealed at the end of the film. Evidently, there's nothing like running from trained killers and knock-down, drag-out fights in the San Francisco Opera House to help someone fall in love.\n\n\"The Apartment\"\n\nMann hasn't neglected to include a classic romance on her list of favorite love tales. \"The Apartment\" revolves around the affairs that occur in -- yes, you guessed it -- an apartment.\n\nC.C. Baxter, played by Jack Lemmon, is an insurance company worker who is looked upon favorably by his managers because he allows them to use his Upper West Side New York apartment for their extramarital rendezvouses.\n\nWhile juggling his boss' trysts, Baxter also tries to woo his building's attractive elevator operator, played by Shirley MacLaine. Of course, she also is being pursued by Baxter's sleazy director.\n\nFind out how the love triangle plays out in this 1960 Oscar winner for best picture.\n\n\"Raising Arizona\"\n\n\"Raising Arizona,\" from the American filmmaking team the Coen brothers, is Mann's fifth favorite romance film. The story follows a couple who rekindle their relationship while breaking the law.\n\nThe pair decide to steal a child from a set of famous quintuplets known as the \"Arizona Quints.\"\n\nUnfortunately for this poor child, things don't go exactly according to plan, and Nathan Jr. is passed around quite a bit. He is kidnapped again by some of H.I.'s old prison buddies and eventually strapped to the motorcycle of a heavily armed bounty hunter.\n\nBut don't worry, there's a happy ending.", "images": ["http://abcnews.go.com/Entertainment/Movies/null", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "http://abcnews.go.com/Entertainment/Movies/null", "keywords": [], "authors": ["Abc News", "Loren Grush", "August", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1", "title": "Leslie Mann Shares Her Top 5 Romantic Movies", "meta_data": {"description": "Actress Leslie Mann shares her top 5 favorite romance movies with ABCNews.com.", "keywords": "leslie mann, romantic movies, top 5, Harold and Maude, Tootsie, Foul Play, The Apartment, Raising Arizona", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Leslie Mann Shares Her Top 5 Romantic Movies", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1", "title": "Leslie Mann Shares Her Top 5 Romantic Movies", "description": "Actress Leslie Mann shares her top 5 favorite romance movies with ABCNews.com.", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2009-08-11T13:42:38Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,8271226", "ipad": "abcnewsipad://link/story,8271226", "googleplay": "https://abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Leslie Mann Shares Her Top 5 Romantic Movies", "description": "Actress Leslie Mann shares her top 5 favorite romance movies with ABCNews.com.", "url": "https://abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,8271226", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,8271226", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/Movies/story?id=8271226&page=1"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}