{"url": "https://variety.com/2018/legit/awards/2018-tonys-snubs-surprises-nominations-amy-schumer-chris-evans-1202793534/", "text": "Nominations for the 2018 Tony Awards were announced Tuesday morning — and they gave Broadway plenty to chatter about. With a roster of candidates that includes “Harry Potter and the Cursed Child,” “Mean Girls” and “Frozen,” these are the Tony nominations’ biggest snubs and surprises:\n\nSURPRISE: Amy Schumer, “Meteor Shower”\n\nThe Steve Martin comedy “Meteor Shower” was one of the season’s giant hits, thanks to Schumer’s name on the marquee. But after the show earned very mixed reviews, no one expected Tony nominators to remember it particularly favorably, and even if they did, a nomination seemed most likely to have gone to Tony favorite Laura Benanti. Still, Schumer’s performance impressed nominators enough that now she’ll add an extra jolt of star power to the ceremony, where she’s up against acting royalty Glenda Jackson, among others, in the race for lead actress in a play.\n\nSNUB: Chris Evans, “Lobby Hero”\n\nThe “Avengers: Infinity War” actor has surprised a lot of Broadway audiences with his turn in “Lobby Hero,” in which he plays, very convincingly, a deeply unlikable cop who’s a far cry from Captain America. But with shows like “Angels in America” and “The Iceman Cometh” also in the mix, the field of male actors was particularly packed this season, and while nominators found room for “Lobby Hero” cast members Brian Tyree Henry and Michael Cera, Evans was left out.\n\nSURPRISE: Michael Cera, “Lobby Hero”\n\nPlaying a slacker doorman in “Lobby Hero,” Michael Cera gives a performance that’s so on-brand for the actor and so seemingly effortless that theatergoers have dismissed his work in what some might not notice is the play’s linchpin role. But Tony nominators didn’t make that mistake, giving Cera a nod for his skilled, subtle work.\n\nSNUB: “Frozen”\n\nSure, Disney’s incipient hit earned a trio of big award noms, placing in the races for new musical, book of a musical (Jennifer Lee) and score (Kristen Anderson-Lopez and Robert Lopez). But that’s the only recognition the production got from nominators, who overlooked notable contributors like director Michael Grandage, as well as the well-received lead performances from Caissie Levy and Patti Murin. (The silver lining: “Frozen” doesn’t need Tony Awards to run forever, anyway.)\n\nSURPRISE: “Angels in America” breaks a record\n\nIf we were going to pick one show from this season that seemed most likely to hit a new high for total nominations earned by a play, we would have gone with sweeping two-part epic “Harry Potter and the Cursed Child,” the frontrunner in the new play category. But while “Potter” emerged with a plenty impressive haul of 10 noms, it was another sweeping two-parter, “Angels in America,” that set a new record with 11 nods for play revival, including director (Marianne Elliott) and actors Andrew Garfield and Nathan Lane, plus design awards. One of the most notable nods: A nomination in the category for original score (Adrian Sutton), where the play’s music will compete with songs for musicals like “The Band’s Visit” and “Mean Girls.”\n\nSNUB: Americans\n\nThis Tony season’s big trend on the red carpet: English accents. With so many new plays and play revivals transferring to Broadway from the U.K. — including notable candidates like “Cursed Child” and “Angels” — Brits dominate the nonmusical categories. For instance, three of the five new play nominees come from U.K. writers and performers, and in the lead actor in a play race, there’s only one American, Denzel Washington (“The Iceman Cometh”), up against Andrew Garfield (“Angels in America”), Tom Hollander (“Travesties”), Jamie Parker (“Harry Potter”) and Mark Rylance (“Farinelli and the King”). (Or maybe it’s 1.5 Americans in the category: Garfield was born in California and has dual citizenship.)\n\nSURPRISE: John Leguizamo and “Latin History for Morons”\n\nJohn Leguizamo’s latest solo show wasn’t much on the radar as a potential nominee in a category dominated by “Harry Potter and the Cursed Child.” But “Latin History for Morons,” about his relationship with his son and his quest to learn all he could about the overlooked contributions of Latin Americans to American history, was one of the quiet successes of the Broadway season, recouping its commercial capitalization during its limited run on the boards. Tony nominators not only gave the show a nod for best play, but they went a step further by picking Leguizamo to receive a special Tony Award for his influential body of stage work.\n\nSNUB: “Escape to Margaritaville”\n\nDon’t expect too many Parrotheads at Radio City next month. “Escape to Margaritaville,” the Jimmy Buffett musical that’s having trouble attracting crowds, didn’t get a single nomination, not even from a talent roster that included last year’s directing Tony winner Christopher Ashley. That means no awards-season attention to potentially boost sales — although that doesn’t mean producers of the Tony ceremony won’t throw the show a bone and give it a performance segment on the live telecast.\n\nCBS will broadcast the 72nd annual Tony Awards live from Radio City Music Hall June 10, with Sara Bareilles and Josh Groban on board to host.\n\nRELATED VIDEO:", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2018/05/tony-nominations-snubs-and-suprises-2018.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Flegit%2Fawards%2F2018-tonys-snubs-surprises-nominations-amy-schumer-chris-evans-1202793534%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202793534&comment_count=3", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2018/05/tony-nominations-snubs-and-suprises-2018.jpg?w=1000", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/05/tony-nominations-snubs-and-suprises-2018.jpg?w=1000", "keywords": [], "authors": ["Gordon Cox"], "canonical_link": "https://variety.com/2018/legit/awards/2018-tonys-snubs-surprises-nominations-amy-schumer-chris-evans-1202793534/", "title": "8 Biggest Tony Nominations Snubs and Surprises", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "With nominees like \"Harry Potter and the Cursed Child,\" \"Mean Girls\" and \"Frozen,\" these are the morning's biggest snubs and surprises.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202793534, "author": "Gordon Cox", "pmc-category": "Awards,Box Office,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-05-01T09:50:33"}, "pmc-tag": "Amy Schumer,Broadway,Chris Evans,Frozen,Tony Awards,Tony Nominations", "title": "8 Biggest Tony Nominations Snubs and Surprises", "pageclass": "article", "pmc-vertical": "legit", "pmc-primary-category": "Awards", "pmc-primary-vertical": "legit", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "8 Biggest Tony Nominations Snubs and Surprises", "url": "https://variety.com/2018/legit/awards/2018-tonys-snubs-surprises-nominations-amy-schumer-chris-evans-1202793534/", "description": "Nominations for the 2018 Tony Awards were announced Tuesday morning — and they gave Broadway plenty to chatter about. With a roster of candidates that includes “Harry Potter and the Cur…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/tony-nominations-snubs-and-suprises-2018.jpg?w=1000", "width": 1000, "height": 562, "alt": "Tony Nominations Snubs and Suprises 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-05-01T16:50:33+00:00", "modified_time": "2018-05-01T18:08:37+00:00"}, "twitter": {"creator": "@GCoxVariety", "site": "@variety", "text": {"title": "8 Biggest Tony Nominations Snubs and Surprises"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/tony-nominations-snubs-and-suprises-2018.jpg?w=1000", "alt": "Tony Nominations Snubs and Suprises 2018"}, "card": "summary_large_image", "title": "8 Biggest Tony Nominations Snubs and Surprises", "description": "With nominees like \"Harry Potter and the Cursed Child,\" \"Mean Girls\" and \"Frozen,\" these are the morning's biggest snubs and surprises."}, "author": "Gordon Cox", "content_type": "Article", "post_id": 1202793534, "title": "8 Biggest Tony Nominations Snubs and Surprises", "published_at": "2018-05-01 09:50:33", "image": "https://pmcvariety.files.wordpress.com/2018/05/tony-nominations-snubs-and-suprises-2018.jpg?w=1000", "comment_count": 3, "tags": "Tony Nominations", "topics": "News", "appeared_in_print": "No", "body": "Nominations for the 2018 Tony Awards were announced Tuesday morning -- and they gave Broadway plenty to chatter about. With a roster of candidates that includes \"Harry Potter and the Cursed Child,\" \"Mean Girls\" and \"Frozen,\" these are the Tony nominations' biggest snubs and surprises:\r\n\r\nSURPRISE: Amy Schumer, \"Meteor Shower\"\r\nThe Steve Martin comedy \"Meteor Shower\" was one of the season's giant hits, thanks to Schumer's name on the marquee. But after the show earned very mixed reviews, no one expected Tony nominators to remember it particularly favorably, and even if they did, a nomination seemed most likely to have gone to Tony favorite Laura Benanti. Still, Schumer's performance impressed nominators enough that now she'll add an extra jolt of star power to the ceremony, where she's up against acting royalty Glenda Jackson, among others, in the race for lead actress in a play.\r\n\r\nSNUB: Chris Evans, \"Lobby Hero\"\r\nThe \"Avengers: Infinity War\" actor has surprised a lot of Broadway audiences with his turn in \"Lobby Hero,\" in which he plays, very convincingly, a deeply unlikable cop who's a far cry from Captain America. But with shows like \"Angels in America\" and \"The Iceman Cometh\" also in the mix, the field of male actors was particularly packed this season, and while nominators found room for \"Lobby Hero\" cast members Brian Tyree Henry and Michael Cera, Evans was left out.\r\n\r\nSURPRISE: Michael Cera, \"Lobby Hero\"\r\nPlaying a slacker doorman in \"Lobby Hero,\" Michael Cera gives a performance that's so on-brand for the actor and so seemingly effortless that theatergoers have dismissed his work in what some might not notice is the play's linchpin role. But Tony nominators didn't make that mistake, giving Cera a nod for his skilled, subtle work.\r\n\r\nSNUB: \"Frozen\"\r\nSure, Disney's incipient hit earned a trio of big award noms, placing in the races for new musical, book of a musical (Jennifer Lee) and score (Kristen Anderson-Lopez and Robert Lopez). But that's the only recognition the production got from nominators, who overlooked notable contributors like director Michael Grandage, as well as the well-received lead performances from Caissie Levy and Patti Murin. (The silver lining: \"Frozen\" doesn't need Tony Awards to run forever, anyway.)\r\n\r\nSURPRISE: \"Angels in America\" breaks a record\r\nIf we were going to pick one show from this season that seemed most likely to hit a new high for total nominations earned by a play, we would have gone with sweeping two-part epic \"Harry Potter and the Cursed Child,\" the frontrunner in the new play category. But while \"Potter\" emerged with a plenty impressive haul of 10 noms, it was another sweeping two-parter, \"Angels in America,\" that set a new record with 11 nods for play revival, including director (Marianne Elliott) and actors Andrew Garfield and Nathan Lane, plus design awards. One of the most notable nods: A nomination in the category for original score (Adrian Sutton), where the play's music will compete with songs for musicals like \"The Band's Visit\" and \"Mean Girls.\"\r\n\r\nSNUB: Americans\r\nThis Tony season's big trend on the red carpet: English accents. With so many new plays and play revivals transferring to Broadway from the U.K. -- including notable candidates like \"Cursed Child\" and  \"Angels\" -- Brits dominate the nonmusical categories. For instance, three of the five new play nominees come from U.K. writers and performers, and in the lead actor in a play race, there's only one American, Denzel Washington (\"The Iceman Cometh\"), up against Andrew Garfield (\"Angels in America\"), Tom Hollander (\"Travesties\"), Jamie Parker (\"Harry Potter\") and Mark Rylance (\"Farinelli and the King\"). (Or maybe it's 1.5 Americans in the category: Garfield was born in California and has dual citizenship.)\r\n\r\nSURPRISE: John Leguizamo and \"Latin History for Morons\"\r\nJohn Leguizamo's latest solo show wasn't much on the radar as a potential nominee in a category dominated by \"Harry Potter and the Cursed Child.\" But \"Latin History for Morons,\" about his relationship with his son and his quest to learn all he could about the overlooked contributions of Latin Americans to American history, was one of the quiet successes of the Broadway season, recouping its commercial capitalization during its limited run on the boards. Tony nominators not only gave the show a nod for best play, but they went a step further by picking Leguizamo to receive a special Tony Award for his influential body of stage work.\r\n\r\nSNUB: \"Escape to Margaritaville\"\r\nDon't expect too many Parrotheads at Radio City next month. \"Escape to Margaritaville,\" the Jimmy Buffett musical that's having trouble attracting crowds, didn't get a single nomination, not even from a talent roster that included last year's directing Tony winner Christopher Ashley. That means no awards-season attention to potentially boost sales -- although that doesn't mean producers of the Tony ceremony won't throw the show a bone and give it a performance segment on the live telecast.\r\n\r\nCBS will broadcast the 72nd annual Tony Awards live from Radio City Music Hall June 10, with Sara Bareilles and Josh Groban on board to host.\r\n\r\nRELATED VIDEO:", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1525193433.0, "source": "https://variety.com", "summary": ""}