{"url": "https://web.archive.org/web/20080206222702/http://www.mittromney.com/News/Press-Releases/Kerry_McCain", "text": "Email this Page To:\n\nMultiple addresses seperated by commas From:\n\nSubject:\n\nMessage :\n\n\n\nWELCOME TO MASSACHUSETTS!\n\n\n\nHalf Of The Proposed Kerry-McCain '04 Ticket Campaigns In Boston\n\nABC's Charles Gibson: \"But, let me, let me, let me imagine it. If he asked you, if he came across the aisle and asked you, would you even entertain the idea? Or will you rule it out for good and all and ever right now?\"\n\n\n\nSen. John McCain: \"John Kerry is a very close friend of mine. We've been friends for years. Obviously, I would entertain it.\" (ABC's \"Good Morning America,\" 3/10/04; www.youtube.com/watch?v=LkcVXIhssCI)\n\n\n\nKerry-McCain 2004? Sen. John Kerry Says Sen. McCain Wanted It:\n\n\n\nSen. John Kerry (D-MA) Says That Sen. John McCain Approached him About Being His 2004 Running Mate. FOX NEWS' BRIT HUME: \"The struggling presidential campaign of John McCain is now involved in a controversy with John Kerry over who approached whom about a possible McCain spot on the Democratic ticket in 2004. The Politico newspaper reports Kerry maintains that McCain's people made overtures to him about a vice presidential nod. But McCain says no, it was Kerry's idea, and that he rejected it each time it was raised. This of course, follows a similar story that came out last week in which Senate Democrats where saying McCain was in serious negotiations with them about switching parties following his loss to George W. Bush in the 2000 presidential primaries. McCain says that also is a mischaracterization, and that he was never serious about leaving the Republican Party.\" (Fox News' \"Special Report With Brit Hume,\" 4/4/07; www.youtube.com/watch?v=KX37Jrw_dMM)\n\n\n\nSen. Kerry: \"[McCain's] People Similarly Approached Me To Engage In A Discussion About His Potentially Being On The Ticket As Vice President.\" JONATHAN SINGER: \"And I was wondering if you could talk a little bit about what your discussions were with him [McCain] in 2004, how far it went, who approached whom... if there was any 'there' there.\" SEN. JOHN KERRY: \"I don't know all the details of it. I know that Tom, from a conversation with him, was in conversation with a number of Republicans back then. It doesn't surprise me completely because his people similarly approached me to engage in a discussion about his potentially being on the ticket as Vice President. So his people were active -- let's put it that way.\" SINGER: \"Okay. And just to confirm, you said it, but this is something they approached you rather than...\" KERRY: \"Absolutely correct. John Weaver of his shop approached...\" (My DD Website, http://www.mydd.com/images/admin/McCain.mp3, Accessed 4/3/07)\n\n\n\nSen. McCain Publicly Said He'd Entertain The Idea Of Running With Kerry:\n\n\n\nIn 2004, When First Questioned If He'd Run With Kerry, McCain Said He \"Would Entertain It.\" ABC's CHARLES GIBSON: \"But, let me, let me, let me imagine it. If he asked you, if he came across the aisle and asked you, would you even entertain the idea? Or will you rule it out for good and all and ever right now?\" SEN. JOHN MCCAIN: \"John Kerry is a very close friend of mine. We've been friends for years. Obviously, I would entertain it.\" (ABC's \"Good Morning America,\" 3/10/04; www.youtube.com/watch?v=LkcVXIhssCI)\n\n\n\nSen. McCain Also Considered Leaving The Republican Party In 2001:\n\n\n\nThe Hill: Sen. McCain Considered Leaving The GOP In 2001. \"Sen. John McCain (R-Ariz.) was close to leaving the Republican Party in 2001, weeks before then-Sen. Jim Jeffords (Vt.) famously announced his decision to become an Independent, according to former Democratic lawmakers who say they were involved in the discussions.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n\n\nSen. McCain's Top Political Strategist John Weaver Recently Acknowledged That McCain Spoke To Democrats About Leaving The Party. \"McCain consistently shot down the rumors, though Weaver acknowledged this week that the senator did talk to Democrats about leaving the GOP.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n\n\nOne McCain Loyalist Said His Chances Of Leaving The Party Were \"50-50.\" \"In one article, Marshall Wittman, a McCain loyalist and strategist six years ago, put the odds of McCain leaving the Republican Party at '50-50.'\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n\n\nSen. McCain Reached Out To Democrats:\n\n\n\nIn 2001, McCain Aide John Weaver Approached Prominent Democrats About McCain Switching Parties. \"Democrats had contacted Jeffords and then-Sen. Lincoln Chafee (R-R.I.) in the early months of 2001 about switching parties, but in McCain's case, they said, it was McCain's top strategist who came to them.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n\n\nWeaver Met With Lobbyist Tom Downey To Float The Idea Of A McCain Switch. \"At the end of their March 31, 2001 lunch at a Chinese restaurant in Bethesda, Md., Downey said Weaver asked why Democrats hadn't asked McCain to switch parties.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n- Weaver: \"Well, If The Right People Asked Him.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\nCalls Were Immediately Placed To Powerful Democrats. \"Within seconds' of arriving home from his lunch with Weaver, Downey said he was on the phone to the most powerful Democrats in town. One of the first calls he made was to then-Senate Minority Leader Daschle.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n- Sen. Tom Daschle (D-SD) Confirmed He Spoke To Downey. \"I did take the call from Tom [Downey],' Daschle said in an interview. 'It was Weaver's comment' to Downey that started the McCain talks, he added.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\nDowney And Weaver Spoke Weekly. \"Downey said he talked to Weaver at least once a week during McCain's discussions with Democrats, asking him questions like, 'What is the state of play?' and 'Where are we?'\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n- Downey: \"I Actually Thought During The Initial Stages Of This That [McCain Leaving The Republican Party] Was Almost A Certain Deal.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n\n\n- Downey: \"Weaver Was Very Active In This.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n\n\n- Downey: \"None Of This Happens Without Weaver.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\nInfluential Democrats Talked To McCain About Defecting:\n\n\n\nLeading Democrats Talked With Sen. McCain For Months About Leaving The Party. \"In interviews with The Hill this month, former Sen. Tom Daschle (D-S.D.) and ex-Rep. Tom Downey (D-N.Y.) said there were nearly two months of talks with the maverick lawmaker following an approach by John Weaver, McCain's chief political strategist.\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n- Sens. McCain And Daschle Met. \"Daschle said that throughout April and May of 2001, he and McCain 'had meetings and conversations on the floor and in his office, I think in mine as well, about how we would do it, what the conditions would be. We talked about committees and his seniority ... [A lot of issues] were on the table.'\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\nSens. John Edwards, Teddy Kennedy And Harry Reid All Attempted To Recruit Sen. McCain. \"Other senators who played major roles in the intense recruiting effort, according to Democrats, were then-Sen. John Edwards (D-N.C.) as well as Sens. Edward Kennedy (D-Mass.) and Harry Reid (D-Nev.).\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\n- Edwards Thought He Might Be Able To Convince McCain To Defect. '\"John [Edwards] at that time was working with McCain on a couple things and there was a sense that because of his relationship that he might be a good person to talk to him,' Daschle said. 'He was clearly one of those that we thought could be helpful.''' (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)\n\nDaschle Thought Sen. McCain Was The Democrats' \"Best Opportunity.\" \"Daschle, however, said the talks went much further, claiming that there were times that he and Democratic leaders thought McCain 'might be our best opportunity.'\" (Bob Cusack, \"Democrats Say McCain Nearly Abandoned GOP,\" The Hill, 3/29/07)", "images": ["https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/favicon.ico", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/Press_Releases/2.4.08_Kerry-McCain.jpg", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/spacer.gif", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/btn/btnEmailFriend.gif", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/btn/btnGo.gif", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/clear.gif", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/bg/bg_logo_small.gif", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/Press_Releases/Kerry-McCain_SML.jpg", "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/img/btn/btnClose.gif"], "top_img": "https://web.archive.org/web/20080206222702im_/http://www.mittromney.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Kerry-McCain: Welcome To Massachusetts!", "meta_data": {"description": "Sen. John McCain:", "keywords": "Kerry, McCain, Massachusetts"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}