{"url": "https://web.archive.org/web/20080606124724/http://www.tampabay.com:80/news/politics/state/article607793.ece", "text": "Fill out this form to email this article to a friend Your name Your email Recipient email\n\nYou may enter up to 20 multiple email addresses, separated by commas.\n\nYour message\n\n\n\nClick here to try again. We were unable to send your email. Crist has experience to be vice president, McCain says By Adam C. Smith, Times Political Editor\n\nIn print: Thursday, June 5, 2008 SCOTT KEELER | Times Story Tools E-mail this story Contact the editor Print this story Comment on this story Social Bookmarking [+] Digg Facebook Stumbleupon Reddit Del.icio.us Newsvine ADVERTISEMENT [EDMUND D. FOUNTAIN | Times] Mike Hughes of Largo, Pam Wilson of Indian Rocks Beach and Nora Harvey of Dunedin sit outside the Renaissance Vinoy Resort in St. Petersburg protesting Sen. John McCain’s fundraiser there Wednesday. About 50 people, including Democrats and union members, came out against the presumptive Republican nominee for president, whom they called “McSame” as President Bush. Wilson made signs for the protest. Jack Ganzell of Dunedin, far right, says he came out because he wanted to see what was going on. Related Links Audio: Excerpts of McCain's interview with the Times' Adam Smith ST. PETERSBURG — Charlie Crist may not yet have a full gubernatorial term under his belt, but Sen. John McCain said Wednesday Crist has enough experience to be vice president. \"Oh, I am sure that in many respects Charlie Crist is qualified. He's had other offices. As we know, he was attorney general as well. This is a big and diverse state,\" McCain said in an interview Wednesday evening before a $1,000-per-person private fundraising reception. \"But we haven't moved anywhere on the process that he would be under,\" the presumptive Republican presidential nominee stressed. \"We have a large number of people that we are considering, but I just don't mention anybody's name because then it starts a process that could end up in an invasion of their privacy.\" In a taped interview to air Sunday on Political Connections on Bay News 9, McCain said he will reach out to supporters of Sen. Hillary Rodham Clinton and noted his independence from President Bush on such issues as government spending and climate control. \"I promise them that I'll be the president of all the people, not just Republicans or anybody else, but all the people,\" McCain said. \"I realize that I have to get independents and Democrats if I'm going to win this election.\" He also decried the giant Confederate flag that's been proposed to fly near the intersection of Interstates 4 and 75 in Hills­borough County. McCain has faced this issue before, and has voiced profound regret for not taking a stand against a rebel flag atop the South Carolina statehouse during the 2000 GOP primary. \"It's a free country,\" McCain said of the flag in Hillsborough, but he said the Civil War memorial group behind the flag plans \"should consider the feelings and sensitivities on this issue at a time like this in America where we want to move forward.\" Now that the Democratic nominee has been chosen, McCain knows he faces an opponent in Sen. Barack Obama who is more inspiring and energetic on the stump. McCain isn't worried. \"I think people are very interested in substance, as well as style,\" he said. McCain also struck on a theme of his campaign, suggesting Obama lacks the experience and knowledge to be president. But polls show a strong majority of American voters think invading Iraq was a mistake, which is what Obama said all along. When asked if Obama showed better judgment in opposing the invasion, McCain defended the war as the right call because \"every intelligence agency in the world believed that (Saddam Hussein) had weapons of mass destruction.\" What about Florida's Bob Graham, the former Senate Intelligence Committee chairman who argued at the time that invading Iraq would divert attention and resources from more urgent threats, particularly al-Qaida? \"I respect Sen. Graham enormously, but I don't think there's any doubt that Saddam Hussein, who had acquired and used weapons of mass destruction before, had invaded a neighbor, Kuwait, where we had to fight one war with him, that his intent was … to acquire and use weapons of mass destruction,\" McCain replied. The private fundraising reception at the Renaissance Vinoy Resort in St. Petersburg kicked off a three-day Florida swing, which includes a speech to newspaper editors in Orlando today and an event touting his environmental credentials in the Everglades on Friday. Obama campaign spokesman Bill Burton dismissed McCain's efforts to cast himself as anything but a continuation of President Bush's agenda. \"While John McCain has a record of occasional independence from his party in the past, last year he chose to embrace 95 percent of George Bush's agenda, including his failed economic policies and his failed policy in Iraq,\" Burton said referring to McCain's voting record. \"No matter how hard he tries to spin it otherwise, that kind of record is simply not the change the American people are looking for or deserve.\" McCain said he supports the antigay marriage ballot initiatives in Florida and California, even though the Republican governors of both states have little interest in those efforts. While he voted against a federal marriage amendment proposal, McCain noted that he supported a similar initiative in his home state of Arizona, where voters rejected the idea. \"I think it's important to preserve the unique status of a marriage between men and women,\" McCain said. \"I respect the views of others who don't hold that view, but I also think that we have a process in our states to amend our constitutions to reflect the will of the majority of the people.\" Adam C. Smith can be reached\n\nat asmith@sptimes.com\n\nor (727)893-8241.\n\n>>fast facts Want to watch? The full interview airs\n\nSunday on Bay News 9\n\nat 11 a.m. and 8:30 p.m.\n\n[Last modified: Jun 05, 2008 09:01 PM]\n\n\n\n\n\n\n\nShare your thoughts on this story Read our guidelines for comments First Name (only)\n\n\n\nLocation\n\nComment (May be published online and/or in print)\n\n\n\nYou have 250 characters left to comment.\n\nComments on this article by John P. Jun 5, 2008 9:01 PM I actually liked McCain till he comes out and makes the comment that Crist is a qualified VP propect. ARE YOU KIDDING ME ? Crist has done nothing to rectify the property tax, property insurance and huge abuse's in government spending,ex. double dipp by Buddy Jun 5, 2008 6:50 PM If mcCain picks Christ he will lose my vote. by Jane Jun 5, 2008 3:18 PM I'm glad people wasted their votes on Christ for Governor. He's checked out on state, just as soon as he won. He's spent valuable time kissing McCain's tush while he could've been solving real problems here. I bet Jim Davis is peeved by Steve Jun 5, 2008 3:18 PM I'm surprised (not really) at how anti-gay McCain is (courting the homophobe vote). He is for an anti-gay state ammendment in a state he doesn't live in governed by a possible running mate who is against the ammendment. I know who I'll vote for now. by jim Jun 5, 2008 3:13 PM maybe charlie can get his friend pearlman to run a drive for McCain by Rich Jun 5, 2008 3:00 PM Senile John and empty Charlie..after clueless George. Obama is over qualified and I cnat wait to vote for him. by Trunk Jun 5, 2008 1:54 PM Nice smile, nice tan, nice girlfriend. That's about it. by Sam Jun 5, 2008 1:41 PM McFossil will not be redeemed to Conservatives by having Gov. Crist, a moderate Republican, on the ticket as Vice President. by Syracuse Jun 5, 2008 1:33 PM I don't think I could vote for an orange VP. by bdiddy Jun 5, 2008 11:52 AM Politics sucks. I am torn between 2 worthless candidates. It could be an old fashioned coin toss. by john Jun 5, 2008 11:52 AM Well I know who I'm not voting for if he does chose Charlie. You know every King needs a court jester. by fj Jun 5, 2008 11:52 AM If Bush can be a president ...when he can't even read ....why cant Crist be a Vice President! Lets face it our standards have been lower'd by Bush! Apparently a trained monkey can be President! by C. Jun 5, 2008 11:52 AM So fairly-new Gov. Crist has experience to be one step away from the presidency, but Sen. Obama doesn't have the experience to be president, though he's more experienced than Crist? McCain, how will you explain yourself out of this one? by Kim Jun 5, 2008 11:52 AM I said I could never vote for Obama, but if McCain pick Crist, I will have not choice, I will have to throw McCain under the bus.... by Pete Jun 5, 2008 11:52 AM Good. Maybe we can get him out of the governor's seat then. He's been dangerous to Floridians in that role since day 1. by billy Jun 5, 2008 11:52 AM \"at least bush had ideas...\" bush had terrible ideas, and look at the results of his ideas and his gut reactions. i am not a republican, but i must say that crist is far more intelligent and acceptable than bush. by kitty Jun 5, 2008 10:52 AM Another reason to NOT vote for ya! Thanks for the warning johnny boy! by Zander Jun 5, 2008 10:52 AM ARE YOU KIDDING ME??? Charlie Crist seems like a nice guy but he is no more qualified to be VP than Obama is qualified to be President. by JH Jun 5, 2008 10:52 AM Graham said we should be focusing on Iran not Iraq and that's why he voted against going to Iraq. Al qaeda's zawahiri stated that Iraq was the central front in the war against the west. It's time the far left admitted defeat. We are winning in Iraq. by Ted Jun 5, 2008 10:51 AM After watching both McCain’s and Obama’s speeches on TV Tuesday night, McCain no less than NEEDS to run Alaska Gov Sarah Palin as his VP mate. by Marie Jun 5, 2008 10:51 AM God help us. RINOs by Clifford Jun 5, 2008 10:51 AM Charlie doesn't pass the White Picket fence test - he isn't married, has no children, and doesn't own property. Unless you consider the child that the mother says is Charlie's but CC won't submit to a DNA test. Charlie is also dating a married woman! by Cindi Jun 5, 2008 10:51 AM If McCain picks Charlie Crist for VP this demonstrates an incredible lack of knowledge. Crist does nothing unless he knows that it will not decrease his popularity.What has he done as Gov? Nothing! I have never voted for him and won't in November. by Bill Jun 5, 2008 10:51 AM Please take empty chair Charlie with you. He's done NOTHING to help with any of the real Florida issues. At least Bush had ideas........Crist has none. by peggy Jun 5, 2008 10:51 AM MCCain was promoted by Crist's tactic to endorse him. Crist did this knowing personally from Guiliani that Guilliani was throwing all his eggs into Florida primary fight.For Crist's short list pick, he destroyed the younger more vibrant candidate. by Joshu Jones Jun 5, 2008 10:50 AM \"Saddam Hussein who had acquired and used weapons of mass destruction before, .... that his intent was … to acquire and use weapons of mass destruction.\" So the US just doesn't supply him with any more. Problem Solved! by Debbie Jun 5, 2008 10:50 AM And there you have it folks. Signs of dementia already. Crist is no more qualified to be vice president than Obama is to be president. What poor choices we have all because the process is tainted by money... by Holly Jun 5, 2008 10:50 AM As we all know, there are two sides to every polician! Unfortunately, George Bush has soured so many people that we are too eager for \"change.\" Has Obama ever had a \"real\" job? I know he doesn't speak to my personal every day needs. by tranottoc Jun 5, 2008 10:50 AM It would be a shame for Florida to lose the talent of Crist for being part of a failed presidential effort.", "images": ["https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/universal/nav/images/itsyourtimes-115.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/universal/nav/images/politifact-130.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/reddit.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/print.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/universal/nav/images/down-pointer.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/delicious.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/fbook.jpeg", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/multimedia/archive/00026/a4s_protest060508_26091d.jpg", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/email.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/editor-icon.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/universal/graphics/logos/footer-partners.gif", "https://web.archive.org/web/20080606124724im_/http://www.sptimes.com/News/webspecials/multimedia/icons-2008/dog-dance.jpg", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/universal/nav/images/buzzblog.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/comment.gif", "https://web.archive.org/web/20080606124724im_/http://digg.com/img/badges/16x16-digg-guy.png", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/stumble.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/universal/nav/images/shoplocal-95.gif", "https://web.archive.org/web/20080606124724im_/http://www.sptimes.com/News/webspecials/multimedia/icons-2008/hank-earl-carr.jpg", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/template/logo_sptimes_lrail.gif", "https://web.archive.org/web/20080606124724im_/http://www.sptimes.com/News/webspecials/multimedia/icons-2008/paycheck-video.jpg", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/multimedia/archive/00026/a4s_mccain060508_26092c.jpg", "https://web.archive.org/web/20080606124724im_/http://www.sptimes.com/spacer.gif", "https://web.archive.org/web/20080606124724im_/http://sptmain.122.2o7.net/b/ss/sptmain/1/H.1--NS/0", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/newsvine.gif", "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/template/favicon.ico"], "top_img": "https://web.archive.org/web/20080606124724im_/http://www.tampabay.com/resource/images/template/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Crist has experience to be vice president, McCain says", "meta_data": {"description": "Tampa Bay's news, shopping and information source brought to you by the St. Petersburg Times and tbt*.", "keywords": "Tampa Bay, St. Petersburg Times, tbt*, Tampa news, Tampa newspaper, Tampa Bay news, world news, local news, obituaries, Tampa, St. Petersburg, Cleawater, Pinellas County, Hillsborough County, Hernando County, Pasco County, www.tampabay.com"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}