{"url": "abcnewsradioonline.com/entertainment-news/contestant-corinne-olympios-breaks-silence-about-bachelor-in.html", "text": "ABC/Jeff Daly(LOS ANGELES) -- Former Bachelor contestant Corinne Olympios has broken her silence about the incident that took place on the set of Bachelor in Paradise earlier this month.\n\nOn Wednesday afternoon, the reality TV star confirmed in a statement obtained by ABC News that she was a part of the incident, which prompted Warner Brothers, the studio behind the show, to suspend production and to launch an investigation into allegations of misconduct.\n\nThough she did not go into detail, Olympios explained that she is currently in therapy to \"begin dealing with the physical and emotional trauma\" that she sustained while shooting the show in Mexico.\n\nShe also said that she has retained an attorney to \"obtain justice.\"\n\n“I am a victim and have spent the last week trying to make sense of what happened on June 4. Although I have little memory of that night, something bad obviously took place,\" she said, adding, \"As a woman, this is my worst nightmare and it has now become my reality.\"\n\nA representative for Warner Brothers did not immediately respond to a request for comment. A representative for ABC, the network on which the show airs, referred a request for comment to Warner Brothers, since the incident deals with production.\n\nOn Sunday afternoon, Warner Brothers released a statement confirming that production on season four of the show had been suspended and \"appropriate responsive action\" would be taken following a \"thorough investigation.\"\n\nTwo days later, Chris Harrison, the host of the Bachelor franchise, urged fans to \"be patient\" and apologized for \"any inconvenience and disappointment\" caused by the show's suspension.\n\nLast week, ABC released the names of several Bachelor in Paradise contestants. In addition to Olympios, they included Raven Gates, Alexis Waters, Jasmine Goode and DeMario Jackson.\n\nCopyright © 2017, ABC Radio. All rights reserved.", "images": ["http://abcnewsradioonline.com/universal/images/transparent.png", "http://dlgie0dznny76.cloudfront.net/wp-content/uploads/2015/10/21160010/START_HERE_PODCAST_ICON_600x600_APODCASTS.jpg?__SQUARESPACE_CACHEVERSION=1526932874504", "http://abcnewsradioonline.com/storage/e_Corinne_06122017.jpg?__SQUARESPACE_CACHEVERSION=1497270627171", "http://pixel.quantserve.com/pixel/p-53469zSReurz-.gif", "http://c.statcounter.com/4890009/0/dcd35c0c/1/", "http://abcnewsradioonline.com/storage/layout/new-banner0102.png"], "top_img": "http://abcnewsradioonline.com/storage/e_Corinne_06122017.jpg?__SQUARESPACE_CACHEVERSION=1497270627171", "keywords": [], "authors": [], "canonical_link": "http://abcnewsradioonline.com/", "title": "ABC News Radio", "meta_data": {"Robots": "index,follow", "description": "Entertainment News and Headlines From ABC News Radio", "og": {"title": "ABC News Radio", "description": "ABC News Radio. Trusted. Credible. Complete. Online. America's largest commercial radio news network.", "image": "http://abcnewsradioonline.com/storage/abcnewsradio.png", "type": "News", "url": "http://abcnewsradioonline.com/", "site_name": "ABC News Radio"}, "fb": {"app_id": 111042768157, "admins": "USER_ID"}}, "movies": [], "publish_date": null, "source": "http://abcnewsradioonline.com", "summary": ""}