{"url": "www.inquisitr.com/4891029/jennifer-aniston-did-not-get-200000-in-cosmetic-procedures-after-justin-theroux-split-debunked/", "text": "Jennifer Aniston has been a big spender when it comes to cosmetic procedures since her breakup with Justin Theroux. At least that’s according to an article that appeared in Life & Style. The online tabloid claims that an “inside source” spilled the beans, allegedly telling them that Aniston spent $200,000 on beauty since she’s become single. But celebrity rumor watchdog Gossip Cop is on the case, and they say that the story is untrue.\n\nAs Gossip Cop notes, Life & Style claims that the $200,000 price tag includes the costs of personal trainers, Botox, fillers, and other products. The tabloid’s “source” says that Jen started investing heavily in these beauty treatments back in February, and that her goal was to show Justin “what he’s missing.” According to Gossip Cop, the article then quotes a plastic surgeon, who said that Jennifer looks like she has had Botox and microneedling done on her face.\n\nBut the doctor they cited has never treated Aniston, which is a red flag about the credibility of the source and the article. Gossip Cop reports that they checked with Aniston’s rep, who said that Jennifer is not spending big bucks on beauty treatments so that she can get revenge on her former flame.\n\nPeople Magazine has previously reported that Jennifer Aniston is moving on from the split and made no mention of expensive cosmetic procedures. A source told People that Jennifer and Justin have had some contact since they broke up, but that they have no plans to resume their romantic relationship. Justin is back in New York, the magazine’s insider says, while Jennifer has remained in Los Angeles. They also added that the former Friends actress’s life hasn’t really changed now that she’s single again. She’s still “socializing with friends,” and otherwise enjoying her life. Aniston is also in a new movie called, The Yellow Birds.\n\nJennifer Aniston, Alden Ehrenreich struggle with secrets in the trailer for Iraq War drama 'The Yellow Birds' https://t.co/SESYcYN0v0 pic.twitter.com/28GbKvT08X — Hollywood Reporter (@THR) May 3, 2018\n\n“Her friends always invite her out and to parties,” the source continued. “Jen has a very caring group of friends that take care of her.”\n\nWatch the intense trailer for Jennifer Aniston's new war movie \"The Yellow Birds\": https://t.co/7ddr5Ti0v6 pic.twitter.com/ip5hIokoO7 — ExtraTV (@extratv) May 4, 2018\n\nGossip Cop reports that Life & Style does not have a stellar track record when it comes to reporting on Jennifer Aniston. They debunked a previous story of theirs in which they claimed that Aniston’s friends were setting her up with men who aren’t involved in the entertainment industry.\n\nAccording to Gossip Cop, Jennifer’ rep stated that the article was “bogus.” So it looks Life & Style should not be trusted if you’re reading or thinking of sharing an article about Jennifer Aniston or any other celebrity.", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/jennifer-aniston-justin-theroux-breakup-split-divorce-rebound-plastic-surgery-brad-pitt.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4891029/jennifer-aniston-did-not-get-200000-in-cosmetic-procedures-after-justin-theroux-split-debunked/", "title": "Jennifer Aniston Did Not Get $200,000 In Cosmetic Procedures After Justin Theroux Split [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}