{"url": "https://apnews.com/ba39109eff3e4893a276c51d91049f8a", "text": "FILE - In this Sept. 29, 2011 file photo, actor Sam Shepard poses for a portrait in New York. Shepard, the Pulitzer Prize-winning playwright, Oscar-nominated actor and celebrated author whose plays chronicled the explosive fault lines of family and masculinity in the American West, died of complications from ALS, Thursday, July 27, 2017, at his home in Kentucky. He was 73. (AP Photo/Charles Sykes, File)\n\nFILE - In this Sept. 29, 2011 file photo, actor Sam Shepard poses for a portrait in New York. Shepard, the Pulitzer Prize-winning playwright, Oscar-nominated actor and celebrated author whose plays chronicled the explosive fault lines of family and masculinity in the American West, died of complications from ALS, Thursday, July 27, 2017, at his home in Kentucky. He was 73. (AP Photo/Charles Sykes, File)\n\nNEW YORK (AP) — Sam Shepard, the Pulitzer Prize-winning playwright, Oscar-nominated actor and celebrated author whose plays chronicled the explosive fault lines of family and masculinity in the American West, has died. He was 73.\n\nFamily spokesman Chris Boneau said Monday that Shepard died Thursday at his home in Kentucky from complications related to Lou Gehrig’s disease, or amyotrophic lateral sclerosis.\n\nThe taciturn Shepard, who grew up on a California ranch, was a man of few words who nevertheless produced 44 plays and numerous books, memoirs and short stories. He was one of the most influential playwrights of his generation: a plain-spoken poet of the modern frontier, both lyrical and rugged.\n\nIn his 1971 one-act “Cowboy Mouth, which he wrote with his then-girlfriend, musician and poet Patti Smith, one character says, “People want a street angel. They want a saint but with a cowboy mouth” — a role the tall and handsome Shepard fulfilled for many. But in soul-searching plays, his portrait of the West was a disillusioned one, peopled by broken characters whose realities fell far short of the American Dream.\n\n“I was writing basically for actors,” Shepard told The Associated Press in a 2011 interview. “And actors immediately seemed to have a handle on it, on the rhythm of it, the sound of it, the characters. I started to understand there was this possibility of conversation between actors and that’s how it all started.”\n\nShepard’s Western drawl and laconic presence made him a reluctant movie star, too. He appeared in dozens of films — many of them Westerns — including Terrence Malick’s “Days of Heaven,” ″Steel Magnolias,” ″The Assassination of Jesse James by the Coward Robert Ford” and 2012′s “Mud.” He was nominated for an Oscar for his performance as pilot Chuck Yeager in 1983′s “The Right Stuff.” Among his most recent roles was the Florida Keys patriarch of the Netflix series “Bloodline.”\n\nBut Shepard was best remembered for his influential plays and his prominent role in the Off-Off-Broadway movement. His 1979 play “Buried Child,” about the breaking down of an Illinois family, won the Pulitzer for drama. Two other plays — “True West,” about two warring brothers, and “Fool for Love,” about a man who fears he’s turning into his father — were nominated for the Pulitzers as well. All are frequently revived.\n\n“I always felt like playwriting was the thread through all of it,” Shepard said in 2011. “Theater really when you think about it contains everything. It can contain film. Film can’t contain theater. Music. Dance. Painting. Acting. It’s the whole deal. And it’s the most ancient. It goes back to the Druids. It was way pre-Christ. It’s the form that I feel most at home in, because of that, because of its ability to usurp everything.”\n\nSamuel Shepard Rogers VII was born in Fort Sheridan, Illinois, in 1943. He grew up on an avocado ranch in Duarte, California. His father was an alcoholic schoolteacher and former Army pilot. Shepard would later write frequently of the damage done by drunks. He had his own struggles, too. Long stretches of sobriety were interrupted by drunk driving arrests, in 2009 and 2015.\n\nShepard arrived in New York in 1963 with no connections, little money and vague aspirations to act, write or make music. “I just dropped in out of nowhere,” he told the New Yorker in 2010. But Shepard quickly became part of the off-off-Broadway movement at downtown hangouts like Caffe Cino and La MaMa. “As far as I’m concerned, Broadway just does not exist,” Shepard told Playboy in 1970 — though many of his later plays would end up there.\n\nHis early plays — fiery, surreal verbal assaults — pushed American theater in an energized, frenzied direction that matched the times. A drummer himself, Shepard found his own rock ’n roll rhythm. Seeking spontaneity, he initially refused to rewrite his drafts, a strategy he later dismissed as “just plain stupid.”\n\nAs Shepard matured as a playwright, he returned again and again to meditations on violence, masculinity and family. His collection “Seven Plays,” which includes many of his best plays, including “Buried Child” and “The Tooth of Crime,” was dedicated to his father.\n\n“There’s some hidden, deeply rooted thing in the Anglo male American that has to do with inferiority, that has to do with not being a man, and always, continually having to act out some idea of manhood that invariably is violent,” he told The New York Times in 1984. “This sense of failure runs very deep — maybe it has to do with the frontier being systematically taken away, with the guilt of having gotten this country by wiping out a native race of people, with the whole Protestant work ethic. I can’t put my finger on it, but it’s the source of a lot of intrigue for me.”\n\nShepard was married from 1969 to 1984 to actress O-Lan Jones, with whom he had son Jesse Mojo Shepard.\n\nHis connection to music was constant. He joined Bob Dylan on the 1975 Rolling Thunder Revue tour of 1975, and co-wrote the song “Brownsville Girl” with him. Shepard and Patti Smith were one-time lovers but lifetime friends. “We’re just the same,” Smith once said. “When Sam and I are together, it’s like no particular time.”\n\nShepard’s movie career began in the late ’70s. While making the 1982 Frances Farmer biopic “Frances,” he met Jessica Lange and the two remained together for nearly 30 years. They had two children, Hannah Jane and Samuel Walker. They separated in 2009. Lange once said of Shepard: “No man I’ve ever met compares to Sam in terms of maleness.”\n\nShepard worked occasionally in movies (among other things, he wrote Wim Wenders’ 1984 Texas brothers drama “Paris, Texas”) but took acting gigs more frequently as he grew older. One movie, he said, could pay for 16 plays.\n\nBesides his plays, Shepard wrote short stories and a full-length work of fiction, “The One Inside,” which came out earlier this year. “The One Inside” is a highly personal narrative about a man looking back on his life and taking in what has been lost, including control over his own body as the symptoms of ALS advance.\n\n“Something in the body refuses to get up. Something in the lower back. He stares at the walls,” Shepard writes. “The appendages don’t seem connected to the motor — whatever that is — driving this thing. They won’t take direction — won’t be dictated to — the arms, legs, feet, hands. Nothing moves. Nothing even wants to.”\n\nShepard’s longtime editor at Alfred A. Knopf, LuAnn Walther, said Shepard’s language was “quite poetic, and very intimate, but also very direct and plainspoken.” She said that when people asked her what Shepard was really like, she would respond, “Just read the fiction.”\n\nThe playwright is survived by his three children and two sisters: Sandy and Roxanne Rogers.\n\nIn Shepard’s 1982 book “Motel Chronicles,” he said that he felt like he never had a home. That feeling, he later, acknowledged, always remained.\n\n“I basically live out of my truck,” Shepard said in 2011. “I feel more at home in my truck than just about anywhere, which is a sad thing to say. But it’s true.”\n\n___\n\nAssociated Press Entertainment Writer Mark Kennedy and National Writer Hillel Italie contributed to this report.", "images": ["https://apnews.com/en_badge_web_generic.png", "https://storage.googleapis.com/afs-prod/media/media:345100f6dd6440e0b6d1b371ab6f105c/3000.jpeg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005041&cv=2.0&cj=1"], "top_img": "https://storage.googleapis.com/afs-prod/media/media:345100f6dd6440e0b6d1b371ab6f105c/3000.jpeg", "keywords": [], "authors": ["Jake Coyle"], "canonical_link": "https://apnews.com/ba39109eff3e4893a276c51d91049f8a", "title": "Sam Shepard, Pulitzer-winning playwright, is dead at 73", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "theme-color": "#dedede", "msapplication-config": "browserconfig.xml", "description": "NEW YORK (AP) — Sam Shepard, the Pulitzer Prize-winning playwright, Oscar-nominated actor and celebrated author whose plays chronicled the explosive fault lines of family and masculinity in the American West, has died. He was 73. Family spokesman Chris Boneau said Monday that Shepard died Thursday at his home in Kentucky from complications related to Lou Gehrig's disease, or amyotrophic lateral sclerosis. The taciturn Shepard, who grew up on a California ranch, was a man of few words who nevertheless produced 44 plays and numerous books, memoirs and short stories. He was one of the most influential playwrights of his generation: a plain-spoken poet of the modern frontier, both lyrical and rugged.", "keywords": "AP Top News,Plays,Music,Entertainment,Lou Gehrig's disease,Movies,North America,Sam Shepard,Patti Smith,Short stories,Celebrity Deaths", "twitter": {"card": "summary_large_image", "site": "@ap", "title": "Sam Shepard, Pulitzer-winning playwright, is dead at 73", "description": "NEW YORK (AP) — Sam Shepard, the Pulitzer Prize-winning playwright, Oscar-nominated actor and celebrated author whose plays chronicled the explosive fault lines of family and masculinity in the American West, has died. He was 73. Family spokesman Chris Boneau said Monday that Shepard died Thursday at his home in Kentucky from complications related to Lou Gehrig's disease, or amyotrophic lateral sclerosis. The taciturn Shepard, who grew up on a California ranch, was a man of few words who nevertheless produced 44 plays and numerous books, memoirs and short stories. He was one of the most influential playwrights of his generation: a plain-spoken poet of the modern frontier, both lyrical and rugged.", "image": "https://storage.googleapis.com/afs-prod/media/media:345100f6dd6440e0b6d1b371ab6f105c/3000.jpeg", "url": "https://apnews.com/ba39109eff3e4893a276c51d91049f8a"}, "og": {"title": "Sam Shepard, Pulitzer-winning playwright, is dead at 73", "description": "NEW YORK (AP) — Sam Shepard, the Pulitzer Prize-winning playwright, Oscar-nominated actor and celebrated author whose plays chronicled the explosive fault lines of family and masculinity in the American West, has died. He was 73. Family spokesman Chris Boneau said Monday that Shepard died Thursday at his home in Kentucky from complications related to Lou Gehrig's disease, or amyotrophic lateral sclerosis. The taciturn Shepard, who grew up on a California ranch, was a man of few words who nevertheless produced 44 plays and numerous books, memoirs and short stories. He was one of the most influential playwrights of his generation: a plain-spoken poet of the modern frontier, both lyrical and rugged.", "type": "article", "url": "https://apnews.com/ba39109eff3e4893a276c51d91049f8a", "image": {"identifier": "https://storage.googleapis.com/afs-prod/media/media:345100f6dd6440e0b6d1b371ab6f105c/3000.jpeg", "width": 4500, "height": 3000}, "site_name": "AP NEWS"}, "fb": {"app_id": 870613919693099, "pages": 249655421622}, "article": {"published_time": "2017-07-31T20:57:10Z", "modified_time": "2017-07-31T20:57:29Z", "section": "AP Top News", "tag": "Celebrity Deaths"}, "google-site-verification": "XvG-YKlyyPmG2x0J9-rdS-zI8LhL4d75ZQoccETD2qA"}, "movies": [], "publish_date": 1501534630.0, "source": "https://apnews.com", "summary": ""}