{"url": "https://web.archive.org/web/20170525180914/http://www.forbes.com/sites/erikkain/2017/05/25/arrows-season-5-finale-was-a-decent-end-to-an-okay-season/", "text": "Arrow wrapped up its fifth season last night. The season finale was a mixed bag, just like the rest of Season 5.\n\nUnlike many other critics who are singing the finale's praises, calling it the best episode ever, or calling the fifth season the best season ever, I'm left feeling deeply divided.\n\nI disagree with IGN's claim that this was the best episode ever, though it had some good moments, and I disagree with Paul Tassi that this was the best season ever. That still belongs to Season 2, for reasons I'll get into momentarily.\n\nSpoilers follow.\n\nThe Good\n\nThe Villain\n\nWe'll start with what worked both in the finale and the season. Adrian Chase was a great villain, certainly the best since Slade Wilson in Season 2. He puts Oliver in a real bind, and there's a real emotional dynamic between the two men. It's the most personal rivalry since Season 2, and that makes a world of difference.\n\nSlade Returns\n\nSpeaking of Slade, it was a pleasant surprise to see Manu Bennett return to that role, this time as a man in search of redemption willing to help Oliver and Team Arrow on Lian Yu. Slade reminds me of just how good Season 2 was. It was kind of cool to see so many villains on Team Arrow at once: Slade, Merlyn, Nyssa...sometimes you have to fight fire with fire.\n\nFull Circle\n\nFinally, I loved how they wrapped up the flashbacks, both because we returned full circle to the very first episode, and because presumably there will be no more flashbacks. These haven't really worked since Season 2, so I'm happy to be done with them.\n\nThe Mixed\n\nOlicity\n\nI'm not sure how I feel about Oliver and Felicty rekindling things. As readers of this column know, I'm not a fan of Olicity, though that's not because I don't think the couple can work on the show. Rather, I don't think the couple is very well written most of the time, and their relationship is fraught with silly melodrama that makes me dislike both characters more than I should.\n\nFake Deaths\n\nMalcolm Merlyn wore out his welcome long, long ago on Arrow. A great Season 1 villain turned into a character with no clear purpose, it's possible that last night he sacrificed himself to save Thea. It's also possible that he's alive and well and will return when we least expect it, given that nobody ever truly dies and stays dead on Arrow. If not for this nagging suspicion, this could have been a great moment. That same logic applies to Chase blowing up the island. It's a cliff-hanger, sure, but we know that most of the heroes will survive.\n\nTeam Arrow\n\nSeason 5 took all the problems the show already had with bloat and made them worse. The cast, and Team Arrow in particular, has ballooned out of hand. I honestly hope that island bomb takes out a few characters because it's just absurd to have so many people on the team. Why do we need two computer geniuses? What is the point of Rene when we already have Diggle? Why did we need a new Black Canary right away? Team Arrow is such a convoluted, bloated mess right now and it really weakens the show, giving too little screen-time to characters we care about.\n\nThe Bad\n\nThe Fight Scenes\n\nI'm not sure how many more fight scenes between Team Arrow and a bunch of goons I can take. What's the point of these black-clad assassins if they can be taken down so easily? I still remember the first time a League of Assassins member attacked Sara Lance. That fight was crazy and brutal and tense. I guess that was the only assassin worth a damn.\n\nIn these big team fights especially the choreography really falls apart. Everyone flails around goofily. There was one moment where an assassin was wobbling his sword unconvincingly at Diggle as our hero sort of pawed back at him. It's pretty cringeworthy.\n\nGranted, the one-on-one fights were better and overall this season has had better fight scenes than before, but the problems with a too-bloated Team Arrow spill over into the action.\n\nThe Killing\n\nFor five seasons now, Oliver has wrestled with whether or not he should kill. He's given it up from time to time, and from time to time he still kills. The show has fumbled over and over when it comes to addressing this question seriously. This makes Season 5's ultimate emotional stakes feel a bit...odd. Chase is trying to convince Oliver that he liked killing, which Oliver eventually admits to, but then Chase wants to get Oliver to kill him to prove a point. But Oliver has killed plenty of people already, so I'm not sure what point that would be. The real emotional zenith here was when Oliver admitted to enjoying killing, but I wish that had come later on rather than several episodes ago.\n\nI also don't really understand why Chase allowed himself to be captured, if he was only going to use his associates to kidnap Oliver's loved ones anyways, and then force Oliver to break him out. It feels like a lot of extra work and risk for no real reason. Chase is a fine villain, but in some ways I felt like I was watching a new version of The Dark Knight. Like the Joker in that film, Chase's plans always work out just perfectly even though they're wildly complex.\n\nVerdict\n\nI can't help but feel like Season 5, while overall a course correction, was still not the show that Arrow could---and should---be. I love the core cast. Stephen Amell, in particular, is the reason I'm still watching this show. He deserves better material to work with, as do Emily Bett Rickards, David Ramsey, Paul Blackthorne and Willa Holland.\n\nThe bloat, the lackluster flashbacks, the serious issues with the plot, all these things make Season 5 a less than great season, and one that I had a hard time connecting with. It wasn't infuriatingly awful like Season 4, and I liked it more than Season 3, but it ranks a distant third to Season 2 and 1 (in that order.) I want the show to tighten its belt and figure out how to make a 23 episode season truly work.\n\nTo do this, I think they need to take some lessons from Gotham, which has been pretty effective at breaking its seasons into two distinct halves. More on that in a separate post.\n\nI'm curious to hear your thoughts on all of this. I feel very much like the negative Nancy of the internet right now, when so many of my colleagues seem so impressed by this finale and this season. For me it was jut OK. Nothing terrible, but hardly anything special either.\n\nHey, at least it wasn't as bad as The Flash's Season 3 finale. That was truly terrible.\n\nI'd love it if you followed me on Twitter and Facebook and subscribed to my channel on YouTube. Also feel free to subscribe to my posts by email. Thanks for reading.", "images": ["https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Oliver-and-Slade.jpg?width=960", "https://web.archive.org/web/20170525183352im_/https://0.gravatar.com/avatar/0b95268a1a76ca3c83a2112b38af5958?s=400&d=mm&r=g", "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Bad-guys-Arrow.jpg?width=960", "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Team-Arrow.jpg?width=960", "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Arrow-header.jpg?width=640&height=434", "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Arrow-header.jpg?width=960", "https://web.archive.org/web/20170525183352im_/https://specials-images.forbesimg.com/imageserve/57ffbe8131358e6da6d7e521/400x400.jpg?fit=scale&background=000000"], "top_img": "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Arrow-header.jpg?width=640&height=434", "keywords": [], "authors": ["Erik Kain"], "canonical_link": "https://web.archive.org/web/20170525183352/https://www.forbes.com/sites/erikkain/2017/05/25/arrows-season-5-finale-was-a-decent-end-to-an-okay-season/", "title": "Arrow's Season 5 Finale Was A Decent End To An Okay Season", "meta_data": {"referrer": "origin-when-cross-origin", "description": "Arrow's Season 5 finale was a mixed bag, just like the rest of the season.", "author": "Erik Kain", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "prerender-status-code": "{{meta.code}}", "apple-itunes-app": "app-id=588647136", "og": {"title": "Arrow's Season 5 Finale Was A Decent End To An Okay Season", "site_name": "Forbes", "url": "https://web.archive.org/web/20170525183352/https://www.forbes.com/sites/erikkain/2017/05/25/arrows-season-5-finale-was-a-decent-end-to-an-okay-season/", "image": {"identifier": "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Arrow-header.jpg?width=640&height=434", "type": "image/jpeg,image/gif,image/png"}, "description": "Arrow's Season 5 finale was a mixed bag, just like the rest of the season.", "updated_time": "2017-05-25T13:40:08-04:00", "type": "article"}, "article": {"publisher": "https://www.facebook.com/forbes", "author": "http://www.facebook.com/https://www.facebook.com/erikkainwriter/", "section": "Business", "section_url": "//www.forbes.com/business", "id": "blogAndPostId/blog/post/1360-42792", "published": "2017-05-25", "modified": "2017-05-25"}, "fb": {"app_id": 123694841080850}, "twitter": {"card": "summary_large_image", "site": "@forbes", "title": "Arrow's Season 5 Finale Was A Decent End To An Okay Season", "description": "Arrow's Season 5 finale was a mixed bag, just like the rest of the season.", "image": "https://web.archive.org/web/20170525183352im_/https://blogs-images.forbes.com/erikkain/files/2017/05/Arrow-header.jpg?width=640&height=434", "creator": "@erikkain"}}, "movies": [], "publish_date": 1495641600.0, "source": "https://web.archive.org", "summary": ""}