{"url": "https://people.com/tv/kourtney-kardashian-scott-disick-discuss-marriage/", "text": "It’s summertime in Calabasas, which means new beginnings for all three of the Kardashian sisters.\n\nOn Sunday’s episode of Keeping up with the Kardashians, Kim, 37, launched her KKW Beauty line, Khloé, 33, brought her boyfriend home for the summer, and Kourtney, 38, tried to set some boundaries with Scott Disick, 34, after he wasn’t invited to Khloé’s surprise birthday party.\n\nGet push notifications with news, features and more.\n\nKhloe’s homecoming\n\nAfter spending the majority of the basketball season with her boyfriend, Cleveland Cavaliers player Tristan Thompson, in Ohio, Khloé, reveals to Kim and Kourtney that she and the NBA star will be spending the summer in Los Angeles.\n\n“I love that Tristan was like, ‘I want to be there this summer,’ ” Khloé explained to her sisters. “We’re always in Cleveland. He literally can’t [wait to] come here and hang out with you guys. He’s like, ‘I want to be a part of your family and do stuff as a group.’ ”\n\nThe Good American founder continued, “He was like, ‘I want to be with your family more,’ and he really wants to hang out with all of us more. We’re going to be here, but we also want a house in the city.”\n\nKhloé stresseed over finding a rental in Los Angeles for the pair to spend the summer so Thompson, 26, could be closer to UCLA, where he did twice-daily workouts. “Trust me, nobody in L.A. wants to sit in traffic for over two hours every single day,” she said.\n\nThe Revenge Body host added that she wanted to make sure Tristan was comfortable on her coast since he’d done the same for her in Cleveland. “Tristan has always gone out of his way to make me feel at home,” she said. “And in Cleveland he’s gone above and beyond, so in L.A. I want to do the same for him.”\n\nWithout the help from mom Kris — who was busy coordinating Khloé’s surprise birthday party with Thompson — Khloé ultimately decided to have Thompson live with her at her Calabasas home.\n\n“After talking with Tristan we have come to the conclusion that I’m crazy,” she recounted. “I don’t know why I was stressing myself out when we have our beautiful home in Calabasas. All Tristan really wants is to be with me and for us to enjoy our summer together. That’s really all that matters.”\n\nParty time!\n\nJust as she settled on a living situation, Khloé got caught off guard when Thompson surprised her with a birthday party with her family and friends in L.A.\n\n“I’ve never had a surprise party ever,” Khloé said. “We were at dinner and Tristan was so calm. He was as cool as a cucumber. He’s good at surprise parties because I had no clue.”\n\nThompson gave a sweet speech at the gathering and shouted out fellow basketball player Brandon Jennings, who originally set him up with Khloé on a blind date. “I’m very honored and glad to be a part of your journey,” Thompson told his girlfriend in front of the attendees.\n\nKhloé was swept away by the touching evening he organized. “Tristan is just incredible,” she gushed. “I’ve never been this happy. I am so lucky to be with someone that is so thoughtful and so sweet.”\n\nRELATED VIDEO: Scott Disick and Sofia Richie Get a Congratulations Dessert and Become Instagram Official\n\nNo invite for Scott\n\nBut Disick didn’t feel as satisfied with the evening since he wasn’t on the guest list.\n\n“I didn’t even get invited to her birthday,” he complained to Kim and ex Kourtney. “I’m family!”\n\nKnowing Kourtney was the reason he didn’t get to go, she offered him a weak excuse: “I didn’t want you to coming to the birthday and be photographed going in.”\n\n“Photographed going in is your concern?” Disick responded. “My concern would be … to be there for your sister who I love and cared about for the past 10-12 years and been there for through thick and thin and marriages and all these different things.”\n\nKourtney had been adopting a positive outlook and later divulged to Khloé over a workout that she was taken aback by the confrontation.\n\n“I’m a little bit caught off guard and I just said that I didn’t want to be photographed even though that’s really not what I meant,” Kourtney admitted. “I just try to be positive. And I didn’t want to say I just didn’t want you there. So if I can’t say anything nice, I just won’t say anything at all.”\n\nWith Khloé’s advice, Kourtney came clean to the father of her three kids about the real reason why she didn’t want him at the birthday affair. “There’s times when I want you to come and there’s times that I don’t,” she told Disick bluntly.\n\nDisick understood and admitted hanging out with a string of various women in Cannes prior to the party wasn’t the best look. “Obviously I’m not able to handle everything that well,” he said. “I don’t have the best support team. I can try to f—ing be a better person, but it’s not the simplest thing.”\n\nThe conversation eventually took a lighter turn, and Disick joked, “When do you think were gonna get married by the way, like 40?”\n\nKourtney responded, “You think when I turn 40 I’m gonna go, hey I’ve been looking for this drunk guy and he has a bunch of dirty sh— stained underwear?”\n\nKim’s beautiful venture\n\nKim’s stressors didn’t come from the man in her life. In fact, she said husband Kanye West actually helped her plan the launch party for her KKW Beauty line.\n\n“Kanye saw the plans and it was so helpful his input,” Kim said. “He called the florist and we made that whole flower rose room last minute, and that was honestly like the biggest attraction.”\n\nKim hosted beauty bloggers and industry titans at her house to support her cosmetics line, which she had announced at the Forbes Women’s Summit in June.\n\n“It’s so exciting to do something on my own,” she said. “Basically for the past almost decade my sisters and I have always had a licensing deal but going from being a licensee to an owner is such a big deal and it’s so much more responsibility. I feel like this has been what I’ve been working for for 10 years.”\n\nBut the mother of two was nervous about doing the interview with Forbes’ editor-in-chief at the summit, as she was still easing into doing press after her October 2016 robbery.\n\n“I’ve been like slowly taking my time to come back and this is a serious, sit-down, major interview,” Kim told Kris, 62. “This isn’t … I don’t know how something like this could go. If they want to ask me crazy questions, it’s Steve Forbes. It’s hard for me to get back out there.”\n\nBut in the end — after releasing new promotional images because fans thought she was wearing blackface in the originals — Kim was happy with how the launch party turned out. “There’s such amazing press on this launch party,” she gushes. “And I’m so happy we made so many changes so it would be perfect.”\n\nKeeping Up with the Kardashians airs Sundays (9 p.m. ET) on E!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fkourtney-kardashian4-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fkourtney-kardashian4-1.jpg", "keywords": [], "authors": ["Dana Rose Falcone"], "canonical_link": "https://people.com/tv/kourtney-kardashian-scott-disick-discuss-marriage/", "title": "Kourtney Kardashian and Scott Disick Discuss Marriage", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Keeping Up with the Kardashians,Kendall Jenner,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,Kylie Jenner,News,reality star,TV", "news_keywords": "Keeping Up with the Kardashians,Kendall Jenner,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,Kylie Jenner,News,reality star,TV", "description": "\"When do you think were gonna get married by the way, like 40?\" Scott Disick asked ex Kourtney Kardashian on Sunday's Keeping Up with the Kardashians", "og": {"title": "Kourtney Kardashian and Scott Disick Discuss Possibly Getting Married at 40", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kourtney-kardashian-scott-disick-discuss-marriage/", "description": "It’s summertime in Calabasas, which means new beginnings for all three of the Kardashian sisters. On Sunday’s episode of Keeping up with the Kardashians, Kim,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fkourtney-kardashian4-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/kourtney-kardashian-scott-disick-discuss-marriage/", "description": "\"When do you think were gonna get married by the way, like 40?\" Scott Disick asked ex Kourtney Kardashian on Sunday's Keeping Up with the Kardashians", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fkourtney-kardashian4-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kourtney-kardashian-scott-disick-discuss-marriage/", "title": "Kourtney Kardashian and Scott Disick Discuss Possibly Getting Married at 40", "description": "\"When do you think were gonna get married by the way, like 40?\" Scott Disick asked ex Kourtney Kardashian on Sunday's Keeping Up with the Kardashians", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fkourtney-kardashian4-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}