{"url": "https://www.sparknotes.com/lit/handmaid/summary/", "text": "Offred is a Handmaid in the Republic of Gilead, a totalitarian and theocratic state that has replaced the United States of America. Because of dangerously low reproduction rates, Handmaids are assigned to bear children for elite couples that have trouble conceiving. Offred serves the Commander and his wife, Serena Joy, a former gospel singer and advocate for “traditional values.” Offred is not the narrator’s real name—Handmaid names consist of the word “of” followed by the name of the Handmaid’s Commander. Every month, when Offred is at the right point in her menstrual cycle, she must have impersonal, wordless sex with the Commander while Serena sits behind her, holding her hands. Offred’s freedom, like the freedom of all women, is completely restricted. She can leave the house only on shopping trips, the door to her room cannot be completely shut, and the Eyes, Gilead’s secret police force, watch her every public move.\n\nAs Offred tells the story of her daily life, she frequently slips into flashbacks, from which the reader can reconstruct the events leading up to the beginning of the novel. In the old world, before Gilead, Offred had an affair with Luke, a married man. He divorced his wife and married Offred, and they had a child together. Offred’s mother was a single mother and feminist activist. Offred’s best friend, Moira, was fiercely independent. The architects of Gilead began their rise to power in an age of readily available pornography, prostitution, and violence against women—when pollution and chemical spills led to declining fertility rates. Using the military, they assassinated the president and members of Congress and launched a coup, claiming that they were taking power temporarily. They cracked down on women’s rights, forbidding women to hold property or jobs. Offred and Luke took their daughter and attempted to flee across the border into Canada, but they were caught and separated from one another, and Offred has seen neither her husband nor her daughter since.\n\nAfter her capture, Offred’s marriage was voided (because Luke had been divorced), and she was sent to the Rachel and Leah Re-education Center, called the Red Center by its inhabitants. At the center, women were indoctrinated into Gilead’s ideology in preparation for becoming Handmaids. Aunt Lydia supervised the women, giving speeches extolling Gilead’s beliefs that women should be subservient to men and solely concerned with bearing children. Aunt Lydia also argued that such a social order ultimately offers women more respect and safety than the old, pre-Gilead society offered them. Moira is brought to the Red Center, but she escapes, and Offred does not know what becomes of her.\n\nOnce assigned to the Commander’s house, Offred’s life settles into a restrictive routine. She takes shopping trips with Ofglen, another Handmaid, and they visit the Wall outside what used to be Harvard University, where the bodies of rebels hang. She must visit the doctor frequently to be checked for disease and other complications, and she must endure the “Ceremony,” in which the Commander reads to the household from the Bible, then goes to the bedroom, where his Wife and Offred wait for him, and has sex with Offred. The first break from her routine occurs when she visits the doctor and he offers to have sex with her to get her pregnant, suggesting that her Commander is probably infertile. She refuses. The doctor makes her uneasy, but his proposition is too risky—she could be sent away if caught. After a Ceremony, the Commander sends his gardener and chauffeur, Nick, to ask Offred to come see him in his study the following night. She begins visiting him regularly. They play Scrabble (which is forbidden, since women are not allowed to read), and he lets her look at old magazines like Vogue. At the end of these secret meetings, he asks her to kiss him.\n\nDuring one of their shopping trips, Ofglen reveals to Offred that she is a member of “Mayday,” an underground organization dedicated to overthrowing Gilead. Meanwhile, Offred begins to find that the Ceremony feels different and less impersonal now that she knows the Commander. Their nighttime conversations begin to touch on the new order that the Commander and his fellow leaders have created in Gilead. When Offred admits how unhappy she is, the Commander remarks, “[Y]ou can’t make an omelette without breaking eggs.”\n\nAfter some time has gone by without Offred becoming pregnant, Serena suggests that Offred have sex with Nick secretly and pass the child off as the Commander’s. Serena promises to bring Offred a picture of her daughter if she sleeps with Nick, and Offred realizes that Serena has always known the whereabouts of Offred’s daughter. The same night that Offred is to sleep with Nick, the Commander secretly takes her out to a club called Jezebel’s, where the Commanders mingle with prostitutes. Offred sees Moira working there. The two women meet in a bathroom, and Offred learns that Moira was captured just before she crossed the border. She chose life in Jezebel’s over being sent to the Colonies, where most political prisoners and dangerous people are sent. After that night at Jezebel’s, Offred says, she never sees Moira again. The Commander takes Offred upstairs after a few hours, and they have sex in what used to be a hotel room. She tries to feign passion.\n\nSoon after Offred returns from Jezebel’s, late at night, Serena arrives and tells Offred to go to Nick’s room. Offred and Nick have sex. Soon they begin to sleep together frequently, without anyone’s knowledge. Offred becomes caught up in the affair and ignores Ofglen’s requests that she gather information from the Commander for Mayday. One day, all the Handmaids take part in a group execution of a supposed rapist, supervised by Aunt Lydia. Ofglen strikes the first blow. Later, she tells Offred that the so-called rapist was a member of Mayday and that she hit him to put him out of his misery.\n\nShortly thereafter, Offred goes out shopping, and a new Ofglen meets her. This new woman is not part of Mayday, and she tells Offred that the old Ofglen hanged herself when she saw the secret police coming for her. At home, Serena has found out about Offred’s trip to Jezebel’s, and she sends her to her room, promising punishment. Offred waits there, and she sees a black van from the Eyes approach. Then Nick comes in and tells her that the Eyes are really Mayday members who have come to save her. Offred leaves with them, over the Commander’s futile objections, on her way either to prison or to freedom—she does not know which.\n\nThe novel closes with an epilogue from 2195, after Gilead has fallen, written in the form of a lecture given by Professor Pieixoto. He explains the formation and customs of Gilead in objective, analytical language. He discusses the significance of Offred’s story, which has turned up on cassette tapes in Bangor, Maine. He suggests that Nick arranged Offred’s escape but that her fate after that is unknown. She could have escaped to Canada or England, or she could have been recaptured.", "images": ["https://www.sparknotes.com/images/social_twitter.png", "https://www.sparknotes.com/images/overlay-close.png", "https://www.sparknotes.com/images/svgicon-menu-color-primary-link.svg", "https://www.sparknotes.com/images/svgicon-close-color-off-gray.svg", "https://www.sparknotes.com/images/svgicon-search-color-primary-link.svg", "https://www.sparknotes.com/images/svgicon-search-color-off-gray.svg", "https://img.sparknotes.com/content/sparklife/sparktalk/scarletpam2_SmallWide.jpg", "https://img.sparknotes.com/content/sparklife/sparktalk/peetathirstymellark_SmallWide.jpg", "https://img.sparknotes.com/content/sparklife/sparktalk/83019disturbingbookmovieMAIN.jpg", "https://img.sparknotes.com/sparknotes_new-1200x630.jpg", "https://www.sparknotes.com/images/social_ig.png", "https://www.sparknotes.com/images/logo.svg", "https://www.sparknotes.com/images/social_fb.png", "https://img.sparknotes.com/content/sparklife/sparktalk/4620memebooksquizMAIN_SmallWide.jpg", "https://img.sparknotes.com/content/sparklife/sparktalk/harryhermioneronlaughinggriffyndor_SmallWide.jpg"], "top_img": "https://img.sparknotes.com/sparknotes_new-1200x630.jpg", "keywords": [], "authors": ["Margaret Atwood"], "canonical_link": "https://www.sparknotes.com/lit/handmaid/summary/", "title": "SparkNotes: The Handmaid’s Tale: Plot Overview", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1.0, user-scalable=0", "og": {"image": "https://img.sparknotes.com/sparknotes_new-1200x630.jpg"}, "description": "A short summary of Margaret Atwood's The Handmaid’s Tale. This free synopsis covers all the crucial plot points of The Handmaid’s Tale.", "keywords": "The Handmaid’s Tale synopsis, The Handmaid’s Tale short summary, The Handmaid’s Tale plot outline, brief summary, Margaret Atwood"}, "movies": [], "publish_date": null, "source": "https://www.sparknotes.com", "summary": ""}