{"url": "https://people.com/tv/katie-couric-matt-lauer-firing-opens-up-interview/", "text": "More than a month has passed since Matt Lauer was fired from the Today show, and his former longtime colleague, Katie Couric, is now opening up about the former NBC anchor’s shocking dismissal.\n\n“The whole thing has been very painful for me,” Couric, 61, tells PEOPLE. “The accounts I’ve read and heard have been disturbing, distressing and disorienting and it’s completely unacceptable that any woman at the Today show experienced this kind of treatment.\n\nGet push notifications with news, features and more.\n\n“I had no idea this was going on during my tenure or after I left,” she continued. “I think I speak for many of my former colleagues when I say this was not the Matt we knew. Matt was a kind and generous colleague who treated me with respect. In fact, a joke I once made on late-night television was just that, because it was completely contrary to our brother-sister relationship. It’s still very upsetting. I really admire the way Savannah [Guthrie] and Hoda [Kotb] and the entire Today show staff have handled a very difficult situation.”\n\nThe late-night show joke that Couric refers to is when she said on Watch What Happens Live with Andy Cohen in 2012 that Lauer “pinches me on the ass a lot.” A clip of the comment made the rounds online in the wake of Lauer’s firing.\n\nCouric spent 15 years co-hosting NBC’s Today show with Lauer, 60, but left in May 2006 to anchor the CBS Evening News.\n\nImage zoom NBC/Getty\n\nLauer was fired at the end of November by NBC News after the network received a “detailed complaint from a colleague about inappropriate sexual behavior,” with reason to believe “this may not have been an isolated incident.” Women have also anonymously accused him of sexual harassment and assault in reports published by Variety and The New York Times.\n\nFollowing his firing, which was announced live on Today by Savannah Guthrie and Hoda Kotb, Lauer addressed the original allegations in a statement.\n\n“There are no words to express my sorrow and regret for the pain I have caused others by words and actions,” he said, in part. “To the people I have hurt, I am truly sorry. As I am writing this, I realize the depth of the damage and disappointment I have left behind at home and at NBC.”\n\nAlthough her PEOPLE interview is the first time Couric has spoken in detail about Lauer’s exit, she briefly broke her silence about the scandal on social media in December.\n\nIn a short response to an Instagram user, who called Couric out for not publicly addressing the scandal, the veteran journalist said, “It’s incredibly upsetting and I will say something when I’m ready to. Thanks for your interest.”\n\nRELATED VIDEO: Women of Hollywood Attend Golden Globes Together in Support of the Time’s Up Movement\n\nThe claims against Lauer came as hundreds of women and men — including Rose McGowan, Ashley Judd, Terry Crews and Anthony Rapp — have publicly came forward about alleged sexual misconduct at the hands of powerful men in Hollywood, including Harvey Weinstein and Kevin Spacey.\n\nThe movement inspired the new Time’s Up initiative and legal defense fund that was created to help victims of sexual misconduct pursue legal action against their perpetrators. Time’s Up was a major focus at this year’s Golden Globes, where almost all the famous attendees wore black to raise awareness about the cause.\n\n“I think it was really moving to see so many women support each other and demand change, not only for themselves, but for mistreated and marginalized women in all kinds of industries,” Couric tells PEOPLE about Time’s Up. “Clearly we are witnessing a sea change and a long overdue course correction.”\n\nShe also said that one of the new of the episodes of her upcoming six-part documentary Nat Geo series will focus on harassment women have experienced in their workplaces.\n\n“One of my Nat Geo episodes explores the various obstacles that are holding women back in Hollywood, Silicon Valley and beyond,” she says. “I just interviewed Elisabeth Moss about this. Harassment is just one part of the equation.”\n\nRELATED VIDEO: Hoda Kotb and Savannah Guthrie Are Today’s New Anchor Team\n\nAs for future projects, Couric is focused on her new documentary series as well as her popular podcast — and teaching her husband John Molner about social media.\n\n“I’m having so much fun doing my podcast with my friend Brian Goldsmith,” she says. “I’ve been able to have extended and substantive conversations with so many great, interesting people, like Julia Louis-Dreyfus, Alec Baldwin, David Axelrod, Ava DuVernay and Ina Garten. And now we’re ‘dropping’ episodes weekly. Coming up: Laverne Cox and Amy Schumer.\n\n“Meanwhile, I’m still happily married (after three years!) and I’m teaching John how to do Instagram stories,” she continues. “His are pretty lame so far. I’m also getting ready for my younger daughter Carrie’s college graduation. (GULP!) And there are some other cool projects I’ll be able to announce soon. I’m addicted to work!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1904&h=997&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkatie-couric-matt-lauer-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F11%2Fkatie-couric-matt-lauer-thanksgiving-day-parade-vintage.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1904&h=997&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkatie-couric-matt-lauer-2000.jpg", "keywords": [], "authors": ["Natalie Stone", "Kate Coyne"], "canonical_link": "https://people.com/tv/katie-couric-matt-lauer-firing-opens-up-interview/", "title": "Katie Couric Opens Up About Matt Lauer's Firing from the Today Show", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,Katie Couric,Matt Lauer,News,TV", "news_keywords": "Exclusive,Katie Couric,Matt Lauer,News,TV", "description": "Katie Couric is opening up about Matt Lauer's shocking firing from the Today show", "og": {"title": "Katie Couric Opens Up About Matt Lauer's Firing from the Today Show", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/katie-couric-matt-lauer-firing-opens-up-interview/", "description": "More than a month has passed since Matt Lauer was fired from the Today show, and his former longtime colleague, Katie Couric, is now opening&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1904&h=997&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkatie-couric-matt-lauer-2000.jpg", "width": 1904, "height": 997}}, "pinterest": {"url": "https://people.com/tv/katie-couric-matt-lauer-firing-opens-up-interview/", "description": "Katie Couric is opening up about Matt Lauer's shocking firing from the Today show", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkatie-couric-matt-lauer-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/katie-couric-matt-lauer-firing-opens-up-interview/", "title": "Katie Couric Opens Up About Matt Lauer's Firing from the Today Show", "description": "Katie Couric is opening up about Matt Lauer's shocking firing from the Today show", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1904&h=997&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkatie-couric-matt-lauer-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}