{"url": "https://www.indiewire.com/2017/11/wonder-woman-patty-jenkins-legacy-1201897246/", "text": "\"I see a world where we need a new kind of hero,\" Jenkins said at Glamour Women of the Year Awards, and that means going beyond the big screen.\n\nDon’t call it a torch-passing, but a torch-sharing. At last night’s Glamour Women of the Year Awards, held at Brooklyn’s historic Kings Theatre, the lauded magazine handed out its annual awards to the women who have made the biggest mark on 2017 in all areas, from politics to culture, sports to journalism. Honoree “Wonder Woman” director Patty Jenkins was hailed for her work on the smash hit superheroine film, and original Wonder Woman Lynda Carter was on hand to introduce a gamechanger who she’s very happy to also call her friend. Can’t we all be Wonder Women together?\n\n“She got the essence of Wonder Woman because it lives inside her,” Carter said. “She took the challenge of this miracle of an idea and a ’70s iconic TV show and she made the ‘she’ become the ‘we’ on the big screen all over the world.”\n\nIn a tribute video dedicated to Jenkins, the filmmaker opened up about her own path to Hollywood success, explaining that in her early years in the industry, she encountered “a lack of interest, a lack of opportunity, I just had gotten used to it and kept trudging forward. All of the success that I have seen in Hollywood, behind the scenes, is pure perseverance.”\n\nPopular on IndieWire\n\n“Wonder Woman” star Gal Gadot also weighed in, saying in that same video, “Patty’s legacy for women in Hollywood is basically paving the way to so many of us and so many female filmmakers.” It’s that legacy that Jenkins is fixed on these days.\n\nAs she accepted her Glamour Women of the Year Award, Jenkins further expounded on her years-long journey to make “Wonder Woman” and why she thinks the film is more important — and necessary — than ever before. “When I got the opportunity to make ‘Wonder Woman’ — as you can see, it was something I wanted to do for a long time — I think part of the reason is because what Wonder Woman stands for,” Jenkins said. “I see a world where we need a new kind of hero.”\n\nFor Jenkins and so many of Wonder Woman’s fans, that didn’t mean creating a new character, but turning to one that had long ago been created to inspire and empower women, and whose message has never grown less important over the intervening decades.\n\n“There was a 75-year-old hero that has been brought to life here and there who stands for something very new, which is that she stands for a new kind of hero who is strong and powerful and can fight the bad guy, but also believes in love and thoughtfulness and a better way and a different way,” she said. “I feel like that’s the hero that we need right now…I feel like I got to make this movie about this incredible woman and, in so many ways, for women, because we need those women to go on and save the world for everyone.”\n\nWhile both “Wonder Woman” and Jenkins have seen boundary-busting, box office-smashing, record-cracking success in the months since the film first opened, the director is hopeful that such successes are only the beginning and signal big changes in other arenas, too, not just on the big screen or at the box office.\n\n“I am so honored to have been a part of this movie and its success and everything is wonderful about that success and all it has done for women,” Jenkins said. “But I also really want to continue that story by having women all over the world become the heroes that we need to save the day, as they already are, because I think we need women more than ever.”\n\nShe added, “As we can see this year with all the change that’s happening, we’ve never needed women to not only be equal, but leading the way in so many ways.”\n\nBoth Jenkins and Gadot are due to return for the film’s much-anticipated sequel, which is now slated for a November 2019 release. You can watch Jenkins’ full speech below or over at Glamour.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "http://www.indiewire.com/wp-content/uploads/2017/08/patty-jenkins-wonder-woman.png?w=670", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2016/05/kate-erbland.png?resize=96%2C96&ssl=1", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2017%2F11%2Fwonder-woman-patty-jenkins-legacy-1201897246%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201897246", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2017/11/shutterstock_9222406bx.jpg", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2017/11/shutterstock_9222406bx.jpg?w=780"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/11/shutterstock_9222406bx.jpg", "keywords": [], "authors": ["Kate Erbland"], "canonical_link": "https://www.indiewire.com/2017/11/wonder-woman-patty-jenkins-legacy-1201897246/", "title": "Patty Jenkins: ‘Wonder Woman’ is More Than Just a Superhero Film, It’s a Call to Action", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "At the Glamour Women of the Year Awards, the \"Wonder Woman\" director sounded off on the legacy of her film in the modern world.", "news_keywords": "Glamour Woman of the Year, Lynda Carter, Patty Jenkins, Wonder Woman", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Kate Erbland", "content_type": "Article", "post_id": 1201897246, "title": "Patty Jenkins: 'Wonder Woman' is More Than Just a Superhero Film, It's a Call to Action", "published_at": "2017-11-14 12:22:12", "image": "https://www.indiewire.com/wp-content/uploads/2017/11/shutterstock_9222406bx.jpg?w=300", "comment_count": 0, "tags": "Wonder Woman", "topics": "Film", "body": "Don't call it a torch-passing, but a torch-sharing. At last night's Glamour Women of the Year Awards, held at Brooklyn's historic Kings Theatre, the lauded magazine handed out its annual awards to the women who have made the biggest mark on 2017 in all areas, from politics to culture, sports to journalism. Honoree \"Wonder Woman\" director Patty Jenkins was hailed for her work on the smash hit superheroine film, and original Wonder Woman Lynda Carter was on hand to introduce a gamechanger who she's very happy to also call her friend. Can't we all be Wonder Women together?\r\n\r\n\"She got the essence of Wonder Woman because it lives inside her,\" Carter said. \"She took the challenge of this miracle of an idea and a '70s iconic TV show and she made the ‘she’ become the ‘we’ on the big screen all over the world.\"\r\n\r\nIn a tribute video dedicated to Jenkins, the filmmaker opened up about her own path to Hollywood success, explaining that in her early years in the industry, she encountered \"a lack of interest, a lack of opportunity, I just had gotten used to it and kept trudging forward. All of the success that I have seen in Hollywood, behind the scenes, is pure perseverance.\"\r\n\r\n\r\n\r\n\"Wonder Woman\" star Gal Gadot also weighed in, saying in that same video, \"Patty's legacy for women in Hollywood is basically paving the way to so many of us and so many female filmmakers.\" It's that legacy that Jenkins is fixed on these days.\r\n\r\nAs she accepted her Glamour Women of the Year Award, Jenkins further expounded on her years-long journey to make \"Wonder Woman\" and why she thinks the film is more important -- and necessary -- than ever before. \"When I got the opportunity to make 'Wonder Woman' -- as you can see, it was something I wanted to do for a long time -- I think part of the reason is because what Wonder Woman stands for,\" Jenkins said. \"I see a world where we need a new kind of hero.\"\r\n\r\n\r\n\r\nFor Jenkins and so many of Wonder Woman's fans, that didn't mean creating a new character, but turning to one that had long ago been created to inspire and empower women, and whose message has never grown less important over the intervening decades.\r\n\r\n\"There was a 75-year-old hero that has been brought to life here and there who stands for something very new, which is that she stands for a new kind of hero who is strong and powerful and can fight the bad guy, but also believes in love and thoughtfulness and a better way and a different way,\" she said. \"I feel like that's the hero that we need right now...I feel like I got to make this movie about this incredible woman and, in so many ways, for women, because we need those women to go on and save the world for everyone.\"\r\n\r\nWhile both \"Wonder Woman\" and Jenkins have seen boundary-busting, box office-smashing, record-cracking success in the months since the film first opened, the director is hopeful that such successes are only the beginning and signal big changes in other arenas, too, not just on the big screen or at the box office.\r\n\r\n\r\n\r\n\"I am so honored to have been a part of this movie and its success and everything is wonderful about that success and all it has done for women,\" Jenkins said. \"But I also really want to continue that story by having women all over the world become the heroes that we need to save the day, as they already are, because I think we need women more than ever.\"\r\n\r\nShe added, \"As we can see this year with all the change that's happening, we've never needed women to not only be equal, but leading the way in so many ways.\"\r\n\r\nBoth Jenkins and Gadot are due to return for the film's much-anticipated sequel, which is now slated for a November 2019 release. You can watch Jenkins' full speech below or over at Glamour.\r\n\r\n\r\n\r\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2017/11/wonder-woman-patty-jenkins-legacy-1201897246/", "title": "Patty Jenkins: ‘Wonder Woman’ is More Than Just a Superhero Film, It’s a Call to Action", "description": "\"I see a world where we need a new kind of hero,\" Jenkins said at Glamour Women of the Year Awards, and that means going beyond the big screen.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/11/shutterstock_9222406bx.jpg", "width": 780, "height": 439}}, "article": {"published_time": "2017-11-14T17:22:12+00:00", "modified_time": "2017-11-14T17:22:12+00:00", "author": "https://www.indiewire.com/author/kateindiewire/", "section": "Film", "tag": "Wonder Woman"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1510680132.0, "source": "https://www.indiewire.com", "summary": ""}