{"url": "https://www.hollywoodreporter.com/fien-print/cw-trailer-rankings-upfronts-2018-1112952", "text": "Time for your regular reminder that over the next four days, I'll be giving my quick reactions to the trailers presented to advertisers in New York City. These aren't formal reviews. How could they be? I haven't seen the darned shows. They're just gut responses to sales pitches. If advertisers can pony up billions based on these clips, I can tell you if they're good or bad. My annual Take Me to the Pilots series will begin in a month and then real reviews will start in September. It's a marathon, not a sprint.\n\nOne day after CBS took advertisers back to the '80s with shiny new versions of Murphy Brown and Magnum P.I., The CW closed out broadcast TV's upfronts week with another healthy dose of nostalgia.\n\nExpanding to six nights of original programming in the fall, the network presented a schedule with five new shows premiering between fall and midseason, two of which — Charmed and Roswell, New Mexico — will induce young adult soap opera flashbacks. Another of the shows, Legacies, didn't have any footage to show yet, but as a spinoff of The Originals (itself a spinoff of The Vampire Diaries), it also brings a measure of familiarity.\n\nWithout further ado, let's get to The CW's trailer rankings.\n\n4) In the Dark | I don't pay as much attention to development as I used to, so I hadn't heard a word about In the Dark. I have to admit that my first instinct after seeing the ridiculous poster for this dramedy was to think it was a parody show. A parody of what? For what? I have no idea. I didn't get that far. And my first instinct after watching the first half of the trailer was to think that this had to be some sort of hastily made filler programming for CW Seed. It was only when I saw John From Cincinnati himself (Austin Nichols, who is no longer on the show) in the trailer that I began to realize that this story of a sex-addicted blind misanthrope attempting to solve a murder with the help of her nosey support dog Pretzel was a real series that will air on real television. I'm still not completely convinced. The trailer was tonally muddled, extremely cheap-looking and made me giggle in several totally inappropriate places. Pretzel looks like a very good dog, though. Good dog, Pretzel!\n\n3) Charmed | I was not a Charmed viewer. I must have watched two full episodes ever. The only time I'm aware of the show is when I watch basketball at night on TNT and there's a repeat of Charmed on the next morning. I'll probably watch more episodes of this remake, which pushed its female empowerment message hard in its first trailer. Jennie Snyder Urman's Jane the Virgin track record has definitely bought this one a few extra hours from me, though I wish more of Urman's sense of humor was pushed to the forefront, because that's what I'll be watching and hoping for. I think stars Melonie Diaz, Sarah Jeffery and Madeleine Mantock all seem OK, though the magical effects look mighty middling.\n\n2) Roswell, New Mexico | Wasn't this one supposed to come with some sort of immigration subtext? I was looking forward to that. The trailer eschewed that angle, if it still exists, in favor of sudsy supernatural romance. As it should. It's a sales pitch and not one aimed at me. I'm a Jeanine Mason fan dating back to her run on So You Think You Can Dance and her small part on Bunheads, so I'm definitely the target demo for her debut as a TV lead (assuming you forget the ABC sword-and-sandals epic she did a couple years back and her brief stint on Grey's Anatomy this season). As with Charmed, I'd love to have seen a shade more humor in a trailer that is very, very, very earnest. Other than a little Southwestern ambiance, this trailer looked interchangeable with The CW's very short-lived Star-Crossed from a couple years ago, and I refuse to exist that all alien-human love stories are identical!\n\n1) All American | This is one of the best-cut trailers I've seen all upfronts week, perhaps the best. I'm pumped enough for this show that I'm going to get over my punctuation anxiety that makes me desperately want to add a hyphen. Unlike In the Dark — still not convinced it's a real show — I'd heard about this one, but I hadn't fully realized how completely it's The O.C. only with football. Watch the trailer again. It's so nearly a beat-for-beat remake that Josh Schwartz should be getting a tiny slice of residuals, right down to the rich kids' bacchanal party and somebody sneering \"Welcome to...\" (in this case \"Beverly Hills\") to our main character. Plus, Taye Diggs as Peter Gallagher! Yes, the mustache-twirling racism of the adversarial white characters looks over-the-top, but I appreciated the one joke undercutting gang stereotyping. This looks fun, emotional, corny and inspirational in equal measures and I am there for it! Or at least now I'm excited to watch a full pilot.\n\nCheck back in around a month for the start of my annual Take Me To The Pilots series.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/05/all_american.jpg", "https://cdn1.thr.com/sites/default/files/2018/05/all_american.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_feinprint.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/05/all_american.jpg", "keywords": [], "authors": ["Daniel Fienberg", "Daniel.Fienberg Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/fien-print/cw-trailer-rankings-upfronts-2018-1112952", "title": "The CW's New Show Trailers: A Critic's Ranking", "meta_data": {"viewport": "width=device-width", "description": "The CW takes us back to 'Roswell' and 'Charmed' and introduces a new high school football drama that may look familiar to fans of 'The O.C.'", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/fien-print/cw-trailer-rankings-upfronts-2018-1112952", "domain": "https://www.hollywoodreporter.com/", "title": "The CW's New Show Trailers: A Critic's Ranking", "description": "The CW takes us back to 'Roswell' and 'Charmed' and introduces a new high school football drama that may look familiar to fans of 'The O.C.'", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/05/all_american.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "The CW's New Show Trailers: A Critic's Ranking", "description": "The CW takes us back to 'Roswell' and 'Charmed' and introduces a new high school football drama that may look familiar to fans of 'The O.C.'", "url": "https://www.hollywoodreporter.com/fien-print/cw-trailer-rankings-upfronts-2018-1112952", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/05/all_american.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "The CW's New Show Trailers: A Critic's Ranking", "sailthru.description": "The CW takes us back to 'Roswell' and 'Charmed' and introduces a new high school football drama that may look familiar to fans of 'The O.C.'", "sailthru.author": "Daniel Fienberg", "sailthru.channel": "The Fien Print", "sailthru.vertical": "The Fien Print", "sailthru.date": "2018-05-17 14:42:02", "sailthru.tags": "The Fien Print, Television, Upfronts 2018"}, "movies": [], "publish_date": 1526539322.0, "source": "https://www.hollywoodreporter.com", "summary": ""}