{"url": "https://en.wikipedia.org/wiki/Scandal_(season_7)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode U.S. viewers\n\n(millions)\n\nThe episode begins with a montage depicting Luna's death and Cyrus's rise to the vice-presidency. Jake still has a cabinet position, and is still with Olivia. Olivia works with Cyrus and Mellie to get passed a bill that offers free college education to American citizens while QPA staff battle to find their first client. Olivia's and Jake's uncommitted relationship turns flamboyant when power rises to Olivia's head and she begins to treat him as an employee. Cyrus thinks about becoming the next president, but his ideas fade after Mellie declares how grateful she is for all he has done. Olivia is interviewed by Curtis Pryce and the two end up in an affair. Mellie deals with a situation where a U.S. CIA agent is being held by terrorists in Bashran. Grant can't convince Ambassador Marachi, and Olivia threatens him in exchange of the citizen's return to American soil.\n\n108 2 \"Pressing the Flesh\" Tony Goldwyn Matt Byrne October 12, 2017 ( ) 702 5.00[7]\n\nThe White House prepares a dinner to welcome the President of Bashran, during which Mellie talks to him to try to reach an agreement on the possession of nuclear weapons in his country through a treaty. Olivia asks Jake to investigate President Rashad and he finds out that Rashad sent his niece to study at a university in the United States, which sounds completely different from what he advocates in his country filled with anti-American people. Olivia threatens him with the information, but the President claims to have expected something like that, saying that his ambassador had warned him that Olivia was \"the devil.\" QPA gets an invitation to the dinner, where they try to socialize with high-profile people and hopefully gather possible scandals. Huck discovers that one of the military men at dinner is actually a killer but is stopped by agents, quickly advised by Olivia, Huck, and Abby. Later, Rashad reveals to Mellie that radicals of his country may be responsible, convincing him to accept the treaty. Curtis Pryce also attends the dinner, and he follows Olivia until she asks him to go to her loft. Arriving there, they run into Fitz, who is expecting Olivia.\n\n109 3 \"Day 101\" Scott Foley Zahir McGhee October 19, 2017 ( ) 703 4.70[8]\n\nMarcus asks Fitz how he would like to have Olivia featured in his Presidential library. Fitz is frustrated with the idea of his Presidency being reduced to him just being a man who loved a woman. After spending time with Fitz, Marcus finds him entitled and intolerable. Marcus states Fitz's accomplishments are actually Olivia's. He is close to quitting when Mellie assures him he is just going through the stages of Fitz and the best part is yet to come. Meanwhile, Fitz gets a startling visit from Rowan who needs help trying to handle Olivia. Rowan informs Fitz that Olivia is command. As Olivia and Curtis arrive at Olivia's door to spend the night together they find Fitz waiting.\n\n110 4 \"Lost Girls\" Nicole Rubio Ameni Rozsa & Austin Guzman October 26, 2017 ( ) 704 4.88[9]\n\nAt Olivia's door Fitz asks her to help him with a project to find missing girls. She tells him to contact QPA— where they find trouble in identifying the poster girl for the missing girls. They later have one of the missing girls' mother start making public statements. Cyrus debates what to do with the painting from Fenton Glackland, prompting him to return it. With his concern over Olivia's power hunger, Rowan warns her that she can't have it all. At a summit, the prime minister of Dacal isn't willing to work with Mellie or Rashad. Mellie and Rashad have a drink together in the oval and have a romantic connection.—arousing Olivia's concerns. Bashran is taken in coup, stripping off Rashad's presidency. Jake tells Olivia that she needs to choose whether or not she is Command. Mellie wants to send in troops to Bashran to help Rashad, but Olivia is against it. Jake gives Olivia information on what Rowan has been up to.\n\n111 5 \"Adventures in Babysitting\" Oliver Bokelberg Serveriano Canales & Tia Napolitano November 2, 2017 ( ) 705 4.89[10]\n\nOlivia and Mellie push their power like never before, coming up with a plan to pit both Bashran rebel groups against each other. Before that can be enacted Fitz reveals to Mellie that Olivia is command and that she killed vice president Luna Vargas. Despite the revelation, Mellie goes along with Olivia's plan in hopes of restoring peace with Bashran. Mellie demands that Fitz go back to Vermont, but he refuses. Cyrus works on a congressional approval to declare war in Bashran as QPA keeps a close watch on President Rashad’s niece, Yasmeen. Yasmeen and Rashad board a plane to return to Bashran, but before it can takeoff the plane explodes.\n\n112 6 \"Vampires and Bloodsuckers\" Jann Turner Chris Van Dusen & Tia Napolitano November 9, 2017 ( ) 706 5.00[11]\n\nOlivia inform Mellie of Rashad's death, and she immediately wants to send troops into Bashran. Glackland and Cyrus have brunch while Glackland pressures Cyrus for information on what's going on in the White House. Quinn gets ready for her wedding and then meets with Olivia and accuses her of being behind Rashad's death. Huck fusses over Quinn and Charlie's wedding as he is both best man and maid of honor. Meanwhile, Quinn is missing and Olivia is worried that Quinn is going to tell that Olivia is behind Rashad's death. Charlie insists that Quinn didn't get cold feet so QPA starts looking for her. Olivia and Jake work to throw off QPA's search for Quinn by planning to blame it on Glackland. Charlie, convinced that Glackland has Quinn, captures and tortures him, but Huck stops him before he can cut off Glackland's arm. Mellie calls the new regime in Bashran and tells them that America will work with them for peace, under Mellie's terms. Jake and Olivia look at footage of Quinn arriving to her wedding, meaning that she didn't bail to build a case against Olivia, but that she was kidnapped.\n\nAt dinner Rowan reveals to Olivia that he has Quinn, and wants to exchange Quinn's life for his freedom and dinosaur bones. Marcus tries to convince Mellie to work with Fitz's foundation on mass incarceration. During a dispute with his daughter, Rowan leaves his living room and gun shots are heard, leaving Olivia to believe Quinn is dead.\n\n114 8 \"Robin\" Daryn Okada Juan Carlos Fernandez January 18, 2018 ( ) 709 5.17[13]\n\nRowan has a body in a car which he burns. He calls the police to report a fire. QPA and Olivia gets word of Quinn's death. Her DNA was found in a tooth from the car fire, along with a burned piece of her wedding dress. Charlie wants to have Quinn cremated and packed into bullet cases. Huck reads through the coroner's report and finds out about the hairpin from the Smithsonian Olivia gave Quinn. Fitz comes to Olivia's apartment to offer his condolences, but Olivia pushes him off, telling him that they aren't friends. Glackland breaks up with Cyrus thinking that Charlie was Cyrus' hitman. Meanwhile, The gladiators say goodbye to Quinn as each of them says something about Quinn and then fires one of her bullets into the ground. Emotional and still drunk, Olivia goes to Fitz's apartment and they have sex. David and Abby rid Charlie's apartment of baby stuff where they find a hidden flashdrive. Charlie arrives at Rowan's door to ask to be reinstated as a B613 agent when he hears a baby crying. He runs up to the second floor of Rowan's house to find a baby girl, he then starts choking Rowan.\n\n115 9 \"Good People\" Nzingha Stewart Shonda Rhimes, Jess Brownell & Nicholas Nardini January 25, 2018 ( ) 708 5.19[14]\n\nThis episode is a flashback to the events that occurred from Quinn's point of view from her abduction to the end of episode 8 where Charlie discovers the baby girl in Rowan's home. Rowan goes to a store to buy a suitcase and makes a friend in one of the employees, Marvin. He kidnaps Quinn from the QPA elevator and puts her in his basement. He goes to dinner with Olivia and says he will trade Quinn for his dinosaur bones, but she declines. Rowan heads to the store and buys a crib, again making conversation with Marvin. They meet in a pub where they have dinner, and Marvin offers Rowan his employee discount. Meanwhile, down in the basement Quinn hallucinates that her colleagues are talking to her. Rowan uses Marvin's employee discount to buy a gun, making it registered in Marvin's name. Olivia arrives at Rowan's home and he barters Quinn for his bones again; overhearing the dispute, Quinn also hears Olivia choose her power over saving Quinn.\n\n116 10 \"The People v. Olivia Pope\" Kerry Washington Ameni Rozsa February 1, 2018 ( ) 710 5.62[15]\n\nA distraught Olivia spends the night with Fitz and leads to her agreeing to go with him to Vermont. Once there, she discovers her closest friends are there as well. Olivia is confronted on her role in Quinn and Rashad's deaths. She locks herself in a bedroom as her friends each provide evidence and reasoning why she should step down from her role, offering her an out if she agrees to give up B613. Olivia provides a single-paged statement of resignation from her Chief of Staff role in the White House and alludes to Jake being placed in control of shutting down B613. The crew fly back to Washington and watch the evening's televised press brief for Olivia's formal resignation statement.\n\n117 11 \"Army of One\" Allison Liddi-Brown Austin Guzman February 8, 2018 ( ) 711 4.63[16]\n\nOlivia confronts Mellie on her decision to name Jake as her new Chief of Staff; Mellie tells Olivia that she must step down and resign, or be publicly terminated. QPA gains a new client, a government employee being accused of treason with Russian entities. The crew discovers he is in an affair with Jake's wife upon Olivia leaking the information to the media. Cyrus gives Mellie and Jake a way to frame Olivia and spin her media story, but backstabs them when he provides Olivia with the documents proving the President's media coverup—offering her the papers to bring down the Mellie presidency during her scheduled resignation announcenent, but instead brings this information to light with Mellie as she is preparing for the first Presidential Mammogram. Quinn bargains with Rowan for her freedom in exchange for not going after Olivia. Olivia returns home where Quinn shows herself and holds her at gunpoint. Olivia warns Quinn of snipers and continuing to not believe the threat, Olivia is shot in the arm attempting to protect Quinn. Olivia gives her speech at a press conference, initially planning to use the files from Cyrus but instead giving her resignation. Charlie, Quinn, Robin, Huck and Abby reunite.\n\n118 12 \"Allow Me to Reintroduce Myself\" Tony Goldwyn Raamla Mohamed March 1, 2018 ( ) 712 4.95[17]\n\nAfter her dismissal from the White House, Olivia serves as a guest lecturer at a local university. Annalise Keating, a defense attorney, asks for her help with her class action. At first, Olivia turns down the offer due to the questionable reputation of Annalise, but softens up shortly after. The duo get in touch with Fitz in order to gain mileage. Meanwhile, Mellie and Jake try their best to postpone if not sabotage the case through QPA, leaking the reason Olivia lost her post as Chief of Staff. With everything seeming to hit a dead end, Olivia and Annalise decide to work by themselves without any help from the White House. After watching a televised interview of Olivia and Annalise, Quinn has a change of heart, offering the \"dirt\" she has on Justice Spivey and prompting her to persuade (possibly blackmail) the judge into changing his vote. The class action suit is added to the court docket, much to Mellie's dismay. This episode begins a crossover event that concludes on How to Get Away with Murder season 4 episode 13.\n\n119 13 \"Air Force Two\" Valerie Weiss Severiano Canales March 8, 2018 ( ) 713 4.67[18]\n\nDavid and Cyrus are on a plane to the Summit when it gets hacked. One of the White House staffers admits that her laptop was stolen and that she accidentally brought the malware onto the plane. Finding a way to get Wi-Fi on the plane, David sends a message to QPA asking for help. Olivia visits Maya, and attempts to celebrate her birthday. Mellie is faced with the decision of whether or not to shoot down the plane per protocol. She is worried that Jake is acting based on his hate of Cyrus. Much to Olivia's dismay, her visit with Maya doesn't bring her any closer to her. As a birthday present, Olivia gets Maya out of jail and givers her a trench coat and a plane ticket to France, as well as enough money to live off of. QPA figures out a way to save the plane. After getting off the plane David goes to Abby, who thought he was going to propose to her. He then tells her he isn't because he knows her and he knows that marriage would make her unhappy.\n\n120 14 \"The List\" Greg Evans Jess Brownell & Juan Carlos Fernandez March 15, 2018 ( ) 714 4.74[19]\n\nA man shows up asking Olivia to help him find his missing daughter Alisha, who idolizes Olivia. Alisha, a congressional intern, who found herself on a list of interns that won't sleep with congressman. Because of her placement on the list she wouldn't be able to get a job. Her father blames Olivia for inspiring her to work in D.C., accusing her of sleeping her way to the top. Olivia finds Alisha's housemate, who did sleep with a congressman, and got a job because of it. Olivia convinces her to give a press conference exposing the congressman responsible. In light of Olivia's case, Mellie plans to introduce legislation addressing sexual harassment. Jake expresses a romantic interest in Mellie, but she turns him down. Fitz asks Olivia if she thinks that he crossed the line when they first got together, and she responds that they both crossed the line together. QPA looks into who hijacked the plane, trying to find evidence that Cyrus is responsible. But when Quinn finds out that Olivia was the one who asked Abby to look into Cyrus she orders QPA to stop investigating. The FBI arrest Charlie for the hijacking, leading QPA to believe that he is being framed.\n\n121 15 \"The Noise\" Darby Stanchfield Raamla Mohamed & Jeremy Gordon March 29, 2018 ( ) 715 3.71[20]\n\nCharlie is taken into custody by the FBI; Lonnie Mencken tries to persuade him to sign a confession to frame Mellie as the mastermind behind the hijacking of Air Force Two—getting immunity in exchange of his corporation—but he brushes him off. QPA with Fitz's help, try to expedite a solution to have Charlie released. Cyrus tries to blackmail Quinn to convince Charlie into signing the deal but Olivia thinks that it may be a bad idea that might destroy Mellie's presidency. Quinn later declines Cyrus' offer. Fitz tries to warn Mellie on Cyrus' plans but she does not believe him. Cyrus makes an ally out of Jake by promising a position once he takes over the presidency. Jake manages to convince Charlie to sign the confession, putting Mellie in the center of the scandal by threatening to harm his family. Mellie is issued with a subpoena, realizing that Cyrus must have framed her. Mellie pleads Jake for help in silencing Cyrus but he flatly refuses, confirming his allegiance to Cyrus. Mellie reinstates Olivia as command and orders her to have Cyrus killed.\n\n122 16 \"People Like Me\" Joe Morton Chris Van Dusen April 5, 2018 ( ) 716 3.83[21]\n\nOlivia, reluctant to kill Cyrus, devises a plan to either convince Cyrus to drop his evil plans against Mellie or kill him if the other plan fails. Huck gravely against the first plan tries to convince Olivia to use some other avenue. The scandal has Mellie in tremendous stress with her approval rating dropping drastically. Abby and Quinn try to find the hacker who Cyrus has been sending information to—who is found murdered. This leaves Olivia with the option of poisoning Cyrus with cyanide and a perfect cover-up for the murder. On the verge of taking a sip of the poisoned wine, Jake comes to Cyrus' rescue. Marcus tries to persuade Mellie to address the rumors head on. She later addresses a press briefing refuting the claims that she had an hand in Air Force Two hijacking. Olivia visits Fitz's apartment and they have sex. Vanessa discovers that her husband is in cahoots with Cyrus; he kills her thereafter. Cyrus and Jake restructure their alliance.\n\n123 17 \"Standing in the Sun\" Jann Turner Mark Fish & Matt Byrne April 12, 2018 ( ) 717 4.15[22]\n\nTension is rising in the midst of the developments in Cyrus and Jake's mission to take the White House. Mellie is summoned to testify to the scandalous Air Force Two hijacking. She initially denies any involvement in the hijacking but information on the death of president Rashad, forces her to plead the fifth. In despair, Jake tries to blackmail Olivia into throwing Mellie under the bus—she ends up exposing the existence of B613 to Lonnie Mencken. QPA also seems to have hit a dead end in trying to figure out the way to bring Jake and Cyrus down, only to find they will end up incriminating themselves in the process. Sally Langston comes to their aid by breaking to the nation, through her televised show, on the existence of top secret organization, B613—a consequence that puts Cyrus and Jake's plans in jeopardy.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/10/Scandal_season_7_poster.jpg/220px-Scandal_season_7_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/1/10/Scandal_season_7_poster.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/42px-Ambox_current_red.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/10/Scandal_season_7_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Scandal_(season_7)", "title": "Scandal (season 7)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/10/Scandal_season_7_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}