{"url": "www.theguardian.com/film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death", "text": "Rachel Weisz stands in the doorway of a cafe in downtown New York, adjusting to the gloom from the brightness outside. We are in the East Village, a formerly bohemian part of town long since gentrified, although, as I note to her as she sits down, the park at the end of the street still seems to host a few local eccentrics. “Yes,” she smiles, fishing in her bag for her glasses. “It’s not all bankers.” The 47-year-old lives around the corner and, in spite of her wealth, fame and marriage to Daniel Craig, gives the impression of living a life somewhat in line with the low-maintenance neighbourhood. This morning, Weisz dropped off Henry, her 10-year‑old son, at school, went to yoga, caught up on emails, and tonight she is taking Henry to the theatre. She is trying to get people together on Sunday for a roast dinner.\n\nIt’s hard for me to understand how Donald Trump happened. It’s surrealist\n\nI mention all this because Weisz is a serious person and an interesting actor who has almost no tolerance for the indignities of fame. Her own celebrity is bad enough, but my God, to be married to James Bond – the mortifying excess of it! – and her reserve in the face of what she considers lascivious interest has often presented, over the years, as diffidence. There is not much of that in evidence today; she is sunny and sociable, unrecognised by all but the staff at the cafe, and bearing little relation to the creepy terms in which British newspapers have, for 20 years, been describing her (a “starlet”, a “siren” and, of course, an “English rose”). In a floral print dress and sensible shoes, she looks like everyone else in the cafe, which is to say, someone who has only glanced in the mirror before leaving the house.\n\nI realise I am being a killjoy with this, but there is a particularly trouser-rubbing tone to much of the coverage of Weisz that her near contemporaries – Kate Winslet, Kate Beckinsale – don’t suffer to quite the same degree, and that has to do with an idea that her looks are “unusual”. The one startling thing about Weisz’s appearance today is that, without much in the way of cosmetics, she looks easily 10 years younger than she is. At an age when a female movie star’s options are expected to dwindle, Weisz is having the best decade of her career, starting in 2006 with her Oscar for best supporting actor in The Constant Gardener and leading up to Denial, in which she played Deborah Lipstadt, the Holocaust historian who was unsuccessfully sued for libel by David Irving. A few years ago, Weisz bought the rights to Naomi Alderman’s novel Disobedience – the story of a lapsed orthodox Jewish woman returning from her life in New York to her native north London – which is about to go into post-production, and she is soon to appear in My Cousin Rachel, an adaptation of the Daphne du Maurier novel.\n\nMy Cousin Rachel is something of a Rorschach test, for viewers as for Weisz herself, who had to decide if her character was primarily a victim or a villain before playing the role. It is the story of a glamorous widow who returns from Italy to Cornwall and transfixes the young heir to her late husband’s estate, whereupon her motives fall into question. The movie tries, successfully, to keep all interpretations open, as does Weisz. “I can’t tell you,” she says as to whether she perceived the character to be a gold digger who conned a young man out of his fortune, or a woman unfairly maligned. “I think it would ruin it. I completely decided, and I’ve only met two people who have seen it other than you, and one of them was adamant and said, ‘Oh, she definitely did it.’ And the other said not.”\n\nFacebook Twitter Pinterest Rachel Weisz with Sam Claflin in her new film, My Cousin Rachel. Photograph: Nicola Dove\n\nIt is my hunch that Weisz plays the heroine as innocent; it is more morally interesting that way, turning the character from The Woman In Black into someone more sinned against than sinning, who flushes out the biases in all who would judge her. It also plays to a guilelessness in Weisz’s style that seems vaguely rooted in her flair for absurdism. Weisz can do a better straight face than almost anyone, be that as Lipstadt, an American baffled by class subtext in the British legal system; or as the unnamed, short-sighted woman in The Lobster, Yorgos Lanthimos’s brilliant surrealist film in which her highly stylised performance relied for its comedy on a kind of aggressive earnestness, and in which she managed to look simultaneously blank and vaguely alarming.\n\nMaking Disobedience and My Cousin Rachel has meant spending long periods in London, where Weisz grew up, and where she and Craig still have a home. Weisz’s mother died several years ago and her father is 88, but for the time being, moving back to Britain full time is out of the question; Weisz and Darren Aronofsky, her former partner, are jointly raising their son in New York. (Craig has a grownup daughter from a previous marriage.) Weisz was aware, however, during those weeks back in London, that she enjoyed a level of social comfort there that she doesn’t experience in New York. She emigrated 16 years ago, and agrees that it was harder to make friends in one’s 30s than one’s 20s. “When I was in London [recently], I had Sunday lunches every weekend, lamb or chicken in the oven, people milling about. I haven’t found that here, so I’m going to start it.” The forthcoming Sunday is to be her inaugural lunch.\n\nWeisz says it was strange to be in Britain when the Brexit vote came in, although in some ways she finds Donald Trump the more puzzling phenomenon. “It’s hard for me even to understand how it happened,” she says. “It’s surrealist. But it’s finite. Trump is pretty catastrophic, and there are terrible things he can do to the Earth and women’s rights, but I feel it will be reversible, somehow. But Brexit feels like a death. It’s gone. It made me think about my parents and the reason the European Union was created in the first place, to make sure we never had a war like that ever again, to come together and get rid of our nationalism, and be one stable thing. It’s very hard.”\n\nAs an actor, you’re revealed, but it’s you threaded through the coordinates of a fiction. There’s no biographical detail\n\nBoth Weisz’s parents, who divorced in the 1980s, came to Britain as child refugees just before the second world war (her mother from Austria, her father from Hungary) and on the evidence of previous interviews, Weisz is irritated by ongoing interest in them. Now, she says, “I’m English, but my parents were refugees and I feel like, really, is that still interesting?”\n\nI wonder if questions about them strike her as a backhanded way to exoticise her origins. On the other hand, Weisz has also been thinking of her parents’ experiences lately. It’s depressing, I suggest, how the warm welcome she says they received in England is not reflected in the current political climate.\n\n“I know. I know. I have been thinking about that, in relation to all the Syrian refugees and the xenophobia now. The way they recounted things is that they were massively welcomed in different parts of England and by different communities, and really felt proud to be English, even though,” she starts laughing, “they were really not. My dad is so Hungarian.”\n\nHe still has an accent?\n\n“Oh yes.”\n\nAnd yet, she says, they were completely accepted. “And they said, look at [Oswald] Mosley, no one would go that way. That’s what I grew up being told: the English sense of moral right means it could never have happened here.”\n\nFacebook Twitter Pinterest With Colin Farrell in Yorgos Lanthimos’s The Lobster. Photograph: Canal+/Rex/Shutterstock\n\nThe most animated Weisz gets in the course of our conversation is when she is revisiting her experiences at Cambridge University. She graduated with a degree in English in the early 90s, and spent most of her 20s trying unsuccessfully to get back to the happiness of being a student performer. The idea of acting on mainstream TV, let alone in Hollywood movies, never held much appeal; as a teenager, Weisz famously turned down a role opposite Richard Gere in a movie called King David, and by university she was convinced her talents lay in more avant-garde work. “I remember this thing I once saw from Poland at the Edinburgh festival, maybe it was 1990 – it was communist-era – and it was a family, speaking Polish, so none of us could understand what they were saying. And they’d begin in a home with all their stuff around them and then a siren would go off and – this relates to my mum, I guess – suddenly the whole family would pack up their entire life and put everything into seven suitcases. It felt like a circus, juggling things. And then they’d march around the stage with this trumpet music playing, and they’d settle somewhere else and unpack their bags and start a new life, talking in Polish, and then – woo-woo-woo – the siren would go off again. It was one of the most incredible pieces of theatre that I have ever seen.”\n\nWeisz’s mother was about five when she left Austria, and her experiences echoed subtly through her daughter’s childhood. “My mum would always give me food, wherever I was going, even if I was going somewhere very briefly. I think that’s a refugee thing. A sandwich, an apple. I still tend to carry food with me, too. It’s a habit. It came in useful when I had a kid – they get low blood sugar. I would say travelling, for my mum, was not easy. I mean, she loved going to places, but the actual journey… it was not a streamlined experience for her. Packing. Packing.”\n\nWhy packing?\n\nFacebook Twitter Pinterest With her husband, James Bond actor Daniel Craig. Photograph: Rex/Shutterstock\n\n“Well, when she left Vienna, it was two weeks before the Germans arrived and they didn’t want to let people out, so you had to pretend you were going on holiday. Her mum packed however many pairs of knickers one took on holiday in 1935, to look like a two-week holiday. Probably two at that time, and you washed them. And a toy.” The shock of this move was not something her mother ever explicitly talked to her about, “but the way I built it in my mind, she ended up in very different circumstances, very poor, in Hertfordshire”.\n\nBy contrast, Weisz was raised in a prosperous household in Hampstead Garden Suburb, north London, her father an engineer and her mother by then a psychotherapist. It was strange, she says, being back in those parts to film Disobedience. “I didn’t grow up as an orthodox Jew, whereas the community in the book is very religious. They’re Haredi, so all the women wear wigs. I grew up in a very liberal Jewish household and my mum was a convert from Catholicism. But we filmed in Golders Green high street and the director of photography had grown up on the next street from me. And it was the most extraordinary thing. It felt mythological – ordinary and mythological at the same time. I remember being a child, and that’s where the ice-cream shop was where I went after school, which was very potent. But it was also nothing to do with my life.”\n\nIt is this tangential relationship to reality that Weisz likes best about her job, enabling her to self-expose under cover of drama. “I like the idea that in stories, ever since Greek tragedy, the unspeakable, the undoable, the unsayable, the taboo, the fuck-you, whatever – all those things can happen and no one gets hurt. I like fiction for that reason.”\n\nDoes that limit the extent to which she reveals herself? “I think you’re completely revealed, but it’s you threaded through the coordinates of this fiction. There’s no biographical detail to get at, but I think you’re ultimately revealed.”\n\nAutobiography is a less palatable business entirely. She has a policy of not speaking publicly about her life with Craig, whom she married in 2011, although she will concede that if one must be a famous actor who marries a more famous actor, one can’t really blame people for ogling. “Yes, my bad,” she says drily. I ask if they have even a grain of competitive spirit between them and she says: “I think that would be true if we were both women, or both men. I can’t play his roles and vice versa.”\n\nAfter Cambridge, she was confident her life in avant-garde theatre was set to continue, until the acting partner with whom she had set up a theatrical company decided to go to Rada and the thing fell apart. “We were going to apply for Arts Council funding, but suddenly it was like, ‘Oh, that’s not happening.’ And I had an agent, and things started happening in television. I was trying to do naturalistic acting. That was so weird. I remember, for one of my first jobs, I had to play a student and I thought, I don’t know how to do that, even though all I’d done in life was be a student.”\n\nWhat was it?\n\n“It was something from Scotland called The Advocate.” She rolls her eyes. “I didn’t know how to do naturalism, whatever that means.”\n\nSo she had to figure it out quickly?\n\n“Or, slowly. Yeah.”\n\nFacebook Twitter Pinterest Weisz won an Oscar in 2006 for The Constant Gardener. Photograph: Jaap Buitendijk\n\nWeisz’s father, in particular, didn’t disguise his lack of enthusiasm for her chosen career path. She has said in the past that he let it be known he didn’t think she was a good enough actor, which she laughingly concedes was very much the case early on. I ask if it is conceivable she would ever express a negative opinion about her own child’s skills the way her father did about hers.\n\n“Well, obviously my dad will read this article, so what can I say? Would I ever do that? Um. I think, if my dad was here, he would say, ‘I think Rachel appreciates my honesty. I don’t mollycoddle her and I’m honest and she can trust what I say.’ And it’s a different generation, he’s 88. Parenting – that word – it’s very different now in terms of directness, maybe.”\n\nParenting didn’t exist back then?\n\n“No. We just grew up. I think he’d say that if he gives me a compliment, I know I can believe it.” She starts laughing. “He says this thing – you know the expression, ‘Well, to tell you the truth.’ And my dad always says, ‘You were lying before?’”\n\nWould she repeat that honest approach with her son? There is a long pause. “I think one can think whatever one wants,” she says, “but one can’t say whatever one wants.”\n\nAfter making The Mummy, a big hit in 1999, Weisz ricocheted between splashy but forgettable films (Enemy At The Gates, Runaway Jury) and smaller, more resonant ones. She was great in the adaptation of Nick Hornby’s About A Boy, and appeared in The Fountain, a magical realist romantic drama, with Hugh Jackman, under the direction of her then partner, Aronofsky. She recently made another film with Lobster director Lanthimos, The Favourite, a period drama starring Olivia Colman as Queen Anne, who reigned until 1714 and was the last Stuart monarch. Weisz plays Sarah Churchill, one of the queen’s advisers. It is striking that if a project interests her, she will forgo the lead and take a smaller, ensemble part.\n\nFacebook Twitter Pinterest As Holocaust historian Deborah Lipstadt in Denial. Photograph: AP\n\nThis was not the case in Denial, which was very much Weisz’s movie. During preproduction, she and Lipstadt bonded over the discovery that the Reverend James Parkes, the man who helped Weisz’s mother’s family come to England, was a theologian Lipstadt had studied in college. Her mother died of cancer, at the age of 83, before Denial was released, but her father thought it was an important film. “A friend of my dad’s wife made a documentary about my dad going back to the flat where he used to live [in Hungary], and being let in and walking around. They’re offices now, there were secretaries sitting there. And he said, ‘This is my bedroom.’ They went to the playground where he used to play.”\n\nAs she gets older, Weisz sees that securing the kinds of roles she wants necessitates her involvement at an earlier stage in the process. She is robustly feminist; when she thinks about history – the second world war, women’s enfranchisement – it seems to her we all have very short memories. “That’s how I feel about when women got the vote. Guys, we’ve only had a second.” But she is also critical of the vapid form so much feminist commentary takes. “I was thinking about that expression ‘women in film’,” she says, “as if we’re outliers. Giraffes in film! Or pandas in film!” Meanwhile, she is especially proud of Disobedience, because, “I produced that and made that happen. I bought the rights for the book three years ago. It didn’t land at my door. I really loved that experience of working with the writer. Now I’m watching edits and it’s using a different muscle from acting.”\n\nThe play she is taking her son to see tonight is Sweeney Todd, which “he’s very excited about”, she says, “because apparently they give out real pies”. Beyond that, she is hanging out in the neighbourhood, enjoying downtime between projects while awaiting the release of My Cousin Rachel. That it is a quiet film, slow-paced like a novel and part of what feels like a mini Du Maurier renaissance, isn’t unusual for Weisz, but it does feel singular to the extent that the audience never gets closure on who the heroine is. “People are going to bring their own interpretations,” she says. “She’s a bit of a mystery, right?”\n\n• My Cousin Rachel is on general release.", "images": ["https://i.guim.co.uk/img/media/2c303c64767f2e9f0ea6ac5b613fe503dff17603/0_0_3492_2095/master/3492.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=28105aa4187d3381b475cd3fbb82c6f6", "https://i.guim.co.uk/img/media/7f1d3a3db750e1073bc3ca70a4c53b183dd38947/0_1188_4912_6140/master/4912.jpg?width=300&quality=85&auto=format&fit=max&s=4b0b3d6fb65c7e7ee441217b3cd23cca", "https://i.guim.co.uk/img/media/2c303c64767f2e9f0ea6ac5b613fe503dff17603/0_0_3492_2270/master/3492.jpg?width=300&quality=85&auto=format&fit=max&s=39a7ec2ede92329c22199025aa6ec6b5", "https://i.guim.co.uk/img/media/bd59e79bf87b1c847a723a7c0bf8fc1277269e0f/0_0_1258_1858/master/1258.jpg?width=300&quality=85&auto=format&fit=max&s=954790b0b47c51b441b0738d24b5db73", "https://i.guim.co.uk/img/media/736734266c38cd29002f11bfe7168cb5b0e3c389/0_116_5997_3598/master/5997.jpg?width=300&quality=85&auto=format&fit=max&s=000c50147d6f9f1039c2736f79f3855f", "https://i.guim.co.uk/img/uploads/2017/10/06/Emma-Brockes,-L.png?width=300&quality=85&auto=format&fit=max&s=4e2c40add2a970d393dcf67bab141ff4", "http://phar.gu-web.net/count/pvg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Rachel+Weisz%2CFilm%2CDenial%2CDaniel+Craig%2CBrexit%2CRefugees%2CDonald+Trump%2CThe+Lobster%2CCulture%2CDisobedience", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/67ea4b1890763e18bc5f6a5e1e027b2ffb819a88/0_0_3536_2344/master/3536.jpg?width=300&quality=85&auto=format&fit=max&s=13d1c24d2d79c3c31f16ad651a39f87e", "https://i.guim.co.uk/img/media/d43becbc827f33108d9c27ab5cf156033d7df526/275_28_1845_1930/master/1845.jpg?width=300&quality=85&auto=format&fit=max&s=39ddb8e149e70b722ad67fbcda822862"], "top_img": "https://i.guim.co.uk/img/media/2c303c64767f2e9f0ea6ac5b613fe503dff17603/0_0_3492_2095/master/3492.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=28105aa4187d3381b475cd3fbb82c6f6", "keywords": [], "authors": ["Emma Brockes"], "canonical_link": "https://www.theguardian.com/film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death", "title": "Rachel Weisz: 'My parents were refugees. Brexit feels like a death'", "meta_data": {"description": "In her most successful decade, the actor talks family, ‘surrealist’ politics and the perils of marrying James Bond", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Emma Brockes", "thumbnail": "https://i.guim.co.uk/img/media/2c303c64767f2e9f0ea6ac5b613fe503dff17603/0_0_3492_2095/master/3492.jpg?width=620&quality=85&auto=format&fit=max&s=e1199ef8850b817e9255153dd484e2c3", "keywords": "Rachel Weisz,Film,Denial,Daniel Craig,Brexit,Refugees,Donald Trump,The Lobster,Culture,Disobedience", "news_keywords": "Rachel Weisz,Film,Denial,Daniel Craig,Brexit,Refugees,Donald Trump,The Lobster,Culture,Disobedience", "og": {"url": "http://www.theguardian.com/film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death", "image": "https://i.guim.co.uk/img/media/2c303c64767f2e9f0ea6ac5b613fe503dff17603/0_0_3492_2095/master/3492.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=28105aa4187d3381b475cd3fbb82c6f6", "description": "In her most successful decade, the actor talks family, ‘surrealist’ politics and the perils of marrying James Bond", "type": "article", "title": "Rachel Weisz: 'My parents were refugees. Brexit feels like a death'", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/emmabrockes", "publisher": "https://www.facebook.com/theguardian", "section": "Film", "published_time": "2017-06-10T08:00:20.000Z", "tag": "Rachel Weisz,Film,Denial,Daniel Craig,Brexit,Refugees,Donald Trump,The Lobster,Culture,Disobedience", "modified_time": "2020-02-03T12:17:27.000Z"}, "al": {"ios": {"url": "gnmguardian://film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death", "iphone": "gnmguardian://film/2017/jun/10/rachel-weisz-my-parents-were-refugees-brexit-feels-like-a-death?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/2c303c64767f2e9f0ea6ac5b613fe503dff17603/0_0_3492_2095/master/3492.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=369fd133ff281bcac20c5d854a44e350", "site": "@guardian", "card": "summary_large_image", "creator": "@emmabrockes", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1497024000.0, "source": "http://www.theguardian.com", "summary": ""}