{"url": "https://www.politico.com/story/2018/01/29/trump-state-of-the-union-2018-time-date-details-374477", "text": "President Donald Trump has invited 15 special guests, ranging from workers and business owners who have benefited from the economy to parents of gang-violence victims, military members, public servants and volunteers. | Getty Images Everything you need to know: Trump’s 2018 State of the Union address\n\nWhen and what time is Trump delivering the 2018 State of the Union?\n\nPresident Donald Trump will deliver his first formal State of the Union address at 9 p.m. Eastern time on Tuesday, Jan. 30, before a joint session of Congress. Speaker Paul Ryan (R-Wis.) presides in the House chamber of the U.S. Capitol, with Vice President Mike Pence beside him in his constitutional role as president of the Senate. Congress, Supreme Court justices, the Joint Chiefs of Staff and all but one of the president’s Cabinet members — the so-called designated survivor — will attend.\n\nAdvertisement\n\nHow can I watch this year’s SOTU? What channel is it on?\n\nAll major networks and cable news channels will broadcast the speech live. The White House will stream it live on its site, as will news networks through Facebook. The livestream will also be available on POLITICO here.\n\nHow long is the speech?\n\nThe State of the Union has no set length. President Bill Clinton holds the record for the longest address, lasting 89 minutes, and President Ronald Reagan the shortest — roughly 31 minutes — according to The American Presidency Project . Trump’s joint address to Congress last year, which was not an actual State of the Union, was about an hour.\n\nWhat topics will Trump cover?\n\nThe White House announced last week that the president would release his complete immigration policy “ framework ” before the State of the Union, so this will almost certainly be a centerpiece. According to a White House official , Trump’s speech will be one of unity as he tries to appeal to a fiercely divided Congress.\n\nTrump will also take a page from his speech on Friday at the World Economic Forum in Davos, Switzerland, and talk about strong economic growth in the U.S., as well as the benefits of the recently enacted tax changes and an America-first trade policy. In view of the recent nuclear threats from North Korea, the Republican leader will highlight a national security policy of “peace through strength,” the White House official said. He also plans to use the opportunity to reveal the details of his long-awaited infrastructure plan .\n\nOf course, the president has demonstrated considerable unpredictability in his first year in office, straying from scripted speeches and creating headaches for his staff. So whether he’ll deviate on Tuesday remains to be seen.\n\nWhat issues are on the minds of voters?\n\nBesides immigration, border security, infrastructure and tax changes, voters may want the president to outline some sort of plan for health care. And while there is great interest in recent reports of Trump’s unsuccessful order that special counsel Robert Mueller be fired last year, it’s hard to imagine the president would use the State of the Union to address such a legally fraught subject or talk about the Russia investigation at all.\n\nHow will the midterm elections feature in the address?\n\nWith the fall 2018 elections fast approaching, lawmakers have a narrow window for swaying voters. Polls show an overall advantage for Democratic candidates over Republicans, who now control both chambers of Congress. Democrats who boycott the president’s address could face praise or backlash from their constituents, possibly affecting election results this fall.\n\nWho's on the guest list for the State of the Union?\n\nThe president and first lady Melania Trump have invited 15 special guests , ranging from workers and business owners who have benefited from the economy, to parents of gang-violence victims, to military members and public servants, to volunteers.\n\nHouse Minority Leader Nancy Pelosi (D-Calif.), several Democratic senators and more than two dozen House members, including Reps. Gerry Connelly of Virginia and David Price of North Carolina, will bring DACA recipients and other undocumented immigrants to the address. Sen. Kirsten Gillibrand (D-N.Y.) tweeted on Monday she was bringing San Juan Mayor Carmen Yulin Cruz , who condemned Trump’s visit to Puerto Rico following Hurricane Maria in October. Also on Monday, Sen. Elizabeth Warren (D-Mass.) announced that she would bring Brockton City Councilor-At-Large Jean Bradley Derenoncourt, the first Haitian-American man to win election to a public office in Massachusetts.\n\nWho’s not coming?\n\nSeveral House Democrats announced they would not attend , including Reps. Earl Blumenauer (D-Ore.), Pramila Jayapal (D-Wash.), John Lewis (D-Ga.), Jan Schakowsky, (D-Ill.), Maxine Waters (D-Calif.) and Frederica Wilson (D-Fla.). Reps. Jayapal, Lewis, Waters, and Wilson decided to skip it after Trump’s incendiary comments on Haiti and other African countries. Blumenauer will instead send a a DACA recipient, a so-called Dreamer, in his place to “remind Trump that these are real people with families and jobs, who are vital to our communities.” Schakowsky, who is also boycotting because of president’s comments, said in a statement , “The American people have been subjected to a year of racist, erratic, and divisive behavior from their Commander in Chief, and I refuse to accept that as the new normal.”\n\nWho is the designated survivor?\n\nThe White House announced Agriculture Secretary Sonny Perdue as the designated survivor on Tuesday evening, just hours before the president's address. Perdue has traveled to more than 30 states since his confirmation last April, addressing the concerns of farmers and rural Americans.\n\nWhere is Trump going after the State of the Union?\n\nThe president is expected to tour the country and give several speeches along the way. The plans are still being finalized, according to officials.\n\nWho’s delivering the Democratic response?\n\nRep. Joe Kennedy (D-Mass.) will deliver the response. Some of his viral speeches criticizing GOP tactics and Trump’s response to the white nationalist rally in Charlottesville have garnered millions of views.\n\nAs the grandson of Robert F. Kennedy, he is viewed as having star potential and is a member of a younger wave of Democrats. The response will be Kennedy’s first chance to shine at the national level. Previous opposition-party responses have been viewed with mixed success and could provide memorable moments, like Sen. Marco Rubio’s (R-Fla.) need for water during his 2013 response to President Barack Obama.\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://static.politico.com/f9/5d/cfb485b8403fa25083e6fd499aba/180125-donald-trump-ap-1160.jpg", "https://static.politico.com/dims4/default/b2d90f0/2147483647/resize/1160x%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ff9%2F5d%2Fcfb485b8403fa25083e6fd499aba%2F180125-donald-trump-ap-1160.jpg"], "top_img": "https://static.politico.com/f9/5d/cfb485b8403fa25083e6fd499aba/180125-donald-trump-ap-1160.jpg", "keywords": [], "authors": ["Elizabeth Castillo", "Ayanna Alexander"], "canonical_link": "https://www.politico.com/story/2018/01/29/trump-state-of-the-union-2018-time-date-details-374477", "title": "Everything you need to know: Trump’s 2018 State of the Union address", "meta_data": {"article": {"opinion": "false"}, "og": {"title": "Everything you need to know: Trump’s 2018 State of the Union address", "description": "The White House said the president would release his complete immigration policy &quot;framework&quot; before the State of the Union.", "type": "article", "url": "http://politi.co/2nlWtOY", "image": "https://static.politico.com/f9/5d/cfb485b8403fa25083e6fd499aba/180125-donald-trump-ap-1160.jpg", "fb_appid": 114037015331397, "site_name": "POLITICO"}, "description": "The White House said the president would release his complete immigration policy &quot;framework&quot; before the State of the Union.", "viewport": "width=device-width, initial-scale=1", "theme-color": "#dc0228", "fb": {"pages": 62317591679}, "twitter": {"card": "summary_large_image", "site": "@politico", "creator": "@politico"}, "host": "www.politico.com", "build": "release/cge-ghana c9cdd63 2020-04-15T19:31:28Z"}, "movies": [], "publish_date": 1517155200.0, "source": "https://www.politico.com", "summary": ""}