{"url": "http://x-files.wikia.com/wiki/Jackson_Van_De_Kamp", "text": "For other uses of the name William, see William (disambiguation).\n\nJackson Van De Kamp was born William Scully [1] the son of Dana Scully. He was long thought, for 17 years, to be the biological child of Fox Mulder. However, in the series finale, the Cigarette Smoking Man claimed to be his biological father and \"creator\" (TXF: “My Struggle III”). While this seems definitive, all the characters are given is the Cigarette Smoking Man's word, and due to the convoluted nature of the mythology arc, there is as much evidence that negates this supposed truth as supports it. In the context of the whole series, it seems more realistic, that the Cigarette Smoking Man's experiments on William before his birth might have been derived from whatever he did with Jeffrey Spender and maybe what he learned when he tried to transfer Mulder's immunity on himself. (TXF: \"The Sixth Extinction II: Amor Fati”). The experiments with William were more related to super-soldiers (USS Valor Victory), an attempt for the aliens to turn William into one of their own. (TXF: \"Nothing Important Happened Today II\", \"Trust No 1\", \"William\", \"The Truth\").\n\nIn 2000, the Cigarette Smoking Man took Scully on a road trip (TXF: \"En Ami\"). He claims that during this time he impregnated her using alien DNA in order to create the first superhuman child, who was William (TXF: \"My Struggle III\"). This was done without her knowledge or consent.\n\nIn 2002, Scully gave William up for adoption, following multiple attempts to kidnap or kill him. He was adopted by the Van De Kamps and renamed Jackson. (TXF: \"William\").\n\nContents show]\n\nHistory\n\nMiraculous Conception\n\nGiven the character of Dana Scully's health and infertility after her abduction it is apparent that William Scully's conception was in some sense of the word, a miracle. It was implied on numerous occasions that perhaps William was a gift from a divine creator in more than the usual sense, but this was all merely speculation and circumstance. There was also the suggestion that the child was created by scientists for a purpose of some kind. It is somewhat more highly implied however that Dana Scully and Fox Mulder simply had good fortune in conceiving their son, as indicated to Mulder by the character of Lizzy in Essence -\"One could only hope to create that in a lab. A perfect human child.\"\n\nOva from an infertile mother\n\nPrior to William's conception, his mother was announced as being infertile. (TXF: \"Christmas Carol\")\n\nConsequently, it is not entirely clear how William came to be.\n\nLike Emily before him, William may have been created from ova extracted from his mother during her abduction in August 1994. (TXF: \"Emily\", \"Per Manum\", \"Memento Mori\") It was this procedure that left Dana Scully infertile and it also caused her to later develop cancer that ultimately went into remission. The ova, which were originally to be used for hybridization, were taken to the Lombard Research Facility, a government laboratory monitored by clone hybrids created from other abductees' ova, which were also stored there. (TXF: \"Memento Mori\") In 1997, Mulder recovered Scully's ova from the facility and took them directly to a specialist doctor who determined that they could no longer be used. (TXF: \"Memento Mori\", \"Per Manum\")\n\nAfter Mulder eventually revealed the story behind the missing ova to Scully, she decided that she wanted a second opinion on whether or not they were viable and took them to her gynecologist, Dr. James Parenti, who told her that there was a good chance she could become pregnant using artificial insemination if begun immediately. Even though the doctor offered her genetic counseling on finding an anonymous donor Scully refused stating that she had someone else in mind, it was at Scully's offer that Mulder became involved. (TXF: \"Per Manum\") The initial procedure was a failure. It was not until shortly after Mulder's abduction in 2000 that Scully discovered she was indeed pregnant. (TXF: \"Per Manum\", \"Requiem\")\n\n\"Trust No 1\" raises a possibility of Scully and Mulder had slept together at least once after Scully invited Mulder to her bed as she was lonely one night. However, it is not confirmed that Mulder accepted the offer nor whether their arrangement of sleeping together was sexual or platonic, though it is true that they had established that they both held romantic feelings toward each other by this point. Similarly, although the trailer of the episode \"all things\" shows Scully preparing herself in a bathroom before leaving his apartment while a sleeping Mulder lies in his bed (at least partially undressed), the events leading up to this moment are not revealed, so it is unknown whether the couple consummated their relationship prior to this scene and whether the suggestion, in \"Trust No 1\", that they slept together refers to this event. Gillian Anderson, the writer of \"all things\" and the actress who portrayed Scully, confirmed in an interview at the New York comic con that she did intend for the episode to imply the Mulder and Scully had consummated their relationship. It is interesting, however, to note that in Trust No 1 it is said that Scully invited Mulder into 'her' bed. This indicates that either Mulder and Scully did not consummate their relationship in \"all things\" (in which the scene opens in Mulder's apartment), or that they consummated their relationship on numerous occasions.\n\nAs she and Mulder would ultimately learn, Dr. Parenti was contributing towards experiments to create babies that seemed alien but were actually other clone hybrids; the experiments were part of an effort to ensure humanity's survival of imminent alien colonization and had originally been initiated under orders from the Syndicate, a group that had been destroyed by the aliens in 1999. (TXF: \"Essence\", \"One Son\")\n\nIn an apparent continuity error, Season 5's \"Emily\" and Season 8's \"Per Manum\" both show Scully learning about Mulder's discovery of her ova. In \"Emily\", he reveals this information to a man at the San Diego Hall of Justice who is judging Scully's appeal for parental rights to Emily Sim as Scully sits nearby, overhearing Mulder. \"Per Manum\" features flashbacks to a period circa 2000 when Mulder admits the news to Scully while the two are alone together.\n\nOther Theories\n\nSupernatural Beliefs\n\nShortly before baby William's birth, several other theories were suggested to explain his puzzling conception. Alien super-soldiers, who had recently learned of the child's existence and considered it a threat, as well as Alex Krycek and those who were involved in conducting the hybridization experiments, believed that the unborn baby was a perfect human child but with no human frailties, extremely special due to its miraculous conception. (TXF: \"Essence\") However, the super-soldiers realized this theory was 'apparently' unfounded soon after the child was born. (TXF: \"Existence\")\n\nA cult leader known as Josepho who worshipped the aliens later came to the belief that William had been born to fulfill his prophesied role as a future savior to the aliens and would do so, if his father was killed. Josepho also believed that William was coveted by forces of both good and evil and that, if his father was not killed, William would try to stop the aliens' return, like his father before him. (TXF: \"Providence\")\n\nThe aliens may have also believed this. It is said that Josepho, who considered the aliens to be a heavenly power, was informed of the prophecy by \"God\".\n\nSuper-soldier Theory\n\nKnowle Rohrer, a super-soldier posing as a human intelligence operative, told Special Agent John Doggett, who had been assigned to the X-Files in 2000, that the baby was actually the first \"organic\" super-soldier, created as the result of a government cloning experiment to try to create a super-soldier. (TXF: \"Existence\", \"Nothing Important Happened Today\") This claim was later supported by Jeffrey Spender, Mulder's biologically related brother, when he claimed to Scully that the alien conspiracy had used her to create William, and by super-soldier Shannon McMahon, who told Scully and her associates several pieces of information about the government's secret program to create super-soldiers. (TXF: \"William\", \"Nothing Important Happened Today II\") According to Shannon McMahon, the government program had recently been successful in giving birth to a super-soldier from \"a mutated egg\".\n\nMcMahon's information led Scully and her associates to the USS Valor Victory - a Navy ship that spent twelve months at sea but was currently docked in Baltimore. (TXF: \"Nothing Important Happened Today II\") Even though it was now deserted, the vessel had recently housed the government program and it contained evidence that scientists had been secretly manipulating ova taken from female abductees. The ova would be readied for transplantation and the abductees' bodies would be used as surrogates for alien babies to create a slave race for colonization. The ship housing this program exploded on the Baltimore dock. (TXF: \"Nothing Important Happened Today II\", \"The Truth\")\n\nShannon McMahon also mentions a substance that promotes the mutation of offspring, fertilization and pregnancy that the government program had been recently using in their plans to aid colonization. It is likely this substance that the scientists were using to manipulate the ova of female abductees.\n\nOn the other hand, William did not have a standard mutation at the back of his neck even though, according to Shannon McMahon, every alien supersoldier had one. (TXF: \"Nothing Important Happened Today II\")\n\nAdditionally, Knowle Rohrer claimed that an implant inserted into the back of Scully's neck at the time of her abduction, which was really a military operation staged as an abduction, not only monitored her but had been used to trigger her pregnancy. (TXF: \"Existence\") An implant had indeed been found under Scully's skin, at the back of her neck, in 1995 but its purpose had never been conclusively confirmed. (TXF: \"The Blessing Way\n\nIn 2016, the Cigarette Smoking Man,reveals to Walter Skinner that he-and not Mulder- is William's biological father, however, this is never confirmed and the information could have easily been another set of falsehoods by a man playing God.It is revealed that during the events of his road trip to Pennsylvania(TXF: \"En Ami\")with Scully he drugged her and impregnated her artificially using alien technology in order to create the first superhuman soldier. Artificial insemination was likely genetic material from Fox Mulder and not the Cigarette Smoking Man. Neither set of storylines were confirmed nor denied.\n\nDevelopment & Birth\n\nBefore Birth\n\nScully's work on the X-Files was not without incident, which may have affected her unborn child. While investigating a case in a small, remote town in Utah, a parasitic organism was forcibly inserted near her spine, despite her protestations that she was pregnant and was going to have a baby. It was removed soon thereafter by Agent Doggett. (TXF: \"Roadrunners\")\n\nThe developing baby was certainly imperiled while not yet born. (The X-Files (season 8)) In 2001, Alex Krycek made a failed attempt at bribing Assistant Director Walter Skinner into terminating the unborn child's life. (TXF: \"DeadAlive\") Krycek would later explain that he had wanted to hide the baby's existence from the super-soldiers before they learned of it. (TXF: \"Essence\", \"Existence\") Several months later, the placenta that connected the baby to Scully somehow started to tear away from her uterine wall but the situation was eventually remedied while Scully rested in hospital. (TXF: \"Empedocles\")\n\nFollowing her recovery, both she and Mulder indicated that they were considering the child's future; Scully admitted that she hoped her child would inherit the gift of courage to believe, a quality she thanked Mulder for having given her. While temporarily trapped and facing death aboard the Galpex Orpheus Mulder jokingly told Scully during transmission between them, \"When he's old enough, tell the kid I went down swinging!\" (TXF: \"Empedocles\", \"Vienen\") Mulder also showed interest in the sex of the baby, asking Scully if it was a boy or girl. (TXF: \"Alone\")\n\nBirth & Naming\n\nDue to the threat that the super-soldiers posed to the unborn baby's existence after they learned of it, the child was born in Doggett's hometown of Democrat Hot Springs, Georgia - under a motionless shining light, high in the night sky - and was delivered by Special Agent Monica Reyes, whose assistance had been enlisted by Doggett. (TXF: \"Essence\", \"Existence\") Even though she and Scully had traveled there in an attempt to flee from the alien threat, the super-soldiers had nevertheless managed to follow them and, with the intent of ensuring the birth, they witnessed the event but soon dispersed, having apparently come to their conclusion that the child was not what they had thought he was.\n\nThe newborn baby and its mother were immediately taken to a hospital by Mulder - who had followed the light in the sky - before Scully took the baby boy home, where he first encountered the three The Lone Gunmen. Following Mulder's arrival shortly thereafter, the baby was held in his father's arms for the first time as Scully told Mulder that she intended to name the child \"William\", after the baby's paternal grandfather. According to Mulder, William had Scully's coloring and her eyes but looked \"suspiciously\" like Walter Skinner (due to sharing the characteristic of being bald, and perhaps a throwback comment on Scully's joking confession in Hollywood AD that she was \"...in love with Assistant Director Walter Skinner.\"). (TXF: \"Existence\")\n\nThat Scully named baby William after Mulder's father seems odd as her own father and brother also had the first-name \"William.\" So one can conclude that by stating William was named after Bill Mulder, Scully was acknowledging Mulder as the father of her baby.\n\nEarly life\n\nAbilities\n\nOn several occasions during the first year of his life, William demonstrated extraordinary abilities that indicated his partly alien nature. (TXF: \"Provenance\", \"William\", \"The Truth\") These abilities included telekinesis and the remote activation of alien technology. (TXF: \"Nothing Important Happened Today\", \"Provenance\", \"Providence\")\n\nWilliam was somehow able to turn the mobile above his crib without having any contact with it and could do this even as he slept. (TXF: \"Nothing Important Happened Today\") William was not alone in demonstrating this ability, as a baby girl named Joy was also said to have spun the mobile over her crib as if with her mind. (TXF: \"Trust No 1\")\n\nIn 2001, shortly after Mulder headed to New Mexico in an effort to secretly flee from the supersoldier threat, William demonstrated his ability to effect the movement of his mobile while he slept, but his mother later woke at the noise of his crying to discover the mobile slowly rotating. As William continued to cry, the mobile's turning abruptly paused when Scully touched the object but its spinning immediately resumed without building momentum, moments after she moved her hand away. Not long after, the mobile stopped rotating and remained still. (TXF: \"Nothing Important Happened Today\")\n\nAt the end of \"Nothing Important Happened Today II\", William looks up at his mobile while he lies awake in his crib. As the episode's end credits sequence begins to appear, the noise of William's mobile turning can be heard. Due to the lack of visual footage, it is uncertain whether the noise is due to William causing his mobile to revolve or not, though it is highly implied.\n\nWilliam later provided another demonstration of telekinesis after Special Agent Robert Comer brought an artefact from an alien spacecraft that had been discovered in Canada to Scully's apartment. Although Scully placed the artifact inside a drawer, she and Reyes later found the object was rattling within the compartment. Immediately after they opened the drawer, the artifact suddenly hurtled through the air, cutting through two of the narrow wooden bars that constituted the perimeter of William's crib, to come to a position directly hovering above William as he rested awake and the object continued to slowly rotate in the air. (TXF: \"Provenance\") Referring to this incident later that year, Reyes would recount that she had seen William \"display amazing powers; he'd move objects with his mind\". (TXF: \"The Truth\")\n\nAfter he was taken to the spacecraft by a female member of Josepho's cult, William started to cry moments before the craft became active. The female cult member noted this development and reported it to Josepho, who had earlier referred to William as \"a very special boy\". The baby continued to cry as the spacecraft launched and while he was subsequently recovered by Scully and Reyes. (TXF: \"Providence\")\n\nDangers\n\nInitial Fears of Jeopardy\n\nWilliam's life was endangered several times during his very early childhood. It was out of concern for the baby's safety and that of his father that Mulder left, eventually reappearing in New Mexico. (TXF: \"Nothing Important Happened Today\", \"The Truth\") Assistant Director Skinner later also feared that Agent Doggett's investigation of FBI Deputy Director Alvin Kersh jeopardized William's life and the safety of his parents. (TXF: \"Nothing Important Happened Today\")\n\nWhen Scully found William being held by Patti, Joy's mother (who William was unfamiliar with), she believed her son was in danger and pulled a gun on Patti until she placed William back in his crib. Scully suspected that Patti and her husband, a man who was caught trying to break into Scully's apartment moments after Patti put William back down, had staged encounters with Scully so that they could get to her baby. The couple actually wanted to protect William, and sought answers regarding the strange incidents involving both him and their young daughter.\n\nPatti's husband worked for an NSA agent who was really a super-soldier and, while backing Scully into a rock quarry, the alien threatened her that either William or his father had to die but the quarry contained a vein of magnetite that destroyed the super-soldier. (TXF: \"Trust No 1\")\n\nAgent Comer & Josepho's Cult\n\nLater the same year, William's life was threatened by Special Agent Comer, who had been investigating Josepho's cult and had learned of the prophecy concerning William's future. (TXF: \"Provenance\", \"Providence\") Both Agent Comer and Josepho mistakenly believed that Mulder was dead. Agent Comer, therefore, wanted to kill William to prevent the child from leading the future alien colonization. (TXF: \"Providence\") Comer secretly entered Scully's apartment while it was unoccupied and waited until Scully's mother, Margaret, returned with William. In his effort to kill the baby, Agent Comer pushed both Margaret and then, following her arrival shortly thereafter, Dana Scully out of the apartment and used a pillow to try to smother William. Agent Scully ultimately managed to use her gun to shoot Comer before he could kill her son.\n\nSuspecting that Josepho's cult also wanted to harm William, Scully called upon the Lone Gunmen to protect her baby and sent him away with the three men. (TXF: \"Provenance\") It was shortly thereafter that the female cult member kidnapped William, once she hijacked the Lone Gunmen's van in an alley. (TXF: \"Providence\", \"Provenance\")\n\nAs Scully had lost her faith in the FBI, she relied solely upon the Lone Gunmen's efforts to find her son but the FBI also tried to find William and his kidnapper. The Lone Gunmen made a failed attempt to find the baby by tracking a cell phone that Byers had tucked under William's seat in the group's van. According to AD Skinner, every available agent was involved in the FBI's search for William but their efforts also proved unsuccessful.\n\nHowever, Scully was personally contacted by Josepho, who arranged a private meeting with her. During the meeting, the cult leader claimed that he merely wanted to protect William from those who would harm him but was reluctant to allow Scully to see her son without evidence that Mulder was dead. The Lone Gunmen managed to electronically track Josepho's vehicle without his knowledge as he left the meeting and headed back to his followers in Canada. It was the Lone Gunmen's information that enabled Scully and Reyes to successfully locate baby William, moments after watching the spacecraft launch. The craft's departure incinerated patches of the field where William was lying but the baby was left alone and unharmed. (TXF: \"Providence\")\n\nAn Unrecognizable Man\n\nJeffrey Spender, who had been severely disfigured to the extent that he was unrecognizable, made several attempts to get near William in 2002. He spied on baby William and his mother one night as they arrived home and, after intentionally being caught apparently trying to steal files from the X-Files office, the disfigured Spender acted innocent but concocted a series of lies that persuaded Scully and Reyes to take him to Scully's apartment, where he made two more attempts to get near William.\n\nOn the first occasion, the FBI agents heard William crying while they were in another room and found Spender leaning over the baby's crib. A brief argument between Scully and Spender followed in which Spender started to explain that he had heard the baby crying. Soon after their discussion, Spender persuaded Scully to let him hold William, his nephew. Spender later admitted his awareness that raising a child alone contributed to the difficulty of Scully's life but that the alien conspiracy was continuing to use her to take care of the child and raise it.\n\nThe second time Spender tried to get near William, he succeeded in injecting the baby but Scully, Reyes and Doggett were again alerted by the noise of William crying. Scully and Reyes found a small amount of blood in William's crib and rushed him to a hospital. Tests were conducted on William by the hospital's medical staff but no abnormalities were found, except for some slight bruising on his head where something had clearly broken his skin as well as an elevated amount of iron in his blood.\n\nThis diagnosis made Scully aware of the truth of the situation and she realized that the unrecognizable man, whose disfigurement had been caused by the conspiracy's failed experiments to transform him into a supersoldier, was actually Jeffrey Spender. She was now aware that Spender's only goal had been to get to William.\n\nSpender confessed that the substance he had injected William with was a form of magnetite. According to Spender, William was \"the one thing the aliens need\" for colonization to succeed so he had taken revenge on his own father — one of the conspirators and a man who had shot Spender but was now believed to be dead — by normalising the baby's biology and \"taking William away\" from the aliens. (TXF: \"William\")\n\nLegacy\n\nAfter Mulder was captured while intruding on the Mount Weather Complex in Bluemont, Virginia and supposedly killing Knowle Rohrer, he was subjected to a brainwashing attempt by a guard who shouted at him, asking the nature of his thoughts, and punished him until he replied that he realized he was a guilty man. Before Mulder yielded, he stated that he was thinking of his son and of the boy's mother.\n\nHe was visited in his cell several times by Scully and AD Skinner. During a visit by AD Skinner, the Assistant Director informed Mulder that Scully had essentially been left with no other option than to give William up for adoption. Scully later visited Mulder before his trial for the first time they had been together in private. Unaware that he had spoken to Skinner until he told her that he had, Scully, heartbroken, repeated to Mulder the news that she had given William up for adoption. As they embraced in a hug, Scully admitted to being scared that he might not ever forgive her but Mulder assured her that he knew she had no choice and confessed that he had missed both her and William while he had been hiding in New Mexico.\n\nScully presented testimony at Mulder's trial but the prosecutor, Special Agent Kallenbrunner, attempted to discredit her accounts by concluding his inquiries with the rhetorical question, \"Isn't it true that you and Mulder were lovers and you got pregnant and had his love child?\"\n\nReyes later talked about William at length when she presented her own testimony during the trial. As part of her account, she recalled that Scully had been one of a number of random women who had experienced miraculous childbirths and that all these women had been abducted as part of the government program conducted aboard the USS Valor Victory. In response to Agent Kallenbrunner's efforts to discredit her accounts, Reyes became angered and accused him of neither caring about Scully's child nor what Scully and Mulder had been forced to sacrifice, believing that Kallenbrunner was \"only too happy she had to give him up so there's no proof\". (TXF: \"The Truth\")\n\nIn 2008, Scully asked Mulder if he thought a strong connection she felt too Christian Fearon, an extremely ill boy, was because of William. Mulder replied that he thought their son had left them with an \"emptiness that cannot be filled\".\n\nFurthermore, a scene of the 2008 movie features a conversation in which Scully discusses Christian's future with Mr and Mrs Fearon. At one point Mrs. Fearon unknowingly remarks to Scully \"If you were a mother you'd understand.\" Scully does not respond verbally, but it is clear from her expression that memories of her son, William, and by extension her daughter, Emily, have been stirred up by the statement. (The X-Files: I Want to Believe)\n\nIn 2016 while investigating the death of Dr. Sanjay Mulder and Scully discovered that a doctor was performing genetic experiments on homeless, impoverished, and other unwitting women. During the investigation, they discussed their sorrow regarding William, who would be 15 years old. (TXF: \"Founder's Mutation\")\n\nVisions\n\nDuring a dream Dana Scully had, she walked her six-year-old son to school on his first day. Dana tells William that the most important thing to remember is that she loves him. She kisses him on the head, they then walk inside the school building. Another day, 10-year-old William rushes out of school past his mother, who requests that he be home in time for dinner. Scully turns around and sees 13-year-old William on a stretcher next to an ambulance. Scully rushes over to see that William's arm is broken. Scully asks if he is hurt anywhere else, he shakes his head. She tells him that he'll be taken to the hospital to be checked for a concussion. She hears William calling for her. She turns around and appears in their house. She walks into the bedroom and sees 15-year old William facing the mirror. He turns around; his face mutated. A scared William asks what is happening to him.\n\nMulder had a similar vision of William. At six-years-old, William and Mulder watch a scene from 2001: A Space Odyssey in which early hominids come into contact with the film's Black Monolith, with William questioning the significance of the scene and Mulder explaining that different people can have different interpretations of movies. Later in William's life, William and Mulder launch model rockets together, with Mulder reciting President John F. Kennedy's speech on space exploration and William expressing a desire to go into space one day. Mulder's vision ends with 15-year-old William being abducted from his bedroom in a similar manner to the way Mulder's sister Samantha was, leaving Mulder shocked and grief-stricken.\n\nLife as Jackson Van De Kamp\n\nIn January 2007, on his sixth birthday, William - now living as Jackson Van De Kamp - became severely ill and his immune system collapsed. He was quarantined and underwent many tests by doctors who also took several stem cells from him.\n\nAt some unknown point after, Jackson was declared healthy again, but developed abilities owing to his heritage and the circumstances of his birth; such as telekinesis - ability unlocked again after Jeffrey Spender's magnetite injection suppressed such abilities. (TXF: \"William\") In 2008, now living away from rural Wyoming, Jackson developed remote-viewing abilities to people he was emotionally connected to, such as his mother Scully, who was conducting an autopsy at the time. (TXF: \"I Want to Believe\")\n\nTowards the middle of his teenage years, in 2015, Jackson developed the ability to connect with people in dreams; most of which were accompanied by \"This Man\".\n\nIn 2016, he began experiencing seizures accompanied with visions of a viral apocalypse, which led to him visiting a therapist and being prescribed medication to treat the seizures. (TXF: \"Ghouli\"). His connection to Scully allowed him to project his visions into her head, causing her to figure out that the Cigarette-Smoking Man was still alive. (TXF: \"My Struggle II\", \"My Struggle III\")\n\nWith his power to create illusions, he lured Sarah Arthur and Brianna Stapleton into an old building to show them both Ghouli and scare them. But instead of fleeing, the girls attacked each other with knives and injured themselves considerably. That did not just track down Mulder and Scully on him, but also some secret agents.\n\nWhen Mulder and Scully find his home, his parents have already been murdered, and he pretends to have been murdered as well. But eventually he can flee the morgue. In the hospital, he meets his persecutors, but can kill some of them using his illusions, including his parents' murderers.\n\nFinally he appears, disguised with an illusion in front of Scully, and says goodbye to her. Mulder and Scully see him on the video of a camera before he driving off in a car.\n\nEscape from the syndicate\n\nIn \"My Struggle IV\" he has been fleeing his pursuers for several weeks or months. He goes to Brianna and asks her to accompany him because he really loves her and does not want to be alone anymore and is afraid of his pursuers every day. Brianna first agrees to accompany him, but when her parents arrive, he has to flee alone, and tells her in which motel she can find him. However, shortly thereafter Mulder contacts her, and thus learns his address.\n\nMulder finds Jackson at the motel and offers his help, but suddenly they are attacked by enemy agents. Jackson can kill her with his telekinesis, but then has to flee again. He flees to the harbor, where he is found by Cigarette Smoking Man.\n\nBut Jackson uses his illusions again, and lets Cigarette Smoking Man believe he is Mulder. Cigarette Smoking Man shoots the alleged Mulder, but is shot shortly afterward by the real Mulder. He and Scully walk to where Jackson fell, but can not find him. They believe he was killed and give up the search. But Scully consoles Mulder with the idea that they will soon have a child together.\n\nShortly afterward you see Jackson getting out of the water again. Because he is now considered dead, he no longer has to fear his persecutors. What he does after that, and whether he will perhaps re-establish the relationship with Brianna, is unknown.\n\nBackground Information\n\nVoice-Overs\n\nThe teasers of \"Essence\" and \"Trust No 1\" each feature a voice-over concerning William's future. The first features Mulder questioning himself about the baby's origin and is accompanied by footage of the unborn baby's development. The voice-over states:\n\n\"We call it the miracle of life. Conception - a union of perfect opposites, essence transforming into existence, an act without which mankind would not exist and humanity cease to exist. Or is this just nostalgia now? An act of biology commandeered by modern science and technology? Godlike, we extract, implant, inseminate... and we clone. But has our ingenuity rendered the miracle into a simple trick? In the artifice of replicating life can we become the creator? Then what of the soul? Can it, too, be replicated? Does it live in this matter we call DNA? Or is its placement the opposite of artifice, capable only by God. How did this child come to be? What set its heart beating? Is it the product of a union? Or the work of a divine hand? An answered prayer? A true miracle? Or is it a wonder of technology-- the intervention of other hands? What do I tell this child about to be born? What do I tell Scully? And what do I tell myself?\"\n\nwhile the second, supposedly spoken by Scully, is accompanied by footage of her with Mulder and predicts:\n\n\"One day, you'll ask me to speak of a truth - of the miracle of your birth. To explain what is unexplained. And if I falter or fail on this day, know there is an answer, my child, a sacred imperishable truth, but one you may never hope to find alone. A chance meeting your perfect other, your perfect opposite - your protector and endangered. Chance embarking with this other on the greatest of journeys - a search for truths fugitive and imponderable. If one day this chance may befall you, my son, do not fail or falter to seize it. The truths are out there. And if one day you should behold a miracle, as I have in you, you will learn the truth is not found in science, or on some unseen plane, but by looking into your own heart. And at that moment you will be blessed - and stricken. For the truest truths are what hold us together, or keep us painfully, desperately apart.\"\n\nTrivia\n\nThe events of the last scene in \"Requiem\", in which Scully first reveals that she is pregnant, were deliberately kept secret until the very last moment, as the production personnel were unsure whether they would return for an eighth season of The X-Files and, if not, \"Requiem\" would be the series finale.\n\nAppearances\n\nReferences", "images": ["https://vignette.wikia.nocookie.net/final-space/images/7/7e/Final-Space.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200122100900", "https://vignette.wikia.nocookie.net/x-files/images/8/81/Baby_William_under_mobile.jpg/revision/latest/scale-to-width-down/260?cb=20080524151536", "https://vignette.wikia.nocookie.net/x-files/images/4/40/Jacksonvandekampseason11.png/revision/latest/scale-to-width-down/310?cb=20180326200004", "https://vignette.wikia.nocookie.net/x-files/images/7/76/Baby_William%27s_kidnapping.jpg/revision/latest/scale-to-width-down/252?cb=20070814133850", "https://vignette.wikia.nocookie.net/x-files/images/8/89/Wiki-wordmark.png/revision/latest?cb=20171017164606", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/x-files/images/4/40/Jacksonvandekampseason11.png/revision/latest?cb=20180326200004", "https://vignette.wikia.nocookie.net/x-files/images/0/0f/Mutated_William.png/revision/latest/scale-to-width-down/180?cb=20160202105820", "https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest/zoom-crop/width/100/height/56?cb=20200327133046", "https://vignette.wikia.nocookie.net/x-files/images/6/64/William_as_fetus.jpg/revision/latest/scale-to-width-down/280?cb=20080305092419", "https://vignette.wikia.nocookie.net/x-files/images/b/bc/Baby_William_with_Jeffrey_Spender.jpg/revision/latest/scale-to-width-down/276?cb=20091019165835", "https://vignette.wikia.nocookie.net/x-files/images/0/09/Baby_William_with_alien_artefact.jpg/revision/latest/scale-to-width-down/256?cb=20080526225833", "https://vignette.wikia.nocookie.net/x-files/images/e/e9/Fetus_title.jpg/revision/latest/scale-to-width-down/180?cb=20080305091639", "https://vignette.wikia.nocookie.net/x-files/images/5/5e/Manipulating_ova.jpg/revision/latest/scale-to-width-down/268?cb=20080527171506", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/wubbzy/images/7/7e/Me_and_My_Friends_-_128.png/revision/latest/zoom-crop/width/100/height/56?cb=20180423181936", "https://vignette.wikia.nocookie.net/x-files/images/9/93/Dana_Scully%27s_ova.jpg/revision/latest/scale-to-width-down/248?cb=20080305100902"], "top_img": "https://vignette.wikia.nocookie.net/x-files/images/4/40/Jacksonvandekampseason11.png/revision/latest?cb=20180326200004", "keywords": [], "authors": [], "canonical_link": "https://x-files.fandom.com/wiki/Jackson_Van_De_Kamp", "title": "Jackson Van De Kamp", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "X-Files Wiki,xfiles,Jackson Van De Kamp,2001,Dana Scully,Cigarette Smoking Man,Jeffrey Spender,William Scully (father),1994,Margaret Scully,2016,William Scully, Jr.,Melissa Scully", "description": "Jackson Van De Kamp was born William Scully the son of Dana Scully. He was long thought, for 17 years, to be the biological child of Fox Mulder. However, in the series finale, the Cigarette Smoking Man claimed to be his biological father and &quot;creator&quot; (TXF: “My Struggle III”). While this seems...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://x-files.fandom.com/wiki/Jackson_Van_De_Kamp", "title": "Jackson Van De Kamp | X-Files Wiki | Fandom", "description": "Jackson Van De Kamp was born William Scully the son of Dana Scully. He was long thought, for 17 years, to be the biological child of Fox Mulder. However, in the series finale, the Cigarette..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "X-Files Wiki", "title": "Jackson Van De Kamp", "description": "Jackson Van De Kamp was born William Scully the son of Dana Scully. He was long thought, for 17 years, to be the biological child of Fox Mulder. However, in the series finale, the Cigarette Smoking Man claimed to be his biological father and \"creator\" (TXF: “My Struggle III”). While this seems definitive, all the characters are given is the Cigarette Smoking Man's word, and due to the convoluted nature of the mythology arc, there is as much evidence that negates this supposed truth as...", "url": "https://x-files.fandom.com/wiki/Jackson_Van_De_Kamp", "image": "https://vignette.wikia.nocookie.net/x-files/images/4/40/Jacksonvandekampseason11.png/revision/latest?cb=20180326200004"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://x-files.fandom.com/wiki/Jackson_Van_De_Kamp"}, "movies": [], "publish_date": null, "source": "http://x-files.wikia.com", "summary": ""}