{"url": "http://theundefeated.com/features/actress-candice-patton-iris-west-in-the-flash/", "text": "Mary Jane Watson in Spider-Man: Homecoming was played by Zendaya. Samuel L. Jackson commanded the role of Nick Fury in The Avengers. In the movie Thor: Ragnarok, Idris Elba is the Asgardian gatekeeper Heimdall. Quvenzhané Wallis starred as the always singing and hopeful foster kid Annie. Brandy Norwood found her happily ever after as Cinderella with Whitney Houston dressed in gold as her fairy godmother. Will Smith protected Earth from aliens as Agent J in Men in Black.\n\nWhat’s the significant common feature of these actors and their characters? They are all African-Americans playing characters who were originally white in their respective comic or children’s book.\n\nAdding to the list is Candice Patton, who is in her fourth season of The Flash as Iris West. West is white in the DC comic, and her character is the no-fear-no-matter-the-danger, tough-as-nails journalist and longtime best friend of Barry Allen, aka The Flash. They’re married now and she leads S.T.A.R. Labs, the team behind The Flash in stopping crazy meta-human activity in Central City. The series airs on Tuesdays at 8 p.m. ET on The CW.\n\nThe Plano, Texas, native began her career in Hollywood with a stint on The Young and the Restless after being chosen in a national college casting search for a guest role. Once Patton graduated from Southern Methodist University in Dallas, she moved to Los Angeles to continue her acting career. Her television credits include appearances on Entourage, Castle, Grey’s Anatomy, The Game, CSI: Miami and Heroes, to name a few.\n\n“It’s a huge honor because young people and future generations will remember Iris West as black,” said Patton, 29. “If my casting wasn’t working [for TV], they would have changed it for the film, but they didn’t [and cast Kiersey Clemons, another African-American woman], and that’s a great thing.”\n\nThere’s still a long way to go with diversity and inclusion in Hollywood, but celebrating every inch, foot and mile fought to push the glass ceiling higher is just as important as the fight.\n\nWhile in Washington, D.C., for the “DC in D.C.” pop culture event, Patton spoke with The Undefeated about being a woman of color in Hollywood, how the leading lady on and offscreen has evolved and just how tearing her ACL as a cheerleader jump-started her passion for acting.\n\nWhat have you learned from playing Iris West?\n\nShe is strong, fearless, passionate and emotional. There is strength in vulnerability, and Iris isn’t afraid to show her emotions. She won’t let that defeat her.\n\nHow is it both an honor and responsibility playing Iris, who is traditionally white in the comic book?\n\nIt’s a huge honor because young people and future generations will remember Iris West as black. They can see themselves as the ingénue. Iris is the love interest of the hero, he’s the one he desires. She’s the leader of the team; she’s the one who rallies everyone together. And that’s a really important role model for young girls and even boys.\n\n#KeepIrisBlack has trended on Twitter. What significance does that have to you?\n\nI got into acting to A) pay my rent and B) live out my dreams … but another part of it became being a voice for so many young women of color. They get to see themselves on-screen [when they watch The Flash]. I craved to see that as a child growing up. It was just never there. All of my heroes were white and blond. There’s nothing wrong with that, but what made it difficult for me as a black girl was that it felt outside of myself, like something over there … something that was so cool but could never happen to me. Even when I was starting out in Hollywood, all of the roles I was going for was the best friend of the pretty white girl. So now for the first time, I’m [metaphorically] the pretty white girl.\n\nWhat actresses do you look up to?\n\nI remember watching Halle Berry win that Oscar and thinking how an acting career path was possible for me. Her grace, dignity and class are all things I’ve aspired toward. Zoe Saldana has done an amazing job in the diverse roles she has acted in, and that further paves a huge path for women of color too.\n\nHollywood is recognizing interracial relationships, like that of Iris and Barry on The Flash, and finally normalizing it. Why is that important?\n\nIt’s very important because it becomes normal and less fearful for people who haven’t seen interracial couples in their own neighborhoods and communities. People see Iris and Barry and say, “Oh they’re just like us … a normal relationship.” Having diverse storylines in general across film and TV impacts communities and [deep-rooted] mindsets.\n\nLeading women in TV and film have evolved. How would you define what a leading lady is today?\n\nThe leading lady is extremely important to the other heroes in the show. We used to see women as the sidekicks, but we’re moving away from that and women are becoming the heroes of their own stories. Iris is stepping into that, especially this season.\n\n[Outside of the screen], we as a culture have a specific way of what we’re used to seeing women as or how we want to see women. But the change is happening because women are now deciding for themselves and we are saying, “No more.” We’re making choices that are going to make people uncomfortable because before it wasn’t the feminine way and it wasn’t acceptable for women [to do that]. But now we are seeing women step up and say, “No more. Thanks for your input, but I decide on what I wear, what profession I’m going to pursue and what I deserve to get paid.”\n\nHow did cheerleading play a part in you becoming an actress?\n\nI grew up in Texas, so you either played football, went to the games or was a cheerleader. I enjoyed it a lot, but then tore my ACL. I couldn’t cheer for a while, so I ended up hanging out in the theater club, and the rest is pretty much history.\n\nWhat insecurities have you overcome?\n\nFear of being wrong, making mistakes and being the perfect celebrity for people to look up to. I learned that I have to be true to who I am because people will see my sincerity through a mistake that way.\n\nWhere does your courage come from?\n\nMy mom and dad. My mom always tells me to be as proud as a peacock, and my dad as a now-retired FBI agent would say, “Just because you’re shot doesn’t mean you’re going to die.” I go through trials and tribulations, but it doesn’t mean it’s the end of the world. You just have to keep pushing through.\n\nHow has being a new dog mom changed your life?\n\nMy dog, Zoe, has changed my life and has been a great anxiety relief. She’s given me that sense of responsibility to love something outside of myself. Sometimes, this career can feel so self-absorbed because it’s a lot about you and your character. I just felt like it was about me, me, me, me for way too long. Having Zoe takes me outside of myself, which is great.\n\nWhat’s your favorite throwback shows?\n\nI grew up idolizing Lucille Ball. I’d watch I Love Lucy every single night. There was something about how she made me feel good and entertained. I just knew that I wanted to do that and be part of being in people’s home every night. Acting was a hobby that turned into my passion.\n\nWhat emoji do you use the most?\n\nThe side-eye one. 👀\n\nWhat’s your favorite movie-time snack?\n\nKeiynan Lonsdale [who plays my brother Wally/Kid Flash on The Flash] introduced me to adding Maltesers chocolate to a warm bag of popcorn. I don’t even like chocolate, but this snack is on point.", "images": ["https://theundefeated.com/wp-content/uploads/2018/02/fla413b_0005b.jpg?w=700", "https://theundefeated.com/wp-content/uploads/2020/04/r689927_2_1296x729_16-9.jpg?w=600&quality=70", "https://theundefeated.com/wp-content/uploads/2020/04/GettyImages-1019037812-e1587050154977.jpg?w=600&quality=70", "https://theundefeated.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://theundefeated.com/wp-content/uploads/2020/03/BLACKAF_107_Unit_00417R-e1586993601934.jpg?w=600&quality=70"], "top_img": "https://theundefeated.com/wp-content/uploads/2018/02/fla413b_0005b.jpg?w=700", "keywords": [], "authors": ["Gianina Thompson"], "canonical_link": "https://theundefeated.com/features/actress-candice-patton-iris-west-in-the-flash/", "title": "Actress Candice Patton opens up on her role as Iris West in ‘The Flash’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.4", "og": {"type": "article", "title": "Actress Candice Patton opens up on her role as Iris West in ‘The Flash’", "url": "https://theundefeated.com/features/actress-candice-patton-iris-west-in-the-flash/", "description": "Mary Jane Watson in Spider-Man: Homecoming was played by Zendaya. Samuel L. Jackson commanded the role of Nick Fury in The Avengers. In the movie Thor: Ragnarok…", "site_name": "The Undefeated", "image": {"identifier": "https://theundefeated.com/wp-content/uploads/2018/02/fla413b_0005b.jpg?w=700", "width": 700, "height": 394}, "locale": "en_US"}, "article": {"published_time": "2018-02-06T12:30:36+00:00", "modified_time": "2018-02-06T12:30:36+00:00", "author": "https://theundefeated.com/contributors/gianina-thompson/", "publisher": "https://www.facebook.com/theundefeatedsite"}, "fb": {"app_id": 834240743288407, "pages": 1583598865225460}, "twitter": {"site": {"identifier": "TheUndefeated", "id": 3033098871}, "widgets": {"csp": "on"}, "maxage": 300, "card": "player", "creator": {"id": 2458283886}, "image": {"src": "https://theundefeated.com/wp-content/uploads/2018/02/fla413b_0005b.jpg?w=700"}, "label1": "Written by", "data1": "Gianina Thompson", "label2": "Filed under", "data2": "Get Lifted, DC Comics, Candice Patton, Iris West, The Flash", "player": "https://www.espn.com/core/video/iframe?id=22335448&adLevel=espn.theundefeated.us.com/theuplift/article&omniReportSuite=wdgespundefeated&omniSite=theundefeated"}, "DC.date.issued": 116589, "description": "Mary Jane Watson in Spider-Man: Homecoming was played by Zendaya. Samuel L. Jackson commanded the role of Nick Fury in The Avengers. In the movie Thor: Ragnarok…", "author": "Gianina Thompson"}, "movies": [], "publish_date": 1517920236.0, "source": "http://theundefeated.com", "summary": ""}