{"url": "https://people.com/movies/inside-kevin-hart-tumultuous-year/", "text": "With Kevin Hart out as Oscars host, the comedian is moving on after a turbulent year.\n\nJust hours after Hart announced he would be stepping down as Oscars host following the resurfacing of past homophobic tweets, the comedian stepped out in Australia looking serious for a series of comedy gigs.\n\nGet push notifications with news, features and more.\n\nThe 39-year-old has had a tumultuous end to 2018 — just a few weeks ago, Hart also had to defend his 13-month-old son Kenzo’s birthday party after he and his wife Eniko were slammed for culturally appropriating Native American culture.\n\nHere’s a look back at Hart’s tough times:\n\nHomophobic Tweets Resurface\n\nAfter Hart confirmed he was hosting the Oscars on Tuesday night, the Night School actor was scrutinized for previous homophobic tweets he had written in the past.\n\nWhile many of those tweets are now deleted, Twitter users resurfaced his comments through screenshots and criticized Hart and the Academy of Motion Picture Arts and Sciences (which hosts the Oscars).\n\nHart did not address the tweets until Thursday in a statement that began with, “I swear man our world is becoming beyond crazy.”\n\nImage zoom Dan MacMedan/WireImage\n\n“If you want to hold people in a position where they always have to justify or explain their past — then do you,” he said. “I’m the wrong guy, man. I’m in a great place, a great mature place where all I do is spread positivity. If you’re not doing that, you’re not on my page.”\n\nHours later, Hart took to Instagram again to reveal the Academy had asked him to issue an apology — which he refused to do.\n\n“So, I just got a call from the Academy and that call basically said, ‘Kevin, apologize for your tweets… or we’re going to have to move on and find another host,’” he said in a video shared on Instagram that he captioned “I know who I am and so do the people closest to me. I’m not going to continue to go back and tap into the days of old when I’ve moved on and I’m in a completely different space in my life.”\n\nHe added, “I’m not going to do it, man. I’m going to be me and stand my ground.”\n\nA source familiar with the situation confirmed to PEOPLE that the Academy did ask Hart to apologize.\n\nRELATED: Kevin Hart Steps Downs as Host of the Academy Awards Moments After Refusing to Apologize\n\nImage zoom Kevin Hart touches down in Sydney, Australia, on a private jet MEGA\n\nStepping Down as Oscars Host — and an Apology\n\nJust an hour after he refused to apologize, the comedian shared he would be stepping down as Oscars host.\n\n“I have made the choice to step down from hosting this year’s Oscars’s,” Hart tweeted .”This is because I do not want to be a distraction on a night that should be celebrated by so many amazing talented artists. I sincerely apologize to the LGBTQ community for my insensitive words from my past.”\n\nIn a second tweet, Hart finally issued an apology, writing, “I’m sorry that I hurt people.. I am evolving and want to continue to do so. My goal is to bring people together not tear us apart. Much love & appreciation to the Academy. I hope we can meet again.”\n\nThe Academy has not commented on the reaction to Hart’s casting as host nor on his revelation that they asked for him to apologize.\n\nRELATED VIDEO: Kevin Hart Reveals How Wife Eniko Forgave Him After Cheating Scandal: She’s ‘My Backbone’\n\nDefending a Cowboys-and-Indians-Themed Birthday Party\n\nBefore stepping down as Oscars host, Hart and his wife were under fire for planning their son Kenzo’s first birthday party with a cowboys-and-Indians theme — which some critics viewed as cultural appropriation.\n\n“Zos cowboys & indians party was nothing but amazing!” Eniko captioned an Instagram photo of the celebration, which was decorated with Native American blankets, cowboy hats and teepees.\n\nDays after his son’s party, Hart addressed the controversy and defended the theme on his SiriusXM show Straight from The Hart saying the backlash was “stupid.”\n\nHart also explained that the premise of the party’s theme was based on western movies and the couple’s intentions were not malicious.\n\nRELATED: With Kevin Hart Out, Who Could (and Wants) to Host Oscars — From Tiffany Haddish to The Rock\n\n“I’m saying the battle that is ‘assumed’ because of the movies and because of everything they’ve seen, was because of the fights that were between the cowboys and the Indians,” he said.\n\n“This isn’t a racial slur that people are doing and being malicious with. This is a game that’s been played for years,” Hart added.\n\nAftermath of a Cheating Scandal\n\nIn 2017, a close friend of Hart’s allegedly tried to extort him over a video of him with another woman. The actor opened up weathering the storm of his cheating scandal to PEOPLE in September saying the friendship he has with his wife “is insane.”\n\n“Yes, that’s my wife, we’re lovers, it’s a relationship, it’s marriage…but the friendship we have is like no other,” he shared. “Our marriage has been put to the test,” alluding to his infidelity scandal. “It’s the most difficult test ever. And, you know, sometimes those tests come from stupidity. But it’s how you handle it, and how you decide to move forward from it.”\n\nFor Eniko’s part, she chose full-fledged forgiveness. “I applaud my wife for just displaying a high level of strength that I can’t even explain,” says Hart. “I applaud her for being my backbone, my support system, and more importantly, taking my life to the next level.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fgettyimages-4642676281-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1498&h=784&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fgettyimages-4642676281-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkevin-hart2-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1498&h=784&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fgettyimages-4642676281-2000.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/movies/inside-kevin-hart-tumultuous-year/", "title": "Inside Kevin Hart's Rough Year: From Oscars Fallout to His Cheating Scandal", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrities,Kevin Hart,Movie Celebrities,Movie News,News", "news_keywords": "Celebrities,Kevin Hart,Movie Celebrities,Movie News,News", "description": "With Kevin Hart out as Oscars host, the comedian is moving on after a turbulent year", "og": {"title": "Inside Kevin Hart's Rough Year: From Oscars Fallout to His Cheating Scandal", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/inside-kevin-hart-tumultuous-year/", "description": "With Kevin Hart out as Oscars host, the comedian is moving on after a turbulent year. Just hours after Hart announced he would be stepping&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1498&h=784&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fgettyimages-4642676281-2000.jpg", "width": 1498, "height": 784}}, "pinterest": {"url": "https://people.com/movies/inside-kevin-hart-tumultuous-year/", "description": "With Kevin Hart out as Oscars host, the comedian is moving on after a turbulent year", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fgettyimages-4642676281-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/inside-kevin-hart-tumultuous-year/", "title": "Inside Kevin Hart's Rough Year: From Oscars Fallout to His Cheating Scandal", "description": "With Kevin Hart out as Oscars host, the comedian is moving on after a turbulent year", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1498&h=784&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fgettyimages-4642676281-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}