{"url": "https://people.com/movies/sag-awards-2018-james-franco-attends/", "text": "Image zoom Dimitrios Kambouris/Getty\n\nJames Franco was spotted at the Screen Actors Guild Awards on Sunday — his first public appearance in the wake of allegations of sexually inappropriate behavior.\n\nFranco, 39, attended the ceremony with his girlfriend Isabel Pakzad.\n\nGet push notifications with news, features and more.\n\nIn a red carpet interview with E!, his sister-in-law Alison Brie, nominated for her role in GLOW, defended the Disaster Artist star.\n\n“I think that above all what we’ve always said is that it remains vital that anyone that feels victimized should and does have the right to speak out and come forward,” she said. “I obviously support my family, and not everything that’s been reported has been accurate, so I think we’re waiting to get all the information. But of course now is the time for listening, and that’s what we are all trying to do.”\n\nFive women accused Franco, who is nominated at Sunday’s ceremony for outstanding performance by a male actor in a leading role for his movie The Disaster Artist, of sexually exploitative behavior earlier this month.\n\nRELATED PHOTOS: See the Standout Outfits from the SAG Awards 2018\n\nLast week, Franco skipped the Critics’ Choice Awards, where he won the award for best actor in a comedy. Sources have said the actor has been shaken by the allegations: “He’s in a really bad place,” a source close to the situation told PEOPLE. “His close friends are trying to be there for him.”\n\nDuring a recent appearance on Late Night with Seth Meyers, Franco addressed the allegations made by a number of women on Twitter after he wore a Time’s Up pin at the Golden Globe Awards.\n\nTo donate to the Time’s Up Legal Defense Fund, which will provide subsidized legal support to women and men in all industries who have experienced sexual harassment, assault, or abuse in the workplace, visit its GoFundMe page. Learn more about Time’s Up, an organization of women in entertainment combating sexual harassment and inequality, on its website.\n\n“There are people that need to be heard,” the actor told Meyers. “I have my own side of this story, but I believe in these people that have been underrepresented getting their stories out enough that I will hold back things that I could say, just because I believe in it that much,” he said. “So if I have to take a knock because I’m not going to try and actively refute things, then I will, because I believe in it that much.”\n\nBe sure to check out PEOPLE’s full SAG Awards coverage to get the latest news on Hollywood’s big night.\n\nIn an article published in the Los Angeles Times on Jan. 11, five women accused Franco of abusing his power as an acting teacher and mentor in a sexually exploitative manner. Two students claimed the actor would often become angry on set when they would refuse to film topless, while another former acting student at the film school Franco founded said he once removed safety guards while filming an oral sex scene on the set of the 2015 film The Long Home.\n\nRELATED VIDEO: James Franco Accused of Inappropriate Behavior By Five Women\n\nAdditionally, actress Violet Paley recounted her previous social media claims that Franco exposed himself and tried to pressure her into oral sex. Though she said they had a consensual relationship, Paley said, “that time wasn’t consensual.” She also alleged that he told her friend to meet him in a hotel when the friend was 17.\n\nCatch PEOPLE, Entertainment Weekly and TNT’s official LIVE red carpet show ahead of the SAG Awards on PeopleTV starting at 5:30 p.m. ET on Sunday. Go to People.com/peopletv, or download the app on your favorite streaming device.\n\nFranco’s attorney, Michael Plonsker, denied each of the women’s allegations and cited Franco’s comments on The Late Show with Stephen Colbert as his formal denial.\n\n“Look, in my life I pride myself on taking responsibility for things that I have done,” Franco told Colbert. “I have to do that to maintain my well being. The things that I heard that were on Twitter are not accurate. But I completely support people coming out and being able to have a voice because they didn’t have a voice for so long. So I don’t want to shut them down in any way.”\n\nThe 24th annual Screen Actors Guild Awards are broadcast live from the Shrine Auditorium in Los Angeles on both TNT and TBS starting at 8 p.m. ET.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2075'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjames-franco8-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjames-franco8-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjames-franco8-1.jpg", "keywords": [], "authors": ["Jodi Guglielmi", "Mia Mcniece"], "canonical_link": "https://people.com/movies/sag-awards-2018-james-franco-attends/", "title": "James Franco Attends 2018 SAG Awards After Allegations of Sexually Inappropriate Behavior", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Awards Shows,James Franco,Movie News,News,SAG Awards,Screen Actors Guild Awards", "news_keywords": "Awards Shows,James Franco,Movie News,News,SAG Awards,Screen Actors Guild Awards", "description": "The event marked his first public appearance since five women accused James Franco of sexually exploitative behavior earlier this month", "og": {"title": "James Franco Attends 2018 SAG Awards After Allegations of Sexually Inappropriate Behavior", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/sag-awards-2018-james-franco-attends/", "description": "James Franco&nbsp;was spotted at the Screen Actors Guild Awards on Sunday — his first public appearance in the wake of allegations of sexually inappropriate behavior.&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjames-franco8-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/sag-awards-2018-james-franco-attends/", "description": "The event marked his first public appearance since five women accused James Franco of sexually exploitative behavior earlier this month", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjames-franco8-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/sag-awards-2018-james-franco-attends/", "title": "James Franco Attends 2018 SAG Awards After Allegations of Sexually Inappropriate Behavior", "description": "The event marked his first public appearance since five women accused James Franco of sexually exploitative behavior earlier this month", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjames-franco8-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}