{"url": "https://www.thesun.co.uk/news/4664289/cara-delevigne-harvey-weinstein-threesome/", "text": "CARA Delevingne has become the latest star to accuse Harvey Weinstein of sexually harassing her as she claimed he tried to force himself on her.\n\nThe model-turned-actress said after meeting the Hollywood producer at a restaurant, he asked her to come up to his hotel room where another woman was waiting.\n\n5 Cara Delevingne claims she was sexually assaulted by Harvey Weinstein, pictured in 2014\n\nWeinstein then apparently told the two women to kiss, which Cara said she escaped from by suddenly breaking out into song.\n\nShe made the explosive claims on Instagram as she told how Wenstein tried to kiss her \"on the lips\".\n\nThe 25-year-old said she still got the part in the film but has felt \"guilty and terrified\" about it ever since.\n\nCara has made two films for the Weinstein company - including her breakout role in Paper Towns in 2015 and recently released Tulip Fever.\n\n5 The model, pictured with sister Poppy at Weinstein's pre-BAFTA dinner in 2014, made the explosive claims on Instagram Credit: Getty - Contributor\n\n5 She claimed Weinstein tried to kiss her and make her have a threesome Credit: Instagram/caradelevingne\n\nWriting on Instagram today, she said: \"When I first started to work as an actress, i was working on a film and I received a call from‎ Harvey Weinstein asking if I had slept with any of the women I was seen out with in the media.\n\n\"It was a very odd and uncomfortable call....i answered none of his questions and hurried off the phone but before I hung up, he said to me that If I was gay or decided to be with a woman especially in public that I'd never get the role of a straight woman or make it as an actress in Hollywood.\"\n\nShe explained how she met up with him a year later to discuss a film at the hotel with him and a director, who left - leaving Cara, who came out as bisexual in 2015, and Weinstein alone.\n\nThe model wrote: \"As soon as we were alone he began to brag about all the actresses he had slept with and how he had made their careers and spoke about other inappropriate things of a sexual nature.\n\n\"He then invited me to his room.\"\n\n5 Hollywood producer Harvey Weinstein is at the centre of sexual harassment and assault claims by a string of women Credit: AP:Associated Press\n\nCara said she felt \"powerless and scared\" but hoped she was \"wrong about the situation\" so she followed him up.\n\nAt first she was \"relieved\" to discover another woman in the hotel room, but he then asked the pair to \"kiss\" and the other woman \"began some sort of advances upon his direction.\"\n\nCara said she told Weinstein she had to leave, adding: \"He walked me to the door and stood in front of it and tried to kiss me on the lips. I stopped him and managed to get out of the room.\n\n\"I still got the part for the film and always thought that he gave it to me because of what happened.\"\n\nShe continued: \"Since then I felt awful that I did the movie. I felt like I didn't deserve the part. I was so hesitant about speaking out....I didn't want to hurt his family. I felt guilty as if I did something wrong.\n\n\"I was also terrified that this sort of thing had happened to so many women I know but no one had said anything because of fear.\"\n\nFall from grace: what we know\n\n5 Cara, with Suki Waterhouse at Weinstein's 2014 bash, said she felt 'guilty' Credit: Getty - Contributor\n\nCara is the latest in a long line of Hollywood A-listers who have accused Weinstein of sexually assaulting them.\n\nIn the past 24 hours multiple women - including Angelina Jolie and Gwyneth Paltrow - have made accusations against the Hollywood producer.\n\nIt comes just hours after Hollywood star Ewan McGregor slammed Weinstein, 64, saying he heard \"rumours\" about the movie mogul's behaviour over many years.\n\nMcGregor, the star of the Trainspotting films, said Weinsten was getting his \"just deserts\" and added: \"Bye bully.\"\n\nThe Oscar-winning producer has also been accused of raping three women in explosive new allegations.\n\nWeinstein's British wife Georgina Chapman also said she was leaving him last night as the new allegations mounted.\n\nHER ACCOUNT IN FULL “When I first started to work as an actress, I was working on a film and I received a call from Harvey Weinstein asking if I had slept with any of the women I was seen out with in the media. It was a very odd and uncomfortable call. “I answered none of his questions and hurried off the phone but before I hung up, he said to me that if I was gay or decided to be with a woman especially in public that I’d never get the role of a straight woman or make it as an actress in Hollywood. “A year or two later, I went to a meeting with him in the lobby of a hotel with a director about an upcoming film. The director left the meeting and Harvey asked me to stay and chat with him. “As soon as we were alone he began to brag about all the actresses he had slept with and how he had made their careers and spoke about other inappropriate things of a sexual nature. “He then invited me to his room. “I quickly declined and asked his assistant if my car was outside. She said it wasn’t and wouldn’t be for a bit and I should go to his room. “At that moment I felt very powerless and scared but didn’t want to act that way hoping that I was wrong about the situation. When I arrived I was relieved to find another woman in his room and thought immediately I was safe. “He asked us to kiss and she began some sort of advances upon his direction. I swiftly got up and asked him if he knew that I could sing. And I began to sing. “I thought it would make the situation better - more professional, like an audition. I was so nervous. “After singing I said again that I had to leave. He walked me to the door and stood in front of it and tried to kiss me on the lips. I stopped him and managed to get out of the room. “I still got the part for the film and always thought that he gave it to me because of what happened. “Since then I felt awful that I did the movie. I felt like I didn’t deserve the part. I was so hesitant about speaking out. “I didn’t want to hurt his family. I felt guilty as if I did something wrong. I was also terrified that this sort of thing had happened to so many women I know but no one had said anything because of fear.” She later posted a second message on the social networking site. It read: “I want women and girls to know that being harassed or abused or raped is NEVER their fault and not talking about it will always cause more damage than speaking the truth. “I am relieved to be able to share this. I actually feel better and I’m proud of the women who are brave enough to speak. “This isn’t easy but there are strength in our numbers. As I said, this is only the beginning. In every industry and especially in Hollywood, men abuse their power using fear and get away with it. This must stop. “The more we talk about it, the less power we give them. I urge you all to talk and to the people who defend these men, you are part of the problem.”\n\nMOST READ IN NEWS Exclusive GREEN FOR GO The top-secret 'traffic light' masterplan for easing the UK out of lockdown Exclusive 'I'LL UNLOCK BRITAIN' Boris could be back next week to lead UK out of lockdown 'OUTRAGEOUS' Harry sparks fury by claiming virus crisis is not as bad as public are told BACK TO SCHOOL Kids back in school in THREE WEEKS as staggered return eases lockdown Exclusive ROCKET MAN-SION Harry and Meghan are renting an £8million LA mansion close to Elton John CORONA RIOTS Riots and looting in Cape Town as Africa suffers 1,000 coronavirus deaths\n\nWe pay for your stories! Do you have a story for The Sun Online news team? Email us at tips@the-sun.co.uk or call 0207 782 4368 . We pay for videos too. Click here to upload yours.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2017/10/pmcomposite-carav1.jpg?strip=all&quality=100&w=750&h=500&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/10/pmcomposite-carav1.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Holly Christodoulou"], "canonical_link": "https://www.thesun.co.uk/news/4664289/cara-delevigne-harvey-weinstein-threesome/", "title": "Cara Delevingne claims Harvey Weinstein tried to kiss her and wanted her to take part in a THREESOME in his hotel suite", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Cara Delevingne says Weinstein wanted her to take part in THREESOME", "url": "https://www.thesun.co.uk/news/4664289/cara-delevigne-harvey-weinstein-threesome/", "description": "CARA Delevingne has become the latest star to accuse Harvey Weinstein of sexually harassing her as she claimed he tried to force himself on her. The model-turned-actress said after meeting the Holl…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/10/pmcomposite-carav1.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2017-10-12T10:57:30+00:00", "modified_time": "2017-10-13T08:21:50+00:00", "publisher": 161385360554578, "tag": "Cara Delevingne", "author": "https://www.facebook.com/TheSunWorldNews/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The model-turned-actress is the latest star to accuse the Hollywood producer of sexual harassment", "keywords": "harvey weinstein, cara delevigne", "news_keywords": "harvey weinstein, cara delevigne", "twitter": {"text": {"title": "Cara Delevingne claims Harvey Weinstein tried to kiss her and wanted her to take part in a THREESOME in his hotel suite"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "'he tried to kiss me'", "headline": "Cara Delevingne says Weinstein wanted her to take part in THREESOME", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/10/pmcomposite-carav1.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/10/pmcomposite-carav1.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 4664289, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1507805850.0, "source": "https://www.thesun.co.uk", "summary": ""}