{"url": "https://www.huffingtonpost.ca/marcia-sirota/steve-harvey-miss-universe_b_8876424.html", "text": "ASSOCIATED PRESS Steve Harvey holds up the card showing the winners after he incorrectly announced Miss Colombia Ariadna Gutierrez at the winner at the Miss Universe pageant Sunday, Dec. 20, 2015, in Las Vegas. According to the pageant, a misreading led the announcer to read Miss Colombia as the winner before they took it away and gave it to Miss Philippines Pia Alonzo Wurtzbach.(AP Photo/John Locher)\n\nI don't know why I chose to watch the Miss Universe Pageant this past Sunday, December 20. I usually don't enjoy those types of shows, but I'm very glad I watched, because I was able to see Steve Harvey make his now-famous mistake in announcing the winner of Miss Universe 2015. My happiness has nothing to do with schadenfreude, though, as I take no pleasure in the suffering of others.\n\nThe reason why I felt fortunate to witness this incredibly awkward moment was because it illustrated to me an important lesson both in human frailty and in human resilience. It was one of the worst possible things that could go wrong -- a horrendous faux pas played out in front of an audience of millions, followed by a surprising and excellent recovery which I saw as tremendously reassuring.\n\nWhen we look at various lists our top fears, the fear of public speaking is always very close to the top, and it's because of of the underlying fear of making a fool of oneself.\n\nShame is a major source of anxiety for human beings. The sensation of shame is particularly painful because it includes not only feeling bad and stupid, but also small and ridiculous. Public shame is the worst of all. The anguish of being humiliated in front of our peers -- or, worse, those who we're hoping to impress -- can be excruciating.\n\nMany people avoid speaking in public altogether for the express purpose of not allowing themselves to be put in a position that might result in their experiencing shame. Many people would rather do just about anything than speak in public.\n\nSo, when Steve Harvey botched the announcement of the winner of Miss Universe 2015, he realized one of our worst fears: he looked really bad in front of the contestants, his bosses and millions of people all around the world.\n\nMr. Harvey did the thing that we all fear when we contemplate speaking in public. He messed up. But then he turned around and surprised us. He recovered.\n\nWe can be so anxious about the possibility of looking foolish in public that our thoughts go no further than to the dreaded possibility of public humiliation.\n\nWe can't imagine standing there, as Mr. Harvey did, with egg on our face, having demonstrated our ineptitude to the masses. Equally, we wouldn't have contemplated how we might react if such a situation were to occur. We simply imagine that we'd die, right then and there, or at least wish that we were dead.\n\nWhat Mr. Harvey showed us -- and why I was so happy to witness his big blunder -- was that we can mess up, look foolish and then we can make things right again.\n\nMr. Harvey showed us that it's possible for us to fall on our face but then stand up, brush ourselves off and carry on with our dignity intact. He showed us all-too-human fallibility, but also real class, courage and resilience.\n\nI was very impressed by the way Mr. Harvey handled his error. He owned up to it, apologized for it, explained what happened without being defensive, and even begged the audience not to blame his error on the contestants.\n\nHe took responsibility for what had happened and he did the right thing. He didn't try to save face, minimize his mistake or laugh it off. He was serious, humble and appropriately contrite. He knew he'd messed up, and he did his best to make things right.\n\nThat night, all of us who were watching the pageant collectively cringed as we witnessed Mr. Harvey's mistake. We felt horrible for the young women involved and embarrassed for Mr. Harvey.\n\nBut then, as I reflected upon what I'd just seen, I realized that, although it was an incredibly uncomfortable moment, it was also an enormously valuable lesson for all of us to take in.\n\nI really appreciate the way Mr. Harvey handled this situation. In fact, he did millions of people a huge favour. He realized one of our worst fears in as public a forum as one could imagine. And he didn't die. His head didn't explode. He didn't run off the stage and commit ritual suicide.\n\nNo, Mr. Harvey messed up, owned up, corrected the situation and survived. And he demonstrated to all of us that we too can mess up and survive, if we're willing to do the right thing, as he did.\n\nSo, Steve Harvey, thank you.\n\nI know you weren't planning on being such an excellent role model, but as is often the case when things go sideways, amazing surprises can happen. Amazing choices can be made and powerful lessons can be learned.\n\nThe next time I get up on a stage somewhere and I'm about to give a talk, I'll remember Steve Harvey and the Miss Universe 2015 pageant. I'll remember that the worst happened and nobody died. I'll take a deep breath and remind myself that if he could mess up in front of millions of people and survive, I really have nothing to worry about, after all.\n\nSign up here for my free monthly wellness newsletter. January is all about authenticity and mindfulness.\n\nMORE ON HUFFPOST:", "images": ["https://img.huffingtonpost.com/asset/5e9a2d442500005706eafd90.jpeg?cache=mUes4Li2K0&ops=434_244", "https://img.huffingtonpost.com/asset/5cd5e86b21000035007309e8.jpeg?ops=scalefit_960_noupscale", "https://img.huffingtonpost.com/asset/5e99bd0b220000fb028272fd.jpeg?cache=UF5rhVRaZ1&ops=434_244", "https://img.huffingtonpost.com/asset/5e9a6aba250000320beafd95.jpeg?ops=434_244", "https://img.huffingtonpost.com/asset/5e9a17f42500004f236b812c.jpeg?ops=434_244", "https://img.huffingtonpost.com/asset/5c92afb53b000002076dde5b.jpeg?ops=100_100", "https://img.huffingtonpost.com/asset/5cd5e86a2100003100c3475f.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5e98a0ea2200009702827212.jpeg?cache=B9IIUEyRbs&ops=434_244", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5e9a5dbe220000cc04827365.jpeg?cache=qHo9tApnGv&ops=434_244", "https://img.huffingtonpost.com/asset/5e99b603220000fc028272eb.jpeg?cache=AwIq8DW6rt&ops=434_244", "https://img.huffingtonpost.com/asset/5e99f009220000f00282733d.jpeg?cache=jUWvJ9jUes&ops=434_244", "https://img.huffingtonpost.com/asset/5e98a9dd3000005f06154569.jpeg?cache=Hi06Q6VXFJ&ops=434_244", "https://img.huffingtonpost.com/asset/5e9a72d9250000320beafd97.jpeg?cache=0n0z1guC8P&ops=434_244", "https://img.huffingtonpost.com/asset/5e9619f0300000a6051541fd.jpeg?cache=O65DhZNGWM&ops=434_244", "https://img.huffingtonpost.com/asset/5e99e3bc25000050236b80fe.png?cache=QgSAtC9PAh&ops=434_244", "https://img.huffingtonpost.com/asset/5cd5e86a24000059007179df.jpeg?ops=1778_1000"], "top_img": "https://img.huffingtonpost.com/asset/5cd5e86a24000059007179df.jpeg?ops=1778_1000", "keywords": [], "authors": ["Author", "Speaker", "Coach"], "canonical_link": "https://www.huffingtonpost.ca/marcia-sirota/steve-harvey-miss-universe_b_8876424.html", "title": "Steve Harvey's Miss Universe Mistake Offers A Powerful Lesson", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffingtonpost.ca", "locale": "en-CA", "inline-consent": "true"}}, "description": "I felt fortunate to witness this incredibly awkward moment was because it illustrated to me an important lesson both in human frailty and in human...", "keywords": "anxiety blog crisis management fear fears living Miss Columbia Miss Universe miss universe 2015 overcoming fear public humiliation Public Speaking shame steve harvey", "og": {"title": "Steve Harvey's Miss Universe Mistake Offers A Powerful Lesson", "type": "blog", "image": {"identifier": "https://img.huffingtonpost.com/asset/5cd5e86a24000059007179df.jpeg?ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5cd5e86a24000059007179df.jpeg?ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffingtonpost.ca/marcia-sirota/steve-harvey-miss-universe_b_8876424.html", "site_name": "HuffPost Canada", "locale": "en_CA", "description": "I felt fortunate to witness this incredibly awkward moment was because it illustrated to me an important lesson both in human frailty and in human..."}, "article": {"tag": "anxiety blog crisis management fear fears living Miss Columbia Miss Universe miss universe 2015 overcoming fear public humiliation Public Speaking shame steve harvey", "section": "Life", "published_time": "2015-12-28T08:38:24Z", "modified_time": "2016-12-28T10:12:01Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostCaLife", "title": "Steve Harvey's Miss Universe Mistake Offers A Powerful Lesson", "image": {"identifier": "https://img.huffingtonpost.com/asset/5cd5e86a24000059007179df.jpeg?ops=1778_1000", "width": 1778, "height": 1000}, "description": "I felt fortunate to witness this incredibly awkward moment was because it illustrated to me an important lesson both in human frailty and in human..."}, "al": {"ios": {"url": "huffpostnews:///?editionID=ca&entryID=ca_5cd5e86ae4b0c06a50b487aa", "app_store_id": 306621789, "app_name": "HuffPost"}}, "robots": "max-snippet:-1,max-image-preview:standard,max-video-preview:-1", "taboola.category": "living"}, "movies": [], "publish_date": 1451291904.0, "source": "https://www.huffingtonpost.ca", "summary": ""}