{"url": "https://vmagazine.com/article/ashley-graham-tracee-ellis-ross-interview/", "text": "Ashley Graham strips down in black and white and talks with her friend Tracee Ellis Ross about role models, mothers, and mantras in our summer issue—available to order here .\n\nAshley Graham strips down in black and white and talks with her friend Tracee Ellis Ross about role models, mothers, and mantras in our summer issue—available to order here .\n\nTRACEE ELLIS ROSS Hi Ashley! How are you doing?\n\nASHLEY GRAHAM I’m so good! I’m so happy to be doing this.\n\nTER Me too! First of all, you’re slaying everybody’s life right now with your fashion. I was spit out of a fashion womb, thanks to momma [Diana Ross]. I’ve been stealing her clothes for a lifetime. My mom was always like, “What are you doing?” Because she always thought that the costumes were incredibly important and worthy of archiving, but I’ve been explaining to her for many, many years, “Mom! Listen, with just your fashion choices in general, you defined an era. These T-shirts are a curated collection!” But that’s not the point. We’re here to talk about you!\n\nAG Who cares! I like being able to talk to you.\n\nTER There’s so much I want to talk to you about! Let’s just dive in. When did you make a decision to love the skin you’re in? Was it something that you found your way to, or was there a particular moment?\n\nAG It would be so much easier to be like, “This is the date, time, and experience I had,” but there really isn’t one. It was more about experiences in my life of devaluing the fact that I was an average, normal girl living in the city. But being told, “You’re fat,” “You’re ugly” or “You’re just not good enough,” and trying to live in these model standards, that was my normal. I think I hit bottom around 18. I was disgusted with myself and told my mom I was coming home. And she told me, “No, you’re not, because you told me that this was what you wanted and I know you’re supposed to do this. It doesn’t matter what you think about your body, because your body is supposed to change somebody’s life.” To this day that sticks with me because I’m here today and I feel that it’s okay to have cellulite.\n\nTER In our culture it’s a big, ugly word, but it’s such a normal part of the human body. As women, we’re taught to see through the eyes of other people instead of our own.\n\nAG I remember my first signs of cellulite, in middle school. I remember telling my mom, “Isn’t it disgusting? It’s so ugly.” She pulled her pants down and said, “Look, I have it, too.” And I was like, “Gasp!” She looked at me, then at it, and just rolled her eyes. She didn’t tell me that it’s beautiful or ugly. She just made it a nonissue. It doesn’t define my worth. If women like you and me continue to preach that, then I feel like younger girls are going to grasp it and they’re going to be like, “Who cares!”\n\nTER In high school, I came up with the Jell-O and earthquake test. I’d stomp my foot on the floor while staring, naked, in the mirror so I could watch how long my ass jiggled. If it made me uncomfortable, it meant I had more work to do.\n\nAG I think you have one of the best asses in the industry!\n\nTER Thank you. I never moved into being full-blown anorexic, but that was the sort of tenacious relationship I had with my body growing up. Do you have a mantra you say to yourself when things get tough?\n\nAG Absolutely, I have many. I grew up in a very Christian home, so words have power. I took that with me into every area of my life. If you say, “I’m fat,” that’s how you’re going to feel. If you say, “I’m stupid,” that’s how you’re going to start your day. I wake up sometimes and I feel like the fattest person alive, but I’m not going to let that affect the rest of my day. Say to yourself, “I like this day. I am bold, I am beautiful, and I am brilliant.” For me, that hits the interior, the exterior, and it makes me feel smart.\n\nTER I do the exact same thing! I get clear on what the specific thing is that is frightening me and then I can turn it around into a positive mantra. I keep little white index cards or put it on the home screen of my phone. You want young girls to start with these good thoughts. But I’m 44 and every day is [still] different. How old are you by the way?\n\nAG This year is the big three-oh.\n\nTER I don’t know why people are afraid of getting older. But we should have a conversation about the areas you have to moisturize, and what to do with the armpits as we get older.\n\nAG Should I be moisturizing my armpits?\n\nTER Moisturize them. Talk to them and make sure they should be doing what they’re doing, but do not forget them. Let’s shift gears. How does what’s happening in our country right now connect to your sense of activism and responsibility?\n\nAG I have never had so many political conversations with my girlfriends. If this year has done anything, it’s brought my friendships to a closer level. We’ve been able to get things off our chests and understand things better. We’ve become closer, even just my inner circle. I feel like a lot of American women have gotten closer and tighter and listened to each other more—and been more supportive of each other. It’s not just about the industry we’re in, but the world we’re in. Women have always had a stereotype of being catty or malicious; I think now we’re willing to bring our sisters up and fight for one another. At the end of the day, we just want equality and our rights.\n\nTER It’s a strange time, but I think it’s awakened a lot of people. What are your thoughts on social media? You use it as a wonderful tool.\n\nAG I think there are negative attachments to it as far as the face tuning and flawless face and big round butt and tiny waist. It’s like, We get it. But I honestly think social media has been a really great platform for young adults that haven’t been accepted. If nobody in their small town looks like them or is doing the same things as them, they can find people on the Internet.\n\nTER I agree. It’s a way to connect to a like-minded community, but it can obviously go either way. Who are your role models?\n\nAG Growing up, I idolized Beyoncé, J-Lo, and the Spice Girls. I was a mix between Ginger and Scary Spice. I wore the Scary buns and Ginger’s slutty, leopard outfits. Today, I have two role models. One of them is my mom. Just seeing how happy she has been going through [life] and how she’s handled every curveball is like, That’s a woman who has integrity and dignity and has been kind and generous to people around her. Business-wise, it’s Kathy Ireland. She’s OG. When she was younger and in Sports Illustrated she was like, I’m going to sell some socks and make a business. Now she has a billion-dollar company. Kathy Ireland, if you’re out there, I’m still trying to be your best friend. You’re on my vision board.\n\nTER Anything you want to say that I didn’t ask about?\n\nAG Buy my book! It’s called A New Model: What Confidence, Beauty, and Power Really Look Like and it comes out May 9th.\n\nON EYES (THROUGHOUT) MAYBELLINE EYE STUDIO COLOR TATTOO LEATHER 24HR CREAM GEL EYESHADOW IN CHOCOLATE SUEDE ON LIPS (THROUGHOUT) MAYBELLINE COLOR SENSATIONAL VIVID MATTE LIQUID IN NUDE THRILL", "images": ["https://vmagazine.com/wp-content/themes/vmagazine/images/search-white.svg", "https://vmagazine.com/wp-content/uploads/2020/02/Order-v124-300x600-1.jpg", "https://vmagazine.com/wp-content/uploads/2019/12/V107_SORRENTI_03.jpg", "https://vmagazine.com/wp-content/themes/vmagazine/images/mail.svg", "http://b.scorecardresearch.com/p?c1=2&c2=20773362&cv=2.0&cj=1", "https://vmagazine.com/wp-content/uploads/2019/12/V107_SORRENTI_01.jpg", "https://vmagazine.com/wp-content/themes/vmagazine/images/close.svg", "https://vmagazine.com/wp-content/themes/vmagazine/images/search.svg"], "top_img": "https://vmagazine.com/wp-content/uploads/2019/12/V107_SORRENTI_03.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Body Beautiful: Ashley Graham Bares All to Tracee Ellis Ross", "meta_data": {"fb": {"pages": 13397230804}, "viewport": "width=device-width, initial-scale=1.0,maximum-scale=1.0, user-scalable=no", "format-detection": "telephone=no", "google-site-verification": "SjfHn-gKXYNiWsxt47jus1sB0qrasWGaNVwIkC6olDQ", "robots": "noodp", "title": "Body Beautiful: Ashley Graham Bares All to Tracee Ellis Ross | V Magazine", "description": "Ashley Graham strips down in black and white and talks with her friend Tracee Ellis Ross about role models, mothers, and mantras in our summer issue—available to order here.", "keywords": "Ashley Graham, tracee ellis ross, b", "og": {"image": "https://vmagazine.com/wp-content/uploads/2019/12/V107_SORRENTI_03.jpg"}, "twitter": {"image": "https://vmagazine.com/wp-content/uploads/2019/12/V107_SORRENTI_03.jpg"}, "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://vmagazine.com/wp-content/themes/vmagazine/res/public/favicon/ms-icon-144x144.png", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://vmagazine.com", "summary": ""}