{"url": "www.inquisitr.com/4473276/blake-griffin-warned-by-l-a-clippers-bosses-kendall-jenner-not-welcome/", "text": "Blake Griffin has been warned by his L.A. Clippers bosses to keep his rumored reality TV star girlfriend Kendall Jenner away from the team locker room.\n\nThe NBA star and Kim Kardashian’s younger sister have been romantically linked now for about two weeks and if Clippers’ brass gets its way, things won’t progress much beyond that point.\n\n“He’s been warned that his new relationship with Kendall better not affect his form this season,” a source told Radar. “He’s not telling anyone yet whether they’re actually together, but Clippers bosses have told him that regardless, she’s not welcome to crash their locker room and distract everyone with the Kardashian circus. They saw what happened to [former Clipper] Lamar Odom when he was with Khloe [Kardashian] and they are not having that from their marquee player.”\n\nThe Clippers only recently signed Griffin to a massive, five-year $173 million extension, officially making him the face of the franchise with Chris Paul having recently been dealt to the Houston Rockets.\n\nNow, management seems to be of the mind if they are going to get a solid return on that investment Griffin needs to end things with Jenner before the so-called “Kardashian Kurse” takes effect.\n\nOver the years, the Kardashian/Jenner sisters have been romantically linked to a number of pro athletes, several of whom inexplicably began to suffer through rough patches in their careers right about the time they went public with one of the sisters.\n\nOdom’s NBA career tragically fizzled amid rampant rumors he was hooked on drugs while still married to Khloe Kardashian.\n\nLater, Khloe was romantically linked to Houston Rockets star James Harden during a stretch that saw his Houston Rockets tumble from a No. 2 seed in the Western Conference all the way down to a No. 7 seed.\n\nDuring his MVP runner-up 2016-17 season, Harden admitted he came to feel he needed to “eliminate” Kardashian from his life to get back to being himself.\n\nKendall Jenner is rumored to be dating Blake Griffin. [Image by Anthony Jones. Getty Images]\n\nHollywood Life also reported last season that LeBron James had words with Cleveland Cavaliers teammate Tristan Thompson after his play suffered during his early days of romancing Khloe.\n\nKim Kardashian was also infamously married to NBA veteran Kris Humphries for all of 72 days and former NFL boyfriend Reggie Bush never quite lived up to the super-stardom that was projected for him coming out of USC.\n\nDoc Rivers leads the .A. Clippers. [Images by Jim Rogash/Getty Images]\n\nFinally, Kanye West, Kim’s current husband, was recently hospitalized in the wake of suffering a “mental breakdown” and Scott Disick, the father of older sister Kourtney’s three young children, has long been dogged by drug and alcohol problems.\n\n[Featured Image by Harry How/Getty Images]", "images": ["https://secure.gravatar.com/avatar/09f1dd0b83489a375f1c46ebebbe6e08?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Kendall-Jenner-.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Doc-Rivers-.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Blake-Griffin-.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Glenn Minnis"], "canonical_link": "https://www.inquisitr.com/4473276/blake-griffin-warned-by-l-a-clippers-bosses-kendall-jenner-not-welcome/", "title": "Blake Griffin Warned By L.A. Clippers Bosses ‘Kendall Jenner Not Welcome’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}