{"url": "https://www.stereogum.com/2022481/mariah-carey-caution-review/franchises/the-week-in-pop/", "text": "Do you remember what you were doing the night of December 31, 2016? Just after midnight, I was at home watching Dick Clark’s New Year’s Rockin’ Eve With Ryan Seacrest, still smarting from Ohio State’s brutal loss to Clemson in the College Football Playoff, when onto my screen bounded Mariah Carey, apropos of nothing. Carey wasn’t promoting new music — her most recent album, the fabulously named Me. I Am Mariah… The Elusive Chanteuse, was more than two years old at the time — but she’d agreed to perform after the ball dropped to usher in 2017 on a literal high note.\n\nAnd then it happened: one of the most talented singers to ever cut a record suffered the most talked-about televised lip-syncing snafu since Ashlee Simpson.\n\nBeing a professional blogger, my first instinct was to document this debacle at stereogum dot com, and that’s exactly what I did. Twitter users performed their customary roasting. We all had a good laugh at Carey’s expense. And to her credit, rather than retreating into a bomb shelter, Carey laughed right along with us. By 2AM, she had tweeted a non-apology replete with emojis and the GIF equivalent of ¯\\_(ツ)_/¯: “Shit happens 😩 Have a happy and healthy new year everybody!🎉 Here's to making more headlines in 2017 😂.”\n\nShit happens 😩 Have a happy and healthy new year everybody!🎉 Here's to making more headlines in 2017 😂 pic.twitter.com/0Td8se57jr — Mariah Carey (@MariahCarey) January 1, 2017\n\nCarey didn’t take many Ls early on, but by now she’s used to shrugging off her failures. Most famously, when her powerhouse ’90s run ended post-Y2K, she found a way to bounce back triumphantly. Although “Loverboy” from her musical rom-com Glitter went all the way to #2 and went on to become 2001’s bestselling single, Carey suffered an emotional breakdown during the project’s promotion, delaying its release. Both the film and its soundtrack flopped. (Bizarrely, Carey’s fans conspired to send the album to #1 on iTunes this week in a display of #JusticeForGlitter.) Glitter’s 2002 follow-up Charmbracelet failed to generate a real hit, and although it eventually went Platinum, this was a boom time for the industry when Napster hadn’t yet destroyed sales and the likes of Britney Spears, Eminem, and N ‘Sync were going Diamond on the regular.\n\nCarey seemed to have been fully supplanted by a wave of younger, TRL-minted celebrities. Yet she proved reports of her career’s death to be premature by returning to glory with the 6x Platinum The Emancipation Of Mimi, the biggest album of 2005, and its 14-week #1 hit “We Belong Together,” one of the most dominant singles in music history. The album also generated a second #1 hit in “Don’t Forget About Us” plus “Shake It Off,” which made it to #2 behind “We Belong Together” (and, later, Kanye West’s “Gold Digger”). Pop’s reigning diva was officially back.\n\nIn the 13 years since, Carey has never approached the splendor of her Mimi era. She did make it back to #1 for the 18th(!) time with “Touch My Body,” the lead single from 2008’s E=MC². But it’s been a full decade since the former queen of the charts has sniffed that kind of success. She now goes four or five years between albums, sometimes because her release dates get pushed back when the singles she releases to drum up attention don’t take off. In recent years she’s been more famous as an American Idol judge and a subject of tabloid gossip than a recording artist. There’s no denying her status as a legacy act; on New Year’s Eve, she was there to sing her classics. Yet when the albums do come out, they remain quietly stunning collections of pop-R&B. And tomorrow she’s about to release another one.\n\nCaution, Carey’s first album since that New Year’s mishap, has yet to generate a hit unless you count “With You” reaching #11 on the Adult Contemporary chart and failing to crack the Hot 100 — which, in the context of this woman’s statistically extraordinary career, absolutely should not count. But don’t let that dissuade you from checking it out if you’ve ever enjoyed a Mariah Carey song in your life. Like Elusive Chanteuse, this latest collection contains ample delights — and this time they aren’t even stranded on a bloated 15-song tracklist (18 if you’re streaming Chanteuse deluxe). Instead, Caution clocks in at an eminently reasonable 10 tracks in 38 minutes, prioritizing quality over quantity.\n\nThe album eases you in with some immaculate slow jams, a vibe that prevails throughout. First comes the dreamy, computerized “GTFO.” Produced by Drake favorite Nineteen85, it turns Aubrey’s favored post-midnight desolation into a powerful diorama of love falling apart. When Carey declares, in a measured cadence that descends into an emotive flurry, “How bout you get the fuck out?” you feel the sting. That’s followed by “With You,” a different sort of ballad: warm, organic, built from little more than gospel piano and booming 808s. When she leans into the hook, “Damn, I fucks with you,” you feel that too.\n\n“Caution” is less noteworthy, a slow-creeping Destiny’s Child throwback that feels more like a deep cut than a title track given spotlight placement on the tracklist. Fortunately the serviceable “A No No” comes along next to pick up the pace with skittering hi-hats and staccato keyboard stabs. Produced by Skrillex, Poo Bear, and Lido, the steamy romance anthem “The Distance” is even better: sampled cheerleader chants, funky digital bass, the ubiquitous Ty Dolla $ign? Sign me up. And the minor-key bump-and-grind “Giving Me Life,” which features backing vocals from Blood Orange(!) and a guest verse from Slick Rick(!!), lives up to its name every time.\n\nMost of the rest is unremarkable: The sex swoon “One Mo’ Gen” and attempted piano tearjerker “Portrait” belonged on the trash heap, while the casually booming Gunna collab “Stay Long Love You” is a mildly enjoyable trip to Carey’s wheelhouse. But at least stick around to marvel at the Timbaland-produced “8th Grade,” which successfully weaves trap drum programming and Migos triplets into the sound of a luxuriant R&B ballad from Carey’s ’90s heyday. It’s one more low-key pleasure on an album full of them.\n\nLook: Carey isn’t what she used to be. Time has reined in that gargantuan vocal range. Her songs are no longer seasoned with those preposterously high whistle vocals that used to be her trademark. No Carey song since the George W. Bush administration has generated as much pop-cultural noise as her divorce from Nick Cannon and subsequent dating life, her cataclysmic feud with fellow Idol judge Nicki Minaj, or the reemergence of her iconic J-Lo putdown “I don’t know her” as one of the most merciless GIFs on the internet. The outrageous persona once glimpsed in her legendary episode of MTV Cribs now completely outshines her musical output.\n\nCarey doesn’t even appear to be aiming for her old blockbuster status anymore, given that Caution is more of a grown-and-sexy R&B album that fully concedes her former role as queen of the hip-hop-adjacent divas to her longtime enemy/Mini Me Ariana Grande. On the other hand, the album doesn’t venture all that far from Carey’s old comfort zone. Give or take an F-bomb or hypermodern collaborator, quite a few of its songs are easy to imagine as smash hits from 1996, which suggests the music industry has changed far more than Mariah Carey has.\n\nIn the age of infinite stimulation, controlled simmers like “GTFO” and “Giving Me Life” are never going to grab people’s attention like a good, old-fashioned public embarrassment. Carey surely knows this, and she’s more than capable of thriving in a celebrity economy that runs on endless drama. What Caution suggests is that she remains just as adept at making records whether the world is listening or not. In its own way, the album is as much of an act of stubborn defiance as her “shit happens” tweet.\n\nMaybe no one will remember this album a few months from now. Chances are most people have also forgotten what went down the night we rang in 2017. The fact is, almost everything disappears into the past — triumphs, embarrassments, and all. For most singers, that merciless march forward would have subsumed their entire careers by now. How many artists who were popping in 1990 are still going? All things must pass, but the world hasn’t yet forgotten Mariah Carey, and Mariah Carey surely hasn’t forgotten how to sing a song. Cackle all you want; anyone releasing an album this good three decades into her career is having the last laugh.\n\nCREDIT: Kevin Winter/Getty Images for iHeartMedia\n\nCHART WATCH\n\nAriana Grande has her first #1 hit. Grande’s remarkable “thank u, next” enters the Hot 100 at #1 this week, ending a seven-week run by Maroon 5 and Cardi B’s “Girls Like You.” It’s Grande’s 11th top 10 hit, the first song by a woman to debut at #1 since Adele’s “Hello” three years ago, and the only song by a female artist to hit #1 this year without a male artist also on the track — previously we’ve seen Ed Sheeran and Beyoncé’s “Perfect Duet,” Camila Cabello and Young Thug’s “Havana,” Cardi B, Bad Bunny, and J Balvin’s “I Like It,” and the aforementioned “Girls Like You” by Maroon 5 and Cardi.\n\nMore trivia: Grande becomes the first artist to debut the lead single from her first five albums in the top 10. The others: “No Tears Left To Cry” from Sweetener earlier this year, Dangerous Woman’s title track in 2016, My Everything’s “Problem” featuring Iggy Azalea in 2014, and “The Way” featuring Mac Miller from her debut Yours Truly in 2013.\n\n“Girls Like You” is now #2, with Travis Scott and Drake’s “Sicko Mode,” Marshmello and Bastille’s “Happier,” and Juice WRLD’s “Lucid Dreams” bumped to #3, #4, and #5 respectively. Halsey’s “Without Me” rises to a new #6 peak, followed by Post Malone’s “Better Now” at #7 and Kodak Black/Offset/Travis Scott’s “Zeze” at #8. Sheck Wes reaches a new #9 high, and Lil Baby and Gunna’s “Drip Too Hard” rounds out the top 10.\n\nOver on the Billboard 200, Metro Boomin scores his first #1 album with 99,000 equivalent album units for his star-studded Not All Heroes Wear Capes, 92,000 of them via streaming. It’s the third top 10 release to have the producer’s name attached as an artist following his Big Sean collab Double Or Nothing and Without Warning alongside Offset and 21 Savage, though he of course contributed heavily to major releases like Future’s DS2.\n\nAfter the extremely resilient A Star Is Born soundtrack at #2 comes another soundtrack, Bohemian Rhapsody, up from #25 to #3 with 59,000 units / 24,000 sales now that the Queen biopic has made its theatrical debut. It’s the highest charting Queen album in 38 years, since The Game spent five weeks at #1 in 1980, Billboard reports. Also in the top 10 at #9 with 39,000 units is Queen’s Greatest Hits I II & III: The Platinum Collection.\n\nTakeoff of Migos enters at #4 with 49,000 units for his debut solo album The Last Rocket, which means all three Migos now have landed solo albums in the top five (if you’re counting Offset’s Without Warning alongside 21 Savage and Metro Boomin, which Billboard is, even though that’s not really a solo album… anyhow, Offset’s got an actual solo LP coming in December, so this will probably be a moot point shortly). The rest of the top 10 comprises the usual suspects: Drake, Lil Wayne, Lil Baby and Gunna, Travis Scott, and Post Malone.\n\nPOP FIVE\n\nZayn & Nicki Minaj – “No Candle, No Light”\n\nAnd to think I used to really enjoy both of these artists!\n\nDido – “Hurricanes”\n\nThe first new Dido song in five years is a brooding trip-hop epic that’s making me wonder why I’ve never spent any time with her discography beyond “Thank You.” It’s called “Hurricanes,” but this shit sounds like winter setting in and I am here for it.\n\nAlessia Cara – “Not Today”\n\n“Not Today” is such a pleasant-sounding soul-pop ditty that you might not realize what kind of real talk Alessia Cara is spitting: “You don’t know what sadness means/ ‘Til you’re too sad to fall asleep/ One day I’ll be snoozing peacefully/ But surely not today.” It’s exciting to see stars like Cara and Shawn Mendes being so real about their struggles with depression.\n\nNormani & 6LACK – “Waves”\n\nNormani is going places! The race for post-Fifth Harmony supremacy is officially on. Watch your back, Camila!\n\nJennifer Lopez & Bad Bunny – “Te Guste”\n\nWhat’s better: the song or the glasses?\n\nNEWS IN BRIEF\n\nMiley Cyrus is among the many who lost their homes in the California wildfires. [Twitter]\n\nThe judge overseeing Dr. Luke’s defamation suit against Kesha denied Katy Perry’s request to keep the transcript of her deposition from being made public. [THR]\n\nPage Six claims that John C. Reilly went “ballistic” when Marshmello wouldn’t take his mask off for a photo. [Twitter]\n\nLil Xan is going to rehab. [TMZ]\n\nMoments before taking the SNL stage with Lil Wayne, Halsey got something he wrote on her arm preserved forever as a tattoo. (It’s a reference to one of Weezy’s lyrics from “She Will.”) [Twitter]\n\nBruno Mars will provide 24k meals to the Salvation Army Hawaiian & Pacific Islands Division’s 48th annual Thanksgiving Dinner meal program. [Page Six]\n\nAriana Grande shared a rare video of Max Martin, working with her in the studio on “No Tears Left To Cry.” [Twitter]\n\nJohn Legend covered U2’s “Pride (In The Name Of Love)” at the People’s Choice Awards. [YouTube]\n\nShawn Mendes covered Kings Of Leon’s “Use Somebody” for his Spotify Single. [Spotify]\n\nEllie Goulding, Diplo, and Swae Lee released a video for “Close To Me.” [YouTube]\n\nKeith Urban won Entertainer Of The Year at the CMAs, 13 years after winning in that category for the first time. (Kacey Musgraves won Album Of The Year, hooray!) [Tennesseean]\n\nHOLD ON, WE’RE GOING HOME", "images": ["https://static.stereogum.com/uploads/2020/04/unnamed-36-1587129743-146x146.jpg", "https://static.stereogum.com/uploads/2020/04/black-dresses-peaceful-as-hell-1586786241-146x146.jpg", "https://static.stereogum.com/uploads/2020/04/FIONAAPPLECOVER-1587130054-146x146.jpg", "https://static.stereogum.com/uploads/2020/04/Lido-Pimienta-Miss-Colombia-1586785827-146x146.jpg", "https://static.stereogum.com/uploads/2018/11/Mariah-1542226357-608x402.jpg", "https://static.stereogum.com/uploads/2020/04/Westside-Gunn-Pray-For-Paris-1587132274-146x146.jpg", "https://static.stereogum.com/uploads/2020/04/Stay-Inside-Viewing-1586792109-146x146.jpg", "https://static.stereogum.com/uploads/2020/04/a3565109622_10-1586532648-146x146.jpg", "https://assets.stereogum.com/wp-content/themes/stereogum/assets/images/logo.svg", "https://static.stereogum.com/uploads/2020/04/Rotting-Out-Ronin-1586541196-146x146.jpg", "https://lib.pgmcdn.com/choices/collisionadmarkerwht.png", "https://assets.stereogum.com/wp-content/themes/stereogum/assets/images/logo-white.svg", "https://static.stereogum.com/uploads/2018/11/Mariah-1542226357-compressed.jpg", "https://static.stereogum.com/uploads/2018/11/GettyImages-966939324-1542040957-640x438.jpg", "https://www.stereogum.com/wp-content/plugins/wp-pi-comments/images/loader.svg"], "top_img": "https://static.stereogum.com/uploads/2018/11/Mariah-1542226357-608x402.jpg", "keywords": [], "authors": ["Chris Deville"], "canonical_link": "https://www.stereogum.com/2022481/mariah-carey-caution-review/franchises/the-week-in-pop/", "title": "While You Were Laughing At Mariah Carey She Was Making Yet Another Dope Album", "meta_data": {"viewport": "width=device-width", "description": "Do you remember what you were doing the night of December 31, 2016? Just after midnight, I was at home watching Dick Clark's New Year's Rockin' Eve With Ryan", "og": {"title": "While You Were Laughing At Mariah Carey She Was Making Yet Another Dope Album", "type": "article", "url": "https://www.stereogum.com/2022481/mariah-carey-caution-review/franchises/the-week-in-pop/", "image": {"identifier": "https://static.stereogum.com/uploads/2018/11/Mariah-1542226357-608x402.jpg", "width": 608, "height": 402}, "site_name": "Stereogum", "description": "Do you remember what you were doing the night of December 31, 2016? Just after midnight, I was at home watching Dick Clark's New Year's Rockin' Eve With Ryan Seacrest, still smarting from Ohio State's brutal loss to Clemson in the College Football Playoff, when onto my screen bounded Mariah Carey, apropos of nothing. Carey wasn't promoting new music — her most recent album, the fabulously named Me. I Am Mariah… The Elusive Chanteuse, was more than two years old at the time — but she'd agreed to perform after the ball dropped to usher in 2017 on a literal high note. And then it happened: one of the most talented singers to ever cut a record suffered the most talked-about televised lip-syncing snafu since Ashlee Simpson. Being a professional blogger, my first instinct was to document this debacle at stereogum dot com, and that's exactly what I did. Twitter users performed their customary roasting. We all had a good laugh at Carey's expense. And to her credit, rather than retreating"}, "article": {"published_time": "2018-11-15T16:32:34Z", "modified_time": "2018-11-16T07:01:45Z"}, "twitter": {"card": "summary", "title": "While You Were Laughing At Mariah Carey She Was Making Yet Another Dope Album", "description": "Do you remember what you were doing the night of December 31, 2016? Just after midnight, I was at home watching Dick Clark's New Year's Rockin' Eve With Ryan Seacrest, still smarting from Ohio State's brutal loss to Clemson in the College Football Playoff, when onto my screen bounded Mariah Carey, apropos of nothing. Carey wasn't promoting new music — her most recent album, the fabulously named Me. I Am Mariah… The Elusive Chanteuse, was more than two years old at the time — but she'd agreed to perform after the ball dropped to usher in 2017 on a literal high note. And then it happened: one of the most talented singers to ever cut a record suffered the most talked-about televised lip-syncing snafu since Ashlee Simpson. Being a professional blogger, my first instinct was to document this debacle at stereogum dot com, and that's exactly what I did. Twitter users performed their customary roasting. We all had a good laugh at Carey's expense. And to her credit, rather than retreating", "image": "https://static.stereogum.com/uploads/2018/11/Mariah-1542226357-608x402.jpg"}, "generator": "WordPress 4.7.4", "fb": {"pages": 13472576978}}, "movies": [], "publish_date": 1542299554.0, "source": "https://www.stereogum.com", "summary": ""}