{"url": "https://www.harpersbazaar.com/culture/film-tv/a19875825/westworld-season-2-episode-1-premiere-recap/", "text": "🚨 Spoilers for Westworld Season 2 Episode 1, \"Journey Into Night,\" below. 🚨\n\nWestworld is back for round two, which means the next several months will largely consist of you getting into arguments on Reddit and feeling extremely uncomfortable about Sophia the Robot's presence in your Twitter feed. But before we jump into Season 2, Episode 1, let's go over where we left off with the Season 1 finale:\n\nDolores shot Dr. Ford at a party celebrating his final narrative. Said party was filled with Delos employees, whoops.\n\nAt the same time, Maeve's robot rebellion began—and the Man in Black was shot in the arm.\n\nMaeve made what appears to be her first sentient decision, opting to stay in the park to find her daughter.\n\nTeddy, Bernard, and presumably the rest of the robots are in the nascent steps of self-realization. (Remember, the order is Memory > Improvisation > Consciousness.)\n\nA note about this episode's timeline: The Season 2 premiere seems to take place during two time periods. The first is the present day; it follows Bernard hooking up with Delos' tech team, features weird flashbacks that show Dolores in modern-day garb, and ends with Bernard admitting to killing all the hosts. The second is two weeks prior, in the immediate aftermath of the board gala massacre. This is where the majority of the episode takes place.\n\nReal quick, here's a side-by-side of Bernard's differing looks between two weeks ago and present day. Why he changed outfits is unclear, but this is a helpful identifier if you ever find yourself confused about which Bernard you're watching.\n\nLeft: Bernard two weeks ago; Right: Bernard present day. HBO\n\nWithout further ado, let's get to the recap.\n\nPRESENT DAY\n\nWe learn Westworld's location.\n\nThe Westworld premiere begins with Bernard (wearing a gray suit) lying on the beach surrounded by bodies. Based on the length the park's been \"offline,\" it's been about two weeks since Maeve and Dolores' robot rebellion.\n\nBernard appears disoriented and confused as he's carted off by Stubbs (hi, Stubbs, long time no see!) and a very serious-looking SWAT team to meet Delos' Head of Operations, Karl Strand (Gustaf Skarsgård). He's arguing about jurisdiction with a group of soldiers speaking Chinese.\n\nThis implies that Westworld is an island in Asia, which falls in line with a fascinating discovery a Reddit user made in 2016: That Westworld's Finnish subtitles show the park's map coordinates, and places it in the Spratly Islands—a disputed group of islands in the South China Sea that are occupied by military forces from Malaysia, Taiwan, China, the Philippines, and Vietnam.\n\nCoordinates found in the Finnish Westworld subtitles. HBO/Reddit\n\nIf Westworld exists in this cluster of islands, it stands to reason that the rest of Delos' parks do as well. Either way, Delos' Head of Operations announces that there are search and rescue teams at the \"rest of the parks.\" Does this mean Dolores and Maeve's rebellion has crossed park borders? The appearance of a Bengal tiger from Park 6 towards the end of the episode certainly implies that borders have been breeched.\n\nSomething weird is going on with the maze imprinted on the hosts' scalps.\n\nRemember last season when The Man in Black discovered a maze drawing on the underside of Kissy's scalp?\n\nHBO\n\nIn this episode, the maze drawing is discovered once again after technician Antoine Costa (Fares Fares) opens up a host's head. And while the man in the middle of the maze on both Kissy's head and this new host's head both have their arms outstretched, the man in the maze Dolores discovers has one arm facing in—to his head.\n\nLeft: The scalp from Season 2, Episode 1. Right: Dolores’ maze toy. HBO\n\nI'm of the belief that nothing in Westworld is an accident, and the show wouldn't remind us of this whole scalp-maze-thing if there wasn't a good reason. Is it possible that Ford secretly placed this pattern on the host's scalp, and that once they achieve the Bicameral Mind one arm moves towards the brain—indicating partial consciousness? I'm not sure, but pay attention to the nuances of this drawing going forward. People tend to argue about it a lot on Reddit, so if you're interested in that fun time, head over here.\n\nWe learn the hosts record video of everything.\n\nTurns out the hosts' \"brains\" are essentially a baseball-sized camera floating in a pool of fluid surrounded by metal. We don't know much about how the system works just yet, but we do learn the hosts are recording everything. In the case of the host who gets scalped by Delos tech, the camera recorded footage of his death-by-Dolores, who clearly isn't interested in saving her robot buddies and can be heard saying, \"Not all of us deserve to make it to the valley beyond.\"\n\nHBO\n\nNote: Is it possible that Dolores is aware that repeat trauma is key to \"waking up\" the rest of her kind? Maybe she's just doing this dude a solid to get the process started.\n\n\n\nBernard killed hundreds of hosts, but why?\n\nThe last image of the episode is Bernard and Team Delos standing by a previously non-existent lake filled with the bodies of dead hosts—including what appears to be Teddy.\n\nHBO\n\nBernard then announces he killed all the hosts. This raises several questions, the most obvious being, how did that lake get there and why would Bernard kill his fellow hosts? My personal theory is that Bernard hooked up with Dolores at some point post-Ford's death, and she encouraged him to slaughter the hosts she didn't find worthy of reaching the \"valley beyond.\"\n\nTWO WEEKS AGO\n\nBernard discovers a secret Delos underground lab.\n\nA brief summary of Bernard's movements post-Ford's death: After a massacre of all their Delos Board buds, he and Charlotte Hale manage to escape to a secret lab that Bernard doesn't know about. While there, Bernard suffers a near critical break, but manages to save himself by injecting another host's brain fluid into his neck. Bernard is wearing a black suit during these scenes.\n\nSome things to note:\n\n1) There's a new type of robot we've never met.\n\nMeet the Drone Host, a faceless robot whose sole purpose seems to be extracting camera footage from hosts, tracking human experiences in the park, and stealing human DNA. This is apparently part of Delos' yet-to-be-revealed master plan.\n\nHBO\n\nThe Drone Host doesn't seem to recognize Bernard as a fellow host or a threat, and furthermore, the lab door recognizes his DNA and allows him to enter. We know Bernard doesn't have human DNA, so I'm inclined to think Ford re-jiggered the system to allow Bernard in, and his infiltration of the lab is A) part of Ford's new pre-written narrative, and B) a way for him to posthumously f*ck with Delos.\n\n2) It's clear Bernard is malfunctioning, but why?\n\nLast season, Felix Lutz informed us that a bullet had damaged an important part of Bernard's robot brain, and his leaking fluid certainly indicates a technical injury. But my question is—and please bear with me because this is somewhat complicated—how far out into the future did Ford program Bernard, or even his narrative as a whole? What happens to a robot if the person secretly programming their every move dies? Did Ford plan out Bernard's movements and decisions post-rebellion? And if not, is it possible that since Bernard isn't fully conscious yet, he's finding it hard to function without a puppet master?\n\nHBO\n\n3) We learn the Drone Hosts are \"off network\"—so who is controlling them?\n\n\n\nThe hosts are largely being driven by Ford's new rebellion narrative, but during this episode we learn the drone hosts are \"off network.\" So, are they currently the only hosts immune from said narrative? I'd normally say yes, but the fact that Bernard was allowed into the laboratory makes me think Ford's reach has potentially extended to this area as well.\n\nHBO\n\n4) The mesh network could change everything.\n\nWhile Bernard helps Charlotte track down Abernathy (more on him in a sec) we discover the existence of a \"mesh network\"—a \"subconscious link\" that allows hosts to contact and exchange information with each other—akin to ants communicating in a colony. If there is a human vs. robot war, the fact that robots have what appears to be a hive mind definitely seems like a bonus.\n\n\n\nWe finally know what's up with Abernathy\n\nWondering why Delos took an entire two weeks to rescue everyone inside Westworld? Because of one Peter Abernathy. During Charlotte and Bernard's time in the lab, Charlotte sends a distress call to Delos, who refuse to begin rescue procedures until they have a \"package.\" That package = Abernathy, whom, you might recall, Hale and Sizemore uploaded with years worth of Delos data. We haven't caught up with Abernathy as of yet, but Reddit has a fascinating theory that Ford viewed him as a vessel he could upload his own personality into, thus living on forever. Read more about that here.\n\nDolores is on a killing spree and she's FULLY conscious\n\nDolores and Teddy are now Westworld's version of Bonnie and Clyde, and from what I can tell, they spent the immediate aftermath of Ford's death killing people; Dolores specifically spent a lot of time giving speeches about how conscious she is. Most significantly, she muses, \"I've evolved into something new and I have one last role to play: myself.\"\n\nGiphy\n\nDolores also seems to be infatuated with a very confused Teddy (bless him), and they share a romantic moment in which Dolores casually announces her plan for world domination. Assuming this scene took place shortly after Dolores killed Ford, it's possible she and Teddy will leave the park in future episodes (more on that in a minute).\n\nThe Man in Black has a new game to play.\n\nGood news: The Man in Black survived the host massacre, and he meets and kills Ford's robotic child incarnation soon after—but not before said child tells him to find \"the door\" as part of a new game. Honestly, The Man in Black's life seems exhausting, but what's really relevant here is that Child Ford now has what appears to be the glitchy voice of Adult Ford, indicating that Westworld's genius mastermind found a way to live on forever after all.\n\nMaeve is back, Hector's alive, and Lee Sizemore is the worst.\n\nHBO\n\nMaeve's storyline is probably the most linear and easy to understand at this point in Season 2: Basically, she makes her way back into the Delos labs to discover everyone's been slaughtered, meets up with Hector, finds a very traumatized Lee Sizemore, and they all set off to find Maeve's daughter—who still lives in the family-friendly homestead area of the park.\n\nTHE...FUTURE? MAYBE?\n\nTowards the beginning of the episode we see footage of Bernard holding a rapid-fire gun in the Delos labs (the same kind Maeve and Hector killed all the techs with) and we also see Dolores in a modern-black dress. I'd argue that they're (maybe!) both flash-forwards.\n\nWhile it's certainly possible that A) this footage exists in the two-week period between Dolores' rebellion and the Delos swat team's arrival, or B) the footage of Dolores takes place in the distant 35-years-ago past, I think it's possible that Westworld set up a new timeline for us: the future.\n\nWe know the show loves itself a confusing and non-linear narrative, and references to the future were big during this episode—especially during Dolores' speech to Teddy when she says, \"I see it all now so clearly: the past, the present, the future. I know how this story ends. With us, Teddy.\"\n\nHBO\n\nWe also need to discuss the very first scene in the show, which I initially assumed was a flashback to a circa 35-years-ago conversation between Arnold and Dolores, in which the former describes a dream about Dolores + Water + Hosts.\n\nHBO\n\nAfter watching the full episode, it seems possible that Arnold is potentially referencing what takes place later in the episode (the death of multiple hosts in a body of water). My theory? This is actually a scene from the future, between Bernard and Dolores, who has been re-programed to remember nothing.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-index-1523395122.jpg?crop=1xw:1xh;center,top&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=1xw:1xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Mehera", "Mehera Bonner Is A News Writer Who Focuses On Celebrities", "Royals"], "canonical_link": "https://www.harpersbazaar.com/culture/film-tv/a19875825/westworld-season-2-episode-1-premiere-recap/", "title": "Westworld Season 2 Episode 1 Premiere Recap", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "The 'Westworld' Season 2 Premiere Delivered Complete Chaos", "description": "And introduced a whole new mystery.", "url": "https://www.harpersbazaar.com/culture/film-tv/a19875825/westworld-season-2-episode-1-premiere-recap/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-04-23 03:30:55", "published_time": "2018-04-23 02:05:00", "section": "Film, TV & Theatre", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Westworld Season 2 Episode 1 Premiere Recap - Westworld Journey Into Night Review", "description": "Westworld is back for round two, which means the next several months will largely consist of you getting into arguments on Reddit and feeling extremely uncomfortable about Sophia the Robot's presence in your Twitter feed. Here's everything you need to know.", "keywords": "westworld, westworld season 2, westworld season 2 premiere, westworld recap, westworld review, westworld season 2 episode 1, westworld season 2 episode 1 recap, westworld journey into night, westworld premiere recap", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,film-tv", "sailthru.date": "2018-04-23T02:05:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-westworld-premiere-recap-1524439921.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "The 'Westworld' Season 2 Premiere Delivered Complete Chaos", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1524420300.0, "source": "https://www.harpersbazaar.com", "summary": ""}