{"url": "https://www.bustle.com/p/98-degrees-2017-macys-parade-performance-will-take-you-right-back-to-the-90s-5547126", "text": "The Macy's Thanksgiving Day Parade is not only a great time to catch celebrities who typically stick to sunny Los Angeles sporting winter coats for the first time since New Year's Eve, but the musical performances can sometimes offer nostalgia alongside holiday cheer. This year, 98 Degrees performed a new song on the Macy's Parade and rightfully, Twitter was freaking out. It's just the kind of '90s moment we need right now.\n\nWell, that's not all that Twitter was reacting to during the performance. Al Roker introduced the group as an \"ageless boy band\" — which resulted in some friendly ridicule. The four middle-aged men still performing with 98 Degrees aren't exactly immortal, but they still look good and the song sounded great. Their new Christmas single is called \"Season of Love,\" not to be confused with \"Seasons of Love\" from the musical Rent and every high school theatre cast party you've ever attended. It's off the new 98 Degrees Holiday album Let It Snow that is available now and also includes classics like \"Have Yourself A Merry Little Christmas,\" \"Silent Night,\" and \"What Child Is This.\"\n\nThey performed atop the Hallmark \"Countdown to Christmas\" advent calendar float too, which was not only a fun number connection, but kind of put the wholesome cherry on this heartwarming cake. What is Christmas if not for fond memories of boy bands and '90s bliss? Combined with appearances by the Goo Goo Dolls and Gwen Stefani, the parade this year was truly a Thanksgiving throwback to remember. Here's what folks had to say online.\n\nAll I want for Christmas is to turn back time.\n\n\"Man Band,\" that's better.\n\nOK, no need to get too cynical. It's Thanksgiving, after all.\n\nActually, Andy Mientus from Smash, Drew Lachey played Mark in 2005. Close!\n\nGet out of here, bad joke.\n\nYou learn something new every day.\n\nLove how nobody can agree on exactly what year we're throwing it back to with this — maybe the group really is ageless.\n\nSee? Next thing you now, somebody will be calling this an '80s flashback.\n\nOK calm down.\n\nIsn't that depressing? Kids these days don't even know.\n\nBe honest — you watch Hallmark movies to see how your favorite '90s stars are doing too, don't you? This whole performance is kind of a mood.\n\nThey also performed \"Because Of You\" on Good Morning America if you want an additional dose of 1998. The reunion of the boy band, or \"man band \"or whatever you want to call it on the NBC broadcast hopefully started your holiday off with some much-needed reminiscing. Maybe you needed to remind your parents \"which one\" they were, if they ever cared to begin with — but it's important, OK?\n\nIf you're anxious for more, the group is going on a holiday tour with this new album. In an interview with Billboard, Nick Lachey said the album was inspired by touring with Ryan Cabrera. \"Ryan would literally be in his dressing room playing Christmas music, all summer long,\" he said. \" [We were] like, 'What's wrong with you?' He's like, 'It just makes you feel good, man!'\" It's different from the group's first Christmas album, actually, because of the years that have passed. They have families now.\n\n\"Everybody kind of understands that Christmas is about spending time with your family and appreciating what you have, \" said Drew Lachey in the same interview. \"So for that to be part of our family and our musical legacy, it’s definitely very special.\"\n\nAt least NBC didn't call 98 Degrees \"classic rock\" like they did with Goo Goo Dolls, causing every '90s kid out there to start arranging their funeral plot. Nostalgia should be fun, not remind you that life is fleeting and we're all basically ancient now. 98 Degrees and \"Season of Love\" deliver all the right feels.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/15/1c70e57d-cf55-412f-b52f-25641d410155-getty-1140923568.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/23/2abc8adb-569f-4057-b4ce-03c0c1b6e813-getty-871873228.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/3/18/b173f9fa-8e90-4dd2-9b32-776c185e85e1-hl12461666.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/2d21ebe8-9f96-4fc8-a8bc-d244baa6bbcb-getty-529590044.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/c046b701-5293-4a48-9511-754066590440-screenshot-588.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/23/2abc8adb-569f-4057-b4ce-03c0c1b6e813-getty-871873228.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/23/2abc8adb-569f-4057-b4ce-03c0c1b6e813-getty-871873228.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/98-degrees-2017-macys-parade-performance-will-take-you-right-back-to-the-90s-5547126", "title": "98 Degrees' 2017 Macy's Parade Performance Will Take You Right Back To The '90s", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/98-degrees-2017-macys-parade-performance-will-take-you-right-back-to-the-90s-5547126", "type": "article", "title": "98 Degrees' Macy's Parade Performance Was The Ultimate '90s Throwback", "description": "The Macy's Thanksgiving Day Parade is not only a great time to catch celebrities who typically stick to sunny Los Angeles sporting winter coats for the first time since New Year's Eve, but the musical performances can sometimes offer nostalgia…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/23/2abc8adb-569f-4057-b4ce-03c0c1b6e813-getty-871873228.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The Macy's Thanksgiving Day Parade is not only a great time to catch celebrities who typically stick to sunny Los Angeles sporting winter coats for the first time since New Year's Eve, but the musical performances can sometimes offer nostalgia…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}