{"url": "https://www.teenvogue.com/story/selena-gomez-mom-justin-bieber-break", "text": "Though Selena Gomez's mom, Mandy Teefey, hasn't exactly hidden the fact that she doesn't love her daughter's rollercoaster relationship with Justin Bieber, that disapproval is reportedly not the reason why Selena and Justin are rumored to currently be on a break. \"They're not on a break because of her relationship with her mom. They have their own issues and are always on and off,\" a source told People about Jelena this week. \"[Selena] wouldn't base her relationship off of what her mom thinks.\" The insider added, \"They've been having disagreements, but it wouldn't be surprising if they're back together in a week.\"\n\nSeveral outlets reported last week that the duo was spending some time apart, but People's source shares that they were definitely on good terms as recently as March 1, Justin's birthday, part of which they spent together. In honor of the special day, Selena appeared to post about Justin on Instagram for the first time since they reunited last fall: She shared a picture of herself with a Polaroid photo of someone who looks like JBiebs resting on her forehead, writing, \"March 1, 1994 someone I know that happens to be super cool was born. Boom.\"\n\nJust a few days after Justin's b-day, he and Selena were spotted attending the same church service separately, according to People. As a source explained to E!, \"They were having a lot of little disagreements recently and one fight in particular blew up and caused them to decide to 'break up,' however, they've been in contact the entire time and their feelings for each other have not changed...They will absolutely get back together and they are not over, but they both need some time away from each other.\" Another E! source mentioned Selena's currently \"not amazing\" relationship with her mother, but didn't explicitly link it to Justin and Selena's decision to take a short break.\n\nWhether or not she's influenced the state of Selena's relationship, there's no doubt that Mandy isn't a Jelena stan. In aJanuary interview*, Mandy admitted that she's \"not happy\" about her daughter's rekindled romance with the \"Sorry\" singer, who Selena first started dating back in 2010. That said, Mandy shared that she would never deliberately come between Selena and Justin. \"Selena can live her life however she wants as long as she is happy, safe and healthy,\" Mandy said. \"She is 25 years old and knows what is at stake with her health. I do not control her the way it has been portrayed. Selena is an adult and can make her own choices.\"\n\nRelated: Selena Gomez Just Made Justin Bieber’s Glasses Look Super Chic", "images": ["https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5aa7da09ee82aa5c3c84ac9d/16:9/w_2560%2Cc_limit/selena-justin.jpg", "https://assets.teenvogue.com/photos/5aa7e903ee82aa5c3c84aca2/16:9/w_1280,c_limit/selena-justin-fb.jpg"], "top_img": "https://assets.teenvogue.com/photos/5aa7e903ee82aa5c3c84aca2/16:9/w_1280,c_limit/selena-justin-fb.jpg", "keywords": [], "authors": ["Andrea Park", "Andrea Par"], "canonical_link": "https://www.teenvogue.com/story/selena-gomez-mom-justin-bieber-break", "title": "Selena Gomez's Mom Reportedly Isn't the Reason She and Justin Bieber Are Taking a Break", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Andrea Park", "copyright": "Copyright (c) Condé Nast 2020", "description": "Though many have speculated that Selena Gomez and Justin Bieber's current break has to do with the \"Wolves\" singer's mom, Mandy Teefey, it's reportedly not the case.", "id": "5aa7d3837644ea61b54a1ba8", "keywords": "culture,snd,selena gomez,justin bieber,mandy teefey, justin bieber", "news_keywords": "culture,snd,selena gomez,justin bieber,mandy teefey, justin bieber", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5aa7d3837644ea61b54a1ba8", "parsely-metadata": "{\"description\":\"Though many have speculated that Selena Gomez and Justin Bieber's current break has to do with the \\\"Wolves\\\" singer's mom, Mandy Teefey, it's reportedly not the case.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5aa7da09ee82aa5c3c84ac9d/16:9/w_1000,c_limit/selena-justin.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5aa7da09ee82aa5c3c84ac9d/1:1/w_1000,c_limit/selena-justin.jpg\"}", "og": {"description": "A source says Mandy Teefey hasn’t played a role in their break.", "image": "https://assets.teenvogue.com/photos/5aa7e903ee82aa5c3c84aca2/16:9/w_1280,c_limit/selena-justin-fb.jpg", "site_name": "Teen Vogue", "title": "No, Jelena's \"Break\" Doesn't Have Anything to Do With Selena Gomez's Mom", "type": "article", "url": "https://www.teenvogue.com/story/selena-gomez-mom-justin-bieber-break"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "A source says Mandy Teefey hasn’t played a role in their break.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5aa7e903ee82aa5c3c84aca2/16:9/w_1280,c_limit/selena-justin-fb.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "No, Jelena's \"Break\" Doesn't Have Anything to Do With Selena Gomez's Mom"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}