{"url": "https://web.archive.org/web/20080717022107/http://www.johnmccain.com/Informing/News/PressReleases/Read.aspx?Guid=e92e0317-02b3-4345-82f9-9eac8bb0a50d", "text": "For Immediate Release\n\nJuly 15, 2008 Contact: Press Office\n\n703-650-5550 John McCain's Comprehensive Strategy for Victory in Afghanistan\n\nToday, John McCain Outlined A New Comprehensive Strategy For Victory In Afghanistan. The status quo in Afghanistan is unacceptable, and from the moment the next President walks into the Oval Office, he will face critical decisions about Afghanistan. John McCain Is Calling For A New Strategy In Afghanistan That Applies The Tried And True Principles Of Counter-Insurgency Used In The Iraq Surge. As President, John McCain will turn around the war in Afghanistan with a comprehensive strategy for victory. In Afghanistan, we need an integrated, nationwide civil-military campaign that is focused on providing security for the population. John McCain's Comprehensive Strategy For Victory In Afghanistan: John McCain Will Work With Our Allies To Ensure Unity Of Command In Afghanistan. One of the reasons there is no comprehensive campaign plan for Afghanistan is because there is no unity of command. Today, there are no less than three different American military combatant commands operating in Afghanistan, as well as NATO. The top commander in Afghanistan needs to be just that: the supreme commander of all coalition forces operating a successful counter-insurgency strategy that integrates all instructs of our national power. John McCain Will Appoint An Afghanistan Czar To Ensure Commanders Have What They Need To Win. Unity of command is a principle lacking in Washington. Too often, even as our soldiers and diplomats cooperate in the field, their superiors back home have been squabbling. Last year, the Administration took a step in the right direction and appointed a war czar. But the situation in Afghanistan demands a separate Czar based in the White House, reporting directly to the President and dedicated to the sole mission of ensuring we bring the war in Afghanistan to a successful end. John McCain Supports Sending At Least Three Additional Brigades To Afghanistan. Our commanders on the ground say they need these troops, and thanks to the success of the surge, these forces are becoming available, and our commanders in Afghanistan must get them. John McCain Will Double The Size Of The Afghan Military. The Afghan army is already a great success story: a multiethnic, battle-tested fighting force. Yet, it's too small, with a projected strength of only 80,000 troops. We need to at least double the size of the Afghan army to 160,000 troops. To pay for this increase, the international community should share the costs. The United States and our allies should establish an international trust fund to provide long-term financing for the Afghan army. John McCain Will Increase Our Non-Military Assistance To The Afghan Government. Through a multi-front plan, we will increase assistance to the Afghan government to strengthen its institutions, the rule of law, and the economy. Essential to success of the mission in Afghanistan is getting control of narcotics trafficking. Alternative crops must be able to get to market and traffickers must be arrested and prosecuted by enhanced Special Courts. We should agree on specific governance and development benchmarks with the Afghan government and then work with them closely to ensure they are met. John McCain Will Enhance Our Regional Diplomatic Efforts By Appointing A Special Presidential Envoy. The violence in Afghanistan has many causes, but chief among them is the fact that the country is treated by some regional powers as a chessboard to pursue their own ambitions. John McCain will appoint a special presidential envoy to address disputes between Afghanistan and its neighbors. Our goal must be to turn Afghanistan from a theater for regional rivalries into a commons for regional cooperation. As Part Of This Regional Strategy, John McCain Will Put Special Focus On Pakistan. We must strengthen local tribes in the border areas who are willing to fight the foreign terrorists there. We must also empower the new civilian government of Pakistan to defeat radicalism with greater support for development, health, and education. ###\n\n", "images": ["https://web.archive.org/web/20080717022107im_/http://www.johnmccain.com/images/news/newsbox_picture.jpg", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/spacer.gif", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/mccain_07_header_02.jpg", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/news/icons/icons_arrow.gif", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/mccain_07_header_01.jpg", "https://web.archive.org/web/20080717022107im_/http://www.johnmccain.com/images/icons/icons_rightside_news.png", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/news/icons/icons_topics.gif", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/button_search2.jpg", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/news/icons/icons_videos.gif", "https://web.archive.org/web/20080717022107im_/http://images.johnmccain.com/Images/news/icons/icons_news.gif", "https://web.archive.org/web/20080717022107im_/http://www.johnmccain.com/images/icons/upcoming_events.png", "https://web.archive.org/web/20080717022107im_/http://www.johnmccain.com/Informing/News/PressReleases/spacer.gif"], "top_img": "https://web.archive.org/web/20080717022107im_/http://www.johnmccain.com/images/news/newsbox_picture.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "John McCain for President", "meta_data": {"description": "John McCain 2008 - The Official Website of John McCain's 2008 Campaign for President", "keywords": "John McCain, McCain, mccain for president, John S. McCain, McCain 2008, president, presidential, 2008, campaign, election, straight talk, straight talk express, politics, political, john mccain, john mccain for president, senator john mccain, sen. john mccain, cindy mccain, john mcain, john mckaine, john maccane, jon mccain, john maccaine, john mccaine, mccain 2008, johnmccain.com, senator mccain, mccain 2000, mccain campaign, mccain hq, exploremccain.com, explore mccain, mccain exploratory committee, mccain exploratory"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}