{"url": "www.gossip-addict.com/article/justin-bieber/gossipcop/5b02fc07e0544705e87fc9c7/hollywoodlife-caught-lying-about-taylor-swift-selena-gomez-and-justin-bieber?lang=en-us", "text": "HollywoodLife Caught Lying About Taylor Swift, Selena Gomez And Justin Bieber\n\n21/05/2018 19:00 - (Getty Images) HollywoodLife is regularly caught lying about Taylor Swift, Selena Gomez and Justin Bieber. Now the site has manufactured a single made-up story involving all three superstars. Gossip Cop can expose this blatant fabrication. In the wake of Gomez making a surprise appearance at Swift’s concert this weekend, the site is pretending to have “exclusive” insight on their friendship. The blog was seemingly inspired to concoct its narrative because Gomez celebrated her bond with Swift during an on-stage speech, in which she declared, “This person has never ever judged a single decision I’ve made.” To capitalize on the comments, HollywoodLife quotes a so-called “source” as saying, “Selena meant every word she said about Taylor.” This supposed snitch goes on to assert, “Taylor was literally the only one of Selena’s pals who never said anything bad about her getting back with Justin, she’s always just been there for Selena as a supportive and loving friend, no matter what.” While the sentiments are nice, the problem is that they completely contradict what the website has been telling fans for years. Throughout Gomez and Bieber’s years-long, on-and-off relationship, the outlet has repeatedly insisted that Swift objects to the romance. The evidence is still available right on the site itself, and Gossip Cop has gathered some of the headlines in a screengrab below. In 2014, for example, HollywoodLies, as it is nicknamed for its tendency to make-up bogus stories, claimed Swift was giving Gomez an ultimatum, demanding she dump Bieber or their friendship would be over. A few days later, the online publication followed up with a piece about their supposed “icy feud.” In 2015, amid speculation Gomez and Bieber might be reconciling, the blog claimed to have “exclusively learned” Swift was “hoping Jelena’s rekindled flame burns out real quick.” And in 2016, the outlet maintained Swift was “pushing” Gomez to cut ties with Bieber “for good.” But in the fall of 2017, HollywoodLies started to change course with a post that claimed Swift wouldn’t “judge” Gomez for getting back together with Bieber. There, an alleged “source” insisted Swift wasn’t going to let the relationship “affect their friendship negatively, as it might have in the past.” Now the website is ignoring that purported “past” completely, with its latest piece about how Swift has “never said anything bad” about Gomez being with Bieber and has been a loyal friend “no matter what.” At no point does the outlet acknowledge how this is inconsistent with the dozens of previous tales in its own archives. This is the result of the publication seemingly making up its articles as it goes along, as opposed to regularly investigating, researching and fact-checking with genuine sources. Gossip Cop, on the other hand, has done a number of stories over the years explaining how HollywoodLies has been wrong with its claims of a Bieber-fueled feud between Gomez and Swift. And on top of Gomez’s own statement about Swift never judging her, the sheer fact that their friendship has continued no matter how many times she and Bieber have gotten back together proves that our debunkings were correct. HollywoodLies’ lack of credibility isn’t just apparent with this particular storyline, but is also clear from the performers’ own comments. In a 2015 interview with Billboard, Gomez bluntly called the site “the worst,” and has also told fans on Instagram that it is “never true.” In 2016, Bieber tried to have HollywoodLife shut down, using his social media to deem the blog “untruthful and hurtful.” Given those remarks and the website’s documented history, there is zero reason to trust that it now has a legitimate “source” waxing poetic about Gomez and Swift’s friendship as it relates to Bieber. Rather, it appears the outlet has once again made it all up. (HL)", "images": ["https://cdn.mashup-web.com/img/sources/gossipcop-small.png", "https://cdn.mashup-web.com/img/header/logo-gossip.png", "https://cdn.mashup-web.com/img/categories/justin-bieber-small.png", "https://www.gossipcop.com/wp-content/uploads/2018/05/Taylor-Swift-Selena-Gomez-Justin-Bieber-Friendship.jpg"], "top_img": "https://www.gossipcop.com/wp-content/uploads/2018/05/Taylor-Swift-Selena-Gomez-Justin-Bieber-Friendship.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.gossip-addict.com/article/justin-bieber/gossipcop/5b02fc07e0544705e87fc9c7/hollywoodlife-caught-lying-about-taylor-swift-selena-gomez-and-justin-bieber?lang=en-us", "title": "HollywoodLife Caught Lying About Taylor Swift, Selena Gomez And Justin Bieber", "meta_data": {"msvalidate.01": "5AC107E9F0021A71E10A6C065F667AFD", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "rgba(0,0,0,1)", "description": "HollywoodLife Caught Lying About Taylor Swift, Selena Gomez And Justin Bieber", "article": {"published_time": "2018-05-21T17:00:58+00:00"}, "og": {"type": "article", "url": "https://www.gossip-addict.com/article/justin-bieber/gossipcop/5b02fc07e0544705e87fc9c7/hollywoodlife-caught-lying-about-taylor-swift-selena-gomez-and-justin-bieber?lang=en-us", "description": "(Getty Images)\nHollywoodLife is regularly caught lying about Taylor Swift, Selena Gomez and Justin Bieber. Now the site has manufactured a single made-up story involving all three superstars. Gossip Cop can expose this blatant fabrication.\nIn the wake of Gomez making a surprise appearance at Swift’s concert this weekend, the site is pretending to have “exclusive” insight on their friendship. The blog was seemingly inspired to concoct its narrative because Gomez celebrated her bond with Swift during an on-stage speech, in which she declared, “This person has never ever judged a single decision I’ve made.”\nTo capitalize on the comments, HollywoodLife quotes a so-called “source” as saying, “Selena meant every word she said about Taylor.” This supposed snitch goes on to assert, “Taylor was literally the only one of Selena’s pals who never said anything bad about her getting back with Justin, she’s always just been there for Selena as a supportive and loving friend, no matter what.”\nWhile the sentiments are nice, the problem is that they completely contradict what the website has been telling fans for years. Throughout Gomez and Bieber’s years-long, on-and-off relationship, the outlet has repeatedly insisted that Swift objects to the romance. The evidence is still available right on the site itself, and Gossip Cop has gathered some of the headlines in a screengrab below.\nIn 2014, for example, HollywoodLies, as it is nicknamed for its tendency to make-up bogus stories, claimed Swift was giving Gomez an ultimatum, demanding she dump Bieber or their friendship would be over. A few days later, the online publication followed up with a piece about their supposed “icy feud.” In 2015, amid speculation Gomez and Bieber might be reconciling, the blog claimed to have “exclusively learned” Swift was “hoping Jelena’s rekindled flame burns out real quick.” And in 2016, the outlet maintained Swift was “pushing” Gomez to cut ties with Bieber “for good.”\nBut in the fall of 2017, HollywoodLies started to change course with a post that claimed Swift wouldn’t “judge” Gomez for getting back together with Bieber. There, an alleged “source” insisted Swift wasn’t going to let the relationship “affect their friendship negatively, as it might have in the past.” Now the website is ignoring that purported “past” completely, with its latest piece about how Swift has “never said anything bad” about Gomez being with Bieber and has been a loyal friend “no matter what.” At no point does the outlet acknowledge how this is inconsistent with the dozens of previous tales in its own archives.\nThis is the result of the publication seemingly making up its articles as it goes along, as opposed to regularly investigating, researching and fact-checking with genuine sources. Gossip Cop, on the other hand, has done a number of stories over the years explaining how HollywoodLies has been wrong with its claims of a Bieber-fueled feud between Gomez and Swift. And on top of Gomez’s own statement about Swift never judging her, the sheer fact that their friendship has continued no matter how many times she and Bieber have gotten back together proves that our debunkings were correct.\nHollywoodLies’ lack of credibility isn’t just apparent with this particular storyline, but is also clear from the performers’ own comments. In a 2015 interview with Billboard, Gomez bluntly called the site “the worst,” and has also told fans on Instagram that it is “never true.” In 2016, Bieber tried to have HollywoodLife shut down, using his social media to deem the blog “untruthful and hurtful.” Given those remarks and the website’s documented history, there is zero reason to trust that it now has a legitimate “source” waxing poetic about Gomez and Swift’s friendship as it relates to Bieber. Rather, it appears the outlet has once again made it all up.\n(HL)", "site_name": "Gossip-Addict", "title": "HollywoodLife Caught Lying About Taylor Swift, Selena Gomez And Justin Bieber", "image": "https://www.gossipcop.com/wp-content/uploads/2018/05/Taylor-Swift-Selena-Gomez-Justin-Bieber-Friendship.jpg"}, "fb": {"app_id": 1453099068318992}, "twitter": {"site": "@FootAddictFR", "title": "HollywoodLife Caught Lying About Taylor Swift, Selena Gomez And Justin", "description": "(Getty Images)\nHollywoodLife is regularly caught lying about Taylor Swift, Selena Gomez and Justin Bieber. Now the site has manufactured a single made-up story involving all three superstars. Gossip Cop can expose this blatant fabrication.\nIn the wake of Gomez making a surprise appearance at Swift’s concert this weekend, the site is pretending to have “exclusive” insight on their friendship....", "card": "summary", "image": "https://www.gossipcop.com/wp-content/uploads/2018/05/Taylor-Swift-Selena-Gomez-Justin-Bieber-Friendship.jpg"}}, "movies": [], "publish_date": 1526922058.0, "source": "http://www.gossip-addict.com", "summary": ""}