{"url": "https://www.etonline.com/how-crazy-ex-gf-star-donna-lynne-champlin-kept-straight-face-singing-first-penis-i-saw-exclusive", "text": "The third season of Crazy Ex-Girlfriendhas taken a dark turn, successfully working through the pains of mental illness while mining both humorous and heartwrenching moments. It's a balancing act that's difficult to get right, but The CW musical dramedy has done it.\n\nAt the heart of it all is Paula Proctor (Donna Lynne Champlin), the BFF and motherly figure to the show's main protagonist, Rebecca Bunch (Rachel Bloom). Though she's had prominent storylines before, tonight's episode, the seventh of the season, puts her front and center. In \"Getting Over Jeff,\" Paula brings Rebecca along as she goes back home to Buffalo, New York, to visit with her dad, played by comedian Eddie Pepitone, and see if there's any spark left to her childhood crush, i.e. her Josh Chan, Jeff Channington. (Tellingly, this is also the first episode of the series to not feature Josh's name in the title.)\n\nWith all of the major changes Rebecca and the rest of the Crazy Ex crew have been through this season, ET spoke with Champlin to dish on her big episode, how on earth she kept a straight face while singing \"First Penis I Saw\" -- because, yes, it's about exactly what you think it is, complete with a dance number full of phallic vegetable props -- and being the mama bear on set.\n\nET: Rebecca has been reliant on Paula for so long that \"Getting Over Jeff\" felt long overdue. I was heartbroken for Paula at first, but by the end of the episode, I was so happy for her.\n\nDonna Lynne Champlin: That's the thing -- depending on who you are, you see her at the top of the episode as the victim or you see her as the perpetrator, as far as her family goes, and she's sort of reaping what she sowed. Especially women -- moms who are trying to hold down a job and a family, you do have that kind of feeling that you're damned if you do and you're damned if you don't. You're trying to be everything to everybody, and everyone still ends up pissed at you. And it's like, what the hell?\n\nHow on Earth did you keep a straight face while singing \"First Penis I Saw\"?\n\nWhere I just couldn't get it together was the first dance rehearsal. It's all a process. First I hear the song, and then I hear the lyrics, and then I laugh at that, and then you get used to the lyrics, and then you do dance rehearsal and you get ridiculous choreography. So, by the time you get to shooting, all the giggles are out, thank God, because we have so little time to shoot. It's ironically a very serious energy on set, even if you're doing a song with a cucumber in your hand singing about penises.\n\nIn reality, by the time we get to shooting, it is like being on an express train that's going 400 miles an hour. You have to jump on, hang on, get it done and don't f**k it up. With that song in particular, there were so many different sets: you've got the grocery store as is, then you've got the turntable and the mirror ball, then you've got the produce section, and then you've got them pulling out the produce and having that area as a dance stage. I'm not being overdramatic -- we had literally five minutes left, and we had not shot the dance break yet, which was in the cleared out produce area. The two other dancers were learning a really quick dance break, and I was learning it by watching them while I was standing still for makeup and hair, and then we had three minutes [left to film]. It's basically the three of us doing a dance break that we had just finalized, knowing we had one chance to do it, and they're playing the music and [choreographer Kathryn Burns] is screaming out from behind the camera what the next step is. It was absolute madness, but I have to say, the dance break kicked f**king ass. It was one of these amazing moments that I wish had been live theater, because I wish more people had witnessed it!\n\nEddy Chen/The CW\n\nRachel has said in the past that Crazy Ex was meant to be four seasons. With how much Paula has grown since season one, did you see this storyline with Jeff coming?\n\nWith her going back to Buffalo and dealing with her dad and dealing with Jeff, that's actually a seed that was planted before we shot the pilot. We had that scene outside Beans' house, and Paula says very specifically, 'I wish I had been as brave as you are when I was your age.' Prior to shooting that scene, me, Rachel, [co-creator] Aline [Brosh McKenna] and [producer] Marc Webb got into a room and worked out that we could shoot it as written and we could improv it a little bit. I think it was Aline who said that she absolutely wanted Paula to say that, so I really think this episode has been in the works before we shot the pilot.\n\nWhat was it like on set when you were filming some of the more difficult episodes this season?\n\nI love it. We have these moments where we know that we as a show are making a statement, whether that's by making a statement or by not making a statement, as we did with Paula's abortion [in season two]. I really do feel that there is a symbiotic coming together, especially with Rachel. We were at a table reading early on [this season], and she actually said to the group, 'I just want to let you guys know that the next four episodes are going to be very difficult for me, so if I'm not joking around, don't take it personally. It's just that I have to go to this headspace to do the job right.' And we were all like, 'Copy that, thanks for the heads up,' and it also allowed us as a group to keep eyes on her and, not that she needs it, but as her friend, every once in awhile in between takes just going, 'Are you good? Do you need a break? Can I help you in any way? Can I just shut up and leave you the f**k alone? Because I can do that, too.' It was really great because it opened the lines of communications for the company and it relieved her of the responsibility of having to be the cheery caption of the ship. So, we were well armed because we were well warned, and as a result, and it was an interesting parallel to what was happening with Rebecca's friends and Rebecca.\n\nWhen I spoke with Scott Michael Foster (Nathaniel Plimpton III) and Vella Lovell (Heather Davis) about singing on the show, they were both very demure about their skills. With your Broadway background, have any of the cast members come to you for advice?\n\nFirst of all, I call bulls**t on both of them. I have literally threatened to punch Scott Michael Foster in the face if he says one more time that he is not a singer or a dancer. I don't give them any advice because they don't need it! They're discounting how talented they really are. Second of all, they need to know their fierceness. Pete Gardner (Darryl Whitefeather) also says, 'Ooh, I'm not a dancer.' You wait! He has a number coming up where he raps and dances, and it is killer. Look at his famous 'Gettin' Bi' song! He was sh**ing bricks before he recorded that number, and he is astounding in it. So if anything, I call out their absurdity and insistence that they're any less talented or proficient than anybody else in this cast. Constantly. They need to look in the mirror and Stuart Smalley themselves because after three years, I'm not entertaining this.\n\nIt sounds like as Paula has a mom role to Rebecca, you also have one in real life with the cast.\n\nI do. And Pete Gardner does, too. The cast calls me Mama Bear. That's normal in casts -- you do fall into the role of your age or your character. Pete and I are definitely the parents, and happily so.\n\nVery important question: Do you prefer the boba shop or donut shop?\n\nI personally love the donut shop. My son loves it, too. He's 6, and every time he comes he wants to go that place and sit in the chairs. It's his favorite thing. But I will tell you, shooting out there is incredibly difficult, because it's very, very noisy. There are planes and there's a vet hospital across the street and an auto repair shop. I don't know what's going to happen if we have a season four, but I do know that everyone is very frustrated with shooting in that area, because it is the noisiest part of Los Angeles. Rachel kept joking whenever we shot there, \"We're just going to have an inside donut shop, because I can't take this anymore!'\n\n'Crazy Ex-Girlfriend' Star Vella Lovell on Season 3's Mega Revenge: 'The Stakes Are Higher' (Exclusive)\n\nScott Michael Foster Gets More 'Silly' Songs and All the Feels on 'Crazy Ex-Girlfriend' (Exclusive)\n\n'Crazy Ex-Girlfriend' Boss Reveals What's Next For Rebecca After That Crazy Season 2 Finale", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-12/ceg307a_0195b.jpg?itok=UGrkZmNB", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_donna_lynne_champlin_crazyex.jpg?h=c673cd1c&itok=nLoiwiMj", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-12/1280_donna_lynne_champlin_crazyex.jpg?h=c673cd1c&itok=ktYWdecq", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/kobevanslovestoryvp.jpg?h=c673cd1c&itok=BhLYWr25"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_donna_lynne_champlin_crazyex.jpg?h=c673cd1c&itok=nLoiwiMj", "keywords": [], "authors": ["Emily Krauser"], "canonical_link": "https://www.etonline.com/how-crazy-ex-gf-star-donna-lynne-champlin-kept-straight-face-singing-first-penis-i-saw-exclusive", "title": "How 'Crazy Ex-GF' Star Donna Lynne Champlin Kept a Straight Face Singing 'First Penis I Saw' (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "How 'Crazy Ex-GF' Star Donna Lynne Champlin Kept a Straight Face Singing 'First Penis I Saw' (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/how-crazy-ex-gf-star-donna-lynne-champlin-kept-straight-face-singing-first-penis-i-saw-exclusive", "title": "How 'Crazy Ex-GF' Star Donna Lynne Champlin Kept a Straight Face Singing 'First Penis I Saw' (Exclusive)", "description": "With the prominent phallic vegetables in the music video, we're not sure how the Broadway vet pulled it off -- but she did so beautifully!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_donna_lynne_champlin_crazyex.jpg?h=c673cd1c&itok=nLoiwiMj", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "With the prominent phallic vegetables in the music video, we're not sure how the Broadway vet pulled it off -- but she did so beautifully!", "title": "How 'Crazy Ex-GF' Star Donna Lynne Champlin Kept a Straight Face Singing 'First Penis I Saw' (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Emily Krauser‍", "url": "https://www.etonline.com/how-crazy-ex-gf-star-donna-lynne-champlin-kept-straight-face-singing-first-penis-i-saw-exclusive", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_donna_lynne_champlin_crazyex.jpg?h=c673cd1c&itok=nLoiwiMj"}, "description": "With the prominent phallic vegetables in the music video, we're not sure how the Broadway vet pulled it off -- but she did so beautifully!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, Crazy Ex-Girlfriend, Donna Lynne Champlin", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}