{"url": "https://en.wikipedia.org/wiki/Today_(U.S._TV_program)", "text": "\"The Today Show\" redirects here. For other programming called \"Today\", see Today\n\nAmerican morning television program broadcast on NBC\n\nToday, also called The Today Show, is an American news and talk morning television show that airs on NBC. The program debuted on January 14, 1952. It was the first of its genre on American television and in the world, and after 68 years of broadcasting it is the fifth-longest-running American television series.\n\nOriginally a weekday two-hour program from 7:00 a.m. to 9:00 a.m., it expanded to Sundays in 1987 and Saturdays in 1992. The weekday broadcast expanded to three hours in 2000, and to four hours in 2007 (though over time, the third and fourth hours became distinct entities). Today's dominance was virtually unchallenged by the other networks until the late 1980s, when it was overtaken by ABC's Good Morning America.\n\nToday retook the Nielsen ratings lead the week of December 11, 1995, and held onto that position for 852 consecutive weeks until the week of April 9, 2012, when Good Morning America topped it again. Today maintained its No. 2 status behind GMA from the summer of 2012 until it regained the lead in the aftermath of anchor Matt Lauer's departure in November 2017.[2][3] In 2002, Today was ranked No. 17 on TV Guide's 50 Greatest TV Shows of All Time.[4]\n\nThe entertainment magazine Variety reported the 2016 advertising revenue during the first two hours of the show was $508.8 million.[5]\n\nHistory [ edit ]\n\nFounding [ edit ]\n\nLogo used from 2009 to 2013\n\nThe show's first broadcast aired on January 14, 1952 as the brainchild of television executive Sylvester Weaver, who was then vice president of NBC. Weaver was president of the company from 1953 to 1955, during which time Today's late-night companion The Tonight Show premiered. In pre-production, the show's proposed working title was The Rise and Shine Revue.[6] The show was first supervised by Jerome Alan Danzig.[7]\n\nToday was the first program of its genre when it premiered with original host Dave Garroway. The program blended national news headlines, interviews with newsmakers, lifestyle features, other light news and gimmicks (including the presence of the chimpanzee J. Fred Muggs who served as the show's mascot during the early years), and local news updates from the network's stations. It has spawned several other shows of a similar type, including ABC's Good Morning America, and CBS' now-defunct The Early Show. In other countries, the format was copied – most notably in the United Kingdom with the BBC's Breakfast Time and TV-am's Good Morning Britain, and in Canada with Canada AM on CTV.\n\nMascot J. Fred Muggs and companion with Garroway, 1954\n\nThe set in January 1952\n\nBroadcast schedule [ edit ]\n\nWhen Today debuted, it was seen live only in the Eastern and Central time zones, broadcasting for three hours each morning but seen for only two hours in each time zone. Since 1958, Today has been tape-delayed for the five other U.S. time zones (Central, Mountain, Pacific, Alaska and Hawaii–Aleutian). Partly to accommodate host Dave Garroway's declining health, the program ceased live broadcasts in the summer of 1958, opting instead to broadcast an edition taped the previous afternoon. The experiment, which drew criticism from many sides, ended when John Chancellor replaced Garroway in July 1961.[8]\n\nToday was a two-hour program for many years, airing from 7:00 a.m. – 9:00 a.m. in all time zones except for Alaska, Hawaii, and the U.S. Virgin Islands, until NBC expanded the program to three hours (extending the program until 10:00 a.m.) on October 2, 2000. A fourth hour (which extended the program until 11:00 a.m.) was eventually added on September 10, 2007. NBC stations in some markets, such as WYFF in Greenville, South Carolina, air the third and fourth hours of Today on tape delay.\n\nIn August 2013, Today released a mobile app for smartphones and tablets.[9]\n\nWeekday showtimes and local cut-ins [ edit ]\n\nThe program airs live in the Eastern Time Zone[10] and on tape delay beginning at 7:00 a.m. in each of the remaining time zones. The remaining three feeds are frequently updated with minor fixes and repairs, and often, correspondents will tape updates that are then edited into the delayed feeds. When breaking news stories warrant, Today will update the West Coast edition live. The live updates typically do not last longer than the 7:00 a.m. (Pacific Time) half-hour and once completed, will return to the taped East Coast feed. When the anchors welcome the viewers to the show, they will note the current time as being \"Pacific Time\" and continue to note it as such until the tape delay is started. In some instances, when an NBC News Special Report of breaking news occurs during the Today timeslot, the show's anchors will assume hosting responsibilities and the show will go live across all time zones until such time when the Special Report segment finishes. At that point, viewers outside the Eastern Time Zone will return to regularly-scheduled programming (i.e. the segment of the Today Show feed already in progress in their corresponding time zone or to their local newscast).\n\nDuring the first two hours of the program, local affiliates are offered a four-minute window at :26 and :56 minutes past the hour to insert a local newsbreak (which usually also includes a local forecast, and in large and mid-sized markets, a brief traffic report) and local advertisements. Certain NBC affiliates that produce an additional morning newscast for a sister station or digital subchannel may pre-tape the local inserts aired during the first one to two hours of Today to focus production responsibilities on their local broadcast.\n\nSatellite radio simulcast [ edit ]\n\nStarting in June 2014, Sirius XM Satellite Radio began simulcasting Today on a new channel called \"Today Show Radio\", Channel 108, with The Best of Today starting at 6 am (Eastern) and the Today Show's live broadcast from Studio 1A at Rockefeller Center in New York City starting at 7:00 a.m. (Eastern), with a tape delayed broadcast at beginning 7:00 a.m. Pacific time. On Mondays The Hoda Show with Hoda Kotb is broadcast exclusive on the Today Show Radio channel. On Tuesdays Off the Rails with Al Roker, Dylan Dreyer and Sheinelle Jones airs at 1:00 p.m. (Eastern). On Wednesdays The Happy Hour with the producers of Kathie Lee and Hoda airs, and on Thursdays Today Show Confidential with the producers of TODAY airs. The channel also simulcasts NBC Nightly News with Lester Holt at 6:30 p.m. (Eastern) The Today Show Radio service is not currently available on SiriusXM's sister service in Canada and Channel 108 is locked out for Canadian subscribers.\n\nStudio [ edit ]\n\nRCA Exhibition Hall (original studio) [ edit ]\n\nThe Today program first originated from the RCA Exhibition Hall on 49th Street in Manhattan in a space now occupied by the Christie's auction house, just down the block from the present-day studio. The first set placed a functional newsroom in the studio, which Garroway called \"the nerve center of the world\". The barrier between backstage and on-stage was virtually nonexistent. Garroway and the on-air staff often walked through the newsroom set. Glimpses of the camera crew and technicians were a frequent occurrence, as were off-screen voices conversing with Garroway. Gradually, machines and personnel were placed behind the scenes to assemble the news and weather reports, and the newsroom was gone by 1955.\n\nStudio 3K, Florida Showcase, Studio 8G & Studio 3B [ edit ]\n\nIn the summer of 1958, television manufacturer Philco complained to NBC that staging Today in a studio explicitly called the RCA Exhibition Hall was unfair (RCA owned NBC at the time). The network bowed to the pressure, and on July 7, 1958, Today moved across the street to Studio 3K in the RCA Building, where it remained through the early 1960s.\n\nOn July 9, 1962, the program returned to a street-side studio in the space then occupied by the Florida Showcase. Each day, the Today production crew would have to move the Florida-related tourism merchandise off the floor and wheel in the Today news set, desks, chairs and cameras. When the show wrapped at 9:00 a.m. Eastern Time, the news set would be put away and the tourism merchandise returned to the floor.\n\nAfter three years in the Florida Showcase, Today moved back to the RCA Building on September 13, 1965. The network converted its news programming to all-color broadcasts at that time, and NBC could not justify allocating four (then-expensive) color cameras to the Florida Showcase studio. For the next 20 years, the show occupied a series of studios on the third, sixth, and eighth floors of NBC's headquarters; most notably Studio 3K in the 1970s, Studio 8G (adjacent to Studio 8H, home to Saturday Night Live) in the late 1970s and early 1980s, and finally Studio 3B from 1983 to 1994.\n\nStudio 1A [ edit ]\n\nToday moved to the new street-side studio on June 20, 1994, providing a link to the show's 1950s origin.\n\nSince the debut of the 1990s set, the national morning news programs of each of the major broadcast and cable-news networks have moved street-side – including two of Today's Rockefeller Center neighbors, Fox News Channel's Fox & Friends (at Avenue of the Americas) and CNN's since-cancelled American Morning (in the summer of 2005, CNN reversed the trend, abandoning its street-level studio and moving upstairs in the Time Warner Center at Columbus Circle). ABC's Good Morning America broadcasts from Times Square Studios, although only a portion of its studio is street side.\n\nIn 2006, Studio 1A underwent a major renovation to prepare for the upgrade to high-definition broadcasts. After the departure of Katie Couric and while a new set was readied (during the summer of 2006), the program was broadcast from a temporary outdoor studio in Rockefeller Plaza, the same set that NBC used at the Olympic Games since 2004.[11] During the week of August 28, 2006, the show was moved to a temporary location outside of Studio 1A because MTV was converting the outdoor studio into their red carpet booth for the 2006 MTV Video Music Awards. A mock set was set up in Dateline's studio, which was also used during inclement weather. The program also used a temporary outdoor set at 30 Rock, and MSNBC's Countdown with Keith Olbermann (which joined at Studio 1A in 30 Rock on October 22, 2007).\n\nOn September 13, 2006, Today moved back into the revamped Studio 1A space. The new studio was divided into five different sections on the lower level including an interview area, the couch area, the news desk, the performance/interview/extra space area, and home base, which is where the anchors start the show. A gigantic Panasonic 103-inch plasma monitor is often used for graphic display backgrounds. A kitchen set is located upstairs from the main studio. The blue background that is seen in the opening of the show in home base moves up and down to allow a view of the outside from the home base.\n\nSome minor changes were implemented throughout the early and middle part of 2013; not only in the way that things are presented, but also with modified graphics and minor updates to the set. That year, a new, larger anchor desk was introduced with space to seat all four main anchors (Guthrie, Lauer, Morales and Roker). The new desk brought an end to the \"news desk,\" as the third \"news reader\" (Morales) now sits at the main anchor desk. Other minor changes included a new larger desk for the third hour. After the August 16, 2013, broadcast, the program vacated Studio 1A, while the space underwent a remodeling with a more modern look with (as stated by executive producer Don Nash) \"a lot more bells and whistles to play with\".\n\nToday set in 2015. set in 2015.\n\nOn September 16, 2013, Today debuted a new set and graphics package (it was originally set to debut on September 9, but was delayed one week to complete final design details[12]). The \"home base\" is located on a platform that can spin 360°, therefore allowing the view and direction of the camera to change depending on the half-hour. A new couch and background was added in the \"sofa area\" (where the anchors sit and discuss topics). A social media area known as the \"Orange Room\", was also added to Studio 1A, which contains screens that display Twitter comments or trending topics;[13] Carson Daly was hired to present segments from the room during the broadcast.[14] Six screens that also connect to one 6' x 16' screen were added in the fashion/special topic area. During its first two days of use, the show transitioned away from its news and entertainment format to a format that emphasized the social interaction of the anchors, Roker and newsreader.\n\nThe graphics were also overhauled with introduction of the new set (a slightly modified version of this package and the revised logo debuted on Early Today that November, further integrating the early-morning news program's branding with Today). The logo-to-peacock animation was moved from the left corner to the bottom right side corner of the screen. The logo that was first previewed on September 13, 2013, pared down the number of circular arches from five to three with its coloring switching from different variations – generally shades of red, orange and yellow to depict a sunrise – to entirely orange.\n\nIn September 2015 Today updated the set once again,[15] the update included new floors, a new couch, and a new anchor desk. The new set retains the 360 home base used in the previous design. The new set replaced much of the dark wood colors with lighter colors and removed the emphasis of orange in previous design in favor of orange accents.\n\nIn February 2018, while Guthrie and Kotb were at the 2018 Winter Olympics, the studio received minor changes including new screens and flooring in the former screen area; and by November of the same year, the Orange Room got a minor change that included a triangular-pattern wall and wooden flooring.\n\nOn-air staff [ edit ]\n\nWeekdays [ edit ]\n\nMain show [ edit ]\n\nDuring the week, the flagship hours of Today (7:00 a.m. – 9:00 a.m.) are co-anchored by Savannah Guthrie (2012–present) and Hoda Kotb (2018–present) alongside co-hosts Al Roker (weather anchor; 1996–present), Craig Melvin (news anchor; 2018–present), Carson Daly (social media anchor/Orange Room anchor; 2013–present), Jenna Bush Hager (correspondent; 2009–present), and Natalie Morales (West Coast anchor/correspondent; 2011–present).[16]\n\nThird hour [ edit ]\n\nSheinelle Jones and Dylan Dreyer – who appear on the main show as contributors – serve as the co-hosts (with Roker and Melvin) of 3rd Hour Today at 9:00 a.m.\n\nFourth hour [ edit ]\n\nKotb and Bush Hager return to co-host the fourth hour – titled Today with Hoda & Jenna – at 10:00 a.m.\n\nNote: 3rd Hour and Hoda & Jenna – while part of the Today Show – are their own distinct entities and are listed as such.[17]\n\nWeekends [ edit ]\n\nSaturday editions are anchored by Peter Alexander and Kristen Welker. Sunday editions are anchored by Willie Geist. Dylan Dreyer is the weather anchor for both editions.\n\nFormer staff [ edit ]\n\nToday anchors started out as \"Communicators\". Creator Pat Weaver envisioned a person whose responsibilities would go beyond the bounds of traditional sit-down news anchors. The Communicator would interview, report, moderate dialogue and generally tie the show together into a coherent whole.[18] Garroway and his successors have all followed that model, with little variation. Today, the hosts are expected to do much the same, and on any given day will talk with correspondents, newsmakers and lifestyle experts; introduce and close each half-hour; conduct special segments (such as cooking or fashion) and go on-assignment to host the program from different locations. Although the \"Communicator\" nomenclature has since dropped out of favor, the job remains largely the same.\n\nAnchors [ edit ]\n\nIncluding Hoda Kotb and Savannah Guthrie, eight men and eight women have served as primary Today hosts since the program's inception:[19]\n\nHost Tenures by the Numbers # Host Number of Years 1 Matt Lauer 20 Years and 10 Months 2 Katie Couric 15 Years and 1 Month 3 Bryant Gumbel 15 Years 4 Jane Pauley 13 Years and 2 Months 5 Barbara Walters 9 years and 8 Months 6 Dave Garroway 9 years and 5 Months 7 Hugh Downs 9 years and 29 Days 8 Savannah Guthrie 7 Years, 9 Months 9 Tom Brokaw 5 Years and 3 Months 10 Meredith Vieira 4 Years and 8 Months 11 Frank McGee 4 Years and 6 Months 12 Hoda Kotb 2 Years, 3 Months 13 Jim Hartz 2 Years and 26 Days 14 John Chancellor 1 Year, 1 Month and 21 Days 15 Deborah Norville 1 Year, 1 Month and 14 Days 16 Ann Curry 1 Year and 20 Days\n\nNotes:\n\nWalters was hired as a Today writer and researcher in 1961, making her first appearance that August with a segment on the Paris fashion show. She was appointed as a \" Today Girl\" and reporter in October 1964; a Today panelist in September 1966, and became the program's first female co-anchor upon Frank McGee's death in April 1974.\n\nwriter and researcher in 1961, making her first appearance that August with a segment on the Paris fashion show. She was appointed as a \" Girl\" and reporter in October 1964; a panelist in September 1966, and became the program's first female co-anchor upon Frank McGee's death in April 1974. Pauley was hired as a Today panelist in 1976, and was promoted to co-anchor when Bryant Gumbel joined the program in 1982.\n\npanelist in 1976, and was promoted to co-anchor when Bryant Gumbel joined the program in 1982. Curry served as the show's Anchor at Large from 2012 to 2015.\n\nNews anchors [ edit ]\n\nFrom the show's inception, the idea of providing the latest news headlines has been critical to the function of the program. In that vein, there has always been at least one person on set whose job it is to prepare and deliver newscasts. In 1952, that person was called the \"news editor\" or (informally) \"news chief\". In modern parlance, the term \"newsreader\" or \"news anchor\" is preferred. Under the two-hour format, four newscasts were delivered, once every half-hour. Presently, there are only two newscasts, delivered at the top of each of the first two hours. Some anchors, including Jim Fleming, Lew Wood, Floyd Kalber and John Palmer, were seasoned journalists before joining the program. Others, including Ann Curry, have used the position to increase their journalistic acumen, at times leaving the newsdesk behind to venture into the field. News anchors have included the following:\n\nWeather anchors [ edit ]\n\nFor the program's first 25 years, weather reports were delivered by the host or newsreader. Dave Garroway illustrated the day's forecast by drawing fronts and areas of precipitation on a big chalkboard map of the United States, based on information gathered earlier in the morning from the U.S. Weather Bureau in Washington, D.C. Subsequent hosts John Chancellor and Hugh Downs dropped the chalkboard weather map concept, and instead read a prepared weather summary over a still image of a weather map. When the show converted to all-color broadcasts in 1965, weather maps were prepared and projected on a screen behind Frank Blair, who delivered the forecast immediately after his news summaries.[22] Following Blair's retirement on March 14, 1975, Lew Wood took over the newsreader and weather reporting duties (using Blair's format). When Floyd Kalber became newsreader in 1976, Wood was relegated to weather, sports, roving reporter assignments, and presenting live on-air commercials until his departure in 1978.\n\nThe weather is reported every half-hour during the program's first two hours, though since Al Roker was named weather reporter on January 26, 1996, an interview is conducted by him in place of the national weather forecast at least once during the show, leaving only the local weather inserts by NBC stations.\n\nPrior to Roker, Today weather reporters were Bob Ryan (1978–1980) and Willard Scott (1980–1996). Until Ryan's hiring, no one on the show had practical experience or academic credentials in meteorology. With NBC's purchase of The Weather Channel in 2008, personnel from that network frequently participate in Today forecast segments, at the site of a weather event or from the cable channel's suburban Atlanta headquarters, or as a fill-in for Roker. This lasted until ten years later when TWC was later acquired by Entertainment Studios.\n\nNBC owned-and-operated stations and affiliates are given a 30-second window to insert a local forecast segment into the program following the national weather report; Roker's outcue for the local break is \"That's what's going on around the country, here's what's happening in your neck of the woods,\" although in recent years, this outcue was used during only starting the second half-hour. During the first half hour, Roker simply uses \"your local forecast\" which appears after a 30-second commercial. Those not watching on an affiliate which provides local weather segments following the outcue (including international viewers, as well as NBC stations that do not have a news department) see a national summary of temperatures on a weather map.\n\nThe semi-retired Scott, who gained fame through his antics that included costumes and props,[23] still appeared on-air to continue his tradition of wishing \"happy birthday\" to centenarians. Scott's traditional local cue was \"Here's what's happening in your world, even as we speak.\" He retired completely from television on December 15, 2015.\n\nRegular panelists [ edit ]\n\nThe job of \"panelist\" has no set definition. Panelist duties can range from conducting interviews to reporting on a number of topics in-studio and in the field. Regular panelists on the program include the following:\n\nToday Girls [ edit ]\n\nFrom 1952 to 1964, a notable member of the cast was a woman, often an entertainer, the Today Girl. Usually, she discussed fashion and lifestyle, reported the weather, covered lighter-fare stories or engaged in verbal jousting with Garroway. Estelle Parsons was the first to hold the job, though her title at the time was \"Women's Editor\". Upon her departure in 1955, the Today Girl name was adopted. The last to hold the position, Barbara Walters, discussed the job in her autobiography Audition: A Memoir. She wrote that the era was before the Women's Movement, and it was believed that nobody would take a woman seriously reporting \"hard news\"; Walters described the position as a \"tea pourer\".[24] In 1966, Walters was promoted to co-anchor alongside Hugh Downs, and the Today Girl position was eliminated. Those who held the position were:\n\nJ. Fred Muggs [ edit ]\n\nFrom 1953–1957, the program featured J. Fred Muggs, a chimpanzee whose antics entertained viewers, but frustrated the program's staff, especially Dave Garroway. Also occasionally appearing was J. Fred's \"girlfriend\" Phoebe B. Beebe.\n\nTransitions [ edit ]\n\nPauley to Norville [ edit ]\n\nIn 1989, Deborah Norville (then anchor of the network's early-morning news program at the time, NBC News at Sunrise) replaced John Palmer at the Today newsdesk, at which point he assumed her previous role on Sunrise. She also began substituting for Tom Brokaw on NBC Nightly News. Shortly after Norville's appointment as Today's news anchor, the decision was made to feature her as an unofficial third host. Whereas Palmer had read the news from a desk separate from where Gumbel and Pauley sat, Norville was seated alongside the program's hosts at the opening and closing of every show. Before long, gossip columns and media observers predicted that NBC would remove Jane Pauley from the program and replace her with Norville in an effort to improve the program's recently declining viewership among young women, the demographic most coveted by morning shows.[25] During this period, Saturday Night Live featured a sketch titled \"All About Deborah Norville\" (a takeoff on the classic film All About Eve), which depicted Norville as ruthlessly scheming to take Pauley's place as Today co-host.\n\nIn October 1989, it was announced that 13-year veteran Pauley would leave Today at the end of the year.[26] NBC, as expected, announced that Norville would become co-host. An emotional Norville hugged Pauley on the air after the announcement was made, and many at the network hoped the negative press generated by Norville's increased presence on the program would end. However, this turned out not to be the case. Prior to the announcement of Pauley's departure, much of the criticism had focused on Norville's youth and beauty, with many branding her \"the other woman\" and a \"home wrecker,\" in a reference to what some felt seemed like her intent on \"breaking up\" the television marriage of Gumbel and Pauley.[27]\n\nThe negative press only heightened after the announcement of Pauley's resignation, and Norville was put under a gag order by NBC brass, which prevented her from defending herself from the widespread and erroneous reports that she somehow orchestrated her rise on Today. In January 1990, the new anchor team of Bryant Gumbel and Deborah Norville, minus Jane Pauley, debuted with disastrous results. Ratings for the program began to plummet. Critics felt that Gumbel and Norville lacked chemistry and many loyal viewers began turning to rival ABC's Good Morning America (GMA).\n\nNorville to Couric [ edit ]\n\nBy the end of 1990, Today, the longtime dominant program, was officially the second-place morning show behind GMA, and most of the blame was pinned on Norville. By the outbreak of the Persian Gulf War in 1991, Norville saw her role as co-host continually minimized. Today aired special editions of the program called \"America at War,\" with Gumbel anchoring most of the show alone. It was not uncommon for Norville not even to appear until the two-hour show's second half-hour. In addition, she was directed not to initiate conversation on the show and only speak when asked a question by Gumbel. Norville left the show for maternity leave in February 1991. It was announced that Katie Couric would substitute co-host during Norville's absence. Ratings for the program rose immediately following Norville's departure and Couric's arrival.[28]\n\nMidway though her maternity leave, Norville was interviewed by People. In the story, she avoided conversation about her recent trouble on Today, and instead focused on her newborn baby boy. She was photographed breastfeeding her son, a seemingly innocuous event, but NBC management was said to be greatly displeased by this, believing the photo to be \"in poor taste\". By April 1991, in light of improved ratings on Today and NBC's displeasure at the People photograph, it was announced that Norville would not return to Today and that Katie Couric had been named the program's co-host. Norville, it was disclosed, would continue to be paid in accordance with her contract, although she would no longer appear on any NBC News programs.\n\nCouric to Vieira [ edit ]\n\nOn April 5, 2006, Katie Couric announced on her 15th anniversary as co-host of Today that she would leave the program and NBC News at the end of May to become the new anchor and managing editor of the CBS Evening News. Couric's final broadcast, on May 31, 2006, was dedicated to her 15 years as one of the show's co-hosts, and celebrated her move to the anchor chair at CBS, where she also became a correspondent for the network's Sunday night newsmagazine program 60 Minutes. Couric said during the show, \"It's been a pleasure hosting this program, and thank you for fifteen great years.\" A special video presentation was broadcast, recapping her best moments and news stories on Today during her 15 years with the show.\n\nThe day after Couric's announcement, Meredith Vieira, then a host of ABC's The View announced on that show that she would take over as Lauer's co-anchor in September. Lauer and Vieira began co-hosting together on September 13, 2006.\n\nOn June 1, 2006 (the day after Couric's departure), NBC News announced that for the summer of 2006, Today would move to a temporary outdoor studio as Studio 1A was going through renovations to prepare for its switch to high-definition. On that same day, NBC News launched a new advertisement promoting Vieira's arrival. That summer, Couric's anchor seat was filled by various hosts, consisting of Curry, Morales and Campbell Brown (all of whom were considered candidates to replace Couric), until Vieira took over that fall.\n\nIn March 2010, Vieira signed a contract to keep her with the program until at least September 2011.[29] However, she announced on May 9, 2011, that she would depart as co-host in the following month, but would remain at NBC News as a special correspondent.[30]\n\nVieira to Curry [ edit ]\n\nAfter announcing her resignation, Meredith Vieira departed the program on June 8, 2011. Vieira's spot was filled by the program's longtime news anchor Ann Curry, appearing alongside Matt Lauer as co-host. Correspondent Natalie Morales replaced Curry as news anchor in turn, with Al Roker remaining as the weather anchor. Savannah Guthrie joined Morales and Roker as co-host of the third (9:00 a.m.) hour.\n\nAlmost a year after her departure, Vieira returned briefly to Today as a special correspondent for events relating to Queen Elizabeth II's Diamond Jubilee Celebration. On June 5, 2012, she co-presented the show with Lauer from London.\n\nCurry to Guthrie [ edit ]\n\nNBC revealed on June 28, 2012, that Ann Curry would no longer co-host Today, and would continue to work for NBC News (where she remained until her departure in January 2015), including continuing to appear on Today. Curry's title was changed to \"Today Anchor at Large and NBC News National & International Correspondent,\" with responsibilities including leading a seven-person unit producing content for NBC Nightly News, Dateline NBC, Rock Center with Brian Williams and Today, with occasional anchor duties for Nightly News. Curry also reported for NBC's coverage of the 2012 Summer Olympics in London. On July 9, 2012, Savannah Guthrie succeeded Curry as co-anchor alongside Lauer, Roker and Morales.[31]\n\nAnn Curry's final show as co-anchor was subdued compared to the earlier departures of Katie Couric and Meredith Vieira, as it did not include retrospectives of Curry's 15-year run on the program or goodbye messages from colleagues and celebrities, although Curry – seated alongside Lauer, Natalie Morales and Al Roker in the couch area of the Studio 1A set – gave a tear-filled farewell message to viewers.[32][33] Rumors of Curry's departure from Today began weeks before NBC formally announced that she would no longer be co-host, spurring negative press similar to that resulting from the departure of Jane Pauley and her replacement by Deborah Norville 23 years earlier, as early reports suggested that Matt Lauer had a hand in the program's decision to let Curry go.[34][35][36] Viewership declines for the program that began in the months following Curry becoming co-host precipitated in part due to public criticism over Lauer's alleged involvement in Curry's departure; loyal viewers once again began turning to the competing Good Morning America, which toppled Today's 16-year consecutive run as the top-rated morning news program during the week of April 9, 2012.[2][2] The public relations problems for Lauer that resulted from the accusations, led then-executive producer Jim Bell to admit responsibility for the negative press, in defense of Lauer, in a series of interviews with The New York Times, The Hollywood Reporter and the Associated Press.[37][38][39]\n\nLauer to Kotb [ edit ]\n\nOn November 29, 2017, Hoda Kotb became the interim co-anchor after Matt Lauer was terminated. Prior to that, she has been a featured co-anchor of Today, sitting alongside Lauer and Guthrie at the beginning of the second half-hour. She held that position on April 17, 2017, after her return from maternity leave until Lauer's termination on November 29, 2017. On January 2, 2018, her interim status became permanent, making her and Savannah Guthrie the first all-female anchor duo in Today's history and the second all-female anchor duo overall.\n\nNBC News Chairman Andrew Lack said in an email that Kotb has \"seamlessly stepped\" into the position, and with Guthrie, \"quickly hit the ground running\". \"They have an undeniable connection with each other and most importantly, with viewers, a hallmark of Today,\" Lack added.[40]\n\nJust before the holidays, NBC executives offered the job to Kotb.[41] She also continued to co-host the fourth hour of the show, a role she has held since 2008.\n\nControversies [ edit ]\n\nGumbel's memo [ edit ]\n\nIn 1989, Bryant Gumbel wrote a memo to the program's then-executive producer Marty Ryan, which was critical of other Today personalities, and was leaked to the press. In the memo, Gumbel commented that Willard Scott \"holds the show hostage to his assortment of whims, wishes, birthdays and bad taste... This guy is killing us and no one's even trying to rein him in.\" He commented that Gene Shalit's movie reviews \"are often late and his interviews aren't very good\".[42]\n\nThere was enough negative backlash in regard to Gumbel's comments toward Scott that Gumbel was shown reconciling with Scott on Today.[43]\n\nSelective editing of George Zimmerman 9-1-1 call [ edit ]\n\nAfter the shooting of Florida teenager Trayvon Martin, Today ran a selectively edited version of the 9-1-1 call that George Zimmerman made prior to shooting and killing Martin (which he defended as being committed in self defense while standing trial for the shooting, for which he was acquitted on charges of murder in July 2013), which had the effect of making Zimmerman appear racist. In a March 2012 edition of the program, Today played a recording of Zimmerman saying, \"This guy looks like he's up to no good. He looks black.\" However, several seconds of the call were cut from the 911 tape, removing Zimmerman's description of Martin, and a question asked to him about the teenager by the 911 operator. In the original, unedited tape, Zimmerman said, \"This guy looks like he's up to no good. Or he's on drugs or something. It's raining and he's just walking around, looking about.\" The operator then asked, \"OK, and this guy – is he black, white or Hispanic?\", to which Zimmerman answered, \"He looks black.\"\n\nThe Washington Post wrote that Today's alteration \"would more readily paint Zimmerman as a racial profiler. In reality's version, Zimmerman simply answered a question about the race of the person whom he was reporting to the police. Nothing prejudicial at all in responding to such an inquiry... it's a falsehood with repercussions. Much of the public discussion over the past week has settled on how conflicting facts and interpretations call into question whether Zimmerman acted justifiably or criminally... To portray that exchange in a way that wrongs Zimmerman is high editorial malpractice...\"[44]\n\nFollowing an internal investigation into the production of the segment, NBC News fired two employees who were involved in the piece, including a producer based at the division's Miami bureau, in April 2012.[45] In December 2012, George Zimmerman filed a defamation lawsuit against NBC for the editing of the 911 call. Florida Circuit Court Judge Debra Nelson dismissed the suit on June 30, 2014, citing that there were \"no genuine issues of material fact upon which a reasonable jury could find that the Defendants [NBCUniversal] acted with actual malice,\" but although Zimmerman could not prove that he was the victim of \"actual malice\", stated that the malice standard was appropriate since Zimmerman is a public figure.[46]\n\n9/11 Moment of Silence omission [ edit ]\n\nOn September 11, 2012, Today sparked outrage after the program neglected to interrupt an interview with Keeping Up with the Kardashians co-star Kris Jenner to broadcast the 11th anniversary remembrance ceremonies of the September 11, 2001, terrorist attacks at 8:46 a.m. Eastern.[47] NBC was the only national television news outlet in the United States that did not interrupt regular programming to broadcast the moment of silence live. While the coverage of the ceremonies was not seen on the NBC network feed in most of the country, the network's New York City flagship owned-and-operated station WNBC interrupted the Today broadcast to run locally produced special coverage of the entire ceremony.[48]\n\nMatt Lauer termination [ edit ]\n\nOn November 29, 2017, NBC terminated Lauer following allegations of \"inappropriate sexual behavior\". NBC News chairman Andrew Lack announced Lauer's termination, stating: \"It represented, after serious review, a clear violation of our company's standards. As a result, we've decided to terminate his employment. While it is the first complaint about his behavior in the over twenty years he's been at NBC News, we were also presented with reason to believe this may not have been an isolated incident. Our highest priority is to create a workplace environment where everyone feels safe and protected, and to ensure that any actions that run counter to our core values are met with consequences, no matter who the offender.\"[49]\n\nAlthough NBC did not publicly report or comment on the specifics of the allegations, the entertainment industry publication Variety ran a two-month long investigation involving interviews with Lauer's former NBC colleagues on his behavior towards them, which included lurid accusations of making verbal and typed lewd comments, as well as making suggestive references to a colleague's sexual performance.[50]\n\nMegyn Kelly blackface controversy [ edit ]\n\nDuring the episode of October 23, 2018, Megyn Kelly participated in a panel discussion on the appropriateness of blackface in Halloween costumes on her morning show Megyn Kelly Today. During the segment, Kelly recollected that \"when I was a kid, that was okay as long as you were dressing up as like a character\", and added that \"[Luann de Lesseps] wants to look like Diana Ross for one day, and I don't know how that got racist on Halloween.\" Her comments were widely criticized for being interpreted as defense of the practice, which is generally considered to be a derogatory caricature of African-Americans.[51] Critics likened Kelly's remarks to a previous incident during her tenure at Fox News Channel, where Kelly asserted that Jesus and Santa Claus were white.[52][53]\n\nLater that day, Kelly issued an internal email apologizing for the remarks, stating that \"I realize now that such behavior is indeed wrong, and I am sorry\", and that \"I've never been a 'pc' kind of person — but I understand that we do need to be more sensitive in this day and age. Particularly on race and ethnicity issues which, far from being healed, have been exacerbated in our politics over the past year. This is a time for more understanding, love, sensitivity and honor, and I want to be part of that. I look forward to continuing that discussion.\"[51]\n\nKelly opened the October 24 episode with a public apology, as well as a follow-up discussion with African-American commentators Amy Holmes and Roland Martin on why blackface is considered controversial.[53][54] The same day, The Hollywood Reporter reported that Kelly had left the Creative Artists Agency, and had hired an attorney. It was also reported that, prior to the incident, Kelly and NBC had been discussing cancelling the program so she could focus more on serving as a correspondent, but that the comments may have an impact on her future at the network. The week's remaining episodes were replaced by encores.[55][56][57]\n\nOn October 26, 2018, NBC News confirmed the cancellation of Megyn Kelly Today and announced that the show's existing anchors would temporarily fill the third hour.[58]\n\nExpansion [ edit ]\n\nCurrent [ edit ]\n\nWeekend Today [ edit ]\n\nToday first expanded to weekends on September 20, 1987, with the debut of the Sunday edition. Five years later on August 1, 1992, the Saturday edition made its debut, expanding the program to seven days a week. The Sunday broadcast was originally 90 minutes in length, until the third half-hour being dropped with the expansion of Meet the Press to an hour-long broadcast in 1992; it now airs for one hour, while the Saturday broadcast airs for two hours.\n\nThe weekend broadcasts continue the Today format of covering breaking news, interviews with newsmakers, reports on a variety of popular-culture and human-interest stories, covering health and finance issues, and national weather reports. NBC feeds the Saturday edition from 7:00 a.m. – 9:00 a.m. (although it is often shortened to air the network's kids' block in full when there is an early start to sports) and the Sunday edition from 8:00 a.m. – 9:00 a.m. (both in the Eastern Time Zone), although many of the network's affiliates air local newscasts in those time slots and carry the network broadcast earlier or later in the morning; many NBC affiliates also bookend the Sunday edition with local morning newscasts that immediately precede and follow the program. NBC's New York City, Chicago, San Francisco and Los Angeles owned-and-operated stations air Weekend Today simultaneously (but not live) at 9:00 a.m Eastern, 8:00 a.m. Central and 6:00 a.m. Pacific Time.\n\nWeekend editions are tailored to the priorities and interests of weekend viewers – offering special series such as \"Saturday Today on the Plaza\", featuring live performances by major music acts and Broadway theatrical productions outside the studio throughout the summer.\n\nDuring the network's coverage of the Olympic Games, the weekday anchors and staff present the majority of the program on both Saturday and Sunday throughout the two weeks to maintain promotional momentum, with limited contributions from the weekend team from New York.\n\nEarly Today [ edit ]\n\nThe first brand extension of Today was created in 1982. The early morning news program Early Today was conceived as a lead-in for Today, featuring the same anchors as the main program at the time, Bryant Gumbel and Jane Pauley. The half-hour program was fed twice to allow affiliates to carry one or both broadcasts. NBC canceled the program after a year, and replaced it with NBC News at Sunrise, originally anchored by Connie Chung.\n\nIn April 1999, NBC canceled Sunrise for two brand extensions of Today. One was Early Today which was revived September 7, 1999; the revived program originally was produced by CNBC and focused on business and financial news before switching to general news under the same production staff as MSNBC First Look in 2004. Early Today continues to air on the network, airing live each weekday morning at 3:00 a.m. Eastern Time (with an updated telecast for viewers in the Pacific Time Zone), and on tape delay until 10:00 a.m. Eastern – corresponding with the start time of Today in the Pacific Time Zone – to allow for adjustment in airtimes for other time zones and for certain NBC stations without a local morning newscast to air Early Today in lieu of one.\n\n3rd Hour Today [ edit ]\n\n3rd Hour Today (sometimes called The 3rd), the current name for the third hour of Today, features anchors who appear in the first two hours of the program. After Megyn Kelly Today was cancelled on October 26, 2018, NBC announced that Today anchors would host the third hour.[59] The new third hour premiered on October 29, 2018, with Hoda Kotb, Craig Melvin and Al Roker anchoring for the first 20 minutes from Studio 1A, reporting on the Pittsburgh synagogue shooting, with Savannah Guthrie anchoring live from Pittsburgh.[60] At the top of the program, Kotb said:\n\n\"Today, as you know, we are starting a new chapter in the third hour of our show as it evolves. We want you to know that the entire Today family will continue to bring you informative and important stories, just as we always have.\"[61]\n\nAfter 20 minutes, the program continued with Jenna Bush Hager from Studio 6A, the former home of Megyn Kelly Today, where broadcasts of the third hour would begin to be based.[62] Since its debut, the third hour has used a modified nameless opening title sequence compared to the other editions of Today. Various other Today and NBC News personalities filled in until January, when it was announced that the official hosts would be Al Roker, Sheinelle Jones, Dylan Dreyer and Craig Melvin. On December 4, 2018, an NBC News spokesperson confirmed that the third hour would move to Studio 1A to streamline the production process and create a more seamless broadcast. The last day at Studio 6A was January 4, 2019, with new broadcasts in Studio 1A beginning on January 7.[63]\n\nToday with Hoda & Jenna [ edit ]\n\nToday with Hoda & Jenna premiered on April 8, 2019, as the fourth hour of Today, succeeding Kathie Lee & Hoda.[64] The program is hosted by Hoda Kotb and Jenna Bush Hager, and continues to follow a similar format as its predecessor as its own distinct entity.[65]\n\nFormer [ edit ]\n\nLater Today [ edit ]\n\nOn September 7, 1999, NBC launched Later Today, a talk show that was intended to air immediately following the then two-hour Today. Replacing Leeza (which would continue in first-run syndication for one more year) on the network's morning schedule, Later Today was hosted by Jodi Applegate, Florence Henderson and Asha Blake. The program was cancelled on August 11, 2000, due to lackluster ratings; it was replaced two months later by the third hour of Today, later known as Today's Take.\n\nToday's Take [ edit ]\n\nToday's Take (sometimes called The Take) was the third-hour segment of Today. This \"show-within-a-show\" had its own anchors (although featuring on-air staff that appears during the first two hours of the program), opening title sequence and theme music.\n\nOn October 2, 2000, NBC expanded Today to three hours, with the addition of an hour from 9:00 a.m. – 10:00 a.m. For its first twelve years, the format of the third hour was originally structured similarly to Today's first two hours, using the same anchors as that portion of the broadcast; separate anchors began to be used for the third hour over time, with only the news anchor (Ann Curry until 2011, then Natalie Morales) and the weather anchor (Al Roker) being shared with the main 7:00 a.m. – 9:00 a.m. block – this was particularly the case during instances where Matt Lauer or his co-host (Katie Couric, then Meredith Vieira from 2006 to 2011, Ann Curry from 2011 to 2012, and finally Savannah Guthrie during the final months of the original format) could not be present for the entire hour due to reporting assignments or personal commitments. Vieira, outside of breaking news situations, was specifically disallowed by contract from any duties in the third hour due to her hosting commitments to the syndicated version of Who Wants to Be a Millionaire? by Buena Vista/Disney–ABC Domestic Television.\n\nThe network revamped the format of the third hour on November 12, 2012, and gave it the in-program title Today's Take. Roker was joined during the revamped third hour by Natalie Morales and Willie Geist (who had recently joined Today after ending his run as the original anchor of MSNBC's Way Too Early); MSNBC anchor and Today correspondent Tamron Hall was added as a co-host for that hour of the program on February 24, 2014, and Ellie Kemper joined the program on June 29, 2015, as a temporary co-host (until July 17, 2015).[66]\n\nWith the change, traditional news segments at the beginning of the hour were abandoned in favor of a topical \"host chat\" format similar to the opening segment of the succeeding fourth hour of the program (with the only difference being that top general news events are discussed somewhat more often, in addition to featuring topical discussions on offbeat and pop culture-related stories and periodic clips from television programs aired the previous night and videos trending online). Instead, the news segment (titled News with Natalie, anchored by Morales, and alternately titled Today's News on days when Morales is off) is featured prior to the local update cutaways near the end of the first half-hour; national weather segments are also retained following the host chat segments in both half-hours. Beginning in May 2015, the News with Natalie/Today's News segment moved to 9:30 a.m. and the national weather segment to follow and the host chat at 9:30 a.m. was discontinued.\n\nOn August 22, 2016, both Morales and Geist left Today's Take and former Access host Billy Bush officially joined the set. Bush was later suspended and eventually fired from the segment as well as the program following the controversy that arose during U.S. Republican and presidential candidate Donald Trump's campaign in October 2016.\n\nOn February 1, 2017, Hall left Today's Take. Weekend co-anchor Sheinelle Jones and weekend meteorologist Dylan Dreyer filled in as co-hosts alongside Roker until a new morning lineup began in the fall.[67]\n\nToday's Take aired its final episode on September 22, 2017, and Megyn Kelly Today replaced it on September 25, 2017.\n\nMegyn Kelly Today [ edit ]\n\nMegyn Kelly Today premiered on September 25, 2017, as a replacement for Today's Take. It was hosted by former Fox News Channel anchor Megyn Kelly, and was structured as a daytime talk show.[68][69][70][71][72][73]\n\nIn the wake of stable but lower viewership in comparison to the timeslot's predecessor, a desire by Kelly to focus more on her overall role at NBC News, and in the wake of controversy over a recent segment discussing blackface,[74][75] the show was officially cancelled on October 26, 2018.[76][77] Kelly never again appeared on NBC and departed the network three months later.\n\nToday with Kathie Lee and Hoda [ edit ]\n\nToday with Kathie Lee and Hoda was the fourth-hour segment of Today hosted by Kathie Lee Gifford and Hoda Kotb, which aired from April 7, 2008, to April 5, 2019. It replaced the original fourth hour that debuted earlier that fall on September 10, 2007, originally hosted by Ann Curry, Natalie Morales, and Hoda Kotb. The program was its own distinct entity, with its own website and social media presence. The fourth hour does not have news or weather segments or input from the earlier hosts and is structured virtually as a standalone talk show, with an opening \"host chat\" segment reminiscent of the one popularized by Gifford and Regis Philbin on Live! with Regis and Kathie Lee, as well as interviews and features focusing on entertainment, fashion and other topics aimed at female viewers.\n\nOn December 11, 2018, NBC and Gifford announced that she will be retiring from her position of anchoring the fourth hour in April 2019, her 11th anniversary since joining Today.[78][79] Kotb continues co-anchoring the fourth hour.[80] On February 26, 2019, NBC announced that Jenna Bush Hager would replace Gifford.[81]\n\nMusic [ edit ]\n\nToday host Dave Garroway selected Les Brown's \"Sentimental Journey\" as the program's original theme music, which was used during Garroway's entire run from 1952 to 1961. In 1962, when Hugh Downs became host, Django Reinhardt's \"Melodie au Crepuscule\" was chosen as the new theme; it was replaced in 1963 by \"Misty\", an instrumental ballad composed by Erroll Garner and performed by Bobby Hackett and John B. Seng.[82]\n\n\"Misty\" served as Today's theme until 1971, when NBC News correspondent Frank McGee joined the show. Composer Ray Ellis penned an instrumental theme entitled \"This is Today\", a jazzy, up-tempo piece that served as the program's main theme until 1978. Because This is Today closely resembled Stephen Schwartz's song \"Day by Day\" from the musical Godspell, Schwartz successfully sued for copyright infringement.[83] \"This is Today\" was revised as a result, with the second version of the piece incorporating the familiar NBC chime signature was used until 1981, at the close of the Tom Brokaw–Jane Pauley era.[82] The chimes were also used throughout the program to introduce and conclude segments, usually in combination with the familiar Today sunburst logo.\n\nBy the time Bryant Gumbel was appointed co-anchor of the program in 1982, a new version of Ellis' \"This is Today\" theme was introduced, using a looser, more relaxed arrangement that continued to feature the NBC chimes in its melody. A shorter arrangement of \"This is Today\" was used for the show open (featuring a rotating globe and the Today sunburst) from 1983 to 1985. The main theme was used until 1985, and due to its popularity with viewers was resurrected as the show's secondary theme in January 1993. The 1982 theme later served as the program's official \"anniversary\" music, used to open and close retrospective segments in the leadup to Today's 60th anniversary in 2012.\n\n1985 saw the end of the synthesizer era at NBC as composer John Williams wrote a series of themes for all NBC News programs, with a cut entitled \"The Mission\", serving as the principal theme for NBC Nightly News with Tom Brokaw. Williams also composed two themes for Today: an opening fanfare for the program that was derived from the opening of \"The Mission\"; and a two-minute closing theme for the show entitled \"Scherzo for Today\", a dramatic arrangement that made heavy use of strings and flutes. In the late 1980s, \"Scherzo\" was played in its entirety multiple times daily during the weather scrolls that ran during local commercial breaks; however, most NBC affiliates preempted these segments with locally slotted advertising. The new Today themes – used in tandem with the show's new opening sequence featuring the Statue of Liberty and a new living room studio set – gave the program a distinctly modern look and sound beginning in September 1985. A series of Williams-penned bumpers featuring the \"Mission\" signature were also used to open and close segments. \"Scherzo for Today\" was used as the program's closing theme until 1990, and the \"Mission\" bumpers were used until 1993 (one of them could be heard as a station break lead-in on NBC's Meet The Press until 2004).\n\nMeanwhile, Williams' opening fanfare had opened the program ever since its 1985 introduction, with two brief interruptions; new opening themes were briefly introduced and quickly discarded in the summer of 1994 (to mark the debut of Studio 1A) and in 2004. The fanfare was iconically accompanied by Fred Facey announcing \"From NBC News, this is Today… with (anchor) and (anchor)\" (with \"Live from Studio 1A in Rockefeller Plaza\" being added to the introduction on June 20, 1994, when the show moved to its new studio). Although Facey died in April 2003, his introduction of the Couric–Lauer team was used for the duration of Couric's era (except for special editions requiring special introductions). Weekend Today announcer Les Marshak became the new voice of the weekday program on September 13, 2006.[84] A lighter theme employing the NBC chimes was used to open the show's 7:30 through 9:30 a.m. half-hour segments, and was also used as a closing theme.\n\nIn March 2013, \"The Mission\" was replaced with a theme composed by Adam Gubman for Non-Stop Music. Along with Non-Stop Music, Gubman's rebranding could be heard dating back to Today's coverage of the wedding of Prince William and Catherine Middleton in April 2011. Gubman went on to write music for the network's 2012 election coverage, and continues to provide audio content for Today.\n\nRatings [ edit ]\n\nFrom 1995 to 2012, Today generally beat ABC rival Good Morning America in the ratings among all network morning programs. By the week of September 11, 2006, the program earned 6.320 million total viewers, 1.6 million more than the 4.73 million viewers earned by Good Morning America. This gap eventually decreased, as by the week of June 30, 2008, Today was watched by an average of 4.9 million viewers, compared to Good Morning America's 3.8 million.[85]\n\nFurthermore, by the week of October 12, 2008, Today's total viewership had gone up to 4.910 million viewers, compared to second place Good Morning America's total viewership of 4.25 million (and significantly above the 2.66 million viewers earned by CBS' The Early Show).[86] For the week above, the third hour (referred as \"Today II\" by NBC exclusively for Nielsen ratings counts) drew 2.9 million viewers and the fourth hour (referred in Nielsen ratings as \"Today III\"), delivered 1.7 million.\n\nFor the week of January 4, 2009, the 8:00 a.m. hour of Today averaged 5.998 million viewers; the 9:00 a.m. hour, meanwhile, averaged 4.447 million total viewers and a 1.4 rating among adults aged 25–54, marking that hour's best ratings since the week of August 11, 2008. The 10:00 a.m. hour averaged 2.412 million total viewers and a .8 rating in the demographic, the highest total viewership for that portion of the program since the week of December 31, 2007.[87]\n\nFor the week of April 11, 2011, the program passed its 800th consecutive week as the No. 1 rated network morning news program, with 5.662 million total viewers (ahead of Good Morning America by approximately 1.2 million viewers).[88]\n\nDuring the week of April 25, 2011, Today averaged 6.424 million viewers, marking its best weekly total viewership since August 11, 2008, during the Beijing Olympics. This was largely buoyed by the April 29 coverage of the wedding of Prince William and Catherine Middleton, which earned 9.628 million viewers (beating Good Morning America's coverage by more than 1.6 million viewers), and was also the best single day rating since November 8, 2000, the day after the 2000 presidential election.[89]\n\nInternational broadcasts [ edit ]\n\nNBC News programs, including the live broadcast of Today , are shown daily on the 24-hour news network OSN News in MENA Region.\n\n, are shown daily on the 24-hour news network OSN News in MENA Region. In Australia, NBC Today (the title used in that country to avoid confusion with the local Nine Network program Today ) airs an edited 42-minute version of the first two hours from 4:00 a.m. Tuesday to Saturday on the Seven Network (rerun at 9:00 a.m. on sister network 7Two). The Today's Take hour (which is abbreviated to the same runtime) only airs Saturdays on the primary channel and Tuesday to Saturday on 7Two; while Seven broadcasts the Sunday edition at 5:00 a.m. on Mondays, following Meet The Press . The program was originally trimmed to 63 minutes, with the local news cutaways removed. However, a news ticker appears at the bottom of the screen, containing national headlines, as well as information on the next edition of Seven's morning program Sunrise . A national weather map of Australia is inserted during local affiliate cutaways during the weather segment. Today does not air on the primary regional affiliates Prime7 and GWN7, which instead air paid programming.\n\n(the title used in that country to avoid confusion with the local Nine Network program ) airs an edited 42-minute version of the first two hours from 4:00 a.m. Tuesday to Saturday on the Seven Network (rerun at 9:00 a.m. on sister network 7Two). The hour (which is abbreviated to the same runtime) only airs Saturdays on the primary channel and Tuesday to Saturday on 7Two; while Seven broadcasts the Sunday edition at 5:00 a.m. on Mondays, following . The program was originally trimmed to 63 minutes, with the local news cutaways removed. However, a news ticker appears at the bottom of the screen, containing national headlines, as well as information on the next edition of Seven's morning program . A national weather map of Australia is inserted during local affiliate cutaways during the weather segment. does not air on the primary regional affiliates Prime7 and GWN7, which instead air paid programming. In the Philippines, Today aired on 9TV (formerly called as Talk TV and Solar News Channel) from 2011 to August 2014; an edited 90-minute version of the weekday editions aired Tuesdays through Saturdays at 5:30 a.m., with a two-hour abbreviated broadcast of the Friday editions airing at 10:00 a.m. local time on Saturdays. Weekend Today airs Saturdays for two hours at 10:00 p.m. and Sundays at 11:00 p.m. local time. The local affiliate cutaways during the weather segment were removed only from the weekday editions. Today with Kathie Lee and Hoda (titled Today's Talk for the TalkTV/SNC/9TV broadcasts) aired Tuesdays to Saturdays at 3:00 a.m. Both shows were removed from the schedule since then, particularly with the relaunch of 9TV as CNN Philippines.\n\naired on 9TV (formerly called as Talk TV and Solar News Channel) from 2011 to August 2014; an edited 90-minute version of the weekday editions aired Tuesdays through Saturdays at 5:30 a.m., with a two-hour abbreviated broadcast of the Friday editions airing at 10:00 a.m. local time on Saturdays. airs Saturdays for two hours at 10:00 p.m. and Sundays at 11:00 p.m. local time. The local affiliate cutaways during the weather segment were removed only from the weekday editions. (titled for the TalkTV/SNC/9TV broadcasts) aired Tuesdays to Saturdays at 3:00 a.m. Both shows were removed from the schedule since then, particularly with the relaunch of 9TV as CNN Philippines. In the United Kingdom and Europe, Today originally aired on Sky News from 1989 to 1993, and on NBC Europe from 1993 to 1998. The show was initially aired live in the afternoon until 1995, when NBC Europe began airing it on a one-day delay the morning after the original U.S. broadcast.\n\nSee also [ edit ]\n\nList of special editions of Today (American TV program), for editions of the program marking major news events or breaking news coverage\n\nReferences [ edit ]\n\nNotes [ edit ]\n\n1. ^ Today Girl\" and panelist. In 1966, she began regularly co-anchoring alongside Downs. In 1974, following the death of McGee, she was titled \"co-host\".", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Willie_Geist.JPG/87px-Willie_Geist.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Dave_Garroway_J_Fred_Muggs_Today_show_1954.JPG/180px-Dave_Garroway_J_Fred_Muggs_Today_show_1954.JPG", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Today_show_%282009-13%29_logo.png/180px-Today_show_%282009-13%29_logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/GE_Building_by_David_Shankbone.JPG/170px-GE_Building_by_David_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Jenna_Bush_Hager_2017_2.jpg/85px-Jenna_Bush_Hager_2017_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Today_show_1961.JPG/180px-Today_show_1961.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Today_show_set_1952.jpg/180px-Today_show_set_1952.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Savannah_Guthrie_2012_Shankbone.JPG/96px-Savannah_Guthrie_2012_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/en/1/18/Today_logo_2013.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Dylan_Dreyer.jpg/76px-Dylan_Dreyer.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Dave_Garroway_on_Today_1955.jpg/180px-Dave_Garroway_on_Today_1955.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Hoda_Kotb.jpg/104px-Hoda_Kotb.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Craig_Melvin.png/73px-Craig_Melvin.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/18/Today_logo_2013.png/250px-Today_logo_2013.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Carson_Daly.jpg/99px-Carson_Daly.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Kristen_Welker_by_Gage_Skidmore.jpg/72px-Kristen_Welker_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/%27Today%27_Show_Co-Hosts_Roker%2C_Guthrie%2C_Morales_Look_on_as_Fellow_Co-Host_Lauer_Interviews_Secretary_Kerry_About_Iran_Deal_in_New_York_%2819781676778%29.jpg/220px-%27Today%27_Show_Co-Hosts_Roker%2C_Guthrie%2C_Morales_Look_on_as_Fellow_Co-Host_Lauer_Interviews_Secretary_Kerry_About_Iran_Deal_in_New_York_%2819781676778%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Natalie_Morales_US_Navi_2011_NewYork.jpg/67px-Natalie_Morales_US_Navi_2011_NewYork.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Sheinelle_Jones.jpg/76px-Sheinelle_Jones.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Today_torino.jpg/215px-Today_torino.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Al_Roker_crop.jpg/85px-Al_Roker_crop.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Today_show_panel_1973.JPG/200px-Today_show_panel_1973.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/18/Today_logo_2013.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Today_(American_TV_program)", "title": "Today (American TV program)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/18/Today_logo_2013.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}