{"url": "https://www.seventeen.com/celebrity/movies-tv/a19834186/13-reasons-why-season-2-cast/", "text": "13 Reasons Why season one was based on a book of the same name. Without a book sequel, season 2 of the acclaimed show was sure to surprise hardcore and new fans alike (and fans who have binge-watched the new season in its entirety are truly shocked).\n\nIt should come as no surprise that there's going to be a whole new cast of characters joining the characters you've already come to know, love, AND hate. Here's everything you need to know about the additions...\n\nChloe is Liberty High’s beautiful “it girl’ who’s also the new head cheerleader. The actress who's playing her, Anne Winters, has appeared in FX’s Tyrant and ABC’s Wicked City.\n\nGetty Images\n\nChelsea is an artsy, witty type unafraid to speak her mind. Alden appeared on American Horror Story: Roanoke last year.\n\nMackenzie's brother, Cyrus is an edgy, cynical mischief-maker who champions the downtrodden. This is Cass’s first major role.\n\nCourtesy of Advantage PR\n\nJackie is a warm, intelligent, passionate advocate for victims of bullying. Kelli is a Broadway star who won a Tony for The King and I in 2015. She's also appeared in CBS All Access’s The Good Fight.\n\nGetty Images\n\nNina is a respected track star with a secret that's bound to cause trouble in season two. Samantha has appeared on MTV’s Teen Wolf and Freeform’s The Fosters among others.\n\n\n\nGetty Images\n\nSonya is a smart and ambitious young litigator. Could she play a role in finally bringing Bryce to justice for raping Jessica? Allison starred in Syfy’s Incorporated and Fox’s Terra Nova.\n\n\n\nGetty Images\n\nBen Lawson as Rick\n\nLawson plays Liberty High's beloved baseball coach, which means he was probably devastated when Jeff Atkins died in that car crash during season one.\n\n\n\nJake Weber and Brenda Strong as Barry and Nora\n\nBarry and Nora are Bryce's parents. They were leaders in their community, but that could all change once Bryce begins facing the consequences of raping Jess in season one. The actors that play them, Jake and Brenda, are industry vets. Jake starred in NBC's Medium and Brenda played Mary Alice Young on Desperate Housewives.\n\n\n\nGetty Images\n\nMeredith Monroe as Carolyn\n\nCarolyn is Alex's mother. She's a hardworking nurse, so could she have been working at the hospital when Alex came in with a gunshot wound? How will she react when she learns how Alex ended up with his injury? Was it self-inflicted or did Tyler shoot him (like some fans are theorizing)? Meredith won't have any trouble in her emotional scenes since she played Andie McPhee in the popular teen drama, Dawson's Creek.\n\nGetty Images\n\nR.J. Brown as Caleb\n\nCaleb is Tony's boxing trainer. He's a fierce competitor inside the ring, but the funniest guy in the room outside of it. You might recognize R.J. Brown because he played Thomas White on The Carrie Diaries.\n\n\n\nGetty Images\n\nNoelle Devoe is the Entertainment Editor at Seventeen.com. Follow her on Twitter and Instagram!\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=1xw:0.9433701657458563xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=1xw:0.9433701657458563xh;center,top&resize=1200:*", "keywords": [], "authors": ["Noelle Devoe", "Entertainment Editor", "When I'M Not Holed Up In My Room Going On A Completely Unproductive Netflix Binge Or Tumblr Stalking Timothée Chalomet", "I'M Searching For Awesome Celeb News Stories That Seventeen Readers Will Love"], "canonical_link": "https://www.seventeen.com/celebrity/movies-tv/a19834186/13-reasons-why-season-2-cast/", "title": "Here Are All The New Characters From \"13 Reasons Why\" Season 2", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Here Are All The New Characters From \"13 Reasons Why\" Season 2", "description": "Get ready to become obsessed with some new faces.", "url": "https://www.seventeen.com/celebrity/movies-tv/a19834186/13-reasons-why-season-2-cast/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=1xw:0.9433701657458563xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2018-05-27 10:26:37", "published_time": "2018-05-21 08:30:00", "section": "Movies & TV", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=1xw:0.9433701657458563xh;center,top&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "'13 Reasons Why' Season 2 Cast - Meet the New Actors in 13 Reasons Why", "description": "13 Reasons Why is coming back for season 2, and there are some new faces on the cast. Here, get to know the full cast of 13RW season 2.", "keywords": "13 reasons why season 2 cast, 13 reasons why season 2 characters, 13 reasons why season 2 actors, 13 reasons why season 2 stars, who will be in 13 reasons why season 2, are there new characters in 13 reasons why season 2", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=0.5300146412884333xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,movies-tv", "sailthru.date": "2018-05-21T20:30:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=1xw:0.9433701657458563xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reasons-why-1523924328.jpg?crop=0.5300146412884333xw:1xh;center,top", "sailthru.socialtitle": "Here Are All The New Characters From \"13 Reasons Why\" Season 2", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1526862600.0, "source": "https://www.seventeen.com", "summary": ""}