{"url": "https://web.archive.org/web/20181012142149/https://www.forbes.com/sites/erikkain/2018/10/12/three-big-mistakes-the-walking-dead-made-in-the-season-9-premiere/", "text": "AMC's zombie drama returned last Sunday with the season 9 premiere---an episode which marked an uptick in overall quality for The Walking Dead, but still made some old, avoidable foibles that almost look like bad habits at this point.\n\nNew showrunner Angela Kang has been a writer on the show since Season 2, and it appears that even with improved dialogue and cinematography, she's been unable to shed some of the show's most annoying proclivities. Old habits die hard, it seems. But, like Gregory and a few other characters, they really do need to die.\n\nLet's take a look at three big mistakes the show made in its Season 9 premiere, and how each could have been easily avoided with a little more quality control and a little bit more courage. With some very small changes, this could have been a much better episode.\n\nSpoilers through Season 9 of 'The Walking Dead' follow.\n\n1. The museum scene.\n\nThings got off to something of a bad start when our heroes went to D.C. I'm going to list this as a two-part problem. My first problem with this sequence is a creative disagreement with the show's producers and writers. My second is pretty much just the objective truth.\n\nFirst: An excursion to Washington D.C. to find seeds and other tools should have been a much more interesting, extended story. I think you could easily fit in an episode or two with a small group of scavengers going to D.C. and getting into various pickles there. That it was just one not very good scene at a museum really diminished something I was looking forward to, stripping of it of almost all its potential as an interesting little adventure (which the show has so few of these days.)\n\nSecond: The museum scene was just bad. There was very little explanation as to why they needed all these heavy objects---surely there were more modern versions of things like carts and ploughs which they could find on farms or in hardware stores.\n\nWorse, the entire sequence with the glass floor was embarrassingly bad. The floor itself would not have cracked so easily. That kind of glass is made to withstand a great deal more impact. But even if they'd had it broken to begin with, making it more precarious from the get-go, there was no reason they couldn't have found another way around it. Passing items over the railing would have worked. Ezekiel could have avoided walking the entire length of the breaking glass by simply turning to one side or the other once exiting the stairs.\n\nThis is a classic example of The Walking Dead's writers treating its viewers with contempt. We aren't that stupid. And neither are these characters. These hardened survivors of the apocalypse should know better---and would know better if they weren't continually written into these same corners over and over and over again. This entire sequence was insulting to our intelligence and had no business being in a premiere cable TV show.\n\n2. The death scene.\n\nThe second big problem of the night came shortly after the first. Our group, comprised largely of characters we know and then also one other guy named Ken, is bringing the museum loot back to Alexandria and Hilltop when a small mob of zombies shuffles up behind them.\n\nThis leads to much fear and commotion, despite this being a much smaller zombie mob than we've seen the same survivors deal with easily in the past.\n\nOne thing leads to another and they decide to all run away and, bafflingly, abandon the horses. In an apocalypse where cars are no longer an option, horses must be one of the most prized---and hard to come by---resources out there. But a few zombies can scare Rick and his band of hardened survivors away regardless.\n\nUtterly unconvincing. So when Ken (I think that was his name) runs back to save the horses we know right away he's going to die. For reasons the show cannot provide, a zombie manages to sneak up on him and nobody can get to him in time to save him. Maybe that looked okay on paper, but it didn't work on TV and left us with that bad, unconvincing taste in our mouths.\n\nThe Fix:\n\nNow, you can fix #1 and #2 in one fell swoop pretty easily (but it won't fix #3.)\n\nSimply have the glass in the museum already breaking when they get there. Have them do everything in their power to avoid standing on it (like actual people with a self-preservation motive would do) but have something go wrong. Maybe there's one last item (like the cart) that they can't get around the glass and they lose control and instead of Ezekiel falling through the glass, Ken falls through the glass and is torn apart by zombies in the most gruesome manner possible.\n\nNow we can avoid the bad parts of the museum scene and cut the other scene entirely and we get a more shocking, gory death. Everybody wins!\n\nThere's just one problem . . . .\n\n3. Using a character we don't know as a catalyst for an important event. Don't do that.\n\nEvery single significant death in a show needs to have a reason or serve some higher purpose, even if it just to shock audiences.\n\nKen's death in the Season 9 premiere served a purpose, but it didn't connect with us emotionally. It was a catalyst for Gregory's final, fatal betrayal of Maggie. It led him to make a very stupid power play, the straw that broke the Maggie's back, as it were, when he got the blacksmith drunk and convinced him to kill Maggie.\n\nThe problem? There's no payoff. No emotional weight. Because Ken was not an established character at all. He was introduced just to die. His parents were introduced just so that the father could become Gregory's tool in his latest horrible scheme.\n\nThis is something we saw happen from time to time in Lost. Characters were suddenly introduced on the island (how did they get there?) only to be killed off later that episode. We, as viewers, never gave a damn because we had no connection to these strangers.\n\nThis is hardly the first time The Walking Dead has done this, of course. That scene where Simon stops Maggie's caravan and kills that one guy---Dave was it?---who we only just met moments earlier. Another scene I think all the way back in Season 5 where a brand new character and love interest of Beth's falls into a zombie-infested cellar. I'm pretty sure that happened but I don't remember it well or care at all because we never care about brand new characters.\n\nOkay, that's not always true. A skilled filmmaker can make us care deeply about characters we just met. Think of the opening moments of A Quiet Place, or the puppy scene in John Wick. But that takes a bit of work. You have to establish an emotional connection in a very short period of time to a character (or dog) we just met. It can be done, but it takes more than a twenty second conversation on the road followed by a swift death and a bunch of melodramatic \"blame Maggie\" scenes. (Seriously you miserable pricks, I get that your son just died and that sucks and you should feel sad, but blaming Maggie for this is absurd. It's the zombie apocalypse. People are dying all the time. Grow up.)\n\nThe Fix:\n\nSo how could you fix this problem and #1 and #2? Given that the blacksmith's family was not introduced in prior seasons, the only way I can figure it out is to make the D.C. trip longer. Three or four episodes at least. Have Ken play a much larger role and get us to really like him. Introduce his parents early on, too. Let us get to know them at least a little before he is ripped to tiny giblets by the walking dead.\n\nEstablishing Ken as an important, likable character before offing him would definitely help, especially if it was a surprise. I add \"likable\" to the mix because, as we saw in season 4 of Fear The Walking Dead, introducing a character everyone hates and then making him the final \"big death\" of the season is also terrible writing.\n\nSo those are my big three problems with the Season 9 premiere. Without them, I think it would have been a really strong episode. With them, because they're so easily avoidable and so in keeping with all The Walking Dead's worst habits over the years, the episode was just okay. It had some very good moments, but those were sullied by these inexplicably bad ones.\n\nSo this is my message---my plea---my best advice to Angela Kang: Every episode needs to be checked over and checked again for this kind of mistake. Quality Control's job needs to be finding every instance of a Walking Dead character making an out-of-character decision or acting stupid for no reason (other than to further the plot) and ensure that it's rewritten to make sense. Sure, some people who watch this show are not particularly discerning, who think just because the premise is outlandish nothing needs to be plausible, but a great deal of the audience (the dwindling audience, I might add) wants this show to be a realistic take on the apocalypse. Make these actions add up. Earn your outcomes.\n\nFortunately, I think the next two episodes are less impacted by this all-too-familiar Walking Dead nonsense, though I can't speak to the rest of the season. Let me know what you think of all this on Twitter or Facebook. Cheers!\n\nBonus: When Rick walks into the Sanctuary a bunch of people kind of turn in awe and one of the Saviors says \"That's Rick Grimes. He ended the war!\" and it's just such a classic Walking Dead moment where anyone with half a brain watching just slaps their forehead and shakes their head in pure wonder and amazement that anyone would write a line so on-the-nose and that, once filmed, it would ever manage to make the final cut.\n\nNot only does nobody actually talk like that, it's just totally superfluous. We know Rick ended the war. He also started it. We don't need some weird recap from some random side character. Thanks a lot, Captain Obvious.\n\nHere's my video review:", "images": ["https://web.archive.org/web/20181012142149im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F10%2FTWD_901_JLD_0504_4151_RT.jpg", "https://web.archive.org/web/20181012142149im_/https://secure.gravatar.com/avatar/0b95268a1a76ca3c83a2112b38af5958?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20181012142149im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F10%2FTWD_901_JLD_0504_4151_RT.jpg", "keywords": [], "authors": ["Erik Kain", "I Write About Video Games", "Tv", "Senior Contributor"], "canonical_link": "https://web.archive.org/web/20181012142149/https://www.forbes.com/sites/erikkain/2018/10/12/three-big-mistakes-the-walking-dead-made-in-the-season-9-premiere/", "title": "The 3 Biggest Mistakes 'The Walking Dead' Made In The Season 9 Premiere", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "The 3 Biggest Mistakes 'The Walking Dead' Made In The Season 9 Premiere", "image": "https://web.archive.org/web/20181012142149im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F10%2FTWD_901_JLD_0504_4151_RT.jpg", "updated_time": "2018-10-12T08:00:31-04:00", "url": "https://web.archive.org/web/20181012142149/https://www.forbes.com/sites/erikkain/2018/10/12/three-big-mistakes-the-walking-dead-made-in-the-season-9-premiere/", "description": "These three mistakes held back The Walking Dead's Season 9 Premiere, forcing us to focus on the negative rather than the positive.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "The 3 Biggest Mistakes 'The Walking Dead' Made In The Season 9 Premiere", "description": "These three mistakes held back The Walking Dead's Season 9 Premiere, forcing us to focus on the negative rather than the positive.", "image": "https://web.archive.org/web/20181012142149im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F10%2FTWD_901_JLD_0504_4151_RT.jpg", "creator": "@erikkain"}, "description": "These three mistakes held back The Walking Dead's Season 9 Premiere, forcing us to focus on the negative rather than the positive.", "author": "Erik Kain", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Erik Kain", "section": "Innovation", "section_url": "https://www.forbes.com/games/", "id": "blogAndPostId/blog/post/1360-51914", "published": "2018-10-12", "modified": "2018-10-12"}}, "movies": [], "publish_date": 1539273600.0, "source": "https://web.archive.org", "summary": ""}