{"url": "https://deadline.com/2018/08/big-bang-theory-decision-jim-parsons-chuck-lorre-12-seasons-cbs-1202451333/", "text": "It was a typical morning for everyone working on The Big Bang Theory on Wednesday until the entire cast was summoned to co-creator/executive producer Chuck Lorre’s office after the table read with no advance notice and no agenda. Many people on the show felt it might have been a meeting to discuss a possible 13th season, as CBS had started talks with producer Warner Bros TV about anther two-season pickup, though the actors had not yet been approached by the studio for new deals.\n\nInstead, I hear Lorre gave the floor to star Jim Parsons, who made a tearful announcement that he would not be continuing on the series beyond the upcoming 12th season. With the entire room still reeling from the shock, I hear Lorre revealed that the series too would end with Season 12.\n\nYesterday was a very emotional day in the offices of The Big Bang Theory, with cast and crew hanging out and hugging each other. “It’s family over there,” one insider said about the team that had been together for many, many years.\n\nThat’s why Lorre made the decision not to continue with the show unless all key auspices were coming back. Parsons is one of the series’ “big three,” along with Johnny Galecki and Kaley Cuoco. Lorre had publicly said he would not do the series without any of the original three leads. Additionally, Parsons’ character on Big Bang, Sheldon Cooper, is at the center of the Big Bang prequel series Young Sheldon, which the actor executive produces and does voice over for.\n\nI hear Parsons informed Lorre about his decision to leave after the end of the season on Friday, when I hear renewal talks with CBS were still ongoing. I hear there were efforts over the weekend to persuade him to change his mind, which were unsuccessful.\n\nParsons has been actively doing theater and movies while on Big Bang over the past few years, with the production accommodating him. Because the series had been going for so long — according to Warner Bros TV, Big Bang will become the longest-running multi-camera series in television history with 279 episodes — it is a well-oiled machine, with the cast working 3.5 days a week during production. Still, I hear Parsons was ready to move on.\n\nThis morning, Parsons, a four-time Emmy winner for his role on Big Bang, posted a lengthy and emotional message on Instagram.\n\n“It is hard (really impossible, actually) to really accept that this is a picture of the first of the final 24 episodes we will shoot for The Big Bang Theory,” he wrote before expressing “intense gratitude” toward the crew, the writers and his castmates. “I will miss all of you and all of this more than I can say and more than I can know at this time.” (Read his full note under the post.)\n\nThe entire cast’s current contracts — paying the five original cast member around $1 million an episode — are up after the current Season 12, so all had to sign new ones in order to return.\n\nThat is how, in the span of two weeks, we went from CBS executives being confident that “we don’t believe it’s the final season,” having already started renewal discussions with WBTV, to yesterday’s surprise announcement that Big Bang, the most watched series on television, is coming to an end.\n\n“We are forever grateful to our fans for their support of The Big Bang Theory during the past twelve seasons. We, along with the cast, writers and crew, are extremely appreciative of the show’s success and aim to deliver a final season, and series finale, that will bring The Big Bang Theory to an epic creative close,” WBTV, CBS and Chuck Lorre Productions said in the joint statement.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F08%2Fbig-bang-theory-decision-jim-parsons-chuck-lorre-12-seasons-cbs-1202451333%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202451333&comment_count=34", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/05/the-big-bang-theory.jpg?w=1024"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/05/the-big-bang-theory.jpg?w=1024", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/08/big-bang-theory-decision-jim-parsons-chuck-lorre-12-seasons-cbs-1202451333/", "title": "‘The Big Bang Theory’: Behind The Sudden Decision To End Series After 12 Seasons", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Jim Parsons told the cast he would not continue on the series past the upcoming 12th season. Chuck Lorre said that goes for the series, too.", "news_keywords": "CBS, Chuck Lorre, Jim Parsons, The Big Bang Theory", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Big Bang Theory’: Behind The Sudden Decision To End Series After 12 Seasons", "url": "https://deadline.com/2018/08/big-bang-theory-decision-jim-parsons-chuck-lorre-12-seasons-cbs-1202451333/", "description": "It was a typical morning for everyone working on The Big Bang Theory on Wednesday until the entire cast was summoned to co-creator/executive producer Chuck Lorre’s office after the table read…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/05/the-big-bang-theory.jpg?w=1024", "width": 1024, "height": 683, "alt": "The Big Bang Theory"}, "locale": "en_US"}, "article": {"published_time": "2018-08-23T20:18:03+00:00", "modified_time": "2018-08-24T04:14:37+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘The Big Bang Theory’: Behind The Sudden Decision To End Series After 12 Seasons"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/05/the-big-bang-theory.jpg?w=1024", "alt": "The Big Bang Theory"}, "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "‘The Big Bang Theory’: Behind The Sudden Decision To End Series After 12 Seasons", "description": "Jim Parsons told the cast he would not continue on the series past the upcoming 12th season. Chuck Lorre said that goes for the series, too."}, "author": "Nellie Andreeva", "content_type": "Article", "post_id": 1202451333, "title": "'The Big Bang Theory': Behind The Sudden Decision To End Series After 12 Seasons", "published_at": "2018-08-23 13:18:03", "image": "https://pmcdeadline2.files.wordpress.com/2017/05/the-big-bang-theory.jpg?w=296&h=166&crop=1", "comment_count": 34, "tags": "The Big Bang Theory", "topics": "TV", "body": "It was a typical morning for everyone working on The Big Bang Theory on Wednesday until the entire cast was summoned to co-creator/executive producer Chuck Lorre's office after the table read with no advance notice and no agenda. Many people on the show felt it might have been a meeting to discuss a possible 13th season, as CBS had started talks with producer Warner Bros TV about anther two-season pickup, though the actors had not yet been approached by the studio for new deals.\r\n\r\nInstead, I hear Lorre gave the floor to star Jim Parsons, who made a tearful announcement that he would not be continuing on the series beyond the upcoming 12th season. With the entire room still reeling from the shock, I hear Lorre revealed that the series too would end with Season 12.\r\n\r\nYesterday was a very emotional day in the offices of The Big Bang Theory, with cast and crew hanging out and hugging each other. \"It's family over there,\" one insider said about the team that had been together for many, many years.\r\n\r\nThat's why Lorre made the decision not to continue with the show unless all key auspices were coming back. Parsons is one of the series' \"big three,\" along with Johnny Galecki and Kaley Cuoco. Lorre had publicly said he would not do the series without any of the original three leads. Additionally, Parsons' character on Big Bang, Sheldon Cooper, is at the center of the Big Bang prequel series Young Sheldon, which the actor executive produces and does voice over for.\r\n\r\nI hear Parsons informed Lorre about his decision to leave after the end of the season on Friday, when I hear renewal talks with CBS were still ongoing. I hear there were efforts over the weekend to persuade him to change his mind, which were unsuccessful.\r\n\r\nParsons has been actively doing theater and movies while on Big Bang over the past few years, with the production accommodating him. Because the series had been going for so long -- according to Warner Bros TV, Big Bang will become the longest-running multi-camera series in television history with 279 episodes -- it is a well-oiled machine, with the cast working 3.5 days a week during production. Still, I hear Parsons was ready to move on.\r\n\r\nThis morning, Parsons, a four-time Emmy winner for his role on Big Bang, posted a lengthy and  emotional message on Instagram.\r\n\r\n“It is hard (really impossible, actually) to really accept that this is a picture of the first of the final 24 episodes we will shoot for The Big Bang Theory,\" he wrote before expressing  \"intense gratitude\" toward the crew, the writers and his castmates. \"I will miss all of you and all of this more than I can say and more than I can know at this time.\" (Read his full note under the post.)\r\n\r\nThe entire cast's current contracts -- paying the five original cast member around $1 million an episode -- are up after the current Season 12, so all had to sign new ones in order to return.\r\n\r\nThat is how, in the span of two weeks, we went from CBS executives being confident that “we don’t believe it’s the final season,\" having already started renewal discussions with WBTV, to yesterday's surprise announcement that Big Bang, the most watched series on television, is coming to an end.\r\n\r\n“We are forever grateful to our fans for their support of The Big Bang Theory during the past twelve seasons. We, along with the cast, writers and crew, are extremely appreciative of the show’s success and aim to deliver a final season, and series finale, that will bring The Big Bang Theory to an epic creative close,” WBTV, CBS and Chuck Lorre Productions said in the joint statement.\r\n\r\nhttps://www.instagram.com/p/Bm1ATQcgQHE/?taken-by=therealjimparsons", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1535055483.0, "source": "https://deadline.com", "summary": ""}