{"url": "https://variety.com/2018/tv/news/bachelor-arie-becca-lauren-breakup-proposal-bachelorette-1202720988/", "text": "SPOILER ALERT: Do not read ahead if you have not watched the finale of Arie Luyendyk Jr.’s season of “The Bachelor” or “After the Final Rose.”\n\nAs host Chris Harrison warns each and every season, “The Bachelor” finale is always dramatic. But this week’s controversial closer had an unprecedented ending, which has since stirred an uproar.\n\nOn Monday night’s finale, “The Bachelor” Arie Luyendyk Jr. proposed to Becca Kufrin and the couple was engaged. However, over the next two months, after the season had wrapped, Luyendyk had a change of heart and realized he made the wrong choice and was actually in love with runner-up Lauren Burnham, so he broke up with Kufrin — and the entire thing was caught on film.\n\nABC’s cameras followed Luyendyk as he broke off his engagement to Kufrin, and the network aired the scene completely unedited, showing exactly what happened between the pair during the difficult conversation.\n\nThe following night on “After the Final Rose,” Kufrin was named ABC’s next leading lady who will star in “The Bachelorette,” and her journey to find love again began last night on “After the Final Rose.”\n\nMeanwhile, Luyendyk sat down with Burnham on “After the Final Rose,” as the glowing couple told America about their rekindled relationship over the past two months, and then Luyendyk proposed to Burnham. The two are now engaged, and have embarked on a mini media tour, sitting down with Jimmy Kimmel, and making appearances today on ABC’s “Good Morning America” and “Live With Kelly and Ryan.”\n\nThe dramatic two-part finale has garnered overwhelming support for Kufrin, but has caused a social media outcry in response to Luyendyk’s behavior.\n\nHere, ABC’s executive in charge of “The Bachelor” franchise, Robert Mills, senior VP of alternative series, specials, and late-night programming, talks to Variety about filming the breakup and choosing to air the footage completely unedited — plus, what he thinks about Kufrin as the next “Bachelorette.”\n\nLooking back on the entire season, what do you think overall?\n\nI liked this season. I think it’s pretty clear we made a conscious decision to do a more straightforward season of “The Bachelor,” and I liked that because at the end of the day, we really believe in this concept and really want it to be about finding love and making connections. I’m really proud of it, creatively. I’m not blind that the ratings are down, so that’s a bit of a disappointment, and I wish that the audience had liked this season a little better. We’ve seen some negativity both toward Arie and the some of the people in this season and the show in general, so every season when the show ends, me and the producers take a look at what worked and what didn’t and we will work to make a phenomenal season of “The Bachelorette.”\n\nWhat went into the decision to film Arie and Becca after the proposal? You had never done that before.\n\nIt lends credence to the fact that “The Bachelor” is not just over the top because one of the problems [with the show] is that you’re dating people in a way that you never would in real life, and then you have to start a life with this person, and so in the finale, you actually see what happens in the real world. It’s incredibly relatable and it’s a place we’ve all been. The stuff you see here is stuff that we’ve all done and we’ve all been through. There’s heartbreak and there is hope, but it is riveting and it’s why we watch “The Bachelor” because when good or bad things happen, we all want to relate that these things happen to other people. When the show really does that, it’s when it’s at it’s best.\n\nWhat was your reaction when Arie started having second thoughts, and wanted to break up with Becca to get back together with Lauren?\n\nYou go to the place where you say this will be great, riveting TV, but you’ve got to realize that these are real people — not just Becca, but Arie and Lauren — and this could happen to anyone, so I think that makes it really difficult. Part of the importance of doing this on camera is it’s sort of a contract with the audience that you’re going to see the whole relationship from beginning to end on TV, and you’re taking that journey with them, and it’s important to understand the whole thing because now there will be no doubt in anyone’s mind what the reason is [that Arie and Becca broke up]. People can feel how they want to after seeing it, as opposed to just hearing about it.\n\nYou have never shown footage of a couple after the proposal, and in this case, you filmed for an additional two months. In future seasons, will you be continuing to film couples after the proposal?\n\nThe things we’ve learned with “The Bachelor” is that it has to constantly evolve. Like you see with the fantasy suite, now you see the morning after, and that’s really important because it’s a totally different phase of the relationship and those conversations inform how all of the decisions are going to be made. So this change is the same thing, and I think you’ll start to see more of this now, as we keep evolving the show.\n\nWas it just a coincidence that the first time you decided to continue to film after the proposal, that this bombshell breakup happened?\n\nIt wasn’t purposeful. A lot of the stuff was shot on iPhones and it’s just stuff that we had of them being together and being kind of goofy together. It was interesting watching it and getting to see how these people are in real life, so I am glad it gave us a reason to use that [iPhone footage], and I think we’ll look at how we can implement that more in seasons going forward. But it wasn’t like, “Oh my god, thank god we had this footage.” It just worked itself in organically into the fabric of the finale.\n\nCan you clear up the timeline of the proposal and the breakup, and Lauren starting to date Arie?\n\nThe proposal happened right before Thanksgiving and then the breakup happened in January, so it was almost two months in between, and that’s when Arie asked Lauren for a second chance, just so they can date. And that was two months ago, and things are going incredibly well.\n\nHow long after the breakup did ABC ask Becca to be “The Bachelorette?”\n\nYou have to be respectful. You can’t say, “You just had your heart broken. Do you want to meet 25 new guys?” It was a very slow process. Fortunately, we had time because this was mid-January and the finale doesn’t air until mid-March. I know two months doesn’t seem like a lot, and the feelings are still raw, but she still just wanted to keep trying. I think when you’ve had great tragedy in your life, like she’s had, there is a resilience that starts to come in, and you realize that for better or worse, life goes on and you’re better off taking a chance. So we moved slowly [asking her to be “The Bachelorette”], but when she came around to it, it got really exciting. It started very slowly and then it got very serious in the middle of February. She actually hadn’t signed until basically a couple of days ago, so it was definitely a lot of thinking. She’s also very close with her family and I don’t know if her family wanted her to jump right back into a show that caused her so much heartbreak, but they are supportive and that’s fantastic.\n\nThere’s been a lot of discussion surrounding the lack of diversity with leads on “The Bachelor” franchise, and just last year, Rachel Lindsay was the first-ever African American lead on “The Bachelorette.” What went into the decision naming Becca next season’s lead?\n\nI’m super proud of this cast [from Arie’s season]. We look at everything, and diversity is not only ethnicity, but also it’s the types of women that we had, and I was really happy that we had a lot of types of different women. We had a lot of professional women and strong women who are their own women. With Becca, it was really a no-brainer decision. I think everybody, after they see how this plays out, they’re going to want to see her get her happy ending. This is a girl who’s been through so much — she lost her dad to brain cancer, her mother had a battle with breast cancer. She’s really strong and resilient, and you really root for her after the finale.\n\nEarlier in the season, Becca’s boyfriend from her past showed up, and a lot of people on Twitter criticized that scene for seeming staged, solely to create drama. He obviously didn’t just pop up in Peru, so how did he show up?\n\nI’m really glad you asked that. We sit down at the end of every season and we look at things and we say, “This is good, this worked, people didn’t like this, or people responded to this.” For me and the producers, something that really didn’t sit right was when DeMario’s [Jackson] girlfriend came back in Rachel’s [Lindsay] season — it just felt completely fake and it felt like this woman had a speech prepared and was ready to go — so when you see all of that, if it plays as false, then it pulls on a sweater thread and the whole thing can fall apart because it all seems false, and it’s not. So in this case, this guy reached out to production and said he heard Becca was on the show and he was really upset and wanted to see her. And as a producer, you think, ‘That’s a great storyline, if it’s authentic.’ But at the very least, we had to make sure that this guy was willing to put up the money to get to Peru, and see if this guy is genuine and didn’t want to just get on TV — and he did. So once we realized that this guy really has feelings for Becca and he wants to go, we did it. This was a guy that Becca had spoken about many times on the show as the one big relationship that she had, and seven years, that’s a long time. So that’s how it all came to be.\n\nWhy did you originally cast Arie as this season’s lead? Is it because he is a bit older, and perhaps ready for a real relationship?\n\nIt’s funny because Arie is the same age as Nick [Viall], but I think the reason why Arie comes off as older is because he has a more mature lifestyle. Nick Viall almost feels like an early-to-mid 20-something who is still figuring himself out and moved to L.A. Arie lives in Scottsdale, Ariz., where he’s showing houses, and he’s even slowed down with the racing. He’s a grown-up. I think that’s the difference, and that’s part of what went into the decision-making. I thought Nick’s season was great and I absolutely love Nick, but you watched that finale last year and he got engaged to Vanessa [Grimaldi], and it should have been this full-circle moment for him because he got so close with Andi [Dorfmann] and then he got so close with Kaitlyn [Bristowe] and then he finally found this person and it just felt like this thing is going to last for five minutes — and that’s what ended up happening. And everyone has to do their own thing so I’m not decrying anything that he did. But it just felt like we really wanted to find someone who was going to leave the spotlight after this was over, and that’s Arie. He was never one of those people that was really on social media and stayed in “The Bachelor” circle. He was just living his life.\n\nIt seems like the intention in casting Arie was to make this season the most authentic it could possibly be when it comes to looking for love, so why do you think ratings were down this season?\n\nI don’t know, but I will tell you that I was surprised when the ratings were up when Nick [Viall] was “The Bachelor,” so sometimes you just don’t know. Nick was a roll-of-the-dice because he’d been on “Bachelor in Paradise,” which is not usually the breeding ground for the lead, so sometimes you can’t put your finger on these things. When Sean Lowe was “The Bachelor,” it really came down to him and Arie, and it was down to the wire because people really wanted to see Arie be “The Bachelor” because he was so heartbroken by Emily [Maynard] so when we were making “The Bachelor” this year, it was surprising how many people said they didn’t know who he was. I know five years is not yesterday, but it’s also not so long ago. He was somebody who always remained in the conversation with fans — maybe not as many as I thought, but I thought there was a lot of appeal for Arie, and it was fascinating to see that we had to re-educate people [on Arie] on I think Arie also had to re-educate himself what it’s like to be on this type of show. I think he has a lot of personality, and it’s really on us for not showing more of that. You saw on “The Women Tell All” that he is really very funny, and I think if we had maybe shown more of that, maybe that would have helped. Also, we premiered on New Year’s Day and then the next day was the college football championship game and then you had the Olympics, so we had a lot of strikes against us. But it still felt like people cared — I heard a lot of chatter about the season online.\n\nSo you believe the numbers being down are due to competing programming and perhaps the lack of awareness for Arie — not any sort of “Bachelor” fatigue among audiences?\n\nI don’t think there’s “Bachelor” fatigue. The people that are watching, certainly all seem to like it and live for it. They might not like certain elements, but I haven’t seen anyone say, “I’m done watching ‘The Bachelor.’” But it is an interesting time right now in the world, and there might be people who say, “I just don’t feel like I can get an escape right now because the world is in a weird place.”\n\nOn the flip side of that, do you think the political climate and intense news cycle serve as a benefit to the show because it can be an escape for viewers?\n\nI think that’s right. Even when things are horrible on the show, as we’ve seen in this finale, there still is a measure of hope. At the end of the day, we are trying to make a version of a fairytale here and there is something about love that is hopeful, even when it is love that’s lost. There’s always going to be hope at the end of the day. There is something hopeful and escapist about this show. We’ve all made a fool of ourselves or gotten dumped, so I think there’s so much relatability to show.\n\nWhat do you expect Becca’s season of “The Bachelorette” to be like?\n\nThis could be one of the stranger seasons of “The Bachelorette” because she might not truly be over Arie and it may not work — I certainly hope it does, and we will do everything we possibly can to make sure it does, but you just don’t know. It certainly is a chance worth taking.\n\nPOPULAR VIDEO:", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2017/09/the-bachelor-arie-becca.jpg?w=1000", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fbachelor-arie-becca-lauren-breakup-proposal-bachelorette-1202720988%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202720988&comment_count=89", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/09/the-bachelor-arie-becca.jpg?w=1000", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2018/tv/news/bachelor-arie-becca-lauren-breakup-proposal-bachelorette-1202720988/", "title": "‘The Bachelor’: ABC Exec Reveals the Real Story Behind Arie’s Breakup and the Next ‘Bachelorette’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "ABC's executive in charge of \"The Bachelor\" franchise talks about filming the breakup and choosing to air the footage completely unedited.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202720988, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-03-07T13:27:41"}, "pmc-tag": "Arie Luyendyk Jr.,Becca Kufrin,Robert Mills,The Bachelor,The Bachelorette", "title": "‘The Bachelor’: ABC Exec Reveals the Real Story Behind Arie’s Breakup and the Next ‘Bachelorette’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Bachelor’: ABC Exec Reveals the Real Story Behind Arie’s Breakup and the Next ‘Bachelorette’", "url": "https://variety.com/2018/tv/news/bachelor-arie-becca-lauren-breakup-proposal-bachelorette-1202720988/", "description": "SPOILER ALERT: Do not read ahead if you have not watched the finale of Arie Luyendyk Jr.’s season of “The Bachelor” or “After the Final Rose.” As host Chris Harrison w…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/09/the-bachelor-arie-becca.jpg?w=1000", "width": 1000, "height": 563, "alt": "The Bachelor Arie Becca"}, "locale": "en_US"}, "article": {"published_time": "2018-03-07T21:27:41+00:00", "modified_time": "2018-03-07T21:27:41+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "‘The Bachelor’: ABC Exec Reveals the Real Story Behind Arie’s Breakup and the Next ‘Bachelorette’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/09/the-bachelor-arie-becca.jpg?w=1000", "alt": "The Bachelor Arie Becca"}, "card": "summary_large_image", "title": "‘The Bachelor’: ABC Exec Reveals the Real Story Behind Arie’s Breakup and the Next ‘Bachelorette’", "description": "ABC's executive in charge of \"The Bachelor\" franchise talks about filming the breakup and choosing to air the footage completely unedited."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202720988, "title": "‘The Bachelor’: ABC Exec Reveals the Real Story Behind Arie’s Breakup and the Next ‘Bachelorette’", "published_at": "2018-03-07 13:27:41", "image": "https://pmcvariety.files.wordpress.com/2017/09/the-bachelor-arie-becca.jpg?w=1000", "comment_count": 89, "tags": "The Bachelorette", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read ahead if you have not watched the finale of Arie Luyendyk Jr.'s season of \"The Bachelor\" or \"After the Final Rose.\"\r\n\r\nAs host Chris Harrison warns each and every season, \"The Bachelor\" finale is always dramatic. But this week's controversial closer had an unprecedented ending, which has since stirred an uproar.\r\n\r\nOn Monday night's finale, \"The Bachelor\" Arie Luyendyk Jr. proposed to Becca Kufrin and the couple was engaged. However, over the next two months, after the season had wrapped, Luyendyk had a change of heart and realized he made the wrong choice and was actually in love with runner-up Lauren Burnham, so he broke up with Kufrin -- and the entire thing was caught on film.\r\n\r\nABC's cameras followed Luyendyk as he broke off his engagement to Kufrin, and the network aired the scene completely unedited, showing exactly what happened between the pair during the difficult conversation.\r\n\r\nThe following night on \"After the Final Rose,\" Kufrin was named ABC's next leading lady who will star in \"The Bachelorette,\" and her journey to find love again began last night on \"After the Final Rose.\"\r\n\r\nMeanwhile, Luyendyk sat down with Burnham on \"After the Final Rose,\" as the glowing couple told America about their rekindled relationship over the past two months, and then Luyendyk proposed to Burnham. The two are now engaged, and have embarked on a mini media tour, sitting down with Jimmy Kimmel, and making appearances today on ABC's \"Good Morning America\" and \"Live With Kelly and Ryan.\"\r\n\r\nThe dramatic two-part finale has garnered overwhelming support for Kufrin, but has caused a social media outcry in response to Luyendyk's behavior.\r\n\r\nHere, ABC's executive in charge of \"The Bachelor\" franchise, Robert Mills, senior VP of alternative series, specials, and late-night programming, talks to Variety about filming the breakup and choosing to air the footage completely unedited -- plus, what he thinks about Kufrin as the next \"Bachelorette.\"\r\n\r\nLooking back on the entire season, what do you think overall?\r\n\r\nI liked this season. I think it’s pretty clear we made a conscious decision to do a more straightforward season of “The Bachelor,” and I liked that because at the end of the day, we really believe in this concept and really want it to be about finding love and making connections. I’m really proud of it, creatively. I’m not blind that the ratings are down, so that’s a bit of a disappointment, and I wish that the audience had liked this season a little better. We’ve seen some negativity both toward Arie and the some of the people in this season and the show in general, so every season when the show ends, me and the producers take a look at what worked and what didn’t and we will work to make a phenomenal season of “The Bachelorette.”\r\n\r\nWhat went into the decision to film Arie and Becca after the proposal? You had never done that before.\r\n\r\nIt lends credence to the fact that “The Bachelor” is not just over the top because one of the problems [with the show] is that you’re dating people in a way that you never would in real life, and then you have to start a life with this person, and so in the finale, you actually see what happens in the real world. It’s incredibly relatable and it’s a place we’ve all been. The stuff you see here is stuff that we’ve all done and we’ve all been through. There’s heartbreak and there is hope, but it is riveting and it’s why we watch “The Bachelor” because when good or bad things happen, we all want to relate that these things happen to other people. When the show really does that, it’s when it’s at it’s best.\r\n\r\nWhat was your reaction when Arie started having second thoughts, and wanted to break up with Becca to get back together with Lauren?\r\n\r\nYou go to the place where you say this will be great, riveting TV, but you’ve got to realize that these are real people — not just Becca, but Arie and Lauren — and this could happen to anyone, so I think that makes it really difficult. Part of the importance of doing this on camera is it’s sort of a contract with the audience that you’re going to see the whole relationship from beginning to end on TV, and you’re taking that journey with them, and it’s important to understand the whole thing because now there will be no doubt in anyone’s mind what the reason is [that Arie and Becca broke up]. People can feel how they want to after seeing it, as opposed to just hearing about it.\r\n\r\nYou have never shown footage of a couple after the proposal, and in this case, you filmed for an additional two months. In future seasons, will you be continuing to film couples after the proposal?\r\n\r\nThe things we’ve learned with “The Bachelor” is that it has to constantly evolve. Like you see with the fantasy suite, now you see the morning after, and that’s really important because it’s a totally different phase of the relationship and those conversations inform how all of the decisions are going to be made. So this change is the same thing, and I think you’ll start to see more of this now, as we keep evolving the show.\r\n\r\nWas it just a coincidence that the first time you decided to continue to film after the proposal, that this bombshell breakup happened?\r\n\r\nIt wasn’t purposeful. A lot of the stuff was shot on iPhones and it’s just stuff that we had of them being together and being kind of goofy together. It was interesting watching it and getting to see how these people are in real life, so I am glad it gave us a reason to use that [iPhone footage], and I think we’ll look at how we can implement that more in seasons going forward. But it wasn’t like, “Oh my god, thank god we had this footage.” It just worked itself in organically into the fabric of the finale.\r\n\r\nCan you clear up the timeline of the proposal and the breakup, and Lauren starting to date Arie?\r\n\r\nThe proposal happened right before Thanksgiving and then the breakup happened in January, so it was almost two months in between, and that’s when Arie asked Lauren for a second chance, just so they can date. And that was two months ago, and things are going incredibly well.\r\n\r\nHow long after the breakup did ABC ask Becca to be \"The Bachelorette?\"\r\n\r\nYou have to be respectful. You can’t say, “You just had your heart broken. Do you want to meet 25 new guys?” It was a very slow process. Fortunately, we had time because this was mid-January and the finale doesn’t air until mid-March. I know two months doesn’t seem like a lot, and the feelings are still raw, but she still just wanted to keep trying. I think when you’ve had great tragedy in your life, like she’s had, there is a resilience that starts to come in, and you realize that for better or worse, life goes on and you’re better off taking a chance. So we moved slowly [asking her to be “The Bachelorette”], but when she came around to it, it got really exciting. It started very slowly and then it got very serious in the middle of February. She actually hadn’t signed until basically a couple of days ago, so it was definitely a lot of thinking. She’s also very close with her family and I don’t know if her family wanted her to jump right back into a show that caused her so much heartbreak, but they are supportive and that’s fantastic.\r\n\r\nThere's been a lot of discussion surrounding the lack of diversity with leads on \"The Bachelor\" franchise, and just last year, Rachel Lindsay was the first-ever African American lead on \"The Bachelorette.\" What went into the decision naming Becca next season's lead?\r\n\r\nI’m super proud of this cast [from Arie's season]. We look at everything, and diversity is not only ethnicity, but also it’s the types of women that we had, and I was really happy that we had a lot of types of different women. We had a lot of professional women and strong women who are their own women. With Becca, it was really a no-brainer decision. I think everybody, after they see how this plays out, they’re going to want to see her get her happy ending. This is a girl who’s been through so much — she lost her dad to brain cancer, her mother had a battle with breast cancer. She’s really strong and resilient, and you really root for her after the finale.\r\n\r\nEarlier in the season, Becca's boyfriend from her past showed up, and a lot of people on Twitter criticized that scene for seeming staged, solely to create drama. He obviously didn't just pop up in Peru, so how did he show up? \r\n\r\nI’m really glad you asked that. We sit down at the end of every season and we look at things and we say, “This is good, this worked, people didn’t like this, or people responded to this.” For me and the producers, something that really didn’t sit right was when DeMario’s [Jackson] girlfriend came back in Rachel’s [Lindsay] season — it just felt completely fake and it felt like this woman had a speech prepared and was ready to go — so when you see all of that, if it plays as false, then it pulls on a sweater thread and the whole thing can fall apart because it all seems false, and it’s not. So in this case, this guy reached out to production and said he heard Becca was on the show and he was really upset and wanted to see her. And as a producer, you think, ‘That’s a great storyline, if it’s authentic.’ But at the very least, we had to make sure that this guy was willing to put up the money to get to Peru, and see if this guy is genuine and didn’t want to just get on TV — and he did. So once we realized that this guy really has feelings for Becca and he wants to go, we did it. This was a guy that Becca had spoken about many times on the show as the one big relationship that she had, and seven years, that’s a long time. So that’s how it all came to be.\r\n\r\nWhy did you originally cast Arie as this season’s lead? Is it because he is a bit older, and perhaps ready for a real relationship?\r\n\r\nIt’s funny because Arie is the same age as Nick [Viall], but I think the reason why Arie comes off as older is because he has a more mature lifestyle. Nick Viall almost feels like an early-to-mid 20-something who is still figuring himself out and moved to L.A. Arie lives in Scottsdale, Ariz., where he’s showing houses, and he’s even slowed down with the racing. He’s a grown-up. I think that’s the difference, and that’s part of what went into the decision-making. I thought Nick’s season was great and I absolutely love Nick, but you watched that finale last year and he got engaged to Vanessa [Grimaldi], and it should have been this full-circle moment for him because he got so close with Andi [Dorfmann] and then he got so close with Kaitlyn [Bristowe] and then he finally found this person and it just felt like this thing is going to last for five minutes — and that’s what ended up happening. And everyone has to do their own thing so I’m not decrying anything that he did. But it just felt like we really wanted to find someone who was going to leave the spotlight after this was over, and that’s Arie. He was never one of those people that was really on social media and stayed in “The Bachelor” circle. He was just living his life.\r\n\r\nIt seems like the intention in casting Arie was to make this season the most authentic it could possibly be when it comes to looking for love, so why do you think ratings were down this season?\r\n\r\nI don’t know, but I will tell you that I was surprised when the ratings were up when Nick [Viall] was “The Bachelor,” so sometimes you just don’t know. Nick was a roll-of-the-dice because he’d been on “Bachelor in Paradise,” which is not usually the breeding ground for the lead, so sometimes you can’t put your finger on these things. When Sean Lowe was “The Bachelor,” it really came down to him and Arie, and it was down to the wire because people really wanted to see Arie be “The Bachelor” because he was so heartbroken by Emily [Maynard] so when we were making “The Bachelor” this year, it was surprising how many people said they didn’t know who he was. I know five years is not yesterday, but it’s also not so long ago. He was somebody who always remained in the conversation with fans — maybe not as many as I thought, but I thought there was a lot of appeal for Arie, and it was fascinating to see that we had to re-educate people [on Arie] on I think Arie also had to re-educate himself what it’s like to be on this type of show. I think he has a lot of personality, and it’s really on us for not showing more of that. You saw on “The Women Tell All” that he is really very funny, and I think if we had maybe shown more of that, maybe that would have helped. Also, we premiered on New Year's Day and then the next day was the college football championship game and then you had the Olympics, so we had a lot of strikes against us. But it still felt like people cared — I heard a lot of chatter about the season online.\r\n\r\nSo you believe the numbers being down are due to competing programming and perhaps the lack of awareness for Arie — not any sort of \"Bachelor\" fatigue among audiences?\r\n\r\nI don’t think there’s “Bachelor” fatigue. The people that are watching, certainly all seem to like it and live for it. They might not like certain elements, but I haven’t seen anyone say, “I’m done watching 'The Bachelor.'” But it is an interesting time right now in the world, and there might be people who say, “I just don’t feel like I can get an escape right now because the world is in a weird place.”\r\n\r\nOn the flip side of that, do you think the political climate and intense news cycle serve as a benefit to the show because it can be an escape for viewers?\r\n\r\nI think that’s right. Even when things are horrible on the show, as we’ve seen in this finale, there still is a measure of hope. At the end of the day, we are trying to make a version of a fairytale here and there is something about love that is hopeful, even when it is love that’s lost. There’s always going to be hope at the end of the day. There is something hopeful and escapist about this show. We’ve all made a fool of ourselves or gotten dumped, so I think there’s so much relatability to show.\r\n\r\nWhat do you expect Becca’s season of \"The Bachelorette\" to be like?\r\n\r\nThis could be one of the stranger seasons of “The Bachelorette” because she might not truly be over Arie and it may not work — I certainly hope it does, and we will do everything we possibly can to make sure it does, but you just don’t know. It certainly is a chance worth taking.\r\n\r\nPOPULAR VIDEO:\r\n\r\nhttps://youtu.be/7iHVTpoErfE", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/7iHVTpoErfE?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1520458061.0, "source": "https://variety.com", "summary": ""}