{"url": "https://lawandorder.fandom.com/wiki/Brian_Cassidy", "text": "Brian Cassidy is a retired New York City Police Department detective who previously worked with the Manhattan Special Victims Unit and the Internal Affairs Bureau.\n\nHe is currently an investigator for the Manhattan District Attorney's Office.\n\nContents show]\n\nPersonality\n\nCassidy was the youngest and most inexperienced member of the precinct. He was partnered with the most experienced member of the team, John Munch. Cassidy makes a real effort to learn from the other members of the precinct, but he also creates friction between him and his colleagues. In the investigation into the death of two young models, Olivia Benson suggests to Munch and Cassidy that they should try a tactic called the prisoner's dilemma, in which you get each of the suspects to think that the other confessed. Cassidy gets really excited about this tactic and expresses his love for the job. This earned him a few surprised glares from his co-workers. (SVU: \"...Or Just Look Like One\")\n\nWhile far from an intellectual, Cassidy is a genuinely talented and driven police officer. He has a genuine desire to put rapists and child molesters in prison but lacks the professional detachment necessary to deal with particularly grisly sex crimes or remain objective toward victims and perpetrators of sexual assault. Captain Cragen realizes that Cassidy is unable to handle emotionally the stress of investigating sex crimes, particularly those against children. Shortly thereafter, Cragen helps Cassidy transfer to the NYPD's Narcotics Division. (SVU: \"Disrobed\")\n\nCassidy's relative lack of sophistication causes several problems for him. His co-workers tend to make fun of him and don't always take him seriously. During the investigation into the death of Victor Spicer, Captain Donald Cragen decides that Cassidy can investigate another crime on his own. In this case, it was about a man who molested a dead woman. (SVU: \"Payback\") As the only detective on the case, he has to appear in court to testify against the offender. ADA Abbie Carmichael questions him about the events that lead to the offense. Cassidy is extremely nervous during his time in the witness stand. Defense attorney Hawkins takes advantage of Cassidy's nervousness and lack of sophistication. When Hawkins asks him about the technical term for fondling a stranger, Cassidy comes up with the answer \"fromage\". The answer was supposed to be frottage. (SVU: \"A Single Life\")\n\nCriminal Investigations\n\nCassidy has been a prime suspect twice in two separate cases. In 2013, Cassidy was accused of rape by a pole dance teacher named Heather Riggs who claimed that Cassidy raped her in 2009, while he was working undercover and decided to come forward after she saw his picture in the newspaper during the Bart Ganzel case. Cassidy is however cleared from these charges when an undercover stint and interrogation reveals that Heather was setting up Cassidy. Heather confesses to Benson that she lied and is imprisoned.\n\nCassidy becomes a prime suspect again in 2018 when a doctor suspected of child molestation is found murdered and Cassidy was at his house and turned up to Benson's apartment covered in blood. Unlike the last time, Benson is unsure whether Cassidy is being honest about not murdering the doctor and a Homicide detective investigates Cassidy. Rollins is determined that Cassidy is guilty and her, Benson and Cassidy clash. Cassidy is once again cleared of the charges when an older brother of one of the victims confesses to murdering the doctor. Cassidy confesses to ADA Stone that he was molested by his little league coach, which is why he was so emotional about the case. Benson and Cassidy meet up and Cassidy that she was very special to him. They say goodbye to each other and Cassidy leaves.\n\nRelationship with Olivia Benson\n\nDuring his time in the Special Victims Unit, he started a brief relationship with Detective Benson.The two had a drunken one night stand and Brian was left wanting to start a relationship with Olivia. Olivia feels that she has broken her personal rule of not getting involved with your co-workers. When he starts to come close to her, she decides to end the relationship. This causes a lot of friction between the two of them during the cases they investigate. When Benson comes up with a theory for a crime, he is the one to make objections against it. While they investigate the rape of Harper Anderson, Cassidy is convinced that she's lying. Although it's clear to the other detectives that she's indeed telling the truth. (SVU: \"Closure (Part I)\")\n\nIn season 13, Cassidy reappeared in the final episode. It is revealed that he had been working undercover for a while and, during an investigation by Benson and Amaro, Benson and Cassidy met again. After Cassidy gets shot during the investigation he and Benson talk and share a kiss. In \"Presumed Guilty\", Benson reveals that she's going on a trip to the Bahamas with \"a friend\". As Benson is waiting for the plane to depart, an unseen person lays his hand on her hand, to which Benson looks up and smiles.\n\nWhen Detectives Munch and Amaro go to Cassidy's apartment in \"Undercover Blue\" to inform him he's been accused of rape, they find Olivia in a nightshirt. It's revealed that Brian and Olivia have rekindled their relationship after a thirteen-year gap. The episode ends with Olivia and Brian going to catch a drink. It's clear Brian has doubts about Olivia's trust. However, they're still together in the season 14 finale, \"Her Negotiation\". In Season 15, Cassidy and Benson are still romantically involved and move in together. They later break-up in the Season 15 episode \"Downloaded Child\" and the break-up is amicable for Benson and Cassidy.\n\nTheir relationship becomes complicated when Brian investigates Benson for suspected child abuse. Rollins later discovers that the investigation would never have happened if Cassidy hadn't spoken to the head of the investigation at a bar. Benson encounters Cassidy on the street and tells him off, to which Cassidy says he told the head investigator at a bar about her ordeal with William Lewis. Benson furiously tells him to mind his own business and to not bother helping her next time, and then walks off furious, leaving Cassidy regretful and ashamed.\n\nIn \"Chasing Demons\", he tells Benson that she is the love of his life. In \"Facing Demons\", Cassidy testified against his rapist after a suicide was linked to the coach. Benson also learns about his rape.\n\nAppearances\n\nTrivia", "images": ["https://vignette.wikia.nocookie.net/adoptme/images/6/61/Wikia_from_DreamCraft.png/revision/latest/zoom-crop/width/100/height/56?cb=20200324164245", "https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://vignette.wikia.nocookie.net/lawandorder/images/c/c2/Briancassidy3.jpeg/revision/latest/scale-to-width-down/245?cb=20190223044656", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://images.wikia.nocookie.net/__cb14/lawandorder/images/8/89/Wiki-wordmark.png", "https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest/zoom-crop/width/100/height/56?cb=20200327133046", "https://vignette.wikia.nocookie.net/lawandorder/images/c/c2/Briancassidy3.jpeg/revision/latest?cb=20190223044656"], "top_img": "https://vignette.wikia.nocookie.net/lawandorder/images/c/c2/Briancassidy3.jpeg/revision/latest?cb=20190223044656", "keywords": [], "authors": [], "canonical_link": "https://lawandorder.fandom.com/wiki/Brian_Cassidy", "title": "Brian Cassidy", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Law and Order,lawandorder,Brian Cassidy,DA Investigator,Detective,New York City Police Department,Manhattan District Attorney's Office,Internal Affairs Bureau,Narcotics Division,Special Victims Unit,16th Precinct,55th Precinct,12th Precinct", "description": "Brian Cassidy is a retired New York City Police Department detective who previously worked with the Manhattan Special Victims Unit and the Internal Affairs Bureau. He is currently an investigator for the Manhattan District Attorney's Office.", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://lawandorder.fandom.com/wiki/Brian_Cassidy", "title": "Brian Cassidy | Law and Order | Fandom", "description": "Brian Cassidy is a retired New York City Police Department detective who previously worked with the Manhattan Special Victims Unit and the Internal Affairs Bureau. He is currently an investigator..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Law and Order", "title": "Brian Cassidy", "description": "Brian Cassidy is a retired New York City Police Department detective who previously worked with the Manhattan Special Victims Unit and the Internal Affairs Bureau. He is currently an investigator for the Manhattan District Attorney's Office.", "url": "https://lawandorder.fandom.com/wiki/Brian_Cassidy", "image": "https://vignette.wikia.nocookie.net/lawandorder/images/c/c2/Briancassidy3.jpeg/revision/latest?cb=20190223044656"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://lawandorder.fandom.com/wiki/Brian_Cassidy"}, "movies": [], "publish_date": null, "source": "https://lawandorder.fandom.com", "summary": ""}