{"url": "jezebel.com/angelina-jolie-and-brad-pitts-divorce-is-a-master-class-1786998912", "text": "Image via Getty\n\nThere have been plenty of celebrity breakups recently, but none have been so carefully analyzed as the Pitt-Jolie separation. Each bit of information that reaches the media is being treated like a chess move in a big game of Who Gets to Keep Their Reputation.\n\nAdvertisement\n\nAngelina Jolie filed for divorce after an alleged altercation between Brad Pitt and their son Maddox on a private plane. The only info that we, the reading public had at first was that she cited irreconcilable differences, and was trying to get sole custody of their children. Wanting sole custody seemed significant, even before reports of Pitt’s drinking began to surface.\n\nNow that Marion Cotillard has denied any involvement in the separation, the media focus is more and more on how Pitt interacts with his children. Is he a man who drinks and emotionally or physically abuses his family when intoxicated? Or is Angelina Jolie exaggerating one family argument so she can get custody, then jet off to the U.N., as the Pitt camp alleges? It all kind of hinges on some recorded evidence of the inciting incident that supposedly led to Jolie’s filing.\n\nAdvertisement\n\nLainey Gossip devoted a long blog Friday to the way in which Brad Pitt has been trying to set up the video of his argument with Jolie and Maddox, a video that has not yet been released, but likely will judging from the way Pitt’s PR is trying to lay the groundwork. She points out that Pitt’s team has clearly chosen People as their tabloid of choice, and in a post literally titled “Brad’s Side of the Story” they have carefully crafted how we should read the abuse allegations. As Lainey writes:\n\nYou know what’s interesting though? PEOPLE’s version of “Brad’s side of the story” has been amended. The one that’s up on the site right now has been edited. Originally when they posted the article last night, this is how it read: The source says Pitt did not hurt his son. “He is emphatic that it did not reach the level of physical abuse, that no one was physically harmed. He did not hit his child in the face in any way. He did not do that; he is emphatic about that. He put his hands on him, yes, because the confrontation was nose to nose and was spiraling out of control.” You see the difference? The detail about Brad and presumably Maddox going “nose to nose”? Also this sentence has been removed from the paragraph that now ends with “attempts to gain custody”: The Pitt source adds that the star “was not black-out drunk” and that “he absolutely remembers that evening and has been interviewed at length to that effect.” Brad’s team doesn’t want you visualising him going “nose to nose” with his 15 year old son. And they certainly don’t want you suspecting that he may have been “black-out drunk”. Just, you know, regular drunk. But drunk enough that Brad’s people can’t straight up deny it. And drunk enough and angry enough that his people cannot categorically dismiss the reports that there was all kinds of drama on that plane.\n\nIt seems like this video will be seen by the public, either through a “leak” or the divorce proceedings, and both sides are prepping public perceptions for how it should be received. As with Amber Heard and Johnny Depp (the latter of whom is represented by the same lawyer as Jolie), how you are seen by the world when you’re a celebrity has a big sway on how you will be treated when you come out on the other side of an ugly divorce.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zotcgauofdbrlxusmset.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zotcgauofdbrlxusmset.jpg", "keywords": [], "authors": [], "canonical_link": "https://jezebel.com/angelina-jolie-and-brad-pitts-divorce-is-a-master-class-1786998912", "title": "Angelina Jolie and Brad Pitt's Divorce Is a Master Class in PR Spins", "meta_data": {"google-site-verification": "qtdmeMUkQ1jhQhHGFHv6CO2FpKGPcUfc9TYEabpRR0A", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/pch44wvo0v6acpdlt0f6.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/pch44wvo0v6acpdlt0f6.png", "keywords": "Angelina Jolie, Brad PItt, divorce, publicity, Jezebel", "news_keywords": "Angelina Jolie, Brad PItt, divorce, publicity, Jezebel", "twitter": {"url": "https://jezebel.com/angelina-jolie-and-brad-pitts-divorce-is-a-master-class-1786998912", "card": "summary_large_image", "site": "@jezebel", "title": "Angelina Jolie and Brad Pitt's Divorce Is a Master Class in PR Spins", "description": "There have been plenty of celebrity breakups recently, but none have been so carefully analyzed as the Pitt-Jolie separation. Each bit of information that reaches the media is being treated like a chess move in a big game of Who Gets to Keep Their Reputation.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zotcgauofdbrlxusmset.jpg"}, "description": "There have been plenty of celebrity breakups recently, but none have been so carefully analyzed as the Pitt-Jolie separation. Each bit of information that reaches the media is being treated like a chess move in a big game of Who Gets to Keep Their Reputation.", "og": {"title": "Angelina Jolie and Brad Pitt's Divorce Is a Master Class in PR Spins", "type": "article", "url": "https://jezebel.com/angelina-jolie-and-brad-pitts-divorce-is-a-master-class-1786998912", "description": "There have been plenty of celebrity breakups recently, but none have been so carefully analyzed as the Pitt-Jolie separation. Each bit of information that reaches the media is being treated like a chess move in a big game of Who Gets to Keep Their Reputation.", "locale": "en_US", "site_name": "Jezebel", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zotcgauofdbrlxusmset.jpg"}, "fb": {"app_id": 40338819712}}, "movies": [], "publish_date": null, "source": "http://jezebel.com", "summary": ""}