{"url": "https://mic.com/articles/137531/where-are-the-jonas-brothers-now-here-s-what-happened-to-every-member-of-the-boy-band", "text": "For a while back there in the mid-2000s, it seemed like you couldn't turn a corner without bumping into a Jonas brother. The three teens were ubiquitous after their family band, the Jonas Brothers, first hit the big time in 2007. They appeared in the Disney channel original movie Camp Rock (and it's sequel, Camp Rock 2), made a 3D concert movie and released four studio albums before officially splitting in 2013.\n\nSo what's been going on with all of the Jonas Brothers since they broke up the ol' brotherly band? Well, they've all done different things in the years since the Jonas Brothers officially disbanded, but here's the basic deal with all of them.\n\nMarco Ugarte/AP\n\nKevin Jonas: The oldest member of the band, Kevin, is now 28. He married wife Danielle Deleasa back in 2009 (when the band was still together) and, of course, brothers Joe and Nick were his best men. The newlyweds starred in the short-lived reality series Married to Jonas, which aired from 2012 to 2013. Kevin also appeared on The Celebrity Apprentice in 2015.\n\nIn February 2014, the eldest Jonas welcomed his first child, daughter Alena Rose Jonas.\n\nDiane Bondareff/AP\n\nJoe Jonas: After the band's official breakup, Joe Jonas continued his solo career (he had released his first solo album, Fastlife, in 2011 during a hiatus from the Jonas Brothers). In 2015, he formed the band DNCE with JinJoo Lee, Cole Whittle and Jack Lawless. \"I prefer the band aspect of things,\" Joe Jonas told Interview Magazine in October. \"I feel comfortable. It feels good to look to my left and right and see three other people on stage with you that love music as much as you. I love seeing us all having a blast.\"\n\nDuring his time in the Jonas Brothers, Joe's romantic life often made headlines. He was involved in high-profile relationships with several fellow celebs, including Taylor Swift, Camilla Belle, Demi Lovato and Gigi Hadid.\n\nRobb D. Cohen/AP\n\nNick Jonas: The youngest member of the Jonas Brothers (but not the youngest Jonas brother) set out on a solo music and acting career. In 2014, he released a solo album, Nick Jonas, which included his hit single \"Jealous.\"\n\nNick has appeared in several television shows since the breakup of the Jonas Brothers, including Kingdom and Scream Queens. He also appeared in the 2016 film Goat, about two brothers who joined the same fraternity.\n\nMike Windle/VF16/Getty Images\n\nFrom 2013 to 2015, Nick was in a high-profile relationship with Miss Universe winner Olivia Culpo. In a recent interview with Complex, Nick discussed the breakup of the Jonas Brothers, saying \"it would have ended badly if we hadn't ended it when we did.\"", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/mic/yhwss6o2uumgxsol3ucfocrn5kdtpetqm79fnepwkk4pli3f89qztxhvpy4ix8dp.jpg?w=1020&h=576&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/mic/yhwss6o2uumgxsol3ucfocrn5kdtpetqm79fnepwkk4pli3f89qztxhvpy4ix8dp.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.mic.com/mic/zmlsamjl9jg7e6off3oj9bcekacvu8c6zgfmjuddpfqlkoykhigmn8ey48wypjni.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.mic.com/mic/fkyxeglqbhvrame9agdqwnxce8ek913mbpmbo2klbo9wdqz9v6sbm4g977q5uafh.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.mic.com/mic/5npu4obayx8bqxnl4odasalse6pom4rlshxjq7amxlnqymbrhnylgfrcr2qwrrle.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.mic.com/mic/qlxvz1pt8fz9uuxhcliry0xf86tytlwvzb2bzo3fmrysf1csmwekuuqy1cu3rskl.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/mic/yhwss6o2uumgxsol3ucfocrn5kdtpetqm79fnepwkk4pli3f89qztxhvpy4ix8dp.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.mic.com/articles/137531/where-are-the-jonas-brothers-now-here-s-what-happened-to-every-member-of-the-boy-band", "title": "Where Are the Jonas Brothers Now? Here's What Happened to Every Member of the Boy Band", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@mic", "card": "summary_large_image"}, "og": {"site_name": "Mic", "url": "https://www.mic.com/articles/137531/where-are-the-jonas-brothers-now-here-s-what-happened-to-every-member-of-the-boy-band", "type": "article", "title": "Where Are the Jonas Brothers Now? Here's What Happened to Every Member of the Boy Band", "description": "For a while back there in the mid-2000s, it seemed like you couldn't turn a corner without bumping into a Jonas brother. The three teens were ubiquitous after their family band, the Jonas Brothers, first hit the big time in 2007. They appeared in…", "image": {"identifier": "https://imgix.bustle.com/mic/yhwss6o2uumgxsol3ucfocrn5kdtpetqm79fnepwkk4pli3f89qztxhvpy4ix8dp.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "For a while back there in the mid-2000s, it seemed like you couldn't turn a corner without bumping into a Jonas brother. The three teens were ubiquitous after their family band, the Jonas Brothers, first hit the big time in 2007. They appeared in…"}, "movies": [], "publish_date": null, "source": "https://mic.com", "summary": ""}