{"url": "https://www.usatoday.com/story/life/entertainthis/2017/04/28/what-know-before-diving-into-netflixs-casting-jonbenet/100848172/", "text": "Erin Jensen\n\nUSA TODAY\n\nCorrections & clarifications: An earlier version of this story incorrectly stated the length of the documentary. It is one hour and twenty minutes.\n\nCasting JonBenét is not your typical true crime documentary du jour. Rather, it serves as a contrast to the numerous programs devoted to the villainy that aired on CBS, Investigation Discovery, Lifetime and Dr. Phil last year.\n\nThose yearning to resolve this two-decade-old crime need to check those lofty ambitions at the foot of the bed or armrest of the couch prior to devouring the one hour and 20-minute film to sidestep disappointment. The latest directorial exploit from Kitty Green (Ukraine Is Not a Brothel and The Face of Ukraine: Casting Oksana Baiul) does not provide puzzle pieces or insight as to why the lifeless body of JonBenét Ramsey was discovered in December of 1996.\n\nInstead of focusing on friends of the six-year-old beauty queen's parents, John and Patsy Ramsey, or investigators, the lens turns to local actors in the Boulder community to be featured in limited reenactments. Also, unlike its title suggests, auditions for the role of the blonde beauty are only a tiny fraction of the film.\n\nConfused? Green's approach is certainly a unique way to look at the case. Over the course of 15 months, filmmakers met with the Coloradans and sought out their beliefs about the crime. The result is a documentary that conveys popular theories about the case as well as biases.\n\nDuring their auditions, many reveal a tie to the incident. A voice teacher's students knew JonBenét. A hopeful vying for the part of Patsy revealed her parents met the Ramsey matriarch and patriarch \"several times,\" because her brother's murder connected the grieving parents. Another actor revealed he was \"effectively (his girlfriend's) alibi,\" because she was slated to be John's successor, therefore, police believed she had something to gain.\n\nThe amateur thespians recall details of JonBenét's death, though not everyone's speech is dripping with confidence or certainty. They talk about the ransom note, totaling almost three pages, which was addressed on CBS' docu-series The Case of: JonBenét Ramsey last September. Their comments are similar to ones that could be heard at a brunch with friends discussing the latest episode of the popular podcast My Favorite Murder.\n\nThey mention the length of the letter discovered by Patsy, along with the highbrow language used, and the fact that it was written with pen and paper belonging to the Ramseys, which, even without training, they found peculiar. A man who spoke of performing at weddings but not investigative experience declared that a kidnapper would typically request a rounded amount, not the $118,000 specified. It seems the media, with some sensationalized reports and a surplus of shows surrounding the 20th anniversary of the crime, have made us all experts.\n\nDoes Lifetime's 'Who Killed JonBenét?' go too far?\n\n‘JonBenét’s Mother: Victim or Killer?’ paints Patsy Ramsey as innocent\n\nSimilarly, one actress expresses her doubts that a 9-year-old — the age of JonBenét's brother Burke at the time of her death — would have the strength inflict the head injury she suffered. In juxtaposition, the camera then cuts to young boys successfully splitting a watermelon with a flashlight, the weapon some believe was used to kill JonBenét.\n\nFurther showcasing the strong beliefs held, some women freely spew their opinions of Patsy, despite not knowing her directly. “She was no longer doing the beauty queen thing,\" one surmises. \"She’d gotten too old and so this was her opportunity to live it again through her daughter.”\n\nThose who watch the film will quickly understand that its centerpiece is not a child's untimely and cryptic death; Green's focal point is one that has been less frequently addressed. Turning not to the stone, but its ripple, the subsequent conversations and attitudes formed about a family that intrigues many but few actually know.\n\nWould it be easy to release the white-knuckled grip on our convictions, formed with the help of experts, to admit that we may never know what happened to that little girl? Are we so desperate to make sense of the senseless act that we cling to theories even if it means persecuting innocent people? These are just a couple of questions to pose while peering into Green's mirror.", "images": ["https://www.gannett-cdn.com/-mm-/7cb1a64656242b444e650d57bad7cce1e6061b0f/c=0-100-1439-913/local/-/media/2017/04/24/USATODAY/USATODAY/636286389897866459-CJB-Unit-00001R-1.jpg?width=1439&height=813&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/7cb1a64656242b444e650d57bad7cce1e6061b0f/c=0-100-1439-913/local/-/media/2017/04/24/USATODAY/USATODAY/636286389897866459-CJB-Unit-00001R-1.jpg?width=1439&height=813&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/04/28/what-know-before-diving-into-netflixs-casting-jonbenet/100848172/", "title": "What to know before diving into Netflix's 'Casting JonBenet'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "What to know before diving into Netflix's 'Casting JonBenet'", "description": "Kitty Green's documentary, available for streaming Friday, isn't a typical true crime film.", "url": "https://www.usatoday.com/story/life/entertainthis/2017/04/28/what-know-before-diving-into-netflixs-casting-jonbenet/100848172/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/7cb1a64656242b444e650d57bad7cce1e6061b0f/c=0-100-1439-913/local/-/media/2017/04/24/USATODAY/USATODAY/636286389897866459-CJB-Unit-00001R-1.jpg?width=1439&height=813&fit=crop&format=pjpg&auto=webp", "width": 1439, "height": 813}, "type": "article"}, "article": {"author": "Erin Jensen", "content_tier": "free", "opinion": "false"}, "description": "Kitty Green's documentary, available for streaming Friday, isn't a typical true crime film.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/7cb1a64656242b444e650d57bad7cce1e6061b0f/c=0-100-1439-913/local/-/media/2017/04/24/USATODAY/USATODAY/636286389897866459-CJB-Unit-00001R-1.jpg?width=1439&height=719&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "What to know before diving into Netflix's 'Casting JonBenet'", "description": "Kitty Green's documentary, available for streaming Friday, isn't a typical true crime film."}}, "movies": [], "publish_date": 1493308800.0, "source": "https://www.usatoday.com", "summary": ""}