{"url": "https://www.businessinsider.com/nailed-it-netflix-baking-fails-photos-2018-3", "text": "On Friday, Netflix released a new baking show called \"Nailed It!\"\n\n\"Nailed It!\" was inspired by a popular meme in which people document their unsuccessful attempts to follow Pinterest recipes.\n\nIn each episode, three home bakers try their best to recreate elaborate cakes, treats, and more.\n\nThe results are hilarious and endearing, and the show is a refreshing break from your typical reality cooking competition.\n\n\n\nA new baking show by Netflix deviates from your typical cooking competition in one endearing way. \"Nailed It!\" was inspired by a popular meme in which people document their wildly unsuccessful attempts to follow Pinterest recipes. In case you're not familiar, the results are often hilarious, and, from time to time, downright terrifying.\n\nWith six half-hour episodes in its first season, \"Nailed It!\" is deliciously bingeable. Here's what you can expect.\n\n\"Nailed It!\" pits amateur bakers against one another — but there's a twist.\n\nConventionally, reality cooking competitions like \"Masterchef\" or \"The Great British Baking Show\" feature amateurs who perform at, or even above, the level professionals do. \"Nailed It!\" abandons this formula to celebrate imperfection. In each episode, three home bakers try their best to recreate elaborate cakes, treats, and more. The one who gets the closest wins $10,000.\n\nAmanda Giles' jelly-filled doughnuts (right) from episode 2. Netflix But unlike other shows, no one on \"Nailed It!\" really ever gets that close — and that's the entire point. Instead of making it seem like anyone, the viewer included, can expect professional results at home, the show highlights just how complicated Pinterest recipes usually are. Because for most us, these baking \"fails\" are the best we can do, and that's impressive enough.\n\nHere are a few standout creations from the show.\n\nWhile this contestant didn't have time to cool her cakes down before glazing them, Torres complimented her fondant flowers.\n\nElena Timman's wedding cake (right) from episode 1. Netflix\n\nThis contestant created a bubbling volcano cake that successfully \"erupted.\"\n\nMegan Swanson's volcano cake (right) from episode 4. Netflix\n\nThe judges congratulated this contestant for completing her cake in a short period of time.\n\nDana Moon's emoji cake (right) from episode 5. Netflix\n\nIt's hard not to love a show where everyone's an underdog.\n\nImperfect creations aside, \"Nailed It!\" also entertains when it comes to commentary. The show is hosted by comedian Nicole Byer, iconic chocolatier Jacques Torres, and a guest judge — and they all often say exactly what you're thinking.\n\nWhen contestants were asked to recreate a Rapunzel cake, for example, Byer confessed, \"I don't mean to laugh, but your princess is terrifying. [...] And I don't think anybody is coming to rescue her.\"\n\nBut the judges also share useful tips about baking, both for the contestants and for viewers at home, along with words of encouragement. \"I want to give you credit for having courage and guts to do this,\" celebrated cake designer Sylvia Weinstock tells a contestant in the very first episode. \"Because it's something you've never done before and I think that is remarkable.\"\n\nAnd judging from reactions online, people can't get enough.\n\n\"Dear Netflix, Nicole Byer and Nailed It are a dream come true,\" Twitter user Kimi Rosenthal wrote. \"I want 10,000 seasons.\"\n\n\"I've been laughing like an idiot at this all day,\" tweeted Maddie Hettrich.\n\n\"Nailed It with Nicole Byer cured my depression, made my skin clear, and brought my dead dog back from the grave,\" Twitter user Hanna Brostowitz joked.\n\n\"Nailed it! on Netflix is addictive,\" a Twitter user named Phoebe wrote. \"Watching people fail spectacularly at baking is strangely calming.\"\n\nTo see more, watch the trailer for \"Nailed It!\" below or check out the first season on Netflix.\n\nSign up here to get INSIDER's favorite stories straight to your inbox.", "images": ["https://i.insider.com/5aa6b5c842e1cc5f6925bc7d?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "https://i.insider.com/5aa6b5c942e1cc5f6925bc80?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5aa6b5c942e1cc5f6925bc7f?width=600&format=jpeg&auto=webp", "https://i.insider.com/5aa6b5c842e1cc5f6925bc7d?width=24&format=jpeg&auto=webp", "https://static.businessinsider.com/image/5dcb04467eece574841c1922", "https://www.businessinsider.com/nailed-it-netflix-baking-fails-photos-2018-3?width=600&format=jpeg&auto=webp", "https://i.insider.com/5aa6b5c942e1cc5f6925bc81?width=600&format=jpeg&auto=webp", "https://i.insider.com/5aa6b5c842e1cc5f6925bc7c?width=1200&format=jpeg", "https://i.insider.com/5aa6b5c842e1cc5f6925bc7e?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5aa6b5c842e1cc5f6925bc7c?width=1200&format=jpeg", "keywords": [], "authors": ["Lucy Yang"], "canonical_link": "https://www.businessinsider.com/nailed-it-netflix-baking-fails-photos-2018-3", "title": "People are loving a new Netflix series about baking fails — and these hilarious side-by-side photos show why", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "People are loving a new Netflix series about baking fails — and these hilarious side-by-side photos show why", "date": "2018-03-12", "news_keywords": "Netflix, Baking, Pinterest, Viral, TV, Lucy Yang", "description": "Netflix's new baking show \"Nailed It!\" was inspired by a popular meme in which people document their wildly unsuccessful attempts to follow Pinterest recipes.", "author": "Lucy Yang", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Entertainment Contributors", "og": {"title": "People are loving a new Netflix series about baking fails — and these hilarious side-by-side photos show why", "description": "Netflix's new baking show \"Nailed It!\" was inspired by a popular meme in which people document their wildly unsuccessful attempts to follow Pinterest recipes.", "type": "article", "url": "https://www.businessinsider.com/nailed-it-netflix-baking-fails-photos-2018-3", "image": "https://i.insider.com/5aa6b5c842e1cc5f6925bc7c?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "People are loving a new Netflix series about baking fails — and these hilarious side-by-side photos show why", "sailthru.date": "2018-03-12", "sailthru.tags": "Netflix, Baking, Pinterest, Viral, TV, Lucy Yang", "sailthru.description": "Netflix's new baking show \"Nailed It!\" was inspired by a popular meme in which people document their wildly unsuccessful attempts to follow Pinterest recipes.", "sailthru.author": "Lucy Yang", "sailthru.verticals": "thewire-contributor, thewire, thelife, media, sai", "sailthru.image.full": "https://i.insider.com/5aa6b5c842e1cc5f6925bc7b?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5aa6b5c842e1cc5f6925bc7b?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@bi_contributors"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "variant", "back-to-top": "control", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "variant", "subscribe-smallest-price": "variant"}, "viking-id": "5aa6b5ca42e1cc5f6925bc82", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": ["https://www.youtube.com/embed/bwZiodYwXoc", "https://www.youtube.com/embed/pb7CBZ952zs"], "publish_date": 1520784000.0, "source": "https://www.businessinsider.com", "summary": ""}