{"url": "https://www.vulture.com/2018/09/bachelor-in-paradise-season-5-where-did-the-couples-end-up.html", "text": "Photo: Paul Hebert/ABC\n\nA congratulations are in order for Bachelor in Paradise, we suppose! After all of those margaritas, dancing crabs, date cards, and rectangle-covered buttocks, three couples have emerged on solid ground after the finale, while some other pairings may have had the word “paradise” forever tainted for them — and that sucks, because it’s such a nice noun! Since we know you’re (secretly) dying to know which Paradise couples are still smooching in sun-kissed harmony, here’s the lowdown on all of the duos who decided to show up to the after-show finale. If only they were all success stories. But where would be the drama in that?\n\nJohn and Olivia\n\nStatus: Parted ways, not too amicably.\n\nDespite frequent calls, video chats, and a trip together, the couple broke up a few weeks after Paradise ended, citing distance as the main factor. Well, John did, anyway — because as Olivia says, John chose to “publicize” a relationship with fellow Paradise-er Chelsea on social media over her. Twist! “For me, I felt like our different lifestyles couldn’t make that work right now,” John explained. “But then, when I saw you were publicizing other relationships … you were FaceTiming her, when you could’ve been FaceTiming me,” Olivia responded. “And that was a slap in my face.”\n\nColton and Tia\n\nStatus: They’re friends, and they really want us to know it.\n\nOur long national nightmare is over — or rather, just beginning — with Colton being anointed as the next Bachelor. (We personally love our proud, messy virgin!) It should come as no surprise that Colton and his on-again-off-again-on-again-off-some-more-maybe-back-again-okay-officially-over gal, Tia, are putting on a unified friendship front to America, saying they’re happy to be pals and that the romance is definitely, absolutely fizzled. “We were never on the same page, and despite all of the crying and everything that happened, I think it was all worth it to get to this point,” Tia said with a laugh. “To know that we tried and it didn’t work.” Colton echoed the sentiment: “She’s an incredible woman and someone I’ll always be friends with and I’ll consider a friend for a very long time. It’s nice to say finally we’re on the same page and we’re good friends.” Don’t worry. Tia won’t actually be showing up on The Bachelor. Lord bless!\n\nAstrid and Kevin\n\nStatus: Back together. Thank God!\n\nParadise’s most popular couple did a relationship 180 and reconciled in front of the studio audience — even though they continued to talk via text message when they returned home from Mexico. (With Bibiana as their meditator, no less.) “It didn’t really become clear to me until I went home. I spoke to my family, I went back to therapy, and I realized it was my own fault and it was my own baggage,” Kevin explained, noting that the pressure to go to the “fantasy suite” triggered him from his previous experience with Ashley I. “I brought baggage to Paradise, and she got blamed for it. I feel terrible about it and it was definitely hard to watch.” As for Astrid, she forgave Kevin’s apology. They exchanged I love yous in front of everyone, and the future is looking bright for these two.\n\nKendall and Joe\n\nStatus: Also back together. Thank God!\n\nKendall, just a few days after breaking up with Joe and leaving Paradise, decided to hightail it to Chicago in the hopes of winning back her man and expressing how much she regretted her decision. Despite some initial pushback from Joe about if his feelings were still there — “I felt in my heart that she felt she made a mistake,” he put it — Kendall’s emotional breakthrough helped ease his pain and encourage him to give her another chance. “I couldn’t help but feel a bunch of regret. I was projecting how I actually was,” she said during their Chicago meet-up. “I was the one actually holding back … I know it doesn’t justify it, but the reason why I had fear and the reason why I was pulling my back so much was that I am in love with you.” The duo have since visited each other multiple times and are in a stable relationship.\n\nKamil and Anneliese\n\nStatus: Oh, honey, we all knew this wasn’t going to last.\n\nKamil decided to breakup with Anneliese during the after-show — hasn’t he learned anything from Arie? — setting her off into a spiral of despair and tears, and wailing about how they won’t be able to share their Airbnb in Los Angeles anymore. “I just don’t really know what to say still,” she said, after he was banished from the stage. “I really tried.” Kamil just said the post-Paradise bubble made him realize they weren’t meant to be together: “I don’t want to string you along. I think it would be best for us to slowly part ways.”\n\nChris and Krystal\n\nStatus: Still engaged, and super cute.\n\nThese two! The former franchise villains are going incredibly strong with their engagement, and plan on moving in with each other as soon as possible. (Yes, he met her dogs, and yes, they love him. Also yes, one of them will serve as a dog ring-bearer.) “We’re so excited. We’ve been waiting a long time to be here and be a couple,” Krystal said, with Chris “the Goose” adding through tears: “I’m crying not only that I’m happy, but I’m so thankful that I have such an incredible woman who saw potential in me and helped transform me in Paradise. Their moms have also become “the best of friends, like sisters,” and are looking forward to a “flock of baby geese.” Redemption cycle, complete.\n\nJordan and Jenna\n\nStatus: ??????\n\nBy all indication, these crazy blondes continued to be livin’ la vida loca with their engagement, even setting a date for a televised wedding at those Paradise Mexican shores on June 9, with ordained minister Chris Harrison officiating. “He broke down all of my walls and made me fall so hard,” Jenna explained of Jordan during the after-show. “But also terrible, because he realized I don’t ever want to live without him.” There was a fun montage video of them scrapbooking, for goodness sake!\n\nHowever, a bombshell report from Reality Steve emerged on Tuesday afternoon, claiming, among other things, that Jenna is a prolific cheater who was only using Jordan to get publicity for her business. (You can read the report here.) In it, allegedly verified screenshots show Jenna texting a man she’s been recently dating — yes, while engaged to Jordan — and she writes how their relationship is “all for my business” and nothing more. “You know how much I need the money … he means nothing to me and never has,” she put it bluntly. Jenna has since denied the “allegations” as “simply untrue” to People, while Jordan, sadly, stated he’s inclined to believe they’re true in the same People piece. We’ll see how this evolves over the next few days.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/09/11/bip/11-bachelor-in-paradise-3.w700.h700.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/09/11/bip/11-bachelor-in-paradise-3.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/09/11/bip/11-bachelor-in-paradise-3.w1200.h630.jpg", "keywords": [], "authors": ["Devon Ivie"], "canonical_link": "https://www.vulture.com/2018/09/bachelor-in-paradise-season-5-where-did-the-couples-end-up.html", "title": "Bachelor In Paradise Season 5: Where Did the Couples End Up?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Where Did Bachelor in Paradise’s Couples End Up?", "url": "https://www.vulture.com/2018/09/bachelor-in-paradise-season-5-where-did-the-couples-end-up.html", "description": "Oh God, poor Annaleise.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/09/11/bip/11-bachelor-in-paradise-3.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Where Did Bachelor in Paradise’s Couples End Up?", "description": "Oh God, poor Annaleise.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/09/11/bip/11-bachelor-in-paradise-3.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@devonsaysrelax", "site": "@vulture"}, "article": {"published_time": "2018-09-12T09:34:35.288-04:00", "tag": "the bachelor, bachelor in paradise, bachelor in paradise season 5, tv, abc, bachelor nation, reality tv", "publisher": "https://www.facebook.com/Vulture"}, "description": "With Season 5 drawing to a close, we look at where Colton & Tia, Jordan & Jenna, Chris & Krystal, Kendall & Joe and Kamil and poor Annaleise ended up.", "sailthru.tags": "the bachelor, bachelor in paradise, bachelor in paradise season 5, tv, abc, bachelor nation, reality tv", "author": "Devon Ivie", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1536759275.288, "source": "https://www.vulture.com", "summary": ""}