{"url": "https://web.archive.org/web/20180118003203/https://threpublican.com/first-indictment-issued-in-russian-bribery-case-tied-to-obama-era-uranium-one-deal/", "text": "While we were busy chasing the “S***hole” not-so-shiny object the press laid out for us on Friday, it is now discovered what the media was trying to distract us from! And it is HUGE!\n\nThe DOJ handed down an indictment in the Uranium One Deal released on Friday. THIS is what the media was trying so hard to cover-up. Unlike the leak with Manafort and his indictment (which had nothing to do with Russian collusion in the Trump campaign), America woke up to non-stop news about Manafort turning himself in. Click HERE to read more about that. Manafort has since sued Special Counsel Robert Mueller.\n\nFast forward to today. Uranium One Deal has its FIRST INDICTMENT against Mark Lambert.\n\nMark Lambert of Maryland has been indicted for “allegedly paid bribes to a Russian Official so his Company could win highly sensitive nuclear fuel transportation contracts.”\n\nThe “11-count indictment with one count of conspiracy to violate the Foreign Corrupt Practices Act (FCPA) and to commit wire fraud, seven counts of violating the FCPA, two counts of wire fraud and one count of international promotion money laundering.” This is serious. And it stems from Russian collusion in the Obama-era.\n\n“The charges stem from an alleged scheme to bribe Vadim Mikerin, a Russian official at JSC Techsnabexport (TENEX), a subsidiary of Russia’s State Atomic Energy Corporation and the sole supplier and exporter of Russian Federation uranium and uranium enrichment services to nuclear power companies worldwide, in order to secure contracts with TENEX.”\n\nKUDOS to the Trump-era DOJ American’s can trust.\n\nThe hard working and honest DOJ team, under Jeff Sessions, made the announcement yesterday.\n\nThe team members are: Acting Assistant Attorney General John P. Cronan of the Justice Department’s Criminal Division, Acting U.S. Attorney Stephen M. Schenning of the District of Maryland, Principal Deputy Inspector General April G. Stephenson of the U.S. Department of Energy’s Office of Inspector General (DOE-OIG) and Assistant Director in Charge Andew W. Vale of the FBI’s Washington, D.C. Field Office, as mentioned in the DOJ statement.\n\nHere is the Statement Below:\n\nAn indictment against a former co-president of a Maryland-based transportation company that provides services for the transportation of nuclear materials to customers in the United States and abroad, was unsealed today for his alleged role in a scheme that involved the bribery of an official at a subsidiary of Russia’s State Atomic Energy Corporation.\n\nActing Assistant Attorney General John P. Cronan of the Justice Department’s Criminal Division, Acting U.S. Attorney Stephen M. Schenning of the District of Maryland, Principal Deputy Inspector General April G. Stephenson of the U.S. Department of Energy’s Office of Inspector General (DOE-OIG) and Assistant Director in Charge Andew W. Vale of the FBI’s Washington, D.C. Field Office made the announcement.\n\nMark Lambert, 54, of Mount Airy, Maryland, was charged in an 11-count indictment with one count of conspiracy to violate the Foreign Corrupt Practices Act (FCPA) and to commit wire fraud, seven counts of violating the FCPA, two counts of wire fraud and one count of international promotion money laundering. The charges stem from an alleged scheme to bribe Vadim Mikerin, a Russian official at JSC Techsnabexport (TENEX), a subsidiary of Russia’s State Atomic Energy Corporation and the sole supplier and exporter of Russian Federation uranium and uranium enrichment services to nuclear power companies worldwide, in order to secure contracts with TENEX.\n\nThe case against Lambert is assigned to U.S. District Court Judge Theodore D. Chuang of the District of Maryland.\n\nAccording to the indictment, beginning at least as early as 2009 and continuing until October 2014, Lambert conspired with others at “Transportation Corporation A” to make corrupt and fraudulent bribery and kickback payments to offshore bank accounts associated with shell companies, at the direction of, and for the benefit of, a Russian official, Vadim Mikerin, in order to secure improper business advantages and obtain and retain business with TENEX.\n\nIn order to effectuate and conceal the corrupt and fraudulent bribe payments, Lambert and others allegedly caused fake invoices to be prepared, purportedly from TENEX to Transportation Corporation A, that described services that were never provided, and then Lambert and others caused Transportation Corporation A to wire the corrupt payments for those purported services to shell companies in Latvia, Cyprus and Switzerland. Lambert and others also allegedly used code words like “lucky figures,” “LF,” “lucky numbers,” and “cake” to describe the payments in emails to the Russian official at his personal email account.T\n\nhe indictment also alleges that Lambert and others caused Transportation Corporation A to overbill TENEX by building the cost of the corrupt payments into their invoices, and TENEX thus overpaid for Transportation Corporation A’s services.\n\nIn June 2015, Lambert’s former co-president, Daren Condrey, pleaded guilty to conspiracy to violate the FCPA and commit wire fraud, and Vadim Mikerin pleaded guilty to conspiracy to commit money laundering involving violations of the FCPA. Mikerin is currently serving a sentence of 48 months in prison and Condrey is awaiting sentencing. The indictment includes allegations against Lambert based on his role in effectuating the criminal scheme with Condrey, Mikerin, and others.\n\nThe charges in the indictment are merely allegations, and the defendant is presumed innocent unless proven guilty beyond a reasonable doubt in a court of law.\n\nThe case is being investigated by DOE-OIG and the FBI. Assistant Chiefs Ephraim Wernick and Christopher J. Cestaro and Trial Attorney Derek J. Ettinger of the Criminal Division’s Fraud Section, as well as Assistant U.S. Attorneys David I. Salem and Michael T. Packard of the District of Maryland, are prosecuting the case.\n\nThe Criminal Division’s Office of International Affairs has provided significant assistance in this matter. The Department also thanks its law enforcement colleagues in Switzerland, Latvia and Cyprus for providing valuable assistance with the investigation and prosecution of the case.\n\nThe Criminal Division’s Fraud Section is responsible for investigating and prosecuting all FCPA matters. Additional information about the Justice Department’s FCPA enforcement efforts can be found at www.justice.gov/criminal/fraud/fcpa.", "images": ["https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Untitled111-390x220.png", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Screenshot_20180113-113937-1-777x405.jpg", "https://web.archive.org/web/20180118003203im_/http://www.slate.com/content/dam/slate/articles/news_and_politics/politics/2017/01/170111_POL_sessions-hearing.jpg.CROP.promo-xlarge2.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Sarah-ss-4-390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/aaaaaaaw-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://placehold.it/599x98", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/BRE-TRUMP--390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/sarahvsreporterdd-390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/BRE-TRUMP--220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Sarah-ss-4-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://secure.gravatar.com/avatar/21a8b8bedf3be31f5843161dcf096f35?s=140&d=mm&r=g", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/trump-women-777x437-390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Screenshot_20180113-113937-1-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Screenshot_20180113-113937-1.jpg", "https://web.archive.org/web/20180118003203im_/http://assets.nydailynews.com/polopoly_fs/1.2986657.1488461639!/img/httpImage/image.jpg_gen/derivatives/article_750/usa-congress-sessions.jpg", "https://web.archive.org/web/20180118003203im_/https://placehold.it/728x90", "https://web.archive.org/web/20180118003203im_/http://media.breitbart.com/media/2016/12/obama-angry-getty-640x480.jpg", "https://web.archive.org/web/20180118003203im_/http://c6.nrostatic.com/sites/default/files/styles/original_image_with_cropping/public/uploaded/why-hell-hillary-clinton-comparing-herself-wonder-woman.jpg?itok=-lWzivnn", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/republix-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/trump-pray-390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Untitled111-220x150.png", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/sarahvsreporterdd-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/ss4-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/ss4-390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/new-220x150.jpg", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/aa-ssc-390x220.jpg", "https://web.archive.org/web/20180118003203im_/https://www.justice.gov/sites/default/files/styles/width_9/public/careers-photo.jpg?itok=0jVMXV5w", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/melania-220x150.png", "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/TrumpDoctor-696x383-390x220.jpg"], "top_img": "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Screenshot_20180113-113937-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180118003203/https://threpublican.com/first-indictment-issued-in-russian-bribery-case-tied-to-obama-era-uranium-one-deal/", "title": "First Indictment Issued In Russian Bribery Case Tied To Obama-Era Uranium One Deal", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#0088ff", "fb": {"pages": 191591641409262}, "generator": "Jannah 1.1.1", "ia": {"markup_url": "https://threpublican.com/first-indictment-issued-in-russian-bribery-case-tied-to-obama-era-uranium-one-deal/?ia_markup=1"}, "og": {"type": "article", "title": "First Indictment Issued In Russian Bribery Case Tied To Obama-Era Uranium One Deal", "url": "https://web.archive.org/web/20180118003203/https://threpublican.com/first-indictment-issued-in-russian-bribery-case-tied-to-obama-era-uranium-one-deal/", "description": "While we were busy chasing the “S***hole” not-so-shiny object the press laid out for us on Friday, it is now discovered what the media was trying to distract us from! And it is HUGE! The DOJ handed…", "site_name": "The Republican News", "image": {"identifier": "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Screenshot_20180113-113937-1.jpg", "width": 777, "height": 437}, "locale": "en_US"}, "article": {"published_time": "2018-01-14T01:29:40+00:00", "modified_time": "2018-01-14T01:29:40+00:00"}, "twitter": {"image": "https://web.archive.org/web/20180118003203im_/https://threpublican.com/wp-content/uploads/2018/01/Screenshot_20180113-113937-1.jpg?w=640", "card": "summary_large_image"}}, "movies": [], "publish_date": 1515893380.0, "source": "https://web.archive.org", "summary": ""}