{"url": "https://www.newidea.com.au/kate-middleton-pregnant-with-baby-number-four", "text": "Getty\n\n'They feel like their family is complete,' the source adds.\n\nKate always hoped for a fourth baby to complete their family - especially now that her sister Pippa is set to give birth to her first child and Meghan Markle and Prince Harry are preparing to welcome twins - but wasn't 'intending to get pregnant so soon after giving birth', explains the royal insider, adding that she and William are taking it in their stride.\n\n'This wasn't part of their plan, but their both so excited.'\n\nThe exciting news is made even better by the fact that sister-in-law Meghan Markle is already expecting her first child.\n\n'Meghan conceived just a few weeks after Kate,' a royal source told In Touch, and claims that because Meghan is having multiples, 'they're likely to arrive earlier - which means her due date is around the same time as Kate's.'\n\n'The could give birth on the same day!' a palace insider adds.\n\nAccording to the publication bombshell report, both duchesses, 36, are preparing to raise the royal cousins as part of 'one big, happy family.'\n\nAn insider said, 'Kate and Meghan bonded over the men they married. Now they're bonding over being pregnant together.'\n\nWhile the pregnancies are the subject of plenty of palace buzz, In Touch reveals the duchesses have only shared the news with close family and friends.\n\nFor Meghan, the US publication claims the pregnancy is not just a huge joy but an 'enormous relief.'\n\n'She was a nervous wreck about conceiving,' a palace insider says, not only because of her age but 'because it didn't happen with her first husband,' producer Trevor Engelson, from whom she split in 2013 after two years of marriage and nine years as a couple.\n\nRelated: Confirmed: Prince Harry and Meghan Markle - 'Yes, it's twins!'\n\nGetty\n\nWhile the royal couple have already shared the news with their immediate families, it will be a long time before they tell the public.\n\nJust like with their first three children, 'Kate and William will wait as long as possible before making an official announcement,' says the insider.\n\nBut in the meantime, 'Kate's hoping for another girl. She's telling people, 'I want Charlotte to have a sister!' William however would love another boy.'\n\nKate, adds the source, is 'convinced she's having another girl because she's having the same cravings for sweets that she did when she was pregnant with Charlotte.'\n\nBut, most importantly the couple want a healthy baby.\n\n'They're both over the moon.'\n\nRelated: Kate Middleton and Prince William expecting fourth child\n\nRelated: Meghan and Harry's twin joy\n\nGetty\n\nKate and Meghan are reportedly loving sharing their journey together.\n\nIn Touch reveals Kate 'has penned a pregnancy food list for Meghan that's full of nutritious things to eat and is advising her on how to balance motherhood with life as a royal,' says the source.\n\nFitness enthusiast Meghan, whose mother Doria Ragland is a yoga instructor, is returning the favour by teaching Kate pregnancy yoga.\n\nThe publication adds that the two pregnant women are happily letting their husbands dote on them.\n\n'William is doing his best to help Kate relax by being a hands-on father to George, Louis and Charlotte,' says the source.\n\n'He brings Kate tea and cookies in bed,' including lavender biscuits which are known to help with nausea.", "images": ["https://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "https://www.newidea.com.au/Branding/newidea/images/gmail.svg", "https://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "https://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "https://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/media/33620/kate-midldeton.jpg", "https://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "https://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/33620/kate-midldeton.jpg", "keywords": [], "authors": ["Nikki Black", "Nikki Is Obsessed With All Things Celebrity", "Dreams She Is A Long-Lost Kardashian. You'Ll Find Her Binging Netflix'S Latest 'Must-Watch' Show With A Jar Of Nutella Her Side."], "canonical_link": "https://www.newidea.com.au/kate-middleton-pregnant-with-baby-number-four", "title": "US report: Kate Middleton pregnant with baby number four", "meta_data": {"language": "en-us", "description": "Kate Middleton is still enjoying her time off from royal duties since welcoming her third child, Prince Louis, in April. But, it looks like the Duchess of Cambridge is already pregnant with baby no. 4!", "news_keywords": "kate middleton, catherine middleton, kate middleton fourth child, pregnancy, prince william, news, latest news, royals, the royal family, royal baby, princess charlotte, prince louis, prince george, the cambridge s, The Duke and Duchess of Cambridge, Duchess of Cambridge, Duke of Cambridge, baby, royal baby no 4, queen elizabeth", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/kate-middleton-pregnant-with-baby-number-four", "title": "'Kate Middleton pregnant with baby number four'", "description": "Kate Middleton is still enjoying her time off from royal duties since welcoming her third child, Prince Louis, in April. But, it looks like the Duchess of Cambridge is already pregnant with baby no. 4!", "image": {"identifier": "http://www.newidea.com.au/media/33620/kate-midldeton.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "US report: Kate Middleton pregnant with baby number four", "description": "Kate Middleton is still enjoying her time off from royal duties since welcoming her third child, Prince Louis, in April. But, it looks like the Duchess of Cambridge is already pregnant with baby no. 4!", "image": "http://www.newidea.com.au/media/33620/kate-midldeton.jpg", "url": "https://www.newidea.com.au/kate-middleton-pregnant-with-baby-number-four"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1537499721.38, "source": "https://www.newidea.com.au", "summary": ""}