{"url": "https://en.wikipedia.org/wiki/Aaron_Carter", "text": "American rapper, singer, songwriter\n\nAaron Charles Carter[6] (born December 7, 1987)[6] is an American rapper, singer, songwriter, actor, dancer and record producer. He first came to fame as a pop and hip hop singer in the late 1990s, establishing himself as a star among pre-teen and teenage audiences during the first years of the 21st century[7] with his four studio albums.\n\nBorn in Tampa, Florida, Carter began performing at age seven and released his self-titled debut album in 1997 at age 9, selling a million copies worldwide. His second album Aaron's Party (Come Get It) (2000) sold three million copies in the United States, and Carter began making guest appearances on Nickelodeon and touring with the Backstreet Boys shortly after the record's release.[8] Carter's next album, Oh Aaron, also went platinum, and the musician released what would be his last studio album for 16 years, Another Earthquake!, in 2002, followed by his 2003 Most Requested Hits collection.\n\nHe has since appeared on Dancing with the Stars, the Broadway musical Seussical, the off-Broadway musical The Fantasticks, and made several one-off performances.[9] In 2014, he announced that he would begin releasing new music[10] and began by releasing a single featuring rapper Pat SoLo, \"Ooh Wee\",[11] which first became available as a free download with purchase on his web store.[12] Carter released the single, \"Fool's Gold\", on April 1, 2016, and an EP titled LøVë in February 2017. His fifth studio album of the same name was released on February 16, 2018.[13]\n\nEarly life\n\nAaron Charles Carter was born on December 7, 1987, at the Tampa General Hospital in Tampa, Florida, where his parents, Jane Elizabeth (née Spaulding) and Robert Gene Carter (1952-2017),[14] ran the Garden Villa Retirement Home. The family was originally from New York City, where his older brother Nick, of the boy band Backstreet Boys, was born. In addition to his brother Nick, he also has three sisters: twin sister Angel (a model), B.J. and Leslie (1986–2012). Carter is named after his paternal grandfather, Aaron Charles Carter, and his maternal grandfather, Douglas \"Charles\" Spaulding. Carter attended the Frank D. Miles Elementary School and the Ruskin School in Florida.[15]\n\nMusic career\n\n1997–1999: Music beginnings and self-titled debut album\n\nCarter began his performing career at the age of seven, as the lead singer of Dead End, a local band formed after the members met at a rock school that they attended in Tampa.[16] He left the band after two years because they were interested in alternative rock while Carter was interested in pop.[16]\n\nCarter made his first solo appearance, singing a cover of The Jets' \"Crush on You\", when opening for the Backstreet Boys in Berlin in March 1997.[17] The performance was followed by a record contract, and in the fall of 1997, he released his first single, \"Crush on You\". Carter's eponymously titled debut studio album was released on December 1, 1997. The album achieved gold status in Norway, Spain, Denmark, Canada, and Germany, and was released in the United States on June 16, 1998.\n\n2000–2002: Aaron's Party (Come Get It), acting debut, and Oh Aaron\n\nCarter's second studio album, Aaron's Party (Come Get It) was released in the United States on September 26, 2000, under the Jive label. The album sold more than three million copies in the United States and was certified 3x platinum by RIAA.[18][19] The album included the hit singles, \"I Want Candy\", \"Aaron's Party (Come Get It)\", \"That's How I Beat Shaq\" and \"Bounce\", which songs received airplay on Disney and Nickelodeon. He also made several guest appearances on Nickelodeon and performed as opening act in several concerts for Britney Spears and the Backstreet Boys.\n\nIn March 2001, he made his acting debut, guest starring on an episode of the Disney Channel series Lizzie McGuire. That same month, he and fellow teen star Samantha Mumba performed a concert in MGM studios live on Disney Channel, titled Aaron Carter and Samantha Mumba in Concert. Aaron's part of the concert was released to DVD that same month as Aaron's Party: Live in Concert. In April 2001, he made his Broadway debut, playing JoJo the Who in Seussical the Musical by Lynn Ahrens and Stephen Flaherty.\n\nAt the age of 13, Carter recorded his third studio album Oh Aaron, which was released on August 7, 2001, and featured his first duet recording with his brother, Nick, and a duet with the new group at the time, No Secrets. Play Along Toys also created an Aaron Carter action figure in conjunction with the album's release.[20] Oh Aaron went platinum that same year and a live concert at Baton Rouge, Louisiana, was released to DVD as Oh Aaron: Live In Concert. He was later featured on the film soundtrack for the Paramount and Nickelodeon movie Jimmy Neutron: Boy Genius on November 21, 2001, with \"Leave It Up to Me\", \"A.C.'s Alien Nation\", and \"Go Jimmy Jimmy\", being released on the soundtrack.[21]\n\n2002–2008: Another Earthquake, Most Requested Hits, Saturday Night and House of Carters\n\nCarter performing in 2005\n\nCarter's fourth studio album, Another Earthquake!, was released on September 3, 2002, during the \"Rock, Rap, and Retro\" tour. The album featured the patriotic-themed \"America A.O.\" and the ballad \"Do You Remember\". He guest starred on three episodes of the Nickelodeon TV show, All That and sang the theme song to the PBS animated series Liberty's Kids, titled \"Through my own Eyes.\"\n\nDuring that time, Carter's parents filed a lawsuit against his former manager, Lou Pearlman (now deceased), in 2002 alleging failure to pay hundreds of thousands of dollars in royalties on Carter's 1998 album, which was released through Pearlman's label and production company, Trans Continental. On March 13, 2003, Pearlman was declared in contempt of court for ignoring a court order to produce documents relating to royalty payments.[22]\n\nCarter had also dated Lindsay Lohan along with his girlfriend Hilary Duff at the same time (leading to a feud between the two), but he broke up with Lohan in April 2003, and resumed dating Duff. Later, that same year, he and Duff ended their on-and-off relationship after two years.[23] Carter's Most Requested Hits, a collection including tracks from his last three albums as well as a new single, \"One Better\", was released on November 3, 2003.\n\n\"Saturday Night\", which was released on March 22, 2005, and was promoted by Carter during his summer 2005 Remix Tour. The song was released by Trans Continental label, with Lou Pearlman as executive producer. The single was also featured in the soundtrack of the film Popstar, in which Carter starred. The direct-to-video film was based heavily on his own life as a performer. A real-life motocross racer, Carter also appeared in 2005's Supercross. On March 21, 2006, Trans Continental filed a lawsuit against Carter within the Los Angeles Superior Court, citing that Carter allegedly reneged on a recording deal. Carter had signed the contract on December 7, 2004, when he was 17 and underage. His attorney however stated that Carter had the right to \"cancel or void various agreements\" that were signed when he was a minor.[24]\n\nCarter and his siblings starred in a reality show, House of Carters, which ran in October–November 2006 on E!. The series features all five Carter siblings reuniting to live in the same house.[7] On September 18, 2006, it was reported that Carter was engaged to former beauty queen and Playboy model Kari Ann Peniche.[25][26] US Weekly later reported that Carter had broken off his engagement to Peniche, saying he was impulsive in proposing to her.[27]\n\n2008–2013: Dancing with the Stars and return to touring\n\nIn 2009, Carter joined season 9 of Dancing with the Stars.[28][29] On November 10, he was eliminated from the show along with his partner Karina Smirnoff. They finished in fifth place.\n\nWeek # Dance/Song Judges' score Result Inaba Goodman Tonioli 1 Cha cha cha 7 8 7 Safe 2 Quickstep 9 9 9 Safe 3 Rumba 8 6 7 Safe 4 Lambada 6 6 6 Bottom Two 5 Argentine tango 8 8 8 Bottom Two 6 Waltz/Mambo Marathon 8 9 8 Safe 7 Jive/Team Paso Doble 9 10 10 Safe 8 Foxtrot/'90s Samba 7/9 8/9 8/9 Eliminated\n\nCarter onstage stage July 30, 2010\n\nDuring this time he also released some music online, including the single \"Dance with Me\" featuring Flo Rida in an attempt to kickstart his music career again. On August 22, 2010, Carter performed in Lake Ronkonkoma, NY at a benefit concert for Audrianna Bartol, a 3-year-old stricken with Stage 4 neuroblastoma cancer.[30]\n\nOn January 23, 2011, Carter's manager Johnny Wright announced that Carter had entered a treatment facility \"to heal some emotional and spiritual issues he was dealing with.\"[31] After entering the facility, Carter's first message to his fans was, \"The main thing in life is not to be afraid of being human.\"[32] On February 10, 2011, it was announced that Carter had successfully completed a month of rehab at the Betty Ford Center in Rancho Mirage, California.[33] Carter was scheduled to perform a second benefit concert for Audrianna Bartol on February 5, 2011, in Lake Ronkonkoma, NY and a benefit for the activist organization, \"Four Years. Go\", was originally scheduled for February 24, 2011, in Manville, New Jersey. The Manville show was rescheduled to take place on March 24, 2011. On September 2, 2011, Carter performed a show at the Eagle Ridge Mall in Lake Wales, Florida.[34]\n\nOn November 7, 2011, Carter began starring in the Off-Broadway production of the world's longest running musical, The Fantasticks, at the Snapple Theater Center in New York City. Carter has been cast in the role of Matt, the play's central character.[35]\n\nIn January 2012, Carter was one of eight celebrities participating in the Food Network reality series Rachael vs. Guy: Celebrity Cook-Off.[36] He was eliminated in the first episode.\n\nThroughout 2012, Carter made several one-off performances. On January 12, 2012, Carter performed a concert at Showcase Live in Foxborough, Massachusetts,[37] and on January 19, 2012, he performed another concert at the Gramercy Theater in New York City.[38] On May 11, 2012, he performed an acoustic show at the Mohegan Sun casino in Uncasville, Connecticut.[39] Carter hosted a Ryan Cabrera show on May 30, 2012, in Flemington, New Jersey,[40] and performed at Mixtape Festival on August 17, 2012. In 2013, Carter kicked off his first tour in eight years, the After Party Tour.[41] The tour ran from February to December 2013 and included over 150 shows in the United States and Canada.\n\n2014–present: The Music Never Stopped and LØVË projects\n\nCarter performing \"Ooh Wee\" with rapper Pat SoLo in 2014 at the Gramercy Theatre\n\nIn June 2014, Carter went on an 11-city Canadian tour during which he performed new songs from his upcoming album. Carter also announced that he would be embarking on a worldwide tour entitled the Wonderful World Tour, named for a song titled \"Wonderful World\" off of his upcoming album.[42] The tour included 50 dates and ran from September 2014 until January 2015.[43] In July, Carter appeared on Good Day LA, where he performed \"Ooh Wee\",[44] a single featuring Pat SoLo.[45] In February 2015, Carter released an EP through SoundCloud titled The Music Never Stopped.[46]\n\nOn January 31, 2016, Carter released his music video for \"Curious\"[47] under the name Kid Carter, co-directed by MDM Media's Michael D. Monroe, Ben Epstein and Aaron Carter.\n\nIn April 2016, Carter released the single \"Fool's Gold\".[48] Another single, \"Sooner or Later\", was released in January 2017.[49] Both songs appeared on the EP LØVË, released in February 2017,[50] written by Carter, Jon Asher, Melanie Fontana, Taylor \"Lakestreet Louie\" Helgeson, and Michel Schulz,[51] produced and independently released by Carter on his new venture Rakkaus Records.[52] An album of the same name was released as his fifth studio album on February 16, 2018.[13]\n\nPersonal life\n\nLegal troubles\n\nOn February 21, 2008, Carter was arrested in Kimble County, Texas, when he was pulled over for speeding, and authorities found less than two ounces of marijuana in his car.[53]\n\nOn July 15, 2017, Carter was arrested in Georgia on suspicion of driving under the influence and marijuana charges according to law enforcement.[54]\n\nOn August 12, 2019, Carter was granted a restraining order against his ex-girlfriend, Russian model Lina Valentina, after she reportedly threatened to stab him.[55]\n\nSexuality and relationships\n\nCarter came out as bisexual on August 5, 2017, through Twitter, and later that year, on December 18, he made a guest appearance on the podcast LGBTQ&A to discuss both his career and sexuality.[56][57][58] He has reaffirmed his bisexuality publicly on at least one other occasion, but has also said that he has only ever had relationships with women.[59][60] He'd previously dated several high profile female celebrities, including Hilary Duff, Lindsay Lohan, and Kari Ann Peniche.\n\nFinances\n\nOn November 22, 2013, Carter filed a bankruptcy petition to shed more than $3.5 million in debt,[61] mostly taxes owed from the money made at the height of his popularity.[62] \"This is not a negative thing,\" Carter's publicist Steve Honig told CNN. \"It's actually very positive. It's him doing what he needs to do to move forward.\"[62] The petition states that Carter's biggest creditor is the U.S. government; \"he owes the Internal Revenue Service $1.3 million in back taxes from his income in 2003, when Carter was just 16.\"[62] Carter settled all of his tax debt in 2014.[63]\n\nIn February 2019, Carter purchased a home in Lancaster, California.[64]\n\nHealth\n\nIn July 2017, Carter discussed his health problems, namely a hiatal hernia and lactose intolerance. In September 2017, Carter appeared on The Doctors, a syndicated health-focused talk show, to discuss public attention generated by his gaunt appearance and drug-related arrests.[65] A thorough series of tests and examinations revealed Carter was not suffering from cancer or any sexually transmitted disease, but he did have a candida infection which can be a sign of a weakened immune system. Carter tested negative for illegal drugs, but tested positive for \"a mixture of benzodiazepines with opiates\", a potentially dangerous combination of prescription medications that Carter said he took for anxiety and sleep. He was malnourished and underweight at 115 pounds (52 kg), with a body mass index of 17 (a BMI of 18.5 to 25 is normal range). Carter was advised to enter a drug rehabilitation program and remain under medical care.\n\nCarter subsequently admitted himself to Alo House, a treatment center in Malibu, California. In February 2018, Carter reported improvement in his condition including therapy for coping with the May 2017 death of his father and a later breakup with a longtime girlfriend, that his weight was a healthier 160 pounds (75.5 kg).[66] In 2019, Carter and his mother, Jane, appeared in the WEtv reality series Marriage Bootcamp: Family Edition. The show focuses on attempting to repair strained relationships through unconventional therapy.\n\nControversies\n\nIn January 2020, German artist Jonas Jödicke pointed out to Carter on Twitter that Carter was making unauthorized use of Jödicke's copyrighted artwork to promote Carter's clothing merchandise.[67] Carter responded to Jödicke, tweeting: \"you should've taken it as a compliment dick a fan of MINE sent this to me. oh here they go again, the answer is No this image has been made public and im using it to promote my clothing line aaroncarter.com guess I'll see you in small claims court FUCKERY\".[68] Following the incident, Jödicke was interviewed by Forbes, saying he was \"absolutely amazed\" at Carter's response.[69]\n\nIn March 2020, Carter set up an OnlyFans account, which is popular in the adult entertainment industry. Carter began charging $50 to $100 per nude photo, or $26 a month. PinkNews stated \"the prices are steep and the content is bizarre\"[70], and Queerty stated \"The reviews of Aaron Carter’s OnlyFans page are in and they’re not good.\"[71]\n\nDiscography\n\nStudio albums\n\nTours\n\nHeadlining\n\nCo-headlining\n\nOpening act\n\nPromotional\n\n1998: Eurasian Tour\n\n2000: Australian Tour [84]\n\n2000: Wal-Mart Promo Tour[84]\n\nFilmography\n\nTelevision\n\nFilm", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Aaron_Carter_and_Pat_SoLo_Performing_%22Ooh_Wee%22_-_Photo_by_Peter_Dzubay.png/344px-Aaron_Carter_and_Pat_SoLo_Performing_%22Ooh_Wee%22_-_Photo_by_Peter_Dzubay.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/AwIMG_0004.jpg/200px-AwIMG_0004.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg/1200px-Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Aaron_Carter_Paparazzo_07_30_2010.jpg/170px-Aaron_Carter_Paparazzo_07_30_2010.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg/220px-Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg/1200px-Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Aaron_Carter", "title": "Aaron Carter", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg/1200px-Aaron_Carter_Performing_at_the_Gramercy_Theatre_-_Photo_by_Peter_Dzubay_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}