{"url": "www.rollingstone.com/music/music-news/all-apologies-22-times-justin-bieber-said-sorry-41634/", "text": "The road to Justin Bieber‘s upcoming album Purpose has been an apologetic one. In fact, saying that he’s sorry for his past has been one of the premiere promotional tools for his highly-anticipated follow-up to 2013 compilation Journals.\n\nEven before he kicked off his notorious string of bad behavior in 2013 and 2014, however, Bieber has been offering mea culpas to fans for his actions, whether intentionally or accidentally terrible. Here are 22 of the 22-year-old’s best apologies.\n\n1. Apology for ignoring British fans (2010)\n\n“Wish I could have come out from the performance at the Mayfair but security wouldn’t let me. For those girls who cursed me out for it, I’m sorry, but sometimes I need to listen to security so no one gets hurt. But I like your attitude. The UK goes hard.”\n\n2. Apology for ignoring Brazilian fans (2011)\n\n“Love when the press think I’m annoyed because I look tired. I’m just tired. It’s normal. I’m not a machine. I’m in Brazil!! Not annoyed. I’m excited.”\n\n3. Apology for ignoring French fans (2012)\n\n“The other day in the airport I got surrounded by 20 paps. I don’t like small spaces, and I just wanted to get on the plane. I ran to get through the gate and there is a video of me running by fans and on the other side you don’t see the 20 paps. I would never run by my fans. For those that I did pass that day I AM SORRY. I know my fans are my everything. I know my responsibility to love them. I LOVE MY BELIEBERS.”\n\n4. Apology for flipping off paparazzi (2011)\n\n“Had a great bday and at the end of the night [Selena and I] got surrounded by paps and I reacted in a way I know better. I’m sorry. #killthemwithkindness. It’s not always easy but I know better than to react in anger.”\n\n5. Apology for throwing up onstage (2012)\n\n“I know that you guys don’t judge me, do you? You love me just the same, even though I’m throwing up all over the stage. You love me that much?”\n\n6. Apology to Bill Clinton after cussing him out on video (2013)\n\n“Thanks for taking the time to talk, Mr. President. Your words meant a lot. #greatguy”\n\n7. Apology for canceled show (2015)\n\n“I look forward to the opportunity to give my UK beliebers a great show in the near future and hope to honor my commitment to [the Prince’s] Trust at that time.”\n\n8. Apology for canceled TV appearance (2010)\n\n“Just want to let my people in Germany know I won’t be on Wetten Dass tonight as an accident has taken place and we all don’t think it is right to continue … I’m sorry we couldn’t perform tonight but some things are more important than putting on a show.”\n\n9. Apology for smoking weed (2013)\n\n“I also heard he got busted for smoking weed,” Bieber said in a Saturday Night Live sketch in reference to himself. “And he’s really sorry about it. And people make mistakes. And he’s never gonna do it again.”\n\n10. Apology to China and Japan after visiting a controversial Tokyo shrine honoring fallen WWII soldiers, including war criminals (2014)\n\n“While in Japan, I asked my driver to pull over for which I saw a beautiful shrine. I was misled to think the Shrines were only a place of prayer. To anyone I have offended, I am extremely sorry. I love you China and I love you Japan.”\n\n11. Apology to Argentina for mishandling the country’s flag onstage (2013)\n\n“People throw stuff on my stage all show and I get it to the stage hands to get off so no one got hurt. That video I saw a bra and thought it was a shirt. I’m being told by my team it was a shirt, but even if it was a flag I would never do anything to disrespect Argentina or the fans.”\n\n12. Apology for walking off stage (2015)\n\n“Sadly, it’s been a rough week for me, long days no sleep while having to be ‘on’ as they would say for cameras, fans, etc. In no way did I mean to come across mean but chose to end the show as the people in the front row would not listen … I don’t always handle things the right way but I’m human and I’m working on getting better at responding, not reacting.”\n\n13. Apology for naked butt (2015)\n\n“I deleted the photo of my butt on Instagram not because I thought it was bad but someone close to me’s daughter follows me and she was embarrassed that she saw my butt and I totally wasn’t thinking in that aspect. I felt awful that she felt bad. To anyone I may have offended I’m so sorry. It was completely pure-hearted as a joke but didn’t take in account there are littles following me!!!”\n\n14. Apology to Love Live anime fans for a poorly worded tweet\n\n“I’m really sorry for getting my otaku Beliebers’ hopes up, but I’m still not really sure which words in a sentence you need to capitalize so it ended up looking like I tweeted the title of the show.”\n\n15. Apology for racist joke (2014)\n\n“As a kid, I didn’t understand the power of certain words and how they can hurt. I thought it was okay to repeat hurtful words and jokes but didn’t realize at the time that it wasn’t funny and that in fact my actions were continuing ignorance.”\n\n16. Apology for another racist joke (2014)\n\n“Facing my mistakes from years ago has been one of the hardest things I’ve ever dealt with. But I feel now that I need to take responsibility for those mistakes and not let them linger. I just hope that the next 14-year-old kid who doesn’t understand the power of these words does not make the same mistakes I made years ago. At the end of the day I just need to step down and own what I did.”\n\n17. Apology to Ellen (2015)\n\n“I think it’s just cool to be able to laugh at yourself. I’ve done some things. That might not of been the greatest. I just want to be able to own up to some of the things.”\n\n18. Apology for appearance on Ellen (2015)\n\n“It’s been a minute since I’ve done a public appearance, and I didn’t want to come off arrogant or conceited or basically how I’ve been acting the past year, year and a half.”\n\n19. Apology for apologizing (2015)\n\n“People often forget that [I’m human], even with their comments and stuff they think it doesn’t get to me, but it gets to me. Things that people say bother me, and I gotta be strong enough to keep it pushing. That’s why I wanted to make a video, just to let people know that I’m human … I’m passionate about being better and growing so I think that this is going to be an awesome chapter in my life.”\n\n20. Apology at Comedy Central Roast (2015)\n\n“There was really no preparing me for this life. I was thrown into this at 12-years-old and didn’t really know what I was getting into. There’s been moments I’m really proud of and moments I’m pretty disappointed in myself for.”\n\n21. Apology to mom (2015)\n\n“If it wasn’t for this woman, let’s just say I would have had a way LONGER stupid phase. I love you and thank you for not giving up on me!”\n\n22. Apology for not apologizing (2015)\n\n“Is it too late now to say sorry? Yeah I know that I let you down. Is it too late to say I’m sorry now?”", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fall-apologies-22-times-justin-bieber-said-sorry-41634%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=41634", "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-215991-GettyImages-494723598.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-215991-GettyImages-494723598.jpg", "keywords": [], "authors": ["Brittany Spanos", "Staff Writer", "Brittany Spanos'S Most Recent Stories", "Rina Sawayama Is The Pop Moment On Her Debut Album", "Sawayama", "Lauren Jauregui Praises Social Distancing In New Song", "Sam Smith", "Demi Lovato Announce", "I M Ready", "For Love With New Song"], "canonical_link": "https://www.rollingstone.com/music/music-news/all-apologies-22-times-justin-bieber-said-sorry-41634/", "title": "All Apologies: 22 Times Justin Bieber Said ‘Sorry’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "From ignoring fans to throwing up on stage, Justin Bieber has had many reasons to atone. Here are 22 of his best apologies.", "news_keywords": "Justin Bieber", "og": {"type": "article", "title": "All Apologies: 22 Times Justin Bieber Said 'Sorry'", "url": "https://www.rollingstone.com/music/music-news/all-apologies-22-times-justin-bieber-said-sorry-41634/", "description": "From ignoring fans to throwing up on stage, the pop star has had many reasons – and opportunities – to atone", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-215991-GettyImages-494723598.jpg", "width": 1024, "height": 1538, "alt": "Justin Bieber"}, "locale": "en_US"}, "article": {"published_time": "2015-11-10T17:30:00+00:00", "modified_time": "2018-06-25T13:56:11+00:00"}, "twitter": {"text": {"title": "All Apologies: 22 Times Justin Bieber Said 'Sorry'"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-215991-GettyImages-494723598.jpg?w=682", "alt": "Justin Bieber"}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@ohheybrittany", "title": "All Apologies: 22 Times Justin Bieber Said ‘Sorry’", "description": "From ignoring fans to throwing up on stage, Justin Bieber has had many reasons to atone. Here are 22 of his best apologies."}, "generator": "WordPress 5.4", "author": "Brittany Spanos", "content_type": "Article", "post_id": 41634, "title": "All Apologies: 22 Times Justin Bieber Said 'Sorry'", "published_at": "2015-11-10 17:30:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-215991-GettyImages-494723598.jpg?w=1024", "comment_count": 0, "tags": "Justin Bieber", "topics": "Music News", "body": "The road to Justin Bieber&apos;s upcoming album Purpose has been an apologetic one. In fact, saying that he&apos;s sorry for his past has been one of the premiere promotional tools for his highly-anticipated follow-up to 2013 compilation Journals.\r\n\r\nEven before he kicked off his notorious string of bad behavior in 2013 and 2014, however, Bieber has been offering mea culpas to fans for his actions, whether intentionally or accidentally terrible. Here are 22 of the 22-year-old&apos;s best apologies. \r\n1. Apology for ignoring British fans (2010)\"Wish I could have come out from the performance at the Mayfair but security wouldn&apos;t let me. For those girls who cursed me out for it, I&apos;m sorry, but sometimes I need to listen to security so no one gets hurt. But I like your attitude. The UK goes hard.\"\r\n2. Apology for ignoring Brazilian fans (2011)\"Love when the press think I&apos;m annoyed because I look tired. I&apos;m just tired. It&apos;s normal. I&apos;m not a machine. I&apos;m in Brazil!! Not annoyed. I&apos;m excited.\"\r\n3. Apology for ignoring French fans (2012)\"The other day in the airport I got surrounded by 20 paps. I don&apos;t like small spaces, and I just wanted to get on the plane. I ran to get through the gate and there is a video of me running by fans and on the other side you don&apos;t see the 20 paps. I would never run by my fans. For those that I did pass that day I AM SORRY. I know my fans are my everything. I know my responsibility to love them. I LOVE MY BELIEBERS.\"\r\n4. Apology for flipping off paparazzi (2011)\"Had a great bday and at the end of the night [Selena and I] got surrounded by paps and I reacted in a way I know better. I&apos;m sorry. #killthemwithkindness. It&apos;s not always easy but I know better than to react in anger.\"\r\n5. Apology for throwing up onstage (2012)\"I know that you guys don&apos;t judge me, do you? You love me just the same, even though I&apos;m throwing up all over the stage. You love me that much?\"\r\n6. Apology to Bill Clinton after cussing him out on video (2013)\"Thanks for taking the time to talk, Mr. President. Your words meant a lot. #greatguy\"\r\n7. Apology for canceled show (2015)\"I look forward to the opportunity to give my UK beliebers a great show in the near future and hope to honor my commitment to [the Prince&apos;s] Trust at that time.\"\r\n8. Apology for canceled TV appearance (2010) \"Just want to let my people in Germany know I won&apos;t be on Wetten Dass tonight as an accident has taken place and we all don&apos;t think it is right to continue ... I&apos;m sorry we couldn&apos;t perform tonight but some things are more important than putting on a show.\"\r\n9. Apology for smoking weed (2013)\"I also heard he got busted for smoking weed,\" Bieber said in a Saturday Night Live sketch in reference to himself. \"And he&apos;s really sorry about it. And people make mistakes. And he&apos;s never gonna do it again.\"\r\n10. Apology to China and Japan after visiting a controversial Tokyo shrine honoring fallen WWII soldiers, including war criminals (2014)\"While in Japan, I asked my driver to pull over for which I saw a beautiful shrine. I was misled to think the Shrines were only a place of prayer. To anyone I have offended, I am extremely sorry. I love you China and I love you Japan.\"\r\n11. Apology to Argentina for mishandling the country&apos;s flag onstage (2013)\"People throw stuff on my stage all show and I get it to the stage hands to get off so no one got hurt. That video I saw a bra and thought it was a shirt. I&apos;m being told by my team it was a shirt, but even if it was a flag I would never do anything to disrespect Argentina or the fans.\"\r\n12. Apology for walking off stage (2015)\"Sadly, it&apos;s been a rough week for me, long days no sleep while having to be &apos;on&apos; as they would say for cameras, fans, etc. In no way did I mean to come across mean but chose to end the show as the people in the front row would not listen ... I don&apos;t always handle things the right way but I&apos;m human and I&apos;m working on getting better at responding, not reacting.\"\r\n13. Apology for naked butt (2015)\"I deleted the photo of my butt on Instagram not because I thought it was bad but someone close to me&apos;s daughter follows me and she was embarrassed that she saw my butt and I totally wasn&apos;t thinking in that aspect. I felt awful that she felt bad. To anyone I may have offended I&apos;m so sorry. It was completely pure-hearted as a joke but didn&apos;t take in account there are littles following me!!!\"\r\n14. Apology to Love Live anime fans for a poorly worded tweet\"I&apos;m really sorry for getting my otaku Beliebers&apos; hopes up, but I&apos;m still not really sure which words in a sentence you need to capitalize so it ended up looking like I tweeted the title of the show.\"\r\n15. Apology for racist joke (2014)\"As a kid, I didn&apos;t understand the power of certain words and how they can hurt. I thought it was okay to repeat hurtful words and jokes but didn&apos;t realize at the time that it wasn&apos;t funny and that in fact my actions were continuing ignorance.\"\r\n16. Apology for another racist joke (2014)\"Facing my mistakes from years ago has been one of the hardest things I&apos;ve ever dealt with. But I feel now that I need to take responsibility for those mistakes and not let them linger. I just hope that the next 14-year-old kid who doesn&apos;t understand the power of these words does not make the same mistakes I made years ago. At the end of the day I just need to step down and own what I did.\"\r\n17. Apology to Ellen (2015)\"I think it&apos;s just cool to be able to laugh at yourself. I&apos;ve done some things. That might not of been the greatest. I just want to be able to own up to some of the things.\"\r\n18. Apology for appearance on Ellen (2015)\"It&apos;s been a minute since I&apos;ve done a public appearance, and I didn&apos;t want to come off arrogant or conceited or basically how I&apos;ve been acting the past year, year and a half.\"\r\n19. Apology for apologizing (2015)\"People often forget that [I&apos;m human], even with their comments and stuff they think it doesn&apos;t get to me, but it gets to me. Things that people say bother me, and I gotta be strong enough to keep it pushing. That&apos;s why I wanted to make a video, just to let people know that I&apos;m human ... I&apos;m passionate about being better and growing so I think that this is going to be an awesome chapter in my life.\"\r\n20. Apology at Comedy Central Roast (2015)\"There was really no preparing me for this life. I was thrown into this at 12-years-old and didn&apos;t really know what I was getting into. There&apos;s been moments I&apos;m really proud of and moments I&apos;m pretty disappointed in myself for.\"\r\n21. Apology to mom (2015)\"If it wasn&apos;t for this woman, let&apos;s just say I would have had a way LONGER stupid phase. I love you and thank you for not giving up on me!\"\r\n22. Apology for not apologizing (2015)\"Is it too late now to say sorry? Yeah I know that I let you down. Is it too late to say I&apos;m sorry now?\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1447176600.0, "source": "http://www.rollingstone.com", "summary": ""}