{"url": "https://www.bbc.com/news/world-europe-43054758", "text": "Media playback is unsupported on your device Media caption Queen Margrethe married Prince Henrik in 1967\n\nPrince Henrik of Denmark, the husband of Queen Margrethe who was famous for his public unhappiness at never being named king, has died at the age of 83.\n\nThe controversial French-born prince had been diagnosed with dementia last year and was admitted to hospital in January with a lung infection.\n\nHis flamboyant style was both loved and criticised by Danes.\n\nFrustrated with his royal title, he announced in 2017 that he did not want to be buried next to his wife.\n\nThe 77-year-old queen accepted her husband's decision, the Royal House said at the time, breaking a 459-year-old tradition of burying royal spouses together.\n\nThe prince died \"peacefully in his sleep\" at the Fredensborg Castle, north of Copenhagen, with Queen Margrethe and their two sons - Crown Prince Frederick and Prince Joachim - at his side.\n\nImage copyright EPA Image caption Unhappy with his royal status, Prince Henrik was a controversial figure in Denmark\n\nBorn Henri Marie Jean André de Laborde de Monpezat on 11 June 1934, Prince Henrik married the then-crown princess Margrethe in 1967. He met her while stationed in London as a diplomat.\n\nWhen she became queen in 1972, he was named Prince Consort - as in most monarchies, a princess traditionally becomes queen when her husband takes the throne, but a man does not become king if his wife becomes queen.\n\nBut over the years, the prince - who changed his name to Henrik as a mark of respect - made no secret about his unhappiness at being denied the title of king. And many Danes disliked him for that, seeing it as a sign of an arrogant man hungry for recognition.\n\n'Degraded and humiliated'\n\nPrince Henrik did not take it lightly when, in 2002, Crown Prince Frederik was chosen to represent Queen Margrethe at a New Year's ceremony, instead of him.\n\nSaying he had to \"reflect on life\", he dramatically fled to his chateau in southern France, where he would stay for three weeks.\n\nTo a Danish tabloid, he said the royal staff had shunted him into \"third place in the royal hierarchy\". He had felt \"pushed aside, degraded and humiliated\", and his self-respect was being destroyed.\n\n\"For many years I have been Denmark's number two,\" he said then. \"I've been satisfied with that role, but I don't want to be relegated to number three.\"\n\nRead more\n\nImage copyright PA Image caption Queen Margrethe and Prince Henrik at the Anglo-Danish Society's Jubilee dinner in London in 1974\n\nWhile the episode became a source of joke for many, it was a turning point for others, especially many young Danes, who thought his manner represented a break from the norms of cultural uniformity in Danish society.\n\nPrince Henrik was also known for his thick French accent and his love of food, wine and poetry, and several of his cookbooks and collections of poems have been published.\n\nIn 2016, he retired from official duties, renouncing the title of Prince Consort. In the time since, he was often in France at his private vineyard.\n\nImage copyright AFP Image caption Prince Henrik and Queen Margrethe pictured in Yogyakarta, Indonesia, in 2015\n\nPrince Henrik did not want a state funeral, the Royal House said, adding that the ceremony would be small and private.\n\nFollowing his wish, he will be cremated, with half his ashes spread over Danish seas and the other half buried in the royal private garden at the Fredensborg Castle.\n\nQueen Margrethe already has a specially-built sarcophagus in a cathedral west of Copenhagen where the remains of Danish royals are buried.\n\nReacting to the death, Danish Prime Minister Lars Lokke Rasmussen said Prince Henrik had \"represented Denmark magnificently\".", "images": ["https://ichef.bbci.co.uk/images/ic/720x405/p05bg26n.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=world::europe::news.world.europe.story.43054758.page&x1=[urn:bbc:cps:bc02d461-21e4-0649-a918-f2ae86947186]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/images/ic/1024x576/p05bg26n.jpg"], "top_img": "https://ichef.bbci.co.uk/images/ic/1024x576/p05bg26n.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/world-europe-43054758", "title": "Denmark's Prince Henrik, who wanted to be king, dies at 83", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "French-born Prince Henrik, who made public his unhappiness at never being named king, dies at 83.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 116087396, "og": {"title": "Denmark's prince who wanted to be king dies", "type": "article", "description": "French-born Prince Henrik, who made public his unhappiness at never being named king, dies at 83.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/world-europe-43054758", "image": {"identifier": "https://ichef.bbci.co.uk/images/ic/1024x576/p05bg26n.jpg", "alt": "BBC News. Queen Margrethe and Prince Henrik of Denmark during visit to Greenland on 17 July 2015"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Europe"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Denmark's prince who wanted to be king dies", "description": "French-born Prince Henrik, who made public his unhappiness at never being named king, dies at 83.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/images/ic/1024x576/p05bg26n.jpg", "alt": "Queen Margrethe and Prince Henrik of Denmark during visit to Greenland on 17 July 2015"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/world-europe-43054758?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}