{"url": "www.computerworld.com.au/article/645961/vodafone-tpg-confirm-plan-merge/", "text": "Vodafone Hutchison Australia and TPG have agreed to a “merger of equals” the companies announced this morning.\n\nThe merged group will be owned 49.9 per cent by TPG shareholders and 50.1 per cent by VHA shareholders: Vodafone and Hutchison Telecommunications Australia.\n\nThe new ASX-listed group will be named ‘TPG Telecom Limited’ and have approximately 20 per cent of the Australian mobile market share and 22 per cent of the fixed line broadband market share. Together, the new company would have some 6.4 million mobile subscribers and 1.9 million fixed line broadband customers.\n\nThe group will have an implied enterprise value of $15 billion and have revenues in the region of $6.02 billion and EBITDA of $1.86 billion.\n\nTPG and VHA have entered into a scheme implementation deed, with the proposal having the unanimous backing of TPG’s board.\n\nIf the deal goes ahead mdash; and it is subject to a number of approval processes including a TPG shareholder vote, and sign-off from the Australian Competition and Consumer Commission and the Foreign Investment Review Board as well as court approval mdash; then the merger is expected to be implemented next year.\n\nLast week the pair acknowledged that they had been engaged in “exploratory discussions” about a potential merger. A statement from the TPG board at the time said “there is no certainty that any transaction will eventuate or what the terms of a transaction would be.”\n\nAn announcement from the two telcos said that VHA expected to have net debt $1.94 billion (plus an $80 million spectrum instalment at the end of January) following a restructure its existing debt facilities by its owners, Vodafone and Hutchison.\n\nTPG will contribute debt of around $1.67 billion, as well as a $352 million payment for spectrum due in January).\n\nPrior to the merger, TPG will spin off its Singapore mobile business into a separate company.\n\nVHA CEO I?aki Berroeta will be the managing director and chief executive of the merged group, while TPG CEO and chairperson David Teoh will be the chairperson.\n\nThe board will comprise the CEO and chairperson, existing TPG directors Robert Millner and Shane Teoh, two Vodafone nominees, two Hutchison Australian nominees, and two new independent directors.\n\nTPG Telecom Limited will be well positioned to capitalise and 5G opportunities and offer significant scale across the country with complementary fixed line and mobile networks to create a stronger challenge to Telstra and Optus, a presentation on the proposal says.\n\n“The merger with VHA represents an exciting step-change in TPG’s evolution, and will benefit both our shareholders and Australian consumers alike,” Teoh said in a statement.\n\n“Together TPG and VHA will have a comprehensive portfolio of fixed and mobile products, and will own the infrastructure required to deliver faster services and more competitive value propositions to Australian customers. With this merger, we will be a more formidable competitor against Telstra and Optus.”\n\nVHA CEO I?aki Berroeta said that the merger will “provide stronger competition in the market and greater choice for Australian consumers and enterprises across fixed broadband and mobile.”\n\n“The combination of our two highly complementary businesses and talented employees will create a more sustainable company, with enhanced capacity to invest in new technology and innovation,” he added. “We are confident that this merger will be highly beneficial to customers, shareholders and other stakeholders.”\n\nToday’s announcement comes just ahead of the deadline mdash; tomorrow at 5pm mdash; to lodge applications to participate in the government’s auction of 3.6GHz spectrum, which is one of the key bands for early 5G services.\n\nThe government has imposed limits on how much spectrum an individual mobile carrier can pick up in the auction.", "images": ["http://idge.staticworld.net/images/print.svg", "http://idge.staticworld.net/images/twitter.svg", "http://idge.staticworld.net/images/linkedin.svg", "https://images.idgesg.net/images/article/2019/09/rohan_pearce-100810839-byline.jpg", "https://alt.idgesg.net/images/furniture/computerworld/computerworld-np-logo.svg", "http://idge.staticworld.net/images/reddit.svg", "http://idge.staticworld.net/images/facebook.svg", "https://alt.idgesg.net/images/logos/logo-footer-white.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6035308&cv=2.0&cj=1", "http://idge.staticworld.net/images/mail.svg", "https://idge.staticworld.net/ctw/computerworld-logo300x300.png"], "top_img": "https://idge.staticworld.net/ctw/computerworld-logo300x300.png", "keywords": [], "authors": ["Rohan Pearce", "Sponsored Hpe"], "canonical_link": "https://www.computerworld.com/article/3474293/vodafone-and-tpg-confirm-plan-to-merge.html", "title": "Vodafone and TPG confirm plan to merge", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Vodafone Hutchison Australia and TPG have agreed to a “merger of equals” the companies announced this morning.", "DC.date.issued": "2018-08-30T01:40-05:00", "date": "2018-08-30", "og": {"title": "Vodafone and TPG confirm plan to merge", "description": "Vodafone Hutchison Australia and TPG have agreed to a “merger of equals” the companies announced this morning.", "image": "https://idge.staticworld.net/ctw/computerworld-logo300x300.png", "type": "article", "site_name": "Computerworld", "url": "https://www.computerworld.com/article/3474293/vodafone-and-tpg-confirm-plan-to-merge.html"}, "twitter": {"image": "https://idge.staticworld.net/ctw/computerworld-logo300x300.png", "card": "summary_large_image", "site": "@computerworld", "description": "Vodafone Hutchison Australia and TPG have agreed to a “merger of equals” the companies announced this morning."}, "author": "Rohan Pearce", "fb": {"app_id": 123026274413041, "pages": 103687894679}, "rating": "General", "robots": "NOODP,NOYDIR", "google-site-verification": "_JEYLpDBDU_w1eI6P77BYlB1lvpukoxFcYDS_-Aznko", "msvalidate.01": "04917178B598F0648B9BAD693FEC29A3"}, "movies": [], "publish_date": null, "source": "http://www.computerworld.com.au", "summary": ""}