{"url": "https://www.etonline.com/news/216101_bill_cosby_says_he_blind_as_daughter_emotionally_defends_him", "text": "Bill Cosby is speaking out for the first time in years to confirm that he has completely lost his sight.\n\nIn a new interview with NNPA Newswire, the 79-year-old embattled comedian says he's now blind. Cosby recalls waking up one morning two years ago, and telling his wife, Camille, that he \"can't see.\" Doctors then told him there was nothing they could do to repair his sight.\n\nCosby didn't discuss the pending criminal sexual assault case against him. Cosby is charged with three counts of aggravated indecent assault for allegedly drugging and sexually assaulting former Temple employee Andrea Constand in January 2004 at his mansion in Elkins Park, Pennsylvania. He has pleaded not guilty to all charges, and has repeatedly denied similar claims from other women.\n\nWATCH: EXCLUSIVE: Holly Madison on Bill Cosby-Hugh Hefner Lawsuit -- 'It Makes Me Feel Sad to Hear Other Stories Like That'\n\nHowever, Cosby did say that he misses performing, and that he's looking forward to the next phase in his career.\n\n\"I miss it all and I hope that day will come. I have some routines and storytelling that I am working on,\" Cosby says. “I think about walking out onstage somewhere in the United States of America and sitting down in a chair and giving the performance that will be the beginning of the next chapter of my career.\"\n\nMeanwhile, Cosby's youngest daughter, 40-year-old Evin Cosby, passionately defended her dad in an essay published on the NNPA Newswire on Wednesday. Evin talks about her loving childhood, and says her father has not been treated fairly by the public and by the media.\n\n\"When people are so quick to cast hate, and make accusations of horrific violence against my dad, they are callous in their carelessness about the harm they are causing to others,\" Evin writes. \"My dad, like anyone in this country, deserves to be treated fairly under the law. My dad broke barriers and raised the conscious of America on important topics, especially for the advancement of women.\"\n\n\"I know that my father loves me, loves my sisters and my mother,\" she continues. \"He loves and respects women. He is not abusive, violent or a rapist. Sure, like many celebrities tempted by opportunity, he had his affairs, but that was between him and my mother. They have worked through it and moved on, and I am glad they did for them and for our family.\"\n\nEvin also writes that the accusations against her father have hurt his family and other people he has worked with.\n\n\"The harsh and hurtful accusations of things that supposedly happened 40 or 50 years ago, before I was born, in another lifetime, and that have been carelessly repeated as truth without allowing my dad to defend himself and without requiring proof, has punished not just my dad but every one of us,\" she writes. \"They have punished the talented people who were still earning money and feeding their families from my dad’s shows and work.\"\n\nWATCH: Bill Cosby's Accusers: A Timeline of Alleged Sexual Assault Claims\n\nCosby's trial surrounding Constand's allegations is set to begin on June 5. Watch below:", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/cosby_vidpic_042617_1280Copy2.jpg?itok=BxLXBVWP"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/cosby_vidpic_042617_1280Copy2.jpg?itok=BxLXBVWP", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/news/216101_bill_cosby_says_he_blind_as_daughter_emotionally_defends_him", "title": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him", "meta_data": {"article": {"opinion": "false"}, "title": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/news/216101_bill_cosby_says_he_blind_as_daughter_emotionally_defends_him", "title": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him", "description": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/cosby_vidpic_042617_1280Copy2.jpg?itok=BxLXBVWP", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him", "title": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno", "url": "https://www.etonline.com/news/216101_bill_cosby_says_he_blind_as_daughter_emotionally_defends_him", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/cosby_vidpic_042617_1280Copy2.jpg?itok=BxLXBVWP"}, "description": "Bill Cosby Breaks His Silence to Say He's Blind, as Daughter Emotionally Defends Him", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Bill Cosby", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}