{"url": "https://en.wikipedia.org/wiki/David_Spade", "text": "American comedian\n\nDavid Wayne Spade (born July 22, 1964)[1] is an American actor, stand-up comedian, writer, producer, and television host. He was a cast member on Saturday Night Live in the 1990s, and he later began an acting career in both film and television. He also starred or co-starred in the films Police Academy 4 (1987), Tommy Boy (1995), Black Sheep (1996), Joe Dirt (2001), Joe Dirt 2: Beautiful Loser (2015), Grown Ups (2010), Grown Ups 2 (2013), and Father of the Year (2018) among others.\n\nHe has been part of an ensemble cast of two long-running sitcoms: Just Shoot Me! (1997–2003) and Rules of Engagement (2007–2013). Additionally, he starred as C. J. Barnes in the sitcom 8 Simple Rules (2004–2005). For his role in Just Shoot Me!, he was nominated for a Primetime Emmy Award and two Golden Globes. In animation, he voiced Kuzco in the 2000 film The Emperor's New Groove (2000) and its direct-to-video sequel, Kronk's New Groove (2005), the red panda Aliur in Snowflake, the White Gorilla (2013) and Griffin the Invisible Man in the Hotel Transylvania film series (2012-2018). Spade hosts a late-night talk show Lights Out with David Spade, which premiered on July 29, 2019. He voiced Ranger Frank in The Rugrats Movie. Spade's comedic style, in both his stand-up material and acting roles, relies heavily on sarcasm and self-deprecation.[2][3]\n\nEarly life [ edit ]\n\nSpade was born in Birmingham, Michigan, to Judith J. (née Meek), a writer and magazine editor, and Wayne M. Spade, a sales representative.[1][4][5] His brothers are Bryan and Andy Spade.[6] The latter is an entrepreneur who, together with David's sister-in-law Kate Spade, co-founded the designer brand Kate Spade New York.\n\nSpade and his family moved to Scottsdale, Arizona, when he was four years old.[7] His parents divorced soon thereafter, and he and his brothers were raised for the most part by their mother, in relative poverty.[8]\n\nSpade attended Saguaro High School and later Scottsdale Community College before transferring to Arizona State University where he graduated with a business degree in 1986.[9][10] He also was a member of the Sigma Alpha Epsilon fraternity.[11] Spade performed standup at the university's long-running sketch comedy show, Farce Side Comedy Hour, on numerous occasions. In the mid-80s he also did stand-up in the Monday night comedy show at Greasy Tony's Pizza in Tempe, Arizona.[12]\n\nCareer [ edit ]\n\nSpade in 2004\n\nWith the help of friend and fellow comedian Dennis Miller, he joined Saturday Night Live in 1990.[13] Spade started as a writer and eventually moved up to cast member. While there, he became known for his brand of sarcasm, and his characters in a number of sketches were hits. Some of them include a flight attendant for \"Total Bastard Airlines\" who bids a dismissive \"Buh-Bye\" to each passenger upon disembarking; a receptionist for Dick Clark who, as a matter of policy, asks people indiscriminately, \"And you are?\"; and the sarcastic \"Hollywood Minute\" reporter who puts celebrities down by means of one-liners. Other characters include Christy Henderson from the Gap Girls and Karl from the Karl's Video sketches. He also did impressions of various celebrities, including Brad Pitt and Michael J. Fox. According to interviews with Spade, most of the material that he wrote early in his time at SNL was given to Dana Carvey to perform on the show.\n\nOn December 9, 1995, Spade revived \"Hollywood Minute\" inside a segment called \"Spade in America\"; Spade joked, \"Look, children, it's a falling star. Make a wish!\" next to a picture of former Saturday Night Live cast member Eddie Murphy.[14] The one-liner referred to Murphy's lack of recent box office success, especially the bomb Vampire in Brooklyn. The crack made Murphy angry at both Spade and SNL for several years afterward.[15] Spade wrote in his 2015 memoir that he received an angry phone call from Murphy two days later at the SNL offices; the two did not reconcile until a chance meeting in 2011.[16][17] Spade left SNL in 1996. He returned to host an episode in 1998 and another in 2005.[citation needed]\n\nSpade's film career began in 1987 with an appearance in Police Academy 4. He starred with fellow Saturday Night Live cast member Chris Farley in two buddy comedy films, Tommy Boy (1995) and Black Sheep (1996). The two were planning a third film together when Farley died of a drug overdose in 1997 at the age of 33. When Spade declined to attend Farley's funeral, rumors abounded that there had been a falling out between the two. Spade stated that their friendship had been under some tension, partly because of Farley's drug problem, but that he did not attend the funeral simply because he could not handle it emotionally.[18]\n\nAlthough he received several offers to star in his own TV shows, he turned them down and joined the ensemble cast of Steven Levitan's office sitcom Just Shoot Me!, opposite Laura San Giacomo and George Segal, which ran for seven seasons from 1997 to 2003. He played a sarcastic receptionist, Dennis Finch.\n\nIn 2000, Spade provided the voice of Kuzco in Disney's buddy comedy film, The Emperor's New Groove (2000) and would later reprise the role in its direct-to-video sequel Kronk's New Groove (2005).\n\nWhile appearing on Just Shoot Me, Spade had his first solo starring role as the title character in the 2001 film Joe Dirt, which was a modest box office success. The film was co-written by Spade and Fred Wolf.\n\nSpade starred again in the 2003 film Dickie Roberts: Former Child Star, again co-written by Spade and Wolf. It was the first of many films in which Spade has appeared that were produced by another Saturday Night Live castmate, Adam Sandler. Most notable among these are the films Grown Ups (2010) and Grown Ups 2 (2013), both of which included Spade and Sandler among the lead roles, and both of which were major box office hits.\n\nSpade hosted both the Teen Choice Awards and SpikeTV's Video Game Awards in 2003. He voiced characters on several episodes of Beavis and Butt-head and produced his own TV series Sammy in 2000. From 2002 to 2006, Spade regularly appeared in commercials for Capital One (with Nate Torrence) where he played the employee of a fictional rival company whose policy toward honoring credit card rewards (and just about everything else) is \"always no.\" In 2004, he joined the cast of 8 Simple Rules, following the death of the sitcom's star, John Ritter, for the show's third and final season.\n\nHe hosted the Comedy Central TV show The Showbiz Show with David Spade for three seasons, from September 2005 to October 2007. On the show, Spade made fun of Hollywood and celebrities in a manner similar to his old \"Hollywood Minute\" segment on SNL.[19]\n\nIn the 2006 video game The Legend of Spyro: A New Beginning, Spade provided the voice of Spyro's dragonfly companion, Sparx.[20] From 2007 to 2013, he starred as Russell Dunbar in the ensemble CBS sitcom Rules of Engagement. In 2010, he worked with TBS on a pilot for an animated series based on Joe Dirt, but it was eventually dropped.[21]\n\nIn 2014, Spade had a guest role on an episode of ABC sitcom The Goldbergs (on which George Segal, his former Just Shoot Me co-star, has a major role as \"Pops\", the protagonist's grandfather). The end credits featured an interaction between Pops and Spade's character.[22] In 2019 he started hosting a new late night show called Lights Out with David Spade on Comedy Central.[23]\n\nAwards and honors [ edit ]\n\nSpade received an Emmy nomination[24] and two Golden Globe nominations for his role as Dennis Finch on Just Shoot Me!.[25]\n\nOn September 5, 2003, Spade received a star on the Hollywood Walk of Fame.[26]\n\nPersonal life [ edit ]\n\nSpade has dated numerous actresses and celebrities, including Heather Locklear, Julie Bowen, Teri Hatcher, and Naya Rivera,[27][28] with E! News calling him \"a bachelor-era George Clooney of the comedy world\".[29]\n\nHe and former Playboy Playmate Jillian Grace have a daughter together, Harper (b. August 28, 2008).[30][31][32]\n\nSpade has stated he prefers to keep his political views private, stating that it can \"alienate half [his] audience\". [33] He did however mock Barack Obama's decision to appear on a GQ magazine cover, opining \"I thought a president should have a little more dignity.\"[34] He has also defended Donald Trump against liberal comedian's jokes, saying that \"If you are funny you are supposed to be able to find something else funny.\"[35]\n\nOn November 29, 2000, Spade was attacked by his assistant David Warren \"Skippy\" Malloy while he was sleeping. Malloy physically attacked him and used a stun gun on him after breaking into Spade's home in the early morning. Spade managed to get out of the 350-pound Malloy's attack and defended himself by locking himself in a bathroom armed with a shotgun. Malloy pleaded guilty and avoided jail time on condition he seek counseling for drug and psychological problems. He subsequently received five years probation, was ordered to stay at least 100 yards from Spade and perform 480 hours of community service.[36][37][38][39]\n\nIn December 2005, Spade donated $100,000 to the police department of Phoenix, which provided firearms for the officers.[40] Spade also donated $200,000 for the Oklahoma tornado relief program on May 20, 2013, $100,000 toward the ALS ice bucket challenge in 2014, and $100,000 to the National Alliance on Mental Illness (NAMI) in June 2018 after the suicide of his sister-in-law Kate Spade, a fashion designer.[41]\n\nSpade resides in Beverly Hills, California.[42] His house was burglarized in June 2017.[42]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nMusic videos [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/4/40/David_Spade2_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/David_Spade2_%28cropped%29.jpg/220px-David_Spade2_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/David_Spade_1_%28cropped%29.jpg/220px-David_Spade_1_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/40/David_Spade2_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/David_Spade", "title": "David Spade", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/4/40/David_Spade2_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}