{"url": "https://people.com/tv/why-bachelor-fans-are-obsessed-ashley-iaconetti-jared-haibon/", "text": "Who’s ugly-crying now? We are.\n\nOn Tuesday, Ashley Iaconetti and Jared Haibon publicly announced that after meeting three summers ago on Bachelor in Paradise, they’re finally an item — and Bachelor Nation collectively lost it. From diehard fans to reluctant ones, all were united in their joy that these two reality stars, seemingly against all odds, finally found a way to make it work.\n\nGet push notifications with news, features and more.\n\n“Um. Ok so here’s the thing, I watch the Bachelor franchise, it’s my biggest weakness of character,” tweeted one fan. “And normally it’s just funny and ridiculous and a good laugh/feminist nightmare watching the bulls—. BUT ASHLEY I AND JARED ARE TOGETHER AND I AM LEGIT ECSTATIC ABOUT IT.”\n\n“I like to think I’m not Bachelor trash but then again I just saw that Ashley I and Jared are finally dating and started crying so,” tweeted another.\n\n“Me: Love is dead. Everyone’s getting divorced. What’s the point. Me after watching Jared & Ashley’s ‘The Story of Us’: Wow. Love is so alive. Can’t wait to fall in love and be happy forever,” tweeted another.\n\n“Ashley I. And Jared are finally dating and honestly if that doesn’t prove that true love is worth waiting for, then idk what does,” tweeted another.\n\nWant to keep up with the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nAnd the tweets kept coming. So why exactly are fans so obsessed with this particular pair? Because for as long as we’ve been watching them on TV, it seemed like they were doomed to fail.\n\nThe couple met on season 2 of BIP in 2015 — and as viewers are well aware, it was pretty much love at first sight for Iaconetti. But while they went on dates (even an overnight one!), Haibon wasn’t quite as enamored.\n\nImage zoom Ashley Iaconetti and Jared Haibon on Bachelor in Paradise season 2 (2015) Rick Rowell/ABC/Getty\n\nImage zoom Ashley Iaconetti and Jared Haibon on Bachelor in Paradise season 2 (2015) Rick Rowell/ABC/Getty\n\nThe result? A seemingly endless flow of tears from Iaconetti, who developed a reputation for sobbing in confessionals over her unrequited love.\n\nNevertheless, the two remained friends even after things didn’t work out — and viewers could hardly believe their eyes when they learned that the pair would both return for season 3 of BIP the following year. But if you thought things would be different this time, think again.\n\nFor yet another summer, fans watched Iaconetti pine over Haibon, unapologetically sabotaging his chances with fellow contestant Caila Quinn. But still, Haibon resisted Iaconetti’s advances, and it seemed all but obvious that these two would never work out.\n\nRELATED VIDEO: Ashley Iaconetti Explains Why She ‘Friend Zoned’ Former Bachelor Ben Higgins\n\nFinally, Iaconetti decided it was time to move on. In late 2017, she jetted off to filmanother ABC spinoff, The Bachelor Winter Games, where she met Kevin Wendt. The two started dating — just as Haibon had begun to realize that maybe what he was looking for had been in front of him all along.\n\nThe giddy duo recapped their journey for fans in a tear-filled episode of Iaconetti’s show The Story of Us, and Haibon admitted Iaconetti’s new relationship felt like “a kick in the a—.”\n\n“I remember I heard rumors that she might have met somebody, and I was sad,” he said. “Sometimes I need a kick in the a—. That was a big kick in the a—.”\n\nAfter production on Winter Games wrapped, Haibon and Iaconetti reunited for a formerly planned vacation to St. Lucia with Iaconetti’s sister Lauren and Bachelor alums Tanner Tolbert and Jade Roper in January.\n\n“Going into St. Lucia, I did a lot of self-reflection … trying to figure out what I want, what I should do, if I should do anything,” Haibon said of weighing whether or not to tell Iaconetti about his feelings for her. “It’s so unfair for me to say anything. Ashley goes on a show, finds another guy and now I’m gonna say something? What kind of a—hole does that?”\n\nEventually, however, he decided to come clean — and took a page right out of a romantic comedy when he planted a kiss on Iaconetti just as she was about to board her flight home.\n\nBut even after sharing a romantic smooch at the airport, Iaconetti wanted to give her relationship with Wendt a fair shot.\n\n“I thought ‘Okay, well that’s everything I’ve ever wanted, but I’m definitely gonna continue dating this other guy,’ ” she said. “I do like him. He’s pursued me … he’s been all in the entire time and I deserve to pursue somebody else and for somebody else to pursue me after all this time.”\n\nRELATED: Ashley Iaconetti’s Ex Kevin Wendt Congratulates Her and Jared Haibon: ‘You Deserve It’\n\nAs Winter Games was airing, however, Iaconetti knew her relationship with Wendt was over, and she called it quits in early March.\n\n“I just knew in my heart at that point that it wasn’t right with Kevin,” she said. “I ended the relationship because it had run its course — and then Jared was still there.”\n\nAnd the rest is history. Looks like fairytales do come true, after all!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-21-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-21-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-11-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-21-2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/why-bachelor-fans-are-obsessed-ashley-iaconetti-jared-haibon/", "title": "Why Bachelor Fans Are So Obsessed with Ashley Iaconetti and Jared Haibon's Long-Awaited Romance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ashley Iaconetti,Bachelor in Paradise,Couples,Jared Haibon,News,TV", "news_keywords": "Ashley Iaconetti,Bachelor in Paradise,Couples,Jared Haibon,News,TV", "description": "After meeting three summers ago on TV, they're finally an item — and Bachelor Nation can't handle it", "og": {"title": "Why Bachelor Fans Are So Obsessed with Ashley Iaconetti and Jared Haibon's Long-Awaited Romance", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/why-bachelor-fans-are-obsessed-ashley-iaconetti-jared-haibon/", "description": "Who’s ugly-crying now? We are. On Tuesday, Ashley Iaconetti and Jared Haibon&nbsp;publicly announced that after meeting three summers ago on&nbsp;Bachelor in Paradise, they’re finally an&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-21-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/why-bachelor-fans-are-obsessed-ashley-iaconetti-jared-haibon/", "description": "After meeting three summers ago on TV, they're finally an item — and Bachelor Nation can't handle it", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-21-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/why-bachelor-fans-are-obsessed-ashley-iaconetti-jared-haibon/", "title": "Why Bachelor Fans Are So Obsessed with Ashley Iaconetti and Jared Haibon's Long-Awaited Romance", "description": "After meeting three summers ago on TV, they're finally an item — and Bachelor Nation can't handle it", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fashley-iaconetti-21-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/87t2QmKwmqI"], "publish_date": null, "source": "https://people.com", "summary": ""}