{"url": "apnews.com/fbe4b160181b4122b3c83335255864da", "text": "FILE - In this May 10, 2018 file photo, singer and fashion icon Rihanna appears at an event to promote her new lingerie brand in New York. The singer will present her Savage x Fenty line of lingerie, undies and intimate accessories with an \"immersive experience\" during Fashion Week in New York. (AP Photo/John Carucci, File)\n\nFILE - In this May 10, 2018 file photo, singer and fashion icon Rihanna appears at an event to promote her new lingerie brand in New York. The singer will present her Savage x Fenty line of lingerie, undies and intimate accessories with an \"immersive experience\" during Fashion Week in New York. (AP Photo/John Carucci, File)\n\nNEW YORK (AP) — The French luxury house Longchamp will be there for the first time. So will Studio One Eighty Nine, the Ghana-based artisan initiative co-founded by actress Rosario Dawson. Look for Rihanna, but don’t look for Victoria Beckham or Alexander Wang.\n\nThere’s a never-ending churn to New York Fashion Week and its packed schedule of more than 200 September shows and other events is no different.\n\nHere’s a rundown of who will be there, who won’t and other highlights:\n\nRIHANNA’S A YES\n\nThe superstar’s size-inclusive Savage x Fenty line of lingerie, undies and intimate accessories will close eight days of fashion with an “immersive experience” the night of Sept. 12 in Brooklyn, because the fashion horde loves a good schlep to Brooklyn.\n\nNo matter. It’s Rihanna after all.\n\nShe debuted the line in May with sizes ranging up to size 44DD in bras and 3XL in apparel. The latest will be available for immediate purchase on SavageX.com. Pop-ups in New York, Minnesota’s Mall of America and elsewhere are planned.\n\nNEW ARRIVALS\n\nThe family-owned Longchamp is having its cake and eating it, too, as the company marks 70 years in business with its first full-scale runway show in New York. It was a big American-themed year for the house with the opening of a Fifth Avenue flagship store, a collaboration with Shayne Oliver and Kendall Jenner as its new face.\n\nLongchamp will also celebrate in Paris with a September event at the Opera Garnier, according to a company statement, as it has expanded in recent years from leather goods into ready-to-wear apparel.\n\n“Longchamp has always acted on intuition — something we can allow ourselves to do because we are independent — and we chose New York as we are inspired by the energy and freedom of the city,” the company said.\n\nWas Self Portrait similarly inspired as it landed on the New York schedule, or was it the London-based company’s higher profile due to one particularly famous fan, Meghan the Duchess of Sussex?\n\nThe duchess wore a black-and-white dress from Self Portrait for her first go-around at Queen Elizabeth’s annual Christmas lunch, before the wedding. The midi dress with a black lace top and pink and white details sold out quickly.\n\nDawson’s Studio One Eighty Nine will also be on hand. It already has a store in New York, along with one in Accra, and a slew of awards. They include the prestigious Council of Fashion Designers of America Lexus Sustainable Fashion Initiative Award. The company has a manufacturing facility in Accra and supports artisan communities in Africa specializing in indigo, hand-batik and kente weaving. It supports initiatives aimed at empowering women, job programs and educational opportunities in the industry.\n\nWHO WON’T BE THERE\n\nVictoria Beckham is celebrating 10 years in business and has decamped to London, where she’ll show at the fashion week immediately following New York. The Brit built her empire in New York and her company remains based here.\n\nVera Wang has been off the fashion week hamster wheel for a while, as has Kanye West. And Philipp Plein? He polished up a huge spaceship for a wintry splash of a February show in New York after leaving Milan but has not yet spoken about future extravaganzas here.\n\nAs for Wang, he generated a lot of buzz earlier this year by announcing he would dump fashion week schedules altogether, choosing to show in June and December rather than participate in New York’s weeks in February and September. The idea is to shorten the time consumers need to wait between reveal and store delivery, from six months to four. Other brands have followed suit.\n\nKATE SPADE NEW YORK\n\nSpade, the co-founder and former co-owner of the company with husband Andy Spade, killed herself in June. She and Spade created their first handbag line in 1993 and sold off bits of the company starting in 1999, cashing out completely in 2006. But the brand lives on and this will be its first runway show and the first time at fashion week since the loss of its namesake.\n\nThe show will be staged at the ornate main branch of the New York Public Library and will be the introduction of new designer Nicola Glass. A tribute was expected.\n\nWHO’S BACK\n\nLos Angeles sisters Kate and Laura Mulleavy headed off to Paris couture week last year, but they announced on Instagram in July they’d be returning to the New York ready-to-wear schedule in September to debut their latest.\n\nAnother returnee: New York-based Proenza Schouler. The design duo Jack McCollough and Lazaro Hernandez showed in Paris for two seasons but took to Instagram in June to say they’d be back at New York Fashion Week, where it all began, come September.\n\n“NY will always be home,” the two said in the post. “Paris was an amazing opportunity to show what we do to a completely different audience that had never been able to attend a Proenza Schouler show and on that level, as well as on a creative level, it felt really right.”\n\nTHE CURVY CON\n\nCoinciding with fashion week is a three-day convention (Sept. 6-8) celebrating the plus-size community. This time, Gabourey Sidibe will be the keynote speaker at The Curvy Con, now in its fourth year. Also on hand: The WWE and “Total Divas” stars Brie Bella, Nikki Bella and Nia Jax will be on a panel to discuss body positivity.\n\nThe retail chain Loft is hosting a shop-able fashion show. The company launched plus sizing (up to 26) for online purchase in February. They’ll begin to roll out plus offerings in stores Sept. 4. The Loft will include five attendees of The Curvy Con (TheCurvyCon.com) among its walkers for the runway show.", "images": ["https://storage.googleapis.com/afs-prod/media/media:85fb69ccc15f4362b4e17d32a8e8c462/2736.jpeg", "http://apnews.com/en_badge_web_generic.png", "https://sb.scorecardresearch.com/p?c1=2&c2=3005041&cv=2.0&cj=1"], "top_img": "https://storage.googleapis.com/afs-prod/media/media:85fb69ccc15f4362b4e17d32a8e8c462/2736.jpeg", "keywords": [], "authors": ["Leanne Italie"], "canonical_link": "https://apnews.com/fbe4b160181b4122b3c83335255864da", "title": "Rihanna’s in, Wang is out: A preview of NY Fashion Week", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "theme-color": "#dedede", "msapplication-config": "browserconfig.xml", "description": "NEW YORK (AP) — The French luxury house Longchamp will be there for the first time. So will Studio One Eighty Nine, the Ghana-based artisan initiative co-founded by actress Rosario Dawson. Look for Rihanna, but don't look for Victoria Beckham or Alexander Wang. There's a never-ending churn to New York Fashion Week and its packed schedule of more than 200 September shows and other events is no different. Here's a rundown of who will be there, who won't and other highlights: RIHANNA'S A YES", "keywords": "Ghana,Rihanna,Victoria Beckham,New York,Entertainment,North America,Rosario Dawson,Brooklyn,Fashion,Alexander Wang,New York Fashion Week", "twitter": {"card": "summary_large_image", "site": "@ap", "title": "Rihanna's in, Wang is out: A preview of NY Fashion Week", "description": "NEW YORK (AP) — The French luxury house Longchamp will be there for the first time. So will Studio One Eighty Nine, the Ghana-based artisan initiative co-founded by actress Rosario Dawson. Look for Rihanna, but don't look for Victoria Beckham or Alexander Wang. There's a never-ending churn to New York Fashion Week and its packed schedule of more than 200 September shows and other events is no different. Here's a rundown of who will be there, who won't and other highlights: RIHANNA'S A YES", "image": "https://storage.googleapis.com/afs-prod/media/media:85fb69ccc15f4362b4e17d32a8e8c462/2736.jpeg", "url": "https://apnews.com/fbe4b160181b4122b3c83335255864da"}, "og": {"title": "Rihanna's in, Wang is out: A preview of NY Fashion Week", "description": "NEW YORK (AP) — The French luxury house Longchamp will be there for the first time. So will Studio One Eighty Nine, the Ghana-based artisan initiative co-founded by actress Rosario Dawson. Look for Rihanna, but don't look for Victoria Beckham or Alexander Wang. There's a never-ending churn to New York Fashion Week and its packed schedule of more than 200 September shows and other events is no different. Here's a rundown of who will be there, who won't and other highlights: RIHANNA'S A YES", "type": "article", "url": "https://apnews.com/fbe4b160181b4122b3c83335255864da", "image": {"identifier": "https://storage.googleapis.com/afs-prod/media/media:85fb69ccc15f4362b4e17d32a8e8c462/2736.jpeg", "width": 3743, "height": 2736}, "site_name": "AP NEWS"}, "fb": {"app_id": 870613919693099, "pages": 249655421622}, "article": {"published_time": "2018-08-30T14:18:30Z", "modified_time": "2018-08-30T14:18:55Z", "section": "Ghana", "tag": "New York Fashion Week"}, "google-site-verification": "XvG-YKlyyPmG2x0J9-rdS-zI8LhL4d75ZQoccETD2qA"}, "movies": [], "publish_date": 1535638710.0, "source": "http://apnews.com", "summary": ""}