{"url": "https://abcnews.go.com/GMA/story?id=125038&page=1", "text": "June 24, 2003 -- Open just about any women's magazine and you'll find ads for anti-cellulite creams that promise to reduce the spongy, dimply, cottage cheese-looking skin that causes distress to so many women.\n\nThe products tout caffeine, retinol and the antioxidant DMAE as the special ingredients that help reduce the appearance of cellulite, which first surfaces on the hips, thighs and buttocks of millions of women during adolescence. Though excess weight and a lack of exercise can contribute to the problem, even thin women grapple with it.\n\nAccording to a study by Neutrogena, 70 percent of women have cellulite. More women have it than men, because women have thinner skin, so it shows more clearly.\n\nWrestling With Cellulite\n\nOver the years, Vivian Carlson has done everything to stay in shape: she runs, goes to the gym and eats healthily, but has had no luck in getting rid of her cellulite. At one point, she even took a dust buster to her inner thigh, hoping to suck the dimply skin away.\n\n\"I heard about the treatments they give at the spas — this wasn't so different,\" Carlson said. \"It's all suction and massage. Why spend the money on the spa treatments? I thought I was on to something.\"\n\nBut all she got for her efforts was some red skin. So Carlson avoids wearing dresses or skirts and wears a skirted bathing suit to the beach.\n\nShe's not alone, and that is why the interest in anti-cellulite creams is so strong.\n\nLinda Wells, editor-in-chief of Allure magazine, says the new products claim to help with the appearance of cellulite, and do not say that they can banish it completely\n\n\"No cream will get rid of cellulite,\" Wells said. \"And they don't really say that they do. What they say is 'help the appearance of cellulite.'\"\n\nCaffeine is in almost every cellulite-reducing product that shows any benefit, because it helps blood flow to the skin and works like a diuretic, Wells said, adding that it flushes you out.\n\n\"In removing moisture from the skin, it firms it, albeit temporarily,\" Wells said.\n\nRetinol is supposed to work by being able to penetrate the skin, exfoliate it, and increase collagen production, which makes skin thicker and hides the dimpling fat. But the question is how much is needed in the products to achieve the effects, because too much can dry out the skin and cause it to redden and peel, Wells said.\n\nOther creams boast the ingredient dimethylaminoethanol or DMAE, an antioxidant derived from fish that when combined with amino acids supposedly stimulates the muscles to contract and become firmer.\n\nNo Scientific Proof\n\nBut doctors told ABCNEWS.com there is no scientific proof that cellulite creams are effective in getting rid of cellulite or reducing its appearance.\n\nWomen who believe that they can eliminate cellulite through creams, or even weight loss, are likely to be disappointed, said Dr. Garry S. Brody, a professor of plastic surgery at the University of Southern California.\n\n\"So-called cellulite is the natural anatomic contour characteristic of many women's thighs and buttocks,\" Brody said. \"It is unrelated to weight gain or loss. There is absolutely no surgical or medical solution to women's dislike of this appearance except for the psychological self-deception of wanting to believe the ads.\"\n\nCellulite Is the Norm\n\nDr. Lisa M. Donofrio, an assistant professor of dermatology at Yale University School of Medicine, and Tulane University School of Medicine, agreed that there is no scientific proof that the creams work, and there is no concrete way to measure cellulite, either. She tells her patients that cellulite is normal, and is likely the product of genetics and hormones.\n\n\"Cellulite is a storage pattern of superficial fat,\" Donofrio said. \"Instead of fat being stored diffusely it is stored in little pockets separated by fibrous strands called septae.\"\n\nContrary to what patients have heard or read, cellulite is not the result of toxins, poor circulation or clogged lymphatics, she said. In fact, one study that compared cellulite fat to other fat found no biochemical differences. If patients really want to try something to get rid of cellulite — beyond diet and exercise — they can try the creams, but she suggests buying the inexpensive variety, and giving it eight weeks to work.\n\nOne doctor said that he has heard anecdotally from his patients that the creams help eliminate the appearance of cellulite, but there is no medical proof to back it up.\n\n\"I have never read a convincing research article that explains how anti-cellulite creams work,\" said Dr. Ron M. Shelton of the New York Aesthetic Center. \"We do know that they do not create long-lasting effects. The topical therapy must be continued to maintain the results.\"\n\nTheoretically, at least, cream ingredients such as methylxanthine — caffeine is one form of it — are chemicals that reduce fluid retention, which can make cellulite worse. But there is a lack of medical data showing that the products can be absorbed well into the fat through the skin surface, Shelton said.\n\nReaching the Fat Cells\n\nDonofrio said there have been a few small trials by cosmetic companies or physicians who are \"testing\" their own products, but she questions how the cellulite is measured.\n\nOne 1999 published study showed no improvement in cellulite for 56 women who had tried a tissue-kneading machine or aminophylline cream, one of the ingredients in current anti-cellulite creams.\n\n\"The main problem is twofold: Do these ingredients have any merit when applied topically, and at what concentration?\" Donofrio said. It is \"pretty ludicrous\" to think that a topical agent could get through multiple layers of skin and into the fat, but even if that were possible, no one has studied at what concentration it would be possible, she said.\n\nThere is also no standardized means of measuring cellulite, making it difficult to gauge whether improvement has indeed taken place, she said. Both caffeine and aminophylline, ingredients found in the creams, are dehydrating chemicals.\n\nIt is postulated that they perhaps show benefit by changing the water content of the skin overlying the fat, and change the look of that skin. But only Retin-A, which is available by prescription and is known generically as tretinoin, has been proven to do that.\n\n\"Retin-A thickens the uppermost skin cell layer — this has been scientifically proven,\" Donofrio said. \"If the skin over the cellulite is thicker, the cellulite won't 'bulge' out so much. Let's say you have a down comforter that is lumpy. It will look a lot lumpier with a thin cotton cover that it will with a thick canvas cover to camouflage it.\"\n\nThe over-the-counter alternative to Retin-A is a metabolite of tretinoin called retinol, but the concentration as which it can thicken the skin to improve cellulite — if it can at all — is unknown, she said.\n\nPerhaps the solution is simply accepting cellulite, Donofrio says.\n\n\"I like to think that in some parallel universe, somewhere, the lumpy distribution pattern of fat was picked by society to be the beautiful one, and all those with the smooth pattern were labeled as boring,\" she said.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://abcnews.go.com/GMA/null"], "top_img": "https://abcnews.go.com/GMA/null", "keywords": [], "authors": ["Abc News", "January", "Min Read"], "canonical_link": "https://abcnews.go.com/GMA/story?id=125038&page=1", "title": "Do Anti-Cellulite Creams Really Work?", "meta_data": {"keywords": "cellulite creams, healthy woman, fat", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Do Anti-Cellulite Creams Really Work?", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/GMA/story?id=125038&page=1", "title": "Do Anti-Cellulite Creams Really Work?", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2006-01-06T12:05:38Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,125038", "ipad": "abcnewsipad://link/story,125038", "googleplay": "https://abcnews.go.com/GMA/story?id=125038&page=1"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Do Anti-Cellulite Creams Really Work?", "url": "https://abcnews.go.com/GMA/story?id=125038&page=1", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,125038", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,125038", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/GMA/story?id=125038&page=1", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/GMA/story?id=125038&page=1"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}