{"url": "https://www.thedailybeast.com/relax-the-new-will-and-grace-is-woke-anti-trump-and-still-funny", "text": "We’ve seen the first three episodes of the new Will & Grace. The verdict? Calm your honey what’s this, what’s happening, what’s going on here fretting. The show isn’t ruined! In fact, it’s good. It’s really funny. It’s, well, it’s Will & Grace.\n\nAfter a dizzying number of TV revivals that fans clamored for only to reject upon finding that the fabric of what made the show so beloved was no longer there—or, worse, there but dated—nerves are high surrounding the return of any series.\n\nThat hand-wringing was fervent enough for the friction to start a fire when the Will & Grace revival was announced. Not only have multi-cam sitcoms generally gone out of favor, but the gay humor, certainly revolutionary at the time, isn’t exactly what the kids would call “woke” today. In fact, they would call it “problematic.”\n\nRelax. The new episodes are certainly more political and even a little gayer than we expected, but just as funny and nostalgic as we hoped they would be.\n\nThose worried about how the show plays in modern times will go through a real roller coaster of emotions in the first scene of next Thursday’s premiere.\n\nThe first three celebrities name-checked on the new Will & Grace—and everyone knows celebrity name-checking is 40 percent of the fun of Will & Grace—are Steven Tyler, Jon Voight, and Newt Gingrich. Two celebrities young gays probably have never heard of and a Speaker of the House who left office during the sitcom’s first season. Topical.\n\nIt happens during a game of Heads Up. That clue: “He’s a man but he ages like a lesbian.”\n\nThe next clue, however, is right on the money. Will: “She’s, ugh, don’t get me started.” Grace: “Jada Pinkett-Smith!” Bingo. Then, the first taste of how the show will handle the politics of 2017 gay and political humor. “You want to love her but she makes it impossible.” Caitlyn Jenner! “Rich hostage.” Melania?\n\nNow that we’ve been reintroduced to Will and Grace and reassured that the celebrity jabs will be as biting and as utterly random as ever, we pan to Jack (Sean Hayes), who’s swiping through Grindr, and Karen (Megan Mullally), who is in a medicated stupor that she comes out of to address the two big elephants in the room: Just how directly with the show go after Trump, and how in the hell are they going to explain away the events of the series finale, which saw Will and Grace respectively married, with grown children, and estranged?\n\n“What’s going on, what’s happening, who won the election?” Karen chirps, her voice as gratingly high as ever, like music to our ears. “Your guy,” Grace harrumphs, settling point one.\n\nKaren mentions a dream she had that Will and Grace were married. “We were, but we’re single now.” What about the children they had that grew up and married each other? “Never happened.” And just like that, the finale is erased.\n\n“What a relief. No one wants to see you raise kids,” Karen says. “What would be funny about that?” Jack adds, a meta reference to creators Max Mutchnick and David Kohan’s insistence that no fan of Will & Grace wants to see a revival that betrays the fiber of the original run’s magic: the four lead characters hanging out and being hilarious with each other.\n\nOf course, the finale weirdness is but one concern fans had about the revival. Since the return of the series was announced, and likely owed to the fact that it followed last fall’s election-themed reunion short, the press has demanded to know how preachy the new episodes will be when it comes to politics.\n\nAt a time when all shows must “say something,” what will Will & Grace’s agenda be? This is, after all, a show that Joe Biden once credited with moving Americans toward accepting same-sex marriage.\n\nSo how political is it? Well, let’s just say that halfway into the premiere, Grace and Karen are in Trump’s Oval Office while Jack and Will are being hit on by a gay secret serviceman on the White House lawn.\n\nAdmittedly more than the other two episodes we watched, and maybe because it was the “first” and the writers felt compelled to, next week’s premiere leans heavy on not just Trump jokes, but also the urgency for people to be social activists. (Of course, that cleverly includes Grace being too lazy and selfish to actually be active.)\n\nWill is writing letters to his congressman. Karen is rubbing Trump’s win in Grace’s face, screaming, “Lock her up!” anytime Grace wears something ugly. This is still Will & Grace, though. Fart jokes and “fake news” exist in the same sentence.\n\nWe grilled Mutchnick and Kohan about whether the show will be “woke” when we talked to them over the summer, and they acknowledged that they “know that word” and “just put it in the script.” Now we know what that joke was. Honestly? It’s pretty good.\n\n“I am so impressed. You are so woke,” Grace tells Will. “I used to be woke. Now I use my pussy hat to sneak candy into the movies.” Cue laugh track.\n\nYes, that laugh track is there—well, it's a studio audience, laughing dutifully—and it’s loud. That might be the most jarring part of the revival.\n\nLaugh breaks are so rare these days (though, interestingly, still used on TV's most watched comedy, The Big Bang Theory) that they are considered the first clue that you’re watching something that might be anachronistic, with the canned guffaws thought to telegraph a kind of humor that’s cheaper or not as intelligent as what’s on single-cam comedies. We refute that, but it’s still the generalization.\n\nThat’s kind of the best part of this revival, though. The comedy’s still broad, and sometimes extremely corny. (Sean Hayes is acting in this, folks. It’s not subtle, bless him.) There are spit takes and goofy, occasionally groan-worthy physical comedy bits. In other words, it feels like the same show, which is comforting, if stylistically initially upsetting.\n\nThe pop culture references still fly by at whiplash pace—Ryans both Reyonlds and Gosling, Anderson Cooper, Shonda Rhimes and Scandal, the history of “power gays”—though often carrying expiration dates with them. Who knows how a Kellyanne Conway reference will play in a few years? Then again, this is also the show that fired off an artillery of Sunny von Bulow jokes a decade ago, so suffice it to say timelessness isn’t of the essence.\n\nIt’s all very nostalgic. But, just like it was then, it’s still very progressive.\n\nWe shudder at the flood of thinkpieces to come debating the show’s politics and especially its gayness. But we think the show actually might have a life raft when it comes to that latter point. Especially once the revival gets the politics-heavy first episode out of the way, it actually seems even “gayer” than before, to speak in unquantifiable terms.\n\nMost pointedly, there’s an exchange between Will and a twentysomething he begins dating played by Dear Evan Hansen’s Ben Platt in the second episode that sort of underlines the generational divide in the gay community, and also the major difference in society between when the show first aired and now.\n\nWill is shocked to learn that his younger beau had no real struggle coming out of the closet. “It’s so nice, it’s practically abuse…How is it supposed to get better if it’s always fine?” he asks. It’s sitcom simplification of a complicated conversation surrounding progress, but also bitterness in changing times and changing modes of acceptance. Nonetheless, it’s remarkable that the conversation is happening on one of the most anticipated television events of the season.\n\nBut before things get preachy, there’s an ace reference to a Dixie Carter speech from Designing Women that will light Gay Twitter on fire, as well as familiar debate over which Madonna era is the best.\n\nAnd, though we’re not going to spoil when or how, at one point “Make America Gay Again” appears as a slogan in the new episodes.\n\nSo, OK, maybe there is an agenda within the revival. That’s probably inescapable. It’d be impossible not to compare the climate surrounding the series’ return against when it premiered two decades ago.\n\nThe need to laugh? That’s always there. The need to say something while doing it? Maybe we need that as much, if not more than before. It’s poignant that it’s our old friends who are saying it.", "images": ["https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779074/author/Kevin-Fallon.jpg", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1506027853/170921-fallon-willandgrace-tease_1_lish8i", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1506027853/170921-fallon-willandgrace-tease_1_lish8i"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1506027853/170921-fallon-willandgrace-tease_1_lish8i", "keywords": [], "authors": ["Kevin Fallon", "Senior Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/relax-the-new-will-and-grace-is-woke-anti-trump-and-still-funny", "title": "Relax! The New ‘Will & Grace’ Is Woke, Anti-Trump, and Still Funny", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Relax! The New ‘Will & Grace’ Is Woke, Anti-Trump, and Still Funny", "keywords": "Donald J. Trump, NBC, Sean Hayes, Eric McCormack, Debra Messing, Megan Mullally", "og": {"title": "Relax! The New ‘Will & Grace’ Is Woke, Anti-Trump, and Still Funny", "description": "We watched the first three episodes of the ‘Will & Grace’ revival. It’s more political than expected, gayer than expected, and just as funny and nostalgic as we hoped it would be.", "url": "https://www.thedailybeast.com/relax-the-new-will-and-grace-is-woke-anti-trump-and-still-funny", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1506027853/170921-fallon-willandgrace-tease_1_lish8i"}, "description": "We watched the first three episodes of the ‘Will & Grace’ revival. It’s more political than expected, gayer than expected, and just as funny and nostalgic as we hoped it would be.", "authors": "Kevin Fallon", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-09-21T21:03:39.000Z", "author": "https://www.thedailybeast.com/authors/kevin-fallon"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@kpfallon", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1506027853/170921-fallon-willandgrace-tease_1_lish8i"}, "sailthru.date": "2017-09-21T21:03:39.000Z", "sailthru.expire_date": "2017-10-05T21:03:39.000Z", "publicationDate": 201709212103, "parsely-page": "{\"author\":\"Kevin Fallon\",\"link\":\"https://www.thedailybeast.com/relax-the-new-will-and-grace-is-woke-anti-trump-and-still-funny\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"Make America Gay Again\"},\"post_id\":\"relax-the-new-will-and-grace-is-woke-anti-trump-and-still-funny\",\"pub_date\":\"2017-09-21T21:03:39+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Donald J. Trump\",\"NBC\",\"Sean Hayes\",\"Eric McCormack\",\"Debra Messing\",\"Megan Mullally\",\"typeArticle\"],\"title\":\"Relax! The New ‘Will & Grace’ Is Woke, Anti-Trump, and Still Funny\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/tkGn3l8wdG4?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1506027819.0, "source": "https://www.thedailybeast.com", "summary": ""}