{"url": "https://www.businessinsider.com/bradley-cooper-lady-gaga-a-star-is-born-review-2018-9", "text": "Bradley Cooper and Lady Gaga make an electric combination in \"A Star Is Born.\"\n\nCooper even does his own singing the movie's songs alongside Gaga.\n\nThe movie, which Cooper also directed, definitely lives up to the hype and will be an Oscar contender.\n\n\n\nGoing all the way back to 1937, Hollywood has been in love with the rags to riches story of “A Star Is Born.”\n\nThe movie that follows the overnight success of an aspiring singer has been done by the likes of Judy Garland (in the 1954 version) and Barbara Streisand (1976), and now Lady Gaga has added her name to the roster.\n\nWe know Gaga for her incredible singing and stage persona, but for at least the rest of this year she'll also be lauded for her acting abilities. She's incredible as Ally, who is discovered by the singer-songwriter Jackson Maine (played by Bradley Cooper), who mentors her into a superstar. The two eventually also fall in love.\n\nAnd if Gaga's acting ability comes as a surprise, get ready for another — Bradley Cooper can direct (wait for it...) and sing!\n\n\"A Star Is Born,\" which opens in theaters October 5, marks the actor’s directorial debut and he crushes it as he weaves together a story filled with emotion and heartache about love, ego, stardom, and acceptance.\n\nFollowing the 1976 rock-and-roll musical version, which was nominated for four Oscars and won for best original song, the project was looking to be told once again in a modern setting. Names like Clint Eastwood were floated as a potential director, and Beyoncé, Leonardo DiCaprio, and Will Smith were all rumored to star over the years, but for the most part the project lingered in development hell. But in 2016 it was announced that Cooper had signed on to not just star but also direct and the project was on the fast track, nabbing Gaga along the way.\n\nThe movie is fueled by the chemistry between Cooper and Gaga, who performed many of the songs featured in the movie in front of live audiences. Cooper holds his own in the singing department and brings a lot of empathy to his drug and alcohol-addicted rocker character with a troubled past. But it's watching Gaga belt out the ballads with ferocious intensity that will give you goosebumps.\n\nAlong for the ride is Sam Elliott, who plays Bobby, Jackson's older brother and the one person who has looked out for him his whole life as their father was a drunk. Cooper gives Jackson a deep, twangy voice that's almost spot on to how Elliott talks, which just adds fuel to the authentic feel of the brothers' love-hate-relationship.\n\nIn the other versions of this movie, much of the focus is on the female character. But in this one, the pulse is Jackson, whose self-destructive life only brings Ally closer to him, until finally it's too much for her to handle. The last third of the movie is heart-wrenching to watch, but you can't turn away as Cooper delivers a tour-de-force performance that will certainly garner him an Oscar nomination.\n\nIn fact, there might be a lot of Oscar notice for this movie. Along with Gaga and Elliott's top-notch work, the original songs are fantastic, and the editing flawlessly delivered the fast-moving lifestyle the two main characters live.\n\nThe hype for this movie is already through the roof, and all I can say is it lives up to it.", "images": ["https://i.insider.com/5b93b2442be4ab1a2f8b552b?width=24&format=jpeg&auto=webp", "https://www.businessinsider.com/bradley-cooper-lady-gaga-a-star-is-born-review-2018-9?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5b93b2442be4ab1a2f8b552b?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b8e8713b354cd20008b5bab?width=1200&format=jpeg"], "top_img": "https://i.insider.com/5b8e8713b354cd20008b5bab?width=1200&format=jpeg", "keywords": [], "authors": ["Jason Guerrasio"], "canonical_link": "https://www.businessinsider.com/bradley-cooper-lady-gaga-a-star-is-born-review-2018-9", "title": "Bradley Cooper and Lady Gaga are electric on screen together in the Oscar-worthy 'A Star Is Born'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Bradley Cooper and Lady Gaga are electric on screen together in the Oscar-worthy 'A Star Is Born'", "date": "2018-10-05", "news_keywords": "Movies, a star is born, Lady Gaga, Bradley Cooper, Toronto International Film Festival 2018, Jason Guerrasio", "description": "A true contended during Oscar season will be \"A Star Is Born,\" starring and directed by Bradley Cooper and also starring Lady Gaga.", "author": "Jason Guerrasio", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Entertainment", "og": {"title": "Bradley Cooper and Lady Gaga are electric on screen together in the Oscar-worthy 'A Star Is Born'", "description": "A true contended during Oscar season will be \"A Star Is Born,\" starring and directed by Bradley Cooper and also starring Lady Gaga.", "type": "article", "url": "https://www.businessinsider.com/bradley-cooper-lady-gaga-a-star-is-born-review-2018-9", "image": "https://i.insider.com/5b8e8713b354cd20008b5bab?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Bradley Cooper and Lady Gaga are electric on screen together in the Oscar-worthy 'A Star Is Born'", "sailthru.date": "2018-10-05", "sailthru.tags": "Movies, a star is born, Lady Gaga, Bradley Cooper, Toronto International Film Festival 2018, Jason Guerrasio", "sailthru.description": "A true contended during Oscar season will be \"A Star Is Born,\" starring and directed by Bradley Cooper and also starring Lady Gaga.", "sailthru.author": "Jason Guerrasio", "sailthru.verticals": "thewire, thelife", "sailthru.image.full": "https://i.insider.com/5b8e870864dce819008b57db?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5b8e870864dce819008b57db?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@EntInsider"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "variant", "pfi-wider-content": "control", "back-to-top": "variant", "sticky-section-titles": "control", "post-breadcrumbs": "control", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5b93b0b664dce82f008b5aef", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": ["https://www.youtube.com/embed/nSbzyEJ8X9E"], "publish_date": 1538668800.0, "source": "https://www.businessinsider.com", "summary": ""}