{"url": "https://cornerstoneconfessions.com/2013/02/home-date-night-ideas.html", "text": "Thursday is Valentine’s Day! Can you believe it?! Yes, it’s the day Hallmark is king and restaurants are filled to the brim. If you haven’t made your reservations yet, you may be standing for hours at the door come Thursday evening. For us, knowing that Valentine’s Day is the busiest night of the year for restaurants, we have chosen to stay home this year for Valentine’s Day and keep the home-fire burning instead. Think you might want to do the same? If so, then maybe some of these at-home date night ideas may be an inspiration for you as well. After all, the cost is usually cheaper, the atmosphere is often quieter, and the intimacy has no limits…well, unless you still have kids awake. In that case, I’d just send them to bed early with a good book! 😉 Here is to a Happy Valentine’s Day!\n\nSpend the night on the living room floor. Set up the air mattress. Roast marshmallows in the fireplace. Have a picnic dinner on the floor. Make dinner together. Choose the menu and get the ingredients ahead of time, then have fun cooking, taste-testing, and eating together. Have a board game night. Choose a favorite board game and feel free to play the traditional way or with an extra romantic twist. The choice is yours. Watch a romantic movie together. Need some movie ideas? Check out this Top 25 List of Romantic Favorites. Turn your living room into a ballroom. Move the furniture out of the way, turn on the music and dance like prom night all over again. Don’t know how to dance? Rent an instructional DVD from your local library and use the night to learn together! Read a book together. It could be something as romantic as a book on marriage or a silly as a favorite picture book from your childhood. Set the mood. Think candles. Think flowers. Think multiple-courses or fondue. What would you expect to see and taste at a fancy restaurant? Try to recreate that atmosphere around your own dining table. For extra gusto you may even want to dress up in your finest attire. Woowee! Revel in wedding day memories. This one will probably mean more to us girls than our hubbies but looking at old wedding albums or watching our wedding video is a great way to rekindle the fires. Enjoy hot chocolate/tea/coffee on the back porch together. There’s nothing like sitting together in the peace and enjoyment of God’s creation to build a deeper level of communication. Get your sport on. While it may not sound very romantic to start, playing soccer in the backyard or a round of H.O.R.S.E. in front of the basketball goal does wonders for relationships. Give each other a massage. Play a video game together. I remember when Goose and I used to do this when we were first married. We loved it. I think this may be one of our choices for Thursday, no doubt! Create a campfire in the backyard or light up the grill. Roast hot dogs, wrap up in a warm blanket and just enjoy watching the fire burn. Go star gazing. Put a blanket on the ground or wrap up in sleeping bags in your backyard and just enjoy gazing at the stars. Go back and read your journals, letters, and memos from when you were dating. Have a karaoke night. Get out your favorite romantic songs and have fun lip-syncing to each other. Have a Nerf gun war. I mean seriously, how fun would it be to sneak around the house in the dark (so as not to wake up the kids) and then shoot each other?! Ha! I may have to add this one too! Order in. Have pizza or Chinese delivered but be sure to use the chopsticks Have a spa night. Think bubble bath…foot massages…the works! Put a puzzle together, then glue and frame it.\n\nCreate sugar cookies. Bake them. Decorate them. And eat them. For an added Valentine’s Day flare you could even write your own little sweetheart messages on top and exchange them. Read Song of Solomon together. Write your lifelong bucket list together. Look through your old high school yearbooks or baby photo albums together. Get artistic. Try drawing or painting each other’s portraits and then framing them! Make a list of all the places you want to visit together were money no limit. Do Mad Libs together. Create a blueprint of your dream house. Have a staring contest. Sit on the couch, hold hands, and stare each other in the eye. The first one who looks away has to do whatever the other one asks of him or her! Have a dessert cook-off. Each of you find a new dessert recipe you’d like to try, bake them side-by-side in the kitchen, and then taste test them both to see which you like better! Write a gratitude list together. Make a list of everything you are thankful for as a couple and then tell God about it! Make a video for your kids telling them about how you met! Take your hubby on a love scavenger hunt. Play with your kid’s toys after they go to bed. Seriously, how long has it been since you’ve built a Lego castle? Have dinner on your roof. Talk about something you’d never forget. Make sure the roofline isn’t too steep though. Play 50 questions. Write out 25 questions each and then ask them to each other. Go window shopping together on Pinterest or Craigslist or some other favorite online shopping haunt. Use your children’s coloring books and crayons to have a coloring contest. Choose a new hobby to try out together. For added inspiration you can always check out the World’s Longest List of Hobbies. Make the date not about you. Make something to leave on a neighbor’s porch or choose a new Compassion child to sponsor together.\n\nWant even more Valentine’s Day date night ideas? Check out my Date Night Pinterest board for many more possibilities.\n\nAnd above all these put on love, which binds everything together in perfect harmony. Colossians 3:14", "images": ["https://homeschoolplanet.idevaffiliate.com/media/banners/aff-4-300x600.png", "https://cornerstoneconfessions.com/wp-content/uploads/2016/10/Archives.png", "https://cornerstoneconfessions.com/wp-content/uploads/2013/02/Free-1-450x450.png", "https://cornerstoneconfessions.com/wp-content/uploads/2013/02/Home-Date-Night-Ideas.png", "https://secure.gravatar.com/avatar/3349411da86a3d0e47fef2949eafd238?s=48&d=mm&r=g", "https://cornerstoneconfessions.com/wp-content/uploads/2018/06/Free-Printables.png", "https://cornerstoneconfessions.com/wp-content/uploads/2016/10/Bookstore.png", "https://cornerstoneconfessions.com/wp-content/uploads/2016/02/Marriage-450x675.png", "https://cornerstoneconfessions.com/wp-content/uploads/2018/07/Free-Lesson-Tall-Ad-1.jpg", "https://cornerstoneconfessions.com/wp-content/uploads/2018/06/Kathy-Gossen.png", "https://secure.gravatar.com/avatar/b7b4da9a16278be85e4fd4461da6dae1?s=48&d=mm&r=g", "https://secure.gravatar.com/avatar/d83a8bde8256eb43ba465080cf80b56d?s=48&d=mm&r=g", "https://secure.gravatar.com/avatar/4f8a3497cc428a3aef02f44866a5a9f7?s=48&d=mm&r=g", "https://cornerstoneconfessions.com/wp-content/uploads/2016/10/Free-Downloads.png", "https://cornerstoneconfessions.com/wp-content/uploads/2013/02/Home-Date-Night-Ideas-400x223.png", "https://secure.gravatar.com/avatar/e2f9dec4bd4696534d448cda36cf87b6?s=48&d=mm&r=g", "https://secure.gravatar.com/avatar/d717ac2b23358d0b246a401a7a064f76?s=48&d=mm&r=g", "https://cornerstoneconfessions.com/wp-content/uploads/2014/05/hardbackstandingstraight-450x518.jpg"], "top_img": "https://cornerstoneconfessions.com/wp-content/uploads/2013/02/Home-Date-Night-Ideas.png", "keywords": [], "authors": ["Kathy Gossen", "Jillian", "Hi", "It'S Jilly"], "canonical_link": "https://cornerstoneconfessions.com/2013/02/home-date-night-ideas.html", "title": "40 Home Date Night Ideas for Valentine’s Day or Any Day", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"description": "Thursday is Valentine's Day!  Can you believe it?!  Yes, it's the day Hallmark is king and restaurants are filled to the brim.  If you haven't made your reservations yet, you may be standing for hours at the door come Thursday evening.  For us, knowing that Valentine's Day is the busiest night of the year for", "title": "40 Home Date Night Ideas for Valentine's Day or Any Day", "image": "https://cornerstoneconfessions.com/wp-content/uploads/2013/02/Home-Date-Night-Ideas.png", "type": "article", "url": "https://cornerstoneconfessions.com/2013/02/home-date-night-ideas.html", "site_name": "Cornerstone Confessions", "updated_time": "2016-02-01T09:07:59-06:00"}, "fb": {"app_id": 529576650555031}, "article": {"published_time": "2013-02-11T05:13:46-06:00", "modified_time": "2016-02-01T09:07:59-06:00"}, "twitter": {"title": "40 Home Date Night Ideas for Valentine's Day or Any Day", "description": "Thursday is Valentine's Day!  Can you believe it?!  Yes, it's the day Hallmark is king and restaurants are filled to the brim.  If you haven't made your reservations yet, you may be standing for hours at the door come Thursday evening.  For us, knowing that Valentine's Day is the busiest night of the year for", "image": "https://cornerstoneconfessions.com/wp-content/uploads/2013/02/Home-Date-Night-Ideas.png", "card": "summary_large_image"}, "description": "40 date night ideas you can enjoy from the comfort of your home.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "generator": "Easy Digital Downloads v2.9.22", "msapplication-TileImage": "https://cornerstoneconfessions.com/wp-content/uploads/2016/10/cropped-Favicon-Pic-270x270.png"}, "movies": [], "publish_date": 1360581226.0, "source": "https://cornerstoneconfessions.com", "summary": ""}