{"url": "https://en.wikipedia.org/wiki/Jamie_Lynn_Spears", "text": "American actress and singer\n\nJamie Lynn Marie Spears[1] (born April 4, 1991) is an American singer and actress. She is known for her role as Zoey Brooks on the Nickelodeon teen sitcom Zoey 101, in which she starred from 2005 to 2008. In July 2019, Netflix announced that Spears has been cast as a series regular in the upcoming romance drama series Sweet Magnolias.[2]\n\nSpears was born in McComb, Mississippi, and raised in Louisiana, and is the younger sister of singer Britney Spears. She became the subject of significant media attention and controversy in 2007, when she announced she was pregnant at age 16, effectively sending her career into hiatus.\n\nIn 2013, Spears launched a career in country music. She released her debut single, \"How Could I Want More\", along with her debut EP, The Journey.\n\nEarly life [ edit ]\n\nSpears was born in McComb, Mississippi, to James and Lynne Spears. Her older siblings are Bryan and Britney.[3] She attended Parklane Academy, where she was a cheerleader, and point guard of the basketball team.[4] Spears studied with tutors while filming Zoey 101 in Los Angeles.[5] She finished her education via online correspondence[6] and received her GED in February 2008 through Tangipahoa Parish School System Adult Education Center.[7]\n\nCareer [ edit ]\n\nIn February 2002, Spears made her acting debut in the Paramount Pictures drama film Crossroads which starred her sister, who portrayed the central character Lucy Wagner. Spears made a cameo, playing the younger version of Britney's character.[8] Following Crossroads, Nickelodeon cast Spears as a regular performer in the eighth season of the sketch comedy series All That.[9] The season followed a two-year hiatus of the series. Spears portrayed various roles through the two seasons she appeared in as well as herself. Spears's performance received positive reviews from critics with many complimenting her comedic timing and being a highlight of the show. Spears did not return for the series' tenth and final season to pursue other roles on the network. Spears made a guest appearance at Stars, Stripes and Skates skating gala at Madison Square Garden in September 2002.[10]\n\nIn August 2004, Spears signed a development deal with Nickelodeon in which she would star as the protagonist in her own scripted television series that would air on the network. The series went on to be titled Zoey 101 and Spears portrayed the role of Zoey Brooks. The series centered on Zoey and her friends who attend a fictional boarding school, Pacific Coast Academy (PCA). Spears recorded the series theme song, titled \"Follow Me\", which was written by her sister Britney Spears. Filmed at Pepperdine University in Malibu, California, the series premiered on January 9, 2005, the network's highest rated series premiere in over eight years. Spears won a Young Artist Award and a Nickelodeon Kids' Choice Awards for her performance.[11] Nickelodeon announced the fourth season would be the series' last season. The series finale, \"PCA Confidential\", aired on May 2, 2008. Nickelodeon issued a statement shortly after the announcement of Spears being pregnant at the age of 16 stating that the network respected Spears's decision to take responsibility and noting that its primary concern was for her well-being.[12][13]\n\nIn December 2007, Variety announced Spears had signed on to guest appear in the ABC comedy sitcom series Miss Guided, in which she played the role of the promiscuous high school student Mandy Fener in the episode \"Hot Sub\" which aired on March 20, 2008. That same year Spears voiced the role of Goldilocks in the direct-to-DVD animation film Unstable Fables: Goldilocks & 3 Bears Show. The film is the third and final installment of the Unstable Fables trilogy.\n\nFollowing Spears's move to Nashville, she began working on a country music album with a number of local music producers. On November 7, 2011, Spears held a small concert at the Rutledge in Nashville in which she performed a set of original songs.[14] On November 25, 2013, Spears released her first single \"How Could I Want More\" from her upcoming debut album.[15][16] The song debuted at number 29 on Billboard's Hot Country Songs, and at number 8 on the Country Digital Songs chart, for the week ending December 7, 2013.[17][18] Kevin Rutherford of Billboard described Spears' performance as \"sweet and innocent\" yet powerful, and suggested the song would fit right in at country radio.[19] Spears is featured on her older sister, Britney Spears's eighth studio album Britney Jean on the song \"Chillin' With You\".[20] On May 27, 2014, Spears released an EP called The Journey.[21] The EP peaked at number 5 on Billboard's Heatseekers Albums, and at number 24 on Top Country Albums. Jana Kramer recorded a song Spears co-wrote, \"I Got the Boy,\" which was released as the second single from Thirty One in 2015.[22]\n\nOn March 15, 2016, Spears performed at the Grand Ole Opry in Nashville. She was introduced by her two older siblings, Britney and Bryan, who made surprise appearances at the show.[23] On June 24, 2016, Spears released her second single, \"Sleepover.\"[24] She described the song as \"young, flirty and empowering\".[25] Spears was a presenter and a performer at Radio Disney Music Awards in April 2017.[26][27] In an episode that aired on July 13, 2018, Spears returned to Nickelodeon for the first time in over ten years as a contestant on the revived game show Double Dare, with her daughter Maddie, competing against fellow All That alumnus Josh Server and his niece.[28] She and Maddie won over $15,000 to donate to the New Orleans hospital that treated Maddie following a near-fatal ATV accident.[29]\n\nIn July 2019, Netflix announced that Spears has been cast as a series regular in the upcoming romance drama series Sweet Magnolias, which is based on the novel series by Sherryl Woods.[2] She will play young woman called Noreen Fitzgibbons, who works as a nurse and wants to build a new life after making bad choices.[30] In November 2019, Teen Vogue reported that Spears has joined the cast of a new Nickelodeon television series, which is uniting two of the channel's most iconic shows from the past: All That and Zoey 101.[31][32] She will be playing her All That character, bodyguard and bacon enthusiast called Thelma Stump.[33]\n\nOther projects [ edit ]\n\nSpears has been featured in several fashion blogs and magazines such as Seventeen, Teen, Girls' Life, Mizz and Nickelodeon Magazine.[34] Spears has appeared in commercials and print ads throughout her career. She appeared in television commercials for eKara, Pepsi and Clorox Bleach.[10] In 2018, she appeared in an advertising campaign for Kraft with daughter Maddie.[35] Spears is popular on social media and endorses products such as beauty and wellness products on Instagram.[36] She has partnered with FabFitFun,[37] KiwiCo[38] and Teami Blends.[39]\n\nPersonal life [ edit ]\n\nPregnancy [ edit ]\n\nOn December 20, 2007, in an interview with OK! magazine, Spears announced that she was pregnant by her then-boyfriend, Casey Aldridge.[40] She was 16 years old at the time. Aldridge, whom she had been dating for two years, was 18.[41] Spears gave birth to a daughter, Maddie Briann, on June 19, 2008, at Southwest Mississippi Regional Medical Center in McComb, Mississippi.[42][43][44]\n\nSpears confirmed her engagement to Aldridge in March 2008 after it was reported she was seen wearing an engagement ring.[45] In May 2008, the couple moved back to Liberty, Mississippi, and purchased a house, with Spears stating they would raise their child there.[46] Spears and Aldridge called off their engagement in March 2009,[47][48] and Spears ended the relationship and moved out in February 2010.[49] Spears and Aldridge reconciled in August 2010,[50] but ended their relationship a second time in November 2010.[51][52]\n\nThe announcement of Spears's pregnancy generated controversy, as the media was accused of using the story to \"glamorize\" teenage pregnancy.[53][54] Some teens were disappointed with the contrast between Spears's on-screen personality as a \"good girl\" and her real life pregnancy.[55] On June 4, 2008, while in Amite County, Mississippi, the Spears family filed a complaint against Edwin Merrino, a paparazzo who, they believed, was following and stalking the couple. Merrino denied the allegation. He was released later in the day after posting a $1,096 bond.[56]\n\nMarriage and family [ edit ]\n\nShe subsequently began a relationship with Jamie Watson, a businessman who owns communications service Advanced Media Partners. After two years of on and off dating, they announced their engagement in March 2013.[57][58] On March 14, 2014, she married Watson in New Orleans.[59] On April 11, 2018, Spears gave birth to her second child, a daughter, Ivey Joan.[60][61]\n\nFilmography [ edit ]\n\nFilms [ edit ]\n\nTelevision [ edit ]\n\nDiscography [ edit ]\n\nExtended plays [ edit ]\n\nSingles [ edit ]\n\nOther appearances [ edit ]\n\nMusic videos [ edit ]\n\nTitle Year Director Ref. \"How Could I Want More\" 2013 Matthew Underwood [69]\n\nAwards and nominations [ edit ]\n\nNotes [ edit ]\n\nNotes\n\nA ^ Billboard Hot 100, but peaked at number 18 on the Bubbling Under Hot 100 Singles chart.", "images": ["https://upload.wikimedia.org/wikipedia/commons/3/3d/Jamie_Lynn_Spears.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Jamie_Lynn_Spears.jpg/220px-Jamie_Lynn_Spears.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Jamie_Lynn_Spears.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jamie_Lynn_Spears", "title": "Jamie Lynn Spears", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Jamie_Lynn_Spears.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}