{"url": "https://web.archive.org/web/20180309144220/https://www.nyfoxnews.co/michelle-obama-just-received-life-shattering-news-from-the-doctor/", "text": "Michelle Obama has been mostly laying low on one vacation after another since leaving the White House, only to emerge when she sees an opportunity to publicly slam President Donald Trump. A lot of questions have come up about the former first lady, starting when Barack Obama was still the president and continuing on now as the two live very separate lives. Although she’s desperately tried to hide the truth for months, a doctor has recently revealed what she has diagnosed her with which confirms our suspicions as well as our fears.\n\nMany have felt that Michelle’s behavior in the final months of being the first lady was strange, even for her, and has only gotten more alarming since the arrogant woman left the White House, but perpetually tries to remain as the center of everyone’s attention. Much of the country is happy to have her and her husband out of politics and wish that she’d slip into obscurity, but she refuses. Now we know why.\n\nMichelle’s hate for America seemed to become more obvious as the grip of power she had while her husband was president started to slip away at the end of his second term as their eviction dated neared. Every chance she got to make disparaging remarks about the country, she took, which has been a habit that’s only gotten worse in her post-presidential life. Dr. Lauren A. Wright, PhD, who is director of investor relations at NV5 Global, Inc. and a member of the White House Transition Project, shed some light on why Michelle did this as result of what she unofficially diagnosed her with.\n\nBiz Pac Review reported on the issue at the end of Obama’s administration before Trump took office:\n\nWhy is First Lady Michelle Obama suddenly appearing so many places disparaging the country in the last days of her husband’s presidency?\n\nDr. Lauren A. Wright, PhD, who is director of investor relations at NV5 Global, Inc. and a member of the White House Transition Project, recently wrote a book entitled, “On Behalf of the President: Presidential Spouses and White House Communications Strategy Today.”\n\nWright diagnosed Mrs. Obama’s recent behavior. She has become an attack dog in an effort to help Obama build his legacy as the last days of his presidency slip away.\n\n“She’s in legacy building mode. She doesn’t have to worry about the implications [of her remarks] for months to come,” Wright said. “This is the time she’s most free to say what she feels, what she believes, and what she wants the message to be for the public.”\n\nAs First Lady, Obama has given more public speeches and indulged more appearances than any First Lady in history, Wright reported in her book.\n\n“I think what surprises and upsets people most often is that first ladies give more public remarks than vice presidents, and that’s been true over the last three administrations,” she wrote.\n\nOf her biggest, and most disturbing claims she made in her campaign of hate against the country was that America is a racist nation who needed her husband in office and that she’s now suffering a feeling of “hopelessness” with Trump in office. Doubling down on that disrespectful sentiment is that she said she was never proud of America until her husband got elected to the White House. It’s ironic how Michelle says Barrack was successful in inspiring hope in the nation after everyone overwhelmingly voted Trump in, desperate for the hope his predecessor promised and failed to deliver on.\n\nThe best case of revenge was how miserably she failed at building her legacy and trying to save it in the final days, especially now, that Trump just took the final sledgehammer to her most beloved project. After her disastrous lunch program crumbled around her and even her biggest supporters were critical of the changes she made to school meals, her nemesis, Trump, came in and reversed all she had done. He then topped it off by giving kids back their chocolate milk that she had ridiculously robbed them of.\n\nDean James from America’s Freedom Fighters let loose on Michelle and her nasty claims about our country she’s more than profited off of:\n\nSo, Michelle is out there claiming that we are all racists and with Trump taking the White House the nation is in a state of hopelessness… This coming from someone who said she was never proud of America until her Muslim, racist pathetic husband was elected.\n\nHey lady, I hate to break it to you but your ‘husband’ has destroyed America and has left the entire planet in a complete state of chaos. The only reason he was elected is because he is black.\n\nThe truth of her desperate attempt to make America and President Trump look bad before she left was nothing more than a temper-tantrum by this entitled woman who knew that Trump was actually about to bring real hope back and in doing so prove what a failure his predecessor really was.", "images": ["https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-35-550x360.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-29.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-36-550x360.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-30.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-37-550x360.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-32-550x360.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-31-550x319.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-28.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-34-550x360.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-27.jpg", "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-33-550x360.jpg"], "top_img": "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-29.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180309144220/https://www.nyfoxnews.co/michelle-obama-just-received-life-shattering-news-from-the-doctor/", "title": "Michelle Obama Just Received LIFE-SHATTERING News From The Doctor", "meta_data": {"fb": {"pages": 334538640393943}, "viewport": "width=device-width, initial-scale=1", "generator": "WordPress 4.9.4", "ia": {"markup_url": "https://www.nyfoxnews.co/michelle-obama-just-received-life-shattering-news-from-the-doctor/?ia_markup=1"}, "og": {"type": "article", "title": "Michelle Obama Just Received LIFE-SHATTERING News From The Doctor", "url": "https://web.archive.org/web/20180309144220/https://www.nyfoxnews.co/michelle-obama-just-received-life-shattering-news-from-the-doctor/", "description": "Michelle Obama has been mostly laying low on one vacation after another since leaving the White House, only to emerge when she sees an opportunity to publicly slam President Donald Trump. A lot of …", "site_name": "NY FOX News", "image": {"identifier": "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-29.jpg", "width": 1200, "height": 630}, "locale": "en_US"}, "article": {"published_time": "2018-03-04T22:45:53+00:00", "modified_time": "2018-03-04T22:45:53+00:00"}, "twitter": {"text": {"title": "Michelle Obama Just Received LIFE-SHATTERING News From The Doctor"}, "image": "https://web.archive.org/web/20180309144220im_/https://www.nyfoxnews.co/wp-content/uploads/2018/03/1-29.jpg?w=640", "card": "summary_large_image"}}, "movies": [], "publish_date": 1520203553.0, "source": "https://web.archive.org", "summary": ""}