{"url": "https://www.mercurynews.com/2018/07/19/kendall-jenners-latest-date-night-with-ben-simmons-again-ruined-by-tinashe-reports-say/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nThere was no peace for lovebirds Kendall Jenner and Ben Simmons, even at Drake’s rollicking West Hollywood party Wednesday night, because Simmons’ ex-girlfriend Tinashe somehow keeps showing up when they’re trying to enjoy a romantic night out.\n\nThe latest incident happened Wednesday night at Delilah, the Daily Mail reported. The Vogue supermodel and her NBA star boyfriend were seen leaving the club, and they looked “tense,” possibly because Tinashe also was at the party.\n\nThis is awkward. Tinashe was, once again, at the same party as Kendall Jenner and Ben Simmons, after it was reported that Ben thought his ex was stalking him!https://t.co/s5ER5CJoeX — Luca Forzin (@Luca_Forzin) July 19, 2018\n\nTinashe’s tendency to be up at the same Los Angeles-area events — at least three times in the past month — has become problematic enough that the Philadelphia 76er has hired extra security, TMZ and other outlets have reported. TMZ said Simmons believes the “All Hands on Deck” singer has become “obsessed” with him after he dumped her for Jenner.\n\nAn insider told TMZ in early July: “Ben is convinced Tinashe cannot accept the fact he ended their relationship and has moved on with Kendall. He believes she’s showing up to keep tabs on him so she can see if there’s a chink in the armor between him and Kendall.”\n\nLast Friday, Tinashe denied being “a stalker,” writing on Instagram stories: “This narrative has to end… I’m not a character in some dumb storyline this is MY REAL LIFE.”\n\n“The fact is, I was in love and I got hurt,” she continued, according to E! News. “I know I’m not the first nor will I be the last person to be in this situation. The details of what has happened since are complicated to say the least, but I’ve never lied. And of course I’m not a stalker lol.”\n\n.@Tinashe defends herself against claims that ex-boyfriend Ben Simmons hired security because she was stalking him. Last week, Tinashe was at the same club as Simmons & new GF Kendall Jenner. She told TMZ he was texting her while there with Jenner. Simmons claimed she was lying. pic.twitter.com/qilAKw0S5b — Pop Crave (@PopCrave) July 13, 2018\n\nThe “Flame” singer’s reference to being hurt probably comes from reports that Simmons, 21, cheated on her with 22-year-old model Jenner, who also is a member of the Kardashian reality TV family.\n\nSimmons and Tinashe began dating in March and ended things in May — around the same time he and Jenner became romantically linked. Simmons and Jenner have never commented on their relationship status or the apparent cheating scandal, but a source told E! News that the two met through mutual friends and quickly developed a “close friendship” while he was still going out with Tinashe.\n\nThis wouldn’t be the first time that Jenner has been accused of coming between another woman and an NBA basketball player. Jenner previously was romantically linked to former L.A. Clippers player Blake Griffin, who was sued by his ex-fiancée Brynn Cameron for palimony, TMZ reported.\n\nCameron accused Griffin, who has since been traded to the Detroit Pistons, of leaving her and their two children for Jenner, saying he embarrassed “his family with his public fawning over Kendall Jenner,” TMZ said.\n\nThe Tinashe stalking allegations began earlier this month when she showed up at hotspot Delilah on July 5, when Simmons and Jenner also were there. She also turned up at Poppy nightclub last week when they were there.\n\nNow comes Wednesday night, when the lovebirds were back at Delilah at Drake’s party, and Tinashe showed up again, nearly a week after issuing her denial that she was a stalker. Related Articles Braless Kendall Jenner inspires cosmetic surgery trend: ‘Designer nipples’\n\nSuit dropped over Kylie and Kendall Jenner’s Tupac T-shirts\n\nKendall Jenner hits hospital before Oscars for ‘bad reaction’ to popular celebrity health treatment\n\nKendall Jenner dragged into palimony lawsuit filed by Blake Griffin’s ex-girlfriend\n\nDid Kendall Jenner spark Blake Griffin’s nasty custody battle?\n\nBut she may have had a better claim to being at Drake’s party than Simmons or Jenner, given that she and Drake collaborated on the 2015 song “On a Wave.”", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2018/07/BenSimmons.jpg?fit=620%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2018/07/Tinashe2.jpg?w=1024&h=680", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/07/Tinashe2.jpg?w=1024&h=680", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/07/19/kendall-jenners-latest-date-night-with-ben-simmons-again-ruined-by-tinashe-reports-say/", "title": "Kendall Jenner’s latest date night with Ben Simmons again ruined by Tinashe, reports say", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Tinashe recently defended reports from Ben Simmons' camp that she is 'stalking' him and Kendall Jenner because he dumped her for the Vogue model.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Kendall Jenner’s latest date night with Ben Simmons again ruined by Tinashe, reports say", "url": "https://www.mercurynews.com/2018/07/19/kendall-jenners-latest-date-night-with-ben-simmons-again-ruined-by-tinashe-reports-say/", "description": "Tinashe recently defended charges from Ben Simmons’ camp that she is ‘stalking’ him and Kendall Jenner because he dumped her for the Vogue model.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/07/Tinashe2.jpg?w=1024&h=680", "width": 1024, "height": 680}, "locale": "en_US"}, "article": {"published_time": "2018-07-19T20:08:39+00:00", "modified_time": "2018-07-20T15:03:56+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Kendall Jenner’s latest date night with Ben Simmons again ruined by Tinashe, reports say"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/07/Tinashe2.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1531929600.0, "source": "https://www.mercurynews.com", "summary": ""}