{"url": "http://isalons.biz/SerenaWilliamsBeautyHair.aspx", "text": "hair salons & barbershops i conversations\n\nTechnology Savvy Social Media engaging Industry Moguls in \"Real-Time\"\n\nI never had any doubt that Serena Williams could rock a catsuit — or even a tutu, as she did this week at the U.S. Open. And I definitely never doubted her ability to win another Grand Slam title one year — almost to the day — of becoming a mom. She is a superstar athlete who does everything with one goal in mind: winning. Perhaps that’s why, in previous years, it never crossed my mind that Serena is just like me. But as she opened up about pregnancy, her harrowing birth story and the vulnerability of motherhood, we all started to feel that way. Last week, on the eve of her return to the U.S. Open, I sat down with Williams on \"Today\" to talk about her Grand Slam goals, embracing her critics and how she works through \"mom guilt\" with the help a few million friends on social media. Do you feel joyful? Williams: You know, I feel a different joy. I've always been this joyful person, but now it's just totally different. I feel just light. I feel lighter and happier. And it's just a great feeling. Read more at: Serena Williams runs to hit a return to Carina Witthoeft during day three of the 2018 U.S.\n\nDuring the 2017 United States Open, Serena Williams, holder of 23 Grand Slam titles, was fighting for her life. She had just given birth to Alexis Olympia Ohanian Jr. by cesarean section and faced life-threatening complications from a pulmonary embolism and blood clotting. She would be bedridden for six weeks. One year later, she is back on the U.S. Open courts, attempting to tie Margaret Court’s record of 24 Grand Slam titles. Her return, which has included a run to the Wimbledon final in July, should be surprising to exactly no one. Williams has joined a league of simultaneously ordinary and extraordinary women, those who return to work after childbirth and quickly perform at a very high level. Elite athletes just have a different kind of office environment awaiting them. In 1960, two years after giving birth to her daughter, the sprinter Wilma Rudolph won three gold medals at the Rome Olympics. Sheryl Swoopes returned to the basketball court six weeks after giving birth to her son. She led the Houston Comets to the 1997 W.N.B.A. championship. The Scottish golfer Catriona Matthew won the Women’s British Open in August 2009, 10 weeks after giving birth to her second daughter. The British heptathlete Jessica Ennis-Hill gave birth to her first son in July 2014. She won gold at the world championships 13 months later. Because of a lack of scientific data, there are few studies on elite athletes who give birth and return to the highest levels of competition soon thereafter, said Miho Tanaka​, director of the women’s sports medicine program at Johns Hopkins. When it comes to following medical advice, these athletes must look toward individualized recommendations and their innate ability to be hyper-aware of their own bodies. Whatever attributes allow elite athletes to get to their level of fitness and bounce back from injury with greater speed can surely help them return to sport after childbirth, Tanaka said. “But what that mechanism is — whether that’s physical or mental, or both — that formula would be hard to translate.” Cordelia Carter, director of the Women’s Sports Medicine Center at N.Y.U. Langone Health, said Williams had an uncomplicated pregnancy but a very complicated postpartum period, and she continues to achieve above and beyond what many, rightly or wrongly, thought was possible. “So looking at her, we don’t yet know our limits, which is powerful,” she said. Read more at: Serena Williams. New Mom. Elite Athlete. Extraordinary and Ordinary All at Once.\n\nAccompanied by her husband, Reddit co-founder Alexis Ohanian, the tennis superstar made her grand entrance rocking an asymmetrical pink Versace dress, matching pink hat, Bulgari necklace and long braids. Williams shared live Instagram updates of herself and Ohanian getting ready throughout the morning, giving fans sneak peaks of her outfit and poking fun at her husband’s high-waisted trousers. “Hey y’all, so my friend’s getting married,” she gushed over Markle. “I’m up super early—well, for me. I’ve known her for so many years and I’m so happy for her.” Williams and Markle have been friends since meeting at the 2010 Super Bowl in Miami. “I just think it’s so important to enjoy the moment,” Williams recently told Good Morning America of Markle’s big day. “And eat the cake—I didn’t get to eat mine at the wedding. We were just having so much fun!” Read more at: Serena Williams has officially arrived at Windsor Castle\n\nAs I’m writing the introduction to this story, the news breaks that Serena Williams has pulled out of the French Open with a pectoral injury. She’s getting an MRI, and the prognosis is uncertain: Williams could be OK in two weeks, or she might not be better in time for Wimbledon, which starts soon. Sports injuries—and in Williams’s case, tightly calibrated comebacks (after the birth of her daughter, Alexis Olympia, last year)—can turn on a dime. But that’s what badasses do; they keep at it. And Williams, of course, has badass in her bones. She first picked up a racket when she was 3 and has been serving, literally, ever since. Men’s champion Roger Federer recently called her the greatest player of all time. I caught up with Williams earlier in the summer, when she was in New York promoting her HBO documentary, Being Serena. She was resplendent in a tropical-print Gucci coat, eating quite the oddest collection of food I’d ever seen on one plate (crab ... and cake). Because, yes, she is a champion, a mother, a wife, and an inspiration, but Serena is really ... Serena. Read more at: Creating the life of a parent within the legend of a champion\n\nLB: So as you’re the first cover of the Badass issue, what are your tips for being a badass woman? SW: You have to be confident. Someone who’s a badass is incredibly confident and unapologetically herself. And she doesn’t care what anyone else says—but in a positive, not a negative, way. It’s more like standing up for yourself and others. The whole #MeToo movement, those women are badass. They’re not afraid to say what’s wrong and what affected them. LB: When is the first time you remember being unapologetic? SW: That’s a good question. I don’t know. It took me a while because I’ve faced so much criticism, whether it was about my body or something else—it was always something. I always felt like I had to be softer or apologize, kind of indirectly, for who I am. And I don’t know when it happened, but something changed. I just became who I am and realized there’s nothing wrong with me. I understand who I am. I’m the most impatient person [laughs]. I’m like, “Now, now, now, now, now!” So I know there’s some room for improvement. LB: What would you say to girls who don’t really feel they have a voice? How would you tell them to be a badass in their family and their community? SW: Being a girl is not easy—in some areas especially. You have to be really brave. And I realize I am saying this from the United States, so I have an opportunity to speak more than the next person—I’m saying that with the understanding that maybe they can’t. It’s really just about being aware and educating yourself so you can help other people be aware. Once you do that, even if you reach one person, that’s more than none. Read more at: Serena Williams' The Number 1\n\nAs I’m writing the introduction to this story, the news breaks that Serena Williams has pulled out of the French Open with a pectoral injury. She’s getting an MRI, and the prognosis is uncertain: Williams could be OK in two weeks, or she might not be better in time for Wimbledon, which starts soon. Sports injuries—and in Williams’s case, tightly calibrated comebacks (after the birth of her daughter, Alexis Olympia, last year)—can turn on a dime. But that’s what badasses do; they keep at it. And Williams, of course, has badass in her bones. She first picked up a racket when she was 3 and has been serving, literally, ever since. Men’s champion Roger Federer recently called her the greatest player of all time. I caught up with Williams earlier in the summer, when she was in New York promoting her HBO documentary, Being Serena. She was resplendent in a tropical-print Gucci coat, eating quite the oddest collection of food I’d ever seen on one plate (crab ... and cake). Because, yes, she is a champion, a mother, a wife, and an inspiration, but Serena is really ... Serena. Read more at: Serena Williams' Creating the life of a parent within the legend of a champion\n\nGlamorous, eye-catching, elegant—the up-do checks all of the boxes for the perfect look for the Glamour's 2017 Women of the Year Awards, and thus holiday party style. While most intricate up-dos are reserved for those with advanced skills, this Vernon François creation, which he referred to as a \"ponytail for the Queen,\" isn't hard to recreate. The celebrity hairstylist, whose clients include Serena, Lupita Nyong'o, Willow Smith and Amandla Stenberg, used the Leave-In Conditioner and Hydration Mist from his namesake line, as well as Paul Mitchell, Got2b and Color Wow to complete the sleek-to-voluminous style. However, the epic nature of the hairstyle is a result of the gold accents, combined with height and length of the ponytail The best part: It's super easy to recreate no matter the texture or state of your hair. If you don't have super long hair, don't worry. You can add in extensions or keep it short. Want to try it at home? PRIV hairstylist Liana Dil broke down the style into simple steps you can do minutes before your next holiday party. Check out the steps below! Step 1 Apply dry shampoo or texturizing spray to give hair more grit and texture, and rid excess oil. Step 2 Using a boar bristle brush, smooth hair into a high ponytail and secure with an hair band. Read more at: Serena William's Regal Ponytail Is Easier Than You Think to Recreate\n\nTreat them the way you would your real hair. Treat them the way you would your real hair. “Naturally textured virgin hair extensions should be treated and cared for the same way you’d treat your own natural hair. Regularly washing, moisturizing and detangling your textured hair extensions is key to extending the life of the hair,” advises Opara. Dry your hair well. Dry your hair well. Hair that hasn’t been dried properly can lead to scalp issues, including fungal ones. So if you have thick hair, be sure to clip your hair in sections and dry your braided sections thoroughly. Don’ t neglect your real hair. Don’t neglect your real hair. “Hair that hasn’t been maintained under a weave may begin to suffer from breakage or matting when the extensions are removed,” warns Pitters. Remove them in a timely fashion. Remove them in a timely fashion. Extensions will damage your hair if left in too long. Pitters recommends redoing interlock sew-ins every 6 weeks and the braided sew-in version every 8 to 10 weeks. Avoid oils. Avoid oils. If you have glue-on bonded extensions, oils will break down the extension glue. And that is something that you don’t want to happen until you are ready to remove your pieces. Take a break now and then. Take a break now and then. Allow your natural hair and scalp to breathe from time to time. Relieve the stress placed on your hair and scalp by waiting a week or two after removal of your extensions before getting them replaced. Read more at: How to Maintain Flawless Hair Extensions\n\nWilliams is in planning mode. A fifties-themed baby shower (she loves a theme party, or any excuse to get into costume, really) is in the works. There is the bachelorette party—maybe the islands, maybe Las Vegas, maybe both—and, one of these days, the wedding itself. But most of her energy is directed at preparing the nursery. Williams, a Francophile who keeps an apartment in Paris, is looking for a baby nurse who speaks French and just found a wall hanging of a medieval French poem by Charles d’Orléans for the room. “Alexis thinks we’re having a boy, but I have a strong suspicion that it’s a girl,” she says. “Two weeks after we found out, I played the Australian Open. I told Alexis it has to be a girl because there I was playing in 100-degree weather, and that baby never gave me any trouble. Ride or die. Women are tough that way.” Read more at: Serena Williams on Pregnancy, Power, and Coming Back to Center Court", "images": ["http://iconversations.biz/images/serena-willimas-vanity-fair-pregnancy-cover800.jpg", "http://isalons.biz/WebResource.axd?d=eA4uw8okQ_zWFsFlNUSjK8vtz2x0iN0d7eWKvPIfStOir0jhyMXblVEVkGGNxEsockTk8utLdiJTCWx3KrvZO5Yx-hw1&t=636284489597151108", "http://iconversations.biz/images/serena-williams-us-open-tutu-ew800i.jpg", "http://iconversations.biz/images/Serena-Williams-Alexis-Olympia-Ohanian-Baby800.jpg", "http://iconversations.biz/images/serena-williams-0800i.jpg", "http://iconversations.biz/images/server-world100.jpg", "http://iconversations.biz/images/mark-seliger-oscars-portrait-studio-serena-williams768.jpg", "http://iconversations.biz/images/Serena-Williams-Holiday-Hair.jpg", "http://iconversations.biz/images/serena-williams-vogue-september-2017n800.jpg", "http://iconversations.biz/images/serena-williams-tennis-nails768i.jpg", "http://iconversations.biz/images/african-american-long-hair700.jpg", "http://iconversations.biz/images/serena williams royal wedding braids800.jpg", "http://iconversations.biz/images/serena-williams-on-the-cover-of-instyle-magazine-discusses-motherhood-tennis800.jpg", "http://iconversations.biz/images/facebook_16x16i.jpg", "http://iconversations.biz/images/serena-williams-alexis-royal-wedding.jpg", "http://iconversations.biz/images/serena-article-hero800.jpg", "http://iconversations.biz/images/twitter_16x16i.jpg", "http://badges.instagram.com/static/images/ig-badge-16.png", "http://iconversations.biz/images/serena-super-nytimes800.jpg"], "top_img": "http://iconversations.biz/images/serena-williams-0800i.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Serena Williams' Regal Ponytail Is Easier Than You Think to Recreate", "meta_data": {"keywords": "Conversations Social Media, @eonline, love, romance, hair salons, black hair salons, pedicure, black barbershops, barbershops, hair, barbers, conversations, @iconversations, wynton marsalis, jlco, bath body, dayspas, beauty shops, nba, nfl, comedy, \r\njimmy fallon, @jimmyfallon, Bobby Flay, Giada De Laurentiis, lebron james, @kingjames, @todayshow, today show, nbc, the ring maker, Gabrielle Union, Dwyane Wade, miami heat, @miamiheat, jazz, quincy jones, herbie hancock, music, cory booker, @mcdonalds, mcdonalds, giada de laurentiis, richard ingram,\r\n    cuisine, food, mike bloomberg"}, "movies": [], "publish_date": null, "source": "http://isalons.biz", "summary": ""}