{"url": "https://www.harpersbazaar.com/celebrity/latest/a21238827/who-is-hilary-duff-boyfriend-matthew-koma/", "text": "Congrats are in order for Hilary Duff and Matthew Koma, who just announced their engagement on Instagram. The couple are parents to six-month-old daughter Banks Violet Bair, who is a little sister to Duff's seven-year-old son Luca Cruz Comrie with ex-husband Mike Comrie. Duff and Koma have been dating for more than a year. Here's everything you need to know about the actress's fiancé.\n\nHe just became a dad for the first time.\n\nKoma and Duff welcomed a daughter named Banks Violet Bair on October 25, 2018, he announced on Instagram with a heartwarming family photo. \"We welcome a beautiful daughter, little sister, and best friend for life. Could not possibly be more grateful for our growing family and for the 🍊 who makes it all possible. Cloud ten,\" he wrote.\n\nHe's a singer and songwriter.\n\nKoma started writing music at the age of nine and scored a publishing deal at the tender age of 16, according to his bio on All Music. He was then signed him to Interscope Records after being noticed by record producer Jimmy Iovine. Since then, he's released two EPs.\n\nHe's had two number one singles on the US Dance Clubs Chart.\n\nKoma was a featured vocalist on two songs with DJ and record producer Zedd: \"Spectrum\" and \"Find You.\"\n\nHe's an EDM star.\n\nIn 2014, Complex reported on the then-up-and-coming Koma, writing: \"You will probably hear at least 14 songs by Matthew Koma at the next dance music festival you attend.\" Koma has worked with DJs like Tiësto, Afrojack, and Alesso.\n\nHe co-produced Shania Twain's latest album.\n\nNow, Twain's first album in 15 years, was co-produced by Koma, Twain, and three others. The album went to #1 on the Billboard 200 Albums Chart.\n\n\n\nMatthew Koma isn't his birth name.\n\nLike many artists before him, Koma decided to use a stage name for he work. He was born Matthew Bair in 1987.\n\nA song he wrote won a Grammy.\n\nKoma co-wrote the song \"Clarity\" with frequent collaborator Zedd and it won the Grammy for Best Dance Recording at the 2014 Grammy Awards. Unfortunately, he wasn't eligible to receive a Grammy for his work, as Grammys for Best Dance Recording are only awarded to producers, engineers, and/or mixers associated with the nominated song, along with the recording artist.\n\nHe wrote songs for Duff's album before they started dating.\n\nDuff's fifth studio album, Breathe In. Breathe Out., was released in 2015, and Koma co-wrote the songs \"Arms Around a Memory,\" \"Confetti,\" and the title track.\n\nHe's from Long Island.\n\nKoma hails from Seaford, New York, and he got a chance to perform in his hometown when he opened for LMFAO's \"Sorry for Party Rocking\" tour at the Nassau Coliseum in 2012.\n\nThis is the couple's third time dating.\n\nThird time's the charm, isn't it? On a December 2017 appearance on The Talk, Duff confirmed that the couple was back on for the third time.\n\nShe explained, \"I think that you have history and a past with someone, and love—just because it doesn’t work out the first time, the second time, as long as there’s not too much damage done, then it can always work out again.\"", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=1xw:0.75xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "keywords": [], "authors": ["Temi Adebowale"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a21238827/who-is-hilary-duff-boyfriend-matthew-koma/", "title": "Meet Hilary Duff's Fiancé and Second Child's Father", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Everything You Need to Know About Hilary Duff's Fiancé Matthew Koma", "description": "She and the musician just got engaged.", "url": "https://www.harpersbazaar.com/celebrity/latest/a21238827/who-is-hilary-duff-boyfriend-matthew-koma/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2019-05-09 04:57:03", "published_time": "2019-05-09 04:52:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=1xw:0.75xh;center,top&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Who Is Matthew Koma? - Meet Hilary Duff's Fiancé and Second Child's Father", "description": "Hilary Duff just announced that she's engaged to Matthew Koma, that father of her daughter Banks. Here's everything to know about the musician.", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=0.66667xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,matthew koma,hilary duff", "sailthru.date": "2019-05-09T16:52:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=1xw:0.75xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-633002942-1528480635.jpg?crop=0.66667xw:1xh;center,top", "sailthru.socialtitle": "Everything You Need to Know About Hilary Duff's Fiancé Matthew Koma", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1557348720.0, "source": "https://www.harpersbazaar.com", "summary": ""}