{"url": "https://people.com/home/hgtv-star-carter-oosterhouse-sexual-misconduct-allegations/", "text": "UPDATE: In a statement to PEOPLE Friday afternoon, a spokesperson for HGTV said, “While we have not been in production with Carter Oosterhouse on an HGTV series for many years, we take matters such as this very seriously. We do not tolerate harassment of any kind.”\n\nIn a second statement, the spokesperson elaborated, “We won’t comment on the details of any specific situation, but we work alongside our independent production partners to investigate any allegations and take action where appropriate.” Carter Can was produced by High Noon Entertainment, which is behind several series on HGTV, TLC and Food Network, among others.\n\nGet push notifications with news, features and more.\n\nCarter Oosterhouse, the HGTV host and star of TLC’s Trading Spaces, has been accused of sexual misconduct by a former employee.\n\nA former makeup artist from the show, Kailey Kaminsky, told The Hollywood Reporter in an interview that she worked with Oosterhouse as his makeup artist in 2008. She alleged that he had coerced her into performing repeated oral sex acts during the show’s production.\n\nShe claimed the experiences led to her hospitalization for depression and unemployment from the show.\n\n“At that point, I was a nervous wreck. I was so worn down from his advances, so I did: that day, on that occasion,” she said, admitting she agreed to his demands after he allegedly threatened her employment. “It was the first time. Then thereafter it was almost every time we would shoot — 10 to 15 times he put me in this position.”\n\nOosterhouse, 41, who also serves as the host of ABC’s The Great Christmas Light Fight, denied anything between him and Kaminsky was not consensual. In a statement to PEOPLE, the carpenter and TV personality said he is “very passionate about what is happening right now with the #metoo movement, especially because I have so many strong women in my life, like my wife, mother, sister and of course my little baby girl. We are in a time of change for society and I am behind it 100%.”\n\nOosterhouse has been married to actress Amy Smart since 2011 and shares 11-month-old daughter Flora with her.\n\nThe HGTV star said he “had an intimate relationship with Kailey 9 years ago and it was 100% mutual and consensual. In no way did I ever feel, nor was it ever indicated to me, that Kailey was uncomfortable during out intimate relationship. I would have never done anything that I was not sure was mutually agreeable.”\n\nImage zoom Carter Oosterhouse and Amy Smart David Livingston/Getty\n\nOosterhouse claimed Kaminsky initiated their relationship the first time including “the 15 or so times we had relations thereafter.”\n\nKaminsky said the demands for oral sex came from Oosterhouse a year into her employment after he had gained fame from Trading Spaces.\n\nShe told THR he propositioned her while they were both running errands during a location shoot in his hometown of Traverse City, Michigan — which she found surprising because she said she identifies as a lesbian.\n\n“He’s like, ‘You know what would be a good idea?’ If you went down on me,’” she said. “I was shocked — it was so random. I said, in my sarcastic way, ‘Well, that’s not sexual harassment at all.’ He said, ‘I just think it would be fun.’ I made it clear that I did not think it would be fun. Still, I thought he was just goofing around.”\n\nDespite her refusals, Kaminsky told the outlet Oosterhouse continued to request oral sex from her until one day an encounter left her reeling.\n\nWhile on the way to a project site, she said, he pulled over and asked her, “’Do you enjoy your job? I said I did and in fact would like to work more, handling more of his personal appearances outside of the show. He said, ‘Well, I can help you with that. But you need to do something for me.’”\n\nKaminsky said she interpreted the conversation as affecting her livelihood, and said she agreed to a sexual relationship with him.\n\nDespite this, she told THR that there was no reciprocal physical intimacy and that “when he would assault me, he insisted on finishing on my face — every time — knowing that I had to go back out and work. I asked him about that. He said, ‘It’s just what I wanted to do.’”\n\nShe said the stress of the encounters led her to develop anxiety that caused her to be away from her job for a week.\n\n“I developed this stomach ulcer, something I’d never had before, and was hospitalized for a week,” she said. “I kept beating myself up psychologically — that I was nothing but a prostitute. And the longer this went on, the less he would allow me to do my job. If I wanted to step in and touch up his hair and powder, he would push me away.”\n\nKaminsky claimed Patrick Jager, the director Carter Can, said her absence was the reason she was replaced for the next season. She said he was unaware of the situation.\n\nOosterhouse said in a statement he “didn’t have anything to do with her not being invited back to the show — that was a producer decision. And as for the fact that she identifies as a lesbian — I didn’t know that — all I knew was that she was in a sexual relationship with another guy who worked on the show.”\n\nHe added, “It’s upsetting that she now feels this way, I only wish her the best and truly hope that she can move forward.”\n\nA year after she left the show, Kaminsky told an official at its production company about the allegations. She said Oosterhouse called her and apologized, saying, “I’m so sorry. I thought it was mutual.”\n\nOosterhouse later told THR, “I did say I thought it was mutual — because it was. I didn’t apologize because I never did anything wrong. That’s the God’s honest truth. I felt bad that she was, in that moment, not-super-positive.”\n\nThe former makeup artist told the publication she had described the encounters to two female producers on the show and “definitely went out of my way to pretend it was something that I was participating in willfully.”\n\n“It was Stockholm Syndrome-y, justifying what you’re doing,” she added.\n\nOne of the producers told the publication she thought Kaminsky’s relationship with Oosterhouse was consensual and “didn’t seem like it was abusive.”\n\nOosterhouse is slated to appear in TLC’s reboot of Trading Spaces, airing in spring 2018.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcarter-oosterhouse-amy-smart-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1645&h=861&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcarter-oosterhouse-amy-smart-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1645&h=861&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcarter-oosterhouse-amy-smart-1-2000.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/home/hgtv-star-carter-oosterhouse-sexual-misconduct-allegations/", "title": "HGTV Star Carter Oosterhouse Accused of Sexual Misconduct", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "HGTV,Home Decor,Home Design,News,Sexual Assault,Sexual Harassment,TV Watch", "news_keywords": "HGTV,Home Decor,Home Design,News,Sexual Assault,Sexual Harassment,TV Watch", "description": "Carter Oosterhouse, the host of ABC's The Great Christmas Light Fight, has been accused of sexual misconduct by a former makeup artist", "og": {"title": "HGTV Star Carter Oosterhouse Accused of Sexual Misconduct", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/home/hgtv-star-carter-oosterhouse-sexual-misconduct-allegations/", "description": "UPDATE:&nbsp;In a statement to PEOPLE Friday afternoon, a spokesperson for HGTV said, “While we have not been in production with Carter Oosterhouse on an HGTV&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1645&h=861&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcarter-oosterhouse-amy-smart-1-2000.jpg", "width": 1645, "height": 861}}, "pinterest": {"url": "https://people.com/home/hgtv-star-carter-oosterhouse-sexual-misconduct-allegations/", "description": "Carter Oosterhouse, the host of ABC's The Great Christmas Light Fight, has been accused of sexual misconduct by a former makeup artist", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcarter-oosterhouse-amy-smart-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/home/hgtv-star-carter-oosterhouse-sexual-misconduct-allegations/", "title": "HGTV Star Carter Oosterhouse Accused of Sexual Misconduct", "description": "Carter Oosterhouse, the host of ABC's The Great Christmas Light Fight, has been accused of sexual misconduct by a former makeup artist", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1645&h=861&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcarter-oosterhouse-amy-smart-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}