{"url": "https://www.bustle.com/articles/117029-will-elijah-hayley-get-back-together-on-the-originals-season-3-could-be-the-year", "text": "When it comes to certain television shows, sometimes choosing a 'ship can feel like an impossible dilemma. With so many attractive people floating around from scene to scene, you can sometimes feel tempted to root for just about anyone. But when it comes to The Originals duo Hayley and Elijah, the decision is simple. These two share an undeniable chemistry that's been blatantly present ever since the series debuted. And even though they've faced their fair amount of hurtles in the past — one, of course, being the fact that Hayley is now married to Jackson — viewers are desperate to see Haylijah reunite on The Originals Season 3. But is there even the slightest chance these two could get back together?\n\nAs you can imagine, no one on the show is able to confirm such a thing at this point in time. However, executive producer Julie Plec recently chatted with TVLine about the subject and assured fans that Elijah still holds a very important place in Hayley's heart. \"I think we know where her heart lies,\" Plec teased. \"But the complicated thing is that as much as she’s deeply bonded with Elijah, she made a commitment to Jackson that was born both out of obligation and — ultimately — out of love.\" And it's an emotional tug of war that Hayley will continue to struggle with throughout the season.\n\nBut even without a direct \"yes\" or \"no\" answer from the cast, let's be honest here — they can't keep one of their best couples apart forever. This is just a fact of television. If two characters have a strong enough following, the writers won't be able to deprive them of reunion for very long. It happened with Elena and Damon on The Vampire Diaries, so it's only a matter of time before these two end up back in each other's arms. Because as exciting as the chase of relationship may be, the anticipation eventually has to lead somewhere satisfying, especially since these two have never really been given the chance of having a full-fledged relationship with each other.\n\nBetween having Klaus' baby and feeling obligated to marry Jackson for the good of the werewolf pack, Haylijah has never had the opportunity to thrive. Their relationship deserves to see the light of day, so that we, as viewers, can see firsthand just how well these two fit together. As great as Jackson is, I'm convinced that Hayley and Elijah are The Originals' OTP. We just have to be patient for them to find their way back to one another. And it will happen, I assure you. Not just because they're meant to be, but also due to the fact that no one can resist Elijah in a suit for very long.\n\nDo you really need any other proof than that? I rest my case.\n\nImages: Annette Brown/The CW; bluevelvet-love/Tumblr (2); Wifflegif", "images": ["https://imgix.bustle.com/rehost/2016/9/13/7ccbecc2-cc9b-4aec-968c-1e23f61ed648.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/9/13/7ccbecc2-cc9b-4aec-968c-1e23f61ed648.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/7ccbecc2-cc9b-4aec-968c-1e23f61ed648.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/117029-will-elijah-hayley-get-back-together-on-the-originals-season-3-could-be-the-year", "title": "Will Elijah & Hayley Get Back Together On 'The Originals'? Season 3 Could Be The Year Of Haylijah", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/117029-will-elijah-hayley-get-back-together-on-the-originals-season-3-could-be-the-year", "type": "article", "title": "There's Still Hope For 'The Originals' Haylijah", "description": "When it comes to certain television shows, sometimes choosing a 'ship can feel like an impossible dilemma. With so many attractive people floating around from scene to scene, you can sometimes feel tempted to root for just about anyone. But when it…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/7ccbecc2-cc9b-4aec-968c-1e23f61ed648.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "When it comes to certain television shows, sometimes choosing a 'ship can feel like an impossible dilemma. With so many attractive people floating around from scene to scene, you can sometimes feel tempted to root for just about anyone. But when it…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}