{"url": "https://www.express.co.uk/news/royal/961153/Royal-Wedding-Meghan-Markle-Prince-Harry-Windsor-Castle-latest-news", "text": "The couple were driven up 'The Long Walk', the three-mile-long road leading up to Windsor Castle, in a Range Rover at around 1.30pm. Prince William and Kate, the Duchess of Cambridge were spotted in the vehicle behind Harry and Meghan Markle making their way to the castle. Groom-to-be Prince Harry, 33, was seen wearing a grey jumper while former actress Ms Markle wore a cream outfit. She later covered her eyes with a pair of elegant black sunglasses and pulled her hair back to show a dazzling pair of diamond earrings.\n\nHer mother Doria Ragland later joined the couple for tea with Kate and William and their children Prince George and Princess Charlotte. The Queen will meet Ms Ragland tomorrow at Windsor Castle. The meeting comes hours after Meghan released a statement confirming her father Thomas will not be attending Saturday's ceremony. In a statement released by Kensington Palace, the bride-to-be spoke of her sadness that Thomas Markle would miss her big day.\n\nJonathan Buckmaster • MEGA Meghan's mother Doria Ragland joined the couple for tea at Windsor Castle\n\nHarry and Meghan arrive at Windsor Castle for wedding rehearsal Thu, May 17, 2018 Prince Harry and Meghan Markle arrive at Windsor Castle for wedding rehearsal. Play slideshow , 1 of 9 Harry and Meghan leave Kensington Palace for wedding rehearsal\n\nSadly, my father will not be attending our wedding Meghan Markle\n\nShe said: \"Sadly, my father will not be attending our wedding. \"I have always cared for my father and hope he can be given the space he needs to focus on his health. \"I would like to thank everyone who has offered generous messages of support. \"Please know how much Harry and I look forward to sharing our special day with you on Saturday.\"\n\nHUMPHREY NEMAR Meghan Markle being driven away from Kensington Palace earlier\n\nMr Markle is still in Mexico where he is recovering after undergoing heart surgery on Wednesday to implant three stents. The reclusive former TV lighting director was caught up in controversy after allegedly being caught staging photographs with the paparazzi. He reportedly pulled out of attending the ceremony in St George's Chapel on May 19 to avoid embarrassing his daughter. But he then later said before his surgery that he wanted to be part of history and hoped to be there, celebrity website TMZ revealed. Meghan's mother is now widely expected to walk her daughter down the aisle.\n\nHUMPHREY NEMAR Ms Markle's father is unable to attend the ceremony due to health reasons\n\nEarlier today, Prince Charles and Camilla, the Duchess of Cornwall visited Kensington Palace after meeting Ms Ragland at Clarence House before the wedding. Charles and Camilla arrived at the Palace by car, but left the royal residence by helicopter for a scheduled engagement in Staffordshire. Ms Ragland arrived in London yesterday and was driven by chauffeured car to the Kensington Palace last night. Ms Ragland was seen carrying her special outfit in a Burberry travel bag as she left her LA home, hinting she could wear a Burberry dress.\n\nHUMPHREY NEMAR Groom-to-be Prince Harry, 33, was seen wearing a grey jumper\n\nHer chauffer loaded the carrier into a black SUV along with a small travel case and holdall bag. Ms Ragland was casually dressed in a t-shirt with a dog print and a black blazer as she left her home for LAX airport. With the wedding just two days away, now bookies have slashed the odds on Ms Ragland walking Ms Markle down the aisle at St George's Chapel. Ms Ragland's odds have been cut into just 1/3 of performing the honours, according to Ladbrokes, with Prince Charles the next favourite with 3/1 odds.\n\nHUMPHREY NEMAR Prince William and Kate Middleton are pictured leaving Kensington Palace", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.express.co.uk/img/dynamic/106/750x445/961153.jpg", "https://cdn.images.express.co.uk/img/covers/70x91/front_2020-04-19.jpg", "https://cdn.images.express.co.uk/img/dynamic/106/285x190/960980_1.jpg", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://cdn.images.express.co.uk/img/dynamic/106/285x190/961047_1.jpg", "https://analytics.twitter.com/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/page/preloaderbig.gif", "https://t.co/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/dynamic/galleries/x701/369116.jpg"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/961153.jpg", "keywords": [], "authors": ["Tom Parfitt", "Meghan Markle"], "canonical_link": "https://www.express.co.uk/news/royal/961153/Royal-Wedding-Meghan-Markle-Prince-Harry-Windsor-Castle-latest-news", "title": "The look of love: Meghan Markle and Harry leave Windsor after tea with Doria and Kate", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "MEGHAN Markle and Prince Harry beamed as they left Windsor Castle after tea with Prince William, the Duchess of Cambridge and Meghan's mother Doria Ragland ahead of Saturday's royal wedding at St George's Chapel.", "fb": {"pages": 129617873765147, "app_id": 823607694325129}, "og": {"title": "The look of love: Meghan Markle and Harry leave Windsor after tea with Doria and Kate", "type": "article", "url": "https://www.express.co.uk/news/royal/961153/Royal-Wedding-Meghan-Markle-Prince-Harry-Windsor-Castle-latest-news", "image": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/961153.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "headlines,nation,ctp_video,autoplay_video,Royal Wedding,Meghan Markle,Prince Harry,Windsor Castle,latest news", "section": "Royal", "description": "MEGHAN Markle and Prince Harry beamed as they left Windsor Castle after tea with Prince William, the Duchess of Cambridge and Meghan's mother Doria Ragland ahead of Saturday's royal wedding at St George's Chapel."}, "news_keywords": "headlines,nation,ctp_video,autoplay_video,Royal Wedding,Meghan Markle,Prince Harry,Windsor Castle,latest news", "article": {"tag": "latest news", "published_time": "2018-05-17T14:26:00+01:00", "modified_time": "2018-05-17T22:21:31+01:00", "expiration_time": "2018-06-16", "section": "Royal", "image_count": 5, "video_count": 1, "word_count": 726, "internal_link_count": 3, "external_link_count": 0}, "author": "Tom Parfitt", "twitter": {"card": "summary_large_image", "image": {"src": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/961153.jpg"}, "title": "The look of love: Meghan Markle and Harry leave Windsor after tea with Doria and Kate", "description": "MEGHAN Markle and Prince Harry beamed as they left Windsor Castle after tea with Prince William, the Duchess of Cambridge and Meghan's mother Doria Ragland ahead of Saturday's royal wedding at St George's Chapel."}, "video_autoplay": "true", "headline_short": "The look of love: Meghan Markle and Harry leave Windsor after tea with Doria and Kate", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "robots": "noodp,noydir,all"}, "movies": [], "publish_date": 1526563560.0, "source": "https://www.express.co.uk", "summary": ""}