{"url": "en.wikipedia.org/wiki/Shapeshifting", "text": "The ability to physically transform through an inherent ability, divine intervention or generic tendencies\n\n\"Shapeshift\" redirects here. For the Swiss company, see ShapeShift\n\n\"Shapeshifter\" redirects here. For other uses, see Shapeshifter (disambiguation)\n\n\"The giant Galligantua and the wicked old magician transform the duke's daughter into a white hind .\" by Arthur Rackham\n\nIn mythology, folklore and speculative fiction, shapeshifting is the ability to physically transform through an inherently superhuman ability, divine intervention, demonic manipulation, sorcery, spells or having inherited the ability. The idea of shapeshifting is in the oldest forms of totemism and shamanism, as well as the oldest extant literature and epic poems such as the Epic of Gilgamesh and the Iliad. The concept remains a common trope in conspiracy theories, modern fantasy, children's literature and popular culture.\n\nFolklore and mythology [ edit ]\n\n1722 German woodcut of a werewolf transforming\n\nPopular shapeshifting creatures in folklore are werewolves and vampires (mostly of European, Canadian, and Native American/early American origin), the huli jing of East Asia (including the Japanese kitsune and Korean kumiho), and the gods, goddesses, and demons of numerous mythologies, such as the Norse Loki or the Greek Proteus. Shapeshifting to the form of a wolf is specifically known as lycanthropy, and such creatures who undergo such change are called lycanthropes. Therianthropy is the more general term for human-animal shifts, but it is rarely used in that capacity. It was also common for deities to transform mortals into animals and plants.\n\nOther terms for shapeshifters include metamorph, the Navajo skin-walker, mimic, and therianthrope. The prefix \"were-,\" coming from the Old English word for \"man\" (masculine rather than generic), is also used to designate shapeshifters; despite its root, it is used to indicate female shapeshifters as well.\n\nWhile the popular idea of a shapeshifter is of a human being who turns into something else, there are numerous stories about animals that can transform themselves as well.[1]\n\nExamples of shapeshifting in classical literature include many examples in Ovid's Metamorphoses, Circe's transforming of Odysseus' men to pigs in Homer's The Odyssey, and Apuleius's Lucius becoming a donkey in The Golden Ass. Proteus was noted among the gods for his shapeshifting; both Menelaus and Aristaeus seized him to win information from him, and succeeded only because they held on during his various changes. Nereus told Heracles where to find the Apples of the Hesperides for the same reason.\n\nThe Titan Metis, the first wife of Zeus and the mother of the goddess Athena, was believed to be able to change her appearance into anything she wanted. In one story, she was so proud, that her husband, Zeus, tricked her into changing into a fly. He then swallowed her because he feared that he and Metis would have a son who would be more powerful than Zeus himself. Metis, however, was already pregnant. She stayed alive inside his head and built armor for her daughter. The banging of her metalworking made Zeus have a headache, so Hephaestus clove his head with an axe. Athena sprang from her father's head, fully grown, and in battle armor.\n\nIn Greek mythology, the transformation is often a punishment from the gods to humans who crossed them.\n\nZeus transformed King Lycaon and his children into wolves (hence lycanthropy) as a punishment for either killing Zeus' children or serving him the flesh of Lycaon's own murdered son Nyctimus, depending on the exact version of the myth.\n\nAres assigned Alectryon to keep watch for the other gods during his affair with Aphrodite, but Alectryon fell asleep, leading to their discovery and humiliation that morning. Ares turned Alectryon into a rooster, which always crows to signal the morning.\n\nDemeter transformed Ascalabus into a lizard for mocking her sorrow and thirst during her search for her daughter Persephone. She also turned King Lyncus into a lynx for trying to murder her prophet Triptolemus.\n\nAthena transformed Arachne into a spider for challenging her as a weaver and/or weaving a tapestry that insulted the gods. She also turned Nyctimene into an owl, though in this case it was an act of mercy, as the girl wished to hide from the daylight out of shame from being raped by her father.\n\nArtemis transformed Actaeon into a stag for spying on her bathing, and he was later devoured by his own hunting dogs.\n\nGalanthis was transformed into a weasel or cat after interfering in Hera's plans to hinder the birth of Heracles.\n\nAtalanta and Hippomenes were turned into lions after making love in one of Zeus' temples.\n\nIo was a priestess of Hera in Argos, a nymph who was raped by Zeus, who changed her into a heifer to escape detection.\n\nHera punished young Tiresias by transforming him into a woman and, seven years later, back into a man.\n\nKing Tereus, his wife Procne and her sister Philomela were all turned into birds (a hoopoe, a swallow and a nightingale respectively), after Tereus raped Philomela and cut out her tongue, and in revenge she and Procne served him the flesh of his murdered son Itys.\n\nWhile the Greek gods could use transformation punitively – such as Medusa, turned to a monster for having sexual intercourse with Poseidon in Athena's temple – even more frequently, the tales using it are of amorous adventure. Zeus repeatedly transformed himself to approach mortals as a means of gaining access:[2]\n\nDanaë as a shower of gold\n\nEuropa as a bull\n\nLeda as a swan\n\nGanymede, as an eagle\n\nAlcmene as her husband Amphitryon\n\nHera as a cuckoo\n\nLeto as a quail\n\nSemele as a mortal shepherd\n\nIo, as a cloud\n\nNemesis (Goddess of retribution) transformed into a goose to escape Zeus' advances, but he turned into a swan. She later bore the egg in which Helen of Troy was found.\n\nVertumnus transformed himself into an old woman to gain entry to Pomona's orchard; there, he persuaded her to marry him.\n\nIn other tales, the woman appealed to other gods to protect her from rape, and was transformed (Daphne into laurel, Cornix into a crow). Unlike Zeus and other gods' shapeshifting, these women were permanently metamorphosed.\n\nIn one tale, Demeter transformed herself into a mare to escape Poseidon, but Poseidon counter-transformed himself into a stallion to pursue her, and succeeded in the rape. Caenis, having been raped by Poseidon, demanded of him that she be changed to a man. He agreed, and she became Caeneus, a form he never lost, except, in some versions, upon death.\n\nAs a final reward from the gods for their hospitality, Baucis and Philemon were transformed, at their deaths, into a pair of trees.\n\nIn some variants of the tale of Narcissus, he is turned into a narcissus flower.\n\nAfter Tereus raped Philomela and cut out her tongue to silence her, she wove her story into a tapestry for her sister, Tereus's wife Procne, and the sisters murdered his son and fed him to his father. When he discovered this, he tried to kill them, but the gods changed them all into birds.\n\nSometimes metamorphoses transformed objects into humans. In the myths of both Jason and Cadmus, one task set to the hero was to sow dragon's teeth; on being sown, they would metamorphose into belligerent warriors, and both heroes had to throw a rock to trick them into fighting each other to survive. Deucalion and Pyrrha repopulated the world after a flood by throwing stones behind them; they were transformed into people. Cadmus is also often known to have transformed into a dragon or serpent towards the end of his life. Pygmalion fell in love with Galatea, a statue he had made. Aphrodite had pity on him and transformed the stone to a living woman.\n\nBritish and Irish [ edit ]\n\nFairies, witches, and wizards were all noted for their shapeshifting ability. Not all fairies could shapeshift, and some were limited to changing their size, as with the spriggans, and others to a few forms and other fairies might have only the appearance of shapeshifting, through their power, called \"glamour,\" to create illusions.[3] But others, such as the Hedley Kow, could change to many forms, and both human and supernatural wizards were capable of both such changes, and inflicting them on others.[4]\n\nWitches could turn into hares and in that form steal milk and butter.[5]\n\nMany British fairy tales, such as Jack the Giant Killer and The Black Bull of Norroway, feature shapeshifting.\n\nCeltic mythology [ edit ]\n\nPwyll was transformed by Arawn into Arawn's own shape, and Arawn transformed himself into Pwyll's, so that they could trade places for a year and a day.\n\nLlwyd ap Cil Coed transformed his wife and attendants into mice to attack a crop in revenge; when his wife is captured, he turned himself into three clergymen in succession to try to pay a ransom.\n\nMath fab Mathonwy and Gwydion transform flowers into a woman named Blodeuwedd, and when she betrays her husband Lleu Llaw Gyffes, who is transformed into an eagle, they transform her again, into an owl.\n\nGilfaethwy committed rape with help from his brother Gwydion. Both were transformed into animals, for one year each. Gwydion was transformed into a stag, sow and wolf, and Gilfaethwy into a hind, boar and she-wolf. Each year, they had a child. Math turned the three young animals into boys.\n\nGwion, having accidentally taken some of the wisdom potion that Ceridwen was brewing for her son, fled from her through a succession of changes that she answered with changes of her own, ending with his being eaten, a grain of corn, by her as a hen. She became pregnant, and he was reborn in a new form, as Taliesin.\n\nTales abound about the selkie, a seal that can remove its skin to make contact with humans for only a short amount of time before it must return to the sea. Clan MacColdrum of Uist's foundation myths include a union between the founder of the clan and a shapeshifting selkie.[6] Another such creature is the Scottish selkie, which needs its sealskin to regain its form. In The Great Silkie of Sule Skerry the (male) selkie seduces a human woman. Such stories surrounding these creatures are usually romantic tragedies.\n\nScottish mythology features shapeshifters, which allows the various creatures to trick, deceive, hunt, and kill humans. Water spirits such as the each-uisge, which inhabit lochs and waterways in Scotland, were said to appear as a horse or a young man.[4] Other tales include kelpies who emerge from lochs and rivers in the disguise of a horse or woman in order to ensnare and kill weary travelers. Tam Lin, a man captured by the Queen of the Fairies is changed into all manner of beasts before being rescued. He finally turned into a burning coal and was thrown into a well, whereupon he reappeared in his human form. The motif of capturing a person by holding him through all forms of transformation is a common thread in folktales.[7]\n\nPerhaps the best-known Irish myth is that of Aoife who turned her stepchildren, the Children of Lir, into swans to be rid of them. Likewise, in the Tochmarc Étaíne, Fuamnach jealously turns Étaín into a butterfly. The most dramatic example of shapeshifting in Irish myth is that of Tuan mac Cairill, the only survivor of Partholón's settlement of Ireland. In his centuries long life he became successively a stag, a wild boar, a hawk and finally a salmon prior to being eaten and (as in the Wooing of Étaín) reborn as a human.\n\nThe Púca is a Celtic faery, and also a deft shapeshifter. He can transform into many different, terrifying forms.\n\nSadhbh, the wife of the famous hero Fionn mac Cumhaill, was changed into a deer by the druid Fer Doirich when she spurned his amorous interests.\n\nNorse [ edit ]\n\nIn the Lokasenna, Odin and Loki taunt each other with having taken the form of females and nursing offspring to which they had given birth. A 13th-century Edda relates Loki taking the form of a mare to bear Odin's steed Sleipnir which was the fastest horse ever to exist, and also the form of a she-wolf to bear Fenrir.[8]\n\nSvipdagr angered Odin, who turned him into a dragon. Despite his monstrous appearance, his lover, the goddess Freyja, refused to leave his side. When the warrior Hadding found and slew Svipdagr, Freyja cursed him to be tormented by a tempest and shunned like the plague wherever he went.[citation needed] In the Hyndluljóð, Freyja transformed her protégé Óttar into a boar to conceal him. She also possessed a cloak of falcon feathers that allowed her to transform into a falcon, which Loki borrowed on occasion.\n\nThe Volsunga saga contains many shapeshifting characters. Siggeir's mother changed into a wolf to help torture his defeated brothers-in-law with slow and ignominious deaths. When one, Sigmund, survived, he and his nephew and son Sinfjötli killed men wearing wolfskins; when they donned the skins themselves, they were cursed to become werewolves.\n\nThe dwarf Andvari is described as being able to magically turn into a pike. Alberich, his counterpart in Richard Wagner's Der Ring des Nibelungen, using the Tarnhelm, takes on many forms, including a giant serpent and a toad, in a failed attempt to impress or intimidate Loki and Odin/Wotan.\n\nFafnir was originally a dwarf, a giant or even a human, depending on the exact myth, but in all variants he transformed into a dragon—a symbol of greed—while guarding his ill-gotten hoard. His brother, Ótr, enjoyed spending time as an otter, which led to his accidental slaying by Loki.\n\nIn Scandinavia, there existed, for example, the famous race of she-werewolves known with a name of Maras, women who took on the appearance of the night looking for huge half-human and half-wolf monsters. If a female at midnight stretches the membrane which envelopes the foal when it is brought forth, between four sticks and creeps through it, naked, she will bear children without pain; but all the boys will be shamans, and all the girls Maras.[citation needed]\n\nThe Nisse is sometimes said to be a shapeshifter. This trait also is attributed to Huldra.\n\nGunnhild, Mother of Kings (Gunnhild konungamóðir) (c. 910 – c. 980), a quasi-historical figure who appears in the Icelandic Sagas, according to which she was the wife of Eric Bloodaxe, was credited with magic powers - including the power of shapeshifting and turning at will into a bird. She is the central character of the novel Mother of Kings by Poul Anderson,[9] which considerably elaborates on her shapeshifting abilities.\n\nOther lore [ edit ]\n\nArmenian [ edit ]\n\nIn Armenian mythology, shapeshifters include the Nhang, a serpentine river monster than can transform itself into a woman or seal, and will drown humans and then drink their blood; or the beneficial Shahapet, a guardian spirit that can appear either as a man or a snake.[10]\n\nIndian [ edit ]\n\nAncient Indian mythology tells of Nāga, snakes that can sometimes assume human form. Scriptures describe shapeshifting Rakshasa (demons) assuming animal forms to deceive humans. The Ramayana also includes the Vanara, a group of apelike humanoids who possessed supernatural powers and could change their shapes.[11][12]\n\nIn the Indian fable The Dog Bride from Folklore of the Santal Parganas by Cecil Henry Bompas, a buffalo herder falls in love with a dog that has the power to turn into a woman when she bathes.\n\nPhilippines [ edit ]\n\nPhilippine mythology includes the Aswang, a vampiric monster capable of transforming into a bat, a large black dog, a black cat, a black boar or some other form in order to stalk humans at night. The folklore also mentions other beings such as the Kapre, the Tikbalang and the Engkanto, which change their appearances to woo beautiful maidens. Also, talismans (called \"anting-anting\" or \"birtud\" in the local dialect), can give their owners the ability to shapeshift. In one tale, Chonguita the Monkey Wife,[14] a woman is turned into a monkey, only becoming human again if she can marry a handsome man.\n\nTatar [ edit ]\n\nTatar folklore includes Yuxa, a hundred-year-old snake that can transform itself into a beautiful young woman, and seeks to marry men in order to have children.\n\n\"Madame White Snake\" Picture on long veranda in the Summer Palace , Beijing, China\n\nChinese [ edit ]\n\nChinese mythology contains many tales of animal shapeshifters, capable of taking on human form. The most common such shapeshifter is the huli jing, a fox spirit which usually appears as a beautiful young woman; most are dangerous, but some feature as the heroines of love stories. Madame White Snake is one such legend; a snake falls in love with a man, and the story recounts the trials that she and her husband faced.\n\nJapanese [ edit ]\n\nKuzunoha the fox woman, casting a fox shadow\n\nIn Japanese folklore ōbake are a type of yōkai with the ability to shapeshift. The fox, or kitsune is among the most commonly known, but other such creatures include the bakeneko, the mujina and the tanuki.\n\nKorean [ edit ]\n\nKorean mythology also contains a fox with the ability to shapeshift. Unlike its Chinese and Japanese counterparts, the kumiho is always malevolent. Usually its form is of a beautiful young woman; one tale recounts a man, a would-be seducer, revealed as a kumiho.[15] The kumiho has nine tails and as she desires to be a full human, she uses her beauty to seduce men and eat their hearts (or in some cases livers where the belief is that 100 livers would turn her into a real human).\n\nSomali [ edit ]\n\nIn Somali mythology Qori ismaris (\"One who rubs himself with a stick\") was a man who could transform himself into a \"Hyena-man\" by rubbing himself with a magic stick at nightfall and by repeating this process could return to his human state before dawn.\n\nTrinidad and Tobago [ edit ]\n\nThe Ligahoo or loup-garou is the shapeshifter of Trinidad and Tobago's folklore. This unique ability is believed to be handed down in some old creole families, and is usually associated with witch-doctors and practitioners of African magic.[16] [17]\n\nMapuche (Argentina and Chile) [ edit ]\n\nThe name of the Nahuel Huapi Lake in Argentina derives from the toponym of its major island in Mapudungun (Mapuche language): \"Island of the Jaguar (or Puma)\", from nahuel, \"puma (or jaguar)\", and huapí, \"island\". There is, however, more to the word \"Nahuel\" - it can also signify \"a man who by sorcery has been transformed into a puma\" (or jaguar).\n\nFolktales [ edit ]\n\nThemes [ edit ]\n\nShapeshifting may be used as a plot device, such as when Puss in Boots in the fairy tales tricks the ogre into becoming a mouse to be eaten. Shapeshifting may also include symbolic significance, like the Beast's transformation in Beauty and the Beast indicates Belle's ability to accept him despite his appearance.\n\nWhen a form is taken on involuntarily, the thematic effect can be one of confinement and restraint; the person is bound to the new form. In extreme cases, such as petrifaction, the character is entirely disabled. On the other hand, voluntary shapeshifting can be a means of escape and liberation. Even when the form is not undertaken to resemble a literal escape, the abilities specific to the form allow the character to act in a manner that was previously impossible.\n\nExamples of this are in fairy tales. A prince who is forced into a bear's shape (as in East of the Sun and West of the Moon) is a prisoner, but a princess who takes on a bear's shape voluntarily to flee a situation (as in The She-Bear) escapes with her new shape.[22] In the Earthsea books, Ursula K. Le Guin depicts an animal form as slowly transforming the wizard's mind, so that the dolphin, bear or other creature forgets it was human, making it impossible to change back. This makes an example for a voluntary shapeshifting becoming an imprisoning metamorphosis. Beyond this, the uses of shapeshifting, transformation, and metamorphosis in fiction are as protean as the forms the characters take on. Some are rare, such as Italo Calvino's \"The Canary Prince\" is a Rapunzel variant in which shapeshifting is used to gain access to the tower.\n\nPunitive changes [ edit ]\n\nIn many cases, imposed forms are punitive in nature. This may be a just punishment, the nature of the transformation matching the crime for which it occurs; in other cases, the form is unjustly imposed by an angry and powerful person. In fairy tales, such transformations are usually temporary, but they commonly appear as the resolution of myths (as in many of the Metamorphoses) or produce origin myths.\n\nTransformation chase [ edit ]\n\nIn many fairy tales and ballads, as in Child Ballad #44, The Twa Magicians or Farmer Weathersky, a magical chase occurs where the pursued endlessly takes on forms in an effort to shake off the pursuer, and the pursuer answers with shapeshifting, as, a dove is answered with a hawk, and a hare with a greyhound. The pursued may finally succeed in escape or the pursuer in capturing.\n\nThe Grimm Brothers fairy tale Foundling-Bird contains this as the bulk of the plot.[24] In the Italian Campania Fables collection of Pentamerone by Gianbattista Basile, tells of a Neapolitan princess who, to escape from her father who had imprisoned her, becomes a huge she-bear. The magic happens due to a potion given to her by an old witch. The girl, once gone, can regain her human aspect.\n\nIn other variants, the pursued may transform various objects into obstacles, as in the fairy tale \"The Master Maid\", where the Master Maid transforms a wooden comb into a forest, a lump of salt into a mountain, and a flask of water into a sea. In these tales, the pursued normally escapes after overcoming three obstacles.[25] This obstacle chase is literally found worldwide, in many variants in every region.[26]\n\nIn fairy tales of the Aarne–Thompson type 313A, The Girl Helps the Hero Flee, such a chase is an integral part of the tale. It can be either a transformation chase (as in The Grateful Prince, King Kojata, Foundling-Bird, Jean, the Soldier, and Eulalie, the Devil's Daughter, or The Two Kings' Children) or an obstacle chase (as in The Battle of the Birds, The White Dove, or The Master Maid).[27]\n\nIn a similar effect, a captive may shapeshift in order to break a hold on him. Proteus and Nereus's shapeshifting was to prevent heroes such as Menelaus and Heracles from forcing information from them. Tam Lin, once seized by Janet, was transformed by the faeries to keep Janet from taking him, but as he had advised her, she did not let go, and so freed him.[29] The motif of capturing a person by holding him through many transformations is found in folktales throughout Europe,[7] and Patricia A. McKillip references it in her Riddle-Master trilogy: a shapeshifting Earthmaster finally wins its freedom by startling the man holding it.\n\nPowers [ edit ]\n\nOne motif is a shape change in order to obtain abilities in the new form. Berserkers were held to change into wolves and bears in order to fight more effectively. In many cultures, evil magicians could transform into animal shapes and thus skulk about.\n\nIn many fairy tales, the hero's talking animal helper proves to be a shapeshifted human being, able to help him in its animal form. In one variation, featured in The Three Enchanted Princes and The Death of Koschei the Deathless, the hero's three sisters have been married to animals. These prove to be shapeshifted men, who aid their brother-in-law in a variant of tale types.[30]\n\nIn an early Mayan text, the Shapeshifter, or Mestaclocan, has the ability to change his appearance and to manipulate the minds of animals. In one tale, the Mestaclocan finds a dying eagle. Changing into the form of an eagle, he convinces the dying bird that it is, in fact, not dying. As the story goes they both soar into the heavens, and lived together for eternity.\n\nBildungsroman [ edit ]\n\nBeauty and the Beast has been interpreted as a young woman's coming-of-age, in which she changes from being repulsed by sexual activity and regarding a husband therefore bestial, to a mature woman who can marry.\n\nNeeded items [ edit ]\n\nValkyries as swan maidens, having shed their swan skins.\n\nSome shapeshifters are able to change form only if they have some item, usually an article of clothing. In Bisclavret by Marie de France, a werewolf cannot regain human form without his clothing, but in wolf form does no harm to anyone. The most common use of this motif, however, is in tales where a man steals the article and forces the shapeshifter, trapped in human form, to become his bride. This lasts until she discovers where he has hidden the article, and she can flee. Selkies feature in these tales. Others include swan maidens and the Japanese tennin.\n\nInner conflict [ edit ]\n\nThe power to externally transform can symbolize an internal savagery; a central theme in many strands of werewolf mythology, and the inversion of the \"liberation\" theme, as in Dr Jekyll's transformation into Mr. Hyde.\n\nUsurpation [ edit ]\n\nSister Alenushka Weeping about Brother Ivanushka by Brother and Sister: Alenushka laments her brother's transformation into a goat. by Viktor Vasnetsov , Russian variant of: Alenushka laments her brother's transformation into a goat.\n\nSome transformations are performed to remove the victim from his place, so that the transformer can usurp it. Bisclaveret's wife steals his clothing and traps him in wolf form because she has a lover. A witch, in The Wonderful Birch, changed a mother into a sheep to take her place, and had the mother slaughtered; when her stepdaughter married the king, the witch transformed her into a reindeer so as to put her daughter in the queen's place. In the Korean Transformation of the Kumiho, a kumiho, a fox with magical powers, transformed itself into an image of the bride, only being detected when her clothing is removed. In Brother and Sister, when two children flee from their cruel stepmother, she enchants the streams along the way to transform them. While the brother refrains from the first two, which threaten to turn them into tigers and wolves, he is too thirsty at the third, which turns him into a deer. The Six Swans are transformed into swans by their stepmother, as are the Children of Lir in Irish mythology.\n\nIll-advised wishes [ edit ]\n\nMany fairy-tale characters have expressed ill-advised wishes to have any child at all, even one that has another form, and had such children born to them.[34] At the end of the fairy tale, normally after marriage, such children metamorphose into human form. Hans My Hedgehog was born when his father wished for a child, even a hedgehog. Even stranger forms are possible: Giambattista Basile included in his Pentamerone the tale of a girl born as a sprig of myrtle, and Italo Calvino, in his Italian Folktales, a girl born as an apple.\n\nSometimes, the parent who wishes for a child is told how to gain one, but does not obey the directions perfectly, resulting in the transformed birth. In Prince Lindworm, the woman eats two onions, but does not peel one, resulting in her first child being a lindworm. In Tatterhood, a woman magically produces two flowers, but disobeys the directions to eat only the beautiful one, resulting her having a beautiful and sweet daughter, but only after a disgusting and hideous one.\n\nLess commonly, ill-advised wishes can transform a person after birth. The Seven Ravens are transformed when their father thinks his sons are playing instead of fetching water to christen their newborn and sickly sister, and curses them.[35] In Puddocky, when three princes start to quarrel over the beautiful heroine, a witch curses her because of the noise.\n\nMonstrous bride/bridegroom [ edit ]\n\nSuch wished-for children may become monstrous brides or bridegrooms. These tales have often been interpreted as symbolically representing arranged marriages; the bride's revulsion to marrying a stranger being symbolized by his bestial form.[36]\n\nThe heroine must fall in love with the transformed groom. The hero or heroine must marry, as promised, and the monstrous form is removed by the wedding. Sir Gawain thus transformed the Loathly lady; although he was told that this was half-way, she could at his choice be beautiful by day and hideous by night, or vice versa, he told her that he would choose what she preferred, which broke the spell entirely. In Tatterhood, Tatterhood is transformed by her asking her bridegroom why he didn't ask her why she rode a goat, why she carried a spoon, and why she was so ugly, and when he asked her, denying it and therefore transforming her goat into a horse, her spoon into a fan, and herself into a beauty. Puddocky is transformed when her prince, after she had helped him with two other tasks, tells him that his father has sent him for a bride. A similar effect is found in Child ballad 34, Kemp Owyne, where the hero can transform a dragon back into a maiden by kissing her three times.\n\nSometimes the bridegroom removes his animal skin for the wedding night, whereupon it can be burned. Hans My Hedgehog, The Donkey and The Pig King fall under this grouping. At an extreme, in Prince Lindworm, the bride who avoids being eaten by the lindworm bridegroom arrives at her wedding wearing every gown she owns, and she tells the bridegroom she will remove one of hers if he removes one of his; only when her last gown comes off has he removed his last skin, and become a white shape that she can form into a man.[1]\n\nIn some tales, the hero or heroine must obey a prohibition; the bride must spend a period of time not seeing the transformed groom in human shape (as in East of the Sun and West of the Moon), or the bridegroom must not burn the animals' skins. In The Brown Bear of Norway, The Golden Crab, The Enchanted Snake and some variants of The Frog Princess, burning the skin is a catastrophe, putting the transformed bride or bridegroom in danger. In these tales, the prohibition is broken, invariably, resulting in a separation and a search by one spouse for the other.[1]\n\nDeath [ edit ]\n\nGhosts sometimes appear in animal form. In The Famous Flower of Serving-Men, the heroine's murdered husband appears to the king as a white dove, lamenting her fate over his own grave. In The White and the Black Bride and The Three Little Men in the Wood, the murdered – drowned – true bride reappears as a white duck. In The Rose Tree and The Juniper Tree, the murdered children become birds who avenge their own deaths. There are African folk tales of murder victims avenging themselves in the form of crocodiles that can shapeshift into human form.[39]\n\nIn some fairy tales, the character can reveal himself in every new form, and so a usurper repeatedly kills the victim in every new form, as in Beauty and Pock Face, A String of Pearls Twined with Golden Flowers, and The Boys with the Golden Stars. This eventually leads to a form in which the character (or characters) can reveal the truth to someone able to stop the villain.\n\nSimilarly, the transformation back may be acts that would be fatal. In The Wounded Lion, the prescription for turning the lion back into a prince was to kill him, chop him to pieces, burn the pieces, and throw the ash into water. Less drastic but no less apparently fatal, the fox in The Golden Bird, the foals in The Seven Foals, and the cats in Lord Peter and The White Cat tell the heroes of those stories to cut off their heads; this restores them to human shape.[40] In the Greek tale of Scylla, Scylla's father Nisus turns into an eagle after death and drowns her daughter for betraying her father.\n\nModern [ edit ]\n\nFiction [ edit ]\n\nPopular culture [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\nCitations [ edit ]\n\nBibliography [ edit ]\n\nFurther reading [ edit ]\n\nHall, Jamie (2003). Half Human, Half Animal: Tales of Werewolves and Related Creatures . AuthorHouse. ISBN 1-4107-5809-5 .\n\nWood, Felicity. \"The Shape-Shifter on the Borderlands: A Comparative Study of the Trickster Figure in African Orality and in Oral Narratives Concerning one South African Trickster, Khotso Sethuntsa.\" English in Africa (2010): 71-90.\n\n(2010): 71-90. Zaytoun, Kelli D. \"“Now Let Us Shift” the Subject: Tracing the Path and Posthumanist Implications of La Naguala/The Shapeshifter in the Works of Gloria Anzaldúa.\" MELUS: Multi-Ethnic Literature of the United States 40.4 (2015): 69-88.", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Galligantus_-_Project_Gutenberg_eText_17034.jpg/220px-Galligantus_-_Project_Gutenberg_eText_17034.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Cadmus_teeth.jpg/220px-Cadmus_teeth.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Svipdag_transformed_-_John_Bauer.jpg/220px-Svipdag_transformed_-_John_Bauer.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Valkyries_with_swan_skins.jpg/220px-Valkyries_with_swan_skins.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/GermanWoodcut1722.jpg/220px-GermanWoodcut1722.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Gerbrand_van_den_Eeckhout_005.jpg/220px-Gerbrand_van_den_Eeckhout_005.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Vasnetsov_Frog_Princess.jpg/250px-Vasnetsov_Frog_Princess.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Ring12.jpg/220px-Ring12.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Anne_Anderson05.jpg/240px-Anne_Anderson05.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Vasnetsov_Alenushka.jpg/220px-Vasnetsov_Alenushka.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Vasnetsov_Frog_Princess.jpg/1200px-Vasnetsov_Frog_Princess.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Apollo_and_Daphne_%28Bernini%29.jpg/220px-Apollo_and_Daphne_%28Bernini%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Kuniyoshi_Kuzunoha.jpg/200px-Kuniyoshi_Kuzunoha.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Legend_white_snake1.jpg/220px-Legend_white_snake1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Thekelpie_large.jpg/230px-Thekelpie_large.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Ler_swans_Millar.jpg/220px-Ler_swans_Millar.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Vasnetsov_Frog_Princess.jpg/1200px-Vasnetsov_Frog_Princess.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Shapeshifting", "title": "Shapeshifting", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Vasnetsov_Frog_Princess.jpg/1200px-Vasnetsov_Frog_Princess.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}