{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/15/i-will-not-be-shamed-actor-terry-crews-details-his-alleged-sexual-assault/", "text": "Crews, a former NFL player who currently stars as a police sergeant on the television show “Brooklyn Nine-Nine,” first spoke out about the alleged sexual assault on Twitter in mid-October, shortly after the New York Times published an explosive story about decades of sexual harassment allegations against Harvey Weinstein.\n\nAD\n\nAt least 20 high-profile men in Hollywood, the media and the political sphere have since faced allegations of sexually harassing or assaulting women and men.\n\nAD\n\nOn Wednesday, Crews told Good Morning America that the executive was Venit, an executive at William Morris Endeavor, which Crews said is “one of the biggest agencies in the world — period.” Venit has represented actors such as Emma Stone, Eddie Murphy and Adam Sandler. Two of his clients, actors Dustin Hoffman and Brett Ratner, were also accused of sexual misconduct earlier this month.\n\nVenit has been suspended from William Morris Endeavor, according to ABC News. The agency could not be immediately reached for comment.\n\nAD\n\nOn Oct. 10, Crews wrote a long thread on Twitter and said that the Weinstein news had given him PTSD, as he was groped by a “high level Hollywood executive” during an event last year he attended with his wife.\n\nThis whole thing with Harvey Weinstein is giving me PTSD. Why? Because this kind of thing happened to ME. (1/Cont.) — terrycrews (@terrycrews) October 10, 2017\n\nMy wife n I were at a Hollywood function last year n a high level Hollywood executive came over 2 me and groped my privates. (2/cont.) — terrycrews (@terrycrews) October 10, 2017\n\nJumping back I said What are you doing?! My wife saw everything n we looked at him like he was crazy. He just grinned like a jerk. (3/cont.) — terrycrews (@terrycrews) October 10, 2017\n\nI was going to kick his ass right then— but I thought twice about how the whole thing would appear. (4/cont.) — terrycrews (@terrycrews) October 10, 2017\n\n“240 lbs. Black Man stomps out Hollywood Honcho” would be the headline the next day. (5/cont.) — terrycrews (@terrycrews) October 10, 2017\n\nHopefully, me coming forward with my story will deter a predator and encourage someone who feels hopeless. (16/end) — terrycrews (@terrycrews) October 10, 2017\n\nCrews was at the packed party last year with his wife, Rebecca King-Crews, when Venit began staring at him, making “overtly sexual” moves with his tongue, he told “Good Morning America.”\n\nAD\n\n“I’m looking like, ‘Is this a joke?’ I mean I don’t understand, it was actually so bizarre,” Crews said. “He comes over to me. I stick my hand out and he literally takes his hand and puts it and squeezes my genitals. And I jump back like, ‘Hey! Hey!’”\n\n“And he’s still licking his tongue out and all this stuff, and I go, ‘Dude, what are you doing? What are you doing?’ And then he comes back again! And he just won’t stop,” Crews said.\n\nAD\n\nCrews said he then pushed Venit away from him, and Venit bumped into other partygoers. Venit then began laughing and giggling, Crews said.\n\n“I have never felt more emasculated, more objectified,” Crews said. “I wake up every morning wondering, ‘Did this really happen?’ ”\n\nCrews said he was concerned about his wife during the incident, and positioned himself between her and Venit so that Venit wouldn’t approach her. Afterward, Crews said he was filled with rage, and felt like he “could punch a hole in his head.” When he and his wife got in the car to drive home, Crews said he “almost ripped the steering wheel off.”\n\nAD\n\nCrews said his wife calmed him down, and was proud of him for not resorting to violence. As an African American man, Crews said, he is aware that, had he physically confronted Venit, he would “immediately be seen as a thug.”\n\nAD\n\nCrews said he understands why many victims don’t come forward. They’re up against powerful people in Hollywood and fear people won’t believe their stories, and that their careers will suffer as a result, he said.\n\nIn the fallout of claims, which range from sexual misconduct to rape, some have resigned and others have been fired. Kevin Spacey in late October was accused of making sexual advances on a minor, and he has since been banished from the last season of the Netflix original series “House of Cards.” He has also been cut from the finished production of director Ridley Scott’s “All the Money in the World,” replaced by actor Christopher Plummer. Such a last-minute recasting in a finished movie is unprecedented.\n\nAD\n\nEarlier this month, the New York Times published five women’s allegations of sexual misconduct against comedian Louis C.K. Less than 24 hours later, the release of his new movie, “I Love You, Daddy,” was canceled. Netflix announced it would not produce the comedian’s planned comedy special. FX announced it would end its relationship with him, cutting its deal with him and removing him as the executive producer of four shows.\n\nAD\n\nCrews himself said he put the incident in the back of his mind until the Weinstein allegations, which encouraged him to tweet in October about what happened. He filed a police report earlier this month.\n\n“I will not be shamed. I will not be shamed. I did nothing wrong,” he told “Good Morning America.”\n\nRead more:", "images": ["https://www.washingtonpost.com/resizer/rryfcIxe3ZeRrE3rbY6RmPU7sRI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X7BH2VN6YA3IXPMAAXEMWEANOM.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9f474f9f-0c3d-4798-8ae2-c6d23673e21b.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZLVX5LSP2E6GZAPCV7PWRXIKD4.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/rryfcIxe3ZeRrE3rbY6RmPU7sRI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X7BH2VN6YA3IXPMAAXEMWEANOM.jpg", "keywords": [], "authors": ["Marwa Eltagouri", "General Assignment Reporter"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/15/i-will-not-be-shamed-actor-terry-crews-details-his-alleged-sexual-assault/", "title": "‘I will not be shamed’: Actor Terry Crews details his alleged sexual assault", "meta_data": {"description": "Crews names the Hollywood executive who allegedly sexually assaulted him at a party.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/15/i-will-not-be-shamed-actor-terry-crews-details-his-alleged-sexual-assault/", "image": "https://www.washingtonpost.com/resizer/rryfcIxe3ZeRrE3rbY6RmPU7sRI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X7BH2VN6YA3IXPMAAXEMWEANOM.jpg", "title": "‘I will not be shamed’: Actor Terry Crews details his alleged sexual assault", "description": "Crews names the Hollywood executive who allegedly sexually assaulted him at a party."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘I will not be shamed’: Actor Terry Crews details his alleged sexual assault", "description": "Crews names the Hollywood executive who allegedly sexually assaulted him at a party."}, "last_updated_date": "2018-02-26T00:27:49.451Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1510675200.0, "source": "https://www.washingtonpost.com", "summary": ""}