{"url": "www.celebritynetworth.com/richest-celebrities/actors/roseanne-barr-net-worth/", "text": "Roseanne Barr net worth: Roseanne Barr is an American comedian, actress, writer, television producer, director, and politician who has a net worth of $80 million. Barr began her career in stand-up comedy before appearing in the television sitcom Roseanne (1988–1997; 2018). She won an Emmy and a Golden Globe Award for Best Actress for her work on the show.\n\nEarly Life: Roseanne Cherrie Barr was born in Salt Lake City, Utah, in November 1952 to a Jewish family. She is the oldest of four children of Helen, a bookkeeper and cashier, and Jerome, a salesman. Her father's family were Jewish emigrants from Russia, and her maternal grandparents were Jewish emigrants from Austria-Hungary and Lithuania. Her paternal grandfather changed his surname from \"Borisofsky\" to \"Barr\" upon entering the United States. Her Jewish upbringing was influenced by her devoutly Orthodox Jewish maternal grandmother. Barr's parents kept their Jewish heritage secret from their neighbors and were partially involved in The Church of Jesus Christ of Latter-day Saints.\n\nAt six years old, Barr began lecturing at LDS churches around Utah and was elected president of a Mormon youth group. At 16, Barr was hit by a car and was left with a traumatic brain injury. Her behavior changed so radically that she was institutionalized for eight months at Utah State Hospital. While institutionalized, she had a baby, whom she put up for adoption. In 1970, when Barr was 18 years old, she moved out by telling her parents she was going to visit a friend in Colorado for two weeks, but never returned.\n\nCareer: She started her career doing stand-up comedy and appeared on The Tonight Show in 1985. In 1986, she performed on a Rodney Dangerfield special and on Late Night with David Letterman. In 1987, Barr had her own HBO special called The Roseanne Barr Show, which earned her an American Comedy Award for the funniest female performer in a television special. Barr was offered the role of Peg Bundy in Married… with Children but turned it down. In her stand up routine in the late 80s, she popularized the phrase \"domestic goddess\" to refer to a homemaker or housewife. The success of her stand up act led to her own series on ABC, called Roseanne. Roseanne originally aired from 1988 to 1997 and was revived in 2018. The show aired 224 episodes and has been popular in syndication. For her work on the show, Roseanne won a Golden Globe Award and an Emmy for Best Actress.\n\nFrom 1998 to 2000 she hosted The Roseanne Show and in 2011 she hosted a show called Roseanne's Nuts. Outside of TV, she appeared in movies including She-Devil, Freddy's Dead: The Final Nightmare, Even Cowgirls Get the Blues, Blue in the Face, Meet Wally Sparks, Cecil B. Demented, and more. She starred in the 2016 documentary film Roseanne For President! and was a judge on the reality TV series Last Comic Standing from 2014-2015. Over the years she has continued to perform standup comedy.\n\nOn April 28, 2017, it was reported that Barr, along with most of the original cast, were shopping an eight-episode revival of Roseanne, with Barr serving as producer, to various networks and Netflix. In May 2017, ABC picked up the revival for mid-season 2018. On March 27, 2018, the revived, 10th season of Roseanne premiered to high ratings. On March 30, 2018, ABC renewed the series for an 11th season, with thirteen episodes. On May 29, 2018, the series was canceled by ABC in the aftermath of a tweet by Barr that was widely considered to be racist.\n\nPersonal Life: In 1970, when she was 17, Barr had a child, Brandi Ann Brown, and put her up adoption; they were later reunited.\n\nOn February 4, 1974, Barr married Bill Pentland, a motel clerk she met while in Colorado. They had three children: Jessica, Jennifer, and Jake. Pentland and Barr divorced on January 16, 1990.\n\nFour days later, on January 20, 1990, Barr married fellow comedian Tom Arnold and became known as Roseanne Arnold during the marriage. Barr had met Arnold in 1983 in Minneapolis, where he opened for her stand-up comedy act. In 1988, Barr brought Arnold onto her sitcom, Roseanne, as a writer. Barr filed for divorce from Tom Arnold on April 18, 1994, in the Superior Court of Los Angeles County, citing irreconcilable differences.\n\nBarr is also remembered for singing a widely panned version of \"The Star-Spangled Banner\" before a baseball game between the San Diego Padres and Cincinnati Reds in San Diego in 1990. She sang off-key while spitting, and grabbing her crotch, apparently mimicking the actions of baseball players. Barr later said that the Padres had suggested she \"bring humor to the song,\" but many criticized the episode, including President George H. W. Bush, who called her rendition disgraceful.\"\n\nIn 1992, Barr received a star on the Hollywood Walk of Fame.\n\nBarr is on the autism spectrum.\n\nIn November 1994, she became pregnant through in-vitro fertilization and had a son named Buck with Ben Thomas, who at one time was her personal security guard. On February 14, 1995, Barr and Thomas got married at Caesars Tahoe with a reception at Planet Hollywood. The couple divorced in 2002.\n\nRoseanne has had many cosmetic procedures including work on her stomach, breasts, and nose. She also had gastric bypass surgery in the late 90s.\n\nBarr elicited criticism in July 2009 when she posed as Adolf Hitler in a feature for the satirical Jewish publication Heeb magazine, called \"That Oven Feelin.'\"\n\nBarr ran for president in 2012 as part of the Green Party. Although she did not win the nomination, she went on to be nominated by the Peace and Freedom Party and came in 6th in the popular vote for President.\n\nRoseanne and partner Johnny Argent live on a macadamia nut farm in Hawaii.\n\nSalary Highlights: During the last season of her sitcom, Roseanne earned $21 million in salary.\n\nReal Estate: When Barr and Arnold were married, they began construction on a 28,000 mansion in southeast Iowa in 1993. After their divorce in 1994 construction was halted and the half-finished mansion sat crumbling for decades. In 2018, when Roseanne the sitcom was rebooted, it was revealed that Barr and Arnold, donated the 1,338-acre property to the Indian Hills Community College Foundation, which sold it to MJW Hawkeye LLC. A spokesman for the owner said that the mansion was too expensive to tear down.\n\nIn 2007, Barr purchased a 2,212-square-foot ranch-style house and 46-acre property sight unseen on the Big Island, Hawaii for $1.78 million. The property, known as Hidden Hamakua Farm, in Honokaa/Hamakua. She moved there from Los Angeles full-time in 2010. Barr's property has 2,000 macadamia nut trees, an organic garden, and a beehive.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2020/02/Roseanne-Barr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1057081139/?value=0&guid=ON&script=0", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2010/02/Roseanne-Barr.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/02/Roseanne-Barr.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/roseanne-barr-net-worth/", "title": "Roseanne Barr Net Worth", "meta_data": {"description": "Roseanne Barr net worth and salary: Roseanne Barr is an American comedian, actress, writer, television producer, and director who has a net worth of", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "cnw_share_fb_count": 35, "cnw_share_tw_count": 31, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Roseanne Barr Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/roseanne-barr-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/02/Roseanne-Barr.jpg", "site_name": "Celebrity Net Worth", "description": "Roseanne Barr net worth and salary: Roseanne Barr is an American comedian, actress, writer, television producer, and director who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2020-04-01T23:22:41+00:00", "published_time": "2020-02-23T07:42:54+00:00", "section": "Actors", "tag": "roseanne barr salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/02/Roseanne-Barr.jpg", "title": "Roseanne Barr Net Worth", "description": "Roseanne Barr net worth and salary: Roseanne Barr is an American comedian, actress, writer, television producer, and director who has a net worth of"}}, "movies": [], "publish_date": 1582443774.0, "source": "http://www.celebritynetworth.com", "summary": ""}