{"url": "https://en.wikipedia.org/wiki/Family_of_Barack_Obama", "text": "List of members of the family of Barack Obama\n\nThe family of Barack Obama, the 44th president of the United States, and his wife Michelle Obama is made up of people of Kenyan (Luo), African-American, and Old Stock American (including originally English, Scots-Irish, Welsh, German, and Swiss) ancestry.[1][2][3][4][5] Their immediate family was the First Family of the United States from 2009 to 2017.[6] The Obamas are the first First Family of African-American descent.[7]\n\nImmediate family\n\nMichelle Obama\n\nMichelle LaVaughn Robinson Obama (born January 17, 1964) is an American lawyer, university administrator, and writer who served as the First Lady of the United States from 2009 to 2017.[6] She is Barack Obama's wife, and was the first African-American first lady. Raised on the South Side of Chicago,[8] Michelle Obama is a graduate of Princeton University and Harvard Law School,[9] and spent her early legal career working at the law firm Sidley Austin, where she met her husband.[10] She subsequently worked as the associate dean of Student Services at the University of Chicago[11] and the vice president for Community and External Affairs of the University of Chicago Medical Center.[12] Barack and Michelle married in 1992.[13]\n\nMichelle campaigned for her husband's presidential bid throughout 2007 and 2008, delivering a keynote address at the 2008 Democratic National Convention.[14] She returned to speak at the 2012 Democratic National Convention,[15] and again during the 2016 Democratic National Convention in Philadelphia, where she delivered a speech in support of the Democratic presidential nominee, and fellow first lady, Hillary Clinton.[16]\n\nAs first lady, Michelle Obama sought to become a role model for women, an advocate for poverty awareness, education, nutrition, physical activity and healthy eating, and became a fashion icon.[17][18]\n\nMalia Obama and Sasha Obama\n\nBarack and Michelle Obama have two daughters: Malia Ann ( ), born July 4, 1998,[19][20] and Natasha (known as Sasha ), born on June 10, 2001.[21] They were both delivered at University of Chicago Medical Center by their parents' friend and physician Anita Blanchard.[22] Sasha was the youngest child to reside in the White House since John F. Kennedy Jr. arrived as an infant in 1961.[23] In 2014, Malia and Sasha were named two of \"The 25 Most Influential Teens of 2014\" by Time magazine.[24]\n\nBefore his inauguration, President Obama published an open letter to his daughters in Parade magazine, describing what he wants for them and every child in America: \"to grow up in a world with no limits on your dreams and no achievements beyond your reach, and to grow into compassionate, committed women who will help build that world.\"[25]\n\nWhile living in Chicago, the Obamas kept busy schedules, as the Associated Press reported: \"soccer, dance and drama for Malia, gymnastics and tap for Sasha, piano and tennis for both.\"[26][27] In July 2008, the family gave an interview to the television series Access Hollywood. Obama later said they regretted allowing the children to be included.[28] Malia and Sasha both graduated from the private Sidwell Friends School in Washington, D.C., the same school that Chelsea Clinton, Tricia Nixon Cox, and Archibald Roosevelt attended and that the grandchildren of Vice President Joe Biden attend.[29] The Obama girls began classes there on January 5, 2009;[30] Malia graduated in 2016. Before the family moved to Washington in 2009, both girls attended the private University of Chicago Laboratory School.[31]\n\nIn his victory speech on the night of his election, President Obama repeated his promise to Sasha and Malia to get a puppy to take with them to the White House.[32] The selection was slow because Malia is allergic to animal dander;[33] the president subsequently said that the choice had been narrowed down to either a labradoodle or a Portuguese Water Dog, and that they hoped to find a shelter animal.[34] On April 12, 2009, it was reported that the Obamas had adopted a six-month-old Portuguese Water Dog given to them as a gift by Senator Ted Kennedy;[35] Malia and Sasha named the dog Bo.[35] The White House referred to Bo as the First Dog.[36] In 2013, the family adopted a second Portuguese Water Dog named Sunny.[37]\n\nAs a high school student, Malia Obama spent a portion of the summer in 2014 and 2015 working in television studios in New York and Los Angeles.[38] She spent the summer of 2016 working as an intern in the U.S. Embassy in Madrid, Spain.[39]\n\nDuring the week June 26, 2016, to July 3, 2016, Michelle, Sasha, Malia and Michelle's mother Marian Robinson went to Liberia to promote the Let Girls Learn Peace initiative, for which the United States has funded $27 million in aid for expansion.[40] They met with Ellen Johnson Sirleaf, the first elected female head of state in Africa.[40] Then they moved to Morocco, where they had a panel with Freida Pinto and Meryl Streep moderated by CNN's Isha Sesay in Marrakesh and delivered a substantive amount of money to aid 62 million girls lacking access to formal education. They proceeded to Spain where Michelle delivered a message about the initiative.[40]\n\nIn August 2016, Sasha began working at Nancy's, a seafood restaurant in Martha's Vineyard, Massachusetts.[41] In the fall of 2016, Malia went on an 83-day trip to Bolivia and Peru.[42] In February 2017, Malia started an internship for Harvey Weinstein at The Weinstein Company film studio in New York City.[43] In August 2017, Malia started attending Harvard University.[44] Sasha graduated from Sidwell Friends in 2019 and began attending the University of Michigan in the fall.[45][46]\n\nMarian Robinson\n\nMarian Robinson, Michelle Obama's mother, resided in the White House during the Obama presidency.\n\nMaternal relations\n\nBarack Obama was raised by his mother, Stanley Ann Dunham, called Ann, and maternal grandparents Madelyn and Stanley Dunham.[47][48]\n\nHe often referred to his family during his candidacy and term as president.[49][50][51] Obama's maternal heritage consists mostly of English ancestry, with smaller amounts of German, Scotch-Irish, Welsh, and Swiss ancestry.[3] Research published in 2012 stated that Obama is likely descended from the African slave John Punch through his mother's Bunch line, with generations of African Americans who gradually married \"white\" on the way to Kansas.[52]\n\nAnn Dunham (1942–1995)\n\nObama's mother was born Stanley Ann Dunham. She became an anthropologist, specializing in economic anthropology and rural development. She earned her PhD degree from the University of Hawaii at Mānoa and worked with the United States Agency for International Development, the Ford Foundation, and Women's World Banking, to promote the use of microcredit in order to combat global poverty.[47][53] The Ann Dunham Soetoro Endowment in the Anthropology Department at the University of Hawaiʻi at Mānoa and the Ann Dunham Soetoro Graduate Fellowships at the East–West Center (EWC) in Honolulu, Hawaii, are named in her honor.[54] Obama has said that his mother was the dominant figure of his formative years. \"The values she taught me continue to be my touchstone when it comes to how I go about the world of politics.\"[55]\n\nStanley Armour Dunham (1918–1992)\n\nStanley Armour Dunham is the maternal grandfather of Barack Obama. He served as a sergeant in the U.S. Army during World War II, enlisting just after the attacks on Pearl Harbor. He and his wife Madelyn Dunham raised Obama in Honolulu, Hawaii. In addition to Obama, Stanley is related to six US presidents: James Madison, Harry S. Truman, Lyndon B. Johnson, Jimmy Carter, George H. W. Bush, and George W. Bush.[56][57] He died in Honolulu, Hawaii, and is buried at the Punchbowl National Cemetery.\n\nMadelyn Lee Payne Dunham (1922–2008)\n\nMadelyn Dunham (née Madelyn Lee Payne) was Obama's maternal grandmother who worked in banking and became vice president of a bank in Hawaii. Obama grew up with her and remembered that when he was a child, his grandmother \"read me the opening lines of the Declaration of Independence and told me about the men and women who marched for equality because they believed those words put to paper two centuries ago should mean something.\"[25]\n\nCharles Thomas Payne (1925–2014)\n\nBarack Obama embraces his great-uncle Charles Payne, June 6, 2009.\n\nCharles Thomas Payne is Madelyn Dunham's younger brother and Obama's great-uncle. He was born in 1925. Payne served during World War II in the U.S. Army 89th Infantry Division.[58] Obama has often described Payne's role in liberating the Ohrdruf forced labor camp.[59] There was brief media attention when Obama mistakenly identified the camp as Auschwitz during the campaign.[60] In 2009, Payne spoke about his war experience:\n\nOhrdruf was in that string of towns going across, south of Gotha and Erfurt. Our division was the first one in there. When we arrived there were no German soldiers anywhere around that I knew about. There was no fighting against the Germans, no camp guards. The whole area was overrun by people from the camp dressed in the most pitiful rags, and most of them were in a bad state of starvation.[61]\n\nPayne appeared in the visitor's gallery at the Democratic National Convention in Denver, Colorado, when his great-nephew was nominated for President.[62] He was the assistant director of the University of Chicago's Library.[59]\n\nRalph Dunham (1916–2012)\n\nRalph Dunham was Stanley Dunham's older brother and Obama's great-uncle, he served in the U.S. Army as an assignment and personnel officer during World War II. He landed at Normandy's Omaha Easy Red Beach on D-Day plus four, and moved with troops in the fighting through France, Italy and Germany.[63][64]\n\nEleanor Belle Dunham Berkebile (1932–2003)\n\nEleanor Dunham, Obama's great-aunt, was the younger sister of Stanley Armour Dunham and Ralph Dunham. Married to Ralph Lee Berkebile. She was the youngest daughter of Ralph Waldo Emerson Dunham Sr. and his second wife, Martha Mae Stonehouse. She retired from civil service as an executive secretary.[citation needed]\n\nMargaret Arlene Payne (1927–2014)\n\nMargaret Arlene Payne, Obama's great-aunt, was the younger sister of Madelyn Dunham and Charles Payne. She was a professor of nutrition who taught at the University of Missouri, Kansas City, and at the University of North Carolina at Chapel Hill (1980–1990). She wrote numerous research articles and two books.[65][66]\n\nLeona McCurry (1897–1968)\n\nObama's family said that his maternal great-grandmother, Leona McCurry, was part Native American.[67] She reportedly held that as a \"source of considerable shame\" and \"blanched whenever someone mentioned the subject and hoped to carry the secret to her grave.\"[67] But her daughter Madelyn Dunham (Obama's maternal grandmother) \"would turn her head in profile to show off her beaked nose, which along with a pair of jet-black eyes, was offered as proof of Cherokee blood.\"[68] To date, no concrete evidence has surfaced of Cherokee heritage in the McCurry line.\n\nRuth Lucille Armour (1900–1926)\n\nObama's family said that his paternal great-grandmother, Ruth Dunham, died November 26, 1926, from ptomaine poisoning. Resided in Topeka, Kansas.[citation needed]\n\nFulmoth Kearney ( c. 1829 –1878)\n\nA maternal 3rd great-grandfather of Barack Obama, nicknamed \"Fully.\"[69] Born circa 1829 in Moneygall, King's County, Ireland, he emigrated to Ohio via New York in 1850, making him the most recent immigrant on the maternal side of Barack Obama's family tree. Fulmoth married Charlotte Holloway and raised a family which included three daughters (including Mary Ann). She and two of her sisters married three Dunham brothers. Kearney and his wife are buried in Fairview Cemetery in Labette County, Kansas. Descendants placed a headstone there in 2014.[70] Around the same time, a photo of him was discovered.[71][69] Barack Obama visited Moneygall in 2011.[72] In 2014, \"Barack Obama Plaza,\" a service station and visitor centre, was opened in Moneygall.[73][73] In 2015, a photograph of Kearney was discovered and made publicly available. In 2018, statues of Michelle and Barack were erected in Moneygall.[74]\n\nLolo Soetoro (1936–1987)\n\nLolo Soetoro, Javanese given name: Martodihardjo,[75][76] was the second husband of Ann Dunham (married on March 15, 1965)[77] and stepfather to Barack Obama. He is Maya Soetoro-Ng's father. After his divorce from Dunham, Soetoro married Erna Kustina. They had two children, Yusuf Aji Soetoro (b. 1981) and Rahayu Nurmaida Soetoro (b. 1984).[76]\n\nMaya Soetoro-Ng (b. 1970)\n\nMaya Soetoro-Ng, Obama's half-sister, was born in Jakarta, Indonesia.[78] She has a half-brother and sister, Yusuf and Aya Soetoro, from her father's second marriage. She is married to Canadian-American Konrad Ng, with whom she has two daughters, Suhaila and Savita. Maya Soetoro-Ng is a teacher in Hawaii.[79]\n\nKonrad Ng (b. 1974)\n\nKonrad Ng is Barack Obama's brother-in-law. He is of Overseas Chinese descent,[80] and his parents are from Kudat and Sandakan, two small towns in Sabah, Malaysia. Ng and his younger brother, Perry, were born and raised in Burlington, Ontario Canada.[81] Perry Ng works for the University of Ottawa.[80] He married Maya Soetoro-Ng at the end of 2003 in Hawaii.[82] They have two daughters, Suhaila[83][84][85] and Savita.[79] Konrad Ng is a U.S. citizen.[86] He was an assistant professor at the University of Hawaii's Academy of Creative Media.[87] From 2011-2015 he was the Director of the Smithsonian's Asian Pacific American Program. Since 2016, he has been the Executive Director of The Shangri La Museum of Islamic Art, Culture & Design in Honolulu. He studied philosophy at McGill University and cultural studies at the University of Victoria before getting his PhD degree from University of Hawaii at Manoa.[88][89]\n\nNg studies \"how minority and diaspora communities use cinema and digital media to engage in artistic and cultural representation and preservation, and community mobilization.\"[90] From 2011 to 2016, he served as director of the Smithsonian Asian Pacific American Center.[90][91][92]\n\nRobert Wolfley (1835–1895)\n\nRobert Wolfley, born in 1835, is one of Obama's maternal third great-grandfathers. He served as a private in Company A, 145th Ohio Infantry during the American Civil War. He died July 17, 1895, and is buried in the Olathe Memorial Cemetery in Olathe, Kansas.[93][94]\n\nJohn Punch\n\nAccording to Ancestry.com's research in 2012, using a combination of historical documents and yDNA analysis, genealogists found that John Punch, the first documented African slave in the American British colonies, has been documented as likely an eleventh great-grandfather of Obama through his mother, Ann Dunham, and her Bunch ancestors.[95][52] With intermarriage, there were eventually both white and African-American lines of descent from Punch; some Bunch descendants were classified as white by the early 18th century. Other Bunch descendants were considered free people of color. Ralph Bunche, U.S. minister to the United Nations, is thought by historian Paul Heinegg to have likely been an African-American descendant of the Bunch family via South Carolina and Detroit, Michigan.[52][96]\n\nJonathan Singletary Dunham (1640–1724)\n\nJonathan Singletary Dunham, born in 1640 in the Massachusetts Bay Colony, was one of Obama's maternal eighth great-grandfathers and is his earliest ancestor known to be born in North America.[3][97][98]\n\nPaternal relations\n\nObama's family in Kenya are members of the Luo people, the nation's second-largest ethnic group. Linguistically, Luo is one of the Nilotic languages. The Obama family is concentrated in the western Kenyan province of Nyanza.\n\nHussein Onyango Obama (c. 1895–1979)\n\nPaternal grandfather to Barack Obama, he was born Onyango Obama.[99] (One source gives 1870–1975 as his dates of birth and death, possibly based on his tombstone in his home village.[100] Barack Obama relates finding in 1988 a British document, based on a 1928 ordinance, recording his grandfather as 35 years old. The date of the document was estimated to be about 1930, which would mean that his grandfather had been born around 1895.[101]) The Luo are given names related to the circumstances of their birth, and Onyango means \"born in the early morning.\"\n\nOnyango was the fifth son of his mother, Nyaoke, who was the first of the five wives of his father, Obama.[102] Barack Obama relates how his step-grandmother Granny Sarah (Sarah Onyango Obama) describes his grandfather: \"Even from the time that he was a boy, your grandfather Onyango was strange. It is said of him that he had ants up his anus, because he could not sit still.\"[103] As a young man, Onyango learned to speak, read and write in English, the language of British colonial administration in Kenya.[104]\n\nOnyango worked as a mission cook and as a local herbalist.[103] He joined the King's African Rifles during World War I.[105]\n\nIn 1949, Onyango spent at least six months in Kamiti Prison. He was probably tried in a magistrates' court on charges of sedition or being a member of a banned organization. Records do not survive; all such documentation was routinely destroyed after six years by the British colonial administration. He was tortured to extract information about the growing insurgency seeking the independence of Kenya.[106] In his memoir, Obama recounted family descriptions of his grandfather's shocking physical state when released from prison:\n\n\"When he returned to Alego he was very thin and dirty. He had difficulty walking, and his head was full of lice.\" For some time, he was too traumatized to speak about his experiences. His wife told his grandson Obama: \"From that day on, I saw that he was now an old man.\"[104]\n\nOnyango was permanently scarred, suffering pain and requiring assistance in moving until his death. Although previously he had worked closely with British colonists, Onyango became bitterly anti-British after his abuse.[107]\n\nAccording to his third wife, Sarah, Onyango had converted from tribal religion to Catholicism early in life. When Seventh-day Adventist missionaries visited the Kendu Bay area many people were baptized into the church, including Onyango.[108] When he later converted to Islam, he took the first name Hussein. She said that he passed on the name of Hussein to his children, but not the religion.[109] Onyango is sometimes referred to as Mzee Hussein Onyango Obama. The word mzee (meaning \"elder\") is a Kenyan honorific. And to this day the Obama family in Kenya is divided between Seventh-day Adventists and Muslims.\n\nHabiba Akumu Obama (c. 1918–2006)\n\nAlso known as Akumu Nyanjoga and Sje.[110][111][112][113] She was Barack Obama's paternal grandmother, and the second wife of Hussein Onyango Obama. She had three children with Onyango: daughters Sarah and Auma, and son Barack (Barack Obama's father).[114] Her father was named Njango or Njoga,[115] and she was born and raised in the Western Kenyan village of Karabondi.[113][116]\n\nIn his memoir Dreams from My Father, Obama wrote that Akumu was miserable in her marriage and abandoned Onyango Obama and her children with him. She subsequently married again and moved to Tanganyika, now Tanzania. Her name Akumu means \"mysterious birth.\" Her mother conceived her after having given birth to another child and before resuming her menses. Akumu took the name Habiba upon her conversion to Islam in her second marriage, to Salmin Orinda, a Muslim from Wagwe, near Homa Hills, South Nyanza.[115] A photograph of her holding her son, Barack Sr., on her lap is on the cover of her grandson's memoir. (See image at right margin.)[117]\n\nSarah Obama (b. 1933)\n\nAunt of U.S. President Obama and elder sister of his father, daughter of Hussein Onyango and his second wife, Habiba Akumu Obama.[118] (She should not be confused with her stepmother Sarah Onyango Obama, also often called just Sarah Obama, the third wife of Onyango.)\n\nBarack Obama Sr. (1936–1982)\n\nBarack Obama Sr., Barack Obama's father, was the son of Onyango and his second wife Habiba Akumu Obama. Educated in the US at the University of Hawai'i and Harvard University, he returned to Kenya, where he became an economist with the government. He served in the ministries of transportation and finance. Obama Sr. was married a total of three times, and he fathered a daughter and at least four sons in addition to Barack II.[119]\n\nHawa Auma Hussein\n\nAunt of U.S. President Obama and younger sister of his father, born to Hussein Onyango and second wife Habiba Akumu Obama.[118] She is the sole surviving full sibling of Barack Obama Sr.[120]\n\nSarah Onyango Obama (b. 1922)\n\nSarah Onyango Obama was the third wife of Obama's paternal grandfather.[121] She is known for short as Sarah Obama; she is sometimes referred to as Sarah Ogwel, Sarah Hussein Obama, or Sarah Anyango Obama.[122] She lives in Nyang'oma Kogelo village, 30 miles west of western Kenya's main town, Kisumu, on the edge of Lake Victoria.[123][124] (She should not be confused with her stepdaughter of the same name, Sarah Obama, a daughter of Onyango's second wife Akumu.)[125]\n\nAlthough she is not a blood relation, Barack Obama calls her \"Granny Sarah\".[122][126] Sarah, who speaks Luo and only a few words of English, communicates with President Obama through an interpreter.\n\nOn July 4, 2008, Sarah Obama attended the United States Independence Day celebrations in Nairobi, hosted by Michael Ranneberger, the US ambassador in Kenya.[127]\n\nDuring the 2008 U.S. presidential campaign, she protested attempts to portray Obama as a foreigner to the United States or as a Muslim, saying that while Obama's grandfather had been a Muslim, \"In the world of today, children have different religions from their parents.\"[109] Sarah Obama is \"a strong believer of the Islamic faith\", in her words.[128]\n\nIn November 2014, Sarah Obama received an award from the United Nations for the work of an education foundation that she heads, as a part of Women’s Entrepreneurship Day.[129]\n\nKezia Obama\n\nKezia \"Grace\" Obama (also known as Kezia Aoko)[130] was born c. 1940.[131][132]) She is Barack Obama Sr.'s first wife; she married him in Kenya in 1954 before he studied abroad in the United States. They had at least two children together: Abongo [Roy] and Auma; and she has also claimed Bernard and Abo Obama as sons by Barack Sr.\n\nShe lives in Bracknell, Berkshire, England.[133] On March 22, 2009, Kezia Obama made a guest appearance on the British television show Chris Moyles' Quiz Night.[134] Her sister, Jane, is the 'Auntie Jane' mentioned at the very start of Dreams from My Father; she telephoned Obama in the US in 1982 to tell him that his father had been killed in a car accident in Kenya.[135]\n\nMalik Obama\n\nBarack Obama's half-brother, also known as Abongo or Roy, was born c. March 1958, the son of Barack Obama Sr. and his first wife, Kezia.[136] Born and raised in Nairobi, Kenya,[137] he earned a degree in accounting from the University of Nairobi.[138] The half brothers met for the first time in 1985[137] when Barack flew from Chicago to Washington, D.C., to visit him.[139] They were best men at each other's weddings.[137] The American Obama brought his wife Michelle to Kenya three years later, and they met with Malik again while meeting many other relatives for the first time.[140]\n\nMalik lives in the Obamas' ancestral home, Nyang'oma Kogelo, a village of several hundred people, preferring its slow pace to that of the city.[137] He runs a small electronics shop a half-hour's drive outside of town.[137] Although much of the Obama family has dispersed throughout Kenya and overseas, most, including Malik Obama, still consider their rural village on the shores of Lake Victoria to be their true home. They feel that those who have left the village have become culturally \"lost\".[141] A frequent visitor to the US,[140] and a consultant in Washington, D.C., for several months each year,[137] Malik has dual citizenship in Kenya and the United States.[142]\n\nDuring his brother's 2008 presidential campaign, Malik Obama was a spokesman for the extended Obama family in Kenya. He dealt with safety and privacy concerns arising from the increased attention from the press.[143]\n\nMalik ran for governor of the Kenyan county of Siaya in 2013.[144] His campaign slogan was \"Obama here, Obama there\" in reference to his half-brother who was serving his second term as the President of the United States. Malik garnered a meager 2,792 votes, about 140,000 votes behind the eventual winner.[145] Prior to the 2016 United States presidential election, he stated that he supported Donald Trump, the candidate for the Republican Party.[146] He attended the third presidential debate as one of Trump's guests,[147] wears a MAGA hat and socializes with Charles C. Johnson.\n\nAuma Obama\n\nAuma Obama\n\nBarack Obama's half-sister, born c. 1960, to Kezia, his father's first wife.[148] As of July 2008, she was a development worker in Kenya.[149] She studied German at the University of Heidelberg from 1981 to 1987. After her graduation at Heidelberg, she went on for graduate studies at the University of Bayreuth, earning a PhD degree in 1996. Her dissertation was on the conception of labor in Germany and its literary reflections.[149]\n\nAuma Obama has lived in London. In 1996 she married an Englishman, Ian Manners, although they have since divorced.[150] They have a daughter named Akinyi (b. 1997).[149][151] In 2011, Auma Obama was interviewed for Turk Pipkin's documentary Building Hope and was the subject of a German documentary film The Education of Auma Obama.\n\nIn 2017 Auma Obama was honoured with the fourth International TÜV Rheinland Global Compact Award in Cologne.[152] At the award ceremony, she received the bronze sculpture ‘Der Griff nach den Sternen’ (Reaching for the stars), solely made for the award, by artist Hannes Helmke.[153]\n\nAbo Obama\n\nSaid to be Barack Obama's half-brother, he is also known as Samson Obama,[154] and was born in 1968 to Kezia Obama. In Dreams from My Father, Obama wrote that his Obama relatives doubt that Abo and Bernard are the biological sons of Barack Obama Sr. Abo manages a mobile phone shop in Kenya.[155]\n\nRuth (Baker) Ndesandjo\n\nBorn Ruth Beatrice Baker in the United States around 1937, the daughter of Maurice Joseph Baker and Ida Baker of Newton, Massachusetts, who are of Lithuanian Jewish descent.[156] Ruth Baker was a 1954 graduate of Brookline High School in Brookline, Massachusetts, and a 1958 graduate of Simmons College in Boston with a degree in business.[156] She was a suburban elementary school teacher when she met and began dating Barack Sr. in Cambridge in June 1964, a month before his return to Kenya in August 1964.[156] She followed Obama Sr. back to Kenya five weeks later, and married him in Kenya in a civil ceremony on December 24, 1964.[156] She later became a private kindergarten director in Kenya.[157] She had two sons with Barack Obama Sr.: Mark and David. She and Barack Sr. separated in 1971 and divorced about 1973. Since she remarried when her sons were young, they took their stepfather's surname, Ndesandjo, as their own. Her third son, Joseph Ndesandjo, was born c. 1980 in her second marriage.\n\nMark Okoth Obama Ndesandjo\n\nBarack Obama's half-brother, born c. 1965, son of Barack Obama Sr. and his third wife Ruth Baker.[158] Mark Ndesandjo runs an Internet company called WorldNexus that advises Chinese corporations how best to reach international customers.[159] Mark was educated in the US, graduating from Brown University; he studied physics at Stanford University, and received an MBA degree from Emory University.[160]\n\nHe has lived in Shenzhen, China, since 2002.[160] Through his mother, he is Jewish.[161] He is married to Liu Xuehua (also spelled Liu Zue Hua in some reports), a Chinese woman from Henan Province.[162][163] He is an accomplished pianist and has performed in concert.[164]\n\nIn 2009, Mark Ndesandjo published a semi-autobiographical novel, Nairobi to Shenzhen: A Novel of Love in the East.[165][166] He published a memoir in 2013, entitled, Cultures: My Odyssey of Self-Discovery.[167] In it, he accused their father Barack Sr. of abuse.[168]\n\nDavid Ndesandjo ( c. 1967 – c. 1987 )\n\nBarack Obama's half-brother (also known as David Opiyo Obama), son of Barack Obama Sr. and his third wife, Ruth Baker, an American. He died in a motorcycle accident several years after his father's death in a car accident.[169][170]\n\nGeorge Hussein Onyango Obama\n\nYoungest half-brother of Barack Obama, born c. 1982, son of Barack Obama Sr.[171] and Jael Otieno. (She has since moved to Atlanta, Georgia as a full-time resident.)[172][173] George was six months old when his father died in an automobile accident, after which he was raised in Nairobi by his mother and a French stepfather. His mother took him to South Korea for two years while she was working there.[172] Returning to Kenya, George Obama \"slept rough for several years,\"[174] until his aunt gave him a six-by-eight foot corrugated metal shack in the Nairobi slum of Huruma Flats.[172]\n\nAs of August 2008, George Obama was studying to become a mechanic.[172] He received little attention until featured in an article in the Italian-language edition of Vanity Fair in August 2008 during the US presidential campaign. This portrayed him as living in poverty, shame, and obscurity.[175] The article quoted George Obama as saying that he lived \"on less than a dollar a month\" and said that he \"does not mention his famous half-brother in conversation\" out of shame at his own poverty.[176] In later interviews, George contradicted this account. In an interview with The Times, he \"said that he was furious at subsequent reports that he had been abandoned by the Obama family and that he was filled with shame about living in a slum.\"[173]\n\nHe told The Times, \"Life in Huruma is good.\" George Obama said that he expects no favors, that he was supported by relatives, and that reports he lived on a dollar a month were \"all lies by people who don't want my brother to win.\"[173] He told The Telegraph that he was inspired by his half-brother.[172] According to Time, George \"has repeatedly denied ... that he feels abandoned by Obama.\"[177] CNN quoted him as saying, \"I was brought up well. I live well even now. The magazines, they have exaggerated everything – I think I kind of like it here. There are some challenges, but maybe it is just like where you come from, there are the same challenges.\"[175] George Obama and the British journalist Damien Lewis published George's story in a 2011 book called Homeland.[178][179] George also appeared in the 2012 film, 2016: Obama's America, an anti-Obama documentary.[180]\n\nOmar Okech Obama\n\nAt times using a variation of the name of his father, Onyango Obama,[181][182] Omar Okech Obama is a half-uncle of Barack Obama.[183] Born on June 3, 1944, in Nyang'oma Kogelo, he is the eldest son of Onyango and his third wife, Sarah Obama. He moved to the United States in October 1963 when he was 17 years old as part of Kenya president Tom Mboya's Airlift Africa project, to send promising Kenyan students to the US for education, particularly undergraduate and graduate school.[181][184] Once he arrived in the country, his half-brother, Barack Obama Sr., found him a place at a boys' school then known as Browne & Nichols, in Cambridge, Massachusetts.[181] He later dropped out of school and changed his name to O. Onyango Obama.[181] He has operated a liquor store in Framingham, where he resided as of March 2011.[181][185] Barack Obama lived with Onyango in the 1980s while a student at Harvard Law School in Cambridge.[186]\n\nOmar Okech Obama was subject to a deportation order in 1989.[187] After an unsuccessful appeal, he was given a new deportation order in 1992.[187][188] He was arrested on August 24, 2011, for driving under the influence, or DUI,[187] and was held in jail until September 9, 2011, on a federal immigration warrant.[182][189] The Boston Herald reported in August 2011 that Obama had had a valid Social Security card \"for at least 19 years.\"[190] On November 30, 2012, the Board of Immigration Appeals remanded the immigration case to the Executive Office for Immigration Review for reconsideration of the original order of deportation, which was issued in 1986 and re-issued in 1992.[191]\n\nAn immigration judge ruled on January 30, 2013, that Onyango Obama would receive a deportation hearing.[184] Onyango's attorneys said that his defense at the December 3, 2013, deportation hearing would be a reliance on the Immigration Reform and Control Act of 1986, because Onyango had resided in the U.S. since before January 1, 1972, the cutoff date of the 1986 amnesty.[192] At the hearing, Immigration Judge Leonard I. Shapiro ruled that Onyango was eligible for permanent residence and would receive a green card.[193]\n\nZeituni Onyango (1952–2014)\n\nZeituni Onyango, half-aunt of Barack Obama,[194] was born May 29, 1952, in Kenya,[195] Onyango is referred to as \"Aunti Zeituni\" in Obama's memoir Dreams from My Father.[196] She entered the US in 2000 on a temporary visa with her son who was going to school; she applied in 2002 for political asylum due to unrest in Kenya and ethnic conflict. This was denied in 2004, but she remained in the country illegally. Her presence was leaked to the media during Barack Obama's 2008 presidential campaign. She was granted asylum in 2010. She died on April 7, 2014, from complications caused by cancer and respiratory problems.[197]\n\nMichelle Obama's extended family\n\nBarack Obama has called his wife Michelle Obama \"the most quintessentially American woman I know.\"[4] Her family is of African-American heritage, descendants of Africans and Europeans of the colonial era and antebellum eras.[4] Michelle Obama's family history traces from colonists and slavery in the South to Reconstruction to the Great Migration to northern cities, in her family's case, Cleveland and Chicago. Each of her four grandparents was multiracial.[198] Some of Michelle's relatives still reside in South Carolina. Extended family from her mother's Shields ancestors also reside in Georgia and throughout the South.\n\nJim Robinson\n\nMichelle's earliest known relative on her father's side is her great-great grandfather Jim Robinson, born in the 1850s, who was an American slave on the Friendfield Plantation in Georgetown, South Carolina in the Low Country, where African Americans developed as the Gullah people and culture. The family believes that after the Civil War, he worked as a Friendfield sharecropper for the rest of his life. He is said to have been buried there in an unmarked grave.[4]\n\nJim married twice, first to a woman named Louiser, with whom he had two sons, Gabriel and Fraser, Michelle Obama's great-grandfather. A daughter was born to the family, but her name has not been discovered, and she is believed to have died as a child. His second marriage to Rose Ella Cohen produced six more children. Fraser had an arm amputated as a result of a boyhood injury. He worked as a shoemaker, a newspaper salesman, and in a lumber mill.[4] Carrie Nelson, Gabriel Robinson's daughter, is the keeper of family lore and the oldest living Robinson at 80 years old in 2008.[4]\n\nAt least three of Michelle Obama's great-uncles served in the military of the United States. One aunt moved to Princeton, New Jersey, where she worked as a maid. She cooked Southern-style meals for Michelle and her brother Craig, when they were students at Princeton University.\n\nMelvinia Shields\n\nThe earliest known relative on her mother's side is her great-great-great-grandmother, Melvinia Shields (1844-1938), who was held as a slave on a farm in Clayton County, North Georgia. Her master was Henry Walls Shields, who had a 200-acre farm near Rex. He would have worked along with his slaves.[198] Melvinia became pregnant at about age 15 and had a biracial son, Dolphus T. Shields, born into slavery about 1860. Melvinia did not talk to relatives about his father.[199] Based on DNA and other evidence, in 2012 researchers said the father was likely 20-year-old Charles Marion Shields, son of Melvinia's master.[198] After the Civil War, Dolphus Shields moved to Birmingham, Alabama. Charles later became a teacher and married a white woman. Michelle Obama's extended family has said that people didn't talk about slavery time while they were growing up.[198] Michelle Obama's distant ancestry also includes Irish and other European roots.[200]\n\nOn June 26, 2012, a monument to Shields was erected in Rex, with an inscription summarizing her life and \"a five-generation journey that began in oppression\" resulting in her descendant becoming First Lady of the United States.[201] A year later, the monument was vandalized and knocked from its base, but was quickly replaced.[201]\n\nMarian Lois Robinson\n\nMarian Lois Robinson (born Marian Lois Shields, July 30, 1937), is descended from Dolphus Shields and his wife. She is now widowed, but had married Michelle's father, Fraser Robinson, on October 27, 1960.[202][203] Robinson was formerly a secretary at Spiegel catalog and a bank. While Michelle and Barack Obama were campaigning in 2008, Robinson tended the Obamas' young children. She continued to help care for them while living in the White House as part of the First Family;[204] she was the first live-in grandmother since Elivera M. Doud during the Eisenhower administration.[205] Some media outlets dubbed Robinson as the \"First Granny\".[205][206] Marian took Sasha and Malia to school daily.[207]\n\nFraser C. Robinson III\n\nMichelle Obama's father, born August 1, 1935, died March 6, 1991, married Michelle's mother, Marian Shields, on October 27, 1960.[203][208] Robinson was a pump worker at the City of Chicago water plant.[4]\n\nCraig Robinson\n\nCraig Robinson, Michelle Obama's brother, was born in 1962. From 2008 until 2014, he served as head coach of men's basketball at Oregon State University.[209]\n\nFraser Robinson Jr.\n\nMichelle Obama's paternal grandfather was born on August 24, 1912, in Georgetown, South Carolina, and died on November 9, 1996, aged 84. He was a good student and orator but moved from South Carolina to Chicago during the Great Migration to find better work and living conditions than in the South, where Jim Crow had been imposed and blacks were disfranchised. He became a worker for the United States Postal Service. He married LaVaughn Johnson. When he retired, they moved back to South Carolina.[4]\n\nLaVaughn Dolores Johnson\n\nMichelle Obama's paternal grandmother (February 6, 1915 – September 17, 2002) and wife of Fraser Robinson Jr. She was born in Chicago, Illinois, to James Preston Johnson (1880–1920?) and Phoebe (1879–1920?).\n\nRobbie Shields Terry\n\nRobbie Shields Terry (born Robbie Lee Shields; July 3, 1908 – June 1, 1983) was Michelle Obama's great-aunt: her mother's father's sister. In the 1940 census, she was listed as head of household,[210] with Marian Shields listed as niece.[211] Michelle Obama, in her memoir, Becoming, introduces Robbie and her husband, Terry, in the first chapter.[212] Her nuclear family moved into a small apartment on the second floor in their house while she was still a young child.[213] Robbie was Michelle's piano teacher[214] as well as nearest neighbor. When she died, Robbie, a widow, left the house to her mother, Marian, and father, Fraser Robinson, who moved downstairs.[215] Subsequently, Michelle moved into the second floor apartment while working at the law firm Sidley & Austin.[216] When Barack Obama settled in Chicago after graduating law school, he moved into this same apartment.[217]\n\nCapers Funnye\n\nCapers C. Funnye Jr. is Michelle Obama's first cousin once removed: his mother, Verdelle Robinson Funnye (born Verdelle Robinson; August 22, 1930 – April 16, 2000), was a sister of Michelle Obama's paternal grandfather, Fraser Robinson Jr. He is 12 years older, and Funnye and Obama grew to know each other as adults in Chicago, where both were involved in community organizing, along with Barack Obama. He is one of America's most prominent African-American rabbis, known for acting as a bridge between mainstream Jewry and African American Jews. He converted to Judaism after 1970, during years of activism when he regarded Christianity as having been imposed on slaves.[218]\n\nIndex\n\nKey : Underscored : Now or once a member of Barack Obama's household . Personal name bolded: Living\n\n: Note: Every link in this index is to entries in this article\n\nBy last name\n\nBy first name\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Michelle%2C_Malia_and_Sasha_Obama_at_DNC.jpg/220px-Michelle%2C_Malia_and_Sasha_Obama_at_DNC.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Barack_Obama_embraces_his_great_uncle_Charles_Payne.jpg/220px-Barack_Obama_embraces_his_great_uncle_Charles_Payne.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/50px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/70px-Seal_of_the_President_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/Barack_Obama%27s_Kenyan_relatives.jpg/220px-Barack_Obama%27s_Kenyan_relatives.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/50px-Seal_of_the_President_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Barack_Obama_family_portrait_2011.jpg/250px-Barack_Obama_family_portrait_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Family_of_Barack_Obama.jpg/220px-Family_of_Barack_Obama.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/President_Barack_Obama%2C_2012_portrait_crop.jpg/100px-President_Barack_Obama%2C_2012_portrait_crop.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/President_Barack_Obama%2C_2012_portrait_crop.jpg/75px-President_Barack_Obama%2C_2012_portrait_crop.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Barack_Obama_family_portrait_2011.jpg/1200px-Barack_Obama_family_portrait_2011.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Barack_Obama_signature.svg/130px-Barack_Obama_signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Auma_Obama.JPG/220px-Auma_Obama.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Barack_Obama_family_portrait_2011.jpg/1200px-Barack_Obama_family_portrait_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Family_of_Barack_Obama", "title": "Family of Barack Obama", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Barack_Obama_family_portrait_2011.jpg/1200px-Barack_Obama_family_portrait_2011.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}