{"url": "https://www.hollywoodreporter.com/news/ten-years-brokeback-jake-gyllenhaal-843951", "text": "\"I wasn’t really quite sure where he came from, and I think that’s the feeling most people got when they were around him and why he was so extraordinary,\" Gyllenhaal recalls.\n\nTen years after Jake Gyllenhaal starred in the landmark Brokeback Mountain — and almost eight years after the death of co-star Heath Ledger — the actor said he had no qualms about taking the role when it came his way.\n\n\"It’s one of the most beautiful scripts I’ve ever read, and it was Ang Lee, and at the time Heath [Ledger] was a friend of mine — before we even shot the movie — and always sort of alluring to me,\" Gyllenhaal recalled.\n\n\"Heath was always somebody who I admired,\" he continued. \"He was way beyond his years as a human, in a way. I wasn’t quite sure where he came from. I mean, I know he’s from Perth, but I wasn’t really quite sure where he came from, and I think that’s the feeling most people got when they were around him and why he was so extraordinary. And when that opportunity came, I was a young actor. I was like, 'Yeah, I’m in.' I know a lot has been made of the choice to do it, but it just didn't seem like something that was scary to me. You know, it was binding, because sometimes a lot of that character is very specifically the more overtly gay character of the two. The one who's struggling with it less. And I didn’t really realize that. And that was an interesting journey for me, giving in to that idea. Being the one who tries to push the relationship.\"\n\nGyllenhaal noted that one of the things that separated him and Ledger was that the former had little experience with animals, which he felt he needed to have for the role. \"It wasn't a connection that I had that was just in me,\" he said. \"Heath, you know, would walk up to a horse and could like silence the horse. Just literally he’d be like, 'Shh. Shh.' And then he’d get on the horse. I’d be like, 'I’m going to get on you.' They’d be like, 'F— off!’ I didn’t really have that style.' \"\n\nThe actor took part in THR’s ongoing interview series The Hollywood Masters, which took place Nov. 18 at Loyola Marymount University’s School of Film & TV.\n\nAsked if there will come a time when stars can openly be gay, he said: \"I wish I had that answer. I think it is changing. And it's pretty amazing how it's changing. And one of the things that I'm so proud of [about] that movie, was to see, within the past basically 10 years, how much has changed. When the Supreme Court [issued a ruling] just a little while ago, I felt like we had been part, a little part and parcel of that movement. I was proud, you know? To me that's really a pretty incredible moment. We had to wait a little while for it. But when will it be OK for an actor to be gay? I mean, it's OK now.\"\n\nA full transcript follows.\n\nGALLOWAY: You went to Columbia University — you dropped out halfway through, but you went to study Eastern Religions and Philosophy. Why and what did that teach you?\n\n\n\nGYLLENHAAL: To be honest, I was at a loss, I think, in a lot of ways. I was trying to figure out where my intellect, if I really have one, where it fit. And so I was searching. I really didn’t know who I was or what I really wanted to be, and in that search, like I think you do as an actor, you end up trying to define whatever that is, and I sort of said, “Oh well, searching spiritually in a way is interesting, and Eastern religion seems to be about a search.” And Robert Thurman was at Columbia, who’s one of the Western world’s most renowned thinkers in Eastern religion —\n\n\n\nGALLOWAY: — especially since his daughter started acting —\n\n\n\nGYLLENHAAL: Yes. Uma Thurman is his daughter. And there was a class called Intro to Tibetan Buddhism, and I just went in, and there were like 250 people waiting to get into this class. My sister actually was at Columbia at the time, and she was going to graduate, and she joined me there. It was the only class we took together, which was pretty cool. And they said, “OK, all freshmen leave,” and my sister was — whoop — “Stay.” And I was like, “OK.” And she was like, “Now all sophomores leave,” and I was like, “I should go.” And she was like, “Stay.” And then so on and so forth until the I was the only freshman there. And she said, “Now walk up to the TA and say, you know you’re a freshman, but you really want to take this class.” And so I did, and they were like, “Oh, yeah, sure, stay.”\n\n\n\nGALLOWAY: So she’s pretty savvy.\n\n\n\nGYLLENHAAL: All the other sheep just left, yeah. [LAUGHTER]. And that’s really my sister in a nutshell. And then I ended up staying and falling in love with the ideas. And it was a place where I felt creative, because at Columbia there’s no performing arts department, so I was searching for it everywhere I could, and I took some photography classes and I ended up becoming fascinated with Eastern Religion, and ultimately it seemed to encompass the more abstract mind that I have.\n\n\n\nGALLOWAY: So what fascinates you about it? Is it one particular religion, or one particular idea?\n\n\n\nGYLLENHAAL: No. That’s probably my problem. I think it’s more, at least at the time, a sense of abstraction. My mind doesn’t really work in a way where there’s a definitive sense of something. I go one way and then it opens up into a million different ideas, and somehow, when you look at the art, Buddhist art, or particularly Tibetan art, you know, it’s a similar thing. All of a sudden there are a million lotus leaves and you’re following one to the next and to another, and I related to that, and it felt simple and easy to me. And it made me feel smart — [LAUGHTER] — which other subjects didn’t make me feel.\n\n\n\nGALLOWAY: Which subjects did not make you feel smart?\n\n\n\nGYLLENHAAL: Every other one. [LAUGHTER] Because I could draw ideas. I remember writing a paper for a seminar class. I remember writing a paper about — and this is going to sound really sort of pretentious, but that’s where my mind was at the time — how acting and the performing artist can really be like a Bodhisattva, how they can communicate ultimately an idea in a way that can move and shift things. And that was wonderful. I didn’t know many classes where I could try and relate the thing that I really loved and wanted to do into an intellectual idea, and that happened to be one of them.\n\n\n\nGALLOWAY: Has that helped with your acting?\n\n\n\nGYLLENHAAL: No. On a spiritual level, on a place where you want to be a better human being and listen more, I try. I joke, but it has. I mean, I don’t consider myself a card-carrying Buddhist, you know. But I do believe deeply in the ideas, and I think anytime you have interest in anything, it somehow humbles you. So yes, I think it has.\n\n\n\nGALLOWAY: Your family was very creative. Your father’s a director, your mother’s a well-known screenwriter. Obviously Maggie, your sister, is an actress. How did they shape you?\n\n\n\nGYLLENHAAL: Oh, man. This is an hour right? [LAUGHTER] If I’m really honest, I think in positive and negative ways. You know, being the youngest, I constantly have that insecurity of being the youngest, which ultimately is probably my drive. in a lot of ways. In terms of as an artist, the way we could communicate as a family very clearly was through movies and through acting, and when things became complicated with all of our own personalities, that’s where we are most clear. I think that’s also where we are most brutal with each other as well.\n\n\n\nGALLOWAY: In what way?\n\n\n\nGYLLENHAAL: This is interesting, but I think we love each other so much and expect so much from each other, and I think we expect a type of honesty in the work that we all do. And I was brought up, and my sister too, with two people who were always saying, “What you do is really nowhere near as important as the things that are going on in the world, and if your work needs to reflect that, or you want it to, then you need to strive for a certain type of excellence.” Because things that are going in the world, particularly now, are no match to what art can do, you know? But you need to strive to try and communicate and try and change things in a similar way. And then people can think that’s pretentious or whatever, but it’s your life’s work, and you’ve decided that. That’s what they made us believe. So we have a pretty high standard, which is at times great and at times not.\n\n\n\nGALLOWAY: Which work of yours have they liked the best and which have they liked the least?\n\n\n\nGYLLENHAAL: [LAUGHS] My mom’s a big fan of Bubble Boy. No. My sister and I, and my brother-in-law too, who’s an actor —\n\n\n\nGALLOWAY: Peter Sarsgaard.\n\n\n\nGYLLENHAAL: — Peter Sarsgaard, he’s an extraordinary actor, and I would say that Peter has really brought into my life and my sister’s life a sense of presence as an actor that I never really understood or knew about until I met him. They’ve been together for a very long time, and he introduced me to the idea of the presentation. You know, as Uta Hagen would say, there’s the representational actor and the presentational actor. He immediately was a present, and he has always been a very presentational actor. It’s always about getting into who he is and bringing that always, not hiding behind a mask. You know, my sister came up to me recently after she saw this movie, Southpaw, the movie I did, and she thought there was this exploration of that type of presentation, and a bit of representation as well, if I could be totally honest, where she was deeply moved. And I think also what’s interesting is that she knows how much the choices that I make reflect what’s going on in my life. Admittedly, probably, as my sister, and as someone who loves me — like, she can’t wait to see become a father… There are a lot of different things that are spinning and connecting when your family sees what you do.\n\n\n\nGALLOWAY: What did you mean when you said: the choices that you make reflect what’s going on in your life?\n\n\n\nGYLLENHAAL: I could think of it two ways. When you have the opportunity to choose projects, inevitably you start being moved towards the things that you’re moved by, right? And that changes over time, as we change, right? I also think within the scene, a specific scene — if I were to play a part that I played 10 years ago now, my interpretation of that scene would be totally different. I would be making different choices. It’s actually [happening] right now in the movie I’m making: I’m doing one section of the movie where I’m playing 22 years old, which has been a very interesting thing for me. Because I can’t somehow subtract all of the experiences that I’ve had in my life. And it’s fascinating to see, because somewhere I’m very reflective in that. You know, I’ve been playing basically actually close to 40 years old, so I’m somewhere lost in age in this movie. But it’s been fascinating to see that I can’t subtract that time.\n\n\n\nGALLOWAY: How do you recreate yourself at 22?\n\n\n\nGYLLENHAAL: Some of it’s physical. You do what you can to make your body and your face and the impression. You have help from the cinematographer and how they light you and all that, and then I try and find and access the parts of myself that still blindly believe and have faith in a lot of things. I don’t mean to be cynical, but I’ve also discovered that I still have a lot of those. And they may not be where I expected them to be. Maybe I’ve been in relationships, and this is a movie about relationships, like romance relationships — so maybe I’ve been in some that have sort of made me lose my faith. But deep down inside, I still have blind faith, you know?\n\n\n\nGALLOWAY: You’re only 34, don’t lose it yet! [LAUGHTER]\n\n\n\nGYLLENHAAL: I was listening to this Adele song, where she’s like, “When we were young...” I was like, “You’re 27. Are you kidding me?\n\n\n\nGALLOWAY: But you feel so old when you’re young. And weirdly you feel younger when you get older.\n\n\n\nGYLLENHAAL: Yeah. I think that there’s definitely this sort of innocence, and I see that particularly with my parents, that’s totally accessible, always. It’s just how much you really want to access it.\n\n\n\nGALLOWAY: And great artists have to have some of that, right?\n\n\n\nGYLLENHAAL: I don’t know what you’re asking me, but I think so. I think so.\n\n\n\nGALLOWAY: You said something really interesting once: you said, “I’m a very political person, and I make political choices in my movies.” What did you mean by that?\n\n\n\nGYLLENHAAL: I have always had a deep belief that every movie, every artistic expression, is political. Don’t be fooled. Even ones that we wouldn’t consider overtly political are political. When we spend time doing anything, whether it’s distraction or whether it’s something that we have to face, it is always political. That’s my belief. Not to say that you should be constantly trying to change the world, but I think it’s important to know that whatever we do has an implication and has an effect, and because of that it is political.\n\n\n\nGALLOWAY: Have you made a political mistake — I mean, artistically have you made a political mistake, or a decision that you regret from that point of view?\n\n\n\nGYLLENHAAL: Every day, all the time. You mean specifically in a project? Or just behaviorally?\n\n\n\nGALLOWAY: Either one that you’d like to talk about is fine by me.\n\n\n\n[LAUGHTER]\n\n\n\nGALLOWAY: Just be warned, there’s a social media universe out there.\n\n\n\nGYLLENHAAL: Oh, I have, believe me. We were joking before, and we were taking a picture and he was like, “I realize I don’t know where these pictures go.” And I said, “When you take a picture, that’s how you should feel always.” Mistake. I don’t really know if I believe in that word. I guess the answer to that question specifically is, no. I don’t think I’ve made a mistake. I think I have behaved in ways that I am proud of; I think I’ve behaved in ways I’m not. I think that I have done work where I feel like I’ve challenged myself, and then what’s even more confusing is I’ve done work where I think I’ve challenged myself and no one’s responded to it, and no one’s interested in it. And then I’ve done work at times where I feel like, huh? Nothing’s happening and everyone goes [GASP] “Oh my God,” you know? So in that way, as an actor in particular, you’re powerless. And so in that way as an actor in particular you can’t make mistakes.\n\n\n\nGALLOWAY: Is this why you started producing recently?\n\n\n\nGYLLENHAAL: To make mistakes?\n\n\n\n[LAUGH]\n\n\n\nGALLOWAY: No, not to feel powerless. You produced Nightcrawler.\n\n\n\nGYLLENHAAL: Yes. I also have an ache to be a part of the whole. I love storytelling, you know, beyond anything. I love a great story beyond a great performance. Storytelling is about what we all do together and how we collaborate together. A performance can be a collaboration in ways, but oftentimes it’s one individual thing. I get off on the interaction with people, and I love the chess of a movie and particularly — not only in preproduction or in production or postproduction— the behavioral chess. That is, learning and being humbled by and also teaching certain people certain things. I love that. As a producer, you have an opportunity to see the whole and bring people together.\n\n\n\nGALLOWAY: Would you direct, too?\n\n\n\nGYLLENHAAL: Yeah.\n\n\n\nGALLOWAY: And going back to this idea that you love story — is there one story, one film —\n\n\n\nGYLLENHAAL: That was a mistake?\n\n\n\nGALLOWAY: No, I dropped that one. I’m letting you off easy, you know. That really resonates with you? One, growing up, that made you say, “This is what I want to do?” I often come back to this thing — do you know that Japanese film Afterlife?\n\n\n\nGYLLENHAAL: Beautiful movie, yeah.\n\n\n\nGALLOWAY: You’re set in sort of a way station between this world and the next.\n\n\n\nGYLLENHAAL: Like purgatory.\n\n\n\nGALLOWAY: And you’re allowed to take one memory with you. You know?\n\n\n\nGYLLENHAAL: I know I can’t beat Amy Adams answer to this question. That’s guaranteed.\n\n\n\nGALLOWAY: [LAUGHS] Did she talk about this with you? That’s so funny. You’re both very charming guests, so…\n\n\n\nGYLLENHAAL: Well, I will safely say she’s probably one of, if not the best actor that I’ve worked with. She’s extraordinary, and when I talk about working with people who are more talented than you, she’s definitely the first person, right now, particularly, that comes to mind.\n\n\n\nGALLOWAY: So is there one film that you would take?\n\n\n\nGYLLENHAAL: Pretty much almost any film by Audiard, I would say.\n\n\n\nGALLOWAY: Oh, Jacques Audiard. A Prophet?\n\n\n\nGYLLENHAAL: A Prophet, definitely yes, absolutely. As a whole, as a film.\n\n\n\nGALLOWAY: Say no more, what a great choice.\n\n\n\nGYLLENHAAL: A Separation is another film that I think is extraordinary, and one of those things that feels like it’s from another planet, much like Terrence Malick’s movies did: at a certain point, you feel like he’s an alien from another planet telling us and looking at us and showing us how we are. I also really, really love Jerry McGuire.\n\n\n\nGALLOWAY: Yes. It’s really good.\n\n\n\nGYLLENHAAL: West Side Story. I remember as a kid, those things that stick with you, Goonies. That has a profound resonance with me, that movie.\n\n\n\nGALLOWAY: Jake, you’re tumbling from my…\n\n\n\nGYLLENHAAL: [LAUGHS]\n\n\n\nGALLOWAY: We start with Jacques Audiard and we end up with Goonies.\n\n\n\n[LAUGHTER]\n\n\n\nGYLLENHAAL: Good. Good. Good. I like being up on stage with someone and they don’t know what they’re going to get. I appreciate that. And I’m slowly feeling like…\n\n\n\nGALLOWAY: Was there a moment when you decided “I’m going to be an actor?” You were in City Slickers at the age of 10. When was the moment where you said, “OK, I’m an actor”?\n\n\n\nGYLLENHAAL: I really don’t know if I feel that way now. I think it’s fleeting. I don’t think it’s something where I say, “This is something that…” Because as an actor, no matter what, you’re at the whim of so many other people all the time. Last night, when I was working with Amy, I was like, “I’m an actor!” you know? But that came really from watching her and feeling kind of — you’ve got to hash tag this —but feeling blessed that I was with her. You know what I mean? You have the feeling that, “I earned this exchange.” I did this Little Shop of Horrors encores performance at City Center this past June, and I was working with Ellen Greene, who originated Audrey, and I was on stage with her as she dies in the scene. She’s 64. You know, I’m 34, and I was a kid when I watched her do it in the movie for the first time. And it was this strange mix of sexuality and oddity and amazing, this voice that was confusing to me. As a kid you’re like, woof, that’s brutal and moving and so many things mixed up into one, which is why that performance is probably one of the most classic performances ever, her performance in Little Shop. And I’m sitting there holding her in my arms, playing Seymour, and thinking, “I have done all the work I’ve done to earn this moment,” you know? And I think, when you say, “When did you feel like an actor?” it’s those moments when I feel like, “I’m an actor, wow.” That’s an extraordinary moment for me. So it’s not like I walk around going, “I’m an actor.” I walk around thinking job to job, trying to not have regrets. Again, I would again bring up Amy, but there was this moment last night, it was like 3 a.m. and we were exhausted. She had done two super-brutal scenes, very hard emotional scenes, and she was just spent. And sometimes, when you’re in that space, you’re trying to find anything you can — like coffee or running down the street — to get motivation. And she just said, “That was too perfect. Can we just do it again, just one more?” And there was something about her not wanting to have regret, wanting to know when she walked home back to her trailer — she went home at 5 a.m. — that, “All right, I left as much as I could on the table.”\n\n\n\nGALLOWAY: Hugh Jackman said almost precisely the same thing about you with Prisoners.\n\n\n\nGYLLENHAAL: Really?\n\n\n\nGALLOWAY: Yes. I want to talk about your first big film. You did October Sky, and then you got the break that at the time wasn’t a big hit, but in retrospect is an extraordinary film, Donnie Darko. So let’s watch our first clip. I hope I chose the right scene.\n\n\n\nGYLLENHAAL: [LAUGHS] The red curtain.\n\n\n\nGALLOWAY: This is your life, Jake.\n\n\n\nGYLLENHAAL: Oh no, [LAUGHS].\n\n\n\n[CLIP] [APPLAUSE]\n\n\n\nGALLOWAY: It's such a wonderful film. I don't think I realized that when I first saw it, and then I watched again last week. It's spooky and haunting.\n\n\n\nGYLLENHAAL: [pointing to an audience member] This dude in the hood is, yeah.\n\n\n\n[LAUGHTER]\n\n\n\nGALLOWAY: So, Jason Schwartzman was meant to play this part.\n\n\n\nGYLLENHAAL: Yes.\n\n\n\nGALLOWAY: Dropped out, you came in.\n\n\n\nGYLLENHAAL: Yeah.\n\n\n\nGALLOWAY: How did you get in? How did you prepare for that role?\n\n\n\nGYLLENHAAL: Well at the time Jason and I — he's a friend of mine. I remember him preparing for a long time, and then at the very last minute it all fell apart. And he had just done Rushmore and he's incredible in that. And I felt this, this pressure, you know. I went in to meet with [director] Richard Kelly and he was desperately looking for an actor, because he wanted to go. He had been really satisfied with what he had and then it all fell apart. And he was like, “I just want to put it back together, I don't want to lose it.” You know. “You seem cool.” So there was that, there this actor who I just always thought was great and I didn't know. And I felt that way the whole time I was doing it. I thought, “Man, Jason would be so good in this.” And he would have been. That's the other thing about playing roles: You I'm fascinated to know what other actors have done with the roles that I play.\n\n\n\nGALLOWAY: Did you talk to him about what he would have done with it?\n\n\n\nGYLLENHAAL: No. We did not talk about that, no. I remember it all happening very fast.\n\n\n\nGALLOWAY: Were you nervous about doing it or did you not know enough at that point to be nervous?\n\n\n\nGYLLENHAAL: I'm always nervous about it. You know, somehow, without even knowing it, I try and recreate the idea of what it feels like to go in front of an audience every night when I'm making a film. And that similar type of pressure and excitement before a scene, or preparing for a movie, so...\n\n\n\nGALLOWAY: That's interesting, because I would have though your goal would have been to relax, not to build the pressure up on yourself.\n\n\n\nGYLLENHAAL: There are standards. I like to be prepared, I guess I should say — that type of pressure of, “All right, now you go with abandon,” you know. Now when you're in it, you let go of all the things — that’s what happens when you're onstage. You have formal rehearsal, a lot of things you don't have in movies — which is, you have to formally rehearse. You have to know your back story, discuss it, and almost everybody onstage has to know each other's [story], so that when it comes time to actually do it, you can throw it all away. That's the way I like to — and I didn't realize until very recently — that's the way I like to prepare for movies.\n\n\n\nGALLOWAY: Have you worked with an acting coach? I don't think you ever took any formal acting lessons, did you?\n\n\n\nGYLLENHAAL: When I was younger, I did. I went to this place called Actors Space in the Valley. I was pretty young, and we were doing acting and improvisation. But no, no I didn't go to RADA, I didn't do that. But I do now work with an acting coach, primarily for the initial intellectual connection to the material. And then sometimes you need an anchor, whatever it might be. You need a space to connect. So often you get into a way of doing things. You have your typical way of preparing and you're like, “OK, I'm ready.” And then you're a bit lost, because you don't have something to connect to whatever it is. And that's what she provides for me. And oftentimes, too, just knocking me around a little bit. There's no real plan with us and I don't really ever have that. It's just knocking you out. As an actor, too, I feel like I'm somebody who, when somebody gives me a mark, I don't want to hit it. I don't like that. But then, without even knowing it, I just hit it. And then it traps me You know, that's the nature of an actor in a lot of ways. I was working with Michael Shannon on this movie I'm doing now, and I was like, \"Oh man I'm having trouble with this scene.\" And he's like, \"Well, then just open it up.\" I was like, \"But, the mark?\" And I was like, what's wrong with me? And he was like, \"Dude, what's wrong with you?\" [LAUGHTER] There's the nature of an actor that, someone says “Go over there and do this,” and you go like, \"OK. Yes I can do that so well.\"\n\n\n\nGALLOWAY: Because you want to please?\n\n\n\nGYLLENHAAL: There's part of that. And I think, for me, there's also that I understand the opposite side of the camera. I have a profound respect for that. I have worked with people who, when you hit that mark, are doing 50 percent of your work for you. So, you know, it's a balance. When you walk into a mark and you're lit a certain way or something's happening so often you don't know what's behind you... And that's what's so strange about being a movie actor.\n\n\n\nGALLOWAY: Did you expect Donnie Darko to be like this when you were shooting it? Or did you think it was going to be a different kind of film?\n\n\n\nGYLLENHAAL: I thought — I mean, I was 19, I thought it was going to be the best movie ever made. [LAUGHTER] And everyone was going to see it and it was just going to be incredible. And then nobody saw it and it didn't get bought at Sundance. And it was a really great experience. Humbling. And then it's since found its way.\n\n\n\nGALLOWAY: Do you understand what's going on in the film?\n\n\n\nGYLLENHAAL: Yes.\n\n\n\nGALLOWAY: If you go to the web, as you know, there are websites devoted to Donnie Darko and the Tangent Universe.\n\n\n\nGYLLENHAAL: There are websites?\n\n\n\nGALLOWAY: Oh, absolutely —\n\n\n\nGYLLENHAAL: Oh, wow, oh.\n\n\n\nGALLOWAY: — regularly updated, that explain the Tangent Universe, that explain the concept of time travel.\n\n\n\nGYLLENHAAL: [LAUGHS] I don’t understand. That’s a real waste of time.\n\n\n\nGALLOWAY: You said, “I don't understand it.” So I wondered if that had changed.\n\n\n\nGYLLENHAAL: I do. I mean, we started the conversation starting about abstraction, and about why I connect to material and for what reason. Often times it's really hard for me to articulate why I connect to something. But I know exactly what that movie's about. I can't define it; it doesn't tie up in a perfect bow. But it's about adolescence. It's about what it feels like — this isn't meant as a criticism, but like things I didn't relate to, which were high school movies. Where I'd watch it and I'd be like, “Well, am I like the kid that nobody likes? Or am I like the person who everybody [likes]?” I couldn't [tell]. I was like quantifying, putting me in a box. “This is my personality at that age” and “I'm this kind of person” just felt like bullshit to me. And to me Donnie Darko was about adolescence. And about how, as soon as you start to grow up and you sort of move out into the world, you realize everything is so trippy. That anything can be anything. And that's equal amounts exciting as it is frightening. And that you can make a connection, but the connection can be with a rabbit, and a man in a suit. And that you can see things and people can think you're crazy, but you're actually not. I think that's what that movie is to me. And there are all these ideas that Richard threw in there — Stephen Hawking's ideas and things like that.\n\n\n\nGALLOWAY: You've made some very bold choices and I wonder, when you came to do Brokeback Mountain, if you were frightened of that? Let's watch. It's very hard to get a short clip.\n\n\n\nGYLLENHAAL: I know. I'm trying to figure out what clip you picked. I'm like, “Here we go. All right!” [LAUGHTER]\n\n\n\nGALLOWAY: You can guess? This is towards the end of the movie.\n\n\n\n[CLIP] [APPLAUSE]\n\n\n\nGALLOWAY: Does that bring back memories?\n\n\n\nGYLLENHAAL: Yeah. It definitely does. I was like, “It definitely does.” [LAUGHTER] Yeah it does. It's funny, I was thinking about it: I haven't seen that in a while, but so many jokes have been made about \"I can't quit you.\" It's like, “My God!” And it's not even on my face. The shot is on my back.\n\n\n\nGALLOWAY: Right, it was very strong seeing that. But it's one of the great movie lines and everybody who has been in an intense relationship has got to that point.\n\n\n\nGYLLENHAAL: Isn't that amazing?\n\n\n\nGALLOWAY: I love the fact that it's not on your face.\n\n\n\nGYLLENHAAL: Not on your face. The power of the story.\n\n\n\nGALLOWAY: It's amazing how the world has changed because, at that time, a lot of actors didn't want to play a gay role.\n\n\n\nGYLLENHAAL: Mm-hmm.\n\n\n\nGALLOWAY: Did you feel that pressure?\n\n\n\nGYLLENHAAL: Now everybody does.\n\n\n\n[LAUGHTER]\n\n\n\nGYLLENHAAL: Did I feel the pressure? No. I think maybe naively, but also just I had been brought up a different way. I had been brought up in an elementary school where, my first few grades, I remember being specifically told that my teachers were gay. I was just that age and that was just how it was, and my parents were very... You know, that's how I was raised. Like super-progressive. And so it's just something I took for granted, weirdly. At the time. I think, now, younger generations do take that for granted in a lot of ways. I don't think that takes away from the struggle of identity and what that is. But the struggle for identity is everybody's struggle. No matter what it is.\n\n\n\nGALLOWAY: Do you struggle for identity?\n\n\n\nGYLLENHAAL: I'm an actor.\n\n\n\n[LAUGHTER]\n\n\n\nGYLLENHAAL: I mean it. Totally relatable. You know what I mean. But at the time, I just went, “It's Ang Lee.” It's one of the most beautiful scripts I've ever read and it was Ang Lee, and at the time Heath [Ledger] was a friend of mine — before we even shot the movie — and always sort of alluring to me. Heath was always somebody who I admired. He was way beyond his years as a human, in a way. I wasn't quite sure where he came from. I mean, I know he's from Perth, but I wasn't really quite sure where he came from and I think that's the feeling most people got when they were around him and why he was so extraordinary. And when that opportunity came I was a young actor. I was like, “Yeah, I'm in.” I know a lot has been made of the choice to do it, but it just didn't seem like something that was scary to me. You know, it was binding, because sometimes a lot of that character is very specifically the more overtly gay character of the two. The one who's struggling with it less. And I didn't really realize that. And that was an interesting journey for me, giving into that idea. Being the one who tries to push the relationship. And I think in a very simple way people would say, “Oh the sort of more female character.” I don't even know what the hell that means, but I've been told that many times — you know, the one who wants the relationship or something. That was an interesting thing for me.\n\n\n\nGALLOWAY: How did you prepare for that?\n\n\n\nGYLLENHAAL: Heath and I spent a lot of time, a lot of things were just about... The biggest thing, and this is going to sound odd, but the biggest thing that I did was: I had not spent a ton of time around animals as a kid. It wasn't a connection that I had that was just in me. Heath, you know, would walk up to a horse and could like silence the horse. [LAUGHTER] Do you know what I mean? Just literally he'd be like, \"Shh shh.\" And he'd be like [MAKES HORSE SOUND]. [LAUGHTER] And then he'd be like, \"I'm going to get on you now.\" [MAKES HORSE SOUND]. And then he'd get on the horse. I'd be like, \"I'm going to get on you.\" They'd be like “Pfft, f—k off!” [LAUGHTER] I didn't really have that style, so one of the things I did was: I got a dog. I know it sounds funny, but I got a dog and that dog died six months ago.\n\n\n\nGALLOWAY: Oh.\n\n\n\nGYLLENHAAL: Yeah.\n\n\n\nGALLOWAY: What kind of dog?\n\n\n\nGYLLENHAAL: He was a German shepherd. His name is Atticus and he taught me. So, that was the first thing. And the other thing was, really, I talked to a lot of people. A lot. Particularly just hearing stories. Ang gave us a lot of books about cowboys who had been gay or stories about it and all that stuff. And I just talked to a lot of my friends —who [was] their first, particularly same-sex, first situation. That was fascinating to me —trying to learn what that was in a certain period of time. Certain age. The secrecy involved in it. All those things.\n\n\n\nGALLOWAY: What surprised you most about what you found out?\n\n\n\nGYLLENHAAL: Just the secrecy of it. How much it had to be. And then [that] became a part of their idea of sexuality. That was fascinating to me. That we all develop relationships with each other based on our first relationships, and then how we experience them. But inevitably they are echoes of earlier on. In my belief. And so when something is not accepted, somehow that becomes part of how we become attracted to it. Does that make sense?\n\n\n\nGALLOWAY: Yes, absolutely.\n\n\n\nGYLLENHAAL: So I was fascinated with that. That what ties these two characters together is not just a love, but a loneliness. I think primarily it was deep loneliness. And what I always say about that movie, which I think maybe over time is more understood, is that this is about two people desperately looking for love. To be loved. And who were probably capable of it. And they just found it with someone of the same sex, you know. And that does not dismiss the fact that it is about, really, primarily, the first kind of very profound gay love story. Hopefully it can create an equality of an idea: that is, it's possible that you can find love anywhere. That intimacy exists in so many places that convention and society won't always allow us to see. And we won't allow ourselves to see, because of what criticism — and danger, really — it might provoke.\n\n\n\nGALLOWAY: It's still hard for a movie star to be gay. I mean, if you're going to be a character actor, it's one thing. When will that change?\n\n\n\nGYLLENHAAL: You're asking me? [LAUGHTER] When will that change? Look, I mean to ask, I think, when a lot of things will change? I wish I had that answer. I mean, I think it is changing, first of all. And it's pretty amazing how it's changing. And one of the things that I'm so proud of, in terms of being in that movie, was to see how, within the past basically 10 years, how much has changed. You know. When the Supreme Court passed just a little while ago, I felt like we had been part, a little part and parcel of that movement. You know. My parents taught me as a kid: do your work. Do it well. Try as hard as you can, whatever it is. It will one day, for the long [run], it will make some sort of change somewhere. You know, that happened there. It was so deeply moving to me that day [when the Supreme Court gave a ruling in favor of gay marriage] when my mother — I remember I was at Little Shop of Horrors. We were in rehearsal. I was freaking out, because we had like six days of rehearsal and four performances. It was a staged reading, and it was like, I didn't know what I was doing. And we were in rehearsal and my mom sent me the decision. And she just said, “Sometimes love does win out,” I remember. And I was just super proud. I mean I was proud, you know? To me that's really a pretty incredible moment. We had to wait a little while for it. But when will it be OK for an actor to be gay? I mean, it's OK now.\n\n\n\nGALLOWAY: Michelle Williams said Ang Lee was very tough on the boys. In what way?\n\n\n\nGYLLENHAAL: Well, I think it's a cultural thing, in a way. We are all from different cultures, you know. Heath's Australian, really. I'm from here. Ang's from China. But I think Ang gets very close in preproduction and rehearsals. And then he allows his actors — I don't think scared of actors, but I think he's scared of getting in on the scenes he's watching. The space he's watching. So he just totally disconnects from you while you're shooting. And I think it's amazing what happens because he gets very close and then he lets you off these reins, you know, and you're like [MAKES NOISE]. And I think he was aware of what the stakes were. And he had high expectations for us, you know. And we had a lot of burden to carry with that relationship and those two characters. A lot. I mean there was a lot there and he had to get it right. And he's tough, you know? I mean, he just is and that's what makes him the extraordinary director he is. And I have grown, and I do love that from my directors. When they push you.\n\n\n\nGALLOWAY: I know you very much like working with Sam Mendes on Jarhead. Did he direct you on stage? Did he do the Kenneth Lonergan play?\n\n\n\nGYLLENHAAL: No. He didn't.\n\n\n\nGALLOWAY: OK. Why do you like working with him so much? What makes a director that you as an actor respond to?\n\n\n\nGYLLENHAAL: Well he just allowed me to make what we would call mistakes and had no judgment of them. He also empowered me. You know, he's like, \"You're my actor. I chose you. Whatever you do is right.\" Right? \"I made the decision, I'm complicit in choosing you. And I went through everything I could to choose you, so I feel good and whatever you're going to do I'm going to give you this space.\" And so it was very empowering. It was like he just completely gave me this confidence. And at the same time was very aware of my instrument and how to sort of push and pull it. I like the conscious manipulation that a great director can have. When you're both complicit in the manipulation of an emotion. Meaning, Sam sometimes would come up to me and he would start talking to me and we'd be talking about a scene and then he would just walk away from me. And it would piss me off. And then he'd roll the camera in this very... and it would boil up in me in this way and I just realized he kind of tied something up and then he snapped it off and he just shot it. And being aware that he was starting to mess with me ended up really feeling, I don't know if this sounds really dark, but like it really felt great, you know. We were in a relationship where we were aware of what was happening. And he's just so smart, too. There's always an intellectual side to the films he's doing and to the characters, and there's such a deep knowledge when you've worked with the actors that he's worked with, on stage in particular, but also in film.\n\n\n\nGALLOWAY: Do you think intellect helps or hurts an actor?\n\n\n\nGYLLENHAAL: I think, in the initial process of discovering a character and the analytical process — and this is what I did take from Buddhism —initially I think there has to be an analytical, intellectual approach. And that has to be abandoned by the time you’re playing the game. You run your plays, you know your plays, you study your plays, you study the other team, you do as much as you can, you go to practice, you get in shape, you do what you need to do, and then by the time you get to the game, you know your plays, but they have to feel like they’re in your bones. That has to be an unconscious thing, it cannot be conscious. That is everything to me.\n\n\n\nGALLOWAY: And can you maintain that, take after take?\n\n\n\nGYLLENHAAL: No.\n\n\n\nGALLOWAY: OK, so now I want to talk about your work with a director who demands take after take, and how you do that. So we’re going to look at a clip from —\n\n\n\nGYLLENHAAL: Zodiac. [LAUGHS]\n\n\n\nGALLOWAY: Zodiac, yes. You’re on the trail of a serial killing and this may be the guy right here.\n\n\n\nGYLLENHAAL: What’s it about?\n\n\n\n[LAUGHTER]\n\n\n\n[CLIP] [APPLAUSE]\n\n\n\nGALLOWAY: I love the way you’re looking at that thing, and realizing, “Oh my god, this guy might be the killer,” and it’s perfectly calibrated. You know, it would be so easy to do too much, or not enough, and it’s this realization that we can feel, and then you go into the basement and we’re all screaming, “Get out of the basement, get out of that basement!” Jane Fonda was here, and she said the toughest emotion for her to act was fear. What’s the toughest for you?\n\n\n\nGYLLENHAAL: The easiest is anger, not just for me but in general. I think volume is also very easy. That’s always a default to go to. Hardest emotion? They’re all pretty damn hard; I don’t know really if there’s one specifically, but I do think, I don’t know what’s happening or what I’m feeling when I’m actually listening. I remember Chris Cooper saying to me — I was doing October Sky with him — and he said, “You know, you’re just yelling at me.” He’s like, “You’re just yelling. You need to listen.” We were in a fight, and you know, oh you’d get so excited as an actor, you’re like, “We have a fight, oh, I get to get mad.” And he just said, “You need to listen.” And I started listening — and then all of a sudden where I was listening was where, I don’t know, anger became something else. But I don’t know about what the hardest one is. I think I’m generally — fear, fear is very still, so in terms of that kind of fear — there’s so many different kinds of fear, but fear is something, particularly in movies, that’s interesting, because it’s created by the film maker, that was created by Fincher, that’s why he’s brilliant. So, to me it’s more important, in terms of the director, because whatever story’s being told has to be water-tight, and then whatever movement you make, like I said, you have to do less, or you know, or the opposite of.\n\n\n\nGALLOWAY: He’s a very meticulous director, and does take after take after take. Do you like that? And how do you work with a director like that?\n\n\n\nGYLLENHAAL: I don’t think I had any idea at the time how to work with someone as masterful as he is. And I don’t think at the time I really understood what was happening. I think I was in a space where I was like: there are all these things. I remember when we were filming, when Brokeback Mountain was coming out, and there were all these awards and stuff, and every night they were asking us to go to somewhere else, and I was shooting all these takes with David, and I was just confused, as a person, and as an actor feeling a little too big for my britches and that this thing was happening and then also not having enough skill yet, and technique to know exactly where I was, and know about the character. So, when I look at that now, all I think about is what a master I was working with, and all of the things I could have watched and learned — and I didn’t. And how, now, in my career, how I would love to have a ton of takes.\n\n\n\nGALLOWAY: That’s so interesting.\n\n\n\nGYLLENHAAL: It’s to be cherished, and I think that’s a big thing you learn, too. I think I work as hard as I do now, because of a lot of lessons I’ve learned early on. And the amount of preparation I saw from someone like Fincher, and how aware he is of everybody else’s job on the set, and how much respect he has for every aspect of the film, and every aspect of the frame — that’s the type of actor I am now; it’s not the type of actor I was then. But without understanding his process, and then coming to learn it later on, I would never be the actor I am now.\n\n\n\nGALLOWAY: You said you had an epiphany when you were 30 years old, but you did great work before then too.\n\n\n\nGYLLENHAAL: You’ve always been sweet about that. Thank you. [LAUGHTER]\n\n\n\nGALLOWAY: It’s not just, “Oh wow, you’ve done Nightcrawler and Southpaw and End of Watch, which I love. You did extraordinary work before that. What was the epiphany? Was it triggered by Prince of Persia, which wasn’t a success? What led to it and how did you change?\n\n\n\nGYLLENHAAL: I don’t want to be lofty when I say this, but I don’t know what a success is any more. I know how we define it, but that was a moment where I went, “Wait, who am I?” You could feel the business, in particular, kind of go “He’s all right, let’s go over here.” I started to go, “Wait, I know why I love to do this.” I think I got off track in why I love to do it. And I like the privacy of it, I like the intimacy of it, I like that when you create you really do create with a very small group of people, and in that space, before it goes out to all these people, that’s what I love. And so I went, “I’m going to give everything to that. The result of that doesn’t really matter,” and ultimately, it’s something I have no control over. Though, it looks like that when it’s your face. So I went, “I’m going to give everything in preparation to that process, and the world before it.” I started to realize I love study, I love the study of human behavior, I love how you’re sitting and the reason you tied your shoes the way you did, I love your —\n\n\n\nGALLOWAY: You know the reason why I tied my shoes the way I did? [LAUGHTER]\n\n\n\nGYLLENHAAL: Probably because you’re not great at tying your shoes. [LAUGHTER]\n\n\n\nGALLOWAY: No, I feel in a nine-foot deep hole in Cuba.\n\n\n\nGYLLENHAAL: No way.\n\n\n\nGALLOWAY: Really banged up my foot, so if I do it too tight it hurts, but there is a reason, and I’m impressed that you observed that.\n\n\n\nGYLLENHAAL: But that, to me, that’s everything, to me that’s so fun, I mean, that’s where I went like, I mean, wherever you find your fun, you know.\n\n\n\nGALLOWAY: It wasn’t much fun.\n\n\n\nGYLLENHAAL: Yeah. [LAUGHS]\n\n\n\nGALLOWAY: Being yanked out, you know.\n\n\n\nGYLLENHAAL: Well, you’re not a professional shoe-tier, nor should you be because that’s sort of shameful, but I would say that —\n\n\n\nGALLOWAY: I’m wearing a brand new suit here.\n\n\n\nGYLLENHAAL: Your suit’s a lot better. [LAUGHS] But you’ve got to find your fun, like I found, when I talk about being onstage, I just get excited, it makes me excited. I feel like my life is worthwhile. I wake up in the morning and I’m like yeah, you know, and I think about walking from my apartment to the subway, , getting on the subway and going up to the theater, walking and saying hi to everybody on my way there, walking into the theater. I may be tired, but I just —\n\n\n\nGALLOWAY: When you had that epiphany, was it while you were making a film, and what was the first film that you made after that?\n\n\n\nGYLLENHAAL: End of Watch was really the movie that I made where it was quiet, everything was quiet.\n\n\n\nGALLOWAY: Which is such a wonderful film. And then you formed this collaboration with Denis Villeneuve.\n\n\n\nGYLLENHAAL: Yes, that was quiet too, until everybody fell in love with Denis. Now it’s really loud.\n\n\n\nGALLOWAY: Let’s take a look at Prisoners, which is really excellent. This is a very brutal scene, I should warn you. Here we go.\n\n\n\n[CLIP] [APPLAUSE]\n\n\n\nGALLOWAY: A really good scene. You play the cop, a detective with a tic, with a slight nervous tic, which again is beautifully calibrated. How did you create that character, and what led to the tic?\n\n\n\nGYLLENHAAL: I read the script, and I had this idea. He was a sort of blank canvas, that character, on the page. There were many choices that could be made with him, and I just got this idea while I was reading it _ that it would be fascinating in a who-done-it story to have the cop be the big question mark. Who, essentially, I knew in the end was the good, really, fundamentally good guy. But if I could f—k with the audience enough to think that, in their conventional idea, he maybe could be the bad guy, through most it. Then it’d be super fun. Because it meant, it gave me a world of choice throughout every scene. So all of a sudden those somewhat bland scenes of interrogation and things you see in so many movies became — you know, you opened yourself up to a world of myriad choices, and so something came to me physically, it came from that weird place of instinct where I went, “Oh, what if he’s holding back, obviously, his feelings?” He’s a young guy, but he’s seen a lot, and he’s never been able to fully expression himself, so much verbally and maybe that inability to express comes through a sense of sort of frustration, and maybe that frustration’s communicated in a tic of some kind, and I felt that in my eyes, somewhere, and I got together with Denis, who I have a very open, creative relationship with, and I just started playing around with it, and clearly it freaked him out when I first did it. I was like, [blinks this eyes]. He was like, “Uh, you know…” And I know in his mind, he’s like, “How am I gonna f—ing edit that? Do we edit on the blink, before the blink, after the blink, and I’m like exactly. [LAUGHS] So, I had that initial idea, and then I just started, then everything sort of spun out from there. I was fascinated. I love Serpico, you know, and I was thinking about police officers, and I had a lot of police officer friends from my work on End of Watch, very close detective friends. I didn’t play a detective, but they were all detectives, and they were amazing men that I met on that movie. And so I started stealing from them. Like, I love trying to figure out, like who pulled the wool over my eyes, it’s just my thing, I’m like hmm? You know. ‘Cause I think as an actor you have that nature, you’re kind of like, what’s really going on? And so that instinct led me also to just the primary research of interrogations, and before that scene in particular, I watched a videotaped interrogation where the suspect actually shot himself, for real. And so, I walked into that scene with the reality of these things actually happening. Because when I read it on the page first, I went like, “Uh, this feels like a kind of writerly thing,” you know. It felt like that, it didn’t feel super real to me. And when I searched far enough, I found that, that happens quite often.\n\n\n\nGALLOWAY: Wow.\n\n\n\nGYLLENHAAL: You know, there were these amazing, really, really hard things to watch of suspects in the room, sitting there, not having been searched. There was one guy that happened to have been searched properly by the police — there’s so many different ways a suspect gets the detectives. When they finally get to the detectives, there’s a sense of like, they’ve been searched, they’ve been put in a cell for long, they’re finally there in the room to be interrogated, there are a lot of assumptions made by every step along the way, and obviously sometimes mistakes were made. And in this case that I saw, he still had a gun on him. So he was handcuffed, and here’s there, who knows what it is, and the officer walks in, he’s on his phone, asking him, doing what you do normal, very normal. And he says, “You want a glass of water?” The guy says yes, officers walks back outside, and when he walks outside to get a cup of water, the guy pulls a gun out of nowhere — he still had his gun on him that they hadn’t found — and he just shot himself, and that made that real. You know, I think I’m not in this work to not look at life as it is. I’m not in it to say, “I want to wear a mask and escape,” you know. I want to know what’s happening in the world, and I want to have it touch me in a way that I can do something, my little part like that, and have it somehow translate. And so that’s what I did there, you know, that’s a specific work, but in terms of creating a character, I will also give massive credit to Donald Mowat, who’s the makeup artist on that movie, who I met on that movie. And, he gave me the idea that there is no continuity, that there is no real continuity ultimately, particularly on the face or in a character. We can walk out of this room differently than we walked in it, through a door, whatever our exchange is, my face can look different, it actually can, given what happens, and doesn’t mean you get punched, you have a black eye. Emotionally there are things happening that affect us. And he was the first person to really show me that through that through makeup, something that a lot of people consider to be a very vain sort of department at this day and age now, in a lot of ways — he really opened my eyes. It was beautiful. I walked in — in that movie I get shot in the head at one point — and I walked in that day — this is also where I think the universe deliveries pretty interesting things where, if you listen enough, you know, it will reveal itself somehow — I had a headache. I was just like, “Ahh man, my head is killing me today.” And Donald’s like, “That’s great.” [LAUGHS] And I was like, “Ohh.” He’s like, “Where?” I said, “Here, behind my eyes on my right side, it’s just killing me.” And he was like, “Great. Well then the bullet should go there.” The target draws forth the arrow.\n\n\n\nGALLOWAY: It’s so great that you learned something fundamental about acting from your makeup person.\n\n\n\nGYLLENHAAL: Oh my God. Working with Jim Sheridan for instance, we did this movie Brothers. Jim will ask anybody — we’ll get a delivery on set, and like the poor delivery guy will be like, “Here’s your pizza,” and he’ll be like, “Come over here. Come here. I want to ask you a question. Do you think this is real?” And he’s like, “Is that Natalie Portman?” and he’s like, “Yeah. What do you think? Do you think she’s good in it? Should we do another take?” And they’re like, “I, uh, you want your pizza?” There’s no shame in everybody’s ideas. There’s no shame in somebody not knowing. There’s no shame in somebody who doesn’t necessarily do that job knowing a little bit more in that instance than you might know about your own job, you know, and I think that is where movies are such a collaborative art form.\n\n\n\nGALLOWAY: You said you’re not drawn to playing characters with masks, but you almost played Spiderman, and you almost played Batman. Would you want to today?\n\n\n\nGYLLENHAAL: There are a lot of other almosts. I was almost in Dude, Where’s my Car?\n\n\n\nGALLOWAY: That’s a classic.\n\n\n\nGYLLENHAAL: There were a lot of people who almost played Bubble Boy, you know.\n\n\n\nGALLOWAY: Would you want to do a superhero movie?\n\n\n\nGYLLENHAAL: It’s so funny, because they’re so prevalent. I don’t have a “I want to play this or that,” I just don’t have that. I’ve never been like that. People say to me, well “What’s the character you really want to play?” And I go, I don’t know, I... there are people who I think would be fascinating, but you know, if there’s a super hero that is you know, gives me, or I don’t even know if it’s the character, it’s really the director, someone who gives me that space to create something interesting with it, you know, those are the characters I love. It’s like, so it’s not, you know, at times when I think you’re talking about those movies, there’s a time where you know, you’re a young actor and you’re just like, oh man, like I can play this like super hero that’s so cool, you know, and it is cool, but I think for right now, I just want to work with people I really like, and who, who think I’m good.\n\n\n\nGALLOWAY: Yes, that helps.\n\n\n\nGYLLENHAAL: No, it does, I mean it’s everything.\n\n\n\nGALLOWAY: Absolutely. Other people’s belief changes you. We all have insecurity, and uncertainty, and to have that glow cast over you by somebody that you respect, makes a gigantic difference.\n\n\n\nGYLLENHAAL: It’s everything.\n\n\n\nGALLOWAY: It is.\n\n\n\nGYLLENHAAL: It is everything because it teaches you how to build it in yourself so that slowly you can be anywhere and be cool. And by cool, I don’t mean cool. I mean vulnerable and a mess. [LAUGHS] Like we are.\n\n\n\nGALLOWAY: Right. I want to talk about a role you did want to play enough that you produced the film. It's really one of your great roles: Nightcrawler.\n\n\n\nGYLLENHAAL: Super vulnerable.\n\n\n\nGALLOWAY: And super interesting, by the way. Super strange.\n\n\n\nGYLLENHAAL: Yeah. Yeah. I love him so much.\n\n\n\n[CLIP]\n\n\n\nGYLLENHAAL: Oh man, Dan Gilroy.\n\n\n\nGALLOWAY: Yes. And by the way, Rene Russo's so good in that.\n\n\n\nGYLLENHAAL: Oh Rene is amazing. Yeah.\n\n\n\nGALLOWAY: And I loved listening to the audience reactions to each line. You know? When I met you we did this roundtable for The Hollywood Reporter, and Jake showed up looking awful. Wow, I thought, he was this kind of a handsome guy, you know? But I guess you'd lost 30 pounds to do Nightcrawler.\n\n\n\nGYLLENHAAL: Yep.\n\n\n\nGALLOWAY: What drew you to this part? And how did you lose 30 pounds?\n\n\n\nGYLLENHAAL: Um…\n\n\n\nGALLOWAY: What did you not eat?\n\n\n\nGYLLENHAAL: I just ran, you know. I ran a lot. I had this idea that he was a coyote, that Southern California was some place I grew up here, so you know, coyote's are everywhere and they had this thing and this way of walking and moving and looking and that they're hungry all the time. And there's this sort of, they kind of look like they're you know, not unassuming at all, but they look like weak in a way because they're so thing but they're just sort of strangely evil and scavengers and will tear apart any animal, you know? In that scene in particular like one of the choices that I believed was like he never used utensils, you know. He was always eating like a coyote, you know? I just ran, I ran, you know. And I didn't eat that much. It's really that simple. I mean it sucked.\n\n\n\n[LAUGHTER]\n\n\n\nGALLOWAY: Did you model the part on anybody?\n\n\n\nGYLLENHAAL: Yes. There are aspects of a lot of people. Primarily, Dan Gilroy who wrote and directed the movie, was a big influence just like in terms of physicality in a lot of ways, because Dan has this sort of upright, very amazing posture about him. But really, I modeled it after an animal. I always find you go back to an animal; it will always show you the sort of primal aspects of behavior. You always know how to respond if you choose that. And I don't mean that like all of the sudden I decide to bark in the middle of a scene or something, [LAUGH] but I think that there's an inherent aspect, a very simple, very clear, very primary color to an animal without inhibition. So you can watch it like fire, like a child, an animal.\n\n\n\nGALLOWAY: What's so interesting is that the words and the surface seem disconnected from the awfulness. And it's like he could be talking about the weather.\n\n\n\nGYLLENHAAL: Yep.\n\n\n\nGALLOWAY: How do you pull that off? Do you make notes on your script? Do you play it different ways?\n\n\n\nGYLLENHAAL: Yes. Well first of all I memorize the entire — this is the first time in a movie — I memorized the entire movie, like I would a play. So that we shot the movie in 22 days, which is a very short shooting schedule. We shot it all at night, well 22 nights really. And I just knew that there were these huge long monologues and I knew that I wanted to be able to get them out in one take. But I knew the variation wasn't going to be in the take it was going to be, I mean like within the take it was going to be take to take. Because we were trying to sort of calibrate this guy. So in terms of the disconnection, I think that came from really following the writing. You know? I did not veer from a period, a comma, even an unconscious mistake that Dan made. Sometimes he put commas in the weirdest places, and I'd be like why did you put that there? He'd say \"Oh it must have been a mistake,\" I went \"no, no, no.\" OK. You know? I'd ask him why he wrote it, and he'd be like, and this is when you know someone's written something brilliant. They go, “I don't know.” Because it comes from, whenever I feel like someone goes \"well I wrote it because this, and this connects to that, and dah dah dah.\" OK, cool. When they go like \"oh, I don't know. I don't know where that came from.\" You know? That's when you're like-. And often times, I'd ask Dan and I'd be like, \"What. Can you tell me why he's like-.\" \"Oh, I don't know.\" You know? And I'd be like, \"OK, all right. Well I'm just going to say it.\" \"Yeah, yeah just say it.\" You know? And when I would just sort of say it, again like I keep saying it's like as an actor in particular, 50% of your work can be done for you when you're working with people who not only believe in you, but also who are exceptional. And it's your job to be able to try and find those people. And it's not just the writer or the director, it's everybody. You know? And there, you know you are the object that carries all departments. You are not, and I think I find this frustrating, when actors believe they're special. That the department, you know, oh I didn't-. A microphone on me, like you know? You carry the costume department, the sound department, the lighting department has to light you. You know? It's not like a privilege. You know what I mean? They have to figure out your face and all that. You know? They have to figure out the character and the story. And the director has to move and shape the whole thing. And so on and so forth.\n\n\n\nGALLOWAY: Who was the DP on all this? Was it Robert Elswit?\n\n\n\nGYLLENHAAL: Robert Elswit.\n\n\n\nGALLOWAY: Who is your godfather?\n\n\n\nGYLLENHAAL: Yes.\n\n\n\nGALLOWAY: What did he teach you?\n\n\n\nGYLLENHAAL: Nothing. [LAUGHTER] No. Look I have a profound respect for cinematographers. That is my secret sauce, you know. Like they are everything to me. And to me I just, I'm a geek when it comes to them. And when it comes to Robert and when it comes to someone like Roger Deakins who shot Prisoners and he shot Jarhead too. When it comes to people like that, you know, if they tell me to hit a mark, I'm going to hit a mark. Because they've also already thought about my job, that's the other interesting thing. When somebody's really good, they're not just thinking about their job. They're saying like I'm helping you too. I'm not just dismissing what you do. You know? And you know, working with Robert, Robert is a storyteller. He's not a cinematographer, he's a storyteller. And to me, that's the graduation I hope to get to in my profession. That I'm not just an actor, I'm a storyteller. And I think that takes a long time in, when you have one job on a movie set. Makeup artists, actor, whatever. To graduate from just that to storyteller. And when he taught me was that you have to be aware of the story no matter what you're doing. That you are in service of that story. Not just how pretty that looks, or you know, what your character's doing. Or you know, only looking at, I mean we're all going to do it, like if I am an actor, I'm going to be watching an actor's work. Like it's inevitable. I mean I'm watching and they're like the silhouette of eating and going like, am I buying that, do I buy that? Am I buying that? You know? Is that believable? Is that any good? You know? I'm watching all that in performance, but ultimately it's looking beyond what you do to service the story.\n\n\n\nGALLOWAY: Will you continue producing?\n\n\n\nGYLLENHAAL: I hope so. I would love to. That's what I would love to do. I love artists, I love, I hope you guys will hire me some day. [LAUGH] I like really do feel that way I think. I love watching other people work, you know? And putting people together in a way that they can really feel like they're having fun. Like I said. It's never like, I don't think, easy's a good word, or hard's a good word when you talk about making movies. Because it's neither of those things, but enjoying it even when it hurts.\n\n\n\nGALLOWAY: I want to take a look at a film you probably did get hurt on: Southpaw.\n\n\n\nGYLLENHAAL: Yeah.\n\n\n\n[CLIP]\n\n\n\nGALLOWAY: So you spent six months preparing for this part.\n\n\n\nGYLLENHAAL: Yeah.\n\n\n\nGALLOWAY: To get in shape physically. But I wondered if the hardest part might have actually been that scene, [where his wife dies in the movie] which is so intense.\n\n\n\nGYLLENHAAL: Yeah.\n\n\n\nGALLOWAY: How do you prepare for that?\n\n\n\nGYLLENHAAL: I think you build up the love between these two people. You know? I think Antoine Fuqua who directed the movie allowed for this space where Rachel's [Rachel McAdams] character and my character could really exist as a family in this space. And I think both of us really fell in love with that space, you know? We fell in love with our daughter, we were all together all the time. We were really like a unit, you know, and we shot all that stuff and there was a lot of improvisation and just a lot of getting to know each other as people, and Antoine was in there too. And you know, and I think also you just build that up. And I think just the thought of those things being taken away is enough, you know? It's just like particularly, I think, again like these things happen. You know? And I think also just the respecting of that space, and you know one of the things too is I believe and Michael Peña when I worked with, on End of Watch he said to me something that was I think one of the wisest things anyone's ever really said to me about acting, which is that you know your instinct is like a wild animal. You know? And you know a tiger in the jungle, you know, if you try and find it, it's not going to, you're not going to find it, you know they have like the cameras trying to like shoot it at different times of night and stuff. And as soon as a flash goes off, it's gone. You know? It's that sensitive, that thing. So the space within which to have that animal that has like come out, needs to be quiet. It needs to be respected. You need to create that space for that thing. And because it can go like that, it’s gone. You're like dry, you know? As an actor, you're just in a space and then all of a sudden things set you off and, and it's not like, you know, I think you can find it in a lot of different ways, you know. Things are blessings that are coming at you in, hashtag [LAUGHTER], that are coming at you at times, always. So you can dismiss them like \"I need my space, you know, and I just like ah, what's that sound, you know, uh.\" You know, or like things come at you and they're always talking like, to you. But in the case of that I think the nature of the situation creates everything for you, you know? And I think also I find tactile things, you know. Just the feeling of blood itself is enough for me. You know? If you, even if it's not real blood. You know? I mean that's enough, like sometimes there are very simple things that are enough. You know? Sometimes you can be in a scene and you can start literally moving your body in the way that you would emotionally, and it will access that feeling. You don't have to go back and think about how this person yelled at you when you were a baby, and blah, blah, blah. You just have to hunch over and all of a sudden. When you hold, particularly for me in that scene, when you hold a woman in your arms who's saying \"what's going on?\" That's enough for me. You know? And I can't give her an answer. That's enough for me.\n\n\n\nGALLOWAY: Are you ever afraid that that emotion will dry up? And that you won't be able to access it? You know, I have a friend who's an actress and she said to me she couldn't access the emotion the way she did when she was younger.\n\n\n\nGYLLENHAAL: I'm not afraid of that, because I think there's sort of a bit of a surrender to that you know? I mean inevitably, this is what Peter Sarsgaard, my brother-in-law really taught me. Which is like wherever you are, like you come into a scene, you're like OK, well all right. This scene is where I'm supposed to be. This is the scene where obviously I lose my wife, right? Like that's enough and, so I need to be in this space, whatever it is. Well, it makes me think of Dustin Hoffman. I worked with Dustin Hoffman when I was a kid. And Dustin before the funeral scene was like put on hip-hop, like crazy bad like pop hip-hop before in the makeup trailer. And I was like \"what are, what is?\" like and he was just like \"yeah.\" And I was like not only is he not a very good dancer, but he [LAUGHS] thank god he chose the right profession, but like he was like you have to like a slingshot, go as far away from the feeling that you're about to go into. Like go have fun, enjoy yourself.\n\n\n\nGALLOWAY: That is so fascinating. I would have thought the opposite.\n\n\n\nGYLLENHAAL: Right? Right, yeah. Well it's about technique, you know? Like of course you're going to run dry I think if you stay in the same place and you are inspired in the same place and it's accessible from the same place always. It's never going to be accessible from the same place, like you know, I mean feelings are, they're ephemeral and that's what they are. You know? And he's the first guy, like you see Meryl Street. I remember watching Meryl Streep in, The River Wild. There's this scene where she's has a gun pointed at her, her family's in this-. I mean by the way, it’s absurd in a lot of ways. Like she's on a raft, and it's like, there’s water's like, you know. And she starts, someone pulls a gun on her I think, I'm not really fully aware of the scene and she just, she starts, you see her terrified. And then all of a sudden she starts to burst out laughing. She starts laughing. Like she can't stop laughing. Because she's terrified and she's emotional and there are no rules to what you're supposed to feel. That to me is like A number one, that's the thing I have to remind myself all the time. You walk into a scene there are no rules ever about what you're supposed to feel. And so to me that was like, that's like, that one scene I always think like \"whoa.\" What a brilliant, you know, she just moving like wherever the gun's funny so it's f—ing funny. You know? It's like what are you going to do?\n\n\n\nGALLOWAY: Great, great answer. Let's get our student questions — fairly briefly please, because we're running late.\n\n\n\nQUESTION: Out of everything you've done, is there a certain line or dialogue that has really stuck with you and why?\n\n\n\nGYLLENHAAL: Oh wow. Wow. Yeah. Oh jeez. Well there are lines that just stick with me, like I mean I still can remember it's like every line that I say from Nightcrawler, I mean it's just always there.\n\n\n\nGALLOWAY: Every line?\n\n\n\nGYLLENHAAL: I would say almost every line, yeah. You know, I mean I have like funny like done interviews and someone's like \"really? And can you do the monologue?\" I'm like, \"yeah I can do any monologue from that movie even now, because I memorized them like.\" But in terms of emotionally, you know what's funny about lines is that like I said like with, like the line in Brokeback Mountain like I had no idea the resonance that line's-. And it doesn't even have that resonance with me now, because it didn't have that resonance when I said it. The lines that were more important to me were like the like, you know, \"you count the damn many times like, I can't survive on a couple of high altitude fucks every once, twice a year.\" You know? Those are the lines I could be, I could emote. You know? And then the one on my back's the one everyone's like \"oh that line's amazing.\" You know?\n\n\n\nGALLOWAY: Somewhere Humphrey Bogart and Claude Rains are saying the same thing.\n\n\n\nGYLLENHAAL: Well, that would be nice company, yeah.\n\n\n\nQUESTION: Congratulations on your first-look deal with Bold Films. I want to know so far what has surprised you the most about producing?\n\n\n\nGYLLENHAAL: Just how hard it is. It's so hard. It's a process in which you literally always take two steps forward and then it feels like three steps back. You know what I mean? And it's like, and then like you got to cheat your way towards like one more step without anybody seeing, you know? It's like there's, it's just I think when I say hard I think it's, you know you're dealing with so many personalities, you know, as an actor you know, you come in with your personality. You know? And you're like the last one in usually in a lot of ways. As a producer, it starts when I talk about privacy and silence. It starts before anybody believes in it. And I think that's, you have to have a real sense of self, and in order to push things through. And so often, what's interesting, is how many people dismiss an idea that eventually everybody [gloms] onto. So to me it's, that's what I mean by hard.\n\n\n\nGALLOWAY: Do you have a favorite project you're trying to get off the ground?\n\n\n\nGYLLENHAAL: Yeah, but I'm superstitious a little bit. So I'm like…\n\n\n\nGALLOWAY: You're allowed not to answer questions.\n\n\n\nGYLLENHAAL: And by the way, a lot of really good, probably better filmmakers than me in here, so if I say it, they're like \"Oh that's a great idea.\" [LAUGHTER]\n\n\n\nQUESTION: Something I really admire about you and your career is just like the variety of work you've done. Like everything is different. Like there's the indies that fly under the radar, and the Oscar nominated dramas, and a rom-com. And they're all so different and so good, and I guess what I would like to know is like do you think there's an element, like, in all of the projects you've chosen thus far that is present in every single one of them, and that kind of unites all of these projects that are, to the outsider, would look so different?\n\n\n\nGYLLENHAAL: Oh yeah. They're not all that good, but... Yeah, I just like, I can't not have something attached to like what actually happens in real life. Like I can't do a romantic comedy without there being something where like, in the case of Annie Hathaway's character, her character ends up having Parkinson's, you know? To me, I feel like that's love, you know? Like to me. So every movie has to have that kind of sense of that. You know I don't, not fantasy as much. I don't do as well with that. Yeah. And also I think yeah, like, often times I read scripts and they're based on a knowledge, people's knowledge of movies as opposed to people's knowledge of themselves. You know? And when I feel that, when someone's saying like this is something for me, it's not just I love movies, and this is what a movie would do. It's like the characters move the way that specific individual sees them move. And to me that's what I'm always looking for.\n\n\n\nQUESTION: I would like to say you're very funny. I wasn't expecting that.\n\n\n\nGYLLENHAAL: Thank you. My mom would agree with you.\n\n\n\nGALLOWAY: I don't think you could do Nightcrawler without having an underlying humor. Even though it's so dark, there's also a humor in that performance.\n\n\n\nGYLLENHAAL: It's funny, people are like, “Why are comedians so dark?” Like they're so dark. And they're like, “Jake why don't you make a happy film, like a comedy?” They're the darkest people I know, comedians.\n\n\n\nGALLOWAY: Sorry go ahead.\n\n\n\nQUESTION: But my question is, when you're reading a script, what intrigues you the most. Is it the story or the character that you want to play?\n\n\n\nGYLLENHAAL: It depends really I think, recently I've decided as an actor the only, the power I have really is in the performance. It's the only real place I get to sort of communicate. Everything else is in the hands of everyone else, so I've recently more started picking things based on character and how much I can learn in terms of into the real, in the real world about that. Like I've become obsessed with learning other languages in movies, because I was like, since I was like, but I learned how to box so why don't I just learn another language for a movie? Do you know? And. Because I think like I sort of look at it that way, so I'm doing a movie, I'm doing this movie with Antoine Fuqua that we're developing and the first half of the movie will be in Spanish. You know? And so to me, that idea. Those things, and it's a character thing. Going into the character for me more and more. But it's both, I mean you wish to have both, you know? I mean, but often times now I will sacrifice sometimes certain things in a story for the character. And that works sometimes and doesn't others.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2012/01/Brokeback_Mountain.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/2012/01/Brokeback_Mountain.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2012/01/Brokeback_Mountain.jpg", "keywords": [], "authors": ["Stephen Galloway", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/ten-years-brokeback-jake-gyllenhaal-843951", "title": "10 Years After 'Brokeback,' Jake Gyllenhaal Remembers Heath Ledger: \"Way Beyond His Years as a Human\"", "meta_data": {"viewport": "width=device-width", "description": "\"I wasn’t really quite sure where he came from, and I think that’s the feeling most people got when they were around him and why he was so extraordinary,\" Gyllenhaal recalls.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/ten-years-brokeback-jake-gyllenhaal-843951", "domain": "https://www.hollywoodreporter.com/", "title": "10 Years After 'Brokeback,' Jake Gyllenhaal Remembers Heath Ledger: \"Way Beyond His Years as a Human\"", "description": "\"I wasn’t really quite sure where he came from, and I think that’s the feeling most people got when they were around him and why he was so extraordinary,\" Gyllenhaal recalls.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2012/01/Brokeback_Mountain.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "10 Years After 'Brokeback,' Jake Gyllenhaal Remembers Heath Ledger: \"Way Beyond His Years as a Human\"", "description": "\"I wasn’t really quite sure where he came from, and I think that’s the feeling most people got when they were around him and why he was so extraordinary,\" Gyllenhaal recalls.", "url": "https://www.hollywoodreporter.com/news/ten-years-brokeback-jake-gyllenhaal-843951", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2012/01/Brokeback_Mountain.jpg", "width": 648, "height": 365, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "10 Years After 'Brokeback,' Jake Gyllenhaal Remembers Heath Ledger: \"Way Beyond His Years as a Human\"", "sailthru.description": "\"I wasn’t really quite sure where he came from, and I think that’s the feeling most people got when they were around him and why he was so extraordinary,\" Gyllenhaal recalls.", "sailthru.author": "Stephen Galloway", "sailthru.vertical": "Movies", "sailthru.date": "2015-11-25 12:37:52", "sailthru.tags": "Movies"}, "movies": [], "publish_date": 1448426272.0, "source": "https://www.hollywoodreporter.com", "summary": ""}