{"url": "www.inquisitr.com/4910026/beyonce-is-not-uspet-with-ryan-reynolds-and-blake-lively-about-deadpool-2-jab/", "text": "Beyonce is not upset with Ryan Reynolds and Blake Lively about jokes made about the singer-songwriter in Marvel’s second installment of Deadpool.\n\nSome tabloids contend that the “Crazy in Love” singer was not only angry with Ryan Reynolds for having made a rather innocuous joke in the film at her expense but even with his wife Blake Lively. At one point during the movie, Reynolds’ character tells another character: “In the words of Beyonce, please stop cheating on me.”\n\nNW magazine reported that Beyonce, upset as she was with Reynolds for having made fun of her marital issues with Jay Z in the film, took an umbrage with Lively as well. This was reportedly because Beyonce felt that she had broken “girl code by not telling Ryan to think twice about poking fun at another woman being cheated on.”\n\nThe source quoted by NW magazine even went on to claim that Beyonce “thinks it’s cruel and certainly isn’t laughing.”\n\nBut if history is anything to go by, Beyonce has a great sense of humor and doesn’t get unhappy with every joke made at her expense. For example, as Gossip Cop reports, in October 2016, Saturday Night Live spoofed the music video of her song “Sorry” which had an implicit implication about Jay Z cheating on her. But despite the spoof, Beyonce attended the SNL after-party the following year with Jay Z invited as the musical guest.\n\nMoreover, considering the nature of Ryan Reynolds’ character in the Deadpool series, where he is foul-mouthed and provides a running sort of social gag, it would be surprising if every celebrity he made fun of would begin to take offense with the jokes in the film. Tens of celebrities including Hugh Jackman, Matthew McConaughey, and Justin Bieber have all been laughed at in some way or the other in the sequel, but it is unlikely that these jokes would cause anything other than a chuckle or two.\n\nAs Reynolds himself noted, everyone who has been made fun of in Deadpool 2 understands what the intention of the makers really is.\n\n“There’s a little bit of making fun, but I think everyone sees it for what it is, in the spirit of what it is. Most of the humor is really without teeth.”\n\nSo we can rest assured that unlike what has been falsely reported in tabloids, Beyonce is not actually upset with Reynolds or Lively over jabs in Deadpool 2. If anything, she might be upset with the tabloids for spreading false information.", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/7c3ead8875ffda193b78228399febdd4?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/Beyonce.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Mohit Priyadarshi"], "canonical_link": "https://www.inquisitr.com/4910026/beyonce-is-not-uspet-with-ryan-reynolds-and-blake-lively-about-deadpool-2-jab/", "title": "Beyonce Is Not Uspet With Ryan Reynolds And Blake Lively About ‘Deadpool 2’ Jab", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}