{"url": "https://en.wikipedia.org/wiki/Jennifer_Lawrence", "text": "American actress\n\nJennifer Shrader Lawrence (born August 15, 1990) is an American actress. The films she has acted in have grossed over $6 billion worldwide, and she was the highest-paid actress in the world in 2015 and 2016. Lawrence appeared in Time's 100 most influential people in the world list in 2013 and in the Forbes Celebrity 100 list in 2014 and 2016.\n\nDuring her childhood, Lawrence performed in church plays and school musicals. At age 14, she was spotted by a talent scout while vacationing in New York City with her family. Lawrence then moved to Los Angeles and began her acting career by playing guest roles in television shows. Her first major role came as a main cast member on the sitcom The Bill Engvall Show (2007–2009). Lawrence made her film debut in a supporting role in the drama Garden Party (2008), and had her breakthrough playing a poverty-stricken teenager in the independent drama Winter's Bone (2010). Her career progressed with her starring roles as the mutant Mystique in the X-Men film series (2011–2019) and Katniss Everdeen in the Hunger Games film series (2012–2015). The latter established her as the highest-grossing action heroine of all time.\n\nLawrence went on to earn accolades for her collaborations with director David O. Russell. Her performance as a depressed young widow in the romance film Silver Linings Playbook (2012) earned her the Academy Award for Best Actress, making her the second-youngest winner of the award. She subsequently won the BAFTA Award for Best Actress in a Supporting Role for playing a troubled wife in the black comedy American Hustle (2013). Lawrence also received Golden Globe Awards for both of these films, and for portraying Joy Mangano in the biopic Joy (2015). She has since starred in the science fiction romance Passengers (2016), the psychological horror film Mother! (2017), and the spy thriller Red Sparrow (2018).\n\nLawrence is an outspoken feminist and has advocated for Planned Parenthood. In 2015, she founded the Jennifer Lawrence Foundation, which has advocated for the Boys & Girls Clubs of America and the Special Olympics. She formed the production company Excellent Cadaver in 2018.\n\nEarly life\n\nJennifer Shrader Lawrence was born on August 15, 1990 in Indian Hills, Kentucky, to Gary, a construction worker, and Karen (née Koch), a summer camp manager.[1][2] She has two older brothers, Ben and Blaine,[2] and her mother brought her up to be \"tough\" like them. Karen did not allow her daughter to play with other girls in preschool as she deemed her \"too rough\" with them.[3] Lawrence was educated at the Kammerer Middle School in Louisville.[3] She did not enjoy her childhood due to hyperactivity and social anxiety and considered herself a misfit among her peers.[2][4] Lawrence has said that her anxieties vanished when she performed on stage and that acting gave her a sense of accomplishment.[4]\n\nLawrence's school activities included cheerleading, softball, field hockey and basketball, which she played on a boys' team that was coached by her father.[3] While growing up, she was fond of horseback riding and frequently visited a local horse farm.[5] She has an injured tailbone as a result of being thrown from a horse.[6] When her father worked from home, she performed for him, often dressing up as a clown or ballerina.[7] She had her first acting assignment at age nine when she played the role of a prostitute in a church play that was based on the Book of Jonah. For the next few years, she continued to take parts in church plays and school musicals.[3]\n\nLawrence was fourteen and on a family vacation in New York City when she was spotted on the street by a talent scout who arranged for her to audition for talent agents.[8][9] Karen was not keen on allowing her daughter to pursue an acting career, but she briefly moved her family to New York to let her read for roles.[3] After Lawrence's first cold reading, the agents said that hers was the best they had heard from someone that young; Lawrence's mother convinced her that they were lying.[9] Lawrence said her early experiences were difficult because she felt lonely and friendless.[3] She signed with CESD Talent Agency, who convinced her parents to let her audition for roles in Los Angeles. While her mother encouraged her to go into modelling, Lawrence insisted on pursuing acting.[10] At that time, she considered acting to be a natural fit for her abilities, and she turned down several offers for modeling assignments.[8] Lawrence dropped out of school at age 14 without receiving a GED or a diploma. She has said that she was \"self-educated\" and that her career was her priority.[11] Between her acting jobs in the city, she made regular visits to Louisville, where she served as an assistant nurse at her mother's camp.[12]\n\nCareer\n\n2006–2010: Career beginnings and breakthrough\n\nLawrence began her acting career with a minor role in the unsold, unaired TV pilot Company Town (2006).[13] She followed it with guest roles in several television shows, including Monk (2006) and Medium (2007).[14] These parts led to her being cast as a series regular on the TBS sitcom The Bill Engvall Show, in which she played Lauren, the rebellious teenage daughter of a family living in suburban Louisville, Colorado.[14] The series premiered in 2007 and ran for three seasons.[15] Tom Shales of The Washington Post considered her a scene stealer in her part, and David Hinckley of the New York Daily News wrote that she was successful in \"deliver[ing] the perpetual exasperation of teenage girls\".[16][17] Lawrence won a Young Artist Award for Outstanding Young Performer in a TV Series for the role in 2009.[18]\n\nLawrence made her film debut in the 2008 drama film Garden Party, in which she played a troubled teenager named Tiff.[19] She then appeared in director Guillermo Arriaga's feature film debut The Burning Plain (2008), a drama narrated in a hyperlink format. She was cast as the teenage daughter of Kim Basinger's character who discovers her mother's extramarital affair—a role she shared with Charlize Theron; both actresses portrayed the role at different stages of the character's life. Mark Feeney for The Boston Globe thought of Lawrence's performance as \"a thankless task\", but Derek Elley from Variety praised her as the production's prime asset, writing that she \"plumbs fresher depths\" into the film.[20][21] Her performance earned her the Marcello Mastroianni Award for Best Emerging Actress at the Venice Film Festival.[22] Also that year, she appeared in the music video for the song \"The Mess I Made\" by Parachute.[23] The following year, she starred in Lori Petty's drama The Poker House as the oldest of three sisters living with a drug-abusing mother.[24][25] Stephen Farber of The Hollywood Reporter thought that Lawrence \"has a touching poise on camera that conveys the resilience of children\", and her role in The Poker House won an Outstanding Performance award from the Los Angeles Film Festival.[26][27]\n\nLawrence's breakthrough role came in the small-scale drama Winter's Bone (2010), based on Daniel Woodrell's novel of the same name. In Debra Granik's independent feature, she portrayed Ree Dolly, a poverty-stricken teenager in the Ozark Mountains who cares for her mentally ill mother and younger siblings while searching for her missing father. Lawrence traveled to the Ozarks a week before filming began to live with the family on whom the story was based, and in preparation, she learned to fight, skin squirrels, and chop wood.[28][29] David Denby of The New Yorker said the film \"would be unimaginable with anyone less charismatic\",[30] and Peter Travers of Rolling Stone wrote that \"her performance is more than acting, it's a gathering storm. Lawrence's eyes are a roadmap to what's tearing Ree apart.\"[31] The production won the Grand Jury Prize at the Sundance Film Festival.[32] The actress was awarded the National Board of Review Award for Breakthrough Performance, and with her first nomination for the Academy Award for Best Actress, she became the second youngest person to be nominated in the category.[33]\n\n2011–2013: Film series and awards success\n\nIn 2011, Lawrence took on a supporting role in Like Crazy, a romantic drama about long-distance relationships, starring Anton Yelchin and Felicity Jones.[34] Kenneth Turan of the Los Angeles Times considered the film to be an \"intensely wrought and immensely satisfying love story\" and credited all three performers for \"making their [characters'] yearning palpable\".[35] She then appeared in Jodie Foster's black comedy The Beaver alongside Foster and Mel Gibson. Filmed in 2009, the production was delayed due to controversy concerning Gibson, and earned less than half of its $21 million budget.[36][37]\n\nAfter her dramatic role in Winter's Bone, Lawrence looked for something less serious, and found it with her first high-profile release—Matthew Vaughn's superhero film X-Men: First Class (2011)—a prequel to the X-Men film series.[38] She portrayed the shapeshifting mutant Mystique, a role played by Rebecca Romijn in the earlier films.[39] Vaughn cast Lawrence, as he thought that she would be able to portray the weakness and strength involved in the character's transformation.[40] For the part, Lawrence lost weight and practiced yoga.[41] For Mystique's blue form, she had to undergo eight hours of makeup, as Romijn had done on the other films.[42] She was intimidated in the role as she admired Romijn.[43] Writing for USA Today, Claudia Puig considered the film to be a \"classy re-boot\" of the film series, and believed that her \"high-spirited performance\" empowered the film.[44] With worldwide earnings of $350 million, X-Men: First Class became Lawrence's highest-grossing film at that point.[45]\n\nIn 2012 she played Katniss Everdeen in The Hunger Games, an adaptation of the first book in author Suzanne Collins' Hunger Games trilogy. Set in a post-apocalyptic future, the series tells the story of the teenage heroine Everdeen as she joins rebel forces against a totalitarian government after winning a brutal televised annual event. Despite being an admirer of the books, Lawrence was initially hesitant to accept the part, because of the grand scale of the film. She agreed to the project after her mother convinced her to take the part.[46] She practiced yoga, archery, rock and tree climbing, and hand-to-hand combat techniques for the role.[3][47][48] While training for the part, she injured herself running into a wall.[49] The film received generally positive reviews, and Lawrence's portrayal of Everdeen was particularly praised.[50] Todd McCarthy of The Hollywood Reporter called her an \"ideal screen actress\", adding that she embodies the Everdeen of the novel, and believed that she anchored the film \"with impressive gravity and presence\".[51] Roger Ebert agreed that she was \"strong and convincing in the central role\".[52] With worldwide revenues of over $690 million,[45] The Hunger Games became a top-grossing film featuring a female lead,[53] making Lawrence the highest-grossing action heroine of all time.[54] The success of the film established her as a star.[55]\n\nLater in 2012, Lawrence played a young widow with borderline personality disorder named Tiffany Maxwell in David O. Russell's romance movie Silver Linings Playbook. The film was an adaptation of Matthew Quick's novel of the same name. It follows her character finding companionship with Pat Solitano Jr. (played by Bradley Cooper), a man with bipolar disorder.[56][57] The actress was drawn to her character's complex personality: \"She didn't really fit any basic kind of character profile. Somebody who is very forceful and bullheaded is normally very insecure, but she isn't\".[58] While Russell initially considered Lawrence to be too young for the part, she convinced him to hire her via a Skype audition.[46] The actress found herself challenged by Russell's spontaneity as a director, and described working on the project as the \"best experience of my life\".[46] Richard Corliss of Time wrote: \"Just 21 when the movie was shot, Lawrence is that rare young actress who plays, who is, grown-up. Sullen and sultry, she lends a mature intelligence to any role.\"[59] Peter Travers believed that Lawrence \"is some kind of miracle. She's rude, dirty, funny, foulmouthed, sloppy, sexy, vibrant, and vulnerable, sometimes all in the same scene, even in the same breath.\"[60] She won the Golden Globe and Academy Award for Best Actress for her performance, becoming—at age 22—the second youngest Best Actress winner.[61] Her final film of the year was alongside Max Thieriot and Elisabeth Shue in Mark Tonderai's critically panned thriller House at the End of the Street.[62]\n\nIn January 2013, Lawrence hosted an episode of Saturday Night Live, with musical guest The Lumineers.[63] The Devil You Know, a small-scale production that Lawrence had filmed for in 2005, was her first release of 2013.[64] She then reprised the role of Everdeen in The Hunger Games: Catching Fire, the second installment in the Hunger Games film series.[65] While performing the film's underwater stunts, she suffered from an ear infection that resulted in a brief loss of hearing.[49] With box office earnings of $865 million, the film remains her highest-grossing release.[45] Stephanie Zacharek of The Village Voice believed that Lawrence's portrayal of Everdeen made her an ideal role model, and wrote that \"there's no sanctimony or pretense of false modesty in the way Lawrence plays her\".[66] She took on a supporting role in Russell's ensemble crime drama American Hustle (2013) as Rosalyn Rosenfeld, the neurotic wife of con man Irving Rosenfeld (portrayed by Christian Bale). Inspired by the Federal Bureau of Investigation's Abscam sting operation, the film is set against the backdrop of political corruption in 1970s New Jersey.[67][68] Lawrence did little research for the part, and based her performance on knowledge of the era from the films and television shows she had seen.[55] Geoffrey Macnab of The Independent praised her as \"funny and acerbic\", especially for an improvised scene in which she aggressively kisses her husband's mistress (played by Amy Adams) on the lips.[67] Lawrence's performance won her the Golden Globe and BAFTA Award for Best Supporting Actress, in addition to a third Academy Award nomination, her first in the supporting category.[69]\n\n2014–present: Established actress\n\nLawrence played Serena Pemberton in Susanne Bier's depression-era drama Serena (2014), based on the novel of the same name by Ron Rash. In the film, she and her husband George (portrayed by Bradley Cooper) become involved in criminal activities after realizing that they cannot bear children.[70] The project was filmed in 2012, and was released in 2014 to poor reviews.[71][72] Lawrence then reprised the role of Mystique in X-Men: Days of Future Past, which served as a sequel to both X-Men: The Last Stand (2006) and X-Men: First Class (2011). The film received positive reviews and grossed $748.1 million worldwide, becoming the highest-grossing film in the X-Men series to that point.[73][74] Justin Chang of Variety praised her look in the film but thought that she had little to do but \"glower, snarl and let the f/x artists do their thing\".[75] Lawrence's next two releases were in the final parts of The Hunger Games film series, Mockingjay – Part 1 (2014) and Part 2 (2015).[76] For the musical score of the former film, she sang the song \"The Hanging Tree\",[77] which charted on multiple international singles charts.[78] In a review of the final film in the series, Manohla Dargis of The New York Times drew similarities between her rise to stardom and Everdeen's journey as a rebel leader, writing: \"Lawrence now inhabits the role as effortlessly as breathing, partly because, like all great stars, she seems to be playing a version of her 'real' self\".[79] Both films earned more than $650 million worldwide.[45]\n\nRed Sparrow in 2018 Lawrence promotingin 2018\n\nLawrence worked with Russell for the third time in the biopic Joy (2015), in which she plays the eponymous character, a troubled single mother who becomes a successful businessperson after inventing the Miracle Mop.[80] During production in Boston, the press reported on a disagreement between Russell and Lawrence that resulted in a \"screaming match\". She said that her friendship with Russell made it easier for them to disagree, because people fight when they really love each other.[81] The film was not as well received as their previous collaborations, but her performance was praised.[82] Richard Roeper called it \"a wonderfully layered performance that carries the film through its rough spots and sometime dubious detours\" that was her best since Winter's Bone.[83] She won a third Golden Globe Award, and was nominated for another Academy Award for Best Actress, becoming the youngest person to accrue four Oscar nominations.[84] Lawrence began 2016 by providing the narration for A Beautiful Planet, a documentary film that explores Earth from the International Space Station.[85] She played Mystique for the third time in X-Men: Apocalypse (2016). The film received mixed reviews, with a consensus that it was overfilled with action that detracted from the story's themes and cast's performances.[86] Helen O'Hara from Empire considered the film to be a letdown from the previous installments of the series, and criticized the actress for making her character too grim.[87] Despite this, she was rewarded Favorite Movie Actress at the 43rd People's Choice Awards.[88]\n\nLawrence was paid $20 million for playing Aurora Lane in the science fiction film Passengers (2016), and she received top-billing over co-star Chris Pratt.[89][90] It features Pratt and her as two people who wake up 90 years too soon from an induced hibernation on a spaceship bound for a new planet. Lawrence says that she felt nervous performing her first sex scene and kissing a married man (Pratt) on screen; she drank alcohol to prepare herself for filming.[91] Critical reaction was mixed, but Lawrence defended the film by calling it a \"tainted, complicated love story\".[92][93] Darren Aronofsky's psychological horror film Mother! was Lawrence's sole release of 2017. She starred as a young wife who experiences trauma when her home is invaded by unexpected guests. Lawrence spent three months rehearsing the film in a warehouse in Brooklyn, despite her reluctance to rehearsals in her previous assignments.[94] The intense role proved difficult for her to film; she was put on supplemental oxygen when she hyperventilated one day, and she also dislocated a rib.[94] Mother! polarized viewers and prompted mass walkouts.[95] The film was better received by critics;[96] Walter Addiego of the San Francisco Chronicle labelled it \"assaultive\" and a \"deliberate test of audience endurance\", and credited Lawrence for \"never allow[ing] herself to be reduced simply to a howling victim\".[97]\n\nThe following year, Lawrence starred as Dominika Egorova, a Russian spy who makes contact with a mysterious CIA agent (played by Joel Edgerton), in Francis Lawrence's espionage thriller Red Sparrow, based on Jason Matthews' novel of the same name.[98] She learned to speak in a Russian accent and undertook ballet training for four months.[99] Lawrence was challenged by the sexuality in her role, but has said that performing the nude scenes made her feel empowered.[100] IndieWire's Eric Kohn disliked the film's denouement, but praised the work of Lawrence and Charlotte Rampling, stating that \"the considerable talent on display is [the film's] constant saving grace.\"[101] A year later, Lawrence made her fourth and final appearance as Mystique, in Dark Phoenix, which received poor reviews and emerged as a box-office bomb.[102][103]\n\nUpcoming projects\n\nLawrence will next star in and produce Red, White and Water, an independent drama directed by Lila Neugebauer, which will be distributed by A24.[104] She will team with filmmaker Adam McKay for the Netflix comedy film Don’t Look Up, and portray the mafia informant Arlyne Brickman in Paolo Sorrentino's film adaptation of Teresa Carpenter's book Mob Girl.[105][106] Lawrence will additionally produce a film adaptation of Hannah Kent's novel Burial Rites about the last woman to be executed for murder in Iceland.[107]\n\nPersonal life\n\nWhile filming X-Men: First Class in 2010, Lawrence began a romantic relationship with her co-star Nicholas Hoult. The couple broke up around the time they wrapped X-Men: Days of Future Past in 2014.[108][109] Also that year, she was one of the victims of the iCloud leaks of celebrity photos when dozens of self-photographed nude pictures of her were leaked online.[110] Lawrence emphasized that the images were never meant to go public; she called the leak a \"sex crime\" and a \"sexual violation\". She added that viewers of the images should be ashamed of their part in a sexual offense.[111] The actress later stated that her pictures were intended for Hoult, and that unlike other victims of the hack, she did not plan to sue Apple Inc.[108]\n\nIn September 2016, she began dating director Darren Aronofsky, whom she met during the filming of mother!.[112][113] The couple split in November 2017.[114] In 2018, she began dating Cooke Maroney, an art gallery director, and they became engaged in February 2019.[115][116] In October 2019, she married Maroney in Rhode Island.[117] As of May 2019, she resides in Lower Manhattan, New York City and Beverly Hills, California.[118]\n\nOff-screen work\n\nLawrence is a supporter of Planned Parenthood,[119] and participated in a June 2017 video against the defunding of the organization.[120] She spoke out against the November 2015 shooting at a Colorado Springs Planned Parenthood clinic.[119] She is a feminist, a concept she argues should not intimidate people \"because it just means equality\".[121] Lawrence promotes body positivity among women.[122] In 2015, she wrote an essay for the Lenny Letter in which she criticized the gender pay gap in Hollywood. She wrote about her own experiences in the industry, such as the lesser salary she received for her work in American Hustle compared to her male co-stars.[123] In a 2015 interview with Vogue, Lawrence criticized Kentucky county clerk Kim Davis for her opposition to same-sex marriage.[81] Lawrence was \"raised a Republican\", but has subsequently criticized the party's stance on women's rights.[81] She has strongly opposed Donald Trump's presidency, stating in 2015 that his election would \"be the end of the world\".[124]\n\nLawrence became a member of the Academy of Motion Picture Arts and Sciences in 2011.[125] She has lent her support to several charitable organizations, such as the World Food Programme, Feeding America, and the Thirst Project.[126] Along with Josh Hutcherson and Liam Hemsworth, her co-stars of The Hunger Games (2012), Lawrence partnered with the United Nations to publicize poverty and hunger.[127] She organized an early screening of The Hunger Games: Catching Fire (2013) to benefit Saint Mary's Center, a disabilities organization in Louisville, and raised more than $40,000 for the cause.[128] She partnered with the charity broadcast network Chideo to raise funds for the 2015 Special Olympics World Summer Games by screening her film Serena (2014).[129] She also collaborated with Omaze to host a fundraising contest for the games as part of the premiere of The Hunger Games: Mockingjay – Part 1 (2014).[130]\n\nIn 2015, Lawrence teamed with Hutcherson and Hemsworth for Prank It FWD, a charitable initiative to raise money for the non-profit organization Do Something.[131] That year, she also launched the Jennifer Lawrence Foundation, which supports charities such as the Boys & Girls Clubs of America and the Special Olympics.[132] In 2016, she donated $2 million to the Kosair Children's Hospital in Louisville to set up a cardiac intensive care unit named after her foundation.[133] Lawrence is a board member of Represent.Us, a nonprofit seeking to pass anti-corruption laws in the United States.[134] In 2018, she collaborated with 300 women in Hollywood to set up the Time's Up initiative to protect women from harassment and discrimination.[135] She participated in the 2018 Women's March in Los Angeles to affirm her commitment to women's rights.[136] Also that year, Lawrence announced her commitment to get young Americans politically engaged and to advocate for anti-corruption laws.[137] In 2018, Lawrence founded a production company called Excellent Cadaver.[138]\n\nIn the media\n\nIn 2012, the review website IndieWire stated Lawrence had a \"down-to-earth, self-deprecating, unaffected\" personality.[139] An IGN writer considers her to be a \"sharp\", \"funny\" and \"quirky\" actress who likes to \"stay grounded\" despite considerable success.[126] Lawrence says that she finds acting \"stupid\" in comparison to life-saving professions like doctors, and therefore does not believe in being \"cocky\" about her success.[140]\n\nA Beautiful Planet in 2016 Lawrence at the premiere ofin 2016\n\nIn 2012, Rolling Stone called her \"the most talented young actress in America.\"[3] Her Hunger Games co-star Donald Sutherland has favorably compared her craft to that of Laurence Olivier and considers her an \"exquisite and brilliant actor\".[141] David O. Russell (who directed her in Silver Linings Playbook, American Hustle and Joy) has praised her effortless acting that makes her performances look easy.[142] During her career, Lawrence has played roles in both high-profile, mainstream productions and low-budget independent films, and has appeared in a range of film genres.[126] She did not study acting and has not been involved in professional theater.[9] She instead bases her acting approach on her observations of people around her.[143] The actress told The Globe and Mail in June 2010 that she does not \"invest any of my real emotions\" or take home any pains of her characters. Lawrence went on to say that \"I don't even take it to craft services\" and has never shared their experiences, relying instead on her imagination, noting \"I can't go around looking for roles that are exactly like my life.\" She stated that \"If it ever came down to the point where, to make a part better, I had to lose a little bit of my sanity, I wouldn't do it. I would just do comedies.\"[9]\n\nAs her career has developed, Lawrence has become one of the best paid actresses; The Daily Telegraph reported in 2014 that she was earning $10 million a film.[144] In 2013, Time magazine named her one of the most 100 influential people in the world,[145] Elle labeled her the most powerful woman in the entertainment business,[146] and Forbes ranked her as the 50th most powerful actress.[147] In 2014, Forbes named her the second-highest-paid actress in the world with earnings of $34 million,[148] and cited her as the most powerful actress, ranking at number 12 in the magazine's Celebrity 100 list; she appeared in the list again in 2016.[149][150] In 2015, Lawrence was named \"Entertainer of the Year\" by Entertainment Weekly—a title she also won in 2012[151][152]—and was recognized as the highest-grossing action heroine in Guinness World Records for starring in the Hunger Games series.[153] In 2015 and 2016, Forbes reported that she had emerged as the world's highest-paid actress with annual earnings of $52 million and $46 million, respectively.[154] The magazine ranked her as the world's third and fourth highest-paid actress during the next two years, with respective earnings of $24 million and $18 million.[155][156] As of 2019 , Lawrence's films have grossed over $6 billion worldwide.[45]\n\nLawrence appeared in Victoria's Secret's listing of the \"Sexiest Up-and-Coming Bombshell\" in 2011,[157] People's Most Beautiful People in 2011 and 2013,[158] Maxim's Hot 100 from 2011 to 2014,[159] and topped FHM's sexiest women in the world list in 2014.[160] From 2013 to 2015, she was featured in Glamour's annual listing of the best dressed women, topping the list in 2014.[161]\n\nFilmography\n\nDenotes films that have not yet been released\n\nFilm\n\nTelevision\n\nMusic videos\n\nYear Title Artist Refs. 2010 \"The Mess I Made\" Parachute [23]\n\nAccolades\n\nLawrence won an Academy Award for Best Actress for her performance in Silver Linings Playbook (2012). She has won three Golden Globe Awards; Best Actress – Comedy or Musical for Silver Linings Playbook (2012) and Joy (2015), and Best Supporting Actress for American Hustle (2013). She also won a BAFTA Award for Best Actress in a Supporting Role for American Hustle.[61][69][84] Her other accolades include seven MTV Movie Awards (five for The Hunger Games series, two for Silver Linings Playbook),[162] six People's Choice Awards (three for The Hunger Games, three for the X-Men series),[163][88] a Satellite Award for Silver Linings Playbook,[164] and a Saturn Award for The Hunger Games.[165]\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Jennifer_Lawrence_SDCC_2015_X-Men.jpg/220px-Jennifer_Lawrence_SDCC_2015_X-Men.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Jennifer_Lawrence_at_the_83rd_Academy_Awards_crop.jpg/170px-Jennifer_Lawrence_at_the_83rd_Academy_Awards_crop.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/30px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/30px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Jennifer_Lawrence_TIFF_2%2C_2012.jpg/170px-Jennifer_Lawrence_TIFF_2%2C_2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Jennifer_Lawrence_SDCC_2015_X-Men.jpg/1200px-Jennifer_Lawrence_SDCC_2015_X-Men.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/29px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Jennifer_Lawrence_in_2016.jpg/170px-Jennifer_Lawrence_in_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Jennifer_Lawrence_Tulane_University_2018_%2801%29_%28cropped%29.jpg/170px-Jennifer_Lawrence_Tulane_University_2018_%2801%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Jennifer_Lawrence_in_2018.png/180px-Jennifer_Lawrence_in_2018.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/30px-Wikinews-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/25px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Jenniferlawrencesignature.svg/90px-Jenniferlawrencesignature.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Jennifer_Lawrence_SDCC_2015_X-Men.jpg/1200px-Jennifer_Lawrence_SDCC_2015_X-Men.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jennifer_Lawrence", "title": "Jennifer Lawrence", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Jennifer_Lawrence_SDCC_2015_X-Men.jpg/1200px-Jennifer_Lawrence_SDCC_2015_X-Men.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}