{"url": "www.dailymail.co.uk/news/article-3689928/We-don-t-want-refugees-George-Clooney-s-super-rich-Lake-Como-neighbours-say-Italian-idyll-RUINED-migrants-doorstep-Switzerland-closes-border.html", "text": "Advertisement\n\nGeorge Clooney's wealthy neighbours in the Alpine beauty spot of Lake Como say their Italian idyll is being ruined by the influx of hundreds of migrants to a makeshift camp on their doorstep.\n\nThe picturesque area is best known as a hide-away for Clooney and a multitude of other Hollywood A-listers includ Brad Pitt, wife Angelina Jolie, and pop superstar Madonna.\n\nBut a clamp-down by Switzerland on illegal immigrants entering the country from Italy threatens to turn this chic resort into a frontier town overrun by the homeless and desperate.\n\nParadise lost: George Clooney's wealthy neighbours in the Alpine beauty spot of Lake Como say their Italian idyll is being ruined by the influx of hundreds of migrants to a makeshift camp on their doorstep\n\nIdyll: The picturesque area is best known as a hide-away for Clooney and a multitude of other Hollywood A-listers include Brad Pitt, wife Angelina Jolie, and Madonna\n\nAnger: But a clamp-down by Switzerland on migrants entering the country from Italy threatens to turn this chic resort into a frontier town overrun by the homeless and desperate. Federica said: ‘A small number of immigrants is not a problem but now they are so many.'\n\nMoving on: They are stuck in Lake Como because Swizerland has closed its border and they are sleeping in camps near the railway station\n\nRubbish: Como local authority held a referendum to decide on whether to build a permanent camp, which was rejected by the wealthy residents so now the refugees who have moved up from Italy are forced to sleep rough\n\nPicturesque: This map shows where the camp at Como railway station is in relation to the banks of Lake Como where stars wine and dine\n\nGateway to Europe: Migrants are trapped in their makeshift camp at Como's railway station, which is close to George Clooney's estate as well as the luxury Villa D'Este hotel where guests include Madonna, Bruce Springsteen and former US President JFK\n\nRestaurant owner Maria Grazia told MailOnline: ‘I don’t want them here.\n\n‘Italy has enough problems without trying to solve the problems of the world. We [Italy] should not have to deal with these people on our own.\n\n‘Europe [the EU] does nothing to help us. Now they make us – me, my family and other Italian families – pay for them.’\n\nHousewife Federica, 55, said: ‘A small number of immigrants is not a problem but now they are so many.\n\n‘You see them arriving at that the San Giovanni station. They are not poor hungry refugees but they are big and strong.\n\n‘People here in Como don’t like them. There are simply too many of them.’\n\nTour guide Denise, 67, added: ‘Immigration here in Italy is a problem, a big problem because of the huge numbers who are arriving all the time.’\n\nChauffeur Santi, 26, said: ‘It is good for Switzerland that they have closed the border to migrants but it is bad for Italy.\n\n‘We simply don’t have the resources to deal with all these new people.\n\n‘Italy has lots of problems of our own without having to try to deal with other people’s problems. It is a complex situation.\n\nFury: Chauffeur Santi, 26, told MailOnline: ‘It is good for Switzerland that they have closed the border to migrants but it is bad for Italy. ‘We simply don’t have the resources to deal with all these new people.\n\nTradition: Financial consultant Emilio, 52, added: ‘Immigration is a big problem. I don’t want lots of immigrants coming to Como. ‘This will affect our jobs, our resources, and the character of our town.’\n\nProblem: Tour guide Denise says the growing number of migrants is a problem which is only getting worse. The 67-year-old added: ‘Immigration here in Italy is a problem, a big problem because of the huge numbers who are arriving all the time.’\n\nNot welcome: Maria Graziaand Giacoma Marito Moglie are concerned that Italy can no longer cope with the influx of migrants. Maria said: ‘I don’t want them here. ‘Italy has enough problems without trying to solve the problems of the world.'\n\n‘It is a lack of resources that is the problem with immigration. Not that we are bad people but that he don’t have the resources to deal with all of these new people arriving in our country.’\n\nFinancial consultant Emilio, 52, said: ‘Immigration is a big problem. I don’t want lots of immigrants coming to Como.\n\n‘This will affect our jobs, our resources, and the character of our town.’\n\nClooney spends up to four months a year as his lake-side 30-room Villa Oleandra which he bought in 2002, officially putting the up-market destination on the international map.\n\n‘People here in Como don’t like them. There are simply too many of them.’\n\nHe celebrated his marriage to Amal Clooney at the £7.5 million Italian home in the picturesque village of Laglio where he keeps an impressive wine cellar and tours the lake on a motor launch.\n\nScenes for Clooney’s heist-movie Oceans Twelve were shot at his Villa Oleandra and actors Emily Blunt and John Krasinski were married in the grounds.\n\nCo-star Brad Pitt and his wife Angelina Jolie are frequent house guests. Matt Bellamy, frontman of the band Muse, who has his own villa along the shore, often pops in.\n\nHowever those who work and live in the area fear the area is being permanently damaged.\n\nSimona, 27, who works in a shop, said: ‘We don’t need any more immigrants here. They are already all over the town. I really hope the situation will not get any worse. Already they sleep in the park. We don’t want people all over the streets.\n\n‘This will only ruin the tourist trade. No one will want to come here.’\n\nRomance: Clooney and his wife celebrated their first year of marriage in Lake Como earlier this week as locals voiced concerns about the number of migrants coming to the area\n\nHoliday home: George Clooney bought his Lake Como property (pictured) for £7.5million in 2002 and spends four months a year here, getting a private jet and catching a boat, which is moored at the bottom of his garden\n\nBelgian ex-pat Nico said: ‘This is a complex issue. Europe has to work together to solve this problem. Italy cannot take on the responsibility on its own.’\n\nItalian newspapers have suggested Como could become a small ‘Ventimiglia’ – the frontier town with France where hundreds of migrants set up a camp and fought pitched battles with police last year after Paris closed the border.\n\nThe lake-side town, just a few miles from the main Italy-Switzerland border, is already home to hundreds of migrants from Africa, Asia and the Middle East, with more arriving every day.\n\nPlans to set up a purpose-built migrant camp on the outskirts of Como had to be scrapped following bad-tempered protests from locals.\n\nInstead immigrants, who have registered a claim for asylum in Italy, are housed in up to 100 hostels throughout the town. They also receive a Euro 75-a-month subsistence allowance while the demand is processed.\n\nOthers – recent arrivals to the town and those whose asylum applications have been turned down – sleep in makeshift camps and under bridges.\n\nAlready the winding cobbled streets of Como’s old town are overrun by young Asian men hawking umbrellas, flowers and other goods. Africans sleep in the parks and North Africans chatter on their mobile phones.\n\nSome have praised the Swiss for holding back the tide of migrants.\n\nEllen and Klaus from Dortmund, Germany, said: ‘Good. I’m pleased to hear that the Switzerland has closed the border. This will help Germany. We [Germany] cannot save the world on our own. Already we have taken in so many thousands of refugees.\n\n‘We have had a lot of problems. I don’t know if you know what happened in Cologne on New Years Eve. It only takes a few to cause problems but this was serious.\n\n‘No one minds someone who learns the language and gets a job but it’s the others.\n\n‘Really other [EU] countries should also help.’\n\nOthers have called for European countries to act together to solve the migrant crisis.\n\nStudent Miriam 24 said: ‘Europe has turned nasty after the Brexit vote. Every country is looking for itself now, that is what I think.\n\nComplex problem: Belgian expat Nico (pictured with his daughter) told MailOnline: 'Italy cannot take on the responsibility on its own.’\n\nUnhappy: Ellen and Klaus from Dortmund, Germany, (left) say it is time Switzerland closed its borders while Arab Israeli Maher says everyone should be allowed to go where they want\n\n‘But people here in Lombardy [region of Como] are open-minded. I don’t know if the town will become like Ventimiglia. But we have to work together to solve this problem with refugees.’\n\nTourist Arab Israeli Maher said: ‘I think everyone should be able to travel wherever they want to go. Europe is meant to be a place where you can travel without borders. This should not be just for people from Europe but for everyone from whatever country.’\n\nWe don’t need any more immigrants here. They are already all over the town. I really hope the situation will not get any worse. Already they sleep in the park. We don’t want people all over the streets.\n\nMusic superstar Madonna, fashion house empress Dontella Versace and millionaire entrepreneur Sir Richard Branson are among his many high-rolling neighbours.\n\nDiners at the restaurant on Isola Comacina, Lake Como’s only island, have included Princess Margaret, Kirk Douglas, Barbra Streisand, Arnold Schwarzenegger, Sylvester Stallone and Elton John.\n\nBanking heir James Rothchild proposed to hotel heiress Nicky Hilton on a boat on the 28-mile lake in the shadow of the Swiss mountains.\n\nComo’s grand Villa d’Este hotel charges up to £2,000-a-night. Previous guests include the Duke and Duchess of Windsor, US President JFK with Marilyn Monroe and more recently although separately Madonna and Bruce Springsteen.\n\nAnd Robert De Niro rubs shoulders with Clooney over cocktails at the lakeside Harry’s Bar where VIPs can enjoy a drink without fear of being photographed, just a few miles from the border.\n\nMeanwhile African migrants at one hostel have told MailOnline how they were forced to leave Italy because their asylum applications are turned down.\n\nIf their demand is rejected they are no longer eligible to the Euro 75 per month subsistence allowance and are evicted from the hostel.\n\nShelter: Makeshift camps have sprung up near San Giovanni station as migrants try to cross the border as hundreds of homeless are camping there before making their onwards journeys to Germany and England\n\nRubbish: But their presence has spoiled the idyllic surrounding enjoyed by the wealthy inhabitants, they say as litter is strewn everywhere\n\nHopes: Ossas, 39, from Nigeria, said: ‘We want a new life in Italy but we have to move on because Italy often does not accept us as refugees. ‘We have all claimed asylum here in Italy but 90 per cent of claims are refused.\n\nDreams: Dumbuya, 23, a teacher from Mali, said: 'I had to come to Europe to save my life. ‘I have not seen my family for four years. I just want to start a new life.’\n\nOssas, 39, from Nigeria, said: ‘We want a new life in Italy but we have to move on because Italy often does not accept us as refugees.\n\n‘We have all claimed asylum here in Italy but 90 per cent of claims are refused.\n\n‘If we are refused we are given seven days to leave the hostel and we no longer receive any money.\n\n‘So we have to sleep in the streets and try to find something to eat. That is why we try to go to other countries.’\n\nOthers explained reasons why they risked had their lives to cross the Mediterranean a seek a new life in Europe.\n\nDumbuya, 23, a teacher from Mali, said: ‘I am from the north of the country where there is war. I had to leave my country because of the war.\n\n‘First I went to Libya and worked there but I was kidnapped by the Islamists and held as a prisoner. I escaped and made my way to the coast.\n\n‘I had to come to Europe to save my life.\n\n‘I have not seen my family for four years. I just want to start a new life.’\n\nLorry driver Lucky Obera, 29, fled his home in Nigeria after receiving death threats.\n\nHe said: ‘I had a crash in my lorry and killed a man. Then his family tried to kill me. I had to escape.\n\nSuperstars: Celebrities such as Madonna, Brad Pitt and his wife Angelina Jolie are frequently seen in Lake Como as is Matt Bellamy, frontman of the band Muse, who has his own villa along the shore that he shared with former wife Kate Hudson\n\nHigh society: Franklin Roosevelt Jnr, son of the late US president, and wife Ethel (nee du Pont) enjoyed their honeymoon at Lake Como and Banking heir James Rothchild proposed to hotel heiress Nicky Hilton on a boat on the lake in the shadow of the Swiss mountains\n\nLuxury: Como’s grand Villa d’Este hotel charges up to £2,000-a-night. Previous guests include the Duke and Duchess of Windsor, US President JFK with Marilyn Monroe and more recently although separately Madonna and Bruce Springsteen.\n\nIdris, 23, from Senegal, fled when Islamist rebels tried to force him to become a fighter.\n\nHe said: ‘The rebels came to my village and said I had to join them in their fight. I ran away. I made my way to Libya and got on a boat.\n\n‘It was a small rubber boat with a capacity for 80 people. But the smugglers made 150 get on boat.\n\n‘The journey was terrible. We were in the sea for four days. It was hell. Some 30 people died on the journey.", "images": ["https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/1s/2020/04/17/18/27329034-0-image-a-10_1587145310401.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645700500000578-3689928-image-a-10_1468497572740.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363AB20B00000578-3689928-image-a-45_1468496151776.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363E533600000578-3689928-image-a-41_1468496032508.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/00661DC600000258-3689928-image-a-24_1468495992382.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/0008D9C000000C1D-3689928-image-a-26_1468495992600.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/00041F4F00000258-3689928-Music_superstar_Madonna_fashion_house_empress_Dontella_Versace_h-a-20_1468495992313.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363B50B100000578-3689928-Holiday_home_George_Clooney_bought_his_Lake_Como_property_pictur-a-17_1468495992198.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3643EA5E00000578-3689928-Not_welcome_Maria_Graziaand_Giacoma_Marito_Moglie_are_concerned_-a-33_1468495993095.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645360700000578-3689928-image-a-36_1468495993244.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316454-0-image-a-18_1587125714890.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/19/27330756-0-image-a-6_1587148551167.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/07/video-27306022-770_154x115.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/15/27321548-0-image-a-37_1587134123891.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/12/01/362CDFCD00000578-0-image-m-16_1468283182854.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363AB1A500000578-3689928-Shelter_Camps_have_sprung_up_near_San_Giovanni_station_as_migran-a-19_1468495992282.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/13/36440E2D00000578-3689928-image-a-12_1468497731940.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3643F37E00000578-3689928-Moving_on_African_migrants_stay_a_hostel_in_Como_but_can_no_long-a-31_1468495992846.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3644245D00000578-3689928-Problem_Tour_guide_Denise_says_the_growing_number_of_migrants_is-a-34_1468495993233.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363AB1C000000578-3689928-image-a-32_1468495992935.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/11/27265126-0-image-m-13_1587033403972.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27313170-0-image-m-25_1587119028862.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3644247500000578-3689928-image-a-28_1468495992725.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/09/27309852-0-image-a-13_1587113311145.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/364535F200000578-3689928-image-a-27_1468495992666.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645361900000578-3689928-image-a-29_1468495992744.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363AE63D00000578-3689928-image-a-42_1468496144737.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/36369EC800000578-3689928-Romance_Clooney_and_his_wife_celebrated_their_first_year_of_marr-a-39_1468495993444.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27298132-0-image-a-10_1587083448170.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/13/27269924-0-image-a-34_1587041887123.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363E538700000578-3689928-image-m-40_1468496023177.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645664E00000578-0-image-a-2_1468497477360.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/364535EE00000578-3689928-image-a-35_1468495993238.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27332258-0-image-a-25_1587151978215.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/13/00/3635896400000578-0-image-m-52_1468364989910.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363E57D800000578-3689928-Complex_problem_Belgian_expat_Nico_pictured_with_his_daughter_sa-a-23_1468495992351.jpg", "https://i.dailymail.co.uk/i/pix/2016/07/14/12/363AB15500000578-3689928-Camps_strewn_with_litter_and_rusted_junk_have_popped_up_near_San-a-16_1468495992196.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645664E00000578-0-image-a-2_1468497477360.jpg", "keywords": [], "authors": ["Nick Fagge", "Nick Fagge In Como", "Italy", "For Mailonline"], "canonical_link": "https://www.dailymail.co.uk/news/article-3689928/We-don-t-want-refugees-George-Clooney-s-super-rich-Lake-Como-neighbours-say-Italian-idyll-RUINED-migrants-doorstep-Switzerland-closes-border.html", "title": "George Clooney's Lake Como neighbours say it is being ruined by migrants", "meta_data": {"keywords": "dailymail,news,George Clooney (Old),Immigration", "news_keywords": "dailymail,news,George Clooney (Old),Immigration", "original-source": "https://www.dailymail.co.uk/news/article-3689928/We-don-t-want-refugees-George-Clooney-s-super-rich-Lake-Como-neighbours-say-Italian-idyll-RUINED-migrants-doorstep-Switzerland-closes-border.html", "description": "The wealthy residents of Lake Como where Clooney bought an estate for £7.5m in 2002 are angry their picture perfect paradise is being marred by the makeshift migrant camp opened there.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "George Clooney's Lake Como neighbours vent anger over migrants", "description": "The wealthy residents of Lake Como where Clooney bought an estate for £7.5m in 2002 are angry their picture perfect paradise is being marred by the makeshift migrant camp opened there.", "url": "https://www.dailymail.co.uk/news/article-3689928/We-don-t-want-refugees-George-Clooney-s-super-rich-Lake-Como-neighbours-say-Italian-idyll-RUINED-migrants-doorstep-Switzerland-closes-border.html", "image": "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645664E00000578-0-image-a-2_1468497477360.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 3689928, "author": "Nick Fagge", "divclasspage": "articlePage", "mol": {"headline": "EXCLUSIVE - 'We don't want ANY refugees here': George Clooney's super rich Lake Como neighbours say Italian idyll is being RUINED by migrants on their doorstep after Switzerland closes its border"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2016-07-14T13:13:28+0100", "modified_time": "2016-07-14T15:17:46+0100", "section": "News", "tag": "We don t want refugees George Clooney s super rich Lake Como neighbours say Italian idyll RUINED migrants doorstep Switzerland closes border", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "George Clooney's Lake Como neighbours vent anger over migrants", "type": "article", "description": "The wealthy residents of Lake Como where Clooney bought an estate for £7.5m in 2002 are angry their picture perfect paradise is being marred by the makeshift migrant camp opened there.", "url": "https://www.dailymail.co.uk/news/article-3689928/We-don-t-want-refugees-George-Clooney-s-super-rich-Lake-Como-neighbours-say-Italian-idyll-RUINED-migrants-doorstep-Switzerland-closes-border.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2016/07/14/12/3645664E00000578-0-image-a-2_1468497477360.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2016/03/15/6825910351782720223/1024x576_6825910351782720223.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/3689928/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/3689928/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1468498408.0, "source": "https://www.dailymail.co.uk", "summary": ""}