{"url": "https://web.archive.org/web/20101217214909/http://www2.tbo.com:80/content/2010/dec/13/131756/news-channel-8-anchor-keith-cate-interviews-obam1/news-politics/", "text": "Obama addresses key concerns for Floridians\n\nRelated Links Watch complete interview\n\nIn an exclusive one-on-one interview this afternoon at the White House, News Channel 8 anchor Keith Cate asked President Barack Obama questions about the economy, health care and Republican leadership.\n\nKeith: Let me start with the economy, Mr. President. Unemployment in the state of Florida is higher than the national average.\n\nObama: Right.\n\nKeith: 11.9 percent. What does this new tax deal do for those 1.1 million Floridians who are looking for work, and what does it do for the businesses that have been reluctant to hire and maybe in some circumstances, because of the economy, cannot afford to hire?\n\nObama: Well, first of all, you're absolutely right. Florida was as hard hit as any state in the country -- partly because the housing market in Florida really took a hit. And in those states where the housing market went up and then went down very rapidly, that really hurt the economy generally. This tax package does a couple of things immediately for economic growth in Florida. Number one, for those folks looking for work right now, it extends their unemployment benefits. Two million people across the country would lose their unemployment benefits at the end of this month if we did not move forward on this tax agreement. And economists say that not only is that good for those families, it's good for the entire economy. It's probably the biggest boost that we can give an economy because those folks are most likely to spend the money with businesses, and that gives them customers. The second thing it does is make sure that no middle class family's taxes go up starting on Jan. 1. Because the taxes are structured, they were set to expire automatically at the end of this year. Which meant that if Congress does nothing, people's paychecks are smaller. Now that's not going to be good for the economy at a time when people feel pinched -- the notion that somehow they have $1,000, $2,000, $3,000 worth of taxes to pay, that's a big problem. The third thing it does is it reduces payroll taxes for everybody in Florida. Which means that now people have a little more money in their pockets, they're more likely to spend, they're more likely to be confident about the direction of the economy. Fourth, it makes sure that all the business provisions that we had put in place a couple years ago to incentivize investments in clean energy, solar power, wind power -- investments in plants and equipment -- that all those investments, tax credits continue into next year and the year after that. So economists generally estimate whereas they were predicting 2.5 percent growth next year, they think that if this tax package goes through, they think that we may end up having 3.5 or 4 percent growth. And that extra percent of growth could mean an extra 1.5 million jobs throughout the country. That's going to be good for Florida.\n\nKeith: What is your relationship with the Republican leadership at this point going forward? A lot of the country looks and goes bipartisanship, but after the agreement was worked out you used the term hostage taker -- you didn't like dealing with hostage takers. Do you still feel that same way? What's your view of the Republican Party today?\n\nObama: The truth of the matter is, I get along fine with Mitch McConnell and I get along fine with John Boehner. On this narrow issue, I disagreed with their approach. My preference would have been to provide all those good things that I just described but not give tax breaks to the top 1, 2 percent. Folks like me that frankly don't need a tax break. I'm not going to change my spending patterns because I get a tax break. If there's something I need, I'm going to buy it. I'm not the person who needs it and who's going to add to our deficit. So I still think that it was the wrong thing to do and it didn't make sense for us to hold up the tax breaks for middle class families because the high-end tax breaks were going to elapse. But that is a philosophical difference I've got with the Republican Party. We're going to keep on arguing about that well into the next couple years -- both on their side and on my side. But I do think this package required me to take some things I didn't like. It requires them to take some things they don't like. They don't really want to, I think, extend unemployment insurance as long as we're extending it or provide college tax credits or child tax credits to people who need them. And that's part of the compromise that we're probably going to have to look at on a whole host of different issues.\n\nKeith: Let me get your opinion if I could on high-speed transit. In the state of Florida the federal government is promising or pledging up to $2.5 billion, $2.7 billion to fund a rail line between Tampa and Orlando. Ohio and Wisconsin said we're not into this, so they gave back some of the money and in fact Florida picked up another $342 million. The governor-elect Rick Scott said he's not so sure about a high-speed connection between Tampa and Orlando. What is the argument for that -- if you agree with that -- when Ohio and Wisconsin say it's not such a good idea.\n\nObama: Well look, let's face it. Some of this is wrapped up in politics. This was my idea that we should make sure that states that want to pursue high-speed rail get help from the federal government. Folks who are running against Democrats, a Democratic president, I understand that. If you go to other countries, they are cleaning our clock when it comes to infrastructure. You've got high-speed rail in China that is moving people around in ways that make our rail systems look archaic. They're investing in airports that make our airports look completely outdated. Their ports, their roads. Infrastructure across the board is going in an upward direction while our infrastructure is deteriorating. And that's not my estimation -- that's the estimation of professional engineers. So when you look at, for example, the opportunities of high-speed rail linking together key cities in Florida and historically how the rail systems have been able to promote business and economic growth and greater efficiency and fewer commuter times, it is a good thing not only by putting people to work right away but by fostering economic growth over the long term. This was an idea that has great enthusiasm among local civic leaders in those cities. And my hope is that everybody looks at this objectively and take the politics out of it. If they do, then I think Florida will benefit in part from decisions that were made in Wisconsin and Ohio that I don't think will serve their people well.\n\nKeith: Quickly, if I could get your reaction to what took place in Richmond, Va., today. I know you've been asked about this, but I'd like to hear it from you directly – when it comes to the health care decision, that parts of it are unconstitutional. What does that do? Your opinion on health care? What's your reaction to that ruling?\n\nObama: I haven't read the full ruling. I've just gotten a synopsis on it. But keep in mind this is one ruling by one federal district court. We've already had two federal district courts that have ruled that this is definitely constitutional. We've got 12 federal courts who have dismissed similar lawsuits, So the majority of courts who looked at this issue so far are absolutely convinced that the health care bill is [constitutional]. You've got one judge who disagreed. That's the nature of these things. When Social Security was passed, there were all kinds of lawsuits. When the civil rights act was passed and the voting rights act was passed, there were all kinds of lawsuits. We are absolutely confident that the basic issue that this judge identified -- that we say that in order to make sure that insurance companies have to provide care to people with pre-existing conditions, we've got to make sure that everybody has some kind of insurance -- the same way that they have car insurance. That's something that makes sense to most people. Think about it -- when it comes to car insurance, we wouldn't say that you can wait until you get into a car wreck and then you can go to the insurance company, say hey, I want to buy some insurance for my car. If you can't do that for car insurance, why can you do that for health insurance. How can you wait until you get sick and then go and say I want to buy some insurance? That isn't fair and I think most people understand it isn't fair. All we've said is everybody has to get some basic insurance so that we're not paying for you when you get sick. And that helps keep everybody's cost down and it makes sure that that insurance company can't discriminate against you if you've got pre-existing conditions. It's the right thing to do, and I'm confident that the courts will uphold it.\n\nKeith: When might you be coming back to the state of Florida? I don't know if you've heard but the beaches are clean and the water is pure. Any thoughts on a business trip or maybe a pleasure trip to the state of Florida? Open for business.\n\nObama: Let me tell you -- if there's any time in January, February or March where I can get to Florida, I'm going to take that opportunity. Because I don't know if you've noticed, but it's a little chilly outside right here.\n\nKeith: It is, but it's cold in Florida today. Mr. President, thank you so much.", "images": ["https://web.archive.org/web/20101217214909im_/http://mgtbo.112.2o7.net/b/ss/mgtbo/1/G.6--NS/0", "https://web.archive.org/web/20101217214909im_/http://cssimages.tbo.com/shared/boxerjamlogo_50x20.gif", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@TopRight?x", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/_shared/icons/video/video_16.gif", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/_topnav/wflalogo.gif", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Right?x", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/buttons/bigbutton_twitter.jpg", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Top?x", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/buttons/bigbutton_myspace.jpg", "https://web.archive.org/web/20101217214909im_/http://cssimages.tbo.com/shared/kewlboxlogo_100x20.gif", "https://web.archive.org/web/20101217214909im_/http://www2.tbo.com/exposure/ar/220/220/2010/12/13/86278_obama_image.jpg", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Right2?x", "https://web.archive.org/web/20101217214909im_/http://pixel.quantserve.com/pixel/p-b5I1kIl7bxY5w.gif", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Position2?x", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Top2?x", "https://web.archive.org/web/20101217214909im_/http://cssimages.tbo.com/shared/mglogo_80x35.gif", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/_topnav/centrologo.gif", "https://web.archive.org/web/20101217214909im_/http://cssimages.tbo.com/shared/dealtakerlogo_105x20.gif", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/images/loading_bar.gif", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/_topnav/tbologo252x90.gif", "https://web.archive.org/web/20101217214909im_/http://cssimages.tbo.com/shared/blockdotlogo_90x20.gif", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/_shared/icons/social/tool_textSize_transparent.png", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/buttons/bigbutton_facebook.jpg", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/_topnav/tampatriblogo.gif", "https://web.archive.org/web/20101217214909im_/http://media2.tbo.com/media/images/buttons/bigbutton_email.jpg", "https://web.archive.org/web/20101217214909im_/http://www2.tbo.com/exposure/ar/659/372/2010/12/13/86278_obama_image.jpg", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Position1?x", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Left3?x", "https://web.archive.org/web/20101217214909im_/http://ads.mgnetwork.com/RealMedia/ads/adstream_nx.ads/www.tbo.com/news/politics/story.htm@Bottom?x"], "top_img": "https://web.archive.org/web/20101217214909im_/http://www2.tbo.com/exposure/ar/220/220/2010/12/13/86278_obama_image.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Obama addresses key concerns for Floridians", "meta_data": {"msvalidate.01": "C16DF090BB463E48A524E94B56B29C5E", "description": "President Obama answered questions about health care, high-speed rail, Republican leadership and tax cuts.", "og": {"image": "https://web.archive.org/web/20101217214909im_/http://www2.tbo.com/exposure/ar/220/220/2010/12/13/86278_obama_image.jpg", "title": "Obama addresses key concerns for Floridians", "site_name": "TBO.com"}, "title": "TBO.com: Obama addresses key concerns for Floridians"}, "movies": [], "publish_date": 1292169600.0, "source": "https://web.archive.org", "summary": ""}