{"url": "www.usatoday.com/story/life/2017/09/05/here-all-reasons-royal-baby-no-3-more-significant-than-just-another-spare/630662001/", "text": "Only last summer, Duchess Kate of Cambridge was heard telling someone about having \"more babies\" and everyone thought she was just joking. She wasn't: That September, the palace confirmed she was expecting her third royal baby. Kate, 36, gave birth to a boy Monday, who came in at a healthy 8 pounds, 7 ounces.\n\nHere are some of the reasons why this matters:\n\nThe succession: The new prince alters the line for the throne. He is now fifth behind sister Princess Charlotte of Cambridge, 2, brother Prince George of Cambridge, 4, father Prince William, Duke of Cambridge, 35, and grandfather Prince Charles, 68, the Prince of Wales and Queen Elizabeth II's eldest son.\n\nWith George and Charlotte as their generation's \"heir and spare,\" the new baby becomes another spare but in a new era of recent changes in succession law that make royal birth order more important than gender.\n\nSo the baby prince (royal fans began immediately speculating about names), will follow Charlotte not jump ahead of her. And if it had been another girl, she would not lose her place to a younger brother who might follow.\n\nUncle Prince Harry, 33, moves down to sixth in line, while great-uncle Prince Andrew, the queen's second son, moves down to seventh. His daughters, Princess Beatrice and Eugenie, move down to eighth and ninth respectively, and the queen's youngest son, Prince Edward, moves to 10th.\n\nThe memory of Diana: No one would have been more thrilled about another baby than Diana, a woman described by her sons as a wonderful mum who had a special rapport with children. During the weeks of mourning following commemoration of her death, happy pictures of her with her sons were everywhere. People recalled she first came to public attention before her engagement to Prince Charles was announced in 1981 as a London nanny and, in a famous picture, as a nursery school aide clutching toddlers to her hips.\n\nA new baby may have been coincidental but it was an apt reminder that life goes on, turning the page on a new chapter for the royal family and for the Cambridges in particular.\n\nFollowing thequeen's lead: Will and Kate may be on their way to imitating his grandparents in family size, which would make them relative rarities as royal heirs.\n\nThe queen, 92, and Prince Philip, 96, have four children, but aside from them, no others in the close line of succession have had more than two kids. The birth order of Will and Kate's children follows that of the Queen's children too: boy, girl, boy. The queen's grandfather, King George V, who died in 1936, had six children.\n\nPrince George: The nation's favorite 4-year-old started school at Thomas's Battersea last fall, a milestone his mother had to miss due to a recurrence of her acute morning sickness with Baby No. 3. Prince William accompanied him, followed by a small press pool in hopes avoiding a repeat of the mob scenes that surrounded Will and Harry's first days of school with Diana back in the 1980s.\n\nAcute morning sickness explained: What is hyperemesis gravidarum?\n\nPrince Harry: He's thrilled about the new baby. Soon after the announcement, during a visit to Manchester, he was asked about the new heir and told reporters, \"Fantastic. Great. Very, very happy for them.\"\n\nAlthough he moves down further in the succession, Harry was still required by law to get the permission of the queen to marry American actress Meghan Markle, 36, on May 19 at Windsor Castle. (The 245-year-old law that required all royals to get the monarch's permission changed in 2013 to include only the first six in line.)\n\nPrince Andrew: The new baby means the Duke of York, the 58-year-old second son of the queen and Prince Philip, no longer has to get the queen's permission to remarry — even if he and his ex-wife, Sarah Ferguson, the Duchess of York, get hitched again. The two are still close, sharing the same royal mansion for years even though they divorced in 1996, but they have always denied they plan to remarry.\n\nRecovery in nice digs:\n\nLast year, Will and Kate and their children returned full-time to Kensington Palace, where Will and Harry grew up with Diana after her separation and divorce from Prince Charles. The Cambridges had been living at their country retreat in Norfolk, where Prince George attended a Montessori nursery school, and near where Will had a part-time job as a helicopter pilot for an air ambulance service.\n\nWilliam gave up his pilot job to become a full-time member of the royal firm and has been undertaking more responsibilities on behalf of the queen and Prince Philip, who retired from official life in 2017.", "images": ["https://www.gannett-cdn.com/-mm-/be5ea3c81d2f210999614c62dd841b079b1e4e37/c=0-0-2766-1563/local/-/media/2017/09/04/USATODAY/USATODAY/636401264775886816-AFP-AFP-S37BL.jpg?width=2766&height=1563&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/be5ea3c81d2f210999614c62dd841b079b1e4e37/c=0-0-2766-1563/local/-/media/2017/09/04/USATODAY/USATODAY/636401264775886816-AFP-AFP-S37BL.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5775201276001_5775146239001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/be5ea3c81d2f210999614c62dd841b079b1e4e37/c=0-0-2766-1563/local/-/media/2017/09/04/USATODAY/USATODAY/636401264775886816-AFP-AFP-S37BL.jpg?width=2766&height=1563&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2017/09/05/here-all-reasons-royal-baby-no-3-more-significant-than-just-another-spare/630662001/", "title": "Here are all of the reasons new baby prince of Cambridge is more significant than just 'another spare'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Here are all of the reasons new baby prince of Cambridge is more significant than just 'another spare'", "description": "A new baby prince for Will and Kate adds another spare heir to the succession, but there are other reasons the development is important.", "url": "https://www.usatoday.com/story/life/2017/09/05/here-all-reasons-royal-baby-no-3-more-significant-than-just-another-spare/630662001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/be5ea3c81d2f210999614c62dd841b079b1e4e37/c=0-0-2766-1563/local/-/media/2017/09/04/USATODAY/USATODAY/636401264775886816-AFP-AFP-S37BL.jpg?width=2766&height=1563&fit=crop&format=pjpg&auto=webp", "width": 2766, "height": 1563}, "type": "article"}, "article": {"author": "Maria Puente", "content_tier": "free", "opinion": "false"}, "description": "A new baby prince for Will and Kate adds another spare heir to the succession, but there are other reasons the development is important.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/be5ea3c81d2f210999614c62dd841b079b1e4e37/c=0-0-2766-1563/local/-/media/2017/09/04/USATODAY/USATODAY/636401264775886816-AFP-AFP-S37BL.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Here are all of the reasons new baby prince of Cambridge is more significant than just 'another spare'", "description": "A new baby prince for Will and Kate adds another spare heir to the succession, but there are other reasons the development is important."}}, "movies": [], "publish_date": 1504540800.0, "source": "http://www.usatoday.com", "summary": ""}