{"url": "https://variety.com/2018/tv/features/rachel-brosnahan-emmys-the-marvelous-mrs-maisel-1202948487/", "text": "In the end, a piece of dental floss saved the day.\n\nRachel Brosnahan’s otherwise perfect night at the Emmy Awards — which included not only a trophy for best actress in a comedy for Amazon’s “The Marvelous Mrs. Maisel” but also a win for comedy series, among others — had one tiny flaw. There was the little matter of the diamond ring she couldn’t get off her hand.\n\nHours earlier, in her rush to get dressed, she tried on the “beautiful, beautiful” ring. But then she wanted to switch it to another finger — and it wouldn’t budge. “And then you know when you start pulling on something, it just gets swollen,” she recounts the next morning over a late breakfast in her hotel room in West Hollywood. “So I was on the red carpet minorly panicking about this ring that was very stuck on my finger.”\n\nIt wasn’t until she got home in the wee hours that she was able to do a bit of research on YouTube, and learned about the dental floss and olive oil trick. “It’s all the rage,” she says, joking. After a little threading and a lot of slathering, the offending bauble finally slid off her finger. “So much for a perfect night,” she adds with a laugh.\n\nThe awards show had barely begun when it was clear the momentum was all in “Maisel’s” favor. First, Alex Borstein (who plays comedy club manager Susie Myerson) won for best supporting actress; then the show’s creator and executive producer, Amy Sherman-Palladino, made history as the first woman to win for both writing and directing in the same year. The next thing Brosnahan knew, Angela Bassett was announcing her name (if butchering it a bit). “I was completely overwhelmed,” says Brosnahan.\n\nShe didn’t prepare a speech, she says, but after what she laughingly recalls as the “Oprah debacle” at the Golden Globes — she’d interrupted herself mid-acceptance with a shout-out to Oprah Winfrey — she cobbled together in her head a list of people to thank. But what she really wanted to do was speak to the moment.\n\n“One of the things I love the most about this show … [is] it’s about a woman who is finding her voice anew,” she said from the stage. “It’s something that’s happening all over the country right now. One of the most important ways that we can find and use our voices is to vote. So if you haven’t already registered, do it on your cell phone right now. Vote, show up and bring a friend to the polls.”\n\nReflecting on the call to action the next morning, she dismisses any suggestion that it was politically motivated. “It didn’t feel political to me,” she says. “It’s our duty as citizens to have a say.”\n\nAnd while she recognizes that strident speeches from celebrities at awards shows can feel “self-indulgent and vain,” she wasn’t going to miss the opportunity to take advantage of the spotlight to make a point. “We have a huge election coming up, and it’s more important than ever that we exercise our right to vote,” she says. “It’s hard, hard won.”\n\nBrosnahan says she hasn’t decided where she’ll keep her trophy. “The Golden Globe is on the toilet, but the shelf is not big enough for them both.”\n\nEric Jamison/Invision/AP/REX/Shu\n\n“The Marvelous Mrs. Maisel” proved marvelous indeed — the comedy, which will debut its second season later this year, would go on to nearly dominate the half-hour categories — winning five prizes that night and eight trophies overall out of 14 nominations. The Academy clearly fell in love with the tale of Midge Maisel, a 1950s New York City housewife whose fairy-tale life gets upended when her husband walks out, leading her to discover a talent for stand-up comedy.\n\nThe morning after the Emmy sweep, bleary-eyed after a late-night run to In-N-Out Burger after hitting the party circuit, Brosnahan is slightly dazed. (“I’m bad at parties,” she says apologetically. “Too much mingling and small talk, which has never been my strong suit.”) Despite the trophy sitting nearby on the bed, the win hasn’t quite sunk in.\n\n“I’ll never recover from having my name spoken in the same sentence as the other legendary actresses in this categories who I’ve admired,” she says of her fellow nominees, including Pamela Adlon, Allison Janney, Issa Rae, Tracee Ellis Ross and Lily Tomlin. “It’s just been wild and crazy and incomprehensible. It’s a dream I didn’t know I had.”\n\nThe show is something of an acting Olympics — not only must she master that rat-a-tat Sherman-Palladino dialogue, but she also has to deliver it from the stages of comedy clubs as Midge makes the rounds honing her routine.\n\nIn person, the 27-year-old actress is nothing like the bold, outspoken Midge — her quiet demeanor is punctuated by soft, self-conscious giggles. “I think we are both ambitious — we’re both resilient, and I think we both see the glass half full,” she says. “But I’m not as confident as Midge, particularly when it comes to work. Midge enters into this whole new field that she has no experience in at all, and genuinely believes in her heart of hearts that she can take it by storm. She never doubts it for a single second. That’s not me.”\n\nSummoning up that bravado is somewhat of a leap for her, she readily acknowledges. It starts with “power posing” in her mirror — and then segues to what she says the show’s first assistant director calls “siren songs.” “I don’t know how you’d ever print this,” she says, letting out an over-the-top “Ahhhhh!”\n\nThat, along with copious amounts of caffeine, is what she credits with enabling her to summon the moxie. “Midge has a lot of energy,” she says. “A lot more than we usually have at four in the morning on a Monday.”\n\nTwo seasons in (with a third already ordered), Brosnahan admits she’s still intimidated.\n\n“I knew that Midge would become a successful stand-up, but I didn’t really think about what that would look like in practice,” she says. “The audiences are growing now, which means that they’re growing for Midge, but they’re also growing for me. I’m performing in front of more and more people every time I get up onstage, and it’s horrifying. It never gets less horrifying. Although from some stand-ups I’ve spoken to, it doesn’t seem that out of the ordinary. So I’m in good company with the constant state of petrification.”\n\nAnd then there’s the matter of living up to the creators’ exacting standards, a point Sherman-Palladino highlighted when receiving the trophy for best writing. She thanked the cast for its endurance and “graciously accept[ing] that sometimes it matters when you drop the ‘the.’”\n\nBrosnahan acknowledges the pressure is intense. “But I appreciate that she knows that her dialogue exactly as written is the best version of it,” she says. Two script supervisors are on hand to make sure nothing goes amiss — one matches the actions, and the other is solely there to monitor the dialogue. “She’s very gentle and so lovely and patient,” Brosnahan says, “but she will often come in with a contraction note: ‘It’s “it’s,” and you’re saying “It is.”’ But she’s always right. It’s those tiny, tiny little shifts that make the thing sing.”\n\nThe secret of Rachel’s success is good old-fashioned talent and extreme hard work. no one works harder on her craft. she’s a total and utter perfectionist, but in the nicest possible way.\n\namy sherman-palladino\n\nSherman-Palladino has created some of TV’s most indelible female characters, working with actresses like Lauren Graham, Alexis Bledel and Sutton Foster. (“I need those fast-talking broads!” she quips.) And this partnership, too, has delivered creatively for both.\n\n“The secret of Rachel’s success is good old-fashioned talent and extreme hard work. No one works harder on her craft, on her character,” says Sherman-Palladino. “She’s a total and utter perfectionist, but in the nicest possible way. It’s that fearlessness, that confidence, that strength, that ability to commit everything to a scene, that brings Midge alive. Plus, no one can take off some gloves, a coat and a purse faster or with more precision. That may not sound like much, but in our show — it’s a lifesaver.”\n\nBrosnahan says she’s “completely in awe” of her boss’ talent. “She knows exactly what she wants all the time, not unlike Midge,” she says. “She tackles this enormous show and all of the stuff that comes with it with a real sense of joy.” And she admits she’s desperately striving to keep up with Sherman-Palladino’s famously encyclopedic knowledge of pop culture, whether from today or the 1950s. “She was very dismayed that I didn’t know who the Dionne quintuplets were!” she says.\n\nThe costumes also help her get into character — they’re all tailor-made and custom-designed by Donna Zakowska. “I don’t feel complete until I have a wig on, my hair did, lipstick and the corset,” says Brosnahan. It’s not about making her thinner — her petite frame is apparent, even clad in a heavy hotel robe — but about giving her body the right shape for the period. “Midge is very fashion-conscious, and the shape of 1950s fashion was with a long torso and lower waist,” she says, explaining that her waist falls naturally higher. “This way the costumes really do look like they came out of a fashion magazine because that would have been important to Midge.”\n\nShe hasn’t quite stolen anything from Midge’s ample closet yet, though she has her eye on a gray knee-length cashmere coat. “It’s so luxurious and heavy and warm, it’s just like wearing a blanket,” she sighs.\n\nAlthough Brosnahan was shy as a kid growing up in suburban Illinois, she says she always wanted to be an actress.\n\n“Mostly I just had a love for storytelling, from a very young age,” she says. “I loved to read. I was an incessant reader — anything and everything.” Fantasy novels were a favorite — from Roald Dahl to the Harry Potter books — for the way they transported her to faraway, different worlds. “That translated very directly into a love for this kind of storytelling and a love for period pieces.” Bit parts in the third-grade play, “where you pulled your part out of a hat and played Troll No. 2,” translated into more formidable roles in high school and college.\n\nBut acting felt like a hobby, she says. “I guess I just didn’t know for a long time that it could be a career. I always felt like maybe I would have to choose something else.” She even considered a career in psychology, which she minored in in college.\n\nWe Are The Rhoads for Variety\n\nAnd then she landed the part of the enigmatic Rachel Posner in Netflix’s “House of Cards,” and turned what was planned to be a five-line role into a recurring character (and snagged an Emmy nom for guest actress).\n\nThe series’ then-showrunner Beau Willimon says Brosnahan’s performance “leapt off the screen” so much that they wrote large parts of the season to expand her story. “The more we worked with Rachel, the more obvious it became that she had a long and successful career ahead of her,” he says. “I can’t say we predicted she’d win an Emmy, but with an extraordinary gift like hers, I’m not at all surprised.”\n\nBrosnahan remains grateful for the opportunity the show provided. “I look often at ‘House of Cards,’ which at the time felt like absolutely the hardest, most excruciating and also fulfilling — by the same token — thing I’d ever done up until this point, and they’re just so different. That was challenging because it required digging into emotional depths that I’d never traveled to before and trying to hold my own with such powerhouses around me,” she says. “I’ve been so lucky to be able to say that I had more than one experience that’s as fulfilling as the current one.”\n\nAfter Brosnahan starred in the WGN America drama series “Manhattan” and took on a few stage roles, the script for “Maisel” landed in her lap. “I fell in love with it from the first page,” she says. “Midge reminded me of so many women that I know and love in my own life that I don’t see on-screen enough — unapologetically confident, ambitious women who approach the world with a sense of insatiable curiosity and joy. She’s complicated too. She’s privileged and selfish and has a hard time seeing outside her previously very narrow worldview. But she’s interested in growing and evolving. And that’s exciting to me as well.”\n\nThe Palladinos were cycling through a stream of auditions when Brosnahan walked in.\n\n“There’s a fearlessness to Rachel,” says Sherman-Palladino. “She was not afraid to lean into the anger that Midge was feeling when she took that stage.”\n\nBrosnahan says she recognizes the rage that fuels Midge’s mission. “Women are angry sometimes. Men are angry. Everybody’s angry,” she says. “And wouldn’t you be angry if your husband walked out on you, after all of your goals have been accomplished and dreams have come true? You have a perfect life, and everything comes shattering down. I’m glad it came through, and they bought it.”\n\nJennifer Salke, head of Amazon Studios, says of Brosnahan’s portrayal: “Rachel brings a rawness and relentless authenticity to Midge that comes from a deeply committed place. The audience has to believe that Midge is on this journey that she never intended would be her path in life. There is never a moment where the performance doesn’t ring true, and that is an unbelievable feat in bringing a character to life.”\n\nThe Palladinos had been developing the series for years, but its debut last November couldn’t have been timed more perfectly: The show about a woman finding her voice hit as the national conversation turned to precisely that subject.\n\n“I have no desire to stop playing her anytime soon,” says Brosnahan of Midge Maisel. “I’m into playing her as long as Amy wants to keep writing her and directing her.”\n\nCourtesy of Amazon Studios\n\n“I think it was a fortunate coincidence,” says Brosnahan. “But it’s been really encouraging talking to young women who feel inspired by the show and inspired by Midge in her journey and her innate sense of self-empowerment.”\n\nBrosnahan promises there’s more to come in Season 2 as Midge explores her voice onstage. “I love how she’s asking questions about motherhood and womanhood and the double standards between women and men and some of the hypocrisy that she’s noticing now that she’s got her eyes wide open,” she says. There’s a moment in the second season when she dares to say the word “pregnant” onstage — it was a taboo for comics back then — “and it’s not well received,” she says. “In the 1950s that isn’t something you can talk about. It’s considered crude and rude and private and inappropriate to be discussing in public, and I think that just fuels her fire.”\n\nThough she now has both a Golden Globe and an Emmy to her name, Brosnahan says she doesn’t feel like she’s quite arrived. “I’m not sure you ever have that moment,” she says.\n\n“I think it always feels like the other shoe could drop, and that’s motivating in its own way. It feels kind of important to never feel like ‘I’ve got this.’ It feels like the minute I reach that point, I’ll stop taking risks, and I don’t want to do that.”\n\nWhile she’s in “Maisel” for the “long haul” (“I have no desire to stop playing her anytime soon”), she’s got her eye out for other projects with female creators.\n\n“I’m dying to work with more women in all different facets of the industry,” she says. “I hope that there’ll be more opportunities to work with more women as we continue the conversation about the need for more women to be represented in different parts of this industry, whether in front of or behind the camera.”\n\nAnd maybe one day she’ll join their ranks as a producer or director. “I’d like to do it all — if they’ll let me,” she says.", "images": ["https://pmcvariety.files.wordpress.com/2018/09/marvelous-ms-maisel.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Ffeatures%2Frachel-brosnahan-emmys-the-marvelous-mrs-maisel-1202948487%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202948487&comment_count=10", "https://pmcvariety.files.wordpress.com/2018/09/rachel-brosnahan-variety-emmys-cover-story-3.jpg", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/09/rachel-brosnahan-variety-emmys-cover-story-2.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/09/rachel-brosnahan-variety-emmys-cover-story-2.jpg?w=1000", "keywords": [], "authors": ["Debra Birnbaum"], "canonical_link": "https://variety.com/2018/tv/features/rachel-brosnahan-emmys-the-marvelous-mrs-maisel-1202948487/", "title": "Rachel Brosnahan on Finding Mrs. Maisel and Her ‘Marvelous’ Emmys Night", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "With her star turn in Amazon’s award-winning comedy, Rachel Brosnahan finds her voice.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202948487, "author": "Debra Birnbaum", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-09-20T06:00:50"}, "pmc-tag": "Emmys,Rachel Brosnahan,The Marvelous Mrs. Maisel", "title": "Rachel Brosnahan on Finding Mrs. Maisel and Her ‘Marvelous’ Emmys Night", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Rachel Brosnahan on Finding Mrs. Maisel and Her ‘Marvelous’ Emmys Night", "url": "https://variety.com/2018/tv/features/rachel-brosnahan-emmys-the-marvelous-mrs-maisel-1202948487/", "description": "In the end, a piece of dental floss saved the day. Rachel Brosnahan’s otherwise perfect night at the Emmy Awards — which included not only a trophy for best actress in a comedy for Amazon’s “The Ma…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/09/rachel-brosnahan-variety-emmys-cover-story-2.jpg?w=1000", "width": 1000, "height": 781, "alt": "rachel brosnahan Emmys Cover Story"}, "locale": "en_US"}, "article": {"published_time": "2018-09-20T13:00:50+00:00", "modified_time": "2018-09-21T21:29:42+00:00"}, "twitter": {"creator": "@debrabirnbaum", "site": "@variety", "text": {"title": "Rachel Brosnahan on Finding Mrs. Maisel and Her ‘Marvelous’ Emmys Night"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/09/rachel-brosnahan-variety-emmys-cover-story-2.jpg?w=1000", "alt": "rachel brosnahan Emmys Cover Story"}, "card": "summary_large_image", "title": "Rachel Brosnahan on Finding Mrs. Maisel and Her ‘Marvelous’ Emmys Night", "description": "With her star turn in Amazon’s award-winning comedy, Rachel Brosnahan finds her voice."}, "author": "Debra Birnbaum", "content_type": "Article", "post_id": 1202948487, "title": "Rachel Brosnahan on Finding Mrs. Maisel and Her 'Marvelous' Emmys Night", "published_at": "2018-09-20 06:00:50", "image": "https://pmcvariety.files.wordpress.com/2018/09/rachel-brosnahan-variety-emmys-cover-story-2.jpg?w=1000", "comment_count": 10, "tags": "The Marvelous Mrs. Maisel", "topics": "News", "appeared_in_print": "Yes", "body": "In the end, a piece of dental floss saved the day.\r\n\r\nRachel Brosnahan’s otherwise perfect night at the Emmy Awards — which included not only a trophy for best actress in a comedy for Amazon’s “The Marvelous Mrs. Maisel” but also a win for comedy series, among others — had one tiny flaw. There was the little matter of the diamond ring she couldn’t get off her hand.\r\n\r\nHours earlier, in her rush to get dressed, she tried on the “beautiful, beautiful” ring. But then she wanted to switch it to another finger — and it wouldn’t budge. “And then you know when you start pulling on something, it just gets swollen,” she recounts the next morning over a late breakfast in her hotel room in West Hollywood. “So I was on the red carpet minorly panicking about this ring that was very stuck on my finger.”\r\n\r\nIt wasn’t until she got home in the wee hours that she was able to do a bit of research on YouTube, and learned about the dental floss and olive oil trick. “It’s all the rage,” she says, joking. After a little threading and a lot of slathering, the offending bauble finally slid off her finger. “So much for a perfect night,” she adds with a laugh.\r\n\r\nThe awards show had barely begun when it was clear the momentum was all in “Maisel’s” favor. First, Alex Borstein (who plays comedy club manager Susie Myerson) won for best supporting actress; then the show’s creator and executive producer, Amy Sherman-Palladino, made history as the first woman to win for both writing and directing in the same year. The next thing Brosnahan knew, Angela Bassett was announcing her name (if butchering it a bit). “I was completely overwhelmed,” says Brosnahan.\r\n\r\nShe didn’t prepare a speech, she says, but after what she laughingly recalls as the “Oprah debacle” at the Golden Globes — she’d interrupted herself mid-acceptance with a shout-out to Oprah Winfrey — she cobbled together in her head a list of people to thank. But what she really wanted to do was speak to the moment.\r\n\r\n“One of the things I love the most about this show … [is] it’s about a woman who is finding her voice anew,” she said from the stage. “It’s something that’s happening all over the country right now. One of the most important ways that we can find and use our voices is to vote. So if you haven’t already registered, do it on your cell phone right now. Vote, show up and bring a friend to the polls.”\r\n\r\nReflecting on the call to action the next morning, she dismisses any suggestion that it was politically motivated. “It didn’t feel political to me,” she says. “It’s our duty as citizens to have a say.”\r\n\r\nAnd while she recognizes that strident speeches from celebrities at awards shows can feel “self-indulgent and vain,” she wasn’t going to miss the opportunity to take advantage of the spotlight to make a point. “We have a huge election coming up, and it’s more important than ever that we exercise our right to vote,” she says. “It’s hard, hard won.”\r\n\r\n\r\n\r\n\r\n\r\n\r\nBrosnahan says she hasn’t decided where she’ll keep her trophy. “The Golden Globe is on the toilet, but the shelf is not big enough for them both.”\r\nEric Jamison/Invision/AP/REX/Shu\r\n\r\n\r\n\r\n“The Marvelous Mrs. Maisel” proved marvelous indeed — the comedy, which will debut its second season later this year, would go on to nearly dominate the half-hour categories — winning five prizes that night and eight trophies overall out of 14 nominations. The Academy clearly fell in love with the tale of Midge Maisel, a 1950s New York City housewife whose fairy-tale life gets upended when her husband walks out, leading her to discover a talent for stand-up comedy.\r\n\r\nThe morning after the Emmy sweep, bleary-eyed after a late-night run to In-N-Out Burger after hitting the party circuit, Brosnahan is slightly dazed. (“I’m bad at parties,” she says apologetically. “Too much mingling and small talk, which has never been my strong suit.”) Despite the trophy sitting nearby on the bed, the win hasn’t quite sunk in.\r\n\r\n“I’ll never recover from having my name spoken in the same sentence as the other legendary actresses in this categories who I’ve admired,” she says of her fellow nominees, including Pamela Adlon, Allison Janney, Issa Rae, Tracee Ellis Ross and Lily Tomlin. “It’s just been wild and crazy and incomprehensible. It’s a dream I didn’t know I had.”\r\n\r\nThe show is something of an acting Olympics — not only must she master that rat-a-tat Sherman-Palladino dialogue, but she also has to deliver it from the stages of comedy clubs as Midge makes the rounds honing her routine.\r\n\r\nIn person, the 27-year-old actress is nothing like the bold, outspoken Midge — her quiet demeanor is punctuated by soft, self-conscious giggles. “I think we are both ambitious — we’re both resilient, and I think we both see the glass half full,” she says. “But I’m not as confident as Midge, particularly when it comes to work. Midge enters into this whole new field that she has no experience in at all, and genuinely believes in her heart of hearts that she can take it by storm. She never doubts it for a single second. That’s not me.”\r\n\r\nSummoning up that bravado is somewhat of a leap for her, she readily acknowledges. It starts with “power posing” in her mirror — and then segues to what she says the show’s first assistant director calls “siren songs.” “I don’t know how you’d ever print this,” she says, letting out an over-the-top “Ahhhhh!”\r\n\r\nThat, along with copious amounts of caffeine, is what she credits with enabling her to summon the moxie. “Midge has a lot of energy,” she says. “A lot more than we usually have at four in the morning on a Monday.”\r\n\r\nTwo seasons in (with a third already ordered), Brosnahan admits she’s still intimidated.\r\n\r\n“I knew that Midge would become a successful stand-up, but I didn’t really think about what that would look like in practice,” she says. “The audiences are growing now, which means that they’re growing for Midge, but they’re also growing for me. I’m performing in front of more and more people every time I get up onstage, and it’s horrifying. It never gets less horrifying. Although from some stand-ups I’ve spoken to, it doesn’t seem that out of the ordinary. So I’m in good company with the constant state of petrification.”\r\n\r\nAnd then there’s the matter of living up to the creators’ exacting standards, a point Sherman-Palladino highlighted when receiving the trophy for best writing. She thanked the cast for its endurance and “graciously accept[ing] that sometimes it matters when you drop the ‘the.’”\r\n\r\nBrosnahan acknowledges the pressure is intense. “But I appreciate that she knows that her dialogue exactly as written is the best version of it,” she says. Two script supervisors are on hand to make sure nothing goes amiss — one matches the actions, and the other is solely there to monitor the dialogue. “She’s very gentle and so lovely and patient,” Brosnahan says, “but she will often come in with a contraction note: ‘It’s “it’s,” and you’re saying “It is.”’ But she’s always right. It’s those tiny, tiny little shifts that make the thing sing.”\r\nThe secret of Rachel’s success is good old-fashioned talent and extreme hard work. no one works harder on her craft. she’s a total and utter perfectionist, but in the nicest possible way.\r\namy sherman-palladino\r\nSherman-Palladino has created some of TV’s most indelible female characters, working with actresses like Lauren Graham, Alexis Bledel and Sutton Foster. (“I need those fast-talking broads!” she quips.) And this partnership, too, has delivered creatively for both.\r\n\r\n“The secret of Rachel’s success is good old-fashioned talent and extreme hard work. No one works harder on her craft, on her character,” says Sherman-Palladino. “She’s a total and utter perfectionist, but in the nicest possible way. It’s that fearlessness, that confidence, that strength, that ability to commit everything to a scene, that brings Midge alive. Plus, no one can take off some gloves, a coat and a purse faster or with more precision. That may not sound like much, but in our show — it’s a lifesaver.”\r\n\r\nBrosnahan says she’s “completely in awe” of her boss’ talent. “She knows exactly what she wants all the time, not unlike Midge,” she says. “She tackles this enormous show and all of the stuff that comes with it with a real sense of joy.” And she admits she’s desperately striving to keep up with Sherman-Palladino’s famously encyclopedic knowledge of pop culture, whether from today or the 1950s. “She was very dismayed that I didn’t know who the Dionne quintuplets were!” she says.\r\n\r\n\r\n\r\nThe costumes also help her get into character — they’re all tailor-made and custom-designed by Donna Zakowska. “I don’t feel complete until I have a wig on, my hair did, lipstick and the corset,” says Brosnahan. It’s not about making her thinner — her petite frame is apparent, even clad in a heavy hotel robe — but about giving her body the right shape for the period. “Midge is very fashion-conscious, and the shape of 1950s fashion was with a long torso and lower waist,” she says, explaining that her waist falls naturally higher. “This way the costumes really do look like they came out of a fashion magazine because that would have been important to Midge.”\r\n\r\nShe hasn’t quite stolen anything from Midge’s ample closet yet, though she has her eye on a gray knee-length cashmere coat. “It’s so luxurious and heavy and warm, it’s just like wearing a blanket,” she sighs.\r\n\r\nAlthough Brosnahan was shy as a kid growing up in suburban Illinois, she says she always wanted to be an actress.\r\n\r\n“Mostly I just had a love for storytelling, from a very young age,” she says. “I loved to read. I was an incessant reader — anything and everything.” Fantasy novels were a favorite — from Roald Dahl to the Harry Potter books — for the way they transported her to faraway, different worlds. “That translated very directly into a love for this kind of storytelling and a love for period pieces.” Bit parts in the third-grade play, “where you pulled your part out of a hat and played Troll No. 2,” translated into more formidable roles in high school and college.\r\n\r\nBut acting felt like a hobby, she says. “I guess I just didn’t know for a long time that it could be a career. I always felt like maybe I would have to choose something else.” She even considered a career in psychology, which she minored in in college.\r\n\r\n\r\n\r\nAnd then she landed the part of the enigmatic Rachel Posner in Netflix’s “House of Cards,” and turned what was planned to be a five-line role into a recurring character (and snagged an Emmy nom for guest actress).\r\n\r\nThe series' then-showrunner Beau Willimon says Brosnahan's performance \"leapt off the screen\" so much that they wrote large parts of the season to expand her story. \"The more we worked with Rachel, the more obvious it became that she had a long and successful career ahead of her,\" he says. \"I can't say we predicted she'd win an Emmy, but with an extraordinary gift like hers, I'm not at all surprised.\"\r\n\r\nBrosnahan remains grateful for the opportunity the show provided. “I look often at ‘House of Cards,’ which at the time felt like absolutely the hardest, most excruciating and also fulfilling — by the same token — thing I’d ever done up until this point, and they’re just so different. That was challenging because it required digging into emotional depths that I’d never traveled to before and trying to hold my own with such powerhouses around me,” she says. “I’ve been so lucky to be able to say that I had more than one experience that’s as fulfilling as the current one.”\r\n\r\nAfter Brosnahan starred in the WGN America drama series “Manhattan” and took on a few stage roles, the script for “Maisel” landed in her lap. “I fell in love with it from the first page,” she says. “Midge reminded me of so many women that I know and love in my own life that I don’t see on-screen enough — unapologetically confident, ambitious women who approach the world with a sense of insatiable curiosity and joy. She’s complicated too. She’s privileged and selfish and has a hard time seeing outside her previously very narrow worldview. But she’s interested in growing and evolving. And that’s exciting to me as well.”\r\n\r\nThe Palladinos were cycling through a stream of auditions when Brosnahan walked in.\r\n\r\n“There’s a fearlessness to Rachel,” says Sherman-Palladino. “She was not afraid to lean into the anger that Midge was feeling when she took that stage.”\r\n\r\nBrosnahan says she recognizes the rage that fuels Midge’s mission. “Women are angry sometimes. Men are angry. Everybody’s angry,” she says. “And wouldn’t you be angry if your husband walked out on you, after all of your goals have been accomplished and dreams have come true? You have a perfect life, and everything comes shattering down. I’m glad it came through, and they bought it.”\r\n\r\nJennifer Salke, head of Amazon Studios, says of Brosnahan’s portrayal: “Rachel brings a rawness and relentless authenticity to Midge that comes from a deeply committed place. The audience has to believe that Midge is on this journey that she never intended would be her path in life. There is never a moment where the performance doesn’t ring true, and that is an unbelievable feat in bringing a character to life.”\r\n\r\nThe Palladinos had been developing the series for years, but its debut last November couldn’t have been timed more perfectly: The show about a woman finding her voice hit as the national conversation turned to precisely that subject.\r\n\r\n\r\n\r\n\r\n\r\n\r\n“I have no desire to stop playing her anytime soon,” says Brosnahan of Midge Maisel. “I’m into playing her as long as Amy wants to keep writing her and directing her.”\r\nCourtesy of Amazon Studios\r\n\r\n\r\n\r\n“I think it was a fortunate coincidence,” says Brosnahan. “But it’s been really encouraging talking to young women who feel inspired by the show and inspired by Midge in her journey and her innate sense of self-empowerment.”\r\n\r\nBrosnahan promises there’s more to come in Season 2 as Midge explores her voice onstage. “I love how she’s asking questions about motherhood and womanhood and the double standards between women and men and some of the hypocrisy that she’s noticing now that she’s got her eyes wide open,” she says. There’s a moment in the second season when she dares to say the word “pregnant” onstage — it was a taboo for comics back then — “and it’s not well received,” she says. “In the 1950s that isn’t something you can talk about. It’s considered crude and rude and private and inappropriate to be discussing in public, and I think that just fuels her fire.”\r\n\r\nThough she now has both a Golden Globe and an Emmy to her name, Brosnahan says she doesn’t feel like she’s quite arrived. “I’m not sure you ever have that moment,” she says.\r\n\r\n“I think it always feels like the other shoe could drop, and that’s motivating in its own way. It feels kind of important to never feel like ‘I’ve got this.’ It feels like the minute I reach that point, I’ll stop taking risks, and I don’t want to do that.”\r\n\r\nWhile she’s in “Maisel” for the “long haul” (“I have no desire to stop playing her anytime soon”), she’s got her eye out for other projects with female creators.\r\n\r\n“I’m dying to work with more women in all different facets of the industry,” she says. “I hope that there’ll be more opportunities to work with more women as we continue the conversation about the need for more women to be represented in different parts of this industry, whether in front of or behind the camera.”\r\n\r\nAnd maybe one day she’ll join their ranks as a producer or director. “I’d like to do it all — if they’ll let me,” she says.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1537448450.0, "source": "https://variety.com", "summary": ""}