{"url": "www.thisisinsider.com/khloe-kardashian-tristan-thompson-cheating-scandal-timeline-2018-4", "text": "On April 12, 2018, Khloe Kardashian and Tristan Thompson welcomed their first child together.\n\nHowever, while Khloe was awaiting the birth of True Thompson in Cleveland, Ohio, reports began swirling that her boyfriend was photographed \"getting up close and personal with a mystery brunette\" in New York City.\n\nFrom there, videos and photos cascaded from sites like The Shade Room and TMZ that claimed to show the NBA player cheating with multiple women. Khloe later confirmed these reports and forgave Thompson — but nearly one year later, the couple was hit with yet another scandal.\n\nIf you've been following the couple's tumultuous relationship, you'll know that Thompson's reputation has been hazy from the get-go. Here's the full timeline of his reported infidelity.\n\nThompson and Khloe began dating while his girlfriend of two years, model and blogger Jordan Craig, was pregnant\n\nThompson and Craig were together for about two years starting in 2014, though it's unclear when they broke up. Thompson reportedly began dating Khloe in the summer of 2016 after a successful blind date.\n\nIn court documents obtained by Radar Online, Craig said that she found out one month into her pregnancy that Thompson was cheating on her.\n\nCraig reportedly said that she confronted Thompson about it but he denied everything. She said her suspicions were confirmed when she saw paparazzi photos of him and Kardashian together, according to the documents.\n\nGoing to miss my bump..but the best is yet to come! 😬🤗 Vest: @AzurraDubai A post shared by 🏆ℐℴ ℛđƴ.ℭ🏆 (@alleyesonjordyc) on Nov 30, 2016 at 4:21pm PST Nov 30, 2016 at 4:21pm PST\n\nThompson and Khloe stepped out as a couple in September 2016 and even went on vacation together. Craig was six months pregnant at the time.\n\nRead more: Khloe Kardashian says she didn't know Tristan Thompson was in a relationship with Jordan Craig when they started dating\n\n\"When Khloe first started dating Tristan, her family questioned if it was a good idea. There were several concerns, including that he is another basketball player and also that his ex was pregnant,\" an unnamed source told People. \"It took a while for the family to accept Tristan. They were worried that Khloe would end up heartbroken.\"\n\nShortly after Thompson and Khloe went public with their relationship, sources claimed that he was a cheater with an existing 'side chick'\n\nBET reported that, in addition to his history with Craig, Thompson was still seeing another woman.\n\nThe website cited a source who claimed that Thompson and Craig broke up because of his \"cheating ways.\"\n\nBossip, however, claimed that Thompson and Craig were \"very much still an item\" when he was initially filmed kissing Khloe on Snapchat.\n\nSources also told OK! magazine that Khloe's friends were concerned about her \"dating patterns\" and her new beau's intentions.\n\n#MemoriesWithYou💕 A post shared by 🏆ℐℴ ℛđƴ.ℭ🏆 (@alleyesonjordyc) on Dec 12, 2017 at 4:01pm PST Dec 12, 2017 at 4:01pm PST\n\nCraig gave birth to a son, Prince, in December of 2016. She apparently did not list Thompson as the father on Prince's birth certificate. According to TMZ, the baby's father must be present at the hospital for his name to appear on the initial birth certificate, though his name can be added after. Prince's last name was still listed as Thompson.\n\nKhloe has never publicly acknowledged the birth of her boyfriend's first child. And while the new father did not acknowledge the birth on social media, he did post a photo of himself and Khloe together on Christmas, two weeks later.\n\n\"Merry Christmas & Happy Holidays from me and mines, to you and yours,\" he wrote.\n\nMerry Christmas & Happy Holidays from me and mines, to you and yours. A post shared by Tristan Thompson (@realtristan13) on Dec 25, 2016 at 6:24pm PST Dec 25, 2016 at 6:24pm PST\n\nAbout two weeks after news broke that Khloe and Thompson were expecting their first child together, Thompson was filmed with another women\n\nJust before the birth of True Thompson, TMZ published a surveillance video that was reportedly taken back in October — when Khloe was three months pregnant — of Thompson appearing to cheat on her with two women at a hookah lounge outside Washington, DC.\n\nThe video was recorded on October 7, 2017, the night before Thompson and the Cleveland Cavaliers played the Washington Wizards.\n\nWhile it's unclear why the footage surfaced months later, the couple was almost certainly aware of Khloe's pregnancy when the cheating reportedly took place. Although the couple had yet to confirm the pregnancy publicly, as The Cut writer and \"Keeping Up With the Kardashians\" expert Mariah Smith noted, they likely filmed her pregnancy announcement to the family on August 25, 2017.\n\nOnce Kardashian confirmed her pregnancy in December 2017, Twitter was aflame with the allegation that Thompson had cheated on his pregnant ex with Khloe\n\nAlthough the rumor had obviously been floating around social media for months, it didn't seem to gain much traction until Khloe's pregnancy was confirmed.\n\n\"OK but he cheated on his pregnant ex with u so what makes u think he won't do the same now,\" one commenter wrote on her announcement post.\n\nTwitter user @rosechocglam also expressed disdain that Thompson had rarely — if ever — acknowledged his son Prince on social media, \"but was happy to pose for a pregnancy announcement with Khloe.\"\n\nAt the time, an unnamed source told Hollywood Life that Craig didn't want to be seen as a \"poor victimized woman.\"\n\n\"Jordan and Tristan had split already when he met Khloe, so he didn't desert her at all, and they're actually pretty good friends still, all things considered,\" the source told the site.\n\nOn Tuesday, April 10, nearing Khloe's due date, photos and videos surfaced of Thompson with another woman in New York City\n\nThe Daily Mail reported that Thompson was seen kissing an unidentified woman at PH-D Lounge in New York City on Saturday, April 7.\n\nThe supposed encounter was caught on video, which the Daily Mail published. The unnamed woman who filmed it told the site, \"I was there and he was on the table right next to us with a group of friends and one girl who he was obviously making out with all night.\"\n\nPage Six later identified the woman as 28-year-old model Lani Blair and reported that the two spent four hours together at the Cleveland Cavaliers' hotel (who were in the city to play the New York Knicks on Monday night). The pair was then photographed on their way to Soho House and again back at the hotel at 5 a.m. on Sunday.\n\nRead more: People think Khloe Kardashian knew about Tristan Thompson's alleged cheating for months — and it proves how powerful the Kardashians really are\n\nMeanwhile, the \"Revenge Body\" creator had been nesting in Cleveland as she awaited the arrival of their daughter.\n\nWe are ready whenever you are little mama 🦋 A post shared by Khloé (@khloekardashian) on Apr 9, 2018 at 6:24am PDT Apr 9, 2018 at 6:24am PDT\n\n\"Tristan has been consistently cheating on Khloe. He's a serial cheater. And there will be more women to come out of the woodwork,\" a source told People. \"[Family and friends] are heartbroken for Khloe. They didn't realize how deceptive Tristan could really be.\"\n\nThompson's ex reacted to the news on social media shortly after reports of his infidelity broke\n\nWhile fans flooded Craig's social media with comments like \"you won\" and \"Karma's a b----,\" she seemingly took the high road with a message on her Instagram story.\n\n\"If you respect yourself and you respect others, you would never make light of the misfortune of anyone, nor would you feel indemnified when it comes at the expense of others,\" Craig wrote. \"Wishing peace for everyone.\"\n\nAlthough Craig did not mention Thompson by name, many interpreted this post as a response to the news. @alleyesonjordyc/Instagram\n\nOther people close to Thompson were apparently less than shocked about the news.\n\n\"None of his friends are surprised by this and they all know he cheats,\" one source told Us Weekly. \"Most of his friends and people in his circle also cheat and don't think there's anything wrong with it.\"\n\nDespite the cheating reports, Thompson was with Khloe for the birth of their daughter\n\nIt was reported that Thompson was with Khloe for the birth of their child, which was later confirmed on an episode of \"Keeping Up With the Kardashians.\"\n\nRead more: Khloe Kardashian explained why she let Tristan Thompson in the delivery room just days after reports that he cheated on her\n\nHer best friend Malika Haqq, mom Kris Jenner, and sisters Kim Kardashian West and Kourtney Kardashian were also by her side.\n\nKris, Kourtney, and Kim all flew to Cleveland to support Khloe. Thompson can be seen in the back. @khloekardashian/Instagram\n\n\"KUWTK\" fans later discovered that Khloe's family members were apparently shocked and \"disgusted\" when allegations of Thompson's indiscretions first surfaced.\n\nKhloe revealed that their daughter is still taking Thompson's last name\n\nIn her first Instagram post since the cheating reports, the new mom announced that she named her baby girl True Thompson.\n\n\"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE,\" Khloe wrote. \"Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True!\"\n\nOur little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE. Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True! A post shared by Khloé (@khloekardashian) on Apr 16, 2018 at 12:15pm PDT Apr 16, 2018 at 12:15pm PDT\n\nTwo weeks after True's birth, an anonymous source told E! News that Khloe still hoped to salvage the relationship for the sake of their daughter.\n\n\"She has one foot out the door but is also holding on to the fact that her and Tristan can make it work,\" the source told the site. \"She hasn't given up on him yet, but also hasn't really been focusing on their relationship. When they see each other, it is all about the baby and parenting together. Khloe has fallen in love with him all over again, watching him be a dad to True, but [she also] knows she needs to really take a step back and make the right decision.\"\n\nDespite initial reports that she was preparing to move back to Los Angeles as soon as possible, Khloe remained in Cleveland, which is Thompson's home base.\n\nKim Kardashian West seemingly confirmed the allegations during an interview with Ellen DeGeneres\n\nIn an interview that aired in full on Monday, April 30, DeGeneres asked Kardashian West what she thought about \"poor Khloe.\"\n\n\"I think everybody was heartbroken for her. I mean, literally days before she gives birth, her boyfriend is seen on video cheating. And, uh, you have opinions about that?\" DeGeneres asked.\n\n\"Like, I don't even know how to describe it besides it's just so f----d up,\"Kardashian West told her, seemingly confirming the reports. \"We really were rooting for Khloe, and we still are ... you know, she's so strong and she's doing the best that she can. It's a really sad situation all over.\"\n\nDespite her vagueness, this was a stunning admission from the woman who would rather drink a sardine smoothie than address rumors about her sisters. Kardashian West has insisted on multiple occasions that, especially when there are kids involved, the family prefers not to comment publicly on relatives or significant others.\n\n\"I'm gonna keep it cute and keep it classy and not talk too bad — I'm gonna try not to say anything so negative 'cause one day, True is gonna see this,\" she told DeGeneres, but went on to reiterate that the situation is \"just so messed up.\"\n\nKris Jenner called the cheating scandal 'unexpected'\n\nThe momager also appeared on \"The Ellen DeGeneres Show\" soon after True's birth. Although she was slightly more reserved than Kardashian West, she didn't shy away from addressing the \"unexpected\" scandal and Khloe's adjustment to motherhood.\n\n\"It's your daughter and she's about to have a baby,\" DeGeneres said. \"Then that video comes out of him ... you must have been furious.\"\n\n\"I'm there to support my kids no matter what happens,\" Jenner said. \"I just do the best I can, just like anybody else would for their family ... we're a force to be reckoned with.\n\n\"Khloe is amazing. I'm so proud of that kid. I get choked up because she's such a good mom and honestly I get so emotional. She's just concentrating on that, just being a mom, her baby, and I think that's what her sisters are doing as well. She's so excited about motherhood.\"\n\nKhloe and Thompson remained a couple\n\nLess than a month after True's birth, the embattled couple was spotted out and about in Cleveland.\n\nAccording to TMZ, Khloe appeared to be \"relaxed and smiling\" during lunch with Thompson and a group friends at TownHall in Cleveland. A representative from TownHall confirmed to INSIDER that the two were dining at the restaurant.\n\nAn anonymous source told Us Weekly that the pair were \"fully back together.\"\n\nThree days later, TMZ published a photo of Khloe at a Cleveland Cavaliers game Saturday night as further evidence that their relationship is still going strong. The opposing team even chanted her name while Thompson was shooting free throws.\n\n—Dime on UPROXX (@DimeUPROXX) May 2, 2018\n\nKhloe finally spoke out about criticism of her decision to stay with Thompson\n\nAlthough Khloe had posted a number of cryptic quotes and messages since the birth of her daughter, none were explicitly commenting on her relationship with Thompson — until she responded directly to a fan who called her a \"hypocrite\" for staying with him.\n\nRead more: Kourtney Kardashian says she also would have stayed with Tristan Thompson after his reported cheating scandal\n\n\"You have no knowledge of what goes on in our household or the enormous rebuilding this takes to even coexist,\" Khloe responded. \"I'm proud of my strength. I appreciate your opinion and I hope you hold that same opinion to everyone else who has stayed in situations.\"\n\nThe fan claimed that she just feels \"protective\" of Khloe and that she doesn't want \"some lame breaking [her] heart again.\"\n\n\"I love you for that and girl trust me don't I understand!!! I appreciate you,\" Khloe replied.\n\nThe new mom also hit back at a headline from the Daily Mail, which suggested that a recent dinner with Thompson was \"VERY tense.\"\n\n\"You make up anything!! I actually had a great night,\" she wrote on Twitter. \"It was a large birthday dinner for friends and as a new mom IM TIRED AF!! Being out past 10pm is not where I'll have the most energy these days.\"\n\nKhloe has since directly addressed her boyfriend's alleged infidelity\n\nIn September, Khloe — whilst spending time with Thompson and True for their first ever \"family vacay\" — also spent some time replying to reports and critical comments on Instagram.\n\nAfter a source told Us Weekly the two were discussing an engagement, Khloe called the report \"crap\" and \"ridiculous.\" Shortly after, she replied to a commenter on Instagram who accused her of \"acting like Tristan didn't cheat.\"\n\nA screenshot of Khloe Kardashian's comment on a @commentsbyceleb post. @commentsbycelebs/Instagram\n\n\"I'm not acting as if Tristan didn't cheat. I'm saying the story about marriage and anyone insinuating that they know what we speak about privately is 'crap,'\" she wrote. \"Not upset by commenters. Not upset by anything. Only pointing out when blogs create stories for you all to believe when it's just simply untrue.\"\n\nRead more: Khloe Kardashian shut down fans 'trying to create drama' after she chose to spend Thanksgiving in Cleveland\n\nOn February 19, 2019, reports surfaced that Khloe and Thompson had split because he had cheated on her again — with a close friend of the family\n\nAccording to TMZ, Thompson spent Valentine's Day with Khloe and their daughter in Los Angeles. On Sunday night, he attended the same house party as Kylie Jenner's best friend and roommate, Jordyn Woods.\n\nMY GIRLS💚🍀 A post shared by Kylie (@kyliejenner) on Jan 18, 2019 at 10:30am PST Jan 18, 2019 at 10:30am PST\n\nAnonymous party attendees told TMZ that Thompson and Woods \"were all over each other\" and \"making out.\"\n\nJason Lee, the CEO of gossip site Hollywood Unlocked, later corroborated TMZ's report.\n\nAccording to Lee, a Hollywood Unlocked contributor was also at the party and witnessed Woods sitting in Thompson's lap, the two getting \"touchy feely,\" and staying together overnight.\n\n#PressPlay One of our contributors was at #TristanThompson’s house party and saw what went down! @kyliejenner we need you to address some thangs with @jordynwoods 😤 Anyhow, #JordynWoods stayed at his house until approximately 7am. Who needs to go?! Comment below! A post shared by HOLLYWOOD UNLOCKED (@hollywoodunlocked) on Feb 19, 2019 at 1:57pm PST Feb 19, 2019 at 1:57pm PST\n\nWhat's more, Khloe and her best friend Malika Haqq appeared to confirm Lee's account. Both commented on the post with approving messages. Haqq even wrote, \"STRONG FACTS.\"\n\nThe Kardashian family's friend and publicist, Tracy Romulus, also liked Hollywood Unlocked's video.\n\nRead more: A complete timeline of Tristan Thompson reportedly cheating on Khloe Kardashian with Kylie Jenner's best friend, Jordyn Woods\n\nA source told People that Thompson and Kardashian have been on the outs for a while, and that Kardashian \"constantly hears rumors of inappropriate behavior when it comes to Tristan.\"\n\nWoods publicly addressed the allegations on an episode of 'Red Table Talk'\n\nWoods — whose late father worked on \"The Fresh Prince of Bel-Air\" and who's close with the Smith family — was embraced by Jada Pinkett Smith on her popular Facebook Watch series.\n\nWoods repeatedly told Pinkett Smith that she decided to appear on the show to take responsibility for her actions and that she regrets putting herself in a compromising situation.\n\n\"On the way out, he did kiss me. No passion... no tongue kiss, no making out, no nothing,\" she said. \"I was in shock. I was like, 'Let me just pretend that didn't happen.'\"\n\nRead more: Jordyn Woods says that Tristan Thompson is the one who initiated their kiss: 'I didn't know how to feel'\n\n\"The last thing I wanted to do was be that person. I'm no home-wrecker,\" she continued. \"I would never try to hurt someone's home, especially someone that I love.\"\n\nKhloe reacted by lashing out on Twitter, blaming Woods for breaking up her family. She later backtracked these comments and said it was \"Tristan's fault.\"\n\nAn episode of 'KUWTK' documented Khloe's reaction to the news about Thompson and Woods\n\nKhloe felt more betrayed by Jordyn because she \"knows what Tristan is capable of.\" E!\n\nOn season 16, episode 11, \"Treachery,\" Khloe recounted the conversations she had with Woods after the news broke.\n\n\"So, Jordyn said that they did make out,\" Khloe revealed. \"For Jordyn to know all I've been through with Tristan — literally, my heart is in my eyeballs.\"\n\nRead more: Khloe Kardashian called the Tristan Thompson and Jordyn Woods cheating scandal a 'debilitating blow to my soul'\n\n\"[Tristan] already knew what was up and there was nothing else he could do but confirm it,\" Khloe said later on the episode, during a confessional. \"And I got my questions answered. I was getting more details — that everyone left and Jordyn still stayed. That she was sitting on his lap in a chair, they were all over each other, they were handsy, they made out. It's disgusting.\"\n\nRepresentatives for Khloe Kardashian, Thompson, and Woods didn't respond to INSIDER's requests for comment. INSIDER will keep this post updated with any new developments.", "images": ["https://i.insider.com/5ace36b0facba835008b45b1?width=24&format=jpeg&auto=webp", "https://i.insider.com/5ace2d93facba8e4198b4585?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ace36b0facba835008b45b1?width=600&format=jpeg&auto=webp", "https://i.insider.com/5d10ef6e9c51011a5b0979b2?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5c6d7330eb3ce8008f0e1522?width=1200&format=jpeg", "https://i.insider.com/5bf580a948eb126b65604327?width=600&format=jpeg&auto=webp", "http://www.thisisinsider.com/khloe-kardashian-tristan-thompson-cheating-scandal-timeline-2018-4?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b8fe56d3cccd14f008b457f?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5c6d7330eb3ce8008f0e1522?width=1200&format=jpeg", "keywords": [], "authors": ["Callie Ahlgrim"], "canonical_link": "https://www.insider.com/khloe-kardashian-tristan-thompson-cheating-scandal-timeline-2018-4", "title": "Khloe Kardashian confirmed that Tristan Thompson cheated on her multiple times. Here's a complete timeline of all the infidelity accusations against him.", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Khloe Kardashian confirmed that Tristan Thompson cheated on her multiple times. Here's a complete timeline of all the infidelity accusations against him.", "date": "2019-06-24", "news_keywords": "Khloe Kardashian, Kardashians, Celebrities, Tristan Thompson, Celebrity Couples, True Thompson, Kylie Jenner, Kris Jenner, Kim Kardashian, Jordyn Woods, Callie Ahlgrim", "description": "If you've been following the couple's three-year relationship, you'll know that Thompson's reputation has been hazy from the get-go.", "author": "Callie Ahlgrim", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Entertainment", "og": {"title": "Khloe Kardashian confirmed that Tristan Thompson cheated on her multiple times. Here's a complete timeline of all the infidelity accusations against him.", "description": "If you've been following the couple's three-year relationship, you'll know that Thompson's reputation has been hazy from the get-go.", "type": "article", "url": "https://www.insider.com/khloe-kardashian-tristan-thompson-cheating-scandal-timeline-2018-4", "image": "https://i.insider.com/5c6d7330eb3ce8008f0e1522?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Khloe Kardashian confirmed that Tristan Thompson cheated on her multiple times. Here's a complete timeline of all the infidelity accusations against him.", "sailthru.date": "2019-06-24", "sailthru.tags": "Khloe Kardashian, Kardashians, Celebrities, Tristan Thompson, Celebrity Couples, True Thompson, Kylie Jenner, Kris Jenner, Kim Kardashian, Jordyn Woods, Callie Ahlgrim", "sailthru.description": "If you've been following the couple's three-year relationship, you'll know that Thompson's reputation has been hazy from the get-go.", "sailthru.author": "Callie Ahlgrim", "sailthru.verticals": "entertainment, news", "sailthru.image.full": "https://i.insider.com/5c6d7318eb3ce8119e393334?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5c6d7318eb3ce8119e393334?width=160&format=jpeg", "twitter": {"card": "summary_large_image"}, "Insider": "Snapchat", "Khloe Kardashian confirmed that Tristan Thompson cheated on her multiple times. Here's a complete timeline of all the infidelity accusations against him.": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 250, "back-to-top": "control", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "variant"}, "viking-id": "5ace0b5afacba8ab0b8b4692", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1561305600.0, "source": "http://www.thisisinsider.com", "summary": ""}