{"url": "en.wikipedia.org/wiki/One_Love_Manchester", "text": "2017 benefit concert organised by Ariana Grande\n\nOne Love Manchester was a benefit concert and British television special held on 4 June 2017, which was organised by American singer and actress Ariana Grande, Simon Moran, Melvin Benn, and Scooter Braun in response to the bombing after the singer's concert at Manchester Arena two weeks earlier.[6][7][8] The concert took place at Old Trafford Cricket Ground in Old Trafford, Greater Manchester,[9] and aired live on BBC One in the UK with hosts Sara Cox and Ore Oduba. The concert was attended by 55,000 people. Guest stars included Justin Bieber, the Black Eyed Peas,[10] Coldplay,[9] Miley Cyrus, Mac Miller, Marcus Mumford, Niall Horan, Little Mix,[6] Katy Perry, Take That, Imogen Heap, Pharrell Williams, Robbie Williams and Liam Gallagher.[6][7][11]\n\nProceeds from the event benefit the We Love Manchester Emergency Fund, which was established by the Manchester City Council and the British Red Cross[12] following the 22 May bombing, which killed 22 concert goers and injured more than 500. The funds will go to help the victims and their families.[11] The British Red Cross reported it received more than £10 million in donations in the 12 hours following the concert.[13] Despite time zone differences, networks from at least 50 countries broadcast the concert live,[14] which was simultaneously streamed live on various platforms, including Twitter, Facebook and YouTube.[15]\n\nNew York's Vulture section ranked the event as the No. 1 concert of 2017.[16]\n\nBackground [ edit ]\n\nOn 22 May 2017, a suicide bombing was carried out at Manchester Arena in Manchester, England, following a concert by Ariana Grande as part of the singer's Dangerous Woman Tour. 22 of the concert-goers and parents who were in the entrance waiting to pick up their children following the show were killed, more than 800 were injured and 116 of those were seriously injured.\n\nWithin a few hours after the bombing, Grande herself posted on Twitter: \"Broken. from the bottom of my heart, I am so so sorry. I don't have words. [sic]\"[17] The tweet briefly became the most-liked tweet in history.[18] Grande subsequently suspended her tour and flew to her mother's home in Boca Raton, Florida.[19][20] On 26 May, she announced that she would host a benefit concert in Manchester for the victims of the attack.[21]\n\nBefore main event [ edit ]\n\nDevelopments and planning [ edit ]\n\nPromotional poster for the concert\n\nEvent tickets were made available on 1 June 2017 for £40, and sold with no booking fees. These tickets sold out within 6 minutes of going on sale.[22] Fans who were at the concert of 22 May could apply to attend at no cost. The application ended on 31 May at 17:00, but was extended till 22:00 to allow as many people at the concert on the 22nd to apply to be there as possible.[8][23] Metrolink offered free travel for concertgoers to and from the Old Trafford tram stop.[24] Uber also said that fares of passengers travelling to and from the concert will be donated to charity.\n\nFollowing the London attack that occurred a day before the show, Greater Manchester Police announced that security would be tighter than planned. They also advised attendees not to bring bags into the venue for security reasons.[25]\n\nTickets for the concert were found to be listed for sale on the online auction site eBay, at prices above the original sales price. However, eBay responded by removing these listings from their site.[26]\n\nMain event [ edit ]\n\nA minute's silence was held before Marcus Mumford opened the concert, at the request of Mumford, in memory of those killed both in Manchester and in London.\n\nAfter Grande's first performance of the night, Stevie Wonder appeared via video link. After Heap's performance, a video of prominent Manchester footballer David Beckham reading a poem dedicated to the city was played. Videos of other artists and celebrities, including Halsey, Bastille, Anne-Marie, Demi Lovato, Jennifer Hudson, Blossoms, Chance the Rapper, Camila Cabello, The Chainsmokers, DJ Khaled, Little Mix, Circa Waves, Kendall Jenner, Clean Bandit, Dua Lipa, Sean Paul, Nick Grimshaw, Kings of Leon, Sam Smith, Rita Ora, Shawn Mendes, Twenty One Pilots, Paul McCartney, U2 and the players of Manchester United and Manchester City declaring their solidarity with Manchester were also shown.\n\nLiam Gallagher of Oasis made a surprise appearance near the end of the concert. Previously, he had stated he wanted to perform but indicated a conflict with the Rock im Park festival in Germany.[27][28] He flew in straight from his performance in Germany.[29] Coincidentally, he was also scheduled to perform at the Rock am Ring festival two days prior, but the rest of that festival day was cancelled before his scheduled performance due to terror suspicions.[30]\n\nUsher was due to appear but did not perform. He appeared with other musicians in the pre-recorded video sending best wishes to Manchester.[31]\n\nSet list [ edit ]\n\nBroadcast [ edit ]\n\nThe concert was broadcast live on BBC One, BBC Radio and Capital FM networks.[7] Television coverage on BBC One was presented by Sara Cox and Ore Oduba, with Nick Grimshaw and Anita Rani hosting from backstage and within the crowd. BBC Radio coverage consisted of a simultaneous broadcast, hosted by Scott Mills, Jo Whiley, Phil Williams and Becky Want, on BBC Radio 1, BBC Radio 2, BBC Radio 5 Live and BBC Radio Manchester respectively. BBC World Service also transmitted the concert live.[32] Outside broadcasting facilities were provided by Arena Television, and BBC Radio Outside Broadcasts.\n\nThe BBC announced that it would broadcast the entire concert even if it overran its intended three-hour duration,[33] which it did by approximately 20 minutes.[34]\n\nUK radio stations [ edit ]\n\nAt least 65 British radio stations broadcast the event live, including 39 Global music stations: the entire Capital FM, Heart FM, Gold, Radio X and Smooth Radio networks.\n\nInternational broadcasters [ edit ]\n\nBroadcasters in at least 38 countries screened the concert live, despite the time zone differences. The BBC was the host broadcaster for international television networks, and the European Broadcasting Union (EBU) distributed the concert to its radio members, which was also streamed online.[35][36] Radio broadcasters were provided the concert through the BBC World Service's programme distribution network. Stations that broadcast the concert were invited to make donations through the British Red Cross.[37]\n\nOnline streaming [ edit ]\n\nThe concert was streamed live online across a number of websites and apps, such as YouTube, Twitter and Facebook.[79]\n\nAttendance and ratings [ edit ]\n\nThe 50,000-capacity venue sold out within 20 minutes.[80] Approximately 14,000 people who attended the original Ariana Grande concert were eligible for free tickets for the One Love Manchester concert. However, approximately 10,000 additional applications, from people ineligible for free tickets, caused delays in ticket processing.[81]\n\nThe concert averaged 10.9 million viewers on BBC One, peaking at 14.5 million viewers.[80][82] 22.6 million people watched at least three minutes of the programme on BBC One, making it the UK's most-watched television event of 2017.[82] The concert reached an audience share of 49.3 percent in overall viewers, 69 percent of adults 16–24 and 61 percent in the demographic of 25–34 year-olds.[82] Consolidated 7-day figures put the average UK viewership at 11.63 million.[83] BBC iPlayer registered more than one million live-stream requests, making One Love Manchester the biggest non-sports programme in iPlayer’s history, surpassing the 2012 Summer Olympics opening ceremony.[84]\n\nMoney raised [ edit ]\n\nThe British Red Cross received £2.35 million in donations during the three-hour concert for the We Love Manchester Emergency Fund. By the next day, the British Red Cross announced it had received more than £10 million since the attack,[13] and subsequently, reports have set the total at more than £17 million.[85]\n\nGrande also donated all proceeds to the fund from a re-release of her single \"One Last Time\" and a live audio version of \"Somewhere Over the Rainbow\" that she performed during the concert.[85]\n\nTicket sale Original concert ticket holders General ticket holders Total attendance 14,158[86] 50,800[86][87] 55,000[87][88]\n\nMoney raised Ticket sale British Red Cross EIF Facebook Fundraising Total amount raised £2 million[ citation needed ] £10 million[13] £358.5 thousand[ citation needed ] £17[89] million +[85]\n\nReactions [ edit ]\n\nFrancis Wilkinson, in Bloomberg.com, wrote that Grande offered \"a face that was brave and kind in the wake of terror while accomplishing several useful goals – raising money for victims, bolstering courage and making the attacks look both puny and pointless. Whatever the terrorists had hoped to produce in Manchester, it certainly wasn't this party.\"[90] She received praise for her \"grace and strength\" in organizing, hosting and performing at the concert.[91][92] Madeline Roth of MTV News wrote that the performance \"bolstered courage among an audience that desperately needed it. ... Returning to the stage was a true act of bravery and resilience\".[93] The City of Manchester named Grande as an honorary citizen of the city following the singer's \"great many selfless acts and demonstrations of community spirit\" and will be the first to be awarded from the city.[94]\n\nKory Grow in Rolling Stone, wrote \"It felt incredibly safe. As I made my own way to the tram, I wrote in my Apple Notes app, 'Helicopter hovering overhead,' which to me signified that the fans were being watched over. Then two policemen stopped me and asked me who I was with and whether I'd written anything about a helicopter into my phone, without explaining the technology of how they'd read my Notes app. After a friendly back-and-forth, they looked through my bag, checked my ID and business card and determined I wasn't a threat. 'You have to understand, tensions are running high,' one of the men said with a smile and a handshake, allowing me through the gate. Manchester was secure tonight.\"[95] Dee Lockett, in New York's Vulture section, ranked the event as the No. 1 concert of 2017, noting:\n\nLess than two weeks after the attack, and with only a few days to privately process and mourn, Ariana returned to Manchester with an entire benefit concert she coordinated. ... She called in every favor, pulling in famous friends like Miley Cyrus and Justin Bieber to show up for the grieving city. After meeting with a parent of one of the victims, Grande said she shifted the tone of the show from somber to celebratory because she understood that it was what her fans needed. ... All night, Ariana performed without breaking, but that was when she had others by her side. ... When it was just her alone with her fans for her finale cover of \"Somewhere Over the Rainbow\", the floodgates opened. In what will likely go down as one of the defining moments of her career, she paused the song, looked out to her audience, which was already sobbing along with her, then resumed the music to nail yet another impossible note.[16]\n\nIn an interview with Billboard magazine, Grande's manager Scooter Braun remarked that \"the City of Manchester was the Hero.\"[96]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/24px-Flag_of_England.svg.png", "https://upload.wikimedia.org/wikipedia/commons/6/67/One_Love_Manchester_Logo_2.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/45/One-Love-Manchester-poster.png/220px-One-Love-Manchester-poster.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/BBC.svg/24px-BBC.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/24px-Flag_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Audio-input-microphone.png/21px-Audio-input-microphone.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/England_Greater_Manchester_numbered.svg/24px-England_Greater_Manchester_numbered.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/67/One_Love_Manchester_Logo_2.jpg/250px-One_Love_Manchester_Logo_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/67/One_Love_Manchester_Logo_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/One_Love_Manchester", "title": "One Love Manchester", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/6/67/One_Love_Manchester_Logo_2.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}