{"url": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_NSYNC", "text": "NSYNC awards and nominations Awards and nominations Award Wins Nominations American Music Awards 3 7 Billboard Music Awards 5 7 Blockbuster Awards 5 6 Juno Awards 0 1 MTV Video Music Awards 7 15 Grammy Awards 0 8 Totals[a] Wins 35 Nominations 66 Note ^ Certain award groups do not simply award one winner. They recognize several different recipients, have runners-up and have third place. Since this is a specific recognition and is different from losing an award, runner-up mentions are considered wins in this award tally. Awards in certain categories do not have prior nominations and only winners are announced by the jury. For simplification and to avoid errors, each award in this list has been presumed to have had a prior nomination.\n\nThis is a list of awards received by American pop group NSYNC. The group has won three American Music Awards, five Billboard Music Awards, seven MTV Video Music Awards and has received eight Grammy Award nominations. Additionally, they have received two RIAA Diamond certifications. NSYNC received a star on the Hollywood Walk of Fame in April 2018.[1]\n\nAmerican Music Awards [ edit ]\n\nThe American Music Awards is an annual American music awards show, created by Dick Clark in 1973.[2][3][4][5]\n\nYear Nominee / work Award Result 1999 NSYNC Favorite Pop/Rock New Artist Won 2000 Favorite Pop/Rock Band, Duo or Group Nominated 2001 'Internet Fans' Artist of the Year Won No Strings Attached Favorite Pop/Rock Album Nominated NSYNC Favorite Pop/Rock Band, Duo or Group Nominated 2002 Favorite Pop/Rock Band, Duo or Group Won Celebrity Favorite Pop/Rock Album Nominated\n\nBillboard Music Awards [ edit ]\n\nThe Billboard Music Awards is an honor given by Billboard, a publication and music popularity chart covering the music business.[6][7]\n\nYear Nominee / work Award Result 2000 No Strings Attached Album of the Year Won Special Award for biggest one-week sales ever of an album Won NSYNC Top 40 Artist of the Year Won Albums Artist Duo/Group of the Year Won 2001 NSYNC Albums Artist of the Year Nominated Albums Artist Duo/Group of the Year Nominated Celebrity Special Award for biggest one-week sales for an album in 2001 Won\n\nBlockbuster Entertainment Awards [ edit ]\n\nThe Blockbuster Entertainment Awards was a film awards ceremony, founded by Blockbuster Inc., that ran from 1995 until 2001.[8][9][10][11]\n\nYear Nominee / work Award Result 1999 NSYNC Favorite New Artist Won 2000 \"Music of my Heart\" Favorite Song from a Movie Won 2001 No Strings Attached Favorite CD Won \"Bye, Bye, Bye\" Favorite Single Won NSYNC Favorite Group of the Year Nominated Favorite Pop Group Won\n\nGrammy Awards [ edit ]\n\nThe Grammy Awards are awarded annually by the National Academy of Recording Arts and Sciences. NSYNC has received 8 nominations, including Record of the Year.[12]\n\nGuinness World Records [ edit ]\n\nThe Guinness World Records is a reference book published annually, listing world records.[13]\n\nYear Nominee / work Award Result 2000 No Strings Attached Fastest-selling pop album in U.S. history Won\n\nHollywood Walk of Fame [ edit ]\n\nThe Hollywood Walk of Fame comprises more than 2,600 stars embedded in the sidewalks of Hollywood Boulevard, representing permanent public monuments to achievement in the entertainment industry.[14]\n\nYear Nominee / work Award Result 2018 NSYNC Recording Artists Won\n\nJuno Awards [ edit ]\n\nThe Juno Awards are presented annually to Canadian musical artists and bands to acknowledge their artistic and technical achievements in all aspects of music.[15]\n\nYear Nominee / work Award Result 2001 No Strings Attached Best Selling Album (Foreign or Domestic) Nominated\n\nMnet Asian Music Awards [ edit ]\n\nThe Mnet Asian Music Awards is a South Korean music awards ceremony presented annually by entertainment company CJ E&M. Mnet Asian Music Awards[16]\n\nYear Nominee / work Award Result 2001 \"Pop\" Best International Artist Won\n\nMTV Europe Music Awards [ edit ]\n\nAn MTV Europe Music Award is an award presented by Viacom International Media Networks to honour artists and music in pop culture.[17]\n\nYear Nominee / work Award Result 2000 NSYNC Best Pop Nominated 2001 Nominated\n\nMTV Video Music Awards [ edit ]\n\nAn MTV Video Music Award is an award presented by the cable channel MTV to honor the best in the music video medium.[18][19][20][21]\n\nMuchMusic Video Awards [ edit ]\n\nThe MuchMusic Video Awards are annual awards presented by the Canadian television channel Much to honour the year's best music videos.[8]\n\nYear Nominee / work Award Result 2000 \"Bye Bye Bye\" Peoples Choice: Favorite International Group Won\n\nNickelodeon Kids' Choice Awards [ edit ]\n\nThe Nickelodeon Kids' Choice Awards is an American children's awards ceremony show that is produced by Nickelodeon.[22]\n\nYear Nominee / work Award Result 1999 NSYNC Favorite Music Group Won\n\nPeople's Choice Awards [ edit ]\n\nThe People's Choice Awards is an American awards show, recognizing the people and the work of popular culture, voted on by the general public.[8]\n\nYear Nominee / work Award Result 2001 NSYNC Favorite Musical Group or Band Won 2002 Favorite Musical Group or Band Won\n\nTeen Choice Awards [ edit ]\n\nThe Teen Choice Awards is an annual awards show that airs on the Fox television network.[23][24][25]\n\nYear Nominee / work Award Result 2000 \"It's Gonna Be Me\" Choice Music: Summer Song Won Choice Music: Video Won \"Bye Bye Bye\" Choice Music: Single Won NSYNC Choice Music: Pop Group Won No Strings Attached Choice Music: Album Nominated 2001 \"Pop\" Choice Music: Single Won Celebrity Choice Music: Album Won NSYNC Choice Music: Pop Group Nominated \"This I Promise You\" Choice Music: Love Song Nominated 2002 \"Girlfriend\" Choice Music: Single Won Choice Music: Hook Up Won \"Girlfriend\" Choice Music: R&B/Hip-Hop Track Nominated \"Gone\" Choice Music: Love Song Nominated", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/%27N_Sync_Logo.svg/220px-%27N_Sync_Logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_NSYNC", "title": "List of awards and nominations received by NSYNC", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}