{"url": "http://thomas.loc.gov/cgi-bin/bdquery/z?d103:HR01025:%7CTOM:/bss/d103query.html", "text": "There are 2 summaries for H.R.1025. Conference report filed in House (11/22/1993) Introduced in House (02/22/1993) Bill summaries are authored by CRS\n\nShown Here:\n\nConference report filed in House (11/22/1993)\n\nTABLE OF CONTENTS:\n\nTitle I: Brady Handgun Control\n\nTitle II: Multiple Firearm Purchases to State and Local Police\n\nTitle III: Federal Firearms License Reform\n\nTitle I: Brady Handgun Control - Brady Handgun Violence Prevention Act - Amends the Federal criminal code to: (1) require the Attorney General, within five years, to establish a national instant criminal background check system (system) for firearm licensees to contact for information on whether receipt of a firearm by a prospective transferee would violate Federal or State law; and (2) establish an interim five-day waiting period for handgun purchases and procedures for checking with the chief law enforcement officer of the place of residence of the purchaser (police official) for such information.\n\n(Sec. 102) Prohibits, under the interim procedures, any licensed importer, manufacturer, or dealer from transferring a handgun to an unlicensed individual unless: (1) the transferor has received a statement of eligibility from the individual, verified the individual's identity, and notified the police official and during the next five business days the transferor either has not received information that the transfer would violate the law or has received notice that the transfer would not violate the law; (2) the individual has presented a statement from the police official that he or she requires a handgun because of a threat to a family member; or (3) applicable State law requires, before any transfer, verification that possession of a handgun by the purchaser would not be unlawful. Requires notified police officials to make a reasonable effort to make the relevant determinations within five days.\n\nProhibits the transfer of a firearm to an unlicensed individual after the system is established unless the transferor has verified the individual's identity and contacted the system and either: (1) the system has provided the transferor with a unique identification number for the transfer; or (2) three business days have elapsed and the system has not notified the transferor that the transfer would violate the law.\n\nPermits a transfer (before or after the system is established) if: (1) the individual has presented a permit issued in the past five years by a State that verifies that the individual is legally qualified; (2) the Secretary of the Treasury has approved the transfer under specified provisions of the Internal Revenue Code; or (3) the Secretary has certified that compliance with the applicable background check requirements is impracticable.\n\nRequires the destruction of records pertaining to any transfer to an eligible individual.\n\nSets penalties of up to a $1,000 fine, imprisonment for not more than one year, or both, for violations of this Act.\n\n(Sec. 103) Directs the Attorney General to: (1) determine a timetable by which each State should be able to provide criminal records on an on-line capacity basis to the system; (2) expedite the upgrading of State records in the Federal criminal records system maintained by the Federal Bureau of Investigation (FBI), the development of hardware and software to link State systems to the national system, and the FBI's revitalization initiatives for technologically advanced fingerprint and criminal records identification; and (3) notify each licensee and the chief law enforcement officer of each State upon establishment of the national system.\n\nProvides for the correction of erroneous information in the system and for regulations to ensure the privacy and security of system information.\n\nProhibits any Government entity from using the system to establish any system for the registration of firearms, except with respect to persons prohibited from receiving a firearm.\n\nAuthorizes appropriations.\n\n(Sec. 106) Amends the Omnibus Crime Control and Safe Streets Act of 1968 to permit the use of formula grants under the drug control and system improvement grant program for the improvement of State record systems and the sharing with the Attorney General of specified records for the purpose of implementing this Act.\n\nDirects the Attorney General, through the Bureau of Justice Statistics, to make grants to States for the creation of a computerized criminal history record system or improvement of an existing system and for assistance in the transmittal of criminal records to the national system.\n\nTitle II: Multiple Firearm Purchases to State and Local Police - Requires each Federal firearms licensee to submit a report of multiple sales or other dispositions of firearms to the department of State police or State law enforcement agency of the State or local law enforcement agency of the local jurisdiction in which the sale or other disposition took place. Prohibits agency disclosure of any such form or contents and requires each such department or agency to: (1) destroy any form containing such information and any record of the contents within 20 days after such form is received, except with respect to a purchaser who is prohibited from receipt of a firearm; and (2) certify to the Attorney General (at six-month intervals) that no disclosure contrary to such requirements has been made and that all such forms and records have been destroyed.\n\nTitle III: Federal Firearms License Reform - Federal Firearms License Reform Act of 1993 - Amends the Federal criminal code to prohibit any common or contract carrier from requiring or causing any label, tag, or other written notice to be placed on the outside of any container indicating that it contains a firearm.\n\nProhibits: (1) any common or contract carrier from delivering in interstate or foreign commerce any firearm without obtaining written acknowledgement of receipt of the package containing the firearm; and (2) stealing or unlawfully taking or carrying away from a licensed firearms importer, manufacturer, or dealer any firearm in the licensee's business inventory that has been shipped or transported in interstate or foreign commerce (subject to penalties of up to a $10,000 fine, ten years' imprisonment, or both, for violations).\n\n(Sec. 303) Increases license application fees for firearms dealers who do not deal in destructive devices.", "images": ["https://www.congress.gov/img/svg/loc-gov-logo.svg", "https://www.congress.gov/img/svg/congress-gov-logo-no-color.svg", "http://thomas.loc.gov/img/svg/congress-gov-logo.svg", "https://www.congress.gov/img/opengraph1200by630.jpg", "https://www.congress.gov/img/svg/copyright-logo.svg"], "top_img": "https://www.congress.gov/img/opengraph1200by630.jpg", "keywords": [], "authors": ["Schumer", "Charles E."], "canonical_link": "https://www.congress.gov/bill/103rd-congress/house-bill/01025", "title": "H.R.1025 - 103rd Congress (1993-1994): Brady Handgun Violence Prevention Act", "meta_data": {"canonical": "https://www.congress.gov/bill/103rd-congress/house-bill/01025", "dc.coverage": "11/30/1993", "dc.creator": "Schumer, Charles E.", "dc.date": "11/30/1993", "dc.identifier": "/bill/103rd-congress/house-bill/01025", "dc.language": "eng", "dc.rights": "Text is government work", "dc.subject": "Congress", "dc.title": "H.R.1025 - 103rd Congress (1993-1994): Brady Handgun Violence Prevention Act", "dc.type": "legislation", "description": "Summary of H.R.1025 - 103rd Congress (1993-1994): Brady Handgun Violence Prevention Act", "viewport": "width=device-width,initial-scale=1", "og": {"description": "Summary of H.R.1025 - 103rd Congress (1993-1994): Brady Handgun Violence Prevention Act", "image": "https://www.congress.gov/img/opengraph1200by630.jpg", "title": "H.R.1025 - 103rd Congress (1993-1994): Brady Handgun Violence Prevention Act", "type": "website", "url": "https://www.congress.gov/bill/103rd-congress/house-bill/01025"}}, "movies": [], "publish_date": null, "source": "http://thomas.loc.gov", "summary": ""}