{"url": "https://tvline.com/2017/10/17/brooklyn-nine-nine-recap-jake-amy-engaged-halloween-proposal-season-5/", "text": "Warning: The following contains spoilers from Brooklyn Nine-Nine Season 5, Episode 4: “HalloVeen.”\n\nBlessed be the fruit, baby! Jake and Amy are getting married.\n\nTotally earning the title “Amazing Human Slash Genius,” Jake uses the precinct’s annual Halloween heist as a means to surprise Amy with a marriage proposal. After luring her into the evidence room via an elaborate scheme involving Fake Charles and her favorite show The Handmaid’s Tale, Jake has his Amy recite the inscription on the winner’s cummerbund, which reads, “Amy Santiago, will you marry me?”\n\nThen Amy turns to Jake, who’s down on one knee, and the most adorable exchange precedes his popping of the question:\n\nAfter Amy says yes to Jake’s proposal, Charles storms into the evidence room. He learns his best friends are engaged, grows overwhelmed and then immediately passes out (because of course he does).\n\nLater, everyone gathers at the bar to toast the engagement. Jake recalls phoning Victor to ask for Amy’s hand in marriage, which instead resulted in an awkward voicemail where he proclaimed that Amy is “a strong, independent woman and she don’t need no man!” (Suffice it to say, Jimmy Smits’ inevitable return for the wedding should be a lot of fun.)\n\nThen Terry and Charles try taking credit for the proposal. Terry thinks he gave Jake the idea when he waxed poetic about mixing vanilla and blueberry yogurt back at the precinct; Charles thinks he put the idea in his head when he interrupted Jake and Amy’s meet-cute back in 2009 and insisted he heard wedding bells. But as it turns out, Jake knew he was going to ask Amy to marry him for months, having come to the “dope” romantic epiphany when she freaked out over a random crossword typo.\n\nDetective’s log:\n\n* I love how much Holt loves the annual Halloween heist at this point. Not only is he sitting at the foot of Jake and Amy’s bed waiting for them to get up at 3 am to get a head start, but he interrupts their engagement celebration to make sure everyone knows that no one won. (“Get over it, ‘ya jag!”)\n\n* When Jake and Holt rip open each other’s button-down shirts, you actually hear the buttons falling to the floor. Even funnier, Terry yells, “Everybody stop undressing! We just had harassment training!”\n\n* Holt, when he finds out the corgi he’s walking isn’t actually his dog, exclaims, “You’re not Cheddar! You’re just some common bitch!”\n\n* Throughout the week, pretty much everyone fed Terry GPS tracking devices, so he now has at least six of them lining his intestinal tract.\n\n* Gina isn’t in the episode (Chelsea Peretti is still on maternity leave), but it’s implied that the character gave birth to a healthy baby girl.\n\n* Charles thinks the phrase “hook, line and sinker” is actually “hook, line and sphincter,” because “that’s where you put the hook in when you’re eeling!”\n\n* While it’s probably too soon to start talking wedding plans, it’s safe to assume Charles is going to try and fulfill the duties of best man and bridesmaid, yes? And Nikolaj is totally going to be the flower girl boy.\n\nWere you surprised by Tuesday’s B99 wedding proposal? Grade the episode via the following poll, then drop a comment below.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/htgawm-6x12-1.jpg?w=620", "https://i2.wp.com/www.goldderby.com/wp-content/uploads/2020/04/top-chef-last-chance-kitchen-jennifer-carroll-lisa-fernandes.jpg?resize=180%2C101&ssl=1", "https://s2.wp.com/wp-content/themes/vip/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://pmctvline2.files.wordpress.com/2019/06/lucifer-season-4-episode-4.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/drag-race-recap-2.jpg?w=620", "https://pmctvline2.files.wordpress.com/2017/10/b99-504_scn3pt_ja0518_hires2.jpg?w=620&h=420&crop=1", "https://pmcdeadline2.files.wordpress.com/2020/02/drew-carey-e1587181608936.jpg?resize=180%2C101", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://pmctvline2.files.wordpress.com/2020/04/too-hot-to-handle-recap.jpg?w=620", "https://boygeniusreport.files.wordpress.com/2020/04/1583_kepler1649cearth.jpeg?quality=98&strip=all&resize=180%2C101", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=tvline.com&path=%2F2017%2F10%2F17%2Fbrooklyn-nine-nine-recap-jake-amy-engaged-halloween-proposal-season-5%2F&ct=article&lob=tvline&loc=us&env=desktop&post_id=877389&comment_count=22", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmchollywoodlife.files.wordpress.com/2020/04/aj_izabella-alvarez-ftr-1.jpg?resize=180%2C101", "https://pmcspy.files.wordpress.com/2020/04/peel-keychain-touch-tool-featured-image.jpg?resize=180%2C101", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmctvline2.files.wordpress.com/2020/04/macgyver-spoilers-mac-riley-desi.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/03/dw-2.jpg?w=280", "https://pmctvline2.files.wordpress.com/2017/10/b99-504_scn3pt_ja0518_hires2.jpg?w=620", "https://pmctvline2.files.wordpress.com/2017/10/brooklyn-nine-nine-handmaids-tale.jpg?w=300&h=193"], "top_img": "https://pmctvline2.files.wordpress.com/2017/10/b99-504_scn3pt_ja0518_hires2.jpg?w=620", "keywords": [], "authors": ["Ryan Schwartz"], "canonical_link": "https://tvline.com/2017/10/17/brooklyn-nine-nine-recap-jake-amy-engaged-halloween-proposal-season-5/", "title": "Brooklyn Nine-Nine Recap: Jake Has a Halloween Surprise for Amy", "meta_data": {"viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "yes", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "Recap: On \"Brooklyn Nine-Nine,\" Jake surprises Amy during the Season 5 Halloween episode \"HalloVeen\" — watch video of the big moment!", "news_keywords": "Brooklyn Nine-Nine, Fox", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress.com", "og": {"type": "article", "title": "Brooklyn Nine-Nine Recap: Jake Has a Halloween Surprise for Amy", "url": "https://tvline.com/2017/10/17/brooklyn-nine-nine-recap-jake-amy-engaged-halloween-proposal-season-5/", "description": "Warning: The following contains spoilers from Brooklyn Nine-Nine Season 5, Episode 4: “HalloVeen.” Blessed be the fruit, baby! Jake and Amy are getting married. Totally earning the titl…", "site_name": "TVLine", "image": {"identifier": "https://pmctvline2.files.wordpress.com/2017/10/b99-504_scn3pt_ja0518_hires2.jpg?w=620", "width": 620, "height": 420}, "locale": "en_US"}, "article": {"published_time": "2017-10-18T01:59:39+00:00", "modified_time": "2017-10-18T13:51:14+00:00"}, "twitter": {"site": "@TVLine", "text": {"title": "<i>Brooklyn Nine-Nine</i> Recap: Jake Has a Halloween Surprise for Amy"}, "image": "https://pmctvline2.files.wordpress.com/2017/10/b99-504_scn3pt_ja0518_hires2.jpg?w=620", "card": "summary_large_image", "creator": "@RyanSchwartz", "title": "Brooklyn Nine-Nine Recap: Jake Has a Halloween Surprise for Amy", "description": "Recap: On \"Brooklyn Nine-Nine,\" Jake surprises Amy during the Season 5 Halloween episode \"HalloVeen\" — watch video of the big moment!"}, "author": "Ryan Schwartz", "content_type": "Article", "post_id": 877389, "title": "<i>Brooklyn Nine-Nine</i> Recap: Jake Has a Halloween Surprise for Amy", "published_at": "2017-10-17 18:59:39", "image": "https://pmctvline2.files.wordpress.com/2017/10/b99-504_scn3pt_ja0518_hires2.jpg?w=300&h=208&crop=1", "comment_count": 22, "tags": "Fox", "topics": "Recaps", "body": "Warning: The following contains spoilers from Brooklyn Nine-Nine Season 5, Episode 4: \"HalloVeen.\"\r\n\r\nBlessed be the fruit, baby! Jake and Amy are getting married.\r\n\r\n\r\n\r\nTotally earning the title \"Amazing Human Slash Genius,\" Jake uses the precinct's annual Halloween heist as a means to surprise Amy with a marriage proposal. After luring her into the evidence room via an elaborate scheme involving Fake Charles and her favorite show The Handmaid's Tale, Jake has his Amy recite the inscription on the winner's cummerbund, which reads, \"Amy Santiago, will you marry me?\"\r\n\r\nThen Amy turns to Jake, who's down on one knee, and the most adorable exchange precedes his popping of the question:\r\n\r\nhttps://www.youtube.com/watch?v=KwO0aCLVoJQ\r\n\r\n\r\n\r\nAfter Amy says yes to Jake's proposal, Charles storms into the evidence room. He learns his best friends are engaged, grows overwhelmed and then immediately passes out (because of course he does).\r\n\r\nLater, everyone gathers at the bar to toast the engagement. Jake recalls phoning Victor to ask for Amy's hand in marriage, which instead resulted in an awkward voicemail where he proclaimed that Amy is \"a strong, independent woman and she don't need no man!\" (Suffice it to say, Jimmy Smits' inevitable return for the wedding should be a lot of fun.)\r\n\r\nThen Terry and Charles try taking credit for the proposal. Terry thinks he gave Jake the idea when he waxed poetic about mixing vanilla and blueberry yogurt back at the precinct; Charles thinks he put the idea in his head when he interrupted Jake and Amy's meet-cute back in 2009 and insisted he heard wedding bells. But as it turns out, Jake knew he was going to ask Amy to marry him for months, having come to the \"dope\" romantic epiphany when she freaked out over a random crossword typo.\r\n\r\nDetective's log:\r\n\r\n* I love how much Holt loves the annual Halloween heist at this point. Not only is he sitting at the foot of Jake and Amy's bed waiting for them to get up at 3 am to get a head start, but he interrupts their engagement celebration to make sure everyone knows that no one won. (\"Get over it, 'ya jag!\")\r\n\r\n* When Jake and Holt rip open each other's button-down shirts, you actually hear the buttons falling to the floor. Even funnier, Terry yells, \"Everybody stop undressing! We just had harassment training!\"\r\n\r\n* Holt, when he finds out the corgi he's walking isn't actually his dog, exclaims, \"You're not Cheddar! You're just some common bitch!\"\r\n\r\n* Throughout the week, pretty much everyone fed Terry GPS tracking devices, so he now has at least six of them lining his intestinal tract.\r\n\r\n* Gina isn't in the episode (Chelsea Peretti is still on maternity leave), but it's implied that the character gave birth to a healthy baby girl.\r\n\r\n* Charles thinks the phrase \"hook, line and sinker\" is actually \"hook, line and sphincter,\" because \"that's where you put the hook in when you're eeling!\"\r\n\r\n* While it's probably too soon to start talking wedding plans, it's safe to assume Charles is going to try and fulfill the duties of best man and bridesmaid, yes? And Nikolaj is totally going to be the flower girl boy.\r\n\r\nWere you surprised by Tuesday's B99 wedding proposal? Grade the episode via the following poll, then drop a comment below.", "fb": {"pages": 187516444593639, "page_id": 187516444593639}, "application-name": "TVLine", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "TV News, Previews, Spoilers, Casting Scoop, Interviews", "msapplication-task": "name=Subscribe;action-uri=https://tvline.com/feed/;icon-uri=https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "msapplication-TileImage": "https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=270"}, "movies": ["https://www.youtube.com/embed/KwO0aCLVoJQ?version=3&enablejsapi=1&origin=https://pmctvline2.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1508169600.0, "source": "https://tvline.com", "summary": ""}