{"url": "en.wikipedia.org/wiki/Carlotta_(The_Phantom_of_the_Opera)", "text": "Ania Gigiel as Carlotta\n\nCarlotta Giudicelli is a fictional character from Gaston Leroux's 1909 novel The Phantom of the Opera. She is the leading soprano at the Paris Opera House who is criticised by the narrator and the Phantom for the lack of emotion in her performances.[1]\n\nIn the novel, she is a minor character hailing from Spain. The first time that she is mentioned in the novel is during the chapter \"The New Marguerite\", where it is revealed that she could not perform at the ceremony for the former managers. Later in the novel, she is threatened by Erik that if she performs at the Opera House \"a great misfortune will strike\". She shrugs the warning off and performs anyway. When she does, however, croaking noises come out of her mouth and the chandelier comes crashing down. Ashamed, she hides from the public view for a few weeks, before making a return to the opera house.\n\nCarlotta is portrayed by Virginia Pearson in the original 1925 silent film with Lon Chaney. In 1929, new sound scenes were filmed and Mary Fabian was recast as Carlotta, due to the fact that she could sing. Virginia Pearson still appeared in new scenes, now playing Carlotta's mother. These changes are also the same in the 1929 silent, foreign cut of the film (which is most commonly viewed).\n\nIn the 1943 film version, she is Mme. Biancarolli who has been drugged by the Phantom and murdered along with her maid when she tries to force him to take off his prop mask.\n\nIn Andrew Lloyd Webber's production, Carlotta (last name Giudicelli) is from Italy and is one of the major singing parts. The opera company's prima donna, she despises Christine Daaé and sees the younger woman as a threat to her job and Phantom's courtesan, when Christine achieves prominence due to the Phantom's dirty tricks. Carlotta and tenor Ubaldo Piangi are lovers; she often turns to him for consolation when things go wrong, and she breaks down crying when his murdered body is discovered onstage. The film reveals that she likes poodles.\n\nIn the Lloyd Webber-Joel Schumacher 2004 film version, she was played by Minnie Driver.[2] Due to Driver's lack of experience in opera, her singing voice was dubbed by opera singer Margaret Preece, although she lent her actual voice to the song \"Learn to Be Lonely\" during the end credits.\n\nIn Nicholas Meyer's novel The Canary Trainer, the characters of Carlotta and La Sorelli are combined into one, despite being mentioned as separate characters in the original novel. In Kim Newman's short story \"Angels of Music\" from the Tales of the Shadowmen anthology series, Carlotta is implied to be the ancestor of Bianca Castafiore from The Adventures of Tintin comic series.", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/AniaGigiel.jpg/220px-AniaGigiel.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/f/f6/AniaGigiel.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f6/AniaGigiel.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Carlotta_(The_Phantom_of_the_Opera)", "title": "Carlotta (The Phantom of the Opera)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/f/f6/AniaGigiel.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}