{"url": "https://tv.avclub.com/the-flash-meets-his-future-self-in-the-darkest-timeline-1798191210", "text": "Grant Gustin/The CW\n\nTV Reviews All of our TV reviews in one convenient place. Prev Next View All\n\nThe Flash Season 3 B \"The Once And Future Flash\" Episode 19\n\nAdvertisement\n\nAs if to prove that Barry Allen isn’t the worst after all, “The Once And Future Flash” takes us to the year 2024, where we meet…the worst Barry Allen ever. For about the first two-thirds of its running time, tonight’s episode is another dour power hour, a Ghost of Christmas Yet to Come trip to a dismal future where the members of Team Flash are all either dead or broken. Somehow The Flash is able to pull out of this tailspin and rally, delivering a rousing and emotionally satisfying final act that rescues the episode from the depths of bleakness.\n\nBefore that happens, however, “The Once And Future Flash” plays almost like a parody of the big-screen version of the DC Universe, that Zack Snyder world of oppressive, self-conscious gloom and humorless, damaged-goods heroes. Killer Frost escapes from STAR Labs, which Barry takes as a sign that this is the perfect time to travel to the future and collect intel on Savitar. (This is one time when Barry isn’t actually being a bonehead: anytime is the perfect time, since he can always travel back to the exact moment he left. This is a concept people will have trouble with throughout the episode.)\n\nAdvertisement\n\nThe 2024 he arrives in is, in Community parlance, the darkest timeline. The Flash has been missing for years, leaving villains like Mirror Master and the Top to run roughshod over Central City. Cisco is a shadow of his former self, deprived of his powers when Killer Frost froze off his hands (an effectively shocking moment). Wally is in a wheelchair, his spine snapped after facing Savitar alone. (So much for those super-healing powers, I guess.) Julian now works in a prison where he can look after the captured Killer Frost. Joe hangs around Iris’s grave, having been abandoned by Barry. That would be Future Emo Barry, with his stringy hair and black wardrobe, holed up in the abandoned and trashed STAR Labs, living in the past.\n\nThis is all very depressing, but worse than that, it’s (almost) meaningless. This future ceases to exists as soon as Barry gets back to his own time and starts changing things. Spending so much time here all but guarantees that Iris won’t be killed at season’s end, because we’ve already seen the effects of that happening. Why waste the emotional impact of Joe standing over Iris’s grave now? Only because it’s not going to happen later.\n\nI said it’s almost meaningless, because the effect it all has on 2017 Barry does make an impact. Sure, Barry has a bad habit of not learning from his mistakes and repeating them over and over, but seeing the way Future Emo Barry has abandoned Joe strengthens his resolve to never let that happen. This is Scrooge seeing the error of his ways and vowing to change, which makes me wonder why this wasn’t scheduled as the Christmas episode.\n\nTo that end, 2017 Barry decides to stay long enough to repair the fractured Team Flash and take down Mirror Master and Top. This is where the episode really comes to life, and a lot of the credit is due to director Tom Cavanagh. He’s already worn so many different hats on this show that stepping behind the camera was probably inevitable, and while he does a decent job with the bleak portion of the episode, it’s probably no coincidence that the hour improves drastically as soon as we see what future HR is up to. (He’s reading his romance novel to a crowd of appreciative women who are all eager to get in his pants. At least the future worked out for someone!)\n\nAdvertisement\n\nArranging the reunion of the surviving and able-bodied members of Team Flash is something Barry doesn’t have to do. Again, from his point-of-view this is only one possible future; if he is successful in changing events, it will never come to exist. It still feels like the right thing to do, though, and the way it plays out, it’s almost as if we’re getting a glimpse of a Flash reunion special years from now. The battle with Mirror Master and Top gives us some freaky Inception-type visuals of bendy buildings as well as a look at the future Flash outfit when Emo Barry finally snaps out of and joins the fight. One thing it doesn’t give us, that now feels way overdue, is Savitar’s identity. In the end we’re left with yet another tease as Savitar meets up with Killer Frost and removes his outer shell to win her trust. Who does she see? That will have to wait yet again. Ugh.\n\nStray observations\n\nMirror Master was always my favorite Rogue from the comics, but this version is a dud, I’m afraid: personality-free and falling far short of exploiting all the possibilities of mirror powers. Bring on the Earth-2 or Earth-16 or Earth-39 version.\n\n“Secrets always were our thing, weren’t they?” Killer Frost, you have crystallized one of The Flash’s biggest flaws with surgical precision.\n\n\n\nHR’s novel is called The Streak vs. Mr. Reflecto. Where does he get his ideas?\n\nSo if Savitar is trapped in the Speed Force in 2024, that rules out Wally, Julian, Cisco, Barry, Joe, and Caitlin as his secret identity, right? We see all of them in the future. Unless, of course, it’s one of them from even further in the future. Just tell us already.\n\nBarry vowed to never tamper with the past again. But when Future Emo Barry gives Barry the Speed Force trap tech to bring back to 2017 with him…isn’t he tampering with the past? (Yes. Yes, he definitely is.)", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/n0fddmlacd1ad1dnyz6g.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/n0fddmlacd1ad1dnyz6g.jpg", "keywords": [], "authors": [], "canonical_link": "https://tv.avclub.com/the-flash-meets-his-future-self-in-the-darkest-timeline-1798191210", "title": "The Flash meets his future self in the darkest timeline", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/cfeerdkqdvairskc2jmv.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/cfeerdkqdvairskc2jmv.png", "keywords": "TV, The CW, The Flash, Grant Gustin, Recap, TV Club", "news_keywords": "TV, The CW, The Flash, Grant Gustin, Recap, TV Club", "twitter": {"url": "https://tv.avclub.com/the-flash-meets-his-future-self-in-the-darkest-timeline-1798191210", "card": "summary_large_image", "site": "AVTVClub", "title": "The Flash meets his future self in the darkest timeline", "description": "As if to prove that Barry Allen isn’t the worst after all, “The Once And Future Flash” takes us to the year 2024, where we meet…the worst Barry Allen ever. For about the first two-thirds of its running time, tonight’s episode is another dour power hour, a Ghost of Christmas Yet to Come trip to a dismal future where the members of Team Flash are all either dead or broken. Somehow The Flash is able to pull out of this tailspin and rally, delivering a rousing and emotionally satisfying final act that rescues the episode from the depths of bleakness.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/n0fddmlacd1ad1dnyz6g.jpg"}, "description": "As if to prove that Barry Allen isn’t the worst after all, “The Once And Future Flash” takes us to the year 2024, where we meet…the worst Barry Allen ever. For about the first two-thirds of its running time, tonight’s episode is another dour power hour, a Ghost of Christmas Yet to Come trip to a dismal future where the members of Team Flash are all either dead or broken. Somehow The Flash is able to pull out of this tailspin and rally, delivering a rousing and emotionally satisfying final act that rescues the episode from the depths of bleakness.", "og": {"title": "The Flash meets his future self in the darkest timeline", "type": "article", "url": "https://tv.avclub.com/the-flash-meets-his-future-self-in-the-darkest-timeline-1798191210", "description": "As if to prove that Barry Allen isn’t the worst after all, “The Once And Future Flash” takes us to the year 2024, where we meet…the worst Barry Allen ever. For about the first two-thirds of its running time, tonight’s episode is another dour power hour, a Ghost of Christmas Yet to Come trip to a dismal future where the members of Team Flash are all either dead or broken. Somehow The Flash is able to pull out of this tailspin and rally, delivering a rousing and emotionally satisfying final act that rescues the episode from the depths of bleakness.", "locale": "en_US", "site_name": "TV Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/n0fddmlacd1ad1dnyz6g.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": [], "publish_date": null, "source": "https://tv.avclub.com", "summary": ""}