{"url": "https://people.com/movies/johnathon-schaech-molested-franco-zeffirelli/", "text": "Johnathon Schaech was 22 when acclaimed director Franco Zeffirelli cast him as the lead in his movie Sparrow. It was 1992, and the newcomer was thrilled to work with the Italian filmmaker, famed for films such as The Champ, La Traviata and Romeo and Juliet, for which he earned a 1969 Oscar nod for best director. But Schaech says Zeffirelli harassed and sexually abused him during the shoot, a trauma he’s kept secret for 25 years. Hopeful his story can help make positive change, the Ray Donovan actor, now 48, who rose to fame in That Thing You Do!, shared this first-person account with PEOPLE’s Elizabeth Leonard. In a statement, Zeffirelli’s son, Pippo, denied his father, now 94, verbally or sexually abused Schaech, calling the accusations “not credible.” His full statement appears below Schaech’s account.\n\nI had been in Los Angeles for about three years doing some modeling and studying acting with Roy London when I got an audition for a Franco Zeffirelli movie, Sparrow. Franco was iconic and at that point had done Hamlet with Mel Gibson, The Champ with Jon Voight, Endless Love, Taming of the Shrew with Elizabeth Taylor… so you can imagine what a big opportunity this was for me.\n\nGet push notifications with news, features and more.\n\nImage zoom Courtesy Johnathon Schaech\n\nIt was an open call and I didn’t even have an agent at that point. After more than six auditions, they flew me to Cinecitta [film studios outside of Rome], and I won the role. They flew me to England to work on the English dialect at the Royal Academy of Dramatic Arts, and it was brutal. I didn’t know it at the time but I’m dyslexic and mastering the words and dialect was difficult for me so I already felt vulnerable.\n\nFranco would fly in and out to see what the progress was — and almost immediately he began trying to seduce me with words. He would tell me how wonderful and beautiful I was, told me incredible stories and what I needed to do to really be a real artist. I could tell he wanted something from me beyond just being his leading man. Franco is incredibly charming. He was in his sixties at the time, and you’d think I’d be safe in that situation. But I just knew I wasn’t safe. I felt it. My instinct was to stay away from him. The intimacy of what I do for a living makes me have to become vulnerable to “the process,” and on this movie, that process was so long, and so elongated, it became something completely different for Franco. I was 22 years old and I had my charm and my looks and my sense of self – I thought I knew exactly who I was. But I didn’t really know anything.\n\nHe was trying to seduce me, under the guise of teaching me, from the start. In Rome, he took us to the Vatican, walked us to places where no one could go. We would be on these sets, the most amazing places in Italy, with massive crews, incredible scenery. So I felt blessed, but then Franco would drink, he would drink to extremes, and become very aggressive and abusive. Not just to me – I remember standing up for some of the young girls that he was just mean to. But he had a whole different agenda for me and I felt it.\n\nImage zoom Johnathon Schaech in Sparrow Alamy\n\nAlmost every day, Franco would say, “I need to be with you.” We filmed all over Italy and at one point we were at a château, and he would come to my door, knock on my door late at night. But I kept it locked. I would literally put stuff, chairs and things, in front of it. I could hear him coming. During the day, he would say things like “I’m coming up to see you tonight” and I would say, “I’m not OK with that Franco, it’s not OK.” He didn’t listen. I didn’t have an agent, or anyone to talk to or protect me except for my acting coach, who was unbelievable, but at the time was on his deathbed.\n\nAt the same time, Franco was verbally abusive. It got to the point where he made me feel like I couldn’t act, I couldn’t do anything right, I couldn’t speak right, I couldn’t move right — everything I did was wrong. So I felt beaten down.\n\n[Then], one night, I think it was when we were at a hotel in Sicily and my costar wasn’t there, he told me he was coming to my room. This time he had managed to get a key. I was in bed sleeping and he let himself into the bedroom and he got beside my bed and was over the top of me on the side of the bed as I awoke. He got in my face. There was a moment where I was telling him “No” and he told me, “We have to.” I remember his breath smelling of scotch. And this is the whole thing, and you hear it from the women who are opening up now about their own experiences with abuse: There’s a moment where, even though you are taught to be charming and have sex appeal as an actor, a line is crossed and everything changes. When someone crosses that line, when someone preys on you, there’s a panic that sets in. That’s what Franco did. He crossed that boundary and I felt as though I left my body. He molested me in my bed. He put his hands in places that I couldn’t even imagine and he did things that I am not proud of. But it’s not my fault. His pants never came off but I can [still] see him fumbling with his belt. He attempted to give me oral sex. I just remember being like, “God, please no. I’m OK, I’m OK.” I did nothing. I just lay there in bed. It felt like four hours but it was probably like 30 seconds.\n\nIn the moment, I don’t remember thinking, “Oh no, my career, I have to do this.” [Instead] I felt like it was a rite of passage, like I had to do it in a sense. I was vulnerable. I didn’t scream and yell. I didn’t physically stop him, and it took me 25 years to answer the question why not. There’s a moment when someone is being violated by a predator where it is a clear form of violence that creates trauma in the body. We have a fight or flight response. People say they “leave their bodies” and that’s what I did. When it was obvious Franco wasn’t getting what he wanted that night, he just left. He never tried to touch me again. I told him not to come near me again. He never said anything about it. For the predator who crosses the line they think that it’s OK.\n\nRELATED: Women of Hollywood Attend Golden Globes Together in Support of the Time’s Up Movement\n\nAfter that, I felt crushed. I felt my whole world was wrong. I didn’t know why I couldn’t handle myself in the moment. I didn’t know why it happened or what to do. It was so traumatic. I buried it for 20-something years of my life and not until Rose [McGowan opened up], did I realize all these people have had these experiences. What he did to me is evil. When he crossed that boundary, I went from being a very vibrant young charming person who faced evil to someone who didn’t know himself. In that moment I didn’t know how to handle myself and I shut myself down for 25 years. I never addressed it.\n\nImage zoom Johnathon Schaech Barry King/Getty Images\n\nIt’s caused me to have major alcohol and drug problems, sexual addictions — it caused my whole world to be confused for a long time. I carried this shame all along, I thought it was just part of who I was. I did things I could never imagine myself doing. I was raised properly. My parents are good parents. They love me. I was just too ashamed. I was ashamed of that moment, I was ashamed of being dyslexic, and both those things caused me to shut down and define a big part of me. They shamed me. That shame manifested itself in so many different ways. I medicated myself so I wouldn’t feel so bad about myself and to try and handle my low self-esteem.\n\nWhether I talk about it or not, it’s still going to be inside me. But as people bury their abuse, it breeds sickness. The problems in my life had a lot to do with that moment. A predator found me and gave me this great opportunity and took advantage of me. I was molested, touched, groped, I was verbally abused. He beat me down to do that. The psychological part was key – and he made sure he set it up. I had been innocent and although I thought I had all the answers, I didn’t have any. It was hard for me to deal with that. What I faced that day – I didn’t know how to handle that evil. I knew it was not OK what he did. That night I was not violent but after that I became more violent. I remember wanting to fight. I told almost no one over the years. I didn’t think most people would listen, and I was filled with shame. I did tell the person [actress Stephanie Romanov] I started dating when I got back from Italy, and years later I told my ex-wife [singer/actress Jana Kramer], but I never had any idea how to process it. [Both Romanov and Kramer confirm to PEOPLE that Schaech confided in them about the molestation.] I all but buried it.\n\nImage zoom Johnathon Schaech and wife Julie Solomon Axelle/Bauer-Griffin/FilmMagic\n\nWhen I saw Rose, my costar [in Doom Generation], post about her experience, it hit home. I told her this happened to me, and she’s been great. What’s also changed in my life is meeting and marrying my wife Julie [Solomon]. There had been a lack of intimacy in my connections until Julie came into my life. I was so in need of love, but I was not able to stay with somebody long enough to build a family and make that kind of connection. When we met, I looked at Julie and said, this is all I want, I’m just trying to have a life, a family, and I’m not just going survive anymore. And she’s met every single moment. I told her about the molestation, and she gave me the courage to talk about this. [Solomon confirms to PEOPLE that Schaech shared with her his experience with Zeffirelli]. I have somebody who really loves me. And I have my boy, my son.\n\nThere are really great, smart human beings in this business. They keep proper boundaries. But this culture is breeding individuals who take advantage of people and we have to stop it. The most important thing I can do is to be of service to someone else so it never happens again. It’s time to do that. There’s a deep-seeded evil inside men that we have to address and let them know it’s not OK. If they act upon those impulses, the good men, like myself, and women and the good of society, will put them in the proper place. It has to stop.\n\nImage zoom Julie Solomon, son Camden Quinn and Johnathon Schaech Courtesy Johnathon Schaech\n\nIt’s not OK for a producer to use his power to take advantage of an actress. It’s not OK to take the innocence away from a child, a boy. I don’t care if you’re 22, or 12 , a man or a woman, it’s not OK to take away innocence because you’re in a power position to do so. You have to face that thing that’s evil inside you or you will continue it onto the next generation. For my son, for the future of all of our kids, we have to stop it. Stop the evil. That’s why I wanted to talk. I want future generations to know they’re not alone.\n\nResponse from Zeffirelli’s Son\n\nIn a statement to PEOPLE, Zeffirelli’s son, Pippo, responded: “It is alleged that 25 years ago an actor, who was then in his early twenties, was the victim of alleged verbal abuse and alleged attempted sexual abuse by my father during the filming of The Sparrow in Sicily, Italy. [He] would have been 70 at the time. It is also alleged that my father drank alcohol and may have been drunk on set. Mr. Zeffirelli and all our family were living in a villa, whilst actors, production and staff were staying in a hotel in Catania; all these allegations are not credible. At the time Johnathon suffered from a throat type of obstruction which made his speaking difficult. Directors have different styles and some time they could be much more demanding on inexperienced actors. My father is in poor health and not able to understand this attack and to respond to the allegations made by Jonathan Schaech. This would be an attack to a great director, an artist and to a man at the end of his life that he is not able, nor he will be in the future able to respond. This will be an incredible damage to his image and reputation on the basis of allegations which are not credible and cannot be proved.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathan-schaech-4-2000-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-4-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathan-schaech-7-2000-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathan-schaech-1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-1.jpg", "keywords": [], "authors": ["Johnathon Schaech"], "canonical_link": "https://people.com/movies/johnathon-schaech-molested-franco-zeffirelli/", "title": "Actor Johnathon Schaech: I Was Molested by Director Franco Zeffirelli", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Johnathon Schaech,Movie Celebrities,Movie News,News,Sexual Assault,Sexual Harassment", "news_keywords": "Johnathon Schaech,Movie Celebrities,Movie News,News,Sexual Assault,Sexual Harassment", "description": "Zeffirelli directed Schaech in the 1994 film Sparrow", "og": {"title": "Actor Johnathon Schaech: I Was Molested by Director Franco Zeffirelli", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/johnathon-schaech-molested-franco-zeffirelli/", "description": "Johnathon Schaech was 22 when acclaimed director Franco Zeffirelli cast him as the lead in his movie Sparrow. It was 1992, and the newcomer was&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-1.jpg", "width": 1080, "height": 565}}, "pinterest": {"url": "https://people.com/movies/johnathon-schaech-molested-franco-zeffirelli/", "description": "Zeffirelli directed Schaech in the 1994 film Sparrow", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/johnathon-schaech-molested-franco-zeffirelli/", "title": "Actor Johnathon Schaech: I Was Molested by Director Franco Zeffirelli", "description": "Zeffirelli directed Schaech in the 1994 film Sparrow", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjohnathon-schaech-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}