{"url": "https://www.indiewire.com/2018/04/kenneth-lonergan-defends-casey-affleck-treated-abominably-metoo-harassment-1201949494/", "text": "Affleck won the Best Actor Oscar for his role in Lonergan's \"Manchester by the Sea.\"\n\nKenneth Lonergan fully supports the #MeToo movement, but he’s not happy about how his friend and collaborator Casey Affleck has been treated in the months since #MeToo and Time’s Up became talking points throughout the world. Speaking to Variety, Lonergan said the actor has been “treated abominably” in the #MeToo era. Affleck was the star of Lonergan’s acclaimed 2016 drama “Manchester by the Sea.” Lonergan won the best original screenplay prize, while Affleck earned the best actor trophy.\n\n“I couldn’t be more all for the #MeToo movement,” Lonergan said, “and I couldn’t feel more strongly that he’s been treated abominably. It’s not good for anybody.”\n\nAffleck was accused of sexual harassment by two women who worked with him on his 2010 mock-documentary “I’m Still Here.” The actor settled both suits out of court for an undisclosed amount the same year.\n\nThe allegations resurfaced in the wake of the #MeToo anti-harassment movement and they made headlines again in January when Affleck decided to step down from presenting at this year’s Oscars. Per tradition, Affleck would’ve presented the 2018 best actress trophy, but he bowed out as the #MeToo and Time’s Up campaigns took center stage during awards season.\n\nAffleck notified the Academy on January 25 that he would not be attending this year’s ceremony because he did not want his involvement in the telecast to distract from the performances of the five nominated actresses. Affleck realized he was in a “no-win situation” and voluntarily stepped down from his expected role in the broadcast.\n\nPopular on IndieWire\n\nMonths earlier in October 2017, just weeks after the Harvey Weinstein allegations reignited the industry’s attention towards sexual abuse and harassment, an online petition circulated asking the Academy to ban Affleck from the telecast. The petition earned over 19,000 signatures.\n\nLonergan’s “Howard’s End” remake premieres April 8 on Starz, and his play “Lobby Hero” is currently on Broadway with star Chris Evans. Affleck has kept a relatively low profile as of late, though he starred in David Lowery’s “A Ghost Story” last summer. Affleck’s upcoming credits include Lowery’s “The Old Man and the Gun” and “Light of My Life,” which he also wrote and directed.\n\nIndieWire has reached out to Lonergan’s representatives for further comment.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F04%2Fkenneth-lonergan-defends-casey-affleck-treated-abominably-metoo-harassment-1201949494%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201949494&comment_count=1", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://i1.wp.com/www.indiewire.com/wp-content/uploads/2018/06/Zack-Sharf.png?resize=96%2C96&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-05-at-1-59-32-pm.png", "https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-05-at-1-59-32-pm.png?w=780", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-05-at-1-59-32-pm.png", "keywords": [], "authors": ["Zack Sharf"], "canonical_link": "https://www.indiewire.com/2018/04/kenneth-lonergan-defends-casey-affleck-treated-abominably-metoo-harassment-1201949494/", "title": "Kenneth Lonergan Believes Casey Affleck ‘Has Been Treated Abominably’ in the #MeToo Era", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Affleck won the Best Actor Oscar for his role in Lonergan's \"Manchester by the Sea.\"", "news_keywords": "Casey Affleck, Kenneth Lonergan, Manchester by the Sea", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Zack Sharf", "content_type": "Article", "post_id": 1201949494, "title": "Kenneth Lonergan Believes Casey Affleck 'Has Been Treated Abominably' in the #MeToo Era", "published_at": "2018-04-05 14:16:31", "image": "https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-05-at-1-59-32-pm.png?w=300", "comment_count": 1, "tags": "Manchester by the Sea", "topics": "Film", "body": "Kenneth Lonergan fully supports the #MeToo movement, but he's not happy about how his friend and collaborator Casey Affleck has been treated in the months since #MeToo and Time's Up became talking points throughout the world. Speaking to Variety, Lonergan said the actor has been \"treated abominably\" in the #MeToo era. Affleck was the star of Lonergan's acclaimed 2016 drama \"Manchester by the Sea.\" Lonergan won the best original screenplay prize, while Affleck earned the best actor trophy.\r\n\r\n\r\n\r\n“I couldn’t be more all for the #MeToo movement,\" Lonergan said, \"and I couldn’t feel more strongly that he’s been treated abominably. It’s not good for anybody.\"\r\n\r\nAffleck was accused of sexual harassment by two women who worked with him on his 2010 mock-documentary \"I'm Still Here.\" The actor settled both suits out of court for an undisclosed amount the same year.\r\n\r\nThe allegations resurfaced in the wake of the #MeToo anti-harassment movement and they made headlines again in January when Affleck decided to step down from presenting at this year's Oscars. Per tradition, Affleck would've presented the 2018 best actress trophy, but he bowed out as the #MeToo and Time's Up campaigns took center stage during awards season.\r\n\r\nAffleck notified the Academy on January 25 that he would not be attending this year’s ceremony because he did not want his involvement in the telecast to distract from the performances of the five nominated actresses. Affleck realized he was in a “no-win situation” and voluntarily stepped down from his expected role in the broadcast.\r\n\r\nMonths earlier in October 2017, just weeks after the Harvey Weinstein allegations reignited the industry's attention towards sexual abuse and harassment, an online petition circulated asking the Academy to ban Affleck from the telecast. The petition earned over 19,000 signatures.\r\n\r\nLonergan's \"Howard's End\" remake premieres April 8 on Starz, and his play \"Lobby Hero\" is currently on Broadway with star Chris Evans. Affleck has kept a relatively low profile as of late, though he starred in David Lowery's \"A Ghost Story\" last summer. Affleck's upcoming credits include Lowery's \"The Old Man and the Gun\" and \"Light of My Life,\" which he also wrote and directed.\r\n\r\nIndieWire has reached out to Lonergan's representatives for further comment.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/04/kenneth-lonergan-defends-casey-affleck-treated-abominably-metoo-harassment-1201949494/", "title": "Kenneth Lonergan Believes Casey Affleck ‘Has Been Treated Abominably’ in the #MeToo Era", "description": "Affleck won the Best Actor Oscar for his role in Lonergan's \"Manchester by the Sea.\"", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-05-at-1-59-32-pm.png", "width": 780, "height": 515}}, "article": {"published_time": "2018-04-05T18:16:31+00:00", "modified_time": "2018-04-05T18:20:07+00:00", "author": "https://www.indiewire.com/author/zacksharf/", "section": "Film", "tag": "Manchester by the Sea"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1522952191.0, "source": "https://www.indiewire.com", "summary": ""}