{"url": "www.newidea.com.au/david-schwimmer-wants-to-win-jennifer-aniston-back", "text": "Getty\n\n‘He’s been calling and texting Jen over the last few months since her split from Justin – being a shoulder for her to lean on and proving that he can be a rock for her in her darkest times.’\n\nWhile David’s currently in London working on an executive producing gig for the BBC, he’s been in constant touch with his former on-screen girlfriend. And because he’s so keen to find a way to work with his old colleague and crush again, they’ve been discussing future projects.\n\n‘David’s made no secret to pals that he wants Jen back and he’s been doing everything he can to try to make that happen – putting her up for a role in the BBC adaptation of Love, which he’s executive producing, suggesting film roles and even talking about reunion plans again all so he can try to win back her affections.’\n\nDavid, 51, split from Zoe Buckman, 32, his English wife of seven years and mum to their seven-year-old daughter Cleo, in April 2017, just 10 months before Jennifer and Justin announced their break-up.\n\nSince then Jennifer has been linked with ex-husband Brad Pitt and as New Idea reported, there are rumours she’s expecting a baby.\n\n‘David’s feelings for Jen have always been strong but he says they’ve become stronger since her split from Justin and he’s fallen for her again – saying this time around he’s going to do everything in his power to win her over and he says he won’t let her slip through his fingers again,’ explains the pal.\n\nRelated: Jennifer Aniston spotted wearing an engagement ring\n\nGetty\n\nThe would-be couple, once known as Ross and Rachel, have always been very open about their mutual admiration. After they began working together on their hit television series Friends, rumours quickly spread that the romance they portrayed on the small screen was mirrored in their real lives.\n\nDavid described Jennifer as ‘adorable’ and ‘amazing’, and even told Oprah Winfrey back in 2003 when the hit TV show ended: ‘Jen, she amazes me. A really generous, warm, warm person.’\n\nMeanwhile, Jennifer has been equally gushing about David, calling him ‘talented’ and ‘dreamy’, and even admitting back in their Friends heyday that: ‘I’d be attracted to him. I love that sweet puppy-dog-eyed kind of thing.’\n\nRelated: Jennifer Aniston is 'ready to date again'\n\nTheir former co-stars are desperate to see the pair finally face their long-held feelings and get together.\n\n‘Courteney, Lisa, Matt, and Matthew all know about David’s plan to win her back and are fully supportive of his plan – with Courteney even offering to help in whatever way she can as they’re all gunning for them to get together,’ explains the insider.\n\n‘Finally seeing David and Jen would be a dream come true for everyone so their loved ones have all got their fingers crossed that they can finally have their happy ending – just like Ross and Rachel.’\n\nFor the full story see this weeks issue of New Idea, on sale now.", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://www.newidea.com.au/media/30406/untitled-design-8.png", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/30406/untitled-design-8.png", "keywords": [], "authors": ["Nikki Black", "Nikki Is Obsessed With All Things Celebrity", "Dreams She Is A Long-Lost Kardashian. You'Ll Find Her Binging Netflix'S Latest 'Must-Watch' Show With A Jar Of Nutella Her Side."], "canonical_link": "https://www.newidea.com.au/david-schwimmer-wants-to-win-jennifer-aniston-back", "title": "David Schwimmer to Jennifer Aniston: I want you back!", "meta_data": {"language": "en-us", "description": "After the breakup of his marriage last year, David Schwimmer is ready to find love again. And his choice of would be girlfriend, revealed exclusively to New Idea, is none other than his former co-star and one-time fling, Jennifer Aniston.", "news_keywords": "David Schwimmer wants to win Jennifer Aniston back, David Schwimmer, David Schwimmer news, Jennifer Aniston, Jennifer Aniston news, David and Jen, David and Jen dating, David Schwimmer and Jennifer Aniston, David Schwimmer and Jennifer Aniston dating, Friends, friends cast, friends cast dated, courtney cox, lisa kudrow, matthew perry, Matt LeBlanc, celeb news, celebrity news, celeb goss, celebrity goss, hollywood couples, latest celebrity news, latest celeb news, latest celeb gossip, latest celeb goss, latest celebrity goss, jennifer aniston dating history, david schwimmer jen aniston, celeb weddings, Friends reboot", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/david-schwimmer-wants-to-win-jennifer-aniston-back", "title": "David Schwimmer to Jennifer Aniston: I want you back!", "description": "After the breakup of his marriage last year, David Schwimmer is ready to find love again. And his choice of would be girlfriend, revealed exclusively to New Idea, is none other than his former co-star and one-time fling, Jennifer Aniston.", "image": {"identifier": "http://www.newidea.com.au/media/30406/untitled-design-8.png", "width": 1500, "height": 800}}, "twitter": {"title": "David Schwimmer wants to win Jennifer Aniston back", "description": "After the breakup of his marriage last year, David Schwimmer is ready to find love again. And his choice of would be girlfriend, revealed exclusively to New Idea, is none other than his former co-star and one-time fling, Jennifer Aniston.", "image": "http://www.newidea.com.au/media/30406/untitled-design-8.png", "url": "https://www.newidea.com.au/david-schwimmer-wants-to-win-jennifer-aniston-back"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1532466516.849, "source": "http://www.newidea.com.au", "summary": ""}