{"url": "www.harpersbazaar.com/celebrity/latest/a19596644/who-is-meghan-markle-maid-of-honor/", "text": "Back in 2011, Kate Middleton's sister, Pippa, became the world's most famous maid of honor when she attended to the Duchess of Cambridge during her wedding to Prince William. Although British weddings don't traditionally have maids of honor (instead, there's a \"chief bridesmaid\"), Kate broke custom to have her sibling by her side on her big day.\n\n\n\nSo who will be Meghan Markle's Pippa on May 19? No one, actually.\n\nMarkle will not have a maid of honor at the wedding, since she could not pick one from her close group of friends. (This contradicts reports from January, which said the bride-to-be had already chosen a maid of honor.) This marks a rare The bridesmaids and page boys will all be children (including Prince George and Princess Charlotte), following British royal wedding tradition.\n\nThough they won't be in the bridal party, Meghan's friends have still been supporting her in preparing for the royal wedding on May 19. Below are all the women we thought were in the running for the maid of honor role.\n\nKate Middleton\n\nGetty Images\n\nThe Duchess of Cambridge has been giving Markle helpful advice, on everything from getting adjusted to the royal family to personal style. Despite their budding friendship, it was expected early on that Meghan would choose \"one of her closest friends who has stood by her for many years before meeting Harry,\" as a maid of honor.\n\nMarkle and Middleton only met in January 2017, The Sun reports. And though fans are excited to tout the pair as BFFs, they still have a lot of bonding to go. Royal expert Katie Nicholl told InStyle that Meghan is independent and interested in creating her own friend group in London, but not with any disrespect to Kate at all.\n\nPlus, on a technical level, Kate \"is the future queen consort when William becomes king after his father, and would unlikely be an attending person to another royal bride,\" royal expert Marlene Koenig revealed. Middleton wasn't even a maid of honor at her own sister's wedding, so it's not a surprise she isn't one at Meghan's.\n\nJessica Mulroney\n\nGetty Images\n\nMeghan met her best friend and stylist, Jessica Mulroney, in 2011, around the time Markle moved to Toronto (Mulroney's home base) to film Suits, according to The Sun. Since then they've bonded over yoga sessions and joint vacations.\n\nJessica and her husband, Ben Mulroney (son of former Canadian Prime Minister, Brian Mulroney), helped Meghan and Harry keep undercover after their romance first broke news. She also accompanied Meghan at the Invictus Games closing ceremony, hosted by Prince Harry, which took place in Toronto.\n\nMeghan’s mother, Doria Ragland, Meghan, Jessica, and their friend Markus Anderson at the Invictus Games closing ceremony. Getty Images\n\nNow that the couple is preparing for the wedding, Mulroney continues to offer a hand. She reportedly helped Markle choose her wedding dress designer and is also making a custom piece for the big day.\n\nPriyanka Chopra\n\nThe Quantico actress and the Suits star first met at the ELLE Women in Television dinner in 2016. \"We bonded as actors,\" she told People of their friendship. \"We just became friends, like two girls would.\"\n\nSince Meghan and Harry's relationship went public, Chopra has urged people to consider Markle as more than just the prince's girlfriend. She called Vanity Fair's profile of the actress \"just a little sexist\" because it mainly focused on Markle's relationship with Harry, and she shut down Wendy Williams when she described Markle as \"Prince Harry's girlfriend.\"\n\nWhen Harper's BAZAAR Arabia asked her if she's going to be a bridesmaid at the royal wedding, Chopra teased, \"If you see me there, you’ll know.\"\n\nSerena Williams\n\nGetty Images\n\nThe star athlete first met Markle in 2014, at DIRECTV's Celebrity Beach Bowl, E! News reports. Meghan recalled in her former lifestyle site, The Tig, \"We hit it off immediately, taking pictures, laughing through the flag football game we were both playing in, and chatting not about tennis or acting, but about all the good old fashioned girly stuff. So began our friendship.\"\n\nIn the following years, Markle supported Williams through her matches at competitions like the U.S. Open and Wimbledon (where she actually sat a few rows away from Pippa Middleton). Williams even contributed to a few blog posts to The Tig, according to E!.\n\n\"She quickly became a confidante I would text when I was traveling, the friend I would rally around for her tennis matches, and the down to earth chick I was able to grab lunch with just a couple weeks ago in Toronto,\" E! says Markle wrote on The Tig, describing her friendship with Williams.\n\n\"We are both the same age, have a penchant for hot sauces, and adore fashion, but what connects us more than those things is perhaps our belief in exceeding expectations–our endless ambition,\" she added.\n\nThough Meghan unfortunately wasn't present at Williams' nuptials to Reddit founder Alexis Ohanian in November 2017, there's still a chance the newlywed tennis champ could show up at Windsor Castle for Markle.\n\nSarah Rafferty or Gina Torres\n\nRafferty, Markle, and Torres promoting Suits Season 4 Getty Images\n\nMarkle's fellow Suits actresses may also be helping her ahead of the wedding. In August 2016, the bride-to-be posted an Instagram (which has now been deleted, like the rest of her social media accounts) dedicated to her costars, with the caption: \"Celebrating our friendship of six years and counting. So much deep love for these two women.\" The former actress also nicknamed Rafferty her \"Suits sister wife.\"\n\nAfter Harry and Meghan's relationship was confirmed in November 2016, Rafferty gave a brief response in an interview with the AP. \"I don't comment on my castmates' personal lives, but of course, it's very exciting,\" she said. \"And I'm very happy for her.\"\n\nIn February 2017, tabloid site OK Magazine reported that Torres and her husband Laurence Fishburne (whom she divorced in November) had a double date with Markle and Harry.\n\nWhether or not Rafferty and Torres are in the bridal party, we can probably expect them to be at the ceremony, since the cast of Suits has reportedly nabbed royal wedding invitations. Plus, it would be a sweet reunion for the former costars, since Meghan's final Suits episode officially aired on April 25.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-bridesmaid-embed2-1526731483.jpg?crop=1xw:0.7498814604077761xh;center,top&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/serena-meghan-1511831009.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Erica Gonzales"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a19596644/who-is-meghan-markle-maid-of-honor/", "title": "Who Will Be Meghan Markle's Maid of Honor?", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Who Will Be Meghan Markle's Maid of Honor?", "description": "The answer is not what you expect.", "url": "https://www.harpersbazaar.com/celebrity/latest/a19596644/who-is-meghan-markle-maid-of-honor/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-05-15 06:05:28", "published_time": "2018-05-04 02:24:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Who Is Meghan Markle's Maid of Honor? - Why Kate Middleton Isn't Meghan Markle's Maid of Honor", "description": "The Duchess of Cambridge Kate Middleton is reportedly out of the running to be Meghan Markle's maid of honor. So who will the bride-to-be choose?", "keywords": "kate middleton, kate middleton meghan markle maid of honor, meghan markle, meghan markle bridesmaid, meghan markle maid of honor, meghan markle prince harry wedding, royal wedding, royal maid of honor, kate middleton maid of honor, kate middleton meghan markle", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,kate middleton meghan markle maid of honor,meghan markle bridesmaid,meghan markle maid of honor,meghan markle prince harry wedding,Meghan Markle,kate middleton", "sailthru.date": "2018-05-04T14:24:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-bridesmaids-index-1522338618.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Who Will Be Meghan Markle's Maid of Honor?", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525371840.0, "source": "http://www.harpersbazaar.com", "summary": ""}