{"url": "www.inquisitr.com/4313038/kanye-west-lazy-hires-personal-trainer-but-doesnt-work-out-amid-meltdown-recovery/", "text": "Kanye West goes to the gym as often as he can with his personal trainer, Harley Pasternak, but according to a report, the rapper doesn’t actually work out once he arrives at the gym.\n\nLife & Style (via Gossip Cop) makes the outrageous claim, insisting that once Kanye West and his trainer get to the fitness studio, though the rapper is wearing his workout gear, he instantly loses interest and doesn’t even attempt to do any exercises that are bound to give him the results he’s looking for.\n\nIt’s puzzling for Pasternak because Kanye West is said to be spending a lot of money to be working out with a celebrity personal trainer. However, considering his lack of motivation, as mentioned by the insider, it seems as if Harley is getting paid to do nothing other than watch Kanye stand around and refuse to take part in the exercises.\n\nThe outlet quotes its source as saying that the fitness studio in Woodland Hills has become one of Kanye West’s favorites. And though he has the drive and dedication to get in the best shape possible, upon arriving at the facility, he ends up doing little to nothing, the source alleges.\n\n“Harley shows Kanye how to do a certain exercise on a machine, Kanye nods in agreement and then they walk over to another machine and do the same thing,” the insider explains.\n\nThe source adds that despite all the efforts the trainer makes to push West in the right direction, to get the fit body he wants, the father of three just doesn’t seem to be interested.\n\nOf course, the rumor concerning Kanye West’s laziness at the gym comes just weeks after it was claimed that the aging rapper is still recovering from his infamous meltdown in November.\n\nhttps://www.instagram.com/p/BVFbLklFLTd/?taken-by=kimkardashian&hl=en\n\nIt’s being said that in the hopes of clearing his mind from his negative thoughts, West has been working on recording new music for his forthcoming album, Complex reveals, but there’s no rush, as he’s mainly focused on getting his mind on the right path.\n\nConsidering the supposed fact that Kanye is easily distracted once he gets to the gym, it would seem to fans that the rap icon has a long way to go before he can say he has fully recovered from his mental breakdown, which left him hospitalized for eight days.\n\nHappy Fathers Day! Thank you for being such a good dad to our babies! A post shared by Kim Kardashian West (@kimkardashian) on Jun 18, 2017 at 12:01pm PDT\n\nWould you be surprised by the news that Kanye West is lazy when it comes to hitting the gym? Is his mental breakdown to blame?\n\n[Featured Image by Victor Boyko/Getty Images]", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://secure.gravatar.com/avatar/2146221c3bb32c670d1053a99949feba?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/kanye-west-workout-lazy-gym-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Maurice Cassidy"], "canonical_link": "https://www.inquisitr.com/4313038/kanye-west-lazy-hires-personal-trainer-but-doesnt-work-out-amid-meltdown-recovery/", "title": "Kanye West Reportedly Lazy, Hires Personal Trainer But Doesn’t Work Out Amid Meltdown Recovery", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}