{"url": "https://www.etonline.com/johnny-depp-sued-by-ex-bodyguards-for-unsafe-working-conditions-and-unpaid-wages-101470", "text": "Johnny Depp is facing a new lawsuit filed by two former bodyguards, who are suing the Pirates of the Caribbean star for unpaid wages, wrongful termination and unlawful business practices, among numerous other allegations.\n\nIn documents obtained by ET, private security professionals Eugene Arreola and Miguel Sanchez say the were employees of the private security firm Premiere Group International and claim they were assigned to protect Depp.\n\nWhen the 54-year-old actor faced a \"financial crisis\" in 2016, Depp cut ties with the company, but hired both Arreola and Sanchez individually, according to the lawsuit. They claim that they were \"told they would be classified as \"employees,\" and would receive all the protections and benefits they were entitled to under the law.\"\n\nThe bodyguards -- who claim that they formed close friendships with Depp's family and friends during their years guarding the movie star -- allege that, between 2016 and 2018, \"things began to spiral toward chaos,\" and that they \"found themselves in situations that required more than what a bodyguard would be expected to do.\"\n\nThe lawsuit alleges that the bodyguards were \"asked repeatedly to drive vehicles that contained illegal substances, open containers and minors\" and were \"asked to monitor unstable individuals in [Depp's] life and entourage.\"\n\nThe suit further alleges that Arreola and Sanchez were \"forced to protect [Depp] from himself and his vices while in public, becoming caretakers for him.\"\n\nAdditionally, the bodyguards claim that they were \"exposed to unsafe conditions and situations\" and, as a result, they suffered \"stress-related injuries created by a hostile and unsafe work environment.\"\n\nEXCLUSIVE: Johnny Depp Reveals the Surprising Advice He Would Give His Younger Self This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart EXCLUSIVE: Johnny Depp Reveals the Surprising Advice He Would Give His Younger Self\n\nArreola and Sanchez also claim that, for nearly two years, neither of them were paid overtime wages, despite working 12-hour shifts. They also claim that they were not given their legally mandated meal and rest breaks.\n\nMany of the claims in the suit -- particularly allegations of the \"toxic and dangerous work environment and constant labor code violations\" -- are directed at the head of Depp's private security detail, Leonard Damian, who is claimed in the documents to have been their direct supervisor.\n\nThe documents also detail an incident in which Damian allegedly accidentally shot himself in the leg \"while playing with his weapon in a small control room\" on Depp's property, when Sanchez says he \"had no choice\" but to rush Damian to the hospital.\n\nThe documents allege that \"[Arreola and Sanchez] were forced to leave their jobs despite claiming that they enjoyed many of the people they worked with and had no ill will toward Johnny Depp.\"\n\nThe bodyguards are asking for all wages and penalties due to them, plus interest. Additionally, they are seeking damages for alleged unpaid overtime and meal breaks, as well as payment for their attorney's fees and court costs.\n\nET has reached out to a rep for Depp.\n\nJohnny Depp Allegedly Spent $30,000 a Month on Wine According to New Lawsuit This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nJohnny Depp Dresses Up as Captain Jack Sparrow to Visit Children's Hospital in Canada -- See Pics!\n\nJohnny Depp Says President Donald Trump Needs 'Help,' Later Apologizes for Controversial Assassination Comment\n\nJohnny Depp's Former Managers File Cross-Complaint, Claim Actor Spent $2M a Month to Maintain Lavish Lifestyle\n\nRelated Gallery", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2014-06/set_PiratesoftheCaribbean_WaltDisneyPictures.JPG?itok=g9qS_MV5", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/johnny_depp_gettyimages-869475490_1280.jpg?h=c673cd1c&itok=3vQD5Uze", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-05/johnny_depp_gettyimages-869475490_1280.jpg?h=c673cd1c&itok=aD483YY_", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/johnny_depp_gettyimages-869475490_1280.jpg?h=c673cd1c&itok=3vQD5Uze", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/johnny-depp-sued-by-ex-bodyguards-for-unsafe-working-conditions-and-unpaid-wages-101470", "title": "Johnny Depp Sued by Ex-Bodyguards for Unsafe Working Conditions and Unpaid Wages", "meta_data": {"article": {"opinion": "false"}, "title": "Johnny Depp Sued by Ex-Bodyguards for Unsafe Working Conditions and Unpaid Wages | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/johnny-depp-sued-by-ex-bodyguards-for-unsafe-working-conditions-and-unpaid-wages-101470", "title": "Johnny Depp Sued by Ex-Bodyguards for Unsafe Working Conditions and Unpaid Wages", "description": "Two former private security personnel allege that 'things began to spiral toward chaos' while working for Depp.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/johnny_depp_gettyimages-869475490_1280.jpg?h=c673cd1c&itok=3vQD5Uze", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Two former private security personnel allege that 'things began to spiral toward chaos' while working for Depp.", "title": "Johnny Depp Sued by Ex-Bodyguards for Unsafe Working Conditions and Unpaid Wages", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/johnny-depp-sued-by-ex-bodyguards-for-unsafe-working-conditions-and-unpaid-wages-101470", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/johnny_depp_gettyimages-869475490_1280.jpg?h=c673cd1c&itok=3vQD5Uze"}, "description": "Two former private security personnel allege that 'things began to spiral toward chaos' while working for Depp.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Johnny Depp", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}