{"url": "https://www.tvguide.com/news/unbreakable-kimmy-schmidt-lemonade-parody-titus-mikey/", "text": "[WARNING: The following story contains spoilers about Season 3 of Unbreakable Kimmy Schmidt. Read at your own risk.]\n\n\n\nWhen the first trailer for Unbreakable Kimmy Schmidt Season 3 revealed that Titus (Tituss Burgess) was going to parody Beyonce's Lemonade, I was cautiously excited. Obviously Burgess was going to crush it — and he did — but a Lemonade pastiche seemed too easy, and on the surface too much of a parody, for parody's sake.\n\nI should never have doubted Kimmy Schmidt.\n\n\"Kimmy's Roommate Lemonades!\" is an on-point, hilarious ode that fits perfectly within the context of the series, while underscoring exactly what Kimmy Schmidt excels at: finding poignant beats in the middle of silliness.\n\n\n\nUnbreakable Kimmy Schmidt goes deceptively dark in Season 3\n\nThe engine for the episode is Titus' suspicion that Mikey (Mike Carlsen) is cheating on him while he was away on a cruise — so the only thing to do is Lemonade him. If this were the first season, it would come off more like a stunt; but Titus' reaction feels true to what we know of his over-the-top, melodramatic personality and the musically inclined show itself. It makes complete sense that Titus would be inspired by Queen Bey, especially a year later (lest we forget, he's still collecting Columbia House tapes). And if you've never seen Lemonade and/or aren't in the Beyhive, it still works because of course Titus would totally flip out in musical form. This is the same dude who summarized his and Mikey's honeymoon period with help from the (fake) American Songbook last season.\n\n\n\n\n\nTituss Burgess, Unbreakable Kimmy Schmidt Photo: Eric Liebowitz / Netflix\n\nTitus' fuming versions of \"Hold Up\" and \"Sorry\" are glorious — shout-out to Carol Kane and her sick moves in the latter music video — but the episode hits new heights after the reveal that Mikey is not cheating on Titus with \"Bucky with the good hair,\" Jorpf Jeff (Titus' inability to say \"Jeff\" properly is a great running gag — \"Ashes to ashes. Dust to Jerfffs\").\n\nMikey and Jeff are just friends, but to Mikey's horror, he realizes Jeff is into him. And worse, he actually never told Jeff that he was dating Titus. This is where other shows might have had Titus forgive Mikey, after he pledges his undying devotion to him. Instead, Titus takes Mikey to meet Roger, his first boyfriend, who did for Titus what Titus must now do for his freshly out beau: set him free so he can explore the big gay world.\n\n\"It's too much pressure being your first and your only,\" Titus says. \"And if we're meant to be together, then blah, blah, blah.\"\n\nIt's an unexpectedly bittersweet, lump-in-your-throat moment that only gets more tear-inducing with Titus' somber, hysterical closing ballad about the breakup (\"Broke my wings so you could fly / Baby gaybird, I said goodbye\") — a take on Bey's \"All Night.\" That a series adept at seamlessly melding cheerfulness and darkness mastered this pivot isn't shocking, but it's remarkable nonetheless.\n\nAdd new fall shows to your Watchlist now!\n\nToo often in fictional breakups, especially in comedies, the splits feel slapdash, irrational or gimmicky — a roadblock to prolong the \"Will they? Won't they?\" of it all. And while Tikey's breakup was probably born out of that same desire — Titus and Mikey moving in together would also get in the way of Titus and Kimmy's (Ellie Kemper) roommate shenanigans — the whole thing not only feels earned, but realistic and emotionally truthful. They are each in different places in their lives and life experiences, and neither of them was the \"bad guy\" in the situation.\n\n\n\nIt's also a strikingly mature decision from Titus to put someone else's needs before his own. And isn't that what true love is? If you've seen the full season, you know Titus still has bouts of full-blown narcissism, but this kind of selflessness constitutes major growth for the character. Burgess really sells Titus' moment of heartbreaking clarity, while Carlsen's charming innocence and confusion is heartbreaking in its own right.\n\n\n\nIt's rare for tributes like these to have this kind of resonance. The simplest route would have been to make this a pure homage, piggybacking off of a huge pop culture phenomenon. Most parodies, even the best ones, do. For example, The Goldbergs does annual '80s movie tribute episodes, and while they've all been fun and nostalgic, it sometimes feels like they're making their story fit into what they're spoofing rather than the other way around. That might be a symptom of having to choose a film every year to pay homage to, but Kimmy Schmidt does the opposite. Not only was this grounded in the story, it drove the story forward organically and added depth to its characters. Plus, it wisely didn't inflict such an overdone plot point like cheating onto its cutest couple.\n\nBy the finale, Titus wants to woo back Mikey, performing his surprise hit \"Boobs in California\" on a Mets cruise. In another instance of Kimmy Schmidt subverting expectations, Mikey doesn't immediately dump his new boyfriend Andrew and go back to Titus after his grand gesture. He doesn't know what to say, but that's OK because he shouldn't. He's still a \"baby gaybird\" expanding his horizons. And in another mature decision, Titus isn't going to push it. He's made his feelings known, and he wholeheartedly believes what he crooned earlier is true:\n\nSo let this painful year go by\n\nAnd if your love for me doesn't die\n\nI'll find you in the night like a firefly\n\nUnbreakable Kimmy Schmidt is streaming on Netflix.", "images": ["https://tvguide1.cbsistatic.com/i/r/2017/05/22/f4d84218-0d71-4347-b6b8-c806f9548c74/thumbnail/1300x867/fe64183327b182e9c369019739dc35a8/170522-news-kimmy-schmidt.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/16/565eda06-3941-42fa-b7fc-d930aee08f41/crop/1380x1380+345+0/thumbnail/70x70/4b41f885e39268c832df50f93dcc84c5/pdcoa-1-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/06/27/3fad4b53-a36e-4293-b6ce-ccefad29ffcd/crop/810x449+0+0/thumbnail/240x133/cad5df011ab1dd8b351cd24feada7c86/190627-one-day-at-a-time-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/07/05/bc91406b-3a01-4435-aee9-43c1dbd39980/crop/1380x1380+345+0/thumbnail/70x70/c42dde18b65265a935b0ebab8df274fb/170705-news-broadchurch.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/02/12/d50dc4eb-048c-46a7-a10b-6612702aa280/crop/1380x1380+345+0/thumbnail/70x70/b946d714a340f58fc03a96538dca2b5b/200213-prodigal-son-superlatives.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/s-u/thumbs/titus-burgess_658670_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2020/04/05/e7406a34-3c0a-4bc9-a6c5-c78b9fc15206/crop/2070x1147+0+0/thumbnail/240x133/33366fa0427b5fbcd05d82d4d88bb082/stranger-things-reg.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/m-o/thumbs/mike-carlsen-926146_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2020/03/30/af5b983a-0607-4360-b289-d0abd98d9bd6/crop/450x450+180+0/thumbnail/70x70/7c04a71635e3f0d825c961f272e7572e/200330-tiger-king-hp.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://tvguide1.cbsistatic.com/i/r/2019/12/01/96c48961-ca4f-4b28-b527-8671dead3c25/crop/450x450+180+0/thumbnail/70x70/845f18917d00275750e9fdf4fa575dea/yoda-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/1ced518e-b4cf-4436-b8dc-4ba119b7d796/crop/1380x1380+345+0/thumbnail/70x70/b4262d63c01e8fee3fb0cb11249be109/200415-wwdits.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/82faad20-77d8-4a9e-822a-45cfbbd511a1/crop/2070x1147+0+0/thumbnail/240x133/824ebe929b742c271435470c8ce0eec8/200415-blackaf.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/01/26/655ca22a-13c4-4792-9064-69485e432cb7/crop/450x450+180+0/thumbnail/70x70/7342b085915e1f180f5a9f27a6772d79/180125-schitts-creek-annie-murphy-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/04/13/345ae1e9-49f3-466b-b122-f444fa426c1c/crop/810x449+0+0/thumbnail/240x133/8f715235a1eb3c4f097109f6ce3d6a39/180413-kylechandlerfridaynightlights-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/08/d0d677a3-6ae0-42a7-a3e0-97afef3f110e/crop/450x450+180+0/thumbnail/70x70/6ea81c93896c18de5e6a87a77328475b/snl-hpsm.jpg", "https://tvguide1.cbsistatic.com/www/img/static/discovery/WTN-logo.png", "https://tvguide1.cbsistatic.com/i/r/2020/01/12/ceb0da6a-93ad-49f7-938a-28d551bde55d/crop/450x450+180+0/thumbnail/70x70/0de32324bb3e93d698553f52955d65b3/sbtb-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/20/34eef86e-4f48-4135-8b87-1958ef4a7d87/crop/450x450+180+0/thumbnail/70x70/6225df71d218139e69d9100bb5108d9a/onward-hpsm.jpg", "https://tvguide1.cbsistatic.com/feed/1/519/thumbs/118839519_100x133.jpg"], "top_img": "https://tvguide1.cbsistatic.com/i/r/2017/05/22/f4d84218-0d71-4347-b6b8-c806f9548c74/thumbnail/1300x867/fe64183327b182e9c369019739dc35a8/170522-news-kimmy-schmidt.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.tvguide.com/news/unbreakable-kimmy-schmidt-lemonade-parody-titus-mikey/", "title": "Unbreakable Kimmy Schmidt's Lemonade Parody Was Sadder – and Better – Than Expected", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-itunes-app": "app-id=333647776, affiliate-data=at=11l9QE, app-argument=https://www.tvguide.com/news/unbreakable-kimmy-schmidt-lemonade-parody-titus-mikey/", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "description": "Unbreakable Kimmy Schmidt's Lemonade homage epitomizes the emotional pivots the show does so well", "og": {"title": "Unbreakable Kimmy Schmidt's Lemonade Homage Is Even Sadder That You Thought | TV Guide", "type": "article", "url": "https://www.tvguide.com/news/unbreakable-kimmy-schmidt-lemonade-parody-titus-mikey/", "image": "https://tvguide1.cbsistatic.com/i/r/2017/05/22/f4d84218-0d71-4347-b6b8-c806f9548c74/thumbnail/1300x867/fe64183327b182e9c369019739dc35a8/170522-news-kimmy-schmidt.jpg", "description": "We're not crying, you are", "site_name": "TVGuide.com"}, "article": {"published_time": "2017-05-22T17:44:14-04:00", "tag": "Netflix"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "title": ".@TitussBurgess' #Lemonade homage in #KimmySchmidt went deeper than your average parody | TV Guide", "description": "[WARNING: The following story contains spoilers about Season 3 of Unbreakable Kimmy Schmidt. Read at your own risk.]When the first trailer for Unbreakable...", "creator": "@joyceeng61", "image": {"src": "https://tvguide1.cbsistatic.com/i/r/2017/05/22/f4d84218-0d71-4347-b6b8-c806f9548c74/thumbnail/1300x867/fe64183327b182e9c369019739dc35a8/170522-news-kimmy-schmidt.jpg"}}}, "movies": [], "publish_date": 1495489454.0, "source": "https://www.tvguide.com", "summary": ""}