{"url": "www.thehollywoodgossip.com/2018/01/jennifer-aniston-and-justin-theroux-headed-for-divorce-because-o/", "text": "As you've no doubt heard by now, Brad Pitt is a single man, having separated from Angelina Jolie back in September of 2016.\n\nHis first wife, Jennifer Aniston, is very much not single, having married Justin Theroux in 2015.\n\nBut that hasn't stopped the tabloid press from reporting that the old flames are eager to rekindle their romance.\n\nOf course, for these two A-listers to get back together, that means the pesky C-lister getting in their way will need to be disposed of.\n\nThus, gossip columnists the world over are employing the trick most often used by screenwriters of romantic comedies in which one half of the meet-cute pair is already taken.\n\nYes, they're leaning hard on the \"Uh, her husband is a douche and they were already having problems before the hero entered the picture\" narrative.\n\nAccording to Life & Style, Jen and Justin have spent most of the past year apart.\n\nThe magazine claims they only recently reunited for a New Year's Eve trip to Mexico ... and they brought a huge group of friends along to make the situation less awkward.\n\n“They chose to go with friends during this particularly difficult time during their marriage. A week alone would’ve been too strained,” one insider says.\n\n\"Had they been alone, the insider suspects, they would’ve been dealing with some uncomfortable conversations. They felt it would be easier and more relaxed to have some friends come along.”\n\nThe source adds that Aniston and Theroux have basically come to terms with the fact that their marriage is coming to an end, but they're still trying to hide the truth from members of their inner circle.\n\n“The truth is that the marriage has been crumbling,” the insider adds.\n\n“It’s not make-or-break time for them and their marriage.”\n\nOf course, all of this couldn't come at a worse time, as Aniston has reportedly fallen back under Pitt's spell in recent months.\n\n“Brad and Jen have bonded like never before over the past year,” a friend of theirs tells In Touch.\n\n“And they’ve been helping each other through their respective troubles.”\n\nLook, we suppose there's a possibility this is really happening, but it all sounds a little too close to what magazines like In Touch and Life & Style would want to happen for it to be entirely believable.\n\nThe only thing this story is missing is Brad Ross-ing out on Jen and justifying banging Jolie with \"We were on a break!\"", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--Vu_LF2UU--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1374783633/justin-and-jen.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--Vu_LF2UU--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1374783633/justin-and-jen.png", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2018/01/jennifer-aniston-and-justin-theroux-headed-for-divorce-because-o/", "title": "Jennifer Aniston & Justin Theroux: Headed For Divorce Because of Brad Pitt?!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/01/jennifer-aniston-and-justin-theroux-headed-for-divorce-because-o/", "title": "Jennifer Aniston & Justin Theroux: Headed For Divorce Because of Brad Pitt?!", "description": "Sources say Jennifer Aniston and Justin Theroux are ready to call things off. Not surprisingly, those same sources say Brad Pitt is to blame.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--409x6xBR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1474625377/brad-pitt-wearing-glasses-and-smiling.jpg", "type": "image/jpeg", "width": 630, "height": 805}}, "article": {"published_time": "2018-01-12T11:19:11-05:00", "modified_time": "2018-01-12T11:22:34-05:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Jennifer Aniston & Justin Theroux: Headed For Divorce Because of Brad Pitt?!", "description": "Sources say Jennifer Aniston and Justin Theroux are ready to call things off. Not surprisingly, those same sources say Brad Pitt is to blame.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--Vu_LF2UU--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1374783633/justin-and-jen.png"}}, "description": "Sources say Jennifer Aniston and Justin Theroux are ready to call things off. Not surprisingly, those same sources say Brad Pitt is to..."}, "movies": [], "publish_date": 1515773951.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}