{"url": "www.chatelaine.com/living/entertainment/meghan-markle-secret-first-husband/", "text": "The rumour: Meghan Markle had a secret first husband\n\nWhere you heard it: The National Enquirer\n\nThe report: Markle’s status as divorcée has never been in dispute, but according to a new “bombshell” Enquirer cover story (is there any other kind?), Prince Harry will be the ex-actress’s third kick at the matrimonial can. “How she HID PAST from Husband No. 2!” claims one scandalous cover line, referring to “Man-eater Meghan’s” ex Trevor Engelson. Inside, an unnamed source explains how Harry was “blindsided” by the news, which has been kept secret until now (per the NE), thanks to a “hush-hush annulment.”\n\nSubscribe To Our Newsletters — And Get All Our Royal Coverage Straight To Your Inbox\n\nThe smell test: For the love of Liverpool — this stinks worse than the royal stables after derby day! Just for starters, if Meghan had been married before she married Trevor Engelson in 2011, why would she have felt the need to hide it? Back then she was a Hollywood actress, existing in a world where divorce is no biggie. It’s not like she could have been planning for her royal future (yes, MM may be calculated, but she’s not clairvoyant). And even if we run with this idea of a secret ex-hubby (whom The Enquirer never names, btw), wouldn’t we already know about him? For his recent book Meghan Markle: A Hollywood Princess, royal biographer Andrew Morton spoke to dozens of people who knew Markle long before she was one half of a commemorative plate design. So we’re supposed to believe that not one of them would have mentioned old what’s-his-name? Never mind the fact that even “hush-hush annulments” are a matter of public record. The Enquirer’s insider speculates that MI-5 (a.k.a. her Majesty’s Secret Service) probably “scrubbed the records” to conceal Markle’s past, which is totally something that MI-5 would try to do. Except that unless they have a time machine, this is a story with way too many loose ends. In summation: Either Meghan Markle does not have a secret first husband (smart money), or she does, and anyone who knows about it better sleep with one eye open.\n\nThe rumour: The Palace is freaking out about the steamy love scenes in the upcoming Meghan and Harry Lifetime movie\n\nWhere you heard it: Vanity Fair\n\nThe report: In case you are not already counting down the days, Harry & Meghan: A Royal Romance is the upcoming Lifetime movie that depicts the couple’s courtship, including (per this preview), some between-the-sheets time, and one scene-stealing giraffe. It’s that first part that purportedly has the palace press office in a tizzy. “What I’ve heard is that they’re seriously worried about the sex scene,” the movie’s director, Menhaj Huda, told VF last week, adding that his info is on good authority, as his “wife’s best friend has been dating the palace press secretary.”\n\nThe smell test: What really reeks here is Huda’s indiscretion. Whatever insider info he did or did not receive via his wife’s connection, you can be sure he won’t be hearing anything else in the future. (Jeez, dude — it’s called protecting your source.) Is the palace “seriously worried” about this movie? It’s easy to see why Huda would want us to think that, since scandal sells. In truth, it’s probably a matter of relativity. Because sure, they’d probably prefer that a factually based account of Harry and Meghan’s premarital sex-fest wasn’t coming soon to a TV near you, but it’s not like it’s a documentary. On the scale of royal scandal — a 1 being Kate Middleton’s cork wedges and a 10 being Prince Charles’s tampon ambitions — this is a 2.\n\nThe rumour: Meghan’s mom Doria will tell all in an interview with Oprah\n\nWhere you heard it: The Mirror\n\nThe report: Last week, The Daily Mail reported that Markle’s mom visited Winfrey’s Santa Barbara Estate, where she stayed for six hours, and exited with gifts (presumably a bunch of the Big O’s favourite things). At the time, the reason for the visit was unknown, but now The Mirror is quoting an unnamed “US TV source,” who claims that the pair were brainstorming ideas for a TV appearance (well, duh). Apparently both women are keen to discuss the reaction to Meghan and Harry through the lens of racism: “It’s an issue close to both Oprah and Doria,” quoth The Mirror’s source, adding that the only thing needed now is a green light from Buckingham Palace.\n\nRumour Has It That Meghan Markle And Kate Middleton ‘Hate Each Other’s Guts.’ Is That Really The Case?\n\nThe smell test: Not to nitpick here, but can an interview really be a “tell-all” if the palace has to approve it? Historically, the royal family has espoused more of a “tell-none” approach to the media. Oprah (who has interviewed pretty much everyone on the planet) never sat down with Diana or Charles or Queen Lizzie herself. That said, Markle is at the forefront of a whole new era, particularly when it comes to royals and the public. Both Harry and Wills have done interviews recently, discussing personal details about their own mental health, and clearly the Queen approved those. Given that Doria has thus far kept her mouth shut (unlike many members of the Markle clan who have made a full-time job of trashing their world-famous relation in the press), it’s possible a (highly scripted) sit-down with Winfrey will be her well-earned reward.\n\nThe rumour: Prince Harry will wear a wedding ring\n\nWhere you heard it: E! News\n\nThe report: This will-he-or-won’t-he drama has been ongoing since the engagement announcement, but now a source is telling E! that the Royal Ginger Snap “does want to wear a wedding band.” Improbably, this is one matter that is not covered in the royal etiquette handbook, and is instead a matter of personal preference: The Queen’s husband Prince Philip does not wear a ring (no big surprise there), and neither does William, while is father, Prince Charles, does.\n\nThe smell test: The idea that there is no existing protocol on the subject of male finger bling is hard to fathom, but if that’s the case, this all smells pretty sound. E! has proven to have some pretty well-placed royal sources. Meghan’s feminism could mean that she believes rings are for both genders. And Harry is definitely more a jewellery guy than super-traditional Wills. If royal memory serves, he and Meghan wore matching bracelets even before they went public as a couple.", "images": ["https://www.chatelaine.com/wp-content/themes/chatelaine.com/assets/images/logo.png", "https://www.chatelaine.com/wp-content/uploads/2018/04/meghan-markle-kate-middleton-feud.jpeg", "https://www.chatelaine.com/wp-content/uploads/2017/11/meghan-markle-prince-harry-relationship-timeline-2.jpg", "https://www.chatelaine.com/wp-content/plugins/rdm-daac-notice/public/images/close.png", "https://www.chatelaine.com/wp-content/plugins/rdm-daac-notice/public/images/info.png", "https://www.chatelaine.com/wp-content/uploads/2018/05/Meghan-Markle-secret-first-husband.jpg"], "top_img": "https://www.chatelaine.com/wp-content/uploads/2018/05/Meghan-Markle-secret-first-husband.jpg", "keywords": [], "authors": ["Courtney Shea"], "canonical_link": "https://www.chatelaine.com/living/entertainment/meghan-markle-secret-first-husband/", "title": "Did Meghan Markle Have A Secret First Husband?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "contextly-page": "{\"title\":\"Did Meghan Markle Have A Secret First Husband?\",\"url\":\"https:\\/\\/www.chatelaine.com\\/living\\/entertainment\\/meghan-markle-secret-first-husband\\/\",\"pub_date\":\"2018-05-09 16:41:13\",\"mod_date\":\"2018-05-15 09:48:58\",\"type\":\"post\",\"post_id\":\"508988\",\"author_id\":\"1\",\"author_name\":\"Chatelaine Staff\",\"author_display_name\":\"Chatelaine\",\"tags\":[\"Editor&#039;s Picks\",\"Royals\"],\"categories\":[\"Entertainment\",\"Facebook Instant Articles\"],\"image\":\"https:\\/\\/www.chatelaine.com\\/wp-content\\/uploads\\/2018\\/05\\/Meghan-Markle-secret-first-husband.jpg\",\"image_alt\":\"Did Meghan Markle have a secret first husband?\"}", "description": "Is there any truth in the latest batch of royal wedding rumours? Each week, we apply our smell test to tell you what’s true and what stinks worse than rotten kippers.", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "Did Meghan Markle Have A Secret First Husband?", "description": "Is there any truth in the latest batch of royal wedding rumours? Each week, we apply our smell test to tell you what’s true and what stinks worse than rotten kippers.", "url": "https://www.chatelaine.com/living/entertainment/meghan-markle-secret-first-husband/", "site_name": "Chatelaine", "updated_time": "2018-05-15T09:48:58-04:00", "image": {"identifier": "https://www.chatelaine.com/wp-content/uploads/2018/05/Meghan-Markle-secret-first-husband.jpg", "width": 1280, "height": 960}}, "article": {"tag": "Royals", "section": "Entertainment", "published_time": "2018-05-09T16:41:13-04:00", "modified_time": "2018-05-15T09:48:58-04:00"}, "twitter": {"card": "summary_large_image", "description": "Is there any truth in the latest batch of royal wedding rumours? Each week, we apply our smell test to tell you what’s true and what stinks worse than rotten kippers.", "title": "Did Meghan Markle Have A Secret First Husband?", "site": "@chatelaine", "image": "https://www.chatelaine.com/wp-content/uploads/2018/05/Meghan-Markle-secret-first-husband.jpg", "creator": "@chatelaine"}, "generator": "WordPress 4.9.13"}, "movies": [], "publish_date": 1525898473.0, "source": "http://www.chatelaine.com", "summary": ""}