{"url": "https://www.sheknows.com/entertainment/articles/1136840/greys-anatomy-300th-episode/", "text": "Leave it to Grey’s Anatomy to bring every fair-goer’s worst fear to life — according to ABC, the show’s landmark 300th episode involves a derailed roller coaster (yikes!). In happier news, though, fans will apparently be treated to appearances by a few ghosts of Grey’s past.\n\nMore: ABC Just Gave Grey’s Anatomy Fans an Early Christmas Present (or 2)\n\nThe episode, titled “Who Lives, Who Dies, Who Tells Your Story?” is set to air on Thursday, Nov. 9 at 8/7c on ABC. The hour will be especially suspenseful judging by the official description, which reads, “A roller coaster car falls off the track at the county fair, and the doctors at Grey Sloan tend to patients who spark memories about ghosts from their past.”\n\nIn a recent interview with TVLine, executive producer/co-showrunner Krista Vernoff alluded to these ghosts, saying, “So I have found a way to pay some small tribute to everyone who has been here before.” She calls it “a love letter to the fans who have been watching all 14 years.”\n\nNaturally, we’re all dying (see what I did there?) to know who these ghosts are. Since the description of the episode states that the patients in the roller coaster accident spark memories of ghosts from the past, there’s no real way of knowing — because we don’t know who the patients are yet, obviously.\n\nHowever, there are plenty of ghosts in Grey Sloan Memorial Hospital’s past that have the potential for an appearance.\n\nWe’ll start with the most recent and most imperative: Derek. McDreamy was a total adrenaline junkie who had a need for speed, so perhaps the roller coaster will remind Meredith of that. Or perhaps we’ll see a clip of Derek and Meredith taking Zola to a fair when she was younger. There are plenty of ways to go with this, and we want need to see MerDer together again.\n\nAnother ghost we’d love to see? Lexie! Maybe one of the people injured in the roller coaster accident is super-brainy and starts spouting off random knowledge about, well, everything… just like Lexipedia would have. That could spur a Lexie flashback, right?\n\nMore: Bethany Joy Lenz Just Signed On for a Grey’s Anatomy Guest Arc\n\nA third ghost we could totally see making a cameo is good ol’ George. T.R. Knight, the actor who played George, returned to Shondaland earlier this year in the now-canceled series The Catch. That could easily segue into him showing up on Grey’s (albeit as a ghost).\n\nNow, here’s the thing — maybe the cameos won’t be by literal ghosts. Perhaps they will be people from the past who simply left or shifted out of the characters’ lives at some point. In this scenario, there are three big contenders.\n\nSince fans were none too happy when Callie was written off the show to go explore life with Penny, it would be nice to see her make an appearance in some sort of flashback. Since there have been some changing dynamics as of late regarding her custody arrangement with Arizona, it could make sense.\n\nAnother possibility, although admittedly slim, is a flashback involving Izzie. Since Alex has recently gotten back together with Jo and things seem to be moving along nicely, it wouldn’t be far-fetched for him to think of Izzie as he moves toward marriage with another woman.\n\nEven though there was reportedly some bad blood between Katherine Heigl and showrunner Shonda Rhimes, plenty of time has passed. Maybe the two have patched things up. If an Izzie flashback did occur and somehow translate into Heigl having an arc on Season 14, that would create some very intriguing drama for Alex.\n\nMore: ABC Reveals Whether Sandra Oh Is Returning for Grey’s Anatomy‘s 300th Episode\n\nAnd finally, there is the ghost of seasons past we’re all still hoping and praying will make a cameo on the 300th episode — even though the notion has basically already been shot down. Yes, we’re talking about Cristina Yang.\n\nAt some point, the show will have to cave into fans’ ardent wishes to see Cristina and Meredith united again. So why not now? It’s time, Rhimes… it’s time.", "images": ["https://www.sheknows.com/wp-content/uploads/2018/08/ruzyzj4hl0dzwbher77g.jpeg?w=150&h=150&crop=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/alia-shawkat-leaves-brad-pitts-house-backgrid-ftr.jpg?quality=98&w=330", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?quality=98&w=330#038;ssl=1", "https://www.sheknows.com/wp-content/uploads/2020/04/Kenneth-Armando.jpg?w=445&h=250&crop=1", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?quality=98&w=330", "https://www.sheknows.com/wp-content/uploads/2018/12/l8mh4mupcwcqcw0jkne7.jpeg?w=695&h=391&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/Kobe-Gianna-Bryant.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/Reese-Witherspoon-2013-arrest.jpg?w=445&h=250&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.sheknows.com&path=%2Fentertainment%2Farticles%2F1136840%2Fgreys-anatomy-300th-episode%2F&ct=article&lob=&loc=us&env=desktop&post_id=1136840", "https://pmcspy.files.wordpress.com/2020/04/best-hangboards.jpg?quality=98&w=330", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.sheknows.com/wp-content/uploads/2020/04/vanessa-kobe-bryant-anniversary-1.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/vanessa-kobe-bryant-1.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/melissa-mccarthy-mark-wahlber-1.jpg?w=445&h=250&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.sheknows.com/wp-content/uploads/2018/12/l8mh4mupcwcqcw0jkne7.jpeg"], "top_img": "https://www.sheknows.com/wp-content/uploads/2018/12/l8mh4mupcwcqcw0jkne7.jpeg", "keywords": [], "authors": ["Julie Sprankles"], "canonical_link": "https://www.sheknows.com/entertainment/articles/1136840/greys-anatomy-300th-episode/", "title": "Grey’s Anatomy’s 300th Episode Will Be Full of ‘Ghosts’ From the Past – SheKnows", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "The 300th episode of 'Grey's Anatomy' will feature blasts from the past.", "generator": "WordPress 5.4", "author": "Julie Sprankles", "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Does this mean we get to see McDreamy again soon?", "url": "https://www.sheknows.com/entertainment/articles/1136840/greys-anatomy-300th-episode/", "description": "The 300th episode of 'Grey's Anatomy' will feature blasts from the past.", "site_name": "SheKnows", "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/12/l8mh4mupcwcqcw0jkne7.jpeg", "width": 1024, "height": 578}, "locale": "en_US"}, "article": {"published_time": "2017-11-01T01:39:00+00:00", "modified_time": "2018-07-10T00:23:26+00:00"}, "twitter": {"text": {"title": "Does this mean we get to see McDreamy again soon?"}, "image": "https://www.sheknows.com/wp-content/uploads/2018/12/l8mh4mupcwcqcw0jkne7.jpeg?w=1024", "card": "summary_large_image", "site": "@SheKnows", "creator": "@https://twitter.com/JulieLMS", "title": "Does this mean we get to see McDreamy again soon?", "description": "The 300th episode of 'Grey's Anatomy' will feature blasts from the past."}, "msapplication-TileImage": "https://www.sheknows.com/wp-content/uploads/2018/11/cropped-sk-favicon.png?w=270"}, "movies": [], "publish_date": 1509500340.0, "source": "https://www.sheknows.com", "summary": ""}