{"url": "https://www.womenshealthmag.com/health/a19995561/butt-implants/", "text": "If you've spent hours in the gym hoping to squat your way to a Kardashian-esque butt, you've probably wondered if there's a quicker and easier way.\n\nTurns out butt augmentation is one of the fastest growing cosmetic surgical procedures performed in the country, according to the American Society of Plastic Surgeons. Derrière implants increased by 18 percent between 2015 and 2016, while fat grafting procedures (where they literally inject more fat into your keister) jumped 26 percent during the same period.\n\nIn total, 20,673 butt augmentation procedures were performed in the U.S. in 2017, per soon-to-be-published data from the American Society for Aesthetic Plastic Surgery. Beverly Hills plastic surgeon Andrew Ordon, M.D., a co-host on The Doctors, even declared 2017 \"the year of the rear.\"\n\nYet Ordon admits not all his patients are happy after having these procedures—and a few have even come back requesting reversals. So is butt augmentation really worth it?\n\nThere are a few things you should know before springing for this pricey procedure:\n\nFat Grafting Is The Most Popular (And Best!) Method\n\nGetty Images\n\nFat grafting is the most popular method of butt augmentation. With fat grafting, also called the Brazilian butt lift, the doctor starts by performing liposuction—removing fat from an area where it’s not wanted, like the stomach, thighs, or upper back, and injects it into the buttocks. Results are immediately visible, but you won’t see the final product until a year after surgery; it takes time for the body to form new blood vessels and truly incorporate the grafted fat.\n\nThere are risks like blood clots, sensation changes, and fat embolism (when fat is released into the blood stream), but most experts advocate fat grafting as the number-one option for butt augmentation. It has a low risk of infection and, if you do gain weight down the line, it will grow with you, says Alexes Hazen, M.D., a plastic surgeon at NYU Langone Health. The average cost of fat grafting is $4,356, per the ASPS; most health insurance companies won't cover it.\n\nYou Can Also Opt For Silicone Implants\n\nGetty Images\n\nVery thin patients who don’t have enough fat for liposuction might not be eligible for fat grafting, and these are the women who make good candidates for implants, says Mark Mofid, M.D., a plastic surgeon in La Jolla, California, and an ASAPS member.\n\nButt implants require a multi-hour outpatient surgery in which a surgeon inserts silicone implants into your tuchus. On butt-implant delivery day, your surgeon will make an incision within the vertical butt crease and then slide silicone implants either into or above the gluteal muscle on each side. Placement technique varies among doctors, but intramuscular implants are ideal, says Mofid.\n\n“Most of the patients who have had implants and are unhappy with them have on-top-of-the-muscle implants,” Mofid says. “That’s just not a great place for an implant to be. Those implants sag over time and kind of look like gumdrops on the buttocks, as opposed to a much more natural look.”\n\nSurgeons typically use the approach they’re most comfortable with, so if you’re considering the procedure, ask your doctor what type of placement he or she uses, he recommends. And, FYI, butt implants cost around $4,860, according to 2016 statistics from ASPS; most health insurance doesn’t cover cosmetic surgery or resulting complications.\n\nThe Bigger The Implant, The Bigger The Risk\n\nGetty Images\n\nMost women go into the initial consultation with an idea of what kind of butt they’re trying to achieve, but Mofid cautions against going too large. He says he won’t do implants bigger than 350 cubic centimeters, which equals roughly one and a half cups of fluid—even when patients beg, as they sometimes do—because it’s too “fraught with risks.”\n\nLarge implants have higher rates of incisions that split open post-surgery and implants that shift around under the skin. (But more on that next.)\n\nIn 2013, Mofid co-authored a study published in Plastic and Reconstructive Surgery that analyzed the experience of 2,226 people who received butt implants. Among all patients, 848—or 38 percent—reported complications.\n\nThe most common side effect reported in the PRS study was incisional separation (7.9 percent of patients)—“people bend and stoop and the incision can separate,” Mofid says. About 5 percent of patients needed an implant revision, and 4.2 percent experienced pain that lasted more than 12 weeks. Nearly 4 percent developed seromas, which means fluid builds up under the skin, and 3.6 percent had minor infection that didn’t require the implants to be removed. Implant removal was necessary in 3.8 percent of patients for reasons like major infection, chronic pain, and chronic seromas, according to the study findings.\n\nHazen says that plastic surgeons have mixed feelings about butt augmentation, but she’s not a fan. “Just anatomically where they go—you’re sitting on it all the time,” Hazen says. “It’s hard to imagine that it would be comfortable.”\n\nSwitch up your squat with these 20 variations that will help you tone your butt:\n\n​\n\nRecovery is rough—No matter the method\n\nGetty Images\n\nWhether you opt for fat grafting or implants, you can't sit or lie on your back for three weeks post butt-augmentation, says Mofid, which generally rules out things like work and school (and maybe comfortable sleeping). “Normal life is put on hold,” he says. “You’ve got to be committed to this operation. It’s not for the faint of heart.”\n\nIf you’re determined to go through with the procedure, vet your surgeon and facility carefully. Check prospective doctors’ websites to see before and after photos of their patients, and talk to other women who’ve gotten implants, Hazen suggests. Always opt for a board-certified plastic surgeon who has ample experience, and be sure to ask questions like how your butt will look over time, whether you’re a good candidate for the surgery and what the options are if you’re dissatisfied with the outcome.\n\nAnd don’t be lured by unscrupulous doctors or facilities in foreign countries hawking cheaper procedures. “Don’t cheap out and go someplace because it’s inexpensive,” Hazen says. “This is your body, this is forever, it’s important, so go to somebody good. You want an accredited facility, not just the back of some guy’s office.”\n\nWhatever you do, don't get silicone injections\n\nGetty Images\n\nIn 2017, the U.S. Food and Drug Administration issued a warning against using silicone injections for purposes like body contouring. The warning was issued in response to an increase in cases of patients receiving illegal silicone injections from unlicensed medical professionals in private homes or hotels. Often called \"pumping parties,\" these services are marketed as a cheaper alternative to plastic surgery.\n\nThe risks of illegal silicone injections are even worse than you'd think: Loose silicone—as opposed to silicone used as enclosed implants—can be dangerous and even fatal; injections can cause disfigurement or significant scarring. “It should be uniformly condemned,” Mofid says. “There’s no place for it in medicine—virtually 100 percent of patients over their lifetime will develop problems.”\n\nSquats might actually be your best option\n\nGetty Images\n\nSurgery offers the lure of a quick fix, but it’s risky, expensive, and, well, extreme. Ordon reminds those who crave a larger posterior that they can get one naturally. He recommends performing exercises that target the glutes, such as squats and leg raises. In short, augmentation might seem like a quick fix—but a butt workout is probably still the best way.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=1xw:0.786xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=1xw:0.786xh;center,top&resize=1200:*", "keywords": [], "authors": ["Angela Haupt"], "canonical_link": "https://www.womenshealthmag.com/health/a19995561/butt-implants/", "title": "Will Butt Implants Really Give You The Bigger Booty Of Your Dreams?", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Women's Health", "title": "Will Butt Implants Really Give You The Bigger Booty Of Your Dreams?", "description": "Butt augmentation procedures are on the rise—but are they totally overrated?", "url": "https://www.womenshealthmag.com/health/a19995561/butt-implants/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=1xw:0.786xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 223993857646230}, "article": {"publisher": "https://www.facebook.com/womenshealthmagazine/", "modified_time": "2019-06-18 03:17:55", "published_time": "2018-01-30 09:55:38", "section": "Health", "opinion": "false"}, "twitter": {"site": "@WomensHealthMag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=1xw:0.786xh;center,top&resize=640:*"}, "google-site-verification": "mJMUXwyIdtxgKFgxuJIMK0pLRtYTrhduC6K_LFpAP8Y", "title": "Butt Implants And Butt Augmentation: Here's What You Need To Know​ | Women's Health", "description": "​Learn how butt implants and fat-grafting are performed, the costs of buttock augmentation, and potential complications of cosmetic surgery.", "keywords": "butt implants, butt augmentation, butt injections", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=0.636xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Health,health", "sailthru.date": "2018-01-30T21:55:38Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=1xw:0.786xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/butt-implants-main-1517405646.jpg?crop=0.636xw:1xh;center,top", "sailthru.socialtitle": "Will Butt Implants Really Give You The Bigger Booty Of Your Dreams?", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1517277338.0, "source": "https://www.womenshealthmag.com", "summary": ""}