{"url": "en.wikipedia.org/wiki/Everything_Is_Love", "text": "2018 studio album by The Carters\n\n2018 studio album by the Carters\n\nEverything Is Love (stylized in all caps) is a collaborative studio album by American duo The Carters, their surnames by marriage. It was released on June 16, 2018, by Parkwood Entertainment, Sony Music Entertainment, S.C Enterprises, and Roc Nation.\n\nBeyoncé and Jay-Z produced the album alongside a variety of collaborators, including Cool & Dre, Boi-1da, and Pharrell Williams. Additional vocalists recorded for the album include Williams, Quavo, Offset, and Ty Dolla Sign, among others. The hip hop and R&B album explores themes of romantic love, fame, wealth, and black pride.\n\nThe album was not made public until its release was announced by Beyoncé and Jay-Z while onstage at a London concert for their On the Run II Tour and later through their social media accounts. It was originally exclusive to the music distribution service Tidal, before given a wider release on June 18, 2018. In its first week, Everything Is Love debuted at number two on the US Billboard 200, recording 123,000 album-equivalent units, of which 70,000 were pure album sales.[1] At the 61st Annual Grammy Awards, the album won for Best Urban Contemporary Album, and was nominated Best Music Video for \"Apeshit\" and Best R&B Performance for \"Summer\".\n\nRecording [ edit ]\n\nView of Paris La Défense Arena (former named UArena), where the album was partially recorded.\n\nPlans about a joint album by the couple were announced by Jay-Z during an interview with The New York Times in 2017 when he said that they used \"art almost like a therapy session\" to create new music. However, since they also worked on their respective albums 4:44 and Lemonade, and Beyoncé's music progressed more rapidly, the project was temporarily stopped. Rumors about the collaborative project began emerging in March 2018 when the couple announced their On the Run II Tour.[2]\n\nThe majority of the album was recorded at U Arena in Paris; \"Friends\", \"Black Effect\" and \"Salud!\" were recorded at Kingslanding Studios West in Los Angeles, while further recording for \"Summer\" and \"Nice\" was done at The Church Studios in London. Beyoncé and Jay-Z co-produced all of the songs on the album themselves, with further producers including Pharrell, Cool & Dre, Boi-1da, Jahaan Sweet, David Andrew Sitek, D'Mile, El Michels, Fred Ball, Illmind, MeLo-X, Mike Dean and Nav. The album was predominantly recorded by Stuart White and Gimel \"Young Guru\" Keaton.[citation needed]\n\nMusic and lyrics [ edit ]\n\nEverything Is Love finds our lovers reunited, their misunderstandings resolved, their vows renewed (Beyoncé: 'you fucked up the first stone/ we had to get remarried'), and their family looking ahead to decades of more peaceful prosperity. Outrageous, multiple-mansioned, diamonds-and-watches-and-Lambos prosperity, symbolically tied to an agenda of black capitalism as racial uplift and reparations.\" \"Like the fifth act of a hip-hop and R&B Shakespearean comedy finds our lovers reunited, their misunderstandings resolved, their vows renewed (Beyoncé: 'you fucked up the first stone/ we had to get remarried'), and their family looking ahead to decades of more peaceful prosperity. Outrageous, multiple-mansioned, diamonds-and-watches-and-Lambos prosperity, symbolically tied to an agenda of black capitalism as racial uplift and reparations.\" —Carl Wilson, Slate[3]\n\nAccording to Exclaim! journalist Riley Wallace, Everything Is Love is a hip hop album.[4] Mike Wass from Idolator observed a \"trap sound and flashy bravado\" on the record,[5] while Respect magazine's Jasmine Johnson said it \"involves trap with a hint of love\".[6] Alexis Petridis found the music more rooted in hip hop than R&B,[7] as did Jogai Bhatt of The Spinoff, who viewed it as a departure from \"the sort of contemporary R&B traditionally associated with Beyoncé.\"[8] Craig Jenkins from Vulture said the singer played the role of an \"R&B heavyweight\" doubling as a \"formidable rapper\" throughout the album, showcasing her talents for vocal belting and complex rap cadences.[9]\n\nThe album contains lyrics about the couple's romantic love, lavish lifestyle, media worship, wealth, black pride and fame; themes that were found to be characteristic of the whole record.[10] Other songs feature the pair singing about their family affairs as well as maintaining their relationship following hardships (i.e. infidelity).[11] Time magazine's Maura Johnston regarded the album as another \"blockbuster duet in R&B and hip-hop\"; comparable to Marvin Gaye and Tammi Terrell's soul songs from the 1960s and the 1995 Method Man and Mary J. Blige recording \"I'll Be There for You/You're All I Need to Get By\"; while incorporating contemporary elements in the form of trap beats, critical references to the National Football League and the Grammy Awards, and playing with \"public perceptions of the duo's relationship\".[12] Jenkins said it extolled African-American entrepreneurship while presenting Jay-Z as \"a doting father and husband, an entrepreneur and altruist with ideas about how everyone else should handle their businesses, a king-tier braggart, and a rap legend\".[9]\n\nArtwork [ edit ]\n\nThe artwork for the album is a still frame from the music video for \"Apeshit\". It features two of Beyoncé's background dancers, Jasmine Harper and Nicholas “Slick” Stewart, at the Louvre—Harper is seen picking the hair of Stewart while standing in front of Leonardo da Vinci's Mona Lisa.[13]\n\nRelease and promotion [ edit ]\n\n[14] Following the album release, the Louvre created a guided tour of the art displayed in the \" Apeshit \" music video.\n\nOn June 6, 2018, Beyoncé and Jay-Z embarked on the joint On the Run II Tour, a sequel to their 2014 On the Run Tour. At the end of their second show at London Stadium in London on June 16, 2018, Beyoncé announced to the crowd that the duo had a surprise before leaving the stage. Then, the music video for \"Apeshit\" played on the LED video screen onstage. Following the conclusion of the video, the words \"ALBUM OUT NOW\" came across the screen. Everything Is Love was subsequently released exclusively via Jay-Z's streaming service Tidal and all audience members received a free six-month trial subscription in order to be able to stream the album.[15] The album was also made available for purchase on Tidal's online music store. The release was announced worldwide on the Beyoncé and Jay-Z's respective social media accounts with the artist of the album being monikered as the Carters.[10] On the same day, the music video for the album's second track and lead single \"Apeshit\" was released on Beyoncé's official YouTube channel. It was directed by Ricky Saiz and filmed at the Louvre in Paris.[16][17]\n\nOn June 18, the album was made available across numerous other platforms, including iTunes Store, Apple Music, Deezer, Amazon Music, Napster, Google Play Music and Spotify.[18]\n\nCommercial performance [ edit ]\n\nIn its first week of release, Everything is Love debuted at number two on the US Billboard 200 behind 5 Seconds of Summer's Youngblood. It recorded 123,000 album-equivalent units, out of which 70,000 were pure album sales.[1] It was Beyoncé's first studio album not to debut at number one on the Billboard 200, and Jay-Z's first album to miss the top spot since The Best of Both Worlds (2002).[19] The album debuted on the chart after less than six full days of activity on Tidal, and four days of activity on all other digital retailers and streaming services.[20] The following chart week, it dropped to number four while recording 59,000 album-equivalent units.[21]\n\nIn 2018, Everything is Love was ranked as the 70th most popular album of the year on the Billboard 200.[22]\n\nCritical reception [ edit ]\n\nEverything is Love was met with generally positive reviews. At Metacritic, which assigns a normalized rating out of 100 to reviews from professional critics, the album received an average score of 80, based on 22 reviews.[24]\n\nReviewing the album for The New York Times, Joe Coscarelli said it \"completes the Knowles-Carter conceptual trilogy\"—referring to the previous releases of Lemonade and 4:44—\"in an expert, tactical showing of family brand management\".[10] Music critic Nicholas Hautman of Us Weekly wrote: \"It's clear from the very first listen that Beyoncé outshines her husband on much of the record, which really should have been marketed as 'Beyoncé featuring Jay-Z' rather than 'Beyoncé and Jay-Z' (or 'the Carters,' in this case). His verses are few and far between in comparison to hers, but it still somehow feels like a balanced body of work from two of the greatest artists of our time.\"[34] In The Guardian, Petridis believed the album retreads braggadocio centering around the duo's wealth and excellence, with less musical daring, but still does so with likeable music, genuine wit, and energy.[7] As per The Daily Telegraph music critic Neil McCormick pointed, \"Everything Is Love certainly doesn’t have the musical expansiveness of Lemonade. There are neither ballads nor bangers, and not much in the way of melodic song construction at all. Rather, these are snappily repetitive beats on which the stars can put across their message as a form of hip hop conversation.\"[27] For Variety, Jim Aswad described it as \"solid and generally satisfying, but not the best from either.\"[35]\n\nWill Hodgkinson of The Times reviewed track-by-track, stated: \"Jay-Z is as dynamic as ever and the new, though Beyoncé demands attention on this surprise album, [...] despite the ups and downs detailed on Beyoncé's Lemonade and Jay-Z's subsequent mea culpa 4:44. Instead they are coming out fighting, with all that fame and money making them defensive, even paranoid, while a mix of classic soul, hard-hitting hip-hop and slinky R&B.\"[33] Pitchfork contributor Briana Younger wrote that the album \"is a compromise between the spoils of Lemonade's war and the fruits of 4:44's labor\", and that \"within this complex, messy and beautifully black display, the Carters find absolution.\"[31] Giving the album one and a half stars, Adam Rothbarth of Tiny Mix Tapes stated that everything about the album \"feels superficial, from the artists' constant pronouncement of their love for each other to their engagement with topics like fashion\". He also added that the \"most boring aspect of the album is its centerpiece: the couple's obsession with their wealth\".[36]\n\nAccolades [ edit ]\n\nYear-end lists Organization Country Accolade Ranked Year Source AllMusic United States Favorite Rap and Hip Hop Albums N/A 2018 [37] Associated Press United States AP's Top 2018 Albums 6 2018 [38] Austin Chronicle United States The Best Albums of 2018 by Genre 8 2018 [39] Billboard United States 50 Best Albums of 2018 10 2018 [40] Complex United States The Best Albums of 2018 7 2018 [41] Esquire United States 20 Best Albums of 2018 18 2018 [42] Exclaim! Canada Exclaim! ' s Top 10 Hip-Hop Albums Best of 2018 5 2018 [43] Fopp United Kingdom Best Albums of 2018 94 2018 [44] Gaffa Denmark Årets Album 2018 17 2018 [45] GQ Russia Russia The 20 Best Albums of 2018 17 2018 [46] HipHopDX United States The Best Rap Albums Of 2018 2 2018 [47] NME United Kingdom NME's Albums Of The Year 2018 91 2018 [48] NPR United States The 50 Best Albums Of 2018 50 2018 [49] People United States The Top 10 Albums of the Year N/A 2018 [50] Rolling Stone Argentina Los mejores discos de 2018 12 2018 [51] United States 50 Best Albums of 2018 48 2018 [52] Uproxx United States The 50 Best Albums of 2018 36 2018 [53] Uproxx Music Critics Poll 2018: Albums 35 2018 [54] Vibe United States 30 Best Albums of 2018 N/A 2018 [55] XXL United States The 50 Best Hip-Hop Albums of 2018 N/A 2018 [56]\n\nDecade-end lists Organization Country Accolade Ranked Year Source Cleveland.com United States 100 greatest albums of the 2010s 86 2019 [57]\n\nTrack listing [ edit ]\n\nCredits adapted from the album's liner notes[65]\n\nTidal exclusive promotional single No. Title Writer(s) Producer(s) Length 1. \"Salud!\" Beyoncé\n\nCarter\n\nValenzano\n\nLyon\n\nEliot Dubok\n\nTerius Nash Beyoncé\n\nJAY-Z\n\nCool & Dre\n\nBeat Butcha 3:33\n\nNotes\n\n^[a] signifies a co-producer\n\nsignifies a co-producer ^[b] signifies an additional producer\n\nsignifies an additional producer ^[c] signifies a vocal producer\n\nsignifies a vocal producer ^[d] Simon Mavin is incorrectly credited as Simon Marvin\n\nSimon Mavin is incorrectly credited as Simon Marvin ^[e] Jun Kozuki is incorrectly credited as Jan Kozuki\n\nSample credits\n\n\"Apeshit\" contains elements of an A$AP Rocky broadcast on Instagram Live.\n\n\n\n\"Black Effect\" contains a sample of \"Broken Strings\", performed by Flower Travellin' Band, written by Jun Kozuki.\n\n\n\nPersonnel [ edit ]\n\nCredits adapted from Beyoncé's official website,[66] Tidal[67] and the album's liner notes[65]\n\nMusicians [ edit ] Derek Dixie – string arrangement (track 1) , horn arrangement (track 1) , additional keys (track 1) , additional horn arrangement (track 3)\n\n, horn arrangement , additional keys , additional horn arrangement Chala Yancy – co-arrangement (track 1) , strings (track 1)\n\n, strings Nathalie Barrett-Mas – co-arrangement (track 1) , strings (track 1)\n\n, strings Crystal Alforque – co-arrangement (track 1) , strings (track 1)\n\n, strings Jessica McJunkins – co-arrangement (track 1) , strings (track 1)\n\n, strings Damien “Dammo” Farmer – bass guitar (track 1)\n\nCorbin Jones – co-arrangement (track 1) , horns (tracks 1, 3)\n\n, horns Michael Jones – co-arrangement (track 1) , horns (track 1)\n\n, horns Christopher Gray – co-arrangement (track 1) , horns (tracks 1, 3)\n\n, horns Christopher Johnson – co-arrangement (track 1) , horns (tracks 1, 3)\n\n, horns Crystal Torres – co-arrangement (track 1) , horns (tracks 1, 3)\n\n, horns Arnetta Johnson – co-arrangement (track 1) , horns (tracks 1, 3)\n\n, horns Lessie Vonner – co-arrangement (track 1) , horns (tracks 1, 3)\n\n, horns Peter Ortega – horns (track 3)\n\nRandy Ellis – horns (track 3)\n\nRichard Lucchese – horns (track 3)\n\n808-Ray – additional programming (track 10)\n\nPharrell – additional vocals (track 4)\n\nQuavo and Offset of Migos – additional vocals (track 2)\n\nRory from Stone Love – additional vocals (track 1)\n\nDamian Marley – additional vocals (track 1)\n\nTy Dolla Sign – additional vocals (track 3)\n\nBlue Ivy Carter – additional vocals (track 3)\n\nDr. Lenora Antoinette Stines – additional vocals (track 8)\n\nDre from Cool & Dre – additional vocals (\"Salud!\") Production [ edit ] Tyler Scott – strings engineering (track 1) , recording (tracks 1, 4) , assistant mix engineering (tracks 1, 3, 10)\n\n, recording , assistant mix engineering Tony Maserati – mixing (tracks 1, 3, 8, 9)\n\nStuart White – mixing (tracks 1, 2–7, 9) , recording\n\n, recording Gimel \"Young Guru\" Keaton – mixing (track 1) , recording (tracks 1–3, 5–10)\n\n, recording Leslie Brathwaite – mixing (tracks 4, 6)\n\nChris Godbey – mixing (tracks 5, 10)\n\nDJ Durel – recording (track 2)\n\nMike Larson – recording (track 4)\n\nZeph Sowers – recording (track 9)\n\nDan Ewins – assistant mix engineering (tracks 2, 5, 7)\n\nHenri Davies – assistant mix engineering (track 8)\n\nAndy Maxell – assistant mix engineering (track 10)\n\nAdrien Crapanzano – assistant engineering\n\nMarcus Locock – assistant engineering (track 1)\n\nLester Mendoza – assistant recording engineering (horns on tracks 1, 3; strings on track 1)\n\nColin Leonard – mastering\n\nTeresa LaBarbera Whites - A&R\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRegion Certification Certified units/sales Brazil (Pro-Música Brasil)[94] Gold 20,000* United States (RIAA)[95] Gold 500,000 *sales figures based on certification alone\n\n^shipments figures based on certification alone\n\nsales+streaming figures based on certification alone\n\nRelease history [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/UArena_from_GrandeArche.jpg/250px-UArena_from_GrandeArche.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/11px-Star_half.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Vista_exterior_del_Museo_del_Louvre.JPG/220px-Vista_exterior_del_Museo_del_Louvre.JPG", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/3/3d/The_Carters_-_Everything_Is_Love_%28Official_Album_Cover%29.png/220px-The_Carters_-_Everything_Is_Love_%28Official_Album_Cover%29.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/3/3d/The_Carters_-_Everything_Is_Love_%28Official_Album_Cover%29.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Beyonce_in_Rome.jpg/220px-Beyonce_in_Rome.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/3/3d/The_Carters_-_Everything_Is_Love_%28Official_Album_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Everything_Is_Love", "title": "Everything Is Love", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/3/3d/The_Carters_-_Everything_Is_Love_%28Official_Album_Cover%29.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}