{"url": "https://www.politico.com/story/2017/04/25/ivanka-trump-booed-berlin-237569", "text": "Ivanka Trump gets booed, hissed at during Berlin event The first daughter was put on the spot during her first trip abroad as a representative of America.\n\nBERLIN — Ivanka Trump arrived in Berlin on Tuesday morning armed with facts and figures to recite at what was expected to be a highbrow international summit to discuss women's entrepreneurship, alongside German Chancellor Angela Merkel.\n\nBut on her first trip abroad as an official representative of the United States, the first daughter was put on the spot about her father's attitudes toward women, booed and hissed at by the crowd, and grilled by the moderator about what, exactly, her role is in President Donald Trump’s administration.\n\nAdvertisement\n\n“You’re the first daughter of the United States, and you’re also an assistant to the president,” said the moderator, WirtschaftsWoche editor-in-chief Miriam Meckel. “The German audience is not that familiar with the concept of a first daughter. I’d like to ask you, what is your role, and who are you representing, your father as president of the United States, the American people, or your business?”\n\nIt was an aggressive opening line of questioning for the first daughter, who was seated next to Christine Lagarde, the managing director of the International Monetary Fund, and one seat down from Merkel. Queen Maxima of the Netherlands was also a participant on the W20 Summit panel, which Ivanka Trump attended at Merkel's invitation.\n\n“Certainly not the latter,” Trump said. “I’m rather unfamiliar with this role as well. ... It has been a little under 100 days, and it has just been a remarkable and incredible journey.”\n\nShe did not define what her new role as a senior White House official entailed but said she cares \"very much about empowering women in the workplace\" and defined her goal as enacting “incremental positive change. That is my goal. This is very early for me; I’m listening, learning.”\n\nThe questions asked of Trump seemed more direct than those about women in the workforce posed to other panelists. But there was a deep curiosity in Europe, ahead of her visit here, about the first daughter's new role in her father's administration.\n\nIvanka Trump, who was deeply involved with her father’s campaign and has been instrumental in his administration in the first three months in office, positioned herself as someone who is still in humbling listening-tour mode. “I’m striving to think about how best to empower women in the economy,” she said, at one point calling herself a feminist. “I have no doubt that coming out of this trip I’ll be more informed.”\n\nBut she was booed and hissed at by the majority-women audience at the conference when she lauded her father for supporting paid-leave policies. “I’m very proud of my father’s advocacy,” she said, calling him “a tremendous champion of supporting families and enabling them to thrive.”\n\nMeckel, the moderator, pushed her to address the vocal disapproval from the audience.\n\n“You hear the reaction from the audience,” she said. “I need to address one more point — some attitudes toward women your father has displayed might leave one questioning whether he’s such an empowerer for women.”\n\nDuring the campaign, more than a dozen women went public to accuse Donald Trump of sexual misconduct, unwanted advances and assault. Ivanka Trump did not comment on those accusations during the campaign, and on Tuesday she dismissed the criticism via her father’s favorite enemy — the press.\n\n“I’ve certainly heard the criticism from the media, that’s been perpetuated,” she said, drawing laughs from the audience.\n\nAnd despite being invited to attend the panel by Merkel in her role as a senior White House official, she defended her father from her vantage point of loyal daughter — in what appeared to be muscle memory from when she was confronted by uncomfortable questions about her father on the campaign.\n\n“As a daughter, I can speak on a very personal level,” Ivanka Trump said. “I grew up in a house where there was no barrier to what I could accomplish beyond my own perseverance and tenacity. That’s not an easy thing to do; he provided that for us.” She said that her father treated her exactly the same way he treated her two brothers, who now run the family business. “There was no difference,” she said.\n\nTrump also credited her father’s administration for hiring women in important roles.\n\n“The team basically going through the vetting and hiring process — six out of eight of those people are women,” she said.\n\nIvanka Trump and her team touted the summit as a political win, in a question-and-answer session with reporters following the panel, noting that Merkel had announced from the stage her support to work together on a fund to support women entrepreneurs.\n\nBreaking News Alerts Get breaking news when it happens — in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\n“Politics is politics, as I’m learning,” Ivanka Trump said, shrugging off the reaction to her comments at the panel. “My father is a champion for all Americans — women, of course.... I think the fact that he’s embraced my interest in taking on this role shows that he aligns with the interests I most deeply care about and advocate for. Otherwise it wouldn’t make for a very good family dynamic.”\n\nShe insisted that the president has been a “champion of women” throughout his career.\n\nAs for the pointed questions from the moderator, she shrugged: “I’m used to it.”", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "http://v.politico.com/images/1155968404/201704/562/1155968404_5410603677001_5410585927001-vs.jpg?pubId=1155968404"], "top_img": "http://v.politico.com/images/1155968404/201704/562/1155968404_5410603677001_5410585927001-vs.jpg?pubId=1155968404", "keywords": [], "authors": ["Annie Karni", "Nolan D. Mccaskill", "Nancy Cook", "Ben White"], "canonical_link": "https://www.politico.com/story/2017/04/25/ivanka-trump-booed-berlin-237569", "title": "Ivanka Trump gets booed, hissed at during Berlin event", "meta_data": {"article": {"opinion": "false", "author": "https://www.facebook.com/politico"}, "og": {"title": "Ivanka Trump gets booed, hissed at during Berlin event", "description": "The first daughter was put on the spot during her first trip abroad as a representative of America.", "type": "article", "url": "https://www.politico.com/story/2017/04/25/ivanka-trump-booed-berlin-237569", "image": "http://v.politico.com/images/1155968404/201704/562/1155968404_5410603677001_5410585927001-vs.jpg?pubId=1155968404", "fb_appid": 114037015331397, "site_name": "POLITICO"}, "description": "The first daughter was put on the spot during her first trip abroad as a representative of America.", "viewport": "width=device-width, initial-scale=1", "theme-color": "#dc0228", "fb": {"pages": 62317591679}, "twitter": {"card": "summary_large_image", "site": "@politico", "creator": "@politico"}, "host": "www.politico.com", "build": "release/cge-ghana c9cdd63 2020-04-15T19:31:28Z"}, "movies": [], "publish_date": 1493049600.0, "source": "https://www.politico.com", "summary": ""}