{"url": "https://www.vogue.com/article/issa-rae-cfda-dress-pyer-moss", "text": "On the CFDA Awards red carpet last night, one look stood out above the rest. Issa Rae, the evening’s host, wore a marine blue jumpsuit with sheer overlay featuring over 180,000 Swarovski crystals by Pyer Moss. Her black belt was embroidered with the title of a Boris Gardiner song that was used at Pyer Moss’s Spring 2018 show. The look itself, and its potent message, was by far the hit of the evening on the red carpet and on social media, where Rae’s many fans celebrated her choice to promote black culture on the red carpet.\n\nThe phrase on Rae’s belt was a something of a last-minute addition to the look. Pyer Moss designer Kerby Jean-Raymond told Vogue, “There was a song on the soundtrack from our runway show in February. When we were finishing the dress, I was at Roots Picnic and we thought it needed something to make it more Issa. She’s a star, so the quote was perfect.” The overall look, with its sweeping lines and glittery spirit, were drawn from another star, Jean-Raymond explained, “Diana Ross in Mohagany was the main inspiration. I took that and put Pyer Moss into it, which was easy for me to do.”\n\nPhoto: Courtesy of Pyer Moss\n\nJean-Raymond, who was nominated for the Swarovski Award for Emerging Talent, is one of American fashion’s rising stars, and the recognition from dressing Rae in such a poignant look is not lost on him. “At first I didnt understand the magnitude of it, but as I see the online reaction to it right now, I understand that its important,” he said. “It means that someone is paying attention, that what I am doing is important.”\n\nRae’s stylist Jason Rembert knew Jean-Raymond was going to be the right designer for the host’s dress from the start. “The collaboration just felt right. Kerby is a talented designer who is opening many doors for others. Issa is a fixture in media who is doing the same. I’m inspired by both,” he said, adding that the message he hopes Rae sent in her jumpsuit is “that being your true and authentic self is always going to be a win.” He summarized her looks of the evening, including a bright-green suit and slinky red dress worn onstage, as “unapologetically black.”\n\nBlackness was a central topic at last night’s awards, which honored British Vogue editor in chief Edward Enninful with the Media Award and modeling legend Naomi Campbell with the Fashion Icon Award. Enninful was presented the honor from none other than Oprah and used his acceptance speech as a clarion call for inclusion and diversity in fashion. “In a world that is increasingly divided, we must remember: We are more alike than we are different. British Vogue is about being inclusive. It’s not just the color of your skin but the diversity of perspective. That’s what drives us forward, not back.”\n\nIn her opening monologue Rae quipped, “I’m about as fashionable as Kanye is black. Only when it’s convenient,” referencing West’s deeply offensive and mis-held belief articulated in an interview with TMZ that slavery was a choice. Our only qualm with Rae’s joke is that by our count, she’s fashionable all the time.\n\nCFDA 2018: The Latest Celebrity Arrivals, Breaking News, Full List of Winners, and More\n\nSee All of the Celebrity Looks From the 2018 CFDA Awards Red Carpet:\n\n\n\n\n\n1 / 103 Chevron Chevron Photo: Getty Images Alessandra Ambrosio in Tommy Hilfiger, Brian Atwood shoes and Ofira Jewelry\n\nWatch: Kate! Cindy! Carla! The Supermodels Reunite to Pay Tribute to Naomi Campbell:", "images": ["https://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg", "https://assets.vogue.com/photos/5b15d8c7fcda8975bec67ce1/master/w_1600%2Cc_limit/GettyImages-967402562.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://assets.vogue.com/photos/5b16d23901bc90041b0821a1/master/w_1600%2Cc_limit/01-issa-rae-cfda.jpg", "https://assets.vogue.com/photos/5b16d22876361040779a9dba/master/w_2560%2Cc_limit/00-story-issa-rae-cfda.jpg", "https://assets.vogue.com/photos/5b16d22cfcda8975bec67d69/16:9/w_1280,c_limit/00-social-issa-rae-cfda.jpg", "https://assets.vogue.com/photos/5b15f0147ff9486d44986614/master/w_1600%2Cc_limit/GettyImages-967452808.jpg", "https://assets.vogue.com/photos/5b15f0102c7d2a68236f0dc8/master/w_1600%2Cc_limit/GettyImages-967452364.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg"], "top_img": "https://assets.vogue.com/photos/5b16d22cfcda8975bec67d69/16:9/w_1280,c_limit/00-social-issa-rae-cfda.jpg", "keywords": [], "authors": ["Steff Yotka", "Steff Yotk"], "canonical_link": "https://www.vogue.com/article/issa-rae-cfda-dress-pyer-moss", "title": "The Making of Issa Rae’s Resplendent CFDA Dress", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Steff Yotka", "copyright": "Copyright (c) Condé Nast 2020", "description": "On the CFDA Awards red carpet last night, one look stood out above the rest.", "id": "5b16c533c90a3471fe45af4f", "keywords": "runway,fashion,designers,cfda awards 2019", "news_keywords": "runway,fashion,designers,cfda awards 2019", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b16c533c90a3471fe45af4f", "parsely-metadata": "{\"description\":\"On the CFDA Awards red carpet last night, one look stood out above the rest.\",\"image-16-9\":\"https://assets.vogue.com/photos/5b16d2254d05a9069712ed99/16:9/w_1000,c_limit/00-promo-issa-rae-cfda.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/5b16d2254d05a9069712ed99/1:1/w_1000,c_limit/00-promo-issa-rae-cfda.jpg\"}", "og": {"description": "On the CFDA Awards red carpet last night, one look stood out above the rest.", "image": "https://assets.vogue.com/photos/5b16d22cfcda8975bec67d69/16:9/w_1280,c_limit/00-social-issa-rae-cfda.jpg", "site_name": "Vogue", "title": "The Making of Issa Rae’s Resplendent CFDA Dress", "type": "article", "url": "https://www.vogue.com/article/issa-rae-cfda-dress-pyer-moss"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "On the CFDA Awards red carpet last night, one look stood out above the rest.", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/5b16d22cfcda8975bec67d69/16:9/w_1280,c_limit/00-social-issa-rae-cfda.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "The Making of Issa Rae’s Resplendent CFDA Dress"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "https://www.vogue.com", "summary": ""}