{"url": "https://en.wikipedia.org/wiki/Jamie_Otis", "text": "Jamie Nicole Otis-Hehner (née Otis; born June 15, 1986)[1] is a reality TV personality who first appeared as a contestant on the sixteenth season of The Bachelor.[2] She is best known for participating in the first season of Married at First Sight, where she met her husband, Doug Hehner. The couple was later featured in a spin-off series, Married at First Sight: The First Year. They have since appeared in several specials on FYI.\n\nPersonal life [ edit ]\n\nOtis has been married to Doug Hehner since March 23, 2014. They shared the first two years of their marriage on the television series “Married at First Sight.” It has also been chronicled on their YouTube series “Married Life.”[3] In July 2016, the couple announced that they were expecting their first child.[4] However, a week later, Otis revealed that she had experienced a miscarriage at four months.[5] In February 2017, the couple announced that they were expecting for a second time.[6] On August, 22 2017, their daughter was born.[7] On Christmas Day 2018, the Hehners announced on their new podcast that they are expecting their third child.[8] In January 2019, Otis announced that she had experienced a second miscarriage.[9] On September 6 2019, the Hehners announced on their podcast that they are expecting.[10][11][12] The child's due date is in May 2020.[13]\n\nOtis is a registered nurse, and works at Columbia Presbyterian.[14]\n\nOtis gained custody and raised her younger siblings when she was a college freshman, and became a certified foster parent and began taking care of kids in foster care as well.[15]\n\nCareer [ edit ]\n\nIn 2012, Otis first came into the public eye as a contestant on The Bachelor, competing for the love of Ben Flajnik in the show's sixteenth season. She was eliminated in 7th place. Later that year, Otis returned for the third season of Bachelor Pad,[16] where she was paired up with fan David Mallet. The two were eliminated in the 4th episode.\n\nIn 2014, Otis was featured on the first season of Married at First Sight. Initially, the experts were reluctant to choose her due to her history on The Bachelor franchise, but ultimately thought she was a good fit. She was chosen to marry Doug Hehner. Six weeks after the wedding, Otis and Hehner decided to stay married and have been together ever since. In 2015-16, they starred in the reality series Married at First Sight: The First Year, a spinoff that followed their lives after the show.\n\nSince 2016, Otis hosts Married at First Sight: Unfiltered, a show that airs after each new episode where current contestants discuss the highs and lows of their relationships. She has also done on-air hosting for The Chef's Connection and Star Shop.\n\nOtis has one acting credit in an episode of the 2014 television series Honestly Amelia, playing Ms. Williams.\n\nOtis launched her own fine jewelry line in New York City.[17]\n\nIn June 2016, Otis became an author with the release of her book titled *Wifey 101: Everything I Got Wrong About Finding Mr. Right*.[18]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jamie_Otis", "title": "Jamie Otis", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}