{"url": "www.inquisitr.com/4656872/scott-disick-writing-kardashian-tell-all-to-expose-kims-strained-marriage-to-kanye-west-kourtney-secrets/", "text": "Scott Disick is said to be in talks to write a tell-all book about the Kardashians which could see him earn a whopping $10 million.\n\nAccording to Life & Style, Scott has been approached by multiple publishers, who have shown great interest in the concept of the book, considering that it would contain nothing but Kardashian scandals that fans would want to know about.\n\nNow that Scott Disick has completely ended his relationship with Kourtney Kardashian and is happily seeing 19-year-old Sofia Richie, he feels as if nothing is holding him back from going ahead with the idea of writing a book about the famous family.\n\nThe amount of money that Scott Disick would pocket is definitely tempting for the socialite, who is famously known for being paid to party and appearing on Keeping Up With the Kardashians from time to time.\n\nBut, as previously mentioned, Scott doesn’t have any reason why he shouldn’t pull through with the idea since he’s no longer as close with the family as he once was, and the money he’s being offered is astoundingly high.\n\nEverything forms his strained relationship with his ex-girlfriend to Kim’s alleged strained marriage with Kanye West will be talked about in the book.\n\nIn recent weeks, it has been said that Kourtney and Scott Disick have not been on good terms because the father of three is still furious over the supposed fact that the TV personality continues to flaunt her romance with boyfriend, Younes Bendjima.\n\nChilling A post shared by Scott Disick (@letthelordbewithyou) on Nov 25, 2017 at 3:08pm PST\n\nThough Scott Disick claims he has moved on with his life, he has not settled well with the idea of having his children around another man, particularly one who is much younger than Kourtney.\n\nThe statement itself heavily contradicts itself seeing that Scott is dating a 19-year-old, but for the self-proclaimed sex addict, he’s not fond of having another man around his kids, which has resulted to many arguments between the two.\n\nWhether Scott Disick will end up pulling through with the tell-all book has yet to be determined, but with the way things are looking, there’s a possibility it could happen.\n\nSlippery A post shared by Scott Disick (@letthelordbewithyou) on Nov 26, 2017 at 2:36pm PST\n\nScott has remained quiet on reports claiming that he’s considering the idea of penning a book about Kourtney and her family.", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://secure.gravatar.com/avatar/2146221c3bb32c670d1053a99949feba?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/12/scott-disick-kourtney-kardashian-tell-all-book-feud-split.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Maurice Cassidy"], "canonical_link": "https://www.inquisitr.com/4656872/scott-disick-writing-kardashian-tell-all-to-expose-kims-strained-marriage-to-kanye-west-kourtney-secrets/", "title": "Scott Disick Writing Kardashian Tell-All To Expose Kim’s Strained Marriage To Kanye West, Kourtney Secrets", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}