{"url": "https://web.archive.org/web/20100105223912/http://republicanleader.house.gov/blog/?m=201001", "text": "As Americans Save Money, their Government Spends with Reckless Abandon\n\nPosted by Kevin Boland on January 5th, 2010\n\nLast month, the New York Times wrote a story about the rise in the personal savings rate - an encouraging sign that American families are living within their means. The Times reported that “[t]his was the year of the return to financial sobriety.” Unfortunately, the same can’t be said for out-of-touch Washington Democrats.\n\nMichael Mandel, the chief economist at Business Week, noted that “Most other journalists and economists have take [sic] the same position-that Americans have reacted to the recession by saving more. But for the U.S. economy as a whole, the savings rate has not gone up-it’s actually fallen.”\n\nHow can that be? The answer is simple: government spending has exploded over the past year, which explains the discrepancies in the following chart:\n\nMandel explained:\n\nWhat we see here is that the net national savings-the sum of personal, corporate, and government savings, net of depreciation-has been plunging rather than rising. The net national savings rate fell to -2.5% in the third quarter of 2009, its lowest level since the Great Depression. That’s astounding low… the government is running such big deficits that they swamp the savings gains in the private sectors . Here’s another way of putting it: The government is borrowing a lot of money and transferring it to the private sector, through fiscal and monetary stimulus. The private sector is using some of those transfers to boost savings. But on net, the country’s savings rate as a whole is falling.\n\nIn other words, the federal government is overwhelming the private sector with deficit spending.\n\nThe House Budget Committee Republican Staff complied a lengthy list of all the Democrats’ spending in last year:\n\nDemocrats need to abandon their job-killing agenda that’s burdening families and small businesses with tax hikes and burying our kids and grandkids under a mountain of debt. All year long, House Republicans have been offering better solutions on the budget, energy, and health care - solutions that recognize that we need to empower the American people, not bureaucrats in Washington, D.C. Until Democrats understand that fundamental truth, we’ll never get our fiscal house in order.\n\n| No Comments »", "images": ["https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/UploadedFiles/1.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/UploadedFiles/2.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/blog/wp-content/uploads/2010/01/01-05-10.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/img/image05.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/blog/wp-content/uploads/2010/01/01-05-09-budget-chart.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/img/image04.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/img/image03.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/img/image06.jpg", "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/img/image07.jpg"], "top_img": "https://web.archive.org/web/20100105223912im_/http://republicanleader.house.gov/blog/wp-content/uploads/2010/01/01-05-10.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "As Americans Save Money, their Government Spends with Reckless Abandon", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}