{"url": "https://www.usatoday.com/story/life/music/2017/06/04/undaunted-ariana-grande-leads-emotional-one-love-show-manchester/102492526/", "text": "Kim Hjelmgaard\n\nUSA TODAY\n\nMANCHESTER, England — The show went on. And it turned into a defiant party with a message for those who would seek to divide us.\n\nFifty thousand people joined Ariana Grande, the Black Eyed Peas, Miley Cyrus, Justin Bieber and more of the world’s biggest musical superstars for an emotional but ultimately spirited and uplifting concert here Sunday to raise money for the victims and families of the Manchester bomb attack that took place less than two weeks ago.\n\nIt was Grande’s first performance since the May 22 attack, which left 22 dead and more than 100 injured as they exited the singer’s concert at Manchester Arena. The youngest victim was 8. The concert took place despite a terror attack 200 miles away that killed seven in London on Saturday night. More than $2.5 million was donated during the three-hour show.\n\n\"We came to show our respect, not just for Manchester (but) also for London,\" said Jason Geal, who was attending with his wife and daughters. The Geals were in the audience during Grande's performance at Manchester Arena last month. \"We need to show we are not scared,\" he said, before joining his family in a frenzied round of selfie-taking.\n\nAriana Grande stays strong, makes a pitch-perfect return to Manchester\n\nAriana Grande visits injured Manchester fans in hospital\n\nSummer was in the air and the concert had an atmosphere reminiscent of an outdoor music festival. There was beer and ice cream in ample supply and stalls selling T-shirts and other band paraphernalia. Families mixed with teenagers and young adults and groups of girls in bunny ears linked arms and sang along to their favorite songs.\n\n\"Oh, my God!\" could be heard over and over again out the mouths of adoring fans.\n\nPerhaps one of the most touching moments came when a police officer joined hands with a group of children and skipped in a circle as Bieber performed.\n\nThe message was made clear repeatedly at the all-star benefit: Whether Manchester, London, Paris or Orlando, the terrorists won't win.\n\nWearing jeans and a sweatshirt emblazoned \"One Love Manchester,\" Grande bounced around the stage and never appeared to stand still for very long. It looked like she fought back tears once or twice, but on the whole she was upbeat and energetic. \"Manchester, I love you so, so much,\" she said on several occasions.\n\nShe fully broke down only once, when she ended the show with a version of Over the Rainbow, Judy Garland's signature ballad.\n\nThousands of people, some as young as 5 or 6, sang along, danced, wiggled and got a little weepy at times, but ultimately found, as Grande’s manager Scooter Braun put it ahead of the event, a “greater purpose” in honoring and celebrating those who lost their lives to terrorism.\n\nOn stage Sunday, Braun paid tribute to the fans who turned out just hours after the London attack. \"Manchester looked fear right in the face and said, 'No, we are Manchester,' and all the world is watching,\" he said. \"Manchester, your bravery is our hope.\"\n\nPharrell Williams, Miley Cyrus, Katy Perry, Coldplay and One Direction’s Niall Horan also performed and received rapturous welcomes from fans.\n\nEach act sang a few songs and children from the Parrs Wood High School Choir performed a duet with Grande on My Everything. Two members of the choir were in the audience on May 22. One of the choir girls, a 12-year-old soloist, received a hug from Grande when she started crying on stage.\n\nThe show was held at the Old Trafford cricket stadium, just under four miles from Manchester Arena. It was broadcast live on BBC radio and television and streamed around the world. Hundreds of millions of people from more than 50 countries were expected to watch the concert in some format.\n\nMany music fans started lining up for the concert hours ahead of time, and security for the three-hour show that sold out within 20 minutes was exceptionally tight.\n\nPolice asked fans not to bring bags, and there were lengthy searches of each person admitted to the stadium amid fears that there could be yet another attack. The venue's surrounding roads were closed and dozens of large police vehicles blocked key access points.\n\n\"It felt pretty safe, although it was also a little unnerving being here, considering what went on last night,” said Cynthia Jared, at the show with her 10-year-old daughter.\n\nThe idea for the concert was Grande’s, according to Melvin Benn, a music festival organizer. “She was very traumatized after the attack but it was very important to her to support the victims and show a level of defiance that stands up to this bloodlust and tells the terrorists that they are not going to stop us,” he told Billboard magazine.\n\nGrande arrived in Manchester on Friday morning. She spent the day meeting the families of her fans who were killed in Manchester.\n\nAt Royal Manchester Children's Hospital, Jaden Farrell-Mann, 10, who was left with fractures to her legs and shrapnel wounds after the suicide blast, wrote on Twitter that she \"got to meet my queen today love you @ArianaGrande xxxxxx.\"\n\nBack on stage Sunday, Grande seemed heartened by the huge turnout.\n\n\"This evening has been filled with fun and brightness,\" she told fans. \"And I want to thank you for that.\"", "images": ["https://www.gannett-cdn.com/-mm-/e2488f0982e1b6a91fdb1c3c2190f1cd955e403a/c=0-31-4133-5542/local/-/media/2017/06/04/USATODAY/USATODAY/636321925524154867-692305822.jpg?width=300&height=401&fit=crop&format=pjpg&auto=webp", "http://videos.usatoday.net/Brightcove3/29906170001/201706/3819/29906170001_5458627914001_5458611644001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/8916714277d269a17bd11e4c46b1600a1741b498/c=0-65-4133-2400/local/-/media/2017/06/04/USATODAY/USATODAY/636321925524154867-692305822.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/8916714277d269a17bd11e4c46b1600a1741b498/c=0-65-4133-2400/local/-/media/2017/06/04/USATODAY/USATODAY/636321925524154867-692305822.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/music/2017/06/04/undaunted-ariana-grande-leads-emotional-one-love-show-manchester/102492526/", "title": "Undaunted, Ariana Grande leads emotional One Love show for Manchester", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Undaunted, Ariana Grande leads emotional One Love show for Manchester", "description": "Despite Saturday's attacks in London, One Love pressed on as a remembrance in Manchester.", "url": "https://www.usatoday.com/story/life/music/2017/06/04/undaunted-ariana-grande-leads-emotional-one-love-show-manchester/102492526/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/8916714277d269a17bd11e4c46b1600a1741b498/c=0-65-4133-2400/local/-/media/2017/06/04/USATODAY/USATODAY/636321925524154867-692305822.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Kim Hjelmgaard", "content_tier": "free", "opinion": "false"}, "description": "Despite Saturday's attacks in London, One Love pressed on as a remembrance in Manchester.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/8916714277d269a17bd11e4c46b1600a1741b498/c=0-65-4133-2400/local/-/media/2017/06/04/USATODAY/USATODAY/636321925524154867-692305822.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Undaunted, Ariana Grande leads emotional One Love show for Manchester", "description": "Despite Saturday's attacks in London, One Love pressed on as a remembrance in Manchester."}}, "movies": [], "publish_date": 1496505600.0, "source": "https://www.usatoday.com", "summary": ""}