{"url": "https://www.elitedaily.com/p/becca-garretts-fantasy-suite-date-on-the-bachelorette-was-seriously-in-tents-9853576", "text": "Bachelorette Becca Kufrin hasn't been shy about her strong feelings for contestant Garrett Yrigoyen. The 29-year-old medical sales rep received Becca's first impression rose in Episode 1, and since then, he's been a fairly quiet but valid candidate in the race for Becca's heart. Garrett has been vocal about his short-lived first marriage throughout the season, and the possibility of him getting engaged again caused his family some anxiety at last week's hometown date. With his family's wise warnings in mind, Becca and Garrett's fantasy suite date was romantically intense...as in, the date literally ended in a tent.\n\nWhile Blake Horstmann has agonized over the thought of the other men falling in love with Becca, Garrett has played the part of the happily oblivious guy who's just pleased to be there. Going into fantasy suite week, Becca admitted she had fallen in love with two men and was falling for a third, but anyone keeping up on the season could tell that Blake and Garrett had her heart split into two. Her only concern with Garrett was whether he would challenge her consistently throughout life, while Garrett was worried about becoming engaged again only for the relationship to fail.\n\nMeanwhile, a date with Garrett usually means a pretty carefree day, but this week's date fell on a Thai national holiday. If your nightmare is floating down a lazy river with people splashing you from all angles, you probably wouldn't have enjoyed Becca and Garrett's bamboo rafting activity, but they seemed into it.\n\nAnna Marie's BachelorTV on YouTube\n\nWhen they put aside their paddles and sat down for a serious chat, Garrett revealed that Becca helped him reach a new level of communication with his family on his hometown date. The time seemed to alleviate Becca's worries about sending Jason home and only confirm that her connection with Garrett is worthwhile.\n\nThe date's nighttime portion also took an emotional turn when Garrett told Becca, \"I love you, and I hope you're the last woman I have to say that to.\" Going into the fantasy suite date, the fear of being engaged was almost paralyzing, but the day's experience soothed his nerves and his tendency to overanalyze. Becca could relate to his fears because of her time with Bachelor Arie Luyendyk, who, as we all saw, bounced around real answers to questions and resorted to \"I love that\"'s.\n\nOf course, Becca was totally into Garrett's devotion. She willingly embraced his very Chris Soules-esque farming background on his hometown date, so it's safe to say that she could be in it for the long haul with Garrett.\n\nParalleling her own fantasy suite date with Arie, Becca and Garrett retreated to a tented treehouse for the night. Hopefully this doesn't foreshadow a future like Becca had with Arie, but fans on Twitter picked up on the startling similarity right away.\n\nThe freaky coincidence of date locations might not have sat well with fans, but Becca and Garrett were totally ready to commit to a life of glamping after that special night in the trees. Well, to each their own, I guess. Enjoy your tent, you crazy kids!\n\nThe Bachelorette returns on Monday, July 30, at 8 p.m. ET on ABC.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/4/2b74a670-4c99-40d5-9b1d-5e9daaa83751-screen-shot-2020-04-04-at-15503-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/7/79039556-36c4-4922-b83d-ab2333995aae-getty-1200238651.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/4ed81eb9-cfac-40ea-9e7f-58a28db04ceb-getty-1152683888.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/23/a3a0a4d0-566b-4099-a980-dcb47be4349d-149214_0269.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/23/a3a0a4d0-566b-4099-a980-dcb47be4349d-149214_0269.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/23/a3a0a4d0-566b-4099-a980-dcb47be4349d-149214_0269.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/becca-garretts-fantasy-suite-date-on-the-bachelorette-was-seriously-in-tents-9853576", "title": "Becca & Garrett's Fantasy Suite Date On 'The Bachelorette' Was Seriously In-Tents", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/becca-garretts-fantasy-suite-date-on-the-bachelorette-was-seriously-in-tents-9853576", "type": "article", "title": "Becca & Garrett's Fantasy Suite Date On 'The Bachelorette' Was Seriously In-Tents", "description": "Bachelorette Becca Kufrin hasn't been shy about her strong feelings for contestant Garrett Yrigoyen. The 29-year-old medical sales rep received Becca's first impression rose in Episode 1, and since then, he's been a fairly quiet but valid candidate…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/23/a3a0a4d0-566b-4099-a980-dcb47be4349d-149214_0269.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Bachelorette Becca Kufrin hasn't been shy about her strong feelings for contestant Garrett Yrigoyen. The 29-year-old medical sales rep received Becca's first impression rose in Episode 1, and since then, he's been a fairly quiet but valid candidate…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}