{"url": "https://www.etonline.com/emmys-2018-schitts-creek-star-dan-levy-best-tv-performance-103744", "text": "Dan Levydelivered one of ET's Standout Performances of the 2017-18 season.\n\n\n\nCo-created by Dan Levy and his father, Eugene, Schitt’s Creek was presented as a fish-out-of-water sitcom about a snobbish, rich family -- the Roses -- stripped of their opulence and forced to rebuild their lives in a small town when it first premiered in February 2016 on Pop. While they bemoan their new existence, Johnny (Eugene Levy) and Moira (Catherine O'Hara), and their two kids Alexis (Annie Murphy) and David (Dan Levy) -- the very definition of narcissism and privilege -- soon discover alternative lives that may not be as bad as they once seemed.\n\nInitially, while bitingly funny, any fondness or empathy for the Roses didn’t seem possible. But over the course of the series, something’s changed. Schitt's Creek got softer and sweeter. In the show's third and fourth seasons, David finds the courage to hug Alexis, Moira tries to be a caring mom to a sick Alexis, and David lets his walls come tumbling down after being serenaded by his boyfriend, Patrick (Noah Reid).\n\nNow, this word-of-mouth comedy is making its fans both cry and laugh and cry again as it continues to gain more fans in the U.S. -- yes, even Carol Burnett -- and earn its first nomination in an American awards show.\n\nIn a conversation with ET, Dan Levy talked about full-circle moments (including a Mariah Carey retweet), writing for his dad and what's to come for the Roses as he looks ahead to their upcoming Christmas special and season five.\n\nET: When did you know that Americans had finally discovered what Canadians and gays already knew as TV’s best-kept secret?\n\nDan Levy: I do feel like we've been building toward this, and the intention of the show from the very beginning was to have the audience grow with these people. We've been peeling back the layers [of these characters], and I think by the time we got to our fourth season, which I think was the fuzziest in terms of the sentimentality marrying with comedy, we were in a place culturally where people were ready to accept that kind of humor. I do feel like the fan base has grown in a very organic way, and it's a very rewarding feeling as a storyteller because it means that what we're doing is working and that we're not just sustaining people, we're actually continuing to excite, which is wonderful.\n\nEven though it's won 13 Canadian Screen Awards, your MTV Movie & TV Awards nomination for Best Comedic Performance is the first time the show has been honored by any U.S. awards show. What did that feel like?\n\nI was floored. Does Catherine O'Hara deserve an Emmy? Absolutely. Is the show big enough to get people's attention? Who knows. But I think the work is there for her. But [the MTV nomination] is a wonderful thing -- and I've worked at MTV. I was a VJ at MTV and actually hosted the Movie Awards red carpet one year about 10 years ago. I was such a bad red carpet host.\n\nI don't believe you!\n\nOh, no, it was so bad. Because you have to ask people like, \"Hey, Sienna Miller, what are you wearing?\" And I knew in my head, this is not my job. I have the utmost respect for red carpet interviewers; it is such a hard job. It was at that moment when I was like, I think I have something else to do. And to have this full-circle moment where I'm now being recognized by MTV at the same sort of award show that I started out as a host, I mean, it's just the most rewarding.\n\nWas it then that you began developing Schitt's Creek?\n\nI left the year after, so I would say it was about a year and a half later when we started working on the show. But I will say I will not expect to win in any way. I'm pretty sure people are looking at me on that list being like, \"Who is this person?\"\n\nHow has the cast dynamic changed since the pilot episode? Is there a different rhythm to the way you and your co-stars interact on set?\n\nFor us, we were lucky enough to start right off the bat with a cast who just were these people, and we didn't have to find voices because our cast was so strong and was so deeply embedded into the characters to begin with. Comedy is not easy to begin with, but comedy that also dances with drama, it's so hard. And with a team of actors young and old who have inspired me on the daily -- they make it look so easy, and it's really not. We've really grown as a family.\n\nIs that same comedy-drama dance one that will carry into the next season?\n\nI think so. Inherently, there will be a little more weight to everything because the audience cares about these people and they're rooting for them. And that's what life is, I think.\n\nThe cast of 'Schitt's Creek' in a scene from season four. Pop TV\n\nDoes art imitate life? Are these storylines taken from your life with your dad and the rest of your family?\n\nThere are a few moments. Like any writing team, everyone puts their own experiences into it. I think my dad is closer to the character of Johnny than I am to David, which makes it fun for us to write for him because I'm so aware of what he will be excited by in terms of just comedy. The more you work with any cast, the more you're able to write little isms into the dialogue that speak on a slightly more intimate level to the actual actor playing the part. That's been really fun. The more I get to know Annie, the more I get to write about her in ways that, as a brother and sister duo outside of the show now -- we feel like that as friends now -- I'm able to put in a jab here and there. She'll be like, \"So, talking about my natural deodorant? Is that a personal thing or is that a character thing?\" And I'm like, \"Well, we'll never know, now will we?\"\n\nWho gets to take jabs at you then?\n\nWell, I'm the most self-deprecating person on the whole show! Everything from David's tendency to overeat to his complete self-deprecation, I mean, all those things come from my own little well. I think if you can't make fun of yourself, then what are you doing? I don't think I am quite as boldly confident as David is. I question things a little bit more. You can't constantly live at a 10.\n\nDavid has such stilted, dramatic speech affectation, and his many facial contortions; how did you go about creating those David characteristics?\n\nI can only describe it as: If there were no rules in terms of social etiquette, what would I look like? How would we all manifest how we feel on our faces if social etiquette or manners or any kind of social norms were never in place? That was sort of the jumping-off point for David, a person who has absolutely no filter over how he reacts to situations. Everything is dramatic. Every sort of problem is a monstrous catastrophe. Nothing is ever easy, nothing is ever peaceful. And this is a character that, in sort of his own way, thrives in chaos. The physicality of it, despite my constant fear that I'm just mugging for the camera.\n\nIs that really a fear of yours?\n\nYeah. I think it's a tricky thing, because you don't ever want to make a character feel like a caricature. For me, it's always making sure that we don't get into cartoon land. I'm always sort of running to the director being like, \"Was it too big?\" because it can get a bit crazy at times.\n\nDid you know from the beginning it'd be a boyfriend who would expose David's heart to us?\n\nYeah. I knew he was going to get a boyfriend, and this person was going to be the perfect counterbalance to his sort of neurotic, anxiety-ridden self.\n\nHow many takes did you do for your version of Tina Turner’s “Simply the Best” and how many did Noah do?\n\nWhat Noah did for that song was so brilliant. He could just keep singing it and I would just keep crying [laughs]. He just knocked it out of the park. For me, I showed up to set not knowing anything about what I was going to do with it. All I did was learn the lyrics to the song. I hadn't choreographed anything. I had no real plan. I didn't know how it would even look. I was in the process of doing my writing job, and it was only at lunch that I thought, Oh, I have this after lunch. So, I had my assistant run out and get a bottle of prosecco, and Noah and I consumed a bottle of prosecco at lunch and then went in there. I would say 90 percent of what you saw was the very first take that I did. But it was also easy because I'd found the gesture of the character itself so liberating for him. This is someone who had never experienced love before. I sort of sat in that character for a minute and thought, This is what you have to do: You have to wear a leather Givenchy sweater and dance around in a room and show this person that you mean business.\n\nIn the season four finale, Patrick professed his love to David, telling him, \"You're my Mariah Carey.\" So, when is Mariah Carey getting her cameo on Schitt's Creek?\n\n[Laughs] Um, listen, you never know. It's a strange thing. I think everyone has their people that sort of trigger an emotional, full-circle-moment response. I have been a Mariah Carey fan -- hers was one of the first CDs I ever bought. As a little gay kid, I was obsessed with Mariah Carey, and then this moment [when she tweeted about the show], it triggered a very excited, emotional response in me, because not only does it mean she's aware of the show, but she's aware of that scene. She's aware of that relationship! Or, she could've just retweeted it or someone else could've done it for her. But either way it came from her account, and yeah, I'm running with it.\n\nNoah Reid and Dan Levy in a scene from 'Schitt's Creek.' Pop TV\n\nI bet you could work Mariah into the Jazzagals, the town's all-female a capella group, at some point.\n\nOr she'll just be stopping by Rose Apothecary and picking up a few things some time soon.\n\nBut you better get the plungers out of the front. Mariah would not find that acceptable.\n\nI'll be laying down a red carpet for that one. It'll be her and Carol Burnett in the same episode, and we'll just see what happens.\n\nAbout Carol: What went through your mind when she told Jimmy Kimmel she binges your show?\n\nFirst of all, I immediately just started picturing Carol Burnett flipping through Netflix, which brought me a lot of joy. You know, it's a small show. We shoot it in Canada, it's very tiny, and we don't ever imagine the scope of it. But these unsolicited endorsements? It's great. So, you know, Carol singing your praises, I mean, who is bigger than that in comedy? I don't know where you go from there.\n\nDo you think we will ever see the Roses back in the poshness of their natural habitat?\n\nI can't say either way. I will say that we have a holiday episode that is coming out in December and there are things that happen in that episode that we've never seen before. It's a longer episode than normal. I ended up directing it with a very close friend of mine from film school, actually. And we may or may not see a little bit of their past. Who knows. But I've always been a big fan of the Downton Abbey Christmas special. I love a good holiday special. So it was a dream to make one. I think a Schitt's Creek Holiday is a very special episode and the first episode that I directed.\n\nWhat are the Roses like at Christmas?\n\nThey don't handle the holidays well, is what I'll say.\n\nWhat are you most looking forward to about season five?\n\nLike anything, we try to build and expand the show. We try to continue to push our characters and excite our actors by throwing them into situations that we haven't seen before. I think there's some big life stuff that happens this year that is really exciting.\n\nExciting or sad?\n\nExciting!\n\nI'm looking for reasons to cry.\n\nThere will be! I think at this point there will always be that emotional undercurrent. There's an episode I wrote this season that I think is my favorite episode we've ever done. It's certainly an incredibly meaningful episode for me on a personal level, and I just wept through the whole thing. You weep for a bunch of reasons, but I think as a showrunner I take such pride in our team -- not just our actors, [but] in our writing team, in our art department -- that to watch something come together with that kind of synergy and have it sing to me is an incredibly moving experience. And when you couple that with a storyline that I have waited a long time to tell, it's a gift. Not a day goes by that I'm not totally grateful for the opportunity.\n\nThis interview has been edited and condensed.\n\nMORE STANDOUT PERFORMANCES OF THE SEASON:\n\nEmmys 2018: How Laurie Metcalf and Zoe Perry Could Make Emmy History (Exclusive)\n\nEmmys 2018: Sarah Jessica Parker Plays to Her Strengths on Season Two of ‘Divorce’ (Exclusive)\n\nEmmys 2018: Tituss Burgess on Doing ‘Kimmy Schmidt’ for Four Seasons and a Movie (Exclusive)", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/sc4_ep406_d41_sw_0229_copy.jpg?itok=TaTowB3-", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_9.jpg?h=c673cd1c&itok=6eLs26R2", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-06/emmys2_9.jpg?h=c673cd1c&itok=p5Bf13Zq", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/sc4_ep406_d39_sw_0191_copy.jpg?itok=cVx8hi47"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_9.jpg?h=c673cd1c&itok=6eLs26R2", "keywords": [], "authors": ["Chris Azzopardi"], "canonical_link": "https://www.etonline.com/emmys-2018-schitts-creek-star-dan-levy-best-tv-performance-103744", "title": "Emmys 2018: ‘Schitt’s Creek’ Star Dan Levy on Creating TV’s Best Kept Secret (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Emmys 2018: ‘Schitt’s Creek’ Star Dan Levy on Creating TV’s Best Kept Secret (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/emmys-2018-schitts-creek-star-dan-levy-best-tv-performance-103744", "title": "Emmys 2018: ‘Schitt’s Creek’ Star Dan Levy on Creating TV’s Best Kept Secret (Exclusive)", "description": "Levy talks to ET about full-circle moments (including a Mariah Carey retweet), writing for his dad, and what's to come for the Roses.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_9.jpg?h=c673cd1c&itok=6eLs26R2", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Levy talks to ET about full-circle moments (including a Mariah Carey retweet), writing for his dad, and what's to come for the Roses.", "title": "Emmys 2018: ‘Schitt’s Creek’ Star Dan Levy on Creating TV’s Best Kept Secret (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Chris Azzopardi‍", "url": "https://www.etonline.com/emmys-2018-schitts-creek-star-dan-levy-best-tv-performance-103744", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_9.jpg?h=c673cd1c&itok=6eLs26R2"}, "description": "Levy talks to ET about full-circle moments (including a Mariah Carey retweet), writing for his dad, and what's to come for the Roses.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Features, Awards, News, TV, Schitt's Creek, Emmys", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}