{"url": "https://www.foxnews.com/entertainment/taylor-swifts-transformation-from-a-country-singer-to-political-advocate", "text": "Taylor Swift became hugely popular at a young age before making career jumps from country to pop music -- and now, from apolitical to key political voice.\n\nHere’s a look back at Swift’s career.\n\nSwift's beginning\n\nThe singer was born in Pennsylvania but moved to Nashville, Tenn., after her father relocated his job to Merrill Lynch's office in the city. Salon reported Swift's father bought a share in Big Machine, the label that later signed the singer. The New Yorker reported Swift began working with songwriters including Liz Rose, who helped write her hit song, \"You Belong with Me.\"\n\nSwift’s first album\n\nThe Nashville-based singer kicked off her popularity with her debut album, “Taylor Swift,” in 2006. The album’s first single, “Tim McGraw,” reached the Billboard Hot 100 chart. Singles “Teardrops on My Guitar” and “Our Song” became critical successes as well.\n\nSwift got attention after the album and went on to win the \"New Female Vocalist of the Year\" award at the Academy of Country Music Awards in 2008.\n\nSwift wins her first Grammy Award\n\nSwift’s second album, “Fearless,” was a critical and commercial success. Singles like “Love Story” and “You Belong with Me” became hits overnight. The album went on to win \"Album of the Year\" and \"Best Country Album\" in 2010.\n\nThe singer made headlines in 2009 after rapper Kanye West interrupted her speech at the MTV Video Music Awards. Swift won the Video of Year award for “You Belong with Me,” but the rapper apparently didn’t think it was well deserved.\n\nWest rushed to the stage, took the microphone from Swift and declared, “Yo, Taylor, I’m really happy for you and I’mma let you finish, but Beyoncé had one of the best videos of all time. One of the best videos of all time.”\n\nThis started the long-running feud between Swift and West that continues to this day.\n\nSwift goes pop\n\nThe \"Mean\" singer won many country music awards before she turned her focus to pop music. \"Red,\" her fourth studio album, churned out hits like \"We are Never Ever Getting Back Together,” “22” and “I Knew You Were Trouble.” Swift was beginning to make the transition to pop after the album's release in 2012. The album still featured a country sound and went on to win the \"Best Country Album\" and \"Album of the Year\" at the Grammy Awards.\n\nHer next album, \"1989,\" was full pop and featured hits like \"Shake it Off\" and \"Bad Blood.\" \"Shake it Off\" shot up to the top of the Billboard Hot 100 chart and the album broke records after it sold more than 1.2 million copies in its first week. The singer was on her way to becoming a pop megastar before a public relations nightmare forced her to take some time out of the spotlight.\n\nSwift takes a break\n\nThe \"Red\" crooner took some time out of the spotlight for much of 2017 following a messy breakup with superstar DJ Calvin Harris and her continuing feud with West. Swift and West were on good terms after the VMAs debacle, but the tide changed after West's hit single \"Famous.\" In the song, West referred to Swift in a derogatory way.\n\n\"I feel like me and Taylor might still have sex. I made that b---- famous,\" he sang.\n\nSwift slammed West during her acceptance speech at the 2016 Grammy Awards without mentioning his name.\n\n\"And as the first woman to win 'Album of the Year' at the Grammys twice, I want to say to all the young women out there, there are going to be people along the way who will try to undercut your success or take credit for your accomplishments or your fame,\" Swift said. \"But if you just focus on the work and you don't let those people sidetrack you, someday, when you get where you are going, you will look around and you will know that it was you and the people who love you who put you there. And that will be the greatest feeling in the world. Thank you for this moment.\"\n\nFollowing the debacle, West's wife Kim Kardashian West defended her husband and posted a video to her Snapchat that appeared to show a phone call between the rapper and Swift talking about the \"Famous\" lyric.\n\n\"It's like a compliment,\" Swift was heard saying.\n\nSwift responded to the debacle after social media users started taking sides.\n\n“Where is the video of Kanye telling me he was going to call me ‘that b----’ in his song? It doesn’t exist because it never happened. You don’t get to control someone’s emotional response to being called ‘that b----’ in front of the entire world,” she wrote in an Instagram post, according to People.\n\nCelebrities even got involved in the feud, including Selena Gomez and actress Chloe Grace Moretz. Both defended Swift.\n\nSwift took a hiatus to work on her new album, \"Reputation,\" and wait for some of the frenzy to die down.\n\nSwift embraces snake meme, drops new album\n\nSwift was back, again, after dropping her hit single, \"Look What You Made Me Do,\" in August 2017. The teaser video focused on a snake which is what social media users called Swift following the West feud. She appeared to have embraced her new title and used it in her music. In November, she dropped \"Reputation\" and continued her reign as a pop superstar. She kicked off her \"Reputation\" tour and remained in and out of headlines mostly for her style -- but last week she made headlines for a different reason.\n\nSwift talks politics\n\nThe noticeably politically-absent singer made a rare endorsement. On Sunday, Swift wrote in an Instagram post that she would be voting for Tennessee Democrats in the midterm elections.\n\n\"As much as I have in the past and would like to continue voting for women in office, I cannot support Marsha Blackburn,\" Swift told her 112 million Instagram followers. \"Her voting record in Congress appalls and terrifies me.\"\n\nSwift said the congresswoman \"voted against equal pay for women. She voted against the Reauthorization of the Violence Against Women Act, which attempts to protect women from domestic violence, stalking, and date rape. She believes businesses have a right to refuse service to gay couples. She also believes they should not have the right to marry.\"\n\nShe added: \"These are not MY Tennessee values.\"\n\nSwift said she'll be voting for Democrat Phil Bredesen for the Senate, and also for Rep. Jim Cooper, a Democrat who's running for re-election.\n\nFollowing her endorsements, new voter registration spiked nationwide and in her home state of Tennessee.\n\nBlackburn responded to Swift's snub, saying she was an advocate for women's causes, in an interview with Fox Business' Connell McShane.\n\n“Of course I support women and I want violence to end against women,” Blackburn said. “I've been very active in abuse shelters and child advocacy centers. I've been advocating for women in equal pay since I was 19 years old and making certain that woman have the opportunity for maximum pay and have a good record on that.”\n\nThe congresswoman continued: \"We're getting ready the Music Modernization Act that I helped steer through Congress. It's going to be signed on Thursday by the president. I've been very active in that and Taylor Swift will benefit by that.\"\n\nThe wide-ranging bill would affect payments to songwriters, copyright performance rights and royalties, among other things.\n\nOn Tuesday, Swift took the stage at the American Music Awards and urged fans to vote in the upcoming midterm elections.\n\nSwift has not made a political comment since Tuesday.\n\nFox News' Nicole Darrah and Elizabeth Zwirz contributed to this report.", "images": ["https://static.foxnews.com/foxnews.com/content/uploads/2018/10/taylor-swift-2.jpg", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/348/196/elvispresleyreuters.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/10/640/320/taylor-swift.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/348/196/meghan-markle-red.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/07/348/196/em-rata-getty.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/AP20110019543582.jpg?ve=1&tl=1", "https://media2.foxnews.com/BrightCove/694940094001/2018/10/08/694940094001_5846039258001_5846041243001-vs.jpg", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/340/340/headshot-48513.jpg?ve=1&tl=1", "https://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/07/17/931/524/694940094001_5810405201001_5810401092001-vs.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/08/348/196/liz-hurley.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/270/152/Brad-Paisley.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/270/152/PattonOswalt1.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/348/196/Lorenzo-twitter.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/348/196/lauren-sanchez-jeff-bezos.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/nickcordero.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/348/196/Screen-Shot-2020-03-17-at-9.39.14-AM.png?ve=1&tl=1", "https://media2.foxnews.com/BrightCove/694940094001/2016/07/18/694940094001_5040108152001_ad2f4d0d-772f-4a56-80ab-a085721759dd.jpg"], "top_img": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/taylor-swift-2.jpg", "keywords": [], "authors": ["Kathleen Joyce", "Kathleen Joyce Is A Breaking Trending News Producer For Foxnews.Com."], "canonical_link": "https://www.foxnews.com/entertainment/taylor-swifts-transformation-from-a-country-singer-to-political-advocate", "title": "Taylor Swift’s transformation from country singer to political voice", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0, initial-scale=1.0", "description": "Taylor Swift became hugely popular at a young age before making career jumps from country to pop music -- and now, from apolitical to key political voice.", "prism.channel": "fnc", "prism.section": "entertainment", "prism.aggregationType": "subsection", "pagetype": "article", "content-creator": "tiger", "dc.creator": "Kathleen Joyce", "dc.title": "Taylor Swift’s transformation from country singer to political voice", "dcterms.abstract": "Taylor Swift became hugely popular at a young age before making career jumps from country to pop music -- and now, from apolitical to key political voice.", "dc.type": "Text.Article", "dc.description": "Taylor Swift became hugely popular at a young age before making career jumps from country to pop music -- and now, from apolitical to key political voice.", "dc.language": "en-US", "dc.publisher": "Fox News", "dc.format": "text/html", "dc.identifier": "urn:uri:base64:fa5d5644-8535-57a9-b20b-c5d4ea6c52f9", "dc.source": "Fox News", "dc.date": "2018-10-11", "dcterms.created": "2018-10-11T14:27:54-04:00", "dcterms.modified": "2018-10-12T17:19:45-04:00", "og": {"title": "Taylor Swift’s transformation from country singer to political voice", "description": "Taylor Swift became hugely popular at a young age before making career jumps from country to pop music -- and now, from apolitical to key political voice.", "type": "article", "image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/taylor-swift-2.jpg", "url": "https://www.foxnews.com/entertainment/taylor-swifts-transformation-from-a-country-singer-to-political-advocate", "site_name": "Fox News"}, "robots": "noarchive, noodp", "twitter": {"card": "summary_large_image", "site": "@foxnews", "title": "Taylor Swift’s transformation from country singer to political voice", "description": "Taylor Swift became hugely popular at a young age before making career jumps from country to pop music -- and now, from apolitical to key political voice.", "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/10/1024/512/taylor-swift-2.jpg?ve=1&tl=1", "url": "https://www.foxnews.com/entertainment/taylor-swifts-transformation-from-a-country-singer-to-political-advocate"}, "fb": {"app_id": 116027085089150}, "article": {"opinion": "false"}, "classification": "/FOX NEWS/ENTERTAINMENT/GENRES/Country,/FOX NEWS/ENTERTAINMENT,/FOX NEWS/ENTERTAINMENT/Celebrity News,/FOX NEWS/Politics", "classification-isa": "country,entertainment,celebrity,politics"}, "movies": [], "publish_date": null, "source": "https://www.foxnews.com", "summary": ""}