{"url": "https://web.archive.org/web/20011107072419/http://www.teamster.org:80/01news/hn_010731_3.htm", "text": "A vote for exploration of Alaska's National Wildlife Reserve (ANWR) is a vote for environmental responsibility, Jerry Hood, a Teamsters leader from Alaska, said during a Capitol Hill news conference Tuesday, July 31, 2001.\n\n\"We know it can be done safely,\" said Hood, who is Special Advisor for Energy Policy to Teamsters General President James P. Hoffa. Hood is also Secretary-Treasurer of Local 959 in Anchorage.\n\nHood noted that 58 percent of the petroleum used by the United States is imported, and that figure will jump to 70 percent by 2010. Hood said the imported oil arrives in largely unsafe, single-hull oil tankers. Hood recalled the 1989 Exxon Valdez tragedy in Alaska.\n\n\"We never want to see that again,\" Hood said. Exploring for oil in Alaska will make the United States less dependent on imports, he said.\n\nThe Teamsters Union supports the creation of 735,000 good-paying jobs for working families that would result from opening ANWR. Hood said he is confident the House of Representatives will vote to approve ANWR oil exploration. The House is scheduled to begin debate Wednesday, August 1, and a vote is expected by Thursday, August 2.\n\nHood was joined at the news conference by Reps. Tom Delay, (R-Texas), J.C. Watts (R-OK) and Roy Blunt (R-MO). U.S. Labor Secretary Elaine Chao also spoke.\n\n\"We ask members of the House and Senate to act upon the President's energy plan,\" Chao said. \"It's time for America to have what it has lacked for too long: a responsible, realistic energy plan that meets our needs and protects our future.\"", "images": ["https://web.archive.org/web/20011107072419im_/http://www.teamster.org/images/logo_red.gif", "https://web.archive.org/web/20011107072419im_/http://www.teamster.org/images/arrow.gif", "https://web.archive.org/web/20011107072419im_/http://www.teamster.org/images/hd_news.gif", "https://web.archive.org/web/20011107072419im_/http://www.teamster.org/images/aatest%20graphic/nav_map0.gif", "https://web.archive.org/web/20011107072419im_/http://www.teamster.org/images/0731ANWR.jpg", "https://web.archive.org/web/20011107072419im_/http://www.teamster.org/images/spacer.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Teamsters Tout ANWR on Capitol Hill", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}