{"url": "www.inquisitr.com/4412082/was-selena-gomez-betrayed-by-the-weeknd-report-claims-the-starboy-is-a-bad-liar/", "text": "Was Selena Gomez cheated on by the Weeknd? That’s what an article in the current issue of Star Magazine says. The tabloid alleges that the “Starboy” singer may have slept with an Irish model while he was on tour in Dublin. But Gossip Cop is on the case and they claim that the story is nothing but the work of a “Bad Liar.”\n\nAs Gossip Cop reports, Star Magazine says that it “learned that The Weeknd, aka Abel Tesfaye, invited Irish Instagram model Ava Van Rose back to his hotel the night before his performance at the Longitude Festival in Dublin on July 15.” They say that they got the information from a so-called insider who told them that the model spent some time with The Weeknd.\n\nThe article then speculates about how Selena will react to the “news” that Abel may have cheated on her, implying that Gomez would be emotionally gutted by the news.\n\n“She hoped Abel would prove her wrong. If Selena finds out about this [hookup with Van Rose], there’s no telling what she might do!”\n\nBut Gossip Cop insists that the story is based on what they call “unsubstantiated rumors.” They say that the story was first published in The Irish Sun and was derived from an insider in the model’s circle. Even though these claims about the Weeknd are pretty explosive, the story hasn’t been picked up by any of the major celebrity news publications. This is a pretty good hint that the story isn’t credible. As Gossip Cop notes, the rumors about Abel and Ava were published by Radar Online, but that’s expected because it’s Star Magazine‘s sister publication.\n\nBest show ever great weekend???? #artistpass #theweeknd #goals❤️ #xo #amazing #lovehim #festival #irishgirl # A post shared by Model Ava van rose???? (@avavanroseofficial) on Jul 18, 2017 at 10:19am PDT\n\nI'm just me ???????????? #godess#glamourmodel#pink#princess#greeneyes#grateful#beautiful#brunette#brussels#love#instagram#instabeauty#instadaily#instagood A post shared by Model Ava van rose???? (@avavanroseofficial) on Jun 22, 2017 at 2:58am PDT\n\nAva Van Rose has been previously linked to Drake, according to the Hollywood Life, when she claimed that she was Drake’s companion on the Boy Meets World Tour for six weeks. Ava claimed that she was invited to spend time with Drake by one of his bodyguards. The “One Dance” rapper was allegedly so smitten with her that they were on the road together for over a month. She has pictures to prove that she has spent time with Drake’s dad and some of the members of his OVO team.\n\n@therealdennisg @jenellling @champagnepapi great night with great people Drakes papi More life party #legend#party#london#glamourmodel#ovo#insta#instagood#morelife A post shared by Model Ava van rose???? (@avavanroseofficial) on Mar 19, 2017 at 3:23am PDT\n\nAs The Heavy reports, she was born Bridget Byrne and has over 50,000 followers on Instagram. She is a mother of three, which may come as a surprise when you look at the lifestyle she claims to have based on her social media posts.\n\nRELATED POSTS ON THE INQUISITR\n\nSelena Gomez Interview: Singer Hints Bieber Made Her Feel ‘Insecure’ During Their Relationship\n\nSelena Gomez Admits She Needs Therapy, Months After Rehab To Help Her Deal With Haters And Fame\n\nSelena Gomez Says Boyfriend The Weeknd Is Her ‘Best Friend’: ‘I’m Lucky’\n\nSelena Gomez Tour: Canceling ‘Revival World Tour’ Was Best Thing She Could Have Done\n\n[Featured Image by Theo Wargo/Getty Images For US Weekly]", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/selena-gomez-and-the-weeknd-at-The-2017-Met-Gala.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4412082/was-selena-gomez-betrayed-by-the-weeknd-report-claims-the-starboy-is-a-bad-liar/", "title": "Was Selena Gomez Betrayed By The Weeknd? Report Claims The ‘Starboy’ Is A ‘Bad Liar’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}