{"url": "www.yourtango.com/2018315676/are-gwen-stefani-and-blake-shelton-married-new-rumors-about-their-secret-wedding", "text": "They've been together since 2015.\n\nAre Gwen Stefani and Blake Shelton married? Ever since Gwen Stefani’s split from Tony Kanal in the 90s, we’ve always wanted her to find someone who could love her and have a healthy relationship. While we thought that was the case with Gavin Rossdale, he ended up breaking her heart and cheating on her after 14 years of marriage and three beautiful children later.\n\nBut in 2015, Stefani met Blake Shelton while filming The Voice, and the two have been dating ever since. He’s getting along well with her children and seems to treat her well.\n\nA post shared by ExtraTV (@extratv) on Jul 30, 2018 at 9:00am PDT\n\nEven though they’ve both said they aren’t rushing into marriage (since they each divorced their spouses not too long ago), are Gwen Stefani and Blake Shelton secretly married?\n\nAccording to sources, the couple has been trying to conceive a child of their own. “Blake and Gwen have decided to put plans to have a baby on hold. Their feeling is if it happens naturally, great. But they’ve decided to not focus on it for the time being. Blake is extremely attentive, loving and doting towards Gwen and the boys. Blake has always wanted children. And he’s great with Gwen’s kids, which prompted them wanting their own,” an insider said.\n\nA post shared by Gwen Stefani (@gwenstefani) on Jun 28, 2018 at 4:35pm PDT\n\nIt looks like they are putting their plans to have children on hold — so does that mean they want to get married beforehand? Because Stefani is so traditional, getting pregnant without being married is unlikely. If that’s the case, did they have a quickie wedding to move things along?\n\nBack in April, she confirmed to Ellen Degeneres she is not married.\n\nDegeneres asked her questions about Shelton, to which Stefani replied, “It's weird because I get nervous when you talk to me about him. I don't know why, but for some reason, the cameras are rolling and I shouldn't say something. So if I say, 'We are [getting married],' then we are, and if I say, 'No, we're not,' then that would be sad, too.”\n\nThe good news, however, is that her children are taken with him. “We love him,” Stefani commented. “Everybody loves him. He's lovable. I think about [marriage] all the time.”\n\nEven Shelton himself thinks about marrying Stefani. In an interview with CMT’s Cody Alan, Shelton admitted, “I think about it. I don’t think it’s anytime soon or anything. The more time that goes by, I guess, the closer you’d be getting to that.”\n\nAs for a secret marriage, you can put the rumors to rest. This couple is taking things slow, but we may see Stefani walking down the aisle again in the near future.\n\nA post shared by Gwen Stefani (@gwenstefani) on Mar 1, 2018 at 3:52pm PST\n\nSamantha Maffucci is an associate editor for YourTango. In her free time, you can find her obsessing about cats, wine, and all things Vanderpump Rules.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/gwen%20stefani%20blake%20shelton.jpg?itok=LhZnrFCM", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/gwen%20stefani%20blake%20shelton.jpg?itok=N2JBDSKK"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/gwen%20stefani%20blake%20shelton.jpg?itok=N2JBDSKK", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018315676/are-gwen-stefani-and-blake-shelton-married-new-rumors-about-their-secret-wedding", "title": "Are Gwen Stefani And Blake Shelton Married? New Details On Their Rumored Secret Wedding", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Taken, Blake Shelton, gwen stefani, celebrity relationships, the voice, Marriage, tony kanal, Gavin Rossdale, Self", "article": {"author": "https://www.yourtango.com/users/samantha-maffucci", "published_time": "2018-07-30T21:53:30", "modified_time": "2018-07-30T21:53:30"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018315676/are-gwen-stefani-and-blake-shelton-married-new-rumors-about-their-secret-wedding", "title": "Are Gwen Stefani And Blake Shelton Married? New Details On Their Rumored Secret Wedding", "description": "They've been together since 2015.", "updated_time": "2018-07-30T21:53:30", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/gwen%20stefani%20blake%20shelton.jpg?itok=N2JBDSKK", "width": 620, "height": 309}}, "description": "Are Gwen Stefani and Blake Shelton secretly married? Though the two have both talked about marriage and are devoted to one another, tying the knot may not be in the near future for the couple.", "abstract": "Ever since Gwen Stefani’s split from Tony Kanal in the 90s, we’ve always wanted her to find someone who could love her and have a healthy", "robots": "follow, index, noodp, noydir", "news_keywords": "are Gwen Stefani and Blake Shelton secretly married, are Gwen Stefani and Blake Shelton married, gwen stefani, blake shelton, hwen stefani and blake shelton, gwen blake married, gwen pregnant, gwen blake secretly married, gwen blake wedding, gwen blake marriage", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018315676/are-gwen-stefani-and-blake-shelton-married-new-rumors-about-their-secret-wedding", "title": "Are Gwen Stefani And Blake Shelton Married? New Details On Their Rumored Secret Wedding", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/gwen%20stefani%20blake%20shelton.jpg?itok=N2JBDSKK", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/qEs9uh9GIPs"], "publish_date": 1532958810.0, "source": "http://www.yourtango.com", "summary": ""}