{"url": "people.com/tv/matt-lauer-annette-roque-marriage-quotes/", "text": "In the wake of Matt Lauer‘s shocking termination from NBC News amid allegations of allegedly inappropriate sexual behavior, the disgraced newsman and wife Annette Roque are no longer wearing their wedding rings.\n\n“They’re taking it day by day right now,” a source tells PEOPLE in this week’s issue, on stands now. “His focus is on his family.”\n\nGet push notifications with news, features and more.\n\nA longtime friend suggests the Dutch model feared Lauer, 59, would cheat on her even before they wed, telling PEOPLE, “By Matt’s own admission there were struggles and challenges with his wife. Like many couples, they struggled with a modern marriage.”\n\nSeveral insiders have told PEOPLE that the ousted Today Show co-anchor was allegedly often unfaithful to Roque, whom he wed in 1998 after meeting on a blind date. (Lauer was previously married to television producer Nancy Alspaugh from 1981-88.)\n\nLauer and Roque share three children: son Jack, 16, daughter Romy, 14, and son Thijs, 11.\n\nHere, we look back on what the intensely private pair has said about their union.\n\nImage zoom From left: Jack Matthew Lauer, Romy Lauer, Thijs Lauer and Matt Lauer James Devaney/GC Images\n\nNot love at first sight\n\nIn 1998, Lauer discussed meeting Roque on a blind date.\n\n“It was one of those slow-developing things,” he told the Palm Beach Post. “I don’t think I kissed her for two months.”\n\n‘She is terrific’\n\nAlso in 1998, Lauer hinted about popping the question to Roque during an interview with Larry King, though he did not share her name.\n\n“I am single, but extremely committed and spoken for,” Lauer said, adding that his mystery woman was was “not in the media.”\n\n“She is terrific. It has been about eight months now,” he added.\n\nAs for trying the knot, he said, “That was written someplace — that Matt’s afraid of commitment. It’s not at all true. I think it’ll be something we’ll look at each other and day and say boom — and it’ll happen quickly. I really do.”\n\nThey tied the knot in Bridgehampton, New York, later that year.\n\nImage zoom Matt Lauer (left) and Annette Roque Jemal Countess/Getty Images\n\n‘Cruel and inhumane’\n\nRoque briefly filed for divorce in 2006. In court documents obtained by the National Enquirer, Roque claimed Lauer committed “cruel and inhumane” acts against her, demonstrating “extreme anger and hostility” that endangered her mental and physical wellbeing as well as repeatedly criticized her parenting skills.\n\nDespite the allegations, Roque withdrew the court papers three weeks after filing them.\n\nRefuting rumors\n\n“Every once in a while I’ll read quotes from so-called insiders, and it’s never true,” Lauer told PEOPLE in 2008 about the gossip surrounding the couple. “We grin and bear it, and the next thing you know, it’s someone else’s turn. Annette and I are great.”\n\nImage zoom Annette Roque (left) and Matt Lauer Kevin Mazur/Getty\n\n‘We have worked through it’\n\nIn 2010, the couple denied a report that Lauer had moved out of their New York City apartment. (However, source have recently confirmed Roque and their kids lived full-time in the Hamptons while he stayed in the city on weekdays.)\n\n““I am living in my apartment with Annette and my children as a family and a couple,” Lauer said. ““I have never moved out. I am not moving out. There is no truth to that.”\n\nRoque said in a separate interview with PEOPLE, “Out of self respect, I want to stand up for our family and protect them.”\n\n“Have we had a completely perfect, easy marriage? No. But the stories you’ve read over the years are not true,” Lauer said. “I don’t think we’re any different than any married couple that’s been together for 12 years,” he adds. “The accusations [of infidelity] are ridiculous and I’m not going to [dignify] them with an answer. It’s not true.”\n\nApologizing to ‘the people I cherish dearly’\n\nIn November, Lauer alluded to his wife and family in a statement after his termination from Today.\n\n“There are no words to express my sorrow and regret for the pain I have caused others by words and actions,” Lauer said. “To the people I have hurt, I am truly sorry. As I am writing this, I realize the depth of the damage and disappointment I have left behind at home and at NBC.\n\n“Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed. I regret that my shame is now shared by the people I cherish dearly.”\n\n“Repairing the damage will take a lot of time and soul searching, and I’m committed to beginning that effort. It is now my full time job. The last two days have forced me to take a very hard look at my own troubling flaws. It’s been humbling. I am blessed to be surrounded by people I love. I thank them for their patience and grace.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fmatt-lauer-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fmatt-lauer.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fgettyimages-166113249-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1242&h=650&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmatt-lauer-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1242&h=650&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmatt-lauer-1.jpg", "keywords": [], "authors": ["Michele Corriston"], "canonical_link": "https://people.com/tv/matt-lauer-annette-roque-marriage-quotes/", "title": "Matt Lauer and Annette Roque's Strained Marriage: In Their Own Words", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Matt Lauer,News,Sexual Assault,Sexual Harassment,Today,TV", "news_keywords": "Matt Lauer,News,Sexual Assault,Sexual Harassment,Today,TV", "description": "NBC fired Matt Lauer for alleged inappropriate sexual behavior", "og": {"title": "Matt Lauer and Annette Roque's Strained Marriage: In Their Own Words", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/matt-lauer-annette-roque-marriage-quotes/", "description": "In the wake of Matt Lauer‘s shocking termination from NBC News amid allegations of allegedly inappropriate sexual behavior, the disgraced newsman and wife Annette Roque&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1242&h=650&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmatt-lauer-1.jpg", "width": 1242, "height": 650}}, "pinterest": {"url": "https://people.com/tv/matt-lauer-annette-roque-marriage-quotes/", "description": "NBC fired Matt Lauer for alleged inappropriate sexual behavior", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmatt-lauer-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/matt-lauer-annette-roque-marriage-quotes/", "title": "Matt Lauer and Annette Roque's Strained Marriage: In Their Own Words", "description": "NBC fired Matt Lauer for alleged inappropriate sexual behavior", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1242&h=650&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmatt-lauer-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}