{"url": "http://www.eternallifestyle.com/living/david-cassidys-family-revealed-wont-holding-funeral-hollywood-star/", "text": "David Cassidy was a world-famous teen idol. He had an entire generation of young girls swooning after him, and after his days on TV, he would wow the crowds as he took to the stage. Sadly he met his fate in November 2017. Yet he will always be remembered as a legend. However, his family’s recent decision to not give him a proper send off has shocked the world. What is their reasoning for this? Sad Ending He was only 67 when he died, and his life certainly had its ups and downs. It has taken until now for his family to speak out about what the funeral arrangements are, or shall we say lack of funeral arrangements. But why?\n\nLooming Sadness David Cassidy shot to fame for his role in the beloved show The Partridge Family in the 1970s. This character would change the course of his entire life. He became the archetypal teen idol, with girls fawning over him and sticking his picture on their bedroom walls. But no matter how many girls fell at his feet, and how big his career became he still didn’t seem to be happy.\n\nLoathed The Image In fact, Cassidy actually spent most of his life trying to shed this teen idol image. He longed to be taken seriously as an adult entertainer, but none of his attempts seemed to work. Even way back in 1972, when The Partridge Family was still on air, he posed naked for Rolling Stone magazine. In the corresponding interview he revealed that he was a drug user.\n\nTragedy Looms Sadly, tragedy seemed to follow Cassidy. In 1974 a terrible incident happened to one of his young adoring female fans. When Cassidy performed a show at London’s White City Stadium, a dangerous stampede occurred. Almost 800 concert-goers were badly injured. What’s more, tragically, one fan suffered a heart attack and died in hospital. He never got over this trauma.\n\nDevastation Occurered Cassidy was devastated over the tragic incident. The fan, Bernadette Whelan, had only been 14 years old. Although Whelan’s parents publicly stated that they didn’t blame Cassidy, the singer chose not to go to her funeral service. He was worried that his presence would turn the event, meant to be a private time of mourning, into a media frenzy and he wanted to respect the family.\n\nAnother Tragedy Occurs Just a few years later, another terrible accident occurred. Cassidy’s estranged father, Jack, perished in a house fire. The elder Cassidy was bipolar and an alcoholic, and David hadn’t spoken to him for over a year. In December 1976 Jack returned drunk to his apartment and passed out with a lit cigarette in his hand. The cigarette dropped and set the room on fire, consequently killing him.\n\nA Sign Of Things To Come Sadly, David Cassidy would experience problems with alcohol of his own. As The Partridge Family ended and the years passed by, his substance abuse problems would continue to get worse. He subsequently claimed that by the 1980s he had spent all his money, and he barely saw his daughter Katie, who was brought up by her mother.\n\nLegal Difficulties If that wasn’t bad enough, he began to encounter legal difficulties. Cassidy was even arrested several times for DUIs between 2010 and 2014. Due to this, he was ordered to go to rehab, during which time Cassidy also filed for bankruptcy. In September 2015 he appeared on the British TV show This Morning, but appeared drunk and angrily shouted at the hosts as the audience awkwardly watched.\n\n\n\nBad Behaviour But there was another reason for his agitated behavior. In February 2017 Cassidy made the announcement that he was suffering from dementia, a terrible brain disease that affects people’s ability to function. “I was in denial but a part of me always knew this was coming,” he told People magazine. “I want to focus on what I am, who I am and how I’ve been, without any distractions… I want to love, I want to enjoy life.”\n\nSad Ending But, sadly, Cassidy didn’t get the chance to live the rest of his days out happily. On November 18, 2017, his liver and kidneys began to pack in and he was admitted to hospital suddenly. He was put into a medically-induced coma for a couple of days, and once he came out of it doctors hoped that they could get him a liver transplant. However, they were too late. Cassidy passed away due to liver failure on November 21.\n\nTribute Members of Cassidy’s family paid public tribute to him. The day after he died, his younger brother Shaun posted a series of tweets and photographs. “Thank you for all your love and good wishes for David. It means the world to all of us,” Shaun wrote, before sharing a story.\n\nPublicly Expressing Sadness “When I was a little boy and my big brother would come to visit, the first call of business would be a punishing pillow fight,” he wrote of his past. “During the battle, he would regale me with hysterical stories of our father, often culminating in his taking a giant leap off my top bunk. I tried to catch him of course. I always tried to catch him. But I never could.”\n\nHeartfelt Words His brother continued to speak of his loss: “Now, I will carry him, along with all of the funny/sad/extraordinary days we shared, none more filled with love than these last few at his side,” he finished. And Cassidy did indeed die with his family at his side. His representative informed E! that “David died surrounded by those he loved, with joy in his heart and free from the pain that had gripped him for so long.”\n\nKatie Finally Speaks Out Cassidy’s daughter, actress Katie Cassidy, also broke her silence with a message on Twitter about her father’s death. “Words can’t express the solace our family’s received from all the love & support during this trying time,” she wrote. “My father’s last words were ‘So much wasted time.’ This will be a daily reminder for me to share my gratitude with those I love as to never waste another minute.” Their feud was publicly squashed with this heartfelt message.\n\n\n\nExploitation Unfortunately, some mean people immediately tried to exploit that incredibly personal moment. In December 2017 CNBC reported that the Cassidy family were taking legal action against bootleggers selling Cassidy T-shirts with “So much wasted time” emblazoned on them. “People don’t even wait until somebody’s cold. It’s like virtual grave robbing,” Cassidy’s ex-wife Sue Shifrin Cassidy said.\n\n\n\nTaking Advantage Of His Death She spoke out stating:”It’s really bad. It was a private moment, and to have people making money off of that makes me wonder what kind of people have we become,” she added. The family took action and hired an LA lawyer to serve cease-and-desist notices to the illegal merchandisers. On the same subject, Shifrin Cassidy posted on Twitter, “It is the poorest of taste to see people trying to make money off of our loved one’s death.”\n\n\n\nShock To The World Many people subsequently eulogized Cassidy on social media. But the day after he died, media outlets began reporting that he wouldn’t have a regular funeral. “Sources with direct knowledge of the situation tell [us that] in lieu of a burial/funeral, the family is planning a private memorial after the holidays for close friends and relatives to attend,” website The Blast announced.\n\nWhy No Funeral? It was decided that Cassidy would be quietly cremated, by the family. According to The Blast, however, the family did also recognize that many fans wanted to pay their respects to their idol. Therefore, they had plans for a public memorial as well. “We’re told a time and venue for the public memorial is far-off, but you can bet it will draw a gigantic crowd,” the website stated.\n\nGone But Not Forgotten They wanted a private cremation, similarly to when music megastar David Bowie died in 2016, his family didn’t have a big service, but instead scattered his ashes on the island of Bali. Was this was David wanted though?", "images": ["https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092637/David-Cassidy-4-1024x687.jpg", "https://www.eternallifestyle.com/wp-content/themes/unified/images/logo_v2.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092632/David-Cassidy-20-1024x679.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092640/David-Cassidy-5-1024x762.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092617/David-Cassidy-13-1024x782.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092648/David-Cassidy-9-1024x703.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092634/David-Cassidy-3-1024x805.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092615/David-Cassidy-12-1024x732.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092611/David-Cassidy-10-1024x684.jpg", "https://www.eternallifestyle.com/wp-content/themes/unified/images/logo_footer.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092645/David-Cassidy-7-1024x746.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092628/David-Cassidy-19-1024x671.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092622/David-Cassidy-16-1024x760.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092630/David-Cassidy-2.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092619/David-Cassidy-14.jpg", "https://www.facebook.com/tr?id=382791848977127&ev=PageView&noscript=1", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092641/David-Cassidy-6.jpg", "http://trc.taboola.com/1021215/log/3/unip?en=page_view", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092621/David-Cassidy-15-1024x765.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092609/David-Cassidy-1-1024x614.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092613/David-Cassidy-11-1024x740.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092646/David-Cassidy-8-1024x581.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092626/David-Cassidy-18-1024x682.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092624/David-Cassidy-17-1024x765.jpg"], "top_img": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092609/David-Cassidy-1-1024x614.jpg", "keywords": [], "authors": ["Mark Parker", "Bonnie Kaplan", "Elizabeth Bartov", "Becca Bridges", "Brandon Strauss", "Jennifer Hall", "Sandra Moore"], "canonical_link": "https://www.eternallifestyle.com/living/david-cassidys-family-revealed-wont-holding-funeral-hollywood-star/", "title": "David Cassidy’s Family Won’t Be Honoring The Hollywood Star But Why?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "David Cassidy’s Family Won’t Be Honoring The Hollywood Star But Why? | EternalLifestyle", "description": "David Cassidy was a world-famous teen idol. He had an entire generation of young girls swooning after him, and after his days on TV, he would wow the crowds as he took to the stage. Sadly he met his fate in November 2017. Yet he will always be remembered as a legend. However, his family’s …", "url": "https://www.eternallifestyle.com/living/david-cassidys-family-revealed-wont-holding-funeral-hollywood-star/", "site_name": "EternalLifestyle", "updated_time": "2018-01-10T14:15:44+00:00", "image": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092632/David-Cassidy-20-1024x679.jpg"}, "article": {"section": "Living", "published_time": "2018-01-10T10:42:07+00:00", "modified_time": "2018-01-10T14:15:44+00:00"}, "twitter": {"card": "summary", "description": "David Cassidy was a world-famous teen idol. He had an entire generation of young girls swooning after him, and after his days on TV, he would wow the crowds as he took to the stage. Sadly he met his fate in November 2017. Yet he will always be remembered as a legend. However, his family’s […]", "title": "David Cassidy’s Family Won’t Be Honoring The Hollywood Star But Why? | EternalLifestyle", "image": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2018/01/08092609/David-Cassidy-1-1024x614.jpg"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1515580927.0, "source": "http://www.eternallifestyle.com", "summary": ""}