{"url": "https://thehill.com/homenews/administration/350999-trump-makes-good-on-pledge-to-donate-to-harvey-relief", "text": "President Trump has acted on his promise to donate $1 million of his personal fortune to charities helping with Hurricane Harvey relief efforts, the White House said.\n\nWhite House press secretary Sarah Huckabee Sanders confirmed to The Hill that the president cut checks to 12 organizations helping the the Gulf region recover from the monster storm, which devastated swaths of southeast Texas and Louisiana last month.\n\nThe Hill confirmed with multiple groups that they received the funds this week.\n\nSanders announced late last month that the president would give $1 million of his personal funds to hurricane disaster relief. Following suggestions from the public and the White House press corps, on September 6 Huckabee Sanders announced 12 organizations that would receive funds.\n\nADVERTISEMENT\n\nThe American Red Cross and the Salvation Army received the largest portions of the president’s donation – $300,000 each.\n\nTwo groups associated with Christian ministries – Samaritan’s Purse and Reach Out America – were promised $100,000 each.\n\n\n\nEight other groups – the ASPCA, Catholic Charities, Direct Relief, Habitat for Humanity, the Houston Humane Society, Operation Blessing, Portlight Inclusive Disaster Strategies and Team Rubicon – would receive $25,000 apiece, the White House said earlier this month.\n\nThe Red Cross, which was slated to receive one of the larger donations from Trump, did not confirm a specific donation, however a spokesperson told The Hill the organization was “grateful to the Trumps for their generous support of our mission.”\n\nHabitat for Humanity confirmed to The Hill the organization had received a check from the president and first lady Melania Trump.\n\nA Habitat for Humanity spokesperson told The Hill the president and first lady thanked the organization in a note for being “on the forefront of rebuilding our Nation and providing a critical helping hand for those in need.”\n\nDisaster relief organizations Portlight Inclusive Disaster Strategies and Team Rubicon also confirmed to The Hill they received checks from the president and first lady to assist in Harvey relief.\n\nReach Out America said in a Facebook post two days before the White House announced the recipients that they had received a $100,000 donation from Trump.\n\n“It was a landmark day for Reach Out America when President Donald & First Lady Melania Trump visited First Church of Pearland, TX. The President & First Lady were there to encourage Hurricane Harvey survivors, and then passed out relief supplies. Larry Williamson, founder of Reach Out America received a generous donation of $100,000 from President Trump for ROA,” the organization’s Facebook page said.\n\nThe Washington Post’s David Farenthold reported on Wednesday that Direct Relief, which is dedicated to improving “the health and lives of people affected by poverty and emergency,” received a personal check from the president for $25,000.\n\nThe Dallas Morning News’ Lauren McGaughy confirmed the animal charity the Houston Humane Society also received a check for $25,000.\n\nThe ASPCA, Operation Blessing, and Samaritan’s Purse declined to discuss personal donations.\n\nThe Hill has reached out to the Salvation Army and Catholic Charities for confirmation.\n\nTrump’s record for fulfilling charitable pledges is not spotless.\n\nEarly in the Republican presidential primaries last year, the real estate mogul vowed to give $1 million of his personal fortune to veterans’ charities, plus an additional $5 million he said he had raised during a fundraiser in Iowa ahead of the state’s caucuses.\n\nBut it was revealed months later that Trump had not made good on that pledge, and only donated $1 million to the causes after facing pressure from media.\n\nSince then, however, the president has fulfilled his promise to donate his presidential salary, giving his first quarter pay to the National Parks Service and his second-quarter salary to the Department of Education.\n\nThe Associated Press also reported on Friday that nearly eight months after Trump was sworn into office, his inaugural committee still has not fulfilled a promise to donate leftover funds to charities.\n\nThe committee had raised an unprecedented $107 million for the inauguration.", "images": ["https://thehill.com/sites/default/files/styles/thumb_small_article/public/trumpdonald_082817getty_1.jpg?itok=jv3eekHj", "https://thehill.com/sites/default/files/styles/leading_video/public/ca_kristof_wudunn_tightrope.jpg?itok=imgzunVm", "https://thehill.com/sites/default/files/styles/leading_video/public/bidenjoe_022920gn24_lead.jpg?itok=WdXZePZS", "https://thehill.com/sites/all/themes/thehill/images/redesign/thehill-logo-big.png", "https://sb.scorecardresearch.com/p?c1=2&c2=10314615&c3=&c4=https%3A//thehill.com/homenews/administration/350999-trump-makes-good-on-pledge-to-donate-to-harvey-relief&c5=&c6=&c15=&cv=2.0&cj=1", "https://thehill.com/sites/default/files/trumpdonald_082817getty_1.jpg", "https://thehill.com/sites/default/files/styles/leading_video/public/palihapitiyachamath_04172020_0.jpg?itok=98iKkeEX", "https://thehill.com/sites/all/themes/thehill/images/redesign/thehill-logo-footer.png"], "top_img": "https://thehill.com/sites/default/files/trumpdonald_082817getty_1.jpg", "keywords": [], "authors": [], "canonical_link": "https://thehill.com/homenews/administration/350999-trump-makes-good-on-pledge-to-donate-to-harvey-relief", "title": "Trump makes good on pledge to donate to Harvey relief", "meta_data": {"author": "Max Greenwood  and Julia Manchester", "description": "President Trump has acted on his promise to donate $1 million of his personal fortune to charities helping with Hurricane Harvey relief efforts, the White House said.", "keywords": ",,", "generator": "Drupal 7 (http://drupal.org)", "fb": {"admins": 1531470032, "app_id": 566538590082898, "pages": "7533944086, 2064147433830888"}, "og": {"site_name": "TheHill", "type": "article", "title": "Trump makes good on pledge to donate to Harvey relief", "url": "https://thehill.com/homenews/administration/350999-trump-makes-good-on-pledge-to-donate-to-harvey-relief", "description": "President Trump has acted on his promise to donate $1 million of his personal fortune to charities helping with Hurricane Harvey relief efforts, the White House said.", "updated_time": "2017-09-24T12:42:33-04:00", "image": "https://thehill.com/sites/default/files/trumpdonald_082817getty_1.jpg"}, "twitter": {"card": "summary_large_image", "title": "Trump makes good on pledge to donate to Harvey relief", "url": "https://thehill.com/homenews/administration/350999-trump-makes-good-on-pledge-to-donate-to-harvey-relief", "description": "President Trump has acted on his promise to donate $1 million of his personal fortune to charities helping with Hurricane Harvey relief efforts, the White House said.", "widgets": {"csp": "on"}}, "article": {"published_time": "2017-09-16T12:09:20-04:00", "modified_time": "2017-09-24T12:42:33-04:00"}, "dcterms.title": "Trump makes good on pledge to donate to Harvey relief", "dcterms.creator": "Julia Manchester", "dcterms.description": "President Trump has acted on his promise to donate $1 million of his personal fortune to charities helping with Hurricane Harvey relief efforts, the White House said.", "dcterms.date": "2017-09-16T12:09-04:00", "dcterms.type": "Text", "dcterms.format": "text/html", "dcterms.identifier": "https://thehill.com/homenews/administration/350999-trump-makes-good-on-pledge-to-donate-to-harvey-relief", "apple-itunes-app": "app-id=396640962"}, "movies": [], "publish_date": 1505578160.0, "source": "https://thehill.com", "summary": ""}