{"url": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_New_Jersey", "text": "New Jersey-based reality television series in the United States\n\nThe Real Housewives of New Jersey (abbreviated RHONJ) is an American reality television series that premiered on May 12, 2009, on Bravo. Developed as the fourth installment of The Real Housewives franchise, it has aired ten seasons and focuses on the personal and professional lives of several women residing in New Jersey.\n\nThe current cast consists of Teresa Giudice, Melissa Gorga, Dolores Catania, Margaret Josephs, Jennifer Aydin and Jackie Goldschneider. Previously-featured cast members include original cast members Danielle Staub, Jacqueline Laurita, Caroline Manzo and Dina Manzo; and later additions Kathy Wakile, Teresa Aprea, Amber Marchese, Nicole Napolitano, and Siggy Flicker.\n\nThe success of the show has resulted in the spin-offs Manzo'd with Children and Teresa Checks In.\n\nOverview and casting\n\nSeasons 1–5\n\nThe Real Housewives of New Jersey was announced when Bravo released its 2008–09 programming on April 15, 2008.[1] The first season premiered on May 12, 2009, and starred Caroline Manzo, Jacqueline Laurita, Teresa Giudice, Dina Manzo and Danielle Staub. For the first time in the franchise, the series followed housewives who are related to one another: sisters Caroline and Dina are married to brothers Albert and Tommy Manzo, and Jacqueline Laurita is married to Caroline and Dina's brother, Chris Laurita.[2] Dina and Tommy Manzo would later end up separated.[3][4] The second season premiered on May 3, 2010, with Dina Manzo departing the series after the seventh episode.[5] Staub left the show after the second season.[6]\n\nThe third season premiered on May 16, 2011, with new housewives Melissa Gorga and Kathy Wakile.[7] It delivered the highest rated season premiere in the network's history and the highest rated season premiere in The Real Housewives franchise at the time.[8] The fourth season premiered on April 22, 2012.[9] The fifth season premiered on June 2, 2013.[10] Caroline Manzo and Laurita left the show after the fifth season.[11]\n\nSeasons 6–present\n\nThe sixth season premiered on July 13, 2014.[12] It featured the return of Dina Manzo as a full-time cast member and new cast members Amber Marchese, Teresa Aprea and Nicole Napolitano.[13] Wakile was demoted to a \"friend of the housewives\" role, while Laurita appeared as a guest.[14][15] Marchese, Aprea, Napolitano and Dina Manzo left the show after the sixth season.[16][17] Laurita returned as a full-time cast member in the seventh season, which premiered on July 10, 2016.[18] The season also featured Dolores Catania and Siggy Flicker as new cast members, while Wakile and Rosie Pierri appeared as \"friends of the housewives\".[19] Aprea and Napolitano also appeared as guests.[20][21] The season marked as the final appearance of Laurita, Wakile and Pierri in the show.[22][23]\n\nStaub returned in the show as friend of the housewives for the eighth season, which premiered on October 4, 2017. It also featured Margaret Josephs as the new cast member.[24] Flicker left the show afterwards.[25] The ninth season premiered on November 7, 2018, featuring Jennifer Aydin and Jackie Goldschneider joining the cast. While Staub returned as a friend once again.[26] The tenth season premiered on November 6, 2019, featuring the cast of the previous season.[27] Staub, who appeared as a friend for the third consecutive season, departed the series for the second time in January 2020.[28]\n\nTimeline of cast members\n\nCast member Seasons 1 2 3 4 5 6 7 8 9 10 Teresa Giudice Main Jacqueline Laurita Main Guest Main Caroline Manzo Main Dina Manzo Main Guest Main Danielle Staub Main Friend Melissa Gorga Guest Main Kathy Wakile Guest Main Friend Teresa Aprea Main Guest Amber Marchese Main Nicole Napolitano Main Guest Dolores Catania Guest Guest Main Siggy Flicker Main Margaret Josephs Main Jennifer Aydin Main Jackie Goldschneider Main Friends of the housewives Rosie Pierri Guest Friend\n\nEpisodes\n\nSeason Episodes Originally aired First aired Last aired 1 10 May 12, 2009 ( ) July 9, 2009 ( 2009-07-09 ) 2 18 May 3, 2010 ( ) September 6, 2010 ( 2010-09-06 ) 3 21 May 16, 2011 ( ) October 23, 2011 ( 2011-10-23 ) 4 24 April 22, 2012 ( ) October 21, 2012 ( 2012-10-21 ) 5 22 June 2, 2013 ( ) October 20, 2013 ( 2013-10-20 ) 6 19 July 13, 2014 ( ) November 20, 2014 ( 2014-11-20 ) 7 18 July 10, 2016 ( ) November 13, 2016 ( 2016-11-13 ) 8 16 October 4, 2017 ( ) January 31, 2018 ( 2018-01-31 ) 9 18 November 7, 2018 ( ) March 6, 2019 ( 2019-03-06 ) 10 19 November 6, 2019 ( ) March 18, 2020 ( 2020-03-18 )\n\nBroadcast history\n\nThe Real Housewives of New Jersey airs regularly on Bravo in the United States;[29] most episodes are approximately forty-two minutes in length,[30] and are broadcast in standard definition and high definition.[31] Since its premiere, the series has alternated airing on Monday, Tuesday, Wednesday, Thursday, and Sunday evenings and has been frequently shifted between the 8:00, 9:00, and 10:00 PM timeslots.[29]\n\nSpin-offs\n\nThe series' success has resulted in a development of spin-off series. Caroline Manzo's children Albie and Chris had a web series spin-off alongside their roommate and friend Greg Bennett, Boys to Manzo which premiered on May 30, 2011.[32][33] Caroline Manzo, who was part of the original cast of the show, quit the series due to involvement in the production of a new show, Manzo'd with Children.[34][35] The show premiered on October 5, 2014 on Bravo.[36] The reality series follows the daily life of Manzo and her family,[37] and lasted for three seasons.[38]\n\nIn October 2015, a three episode spin-off, entitled Teresa Checks In premiered. It featured the life of the Giudice family during the aftermath of Teresa Giudice's being sentenced to prison. The series featured cast members of The Real Housewives of New Jersey, Melissa Gorga and Rosie Pierri.[39][40]\n\nIn December 2018, an after show featuring season 9's cast was released online through Bravo.com and YouTube. It featured their reactions to the most recent episode and thoughts on the season.[41] An after show for the tenth season started streaming online on December 11, 2019.[42]", "images": ["https://upload.wikimedia.org/wikipedia/en/4/4c/Real-housewives-of-new-jersey-logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Siggy_Flicker.jpg/129px-Siggy_Flicker.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Danielle_Staub.jpg/197px-Danielle_Staub.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Teresa_Giudice_at_New_York_Fashion_Week_2016.jpg/145px-Teresa_Giudice_at_New_York_Fashion_Week_2016.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Melissa_Gorga_at_New_York_Fashion_Week_2016.jpg/204px-Melissa_Gorga_at_New_York_Fashion_Week_2016.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Real-housewives-of-new-jersey-logo.png/250px-Real-housewives-of-new-jersey-logo.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/4c/Real-housewives-of-new-jersey-logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_New_Jersey", "title": "The Real Housewives of New Jersey", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/4c/Real-housewives-of-new-jersey-logo.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}