{"url": "https://www.cheatsheet.com/entertainment/brad-pitt-how-the-actor-is-moving-on-after-split-with-angelina-jolie.html/", "text": "Brad Pitt and Angelina Jolie’s divorce has been out of the headlines lately, but it is still moving forward, despite rumors that they were thinking about reconciling. Now there are rumors that Pitt is moving on with his life by dating. But someone he has been rumored to be dating said publicly that isn’t true. So what exactly is going on with the newly single actor?\n\nThat’s hard to figure out, given the father has been purposely laying low, but we decided to find out the latest. Here are seven things we know about how the actor is moving on after the divorce, in both his professional life and dating life.\n\n1. Brad Pitt is reportedly dating again\n\nBrad Pitt isn’t all work and no play. | Alberto E. Rodriguez/Getty Image Brad Pitt isn’t all work and no play. | Alberto E. Rodriguez/Getty Image\n\nIt sounds like the Oscar winner is dipping his toe back in the dating pool. But don’t expect there to be an announcement of him getting serious with anyone just yet. A source told People that Pitt “has been dating a bit.”\n\nThe source continued, “It’s not anything serious” and “he doesn’t have a girlfriend. It’s more of a way to get out and be social.” The dates are also reportedly not that intimate. “He seems more comfortable double-dating and friends are helping out.”\n\n2. Sienna Miller reportedly went on a date with the actor\n\nSienna Miller has been linked to the Hollywood heartthrob. | Tristan Fewings/Getty Images Sienna Miller has been linked to the Hollywood heartthrob. | Tristan Fewings/Getty Images\n\nAfter his divorce, Pitt was briefly linked to actress Sienna Miller, with reports claiming that the two went out briefly last summer but were “both absolutely determined to keep everything under wraps.”\n\nIt seems like that didn’t last long though, because in April 2018, Pitt was linked to yet another lady.\n\n3. Pitt may be dating an MIT professor\n\nBrad Pitt has been linked to different women since his divorce. | Adrian Dennis/AFP/Getty Images Brad Pitt has been linked to different women since his divorce. | Adrian Dennis/AFP/Getty Images\n\nIn April 2018, rumors started swirling that Pitt was dating an MIT professor, Neri Oxman. According to People, Pitt and Oxman connected over their shared love of design and architecture. At the time, the publication reported Pitt is “interested in spending more time” with Oxman, although it’s unclear if they meant in a romantic or platonic capacity.\n\n4. World War Z 2 has also been announced\n\nHe is working on a sequel to World War Z.| Leon Neal/AFP/Getty Images He is working on a sequel to World War Z.| Leon Neal/AFP/Getty Images\n\nYou will be seeing Pitt playing Gerry Lane once again in World War Z 2. The sequel has been announced but it’s still in the very early stages. He is the only actor tied to the project so far, and there reportedly isn’t a script yet.\n\nDavid Fincher is set to direct it.\n\n5. He is still talking to Angelina Jolie about divorce and custody details\n\nDivorce is never fun or easy, but these two seem to be hashing things out. | Kevin Winter/Getty Images Divorce is never fun or easy, but these two seem to be hashing things out. | Kevin Winter/Getty Images\n\nFor a time, some were doubting that the two were moving forward with the divorce, as a lot of the news about it has been kept from the public. But in August 2017, TMZ reported that the two were still planning on moving forward with the divorce by planning child custody and property settlements.\n\nAccording to E! News, that still seems to be the case, although Pitt is reportedly hoping to rework some of the details surrounding the couple’s current custody agreement, which only allows him visitation rights.\n\n” [Angelina and Brad] are still working out the divorce and the custody details,” a source told the publication. “Brad isn’t happy about the custody arrangement. He wants to see his kids more and struggles with not being able to. Overall, he is doing well though.”\n\n6. They are still co-parenting\n\nThey’re putting their children’s needs before their own. | Dimitrios Kambouris/Getty Images They’re putting their children’s needs before their own. | Dimitrios Kambouris/Getty Images\n\nThe former couple has six children together, so it has been a priority for them to work together for their kids.\n\n“They are in a place where they can put anger or hurt aside to focus on their children and how they plan to co-parent,” a source told Us Weekly in March 2017. “It’s been a difficult time for Angelina, and both are now willing to move forward and begin the next chapters of their lives.”\n\n7. He’s ‘healthier and happier’ now\n\nThe actor seems to be in a good place in recent months. | Jason Merritt/Getty Images The actor seems to be in a good place in recent months. | Jason Merritt/Getty Images Pitt made a rare appearance at the 2018 Oscars in February, prompting many to believe he’s finally ready to re-enter the spotlight. According to E! News, a source said this of Pitt: “The separation was brutal and a very sad time in his life. [Brad] made some important changes and is much better off now. He is happier and healthier. He has an active social life and has rekindled old friendships. He goes out to dinner a lot and enjoys being out doing different things.”\n\n8. He’s focusing on new projects He’s keeping his schedule packed. | Rich Fury/Getty Images He’s keeping his schedule packed. | Rich Fury/Getty Images The actor is keeping himself busy. In addition to working on the World War Z sequel, he also recently signed on to join Leonardo DiCaprio in Quentin Tarantino’s upcoming film about the 1969 Manson family murders, Once Upon a Time in Hollywood. A source told E!, “[Brad] spent a lot of time alone and in private looking at himself and reevaluating what was most important and who he wanted to be. Now he’s in a place where he’s implemented those changes and has a lot more clarity. He’s come out of that dark time and is in a much better place.”\n\nFollow Nicole Weaver on Twitter @nikkibernice.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2015/01/Brad-Pitt-640x420.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Brad-Pitt.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/bradandangelina-640x428.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2015/09/Sienna-Miller-640x427.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/10/angelina-jolie-and-brad-pitt-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2015/01/Brad-Pitt-640x420.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Brad-Pitt-at-a-media-event-640x427.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/pitt-e1507664756798.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/07/brad-pitt-red-carpet.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2015/01/Brad-Pitt-640x420.jpg", "keywords": [], "authors": ["Nicole Weaver"], "canonical_link": "https://www.cheatsheet.com/entertainment/brad-pitt-how-the-actor-is-moving-on-after-split-with-angelina-jolie.html/", "title": "Brad Pitt: How the Actor Is Moving On After Split With Angelina Jolie", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/brad-pitt-how-the-actor-is-moving-on-after-split-with-angelina-jolie.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The married couple made headlines for splitting up, but what will happen next? Here's how Brad Pitt is putting his split with Angelina Jolie behind him.", "og": {"locale": "en_US", "type": "article", "title": "Brad Pitt: How the Actor Is Moving On After Split With Angelina Jolie", "description": "The married couple made headlines for splitting up, but what will happen next? Here's how Brad Pitt is putting his split with Angelina Jolie behind him.", "url": "https://www.cheatsheet.com/entertainment/brad-pitt-how-the-actor-is-moving-on-after-split-with-angelina-jolie.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-16T17:00:44-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2015/01/Brad-Pitt-640x420.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2015/01/Brad-Pitt-640x420.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "divorce", "section": "Entertainment", "published_time": "2018-06-16T16:44:00-04:00", "modified_time": "2018-06-16T17:00:44-04:00"}, "twitter": {"card": "summary_large_image", "description": "The married couple made headlines for splitting up, but what will happen next? Here's how Brad Pitt is putting his split with Angelina Jolie behind him.", "title": "Brad Pitt: How the Actor Is Moving On After Split With Angelina Jolie", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2015/01/Brad-Pitt-640x420.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529181840.0, "source": "https://www.cheatsheet.com", "summary": ""}