{"url": "https://people.com/tv/jordan-rodgers-jojo-fletcher-wedding-planning-update/", "text": "Jordan Rodgers and JoJo Fletcher are enjoying the peace and quiet of life after The Bachelorette.\n\nThe couple, who got engaged on the season 12 finale in 2016, are happily living together in her hometown of Dallas, Texas — and though their fans are eagerly awaiting their nuptials, they’re not in any rush to tie the knot.\n\nGet push notifications with news, features and more.\n\n“It’s something that we continually talk about,” Rodgers, 29, tells PEOPLE. “But I think what’s best right now is we feel no pressure to do it. Think about it: When you get together in an accelerated process, it makes sense to take your time afterwards. We still have no doubts about what we want to do, and we want to get married — but we want to enjoy every moment of it.”\n\n“When you meet in nine weeks, you miss the dating and the courtship and the traveling!” he explains. “And with what we both do for work — she’s grinding, flipping houses, and from August to December I’m traveling a ton — we’re taking our time. But we’re enjoying every moment of it. I imagine at some point in the near future we’re going to sit down and really talk about when and what that’ll look like, but we don’t have a date set yet.”\n\nBut even though they haven’t nailed down any details, the SEC analyst says he and Fletcher, 27, are constantly gathering ideas.\n\n“We have really similar style, so we’ll see pictures and both be like, ‘Oh, I love that. I want to do something like that,’ ” he says. “So she’s going to take the lead [with planning], but her style is so great. There’s nothing that she picks or does that I don’t like. And we see things all the time that give us ideas. We love the outdoors — something with a little rustic feel, lights in the trees.”\n\nImage zoom Jordan Rodgers and JoJo Fletcher Abel Villalobos\n\nAs for televising the big day, Rodgers says it would “take a lot” for him to agree to that\n\n“There’s just something about that day that is so special,” he says. “I’m not saying no — like anything, it’d have to be right. But there’s just something about that day. I’ve always thought the more private it can be, the more special, the more natural, the better. I wouldn’t want my bride to be worried about anything other than us that day. I’ll tell you what, though — the wedding dancing would be great. Because I’ve got some friends that can break it down, so it would make great TV, for sure.”\n\nAnd while the couple have yet to walk down the aisle, Rodgers says Fletcher is already experiencing some baby fever.\n\n“Both of JoJo’s brothers are expecting,” he reveals. “So the baby fever came, and she gives me those eyes. She’s like, ‘I want one!’ I’m like, ‘We’ve got things to do before we get there!’ But also, I feel like she’s going to get her fix. She’ll get to feel what it’s like to be an aunt, and she’ll love that. But you better believe my parents are like, ‘Hey, we want grandkids!’ “\n\n“I always thought I’d have a family similar to mine,” he adds. “So there’s three boys, and my mom is like:,’You can have as many kids as you want, but you’ve got to have three boys first so you know what you put me through!’ I think JoJo and I always say we would like to have three kids, but you never know.”\n\nAnd Rodgers — who, just in time for Valentine’s Day, partnered with Captain Morgan to model their hilarious new Captain’s Posepants boxer briefs — is happy to confirm that the spark is still very much alive with his fiancée.\n\nImage zoom Jordan Rodgers Courtesy Captain Morgan\n\n“We always get lumped into being part of The Bachelor franchise, so every person is like, ‘Oh my God, I’m glad you guys are still together!’ ” he says. “And I just think you can’t lump everybody into the same group, because every relationship is different.”\n\n“You get out of it what you put in, and I frustrated the hell out of her, because early on I knew I had feelings for her,” he adds. “But I was like, ‘Wait a minute. I’m not going to tell you that, because we’re on a boat in Uruguay. I’m going to make sure I sleep on it, and make sure that these feelings are real and I’m not getting caught up in the moment.’ I think we did it the right way, and I think we were honest with each other.”\n\n", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fjordan-rodgers-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Ffletcher-rogers-1333x2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Ffletcher-rogers-1333x2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Ffletcher-rogers-1333x2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/jordan-rodgers-jojo-fletcher-wedding-planning-update/", "title": "Jordan Rodgers on Wedding Planning with JoJo Fletcher", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,JoJo Fletcher,Jordan Rodgers,News,The Bachelorette,TV", "news_keywords": "Exclusive,JoJo Fletcher,Jordan Rodgers,News,The Bachelorette,TV", "description": "\"We're taking our time, but we're enjoying every moment of it,\" Jordan Rodgers tells PEOPLE", "og": {"title": "The Bachelorette's Jordan Rodgers on Life with JoJo Fletcher: Wedding Planning and Baby Fever!", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/jordan-rodgers-jojo-fletcher-wedding-planning-update/", "description": "Jordan Rodgers and JoJo Fletcher are enjoying the peace and quiet of life after&nbsp;The Bachelorette. The couple, who got engaged on the season 12 finale&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Ffletcher-rogers-1333x2000.jpg", "width": 1333, "height": 698}}, "pinterest": {"url": "https://people.com/tv/jordan-rodgers-jojo-fletcher-wedding-planning-update/", "description": "\"We're taking our time, but we're enjoying every moment of it,\" Jordan Rodgers tells PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Ffletcher-rogers-1333x2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/jordan-rodgers-jojo-fletcher-wedding-planning-update/", "title": "The Bachelorette's Jordan Rodgers on Life with JoJo Fletcher: Wedding Planning and Baby Fever!", "description": "\"We're taking our time, but we're enjoying every moment of it,\" Jordan Rodgers tells PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Ffletcher-rogers-1333x2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}