{"url": "time.com/4903006/donald-trump-charloteesville-press-conference-celebrity-reactions/", "text": "At a press conference in the lobby of Trump Tower on Tuesday, President Donald Trump doubled down on his original comments that “many sides” were responsible for the violent rallies in Charlottesville, VA. where a man believed to be a white supremacist allegedly drove his car into a crowd of counter demonstrators, killing a woman in the process.\n\nDuring the press conference, Trump defended a procession that included torch-carrying white nationalists who chanted “blood and soil” and “Jews will not replace us,” by reducing them to “people protesting very quietly the taking down of statue of Robert E. Lee.”\n\nFollowing his remarks, the President received backlash for his comments, especially online where the public sounded off on his press conference. Some of his most vocal detractors on the Internet were high-profile celebrities who used their platform to not only critique the President but to show support for communities who were marginalized by his stance.\n\nSee celebrity responses to Trump’s Charlottesville press conference below.\n\nNoted critic of Trump Chrissy Teigen took to her Twitter to sound off on the President’s comments.\n\nWhile her husband John Legend stated that he supported the removal of the statue that sparked the rallies.\n\nLady Gaga asked her followers what they thought of Trump’s comments.\n\nLeBron James pointed out that racism and hate have existed long before Donald Trump was president.\n\nChris Evans couldn’t get over the press conference remarks.\n\nQuestlove had a Captain America-themed response to Evans’ reaction.\n\nMandy Moore had similar feelings.\n\nWhile John Mayer called on the power of the people.\n\nDemi Lovato bristled at Trump’s defense of those linked to white nationalists and neo-Nazis.\n\nBette Midler used her trademark wit to critique Trump’s statements.\n\nWhile Chelsea Handler called on presidents past to hold Donald Trump accountable.\n\nLin-Manuel Miranda issued a call to action.\n\nAs did Mark Ruffalo.\n\nElizabeth Banks agreed with their thinking.\n\nAs did Don Cheadle.\n\nJ.K. Rowling wryly found a silver lining.\n\nWhile Mia Farrow pointed to this press conference as part of a larger problem.\n\nBarbra Streisand felt that the president was showing his true colors.\n\nMichael Moore led a protest in New York City that Mark Ruffalo, Zoe Kazan, and Olivia Wilde participated in.\n\nJessica Chastain and Kirk Franklin offered encouragement to those who were made to feel less than by Trump’s remarks.\n\nGabrielle Union called for action, not silence.\n\nZach Braff thought that the President was relying on “alternative facts.”\n\nWhile Alyssa Milano pointed out that the President should not make false comparisons.\n\nAva DuVernay had a visceral response to the President’s remarks.\n\nGeorge Takei made a case for the alt-left.\n\nSarah Silverman had a message for the president.\n\nGigi Hadid sounded off on what she felt were limitations to the First Ammendment.\n\nKumail Nanjiani questioned how someone could support the ideas that the President expressed.\n\nClay Aiken rescinded his former view that Donald Trump wasn’t racist.\n\nWhile Camila Cabello called for impeachment.\n\nDamien Chazelle joined Twitter just to sound off on how he felt about Trump’s comments.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Cady Lang at cady.lang@timemagazine.com.", "images": ["https://api.time.com/wp-content/uploads/2017/08/donald-trump-charlottesville-press-conference-celebrity-reactions.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/08/donald-trump-charlottesville-press-conference-celebrity-reactions.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Cady Lang"], "canonical_link": "https://time.com/4903006/donald-trump-charloteesville-press-conference-celebrity-reactions/", "title": "Celebrities React Donald Trump Defending White Nationalists", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Donald Trump Charlottesville, Donald Trump press conference, Donald Trump Nazis, Donald Trump racist, Donald Trump white nationalists, Donald Trump white supremacy, Charlottesville Va, Donald Trump on Charlottesville Va", "news_keywords": "Donald Trump Charlottesville, Donald Trump press conference, Donald Trump Nazis, Donald Trump racist, Donald Trump white nationalists, Donald Trump white supremacy, Charlottesville Va, Donald Trump on Charlottesville Va", "description": "Celebrities ranging from Chrissy Teigen to Lady Gaga are sounding off after Donald Trump's press conference about Charlottesville, Va.", "og": {"title": "Celebrities Sound Off After Trump Defends White Nationalists", "type": "article", "site_name": "Time", "url": "https://time.com/4903006/donald-trump-charloteesville-press-conference-celebrity-reactions/", "description": "From Chrissy Teigen to Lady Gaga", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/08/donald-trump-charlottesville-press-conference-celebrity-reactions.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4903006/donald-trump-charloteesville-press-conference-celebrity-reactions/", "description": "Celebrities ranging from Chrissy Teigen to Lady Gaga are sounding off after Donald Trump's press conference about Charlottesville, Va.", "media": "https://api.time.com/wp-content/uploads/2017/08/donald-trump-charlottesville-press-conference-celebrity-reactions.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4903006/donald-trump-charloteesville-press-conference-celebrity-reactions/", "title": "Celebrities Sound Off After Trump Defends White Nationalists", "description": "From Chrissy Teigen to Lady Gaga", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/08/donald-trump-charlottesville-press-conference-celebrity-reactions.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}