{"url": "https://abc.go.com/shows/dancing-with-the-stars/news/updates/dancing-with-the-stars-2017-fantasy-league", "text": "The Dancing with the Stars Fantasy League is here! Fans can make picks on the Dancing with the Stars 2017 cast for bragging rights and the chance to win a trip for four to Aulani, a Disney Resort and Spa in Ko Olina, Hawai'i, as well as other exclusive prizes. No purchase necessary! Visit ABC.com/dfl to see how to play and check out the official rules. Join the league now and get ready for some fantasy fun all fall long beginning with the Dancing with the Stars Season 25 Premiere MONDAY, SEPTEMBER 18 8|7c on ABC.\n\nWatch the How to Play Video to Learn More!\n\nJOIN THE DWTS FANTASY LEAGUE RIGHT HERE, RIGHT NOW!\n\nWho's on Dancing with the Stars? Find out here!\n\nBARBARA CORCORAN (pro partner Keo Motsepe) - Barbara Corcoran has been an investor/Shark for the past nine seasons on Shark Tank. Years ago, Barbara borrowed $1,000 to start a tiny real estate company in New York City. She would parlay that $1,000 loan into a $5 billion real estate business. Now Barbara is swimming into uncharted waters with partner Keo to add the coveted Mirrorball trophy to her collection of successes. SEE BARBARA CORCORAN'S EXTENDED BIO ON HER CAST PAGE.\n\nDEBBIE GIBSON (pro partner Alan Bersten) - From singer, songwriter and musician to actress and dancer, Debbie Gibson embodies what it truly means to be an entertainer. A music prodigy, Debbie exploded on the Billboard Pop Charts at the tender age of 16 with the self-penned \"Only in My Dreams.\" Now she has dreams of dazzling us in the ballroom with partner Alan Bersten on Season 25 of Dancing with the Stars. SEE DEBBIE GIBSON'S EXTENDED BIO ON HER CAST PAGE.\n\nMEET DEBBIE GIBSON\n\nDEREK FISHER (pro partner Sharna Burgess) - In 1996, Derek Fisher was drafted by the Los Angeles Lakers, with whom he won 5 NBA Championships. He is the all-time NBA record holder in playoff games played and served as president of the National Basketball Players Association (NBPA). Now Derek hopes to score some different points in the ballroom with partner Sharna Burgess by his side. SEE DEREK FISHER'S EXTENDED BIO ON HIS CAST PAGE and CLICK HERE TO MEET DEREK FISHER IN THIS NEW VIDEO!\n\nDREW SCOTT (pro partner Emma Slater) - Drew Scott and his twin brother, Jonathan, host multiple top-rated HGTV series, including the Emmy-nominated Property Brothers, Brother vs. Brother and Property Brothers at Home. Their shows are watched by millions of fans in over 150 countries. Now he hope to make the Mirrorball trophy his next piece of property with partner Emma Slater. SEE DREW SCOTT'S EXTENDED BIO ON HIS CAST PAGE. and CLICK HERE TO MEET DREW SCOTT IN THIS NEW VIDEO!\n\nFRANKIE MUNIZ (pro partner Witney Carson) - Frankie Muniz is an actor, musician, writer, producer, race car driver and band manager. He is best known for playing the title character in the FOX comedy Malcolm in the Middle, which earned him an Emmy nomination, two Golden Globe Award nods and The Hollywood Reporter's \"Young Star Award.\" Now he's a Dancing star with partner Witney Carson. SEE FRANKIE MUNIZ'S EXTENDED BIO ON HIS CAST PAGE.\n\nMEET FRANKIE MUNIZ\n\nJORDAN FISHER (pro partner Lindsay Arnold) – Jordan Fisher's take as Doody in FOX's Emmy-winning broadcast of Grease: LIVE earned him critical acclaim and was deemed the show's breakout star by MTV and People Magazine. That spring, he released his first single, \"All About Us,\" which was the #2 most added song and a top 30 hit at pop radio. SEE JORDAN FISHER'S EXTENDED BIO ON HIS CAST PAGE.\n\nLINDSEY STIRLING (pro partner Mark Ballas) – Acclaimed violinist Lindsey Stirling used her classical violin training to leap through the music industry with almost 10 million YouTube subscribers, over 1.9 billion views on her YouTube channel, two Billboard Music Awards and sold out tours worldwide. Now Lindsey is putting down the violin for a spell to step onto the dance floor with partner Mark Ballas. SEE LINDSEY STIRLING'S EXTENDED BIO ON HER CAST PAGE.\n\nNICK LACHEY (pro partner Peta Murgatroyd) – Nick Lachey, a multi-platinum recording artist, television personality and businessman, first rose to stardom as the front-man of the popular band 98 Degrees, selling over 10 million albums worldwide and charting several top-40 hits. In 2003 he launched a successful solo music career and segued into television when he starred on MTV's Newlyweds. SEE NICK LACHEY'S EXTENDED BIO ON HIS CAST PAGE.\n\nMEET NICK LACHEY\n\nNIKKI BELLA (pro partner Artem Chigvintsev) - Nikki Bella is a philanthropist, YouTuber, motivational speaker and the longest-reigning Divas Champion. She and her twin sister, Brie, stirred up the WWE, culminating with a Divas title reign apiece in 2011 and 2012. As a pivotal member of the SmackDown LIVE roster, Bella continues to test the limits of competition. She'll be doing the same in the ballroom with partner Artem Chigvintsev. SEE NIKKI BELLA'S EXTENDED BIO ON HER CAST PAGE.\n\nMEET NIKKI BELLA\n\nSASHA PIETERSE (pro partner Gleb Savchenko) - Sasha Pieterse is best known for her lead role on Freeform's Pretty Little Liars, which wrapped its seventh and final season earlier this year. Despite being only 12 when she was cast, she held her own as the youngest regular cast member. Sasha has also launched her singing career releasing four singles. Now she begins a new ballroom adventure with partner Gleb Savchenko. SEE SASHA PIETERSE'S EXTENDED BIO ON HER CAST PAGE. and CLICK HERE TO MEET SASHA PIETERSE IN THIS NEW VIDEO!\n\nTERRELL OWENS (pro partner Cheryl Burke) - Terrell Owens is one of the most exciting and electrifying players to ever play pro football, with 1078 Receptions, 15,935 yards and 153 touchdowns during the span of his 15-year career. Terrell is also a respected and best-selling author, penning a children's book, Little T Learns to Share and a fitness book, T.O.'s Finding Fitness. Now Terrell is tackling a brand new challenge with partner Cheryl Burke. SEE TERRELL OWENS' EXTENDED BIO ON HIS CAST PAGE.\n\nVANESSA LACHEY (pro partner Maksim Chmerkovskiy) - As the winner of the 1998 Miss Teen USA pageant, Vanessa Lachey (then Minnillo) was awarded the title of Miss Congeniality 1998. She went on to serve as co-host for Total Request Live and MTV Hits as well as taking on many other hosting duties, including two seasons as the New York-based correspondent for Entertainment Tonight. Now Vanessa will be entertaining us in the ballroom with partner Maksim Chmerkovskiy. SEE VANESSA LACHEY'S EXTENDED BIO ON HER CAST PAGE.\n\nMEET VANESSA LACHEY\n\nVICTORIA ARLEN (pro partner Valentin Chmerkovskiy) - At the age of 11, lifelong swimmer Victoria Arlen fell ill with a rare viral disease that left her without use of her legs for nearly 10 years. Her health improved tremendously and, not only did she participate in four events at the London Paralympic Games, but she also took home one Gold and three Silver medals while also setting a world record in in the 100-meter free. Now Victoria is taking on yet another challenge in the ballroom with partner Valentin Chmerkovskiy. SEE VICTORIA ARLEN'S EXTENDED BIO ON HER CAST PAGE.\n\nMEET VICTORIA ARLEN\n\nCHECK OUT POLLS, TRIVIA, VIDEOS & MORE IN THE 25-DAY COUNTDOWN TO THE SEASON 25 PREMIERE", "images": ["https://assets.cdn.watchdisneyfe.com/delta/assets/abc/abc.png", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/showimages/086101c1a6a087ef587c5debf86ba884/350x117-Q80_086101c1a6a087ef587c5debf86ba884.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/close.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/search.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/facebook.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/twitter.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2067676/5ee41c8f489c7956e7f18dd7fe2c1f7f/1000x400-Q90_5ee41c8f489c7956e7f18dd7fe2c1f7f.jpg"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2067676/5ee41c8f489c7956e7f18dd7fe2c1f7f/1000x400-Q90_5ee41c8f489c7956e7f18dd7fe2c1f7f.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.com/shows/dancing-with-the-stars/news/updates/dancing-with-the-stars-2017-fantasy-league", "title": "Dancing with the Stars 2017 Fantasy League: Join Now & Make Your Picks", "meta_data": {"fb": {"app_id": 137585909851}, "twitter": {"card": "summary_large_image", "site": "@dancingabc", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2067676/5ee41c8f489c7956e7f18dd7fe2c1f7f/1000x400-Q90_5ee41c8f489c7956e7f18dd7fe2c1f7f.jpg"}, "og": {"url": "https://abc.com/shows/dancing-with-the-stars/news/updates/dancing-with-the-stars-2017-fantasy-league", "app_id": 137585909851, "site_name": "ABC", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2067676/5ee41c8f489c7956e7f18dd7fe2c1f7f/1000x400-Q90_5ee41c8f489c7956e7f18dd7fe2c1f7f.jpg", "description": "The Dancing with the Stars Fantasy League is here! Fans can make picks for bragging rights and the chance to win a trip for four to Aulani, a Disney Resort and Spa in Ko Olina, Hawaii, as well as other exclusive prizes. No purchase necessary!", "title": "Dancing with the Stars 2017 Fantasy League: Join Now & Make Your Picks | Dancing with the Stars", "locale": "en_US"}, "keywords": "Dancing with the Stars 2017 Fantasy League: Join Now & Make Your Picks, Dancing with the Stars blogs", "description": "The Dancing with the Stars Fantasy League is here! Fans can make picks for bragging rights and the chance to win a trip for four to Aulani, a Disney Resort and Spa in Ko Olina, Hawaii, as well as other exclusive prizes. No purchase necessary!", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "msApplication-ID": "App", "msapplication-TileColor": "#2D2D2D", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileImage": "//cdn1.edgedatg.com/aws/abc/brand/fall2018/favicon_ie10.png", "apple-itunes-app": "app-id=364191819, app-argument=https://abc.com/watch-live", "google-site-verification": "5ojqqxU4pdyoa-4TgjCukgNv4eEl-8TGQZPsRhznWXc", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}