{"url": "http://www.nytimes.com/2008/02/26/us/politics/26text-debate.html?_r=1&adxnnl=1&oref=slogin&pagewanted=all&adxnnlx=1204139772-dnxW+xyD4n9RmqZLgdQ3Ig", "text": "This is rightly a big issue in Ohio. And I have laid out my criticism, but in addition my plan, for actually fixing NAFTA. Again, I have received a lot of incoming criticism from Senator Obama. And the Cleveland Plain Dealer examined Senator Obama's attacks on me regarding NAFTA and said they were erroneous. So I would hope that, again, we can get to a debate about what the real issues are and where we stand because we do need to fix NAFTA. It is not working. It was, unfortunately, heavily disadvantaging many of our industries, particularly manufacturing. I have a record of standing up for that, of chairing the Manufacturing Caucus in the Senate, and I will take a tough position on these trade agreements.\n\nMR. WILLIAMS: Senator, thank you.\n\nBefore we turn the questioning over to Tim Russert, Senator Obama.\n\nSEN. OBAMA: Well, I think that it is inaccurate for Senator Clinton to say that she's always opposed NAFTA. In her campaign for Senate, she said that NAFTA, on balance, had been good for New York and good for America. I disagree with that. I think that it did not have the labor standards and environmental standards that were required in order to not just be good for Wall Street but also be good for Main Street. And if you travel through Youngstown and you travel through communities in my home state of Illinois, you will see entire cities that have been devastated as a consequence of trade agreements that were not adequately structured to make sure that U.S. workers had a fair deal.\n\nNow, I think that Senator Clinton has shifted positions on this and believes that we should have strong environmental standards and labor standards, and I think that's a good thing. But you know, when I first moved to Chicago in the early '80s and I saw steelworkers who had been laid off of their plants -- black, white, and Hispanic -- and I worked on the streets of Chicago to try to help them find jobs, I saw then that the net costs of many of these trade agreements, if they're not properly structured, can be devastating.\n\nAnd as president of the United States, I intend to make certain that every agreement that we sign has the labor standards, the environmental standards and the safety standards that are going to protect not just workers, but also consumers. We can't have toys with lead paint in them that our children are playing with. We can't have medicines that are actually making people more sick instead of better because they're produced overseas. We have to stop providing tax breaks for companies that are shipping jobs overseas and give those tax breaks to companies that are investing here in the United States of America.\n\nAnd if we do those things, then I believe that we can actually get Ohio back on the path of growth and jobs and prosperity. If we don't, then we're going to continue to see the kind of deterioration that we've seen economically here in this state.\n\nMR. RUSSERT: I want to ask you both about NAFTA because the record, I think, is clear. And I want to -- Senator Clinton. Senator Obama said that you did say in 2004 that on balance NAFTA has been good for New York and America. You did say that. When President Clinton signed this bill -- and this was after he negotiated two new side agreements, for labor and environment -- President Clinton said it would be a force for economic growth and social progress. You said in '96 it was proving its worth as free and fair trade. You said that -- in 2000 -- it was a good idea that took political courage. So your record is pretty clear.\n\nBased on that, and which you're now expressing your discomfort with it, in the debate that Al Gore had with Ross Perot, Al Gore said the following: \"If you don't like NAFTA and what it's done, we can get out of it in six months.", "images": ["https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png"], "top_img": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "keywords": [], "authors": [], "canonical_link": "https://www.nytimes.com/2008/02/26/us/politics/26text-debate.html", "title": "The Democratic Debate in Cleveland", "meta_data": {"article": {"published": "2008-02-26T14:20:00.000Z", "modified": "2008-02-27T22:55:10.000Z", "section": "U.S.", "tag": "Debating", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 1194750766534, "nyt_uri": "nyt://article/8f3d61b8-f650-530c-acae-5a9970d51514", "pubp_event_id": "pubp://event/c79784034cc84bfe816948cc0f7907ec", "description": "The following is a transcript of the Democratic presidential debate on MSNBC in Cleveland, Ohio, as provided by the Federal News Service and CQ Transcriptions via The Associated Press.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "thumbnail": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "news_keywords": "Hillary Clinton,Barack Obama,2008 Presidential Election,Debate", "pdate": 20080226, "og": {"url": "https://www.nytimes.com/2008/02/26/us/politics/26text-debate.html", "type": "article", "title": "The Democratic Debate in Cleveland", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "description": "The following is a transcript of the Democratic presidential debate on MSNBC in Cleveland, Ohio, as provided by the Federal News Service and CQ Transcriptions via The Associated Press."}, "twitter": {"url": "https://www.nytimes.com/2008/02/26/us/politics/26text-debate.html", "title": "The Democratic Debate in Cleveland", "description": "The following is a transcript of the Democratic presidential debate on MSNBC in Cleveland, Ohio, as provided by the Federal News Service and CQ Transcriptions via The Associated Press.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/8f3d61b8-f650-530c-acae-5a9970d51514"}}, "site": "@nytimes"}, "CG": "us", "SCG": "politics", "PT": "article", "PST": "Text", "url": "https://www.nytimes.com/2008/02/26/us/politics/26text-debate.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/8f3d61b8-f650-530c-acae-5a9970d51514", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2008/02/26/us/politics/26text-debate.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2008/02/26/us/politics/26text-debate.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1203955200.0, "source": "http://www.nytimes.com", "summary": ""}