{"url": "www.washingtonpost.com/lifestyle/inside-melania-trumps-complicated-white-house-life-separate-schedules-different-priorities/2018/05/06/60f6f07e-4703-11e8-9072-f6d4bc32f223_story.html", "text": "Amid the noise and churn of the Trump administration — most recently about how the president paid money to silence Stormy Daniels — Melania Trump has settled into a quieter routine, often apart from the president, raising their son and carving out a place for herself in a most untraditional White House.\n\nAD\n\nThe first lady has not directly addressed the affairs that Daniels and another woman, Karen McDougal, said they had with her husband. But she has noticeably begun to raise her profile, independent from the president’s, and she has called a news conference in the White House Rose Garden on Monday, a public appearance that would have been almost unthinkable just a few months ago.\n\nAD\n\n“Her focus all along has been children, and this launch is meant to formalize what her role will be for the next three to seven years,” said Stephanie Grisham, Melania’s spokeswoman. She said the first lady will devote the rest of the Trump presidency to the issues children face today and their well-being.\n\nIn recent weeks, the first lady has been at the center of more high-profile events than during the entire previous year — including attending the funeral of former first lady Barbara Bush solo.\n\nAD\n\nPolitical marriages tend to be more complicated than most, but it’s striking that the Trumps make so little effort to project a more united front. Although both are keenly aware of the power of visual images, some of their memorable moments together are awkward: Melania swatting his hand away on a tarmac, and several times caught on camera seeming to resist his outreach.\n\nAD\n\n“She is a dignified, private person, and she’ll deal with her personal life in private and it’s no one’s business,” said Stephanie Winston Wolkoff, a longtime friend of Melania’s. “They are not that couple that holds hands just because; she is old-world European and it’s not who she is.”\n\nIt is unusual to see a candid shot of the president enjoying an unplanned moment with his wife, or even with Barron, the first young son in the White House since John F. Kennedy Jr. in the early 1960s.\n\nAD\n\nThe Trumps are often apart even during their free time, according to several people who know the couple’s schedules. At Mar-a-Lago on holidays and weekends, the president golfs or dines with politicians, business executives and media personalities on the patio, while Melania is often nowhere to be seen. According to several current and former aides, the president and first lady often do not eat together in the White House either.\n\nAD\n\n“They spend very little to no time together,” said one longtime friend of the president.\n\nGrisham said the president and Melania do spend time with each other. “Aside from the president’s solo trips, the family spends most evenings together.” She also played down the headlines about Trump’s alleged affairs and said Melania “is focused on being a mom. She’s focused on being a wife, and she’s focused on her role as first lady. And that’s it. The rest is just noise.”\n\nAD\n\nA senior West Wing official, when asked about the couple’s separate schedules and bedrooms, declined to comment, saying it wasn’t official business.\n\nMelania grants few interviews and declined to speak for this article, but during the campaign she told The Washington Post that she and her husband are “very independent,” adding, “We give ourselves and each other space.”\n\nAD\n\nAccording to several people who know the couple, that space appears to have grown wider under the White House roof — especially since Daniels, a porn star whose real name is Stephanie Clifford, as well as Karen McDougal, a Playboy model, publicly talked about their alleged affairs with Trump during his marriage to Melania. Daniels was paid $130,000 during the campaign by a Trump attorney to stop talking about the affair.\n\nAD\n\nLast week, Trump tweeted that he repaid the attorney to “stop the false and extortionist accusations made by her about an affair.” Rudolph W. Giuliani, one of Trump’s lawyers, told NBC News that payment was made “to prevent personal embarrassment and heartache to [Trump’s] wife.”\n\nAnother awkward exchange happened April 26 with Trump calling into “Fox & Friends,” announcing that it was Melania’s birthday, and then suddenly talking about Daniels. Asked on the same TV show what he had gotten Melania for her birthday, he paused: “Maybe, I didn’t get her so much. I got her a beautiful card, you know I’m very busy to be running out looking for presents.”\n\nAD\n\nAccording to several White House staff members, Melania has erected a de facto wall between the East Wing, where she is renovating her office and enjoying growing popularity, and the West Wing, where her husband and Ivanka Trump, her eldest stepdaughter, have offices.\n\nAD\n\nWhile she goes to the West Wing for official duties, she does not walk down the hall, pop her head in and see how the president’s day is going.\n\n“She seldom sets foot in the West Wing,” said one person with firsthand knowledge.\n\nYet, many political analysts believe that Trump will need Melania at his side if he wants to win again in 2020.\n\nThe Trumps have broken the traditional mold of a presidential family from the moment he was sworn in. While Melania stood beside the president at the Capitol, his two ex-wives, Ivana Trump and Marla Maples, sat in the crowd.\n\nAD\n\nTrump is the only president to be married three times. Melania is 48, and the president is 71.\n\nAD\n\nRather than move into the White House with her husband, Melania stayed in New York for six months to allow Barron to finish his school year there. That delay initially put Melania at a disadvantage, according to a friend who said the rhythm of the White House had already been established, and left her out of the mix. Some staff positions from the first lady’s office were diverted to the West Wing — including to support Ivanka, who is a presidential adviser, according to a person close to the first lady.\n\nIvanka, 36, and Melania, both former models, do not have a close relationship and are very different from one another, several people who know them both said. Grisham said it was not only wrong to say Melania was not close to her stepdaughter but “hurtful.”\n\nAD\n\nNoticeably, Melania’s presence is growing as Ivanka’s fades.\n\nAD\n\nLast year, an official White House statement described Ivanka as holding an “unprecedented role for a first daughter” and she has at times taken on the duties of a first lady. Ivanka acts as the president’s policy adviser, has traveled the globe as her father’s surrogate, and sat down with world leaders at the White House. But recently her public profile has been reduced.\n\nFirst ladies often have had considerable influence, as an informal adviser to the president and the person closest to him. They have been the hidden hand in policy decisions and hiring and firings. And, they can command attention for causes. Most recently, Laura Bush established the National Book Festival and used her foreign trips to focus concern on HIV/AIDS, and Michelle Obama promoted girls’ education globally and started a movement here to get children exercising and eating healthier.\n\nAD\n\nMelania’s staff is unusually small; with 10 people, it is about half the size of Michelle Obama’s at its peak.\n\nMelania has borrowed books from the White House Historical Association to study the first lady’s role and plans to outline on Monday a new initiative concerning children.\n\nSeveral polls have shown that as she becomes more visible, her popularity is rising. In many ways the image she projects is the least like Trump’s of all the Trumps.\n\nThe president organizes big rallies; Melania often holds meetings with just a few people. Her husband rails against family-based “chain migration”; she is from Slovenia and now her parents, also immigrants, have become legal residents here, too.\n\nThe president mocks political enemies on Twitter with his derogatory nicknames such as “Cryin’ Charles E. Schumer” or “Cheatin’ Obama”; Melania calls cyberbullying an “evil” and organized a White House conference to try to stop it.\n\nMelania has complained that she doesn’t deserve the mean comments she has read about herself online. She has been heard saying that she knows her husband has contributed to the combative nature of today’s online chatter, and one associate said she has persisted with her anti-cyberbullying efforts despite White House advice that she pick any other issue to champion.\n\nIn March, Melania invited top executives from Twitter, Facebook and other tech companies, along with nonprofits working on Internet safety, to the White House to hold a meeting on the issue.\n\n“I am well aware that people are skeptical of me discussing this topic,” she told the group. “I have been criticized for my commitment to tackling this issue, and I know that will continue. But it will not stop me for doing what I know is right,” she said in opening remarks. “We have to find a better way to talk to each other, to disagree with each other, to respect each other.”\n\nStephen Balkam, the founder and CEO of the Family Online Safety Institute, was seated at a table with the first lady. “It was a pretty remarkable opening,” he said. “I was pleased that she addressed the elephant in the room.”\n\nMelania has not always been willing to go in a different direction from her husband. In 2011, when Trump was one of the leading \"birthers\" challenging the validity of President Obama's birth certificate and U.S. citizenship, Melania backed him up.\n\n“What’s this with the birth certificate obsession? Did he ask to see yours when you met him?” asked TV interviewer Joy Behar.\n\n“Do you want to see President Obama’s birth certificate or not?” Melania responded. She also said what Obama had made public to date was “different” from a birth certificate. “It would be very easy if President Obama would just show it,” she said.\n\n“It is not only Donald who wants to see it. It’s the American people . . . they want to see that.”\n\nBut as first lady, she has publicly praised Michelle Obama and laughed alongside President Obama, who sat beside her at Barbara Bush’s funeral last month in Houston. She also shared the pew with Bill and Hillary Clinton — two favorite targets of her husband’s criticism.\n\nMelania received a warm reception from the former presidents and first ladies. Photos of them all together — the Obamas, the Clintons, George W. Bush, Laura Bush and George H.W. Bush — show Melania beaming.\n\nShe has also traveled apart from her husband — even when they are going to the same destination. In February, hours after the New Yorker published a story about Trump’s alleged affair with McDougal, the Playboy model, Melania did not walk with Trump across the White House’s South Lawn to board Marine One.\n\nBoth Trumps were heading to Mar-a-Lago for the weekend, but instead of making the very public walk across the White House lawn with her husband to the helicopter, she drove separately to the Maryland military airport to catch Air Force One. Grisham told reporters at the time that given the first lady’s schedule, it was just easier for the couple to meet at the plane. When her motorcade pulled up, White House press aides shouted at journalists to get off the plane until she boarded. No photos were allowed of her arrival.\n\nAs first ladies often are, Melania is more popular than her husband. But two friends of the couple say the president, who pays close attention to his poll numbers, also fixates on hers. Her approval rating was 47 percent to his 40 percent in a January CNN poll.\n\nGrisham said Melania takes her role seriously and is careful to coordinate with Sarah Huckabee Sanders, the White House press secretary. “Basically, we’re like, ‘Okay, we’ll put this out,’ or, ‘We’ll wait for you.’ . . . We don’t want to conflict with the president’s message of the day, nor do we want him to do that to us.”\n\nBut, she added, “the 24/7 social media-cable news cycle and a West Wing that’s very active . . . perhaps overshadows some of the good work she’s doing.”\n\nTrump described Melania to supporters in a recent email as his “rock and foundation.” “I wouldn’t be the man I am today without her by my side,” he said. “My BEAUTIFUL, kindhearted and exceptional wife.”\n\n“They have an unspoken affinity,” said Winston Wolkoff, whose official advisory arrangement in the first lady’s office ended earlier this year amid headlines about inauguration spending and the White House’s move to end informal contracts.\n\nAnother person close to the president said they had heard him call Melania when he travels and “she is someone he relies on and listens to.”\n\nMelania has said she sometimes offers advice to her husband — including about his tweets — but that doesn’t mean he takes it.\n\nDuring one dinner in the White House in late 2017, Melania told the president that he should be more concerned about the investigation led by special counsel Robert S. Mueller III and that his legal team wasn’t protecting him, according to a person who attended the dinner. Trump disagreed, this person said, insisting that the investigation was going to exonerate him and that he had great lawyers. Grisham disputed this account, saying: “Your anonymous sources are wrong.” Since that dinner, two of three lawyers have left Trump’s Russia team.\n\nSeveral people in the White House, who like others interviewed for this story did not want to be quoted by name discussing the first couple’s relationship, said Melania does not trust some members of her husband’s staff. Two people in a position to know said she particularly disliked former chief strategist Stephen K. Bannon and told her husband so, and she was upset about the abrupt dismissal of John McEntee, Trump’s young personal assistant. He left over a security clearance issue but is now working on Trump’s reelection effort.\n\nTrump insisted on a prenuptial agreement when he married Melania 13 years ago, just as he had with his two previous wives. The terms have never been made public. A person close to Melania noted that the prenuptial was signed before his political career, which forced her to take on a whole new role and one, as a friend said, that is “unpaid.”\n\n\"Free Melania!\" continues to be a popular meme. Late-night TV comedy skits portray her as trapped inside the White House, unhappy.\n\nFor months, a persistent rumor has floated around Washington that Melania doesn’t really live in the White House and stays in a house with her parents and Barron near his suburban Washington school.\n\n“It’s 1,000 percent false. We laugh at it all the time,” Grisham said.\n\n“It’s an urban legend,” said Rickie Niceta Lloyd, the White House social secretary.\n\nMelania is exceedingly close to her parents and her son, Barron, who also speaks Slovenian with his grandparents. When she is out of the public eye, she is often with her family, friends say.\n\nHer office declined to say where her parents live, or even whether they keep a room at the White House, as Michelle Obama’s mother did.\n\nMelania does spend a lot of time in the White House, according to people who work there, and has a very good relationship with the permanent household staff of nearly 100 that includes chefs, florists and butlers, and she oversees the residence as well as the state floor.\n\nFriends say she is a perfectionist who oversees the tiniest details of events in which she is involved.\n\nShe enjoys putting her personal mark on the historic home and has redesigned the family living quarters. While her husband favors the lavish gold-and-glitz decor of their Trump Tower penthouse, Melania has picked neutral colors.\n\n“It is a very comfortable and calming place to be in,” Winston Wolkoff said.\n\nStill, Trump often waves friends up to the residence after holiday parties or social gatherings and gives tours of the Lincoln Bedroom, where he remarks on how tall the former president was while showing off the Gettysburg Address and other features of the home. Melania has, however, told confidantes she wants to keep the residence private.\n\nAlthough English is not her first language, she is getting more used to public speaking. She has also begun releasing videos of her work.\n\nThe latest highly produced video shows her preparing for the recent state dinner for French President Emmanuel Macron and has been viewed by nearly 1.5 million people.\n\nTwenty-two years after first coming to the United States to model, she is now one of the most-photographed women in the world.\n\nPaolo Zampolli, who helped arrange for Melania to work in the U.S. fashion industry and sees her in the White House, said Melania is blossoming.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/47129288-549e-43ef-88ef-932b32346185.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/dac07c79-53b6-4b3b-95da-7d79619a3263.png&w=90&h=90", "https://www.washingtonpost.com/resizer/L9cp2Wm-9VFJrVMuonJ1F119uWQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NW6NPFCXZEI6PBALKEQCMMM5U4.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NW6NPFCXZEI6PBALKEQCMMM5U4.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/91714749-fd0b-49b1-a2e5-6fa1578c490e.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/L9cp2Wm-9VFJrVMuonJ1F119uWQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NW6NPFCXZEI6PBALKEQCMMM5U4.jpg", "keywords": [], "authors": ["Mary Jordan", "National Political Correspondent", "Emily Heil", "Co-Author Of The Reliable Source", "Josh Dawsey", "Reporter Covering The White House"], "canonical_link": "https://www.washingtonpost.com/lifestyle/inside-melania-trumps-complicated-white-house-life-separate-schedules-different-priorities/2018/05/06/60f6f07e-4703-11e8-9072-f6d4bc32f223_story.html", "title": "Inside Melania Trump’s complicated White House life: Separate schedule, different priorities", "meta_data": {"description": "Amid the chaos of her husband’s presidency, the first lady raises her profile and defines her role.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/lifestyle/inside-melania-trumps-complicated-white-house-life-separate-schedules-different-priorities/2018/05/06/60f6f07e-4703-11e8-9072-f6d4bc32f223_story.html", "image": "https://www.washingtonpost.com/resizer/L9cp2Wm-9VFJrVMuonJ1F119uWQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NW6NPFCXZEI6PBALKEQCMMM5U4.jpg", "title": "Inside Melania Trump’s complicated White House life: Separate schedule, different priorities", "description": "Amid the chaos of her husband’s presidency, the first lady raises her profile and defines her role."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Inside Melania Trump’s complicated White House life: Separate schedule, different priorities", "description": "Amid the chaos of her husband’s presidency, the first lady raises her profile and defines her role."}, "last_updated_date": "2018-05-21T16:39:10.990Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1525536000.0, "source": "http://www.washingtonpost.com", "summary": ""}