{"url": "www.npr.org/sections/13.7/2011/03/30/134950294/recognizing-the-potential-and-perils-of-a-limitless-mind", "text": "Recognizing The Potential And Perils Of A 'Limitless' Mind\n\nEnlarge this image istockphoto istockphoto\n\nImagine a pill that would give you tremendous intellectual power, triggering an avalanche of neuronal activity, igniting your brain into unparalleled awareness. You take the little thing and, for a few hours, you are a god-like creature. This is the premise of Limitless, the movie directed by Neil Burger, based on the novel by Alan Glynn and starring Bradley Cooper as the loser-writer who is turned into a genius by the powers of a psychotropic drug.\n\nWhat if we had tremendous amounts of brainpower that remain untapped, powers that the dullness of our everyday routine dims into mere occasional insights, little flashes of awareness of a deeper reality that enfolds all that is? Could we really step into this different realm of being, freeing ourselves from the \"triviality\" that comes from using only a small percentage of our cortical mass?\n\nThere is a widespread myth out there, that we use only about 10 percent of our brain. We actually use all of it; every part of the brain has a known function. Otherwise, we would have certainly evolved smaller brains, or brains that are less costly metabolically.\n\nSo, the point is not that we need to activate large parts of our dormant brain, but that we need to trigger more efficient neuronal connections between the many parts: the secret is in increasing the pathways, making them resonate together in more creative ways.\n\nCould a pill do such a thing?\n\nWe don't know, certainly not now. But look at where we are now: millions of people, including children, are taking Adderall and Vyvanse, psychostimulants composed of different kinds of amphetamine. The drugs increase the amount of dopamine in the brain, raising focus, libido and overall cognitive alertness. They are, in a very real sense, the baby versions of NZT 48, the magic pill in Limitless. No wonder those who take these medications must hide them so that they don't get stolen. (Especially in college dorms.)\n\nThe movie echoes precisely this reality, amplifying it with the help of fiction: if there is a magic pill that makes you into a genius, or at least more focused and intellectually productive, everyone, or at least many people, will want it.\n\nIt's another version of the Faustian bargain, where now the Devil wears the clothes of a pharmaceutical company salesperson; or a drug dealer.\n\nI won't tell you how the movie ends. But I'd like to point out an interesting parallel with a remarkable sci-fi novel by the British writer Colin Wilson, The Philosopher's Stone, published in 1969.\n\nIn the novel, it wasn't a pill that gave the protagonist unprecedented brain power but the targeted electric stimulation of certain areas of the prefrontal cortex, which was described as \"some kind of extra storage area ... the centre of poetry and intelligence.\" The premise of the novel is that the brain contains in it all of our past and future, if only we knew how to tap into its amazing reservoirs of timeless power. The \"freed man\" becomes a seer, a prophet, a genius, a god.\n\nThere are all sorts of hidden meanings in the universe, but we are blind to most of them. Occasionally, someone of genius, a great poet, a musician, a scientist, peers into the fog, even if only momentarily. What the protagonists of Limitless and The Philosopher's Stone are after is the ability to keep the light shining permanently.\n\nCan we turn all the lights on without burning a central fuse? Is there a real advantage to pursuing a limitless mind? The movie makes it clear that the advantages we already have will remain even after taking the drug, that is, if you are smarter without it you will be smarter after taking it; the differentials between different IQs remain.\n\nPerhaps here we can extract the true lesson of the movie and the novel: hard as it is, we must learn to accept our limitations while trying to constantly transcend them. To me, what makes life interesting is the search for the right balance between these two trends.", "images": ["https://media.npr.org/assets/img/2020/03/24/undefined_sq-63f9f4b46bb9031d67f9785b66818f4befbab8bc.jpg?s=100", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://media.npr.org/assets/img/2011/03/30/smarter-through-pills-7a494d8599ed1cb621c4dd37641be617af3e3d17-s1100-c15.jpg", "https://www.facebook.com/tr?id=1621557368158968&ev=PageView&noscript=1", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/assets/img/2011/03/30/smarter-through-pills_wide-48addc4071eaffa65918a066789bbbb302221e06.jpg?s=1400", "https://media.npr.org/assets/img/2020/03/17/coronavirus_daily_final__sq-2aca96317281db7f8671e5bf24e68fb77b66bbed.png?s=100", "https://media.npr.org/assets/img/2020/02/21/invisibiliapodcasttile-3000x3000_sq-3cea16f264a5ecd812496bd930d38c4f54102d6e.png?s=100", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/assets/img/2020/03/09/trh_podcast-tile_sq-c05fb259465d433a5cf8a21248b8fa209a6b7690.png?s=100", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/chrome/programs/logos/fresh-air.png"], "top_img": "https://media.npr.org/assets/img/2011/03/30/smarter-through-pills_wide-48addc4071eaffa65918a066789bbbb302221e06.jpg?s=1400", "keywords": [], "authors": ["Marcelo Gleiser"], "canonical_link": "https://www.npr.org/sections/13.7/2011/03/30/134950294/recognizing-the-potential-and-perils-of-a-limitless-mind", "title": "Recognizing The Potential And Perils Of A 'Limitless' Mind", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2011-03-30", "description": "Can we find a drug that will give us limitless brain power? The new movie Limitless, explores this possibility. And the pharmaceutical industry may already be moving in this direction.", "og": {"title": "Recognizing The Potential And Perils Of A 'Limitless' Mind", "url": "https://www.npr.org/sections/13.7/2011/03/30/134950294/recognizing-the-potential-and-perils-of-a-limitless-mind", "type": "article", "description": "Can we find a drug that will give us limitless brain power? The new movie Limitless, explores this possibility. And the pharmaceutical industry may already be moving in this direction.", "image": "https://media.npr.org/assets/img/2011/03/30/smarter-through-pills_wide-48addc4071eaffa65918a066789bbbb302221e06.jpg?s=1400", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "true"}, "twitter": {"card": "summary_large_image", "title": "Recognizing The Potential And Perils Of A 'Limitless' Mind", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2011/03/30/smarter-through-pills_wide-48addc4071eaffa65918a066789bbbb302221e06.jpg?s=1400"}}}, "movies": [], "publish_date": 1301414400.0, "source": "http://www.npr.org", "summary": ""}