{"url": "https://en.wikipedia.org/wiki/Dancing_with_the_Stars_(U.S._season_25)", "text": "season of television series\n\nSeason twenty-five of Dancing with the Stars premiered on September 18, 2017, on the ABC network.\n\nOn November 21, 2017, actor and singer Jordan Fisher and Lindsay Arnold were declared the winners, marking Arnold's first win. Violinist and composer Lindsey Stirling and Mark Ballas finished second, while actor and race car driver Frankie Muniz and Witney Carson finished third. Having won at age 23, Fisher is currently the youngest male winner of the show, surpassing short track speed skating competitor Apolo Anton Ohno (season 4). Fisher also currently holds the record for most perfect scores by a celebrity in a season (9), surpassing Bindi Irwin (season 21) and Laurie Hernandez (season 23).\n\nCast [ edit ]\n\nCouples [ edit ]\n\nGood Morning America announced the professional dancers who would be competing in the upcoming season.[2] The two professionals from the previous season that did not return were Kym Johnson-Herjavec and Sasha Farber. Farber returned to the troupe, and Mark Ballas, who last appeared on season 22, also returned. Alan Bersten, a troupe member since season 20, was promoted to pro. On September 4, it was revealed that Cheryl Burke was the thirteenth pro added to the lineup.[3] Drew Scott was announced as the first celebrity competing for the season partnered with Emma Slater.[4] On September 6, the rest of the cast was revealed on Good Morning America.[5]\n\nHosts and judges [ edit ]\n\nTom Bergeron and Erin Andrews returned as hosts, while Carrie Ann Inaba, Len Goodman, and Bruno Tonioli returned as judges.[16] Julianne Hough did not return as a permanent judge this season, though she did return as a guest judge during the first night of the finals.[17] On October 23, singer Shania Twain joined the panel as a guest judge.[18]\n\nDance troupe [ edit ]\n\nThe dance troupe members for the season are former pros Sasha Farber and Jenna Johnson, and season 24 troupe members Artur Adamski, Brandon Armstrong, Hayley Erbert, and Britt Stewart.[19]\n\nScoring charts [ edit ]\n\nCouple Place 1 2 3 2 2 +3 4 5 6[a] 7 8 9 10[b] 1 2 Top 4 Top 3 Jordan & Lindsay 1 22 24 24 25 49 29 30 39 30 + 24 =54 30 + 30 = 60 28+ 30 = 58 40 + 40 = 80 + 30 + 30 = 140 Lindsey & Mark 2 22 21 24 27 51 26 28 40 27+ 24 =51 26+28=54 29 +28=57 40 + 40 = 80 + 30 + 30 = 140 Frankie & Witney 3 19 23 25 21 46 24 29 31 30 + 30 = 60 26+27=53 25+26=51 38+ 38 =76 + 30 + 28 = 134 Drew & Emma 4 16 20 21 23 44 24 25 30 27+ 30 =57 22 +25= 47 24 + 24 = 48 36 +39= 75 Victoria & Val 5 19 24 20 22 42 27 27 31 27+ 30 =57 24+ 24 =48 27+29=56 Terrell & Cheryl 6 15 20 19 21 40 24 25 37 25+ 24 =49 27+ 24 =51 Nikki & Artem 7 20 21 18 21 39 24 27 36 24 + 24 = 48 Vanessa & Maks 21 24 23 23 46 24 24 36 24 + 30 =54 Nick & Peta 9 18 19 19 21 40 22 22 26 Sasha & Gleb 10 18 23 22 19 41 24 24 Derek & Sharna 11 18 19 19 21 40 23 Debbie & Alan 12 17 20 21 Barbara & Keo 13 14 17\n\nRed numbers indicate the lowest score for each week Green numbers indicate the highest score for each week the couple eliminated that week the returning couple that was the last to be called safe the winning couple the runner-up couple the third-place couple\n\nAverage score chart [ edit ]\n\nThis table only counts dances scored on a 30-point scale (scores by guest judges are excluded).\n\nRank by\n\naverage Place Couple Total\n\npoints Number\n\nof dances Average 1 1 Jordan & Lindsay 475 17 27.9 2 2 Lindsey & Mark 460 27.1 3 3 Frankie & Witney 442 26.0 4 5 Victoria & Val 324 13 24.9 5 7 Vanessa & Maks 220 9 24.4 6 4 Drew & Emma 357 15 23.8 7 7 Nikki & Artem 206 9 22.9 8 6 Terrell & Cheryl 251 11 22.8 9 10 Sasha & Gleb 130 6 21.7 10 11 Derek & Sharna 100 5 20.0 9 Nick & Peta 140 7 12 12 Debbie & Alan 58 3 19.3 13 13 Barbara & Keo 31 2 15.5\n\nHighest and lowest scoring performances [ edit ]\n\nThe best and worst performances in each dance according to the judges' 30-point scale (scores by guest judges are excluded) are as follows:\n\nCouples' highest and lowest scoring dances [ edit ]\n\nScores are based upon a potential 30-point maximum (team dances and scores by guest judges are excluded).\n\nCouple Highest scoring dance(s) Lowest scoring dance(s) Jordan & Lindsay Foxtrot, Paso doble, Quickstep, Salsa, Jive, Charleston, Freestyle, Samba & Salsa/Paso doble fusion (30) Tango (22) Lindsey & Mark Argentine tango, Quickstep, Freestyle, Jive & Cha-cha-cha/Tango fusion (30) Quickstep (21) Frankie & Witney Contemporary & Argentine tango (30) Foxtrot (19) Drew & Emma Freestyle (29) Foxtrot (16) Victoria & Val Charleston (29) Cha-cha-cha (19) Terrell & Cheryl Jive & Charleston (27) Cha-cha-cha (15) Nikki & Artem Jazz & Argentine tango (27) Samba (18) Vanessa & Maks Quickstep (27) Cha-cha-cha (21) Nick & Peta Contemporary & Quickstep (22) Cha-cha-cha (18) Sasha & Gleb Foxtrot & Rumba (24) Cha-cha-cha (18) Derek & Sharna Jazz (23) Salsa (18) Debbie & Alan Argentine tango (21) Foxtrot (17) Barbara & Keo Tango (17) Salsa (14)\n\nWeekly scores [ edit ]\n\nIndividual judges' scores in the charts below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Len Goodman, Bruno Tonioli.\n\nWeek 1: First Dances [ edit ]\n\nThe couples danced the cha-cha-cha, foxtrot, salsa or tango.\n\nRunning order\n\nWeek 2: Ballroom Night / Latin Night [ edit ]\n\nThe couples had to prepare two new dances to be performed on two consecutive nights. On Monday, the couples performed an unlearned ballroom routine, with one couple being eliminated at the end of the show. On Tuesday, the remaining couples performed an unlearned Latin routine, with another couple being eliminated.\n\nArgentine tango, paso doble, quickstep, rumba, samba, Viennese Waltz, and waltz are introduced.\n\nRunning order (Night 1)\n\nRunning order (Night 2)\n\nWeek 3: Guilty Pleasures Night [ edit ]\n\nThe couples performed one unlearned dance to a song that reminded them of their secret indulgences.\n\nCharleston, jazz and jive are introduced.\n\nAt the start of the show, a moment of silence was held to honor the victims of the 2017 Las Vegas shooting, which occurred the previous day.[24] It was announced at the beginning of the show that, due to the tragedy, no elimination would take place.\n\nMaksim Chmerkovskiy was unable to perform due to an unspecified personal issue, so eliminated pro Alan Bersten danced with Vanessa Lachey instead.\n\nRunning order\n\nWeek 4: Most Memorable Year Night [ edit ]\n\nThe couples danced one unlearned dance to celebrate the most memorable year of their lives.\n\nContemporary is introduced.\n\nRunning order\n\nWeek 5: Disney Night [ edit ]\n\nThe couples performed one unlearned dance to a song from a Disney film to celebrate Walt Disney through the years. All performances were chronological, based on when the couple's respective movie was released.\n\nRunning order\n\nWeek 6: A Night at the Movies [ edit ]\n\nIndividual judges' scores in the chart below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Len Goodman, Shania Twain, Bruno Tonioli.\n\nThe couples performed one unlearned dance, capturing the spirit of a specific movie genre.\n\nRunning order\n\nWeek 7: Halloween Night [ edit ]\n\nThe couples performed one unlearned dance and a team dance to Halloween themes and songs.\n\nRunning order\n\nWeek 8: Celebrity Trio Dances (Quarterfinals) [ edit ]\n\nThe couples performed an unlearned dance and a trio dance. Unlike in prior seasons, where the trios involved eliminated pros or troupe members, the trios were instead composed of past celebrity winners or finalists. They included Kelly Monaco, Rashad Jennings, Laurie Hernandez, Kristi Yamaguchi, Alfonso Ribeiro and Corbin Bleu.\n\nRunning order\n\nWeek 9: Semifinals [ edit ]\n\nThe couples performed an unlearned dance using music chosen by the pros, as well as a dance that reinterpreted an iconic routine from a previous season.\n\nRunning order\n\nWeek 10: Finals [ edit ]\n\nIndividual judges' scores in the chart below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Len Goodman, Julianne Hough, Bruno Tonioli.\n\nOn the first night, the couples performed a redemption dance and a freestyle.\n\nOn the second night, the final three couples danced their favorite routine and a fusion dance of two styles. For the first time, a short window of \"last chance\" audience voting was added for the Eastern and Central time zones immediately after the final scored dance.\n\nRunning order (Night 1)\n\nRunning order (Night 2)\n\nDance chart [ edit ]\n\nThe celebrities and professional partners danced one of these routines for each corresponding week:\n\nWeek 1: Cha-cha-cha, foxtrot, salsa, or tango (First Dances)\n\nWeek 2 (Night 1): One unlearned ballroom dance (Ballroom Night)\n\nWeek 2 (Night 2): One unlearned Latin dance (Latin Night)\n\nWeek 3: One unlearned dance (Guilty Pleasures Night)\n\nWeek 4: One unlearned dance (Most Memorable Year Night)\n\nWeek 5: One unlearned dance (Disney Night)\n\nWeek 6: One unlearned dance (A Night at the Movies)\n\nWeek 7: One unlearned dance and team dances (Halloween Night)\n\nWeek 8: One unlearned dance and trio dances (Quarterfinals)\n\nWeek 9: Two unlearned dances (Semifinals)\n\nWeek 10 (Night 1): Redemption dance and freestyle (Final 4)\n\nWeek 10 (Night 2): Favorite dance and fusion dance (Final 3)\n\nCouple 1 2 3 4 5 6 7 8 9 10 Jordan & Lindsay Tango Viennese waltz Samba Charleston Contemporary Foxtrot Rumba Paso doble Freestyle\n\n(Team \"Monster Mash\") Quickstep Salsa Argentine tango Jive Charleston Freestyle Samba Salsa\n\nPaso doble Lindsey & Mark Cha-cha-cha Quickstep Salsa Jive Viennese waltz Foxtrot Argentine tango Paso doble Freestyle\n\n(Team \"Monster Mash\") Samba Jazz Contemporary Tango Quickstep Freestyle Jive Cha-cha-cha\n\nTango Frankie & Witney Foxtrot Tango Cha-cha-cha Samba Quickstep Argentine tango Jazz Contemporary Freestyle\n\n( Team \"Phantom of the Ballroom\") Viennese waltz Jive Salsa Paso doble Foxtrot Freestyle Argentine tango Foxtrot\n\nTango Drew & Emma Foxtrot Quickstep Rumba Argentine tango Jive Viennese waltz Paso doble Charleston Freestyle\n\n(Team \"Phantom of the Ballroom\") Waltz Cha-cha-cha Tango Jazz Paso doble Freestyle Jive Victoria & Val Cha-cha-cha Tango Rumba Quickstep Foxtrot Jazz Paso doble Viennese waltz Freestyle\n\n(Team \"Phantom of the Ballroom\") Argentine tango Jive Contemporary Charleston Viennese waltz Terrell & Cheryl Cha-cha-cha Foxtrot Samba Salsa Viennese waltz Quickstep Jive Tango Freestyle\n\n(Team \"Monster Mash\") Charleston Rumba Nikki & Artem Tango Waltz Samba Viennese waltz Contemporary Jazz Argentine tango Jive Freestyle\n\n(Team \"Monster Mash\") Quickstep Vanessa & Maks Cha-cha-cha Foxtrot Salsa Jazz Rumba Waltz Quickstep Paso doble Freestyle\n\n(Team \"Phantom of the Ballroom\") Quickstep Nick & Peta Cha-cha-cha Foxtrot Argentine tango Jazz Contemporary Quickstep Samba Sasha & Gleb Cha-cha-cha Viennese waltz Samba Jazz Foxtrot Rumba Quickstep Derek & Sharna Salsa Foxtrot Paso doble Cha-cha-cha Jazz Salsa Debbie & Alan Foxtrot Quickstep Argentine tango Quickstep Barbara & Keo Salsa Tango Jive\n\nHighest scoring dance Lowest scoring dance Danced, but not scored\n\nRatings [ edit ]\n\nU.S. Nielsen ratings [ edit ]\n\nEpisode Air date Rating/Share\n\n(18–49) Viewers\n\n(millions) 1 \"Week 1: Premiere\" September 18, 2017 1.6 6 10.71[33] 2 \"Week 2: Ballroom Night (Night 1)\" September 25, 2017 1.4 5 8.67[34] 3 \"Week 2: Latin Night (Night 2)\" September 26, 2017 1.2 4 7.22[35] 4 \"Week 3: Guilty Pleasures Night\" October 2, 2017 1.4 5 9.06[36] 5 \"Week 4: Most Memorable Year Night\" October 9, 2017 1.3 5 9.25[37] 6 \"Week 5: Disney Night\" October 16, 2017 1.4 5 9.76[38] 7 \"Week 6: A Night at the Movies\" October 23, 2017 1.3 5 9.15[39] 8 \"Week 7: Halloween Night\" October 30, 2017 1.4 5 9.93[40] 9 \"Week 8: Quarterfinals\" November 6, 2017 1.2 5 9.30[41] 10 \"Week 9: Semifinals\" November 13, 2017 1.4 5 9.88[42] 11 “Week 10: Finals” November 20, 2017 1.4 5 10.08[43] 12 “Season Finale” November 21, 2017 1.3 5 9.20[44]\n\nNotes [ edit ]\n\n^ Shania Twain was a guest judge, so the couples were scored on a 40-point scale. ^ Julianne Hough was a guest judge for Monday night only, so those dances were scored on a 40-point scale. The Tuesday dances were scored on a 30-point scale.", "images": ["https://upload.wikimedia.org/wikipedia/en/a/a3/Dwts_season_25_poster.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/Dwts_season_25_poster.png/220px-Dwts_season_25_poster.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a3/Dwts_season_25_poster.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dancing_with_the_Stars_(American_season_25)", "title": "Dancing with the Stars (American season 25)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/a3/Dwts_season_25_poster.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}