{"url": "https://web.archive.org/web/20181114202525/https://www.forbes.com/sites/jordilippemcgraw/2018/11/14/victorias-secret-models-beauty-tricks-traveling/", "text": "The Victoria’s Secret models spend months preparing for the Victoria’s Secret Fashion Show, which is set to air Dec. 2. They hit the gym for extra sessions and pay extra attention to their diets to ensure their legs are perfectly toned, and their stomachs are totally flat. But, while that might be the goal gig of the year, they certainly manage to look near perfect for the other 364 days too. The most surprising place they look flawless though is the airport.\n\nWhile the rest of us walk off the plane with greasy hair, dried out skin and sweatpants, the Angels manage to look like they’ve just stepped off the runway. That’s pretty impressive considering how often they travel for shoots and shows. So, just how do they succeed in pulling off such a feat? Well, I caught up with some of the famous lingerie beauties backstage at the filming of the 2018 Victoria’s Secret Fashion Show in New York City where they dished to me their secrets to looking magazine-ready on-the-go and what they always have in their carry-ons.\n\nStella Maxwell, for example, has graced the cover of Vogue and walked in runway shows around the globe. But when it comes to looking fresh stepping off a plane, she relies on two things. “I always bring some eye drops and a face mask,” she told me. The reason? It keeps her skin and eyes hydrated, which helps you look fresh rather than worn out. Regarding practical things in her carry-on, she said, “I always have my phone charger.”\n\nLais Ribeiro and Romee Strijd have a similar trick to Maxwell for keeping their skin looking bright. “I always have lip balm and a mask for the plane,” said Ribeiro. “The mask keeps you hydrated; it is the best.” Strijd agreed saying, “I always have a mask, so my skin does not get dehydrated plus lip balm and water.” And music lover Ribeiro makes sure to have one key piece of tech with her too to survive the flight. “I have to have my headphones,” she said.\n\nElsa Hosk is all about the skin hydration as well but opts for a serum rather than a mask. “I have Barbara Sturm Glow Drops to hydrate,” she said. According to the brand, the drops are supposed to help you achieve that model glow by deeply hydrating your skin, refining your pores, and adding a hint of pigment. As far as her other tips Elsa said, “I drink lots of water and wear compression socks to keep the blood flowing.”\n\nDevon Windsor said she loves her at-home products so much, she makes sure to get travel size containers to bring them along. “I like to bring some hydrating face oils and de-puffing eye patches in case I get puffy on the flight,” she said. “I also always am sure to travel with my own silk eye mask, it’s so necessary when trying to sleep on flights.”\n\nNadine Leopold is all about the protection when it comes to her travel favorites. “Sunscreen, no matter if hot or cold it’s a must,” she said. “Same goes for a good pair of sunglasses.”\n\nCandice Swanepoel swears by different beauty items to keep her looking photo ready. “My travel must-haves are rosewater spray, mascara, and lip/cheek tint,” she said. “It helps to keep that glow.” But, as a mom of two, the 30-year-old has a few other priorities when she travels. “The baby bag is a whole different thing,” she said. “In there I always have disinfectant wipes.”\n\nThe Victoria’s Secret Fashion Show will broadcast on Sunday, December 2, at 10PM ET on The ABC Television Network, streaming and on demand.", "images": ["https://web.archive.org/web/20181114202525im_/https://secure.gravatar.com/avatar/545d69f8698c16aded740f6c791c0187?s=400&d=mm&r=g", "https://web.archive.org/web/20181114202525im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F488ae699de6c463aaef507061ffc7733%2F960x0.jpg%3Ffit%3Dscale"], "top_img": "https://web.archive.org/web/20181114202525im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F488ae699de6c463aaef507061ffc7733%2F960x0.jpg%3Ffit%3Dscale", "keywords": [], "authors": ["Jordi Lippe-Mcgraw"], "canonical_link": "https://web.archive.org/web/20181114202525/https://www.forbes.com/sites/jordilippemcgraw/2018/11/14/victorias-secret-models-beauty-tricks-traveling/", "title": "Victoria's Secret Models Reveal How To Look Runway Ready When Traveling", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Victoria's Secret Models Reveal How To Look Runway Ready When Traveling", "image": "https://web.archive.org/web/20181114202525im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F488ae699de6c463aaef507061ffc7733%2F960x0.jpg%3Ffit%3Dscale", "updated_time": "2018-11-14T11:30:10-05:00", "url": "https://web.archive.org/web/20181114202525/https://www.forbes.com/sites/jordilippemcgraw/2018/11/14/victorias-secret-models-beauty-tricks-traveling/", "description": "The Victoria's Secret models opened up about their beauty hacks for looking flawless while flying ahead of the 2018 Victoria's Secret Fashion Show.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Victoria's Secret Models Reveal How To Look Runway Ready When Traveling", "description": "The Victoria's Secret models opened up about their beauty hacks for looking flawless while flying ahead of the 2018 Victoria's Secret Fashion Show.", "image": "https://web.archive.org/web/20181114202525im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F488ae699de6c463aaef507061ffc7733%2F960x0.jpg%3Ffit%3Dscale", "creator": "@jordilippemcgraw"}, "description": "The Victoria's Secret models opened up about their beauty hacks for looking flawless while flying ahead of the 2018 Victoria's Secret Fashion Show.", "author": "Jordi Lippe-McGraw", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Jordi Lippe-McGraw", "section": "Lifestyle", "section_url": "https://www.forbes.com/travel/", "id": "blogAndPostId/blog/post/5252-631", "published": "2018-11-14", "modified": "2018-11-14"}}, "movies": [], "publish_date": 1542124800.0, "source": "https://web.archive.org", "summary": ""}