{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-finale-aries-decision-explained-by-ben-higgins-1092444", "text": "After Monday's shocking \"most dramatic\" ending ever to The Bachelor, one big question is swirling around Bachelor nation — why did everything happen the way it did?\n\nHere's what went down: Bachelor star Arie Luyendyk Jr. fell in love with both of his two finalists, Lauren Burnham and Becca Kufrin. He was conflicted until the last day of production, ultimately deciding to break up with Lauren and propose to Becca that same night. One month later, however, he couldn't stop thinking about Lauren and he brought ABC's cameras along to break it off with his clueless now-fiancee, Becca, in hopes of reconciling with Lauren. The devastating scene played out, completely unedited, during the last act of a three-hour finale. Tuesday will bring the first-ever second night of the finale, when Becca, Arie and Lauren all come face to face and Arie reveals the result of his bid to win Lauren back.\n\nYes, there was a switcheroo — which happened only one time before in Bachelor history with Jason Mesnick in 2009 — but the dragged-out ambush on Becca, orchestrated by Arie, is what viewers can't seem to forgive. Twitter has been an unfriendly place for Arie to visit, as both fans and former stars of the franchise vocalize their discomfort at how everything played out.\n\nAfter watching it all unfold for a second time when being interviewed by host Chris Harrison during the live portion of Monday's show, former Bachelor Ben Higgins tweeted, \"We don’t belong in this conversation....but im still watching\" about Arie's breakup with Becca. \"I've never had more of a response on social media than I did last night — not in the three years of being a part of this franchise, with how people were reacting,\" Ben tells The Hollywood Reporter the next day.\n\nHiggins appeared on the finale because he could relate, in part, to Arie's plight. During his Bachelor season in 2016, Ben also told his two finalists that he loved them. The moment made for a first on the long-running franchise and sympathy for his runner-up, JoJo Fletcher, propelled her to the top of the list for the next cycle of The Bachelorette — something the franchise no doubt assumes will happen for Becca (ABC plans to announce the next Bachelorette on Tuesday).\n\nA little more than a year after getting engaged, he and his winner, Lauren Bushnell, called off their engagement, but Ben remains a familiar face within the ABC reality dating franchise. He recently appeared on winter spinoff Bachelor Winter Games and hosts a Bachelor-themed podcast, The Ben & Ashley I Almost Famous Podcast, with another member of the franchise, Ashley Iaconetti. In a candid chat below, Ben peels back the curtain on The Bachelor to tell THR what happens when the cameras shut down, why Arie might have felt pressured to deliver a proposal in the end and where the current Bachelor — who may now be the franchise's No. 1 villain — made his biggest mistake.\n\nLet's get into some of the reasons about why this all played out the way it did. First, should Arie have proposed to Becca in the first place? Why does the show have to have a proposal in the end?\n\nWhen I was the Bachelor, I never felt pressured to make a proposal. But I always knew that it was something that was expected. I think for the fans of the show, the women that are involved, the show itself — there’s an expectation that there could be a proposal at the end. I would like the show to get back to a place where, as a fan, we’re watching and that last episode is about: Is he/she going to do it or not? Then we would know how far the relationship has progressed. If everyone is just going to get engaged at the end, then we don't really know. With Arie, it doesn’t seem like a proposal should have happened and I wonder if he would say the same thing.\n\nOne thing Arie has said that does make sense is about the pressure he felt to propose; where an entire show of people are surrounding you who want you to have your happy ending. What is that like, especially in those final days of filming?\n\nIt becomes a big family and that’s one of the beautiful parts about The Bachelor that nobody gets to see. I can’t speak for every Bachelor or Bachelorette, or every contestant, but I can speak to my experience. Even last night, as I showed up for filming, I have a bunch of friends who work on this show and there are hugs and smiles and stories. That’s what the Bachelor family feels like when you’re doing the show. Then at the very end, there are also tons of people around, who work on lighting or sound and who don’t know anything about me or any of the women left, but who also want you happy. You feel that towards the end, so I totally get where Arie is coming from. You feel a little pressure because you go into it hoping this will be a story that will be shared forever and that you’d be excited to watch back.\n\nReaction to Arie's pick as the Bachelor was mixed. People loved Peter Kraus from the previous Bachelorette, but he couldn't guarantee that he would be ready to propose in the end. Do you think that added to the expectation?\n\nI haven’t talked to Arie. He came on the podcast [earlier] but I haven’t been able to get into his head. I’d love to talk with him and see where he’s at, but I wouldn’t be surprised. I remember when I was chosen as the Bachelor there were rumors that they should have chosen Nick [Viall] or some other guys out there they were interested in. As a result, I was a little self-conscious and thought, “What if they should have chosen those guys? What if I’m not the guy they hoped for?” So I can relate with Arie about that. Especially if you struggle at all with your own confidence, you can definitely slip into the mindset of, “I need to be the best for this situation because I don’t want to let anybody down.”\n\nWhen you are the Bachelor, how is it explained to you about expressing your feelings when a contestant says “I love you”? And what were your conversations like with the producers when you decided you did want to tell both of your finalists you loved them?\n\nIt really wasn’t explained. I’m talking about my season here, but the big thing for me is that they always said, “There are no rules, Ben.” I don’t know if they said that because they knew I was always on edge and nervous to make anyone mad or ruin the whole show, but they always said there were no rules. Towards the end, I felt this pull where I had two amazing women, one of which I really did believe I was going to spend my life with, but the other one was a woman that in any other circumstance I would have been ecstatic to spend my time with. Any other world that didn’t have Lauren a part of it, I would be so happy with JoJo. I felt, “How do I express that so that JoJo knows this is real?” So that she could look at our relationship and find it legitimate and that her time was not wasted. When I went to the show, I said, “This is how I’m feeling. I feel like I want to tell her this. If I tell her this, is that OK?” They said to do what I had to do, and again that there were no rules. So when she told me she loved me, I felt free to say it. I never even really felt weird about it, until the storyline played out in the public’s eye. I didn’t realize the Bachelor or Bachelorette hadn’t said that before.\n\nThere is a difference when watching the end of your season compared to Arie’s. He said he made up his mind that morning and by that night, he was joking with Becca about making babies — quite a leap of love in less than 24 hours. What is it like after the proposal, when the cameras go away?\n\nAs soon as the proposal happens and you carry her away into the sunset or however that works, the cameras are down. That’s a wrap and the show is done. We had a nice big party that evening with everyone closely involved in the show. A big dinner and celebration, which was incredible. Then we had four days of freedom which for us was in Jamaica. It’s really just a vacation to unwind and decompress. I slept one full day. It’s this weird, very quick transition from being on the show and having someone telling you your schedule every day, and then going on all these dates and being involved in all these intense conversations, to then everything shutting down. There’s quiet and no people. For my case, I looked by my side and I had a woman I was in love with. But it is a really confusing and also very crucial time in that relationship. If Lauren and I could have looked at each other and said, “Hey, this is weird and crazy but we both understand that and we’re going to be here for each other,” then I think that would have set the foundation for a really healthy relationship. You’ve already been through some of the weirdest and toughest stuff any couple could ever go through.\n\nWhen you then do the secret three months of dating before After the FInal Rose, you are in touch with the producers because they set you up to see each other in “safe houses.” It’s not clear if filming the breakup was Arie’s idea or if the producers brought the idea to him, but that seems to be the consensus for where he went wrong. Would you have pushed back and said no?\n\nOne thing in this, which has also been a good life lesson for me, is that you get wrapped up in the emotion of it all and you start to really hate on Arie. But I need to take a step back myself and say: This guy is in a situation — and I remember feeling this way — where there is no right decision to be made. Choose the lesser evil. That’s both the beauty of the format and also the necessary evil of the show — you are going to make a mistake. It happens every year, where there is something you do that doesn’t work out. I believe that Arie has been incredibly authentic and genuine, almost to a fault, because there are times where you hoped he could have led conversation a little bit more, but he just wasn’t feeling it so he didn’t. As a result, we had a lot of TV of awkward silence. I want to give him the benefit of the doubt.\n\nBut, with all that being said, there was one decision here where he had to put his foot down. And there are a bunch of ways to go about it. Being the Bachelor or Bachelorette comes with a level of responsibility where you have to live above reproach. You have to continue to stay on edge and, as funny and goofy as the show is, it carries a lot of weight and it does affect real lives. In a situation like in a breakup, where you know you made the wrong decision — and as humans, we are allowed to make the wrong decision and learn from that — but as he’s getting ready for that breakup, in my opinion with being around this for a while, the better option would have been to never tell anyone except for a close friend or a family member. Say, “Hey, I’m feeling this way and want to process it through with you.” And then tell Becca directly.\n\nExactly. Why did he go to the show first?\n\nMaybe he got caught up in it all and looked at them for trust and support. But he obviously went to them and then at that point, once they know, their whole job is to document the story. That’s why they are there. I get why the show said, “OK, this is a part of the love story. You filled us in on this. Now we are entitled to document what happens.” Now, I’m in a sense glad they did because it lets me know the clear picture of where Becca is at, where Arie is at and what exactly happened between them. But, to take it all back to real life, I think Arie should have done this in private and then filled the show in and said, “Hey I just ended things with Becca. We can do a follow-up interview to explain everything.” But to document it like they did last night, it just felt weird.\n\nA lot of former Bachelor leads and stars are speaking out on Twitter to say they are upset that Becca was ambushed. Chris Harrison defended the decision, saying, “We can’t always show fairy tales.” Do you see both sides?\n\nI get why people are upset. There are real emotions at play — Becca got broken up with and ended an engagement. When I ended my engagement, that paralyzed me with emotion for days. I can’t imagine that being something that was documented or planned out. It would have messed with me so bad if I felt this had been in talks for days now. [Ex-Bachelor contestant] Caroline Linney said on our podcast that she actually knew about the breakup before Becca did. So, at what level does this not feel right? We can’t blame the producers, because that’s their job. It’s Arie’s job in this situation to do this respectfully and wisely, to make sure that the least pain is being caused. I’m not thrilled that we watched it either, but I get why we did.\n\nArie has taken heat all season long for not expressing himself well and he was criticized for not showing empathy during either breakup. What is that conflict like: Where you want to put one relationship to bed but still respect the other relationship you are trying to make work?\n\nI’m pretty emotional. This was my second time watching it last night and it just pulls at you. Breakups are terrible, I don’t think there is any right way to do it. But one of the women sitting next to me at the show last night kept commenting on how he wasn’t showing any emotion. He seemed more interested in Becca reassuring him and talking to him than he was about the fact that he just crushed a girl’s dream. At this point, he might have been so far moved on, especially since he had been talking to Lauren. If Arie would have been a little more transparent and could have communicated himself better this season, we could have ridden this wave with him. It all might have made more sense and then peoples’ hearts would have broken for both Arie and Becca, to know that Arie was so conflicted internally. Instead, it just felt like: \"I proposed to a girl, that’s not going to work out. I made a mistake and now I’m going to back to the other one — and I want Becca to be OK so I can leave the house.\" I just didn’t feel it from him.\n\nDid that surprise you when you heard that he had been in contact with Lauren?\n\nRunner-up aside, let’s just talk real life: If you propose and are engaged to somebody, I don’t think it’s appropriate to talk to your ex really at all, unless it’s for small details. I think that was unhealthy. As soon as we open the door to allow an old relationship in, it’s very easy to let it happen very quickly. The grass is always greener. When you get in relationships that are committed and serious, they can be difficult. It’s not just fairy tales; there are beautiful and hard moments, too. If you are always allowing yourself to stay open to the possibility of who else is out there or who else might bring you less pain or more joy, then your mind is always going to be in a different place. I think he let himself open up to a former relationship and a former love and we saw the repercussions of that.\n\nThere is this belief that the audience needs to see Becca’s heartbreak in order to want to watch her as the next Bachelorette. Knowing what it takes to be the lead of this show, do you think she is ready to make such a quick turnaround and look for love on The Bachelorette?\n\nShe can answer that. I don’t know, but I would imagine yes. She probably has deep feelings for Arie but she now has had to watch the show back and clearly understands that Arie no longer feels that way about her. So, what’s her better option? To sit back paralyzed and not do anything, not date or put herself out there? Or, what if that next step is on The Bachelorette and we’re able to watch her heal and pursue other people? I would imagine if she’s saying yes, she’s very ready and I could see why.\n\nIf Arie proposes to Lauren on After the Finale Rose, is he making another mistake?\n\nOh, man, poor Lauren. This girl, she has done nothing wrong. She fell in love with a guy in a situation where she very much had the right to fall in love with somebody and now she’s dealing with the backlash of a very hard decision that Arie has made. It just shows that hard decisions in life can definitely affect another person. I haven’t heard of anything Lauren has done that is incorrect or irresponsible, so she is probably just getting hated on for no reason. If he were to propose, it wouldn’t be fair to Lauren because I feel like it would be the most uncelebrated proposal ever. But, I think over time, if their relationship works out, I’m happy he found someone. There were just about 100 other ways it could have been done without him having to propose tonight.\n\nWhat is your advice to Arie and Lauren about how to make it through all of this?\n\nDisappear for a while together. The beauty of this world is that opinions and thoughts fade pretty quickly. As soon as the next Bachelorette comes or a rumor gets started, this will all fade. I talked to Jason Mesnick last night and he no longer deals with the day to day to making his switch. It’s almost now something he can laugh about, because it led him to his wife and family. If Arie and Lauren really care about each other, they have to dig deep to support each other through a time that isn’t ideal. They need to both understand that this crazy situation that had its faults and bad decisions led them to each other. True love, I think, can overcome any type of difficulty and what better way to start showing love to each other than a time like this, where it feels like the only thing surrounding you is difficulty? It just takes time and I hope it’s time they are able to spend supporting each other.\n\nYou see people like Luke Pell after Bachelor Winter Games and now Arie get put through the ringer, yet you still say you’re open to doing the show again. Why?\n\nI've learned over the last three years that when I said \"no\" to things, that same thing I said no to was opened up right in front of me and ended up being a good decision. So I don’t want to say, “No, I’m never doing this again.” Because then I start lying to myself. But I also know that any time I make a decision now, there is a lot more weight and thought behind it than when I was asked to be on The Bachelorette three years ago and I said, “Why not? What’s the worst thing that could happen?” But there still are a lot of worse things that could happen, so that’s why I can’t close the door. I also don’t want to open it up and say I’m sitting here, excited and waiting, because that’s not the case either.\n\nWhat is your current relationship status?\n\nI’m single, but I’ve been dating. I don’t know what the rules are anymore. I hadn’t gone on a real date for three years. From 25 to 28, I was dating on TV or not dating at all. I’ve had some dates with some people early on that didn’t go anywhere; I’ve gone on dates with some people multiple times. All of it has been a learning experience but it’s also been something I still feel semi-uncomfortable with. As much as I’d like to put a foot out there and really let myself go again, I’m still held back. Not by any past hurt, my life just isn’t really there right now. I’m slowly wading back in. I remember my very first date after Lauren, we were on this date and there were some people who recognized us and asked for a picture and I when I sat back down, I realized that if that picture got out, this poor girl would be exposed to whatever kind of criticism that entails from me dating someone. Then i started to feel guilty that I was even on a date. My mind has just been messed up over this for the last few months.\n\nYou’ve been keeping yourself busy with your new company, Generous. What was your recent trip to Honduras like and what are you up to now?\n\nGenerous is a for-profit company that spun off of the idea of we have to support causes that are actually doing good in the world. So we started with Generous Coffee, where we buy pre-imported beans and sell these beans in the United States and then donate profits back to these causes that are building some type of sustainable plan in communities around the world. We have partnerships in Haiti, Malawi, Rwanda, Honduras and also domestically. As recently as last week, we went to Honduras to see our coffee farms and communities we’re serving there. We brought 20 people down, including friends of the Bachelor Dean Unglert and Lesley Murphy. It is now my full-time job that I love and am passionate about. If you go to Gernerousmovement.com, you can see everything we’re selling and trying to do. Right now, I’m a team of one. If you call customer service, you will be directed right to me. (Laughs.) This project is one I truly believe in and I just think that if I can personally find a way the for-profit business can also change lives for the better, then I am in my happy place.\n\nThe second part of The Bachelor finale airs Tuesday at 8 p.m. on ABC. What do you think of the ending? Sound off in the comments, below.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2011/06/abc_logo_2011_a_p.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2016/08/chris_harrison.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2018/12/colton_from_the_bachelor_-_publicity_-_h_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "https://cdn1.thr.com/sites/default/files/2018/03/ben_higgins_and_arie_luyendyk_jr._-_inset_-_publicity_-_h_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/12/bywcqq0k.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/03/ben_higgins_and_arie_luyendyk_jr._-_inset_-_publicity_-_h_2018.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/03/ben_higgins_and_arie_luyendyk_jr._-_inset_-_publicity_-_h_2018.jpg", "keywords": [], "authors": ["Jackie Strause", "Jackie.Strause Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/bachelor-finale-aries-decision-explained-by-ben-higgins-1092444", "title": "Former 'Bachelor' Ben Higgins Explains Where Arie Went Wrong", "meta_data": {"viewport": "width=device-width", "description": "Former 'Bachelor' Ben Higgins, who has been in Arie Luyendyk Jr.'s shoes, shares behind-the-scenes details of the ABC show's process and unpacks the finale.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/bachelor-finale-aries-decision-explained-by-ben-higgins-1092444", "domain": "https://www.hollywoodreporter.com/", "title": "Former 'Bachelor' Ben Higgins Explains Where Arie Went Wrong", "description": "Having been in Arie Luyendyk Jr.'s shoes, the ABC star takes THR behind the scenes to offer new insight into the controversial 'Bachelor' finale.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/03/ben_higgins_and_arie_luyendyk_jr._-_inset_-_publicity_-_h_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Former 'Bachelor' Ben Higgins Explains Where Arie Went Wrong", "description": "Having been in Arie Luyendyk Jr.'s shoes, the ABC star takes THR behind the scenes to offer new insight into the controversial 'Bachelor' finale.", "url": "https://www.hollywoodreporter.com/live-feed/bachelor-finale-aries-decision-explained-by-ben-higgins-1092444", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/03/ben_higgins_and_arie_luyendyk_jr._-_inset_-_publicity_-_h_2018.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Former 'Bachelor' Ben Higgins Explains Where Arie Went Wrong", "sailthru.description": "Having been in Arie Luyendyk Jr.'s shoes, the ABC star takes THR behind the scenes to offer new insight into the controversial 'Bachelor' finale.", "sailthru.author": "Jackie Strause", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-03-06 14:06:33", "sailthru.tags": "Live Feed, Television, ABC, The Bachelor"}, "movies": [], "publish_date": 1520316393.0, "source": "https://www.hollywoodreporter.com", "summary": ""}