{"url": "www.independent.co.uk/life-style/hailey-baldwin-justin-bieber-engaged-who-is-she-model-stephen-a8438196.html", "text": "Justin Bieber is reportedly engaged to US model Hailey Baldwin.\n\nThe Canadian singer popped the question in the Bahamas on Saturday night, according to TMZ, and videos of the genetically-blessed duo dancing that same evening have been widely shared on social media.\n\nWhile the hearts of ambitious beliebers everywhere slowly crumble into dust at the news that the 24-year-old superstar is officially off the market, some are avidly trying to find out everything they can about his alleged fiancée.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nHere's everything you need to know about Hailey Baldwin.\n\nWho is she?\n\nBorn on November 22, 1996, Hailey Rhode Baldwin was instantly thrust into the spotlight as the daughter of Hollywood actor Stephen Baldwin, known for The Usual Suspects, and Brazlian graphic designer Kennya Baldwin.\n\nThe 22-year-old grew up in Tuscon, Arizona and was homeschooled by her parents from the age of eight.\n\nShe has an older sister, Alaia Baldwin, 24, who tied the knot to her longtime partner Andrew Aronow in September 2017; Hailey was the maid of honour.\n\nAlec Baldwin - of Beetlejuice, 30 Rock and Saturday Night Live - is her uncle.\n\nWhat does she do?\n\nBaldwin was signed to New York agency Ford Models as a teenager, making her commercial debut in late 2014 in a campaign for French Connection.\n\nShe made her first runway appearance later that year walking for Topshop Unique at London Fashion Week and appeared in fashion editorials for Tatler, LOVE and i-D amongst others.\n\nIn January 2015, Baldwin was photographed for American Vogue and went on to land a string of high profile campaigns, including ones with Ralph Lauren, Tommy Hilfiger, Carolina Herrera and Guess.\n\nBaldwin's career has flourished ever since and the young model has appeared on a number of magazine covers such as Elle, Wonderland, Vogue Turkey and The Sunday Times Style.\n\nShe has also walked the runway for Elie Saab, Missoni, Dolce & Gabbana Tory Burch, Prabal and Jeremy Scott.\n\nShe is now signed to IMG Models - the same agency as Bella Hadid, whom Baldwin is close friends with - and has worked with some of the industry's leading photographers, including Willy Vanderpere and Cass Bird.\n\nDespite boasting a staggering 12.7 million followers on Instagram, Baldwin resents the term \"Insta-model\", telling Elle UK in 2017:\n\n\"I put all my modelling [photos] on my Instagram because I'm showing it to people.\n\n\"It's not about me getting paid to model for things on Instagram — of course, sometimes we do get paid for things we do for Instagram and Twitter — but there is a line of calling someone an 'Insta model' or an 'Insta star.\"\n\nWhat else does she do?\n\nIn addition to modelling, Baldwin also co-hosts TBS’ celebrity rap programme Drop the Mic, which is produced by James Corden, alongside rapper Method Man.\n\nBaldwin has also dipped her toe into the acting world, making a cameo in Ocean's 8 as one of the celebrities attending the Met Gala, where the all-star female cast are staging an almighty jewellery heist.\n\nHer reported net worth is $3 million (£2.2 million).\n\nWhat are her interests?\n\nBaldwin is often vocal about her Christian faith, sharing verses from the bible on social media.\n\n\"I was raised in church. I was brought up in that life, and I think that it's very important for everybody to be in touch with their spirituality and to have a relationship with God,\" she told Teen Vogue in 2016.\n\nHer religious beliefs have hugely influenced her morals, she told The Sunday Times Style, revealing that she would never post nude.\n\n\"People look at religion as a scary thing if they don’t know what it’s about. But at the end of the day, church is just a building; my personal beliefs are what matters,” she told the magazine.\n\n\"I’m definitely not the poster child for Christianity, there are a lot of things the Bible says you’re not supposed to do. I mean, you’re not supposed to drink, you’re not supposed to have sex before marriage...\n\n“But I could be doing so many worse things with the access I’m given.”\n\nHow does she know Bieber?\n\nNews of their engagement may come as a shock to fans, but Baldwin and Bieber have actually known each other for nine years.\n\nStephen Baldwin introduced the two in 2009 as seen in a short clip that went viral in 2016 after Bieber retweeted it alongside the caption “Haha. Amazing”.\n\nHow did their relationship start?\n\nRumours began circulating that the two were romantically involved after pictures surfaced of them attending the same Church ceremony together in 2014 with Kendall Jenner.\n\nDespite frequently being photographed together, both denied the rumours until January 2016, when Bieber posted a candid snap on Instagram of the couple kissing on New Year’s Eve, taken when they were on a trip in Anguilla with Bieber’s family.\n\nHowever, Bieber got back together with his ex-girlfriend, Selena Gomez just a few months later. The two were rumoured to be dating until April this year, when he rekindled his relationship with Baldwin.\n\n\"Justin and I were friends for a long time,\" Baldwin told The Sunday Times Style.\n\n\"I met him when I was really young and he was one of my best friends. Everybody knows that at a certain point in time that turned into something else, but that just happens when you’re 18, 19.\n\n“We went through a long period of time when we weren’t friends. We didn’t speak for quite some time and there was a lot of weirdness that went on. We’ve moved past that.\"", "images": ["http://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/09/10/gettyimages-960634926.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/09/10/gettyimages-960634926.jpg", "keywords": [], "authors": ["Olivia Petter"], "canonical_link": "https://www.independent.co.uk/life-style/hailey-baldwin-justin-bieber-engaged-who-is-she-model-stephen-a8438196.html", "title": "Who is Hailey Baldwin? Justin Bieber's new fiancée", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/life-style/hailey-baldwin-justin-bieber-engaged-who-is-she-model-stephen-a8438196.html", "title": "Who is Hailey Baldwin? Justin Bieber's new fiancée", "description": "The two reportedly got engaged in the Bahamas on Saturday", "updated_time": "2018-07-09T12:45:49+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/09/10/gettyimages-960634926.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5806979614001_5806974583001.mp4?pubId=624246174001&videoId=5806974583001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8438196"}, "description": "Justin Bieber is reportedly engaged to US model Hailey Baldwin.", "keywords": "Hailey Baldwin, Justin Bieber, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Hailey Baldwin", "published_time": "2018-07-09T11:14:00+01:00", "modified_time": "2018-07-09T12:45:49+01:00", "section": "Lifestyle", "subsection": "Video", "author_name": "Olivia Petter", "content_type": "story", "word_count": 1031, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 14}, "twitter": {"title": "Who is Hailey Baldwin? Justin Bieber's new fiancée", "description": "Justin Bieber is reportedly engaged to US model Hailey Baldwin.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1531131240.0, "source": "http://www.independent.co.uk", "summary": ""}