{"url": "https://www.digitalspy.com/tv/ustv/a828387/13-reasons-why-season-2-release-date-trailer-cast-theories-spoilers/", "text": "Given that season one launched on March 31, 2017, Netflix may consider releasing season two at around the same date in 2018.\n\nIn fact, in March 2018, Navarro hyped up the second season by suggesting the new episodes will be launching \"soon\".\n\nIn October 2017, filming for the second season was temporarily halted due to Northern California wildfires in Vallejo.\n\nWe film 13 Reasons Why in many of the areas in NorCal affected by these devastating fires. Sending love and thoughts to everyone involved. — Dylan Minnette (@dylanminnette) October 10, 2017\n\nIn December 2017, shooting concluded. Stars such as Katherine Langford (Hannah Baker) and Michele Selene Ang (Courtney Crimsen), as well as producer Selena Gomez, shared pictures from the wrap party.\n\nOh you thought season 1 was crazy? I'll be sittin here waiting for y'all to see season 2 like...\n\n📸: @alishaboe#13ReasonsWhy pic.twitter.com/J0qxW2WSaO — Ross Butler (@RossButler) December 18, 2017\n\nSeason two will feature an introductory warning from the cast about the show's tough topics.\n\nA third season is not out of the question. Producer and Paramount president Amy Powell said that Yorkey has been giving it some thought.\n\n\"We're not going to pressure him to create more seasons if he doesn't feel they are there, but he is already starting to think about what a season three could be,\" she said.\n\n13 Reasons Why season 2 cast: Will Hannah be back?\n\nDespite showrunner Yorkey playing around with the idea of making 13 Reasons Why an anthology series at one point – à la True Detective – season two will keep the same cast and the same setting.\n\nMost notably, yes, Katherine Langford will be back as Hannah Baker.\n\nNetflix\n\n\"I think one of the things that is still hanging out there is this question of, is someone responsible for Hannah's death?\" Yorkey said. \"Is the school responsible? Who is responsible, if anyone is?\n\n\"One way we'll explore that question is through the trial and also through all of these kids reflecting on where they are a few months down the road and what other secrets are being uncovered.\n\n\"That's going to take us into the past, into Hannah's story.\"\n\nAnd you'll definitely be seeing a lot of Hannah. HuffPost says that season two will \"will feature [her] in more scenes than even Langford expected\".\n\nIn a later interview, Langford teased: \"You see a very different Hannah in season two. I would prepare fans not to expect the Hannah from season one for a multitude of reasons.\"\n\nWe also can't have a second season without Clay Jensen. Actor Dylan Minnette is too, confirming via this pretty cool Instagram snap:\n\nMinnette shed some light into the second season by saying that the never-before-seen flashbacks with Hannah in the new episodes will cover new ground by featuring other characters rather than himself.\n\nRoss Butler (Zach Dempsey) all but confirmed his return back in April 2017, after he revealed that he dropped out of Riverdale to be part of the second season of 13 Reasons Why.\n\nChristian Navarro (Tony Padilla) tweeted that he was back on set, while Kate Walsh (Olivia Baker) gave an interview revealing the part her character will play in the new episodes.\n\nBrandon Flynn (Justin Foley) said he was excited for season two, posting on Instagram: \"Can't wait to get back to work with this beautiful team!\" (Side-note: Flynn will also be seen in True Detective season three on HBO in 2019.)\n\nAlisha Boe (Jessica Davis) and Justin Prentice (Bryce Walker) are back, with Yorkey stating his interest in continuing their stories (more on that later), while Miles Heizer (Alex Standall) suggested his cliffhanger will be addressed – meaning he will return in some form.\n\nMichele Selene Ang (Courtney Crimsen) said on Instagram: \"See all you freaks back at Liberty High.\"\n\nNetflix\n\nDevin Druid (Tyler Down), Amy Hargreaves (Lainie Jensen), Ajiona Alexus (Sherri Holland), Tommy Dorfman (Ryan Shaver), and Timothy Granaderos (Montgomery de la Cruz) all shared the season two teaser video on Twitter and/or Instagram following the show's renewal – which implies that they are all interested in coming back as well.\n\nBrian d'Arcy James (Hannah Baker's father Andy) said in an interview that he would love to return.\n\nAnd could we finally see justice for Jeff? Brandon Larracuente shared in an interview that he would love to play Jeff Atkins again, and suggested that he could feature in flashbacks.\n\n\"Considering the entire first season, Jeff was shown entirely in flashbacks, that could be a possibility,\" he said.\n\n@selenagomez Instagram\n\nSelena Gomez didn't make a cameo in season one, and fans shouldn't expect her to appear in season two, either.\n\nHargreaves commented on the possibility of Selena popping up, saying: \"It would kinda distract from the main story. So I can't imagine that she would pop up for a cameo, but who knows? You never know.\"\n\nThe show held an open casting call in June, looking for \"students, baseball players, track and field athletes, cheerleaders, boxers, parents, teachers, and coffee shop patrons\". Actors of \"all ages, types, and ethnicities\" were encouraged to attend.\n\nIn August, a few new characters were announced...\n\nKelli O'Hara, a Tony award-winning Broadway actress and star of Masters of Sex, will join the cast as Jackie, an \"advocate for victims of bullying\" (via TVLine).\n\nOther cast additions include Bryce Cass, who will play Cyrus, described as \"an edgy, cynical mischief maker\" and his on-screen sister Mackenzie, played by Chelsea Alden (who you might recognise from American Horror Story), who is \"artsy, witty\" and outspoken.\n\nAlso joining students at Liberty High School for season two will be Samantha Logan (The Fosters) as track star Nina and Anne Winters (Tyrant) playing head cheerleader Chloe.\n\nIt's not just the pupils at Liberty High who will have some new faces in the crowd: the teachers will be joined by new cast member Ben Lawson (Neighbours) as Rick, the basketball coach.\n\nMeanwhile, Kings' Allison Miller is going to be playing a young litigator, Sonya, who we would imagine will be playing a role in the lawsuit Hannah's parents have filed against the school.\n\nNow I get to stop hiding what I've been up to recently!! 🤗 Honored to be a part of this discussion. https://t.co/pRdyXrhPTq — Allison Miller (@allisonemiller) August 8, 2017\n\nBrenda Strong and Jake Weber are playing Bryce's parents Nora and Barry, and Meredith Monroe has been announced as Alex's mother Carolyn.\n\nRJ Brown will take on the role of Caleb, Tony's boxing trainer with a \"wry sense of humour\".\n\n13 Reasons Why season 2 spoilers: What will happen?\n\nFirstly, the tapes are being scrapped. Those cassettes still exist, of course, but rather the episodes will no longer be structured around Hannah's narration.\n\nInstead, there will be a \"different sort of analogue technology that plays a hugely important role in season two\", showrunner Yorkey teased. \"The cassette tapes aren't at the centre of it – those two boxes of tapes are still hanging around and matter to people, but there will be a new piece of technology for 13-year-olds to Google and try to understand what it was.\"\n\nNetflix\n\nSeason two will keep the multiple-timeline storytelling, but Hannah is no longer the narrator. Instead, somebody else will be providing the voiceover.\n\nWe will see \"other perspectives on Hannah's story\", too. This is particularly interesting, because there were a couple of moments in the first season where certain characters questioned Hannah's \"truth\".\n\nOf note, remember the letter that Hannah gave to Zach? The one which she claimed he had thrown away, thus rejecting her plea for help?\n\nThe reality is that Zach actually kept the note. Did Hannah lie, or was she just mistaken? Maybe that will be explained.\n\nNetflix\n\n\"Hannah told her version of events, but there are at least 12 kids who have another version of those events that we actually haven't really heard from yet,\" Yorkey said.\n\nTime-wise, the second season will pick up \"a number of months\" after season one (according to Yorkey), and will in part cover the trial and the Bakers' lawsuit against the school.\n\nKate Walsh (Hannah's mother Olivia Baker) teased: \"We'll see more and more of the mystery getting revealed, and I think you see Mrs Baker still questing for the answers of what happened to her daughter.\"\n\nYou should also expect a number of other loose ends to be addressed when the show returns. Most of the characters were in a dark place by the end of last season (star Miles Heizer confirmed that the show will not shy away from \"taboo topics\" it tackled in the first season), but could some of them find happiness?\n\n\"[The individual cliffhangers are] all related, so I would very much like to explore where they all go and to see if there is, as I think there will be, some light for these kids,\" Yorkey said.\n\nJessica is still trying to recover from her rape, while Bryce – who raped Jessica and Hannah – will hopefully be receiving some form of comeuppance, whatever that may be.\n\nNetflix\n\n\"I want to do Jessica's story the deserved justice of following her as she goes back to school, as she tries to begin to recover from what happened to her, because it's something that millions of young women go through,\" Yorkey said.\n\n\"And also [I want to] see somebody punch Bryce in the face.\"\n\nThe cast seem to be in agreement as well, with stars such as Alisha Boe and Brandon Flynn saying that they hope to see \"justice for Hannah and Jessica\".\n\nTimothy Granaderos similarly wants the people who wronged Hannah to be \"held accountable\".\n\nOther cliffhangers from the season one finale include what happens with school counsellor Kevin Porter (will he be fired?), Alex's suicide attempt, Zach desperately trying to reach Alex only to receive a call from somebody else, and Tyler's stash of guns.\n\nNetflix\n\nSelena Gomez, pop singer and one of the producers on the show, said that she has been in the writers' room and that there were story moments she learned which left her \"almost freaking out\".\n\nShe later said that the new season will be \"really encouraging and empowering\".\n\nAny fears that 13 Reasons Why would have to censor itself in light of the controversy the show drew for season one (over its depiction of suicide) can rest easy: Dylan Minnette and executive producer Tom McCarthy have both said season two will not be censored.\n\n\"I'm sure it's going to be just as important and dark as last season,\" Minnette said.\n\nThe actor added that the second season's theme will be \"recovery\", adding: \"It's naturally going to progressively get to a more emotional place, due to the nature of the story we're telling. I'm sure we're all heading in some dark directions again.\"\n\nAnd new cast member Anne Winters said that the new episodes will be less \"black and white\" compared to season one.\n\n\"This season will explore a little of those grey areas... so that when people raise the question of, 'Well, wasn't it her fault that she did this or that?' this season shows a different take on it,\" she shared.\n\n13 Reasons Why season 2 theories: Did Tyler shoot Alex?\n\nWith the way the season one finale ended, it's not surprising that people have been coming up with fan theories about season two – many of which are truly clever and imaginative.\n\nPerhaps the most popular one out there is tied to Alex's cliffhanger. In the finale, Alex was fighting for his life after it was revealed that he shot himself.\n\nWe never saw this happen on screen, and fans have suggested that Tyler actually shot him instead. The theory points out that Tyler had a stash of guns hidden in his room, and that he ominously took down Alex's photo that he had previously hung up in his studio.\n\nNetflix\n\nHowever, Miles Heizer (who plays Alex) has appeared to dismiss that theory.\n\n\"That's another subject that's very rarely shown on screen and is probably a lot more common than people think it is: people attempting to take their lives and it not happening. I'm sure that will bring a crazy set of issues. It would be interesting to go into that,\" he said.\n\nThat's not all. Alex was seen in an ambulance – but if you ask some fans, they think that scene is actually a flashforward and it's not Alex there at all. Maybe it's Bryce. Maybe it's Justin.\n\nAs for Tyler's stash of guns, one common theory is that he is planning a school shooting.\n\nNetflix\n\nTyler had photos of numerous other students (including Clay) in his studio – people who have wronged and bullied him. Maybe these students are the targets, and maybe he actually took down Alex's picture because he had decided to spare him (the opposite of the 'Tyler shoots Alex' theory).\n\nLastly, a lot of fans seem to think that Tony is either a ghost or a figment of Clay's imagination.\n\nThis one is a little more difficult to swallow (and indeed, Christian Navarro himself has shot that down), mainly because we have seen Tony interacting with plenty of other characters besides Clay, but it's interesting nonetheless...\n\nSuicide is preventable. Readers who are affected by the issues raised in 13 Reasons Why are encouraged to contact Samaritans on 116 123 (www.samaritans.org), or Mind on 0300 123 3393 (www.mind.org.uk). Readers in the US are encouraged to contact the National Suicide Prevention Line on 1-800-273-8255.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/19/1494757654-13-reasons-why-clay-ep1c.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=300:*", "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "keywords": [], "authors": ["Ben Lee"], "canonical_link": "https://www.digitalspy.com/tv/ustv/a828387/13-reasons-why-season-2-release-date-trailer-cast-theories-spoilers/", "title": "release date, trailer, cast, theories and everything you need to know", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "13 Reasons Why season 2: Everything you need to know", "description": "Their story isn't over.", "url": "http://www.digitalspy.com/tv/ustv/a828387/13-reasons-why-season-2-release-date-trailer-cast-theories-spoilers/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-11-28 08:29:26", "published_time": "2018-05-01 08:21:00", "section": "US TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "13 Reasons Why season 2 on Netflix - release date, trailer, cast, theories and everything you need to know", "description": "Netflix's 13 Reasons Why season 2 news and details in full.", "keywords": "13 Reasons Why season 2, 13 Reasons Why season 2 release date, 13 Reasons Why season 2 trailer, 13 Reasons Why season 2 cast, 13 Reasons Why theories, 13 Reasons Why fan theories, 13 Reasons Why season 2 spoilers, 13 Reasons Why Netflix", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=0.5625xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,ustv,Ajionus Alexus,Amy Hargreaves,Zach Dempsey,Tommy Dorfman,Brandon Flynn,Michele Selene Ang,Alisha Boe,Devin Druid,Justin Prentice,Miles Heizer,Brian Yorkey,Timothy Granaderos,Katherine Langford,Christian Navarro,Dylan Minnette,Kate Walsh,Selena Gomez", "sailthru.date": "2018-05-01T08:21:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=1xw:0.8888888888888888xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/16/1492519018-13-reasons-why-hannah-finale-2.jpg?crop=0.5625xw:1xh;center,top", "sailthru.socialtitle": "13 Reasons Why season 2: Everything you need to know", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525134060.0, "source": "https://www.digitalspy.com", "summary": ""}