{"url": "www.thedailybeast.com/katie-holmes-long-road-to-freedom-from-tom-cruise", "text": "This week, in the midst of rising panic and gathering storms, some lucky paparazzi spotted the tabloid equivalent of the Loch Ness Monster.\n\nIn an industry of repetitive stories, unsubstantiated rumors, and Bachelor covers, these fateful shots of Jamie Foxx and Katie Holmes holding hands on the beach in Malibu immediately made waves. To understand the magnitude of Holmes and Foxx’s PDA, you have to venture back four years ago, to a pre-Trump era when Brangelina was still a thing and nobody knew what a Chainsmoker was. In 2013, photos surfaced of Foxx and Holmes dancing together at a Hamptons charity event. Ever since then, the rumored duo has gone to great lengths to insist that they’re just friends, with varying degrees of success. In an October 2013 interview, Foxx called the dating rumors “one hundred percent not true.” Again in 2015, Foxx strongly reacted to the relationship rumors, retorting, “What I’ve learned about society today is that they’re so thirsty. Especially in tabloid world and social media world, they’re so thirsty to find any story… Sometimes when you read the stuff you’re like, ‘Wow! That’s so not true!’” Holmes has refused to engage with the topic altogether. When pressed on her relationship status in 2016, the actress replied, “That’s not something I want to answer.”\n\nDespite JamKat’s press defensive, there have been numerous leaks over the course of the alleged half-decade that they’ve been allegedly dating. A blurry 2015 photo of the duo holding hands in a recording studio is perhaps the most damning evidence, along with a 2016 interview with Foxx’s friend, reality TV star Claudia Jordan, who gushed that Foxx “is very happy with [Holmes].” Jordan quickly walked back her inadvertent confirmation, subsequently telling ET that, “I have no knowledge of Jamie with Katie at all,” adding, “I’ve never seen them together. He’s never told me he’s dating her.”\n\nStill, as months and years passed, rumors of this celebrity coupling persisted. Anonymous sources insisted on Jamie and Katie’s relationship status and tabloids, sensing a story even bigger and more factually accurate than Jennifer Aniston’s phantom pregnancy, never gave up. While any secret celebrity dating scenario is fodder for a People cover or a clickbait headline, JamKat is a particularly elusive and fascinating pairing. That’s because Foxx and Holmes’ intense secrecy is rumored to be a condition of Holmes’ 2012 divorce from Tom Cruise, which was itself the ending of one of the most widely discussed and analyzed marriages in celebrity history.\n\nLong before Holmes and Cruise started dating, the leading man had a reputation for strange behavior—the alleged result of his close relationship with the Church of Scientology.\n\nOne of the main celebrity faces of Scientology, Cruise appeared to have, at some point, handed over the reins of his personal life to the church. In Going Clear: Scientology and the Prison of Belief, Alex Gibney’s 2015 documentary, Marty Rathbun, a former high-ranking Scientologist, confesses that he was assigned to sabotage Cruise’s second marriage: “I was to facilitate the breakup with Nicole Kidman.”\n\nAccording to the film, Scientology head David Miscavige—a good friend of Cruise’s—became suspicious of Kidman when she began to influence Cruise away from the church. Gibney’s film claims that over the course of their marriage, Cruise even stopped returning Miscavige’s calls. At that point, the documentary alleges, Miscavige resolved to get Kidman out of the picture. Rathbun elaborates that this campaign included spying on/wiretapping Kidman, “auditing” Cruise, and “re-educating” the couple’s adopted children, Connor and Isabella. This all culminated in 2001, when Cruise divorced Kidman.\n\nA 2012 Vanity Fair article claimed that Miscavige subsequently made it his mission in 2004 to find Cruise a new girlfriend. Maureen Orth reported that, “The organization devised an elaborate auditioning process in which actresses who were already Scientology members were called in, told they were auditioning for a new training film, and then asked a series of curious questions including: ‘What do you think of Tom Cruise?’” The search party, Orth reported, eventually landed on Homeland actress Nazanin Boniadi. Between 2004 and 2005, Boniadi reportedly dated the actor: “In a month-long preparation in October 2004, she was audited every day, a process in which she told a high-ranking Scientology official her innermost secrets and every detail of her sex life. Boniadi allegedly was told to lose her braces, her red highlights, and her boyfriend.”\n\nWhen Boniadi was eventually flown to New York to meet her new boyfriend, she was given a confidentiality agreement “specifically about Cruise,” claimed Vanity Fair. And while the relationship was initially successful, the actress quickly found herself running afoul of both Cruise and Miscavige: “By the third week in January, she was asked to move into Scientology’s Celebrity Centre. Boniadi was told that Cruise ‘wants someone with her own power—like Nicole.’ When she asked why Cruise would not break up with her himself, she was told he was not to be disturbed.” (The Church of Scientology did not respond to The Daily Beast’s requests for comment prior to publication.)\n\nBy April of 2005, Cruise was dating actress Katie Holmes, and just one month later he was enthusiastically holding forth on his budding relationship while jumping on Oprah Winfrey’s couch.\n\nAccording to journalist Tony Ortega, who’s covered the church since 1995, “Katie made the effort initially to become a Scientologist herself, and then escaped later.” Ortega told The Daily Beast about the actress’ Scientology handler, Jessica Rodriguez, who was reportedly assigned to accompany Holmes during the Batman Begins press tour, recalling, “Jessica was answering questions for Katie in interviews, and it was really, really weird.” Rumors of strange behavior and restrictions abounded during the couples’ six-year marriage. (Miscavige was Cruise’s best man at his and Holmes’ 2006 wedding.) According to one particularly striking claim, Cruise allegedly insisted that “his wife stay silent while she was giving birth to baby Suri,” in keeping with Scientology founder L. Ron Hubbard’s belief that absolute silence ought to be maintained throughout delivery.\n\nAs The Daily Beast previously reported, the final straw allegedly came when Holmes began to suspect that she would soon be separated from her and Cruise’s young daughter, Suri: “When Cruise and Holmes split in 2012, it was amidst rumors that the star feared her husband was planning to ship their daughter Suri off to Sea Org—an elite training division of the Church that requires its members to sign a ‘billion-year contract.’” Cruise and Holmes’ hasty settlement, which was finalized just 10 days after Holmes filed for divorce, reportedly stipulated that Suri would have no relationship with the Church of Scientology. Unfortunately, this agreement appears to have wreaked havoc on Suri’s relationship with her father, as the two are rarely seen together. In late June, InTouch reported that Cruise hadn’t seen his 11-year-old daughter in person in “more than 1,381 days.” This alleged separation is less shocking in light of the church’s practice of “disconnecting” congregants from family members who disapprove of Scientology.\n\nA RadarOnline report from last year alleged Holmes and Foxx’s secrecy may also be a result of that high-stakes divorce settlement. The gossip site published a source who claimed that, “Katie signed a clause in her quickie divorce settlement that prevents her from embarrassing Tom in various ways, like talking about him or Scientology, or publicly dating another man for five years after the divorce.\n\n“She’s allowed to date, but she cannot do so in a public fashion, and she’s not supposed to let any boyfriend near their daughter, Suri,” the source continued. “Katie wanted out of the marriage so badly, she agreed to the terms—and got $4.8 million in child support, plus another $5 million for herself.”\n\nAnd the timing works out: Holmes and Cruise finalized their divorce in June 2012, meaning that the exes have only recently passed the five-year mark. If the rumors are true, Holmes and Foxx are now free to shout their love from the couches without fear of reprisal from Holmes’ bizarre ex.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1504827191/170907-zimmerman-holmes-cruise-tease_xjskrn", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504827191/170907-zimmerman-holmes-cruise-tease_xjskrn"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504827191/170907-zimmerman-holmes-cruise-tease_xjskrn", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/katie-holmes-long-road-to-freedom-from-tom-cruise", "title": "Tom Cruise’s Strange Hold Over Katie Holmes: From Scientology Minders to the ‘Dating Ban’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Tom Cruise’s Strange Hold Over Katie Holmes: From Scientology Minders to the ‘Dating Ban’", "keywords": "Church of Scientology, Nicole Kidman, Scientology, Tom Cruise, David Miscavige, Katie Holmes, Jamie Foxx", "og": {"title": "Tom Cruise’s Strange Hold Over Katie Holmes: From Scientology Minders to the ‘Dating Ban’", "description": "Rumors have surfaced that a five-year ‘dating ban’ has finally ended, allowing Holmes and beau Jamie Foxx to date publicly. But Cruise’s odd history with women doesn’t stop there.", "url": "https://www.thedailybeast.com/katie-holmes-long-road-to-freedom-from-tom-cruise", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504827191/170907-zimmerman-holmes-cruise-tease_xjskrn"}, "description": "Rumors have surfaced that a five-year ‘dating ban’ has finally ended, allowing Holmes and beau Jamie Foxx to date publicly. But Cruise’s odd history with women doesn’t stop there.", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-09-08T05:00:00.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1504827191/170907-zimmerman-holmes-cruise-tease_xjskrn"}, "sailthru.date": "2017-09-08T05:00:00.000Z", "sailthru.expire_date": "2017-09-22T05:00:00.000Z", "publicationDate": 201709080500, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/katie-holmes-long-road-to-freedom-from-tom-cruise\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"FOR THE LOVE OF XENU\"},\"post_id\":\"katie-holmes-long-road-to-freedom-from-tom-cruise\",\"pub_date\":\"2017-09-08T05:00:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Church of Scientology\",\"Nicole Kidman\",\"Scientology\",\"Tom Cruise\",\"David Miscavige\",\"Katie Holmes\",\"Jamie Foxx\",\"typeArticle\"],\"title\":\"Tom Cruise’s Strange Hold Over Katie Holmes: From Scientology Minders to the ‘Dating Ban’\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/frlf0Dpx9V8?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1504846800.0, "source": "http://www.thedailybeast.com", "summary": ""}