{"url": "http://www.whitehouse.gov/the-press-office/2013/08/06/remarks-president-responsible-homeownership", "text": "Desert Vista High School\n\nPhoenix, Arizona\n\n1:00 P.M. MST\n\nTHE PRESIDENT: Hey! Hello, Phoenix! (Applause.) Hello, Arizona! (Applause.) It is --\n\nAUDIENCE MEMBER: We love you, Obama!\n\nTHE PRESIDENT: I love you back. It is good to be here. (Applause.)\n\nI want to say thank you to the Thunder for hosting us here today. (Applause.) Well, we are so glad to be here. I want you to give it up for somebody who’s been fighting for homeowners and working families every single day, who’s with me today -- Secretary Shaun Donovan, Secretary of HUD. There he is right there. Give him a big round of applause. (Applause.) We’ve got Congressman Ed Pastor who’s here as well. (Applause.) We’ve got your Mayor, Greg Stanton, here. (Applause.) Doing an outstanding job. And to all the mayors and state legislators and tribal leaders who are here today, thank you. (Applause.)\n\nGive Jorge a big round of applause for his introduction. (Applause.) To your superintendent, Dr. Kenneth Baca. (Applause.) Your principal, Dr. Anna Battle. (Applause.) And I appreciate everybody at Desert Vista for having me here today. (Applause.) It is good to see the students are pretty enthusiastic about being back in school. (Laughter.) I’m not sure I would have been that enthusiastic starting on the 6th. (Laughter.)\n\nAnd I know this isn’t your typical school -- second day of school. So I want to give a special shout-out to the new seniors, class of 2014. (Applause.) You are aware that you’re not finished yet. (Laughter.) Senior year, that’s sometimes tempting. I want you all to stay focused.\n\nOver the past couple weeks, I have been --\n\nAUDIENCE MEMBER: Happy birthday, Mr. President!\n\nTHE PRESIDENT: Thank you very much. Thank you. (Applause.) It was my birthday two days ago. (Laughter.) Got some singers here.\n\nAUDIENCE: Happy birthday to you, happy birthday to you, happy birthday, Mr. President. (Applause.)\n\nTHE PRESIDENT: Thank you. Thank you. Thank you. (Applause.) I am now 52, and Michelle says that I don’t look a day over 51. (Laughter.)\n\nSo over the last few weeks, I’ve been visiting towns all across the country, talking about what we need to do to secure a better bargain for the middle class -- a national strategy to make sure that everybody who works hard has a chance to succeed in the 21st century economy.\n\nAnd I think people in Arizona especially understand the challenges that are out there, because for the past four and a half years, together, we fought our way back from a devastating recession that cost millions of jobs for Americans. A lot of folks lost their homes; a lot of folks lost their savings. And what the recession showed was the long erosion of middle-class security that had been taking place for decades.\n\nBut we fought back. We took on a broken health care system. We took on a housing market that was in free fall. We invested in new technologies to reverse our addiction to foreign oil. We changed a tax code that had become tilted a little bit too much in favor of the wealthiest Americans at the expense of working families. (Applause.) We saved the auto industry. We’ve now got GM that plans to hire a thousand new workers right next door in Chandler to make sure we’re building some of the best cars in the world right here in the United States of America. (Applause.)\n\nOur businesses have created 7.3 million new jobs over the past 41 months. We now sell more products made in America to the rest of the world than ever before. Our exports are way up. We produce more renewable energy than ever before, more natural gas than anybody else. Health care costs have been growing at the slowest rate in 50 years. And our deficits are coming down at the fastest rate in 60 years. So we’re making progress. (Applause.)\n\nSo thanks to the efforts of a lot of people like you, we’ve cleared away the rubble of the financial crisis. We’re starting to lay the foundation for more stable, more durable economic growth. But as any middle-class family will tell you, we’re not yet where we need to be. Because even before the crisis hit, we had lived through a decade where a few at the top were doing better and better, but most families were working harder and harder just to get by.\n\nAnd reversing this trend should be -- must be -- Washington’s highest priority. It’s my highest priority. (Applause.) I want to make sure that in America, it doesn’t matter what you look like, where you come from, who you love -- you should be able to make it when you try. You should be able to make it. (Applause.)\n\nNow, unfortunately, for the last year or so, we’ve had an endless parade of distractions and political posturing and phony scandals that shift focus away from what do we need to do to shore up middle-class families and create ladders of opportunity for folks to get into the middle class. And as Washington heads towards another budget debate, the stakes could not be higher.\n\nAnd that’s why I’m traveling around, laying out my ideas for how we have to build the cornerstones of what it means to be middle class: a good job with good wages; a home to call your own; a good education; affordable health care that’s there for you when you get sick; a secure retirement even if you’re not rich; the opportunity -- the ladders of opportunity for people to earn their way into the middle class, to work their way out of poverty. Those are the elements that I think all of us believe in, but right now we're not delivering as much as we should on those promises.\n\nNow, last Tuesday, I went to Tennessee to talk about the first cornerstone, which is how do we make sure that we're creating good middle-class jobs here in the United States of America. Today I've come to Phoenix to talk about the second component, which is the most tangible cornerstone that lies at the heart of the American Dream, at the heart of middle-class life -- and that's the chance to own your own home. (Applause.) The chance to own your own home.\n\nWe've got a lot of young people here who are thinking about college, they're going to get a higher education, they're going to find a job, they're going to find somebody they love, they're going to want to own a home. And the reason they will is because a home is the ultimate evidence that here in America, hard work pays off, that responsibility is rewarded.\n\nI think about my grandparents’ generation. When my grandfather served in World War II, he fought in Patton's Army -- when he got back, this country gave him a chance to go to college on the G.I. Bill, but it also gave him the chance to buy his first home with a loan from the FHA. To him, and to generations of Americans before and since, a home was more than just a house. It was a source of pride and a source of security. It was a place to raise kids, to put down roots; a place where you could build up savings for college, or to start a business, or to retire with some security.\n\nAnd buying a home required responsibility on everybody’s part. You had to save up to buy a home. And then banks were supposed to give you a fair deal, with terms you could understand, and buyers were supposed to live within their means and make sure that they could make their payments. So in that earlier generation, houses weren’t for flipping around, they weren’t for speculation -- houses were to live in, and to build a life with.\n\nAnd unfortunately, over time, responsibility too often gave way to recklessness. You had reckless lenders who sold loans to people they knew couldn’t afford them. And let's face it, we also had some reckless buyers who knew they couldn’t afford them and still took out loans. And all this created a housing bubble. And especially in some places like Arizona, it was devastating when that bubble finally burst -- triggered a recession. Millions of Americans who had done everything right were hurt badly by the actions of other people. Housing prices plummeted.\n\nBy the time I took office, home values had fallen almost 20 percent from the year before. New housing starts had fallen nearly 80 percent from their peak. Hundreds of thousands of construction workers had lost their jobs. A record number of people were behind on their mortgage payments. And a lot of people here in Phoenix, they saw that devastation. This was part of Ground Zero for the housing bubble bursting.\n\nSo less than a month after I took office, I came here to Arizona and I laid out steps to stabilize the housing market and help responsible homeowners get back on their feet. And the truth is it's been a long, slow process. The housing market is so big that it was going to take some time to heal when it got hurt that badly. It's taken longer than any of us would like. But during that time, we helped millions of Americans save an average of $3,000 each year by refinancing at lower rates. We helped millions of responsible homeowners stay in their homes, which was good for their neighbors because you don't want a bunch of foreclosure signs in your neighborhood.\n\nWhere Congress wouldn’t act, we went ahead and acted, so over the past few years, we had the Department of Justice stand up for buyers who had been discriminated against or conned by predatory lending. And we won a settlement that gave more money to victims of discrimination in one year than in the previous 23 years combined. (Applause.)\n\nWe worked with states to force big banks to repay more than $50 billion to more than 1.5 million families -- largest lending settlement in history. (Applause.) We extended the time that folks who had lost their jobs could delay their payment on their mortgages while they kept looking for work. We cracked down on the bad practices that led to the crisis in the first place. I mean, you had some loans back there in the bubble that were called “liar’s loan.” Now, something that's called a liar's loan is probably a bad idea. (Laughter.)\n\nSo because of all these actions we've been taking, our housing market is beginning to heal. Home prices are rising at the fastest pace in seven years. Sales are up nearly 50 percent. Construction is up nearly 75 percent. New foreclosures are down by nearly two-thirds. Millions of families have been able to come up for air -- they’re no longer underwater on their mortgages. (Applause.)\n\nAnd just like the crisis hit Phoenix very hard, thanks to some great leadership here locally, Phoenix has also led one of the biggest comebacks in the country. (Applause.) So you should be proud of what you've done here. Home prices in Phoenix have risen by nearly 20 percent over the last year. New home sales are up by more than 25 percent.\n\nThis morning, right before I came here, I visited Erickson Construction -- (applause.) We've got some Erickson folks here. And they were explaining how right when the bubble hit, Erickson shrank to less than a hundred workers. Today they're employing 580 people -- and they’re hiring even more people -- (applause) -- because the housing market is bouncing back.\n\nSo that's one of the things about housing. It's not just important for the person who owns the house; our economy is so impacted by everything that happens in housing. Consumers feel better when their home values are in a better place, so they're more willing to spend. A lot of people who want to start a business, their savings may be locked up in their house. Construction workers, contractors, suppliers, carpet makers, all these folks are impacted by the housing industry.\n\nSo we've made progress, and that's helped to move the economy forward. But we've got to build on this progress. We're not where we need to be yet. We've got to give more hardworking Americans the chance to buy their first home. (Applause.) We have to help more responsible homeowners refinance their mortgages, because a lot of them still have a spread between the rates they're paying right now on their mortgage and what they could be getting if they were able to refinance.\n\nAnd we’ve got to turn the page on this kind of bubble-and-bust mentality that helped to create this mess in the first place. (Applause.) We got to build a housing system that is durable and fair and rewards responsibility for generations to come. That's what we’ve got to do. (Applause.)\n\nSo I’ve already put forward a bunch of ideas that will help accomplish that. And, look, the fact of the matter is Congress hasn’t enacted all of them, so I’d like you to encourage members of Congress to take some of these actions. (Applause.)\n\nBut like the other actions that we’ve taken, these will not help the neighbors down the street who bought a house that they couldn’t afford, and then walked away from it and left a foreclosed home behind. We don't want to help speculators who bought multiple homes just to make a quick buck.\n\nWhat we want to do is put forward ideas that will help millions of responsible, middle-class homeowners who still need relief. And we want to help hardworking Americans who dream of owning their own home fair and square, have a down payment, are willing to make those payments, understand that owning a home requires responsibility. And there are some immediate actions we could take right now that would help on that front, that would make a difference. So let me just list a couple of them.\n\nNumber one: Congress should pass a good, bipartisan idea to allow every homeowner the chance to save thousands of dollars a year by refinancing their mortgage at today’s rates. (Applause.) We need to get that done. We’ve been talking about it for a year and a half, two years, three years. There’s no reason not to do it. (Applause.)\n\nStep number two: Now that we’ve made it harder for reckless buyers to buy homes that they can’t afford, let’s make it a little bit easier for qualified buyers to buy the homes that they can afford. (Applause.) So Shaun Donovan has been working with the finance industry to make sure we’re simplifying overlapping regulations; we’re cutting red tape for responsible families who want to get a mortgage but keep getting rejected by the banks. We need to give well-qualified Americans who lost their jobs during the crisis a fair chance to get a loan if they’ve worked hard to repair their credit.\n\nAnd step three is something that you don’t always hear about when it comes to the housing market, and that is fixing our broken immigration system. It would actually help our housing market. (Applause.)\n\nIt’s pretty simple: When more people buy homes and play by the rules, home values go up for everybody. And according to one recent study, the average homeowner has already seen the value of their home boosted by thousands of dollars just because of immigration. And the good news is, with the help of your Senators, John McCain and Jeff Flake, the Senate has already passed a bipartisan immigration bill. It’s got the support of CEOs and labor and law enforcement. (Applause.) This could help homeownership here.\n\nSo I want you to encourage Republicans in the House of Representatives to stop dragging their feet. Let’s go ahead and get this done.\n\nStep number four: We should address the uneven recovery by rebuilding the communities hit the hardest by the housing crisis, including many right here in Arizona. Let’s put construction back -- construction workers back to work repairing rundown homes, tearing down vacant properties so that the value of homes in those surrounding areas start picking up. We can put people to work right now and improve the remaining housing stock that's out there. (Applause.) Places that are facing a longer road back from the crisis should have their country’s help to get back on their feet.\n\nStep five: We should make sure families that don’t want to buy a home or can’t yet afford to buy one still have a decent place to rent. (Applause.) It’s important for us to encourage homeownership, but a lot of people rent and there’s nothing wrong with renting. And we got to make sure that we are creating affordable opportunities when it comes to rental properties.\n\nIn the run-up to the crisis, banks and governments too often made everybody feel like they had to own a home, even if they weren’t ready and didn't have the payments. That’s a mistake we should not repeat. Instead, let’s invest in affordable rental housing. Let’s bring together cities and states to address local barriers that drive up rents for working families. (Applause.)\n\nSo if we help more Americans refinance their homes, if we help qualified families get a mortgage, we reform our immigration system, we rebuild the hardest-hit communities, we make sure that folks have a decent place to rent if they're not yet able to buy -- all these steps will give more middle-class families the chance to either buy their own home now or eventually buy their own home. It's going to give more relief to responsible homeowners. It gives more options to families who aren’t yet ready to buy. All that is going to improve the housing market and will improve the economy.\n\nBut -- and this is the last key point I want to make -- as home prices rise, we can’t just re-inflate another housing bubble. I hope everybody here in Arizona learned some hard lessons from what happened. Housing prices generally don't just keep on going up forever at the kind of pace it was going up. It was crazy. So what we want to do is something stable and steady. And that's why I want to lay a rock-solid foundation to make sure the kind of crisis we went through never happens again. We've got to make sure it doesn't happen again. (Applause.)\n\nAnd one of the key things to make sure it doesn't happen again is to wind down these companies that are not really government, but not really private sector -- they're known as Freddie Mac and Fannie Mae. For too long, these companies were allowed to make huge profits buying mortgages, knowing that if their bets went bad, taxpayers would be left holding the bag. It was “heads we win, tails you lose.” And it was wrong. And along with what happened on Wall Street, it helped to inflate this bubble in a way that ultimately killed Main Street.\n\nSo the good news is, right now there’s a bipartisan group of senators working to end Fannie and Freddie as we know them. And I support these kinds of reform efforts. And they're following four core principles for what I believe this reform should look like.\n\nFirst, private capital should take a bigger role in the mortgage market. I know that sounds confusing to folks who call me a socialist -- I think I saw some posters there on the way in. (Laughter.) But I actually believe in the free market. And just like the health care law that we put in place, Obamacare -- (applause) -- which, by the way, if you don't have health insurance or you're buying it at exorbitant rates on the individual market, starting on October 1st, you can join a marketplace and be part of a pool that gives you much lower premiums, saves you a lot of money. (Applause.)\n\nBut in the same way that what we did with health care was to set up clear rules for insurance companies to protect consumers, make it more affordable, but still built on the private marketplace, I believe that our housing system should operate where there's a limited government role and private lending should be the backbone of the housing market. And that includes, by the way, community-based lenders who view their borrowers not as a number, but as a neighbor. So that's one principle.\n\nA second principle is we can't leave taxpayers on the hook for irresponsibility or bad decisions by some of these lenders or Fannie Mae or Freddie Mac. (Applause.) We've got to encourage the pursuit of profit, but the era of expecting a bailout after you pursue your profit and you don't manage your risk well -- well, that puts the whole country at risk. And we're ending those days. We're not going to do that anymore. (Applause.)\n\nThe third principle is we should preserve access to safe and simple mortgage products like the 30-year, fixed-rate mortgage. That’s something families should be able to rely on when they're making the most important purchase of their lives. (Applause.)\n\nNumber four, we've got to keep housing affordable for first-time homebuyers -- like all these young people. When they're ready to buy a house, we've got to make sure it's affordable. Families who are working to climb their way into the middle class, we've got to do what we can to make housing affordable. And that means we've got to strengthen the FHA so it gives today’s families the same kind of chance it gave my grandparents to buy a home, and it preserves those rungs on the ladder of opportunity.\n\nAnd we've got to support, as I said, affordable rental housing. And, by the way, we've also got to keep up our fight against homelessness. (Applause.) The Mayor of Phoenix has been doing a great job here in Phoenix on that front. We've got to continue to improve it. (Applause.)\n\nSince I took office, we helped bring one in four homeless veterans off the streets. (Applause.) We should be proud of that. Here in Phoenix, thanks to the hard work of everyone from Mayor Stanton to the local United Way to US Airways, you’re on track to end chronic homelessness for veterans, period, by 2014. (Applause.)\n\nBut we've got to keep going, because nobody in America, and certainly no veteran, should be left to live on the streets. (Applause.)\n\nSo here's the bottom line: Put all these principles together, that's going to protect our entire economy and it will improve the housing market not just here in Phoenix, but throughout the state and throughout the country.\n\nWe're also going to need to make sure, though, that we're protecting individual homeowners. We've got to give them the tools that they can protect themselves. So we've got a Consumer Finance Protection Bureau that we created. (Applause.) And it's laying down new rules of the road that everybody can count on when they’re shopping for a mortgage. They’re designing a new, simple mortgage form that will be in plain English, so you can actually read it without a lawyer -- (applause) -- although, you may still want a lawyer obviously. I'm not saying you don't. I'm just saying you'll be able to read it. (Laughter.) There won't be a lot of fine print. That way you know before you owe. (Laughter and applause.)\n\nAnd the Senate finally confirmed Richard Cordray as the head of this -- head watchdog for the CFPB. (Applause.) So he's out there aggressively protecting consumers and homeowners.\n\nWhen it comes to some of the other leaders we need to look out for the American people, the Senate still has a job to do. Months ago, I nominated a man named Mel Watt to be our nation’s top housing regulator. He is an outstanding member of Congress. And during that time, he was on the Housing Committee -- worked with banks, worked with borrowers to protect consumers, to help responsible lenders provide credit. He is the right person for the job. Congress and the Senate should give his nomination an up or down vote without any more obstruction or delay. We don't have time for those kinds of games. (Applause.)\n\nSo I want to be honest with you. No program or policy is going to solve all the problems in a multi-trillion dollar housing market. The housing bubble went up so high, the heights it reached before it burst were so unsustainable, that we knew it was going to take some time for us to fully recover. But if we take the steps that I talked about today, then I know we will restore not just our home values, but also our common values. We’ll make owning a home a symbol of responsibility, not speculation -- a source of security for generations to come, just like it was for my grandparents. I want it to be just like that for all the young people who are here today and their children and their grandchildren. (Applause.)\n\nAnd if we stay focused on middle-class security and opportunities to get into the middle class, if we take the strategy that I'm laying out for the entire economy -- for jobs and housing and education, health care, retirement, creating ladders of opportunity -- then we will secure that better bargain for all Americans, where hard work is once again rewarded with a shot at a middle-class life, which means more Americans will know the pride of that first paycheck. More Americans will know the satisfaction of flipping the sign to “Open” on their own business. More Americans will know the joy of scratching the child’s height on the door of their new home -- with pencil, of course. (Laughter.)\n\nWe can do all this if we work together. And it won’t be easy. But if we take just a few bold steps -- and if Washington will just end the gridlock, set aside the slash-and-burn partisanship -- (applause) -- actually try to solve problems instead of scoring political points, our economy will grow stronger a year from now, five years from now, 10 years from now. (Applause.)\n\nAnd as long as I've got the privilege to serve as your President, that's what I'm going to be fighting for.\n\nThank you very much, everybody. God bless you. (Applause.)\n\nEND 1:35 P.M. MST", "images": ["https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "https://obamawhitehouse.archives.gov/profiles/forall/modules/custom/gov_whitehouse_www/images/icons/wh_logo_seal.png"], "top_img": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "keywords": [], "authors": [], "canonical_link": "https://obamawhitehouse.archives.gov/the-press-office/2013/08/06/remarks-president-responsible-homeownership", "title": "Remarks by the President on Responsible Homeownership", "meta_data": {"msapplication-square70x70logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-TileImage": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-square150x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-150x150.png", "msapplication-wide310x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x150.png", "msapplication-square310x310logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x310.png", "msapplication-TileColor": "#003C80", "application-name": "Whitehouse", "msapplication-config": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/browserconfig.xml", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "whitehouse.gov", "type": "article", "title": "Remarks by the President on Responsible Homeownership", "url": "https://obamawhitehouse.archives.gov/the-press-office/2013/08/06/remarks-president-responsible-homeownership", "description": "Desert Vista High School Phoenix, Arizona 1:00 P.M. MST", "updated_time": "2013-08-06T18:42:13-04:00", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "secure_url": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "type": "image/jpeg", "width": 240, "height": 240}}, "twitter": {"card": "summary", "site": "@WhiteHouse", "creator": "@WhiteHouse", "title": "Remarks by the President on Responsible Homeownership", "url": "https://obamawhitehouse.archives.gov/the-press-office/2013/08/06/remarks-president-responsible-homeownership", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "width": 240, "height": 240}}, "article": {"published_time": "2013-08-06T18:42:13-04:00", "modified_time": "2013-08-06T18:42:13-04:00"}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width"}, "movies": [], "publish_date": 1375718400.0, "source": "http://www.whitehouse.gov", "summary": ""}