{"url": "https://www.elitedaily.com/p/kylie-jenners-family-vacation-with-travis-scott-stormi-looks-so-ridiculously-beautiful-9522650", "text": "What’s a better way to kick back, relax, and spend time with family than taking a group trip to France? Well, that’s exactly what Kylie Jenner did with boyfriend Travis Scott and daughter Stormi Webster. The family of three traveled to France on Wednesday, June 20, and brought their close friend Jordyn Woods along with them. And to be honest, judging by their photos on Instagram, Kylie Jenner's family vacation with Travis Scott and Stormi looks amazing.\n\nThe trip, it seems, was kind of on the spontaneous side. Scott, who is a rapper, reportedly had a gig in France and Jenner decided to bring the whole family along. The couple took a private jet that flew out of Los Angeles.\n\nA source told E! News that Scott and Jenner first landed in Nice and then went out to Cannes. The source also explained that there was quite a large group with them:\n\nIt was a big group and they looked like they were ready to have some fun.\n\nWow, that definitely sounds like a wild and fun ride. I’m sure they’re having a blast! And, by the looks of things, they are.\n\nJenner posted a photo of herself rocking some sunglasses and looking amazing:\n\nAnd Woods, who is Jenner’s BFF, also posted a shot of herself on her Instagram account:\n\nThis little family vacation has only just gotten started, so the group has shared very few pics so far. But I’m sure more pics are coming.\n\nUnfortunately, I wouldn’t expect any photos of Stormi to show up on social media during this trip. Earlier this month, on June 10, Jenner revealed that she wouldn’t be sharing photos of her daughter anymore.\n\nJenner, who posted a photo of herself with her daughter’s face cropped out, explained to a fan why Storm wasn’t visible:\n\n“Yeah I cut my baby out. I'm not sharing photos of my girl right now,” she wrote in the photo’s comments.\n\nIn addition to announcing this news, Jenner also deleted any and all Instagram photos that included Stormi’s face. So, all those cute pics are gone. Only photos like this one remain:\n\nScott is also following suit and resorting to cropping Stormi out of photos. He recently posted a photo of his and Stormi’s legs. Nothing else. So, Scott and Jenner are serious about not sharing photos of their little one.\n\nThis all comes amid negative comments about the baby, at least according to a June 12 report from People.\n\nIn the report, People cited an unnamed source close to Jenner and Scott. That source revealed that Jenner was feeling especially protective of Stormi:\n\nShe couldn’t wait to show off Stormi to her fans. She posted pictures, because she was so excited to be a mom. Unfortunately, social media is a crazy place … People have been making nasty comments.\n\nElite Daily reached out to Jenner and Scott's teams regarding the report but did not hear back by the time of publication. The source also revealed that Jenner is in total shock over how negative people can be and she wants to make sure her daughter has no part in that:\n\nKylie is shocked and doesn’t want her daughter’s pictures to be a part of something negative. She might reconsider in the future, but for now, she won’t post any more photos of Stormi’s face.\n\nSo, while this overseas trip to France may be a fun photo op for Jenner, Scott, and even Woods, 4-month-old Stormi won’t likely be featured in any pics.\n\nAt the very least, you have to respect that Jenner and Scott are doing what they feel is best for their child. It's a smart move and one that the baby will probably benefit from in the future!\n\nBaby pics or not, though, the family seems to be having a wonderful time over in France! Can't wait to see the rest of their vacation pics!", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/21/93ca8943-2fef-4b9a-9d05-79414b7c6f15-getty-958396664.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/f2d41d12-2957-4f14-83a9-45d955e82f13-getty-930538154.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/21/93ca8943-2fef-4b9a-9d05-79414b7c6f15-getty-958396664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/10/b5088cc2-b75c-439b-818a-871f93e3532e-getty-1209679085.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/6/21/93ca8943-2fef-4b9a-9d05-79414b7c6f15-getty-958396664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kylie-jenners-family-vacation-with-travis-scott-stormi-looks-so-ridiculously-beautiful-9522650", "title": "Kylie Jenner's Family Vacation With Travis Scott & Stormi Looks So Ridiculously Beautiful", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kylie-jenners-family-vacation-with-travis-scott-stormi-looks-so-ridiculously-beautiful-9522650", "type": "article", "title": "Kylie Jenner & Travis Scott Took Stormi On Vacation To France & It Looks So, So Beautiful", "description": "What’s a better way to kick back, relax, and spend time with family than taking a group trip to France? Well, that’s exactly what Kylie Jenner did with boyfriend Travis Scott and daughter Stormi Webster. The family of three traveled to France on…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/6/21/93ca8943-2fef-4b9a-9d05-79414b7c6f15-getty-958396664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "What’s a better way to kick back, relax, and spend time with family than taking a group trip to France? Well, that’s exactly what Kylie Jenner did with boyfriend Travis Scott and daughter Stormi Webster. The family of three traveled to France on…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}