{"url": "https://en.wikipedia.org/wiki/The_Royals_(TV_series)", "text": "The Royals is an American primetime television soap opera[1] that premiered on E! on March 15, 2015. Created by Mark Schwahn and starring Elizabeth Hurley, it is the network's first scripted series. The show began as a loose adaptation of the Michelle Ray novel Falling for Hamlet.[2] E! renewed The Royals for a second season two months before its debut, and picked up a third season on January 5, 2016. E! renewed the series for a fourth season on February 16, 2017; the fourth season premiered on March 11, 2018. On August 16, 2018, it was announced that E! had canceled the series after four seasons. Additionally, it was reported that Lionsgate Television was shopping the series to other networks with discussions already underway for a pick-up by sister network Pop. However, on September 24, 2018, Lionsgate Television announced that it had failed to find a new home for the series and that it was now officially cancelled.\n\nHurley starred as Queen Helena, a fictional contemporary queen consort of England, along with William Moseley and Alexandra Park as her twin children, Prince Liam and Princess Eleanor; Jake Maskall as Helena's brother-in-law and nemesis, the new King Cyrus; Tom Austen as Eleanor's bodyguard and blackmailer, Jasper Frost; and Oliver Milburn as Ted Pryce, the Royal Family's head of security. Season 1 also starred Vincent Regan as Helena's husband, King Simon, and Merritt Patterson as Liam's love interest, Ophelia Pryce.\n\nPlot summary [ edit ]\n\nHelena is the matriarch of a fictional contemporary British royal family who must struggle with both common and atypical family dramas while in the public eye.[3][4] Twins Prince Liam and Princess Eleanor enjoy the hedonistic pleasures available to them as royals, knowing that their older brother Robert bears the responsibility of being heir to the throne of England. But when Robert is killed, the family is thrown into disarray and a grieving King Simon fears for the future of the monarchy. Unexpectedly next in line for the throne, Liam must adjust to his new role while navigating his attraction to Ophelia, the American daughter of the royal head of security. His self-destructive sister Eleanor finds rock-bottom when her bodyguard turns out to be a conman. Trying to preserve the status quo and keep the royal family under her control, Queen Helena allies herself with Simon's brother Cyrus to preserve their way of life at any cost.\n\nCast [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nSeason 1 cast\n\nIn April 2013, E! announced several scripted projects it had in development, including The Royals, a \"contemporary family ensemble is steeped in all of the regal opulence of the British Monarchy and framed by Shakespeare's Hamlet.\"[5] Deadline Hollywood reported in June 2013 that E! would be producing pilots for The Royals and another series named Songbyrd, which would be the network's first scripted pilots to date.[6] The Royals was picked up for series in March 2014, to be shot in the United Kingdom and scheduled to debut in 2015.[7][8][9] Shooting for the first season began in London in June 2014.[10] In August 2014, E! released its first promotional trailer for The Royals.[11][12] The first season consisted of ten episodes.[13]\n\nIn December 2014, E! announced that the series would premiere on March 15, 2015.[14][15][16] The network later announced at the Television Critics Association press tour on January 15, 2015, that the series had been renewed for a second season, two months before its debut.[17][18] E!'s Executive Vice President of Original Programming & Development Jeff Olde noted that production for season two would begin in London in spring 2015.[18] Shooting officially resumed on June 15, 2015,[19] with season two premiering on November 15, 2015.[20] On January 5, 2016, E! renewed The Royals for a third season,[21][22][23] which premiered on December 4, 2016.[24] Several days before the season three finale, the series was renewed for a fourth season on February 16, 2017,[25] which premiered on March 11, 2018.[26]\n\nSchwahn was suspended from the series after the completion of season four filming on November 15, 2017, following sexual harassment allegations against him by female casts and crew of both The Royals and his previous series One Tree Hill came to light.[27] He was subsequently fired from the series on December 22, 2017.[28] On August 16, 2018, it was announced that E! had canceled the series after four seasons. Additionally, it was reported that Lionsgate Television was shopping the series to other networks with discussions already underway for a pick-up by sister network Pop.[29] However on September 24, 2018, it was announced that Lionsgate Television had failed to find a new home for the series and that it was now considered officially ended.[30]\n\nThe production uses Blenheim Palace as its fictional royal palace.[31] In season two, the production also filmed at Allington Castle and Boughton Monchelsea Place in Kent.[32]. Various scenes were filmed at The Historic Dockyard Chatham in Kent in June 2017 for episode 4, season four of The Royals. The locations filmed at the dockyard included The Tarred Yarn Store, HMS Cavalier, Commissioner's House garden and the Ropery Tunnels. Chapel Place in Tunbridge Wells also featured as part of a royal wedding.[33]\n\n(L to R) Park, Hurley, Moseley and Patterson at the 2015 Television Critics Association's Press Tour Park, Hurley, Moseley and Patterson at the 2015 Television Critics Association's Press Tour\n\nCasting [ edit ]\n\nIn September 2013, Hurley was cast in the leading role of Queen Helena.[34] Soon after, Moseley was cast as Helena's son Liam,[35] followed by Park as Liam's twin sister Eleanor and Haley Lu Richardson as his love interest, Ophelia.[36] The rest of the pilot's cast included Regan, Austen, Maskall, Roach and Milburn.[7][8] After the series pickup, Merritt Patterson replaced Richardson as Ophelia in June 2014,[37][38] as shooting for the first season began in London.[10] Additional recurring roles included Bewley and Preston as Cyrus' eccentric daughters Penelope and Maribel,[39] and Colquhoun as Gemma, Liam's heiress ex-girlfriend.[40] In August 2014, People reported that Joan Collins would guest star as the Grand Duchess of Oxford, Helena's mother.[41][42][43]\n\nIn June 2015, Laila Rouass was cast as Rani, the Deputy Prime Minister whom the actress calls \"Elizabeth Hurley's arch-enemy\".[44] For season 2, Hatty Preston was replaced as Princess Maribel with Jerry-Jane Pears, the difference in their appearance explained by plastic surgery.[45]\n\nIn June 2016, Max Brown was cast as Prince Robert, the presumed-dead eldest son of Simon and Helena,[46] and Jules Knight was cast as Spencer Koenigsberg, Helena's new Lord Chamberlain.[47] Genevieve Gaunt, who played Liam's potential love interest Willow in season 2, was also promoted from recurring to series regular for season 3.[47] Hurley's son Damian Hurley was cast in a guest star role in July 2016.[48]\n\nConcept and characterization [ edit ]\n\nThe Royals is loosely based on the Michelle Ray novel Falling for Hamlet.[2] Alessandra Stanley of The New York Times described the show as \"a tongue-in-cheek nighttime soap\" and \"a Dynasty about a real dynasty\".[49] Creator Schwahn said of the series, \"It's a family drama. It's about a family, and it just happens to be a royal family ... [but] not the royal family.\"[50] Hurley called The Royals \"a very nice combination of what the public sees and what the public will never see.\"[51] Of the concept, Schwann said:\n\nI just thought it would be really interesting to take a look behind the curtain ... Who are these people? What do they want? What will they do to get it? I thought it was really fascinating and a great idea for the foundation of a story.[51]\n\nSchwahn said of Hurley, \"I tell her every day that this was the role that she was meant to play ... she has found her lot in life\"[52] Of her character, Hurley commented \"this queen is very matriarchal ... she has a lot of power and I think she knows how to use it.\"[52] She noted, however, that \"there's no correlation at all between Her Majesty Queen Elizabeth and my Queen Helena... If Princess Diana [sic], for example, had become queen of England, that would be a more similar age group.\"[53] Hurley later said that the character of Helena was inspired by Diana, but \"some of it we picked from Cruella de Vil, the Disney character.\"[50] Noting that \"most of the characters on The Royals are going to be walking a fine line between 'good' and 'bad',\"[50] Schwahn said:\n\nElizabeth has been very brave in approaching the more villainous aspects of the character ... I was working with Elizabeth on wardrobe and she asked, 'Why not add in bits of fur? I think the queen should wear bits of cruelty once in a while.'[50]\n\nRegan said of his character, the \"soft-spoken\" King Simon: \"He's coping with a great deal of grief for the loss of his eldest son, Robert ... He's coping with that and trying to work out how the royal family can exist in the world they're now in.\"[52] Moseley commented on his own storyline as playboy Prince Liam, \"it's like (if) Prince Harry was thrown into being the next King of England [sic].\"[53] \"He basically is sort of a rebel ... doesn't really care what anybody thinks, does whatever he wants to do, when he wants to do it,\" he later added.[52] Park said of her wild Princess Eleanor, \"she's young and trying to find where her place is in the world. She's a party girl.\"[52] Austen said of bodyguard Jasper, \"He's a very mysterious character ... you never know what to expect from him. There's a lot of stuff that only Mark [Schwahn] and me know about, so there's a lot of secrets on set.\"[54] Calling the show \"uncompromising\", Austen added, \"It's about the lives of these people and it doesn't try to pretend that they would try to do anything different than the way they would. They're all human beings with flaws, some more than others, and the show doesn't shy away from that.\"[54]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 10 March 15, 2015 ( ) May 17, 2015 ( 2015-05-17 ) 2 10 November 15, 2015 ( ) January 17, 2016 ( 2016-01-17 ) 3 10 December 4, 2016 ( ) February 19, 2017 ( 2017-02-19 ) 4 10 March 11, 2018 ( ) May 13, 2018 ( 2018-05-13 )\n\nPromotion [ edit ]\n\nIn January 2015, Collins commented on the public anticipation for The Royals, saying \"I know there's been a lot of excitement about it in the British press.\"[17] Hurley suggested that fans of Dynasty and Gossip Girl would enjoy the series.[53]\n\nIn March 2015, a viral video of a naked man climbing out a window of Buckingham Palace on a bedsheet during the changing of the Queen's Guard, presumed to be a hoax, was publicized internationally by a variety of media outlets.[55] The video turned out to be a publicity stunt to promote The Royals via the show's own fictional tabloid, D-Throned.[56]\n\nReception [ edit ]\n\nThe initial reviews were largely negative. Jane Mulkerrins of The Telegraph described The Royals as \"a sexy and soapy portrayal of palace life\", but noted that it \"lacks the sophistication\" of Gossip Girl and \"the compelling melodrama\" of The O.C.[57] Alessandra Stanley of The New York Times called the show \"a mischievous sendup\" and Hurley \"amusing\", but said overall that the series \"gets old, and dull, very quickly.\"[49] Nancy Dewolf Smith of The Wall Street Journal described The Royals as \"a trashy soap opera that's not bad enough to be funny and is best when it wallows in melodrama\",[58] and David Wiegand of the San Francisco Chronicle called the show \"entertaining but disappointingly toothless\".[59] The Sydney Morning Herald described the series as \"possibly the worst show in the history of TV\", criticizing it as \"a bunch of bed-hopping halfwits saddled with ... very, very lousy dialogue\".[60] The Independent agreed, calling The Royals \"probably\" the \"worst series ever made\".[61] Vicki Hyman of NJ.com said the show was \"a royal failure,\" describing it as \"crass and, for long stretches, tedious.\"[62] The Hollywood Reporter described The Royals as being \"like an extended MTV music video interspersed with dialogue\" and called it \"interminably boring\".[63] The Los Angeles Times panned the series, declaring that \"camp requires courage, and The Royals has none\",[64] while Margaret Lyons of Vulture said the show was \"flaccid, weirdly paced, and badly cast.\"[65] Variety called The Royals \"bloody bad\",[2] and the Chicago Reader advised viewers to \"think of the worst hour-long prime-time soap operas to have assaulted our senses over the past 30 or so years, then go ahead and add this one to your brain's trash heap.\"[66]\n\nConversely, David Hinckley of the New York Daily News wrote that The Royals \"doesn't pretend to be much more than good fun, and it delivers that.\"[67] Diane Gordon of TheWrap described the show as \"addictive, naughty and just the right amount of silly ... it left me wanting more\".[68] Calling it \"an escapist fantasy\", Amanda Michelle Steiner of People wrote that \"The Royals is everything that's been missing from your life since Gossip Girl and The O.C..\"[39] Ellen Gray of Philly.com also called it \"silly but potentially addictive\".[69] Kevin Fallon of The Daily Beast added that \"once you commit yourself to the trashy abandon of The Royals, the one critique of the show might be that the abandon isn't reckless or campy enough\".[70] Jeff Jensen of Entertainment Weekly agreed, noting that the show \"actually isn't bad ... if anything, you'll wish The Royals were trashier\".[71]\n\nThe performances have generally received praise. Jensen called the acting \"uniformly good\",[71] and Fallon deemed Hurley \"fantastic in this role\".[70] Wiegand added, \"The unquestionable highlight of the series is the mother-and-daughter reunion between Queen Helena [Hurley] and the Grand Duchess of Oxford [Joan Collins]\".[59] Dewolf Smith singled out Park's Eleanor as \"the best and worst of what The Royals has to offer\" and noted that Hatty Preston and Lydia Rose Bewley \"steal their scenes in an Absolutely Fabulous sort of way\".[58] Steiner concurred, writing \"[Preston and Bewley's] banter is possibly the best part of the premiere.\"[39]\n\nU.S. ratings [ edit ]\n\nBroadcast, home video, and streaming [ edit ]\n\nThe Royals airs on E! in the United States and Canada.[14][15][16] It also aired on E! in the United Kingdom and Ireland,[102] although the channel dropped the series after season two.[103] In Germany the series is shown on Pro Sieben.[104] Amazon.com acquired exclusive subscription streaming rights to The Royals in October 2015,[105] making the first season of the show available to stream for Amazon Prime subscribers.[106] The first season is also available on the E Now mobile app (for cable subscribers), as well as the Canadian OTT video service CraveTV.[107] Outside of the SVOD and cable subscription space, the show is available from electronic sell-through platforms such as iTunes,[108] Amazon Instant Video[109] and Vudu.[110]\n\nDVD release [ edit ]\n\nName Release dates Ep # Additional information Region 1 Region 2 Region 4 The Complete First Season August 18, 2015[111] July 27, 2015[112] 10 English/Spanish subtitles The Complete Second Season March 22, 2016[113] April 18, 2016[114] 10 English/Spanish subtitles, Region 1 contains digital copies of episodes", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Alexandra_Park%2C_Elizabeth_Hurley%2C_William_Moseley_%26_Merritt_Patterson_2015_TCA_Press_Tour_%28cropped%29.jpg/220px-Alexandra_Park%2C_Elizabeth_Hurley%2C_William_Moseley_%26_Merritt_Patterson_2015_TCA_Press_Tour_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d3/The_Royals_%282015%29_title.png/220px-The_Royals_%282015%29_title.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/0/06/The_Royals_intertitle.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/The_Royals_intertitle.png/250px-The_Royals_intertitle.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/06/The_Royals_intertitle.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Royals_(TV_series)", "title": "The Royals (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/0/06/The_Royals_intertitle.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}