{"url": "www.theguardian.com/us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election", "text": "This article is more than 3 years old\n\nThis article is more than 3 years old\n\nDonald Trump has accused Barack Obama of “wire tapping” his offices in New York City before the presidential election in November, claiming the former president had overseen a “Nixon/Watergate”-style intervention.\n\nLaunching a series of tweets at 5.35am eastern time on Saturday, the US president said: “Terrible! Just found out that Obama had my ‘wires tapped’ in Trump Tower just before the victory. Nothing found. This is McCarthyism!”\n\nHow Trump lambasted Obama – and Obama trashed Trump Read more\n\nHe followed up that initial tweet with a string of others in the following 30 minutes which claimed Obama had defied a court’s rejection of a request to tap his office, and invited a “good lawyer” to make a case against the alleged operation.\n\n\n\nDonald J. Trump (@realDonaldTrump) Is it legal for a sitting President to be \"wire tapping\" a race for president prior to an election? Turned down by court earlier. A NEW LOW!\n\nDonald J. Trump (@realDonaldTrump) I'd bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!\n\nThe president then compared the alleged surveillance of his communications to Watergate – the scandal in the early 1970s that brought down Republican president Richard Nixon after he ordered a break-in of the Democrat party’s Washington headquarters.\n\nDonald J. Trump (@realDonaldTrump) How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!\n\nTrump also made efforts to defend Jeff Sessions, the US attorney general, who is facing questions over his meeting with the Russian ambassador to Washington during the 2016 presidential election campaign.\n\nHe tweeted: “The first meeting Jeff Sessions had with the Russian Amb was set up by the Obama Administration under education program for 100 Ambs...” .\n\nHe added: “Just out: The same Russian Ambassador that met Jeff Sessions visited the Obama White House 22 times, and 4 times last year alone.”\n\nThere was no additional information provided to substantiate the president’s claims that Obama had “wire tapped” Trump Tower, and it was not clear on what information Trump was basing the allegations.\n\nThere has been no response to the tweets from Obama.\n\nThe Trump administration has been on the back foot over its contacts with Russian officials before the president took office in January.\n\nLast month Michael Flynn was forced to resign as national security adviser over conversations with the Russian ambassador to Washington and misleading statements about them to the press and the vice-president, Mike Pence.\n\nThis week it was revealed that Sessions had two meetings with Sergey Kislyak, the Russian ambassador to the US, last year twhich he failed to disclose to senators during his confirmation hearing.\n\nSessions said on Friday that he would recuse himself from investigations into Russian interference in the 2016 election despite backing from Trump, who described the controversy as “a total witch hunt”.\n\nTrump’s tweets follow claims made by the conservative radio host Mark Levin on his Thursday night show about the alleged steps taken by the Obama administration to undermine the Republican candidate’s campaign to win the White House.\n\n\n\nDonald Trump accuses Obama of orchestrating protests against him Read more\n\nThe presenter called the effort a “silent coup” by the Obama administration and called for a congressional investigation into the issue. That contrasts with demands from across the US political spectrum to examine Russian interference in the presidential election.\n\nLevin’s comments were followed up by Breitbart News, the “alt-right” website formerly run by Steve Bannon, who ran the Trump campaign and is now the president’s chief strategist.\n\n\n\nThe article stated: “The Obama administration sought, and eventually obtained, authorisation to eavesdrop on the Trump campaign; continued monitoring the Trump team even when no evidence of wrongdoing was found; then relaxed the NSA [National Security Agency] rules to allow evidence to be shared widely within the government, virtually ensuring that the information, including the conversations of private citizens, would be leaked to the media.”\n\n\n\nThe Breitbart story references recent claims that the FBI had asked the foreign intelligence surveillance court for a warrant last year to monitor members of the Trump team suspected of being in contact with Russian officials. The request for the warrant was initially rejected before being granted in October, the reports have said.\n\nLindsey Graham, the Republican senator from South Carolina, said: “I am very worried that our president is suggesting that the former president has done something illegally. I would be very worried if, in fact, the Obama administration was able to obtain a warrant lawfully about the Trump campaign activity with foreign governments. It’s my job as a United States senator to get to the bottom of this – I promise you I will.”\n\nThe Democratic congressman Seth Moulton, a member of the House armed services and budget committees, told the MSNBC channel: “This is right out of Donald Trump’s reality TV playbook. He’s trying to distract attention from the real story here, which is his campaign, his administration’s contact with Russian officials ... There’s clearly a deeper story here and we the American people need to know how high this conspiracy goes.”\n\nMoulton added: “Obviously contacts with Russian intelligence officials are monitored – that’s part of maintaining our national security. So if under the Obama administration they were simply monitoring contacts with Russian officials – not trying to wiretap into the Trump campaign but simply looking at who Russian officials were talking with – and then Trump campaign officials got ensnared in that net, then it’s a total mischaracterisation to say President Obama was wiretapping Trump.”\n\nRep Eric Swalwell, a Democrat who is a member of the House intelligence committee, told Fox News that Trump “is not credible when it comes to talking about Russia”.\n\nSwalwell downplayed Trump’s allegations. “I think this is just the president up early doing his routine tweeting, he said. “Presidents don’t wiretap anyone. These are pursued by the Department of Justice in accordance with the FBI and signed off by a judge.”", "images": ["https://i.guim.co.uk/img/media/724f9fd007cd1715f5d0bd99994f097f825c0a0f/0_168_5047_3028/master/5047.jpg?width=300&quality=85&auto=format&fit=max&s=a4e130d4ac828e950433e518b1a4fb2e", "https://i.guim.co.uk/img/media/724f9fd007cd1715f5d0bd99994f097f825c0a0f/0_168_5047_3028/master/5047.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=efdb38dcedeb3b356619a3c5a509957d", "https://i.guim.co.uk/img/media/938bce39625a1c336469dac009e9ae134527dae4/0_243_3648_2189/master/3648.jpg?width=300&quality=85&auto=format&fit=max&s=c48e7bd54434fb8609a2a1b92f0be622", "https://i.guim.co.uk/img/media/d3d65262978ba6ab21eeb8a1345ed86b8ac90cd4/0_186_3452_2071/master/3452.jpg?width=300&quality=85&auto=format&fit=max&s=f17a83ef8a33fa7f41f75a7ab4ea16a3", "https://i.guim.co.uk/img/media/49f1b0f442150eb8d0e66adbe61efe166e37ee13/0_69_3500_2100/master/3500.jpg?width=300&quality=85&auto=format&fit=max&s=d6d570ca79f328b68c7de488038f218b", "https://i.guim.co.uk/img/media/8a252e981436cb96ff9ddcc02f4f91ec52418184/0_315_5039_3023/master/5039.jpg?width=300&quality=85&auto=format&fit=max&s=29b5aa77fa25c8b0c9b8242dceb8406a", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Donald+Trump%2CObama+administration%2CUS+news%2CBarack+Obama%2CSurveillance%2CWorld+news"], "top_img": "https://i.guim.co.uk/img/media/724f9fd007cd1715f5d0bd99994f097f825c0a0f/0_168_5047_3028/master/5047.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=efdb38dcedeb3b356619a3c5a509957d", "keywords": [], "authors": ["Chris Johnston"], "canonical_link": "https://www.theguardian.com/us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election", "title": "'This is McCarthyism!': Trump accuses Obama of 'wire-tapping' his office before election", "meta_data": {"description": "President accuses his White House predecessor of overseeing ‘Nixon/Watergate’-style intervention", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Chris Johnston", "thumbnail": "https://i.guim.co.uk/img/media/724f9fd007cd1715f5d0bd99994f097f825c0a0f/0_168_5047_3028/master/5047.jpg?width=620&quality=85&auto=format&fit=max&s=e242e881331cebb17326ca4b0884e1b6", "keywords": "Donald Trump,Obama administration,US news,Barack Obama,Surveillance,World news", "news_keywords": "Donald Trump,Obama administration,US news,Barack Obama,Surveillance,World news", "og": {"url": "http://www.theguardian.com/us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election", "image": "https://i.guim.co.uk/img/media/724f9fd007cd1715f5d0bd99994f097f825c0a0f/0_168_5047_3028/master/5047.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=efdb38dcedeb3b356619a3c5a509957d", "description": "President accuses his White House predecessor of overseeing ‘Nixon/Watergate’-style intervention", "type": "article", "title": "'This is McCarthyism!': Trump accuses Obama of 'wire-tapping' his office before election", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/chris-johnston", "publisher": "https://www.facebook.com/theguardian", "section": "US news", "published_time": "2017-03-04T17:55:35.000Z", "tag": "Donald Trump,Obama administration,US news,Barack Obama,Surveillance,World news", "modified_time": "2018-02-09T18:48:54.000Z"}, "al": {"ios": {"url": "gnmguardian://us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election", "iphone": "gnmguardian://us-news/2017/mar/04/donald-trump-accuses-obama-of-wire-tapping-his-office-before-election?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/724f9fd007cd1715f5d0bd99994f097f825c0a0f/0_168_5047_3028/master/5047.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&s=fe019c2199c564b7e7873fd24dfa686b", "site": "@guardian", "card": "summary_large_image", "creator": "@cajuk", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1488556800.0, "source": "http://www.theguardian.com", "summary": ""}