{"url": "https://abc.go.com/shows/dancing-with-the-stars/news/dwts-results-and-eliminations/fall-2018-season-27-week-5-results-disney-night", "text": "Dancing with the Stars Disney Night was an enchanting evening full of classic Disney music, plus some new tunes from upcoming Disney movies Ralph Breaks the Internet and The Nutcracker and the Four Realms. The show also features performances by Dancing with the Stars Juniors host Jordan Fisher, the kid pros and kid stars! Here's a recap of Disney Night, including the scores and what judges Carrie Ann Inaba, Len Goodman, and Bruno Tonioli had to say about all the magical Disney Night performances.\n\nVIDEO: Watch all the performances from Week 5: Disney Night\n\nAlexis & Alan: \"The way you danced made me believe in fairy tales,\" said Carrie Ann Inaba after Alexis and Alan's foxtrot to \"Just Around the Riverbend\" from Pocahontas. They received a 10, a 9, and a 10 for a total score of 29 out of 30.\n\nJuan Pablo & Cheryl: Juan Pablo and Cheryl's Viennese Waltz to \"Gaston\" from Beauty & The Beast was \"spot on, on every level!\" cheered Bruno. Carrie Ann called Juan Pablo spectacular. \"You, without a doubt, are a fantastic dancer,\" said Len. This team also received a 10, a 9, and a 10, for a total of 29 out of 30.\n\nJuan Pablo and Cheryl's Beauty & The Beast Viennese Waltz\n\nDeMarcus & Lindsay: \"That is like a Disney movie, you finish it and you just feel great!\" said Len of DeMarcus and Lindsay's Charleston to \"A Star Is Born,\" from Hercules. They earned a 9, an 8, and another 9 for a score of 26 out of 30.\n\nDeMarcus and Lindsay's fun Charleston to \"A Star Is Born\" from Hercules\n\nEvanna & Keo: Evanna and Keo's dance was a Jazz to \"When Will My Life Begin\" from Tangled. \"It had a lovely feel to it\" said Len, but added he couldn't call it a spectacular number. Carrie Ann and Bruno also offered constructive criticism to Evanna, and the couple received three 8s for a total of 24 out of 30.\n\nGrocery Store Joe & Jenna: \"Go Joe!\" said Carrie Ann. \"That was a vast improvement!\" She complimented Joe for not missing any steps. Bruno felt the timing was still not perfect but said Joe did a baby step in the right direction, and Len praised Joe for getting knocked down each week, and coming back to give it his all the following week. Joe and Jenna's Jive to \"Zero\" from the upcoming Disney movie Ralph Breaks the Internet earned them a 6, a 5, and another 6 for a total of 17 out of 30.\n\nGrocery Store Joe and Jenna's Ralph Breaks the Internet Jive\n\nMary Lou & Sasha: Mary Lou was emotional after her Contemporary number with Sasha to \"Reflection\" from Mulan. She credits Dancing with the Stars for helping her be vulnerable and open. Len liked that her dance was gentle and understated, with lovely fluidity. Bruno said he loved her determination and that she doesn't give up. Mary Lou and Sasha received a 9, an 8, and another 8 for a total score of 25 out of 30.\n\nMary Lou and Sasha dance a contemporary to \"Reflection\" from Mulan\n\nJohn & Emma: John and Emma danced a Quickstep to \"I Wan'na Be Like You\" from The Jungle Book, which has been one of John's favorite songs since he was a kid. \"I thought you did a spectacular job!\" said Len, adding, \"It's transpired, in my opinion, to be your best dance to date!\" Bruno and Carrie Ann agreed that it was John's best performance so far, and he received his highest score yet, three 8s for a total of 24 out of 30.\n\nJohn and Emma's Jungle Book Quickstep\n\nBobby & Sharna: Bobby and Sharna did an enchanting Waltz to The Little Mermaid's \"Part Of Your World.\" \"A proper Waltz, and pretty well done,\" proclaimed Len. Carrie Ann advised Bobby to try not to giggle with his whole body while he dances. The judges awarded Bobby and Sharna three 7s, for a total score of 21 out of 30.\n\nMilo & Witney: \"Fantastic performance, full of life, full of zest!\" said Carrie Ann. \"I don't have any complaints about that, it was a blockbuster!\" raved Bruno. The pair, who danced a Quickstep to \"Incredits 2\" from The Incredibles 2, received a 9, an 8, and a 10 for a score of 27 out of 30.\n\nWhile Tom announced that partners DeMarcus and Lindsay and Alexis and Alan were in jeopardy, it turned out no one was going home, because it was Disney Night!\n\nCatch weekly video highlights and watch full episodes of Dancing with the Stars on ABC.com or the ABC app and don't miss Dancing with the Stars LIVE Mondays 8|7c on ABC!", "images": ["https://assets.cdn.watchdisneyfe.com/delta/assets/abc/abc.png", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/showimages/086101c1a6a087ef587c5debf86ba884/350x117-Q80_086101c1a6a087ef587c5debf86ba884.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/close.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/search.png", "http://datg-cms-source-repo.s3-website-us-east-1.amazonaws.com/ABC/150647_4779/993eac62-1c2d-4dcf-b078-df6b69badc21.jpg", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/facebook.png", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2227456/87570d984f0bc27f51673220cea347cd/1000x400-Q90_87570d984f0bc27f51673220cea347cd.jpg", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/twitter.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2227456/87570d984f0bc27f51673220cea347cd/1000x400-Q90_87570d984f0bc27f51673220cea347cd.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.com/shows/dancing-with-the-stars/news/dwts-results-and-eliminations/fall-2018-season-27-week-5-results-disney-night", "title": "DWTS Season 27 Results: Week 5 - Disney Night", "meta_data": {"fb": {"app_id": 137585909851}, "twitter": {"card": "summary_large_image", "site": "@dancingabc", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2227456/87570d984f0bc27f51673220cea347cd/1000x400-Q90_87570d984f0bc27f51673220cea347cd.jpg"}, "og": {"url": "https://abc.com/shows/dancing-with-the-stars/news/dwts-results-and-eliminations/fall-2018-season-27-week-5-results-disney-night", "app_id": 137585909851, "site_name": "ABC", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2227456/87570d984f0bc27f51673220cea347cd/1000x400-Q90_87570d984f0bc27f51673220cea347cd.jpg", "description": "It's Disney Night on Dancing with the Stars. Get the recap now!", "title": "DWTS Season 27 Results: Week 5 - Disney Night | Dancing with the Stars", "locale": "en_US"}, "keywords": "DWTS Season 27 Results: Week 5 - Disney Night, Dancing with the Stars blogs", "description": "It's Disney Night on Dancing with the Stars. Get the recap now!", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "msApplication-ID": "App", "msapplication-TileColor": "#2D2D2D", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileImage": "//cdn1.edgedatg.com/aws/abc/brand/fall2018/favicon_ie10.png", "apple-itunes-app": "app-id=364191819, app-argument=https://abc.com/watch-live", "google-site-verification": "5ojqqxU4pdyoa-4TgjCukgNv4eEl-8TGQZPsRhznWXc", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}