{"url": "https://www.usatoday.com/story/news/nation-now/2017/10/31/fiona-hippo-dad-dies/818271001/", "text": "Mallorie Sullivan\n\nThe Cincinnati Enquirer\n\nCINCINNATI — The dad of premature hippo Fiona died Tuesday of a lingering infection, almost a year and a half after he arrived from a zoo in Springfield, Mo., Cincinnati Zoo officials said.\n\nHenry, 36, arrived at Dickerson Park Zoo in Springfield at 7 months old and spent the next 34 years of his life there — 20 of those years all alone.\n\nHe came to Cincinnati Zoo & Botanical Garden in June 2016 a week after Bibi, now 18, arrived from St. Louis Zoo. By the next month, they had been introduced and were breeding.\n\nBaby Fiona, Bibi's firstborn, was supposed to arrive in March but instead was six weeks premature and about 25 pounds lighter than the lowest recorded birth weight for her species. Fiona, born Jan. 24 at 29 pounds, now tips the scales at 550.\n\n► Oct. 10:Fiona the baby hippo featured in new children's book\n\n► June 1:Fiona the hippo dazzles in front of the cameras\n\n► April 29:Baby hippo's keepers learn to live with bruises\n\nHenry, who had sired other hippos in Springfield, wasn't there for Fiona's birth but was introduced to her in July. He, Fiona and Bibi would spend most of their days napping on top of one another like a normal hippo herd.\n\nThen Henry stopped eating and got diarrhea. Henry's caretakers began feeding him antibiotics and pain medication with applesauce and beet pulp. But \"nothing — antibiotics, favorite foods, extra TLC — seemed to turn his condition around,” said Christina Gorsuch, the zoo's curator of mammals.\n\n“The blood work from Henry’s last exam gave us some hope that he was on the mend, but his appetite never returned and his condition declined rapidly,\" she said. \"Vets and his care team worked tirelessly to keep him comfortable and help him fight this illness.\"\n\nIn the intervening months he had lost hundreds of pounds from his 3,650-pound frame and could not overcome his infection. Despite having some good days, the bad ones outnumbered them, so caretakers decided to euthanize him Tuesday, according to a zoo statement.\n\n► March 14:The science behind milking a hippo, saving baby Fiona\n\n► Feb. 5:Cincinnati Zoo's premature hippo Fiona takes first steps\n\n\"He became pickier and pickier until he was barely eating anything and he began losing weight,\" Henry's caretaker, Wendy Rice, wrote on her blog Monday. \"Additionally, he became more lethargic and less interactive with keeper staff and even his interactions with Bibi and Fiona diminished.\"\n\nWhen caretakers first noticed his illness, they isolated him from Fiona and Bibi because they were worried that he might be contagious. When tests came back negative for bad bacteria and viruses, zoo staff brought the trio back together.\n\nHenry started to get better, but at the end of September began going downhill again, Rice wrote. In mid-October, zoo doctors anesthetized Henry for a full checkup and a transfer of some of Bibi's healthy digestive system bacteria into Henry's stomach.\n\nBut Henry's white blood cell count soon after showed he was fighting a serious infection and his kidneys appeared to be shutting down.\n\n\"While our time with him has been short in quantity, no one can deny that his quality of life before becoming ill was exceptional,\" Rice said. The median life expectancy for a male Nile hippopotamus is 35, so Henry was a year older.\n\n\"From meeting, bonding and breeding with his mate Bibi, to becoming a father to charismatic and spirited Fiona, Henry’s days in Cincinnati were filled with sunshine, watermelons, waterfalls and the highest quality of care that can be provided to any animal,\" she said.\n\nFollow Mallorie Sullivan on Twitter: @malloriesullivn", "images": ["https://www.gannett-cdn.com/-mm-/b6bf65ffedd111fac2b512dc0036832588590782/c=0-302-2996-1995/local/-/media/2017/10/31/USATODAY/USATODAY/636450628098392447-103117fiona-henry-hippo.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/b6bf65ffedd111fac2b512dc0036832588590782/c=0-302-2996-1995/local/-/media/2017/10/31/USATODAY/USATODAY/636450628098392447-103117fiona-henry-hippo.jpg?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/cinci/35546123001/201703/2987/35546123001_5354985626001_5354980949001-vs.jpg?pubId=35546123001&width=660&height=372&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/b6bf65ffedd111fac2b512dc0036832588590782/c=0-302-2996-1995/local/-/media/2017/10/31/USATODAY/USATODAY/636450628098392447-103117fiona-henry-hippo.jpg?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.cincinnati.com/story/news/2017/10/31/fionas-dad-henry-hippo-dies-cincinnati-zoo/817680001", "title": "Henry the hippo, dad of adorable Fiona, dies in Cincinnati", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Henry the hippo, dad of adorable Fiona, dies in Cincinnati", "description": "He was 36 and couldn't shake an infection that started in July.", "url": "https://www.cincinnati.com/story/news/2017/10/31/fionas-dad-henry-hippo-dies-cincinnati-zoo/817680001", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/b6bf65ffedd111fac2b512dc0036832588590782/c=0-302-2996-1995/local/-/media/2017/10/31/USATODAY/USATODAY/636450628098392447-103117fiona-henry-hippo.jpg?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "width": 2996, "height": 1693}, "type": "article"}, "article": {"author": "Mallorie Sullivan", "content_tier": "free", "opinion": "false"}, "description": "He was 36 and couldn't shake an infection that started in July.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/b6bf65ffedd111fac2b512dc0036832588590782/c=0-302-2996-1995/local/-/media/2017/10/31/USATODAY/USATODAY/636450628098392447-103117fiona-henry-hippo.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Henry the hippo, dad of adorable Fiona, dies in Cincinnati", "description": "He was 36 and couldn't shake an infection that started in July."}}, "movies": [], "publish_date": 1509379200.0, "source": "https://www.usatoday.com", "summary": ""}