{"url": "https://people.com/tv/rhony-where-bethenny-frankel-stands-with-all-the-housewives/", "text": "Image zoom Charles Sykes/Bravo\n\nIt’s been a tough season for Bethenny Frankel on The Real Housewives of New York City.\n\nAs the long-running Bravo series completed its tenth season, Frankel, 47, has found herself at a crossroads in her relationships with much of the cast — currently made up of Ramona Singer, Luann de Lesseps, Carole Radziwill, Dorinda Medley, Sonja Morgan and Tinsley Mortimer.\n\nGet push notifications with news, features and more.\n\n“It’s a little bit difficult,” she told PEOPLE in May. “The whole season was a little bit challenging for me, truthfully. Working so much, I’ve filmed [other] television shows and I’m a mom, which is very important to me, obviously — and I just cracked at the end of the season. I’m not used to that either, so it’s a very different, unsettling season for me.”\n\nSo where does Frankel stand with the Housewives going into the RHONY reunion? Here’s an official rundown:\n\nCAROLE RADZIWILL: FOE\n\nImage zoom Bethenny Frankel and Carole Radziwill\n\nThey had one of the strongest friendships across any Housewives franchise. But on season 10 of RHONY, Frankel and Radziwill’s bond fell apart.\n\nWhat went wrong will depend on who you ask. Frankel claims the two were on “totally on different pages” this season — she focused on her B Strong relief efforts in Puerto Rico and beyond, Radziwill more interested in fashion, selfies, her friendship with Tinsley Morimer, and not having “kids” or “a career.”\n\nRadziwill, meanwhile, insists she felt Frankel, 47, pull away first, despite making multiple financial contributions to her charity. She then got annoyed hearing that Frankel insulted her on-again, off-again boyfriend Adam Kenworthy (whom she called “a bit of an operator”), and started confronting Frankel about talking negatively behind her back.\n\nImage zoom Carole Radziwill and Bethenny Frankel Paul Cheney/Bravo\n\nEvery time the two met to address their issues, their anger would intensify. Radziwill called Frankel a “liar,” telling her, “every time we’re together you’re kind of aggressive with me and kind of dismissive.” Frankel disputed that, saying that she is “accurate in every single detail” and Radziwill was “condescending.” By the time their trip to Colombia came around, the two were barely speaking to one another.\n\nThe season ended with Frankel and Radziwill on cordial terms. But as it aired, Frankel and Radziwill’s friendship fell apart even more — Radziwill even blasting Frankel in a scathing blog post, calling her “self-righteous” and claiming that her “ego” has gotten the best of her.\n\nImage zoom Carole Radziwill and Bethenny Frankel Heidi Gutman/Bravo\n\nIn July, Radziwill announced she was departing the show on her own terms, saying in a statement to PEOPLE that she was “thrilled to leave frenemies behind” and to move on to other projects. Frankel followed up days latter on Twitter implying that it wasn’t Radziwill’s choice, writing, “Bravo has reasons for not asking hwives to return. It’s based on research & focus groups & YOU. Aside from 3 years I left, no RHONY cast member has ever quit. One saying they chose to depart & attributing it to me is fiction. It’s healthier to be truthful about a hard situation.”\n\nThough they are no longer the best of friends, Radziwill did send love to Frankel following the death of on-off boyfriend Dennis Shields earlier this month. “I just heard the sad news about Dennis. He was a good man,” Radziwill, 54, wrote on Twitter. “My condolences to all his family and friends. So tragic.”\n\nLUANN DE LESSEPS: FRIEND\n\nImage zoom Bethenny Frankel and Luann de Lesspes Paul Cheney/Bravo\n\nFrankel has been known to patch things up with longtime enemies in the past. Why? Just ask de Lesseps.\n\nThe two were longtime rivals, Frankel even calling de Lesseps “a slut and a liar and a hypocrite and a snake” during a Berkshires blowout in season 8. But this year, the O.G. N.Y.C. Housewives bonded, and remained really close friends throughout.\n\nSadly, de Lesseps won’t be there to support Frankel at the reunion. Days before its taping, Frankel helped de Lesseps return to an alcohol treatment center.\n\n“Luann is now surrounded by a core group of people who truly have her best interests at heart and who are working to make sure she gets the help she needs,” Frankel told PEOPLE at the time. “It’s a brave and honest decision by her, and everyone is rallying around her and wants the best for her.”\n\nRAMONA SINGER: FOE\n\nImage zoom Bethenny Frankel and Ramona Singer Heidi Gutman/Bravo\n\nThis should come as no surprise to RHONY fans. Though they both started the show together, Frankel and Singer haven’t connected as friends in years.\n\nThings first started crumbling back in season 3, when during a chat on the Brooklyn Bridge, Singer said Frankel’s relationship with now ex-Jason Hoppy would likely fall apart. From there, it only got worse. When she returned to the show in season 7, Frankel accused Singer of stealing dresses. Then last season, Frankel refused to accept Singer’s multiple apologies for bringing up Frankel’s naked film past in the context of her young daughter Bryn.\n\n“Bethenny’s just not a nice person,” Singer, 61, said this season on Watch What Happens Live with Andy Cohen, later blasting Frankel for not supporting other women. “She always has something negative to say about everybody. … And she pushes everyone away. She’s a bully.”\n\nSONJA MORGAN: FRIEND\n\nImage zoom Bethenny Frankel and Sonja Morgan Paul Cheney/Bravo\n\nHere’s another example of a former foe turning into a friend.\n\nBack in season 8, when Morgan tried to launch her own booze business called Tipsy Girl, Frankel went off on her — the Skinnygirl founder saying that she wanted nothing to do with Morgan and her “nonexistent businesses.”\n\nWhat a difference a year makes. With some distance between them, and Tipsy Girl never materializing, Frankel and Morgan bonded. And when Morgan, 54, feuded with Medley, Frankel was there to stand up for her.\n\n“I’m here to hold up Bethenny,” Morgan said on WWHL when asked about their friendship. “I can’t do anything but that right now.”\n\nDORINDA MEDLEY: FOE\n\nImage zoom Bethenny Frankel and Dorinda Medley Peter Kramer/Bravo\n\nOn the surface, Frankel and Medley have a lot in common, which is why it was surprising to see this pair on opposite sides of ongoing awkwardness all season long.\n\nPinning down what happened between the two is much harder to do than, say, Frankel and Radziwill’s feud. Medley could sense Frankel’s guard was up all season long, and every time they discussed it, it appeared to come down to Frankel not trusting Medley. But they would make up each time, and try to move forward.\n\nEventually, the two went on a trip to Puerto Rico for one of the Skinnygirl mogul’s B Strong relief missions, where Frankel addressed Medley’s alcohol intake. “You go to a 16 out of 10 and I need to really say it to you — the way that you sometimes treat me is worse than [Singer],” Frankel said. “I just cut you slack because you’re a drunk.”\n\nMedley has long denied that. “I don’t have a drinking problem,” she said on WWHL. “We got to stop that topic.”\n\nTINSLEY MORTIMER: CO-WORKER\n\nImage zoom Bethenny Frankel and Tinsley Mortimer Eugene Gologursky/Bravo\n\nRELATED VIDEO: RHONY‘s Tinsley Mortimer Says She’s #TeamCarole Amidst Housewife Drama with Bethenny Frankel\n\nOf all of the New York City cast, Mortimer seems the most indifferent towards Frankel.\n\nThe two have never been friends or foes, rarely sharing a scene together away from the rest of the group.\n\nOne thing’s for sure: Mortimer’s closeness with Radziwill hasn’t influenced her relationship with Frankel.\n\n“My relationship from Carole is separate from that,” Mortimer told PEOPLE. “Of course I am Team Carole, but their relationship, it’s sad. I really hope that they work this out. I’ve only known them being close. When I met them, they were best friends. So I don’t like to see that deteriorate or fall apart.”\n\nThe Real Housewives of New York City airs Wednesdays (8 p.m. ET) on Bravo.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Frhony-7-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Frhony-3-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Frhony-8-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-9-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Frhony-4-1-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Frhony-6-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Frhony-5-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbethenny-frankel-carole-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-1-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/rhony-where-bethenny-frankel-stands-with-all-the-housewives/", "title": "RHONY: Where Bethenny Frankel Stands with Her Castmates", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bethenny Frankel,Carole Radziwill,Dorinda Medley,Luann de Lesseps,News,Ramona Singer,Real Housewives,Real Housewives of New York City,Sonja Morgan,Tinsley Mortimer,TV", "news_keywords": "Bethenny Frankel,Carole Radziwill,Dorinda Medley,Luann de Lesseps,News,Ramona Singer,Real Housewives,Real Housewives of New York City,Sonja Morgan,Tinsley Mortimer,TV", "description": "It's been a tough season for Bethenny Frankel on The Real Housewives of New York City", "og": {"title": "Friend or Foe? Where Bethenny Frankel Stands with Each of Her Real Housewives of New York City Castmates", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/rhony-where-bethenny-frankel-stands-with-all-the-housewives/", "description": "It’s been a tough season for Bethenny Frankel on&nbsp;The Real Housewives of New York City.&nbsp; As the long-running Bravo series completed its tenth season, Frankel,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/rhony-where-bethenny-frankel-stands-with-all-the-housewives/", "description": "It's been a tough season for Bethenny Frankel on The Real Housewives of New York City", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/rhony-where-bethenny-frankel-stands-with-all-the-housewives/", "title": "Friend or Foe? Where Bethenny Frankel Stands with Each of Her Real Housewives of New York City Castmates", "description": "It's been a tough season for Bethenny Frankel on The Real Housewives of New York City", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Frhony-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}