{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/rob-kardashian-blac-chyna-nude-photots-criminal-charges-revenge-porn-reality-tv-ex-girlfriend-a7826531.html", "text": "Rob Kardashian could face criminal charges for posting a series of explicit photos of his former fiancée Blac Chyna on Instagram according to legal experts.\n\nThe since-deleted photos, some of which Kardashian re-shared several times as Instagram removed them from the website, showed Chyna’s nude body.\n\nKardashian, the son of the late Robert Kardashian, was suspended from the site after also sharing a string of posts accusing Chyna of cheating on him, taking advantage of him financially and taking drugs. 'The saga played out in front of the tens of millions who follow the pair on social media.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nChyna’s lawyer has now said she may be preparing for a legal battle and is considering all options at her disposal.\n\n“We are considering all legal options and recourses at this time,” Chyna’s lawyer, Walter Mosley, told ABC.\n\nIn California, where Kardashian lives, revenge porn is a criminal offence and it is illegal to intentionally distribute \"the image of the intimate body part or parts of another identifiable person”.\n\nThe penalty is up to six months in prison and a $1,000 (£770) fine. A number of legal experts have said Kardashian may have potentially violated the state's revenge porn laws.\n\nLisa Bloom, the women's rights lawyer who represented Mischa Barton in her recent successful civil suit against an ex to prevent revenge-porn images of her from being released, weighed in on the furore on Twitter, saying: \"Note to Rob Kardashian: revenge porn is a crime. And in my Mischa Barton case judge agreed it's a form of domestic violence. Knock it off\".\n\nIn October 2013, the California Governor signed a bill outlawing so-called revenge porn and levying possible prison time for those who post naked photos of their ex-partners. In 2014, the first person was convicted and sentenced to a year in prison for violating the law.\n\nThe former couple, who have a daughter called Dream, announced their engagement last April.\n\nShape Created with Sketch. Kim Kardashian at Paris Fashion Week Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Kim Kardashian at Paris Fashion Week 1/7 Kim Kardashian in the front row Givenchy show, Spring Summer 2017, Paris Fashion Week, France - 02 Oct 2016 Rex Features 2/7 Kim Kardashian and Kris Jenner attend the Givenchy show as part of the Paris Fashion Week Womenswear Spring/Summer 2017 on October 2, 2016 in Paris, France. (Photo by Pascal Le Segretain/Getty Images) Getty Images 3/7 Kim Kardashian in the front row Balenciaga show, Spring Summer 2017, Paris Fashion Week, France - 02 Oct 2016 Rex Features 4/7 Kendall Jenner, Kourtney Kardashian, Riccardo Tisci and Kim Kardashian backstage Givenchy show, Spring Summer 2017, Paris Fashion Week, France - 02 Oct 2016 Rex Features 5/7 Kanye West, Kim Kardashian, Kourtney Kardashian, Kris Jenner Off-White show, Front Row, Spring Summer 2017, Paris Fashion Week, France - 29 Sep 2016 Rex Features 6/7 (From L) Kanye West and Kim Kardashian attend the Off-white 2017 Spring/Summer ready-to-wear collection fashion show, on September 29, 2016 in Paris. / AFP / ALAIN JOCARD (Photo credit should read ALAIN JOCARD/AFP/Getty Images) AFP/Getty Images 7/7 (From L) Kanye West, Kim Kardashian and Kourtney Kardashian attend the Off-white 2017 Spring/Summer ready-to-wear collection fashion show, on September 29, 2016 in Paris. / AFP / ALAIN JOCARD (Photo credit should read ALAIN JOCARD/AFP/Getty Images) AFP/Getty Images 1/7 Kim Kardashian in the front row Givenchy show, Spring Summer 2017, Paris Fashion Week, France - 02 Oct 2016 Rex Features 2/7 Kim Kardashian and Kris Jenner attend the Givenchy show as part of the Paris Fashion Week Womenswear Spring/Summer 2017 on October 2, 2016 in Paris, France. (Photo by Pascal Le Segretain/Getty Images) Getty Images 3/7 Kim Kardashian in the front row Balenciaga show, Spring Summer 2017, Paris Fashion Week, France - 02 Oct 2016 Rex Features 4/7 Kendall Jenner, Kourtney Kardashian, Riccardo Tisci and Kim Kardashian backstage Givenchy show, Spring Summer 2017, Paris Fashion Week, France - 02 Oct 2016 Rex Features 5/7 Kanye West, Kim Kardashian, Kourtney Kardashian, Kris Jenner Off-White show, Front Row, Spring Summer 2017, Paris Fashion Week, France - 29 Sep 2016 Rex Features 6/7 (From L) Kanye West and Kim Kardashian attend the Off-white 2017 Spring/Summer ready-to-wear collection fashion show, on September 29, 2016 in Paris. / AFP / ALAIN JOCARD (Photo credit should read ALAIN JOCARD/AFP/Getty Images) AFP/Getty Images 7/7 (From L) Kanye West, Kim Kardashian and Kourtney Kardashian attend the Off-white 2017 Spring/Summer ready-to-wear collection fashion show, on September 29, 2016 in Paris. / AFP / ALAIN JOCARD (Photo credit should read ALAIN JOCARD/AFP/Getty Images) AFP/Getty Images\n\nOver time, the pair, who split up in December, have become famed for their explosive, tumultuous relationship. They have their own reality TV series on popular US entertainment channel E! called Rob and Chyna.\n\nIn the slew of posts, Kardashian claimed Chyna, a model and former stripper, sent him a video of her cheating with another man.\n\nHe wrote: \"Today Chyna sent me a video after I just bought her 250K of jewellery. She sends me this video... of another man in our bed.\"\n\nKardashian also made a series of other claims about Chyna before having his Instagram account suspended. He accused her of taking drugs and having plastic surgery after the birth of Dream Renée Kardashian last November.\n\nChyna responded to the allegations with a Snapchat post, which has since been deleted. It said: \"Rob you did all this but you beat me up and try act it never happen !!!!! You put hand on me I swear on god !!!!! On my kids but I'm supposed to be quiet because you're a Kardashian.\"\n\nKardashian, who is known for his appearances on reality show Keeping Up with the Kardashians alongside his family, later continued his rant on Twitter after having his Instagram account deactivated. He reposted the video he claims Chyna sent to him.\n\nRepresentatives for Chyna and Kardashian did not immediately respond to request for comment.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/07/06/10/rob-kardashian-blac-chyna.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/07/06/10/rob-kardashian-blac-chyna.jpg", "keywords": [], "authors": ["Maya Oppenheim"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/rob-kardashian-blac-chyna-nude-photots-criminal-charges-revenge-porn-reality-tv-ex-girlfriend-a7826531.html", "title": "Rob Kardashian 'could face criminal charges' after posting nude photos of Blac Chyna on Instagram", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/tv/news/rob-kardashian-blac-chyna-nude-photots-criminal-charges-revenge-porn-reality-tv-ex-girlfriend-a7826531.html", "title": "Rob Kardashian could go to jail over revenge porn pics of Blac Chyna", "description": "'We are considering all legal options and recourses at this time,' says Chyna’s lawyer", "updated_time": "2017-07-06T19:49:58+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/07/06/10/rob-kardashian-blac-chyna.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7826531"}, "description": "Rob Kardashian could face criminal charges for posting a series of explicit photos of his former fiancée Blac Chyna on Instagram according to legal experts. The since-deleted photos, some of which Kardashian re-shared several times as Instagram removed them from the website, showed Chyna’s nude body.", "keywords": "Rob Kardashian, Blac Chyna, News, TV & Radio, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Rob Kardashian", "published_time": "2017-07-06T09:57:00+01:00", "modified_time": "2017-07-06T19:49:58+01:00", "section": "News", "author_name": "Maya Oppenheim", "content_type": "story", "word_count": 590, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 2}, "twitter": {"title": "Rob Kardashian could go to jail over revenge porn pics of Blac Chyna", "description": "Rob Kardashian could face criminal charges for posting a series of explicit photos of his former fiancée Blac Chyna on Instagram according to legal experts. The since-deleted photos, some of which", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1499331420.0, "source": "https://www.independent.co.uk", "summary": ""}