{"url": "https://dailycaller.com/2018/02/21/weinsteins-wife-not-a-victim/", "text": "Of all the women who have been intimately involved with Harvey Weinstein over the years only one doesn’t see herself as a victim of the disgraced Hollywood producer.\n\nFive days after two bombshell reports exposed Weinstein for decades of alleged sexual misconduct ranging from harassment to rape, his wife, Georgina Chapman, announced she was leaving him. However, Chapman doesn’t see herself as a victim and has reportedly been “incredibly strong” over the past few months, according to her close friend.\n\nSince announcing their separation and expressing sympathy for the women who suffered due to her husband’s “unforgivable actions,” Chapman has remained mostly out of the public eye. The fashion designer and Marchesa co-founder even canceled her runway show at New York Fashion Week.\n\nHowever, according to Chapman’s best friend and business partner, Keren Craig, Weinstein’s ex-wife has been focusing intensely on her fashion to take her mind off of things. In a recent interview with Grazia Craig spoke about how the past few months have influenced Chapman’s work, but emphasized that she has been strong and doesn’t think of herself as a victim.\n\n“Everything you see here today Georgina sketched while she was out of the office and going through a very, very tough time,” Craig said of Marchesa’s Fall/Winter 2018 collection. “George was just sending sketches through. It was unbelievable. This collection is the result of that time. I feel emotional about it because I actually couldn’t believe how incredibly strong she was.”\n\n“She threw herself into her work. She threw herself into protecting her kids,” Craig continued. “Marchesa is her life. It is her passion. You see it here: even though she was going through all that, these beautiful things have somehow come out of such a hard time.”\n\nDespite the tough time she’s been going through, “she doesn’t see herself as a victim,” Craig said. “That’s very important. She’s just trying to get on with her life. You’ve got to realize George is such a strong woman. Don’t get me wrong—it’s a very hard time. But she’s quite inspirational.”\n\nJust about every actress in Hollywood has gone through awards season without wearing Marchesa on the red carpet for obvious reasons, but Craig and Chapman are hoping to change that by supporting the Me Too and Time’s Up movements in some fashion.\n\n“We want to support them. We want to make a gesture,” Craig said. “We need to properly process how it can be the most beneficial.”", "images": ["https://dailycaller.com/files/images/1x1.trans.gif", "https://www.facebook.com/tr?id=1660572110829759&ev=PageView\r\n\t&noscript=1", "http://b.scorecardresearch.com/p?c1=2&c2=10110104&cv=2.0&cj=1", "https://dailycaller.com/files/images/newsletter-small.jpg", "https://images.dailycaller.com/image/width=960,height=411,fit=cover,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2018/02/Harvey_Weinstein_wife-e1519229743805.jpg", "https://cdn01.dailycaller.com/wp-content/uploads/2018/02/Harvey_Weinstein_wife-e1519229743805.jpg", "https://dailycaller.com/wp-content/uploads/2018/02/Harvey_Weinstein_Georgina_Chapman.jpg", "https://dailycaller.com/wp-content/uploads/2018/02/Marchesa.jpg", "https://dailycaller.com/files/images/logo-white.png"], "top_img": "https://cdn01.dailycaller.com/wp-content/uploads/2018/02/Harvey_Weinstein_wife-e1519229743805.jpg", "keywords": [], "authors": [], "canonical_link": "https://dailycaller.com/2018/02/21/weinsteins-wife-not-a-victim/", "title": "Georgina Chapman ‘Doesn’t See Herself As A Victim’ Of Harvey Weinstein", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"url": "https://dailycaller.com/2018/02/21/weinsteins-wife-not-a-victim/", "image": "https://cdn01.dailycaller.com/wp-content/uploads/2018/02/Harvey_Weinstein_wife-e1519229743805.jpg", "title": "Georgina Chapman ‘Doesn’t See Herself As A Victim’ Of Harvey Weinstein", "description": "Of all the women who have been intimately involved with Harvey Weinstein over the years only one doesn't see herself as a victim of the disgraced producer."}, "twitter": {"card": "summary_large_image", "site": "dailycaller", "title": "Georgina Chapman ‘Doesn’t See Herself As A Victim’ Of Harvey Weinstein", "description": "Of all the women who have been intimately involved with Harvey Weinstein over the years only one doesn't see herself as a victim of the disgraced producer.", "image": "https://cdn01.dailycaller.com/wp-content/uploads/2018/02/Harvey_Weinstein_wife-e1519229743805.jpg"}, "description": "Of all the women who have been intimately involved with Harvey Weinstein over the years only one doesn't see herself as a victim of the disgraced producer.", "apple-itunes-app": "app-id=381099982", "fb": {"pages": 182919686769}}, "movies": [], "publish_date": 1519142400.0, "source": "https://dailycaller.com", "summary": ""}