{"url": "https://www.independent.co.uk/news/uk/home-news/madeleine-mccann-parents-vow-to-find-her-kate-gerry-portugal-missing-investigation-latest-a7709591.html", "text": "The parents of Madeleine McCann have vowed to do “whatever it takes for as long as it takes” to find her as they prepare to mark the 10th anniversary of her disappearance.\n\nIn a wide-ranging interview ahead of next week’s anniversary, Kate and Gerry McCann also said they intended to challenge a court ruling clearing a Portuguese former police officer of breaching libel laws.\n\nSpeaking to the BBC’s Fiona Bruce on Friday, the couple, from Rothley, Leicestershire, said they took heart from the “real progress” that had been made by the Metropolitan Police during the past five years.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nMs McCann, who has described the impending anniversary of her daughter’s disappearance as a “horrible marker of time, stolen time”, said she was no less hopeful of finding Madeleine than she had been in 2007.\n\nScotland Yard said last week that officers are still pursuing “critical” leads to trace Madeleine, who was aged three when she vanished from a holiday apartment in Praia da Luz in Portugal on 3 May 2007.\n\nAnswering questions five days before Wednesday’s anniversary, Ms McCann said of the active inquiry: “It might not be as quick as we want, but there’s real progress being made and I think we need to take heart from that.\n\n“We just have to go with the process and follow it through – whatever it takes for as long as it takes. There is still hope that we can find Madeleine.”\n\nMs McCann told the BBC: “I think you know we’ve had so many supporters who are still with us, people that we don’t know who are still there, and I guess I just want them to be reassured that there is progress being made.”\n\nDuring the interview, Mr McCann, 48, acknowledged it was “devastating” not to have found Madeleine but said the most important thing was holding on to hope of tracing her.\n\n“We are still looking forward, I think that’s the most important thing – we still hope,” he said.\n\nDaily coronavirus briefing No hype, just the advice and analysis you need Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nAsked how he and his wife were coping 10 years on, Mr McCann answered: “I think we’re doing a new normality really, particularly over probably the last – and it seems like a long time saying it – but over the last five years.\n\n“Since the Metropolitan Police actually started their investigation, it has taken a huge pressure off us, individually and as a family.\n\n“After the initial Portuguese investigation closed, essentially, no-one, no-one else was actually doing anything proactively to try and find Madeleine.\n\n“And I think every parent could understand that what you want – and what we have aspired to – is to have all the reasonable lines of enquiry followed to a logical conclusion.”\n\nAs well as dismissing criticism of the cost of the Met’s inquiry as unfair, the McCanns said they intended to continue a legal battle against former detective Goncalo Amaral, who wrote a book about their daughter’s disappearance.\n\nConfirming that the couple still plan to contest a Portuguese court ruling handed down in January, Mr McCann said: “We haven’t launched that yet, but it will be going to the European courts.\n\n“What people really need to realise though is, as (Met Police) Assistant Commissioner (Mark) Rowley has said again this week, and the Portuguese have said in the final report – there’s no evidence that Madeleine is dead and the prosecutor has said there’s no evidence that we were involved in any crime.”\n\nThe couple also commented on the impact of social media criticism of them, urging people to think twice before posting hurtful comments.\n\nMr McCann said of online abuse directed at the family: “I’m sure it is a very small minority of people who spend their time doing it, but it has totally inhibited what we do.\n\n“Personally, we don't use social media, although we have used it in Madeleine’s campaign.\n\n“But for our twins who are growing up in an era where mobile technology is used all the time, we don’t want them not to be able to use it in the same way that their peers do.”\n\nMs McCann described the actions of some people online as shocking but said she preferred to focus on the support many more people had offered.\n\n“Actually the main thing that we have experienced is the goodness of people and the support that we have had over 10 years, which hasn’t wavered in all that time,” she said.\n\nAsked how the McCann “family unit” had managed to stay strong during the hunt for Madeleine, her mother said: “What people do say is that you don’t realise how strong you are until you have no option.\n\n“And I think that’s very true. Obviously massive events like this cause a lot of reaction, a lot of trauma and upset.\n\n“But ultimately you have to keep going – and especially when you have got other children involved.\n\n“Some of that is subconscious I think – your mind and body just take over to a certain extent. But if you can’t change something immediately, you have to go with it and do the best that you can.”\n\nAdding that she had tried to ensure her now 12-year-old twins had a normal, happy and fulfilling life, Ms McCann, a former GP, said her return to work in another area of medicine had helped her re-establish as normal a life as possible.\n\n“My hope for Madeleine being out there is no less than it was almost 10 years ago,” Ms McCann said.\n\nEarlier this week, Ms McCann, aged 49, said in a message on the Official Find Madeleine Campaign Facebook page: “We are bracing ourselves for the next couple of weeks.\n\n“Ten years – there’s no easy way to say it, describe it, accept it. And now here we are... Madeleine, our Madeleine – ten years.\n\n“Most days are similar to the rest – another day. May 3rd 2017 – another day. But ten years – a horrible marker of time, stolen time.”\n\nPress Association", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/04/29/17/mccann-1.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/04/29/17/mccann-1.jpg", "keywords": [], "authors": ["Matthew Cooper"], "canonical_link": "https://www.independent.co.uk/news/uk/home-news/madeleine-mccann-parents-vow-to-find-her-kate-gerry-portugal-missing-investigation-latest-a7709591.html", "title": "Madeleine McCann’s parents vow to do ‘whatever it takes’ to find her", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/uk/home-news/madeleine-mccann-parents-vow-to-find-her-kate-gerry-portugal-missing-investigation-latest-a7709591.html", "title": "Madeleine McCann’s parents vow to do ‘whatever it takes’ to find her", "description": "‘It might not be as quick as we want, but there’s real progress being made and I think we need to take heart from that’", "updated_time": "2017-04-30T00:01:18+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/04/29/17/mccann-1.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7709591"}, "description": "The parents of Madeleine McCann have vowed to do “whatever it takes for as long as it takes” to find her as they prepare to mark the 10th anniversary of her disappearance. In a wide-ranging interview ahead of next week’s anniversary, Kate and Gerry McCann also said they intended to challenge a court ruling clearing a Portuguese former police officer of breaching libel laws.", "keywords": "Madeleine McCann, missing child, Portugal, Police, Home News, UK, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Madeleine McCann", "published_time": "2017-04-30T00:01:18+01:00", "modified_time": "2017-04-30T00:01:18+01:00", "section": "Home News", "author_name": "Matthew Cooper", "content_type": "story", "word_count": 1124, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 8, "external_link_count": 0}, "twitter": {"title": "Madeleine McCann’s parents vow to do ‘whatever it takes’ to find her", "description": "The parents of Madeleine McCann have vowed to do “whatever it takes for as long as it takes” to find her as they prepare to mark the 10th anniversary of her disappearance. In a wide-ranging interview", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1493506878.0, "source": "https://www.independent.co.uk", "summary": ""}