{"url": "www.inquisitr.com/4801042/brad-pitts-mom-is-not-begging-him-to-get-back-with-jennifer-aniston-gossip-cop-reports/", "text": "Brad Pitt’s mom, Jane Pitt, is begging her son to reunite with his ex-wife, Jennifer Aniston. That’s according to an article in Radar Online where an alleged insider source claims that Jane wants Brad to get back with Jennifer now that her relationship with Justin Theroux is over.\n\n“Jane and the whole Missouri-based Pitt family haven’t been disrespectful about Jen and Justin’s marriage, but once it became apparent things wouldn’t work out they actively pushed Brad to get back in touch,” the source said to Radar. “Now they’re determined to see them back together for a second chance.”\n\nBut celebrity rumor watchdog, Gossip Cop, is saying that the story is false based on their research. They confirmed that the two exes communicate sometimes via text but they haven’t seen each other in a long time. There was also no contact between them during the week since Jennifer Aniston and Justin Theroux announced their divorce.\n\nThis isn’t the first time that Radar Online has made allegations that Jane Pitt has tried to influence her son’s dating decisions. They have previously reported that she called Aniston to help Brad “get back on his feet.” According to Gossip Cop, Radar Online’s sister publication has also made up stories about Brad Pitt’s mom. They recently claimed that Jane Pitt moved into his home after his divorce from Angelina Jolie. Gossip Cop debunked each of these stories.\n\nEXCLUSIVE: Brad Pitt gives ex-wife Jennifer Aniston a shoulder to cry on amidst Justin Theroux split! https://t.co/SrLJUpgx8D pic.twitter.com/LWFObLk8zw — In Touch Weekly (@intouchweekly) February 16, 2018\n\nThere was also a claim from Radar that Jane Pitt called Aniston to complain about Jolie. But that story was debunked as well.\n\nRadar Online isn’t the only tabloid that’s publishing questionable stories about Brad Pitt, Jennifer Aniston, and Justin Theroux. Us Weekly recently reported that Justin found post-it notes from Brad to Jennifer two years ago. According to their source, the notes reportedly contain sweet messages like “You looked nice tonight” or “Miss you already.” The notes allegedly caused a rift in Jennifer and Justin’s relationship. He was reportedly bothered by it even though Aniston said that it wasn’t a big deal. Theroux was nevertheless insecure about it.\n\nJustin Theroux found Brad Pitt's old love notes to Jennifer Aniston. https://t.co/7p3LUgfVgi pic.twitter.com/Q1EWBnw0KN — Toronto Sun (@TheTorontoSun) February 21, 2018\n\nJennifer Aniston and Justin Theroux announced their split on February 15 in a joint statement that they released to the press. In the statement, they claimed that the decision to break up was “lovingly” made by both of them. They also said that they intend to remain friends even though their romantic relationship has ended.", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/brad-pitt-jennifer-aniston-reunion-divorce-angelina-jolie-justin-theroux.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4801042/brad-pitts-mom-is-not-begging-him-to-get-back-with-jennifer-aniston-gossip-cop-reports/", "title": "Brad Pitt’s Mom Is Not Begging Him To Get Back With Jennifer Aniston, ‘Gossip Cop’ Reports", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}