{"url": "https://www.lennyletter.com/story/gabourey-sidibe-got-dissed-by-chanel-saleswoman", "text": "I needed new eyeglasses. My friend has a really cute pair of frames from Chanel that I'd been coveting, so I decided to try to buy a pair for myself at the Chanel store near my apartment in Chicago, where I live while shooting the show Empire.\n\nOn my way to the store, another friend called. Taraji said she was stuck on set and asked if I would pick up a pair of sandals for her. No problem. I grabbed a cab and in a few minutes walked into the nearly empty shop.\n\nI was looking pretty cute. My wig was long and wavy, I was wearing new ankle boots and my prescription Balenciaga shades, and I had a vintage Chanel purse on my shoulder, over my winter coat with a fur hood. I looked as though I were in a Mary J. Blige video. Just how I like to look! The glasses display was near the door, so I walked right over. A saleswoman and I locked eyes immediately. I said \"Hello\" before she did. She greeted me, but the look on her face told me that she thought I was lost.\n\n\"Can I take a look at your eyeglasses?\" I asked.\n\n\"We don't have any,\" she answered. \"We only have shades. There's a store across the street that sells eyeglasses.\"\n\n\"Across the street?\" I asked, confused.\n\n\"Yes. In the building across the street on the fifth floor.\" She gave me the name of a discount frames dealer. I had been at her display for less than a minute, and she was literally directing me to another store.\n\n\"But … I want Chanel frames,\" I said. She told me the name of the other store again and exactly how to get there and let me know that they had lots of different frames, including Chanel. I'd love to pretend she was being polite, and I'm sure she would love to pretend she was polite, but she was actually condescending. Explaining to me how exactly I should get across the street and out of her sight line, as if I were in kindergarten. I was trying to purchase glasses, and she was trying to get the interaction with me over as soon as possible. Just to be sure of what was happening, I made her tell me to leave, in her pretend-polite way, three times.\n\nI knew what she was doing. She had decided after a single look at me that I wasn't there to spend any money. Even though I was carrying a Chanel bag, she decided I wasn't a Chanel customer and so, not worth her time and energy.\n\nThis actually happens to me a lot. My whole life. Both before and after I became a recognizable actress. It happened to me in St. Maarten on vacation after shooting a film, when I went to a Dior counter to look at lip gloss and the saleswoman literally took a gloss out of my hand and put it back down in the display case. It used to happen to me at my neighborhood beauty-supply store in New York, where I was relentlessly followed around whenever my mom sent me to pick up shampoo and Q-tips. Even when I was a teenager, I knew it was because of my skin color but also because of the environment. I lived in the hood. Being suspected of stealing is just par for the course. Also, I definitely went through a mini-klepto phase when I was around fifteen, so some of that suspicion was warranted. But I grew out of it, and if I weighed the times I was suspected of stealing versus the time I actually stole something, it would be about 99 percent to 1 percent.", "images": ["https://www.lennyletter.com/verso/static/lennyletter/assets/logo-header.c98e4b0ddbdc36ae916b8841a430f48bfcc366ef.svg", "https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/master/w_2560%2Cc_limit/1494275443-citrin-gabby-sidbe-white-3.jpg", "https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/16:9/w_1280,c_limit/1494275443-citrin-gabby-sidbe-white-3.jpg", "https://www.lennyletter.com/verso/static/lennyletter/assets/logo-reverse.92a7056c980a0ecd4f5e08e6fc75b5d0486d35b7.svg"], "top_img": "https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/16:9/w_1280,c_limit/1494275443-citrin-gabby-sidbe-white-3.jpg", "keywords": [], "authors": ["Gabourey Sidibe", "Gabourey Sidib"], "canonical_link": "https://www.lennyletter.com/story/gabourey-sidibe-got-dissed-by-chanel-saleswoman", "title": "When Gabourey Sidibe Got Dissed By a Chanel Saleswoman", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Gabourey Sidibe", "copyright": "Copyright (c) Condé Nast 2020", "description": "The actress is almost turned away at Chanel, until the saleswoman figures out Gabby is famous.", "id": "5a248211cc9b95000f858488", "keywords": "style,chanel,gabourey sidibe", "news_keywords": "style,chanel,gabourey sidibe", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a248211cc9b95000f858488", "parsely-metadata": "{\"description\":\"The actress is almost turned away at Chanel, until the saleswoman figures out Gabby is famous.\",\"image-16-9\":\"https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/16:9/w_1000,c_limit/1494275443-citrin-gabby-sidbe-white-3.jpg\",\"image-1-1\":\"https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/1:1/w_1000,c_limit/1494275443-citrin-gabby-sidbe-white-3.jpg\"}", "og": {"description": "The actress is almost turned away at Chanel, until the saleswoman figures out Gabby is famous.", "image": "https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/16:9/w_1280,c_limit/1494275443-citrin-gabby-sidbe-white-3.jpg", "site_name": "Lenny Letter", "title": "When Gabourey Sidibe Got Dissed By a Chanel Saleswoman", "type": "article", "url": "https://www.lennyletter.com/story/gabourey-sidibe-got-dissed-by-chanel-saleswoman"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@lennyletter", "description": "The actress is almost turned away at Chanel, until the saleswoman figures out Gabby is famous.", "domain": "https://www.lennyletter.com", "image": {"src": "https://media.lennyletter.com/photos/5a247b5ecc9b95000f858485/16:9/w_1280,c_limit/1494275443-citrin-gabby-sidbe-white-3.jpg?mbid=social_retweet"}, "site": "@lennyletter", "title": "When Gabourey Sidibe Got Dissed By a Chanel Saleswoman"}, "fb": {"app_id": 966242223397117, "pages": 647518172048219}}, "movies": [], "publish_date": null, "source": "https://www.lennyletter.com", "summary": ""}