{"url": "www.thecut.com/2016/09/everything-we-know-about-brad-pitts-plane-incident.html", "text": "Brad Pitt and Angelina Jolie. Photo: Dimitrios Kambouris/Getty Images for WSJ Magazine\n\nYesterday, multiple outlets reported that Brad Pitt is under investigation for child abuse by both the FBI and the Los Angeles Department of Child and Family Services after an incident that occurred on his family’s private plane last Wednesday. More details have emerged about the incident that reportedly caused Angelina Jolie to file for divorce and request full custody of the couple’s six children. Us Weekly is reporting that at least part of the alleged fight was caught on film, and TMZ and People are reporting that the fight involved Pitt and Jolie’s 15-year-old son, Maddox.\n\nAccording to TMZ, “the details of precisely what happened” are “murky,” but the anonymous person who reported Pitt to the DCFS alleged that Pitt “attacked” Maddox on the family’s flight home from Nice, France. From TMZ:\n\nHere’s what’s alleged – shortly after the plane took off, Brad and Angelina began arguing and Maddox jumped up to verbally defend his mom. We’re told Brad then lunged at the boy and Angelina jumped in between them to block her husband. Brad connected in some fashion with his son.\n\nPeople, which has presented Pitt’s side of the divorce story throughout the week, reports that Pitt “did not hit” Maddox during the incident. A source close to Pitt provided People with the following account:\n\nPitt “was drunk, and there was an argument between him and Angelina,” says the source. “There was a parent-child argument which was not handled in the right way and escalated more than it should have.”\n\n\n\nThe source says Pitt did not hurt his son. “He is emphatic that it did not reach the level of physical abuse, that no one was physically harmed. He did not hit his child in the face in any way. He did not do that; he is emphatic about that. He put his hands on him, yes, because the confrontation was spiraling out of control.”\n\n\n\nA source close to Pitt says any accusations beyond that are “a combination of exaggerations and lies. They have taken the overall smallest kernel of truth – that a fight got out of hand and reached a regrettable peak, and that as a result DCFS is looking into it – and they are manipulating it to best suit their attempts to gain custody.”\n\nLainey Lui of Lainey Gossip points out that, at some point last night, People removed the following sentence from the report: “The Pitt source adds that the star ‘was not black-out drunk’ and that ‘he absolutely remembers that evening and has been interviewed at length to that effect.’”\n\nTMZ notes that Pitt’s sources and Jolie’s sources do not agree on whether or not Pitt was drunk during the incident, so that point remains unclear. TMZ reported yesterday that sometime after the incident, the plane landed in Minnesota to refuel, and “that’s when eyewitnesses say Brad was ‘out of control’ on the tarmac and even tried to leave in a fuel truck.”\n\nPitt has yet to release an official statement regarding the allegations. Us Weekly reports that, on the video of the incident, Pitt can be seen “looking drunk” and “yelling.” Us Weekly’s source claims, however, that “nothing physical” happens on the tape.\n\nAccording to TMZ, Pitt still plans to fight for joint custody of his children.\n\nWe will update this post as more information becomes available.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2016/09/23/23-Brad-Pitt-Angelina-Jolie.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2016/09/23/23-Brad-Pitt-Angelina-Jolie.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2016/09/23/23-Brad-Pitt-Angelina-Jolie.w1200.h630.jpg", "keywords": [], "authors": ["Allie Jones"], "canonical_link": "https://www.thecut.com/2016/09/everything-we-know-about-brad-pitts-plane-incident.html", "title": "Everything We Know About Brad Pitt’s Plane Incident", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Everything We Know About Brad Pitt’s Plane Incident", "url": "https://www.thecut.com/2016/09/everything-we-know-about-brad-pitts-plane-incident.html", "description": "Multiple outlets report that it involved Pitt and Angelina Jolie’s 15-year-old son, Maddox.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2016/09/23/23-Brad-Pitt-Angelina-Jolie.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Everything We Know About Brad Pitt’s Plane Incident", "description": "Multiple outlets report that it involved Pitt and Angelina Jolie’s 15-year-old son, Maddox.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2016/09/23/23-Brad-Pitt-Angelina-Jolie.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@allierileyjones", "site": "@TheCut"}, "description": "Multiple outlets report that it involved Pitt and Angelina Jolie’s 15-year-old son, Maddox.", "article": {"tag": "brangelina divorce, brad pitt, angelina jolie, child abuse investigation, fame", "publisher": "https://www.facebook.com/cut"}, "sailthru.tags": "brangelina divorce, brad pitt, angelina jolie, child abuse investigation, fame", "author": "Allie Jones", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1474648620.0, "source": "http://www.thecut.com", "summary": ""}