{"url": "https://en.wikipedia.org/wiki/Me_Enamor%C3%A9_(Shakira_song)", "text": "\"Me Enamoré\" (English: \"I Fell in Love\") is a song by Colombian singer Shakira. The song was released as the second single to anticipate Shakira's eleventh studio album El Dorado on 7 April 2017, by Ace Entertainment and Sony Music Latin. The song was written by Shakira and Rayito, who also produced the song along the co-production of Rude Boyz, Kevin ADG and A.C.[1][2][3][4][5]\n\nBackground and release [ edit ]\n\nShe teased the song hours prior its release sending personalized postcards to a few fans, where she appears climbing a tree. She stated in them: \"[I'm] very happy to share with all of you my new single 'Me enamoré.' This song narrates a moment in my life when I was so in love that I was literally climbing trees\".[5]\n\nComposition [ edit ]\n\n\"Me Enamoré\" tells the story of when she fell in love with her current partner Gerard Piqué, whom she met in 2010 on the set of the music video for \"Waka Waka (This Time For Africa)\", the official song of the 2010 FIFA World Cup.[3]\n\nMusic video [ edit ]\n\nThe \"Me Enamoré\" official lyric video was released via Shakira's Vevo the day of the release of the song. Directed by James Zwadlo, it features the Spanish-language words along watercolor painted images, presumably for the non-Spanish speaking people to understand the song.[4]\n\nThe music video was shot in Barcelona and was released on 12 May 2017.\n\nThe music video for the song garnered media attention due to the appearance of her current partner Gerard Piqué and became her twenty-first Vevo Certified video (collaborations included).[6][7]\n\nChart performance [ edit ]\n\nIn France, \"Me Enamoré\" debuted at number 72 on 14 April 2017, reaching number 41 after the release of its music video and eventually peaking at number 13 after the release of El Dorado.[8] In the United States, the song debuted at number 100 on the Billboard Hot 100, where later peaked at number 83, and at number 11 on the Hot Latin Songs chart, where it reached number five following the release of the music video and peaked at number four after the release of the album. \"Me Enamoré\" peaked at number three in Spain,[9] and has been certified three times Platinum for exceeding sales of 120,000 copies in the country.\n\nLive performances [ edit ]\n\nShakira performed live \"Me Enamoré\" for the first time at Univision’s Upfront on 16 May 2017. Then, she performed the song ten days later at her El Dorado Album Release Party at The Temple House in Miami on 26 May 2017. She also performed the song at the El Dorado Album Launch in Barcelona on 8 June 2017. She performed the song on the sixth season finale of The Voice: la plus belle voix in June 2017 in Paris. She also performed with Coldplay's lead vocalist Chris Martin at Global Citizen Festival Hamburg on 6 July 2017.\n\nCredits and personnel [ edit ]\n\nCredits adapted from Tidal and Qobuz.[10][1]\n\nShakira – vocals, composer, producer\n\nAntonio Rayo Gibo – composer, producer\n\nA.C. – co-producer\n\nKevin ADG – co-producer\n\nChan \"El Genio\" (Rude Boyz) – producer\n\nDave Clauss – mixing engineer, recording engineer\n\nAdam Ayan – mastering engineer\n\nCarlos Hernández Carbonell – recording engineer\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg/220px-Shakira_Me_Enamor%C3%A9_Coverart.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/People_icon.svg/16px-People_icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Me_Enamor%C3%A9_(Shakira_song)", "title": "Me Enamoré (Shakira song)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}