{"url": "https://www.bustle.com/p/erika-jaynes-christmas-gift-for-her-husband-may-be-the-most-extra-thing-you-hear-all-day-7715414", "text": "Here's a fact that will never stop being incredible: Real Housewives of Beverly Hills star and “Painkillr” songstress Erika Girardi gave her husband a toilet for Christmas this year — and it's not just any ol' commode. In a recent interview with People, the Bravolebrity revealed she bought a $5,000 toilet for Tom Girardi. She took the plunge and picked out a present that's as useful as it is hilarious. Well played, Erika Jayne. Well played.\n\nWhen People asked her what she got her husband of 18 years for Christmas, the Beverly Hills Housewife's answer sounded like something that you might hear in yet another Erika Jayne Saturday Night Live sketch. “I bought him the top of the line Toto toilet that has heated seats and oscillation,” she laughed. “Yeah, I got him a toilet.” If gifting someone with a high-end crapper isn’t true love, then what is? Erika added, “Complete with custom made toilet paper, but I’m not going to tell you what’s on it.” Yes, she had custom T.P. made for Tom, too. This gift just keeps getting better and better.\n\nSurprising her spouse with an elaborate porcelain throne on Xmas is so on brand; Erika is no stranger to being wonderfully over-the-top, and this toilet situation is one of the many reasons why she's a true legend. Here are just some of the things Erika has done in the last few years that are delightfully extra.\n\nThis Yuletide Hairdo\n\nShe sure had a hairy, jolly Christmas.\n\nHer Office\n\nLast year, she opened up an “office” in Hollywood called the Pretty Mess Clubhouse. In lieu of cubicles and fax machines, Erika's office boasts an enormous closet, a well-lit makeup room, a lounge, and a bar. It’s a space where she and the Erika Jayne team conduct all Erika Jayne-related business, aka the greatest place on the planet.\n\nThe Octopus Tank That’s Nestled In A Bookshelf\n\nAnimal Planet on YouTube\n\nIn a 2016 episode of Animal Planet series Tanked, fish tank designers Brett Raymer and Wayde King built an aquarium for Tom and Erika’s pet octopus. Yes, an eight-legged cephalopod lives in the study of their home. There are no words.\n\nThe Gold Room From The “How Many F**ks?” Music Video\n\nerikajayneVEVO on YouTube\n\nOK, this entire music video is wild, but everything happening in that gold room? Whew. That gold lipstick is next-level.\n\nThe Money-Stuffed Pillows From The \"XXPEN$IVE\" Music Video\n\nerikajayneVEVO on YouTube\n\nPerfect. Just perfect.\n\nThe House She Rented In Greece\n\nBravo on YouTube\n\nWhen Erika booked a performance in Greece in Season 7, she and Kyle Richards stayed in a place that rented for $50,000/week. Ah, chump change.\n\nThe Beginning Of This Dancing With The Stars Performance\n\nDancing With The Stars on YouTube\n\nRemember when she kicked off her routine to “XXPEN$IVE” perched atop a unicorn? No one is worthy.\n\nHer Vacation Lookbooks\n\nLeave town without a binder full of vacation outfits? Erika would never. Who wants to waste valuable trip time trying to figure out what they’re going to wear or attempting to recall why they packed what they packed?\n\nHer Pair Of Private Planes\n\nHer family owns not one, but two private planes. Two. Why? As she told Andy Cohen on Watch What Happens Live in 2016, “Because one is small and one is big.” Well, there you have it.\n\nAnd now, she’s given her significant other a toilet for Christmas. A fancy, xxpen$ive, and heated toilet. Here’s an important question: Did she wrap the toilet in wrapping paper and put it under the tree, or did she have it installed while Tom was at work? Gosh, it really is too bad RHOBH isn't filming right now. It would've been life-changing to see a toilet-shaped package waiting under the Girardi Xmas tree on an episode of the reality show.\n\nHow will she possibly top such an iconic present next year? No idea. But if history tells us anything, it's that Erika will undoubtedly figure out how to outpoo, er, outdo a $5,000 toilet.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/efcd4f59-9964-4c6d-a6ad-4634b0b09f8a-getty-1156675580.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/12/28/d54fe8ab-1fc8-40c3-baaa-3ac24513a087-getty-875976230.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/948eaa3d-8423-428e-aff3-e7157351d9a6-getty-1205159727.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/6534f3ff-ed4a-48a5-867b-2a0737fbc057-getty-1154921708.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/12/28/d54fe8ab-1fc8-40c3-baaa-3ac24513a087-getty-875976230.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/12/28/d54fe8ab-1fc8-40c3-baaa-3ac24513a087-getty-875976230.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/erika-jaynes-christmas-gift-for-her-husband-may-be-the-most-extra-thing-you-hear-all-day-7715414", "title": "Erika Jayne’s Christmas Gift For Her Husband May Be The Most Extra Thing You Hear All Day", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/erika-jaynes-christmas-gift-for-her-husband-may-be-the-most-extra-thing-you-hear-all-day-7715414", "type": "article", "title": "Erika Jayne's Christmas Gift To Her Husband May Be The Most Extra Thing You Hear All Day", "description": "Here's a fact that will never stop being incredible: Real Housewives of Beverly Hills star and “Painkillr” songstress Erika Girardi gave her husband a toilet for Christmas this year — and it's not just any ol' commode. In a recent interview with…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/12/28/d54fe8ab-1fc8-40c3-baaa-3ac24513a087-getty-875976230.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Here's a fact that will never stop being incredible: Real Housewives of Beverly Hills star and “Painkillr” songstress Erika Girardi gave her husband a toilet for Christmas this year — and it's not just any ol' commode. In a recent interview with…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}