{"url": "https://web.archive.org/web/20180605104322/http://popculture.com:80/celebrity-moms/2018/06/03/rumor-kim-kardashian-wanting-triplets-kanye-west-debunked/", "text": "Rumors that Kim Kardashian wants her surrogate to carry triplets for her have been proven false by comments she made herself.\n\nThe story began in Closer, where a a report suggested that Kardashian wanted to have triplets as a birthday surprise for her husband, Kanye West. The article, headlined: “Kim: ‘Surprising Kanye With Triplet News Will Save Our Marriage,'” also indicated that their marriage was crumbling, though that too appears to be unfounded.\n\nIn the piece, sources claimed that Kardashian is “keen to set the wheels in motion for her next surrogacy.\" Alleged insiders said that she intends to “complete her family with triplets.” They went on to frame it as a birthday gift, claiming that she is “determined to surprise” West “on his 41st birthday... with the news that their surrogate is ready to get pregnant again.”\n\n“Kim’s been racking her brains over what to give Kanye for his birthday, and she says that giving him more children would be the best present he could ever wish for,\" the source claimed. After his recent public meltdown, Kardashian reportedly believed that “the best thing for him is to focus on family, and what better way than celebrating baby news?”\n\nThe source explained that the plan was for Kardashian's surrogate to “be implanted with three embryos to maximize their chances” of conceiving a bigger family. They added that West “laughed when Kim suggested triplets, but she knows he’s always wanted a big family… so she’s sure he’ll be ecstatic with her decision.”\n\nThey even included the alleged reaction of Kourtney and Khloe Kardashian, saying the sisters “have warned [Kim] that it could backfire, given that it’s such a big step to take without discussing it properly with Kanye.”\n\nIt turns out there's not much to back these strange claims, despite the tabloid's insistence. A report by Gossip Cop points out that Kardashian herself talked about children in March when she did an interview with Elle. The reality star specifically said she doesn't want more than four kids.\n\n“I don’t think I could handle more than that. My time is spread really thin,” she said at the time. In May, she talked about it again on Live with Kelly and Ryan.\n\n“I would have maybe one more,\" she said.\n\nWhile the rumors about Kardashian seem to be false, it is true that surrogates have a high chance of gestating twins, triplets or more. According to a report on simplesurrogacy.com, several factors of the surrogacy process combined with advancements in in vitro fertilization technology make it likely for multiple embryos to mature.", "images": ["https://web.archive.org/web/20180605104322im_/http://popculture.com/celebrity-moms/2018/06/03/rumor-kim-kardashian-wanting-triplets-kanye-west-debunked/", "https://web.archive.org/web/20180605104322im_/http://media.popculture.com/2018/04/kim-kardashian-kanye-west-family-photo-20031095-640x320.jpeg", "https://web.archive.org/web/20180605104322im_/https://www.facebook.com/tr?id=234034990453743&ev=PageView&noscript=1"], "top_img": "https://web.archive.org/web/20180605104322im_/http://media.popculture.com/2018/04/kim-kardashian-kanye-west-family-photo-20031095-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180605104322/http://popculture.com/celebrity-moms/2018/06/03/rumor-kim-kardashian-wanting-triplets-kanye-west-debunked/", "title": "Rumor About Kim Kardashian Wanting Triplets With Kanye West Debunked", "meta_data": {"description": "Rumors that Kim Kardashian wants her surrogate to carry triplets for her have been proven false by comments she made herself.The story began in Closer, where a a report suggested that Kardashian wanted to have triplets as a birthday surprise for her husband, Kanye West. The article, headlined: [...]", "keywords": "Kim Kardashian,Kanye West,Keeping Up With the Kardashians,Pregnancy,Pregnancy & Parenting", "twitter": {"card": "summary", "title": "Rumor About Kim Kardashian Wanting Triplets With Kanye West Debunked", "description": "Rumors that Kim Kardashian wants her surrogate to carry triplets for her have been proven false [...]", "image": "https://web.archive.org/web/20180605104322im_/http://media.popculture.com/2018/04/kim-kardashian-kanye-west-family-photo-20031095-640x320.jpeg"}, "og": {"title": "Does Kim Kardashian Want Triplets With Kanye West?", "type": "article", "url": "https://web.archive.org/web/20180605104322/http://popculture.com/celebrity-moms/2018/06/03/rumor-kim-kardashian-wanting-triplets-kanye-west-debunked/", "image": {"identifier": "https://web.archive.org/web/20180605104322im_/http://media.popculture.com/2018/04/kim-kardashian-kanye-west-family-photo-20031095-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Celebrity Moms", "description": "Rumors that Kim Kardashian wants her surrogate to carry triplets for her have been proven false [...]"}, "fb": {"pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "uc": "820a67c0d9d4857c0f209f8e16cf6828", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1527955200.0, "source": "https://web.archive.org", "summary": ""}