{"url": "www.usatoday.com/story/life/people/2017/03/16/plastic-surgery-requests-ivanka-trump/99225796/", "text": "Maria Puente\n\nUSA TODAY\n\nWhen a woman shows a celebrity picture to her plastic surgeon and says, \"I want to look like her!\" the face glowing on her phone might be Jennifer Lopez, Kim Kardashian, Angelina Jolie or Scarlett Johansson. And now, say some surgeons, the new star is Ivanka Trump.\n\n\"In my practice, Ivanka is sort of the new style icon for plastic surgery,\" says Houston surgeon Franklin Rose, who says he's already performed extensive work on \"several\" women who wanted to look more like President Trump's elder daughter.\n\nAnd why not? \"I think she's exquisite,\" Rose says.\n\nSo does one of his patients, Jenny Stewart, 37, who last summer underwent more than six hours of surgery by Rose to reshape her nose and augment her breasts. She got liposuction to harvest fat to lift her buttocks, and she got injectable fillers for her face. All of it cost about $30,000, a discount because Stewart agreed to do interviews with reporters.\n\n(People magazine profiled another of Rose's Texas patients, Tiffany Taylor, who spent $60,000 to look like Ivanka.)\n\n\"At first, the healing process was painful ... but after that I'm absolutely happy with the results,\" Stewart says.\n\nStewart had seen Ivanka in the media before the election but hadn't really thought of her as a model for enhancing her own appearance, which already was attractive. But she took notice when Donald Trump started to run for president and Ivanka, 35 and previously best known in New York, suddenly was all over global news feeds.\n\n\"I was very much interested in the election, and that’s when I started thinking she was pretty,\" says Stewart, a mother of two and an IT headhunter consultant who lives in Houston and Los Angeles. She Googled images of Ivanka and picked three she thought exhibited the features she admired and wanted to enhance on herself: Ivanka's small nose, the way her breasts fit her frame, and her rounded cheeks.\n\n\"I thought Ivanka was classically pretty and not overdone,\" she says. \"I had always admired her appearance, but then I started seeing her more often in the media. She was right there and still is. I follow her on Instagram and Facebook and I see her in my news feed.\"\n\nOh, and politics had nothing to do with it, she says: She voted for Hillary Clinton.\n\nIn the old days, Rose says, patients would come in with pictures from magazines — say, Playboy — and now they come in with pictures on their cellphones. In recent years, patients would say they want buttocks like Lopez's or Kardashian's, breasts like Johansson's or lips like Jolie's.\n\nNow, Ivanka has reached movie star-level celebrity — more visible than her stepmother, ex-model-turned-first lady Melania Trump — thanks to her steady presence on the campaign trail, her carefully curated Instagram page, and as an unofficial adviser to dad at the White House.\n\n\"In the last year and a half, I've seen several patients who came in with pictures of Ivanka,\" Rose says. \"The Ivanka thing is very widespread, at least in Texas.\"\n\nRod Rohrich, a plastic surgeon in Dallas and professor of plastic surgery at the University of Texas Southwestern, agrees.\n\n\"Yes, absolutely, I have had a lot of patients in the past six months or more who ask about Ivanka’s great and sculpted, clean facial features, including her high cheekbones and beautiful skin and elegant nose,\" says Rohrich. He says she's \"in the top five\" on the list of people that patients cite when they ask for fillers on their cheeks and for rhinoplasty.\n\n\"There’s always been an interest in the appearance and the trends of public figures and (Ivanka) has been a good example, because she's a very pretty woman, she's articulate and she has classic features,\" says Alan Matarasso, a leading plastic surgeon in Manhattan, a professor of surgery at Hofstra University Northwell School of Medicine, and a vice president and spokesman for the American Society of Plastic Surgeons.\n\n\"I can't give you any numbers,\" Matarasso adds. \"But the reason is, she’s been in the media a lot, she has classic good looks and is not overdone in any way.\"\n\n(Matarasso and other plastic surgeons say it is crucial for would-be patients to consult board-certified surgeons to get appropriate advice, no matter who they want to look like.The ASPS website provides a free service helping to link patients with doctors in their area.)\n\nSherrell Aston, a professor of plastic surgery at New York University and another prominent Manhattan surgeon with many celebrities for patients, says he's not sure how widespread the Ivanka-wannabe trend might be, but he wouldn't be surprised to learn it's growing.\n\n\"I think that across the country, plastic surgeons with aesthetic practices will see people who will mention her by name as being someone they admire and would like to have features that are similar,\" Aston says. \"I don’t think it’s necessarily limited to Houston. (Ivanka) is widespread (in the media) and so is aesthetic surgery, and I think it’s conceivable it could happen anywhere in the country.\"\n\nBut not everywhere. Surgeon Lyle Leipziger, chief of plastic surgery at North Shore University Hospital in Manhasset, N.Y., and at Long Island Jewish Medical Center in New Hyde Park, N.Y., says his patients don't come in with celebrity pictures — or any pictures.\n\n\"In my practice, patients don’t usually come in asking to look like someone else. They want to be a more enhanced version of themselves,\" he says. \"Over the years, there isn’t a patient who hasn’t said, 'I want to look natural.' … The statement (among plastic surgeons) is the best plastic surgery doesn’t leave you looking plastic.\"\n\nNor does he believe most plastic surgeons are seeing an uptick in Ivanka-copying patients.\n\n\"I certainly understand that Ivanka Trump is a beautiful, stunning and poised individual, and I can understand how people can identify with her, as people have with many (other celebrities) over the years,\" he says. \"But I don’t know if this is happening elsewhere.\"", "images": ["https://www.gannett-cdn.com/-mm-/dba8c5c35e9d467f93d887d9e67c1663b3cb2408/c=0-160-4499-2702/local/-/media/2017/03/15/USATODAY/USATODAY/636251982951459134-AFP-AFP-LD8B2.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "http://videos.usatoday.net/Brightcove3/29906170001/201703/1335/29906170001_5362946559001_5362934297001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/dba8c5c35e9d467f93d887d9e67c1663b3cb2408/c=0-160-4499-2702/local/-/media/2017/03/15/USATODAY/USATODAY/636251982951459134-AFP-AFP-LD8B2.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/dba8c5c35e9d467f93d887d9e67c1663b3cb2408/c=0-160-4499-2702/local/-/media/2017/03/15/USATODAY/USATODAY/636251982951459134-AFP-AFP-LD8B2.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2017/03/16/plastic-surgery-requests-ivanka-trump/99225796/", "title": "Would you spend $30K to look like Ivanka Trump?", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Would you spend $30K to look like Ivanka Trump?", "description": "For some women, Ivanka Trump is the new beauty ideal when seeking plastic surgery.", "url": "https://www.usatoday.com/story/life/people/2017/03/16/plastic-surgery-requests-ivanka-trump/99225796/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/dba8c5c35e9d467f93d887d9e67c1663b3cb2408/c=0-160-4499-2702/local/-/media/2017/03/15/USATODAY/USATODAY/636251982951459134-AFP-AFP-LD8B2.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1809}, "type": "article"}, "article": {"author": "Maria Puente", "content_tier": "free", "opinion": "false"}, "description": "For some women, Ivanka Trump is the new beauty ideal when seeking plastic surgery.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/dba8c5c35e9d467f93d887d9e67c1663b3cb2408/c=0-160-4499-2702/local/-/media/2017/03/15/USATODAY/USATODAY/636251982951459134-AFP-AFP-LD8B2.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Would you spend $30K to look like Ivanka Trump?", "description": "For some women, Ivanka Trump is the new beauty ideal when seeking plastic surgery."}}, "movies": [], "publish_date": 1489593600.0, "source": "http://www.usatoday.com", "summary": ""}