{"url": "www.mercurynews.com/2018/08/22/jennifer-garner-watches-helplessly-as-ben-affleck-returns-to-womanizing-ways/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nOn Monday, Jennifer Garner was all smiles as she stood with her three children, parents, sisters and their families to celebrate receiving her star on the Hollywood Walk of Fame.\n\nBut one notable family member was missing: Ben Affleck. Yes, Garner may be in a long process of divorcing the 46-year-old “Batman v. Superman” star, but she has also gone out of her way keep him in her life, if only for the sake of their children, Violet, 12, Seraphina, 9, and Samuel, 6.\n\nOf course, Garner had good reason to exclude her estranged husband of 10 years. His romantic life is back in the headlines as he recently broke up with his longtime girlfriend Lindsay Shookus and has, for the time being, taken up with 22-year-old Playboy model Shauna Sexton.\n\nBut it’s not likely that he’ll stick to Sexton for long, reports say, with Garner realizing that Affleck is back to his womanizing ways.\n\n“He is happy being able to date who he wants and not feel tied down to a serious relationship,” a film source told People. “Lindsay was more serious about him. He enjoyed her company but was not looking for anything permanent now.”\n\nOf course, Garner, 46, isn’t happy Affleck is dating a woman who is young enough to be their daughter, another source said.\n\nGet more celebrity news and photos delivered to your inbox for free on weekdays.\n\nSign up for our Coffee Break newsletter here.\n\n“Is she happy about him hanging out with a very young Playboy model? Certainly not,” another source says in the new issue. “But her concern right now is not who he is dating. What she ultimately cares about is his sobriety and whether she can rely on him to co-parent.”\n\nSimilarly, Us Weekly reported that Garner realized long ago that she can’t change Affleck, even though she has tried to be a pillar of support as he struggles to recover from his alcohol abuse issues. Garner’s concern for Affleck’s health and sobriety is the reason given for her putting off finalizing their divorce, which the couple first sought in 2016.\n\nWhen it comes to women, Affleck will play the field, Us Weekly reported. While still married to Garner, Affleck began secretly dating Shookus, a 38-year-old “Saturday Night Live” producer. Garner’s discovery of his affair with Shookus helped bring about the end of their 10-year marriage. But weeks after Garner and Affleck announced their split in 2015, Affleck quickly moved on with their 28-year-old nanny, Christine Ouzounian, apparently cheating on his secret girlfriend Shookus as well.\n\n“Jen realized a long time ago that she cannot fix Ben and that his problems are not hers to solve,” a Garner “confidant” told Us Weekly. “She’s not his babysitter. She just wants to protect the kids. But she does wish Ben would keep his life more private.”\n\nAffleck has twice been photographed in public with Sexton, Playboy’s Miss May 2018, since he broke up with Shookus. One of those occasions was a romantic dinner date with her at Nobu Malibu last week. But Us Weekly reports that the two have spent many hours holed up in his new $19 million, seven-bedroom Pacific Palisades bachelor pad.\n\nReading this on your iPhone or iPad? Check out our new Apple News app channel here and click the + at the top of the page to save to your Apple News favorites.\n\n“Of course (Garner’s) not pleased he’s dating a 22-year-old Playboy model,” the Garner confident said, repeating what others have spilled. “But she’s also not surprised. Jen has come to expect this from Ben. She’s not going to get involved. She can’t make decisions for him.”", "images": ["https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2018/08/Garner2.jpg?fit=620%2C9999px&ssl=1", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2018/08/Film-Ben-Affleck.jpg?fit=620%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2018/08/Garner1.jpg?w=1024&h=680", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/08/Affleck_04.jpg?fit=620%2C9999px&ssl=1"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/08/Garner1.jpg?w=1024&h=680", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/08/22/jennifer-garner-watches-helplessly-as-ben-affleck-returns-to-womanizing-ways/", "title": "Jennifer Garner watches helplessly as Ben Affleck returns to womanizing ways, reports say", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "While Jennifer Garner isn't happy that Ben Affleck is dating a 22-year-old Playboy model, she's mostly concerned that he stays sober for the sake of their kids.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Jennifer Garner watches helplessly as Ben Affleck returns to womanizing ways, reports say", "url": "https://www.mercurynews.com/2018/08/22/jennifer-garner-watches-helplessly-as-ben-affleck-returns-to-womanizing-ways/", "description": "While Jennifer Garner isn’t happy that Ben Affleck is dating a 22-year-old Playboy model, she’s mostly concerned that he stays sober for the sake of their kids, reports say.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/08/Garner1.jpg?w=1024&h=680", "width": 1024, "height": 680}, "locale": "en_US"}, "article": {"published_time": "2018-08-22T14:00:45+00:00", "modified_time": "2018-08-23T14:47:45+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Jennifer Garner watches helplessly as Ben Affleck returns to womanizing ways, reports say"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/08/Garner1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1534867200.0, "source": "http://www.mercurynews.com", "summary": ""}