{"url": "www.wmagazine.com/story/keeping-up-with-kardashians-teaser-khloe-kardashian-kylie-jenner-pregnancy", "text": "Lest the Kardashians have pulled the greatest troll job on celebrity media since that time Joaquin Phoenix pretended to be a rapper, its safe to assume that Khloe Kardashian and Kylie Jenner are both pregnant, and have been for some time. Yet, the close-knit clan has stubbornly refused to confirm this. Like most open secrets, it's become almost frustrating. More frustrating than those two friends in your circle that everyone knows are secretly dating but refuse to admit it. More frustrating than knowing someone is throwing you a surprise birthday party but not knowing the exact details. More frustrating even than when someone you know keeps saying they're staying out of politics, but occasionally makes vague Facebook status that makes you think they're a secret Trump supporter. Yes, more frustrating than even that.\n\nIn the process, though, the Kardashian-Jenners have turned the presumably inevitable announcement and their surrounding anticipation into events on their own. It's not even a question of \"if\" that's interesting anymore, but rather \"how\" and \"when.... no seriously when? We're all waiting. There's a lot going on in the world right now. We have better things to think about.\"\n\nWell, at least one confirmation may be coming our way sometime sort of soon, if the latest preview of Keeping Up With The Kardashians is any indication. The trailer begins with Kris Jenner (in that blonde wig) and her three eldest daughters sitting around a table and presumably all cosplaying as powerful female crime lords, as Kris proposes, \"Let's raise a glass to Kris f------ Jenner.\" Then they run through matters of Rob's whole situation with Blac Chyna, Kendall's anxiety issues, and a tarantula before we get to someone murmuring the phrase, \"Did you guys hear what's on TMZ?\" Then Kourtney says, \"I'm so sick of people like not saying anything.\" (Yeah, us too.) Eventually, though, we wind up at a party where there's tears of joy and everyone is hugging Khloe. It definitely seems like a pregnancy announcement situation.\n\nSo, perhaps that's how the Khloé konfirmation goes down, almost as we all should have expected it, during a super-hyped episode of the family's show.\n\nThat leaves the matter of Kylie, who, save for some iPhone-shot footage, is as conspicuously absent from the preview as the part of her body below her neck is from her Snapchats. Some fans have theories about how her pregnancy could be revealed. Kim is currently teasing the family's Christmas card shoot on Instagram in a sort of 25 day long digital advent calendar: Khloé made her first full appearance today, but Kylie has been missing. Might she and her baby bump appear on day 25? Or could she too be waiting to reveal her news on the show?\n\nRelated Videos\n\nHere's another curious matter to consider when mulling the timing: the trailer in question is for the second half of this season, which will begin on January 7th next year. So we may make it through the rest of 2017 without confirmation of either. What's another few weeks at this point? Then again, what's the point of calling the show Keeping Up With The Kardashians if we're all way ahead of it anyway?\n\nEither way, the've managed to keep attention on this mystery for far longer than they should have. As they say in the trailer, \"Let's raise a glass to Kris f------ Jenner!\"\n\nRelated: Kris Jenner Finally Opens Up About Her Daughters Pregnancies: \"It's Like a Faucet That We Turned On and Won't Turn Off", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=3223313014351882&ev=PageView&noscript=1", "https://www.wmagazine.com/wp-content/uploads/2017/12/13/5a31a096499a6c4ea286ad36_khloe-kardashian-pregnancy-reveal.jpg?crop=0px,40px,1356px,677px&w=790px"], "top_img": "https://www.wmagazine.com/wp-content/uploads/2017/12/13/5a31a096499a6c4ea286ad36_khloe-kardashian-pregnancy-reveal.jpg?crop=0px,40px,1356px,677px&w=790px", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/keeping-up-with-kardashians-teaser-khloe-kardashian-kylie-jenner-pregnancy/", "title": "Khloé Kardashian and Kylie Jenner May Not Confirm Their Pregnancies Until 2018", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Khloé Kardashian and Kylie Jenner may keep their pregnancies \"secret\" until they're revealed on \"Keeping Up\" in 2018.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Khloé Kardashian and Kylie Jenner May Not Confirm Their Pregnancies Until 2018", "description": "Khloé Kardashian and Kylie Jenner may keep their pregnancies \"secret\" until they're revealed on \"Keeping Up\" in 2018.", "url": "https://www.wmagazine.com/story/keeping-up-with-kardashians-teaser-khloe-kardashian-kylie-jenner-pregnancy/", "site_name": "W Magazine | Women's Fashion & Celebrity News", "image": {"identifier": "https://www.wmagazine.com/wp-content/uploads/2017/12/13/5a31a096499a6c4ea286ad36_khloe-kardashian-pregnancy-reveal.jpg?crop=0px,40px,1356px,677px&w=790px", "secure_url": "https://www.wmagazine.com/wp-content/uploads/2017/12/13/5a31a096499a6c4ea286ad36_khloe-kardashian-pregnancy-reveal.jpg?crop=0px,40px,1356px,677px&w=790px", "width": 1356, "height": 718}}, "fb": {"app_id": 450372832509980}, "twitter": {"card": "summary_large_image", "description": "Khloé Kardashian and Kylie Jenner may keep their pregnancies \"secret\" until they're revealed on \"Keeping Up\" in 2018.", "title": "Khloé Kardashian and Kylie Jenner May Not Confirm Their Pregnancies Until 2018", "image": "https://www.wmagazine.com/wp-content/uploads/2017/12/13/5a31a096499a6c4ea286ad36_khloe-kardashian-pregnancy-reveal.jpg?crop=0px,40px,1356px,677px&w=790px&mbid=social_retweet"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://www.wmagazine.com/wp-content/uploads/2020/01/cropped-favicon.png?fit=270%2C270"}, "movies": ["https://www.youtube.com/embed/PI2qyvKGd3w"], "publish_date": null, "source": "http://www.wmagazine.com", "summary": ""}