{"url": "https://variety.com/2017/tv/news/dynasty-reboot-cw-different-from-original-1202513560/", "text": "“Dynasty” is coming back to television in the form of a younger, sexier, sassier CW series.\n\nIn anticipation of the fall debut, the cast and creators of The CW’s “Dynasty” addressed the press for the first time on Wednesday at the Television Critics Association press tour in Beverly Hills for a well-received panel about the differences and similarities to the original primetime soap opera.\n\n“You see the word ‘Dynasty,’ and you’re like, ‘Oh yes,'” exclaimed star Elizabeth Gillies, who plays Fallon Carrington in the modernized reboot, recalling when the script first landed in her lap.\n\nThe cast and executive producers, Josh Schwartz and Stephanie Savage of “Gossip Girl” and series co-creator, executive producer and showrunner Sallie Patrick, expressed their desire to honor the original characters, while also making them their own. “I wanted to bring my own thing to her. I think she’s feisty as ever,” Gillies said.\n\nHere are 10 more things we learned about The CW’s “Dynasty” reboot:\n\n1. More original characters will appear in The CW series — including Alexis.\n\nAside from the core cast, based on the original “Dynasty” characters, the team plans to bring back some more familiar faces, namely Alexis, who was originally played by Joan Collins.\n\n“All in due time,” Schwartz teased, before Patrick confirmed that you will see Alexis during the first season, though she didn’t say who will be cast in the iconic role. “We don’t know yet,” Patrick said of the Alexis casting. “We’re going to see if it works out.”\n\nEven before Alexis shows up on screen, the character’s presence will be felt throughout the episodes. “We do refer to her a lot,” Schwartz said to which Patrick added, “We’re building up the spirit of Alexis. She’s definitely there in the other characters.”\n\n2. The original “Dynasty” was homophobic. The CW version will be far from that.\n\nBlake Carrington’s (Show) son, Steven (James Mackay), is gay and he’ll be out-and-proud.\n\n“The relationship between Blake and Steven is not about sexuality. Steven is confidently gay, Blake accepts him,” Schwartz said, explaining that the father-son duo will instead fight about other things like “environmental causes.”\n\n3. Today’s politics will make the 2017 “Dynasty” more relevant than the original.\n\nWhen asked about President Donald Trump’s power and wealth and how that may influence the show, Schwartz said the series’ influence is bigger than Trump.\n\n“We are definitely living in an age of dynasties,” he said. “Whether it’s the Trumps or the Clintons or the Kardashians or the Murdochs, our news is filled with the worlds of family dynasties and that was exciting for us.”\n\n4. The spelling of Crystal’s name (rather than Krystle, like the original character) has a lot of meaning behind it.\n\nActress Nathalie Kelley, who’s from Peru, portrays the character that was originally played by Linda Evans. But in the new and updated series, Crystal is Latina and from Venezuela.\n\n“This modern version represents a more current picture of what’s happening in America. The diversity of the cast really represents that,” Kelley said. “To weave that into the narrative of ‘Dynasty’ is really exciting and important to talk about the geo-politics of Venezuela on a CW show.”\n\n5. This version of “Dynasty” will focus on powerful and ambitious women.\n\nThe two female central stars, Gillies and Kelley, will both portray career-hungry women, who are fighting for power of the family company.\n\n“Both of these women are ambitious career women … they want to run this business,” Schwartz said. “Having Crystal have a more senior role in the company, not just being the secretary, makes her more credible of vying for control of this company with Fallon.”\n\nSavage said that the original show “really found itself” when the two women started sparring against each other, though in the ’80s series, their catfights were over a man, rather than a business.\n\n“They’re competitive, they’re both smart, they’re ambitious. You have the great head-to-head and [we’re] kicking it off with that great catfight,” Savage teased of the pilot episode.\n\n6. Speaking of fight scenes, don’t think they promote woman-on-woman hate.\n\nKelley joked that at first, she and Gillies were uncomfortable with physical fighting and wanted to work out their characters’ disagreements “through words.” But then, the actress realized there was a gender inequality issue with on-screen catfights.\n\n“Here’s how I justify it — if modern women today are fighting rightfully so for equal pay,” Kelley began, “Why can’t we also have the right to fight with men? Why should we be less feminine or less as women when we fight? That’s my feminist take on why we pull each other’s hair out!”\n\n7. The new “Dynasty” is based in Atlanta, while the original was set in Denver.\n\n“It felt like Atlanta was a realistic location of this family to be based out of,” Schwartz said, sharing that when he met with the Shapiros, they weren’t wedded to the location of Denver. “They kind of randomly picked it off of a map,” he said of the original location. “It didn’t feel like an issue that was integral to them creatively in the beginning.”\n\n8. The show will include comedic undertones.\n\n“We have a really funny cast so we wanted to be able to write toward that,” Schwartz said, assuring the room of reporters and critics that the catfights would be balanced with comedy.\n\n9. The fashion will still be a centerpiece of the 2017 primetime soap.\n\nMeredith Markworth-Pollack, who was the designer on The CW’s “Reign” and was an assistant to the designer on “Gossip Girl,” is in charge of the clothes on “Dynasty.”\n\n“She’s great with being in touch with new trends,” Savage raved of Markworth-Pollack, also teasing some “really fun themed parties coming up and things that are really dramatic and more costumey.”\n\n10. Like the original, The CW version will stay true to family.\n\n“When we first sat down with the Shapiros to talk about rebooting the show, they talked a lot about family. No matter the villainous things that they did, they never stopped loving each other,” Savage said of meeting with original “Dynasty” creators Richard and Esther Shapiro, who are executive producers on The CW show. “I think we took that core concept and then just talked about how to place the idea in the historical context of our day.”\n\nWhile the concept of core family will remain, the subject matter of their fights will change to adapt to modern times.\n\n“What are the conversations people are having about politics, about culture, about climate change? There’s so much going on, and we felt like the show could really be part of those conversations,” Savage explained. Schwartz added, “It’s really important for us for our show to meet this moment in time just like the original did in the ’80s.”\n\nGrant show, who plays Blake Carrington in The CW’s “Dynasty,” is best known for his starring role on the original “Melrose Place.” When asked if executive producer Aaron Spelling would have given his stamp of approval on the new “Dynasty,” he said, “absolutely.”\n\n“I think he would love it,” Show said. “One thing that Aaron always said was that his stories were about characters, were about people, and that’s what this story is about.”", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fdynasty-reboot-cw-different-from-original-1202513560%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202513560&comment_count=20", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2017/08/dynasty-tca.jpg?w=1000", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/08/dynasty-tca.jpg?w=1000", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2017/tv/news/dynasty-reboot-cw-different-from-original-1202513560/", "title": "10 Ways CW’s ‘Dynasty’ Reboot Will Be Different From the Original", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"Dynasty\" is coming back to television in the form of a younger, sexier, sassier CW series.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202513560, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-08-02T12:55:04"}, "pmc-tag": "Dynasty,Josh Schwartz,Stephanie Savage,TCA,The Cw", "title": "10 Ways CW’s ‘Dynasty’ Reboot Will Be Different From the Original", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "10 Ways CW’s ‘Dynasty’ Reboot Will Be Different From the Original", "url": "https://variety.com/2017/tv/news/dynasty-reboot-cw-different-from-original-1202513560/", "description": "“Dynasty” is coming back to television in the form of a younger, sexier, sassier CW series. In anticipation of the fall debut, the cast and creators of The CW’s “Dynasty&#82…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/08/dynasty-tca.jpg?w=1000", "width": 1000, "height": 562, "alt": "Dynasty"}, "locale": "en_US"}, "article": {"published_time": "2017-08-02T19:55:04+00:00", "modified_time": "2017-08-03T17:30:55+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "10 Ways CW’s ‘Dynasty’ Reboot Will Be Different From the Original"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/08/dynasty-tca.jpg?w=1000", "alt": "Dynasty"}, "card": "summary_large_image", "title": "10 Ways CW’s ‘Dynasty’ Reboot Will Be Different From the Original", "description": "\"Dynasty\" is coming back to television in the form of a younger, sexier, sassier CW series."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202513560, "title": "10 Ways CW's 'Dynasty' Reboot Will Be Different From the Original", "published_at": "2017-08-02 12:55:04", "image": "https://pmcvariety.files.wordpress.com/2017/08/dynasty-tca.jpg?w=1000", "comment_count": 20, "tags": "The Cw", "topics": "News", "appeared_in_print": "No", "body": "\"Dynasty\" is coming back to television in the form of a younger, sexier, sassier CW series.\r\n\r\nIn anticipation of the fall debut, the cast and creators of The CW's \"Dynasty\" addressed the press for the first time on Wednesday at the Television Critics Association press tour in Beverly Hills for a well-received panel about the differences and similarities to the original primetime soap opera.\r\n\r\n\"You see the word 'Dynasty,' and you're like, 'Oh yes,'\" exclaimed star Elizabeth Gillies, who plays Fallon Carrington in the modernized reboot, recalling when the script first landed in her lap.\r\n\r\nThe cast and executive producers, Josh Schwartz and Stephanie Savage of \"Gossip Girl\" and series co-creator, executive producer and showrunner Sallie Patrick, expressed their desire to honor the original characters, while also making them their own. \"I wanted to bring my own thing to her. I think she's feisty as ever,\" Gillies said.\r\n\r\n\r\n\r\nHere are 10 more things we learned about The CW's \"Dynasty\" reboot:\r\n\r\n1. More original characters will appear in The CW series -- including Alexis.\r\n\r\nAside from the core cast, based on the original \"Dynasty\" characters, the team plans to bring back some more familiar faces, namely Alexis, who was originally played by Joan Collins.\r\n\r\n\"All in due time,\" Schwartz teased, before Patrick confirmed that you will see Alexis during the first season, though she didn't say who will be cast in the iconic role. \"We don't know yet,\" Patrick said of the Alexis casting. \"We're going to see if it works out.\"\r\n\r\nEven before Alexis shows up on screen, the character's presence will be felt throughout the episodes. \"We do refer to her a lot,\" Schwartz said to which Patrick added, \"We're building up the spirit of Alexis. She's definitely there in the other characters.\"\r\n\r\n2. The original \"Dynasty\" was homophobic. The CW version will be far from that.\r\n\r\nBlake Carrington's (Show) son, Steven (James Mackay), is gay and he'll be out-and-proud.\r\n\r\n\"The relationship between Blake and Steven is not about sexuality. Steven is confidently gay, Blake accepts him,\" Schwartz said, explaining that the father-son duo will instead fight about other things like \"environmental causes.\"\r\n\r\n3. Today's politics will make the 2017 \"Dynasty\" more relevant than the original.\r\n\r\nWhen asked about President Donald Trump's power and wealth and how that may influence the show, Schwartz said the series' influence is bigger than Trump.\r\n\r\n\"We are definitely living in an age of dynasties,\" he said. \"Whether it's the Trumps or the Clintons or the Kardashians or the Murdochs, our news is filled with the worlds of family dynasties and that was exciting for us.\"\r\n\r\n4. The spelling of Crystal's name (rather than Krystle, like the original character) has a lot of meaning behind it.\r\n\r\nActress Nathalie Kelley, who's from Peru, portrays the character that was originally played by Linda Evans. But in the new and updated series, Crystal is Latina and from Venezuela.\r\n\r\n\"This modern version represents a more current picture of what's happening in America. The diversity of the cast really represents that,\" Kelley said. \"To weave that into the narrative of 'Dynasty' is really exciting and important to talk about the geo-politics of Venezuela on a CW show.\"\r\n\r\n5. This version of \"Dynasty\" will focus on powerful and ambitious women.\r\n\r\nThe two female central stars, Gillies and Kelley, will both portray career-hungry women, who are fighting for power of the family company.\r\n\r\n\"Both of these women are ambitious career women ... they want to run this business,\" Schwartz said. \"Having Crystal have a more senior role in the company, not just being the secretary, makes her more credible of vying for control of this company with Fallon.\"\r\n\r\nSavage said that the original show \"really found itself\" when the two women started sparring against each other, though in the '80s series, their catfights were over a man, rather than a business.\r\n\r\n\"They're competitive, they're both smart, they're ambitious. You have the great head-to-head and [we're] kicking it off with that great catfight,\" Savage teased of the pilot episode.\r\n\r\n6. Speaking of fight scenes, don't think they promote woman-on-woman hate.\r\n\r\nKelley joked that at first, she and Gillies were uncomfortable with physical fighting and wanted to work out their characters' disagreements \"through words.\" But then, the actress realized there was a gender inequality issue with on-screen catfights.\r\n\r\n\"Here's how I justify it -- if modern women today are fighting rightfully so for equal pay,\" Kelley began, \"Why can't we also have the right to fight with men? Why should we be less feminine or less as women when we fight? That's my feminist take on why we pull each other's hair out!\"\r\n\r\n7. The new \"Dynasty\" is based in Atlanta, while the original was set in Denver.\r\n\r\n\"It felt like Atlanta was a realistic location of this family to be based out of,\" Schwartz said, sharing that when he met with the Shapiros, they weren't wedded to the location of Denver. \"They kind of randomly picked it off of a map,\" he said of the original location. \"It didn't feel like an issue that was integral to them creatively in the beginning.\"\r\n\r\n8. The show will include comedic undertones.\r\n\r\n\"We have a really funny cast so we wanted to be able to write toward that,\" Schwartz said, assuring the room of reporters and critics that the catfights would be balanced with comedy.\r\n\r\n9. The fashion will still be a centerpiece of the 2017 primetime soap.\r\n\r\nMeredith Markworth-Pollack, who was the designer on The CW's \"Reign\" and was an assistant to the designer on \"Gossip Girl,\" is in charge of the clothes on \"Dynasty.\"\r\n\r\n\"She's great with being in touch with new trends,\" Savage raved of Markworth-Pollack, also teasing some \"really fun themed parties coming up and things that are really dramatic and more costumey.\"\r\n\r\n10. Like the original, The CW version will stay true to family.\r\n\r\n\"When we first sat down with the Shapiros to talk about rebooting the show, they talked a lot about family. No matter the villainous things that they did, they never stopped loving each other,\" Savage said of meeting with original \"Dynasty\" creators Richard and Esther Shapiro, who are executive producers on The CW show. \"I think we took that core concept and then just talked about how to place the idea in the historical context of our day.\"\r\n\r\nWhile the concept of core family will remain, the subject matter of their fights will change to adapt to modern times.\r\n\r\n\"What are the conversations people are having about politics, about culture, about climate change? There's so much going on, and we felt like the show could really be part of those conversations,\" Savage explained. Schwartz added, \"It's really important for us for our show to meet this moment in time just like the original did in the '80s.\"\r\n\r\nGrant show, who plays Blake Carrington in The CW's \"Dynasty,\" is best known for his starring role on the original \"Melrose Place.\" When asked if executive producer Aaron Spelling would have given his stamp of approval on the new \"Dynasty,\" he said, \"absolutely.\"\r\n\r\n\"I think he would love it,\" Show said. \"One thing that Aaron always said was that his stories were about characters, were about people, and that's what this story is about.\"", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1501703704.0, "source": "https://variety.com", "summary": ""}