{"url": "https://abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140", "text": "All eyes on Prince Harry, Meghan Markle as 2017 Invictus Games kick off Harry, 33, will lead an opening ceremony at the Air Canada Centre.\n\n\u0097 -- Prince Harry is preparing to kick off the 2017 Invictus Games, the Paralympic-style sporting event he founded for wounded service members.\n\nHarry, 33, will welcome the service members and their families before kicking the games off Saturday in an opening ceremony featuring the Canadian Armed Forces and celebrities including Sarah McLachlan at the Air Canada Center, an arena in downtown Toronto.\n\nHarry met with U.S. first lady Melania Trump, who is leading the U.S. delegation to the Invictus Games, before the official opening.\n\nToronto has been home to Harry’s girlfriend, Meghan Markle, for the past several years during her starring run on the television show “Suits.”\n\nMarkle, 36, who is believed to be in production now for “Suits,” is expected to make an appearance at some point during the Invictus Games.\n\nPrince Harry of Wales and Meghan Markle as they hold hands together on a date night while out in London, England on February 3, 2017. FameFlynet/BACKGRID\n\nAn appearance at the games would be the first time Markle accompanies Harry while he carries out official royal duties. Kensington Palace has not confirmed Markle’s attendance.\n\nThis year’s Invictus Games in Toronto will feature 550 competitors from 17 nations. They will compete in 12 different sports, from powerlifting to cycling and wheelchair rugby.\n\nAll 550 of the competitors are active duty and veteran service members who \"have become ill or injured during or as a direct consequence of their service,\" according to the games’ website.\n\nThe athletes will be supported by 1,500 volunteers. A focus this year is on the family and friends who support service members' journey to recovery.\n\nThe U.S. team will have 90 athletes competing in this year's games, according to the Department of Defense. First lady Melania Trump will lead the U.S. delegation in Toronto.\n\nPrince Harry attends the launch of the team selected to represent the UK in the 2017 Invictus Games in Toronto at The Tower of London, on May 30, 2017 in London, England. Jeremy Selwyn/WPA Pool via Getty Images\n\nFormer President Barack Obama will also show his support for U.S. athletes competing in Toronto. Obama does not have plans to meet with Mrs. Trump at the games.\n\nKevin Lewis, a spokesman for Obama, told ABC News in a statement the former president will meet with U.S. athletes while in Toronto.\n\n\"During his travel to Toronto, President Obama will also be able to meet with some of the U.S. participants in the Invictus Games to once again express his gratitude for their service, and his admiration for their courage and resilience,\" Lewis said in a statement.\n\nObama and his wife, Michelle Obama, were early supporters of the Invictus Games. Michelle Obama, a passionate advocate for veterans who recognized the service of military families during her time as first lady, headlined the opening ceremony of the 2016 Invictus Games in Orlando with Harry.\n\nJust before the 2016 games, the Obamas took to Twitter to challenge Harry, the fifth in line to the British throne, in a video that went viral.\n\nA personal mission\n\nHarry founded the Invictus Games in 2014 to raise awareness about the challenges wounded service members face and allow them to compete internationally against other soldiers with whom they served.\n\nThe sporting event has become a deeply personal mission for Harry, who was known as Capt. Wales during his 10 years in the British Army. He has previously hosted the games in London and Orlando.\n\n\"No one wants sympathy. All they want is an opportunity to prove themselves,\" Harry told ABC News' Robin Roberts at the 2016 Invictus Games in Orlando, Florida. \"And that's what this is all about.\"\n\nPrince Harry, Patron of the Invictus Games Foundation, cheers on competitors as he attends the UK team trials for the Invictus Games Toronto 2017 held at the University of Bath on April 7, 2017 in Bath, England. Chris Jackson/WPA Pool via Getty Images\n\nHarry revealed in June that he felt \"guilty\" when he was evacuated out of Afghanistan in 2008 after an Australian magazine violated a news blackout and revealed his location in the country.\n\nHe said he became determined to create an event that would ultimately change his life and create a lasting impact on other veterans and wounded service members and their families.\n\n\"In these challenging times, we can all benefit from positive and inspiring stories from which to draw strength,\" Harry said. \"The Invictus Games shows us that it is possible to overcome adversity and that the impossible is possible, if you have the will.\"\n\nBruce Springsteen, Kelly Clarkson and Bryan Adams will close out this year’s games.\n\nThe 2018 Invictus Games will be held in Sydney, Australia.", "images": ["https://s.abcnews.com/images/Entertainment/meghan-markle-prince-harry-gty-jpo-170921_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/meghan-markle-prince-harry-gty-jpo-170921_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Katie Kindelan", "Carolyn Durand", "September", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140", "title": "All eyes on Prince Harry, Meghan Markle as 2017 Invictus Games kick off", "meta_data": {"keywords": "prince harry, toronto, invictus games, meghan markle", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "All eyes on Prince Harry, Meghan Markle as 2017 Invictus Games kick off", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140", "title": "All eyes on Prince Harry, Meghan Markle as 2017 Invictus Games kick off", "image": "https://s.abcnews.com/images/Entertainment/meghan-markle-prince-harry-gty-jpo-170921_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2017-09-23T18:36:20Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,49929140", "ipad": "abcnewsipad://link/story,49929140", "googleplay": "https://abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "All eyes on Prince Harry, Meghan Markle as 2017 Invictus Games kick off", "url": "https://abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/meghan-markle-prince-harry-gty-jpo-170921_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,49929140", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,49929140", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/prince-harry-kick-off-2017-invictus-games-toronto/story?id=49929140"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}