{"url": "https://www.etonline.com/wells-adams-says-living-with-girlfriend-sarah-hyland-has-been-weirdly-perfect-exclusive-109475", "text": "There's no stopping the love between Wells Adams and Sarah Hyland.\n\nIf you ask the 34-year-old Bachelor In Paradise bartender and radio personality how he feels about his relationship with the 27-year-old Modern Family star, it's clear how head-over-heels he truly is, and appreciates his luck immensely.\n\nAdams -- who appeared on season 12 of The Bachelorette and then Bachelor in Paradise -- dropped by to chat with ET's Lauren Zima on Roses and Rose Live on Tuesday, where he opened up about how things are going with his lady love.\n\n\"I’m just so happy,\" Wells said. \"I did these crazy shows and then all of a sudden I get this amazing relationship out of it. I could’ve never imagined that was the path I was going to go down, but I’m so grateful for all of it.\"\n\nHyland, a self-professed Bachelor Nation superfan, connected with Wells over Instagram last year after seeing him on the show, and the two hit it off spectacularly.\n\nWells Adams On Why He Loves 'Strong, Powerful, Funny' Girlfriend Sarah Hyland (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Wells Adams On Why He Loves 'Strong, Powerful, Funny' Girlfriend Sarah Hyland (Exclusive)\n\nIn fact, Adams revealed that Bachelor host Chris Harrison even takes a bit of credit for his happy relationship.\n\n\"One thing you [didn’t see on this season of Bachelor in Paradise], was when I walked down the stairs and Chris Harrison was like, 'You’re welcome for your girlfriend!' And it’s so true!\" Adams recalled. \"If I hadn’t done the show and met Chris and all those people, I would have never had the opportunity to meet this amazing woman. So, I won the show!\"\n\nAdams finally moved to Los Angeles from his hometown of Nashville, Tennessee, a month ago when he began living together with Hyland, and he says their life under the same roof has pretty harmonious.\n\n\"It's been weirdly perfect, there have been no real issues. We were scared about the dogs meeting, but that went really well. It’s been perfect. It’s been great,\" Adams shared.\n\nWith the couple approaching the 1-year anniversary of the day they met, Adams reflected on what that moment meant for him and how it changed his life.\n\n\"It was the night before the Emmys party, and it was the day I knew I was going to move to L.A.,\" he explained, adding that Hyland is \"the one, for sure.\"\n\nFor Adams, the romance between him and Hyland came at the exact right moment in his life, and he was prepared to jump at the chance at finding love and cultivating their relationship. But getting into that headspace came after growing up a bit, emotionally.\n\nSarah Hyland Says She & Boyfriend Wells Adams Are 'Same Person With Different Genitalia' (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Sarah Hyland Says She & Boyfriend Wells Adams Are 'Same Person With Different Genitalia' (Exclusive)\n\n\"For me, you need to be ready [for the relationship.] If you watch The Bachelor, some people are like, ‘I’m really ready,’ and you’re not -- you’re 24 years old. And I think there came a point in my life where I was like, I really do want this. I don’t want to be single anymore. This isn’t fun for me,\" Adams reflected.\n\n\"I think you have to be emotionally ready for that and that’s number one,\" he added. \"Then I think think you have to find the person that compliments you the best, and Sarah is that for me. We’re both huge dorks, we have similar interests. Our brands are the same! Dogs, rose, tacos, [and] The Bachelor!\"\n\nRecently, ET caught up with Hyland at the sixth biennial Stand Up To Cancer telecast in Santa Monica, California, where she opened up about moving in with her boyfriend and how their relationship as impacted her life.\n\nCheck out the video below to hear more.\n\nSarah Hyland Says Wells Adams Is Seeing Her True Self Now That They Live Together (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\n'Bachelor in Paradise' Bartender Wells Adams Reveals 13 Things We Didn't See on TV (Exclusive)\n\nSarah Hyland Greets Wells Adams With a Kiss As He Moves Into Her L.A. Home\n\nWells Adams Shares His Biggest Concern About Moving in With Sarah Hyland\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-09/sarah_hyland_wells_adams_gettyimages-950077588_1440.jpg?h=2d44e782&itok=5AvTK0GB", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sarah_hyland_wells_adams_gettyimages-950077588_1440.jpg?h=2d44e782&itok=X2joAdkN", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-04/gettyimages-1208907871.jpg?h=967b01ed&itok=f0LeBGob", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sarah_hyland_wells_adams_gettyimages-950077588_1440.jpg?h=2d44e782&itok=X2joAdkN", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/wells-adams-says-living-with-girlfriend-sarah-hyland-has-been-weirdly-perfect-exclusive-109475", "title": "Wells Adams Says Living With Girlfriend Sarah Hyland Has Been 'Weirdly Perfect' (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Wells Adams Says Living With Girlfriend Sarah Hyland Has Been 'Weirdly Perfect' (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/wells-adams-says-living-with-girlfriend-sarah-hyland-has-been-weirdly-perfect-exclusive-109475", "title": "Wells Adams Admits Girlfriend Sarah Hyland Is 'The One'", "description": "The 34-year-old reality star also revealed to ET that he feels the 'Modern Family' actress is 'the one.'", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sarah_hyland_wells_adams_gettyimages-950077588_1440.jpg?h=2d44e782&itok=X2joAdkN", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 34-year-old reality star also revealed to ET that he feels the 'Modern Family' actress is 'the one.'", "title": "Wells Adams Admits Girlfriend Sarah Hyland Is 'The One'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/wells-adams-says-living-with-girlfriend-sarah-hyland-has-been-weirdly-perfect-exclusive-109475", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sarah_hyland_wells_adams_gettyimages-950077588_1440.jpg?h=2d44e782&itok=X2joAdkN"}, "description": "The 34-year-old reality star also revealed to ET that he feels the 'Modern Family' actress is 'the one.'", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, TV, Wells Adams, Sarah Hyland, Bachelor In Paradise, Roses and Rose", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/9oqZ4I4wL1g?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}