{"url": "en.wikipedia.org/wiki/13_Reasons_Why", "text": "This article is about the television series. For the novel, see Thirteen Reasons Why\n\n2017 American teen drama web television series\n\n13 Reasons Why (stylized onscreen as TH1RTEEN R3ASONS WHY) is an American teen drama web television series originally developed for Netflix as limited series by Brian Yorkey, based on the 2007 novel Thirteen Reasons Why by Jay Asher. The series revolves around seventeen-year-old high school student Clay Jensen and his deceased friend Hannah Baker,[4] who takes her own life after having to face a culture of gossip, bullying and sexual assault at her high school and a lack of support from her friends, her family and her school. A box of cassette tapes recorded by Hannah in the weeks preceding her suicide detail why she chose to end her life. The series is produced by July Moon Productions, Kicked to the Curb Productions, Anonymous Content and Paramount Television, with Yorkey and Diana Son serving as showrunners.\n\nDylan Minnette stars as Clay Jensen, while Katherine Langford plays Hannah Baker. Christian Navarro, Alisha Boe, Brandon Flynn, Justin Prentice, Miles Heizer, Ross Butler, Devin Druid, Amy Hargreaves, Derek Luke, Kate Walsh, and Brian d'Arcy James also star. A film from Universal Pictures based on Thirteen Reasons Why began development in February 2011, with Selena Gomez set to star as Hannah, before being shelved in favor of a television series and Netflix ordering an adaptation as a limited series in October 2015, with Gomez instead serving as an executive producer. [5]\n\nThe first season was released on Netflix on March 31, 2017. It received positive reviews from critics and audiences, who praised its subject matter and acting, particularly the performances of Minnette and Langford. For her performance, Langford received a Golden Globe Award nomination for Best Actress – Television Series Drama.[6] However, its graphic depiction of issues such as suicide and rape (along with other mature content) prompted concerns from mental health professionals. In response, Netflix added a warning card and from March 2018 on, a video that plays at the start of each season warning viewers about its themes.[7] In July 2019, Netflix edited out the suicide scene in the first season's final episode.[8]\n\nIn May 2017, Netflix renewed 13 Reasons Why for a second season due to the success of the initial 13 episodes;[9] the second season was released on May 18, 2018, and received mixed to negative reviews from audiences. Coinciding with the release of the second season, Netflix released a video with the cast that cautioned viewers on some of the topics covered in the show and provided a support website with crisis numbers for people affected by depression, anxiety and other mental health issues.[10] A third season was ordered in June 2018 and was released on August 23, 2019. In August 2019, the series was renewed for a fourth and final season.[12]\n\nPremise [ edit ]\n\nIn season one, seventeen-year-old Clay Jensen returns home from school one day to find a mysterious box on his porch. Inside he discovers thirteen cassette tapes recorded by Hannah Baker, his deceased classmate who killed herself two weeks earlier. On the tapes, Hannah unfolds an intensely emotional audio diary, detailing why she decided to end her life. It appears each person who receives this package of old-style tapes is fundamentally related to why she killed herself. Clay is not the first to receive the tapes, but there is an implication that he should pass the tapes on after hearing them. There appears to be an order to distribution of the tapes, with an additional copy held by an overseer should the plan go awry. Each tape recording refers to a different person involved in Hannah's life contributing to a reason for her suicide (mostly referring to both her friends and enemies).[13]\n\nIn season two, months after Hannah's suicide, Clay and the other people mentioned on the tapes, as well as close friends and Hannah's family members, become embroiled in a civil legal battle between Hannah's parents and Liberty High School. Alleging negligence on the part of the school, Hannah's mother pursues her perception of justice, while her reluctance to settle pre-trial and her personal circumstances eventually break up her marriage with Hannah's father. The story unfolds with narratives illustrating Hannah's story told by those who were present in court at the trial.\n\nClay, who perceives himself as Hannah's failed protector, embarks on an investigation using whatever evidence he can find in an effort to impact on the civil case between Hannah's parents and the school. Clay also endeavors to expose the corrupted culture of the high school and its favor of wealthy jocks over the average student, which especially compromises the integrity of young girls such as Hannah.\n\nSeason three is set eight months after the end of season two. Clay and his friends are struggling to cope with the cover-up of Tyler's attempted massacre at the Spring Fling, while helping him towards recovery. However, acrimonious tensions reach a boiling point during Liberty High's Homecoming game, which results in the murder of Bryce Walker. The students of Liberty High are once again forced under the microscope as the investigation into Bryce's death threatens to expose their darkest secrets. [14]\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nIntroduced in season one [ edit ]\n\nIntroduced in season two [ edit ]\n\nParminder Nagra as Priya Singh (season 3; guest season 2), the school counsellor at Liberty High\n\nAnne Winters as Chlöe Rice (seasons 2–3), a smart, clueless, popular girl at Liberty High and the new head cheerleader who is also Bryce's girlfriend. At the end of the second season, it is revealed that she is pregnant.\n\nJake Weber as Barry Walker (season 2; guest season 3), Bryce's father\n\nMeredith Monroe as Carolyn Standall, Alex's mother\n\nR.J. Brown as Caleb, Tony's boxing trainer and boyfriend\n\nBryce Cass as Cyrus, an edgy, cynical mischief maker who serves as an unexpected champion of the downtrodden. He befriends Tyler and the two together embark on smear campaigns against bullies.\n\nChelsea Alden as Mackenzie, Cyrus' sister, an artsy and witty girl who is not afraid to speak her mind. In the second season, she briefly develops a relationship with Tyler, though the latter breaks it up.\n\nAllison Miller as Sonya Struhl (season 2), a smart and ambitious young litigator, who defends the school during the Hannah Baker trial\n\nBrandon Butler as Scott Reed (season 2), a student at Liberty High who is on the baseball team\n\nSamantha Logan as Nina Jones, a well-respected track star who befriends Jessica over shared sexual assault pasts\n\nKelli O'Hara as Jackie, a passionate advocate for victims of bullying\n\nBen Lawson as Rick Wlodimierz, the baseball coach at Liberty High, who supports and protects his players\n\nKeon Motakhaveri as Chad Moore, one of Cyrus' friends\n\nSpencer Moore II as Michael, one of Nina's friends\n\nJames Cretan as Eric Cox, one of Cyrus' friends\n\nMason Guccione as Toby Fletcher, one of Cyrus' friends\n\nMikko Edwards as Jada, a cheerleader at Liberty High\n\nIntroduced in season three [ edit ]\n\nTyler Barnhardt as Charlie St. George, a jock at Liberty High who is friends with Montgomery but kind at heart\n\nBex Taylor-Klaus as Casey Ford, a member of HO and Jessica's friend\n\nAustin Aaron as Luke Holliday, a jock at Liberty High\n\nHart Denton as Dean Holbrook, a student at Hillcrest who does not like Bryce\n\nDeaken Bluman as Winston Williams, a student at Hillcrest who hooks up with Montgomery\n\nNana Mensah as Amara Josephine Achola, Ani's strict mother and the Walker's nurse and housekeeper\n\nBenito Martinez as Sheriff Diaz, the head police officer in Bryce's murder case\n\nMarcus DeAnda as Mr. de la Cruz, Montgomery's abusive father\n\nRaymond J. Barry as Harrison Chatham, Nora's sick father and Bryce's grandfather\n\nBrandon Scott as J. J. Kerba, a football coach at Liberty High, who is hard on the players to get them to shape up\n\nJ. Kerba, a football coach at Liberty High, who is hard on the players to get them to shape up Ron Rogge as Morris, the head football coach at Liberty High\n\nBlake Webb as Tim Pozzi, a drug dealer who sells cheap steroids at the local gym\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 13 March 31, 2017 ( ) 2 13 May 18, 2018 ( ) 3 13 August 23, 2019 ( )\n\nSeason 1 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 1 1 \"Tape 1, Side A\" Tom McCarthy Brian Yorkey March 31, 2017 ( ) Clay Jensen finds a box filled with audio cassette tapes anonymously left on his front doorstep. He plays the first in his father's boombox and realizes they have been recorded by his recently deceased classmate Hannah Baker before he accidentally drops and breaks the boombox when surprised by his mother. Clay steals his friend Tony's Walkman to continue listening. Clay listens to the first tape, in which Hannah begins to relate the experiences that led to her suicide. She starts by sharing the story of her first kiss, with Justin Foley, who goes on to inadvertently spread a salacious rumor that begins the sequence of events leading to her suicide. Clay is revealed, through numerous short flashbacks, to have been in love with Hannah and to have worked with her at the local movie theater. It is revealed in this episode that Hannah has put her friend Tony in charge of the tapes. Tape subject: Justin Foley, for spreading a racy picture of Hannah along with a sexual rumor about their encounter. 2 2 \"Tape 1, Side B\" Tom McCarthy Brian Yorkey March 31, 2017 ( ) Hannah reminisces about her friendship with two other new students: Jessica, who moves frequently because her father is in the Air Force, and Alex, whom they met at a coffee shop. Jessica and Alex eventually begin a relationship and stop spending time with Hannah. When Alex breaks up with Jessica, she very publicly blames Hannah. In the present, Hannah's mother, Olivia, finds a note in her daughter's textbook that leads her to believe Hannah was being bullied. Clay asks Jessica about the tapes, which results in Bryce Walker's circle of peers meeting to discuss how Clay is listening to Hannah's recordings. Tape subject: Jessica Davis, for mistakenly blaming Hannah for her breakup with Alex. 3 3 \"Tape 2, Side A\" Helen Shaver Diana Son March 31, 2017 ( ) As Clay attempts to pursue a romantic relationship with Hannah, her relationships are threatened by a \"best/worst list\" made by Alex Standall, who has put a \"target\" on Hannah. In the present, Hannah's mother, Olivia Baker, seeks out the school principal about her suspicion of bullying and makes a disturbing discovery. In the midst of his investigation, Clay turns to Alex for answers, who not only feels regret for his actions on the tapes, but also warns Clay against trusting Tony, whom Clay later sees in a violent exchange with his brothers. As Justin tries to recuperate from his recent slump, Bryce strong-arms Clay and Alex into a drinking contest in an alleyway. Tape subject: Alex Standall, for listing Hannah's ass as the best in school to make Jessica Davis jealous and for destroying her friendship with Jessica. 4 4 \"Tape 2, Side B\" Helen Shaver Thomas Higgins March 31, 2017 ( ) Hannah hears someone outside her window, and confesses to her friend, Courtney, that she has a stalker. Courtney offers to help her catch the offender in the act. While waiting for the stalker to arrive, they play an alcohol-fueled game of truth or dare that leads to the two of them kissing on Hannah's bed. The stalker, school photographer Tyler Down, takes a photo of the girls and sends it around the school. This effectively ends Courtney and Hannah's friendship as Courtney distances herself from Hannah to avoid being revealed as one of the people in the photograph. In the present, Clay goes to Hannah's house and talks to her mother, though is unable to admit how close he and Hannah were. He also confronts Tony about the incident with his brothers. Tony responds that \"people have to make their own justice\" and proves he has an extra set of tapes. Inspired by this, Clay takes a naked picture of Tyler and sends it around the school in revenge. Tape subject: Tyler Down, for stalking Hannah and spreading the photo of her and Courtney's kiss around the school. 5 5 \"Tape 3, Side A\" Kyle Patrick Alvarez Julia Bicknell March 31, 2017 ( ) Courtney, afraid of her classmates finding out about her sexuality, spreads a rumor that the girls in the leaked photos are Hannah and Laura, an openly lesbian classmate. Courtney also adds to the rumor about Hannah and Justin, worsening Hannah's poor reputation. In the present, Clay takes Courtney to visit Hannah's grave. She leaves, not ready to face her involvement in the loss of her classmate or be more open about her sexuality. Tony arrives with Clay's bike and gives him a tape with the song he and Hannah danced to at the Winter Formal. Later, Justin, Zach and Alex force Clay into the car with them by stealing his bike and scare him into silence about the tapes by driving over the speed limit. They are pulled over by the police but face no consequences as the officer is revealed to be Alex's father. Clay denies knowing Hannah to his mother, who has been asked to represent the school in the lawsuit the Bakers are bringing. Tape subject: Courtney Crimsen, for deflecting attention about both her sexuality and the photo Tyler took of her and Hannah by spreading further rumors about Hannah. 6 6 \"Tape 3, Side B\" Kyle Patrick Alvarez Nic Sheff March 31, 2017 ( ) Hannah's date on Valentine's Day with Marcus does not go as planned due to the rumors that she is promiscuous. In the present, Alex gets into a fight with Montgomery and they both must appear before the student honor board. Clay helps Sheri on an assignment, and they nearly hook up, but Sheri reveals she is only there because she is on the tapes and wants Clay to like her despite her role in Hannah's death. Tape subject: Marcus Cole, for humiliating and attempting to sexually assault Hannah in public on their Dollar Valentine date. 7 7 \"Tape 4, Side A\" Gregg Araki Elizabeth Benjamin March 31, 2017 ( ) After Hannah refuses to go out with Zach, he gets revenge by sabotaging her emotionally during a class project. Zach removes compliments from Hannah's box, affecting her self-confidence. In the present, Clay hears Zach's tape and keys his car in an act of revenge, but things turn out to be different than they appeared. Clay is now having both auditory and visual hallucinations of Hannah during the day, including seeing her dead body on the floor of the basketball court during a game and hearing her tape playing over the school's intercom system. He returns the tapes to Tony, unable to continue listening. Tape subject: Zach Dempsey, for stealing the \"positive notes\" destined to Hannah in Communications class out of revenge for her rejecting him and his help. 8 8 \"Tape 4, Side B\" Gregg Araki Kirk Moore March 31, 2017 ( ) Hannah is touched by poetry recited by fellow student Ryan Shaver, and joins the Evergreen Poetry Club, a place where people write and perform their own poetry, and listen and critique others. Hannah presents some extremely revealing and confessional poetry at the poetry club after Ryan encourages her. Ryan betrays her by publishing the poem without her knowledge or consent in his school magazine. Almost everyone in school finds the poem hilarious, but Clay is both touched and disturbed by it, not realizing Hannah is the author. In the present day, Tony confides to Clay about the night of Hannah's death, and Clay takes back the tapes. Clay later gives the poem to Hannah's mother. Tape subject: Ryan Shaver, for stealing a poem Hannah wrote detailing her personal problems and publishing it in the school newspaper without her consent. 9 9 \"Tape 5, Side A\" Carl Franklin Hayley Tyler March 31, 2017 ( ) While hiding in Jessica's room during a party, Hannah witnesses Bryce Walker raping an unconscious and intoxicated Jessica. In the present, Marcus warns Clay the worst is yet to come and again attempts to scare him into silence about the tapes, this time by planting drugs in his backpack to get him suspended from school. Clay finally admits to his mother that he and Hannah were close. After getting suspicious legal advice from his mother, he goes to Justin's apartment to retrieve his bike and talk about getting justice for Jessica. Justin finally admits that what happened in the tapes is real, and claims it is better if Jessica does not know the truth. Tape subject: Justin Foley (and seemingly Hannah Baker herself), for allowing Bryce to rape his girlfriend Jessica. 10 10 \"Tape 5, Side B\" Carl Franklin Nathan Louis Jackson March 31, 2017 ( ) After the party, Hannah gets a ride home from her classmate, cheerleader Sheri Holland. They have what appears to be a minor accident, knocking over a stop sign. While Hannah wants to call the police to report it, Sheri refuses to do so, because she is afraid she will get in trouble. While Hannah is on her way to find a phone to call the authorities, the downed stop sign causes a serious accident at that intersection, resulting in the death of Clay's friend Jeff Atkins, which was incorrectly considered a drunk driving accident. When Hannah tries to tell Clay about the stop sign, he pushes her away, thinking she is being unnecessarily dramatic. In the present, Jessica's behavior becomes more erratic. Clay finds out that Sheri is trying to make up for her mistake in her own way, and he tells Jeff's parents that Jeff was sober when he died. Tape subject: Sheri Holland, for abandoning Hannah after crashing her car into a stop sign, which ultimately caused the death of Jeff Atkins. 11 11 \"Tape 6, Side A\" Jessica Yu Diana Son March 31, 2017 ( ) With Tony's support, Clay finally listens to his tape and is overcome with guilt to the point of contemplating his own suicide because he feels he did not do enough to prevent Hannah's death. Tony manages to calm him down; the two climb a mountain and each have a mental breakdown at the top. Justin finds out Jessica is at Bryce's home. He confronts her there and admits that Bryce raped her on the night of the party, causing her to break up with him. Olivia Baker finds a list with the names of all the people on the tapes, although she does not know what the list means. Tape subject: Ostensibly Clay Jensen, for complying with Hannah's request to leave her alone at Jessica's party. However, Hannah is explicit in stating Clay is not included in the list, but is there because he must be, as he is part of the story. 12 12 \"Tape 6, Side B\" Jessica Yu Elizabeth Benjamin March 31, 2017 ( ) After accidentally losing her parents' store's earnings, a depressed Hannah stumbles upon a party being thrown by Bryce. The night ends in tragedy when she ends up alone with him, and he rapes her in his hot tub. This leads Hannah to create a list of people (the one that her mother found in the previous episode) who she feels were responsible for leading her to her current circumstances, which becomes the inspiration for the creation of the tapes. In the present, everyone on Hannah's list is subpoenaed to testify in the lawsuit between the Bakers and the school. The subjects of the tapes disagree over what to do. Tyler eventually suggests they pin everything on Bryce, but Alex refuses and says they should tell the truth. Sheri turns herself in. Clay goes to Bryce's house, on the pretext of buying marijuana, to confront him about the events of the night he raped Hannah. Clay provokes Bryce to attack him and is badly beaten. However, Clay has been secretly recording their conversation and gets Bryce to admit that he raped Hannah. An unknown teenager with a gunshot wound to the head is treated by paramedics. Tape subject: Bryce Walker, for raping Hannah in his hot tub. 13 13 \"Tape 7, Side A\" Kyle Patrick Alvarez Brian Yorkey March 31, 2017 ( ) Hannah begins to record the tapes and then visits Mr. Porter to tell him about her rape as she secretly records the conversation, hoping he will help her. When he does not, she heads to a post office and mails the tapes to Justin Foley before going home and taking her own life by slitting her wrists. In the present, Clay gives Tony the tape of his conversation with Bryce to copy before confronting Mr. Porter about meeting with Hannah on her last day. As the depositions begin, Marcus and Courtney deny their involvement in Hannah's death as much as possible while Zach and Jessica admit their mistakes. Before his deposition, Tyler hides ammunition and guns in his room, and then reveals the existence of the tapes during his interview. Alex is revealed to have been the teenager with the gunshot wound as he is in critical condition at the hospital. Jessica finally tells her father about her rape while at school, Clay reaches out to Skye Miller, his former friend, to avoid repeating the same mistakes he made with Hannah. Tape subject: Mr. Porter, for not believing Hannah was suicidal and for not giving her proper help. Note: Netflix digitally altered the suicide scene in this episode on July 15, 2019.[21]\n\nSeason 2 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 14 1 \"The First Polaroid\" Gregg Araki Brian Yorkey May 18, 2018 ( ) Five months after the events of the first season, Hannah's trial moves to court. Tyler is the first to testify in the trial and does so truthfully. Skye and Clay are dating, but Clay starts to have hallucinations of Hannah. Mr. Porter confronts Bryce in the bathroom about raping Hannah. Jessica returns to school, as does Alex who survived his suicide attempt but has lost much of his memory from before it, including the contents of Hannah's tapes. Tony is given the note Hannah left him the night she died and is later seen burning it. A Polaroid was left in Clay's Locker which falls out when he opens it, Clay picks it up, flips it to look at the back and a note saying \"Hannah wasn't the only one\". Testified: Tyler Down, During cross examination by the school lawyer talks about taking photos of Hannah during a photoshoot and attempting to befriend her. 15 2 \"Two Girls Kissing\" Gregg Araki Thomas Higgins May 18, 2018 ( ) Courtney reveals that she is a lesbian and had feelings for Hannah during her testimony. A group of protesters gathers at the court to demand justice for Hannah, but Jessica and Alex are both threatened to avoid revealing anything incriminating when they testify. Skye and Clay fight over her suspicion that Clay is still in love with Hannah, and Skye is hospitalized soon after leaving Clay's house. Meanwhile, Tyler befriends a classmate named Cyrus. Testified: Courtney Crimsen, who talks about her feelings towards Hannah and their kiss. 16 3 \"The Drunk Slut\" Karen Moncrieff Marissa Jo Cerar May 18, 2018 ( ) Clay, riding home on his bicycle, is hit intentionally by a car, injuring him slightly. He visits Skye in the hospital, but she breaks up with him. Clay and Alex try to encourage Jessica to reveal information about Bryce during her testimony, but she fails after seeing incriminating pictures of her stuck to the board in a classroom. Olivia asks her afterwards if she was the girl on the ninth tape, but Jessica does not answer. After discovering Jessica had been contacted by Justin, Clay finds him homeless in Oakland with Tony's help. With no other option, Clay lets Justin stay in his bedroom with him. Skye's parents move her to a psychiatric facility, and tell Clay not to contact her. Tyler meets the rest of Cyrus' friends while Bryce is asked to testify. Testified: Jessica Davis, who talks about the hot-or-not list and hers and Hannah's friendship. 17 4 \"The Second Polaroid\" Karen Moncrieff Hayley Tyler May 18, 2018 ( ) Marcus lies about what happened with Hannah the night they went out on Valentine's Day during his testimony (in order to protect his reputation) and briefly mentions Bryce, angering him. Cyrus and Tyler hear of Marcus' lies and prank him, going to a nearby field afterwards to shoot guns. Clay finds out that Justin has been taking heroin and he and Sheri help him onto the path to sobriety. Jessica shows the threatening note she was left before her testimony to Mr Porter. Alex continues to be frustrated about not being able to remember anything and asks Clay for the tapes, who sends them to him. Jessica and Alex skip school and share a kiss. Clay also finds a second Polaroid photograph in his locker, which shows Bryce having sex with an unconscious girl, alongside a note saying \"he won't stop\". Testified: Marcus Cole, who lies about what happened with Hannah the night they went out. 18 5 \"The Chalk Machine\" Eliza Hittman Nic Sheff May 18, 2018 ( ) Tyler is confronted by Mr. Porter, who suspects he was behind the pictures of Jessica found in the classroom before her testimony, but he denies involvement. Ryan testifies and talks about Hannah's poems, saying they were written about Justin and that she and Justin maintained contact even after falling out. Afterwards, Olivia invites Ryan to help her decipher Hannah's poems for additional clues, but Ryan soon leaves after Olivia mentions missing pages in Hannah's journal, which Ryan had torn out. Clay realizes the Polaroid photos were taken at school and attempts to find out where. Chlöe meets with Bryce's parents and his mother notices bruises on her. Jessica attends her first group therapy session, where she befriends Nina. Mr. Porter finds a brick thrown through his car window, with a threatening note attached; he later confronts Justin's mother and is arrested after a violent incident with her boyfriend. Testified: Ryan Shaver, who talks about the poems he wrote with Hannah and who she wrote them about. 19 6 \"The Smile at the End of the Dock\" Eliza Hittman Julia Bicknell May 18, 2018 ( ) Zach testifies and reveals that he and Hannah had a romantic relationship the summer before she died, but they kept it secret. After the testimony, Clay reacts angrily and confronts Zach, ignoring his apologies, while Bryce teases Zach about his relationship, prompting a small fight between them. Justin returns to school and talks to Jessica, but she asks him to leave. He then faints after seeing Bryce, and on his return to Clay's house, has to hide as someone breaks in, at which point Clay's parents find out he has been staying there, but allow it to continue. Testified: Zach Dempsey, who talks about his relationship with Hannah the summer before she died. 20 7 \"The Third Polaroid\" Michael Morris Brian Yorkey May 18, 2018 ( ) During Clay's testimony, he is forced to reveal he and Hannah did drugs at a small party one night and spent the night together, and Clay ignored a comment Hannah made the next morning about wanting to die. Alex's birthday party at the arcade is derailed after a number of arguments break out. When Clay leaves the birthday party, he finds a Polaroid photograph left on his car, with a note reading \"The Clubhouse\". After reading comments posted online about his testimony, Clay anonymously uploads Hannah's tapes to the Internet. Meanwhile, Bryce is seen having sex with Chlöe without getting proper consent. The baseball team pays tribute to Jeff Atkins. Testified: Clay Jensen, who talks about his friendship with Hannah. 21 8 \"The Little Girl\" Michael Morris Felischa Marye May 18, 2018 ( ) After the release of the tapes, Bryce returns to school to find his locker vandalized and his \"confession tape\" Clay recorded being shared among students. After Marcus is blackmailed, he calls Bryce a rapist during a speech at a ceremony, in front of a large group of parents and students, in order to protect his own reputation. Clay finally contacts Skye again and meets with her at the psychiatric facility, but she tells him she is moving to a different state. Justin overdoses on heroin, but Alex saves his life – he then returns to his mother's home. The release of the tapes gets Clay in trouble with his parents. Testified: Andy and Olivia Baker, who talk about Hannah's life and the bullying at Liberty High. 22 9 \"The Missing Page\" Kat Candler Rohit Kumar May 18, 2018 ( ) When testifying, Mr. Porter reveals that since Hannah's death he has come to believe that Hannah was raped by Bryce. He then emotionally apologizes to Hannah's mother for the part he played in her suicide. Justin steals money from his mother's boyfriend, and when confronted by his mother, leaves her some suggesting she leave too in order to escape the relationship. Bryce confronts and threatens Clay under the assumption that it was Clay who blackmailed Marcus into publicly accusing Bryce of rape. Later, Clay is violently beaten at school by four masked students. He is then approached by Cyrus who invites him to join him and Tyler in vandalizing the school that evening, but when he does, he sees a group of students entering a storage shed next to the baseball field, which he correctly guesses is the location of The Clubhouse. He texts Justin and they reconvene. Meanwhile, Olivia contacts a girl, Sarah, and her mother and asks them not to testify. Testified: Pam Bradley, who talks about the atmosphere at Liberty High, and Kevin Porter, who talks about the day Hannah asked help from him. 23 10 \"Smile, Bitches!\" Kat Candler Kirk Moore May 18, 2018 ( ) Tony is asked to testify, but chooses not to reveal that Hannah left him her tapes because he owed her a favor after she helped him evade arrest. During Sarah's testimony, she reveals Hannah was part of a trio of girls who bullied her at another high school. After an argument between Tyler and Mackenzie, his friendship with Cyrus breaks down. Offering marijuana, Sheri tempts some male students into taking her to The Clubhouse, where Bryce takes a picture of her and two other boys on a Polaroid camera, placing the photograph in a box filled with many others. She learns the code to unlock the door and shares it with Clay and Justin. During a baseball game, Zach confronts Bryce, tells him he knows Hannah was not lying, and quits the game. He goes to The Clubhouse to find Clay and Justin there, and hands Clay the box of Polaroid photographs taken in the Clubhouse, confessing that it was him who had given Clay the first three photographs. Clay reviews the photographs at home with Justin and Sheri, and they find a pair of photographs which show Bryce raping Chlöe. Clay also finds a picture of Nina and Hannah. Testified: Sarah, who talks about Hannah bullying her and Tony Padilla, who talks about his friendship with Hannah. 24 11 \"Bryce and Chloe\" Jessica Yu Marissa Jo Cerar & Thomas Higgins May 18, 2018 ( ) While testifying, Bryce lies and claims that he and Hannah had a casual sexual relationship, and that she falsely accused him of rape after he brought an end to it. When Bryce returns to school, Justin attacks him and a fight breaks out, which evolves into a mass brawl. Jessica shows Chlöe the two pictures of Bryce and her in The Clubhouse, and Chlöe confesses that she posted the pictures of Jessica in the classroom before she testified. Olivia, her legal team, and Jessica ask Chlöe to testify, and she agrees, but on the stand, she testifies that she remembers Bryce having sex with her and remembers consenting. The box of Polaroid photographs taken from The Clubhouse is stolen from Clay's car, and Alex is sent a package containing a gun and a threatening letter. Bryce's mother later asks him whether he was telling the truth in his testimony, and, after being pressed, he coldly confesses to raping Hannah. Flashbacks reveal that Bryce wanted a relationship with Hannah and was rejected himself. Clay becomes mentally tormented by hallucinations of Hannah, to the point where he contemplates both murdering Bryce and killing himself, but Justin manages to calm him down. Testified: Bryce Walker, who lies about raping Hannah, and Chloe Rice, who talks about the clubhouse but also lies about being raped by Bryce. 25 12 \"The Box of Polaroids\" Jessica Yu Hayley Tyler & Brian Yorkey May 18, 2018 ( ) Justin receives a death threat before going to testify, but he tells of Bryce raping Jessica during his testimony nonetheless. After Alex realizes that Montgomery is responsible for intimidating people during the trial, Alex, Clay, Justin, Tony, Zach, and Scott confront Montgomery and he admits to stealing the box of Polaroid photos. However, after Montgomery takes Alex to a deserted location to retrieve them, he reveals he was lying and escapes. As a result, Jessica is encouraged by her friends to report her case of sexual assault to the police. After the Baker trial concludes and the jury finds the school district not responsible for Hannah's death, both Bryce and Justin are arrested outside the courtroom for their involvement in Jessica's rape. Mr. Porter is fired after a performance review, and Tyler is placed on a diversion program after one of his social media posts reveals it was him who vandalized the school. Testified: Justin Foley, who talks about his relationship with Hannah and confesses about Bryce raping Jessica. 26 13 \"Bye\" Kyle Patrick Alvarez Brian Yorkey May 18, 2018 ( ) One month later, after Bryce's sexual assault trial for raping Jessica, Bryce is convicted but sentenced to only three months' probation. Justin is sentenced to six months' probation and can only be released to one of his parents, neither of whom can be found which leads Clay's family to adopt him. Tyler returns to school but is beaten and brutally sodomized by an enraged Montgomery and two of his friends. The following night, at a school dance, Jessica and Justin share an intimate encounter, and Chlöe tells Jessica she is pregnant. \"The Night We Met\" plays and everyone dances with Clay. Tyler arrives at the dance planning to carry out a mass school shooting, but Clay learns of his plan, thanks to a text that Mackenzie received from Tyler. He then goes outside to confront him, encouraging him not to do it as peacefully disarms Tyler as Tony arrives to drive Tyler away in his car. As the car departs, sirens of the approaching police cars can be heard, and Clay is left holding Tyler's rifle in front of the school.\n\nSeason 3 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 27 1 \"Yeah. I'm the New Girl\" Michael Morris Brian Yorkey August 23, 2019 ( ) Flashbacks: On the night of Spring Fling, Clay and Tony help Tyler get away and get rid of the weapons, while Justin, Zach and Cyrus cover for them with the police. The next day, Clay makes a schedule of the group monitoring Tyler and helping him get back to himself, though Zach refuses to participate, believing Tyler has become a psychopath. At school that day, Courtney has Clay give a tour of the school to a new transfer student, Ani Achola, who he forms a slight bond with and introduces to his friends. Later, during a student council meeting, Jessica blames athletes for being the cause of problems at the school. Ani, inspired by this, suggests that Jessica run for president, which Jessica agrees to, also becoming her friend. Bryce moves in with his mother after his father leaves town and sells the house. Present: Clay is brought from school to the police station and questioned by Deputy Standall about Bryce Walker's disappearance. Principal Bolan reprimands Jessica over a riot that occurred at the homecoming game. Clay tells the others that Bryce is missing, putting some of them on edge. Suspect: Clay Jensen because of his bicycle lock found in Bryce's room. 28 2 \"If You're Breathing, You're a Liar\" Michael Morris Allen MacDonald August 23, 2019 ( ) Flashbacks: Zach is elected captain of the football team, despite Montgomery having been the favorite, and vows to change the rape culture. At an assembly for class presidential candidates, Jessica promises to change the school culture. Chloe walks out and reveals to Zach that she's pregnant. Zach takes her to get an abortion, where she is harassed by pro-life activists. Afterward she tells Zach she will not be coming back to Liberty High next year, and breaks up with Bryce. Meanwhile, Bryce is bullied by the football team at his new school, since they disapprove of him for being a rapist. Present: After Clay sees a rabbit's foot stuck to Zach's bag, which he knows belonged to Chloe, he and Ani confront Zach. Jessica tells them about Chloe's pregnancy, but claims Bryce never knew, which Chloe confirms. Montgomery threatens Tyler after having been interrogated by the police about Bryce, and is later threatened himself by Alex. Ani finds that Bryce was writing a letter to Jessica. After taking pictures of himself shirtless, Tyler walks by the river, and eventually climbs an overpass. Later, near that overpass, the police pull a corpse out of the river, revealed to be Bryce. Suspect: Zach Dempsey because of the gift Chlöe gave him. 29 3 \"The Good Person Is Indistinguishable from the Bad\" Jessica Yu Hayley Tyler August 23, 2019 ( ) Flashbacks: Jessica is elected student body president, and begins working at the Crestmont. She later confronts Bryce at his house, where he tries to admit he was wrong, but is ignored. Bryce tries to apologize to her at work, but is rejected again. Later, Bryce meets up with Justin, revealing his attempts to apologize, as well as his knowledge of Tyler's attempt to commit a school shooting. Meanwhile, Jessica tells Ani that sex with Alex isn't great, and Ani encourages her to \"reconnect\" with her body. Jessica does, and afterward, breaks up with Alex and begins a casual relationship with Justin. Present: Clay notices a scar on Justin's back. Later, to Clay's surprise, Justin mourns Bryce. Clay and Ani suspect Jessica, and investigate her, but discover that she and Justin have been secretly hooking up. Tyler admits to Clay and Tony that he still has a gun, and they plan to get rid of it. Later, Tyler is shown looking through pictures on his computer of Bryce's corpse, looking like it was shot in the head, with the gun next to him. Suspect: Jessica Davis because of the letter Bryce wrote for her; Justin Foley because of the scar on his back. 30 4 \"Angry, Young and Man\" Jessica Yu Thomas Higgins August 23, 2019 ( ) Flashbacks: During the time that the group monitors Tyler, he hangs out at the movie theater during Jessica's shift. Jessica calls Alex to take over, due to being creeped out. Jessica forms a group called \"Hands Off\" to protect survivors of sexual assault, which Tyler joins. Clay gives Ani his bike and lock. Clay, Ani and Tyler see a movie together. Tyler confronts Montgomery and demands an apology, but Montgomery refuses, claiming Bryce had him do it. Tyler threatens Bryce with a gun. Bryce tells him Montgomery acted on his own, and does not defend himself. Present: The group monitors Tyler due to the gun he still has. Clay sees him go outside to use the bathroom, and later finds a brown bag in his backpack. Clay goes to Tyler's house, where his parents show appreciation to him for being Tyler's friend. In his room, Clay finds pictures of Bryce on Tyler's computer. Tyler hands over the gun, and reveals he was the one who found Bryce's body, reporting it anonymously. He also reveals that he kept the gun to eventually kill himself, and that he intended to die at Spring Fling. The brown bag is revealed to contain a camera, the same model from the film Tyler, Clay and Ani saw. Later, when the group meets at Monet's, Justin reveals that Bryce was not shot, but beaten to death, and takes the gun to dispose of it. He is later shown threatening Seth, his mother's ex-boyfriend, with it. The police look for a murder weapon at the river, and find Bryce's car, containing steroids, which puts Alex on edge. It is revealed Clay and Tony threw Tyler's guns in the river. Suspect: Tyler Down because he still has a gun. 31 5 \"Nobody's Clean\" Bronwen Hughes Trevor Marti Smith August 23, 2019 ( ) Flashbacks: Alex starts working out to overcome his physical problems after his breakup with Jessica. One of the football players offers him steroids, which he takes. He later begins buying different steroids from Bryce, who also introduces him to a prostitute to help him get over Jessica. They begin hanging out. Later, Bryce brings Alex to help him destroy his father's house. They go to the wrong house, and Bryce threatens a child who finds them vandalizing the house. Alex ends their relationship following this. At some point during their \"friendship\", Bryce and Montgomery attend a party, where Montgomery hooks up with a boy, Winston, from Bryce's school. Later, when Winston asks Montgomery to hang out, Montgomery assaults him. Bryce pays him not to press charges. Present: The police search the school for steroids, and find some in the possession of one of the football players. Alex throws away a stash, which is retrieved by Justin. Montgomery hides some in his car, which are found by Clay and Ani, along with an ID of another boy named Winston. Clay and Ani confront Montgomery, and later, after finding the real Winston's Facebook page, Winston, who admits the other boy took the SAT's for him and that Bryce and Montgomery were blackmailing him not to talk about the assault. Justin gets rid of Tyler's gun. Mrs. Walker tells her father Bryce is dead. Ani finds Tony's Mustang in Bryce's garage. Suspect: Alex Standall because of the steroids found in Bryce's car. 32 6 \"You Can Tell the Heart of a Man by How He Grieves\" Bronwen Hughes Mfoniso Udofia August 23, 2019 ( ) Flashbacks: Bryce's father divorces his mother and begins seeing another woman. After Bryce trashes his father's house, his father demands he pay for the damages. Bryce refuses and reveals he has an illegitimate daughter, though his mother decides not to use this against him in the divorce. Meanwhile, it is revealed that shortly after Bryce's rape trial, ICE was called on Tony's family, resulting in his parents and brothers being deported to Mexico, and Tony having to send his sister to their aunt and uncle in Arizona. Bryce tried to make amends for his past ways by buying Tony's Mustang for double its worth, giving Tony money for a lawyer to fight the deportation, but it did no good. Present: Tony is interrogated about Bryce, but tells the police nothing. At Bryce's funeral, his father shows up, but doesn't appear to mourn, disgusting his mother. Zach gives a speech. The funeral is interrupted by Jessica's sexual assault survivor group, who protest the mourning of a rapist. Clay asks Tony and Caleb about the car, and they tell him the truth. The police find security footage of Clay pointing a gun at Bryce in front of his father's old house. Suspects: Tony Padilla because of his Mustang being in Bryce's garage; Barry Walker because of the daughter he hides. 33 7 \"There Are a Number of Problems with Clay Jensen\" Kevin Dowling Julia Bicknell August 23, 2019 ( ) Flashbacks: Clay and Ani become closer after bonding over love of comic books. Later, they measure each other to make costumes for a cosplay convention. Ani takes off her clothes for this, allowing Clay to see her underwear. Later, Clay drops Ani off at Bryce's house, and they kiss. Meanwhile, Ani and Bryce are revealed to have had a sexual relationship, in which he treated her with respect. Present: The police interrogate Clay and Justin about the security footage. Sheriff Diaz shows Clay underwear containing Ani's blood and Bryce's semen. Clay denies knowing the underwear is Ani's, and that Bryce and Ani were seeing each other. Clay's parents question Justin about the footage and begin to question whether Clay had something to do with Bryce's death. Alex confronts Jessica over her relationship with Justin, and the school, as a result, finds out about it. Jessica's group refuses to listen to her when she tries to reprimand them for protesting Bryce's funeral. Clay and Ani fight over her relationship with Bryce, and Clay later hallucinates Bryce taunting him. Clay returns home to find Ani in his room, and notices she is afraid of him. Suspects: Clay Jensen because of the security footage of Clay pointing a gun at Bryce; Ani Achola because of her underwear being found in Bryce's room. 34 8 \"In High School, Even on a Good Day, It's Hard to Tell Who's on Your Side\" Kevin Dowling Felischa Marye August 23, 2019 ( ) Flashbacks: Mrs. Walker asks Mr. Porter to become Bryce's counselor, which Mr. Porter agrees to. During the time that he counsels Bryce, he gives Bryce a journal to write down private thoughts, and has him to write a letter from his mother's point of view about him. Bryce does so, revealing his belief that his mother hates him. When Mrs. Walker sees the letter, she reveals this is not true, and that she blames herself for her mistakes when Bryce was younger. Bryce also tells Mr. Porter about his relationship with 'a girl', and that he still has thoughts of rape on his mind. Mr. Porter suggests he get other help. Present: Clay goes to the Walker's house to ask Mrs. Walker to call off the investigation, but she refuses. He finds a note she seemingly wrote about her hatred of Bryce. The police call Mr. Porter to help with the investigation. Mr. Porter calls in Tyler, Zach, Alex, Cyrus, Justin and Jessica, all of whom defend Clay when he asks about various incidents. Clay shows Ani the note, and Ani reveals Mr. Porter was privately counseling Bryce. Mr. Porter meets Clay, and they arrange to meet outside of school, where he reveals he doesn't think Clay killed Bryce, and only spoke to students he thought would defend Clay. He tells Clay the truth about the note when Clay asks him. He also tells Clay that something may have happened to Tyler. Clay asks Tyler, and Tyler reveals his sexual assault by Montgomery. When he confronts Montgomery, the jock tells him Justin may still be using. At home, Clay searches Justin's things and finds a bottle of oxycodone prescribed to Bryce. Suspects: Kevin Porter because he has the same notebook that Bryce has; Nora Walker because of the note saying she hates Bryce. 35 9 \"Always Waiting for the Next Bad News\" Aurora Guerrero M.K. Malone August 23, 2019 ( ) Flashbacks: Clay feels depressed on the anniversary of Hannah's death, despite Ani's attempts to comfort him. Zach gets Justin to join the football team. Shortly after Justin begins working at Monet's, Seth arrives and demands the money Justin stole from him. When Justin is unable to pay, Seth agrees to allow him to work off the debt by selling drugs to his customers. When the customers notice Justin is keeping some of the drugs for personal use, Seth threatens Justin and demands the money. Shortly afterward, the police arrive. Seth escapes while Justin is arrested. Justin calls Bryce to bail him out, and asks him to not tell Clay. Bryce pays off Seth, and gives Justin some oxycodone to feed the addiction, and prevent him from overdosing. Despite this, they do not resume their friendship. During a game, during a drug test, Justin admits to Zach that he is still using and will not pass, but Zach ensures he does. Present: Clay confronts Justin about the oxycodone. Justin claims he stole it from Bryce's room at the funeral. Later, at Monet's, a reporter asks Clay questions about Bryce, and Justin tells him to leave. At school, Justin and Jessica officially become a couple, but Alex, disgusted, asks Justin what he will do when Jessica finds out he is still an addict. Clay tells Ani Justin's alibi, and Ani states he could not have stolen the drugs from Bryce's room, since they were not there when the police checked it. Montgomery threatens Justin, revealing he knows about Justin's addiction. Justin breaks up with Jessica, claiming he cheated on her. At Monet's, Clay and Ani confront Justin about his lie. Justin shows them Seth texted him when Bryce died, and states his belief that if Seth killed Bryce, he may be the reason why. The three investigate Seth's hideout, and find Bryce's watch. When Seth catches them, Clay accuses him of having murdered Bryce and taken the watch, but Seth reveals Justin traded him the watch for drugs. The students escape. At home, Justin admits he stole the watch, not the pills, on the day of the funeral, and traded it to Seth for the pills. He also admits that on the night of Homecoming, he was getting high. Clay and Justin reaffirm their brotherhood. Clay later gets a call from Mrs. Baker, which upsets him. Suspect: Justin Foley because he has Bryce's oxycodone bottle; Seth Massey because he has Bryce's watch. 36 10 \"The World Closing In\" Aurora Guerrero Teleplay by : Allen MacDonald & Thomas Higgins & Hayley Tyler & Brian Yorkey\n\nStory by : Rohit Kumar and Allen MacDonald & Thomas Higgins & Hayley Tyler August 23, 2019 ( ) Flashbacks: Olivia returns to Crestmont on Homecoming weekend to finalize the selling of her house. She meets with Jessica and Tony, telling Tony that her ex-husband is remarried to his mistress, and that Bryce's father was the one who called ICE on his family. Tony confronts Bryce about this. When Bryce finds out his father was the one who called ICE, he tries to return the Mustang for free, and Tony makes him listen to the tapes; when Bryce finally listens to his, he has an emotional breakdown realizing how much he hurt Hannah. He tries to apologize to Olivia for what he did to Hannah, but she rejects him. Later, Olivia goes to Hannah's grave while drunk, and calls Clay, expressing her wishes for Bryce to die. Meanwhile, after Ani reveals she has never been to a school dance, Clay attempts to ask her to Homecoming. When he goes to Bryce's house, he meets Bryce, who tells him that Ani isn't the nice girl he thinks she is. Clay threatens to kill Bryce, and leaves. Later Bryce, while drunk, tells Ani he misses her and needs her, then tries to grab her. Present: Olivia is questioned about Bryce's murder, and reprimands the police for caring more about him than about the girls he raped. Clay tells Jessica that Justin is still an addict. Jessica shows up at Monet's during his shift to get back together with him, promising to help. Clay and Olivia meet, where Olivia tells him she is worried about how a voicemail she left him makes them look guilty. Olivia and Mrs. Walker meet up and talk about the pain of outliving their children. At home, Justin forgives Clay for telling Jessica he is still an addict. The police then arrive at the house with a search warrant. Suspect: Olivia Baker because of the voicemail she left to Clay saying Bryce deserved to die, and that she wishes she could kill him; Tony Padilla because Bryce's father had his family deported. 37 11 \"There Are a Few Things I Haven't Told You\" Kevin Dowling Helen Shang August 23, 2019 ( ) Flashbacks: Bryce makes the Dean's List at Hillcrest, and tells his mother he wants to transfer back to Liberty next semester. Jessica tries to get the Homecoming game cancelled due to it celebrating jock culture, but Principal Bolan refuses, and reveals he is considering allowing Bryce to return to Liberty High next semester. When Bryce asks Tyler about his attempt to shoot up the school, Tyler tells him about Montgomery raping him. On Homecoming night, Bryce tells Jessica to meet him at the pier after the game, as he has something to give her. Afterward, in the locker rooms, Bryce confronts Montgomery over his rape of Tyler in front of Charlie. When Montgomery proudly confesses, Bryce threatens to reveal his threatening of other students during Hannah's trial to the police. During halftime, Jessica and her sexual assault survivor club start a protest, where they take off their clothes and paint themselves with red hand prints. When one of the jocks from Hillcrest touches Jessica inappropriately, the Liberty High team attacks the Hillcrest team. Other students join the brawl. Present: The parents check the students' alibis for the night of Homecoming. Tyler considers telling the police about his assault and Bryce's knowledge of it to protect Clay, but Clay refuses, telling him to come out when he is ready, and that he may want to tell someone else in case he is arrested. Tyler tells Jessica, who apologizes for mistreating him, and afterwards, confronts Montgomery. Principal Bolan tells Jessica to apologize for Homecoming or lose her position as student body president. Clay reveals to Justin that he writes fanfiction, and researched how to kill someone, which makes him look more guilty. His parents try to get him to tell them everything, but he becomes more upset that they don't believe he isn't capable of murder. Clay asks Tony to help him disappear. Justin meets with Seth to make a deal. Suspect: Clay Jensen because of the text messages found on his phone. 38 12 \"And Then the Hurricane Hit\" Kevin Dowling Teleplay by : Allen MacDonald & M.K. Malone & Helen Shang\n\nStory by : Thomas Higgins & Hayley Tyler & Trevor Marti Smith August 23, 2019 ( ) Flashbacks: Clay watches Ani and Bryce kiss. Later, Bryce attacks Zach over Chloe, dislocating his knee and ending his football career. Ani spills red paint on herself and hurries home to remove it. Zach finds Bryce at the pier and attacks him. He throws his phone in the river and leaves Bryce to die while he reconciles with Chloe. Present: Tyler convinces Clay to come to an assembly where Jessica apologizes for the protests. Tyler and Justin publicly reveal that they are sexual assault survivors. In private, Justin tells Jessica his childhood experience. Clay is arrested. Tyler reports his sexual assault to the police. Monty is arrested. Ani tells Jessica that she slept with Bryce. Zach surrenders to the police, believing he killed Bryce. Deputy Standall reveals that Bryce drowned. Zach is released, but charged for assault and battery. Suspect: Ani Achola because of the red paint on her clothes. 39 13 \"Let the Dead Bury the Dead\" John T. Kretchmer Brian Yorkey August 23, 2019 ( ) Flashbacks: Shortly following the Homecoming game, everyone's alibis are revealed: Tony was laundering money through the Mexican cartel for his deported family, Justin was dealing and going under the influence from drugs at the docks, and Monty is revealed to not have been at Charlie's house, but was sleeping with Winston. Bryce, having been abandoned at the pier, is met by both Alex and Jessica, who ignore Bryce's pleas for reformation, but hands Jessica a cassette tape. Alex helps him up, but when Bryce threatens retaliation against Zach, Alex becomes furious and pushes Bryce into the river, where he drowns. Jessica ends her relationship with Alex, after which they go home. Present: Ani tells the details of the circumstances leading to Bryce's murder to Deputy Standall, instead telling him that Monty was responsible for the murder, since Monty had threatened to kill Bryce earlier in the Homecoming game, and that he didn't have a strong alibi. Deputy Standall reveals that Monty was killed in his jail cell, to which Ani encourages Standall to close the case quickly by blaming the murder on a man already dead. Deputy Standall quickly deduces Alex was the killer, but doesn't mention anything, and burns all of Alex's clothes that he was wearing the night of Bryce's death. Clay and Mrs. Walker come to terms with each other, and Ani begins dating Clay. The group, who have agreed to cover up Alex's involvement as the killer, plays Bryce's tape, where he confesses to his rapes, but shows remorse for them and apologizes, although having come to terms that nobody will allow him to change. Tyler showcases his photography project at Monet's, as tribute for everyone who has helped him since his sexual assault. Meanwhile, Winston, angry over Monty's death, confronts Ani about lying to the police. Elsewhere, a fisherman finds the discarded bag of assault rifles that Clay, Tony and Tyler hid in the river during Spring Fling. Suspect: Montgomery de la Cruz because of the fight he had with Bryce in the change rooms.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nUniversal Studios purchased film rights to the novel on February 8, 2011, with Selena Gomez cast to play Hannah Baker.[22] On October 29, 2015, it was announced that Netflix would be making a television adaptation of the book with Gomez instead serving as an executive producer.[23][24] Tom McCarthy was hired to direct the first two episodes.[25] The series is produced by Anonymous Content and Paramount Television with Gomez, McCarthy, Joy Gorman, Michael Sugar, Steve Golin, Mandy Teefey, and Kristel Laiblin serving as executive producers.[25]\n\nOn May 7, 2017, it was announced that Netflix had renewed the series for a second season, which was released on May 18, 2018.[26]\n\nOn June 6, 2018, Netflix renewed the series for a third season, which was released on August 23, 2019.[27] It was dedicated to executive producer Steve Golin (founder and CEO of Anonymous Content), who died of Ewing's sarcoma on April 21, 2019, four months before the third season's release.[citation needed]\n\nOn August 1, 2019, it was announced that the series had been renewed for a fourth and final season.\n\nCasting [ edit ]\n\nIn June 2016, Dylan Minnette, Katherine Langford, Christian Navarro, Alisha Boe, Brandon Flynn, Justin Prentice, Miles Heizer, Ross Butler, Devin Druid and Brian d'Arcy James were cast as the main leads.[19] In September, Amy Hargreaves, Kate Walsh and Derek Luke were cast.[17][18] Langford exited the show after the second season.\n\nIn September 2018, Timothy Granaderos and Brenda Strong were promoted to series regulars for season 3 after recurring in the previous seasons.[20] On September 5, 2019, Gary Sinise was cast as a series regular for the fourth season.[28] On February 11, 2020, JanLuis Castellanos joined the cast as a series regular for the fourth season.[29]\n\nIn August 2017, Jake Weber, Meredith Monroe, R.J Brown, Anne Winters, Bryce Cass, Chelsea Alden, Allison Miller, Brandon Butler, Samantha Logan, Kelli O'Hara, and Ben Lawson were cast for season two.[30][31]\n\nFilming [ edit ]\n\nFilming for the series took place in the Northern Californian towns of Vallejo, Benicia, San Rafael, Crockett and Sebastopol during the summer of 2016.[32][33] The 13-episode first season and the special were released on Netflix on March 31, 2017.[34][35] Therapy dogs were present on set for the actors because of the intense and emotional content of the series.[36]\n\nFilming for the second season began on June 12, 2017,[37] but was briefly halted in October in response to the then-ongoing Northern California wildfires happening around the areas where the series was being filmed.[38] Production on the second season wrapped in December 2017.[39] The second season was released on May 18, 2018.[40]\n\nFilming for the third season began on August 12, 2018, but was halted due to another wildfire until December 17.[41] Filming was scheduled to be completed on February 6, 2019.[42]\n\nRelease and reception [ edit ]\n\nThe first season was released on Netflix on March 31, 2017. It received positive reviews from critics and audiences, who praised its subject matter and acting, particularly the performances of Minnette and Langford. For her performance, Langford received a Golden Globe Award nomination for Best Actress – Television Series Drama.[43] However, its graphic depiction of issues such as suicide and rape (along with other mature content) prompted concerns from mental health professionals. In response, Netflix added a warning card and from March 2018 on, a video that plays at the start of each season warning viewers about its themes.[44] In July 2019, Netflix edited out the suicide scene in the first season's final episode.[45]\n\nNetflix renewed 13 Reasons Why for a second season in May 2017 due to the success of the initial 13 episodes; filming of the second season began the next month and concluded that December. The second season was released on May 18, 2018, and received mixed to negative reviews from audiences. Coinciding with the release of the second season, Netflix released a video with the cast that cautioned viewers on some of the topics covered in the show and provided a support website with crisis numbers for people affected by depression, anxiety and other mental health issues.[46] A third season was ordered in June 2018 and was released on August 23, 2019. In August 2019, the series had been renewed for a fourth and final season.[47] Critical and audience reaction to the series has been divided, with the program generating controversy between audiences and industry reviewers alongside acquiring a loyal following.[48][49][50]\n\nAudience viewership [ edit ]\n\nThe marketing analytics firm Jumpshot determined the first season was the second-most viewed Netflix season in the first 30 days after it premiered, garnering 48% of the viewers that the second season of Daredevil received, which was the most viewed season according to Jumpshot. The series also showed an 18% increase in week-over-week viewership from week one to week two. Jumpshot, which \"analyzes click-stream data from an online panel of more than 100 million consumers\", looked at the viewing behavior and activity of the company's U.S. members, factoring in the relative number of U.S. Netflix viewers who watched at least one episode of the season.[51]\n\nCritical response [ edit ]\n\nSeason 1 [ edit ]\n\nThe first season has received positive reviews, with praise for the acting (particularly that of Minnette, Langford, and Walsh), directing, story, visuals, improvements upon its source material, and mature approach to dark and adult subject matter. The review aggregator website Rotten Tomatoes reported an 78% approval rating with an average rating of 7.14/10, based on 63 reviews. The website's critical consensus reads, \"13 Reasons Why complements its bestselling source material with a gripping look at adolescent grief whose narrative maturity belies its YA milieu.\"[52] Metacritic, which uses a weighted average, assigned a score of 76 out of 100, based on 17 critics, indicating generally favorable reviews.[53]\n\nJesse Schedeen of IGN praised 13 Reasons Why, giving it a 9.2 out of 10, \"Amazing\", stating that the series is \"a very powerful and hard-hitting series\" and \"ranks among the best high school dramas of the 21st century\".[58] Matthew Gilbert of The Boston Globe gave a glowing review for the series, saying, \"The drama is sensitive, consistently engaging, and, most importantly, unblinking.\"[59] Maureen Ryan of Variety asserts that the series \"is undoubtedly sincere, but it's also, in many important ways, creatively successful\" and called it \"simply essential viewing\".[60] Leah Greenblatt of Entertainment Weekly gave the entire season a score of B+, calling the series \"a frank, authentically affecting portrait of what it feels like to be young, lost and too fragile for the world\".[61] Daniel Feinberg of The Hollywood Reporter also praised the series, calling it \"an honorably mature piece of young-adult adaptation\", and citing its performances, direction, relevance and maturity as some of the series' strongest points.[62]\n\nThe acting, particularly Katherine Langford as Hannah and Dylan Minnette as Clay, was frequently praised in reviews. Schedeen of IGN praised the cast, particularly Minnette and Langford, stating: \"Langford shines in the lead role ... [and] embodies that optimism and that profound sadness [of Hannah's] as well. Minnette's Clay is, by design, a much more stoic and reserved character ... and does a fine job in what's often a difficult role.\"[58] Gilbert of The Boston Globe praised the chemistry of Langford and Minnette, saying that \"watching these two young actors together is pure pleasure\", while Schedeen of IGN also agreed, saying that they are \"often at their best together, channeling just the right sort of warm but awkward chemistry you'd expect from two teens who can't quite admit to their feelings for one another\". Feinberg of The Hollywood Reporter also praises both actors: \"Langford's heartbreaking openness makes you root for a fate you know isn't possible. The actress' performance is full of dynamic range, setting it against Minnette's often more complicated task in differentiating between moods that mostly go from uncomfortable to gloomy to red-eyed, hygiene-starved despair.\"[62]\n\nRyan of Variety also gave praise to not only the two leads, but also the supporting cast of actors, particularly Kate Walsh's performance as Hannah's mother, which Ryan describes as \"career-best work\".[60] Positive mentions from various critics, such as Ryan, Feinberg and Schedeen, were also given to the supporting cast of actors (most particularly Alisha Boe, Miles Heizer and Christian Navarro's respective performances of Jessica, Alex and Tony). Liz Shannon Miller of Indiewire, who enjoyed the series and gave it a positive score of B+, gave praise to the racial, gender and complex diversity of its supporting cast of teens.[60][58][62][63]\n\nAnother aspect frequently mentioned within reviews was the series's mature and emotional approach to its dark and adult subject matter. This was favorably reviewed by critics, such as Miller of Indiewire, particularly her statement that \"the adult edges to this story ring with honesty and truth.\"[63] Miller, and Feinberg of The Hollywood Reporter, also stated that the series can be difficult to watch at times,[62] while Schedeen of IGN states that it is \"an often depressing and even uncomfortable show to watch ... a pretty emotionally draining experience, particularly towards the end as the pieces really start to fall into place.\"[58]\n\nCritics also praised several other aspects of the series. Feinberg highlighted the series' directors, saying: \"A Sundance-friendly gallery of directors including Tom McCarthy, Gregg Araki and Carl Franklin keeps the performances grounded and the extremes from feeling exploitative\",[63] while Gilbert of The Boston Globe praised the storytelling: \"The storytelling techniques are powerful ... [as it] builds on the world established in the previous hour, as we continually encounter new facets of Hannah's life and new characters. The background on the show keeps getting deeper, richer.\"[59]\n\nConversely, the series has also received criticism over its portrayal of teen angst. Mike Hale of The New York Times wrote a critical review, writing, \"the show doesn't make [Hannah's] downward progress convincing. It too often feels artificial, like a very long public service announcement.\" He also criticized the plot device that has Clay listening to the tapes one by one instead of all in one sitting like the other teens did, which Hale felt was unbelievable: \"It makes no sense as anything but a plot device, and you'll find yourself, like Clay's antagonists, yelling at him to listen to the rest of tapes already.\"[64]\n\nWriting for The Guardian, Rebecca Nicholson praised some aspects of the series, including the performances from Minnette and Walsh, but was troubled by much of the plot, writing, \"a storyline that suggests the love of a sweet boy might have sorted all this out added to an uneasy feeling that stayed with me\". Nicholson was skeptical that the series would appeal to older viewers, unlike other series set in high school such as Freaks and Geeks and My So-Called Life: \"It lacks the crossover wit of its forebears ... It's too tied up in conveying the message that terrible behaviour can have horrible consequences to deal in any subtleties or shades of feeling. It's largely one-note – and that note is horrifying. 'It has to get better,' implores one student towards the end, but given its fairly open ending, an apparent season two setup, it does not seem as if there's much chance of that happening.\"[65]\n\nWashington Post television critic Hank Stuever wrote a negative review, finding 13 Reasons Why \"contrived\" and implausible: \"There are 13 episodes lasting 13 super-sullen hours – a passive-aggressive, implausibly meandering, poorly written and awkwardly acted effort that is mainly about miscommunication, delivering no more wisdom or insight about depression, bullying and suicide than one of those old ABC Afterschool Specials people now mock for being so corny.\" He also wrote that he found Hannah's suicide tapes \"a protracted example of the teenager who fantasizes how everyone will react when she's gone. The story ... strikes me as remarkably, even dangerously, naive in its understanding of suicide, up to and including a gruesome, penultimate scene of Hannah opening her wrists in a bathtub.\"[66]\n\nDavid Wiegand of the San Francisco Chronicle gave the series a tepid review, saying that it was plagued by character inconsistencies, particularly Hannah. He praised Langford's \"stunning performance\" but noted, \"There are times when we simply don't believe the characters, when what they do or say isn't consistent with who we've been led to believe they are ... At times, [Hannah] is self-possessed and indifferent at best to the behavior of the popular kids. At other times, though, relatively minor misperceived slights seem to send her into an emotional tailspin. No doubt, teenagers embody a constant whirl of conflicting emotions, but the script pushes the bounds of credibility here and there.\" He noted that overall, the series worked: \"The structure is gimmicky and the characters inconsistent, but there are still at least 13 Reasons Why the series is worthy.\"[67]\n\nSeason 2 [ edit ]\n\nThe second season received largely negative to mixed reviews from critics, with many praising the performances (particularly that of Boe, Luke, and Walsh) but criticism aimed at the poor execution of its topics; many declared it unnecessary.[68][69] Rotten Tomatoes reports an approval rating of 25% with an average rating of 5.31/10, based on 51 reviews. The site's critical consensus states, \"By deviating from its source material, 13 Reasons Why can better explore its tenderly crafted characters; unfortunately, in the process, it loses track of what made the show so gripping in the first place.\"[54] On Metacritic the season has an average score of 49 out of 100, based on 16 critics, indicating \"mixed or average reviews\".[55]\n\nCatherine Pearson from DigitalSpy wrote a negative review, calling the season \"even more problematic\" than the first. She ends the review saying that, \"Unrelenting depression seems to shroud the season, briefly lifted only to collapse back down as the show's thirteenth episode, once again, delivers a deeply disturbing scene of suffering.\"[70] Jordan Davidson from The Mighty wrote that he \"felt sick\" after watching the final episode of the season.[71]\n\nA scene in which the character Tyler is attacked and sexually assaulted during the finale also caused controversy from fans and critics of the series, with some describing it as \"unnecessary\" and \"traumatizing\".[72] The series' showrunner has defended the scene, saying that it was included in an attempt to \"[tell] truthful stories about things that young people go through in as unflinching a way as we can\".[73]\n\nSeason 3 [ edit ]\n\nSeason 3 received overwhelmingly negative reviews by both critics and audiences, with criticism aimed at the lack of necessity, poor execution of its topics, including the rape of Tyler in the final episode of the previous season,[74][75] the new character of Ani,[76] the sympathetic redemption of Bryce[77] and conclusion. However, some praised the technical aspects and the performances (particularly those of Prentice, Druid, and Granaderos).[78]\n\nReview aggregator Rotten Tomatoes reports an approval rating of 12%, with an average rating of 1.43/10, based on 17 reviews. The site's critical consensus reads: \"13 Reasons Why attempts to break away from its first two seasons only to become a melodramatic mess of a murder mystery.\"[56]\n\nOn Metacritic the season has an average score of 23 out of 100, based on 4 critics, indicating \"generally unfavourable reviews\".[57]\n\nControversy [ edit ]\n\n[79] Rowan University 's Counseling and Psychological Services office mocked the series with a campaign challenging students to come up with 1300 reasons not to kill themselves. The expressions of hope were hung in windows alongside mental health contact information.\n\nSome medical professionals, school officials, and others who work with youth said that the series violated guidelines for depicting suicide in the media, and was resulting in an increase in suicidal and self-harming behavior. Netflix responded by adding strong advisory warnings prior to the first, twelfth, and thirteenth episodes.\n\nThe superintendent of Palm Beach County, Florida schools reportedly told parents that their schools had seen an increase in suicidal and self-harming behavior from students, and that some of those students \"have articulated associations of their at-risk behavior to the 13 Reasons Why Netflix series\".[80]\n\nThe Australian youth mental health service for 12–25 year-olds, Headspace, issued a warning in late April 2017 over the graphic content featured in the series, due to the increased number of calls to the service following the series' release in the country. Netflix however, demonstrably complied with the Australian viewer ratings system, by branding the series as \"MA15+\" when streamed via its own interface. They accompanied its presentation with additional warnings and viewer advice, and ensured that counselling referrals were included and not easily skipped at the conclusion of each episode. Each warning voice over is read by a different cast member at the end of the episode, with Katherine Langford reading in her native Australian accent in her voice-overs. [81][82][83]\n\nIn response to the graphic nature of the series and New Zealand's high youth suicide rate, which was the highest among the 34[a] OECD countries during 2009 to 2012,[85][86] the Office of Film & Literature Classification in the country created a new rating, \"RP18\", allowing individuals aged 18 and over to watch the series alone and those below having to watch it with supervision from a parent or guardian.[87][88]\n\n... We wanted to do it justice and, yeah, [the backlash is] gonna come no matter what. It's not an easy subject to talk about, but I'm very fortunate with how it's doing. We stayed very true to the book and that's initially what [author] Jay Asher created was a beautifully tragic, complicated yet suspenseful story and I think that's what we wanted to do... We wanted to do it justice and, yeah, [the backlash is] gonna come no matter what. It's not an easy subject to talk about, but I'm very fortunate with how it's doing. —Executive producer Selena Gomez, in defense of the controversy surrounding the series[89]\n\nIn April 2017, the National Association of School Psychologists (NASP) in the United States released a statement regarding the series, saying: \"Research shows that exposure to another person's suicide, or to graphic or sensationalized accounts of death, can be one of the many risk factors that youth struggling with mental health conditions cite as a reason they contemplate or attempt suicide.\"[90] NASP sent a letter to school mental health professionals across the country about the series, reportedly a first for NASP in response to a television series.[91] The following month, the United States Society of Clinical Child and Adolescent Psychology (SCCAP) released a statement also noting how strongly the series may serve as a trigger for self-injury among vulnerable youth. They lamented the depiction of mental health professionals as ineffective for youth who have experienced trauma and may have been considering suicide.[92] The statement implored Netflix to add a tag following each episode with mental health resources, and a reminder that depression and suicidal thoughts can be effectively treated by a qualified mental health professional, such as a clinical child psychologist, using evidence-based practice.\n\nSimilarly, clinical psychologists such as Daniel J. Reidenberg and Erika Martinez, as well as mental health advocate MollyKate Cline of Teen Vogue magazine, have expressed concerns regarding the risk of suicide contagion.[93][94][95] However, Eric Beeson, a counselor at The Family Institute at Northwestern University noted that \"it's unlikely that one show alone could trigger someone to attempt suicide.\"[90] Mental health professionals have also criticized the series' depiction of suicide itself, much of which violates widely promulgated recommendations for reporting on actual suicides or not depicting them in fiction, in order to not encourage copycat suicides.[96] The season finale, which depicts Hannah's suicide in graphic detail, has been particularly criticized in this regard.[97] Nic Sheff, a writer for the series, has defended it as intended to dispel the myth that suicides \"quietly drift off\", and recalled how he himself was deterred from a suicide attempt by recalling a survivor's account of how painful and horrifying it was.[98]\n\nThe NASP statement also criticized the series' suggestion that bullying alone led Hannah to take her life, noting that while it may be a contributing factor, suicide far more often results from the bullied person having a \"treatable mental illness and overwhelming or intolerable stressors\", along with a lack of adequate coping mechanisms. Alex Moen, a school counselor in Minneapolis, took issue with the series' entire plotline as \"essentially a fantasy of what someone who is considering suicide might have—that once you commit suicide, you can still communicate with your loved ones, and people will suddenly realize everything that you were going through and the depth of your pain ... That the cute, sensitive boy will fall in love with you and seek justice for you, and you'll be able to orchestrate it, and in so doing kind of still be able to live.\"[97] Other counselors criticized the depiction of Hannah's attempt to reach out to Mr. Porter as dangerously misleading, since not only does he miss obvious signs of her suicidal ideations, but says he cannot report her sexual assault to the police without her identifying the assailant. School counselors are often portrayed as ineffective or clueless in popular culture, Moen says, but Porter's behavior in the series goes beyond that, to being unethical and possibly illegal. \"It's ridiculous! Counselors are not police. We don't have to launch an investigation. We bring whatever information we do have to the police\", she told Slate.[97]\n\nIn May 2017, the Canadian Mental Health Association (CMHA) along with the Centre for Suicide Prevention (CSP) released a statement with similar concerns to the ones raised by NASP. CMHA believed that the series may glamorize suicide, and that some content may lead to distress in viewers, particularly in younger viewers. Furthermore, the portrayal of Hannah's suicide does not follow the media guidelines as set out by the Canadian Association for Suicide Prevention (CASP) and the American Association of Suicidology. CMHA and CASP did praise the series for raising awareness about \"this preventable health concern,\" adding that, \"Raising awareness needs to be done in a safe and responsible manner. A large and growing body of Canadian and international research has found clear links between increases in suicide rates and harmful media portrayals of suicide.\" Ways in which the portrayals of suicide may cause harm, according to CMHA and CASP, include the following: \"They may simplify suicide, such as, by suggesting that bullying alone is the cause; they may make suicide seem romantic, such as, by putting it in the context of a Hollywood plot line; they may portray suicide as a logical or viable option; they may display graphic representations of suicide which may be harmful to viewers, especially young ones; and/or they may advance the false notion that suicides are a way to teach others a lesson.\"[99][100] A 2019 study showed the overall suicide rate among 10- to 17-year-olds increased significantly in the month immediately following the release of the series.[101]\n\nThe release of 13 Reasons Why corresponded with between 900,000 and 1.5 million more suicide-related searches in the United States, including a 26% increase in searches for \"how to commit suicide,\" an 18% increase for \"commit suicide,\" and a 9% increase for \"how to kill yourself.\"[102] After an initial spike in calls to Crisis Text Line after the first episode, there was an overall reduction in crisis call volume for the remainder of the series.[103] Although the link between searching for suicide information and suicide risk is unclear,[104] increases in self-harm admissions to one children's hospital were observed.[105][106][107][108][109]\n\n\n\n\n\nAccolades [ edit ]\n\nBeyond the Reasons [ edit ]\n\nWith the release of the first season of the series, Netflix also released 13 Reasons Why: Beyond the Reasons , an aftershow documentary television film.[121] The 29-minute documentary featured cast and crew of the series, and mental health professionals discussing their experiences working on the four series and dealing with different issues, including bullying, depression and sexual assault. Two more Beyond the Reasons specials were released with the second and third seasons respectively.[122][123][124]\n\nSoundtrack [ edit ]\n\nA compilation soundtrack has been released for every season, as well as score albums featuring the show's original score by Eskmo.[125][126][127][128]\n\nSeason 1 [ edit ]\n\n13 Reasons Why (A Netflix Original Series Soundtrack) Soundtrack album by Various artists Released March 30, 2017 ( ) Length 52 : 21 Label Interscope Records Singles from 13 Reasons Why (A Netflix Original Series Soundtrack)\n\nReleased: March 30, 2017\n\nReleased: April 21, 2017\n\nTrack listing [ edit ]\n\nSeason 2 [ edit ]\n\n13 Reasons Why: Season 2 (A Netflix Original Series Soundtrack) Soundtrack album by Various artists Released May 18, 2018 ( ) Length 1 : 12 : 17 Label Interscope Records Singles from 13 Reasons Why: Season 2 (A Netflix Original Series Soundtrack)\n\nReleased: April 19, 2018\n\nReleased: May 10, 2018\n\nReleased: May 15, 2018\n\nReleased: December 14, 2018\n\nTrack listing [ edit ]\n\nSeason 3 [ edit ]\n\n13 Reasons Why: Season 3 (A Netflix Original Series Soundtrack) Soundtrack album by Various artists Released August 23, 2019 ( ) Length 1 : 03 : 50 Label Interscope Records Singles from 13 Reasons Why: Season 3 (A Netflix Original Series Soundtrack)\n\nReleased: August 1, 2019\n\nReleased: August 12, 2019\n\nReleased: August 21, 2019\n\nReleased: October 30, 2019\n\nTrack listing [ edit ]\n\nReferences [ edit ]\n\nNotes [ edit ]\n\n^ [84] The 2009–2012 data exclude Latvia, which became the 35th OECD member country on July 1, 2016.", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Dylan_Minnette_in_2018.jpg/136px-Dylan_Minnette_in_2018.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/7/73/Netflix%27s_13_Reasons_Why_title_screen.png/250px-Netflix%27s_13_Reasons_Why_title_screen.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/1300_Reasons_WHY_NOT.jpg/220px-1300_Reasons_WHY_NOT.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Wikiversity-logo.svg/40px-Wikiversity-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/7/73/Netflix%27s_13_Reasons_Why_title_screen.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Katherine_Langford_in_2018.jpg/120px-Katherine_Langford_in_2018.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/73/Netflix%27s_13_Reasons_Why_title_screen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/13_Reasons_Why", "title": "13 Reasons Why", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/73/Netflix%27s_13_Reasons_Why_title_screen.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}