{"url": "http://www.ohioart.com/etch/", "text": "In February of 2016, we announced the sale of our Etch A Sketch and Doodle Sketch brands in a move designed to allow us to focus on its metal lithography business and invest in its manufacturing operations in Bryan.\n\nBegin official Release:\n\nThe Ohio Art Company, a business and community leader for more than 100 years, announced today that it has sold its Etch A Sketch and Doodle Sketch brands in a move designed to allow it to focus on its metal lithography business and invest in its manufacturing operations in Bryan. Ohio Art’s first lithography press was installed in its Bryan, Ohio facility in 1912 and the company has since specialized in precision printing and beautiful color reproduction that is protected to withstand the rigors of stamping and fabrication. The company has been a leader in the metal lithography business for more than a century and company CEO Elena West confirms that, “Ohio Art is squarely focused on continuing to build its reputation as one of the premier metal lithographers in North America.”\n\nThe company also underscored its continued commitment to the Bryan, Ohio community and has been working with local business leaders to more effectively utilize its Bryan facility. G&M Media Packaging and Reece Brothers Digital Printers have both signed on as tenants and Wilton Keck Recycling has purchased warehouse space for their upstart commercial recycling business. The company is also leasing warehouse space to two local manufacturers in need of additional staging.\n\n“We are very pleased to be able to partner with these local businesses to provide them with quality space and support services and, most importantly, keep these companies and jobs right here in Bryan,” notes Martin Killgallon, President. “Our commitment to the community is important to our strategy and we look forward to continuing to partner with other local businesses.”\n\nThe Etch A Sketch and Doodle Sketch brands have been sold to Spin Master Corp., a leading global children’s entertainment company that creates, designs, manufactures and markets a diversified portfolio of innovative toys, games, products and entertainment properties. “We are very happy that children around the world will continue to be able to enjoy Etch A Sketch, one of the world’s most iconic toys, as Spin Master is committed to building upon the success that The Ohio Art Company has created and sustained for more than 50 years,” West concludes.", "images": ["https://ohioart.com/wp-content/uploads/2016/03/cropped-OA-Metal-Litho-Logo-32x32.png", "http://ohioart.com/wp-content/uploads/2016/04/web-metal.png", "https://ohioart.com/wp-content/uploads/2016/05/etchasketch-e1462795278748.jpeg", "https://ohioart.com/wp-content/uploads/2018/11/Vintage-Ohio-Art-Logo-e1542006636648.png", "http://ohioart.com/wp-content/uploads/2016/04/BillWaters-e1461722494797.jpg"], "top_img": "https://ohioart.com/wp-content/uploads/2016/03/cropped-OA-Metal-Litho-Logo-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://ohioart.com/etch-a-sketch-sold-to-spinmaster/", "title": "Sale of the Etch A Sketch Brand", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "In February of 2016, we announced the sale of our Etch A Sketch and Doodle Sketch brands in a move designed to allow us to focus on its metal lithography", "generator": "WordPress 5.2.5", "msapplication-TileImage": "https://ohioart.com/wp-content/uploads/2016/03/cropped-OA-Metal-Litho-Logo-270x270.png"}, "movies": [], "publish_date": null, "source": "http://www.ohioart.com", "summary": ""}