{"url": "https://www.livestrong.com/article/255500-how-to-cure-an-acne-breakout-overnight/", "text": "When your face breaks out in acne the night before an important event, tailor your basic skin-care routine for quick healing. Acne-prone skin requires products that deeply cleanse to eliminate bacteria while soothing inflammation. Treat your skin before bed to reduce the visibility and discomfort of a breakout overnight.\n\nStart with Salicylic\n\nCleanse your skin with a salicylic acid-based cleanser. Salicylic acid does double duty by exfoliating the skin and soothing inflammation. It breaks apart pore-clogging bacteria without causing the breakout to spread. To intensify your cleanse routine, pour a quarter-sized amount of cleanser onto a natural-bristle face brush. Massage it into damp skin using a circular motion for two minutes while avoiding the eye area. Rinse your face with cool water to close your pores, and pat it dry with a paper towel to prevent the transfer of bacteria.\n\nClear Out with Charcoal\n\nUse a charcoal face mask to draw out deeply embedded impurities 7. Charcoal acts like a magnet for oil and buildup, working in less than five minutes to dry out breakouts and prevent those about to surface. Smooth the mask over your face, avoiding your eyes, nostrils and mouth. Allow it to sink in until it feels slightly tacky, but not completely dry. Rinse the mask off with warm water, and use a clean cloth to remove any stubborn patches.\n\nBanish with Benzoyl\n\nTarget spots with a Benzoyl peroxide spot treatment. Benzoyl peroxide quickly eliminates bacteria in blackheads, whiteheads and red blemishes. It exfoliates deep within the pores to prevent buildup. Wash your hands with soap and water, and pat a thin layer of Benzoyl peroxide gel onto blemishes with your fingertip. Avoid rubbing the spot, as the gel will sink in on its own. Only apply Benzoyl peroxide during breakouts -- not on clear skin -- as it has a drying effect.\n\nA Soothing Sleep\n\nSet yourself up for a good skin day by preparing your sleeping environment as well as your skin. Tie your hair up and wrap it in a scarf to prevent oils and product buildup from irritating your skin. Change your bedding to a clean set to avoid transferring bacteria onto your clean skin while you sleep. Wash your bedding without fabric softener, which leaves behind a pore-clogging residue. Use a pillowcase made of natural fabric, as it breathes better and doesn't trap oil as easily as man-made fabrics.", "images": ["https://healthfully.com"], "top_img": "https://healthfully.com", "keywords": [], "authors": ["Celeigh O'Neil"], "canonical_link": "https://healthfully.com/is-it-possible-to-treat-an-acne-breakout-overnight-5399057.html", "title": "Is It Possible to Treat an Acne Breakout Overnight?", "meta_data": {"viewport": "width=device-width", "og": {"site_name": "Healthfully", "url": "https://healthfully.com/is-it-possible-to-treat-an-acne-breakout-overnight-5399057.html", "description": "Find your way to better health.", "type": "website", "title": "Healthfully", "image": "//healthfully.com"}, "description": "Find your way to better health.", "pagetype": "Home", "msvalidate.01": "129B5DE6FF8DD0ECBDD457C93FF101E3", "theme-color": "#1AA8E8", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "default", "apple-mobile-web-app-title": "Healthfully", "msapplication-TileImage": "//healthfully.com/dist/images/icons/mstile-150x150.png", "msapplication-TileColor": "#1AA8E8"}, "movies": [], "publish_date": null, "source": "https://www.livestrong.com", "summary": ""}