{"url": "https://www.businesswire.com/news/home/20180605006656/en/kate-spade-new-york-Statement-Passing-Founder", "text": "NEW YORK--(BUSINESS WIRE)--Tapestry, Inc. (NYSE: TPR), a leading New York-based house of modern luxury accessories and lifestyle brands, addresses the passing of kate spade new york founder, Kate Spade.\n\nWe at kate spade new york just learned of the incredibly sad news that Kate Spade has passed. Although Kate has not been affiliated with the brand for more than a decade, she and her husband and creative partner, Andy, were the founders of our beloved brand. Kate will be dearly missed. Our thoughts are with Andy and the entire Spade family at this time.\n\nkate spade new york was founded in 1993 debuting with just six handbag silhouettes, combining sleek, utilitarian shapes and colorful palettes in an entirely new way. In 2007, spade turned the reins to design powerhouse kate spade & company (formerly known as liz claiborne, inc.). kate spade new york has grown into a global lifestyle brand, aiming to inspire colorful living through the collection’s handbags and clothing, jewelry, shoes, stationery, eyewear, baby, fragrance, tabletop, bedding and gifts. Crisp color, graphic prints and playful sophistication are the hallmarks of kate spade new york. The brand’s exuberant approach to the everyday encourages personal style with a dash of incandescent charm. kate spade new york is a company of Tapestry, Inc.\n\nTapestry, Inc. is a New York-based house of modern luxury lifestyle brands. The Company’s portfolio includes Coach, Kate Spade and Stuart Weitzman. Our Company and our brands are founded upon a creative and consumer-led view of luxury that stands for inclusivity and approachability. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. To learn more about Tapestry, please visit www.tapestry.com. The Company’s common stock is traded on the New York Stock Exchange under the symbol TPR.\n\nThis information to be made available in this press release may contain forward-looking statements based on management's current expectations. Forward-looking statements include, but are not limited to, statements that can be identified by the use of forward-looking terminology such as \"may,\" \"will,\" “can,” \"should,\" \"expect,\" \"intend,\" \"estimate,\" \"continue,\" \"project,\" \"guidance,\" \"forecast,\" \"anticipated,\" “moving,” “leveraging,” “targeting,” “assume,” “plan,” “pursue,” “look forward to,” “on track to return,” “to achieve” or comparable terms. Future results may differ materially from management's current expectations, based upon a number of important factors, including risks and uncertainties such as expected economic trends, the ability to anticipate consumer preferences, the ability to control costs and successfully execute our transformation and operational efficiency initiatives and growth strategies and our ability to achieve intended benefits, cost savings and synergies from acquisitions, etc. Please refer to the Company’s latest Annual Report on Form 10-K, Quarterly Report on Form 10-Q, and its other filings with the Securities and Exchange Commission for a complete list of risks and important factors.", "images": ["http://www.businesswire.com/images/bwlogo_square.png", "https://www.businesswire.com/images/icons/icon_search.gif", "https://www.businesswire.com/images/bwlogo_extreme.png"], "top_img": "http://www.businesswire.com/images/bwlogo_square.png", "keywords": [], "authors": [], "canonical_link": "https://www.businesswire.com/news/home/20180605006656/en/kate-spade-new-york-Statement-Passing-Founder", "title": "kate spade new york Statement on Passing of Founder", "meta_data": {"description": "KATE SPADE NEW YORK STATEMENT ON PASSING OF FOUNDER", "DC.date.issued": "2018-06-05", "robots": "noodp,noydir", "twitter": {"card": "summary", "site": "@businesswire", "title": "kate spade new york Statement on Passing of Founder", "description": "KATE SPADE NEW YORK STATEMENT ON PASSING OF FOUNDER", "widgets": {"csp": "on"}, "image": "http://www.businesswire.com/images/bwlogo_square.png"}, "og": {"title": "kate spade new york Statement on Passing of Founder", "description": "KATE SPADE NEW YORK STATEMENT ON PASSING OF FOUNDER", "image": {"identifier": "http://www.businesswire.com/images/bwlogo_square.png", "secure_url": "https://www.businesswire.com/images/bwlogo_square.png", "type": "image/png", "width": 560, "height": 560}, "type": "article"}, "fb": {"pages": 1157450754275955}, "p": {"domain_verify": "95725e0359a14c2e1ccbd936e10d20d6"}, "viewport": "width=device-width,initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.businesswire.com", "summary": ""}