{"url": "https://medium.com/@PRyan/expanding-opportunity-kempforum16-11fe61f733d2#.y593ohi7t", "text": "Let’s get the conversation going on how we can fight poverty and expand opportunity in America. Join Senator Tim Scott and I as we moderate a forum on fighting poverty with Republican presidential candidates in Columbia, S.C., hosted by the Jack Kemp Foundation. Follow along here and on Twitter with #KempForum16.\n\nI just wanted to say a few words about why we’re here today. And one reason why I’m here is that my mentor was Jack Kemp. There was no issue he was more passionate about than poverty.\n\nSo I couldn’t think of a better host than the foundation that bears his name. Jack was the greatest champion of the American Idea, and he knew the fight against poverty is vital to renewing that idea in the 21st century.\n\nWe’ve been fighting the War on Poverty for 50 years now. And I don’t think you can call it anything but a stalemate. The federal government has spent trillions of dollars. And yet today, if you were raised poor, you’re just as likely to stay poor as you were 50 years ago.\n\nI’m not saying we haven’t made progress. We have. But today we have a safety net that catches people falling into poverty. What we need is a safety net that lifts people out of poverty — that helps them earn a good paycheck so they can support themselves. So, what is the problem?\n\nIt is our strategy. Most of us think poverty is about deprivation — or not having enough money.\n\nWe treat empty wallets like potholes. Fill them up and move on. So for the past 50 years, we’ve created over 80 different programs to fill over 80 different holes in people’s budgets: health care,child care, energy, education — with almost no coordination among them.\n\nHere’s the catch: You qualify for these programs based how much you make. So if you don’t make much, you get a lot of benefits. But as you work and make more, you start to lose benefits.\n\nAnd because we’ve piled these programs right on top of each other, the falloff is steep. Make a little more, and you’ll lose a ton. So we think we’ve been filling holes. But we’ve actually been building a trap. And that’s because poverty is about more than deprivation; it’s about isolation.\n\nThere are many different kinds of poverty. But what a lot of them share in common is, people are cut off from the community. They don’t have the support they need to grow, whether it’s a counselor, or a teacher, or a boss.\n\nWhat they need is someone they can trust, someone who can help them learn new skills. And by discouraging work, the federal government is isolating the poor.\n\nThat’s why we are here today. We as a country are not winning this war, and we conservatives have something to offer. I believe if we apply our principles to this challenge, we can come up with real solutions. Don’t just treat the symptoms of poverty. Get at the root causes of poverty.\n\nDon’t measure success based on inputs. Measure the results.\n\nAnd this, to me, is the biggest conservative insight: The answer is not the money in Washington.\n\nIt is the people in our communities — the people with credibility. They’re the ones who can break through. And I’m not saying just cut money for the safety net. I’d say spend the same amount of money we do now — because this isn’t about saving money; it’s about saving lives.\n\nWhat I’m saying is, don’t minimize; customize. Take the money we’re spending now and direct it to homegrown solutions. Design aid to fit each person’s needs. And whatever you do,encourage work — because that’s how people reconnect with their community. Once they find their niche and put down roots, they draw strength from the people around them, and they grow.\n\nThey’ll not only have enough money; they’ll be able to make enough money to get off assistance.\n\nThe way I see it, the federal government is the rearguard; it should direct the supply lines. But the people in our communities — they’re the vanguard; they should fight poverty on the front lines.\n\nNow, I know a lot of people are wondering, “Why do you care about this? You’re Republicans.”\n\nI remind them, ‘Well, we’re Americans too.’ We all believe in the American Idea: The condition of your birth doesn’t determine the outcome of your life.\n\nIf you work hard and play by the rules, you can get ahead. If you made a mistake, you can redeem yourself.\n\nBut a lot of people don’t think that’s true anymore. And we have to be honest with ourselves: If the American Idea is not true for everybody, then it is not true at all. So we all should care about poverty because it is a direct challenge to who we are.\n\nAnd it’s not enough to pay your taxes and think, “Government is going to take care of this.” We all have to get involved.\n\nAnd I know it’s easy to get discouraged. But what I’ve learned is, there are thousands of people beating poverty every day. The solutions are out there; they’re already working. We just have to support them. We just have to find them. And more often than not they’re right under our noses . . . in our communities . . . all over America.\n\nSo I look forward to hearing from all our candidates and learning more about how we can build a more prosperous, a more secure, and a more confident America.", "images": ["https://miro.medium.com/max/4000/1*M9jaH_rsq0U6WuBsdzlO9g.jpeg", "https://miro.medium.com/fit/c/96/96/0*3s5gC-BvDyqnmqhS.jpeg", "https://miro.medium.com/max/4000/1*6n2LsiXpn3z9dXQjLF3vPg.jpeg", "https://miro.medium.com/max/60/1*M9jaH_rsq0U6WuBsdzlO9g.jpeg?q=20", "https://miro.medium.com/fit/c/160/160/0*3s5gC-BvDyqnmqhS.jpeg", "https://miro.medium.com/max/1200/1*M9jaH_rsq0U6WuBsdzlO9g.jpeg", "https://miro.medium.com/max/60/1*6n2LsiXpn3z9dXQjLF3vPg.jpeg?q=20", "https://miro.medium.com/max/60/1*pJe9YRr-8Xe7pGIjhSu17A.jpeg?q=20", "https://miro.medium.com/max/5000/1*pJe9YRr-8Xe7pGIjhSu17A.jpeg"], "top_img": "https://miro.medium.com/max/1200/1*M9jaH_rsq0U6WuBsdzlO9g.jpeg", "keywords": [], "authors": ["Paul Ryan"], "canonical_link": "https://medium.com/@PRyan/expanding-opportunity-kempforum16-11fe61f733d2", "title": "Expanding Opportunity — #KempForum16", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/11fe61f733d2"}}, "title": "Expanding Opportunity — #KempForum16", "site": "@Medium", "description": "Let’s get the conversation going on how we can fight poverty and expand opportunity in America. Join Senator Tim Scott and I as we moderate…", "image": {"src": "https://miro.medium.com/max/1200/1*M9jaH_rsq0U6WuBsdzlO9g.jpeg"}, "card": "summary_large_image", "creator": "@PRyan", "label1": "Reading time", "data1": "5 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/11fe61f733d2"}, "android": {"package": "com.medium.reader", "url": "medium://p/11fe61f733d2", "app_name": "Medium"}, "web": {"url": "https://medium.com/@PRyan/expanding-opportunity-kempforum16-11fe61f733d2"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "Expanding Opportunity — #KempForum16", "description": "Let’s get the conversation going on how we can fight poverty and expand opportunity in America. Join Senator Tim Scott and I as we moderate…", "url": "https://medium.com/@PRyan/expanding-opportunity-kempforum16-11fe61f733d2", "image": "https://miro.medium.com/max/1200/1*M9jaH_rsq0U6WuBsdzlO9g.jpeg"}, "article": {"published_time": "2016-01-09T17:18:52.070Z", "author": "https://medium.com/@PRyan"}, "title": "Expanding Opportunity — #KempForum16 - Paul Ryan - Medium", "description": "Let’s get the conversation going on how we can fight poverty and expand opportunity in America. Join Senator Tim Scott and I as we moderate a forum on fighting poverty with Republican presidential…", "author": "Paul Ryan", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "11fe61f733d2"}, "movies": [], "publish_date": 1452359932.07, "source": "https://medium.com", "summary": ""}