{"url": "www.usmagazine.com/entertainment/news/i-am-cait-top-5-moments-caitlyn-jenners-ties-with-ronda-kanye-kim-2015227/", "text": "She Is Cait. The first episode for Caitlyn Jenner‘s brand-new E! docuseries, I Am Cait, shows the former Olympian continually moving along in her transition from male to female, with the support of close friends and her famous family members.\n\nUs Weekly rounds up the top five moments from the premiere, screened to press in NYC and L.A., on Tuesday, July 21, including revelations like Caitlyn’s friendship with Kris‘ former best friend Ronda Kamihira, her mom’s reaction to her debut as a woman, as well as Kanye West‘s thoughts on her societal impact.\n\nPHOTOS: Caitlyn Jenner's journey through the years\n\n1. Who Is Ronda Kamihira?\n\nAfter Caitlyn (previously known as Bruce) finalized her divorce last fall, the former decathlete stepped out with her ex’s longtime best friend and former assistant Ronda Kamihira — and it was rumored that they were dating. A source told Us at the time that while Kamihira and Caitlyn attended an Elton John concert together, joined by Brandon and Leah Jenner last October, it was unclear whether they were actually a couple.\n\nIn the debut episode, Kamihira’s relationship with Caitlyn is fully revealed, and it’s not romantic at all. She is introduced as Caitlyn’s assistant and her close friend, and the two share a surprising bond. Caitlyn says in her docuseries that she began confiding in Ronda about transitioning close to two years ago. Ronda even helped her pick the name “Caitlyn.”\n\nPHOTOS: Celebs' coming out stories\n\n2. Esther Jenner Meets Caitlyn for the First Time Ever\n\nEsther Jenner — Kylie, Kendall, Brandon, and Brody‘s maternal grandmother — has continually voiced her public support for Caitlyn, even prior to the star’s sit-down interview with Diane Sawyer, during which the athlete confirmed, “For all intents and purposes, I am a woman.”\n\nIn the first few scenes of I Am Cait‘s premiere, Caitlyn is seen nervously pacing at home, because her sisters and her mother are on their way over. This is the first time the family has been all together in a whopping four years, and Caitlyn is fretting because Esther has yet to meet Cait. She wonders how she should sign her mother’s birthday card — as Bruce or as Caitlyn? (Spoiler alert: She ends up signing it as Caitlyn).\n\nWhen the family arrives, Cait says to her mom, “It’s okay, it’s okay.” Esther replied, “I knew it would be,” as the entire clan hugs in the entryway. In her one-off with the camera, the Jenner family matriarch has sweet notes about Cait’s new appearance. “I think he’s a very good looking woman,” Esther muses. “He’s still Bruce. I love him so much.” While making an effort, she admits that the transition will require “a lot of getting used to.” They also meet with a therapist, who helps facilitate a larger conversation with the family. “I really want to learn more,” Esther repeats throughout the episode. “I need to understand more”\n\nIn another scene, Caitlyn’s mom tears up as she discusses how “it’s not easy” getting used to the newfound identity of her child. The supportive mom gets visibly emotional. “You have the same soul you were born with,” she notes to Cait.\n\nPHOTOS: Kardashian Christmas cards through the years\n\n3. Kylie Sees Caitlyn for the First Time Ever — Via FaceTime!\n\nCaitlyn’s youngest daughter Kylie, 17, sees her for the first time ever as a woman via FaceTime. The teen, who graduated from high school this past week, is waking up from anesthesia in a dentist’s chair when she sees Cait in her female form. “You look so pretty!” Kylie gushes, still slightly out of it from her operation.\n\nLater, Kylie comes over to see her in person and puts teal ombre hair extensions (from her own line, ha!) in Cait’s hair. Kendall’s younger sister says she was Google-imaging snapshots to figure out the best color scheme.\n\nAfter Kylie leaves, Cait expresses how excited she is about her daughter being accepting and gracious. Cait tells her sister that Kylie never really wanted to come by before, and she’s glad that she finally did.\n\nPHOTOS: How Kylie has evolved\n\n4. Kim and Kanye Make a Brief and Memorable Cameo\n\nThe superstar couple’s brief appearance in the premiere is marked with their usual antics — Kanye West gives a very sincere and philosophical statement, while stepdaughter Kim Kardashian pulls some tricks in the closet.\n\n“What’s up,” the rapper says to Caitlyn as he gives her a hug. West then tells Cait that she’s “changing society in the most meaningful way,” adding that what the former Olympian did was “one of the strongest things that have happened” in her entire lifetime. “You’re a celebrity, your daughter is a supermodel, and you’re saying this is who I am.”\n\nMeanwhile, Kim brings some comic relief to the episode as she raids Cait’s closet and sifts through her newly revamped wardrobe. The Vogue cover girl largely approves most of the items in Cait’s closet with the exception of one maxi dress. Caitlyn has a lot of items from Diane von Furstenberg and Tom Ford that the designers themselves have sent over directly.\n\n“I love this Tom Ford dress,” Cait tells North West‘s mom. Kim then notes that Kris has the same Tom Ford dress in a different color. The two joke about setting the momager up for a “Who Wore It Best” (shout-out to Us Weekly!). Kim jokes that she’ll invite Cait over when Kris is in the dress.\n\nPHOTOS: Caitlyn Jenner's best style moments — so far!\n\n5. Caitlyn Meets With the Family of a Trans Teen Who Committed Suicide\n\nLast, but certainly not least, the most somber part of the episode featured Caitlyn meeting with the family of a young transgender boy named Kyler, who tragically committed suicide. Caitlyn, who confessed at one point in the episode that she contemplated suicide, then attends a memorial with Kyler’s friends and family. Together, the group releases memorial balloons on the beach in San Diego.\n\nBONUS!\n\nThe previews for the second episode include several juicy tidbits, including one scene where Candis Cayne asks Cait if she wants to go on a date. Another moment features a miffed Kim telling Cait, “You don’t have to bash us on your way up.”\n\nTune in to the premiere of I Am Cait on E! on July 26 at 8 p.m. ET.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/Caitlyn-Jenner-Esther-Jenner-072215.jpg", "https://www.usmagazine.com/wp-content/uploads/1437571154_caitlyn-jenner-178.jpg?w=300&h=178&crop=1", "https://www.usmagazine.com/wp-content/uploads/Caitlyn-Ronda-Kamihira-072215.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/1437571154_caitlyn-jenner-zoom.jpg?w=200&h=113&crop=1", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://www.usmagazine.com/wp-content/uploads/1437571154_caitlyn-jenner-178.jpg?w=300&h=178&crop=1", "keywords": [], "authors": ["Esther Lee"], "canonical_link": "https://www.usmagazine.com/entertainment/news/i-am-cait-top-5-moments-caitlyn-jenners-ties-with-ronda-kanye-kim-2015227/", "title": "I Am Cait Top 5 Moments: Caitlyn Jenner's Ties With Ronda, Kanye, Kim", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Us Weekly rounds up the top five moments from the premiere episode of Caitlyn Jenner's new E! docuseries, I Am Cait", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "I Am Cait's Top 5 Moments: Her Ties With Kris' Ex-BFF Ronda Revealed", "description": "Us Weekly rounds up the top five moments from the premiere episode of Caitlyn Jenner's new E! docuseries, I Am Cait", "url": "https://www.usmagazine.com/entertainment/news/i-am-cait-top-5-moments-caitlyn-jenners-ties-with-ronda-kanye-kim-2015227/", "site_name": "Us Weekly", "updated_time": "2017-12-07T05:30:53+00:00", "image": {"identifier": "https://www.usmagazine.com/wp-content/uploads/1437571154_caitlyn-jenner-178.jpg?w=300&h=178&crop=1", "secure_url": "https://www.usmagazine.com/wp-content/uploads/1437571154_caitlyn-jenner-178.jpg?w=300&h=178&crop=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "section": "Entertainment", "published_time": "2015-07-22T13:55:15+00:00", "modified_time": "2017-12-07T05:30:53+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Us Weekly rounds up the top five moments from the premiere episode of Caitlyn Jenner's new E! docuseries, I Am Cait", "title": "I Am Cait's Top 5 Moments: Her Ties With Kris' Ex-BFF Ronda Revealed", "site": "@usweekly", "image": "https://www.usmagazine.com/wp-content/uploads/1437571154_caitlyn-jenner-178.jpg?w=300&h=178&crop=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1437573315.0, "source": "http://www.usmagazine.com", "summary": ""}