{"url": "https://www.cheatsheet.com/entertainment/meghan-markle-wrote-a-love-poem-for-prince-harry-and-were-not-crying.html/", "text": "Meghan Markle and Prince Harry’s wedding day was as magical as they come. Though it was a royal affair, the bride and groom were adamant about adding personal touches throughout the wedding ceremony and during both of their receptions. Not only did the royal couple allow viewers across the globe to witness their nuptials, they also invited British citizens, their personal guests, celebrities, and everyone in between to bear witness to their love.\n\nDespite their openness, the couple did keep some things to themselves. Their evening reception was a private affair for their 200 hundred closest friends and family members. And with no cameras or phones allowed in the venue, we had to hear what the celebration was like through the grapevine.\n\nHowever, one royal insider did reveal that Markle wrote a breathtaking poem for her new husband and there wasn’t a dry eye in the entire house when she read it. The Duchess of Sussex also praised this very important person in her speech (page 5).\n\nA perfect evening at Frogmore House\n\nThey made their way to the reception in this beautiful car. | WPA Pool/Getty Images They made their way to the reception in this beautiful car. | WPA Pool/Getty Images\n\nEven royals love to play beer pong\n\nThough we’ll probably never see any photos or video, Prince Harry and Meghan Markle’s intimate wedding reception at Frogmore House and Gardens was a fairytale. Hosted by Prince Charles, the reception was housed in a glass marquee on the grounds and had everything from cotton candy and burgers, to beer pong and a dance floor.\n\nIt was said to have been the perfect blend of the duke and duchess’ personalities.\n\nNext: Meghan Markle is determined to do her own thing.\n\nBreaking protocol\n\nShe invited this notable reverand to speak. | WPA Pool/Getty Images She invited this notable reverand to speak. | WPA Pool/Getty Images\n\nTheir celebration was modern and inclusive\n\nIt’s been evident since their engagement that Markle has no interest in being a traditional royal. The mix-raced, former actress is determined to forge her own unique path into the British royal family. It was clear from her wedding day that she was more than ready to do just that.\n\nThe Duchess of Sussex asked Bishop Michael Curry, the first African American leader of the Episcopal Church, to speak at her wedding. The bishop gave a rousing 14-minute long sermon on the power of love.\n\nMarkle also chose to speak at her wedding reception, something that is traditionally underheard of when it comes to British weddings and royal weddings in particular. However, she was determined to make her wedding an inclusive and modern celebration.\n\nNext: Here’s what the beautiful bride had to say.\n\nAn unexpected speech\n\nMarkle’s speech was wonderful. | Jonathan Brady-WPA Pool/Getty Images Markle’s speech was wonderful. | Jonathan Brady-WPA Pool/Getty Images\n\nThis may have been the most special part of the day\n\nThough the media speculated that Markle would speak at her wedding reception, guests at the Frogmore House were stunned when the newly minted duchess got to her feet to address the crowd. The speech went beyond the normal thanks and appreciation for her loved ones.\n\nA royal wedding guest told The Sun, “Meghan totally stole the show. It was the most special part of the entire day and the most unexpected.”\n\nNext: The perfect way to enter into a family.\n\nThanking her in-laws\n\nShe was grateful to Charles for filling in on the big day. | Jonathan Brady-WPA Pool/Getty Images She was grateful to Charles for filling in on the big day. | Jonathan Brady-WPA Pool/Getty Images\n\nShe has received a warm welcome from the royals\n\nMarkle’s entry into the royal family has been warm and welcoming, an almost unprecedented tone for the stuffy and traditional monarch. Prince Harry’s family has been keen to welcome Markle into the fold, despite her biracial heritage, previous marriage, Hollywood career, and American citizenship. It seems that everyone remembered how unhappy Princess Diana was during her marriage to Prince Charles, and no one wants to repeat that.\n\nDuring her wedding speech, the Duchess of Sussex graciously thanked her in-laws, including Prince Charles who walked her down the aisle. A source informed Us Weekly, “Meghan also gave a shout-out to her groom’s father, Prince Charles, and stepmother, Duchess Camilla, for being amazing hosts and welcoming her and her mother into the family.”\n\nNext: Meghan Markle’s No. 1 champion\n\nPraise for her mother\n\nShe was so grateful to have her mom beside her. | Phil Harris-WPA Pool/Getty Images She was so grateful to have her mom beside her. | Phil Harris-WPA Pool/Getty Images\n\nThe two have an unbreakable bond\n\nThroughout her entire journey to get to the altar, through her father’s health scares, and her half-siblings ire towards her, Markle’s mother, Doria Ragland, has been her rock. From the moment we caught glimpses of Markle and Ragland in the car coming towards St. George’s Chapel, we could tell that the bond between this mother/daughter duo was unbreakable.\n\nThe duchess, of course, took time during her speech to thank her mother for everything she’s done. A source told US Weekly, “She said, “You have always been there for me through everything.”\n\nMarkle never mentioned her father, Thomas Markle, in her speech.\n\nNext: The moment that moved everyone to tears\n\nA poem for Harry\n\nHe’s truly her Prince Charming. | Eamonn M. McCormack/Getty Images He’s truly her Prince Charming. | Eamonn M. McCormack/Getty Images\n\nTrue love is worth the wait\n\nMarkle put her acting, writing, and speaking skills to work for the portion of the speech that was about Prince Harry, whom she calls, “The One.” An insider told The Sun, that the poem was epic.\n\nThey revealed, “She spoke about their first date and falling in love at first sight. Meghan said she knew she had met her prince from the off and how blessed and lucky she feels to have found such a profound love.”\n\nMarkle also reportedly said finding love was worth the wait. Everyone in the crowd was moved, including Prince Harry who had to wipe away a tear.\n\nNext: Prince Harry’s sweet words\n\nA smitten pair\n\nWhat a wonderful way to begin their life together. | Ben Stansall-WPA Pool/Getty Images What a wonderful way to begin their life together. | Ben Stansall-WPA Pool/Getty Images\n\nThe couple makes the perfect team\n\nMarkle wasn’t the only one to make a speech. Her new husband, Prince Harry, also had some stunning words to say about his beautiful bride. During his BBC interview just after their engagement, Prince Harry revealed that he was smitten with Markle after their first date. He went even further about his feelings for her during the couple’s lunchtime wedding reception.\n\nA source told Us Weekly that he said, “Meghan has handled things with grace and dignity. [He said] that he can’t wait for them to be a team.”\n\nCheck out the Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/05/Meghan-and-her-mother-at-the-wedding.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceHarrysuit.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960192816.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960051980.jpg?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960192816.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960057722.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/Meghan-Markle-on-her-wedding-day.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/Meghan-Markle-harry-wedding-look.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960192816.jpg", "keywords": [], "authors": ["Aramide Tinubu"], "canonical_link": "https://www.cheatsheet.com/entertainment/meghan-markle-wrote-a-love-poem-for-prince-harry-and-were-not-crying.html/", "title": "Meghan Markle Wrote A Love Poem For Prince Harry and We’re Not Crying", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/meghan-markle-wrote-a-love-poem-for-prince-harry-and-were-not-crying.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Meghan Markle read a beautiful love poem for Prince Harry at their evening wedding reception and honestly, we're in tears.", "og": {"locale": "en_US", "type": "article", "title": "Meghan Markle Wrote A Love Poem For Prince Harry and We’re Not Crying", "description": "Meghan Markle read a beautiful love poem for Prince Harry at their evening wedding reception and honestly, we're in tears.", "url": "https://www.cheatsheet.com/entertainment/meghan-markle-wrote-a-love-poem-for-prince-harry-and-were-not-crying.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-17T23:00:05-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960192816.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960192816.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Royal Wedding", "section": "Entertainment", "published_time": "2018-06-17T23:00:00-04:00", "modified_time": "2018-06-17T23:00:05-04:00"}, "twitter": {"card": "summary_large_image", "description": "Meghan Markle read a beautiful love poem for Prince Harry at their evening wedding reception and honestly, we're in tears.", "title": "Meghan Markle Wrote A Love Poem For Prince Harry and We’re Not Crying", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/05/GettyImages-960192816.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529290800.0, "source": "https://www.cheatsheet.com", "summary": ""}