{"url": "en.wikipedia.org/wiki/Billy_Bush", "text": "American radio and television host\n\nWilliam Hall Bush[2] (born October 13, 1971)[3] is an American former radio and current television host, and a member of the Bush family, which includes two former U.S. presidents and other political figures.\n\nAfter appearing as a correspondent on Access Hollywood from 2001 to 2004, Bush became a primary anchor of the program in 2004. Bush also hosted The Billy Bush Show, a nationally syndicated talk and music radio show that aired from 2008 to 2014.[4] He departed Access Hollywood in 2016 after being named a co-host in the third hour of Today. In October 2016, during the presidential election, he became the subject of controversy when the 2005 Access Hollywood recording surfaced of him and presidential candidate Donald Trump having a lewd conversation. Due to this incident, Bush was fired from Today.[5]\n\nEarly life and career [ edit ]\n\nWilliam Hall Bush was born in Manhattan, New York,[1] to Josephine Colwell Bush (née Bradley) and Jonathan Bush, a banker.[6][7] He has one older brother, Jonathan S. Bush. William Bush's uncle (his father's older brother) was George H. W. Bush, the 41st President of the United States. George W. Bush, the 43rd President, and former Florida governor Jeb Bush are William Bush's first cousins.[3]\n\nBush attended middle school at St. Bernard's School in Manhattan and high school at St. George's School in Middletown, Rhode Island.[8] He graduated with a Bachelor of Arts in international studies and government from Colby College in 1994.[2] He was also a four-year letterman and a two-time co-captain as a junior and senior with the Mules' men's lacrosse team.[9][10] As of 2017, he is 4th (182), 8th (97), and 4th (85) in career points, goals and assists respectively in program history and was a first-team All-NESCAC in 1994.[11]\n\nCareer [ edit ]\n\nFM radio [ edit ]\n\nBush began his career hosting the afternoon drive show on WLKZ-FM in Wolfeboro, New Hampshire, later moving to Washington, D.C., where he hosted the midday show on WARW-FM.[citation needed] In March 1997, Bush joined WWZZ-FM (Z104) in D.C. as host of Billy Bush and the Bush League Morning Show, which aired until January 2001.[12]\n\nEarly television work [ edit ]\n\nIn January 2003, Bush hosted a short-lived NBC prime-time version of Let's Make a Deal.[12] He was also a correspondent for WNBC-TV's Today in New York morning show.[12][13]\n\nBush joined Access Hollywood, a daily entertainment news magazine, as East Coast correspondent in December 2001.[1] He was promoted to co-anchor in June 2004.\n\nWhile working at Access Hollywood, he was present at high-profile red carpet events including the Golden Globes, Grammys, and Academy Awards, and hosted ABC's live pre-show for the 2004, 2005 and 2006 Academy Awards and the 2006 Emmy Red Carpet Special.\n\nBush was a reporter for NBC at the 2004 Summer Olympics in Athens, and was the host for Access Hollywood's coverage of the 2006 Winter Olympics in Torino as well as the 2008 Summer Olympics in Beijing. In addition, Bush hosted the reality competition Grease: You're the One that I Want! on NBC in 2007, and stood in for Meredith Vieira for a week of Who Wants to Be a Millionaire shows on April 21–25, 2008. He and Vieira both had credited cameos as hosts of fictional game shows in the 2004 remake of Ira Levin's 1972 satirical thriller The Stepford Wives.\n\nHe returned to radio with The Billy Bush Show, a nightly talk radio and entertainment interview show. It airs from KBIG in Los Angeles and is syndicated by Westwood One. The show is written by Ryan Miller and produced by Corrin Barlow, while Bush and Access Hollywood executive producer Rob Silverstein are the show's executive producers.[13] The show, which airs evenings Monday through Friday, focuses on the top entertainment stories and personalities in the news, and features celebrity guests and listener calls.\n\nBush co-hosted the Miss Universe pageant four times: in 2003 and 2004 with Daisy Fuentes; in 2005 with fellow Access Hollywood co-anchor Nancy O'Dell; and in 2009 with Claudia Jordan. He has also co-hosted the Miss USA pageant four times, with almost the same partners: in 2003 with Fuentes; 2004 and 2005 with O'Dell; and again in 2009, this time with Nadine Velazquez. After the 65th Annual Golden Globe Awards of 2008 were cancelled as a result of the 2007–08 Writers Guild of America strike, Bush co-hosted the 65th Annual Golden Globe Awards Announcement press conference with O'Dell on January 13, 2008.\n\nBush was named one of Esquire magazine's \"10 Men\" in July 2005.[13] \"He's a furious, inventive interviewer, unafraid of playing the fool in exchange for a true reaction\", opined the writer of the accompanying magazine profile.[14]\n\nFrom September 13, 2010, to October 2016, Bush co-hosted the syndicated national daily entertainment talk show Access Hollywood Live, along with co-host Kit Hoover. This show is a sister show of Access Hollywood, with host chat of popular topics and celebrity live interviews. Bush and Hoover traveled together to the UK to cover Prince William's wedding to Catherine Middleton, as part of the NBC team coverage.\n\nBush played the drill sergeant in the 2010 film Furry Vengeance and had a small role as the voice of a newscaster in the 2014 Disney animated film Big Hero 6. He has also had several appearances on television shows including 30 Rock and Donny!.[15]\n\nToday [ edit ]\n\nIn May 2016, Bush was selected to be the co-host of the third hour of NBC's Today.[16] He served as a replacement for Willie Geist.[17]\n\nRyan Lochte controversy [ edit ]\n\nBush was the first reporter to interview American Olympic swimmer Ryan Lochte after the athlete claimed he was robbed at gunpoint in Rio de Janeiro during the 2016 Summer Olympics.[18] Bush's due diligence as an interviewer was scrutinized after critics claimed Bush did not ask questions that would have shown Lochte's story was fabricated.[19] When details of Lochte's story began to fall apart, Matt Lauer re-interviewed the swimmer in a move that was seen as a snub to Bush.[19] Bush garnered attention once again after he and Al Roker got into an argument during Olympic coverage on Today after Lochte was exposed.[20] Bush defended Lochte, saying he lied about \"some\" details whereas Roker characterized Lochte's statement as a lie.[21]\n\nTrump tape scandal [ edit ]\n\nOn October 7, 2016, The Washington Post reported that video footage was released of Donald Trump having a lewd conversation with Bush, with Trump either unaware or unconcerned that his microphone was active. Bush is heard laughing about Trump's failed effort to seduce a married woman, and joining in by commenting on actress Arianne Zucker's appearance, calling her \"hot as shit.\"[22] The video was made on the NBC Studios lot in the course of videotaping an Access Hollywood episode in mid-September 2005,[23] promoting Trump's cameo appearance in an episode of daytime soap opera Days of Our Lives to promote The Apprentice.\n\nIn the video, Trump discussed a failed attempt to seduce Bush's then-co-host Nancy O'Dell:[24] \"I moved on her, and I failed. I’ll admit it. I did try and fuck her. She was married.\" He also talked about stars groping women: \"...you just kiss...when you're a star they let you do it. You can do anything [Bush: Anything you want]...grab them by the pussy...\"[22]\n\nWhen the news of the footage first broke, Bush was at New York's JFK International Airport waiting to take off for Los Angeles. He spent the six-hour flight reading news reports on the unfolding controversy. By the time he arrived in Los Angeles, a horde of paparazzi had materialized at Los Angeles International Airport and at his home in Los Angeles, where they remained for more than a week. Bush spent the remainder of that weekend trying to save his job at Today, which had already garnered controversy, first over Bush's lack of hard-news experience and the rude tone he exhibited during red carpet events and then over the Ryan Lochte matter. Initially, NBC News signaled Bush would return that Monday to apologize on-air. Bush later stated, \"I would have welcomed addressing the audience.\"[25]\n\nHowever, Bush received criticism online and calls for his resignation from the show, with The Washington Post stating, \"Bush's public image was damaged—perhaps beyond repair.\"[20] He issued an apology, stating: \"Obviously I'm embarrassed and ashamed. It's no excuse, but this happened eleven years ago. I was younger, less mature, and acted foolishly in playing along. I'm very sorry.\"[26] Bush was 33 years old at the time the video was made. On October 9, 2016, NBC announced that Bush was suspended from Today for his role in the 2005 video. He was suspended pending an internal review.[27] By October 17, Bush had been fired.[28][29]\n\nAfter The New York Times reported in late November 2017 that Trump had privately told people, including a sitting senator, that the voice on the tape was not his, Bush published an op-ed in the paper on December 3, reaffirming that the voice in the tape was the president's and accusing him of engaging in revisionist history.[30][31]\n\nExtra [ edit ]\n\nOn May 8, 2019, Telepictures announced they would hire Bush to be the host of Extra. Bush replaces Mario Lopez at the start of the 26th season on September 9, 2019, in a revamp of the show, which was originally to be renamed ExtraExtra.[32][33]\n\nPersonal life [ edit ]\n\nHe married Sydney Davis in April 1998[34] and the couple has three daughters.[2] On September 19, 2016, the couple announced they were separating.[34] On July 15, 2018, Bush and his wife announced their divorce due to irreconcilable differences.[35]", "images": ["https://upload.wikimedia.org/wikipedia/commons/a/ac/William_hall_bush_2006.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/William_hall_bush_2006.jpg/220px-William_hall_bush_2006.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/ac/William_hall_bush_2006.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Billy_Bush", "title": "Billy Bush", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/a/ac/William_hall_bush_2006.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}