{"url": "https://www.hollywoodreporter.com/live-feed/backstreet-boys-james-corden-perform-late-late-show-larger-life-1129668", "text": "During the band’s Tuesday appearance on CBS’ 'The Late Late Show,' Corden made an amusing attempt to become the band’s new member.\n\nThe Backstreet Boys might have found a new member in James Corden — or so he hopes — as the late-night host performed alongside the boy band for a revamped version of their hit single during Tuesday night’s Late Late Show.\n\nJokingly promoting their new boy band, dubbed “James Street,” group members Nick Carter, Howie Dorough, AJ McLean, Kevin Richardson and Brian Littrell performed an mock version of their 1999 single, “Larger Than Life,” changing it to “Late Late-r Than Life” to reflect Corden’s 12:37 p.m. broadcast.\n\nPrior to their sketch, the band teased their appearance with their mock album cover with Corden on Twitter, where they created the hashtag \"#Jamesstreet.\"\n\nIn the performance, the late-night host and singers donned their signature white attire, recognizable from their 1999 album, Millennium, which featured the “Larger Than Life” single.\n\nThe sketch opened with Corden explaining that he plans to take over for one of the Backstreet Boys at their performance later that night. \"Corden's back, alright,\" he sang to the bandmembers as he stated his plan.\n\nWhile Kevin Richardson explained to Corden that no one was going to opt out of the performance, the late-night host responded, \"How hard is it? What is being a Backstreet Boy? It's wearing a fedora and dancing on some tarmac. I think I got it.\"\n\nFollowing Brian Littrell's insistence that Corden could not handle the costume changes, Corden let the members vote on whom he replaces. Corden then decided that he should take Littrell's place onstage. \"Show me the meaning of being lonely,\" Corden said, referencing another song off the album, as Littrell exited the dressing room.\n\nFollowing Littrell's forced departure, Corden tried to learn the choreography for the performance. He also took the liberty of suggesting new dance moves. When asked when he should do the worm, Howie Dorough responded, \"Maybe after the show.\"\n\nDespite resistance from the bandmembers, Corden eventually took on the role of choreographer and incorporated a number of new dance moves, including the band lifting him up during \"Larger Than Life.\" When they perfected the lift, Corden instructed, \"And then you guys disappear 'til the end of the song.\"\n\nNot only did Corden take over for the performance, but he also attended the band's meet and greet. When taking a group photo with a fan, Corden flipped the iPhone camera and instead took a selfie. He then blocked a fan in another photo.\n\nCorden led a prayer circle before he and the Backstreet Boys took the stage. \"Dear Lord, heavenly Jesus. I know what you're thinking. What's Brian doing there? We're thinking the same,\" he said. \"Make us strong. Show us the meaning of being lonely. Quit playing games with out hearts. Give us the call and know that everybody.\" After a moment of silence, he added, \"I can't think of any other Backstreet Boys songs. We want it that way. We want it that way!\"\n\nThe sketch then cut to the performance, in which a photo of Littrell onstage was been replaced with one of Corden. The band then appeared and began to sing \"Larger Than Life\" while the musicians are suspended on platforms in the air. Littrell eventually joined the group onstage. Corden then ran to the front of the stage and showed off his best dance moves, including the running man and the worm, as the band sang behind him.\n\nThe performance concluded when Corden thanked fans for coming and told them to drive home safe. Richardson then explained that they had 22 more songs to perform. \"I quit the band,\" Corden responded before walking offstage.\n\nAmid the release of their new single “Don’t Go Breaking My Heart,” the band is also headlining a Las Vegas residency, Backstreet Boys: Larger Than Life. This year, the group celebrated its 25th anniversary.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2018/07/111599_0076b2_copy_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2016/05/gettyimages-510455694-h_2016.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/02/colbert_never_fjorget.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/07/111599_0076b2_copy_0.jpg", "keywords": [], "authors": ["Lexy Perez Katherine Schaffstall", "Lexy Perez", "Katherine Schaffstall", "Lexy.Perez Thr.Com", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/backstreet-boys-james-corden-perform-late-late-show-larger-life-1129668", "title": "Backstreet Boys, James Corden Perform Revamped Single “Late Late-r Than Life”", "meta_data": {"viewport": "width=device-width", "description": "The Backstreet Boys and James Corden performed a revamp of their 1999 single \"Larger Than Life\" during their appearance on CBS’ 'The Late Late Show' Tuesday night.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/backstreet-boys-james-corden-perform-late-late-show-larger-life-1129668", "domain": "https://www.hollywoodreporter.com/", "title": "Backstreet Boys, James Corden Perform Revamped Single “Late Late-r Than Life”", "description": "During the band’s Tuesday appearance on CBS’ 'The Late Late Show,' Corden made an amusing attempt to become the band’s new member.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/07/111599_0076b2_copy_0.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Backstreet Boys, James Corden Perform Revamped Single “Late Late-r Than Life”", "description": "During the band’s Tuesday appearance on CBS’ 'The Late Late Show,' Corden made an amusing attempt to become the band’s new member.", "url": "https://www.hollywoodreporter.com/live-feed/backstreet-boys-james-corden-perform-late-late-show-larger-life-1129668", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/07/111599_0076b2_copy_0.jpg", "width": 1280, "height": 720, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Backstreet Boys, James Corden Perform Revamped Single “Late Late-r Than Life”", "sailthru.description": "During the band’s Tuesday appearance on CBS’ 'The Late Late Show,' Corden made an amusing attempt to become the band’s new member.", "sailthru.author": "Lexy Perez,Katherine Schaffstall", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-07-25 08:38:55", "sailthru.tags": "Live Feed, Television, Music, Backstreet Boys, James Corden, The Late Late Show, Late-Night TV"}, "movies": [], "publish_date": 1532479135.0, "source": "https://www.hollywoodreporter.com", "summary": ""}