{"url": "https://www.etonline.com/tv/216788_riverdale_jason_blossom_killer_reveal", "text": "\n\nWarning: Spoilers ahead! Do not proceed if you haven't watched Thursday's Riverdale!\n\n\n\nOne of Riverdale's biggest mysteries was answered on Thursday, as it was revealed that Jason Blossom's killer was none other than his own father, Clifford Blossom!\n\nArchie (KJ Apa), Jughead (Cole Sprouse), Betty (Lili Reinhart), Veronica (Camila Mendes), and Kevin (Casey Cott) spent the episode doing some amateur sleuthing after Jughead's father, F.P. Jones (Skeet Ulrich) was arrested for, and later confessed to, Jason's murder. They discovered part of the truth, that Jason was shot and dumped in a freezer in the basement of the Southside Serpents' bar, but a video on a flash drive found in Jason's letterman jacket ultimately revealed the shocking truth, that it was Clifford (Barclay Hope), and not F.P., who pulled the trigger.\n\nRELATED: 'Riverdale' Stars Dish on Archie's New Romance and Molly Ringwald's Grand Debut\n\n\n\nTo get to the bottom of the morose truth behind Jason's death (and that extra incest twist!) ET hopped on the phone with EP Roberto Aguirre-Sacasa to discuss the who, what and why behind Riverdale's inciting incident.\n\n\n\nCan you talk to me about your decision to reveal the identify of Jason Blossom's killer in Riverdale's penultimate episode rather than the finale?\n\n\n\n\n\nRAS: I had a meeting with Greg Berlanti and Sarah Schechter, who are executive producers on the show... [we were] talking about the last few episodes and I said, 'Then we'll reveal the murderer in the finale.' And Greg said, 'I think you should reveal it in the penultimate, because when you invest in these characters the way you have this year, you're going to want to be able to see the aftermath. You're going to be surprised by how much story you have to tell on the other side of it.' And the second he said that I was like, 'Oh my gosh, that's exactly right!'\n\n\n\n\n\nWhen we brought it up to the studio and the network, there were some raised eyebrows and I said, 'This is Greg's idea and we really agree on this,' and then I threw out what was going to be in the finale so that they knew there was enough mystery and exciting stuff happening and then everyone got really on board, but it sort of makes for a very breathless episode 12.\n\nThe CW\n\n\n\nWhen it comes to who killed Jason, was it always your intention from the very beginning to have it be his own father?\n\n\n\n\n\nRAS: Yes, Mr. Blossom was always it... We went into [the season] with three likely candidates: one was F.P. Jones, one was Hiram Lodge... and then the last was Clifford Blossom. As the season progressed, we kind of added Hal Cooper to the mix of someone who very possibly could have killed Jason.\n\nOur thesis for this show is this dark take on the Archie characters, and the Archie world that people thought they knew was a place of sunny, happy kids and families, where everyone is protected and everyone is safe. So the most transgressive, the most taboo, the darkest act that could happen is a parent killing their own child. And he also sort of, we discovered, had the greatest secret that he was hiding and he had the biggest motive. That's sort of how we landed on him.\n\nRELATED: Mark Consuelos Joins Season 2 of 'Riverdale' as Veronica's Father\n\n\n\n\n\nSeems like there's more to the story -- are we going to discover the reasons why Clifford killed his son?\n\n\n\n\n\nRAS: Absolutely! Episode 112 is the who-dunnit, and episode 113 is the 'Why did he do it?' A lot more mysteries start rolling out from there.\n\n\n\nLet's talk about the Blossom family twist with the Coopers – I'm going to call them the Bloopers – When did you decide to do that and can you talk about the cousin-cest of it all?\n\n\n\n\n\nRAS: Very early on that was in the pitch, that it was going to be revealed that the reason the families didn’t want Jason and Polly to be together was because – though they were somewhat distantly related – they were blood relatives and of course, that's just such a gothic trope... People thought that we were breaking the incest taboo with Cheryl this season, and I love that the twist isn’t that it was Cheryl and Jason, it was Jason and Polly. And again, in our sort of darker universe, that's one of darkest kind of roses in the vase.\n\nThe CW\n\nTV: 6 Reasons Why 'Riverdale' Is the New Teen Drama We've Been Waiting For\n\n\n\n\n\nCan you talk about the decision behind Clifford hanging himself? Obviously that takes away the vindication of watching that person get punished for the crime.\n\n\n\n\n\nRAS: I would say two things: stay tuned for the finale and remember, we didn’t see Clifford hang himself. We just saw Clifford hanging there.\n\n\n\nHell hath no fury like a Blossom woman scorned?\n\n\n\n\n\nRAS: Correct, correct, and the one thing that you won't find out in 12 is that the evil things we know Clifford has been doing are just the tip of the iceberg.\n\n\n\nRiverdale's season finale airs next Thursday at 9 p.m. ET/PT on The CW.\n\nEXCLUSIVE: Molly Ringwald on Playing Archie's Mom on 'Riverdale,' What Advice She Gives Her Young Co-Stars\n\n", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_riverdale_RVD112a_0030b.jpg?itok=1C7fujyE", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-05/1280_riverdale_RVD112a_0030b.jpg?itok=3BF5HXBj", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-05/1280_riverdale_RVD112b_0410b.jpg?itok=gC4aSGms", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-05/1280_riverdale_RVD112b_0107b.jpg?itok=Yy6VYwrs", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/kobevanslovestoryvp.jpg?h=c673cd1c&itok=BhLYWr25"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_riverdale_RVD112a_0030b.jpg?itok=1C7fujyE", "keywords": [], "authors": ["Leanne Aguilera"], "canonical_link": "https://www.etonline.com/tv/216788_riverdale_jason_blossom_killer_reveal", "title": "EXCLUSIVE: 'Riverdale' Boss Reveals Why [SPOILER] Killed Jason Blossom and Talks That Crazy Incest Twist!", "meta_data": {"article": {"opinion": "false"}, "title": "EXCLUSIVE: 'Riverdale' Boss Reveals Why [SPOILER] Killed Jason Blossom and Talks That Crazy Incest Twist! | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/tv/216788_riverdale_jason_blossom_killer_reveal", "title": "EXCLUSIVE: 'Riverdale' Boss Reveals Why [SPOILER] Killed Jason Blossom and Talks That Crazy Incest Twist!", "description": "One of 'Riverdale's biggest mysteries was answered on Thursday!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_riverdale_RVD112a_0030b.jpg?itok=1C7fujyE", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "One of 'Riverdale's biggest mysteries was answered on Thursday!", "title": "EXCLUSIVE: 'Riverdale' Boss Reveals Why [SPOILER] Killed Jason Blossom and Talks That Crazy Incest Twist!", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Leanne Aguilera", "url": "https://www.etonline.com/tv/216788_riverdale_jason_blossom_killer_reveal", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_riverdale_RVD112a_0030b.jpg?itok=1C7fujyE"}, "description": "One of 'Riverdale's biggest mysteries was answered on Thursday!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}