{"url": "https://betches.com/which-celebrity-couple-will-get-engaged-next-our-predictions/", "text": "Between that tiny sunglasses trend to *insert laundry list of Trump’s antics here* to these poorly thought-out celebrity engagements, being f*cking stupid seems to be very en vogue this 2018. If commitment-phobes like Justin Bieber and Jax Taylor can magically become loyal (LOL), why can’t the rest of Hollywood, which is basically the Land of Misfit F*ckboys? Which celebs are getting engaged next? We’re here to tell you! Here are our v serious predictions.\n\nKris Jenner and Corey Gamble\n\nDude, Kris Jenner has really been through it in terms of marriage. Her first husband defended OJ and her second husband aired her out in a tell-all book. Since Kris is Regina George’s mom come to life, of course she dates a guy that one of her daughters probably rejected at 1OAK. Is the age difference a little inappropriate? Yes. But Kris Jenner capitalized off of her daughter’s leaked sex tape, let her 16-year-old kid get lip injections, and possibly has an illegitimate daughter with OJ Simpson, so I don’t think “age-appropriate” is really in her vocabulary. And besides, Kris Jenner is Big D*ck Energy. She DGAF about what’s appropriate and what isn’t. She deserves holy matrimony with Corey. There, I said it. This is the only couple on this list I really want marriage for.\n\nBella Thorne and Mod Son\n\nMuch like showering, I really didn’t think holy matrimony was in the cards for Bella Thorne and Mod Son. But now that there’s an influx of dumb engagements, maybe I’m wrong (probably not about the shower thing, though). Bella Thorne is what happens when you don’t stop drinking double vodka Red Bulls and listening to TECH N9NE past the age of 19. And Mod Son is what happens when that rapper Sweet Dee dated on It’s Always Sunny gets addicted to DMT. So given their shared love of terrible hygiene and giving us the heebie-jeebies on social media, their love may be as long-lasting as their terrible tattoos. And should they get pregnant, it’ll be interesting to see what they name their children since they named their dog TAMPON. Maybe they were so high they thought that naming their dog after a personal hygiene product would automatically make them hygienic. IDK, just my theory.\n\nSuki Waterhouse and Rob Pattinson\n\nThey announced they were dating last week, so it’s high time these two get engaged already! I mean, Travis Scott and Kylie had a baby, and Travis doesn’t even know the names of all Kylie’s dogs. Why get to know the person before embarking on a wedding engagement when you can do that AFTER you agree to spend the rest of your lives together?\n\nDane Cook and His 18-Year-Old GF\n\nIf Katherine McPhee can get engaged to David Foster, who says Dane Cook won’t continue the trend of marrying your much younger sugar baby? We always knew Dane Cook would be destined to marry a trashy hot girl with an intentionally misspelled name with an “i” at the end, but we’re a little surprised that he could land one who’s 18. Dane Cook is like that creepy third-tier frat bro who peaked at whatever commuter college he went to and is a fixture at Dave and Buster’s happy hour. And Kelsi, his girlfriend, is like the naive hostess who gave in to his advances because he bought her a few black raspberry margaritas so she wouldn’t get carded. How romantic. Based on the comments Dane leaves on her Instagram, he seems to be really smitten by her. How sweet! Maybe she’s mature for her age and that’s why they….k, nvm.\n\nCorinne Olympios and Jonathan Cheban\n\nCorinne and Jonathan have been trying to have us guessing if they’ve been dating for months now. And literally, no one cared. So what’s the best way to get everyone to give a sh*t? Get engaged. Corinne could totally get married in that famous white wedding bikini from her first Bachelor episode. You know, the challenge where she took her top off because she wasn’t getting enough attention? And then they can bond over how much they hate me because I pissed Corinne off when I asked her about her Juicy J music video, and I pissed Jonathan Cheban off when I wrote that deep dive article about all the people he blocked on social media. Anyway, me making everything about myself aside, a wedding would be the only way for these two to finally (kind of) get our attention.\n\nImages: Giphy (3)", "images": ["https://betches.com/app/themes/bws-betches/dist/images/Betches_Main_Logo_b56dbfb2.svg", "https://s3.amazonaws.com/betches/app/uploads/2017/11/30094502/separator.png", "https://media.giphy.com/media/3o6Zt4ofWchCbg31eg/giphy.gif", "https://pixel.quantserve.com/pixel/p-ZqRuYBtPWtPaq.gif", "https://betches.com/app/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif", "https://media.giphy.com/media/3ohBVvjbRXDW9gXM0U/giphy.gif", "https://s3.amazonaws.com/betches/app/uploads/2018/08/06143345/engagement1.jpg", "https://betches.com/app/themes/bws-betches/dist/images/Betches_Main_Logo_White_3fc34aaa.svg", "https://betches.com/app/themes/bws-betches/dist/images/separator_3963510f.png", "https://media.giphy.com/media/l0Iy8CoXkvBku9mfK/giphy.gif"], "top_img": "https://s3.amazonaws.com/betches/app/uploads/2018/08/06143345/engagement1.jpg", "keywords": [], "authors": [], "canonical_link": "https://betches.com/which-celebrity-couple-will-get-engaged-next-our-predictions/", "title": "Which Celebrity Couple Will Get Engaged Next? Our Predictions", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "version": "1.222.425 | 13.33.25", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Which Celebrity Couple Will Get Engaged Next? Our Predictions | Betches", "description": "Between that tiny sunglasses trend to *insert laundry list of Trump’s antics here* to these poorly thought-out celebrity engagements, being f*cking stupid seems to be very en vogue this 2018. If commitment-phobes like Justin Bieber and Jax Taylor can magically become loyal (LOL), why can’t the rest of Hollywood, which is basically the Land of … Continued", "url": "https://betches.com/which-celebrity-couple-will-get-engaged-next-our-predictions/", "site_name": "Betches", "updated_time": "2018-08-06T14:46:07+00:00", "image": {"identifier": "https://s3.amazonaws.com/betches/app/uploads/2018/08/06143345/engagement1.jpg", "secure_url": "https://s3.amazonaws.com/betches/app/uploads/2018/08/06143345/engagement1.jpg", "width": 1140, "height": 570}}, "article": {"tag": "kris jenner", "section": "Celebrities", "published_time": "2018-08-06T14:45:50+00:00", "modified_time": "2018-08-06T14:46:07+00:00"}, "twitter": {"card": "summary_large_image", "description": "Between that tiny sunglasses trend to *insert laundry list of Trump’s antics here* to these poorly thought-out celebrity engagements, being f*cking stupid seems to be very en vogue this 2018. If commitment-phobes like Justin Bieber and Jax Taylor can magically become loyal (LOL), why can’t the rest of Hollywood, which is basically the Land of … Continued", "title": "Which Celebrity Couple Will Get Engaged Next? Our Predictions | Betches", "image": "https://s3.amazonaws.com/betches/app/uploads/2018/08/06143345/engagement1.jpg", "creator": "@relationshep"}, "generator": "WordPress 5.3.2", "fb": {"pages": 197896046906431}, "wp-parsely_version": "2.0", "msapplication-TileImage": "https://s3.amazonaws.com/betches/app/uploads/2018/01/13052953/cropped-favicon23-270x270.png"}, "movies": [], "publish_date": 1533566750.0, "source": "https://betches.com", "summary": ""}