{"url": "https://www.dailymail.co.uk/news/article-4536624/Salman-Abedi-known-security-services-point.html", "text": "Advertisement\n\nAn extraordinary picture of the family of Manchester Arena bomber Salman Abedi has emerged tonight, as his father who had Al-Qaeda links and his younger brother were arrested in Tripoli.\n\nSalman killed 22 people and injured at least 119 more when he detonated a bomb on Monday night as children were piling out of the venue having watched Ariana Grande.\n\nThe mass-murderer - who apparently had links to the 'Man in the Hat' Brussels bomber - had only just returned from a three-week trip to war-torn Libya before launching his horrifying attack, friends said.\n\nThat revelation came as his father, Ramadan, was arrested by masked gunmen in Tripoli this evening while recording TV interviews in the country.\n\nEarlier he had claimed his son seemed 'normal' when they last spoke five days ago and insisted: 'We don't believe in killing innocents.'\n\nAbedi's younger brother Hashem has also been arrested in Tripoli, Libya, on suspicion of having links to the ISIS who claimed responsibility for Monday night's atrocity.\n\nHe was 'aware of all the details' of his plans, a Libyan security force said. Hashem had been 'under surveillance for a month and a half' and 'investigation teams supplied intelligence that he was planning a terrorist attack in the capital Tripoli', the Deterrence Force said on its Facebook page.\n\nSalman's older brother Ismail, 23, was arrested yesterday in Chorlton, south Manchester. He is still being quizzed by police, who are probing the family's links to a terror network.\n\nScroll down for video\n\nLounging on the beach in Libya with friends and hanging out with his mates in Manchester, this is Salman Abedi (circled) as a teenage boy before he became a suicide bomber. There is a no suggestion any of the friends he is pictured with have been involved in any wrong doing\n\nRamadan Abedi (pictured) the father of Manchester Arena bomber Salman Abedi claims his son seemed 'normal' when they last spoke five days ago and insists: 'We don't believe in killing innocents'\n\nRamadan, 51, was arrested this afternoon – hours after insisting his son Salman had nothing to do with the suicide bombing\n\nAbedi's younger brother Hashem (pictured) has also reportedly been arrested in Tripoli, Libya, on suspicion of having links to the ISIS, that claimed responsibility for the atrocity\n\nHashem (pictured after his arrest in Libya this evening) was 'aware of all the details' of his plans, Libyan security forces said\n\nIsmail (pictured), the older brother of Salman, was arrested in south Manchester yesterday\n\nHashem Abedi, 20, the younger brother of Manchester suicide bomber Salman, has been arrested in Libya (pictured left with brother Ismail, centre, who has been arrested in England), according to reports\n\nTHE KEY QUESTIONS ABOUT THE ABEDI FAMILY By Thomas Burrows What were Salman Abedi's father's links to terror groups? Ramadan, a former airport security worker, was a member of the Libyan Islamic Fighting group in the 1990s, according to a former Libyan security official. The group had links to Al-Qaeda. Although the LIFG disbanded, he reportedly belongs to the Salafi Jihadi movement, the most extreme sect of Salafism and from which Al-Qaeda and ISIS hail. He had also publicly voiced his support for an extremist group fighting in Syria. He posted photos of soldiers clad in black uniforms from the Al-Nusra Front, which was the official Syrian branch of al Qaeda until it broke up last July, on his Facebook page five years ago. Ramadan's wife, Samia, a nuclear scientist, is a close friend of the wife of Abu Anas al-Libi, an Al-Qaeda veteran who was snatched off the streets of Tripoli in 2013 by US special forces. Al-Libi faced accusations of involvement in the 1998 bombings of two US embassies in Africa. He was on the FBI's most-wanted terrorist list and died in U.S. custody in 2015. Why did his parents leave Britain? Ramadan fled Tripoli in 1993 to Saudi Arabia after he was accused of helping Islamists by tipping them off before police raids. He then claimed political asylum in Britain and lived there for 25 years, fathering three sons and a daughter, before returning to Libya after Gadhafi was ousted and killed in the country's 2011 civil war. He went on to become a manager of the Central Security Force in Tripoli, as different factions continued to fight for overall control of the country. What were his brothers, Hashem and Ismail's links to terror groups? Hashem had posted comments on ISIS-supporting sites. The Libyan security force claimed he told authorities both he and his brother belonged to ISIS. The Special Deterrent anti-terror force said Hashem was receiving cash transferred from Salman. Detectives said Hashem had links to Islamic State and was planning to carry out a terror attack in Tripoli. Ismail, who was arrested on Tuesday in south Manchester, was once reported to a counter- terrorism unit after concerns were raised by members of the Muslim community. How much was known about Salman prior to Monday night's attack? Two people who knew Salman are said to have called the police counter-terrorism hotline five years ago to raise concerns that he thought 'being a suicide bomber was OK'. And a senior US intelligence official has claimed that members of his own family had warned police that he was 'dangerous'. Why was he allowed to travel freely between Libya and the UK? UK border checks were branded a 'shambles' after it emerged the suicide bomber had travelled to ISIS strongholds Syria and Libya before being able to come 'straight through' to Britain. Labour's Khalid Mahmood told MailOnline the case of Abedi demonstrated the weakness of Britain's border check system and claimed border staff had been reduced by 50 per cent since 2010. Had Salman been to Syria? France's interior minister Gerard Collomb told French TV that both British and French intelligence services had information that the attacker had been in Syria. Asked if he believed Abedi had the support of a network, Collomb said: 'That is not known yet, but perhaps. In any case, (he had) links with Daesh (ISIS) that are proven.'\n\nEarlier today, Manchester's police chief said it is 'very clear' that police are investigating 'a network' linked to the bomber.\n\nPolice, in tandem with British soldiers, have carried out several raids since Monday night's atrocity and so far nine people have been arrested, including Salman's father and two brothers.\n\nA former Libyan security official Abdel-Basit Haroun said Ramadan, a former airport security worker, was a member of the Libyan Islamic Fighting group in the 1990s. The group had links to Al-Qaeda.\n\nAlthough the LIFG disbanded, Haroun said the father belongs to the Salafi Jihadi movement, the most extreme sect of Salafism and from which Al-Qaeda and ISIS hail.\n\nHe had also publicly voiced his support for an extremist group fighting in Syria. He posted photos of soldiers clad in black uniforms from the Al-Nusra Front, which was the official Syrian branch of al Qaeda until it broke up last July, on his Facebook page five years ago.\n\nUnderneath the photo, he wrote: 'Victorious against the infidels... say Amen!'\n\nRamadan, a former airport security worker in the UK, also published a picture of Hashem holding a machine gun while wearing a Nike t-shirt and combat trousers. Underneath the picture he write: 'The lion Hashem... is training'.\n\nRamadan fled Tripoli in 1993 after Moammar Gadhafi's security authorities issued an arrest warrant and eventually sought political asylum in Britain.\n\nHaroun said Ramadan, also known as Abu Ismail, had returned to the Libyan capital of Tripoli.\n\nA witness said he was handcuffed by armed men this evening who drove him away in two unmarked vehicles.\n\nThe 22-year-old suicide bomber appeared to have carried a powerful explosive in a metal container, which was either inside a black vest or blue Karrimor backpack\n\nA small handheld a small detonator was used to explode the bomb, investigators believe\n\nAnalysis of where people fell shows that most of the fatalities occurred in a nearly complete circle around the bomber\n\nInvestigators found a destroyed Yuasa 12-volt, 2.1 amp lead acid battery (pictured) after the attack in Manchester Arena\n\nThousands of troops will be deployed to guard 'key locations' amid fears another attack is 'imminent'. British soldiers were pictured arriving by bus this morning and heading towards a building near New Scotland Yard in London\n\nSalman's younger brother, Hashem, now 20, who has also been arrested in Libya, had posted comments on ISIS- supporting sites.\n\nThe Special Deterrent anti-terror force said Hashem was receiving cash transferred from his brother, Salman.\n\nThe SDF said Hashem had been under surveillance for about a month-and-a-half before the Manchester terror attack.\n\nBut Libyan detectives are not thought to have told their British counterparts about the operation because they only suspected Hashem of planning an attack in Tripoli.\n\nAn SDF spokesman said: 'Hashem confessed to being in the UK while the terrorist operation was being planned. And it is clear that he was fully aware of all the details of the [Manchester] terrorist operation.\n\n'It is also important to note that Hashem left the UK on April 16 and said he was in constant contact with his brother, the executor of the operation.'\n\nThe Libyan security force claimed Hashim told authorities both he and his brother belonged to ISIS.\n\nAccording to CNN, Ramadan brought Salman and Hashem to Libya from Manchester about a month ago because they were getting in trouble in England. The brothers wanted revenge for a friend who was killed by a gang, a family friend said.\n\nThe father took his sons' passports so they could not return to England, according to the friend.\n\nThe friend and another source in Manchester's Libyan community said Salman got his passport back after telling his father he was going on a Umrah pilgrimage to Saudi Arabia. He returned to England instead.\n\nPictures show troops arriving at a Ministry of Defence Building today. They had earlier been seen boarding buses at wellington Barracks in London after Theresa May raised the terrorism threat level in Britain to 'critical'\n\nLINK TO THE 'MAN IN THE HAT' Mohamed Abrini, who police believe may be linked to Salman Abedi, became known as 'the man in the hat' after police released CCTV pictures of him in Brussels airport pushing a luggage trolley packed with explosives. He was seen with the two bombers who died in the attack in March 2016. His bomb failed to explode and he fled the scene, prompting a worldwide manhunt. The Belgian, of Moroccan descent, was also linked to the Paris atrocities. The 31-year-old was eventually arrested in Brussels in April 2016 and remains in custody. There were fears he might have been plotting a massacre in the UK after it emerged he had visited Birmingham and taken pictures of a football stadium. When interviewed by Belgian police he denied that photos he took of landmarks in Britain were for reconnaissance.\n\nEarlier today Ramadan said he spoke to Salman five days ago and claimed he was getting ready to visit Saudi Arabia and sounded 'normal.'\n\nHe said he was planning to head from Saudi Arabia to Libya to spend the holy month of Ramadan with the family.\n\nHe said: 'We don't believe in killing innocents. This is not us.'\n\nHe added: 'Every father knows his son and his thoughts, my son does not have extremist thoughts. I was really shocked when I saw the news, I still don't believe it.\n\n'My son was as religious as any child who opens his eyes in a religious family. As we were discussing news of similar attacks earlier, he was always against those attacks, saying there's no religious justification for them.\n\n'I don't understand how he'd have become involved in an attack that led to the killing of children.'\n\nHe denied that his son had ever been to Syria.\n\nRamadan also denied having ties to any of Libya's militant groups, including the LIFG.\n\n'This is nonsense,' he said, adding that under Gaddafi 'anyone who went to a mosque raised question marks'.\n\nPolice are probing the family's links to a terror network and have carried out extensive searches across Manchester.\n\nThree arrests were in the Fallowfield area of the city in the early hours of this morning, and Abedi's older brother Ismail, 23, was arrested yesterday in Chorlton, south Manchester. He is still being quizzed by police.\n\nThis evening investigators arrested a fifth suspect in Wigan who allegedly approached a bus with a suspicious package. A property in Wigan is also being searched.\n\nA short time later, a woman was arrested following an armed raid on a block of flats in Blackley, in the north of the city.\n\nDetails of the arrests emerged as:\n\nThree men were arrested in south Manchester over the attack taking the total number now in custody to five.\n\nPolice arrested a fifth suspect in Wigan this evening and are assessing a package the suspect was carrying.\n\nHeavily armed police raided a flat in central Manchester as they hunted a 'network' linked to Salman Abedi.\n\nAn off-duty female officer was among the 22 killed in the atrocity which also claimed the lives of a Polish couple.\n\nPrime Minister Theresa May raised the terrorism threat level in Britain to 'critical' - the highest possible rating.\n\nThousands of troops will be deployed to guard 'key locations' amid fears another attack is 'imminent'.\n\nChanging of the Guard ceremony at Buckingham Palace and tours of Palace of Westminster tours cancelled.\n\nA minute's silence will be held at 11am tomorrow in remembrance of those who lost their lives or were affected.\n\nThe father of the alleged Manchester arena attacker denied his son was linked to militants or the bombing.\n\nHome Secretary Amber Rudd vented her frustration over US leaks revealing details about the attack.\n\nCountries around the world supported Britain by lighting up major buildings in the colours of the Union Jack.\n\nFrench president Emmanuel Macron revealed plans to extend the country's state of emergency until November.\n\nEarlier, pictures emerged showing Abedi lounging on the beach in Libya with friends and hanging out with his mates in Manchester as a teenager.\n\nAccording to schoolmates of the 22-year-old killer, the pictures were taken near his home in South Manchester and on a trip in his parents' home country of Libya when he was 14 or 15.\n\nThe 'ordinary' teenager posing in the new photographs was described as 'quiet' and 'not the sort of kid that stood out'.\n\nFriends told MailOnline he showed little interest in religion, adding that he even smoked cannabis.\n\nFresh police raids took place today with three men arrested over the attack. Police descended on two homes south Manchester yesterday\n\nUndercover armed police are said to have tackled a man to the floor who allegedly approached a bus with a suspicious package\n\nHeavily armed police raided a city centre flat after three men were arrested at gunpoint in south Manchester in connection with Monday night's bomb attack\n\nPolice were seen outside a house in South Manchester this morning, in connection with three new arrests over the attack\n\nThree men were arrested in fresh raids this morning, Greater Manchester Police revealed today. An officer is pictured at the scene of the arrest\n\nArmed police officers patrol a police cordon near the Manchester Arena in Manchester this morning amid heightened security\n\nOperation: Armed police outside Manchester Piccadilly train station during the early morning rush hour this morning\n\nArmed police were seen patrolling the streets of Manchester today after Theresa May raised the terrorism threat level to 'critical' - the highest possible rating\n\nMOTHER OF SUICIDE BOMBER WAS 'NUCLEAR SCIENTIST' Bomber Salman Abedi's mother is a nuclear scientist, a family friend revealed last night. Samia Tabbal, 50, graduated from Tripoli university 'top of her class', it was said. It also emerged she is a close friend of the wife of former Al Qaeda commander Abu Anas Al-Libi who once featured on the FBI most wanted terrorists list, with a £20million bounty. He spent five years in Manchester, having won asylum in Britain in 1995. He was later suspected of helping to plot the 1998 bombings of US embassies in Tanzania and Kenya, which killed a total of 224. Al-Libi returned to Libya in 2000, and was captured by US Special Forces in Tripoli in 2013. He died in custody two years later. His wife Umm Abdul Rahman said she went to college in Tripoli with Abedi's mother, who studied nuclear engineering, and that the women had lived together in Manchester. Another friend said: '[Abedi's] mother is very intelligent. She told my wife she was a nuclear science engineer … She graduated top of her class from Tripoli University.'\n\nThere is no suggestion any of the people he was pictured with have been involved in any wrongdoing.\n\nSalmon went to Burnage Academy, a boy's school catering largely to Manchester's Asian community and was a keen footballer, often playing at the ground at Whalley Range High School where the Manchester United Foundation held soccer sessions, they said.\n\nTwo people who knew Salman are said to have called the police counter-terrorism hotline five years ago to raise concerns that he thought 'being a suicide bomber was OK'.\n\nAnd a senior US intelligence official has claimed that members of his own family had warned police that he was 'dangerous'.\n\nUK border checks were branded a 'shambles' after it emerged the suicide bomber had travelled to ISIS strongholds Syria and Libya before being able to come 'straight through' to Britain.\n\nOne neighbour and schoolmate claimed: 'None of them were your typical Salafis or religious or extremists. No religion was involved. A year ago, all of this changed when the killer started hanging out with 'people I hadn't seen before.'\n\n'It was like a turning-point,' he told MailOnline. 'He suddenly started hanging out with people I'd never seen before and not his old friends anymore.'\n\nA different schoolmate of the bomber, who was in the same class throughout secondary school, told MailOnline that Abedi had never shown any interest in religion.\n\n'He was just a normal kid, not one of those who ever particularly stood out,' he said.\n\nYet neighbours of a family in suburban Manchester linked to Abedi said the family there were 'super religious'.\n\nAbedi was a pupil at Burnage Academy For Boys between 2009 and 2011, the school said.\n\nIn a statement, it said: 'We are a Manchester school. We feel the pain that Manchester feels. We stand shoulder to shoulder with our fellow Mancunians against terrorism in all its forms. Our deepest condolences go to all who have been affected by this outrage.'\n\nPolice and forensics were also seen at Manchester's Victoria Railway Station as the hunt for Abedi's accomplices continued\n\nForensics officers were seen working near Manchester Arena this morning as they examined the scene of the atrocity\n\nInvestigation: Scenes of crime officers wearing white suits were working close to the scene of the attack this morning\n\nPolice officers stand next to floral tributes left for the victims of an attack on concert goers at Manchester Arena, in St Ann's Square, Manchester, today\n\nHundreds of bunches of flowers and tributes were left in central Manchester today as people paid their respects throughout the day\n\nManchester City Council workers moved the floral tributes from Albert Square to St Anns Square this afternoon\n\nLast night it emerged Salman had only just returned from war-torn Libya before launching his horrific attack and was seen as the 'face of hate' among some neighbours.\n\nBritish-born Abedi had spent time in a conflict zone - possibly Syria - before slaughtering 22 in a suicide bomb atrocity at Manchester Arena on Monday night, it has been claimed.\n\nA friend of Abedi said the attacker had returned from a three-week trip to Libya - also an ISIS hotbed - just days ago.\n\nHe is understood to have made regular journeys to the North African country in recent years.\n\nIt was also claimed last night that he had travelled by train from London to Manchester on Monday in advance of the attack. This has raised suspicions that he may have met co-conspirators or been supplied with his explosive device and was effectively being used as a 'mule' by an as-yet-unidentified bombmaker.\n\nFrench interior minister Gerard Collomb said this morning Abedi is understood to have travelled to Syria and had 'proven' links with ISIS.\n\nToday, Labour's Khalid Mahmood told MailOnline the case of Abedi demonstrated the weakness of Britain's border check system and claimed border staff had been reduced by 50 per cent since 2010.\n\n'We don't have and have never had secure borders,' he said. 'This is an individual who has come back with devastating effect.'\n\nMr Mahmood said Mrs May had to 'take responsibility' for the border 'shambles' because she was Home Secretary for six years.\n\nSalman was identified after the attack by his bankcard and had deployed a 'big and sophisticated bomb' using materials not widely available in Britain.\n\nA woman pauses to look at floral tributes and messages in Manchester, this morning. Mourners last night held a candle-lit vigil to remember the dead\n\nRenee Rachel Black (right) is comforted by Sadiq Patel in front of flower tributes at Albert Square central Manchester, this morning\n\nOffering prayers: A man kneels down and prays close to floral tributes left in St Ann's Square Manchester this morning\n\nThere were heartbreaking scenes in central Manchester this morning as a steady stream of people came to pay their respects\n\nThe official said he had 'clear ties to 'Al-Qaeda' but could have links with other groups and had travelled to multiple countries.\n\nManchester Chief Constable Ian Hopkins said this afternoon: 'It's very clear that this is a network that we are investigating.'\n\nHome Secretary Amber Rudd had earlier said the 22-year-old was known to intelligence services 'up to a point' and that it 'seems likely' he was not acting alone in the run up to the massacre.\n\nFrench Interior Minister Gerard Collomb later suggested British investigators had told Paris counterparts that Abedi had probably travelled to Syria. It raises the question of whether Abedi had links to French jihadists and terror cells.\n\n'Today we only know what British investigators have told us - someone of British nationality, of Libyan origin, who suddenly after a trip to Libya, then probably to Syria, becomes radicalised and decides to carry out this attack,' Collomb told BFMTV.\n\nPressed on how he knew Abedi had been in Syria, Collomb said this was the information French and British intelligence services had.\n\nAsked if he believed Abedi had the support of a network, Collomb said: 'That is not known yet, but perhaps. In any case, (he had) links with Daesh (ISIS) that are proven.'\n\nMeanwhile, France's president Emmanuel Macron is seeking to extend the country's state of emergency, imposed after ISIS attacks, until November, the Elysee Palace announced.\n\nPrime Minister Theresa May said yesterday that troops will be deployed to guard Buckingham Palace and other 'key locations' across Britain amid fears of a further terror attack.\n\nThe Palace of Westminster today closed off access to all non-passholders.\n\nMrs May raised the terrorism threat level to 'critical' - the highest possible rating - on amid fears another atrocity is 'imminent'.\n\nPictures this morning showed troops assembling at Wellington Barracks in London and entering a building near New Scotland Yard.\n\nAmid heightened security fears, Premier League Champions Chelsea have decided to cancel a planned victory parade on Sunday after saying it would be 'inappropriate'.\n\n'Taken too soon': Victims of Abedi's suicide bomb attack Two teenagers, an eight-year-old girl, two mothers, a Polish couple and a hero aunt who shielded her niece are among those killed in the atrocity. In the early hours of this morning devastated mother Charlotte Campbell confirmed that her 15-year-old daughter Olivia was the latest victim of Monday's suicide attack. In a heartbreaking post, Charlotte, who yesterday appealed on TV for information about Olivia, posted: 'RIP my darling precious gorgeous girl Olivia Campbell, taken far far to soon go sing with the angels and keep smiling mummy loves you so much.' Olivia Campbell's distraught mother confirmed that the 15-year-old (pictured) had died as a result of the blast on Monday night It was confirmed this morning that Polish couple Marcin and Angelika Klis had died in the blast yesterday. They had gone to pick up their children from the concert when they were killed. Their children Alex and Patricia are said to be safe Saffie Rose Roussos, 8, is the youngest known victim of last night's atrocity. Her mother, Lisa, was criticially injured and neighbours say she does know her daughter had died The first victim of the Manchester terror attack has been named locally as 18-year-old Georgina Callander. She is pictured with Ariana Grande two years ago This morning, it was confirmed that Polish couple Angelika and Marcin Klis have also died. Their daughter Alex Klis had launched a desperate search to find them online yesterday. The youngest victim of the attack was eight-year-old Saffie Rose Roussos, whose mother Lisa is in intensive care. A family friend said Lisa, 48, did not know her daughter had died. Friends Alison Howe and Lisa Lees, who were waiting to pick up their children outside the Manchester Arena on Monday night, were also confirmed dead by their families late last night. Mothers Lisa Lees (left) and Alison Howe (right) were killed in the suicide bombing on Monday night outside the Manchester Arena in Manchester as they waited for their children This image, believed to be of victim John Atkinson (pictured left), 26, from Bury, has been posted on Facebook by a friend Kelly Brewster died as a result of her injuries, her family has confirmed. She had been missing since the atrocity last night 'True gentleman' John Atkinson, 26, also died in the atrocity, along with 32-year-old Kelly Brewster, who shielded her niece from the blast. And a fundraising page has been set up in memory of schoolgirl Megan Hurley, stating she was taken 'far too early'. It has already raised more than £3,000. Her brother Bradley was seriously injured. The first victim of the Manchester terror attack was yesterday named as 18-year-old Georgina Callander. Also among the dead were Nell Jones, 14, from Goostrey, Cheshire, a member of a Young Farmers club. Jane Tweddle-Taylor, 50, from Blackpool, Lancashire was killed after heading to the arena to pick up her friend's children. Michelle Kiss, a mother from Blackburn, Lancashire, was also today confirmed as one of the victims of Monday's terror attack as was Martyn Hett, 29, a PR manager from Stockport, Greater Manchester, who is believed to have been at the Ariana Grande concert with his friend Stuart Aspinall when the pair became separated. Nell Jones (pictured left) and 50-year-old school receptionist Jane Tweddle-Taylor (right) both died when the bomber struck Another victim, Martyn Hett, from Stockport, was due to fly to America for a two-month holiday. Family and friends revealed that he had spent the last few days saying goodbye to friends Hours before she was due to attend the concert, Michelle Kiss posted on Facebook a photograph of two young girls, one thought to be her daughter, excited for the show. She is believed to have been killed in the terror attack\n\nPolice were standing outside Abedi's house in Fallowfield this morning as the hunt for possibly accomplices continued\n\nPolice have said they are investigating a 'network' linked to the bomb attack on Monday night.\n\nEarlier today police in Manchester arrested three men in the south of the city.\n\nResidents said they watched a man and possibly his two sons get frogmarched out of a house in Aston Avenue, Fallowfield, two streets away from a property raided yesterday - the suspected home of suicide bomber Salman Abedi.\n\nA witness described the man arrested as a 'super-religious Libyan' who hosted Abedi at his home in the past.\n\nThis evening police arrested a fifth suspect in Wigan, and are assessing a package the suspect was carrying.\n\nThey follow the arrest of Salman's older brother, Ismail, yesterday morning in connection with the attack.\n\nOfficers were seen entering and leaving the building this morning as it emerged that three men have been arrested over the attack\n\nPolice were also guarding a block of flats in South Manchester that was also at the centre of a raid yesterday\n\nPolice were still on the scene at Salman Abedi's home in Fallowfield, Manchester, today. Aa controlled explosion took place yesterday during a raid\n\nLast night, a chilling picture emerged of the terrorist who wore a 'face of hate' as he grew up in an anonymous suburb of Manchester.\n\nThe imam of Didsbury Mosque, Mohammed Saeed revealed Salman stopped going to the mosque in 2015 as he objected to anti- ISIS comments.\n\nHe said: 'Salman used to come to the mosque occasionally, he wasn't particularly friendly towards me because he didn't like my anti-ISIS sermons.\n\n'He didn't like what I was saying and showed me the face of hate. He came to the mosque less and less after that.'\n\nIt is understood that Abedi was 'known' to the Security Services through his associations to those linked to terrorism in Manchester's Libyan community.\n\nThese are said to have included 24 year-old Abdalraouf Abdallah, who was jailed for nine years after being convicted of preparing acts of terrorism and funding terrorism. Abdallah, who is partially paralysed after being shot during the Libyan Revolution, is said to have helped men travel to Syria to fight. Inquiries led officials at the time to believe Abedi was not of significance to that operation.\n\nSalman is also being probed over alleged ties to an 'ISIS recruiter' in Manchester. Abedi was friends with Raphael Hostey, also known as Abu Qaqa al-Britani, who served as an ISIS recruiter until he was killed in 2016 in Syria by a drone strike.\n\nThey were said to be family friends and it is feared Hostey may have helped radicalise Abedi.\n\nThere are also fears Abedi may have been inspired by Manchester-born 50-year-old former Guantanamo Bay detainee, Ronald Fiddler, also known as Jamal al-Harith. The Briton blew himself up at a military base in Iraq in February.\n\nHe was one of 16 men awarded a total of £10million in compensation in 2010, when the British government settled a lawsuit alleging its intelligence agencies were complicit in the torture of prisoners at Guantanamo Bay.\n\nSalman may also have had links with other cells across Europe and North Africa, according to two officials familiar with the case.\n\nThey said one thread of the investigation involves pursuing whether Abedi could have been part of a larger terror cell that included Mohamed Abrini, otherwise known as 'the man in the hat,' with connections to the Brussels and Paris attacks. Abrini visited Manchester in 2015.\n\nA huge number of police - including armed officers - carried out a raid on a house in the Fallowfield area of the city. They remained on guard today (pictured)\n\nSecurity was on high alert around Buckingham Palace today and police arrested a man in possession of a knife\n\nPictures show a man surrounded by officers and handcuffed as he sat on the ground in The Mall at around 10.40am this morning\n\nA policeman holds a knife as colleagues detain a man opposite Buckingham Palace just before the Changing of the Guard ceremony today\n\nThe Changing of the Guard at Buckingham Palace was cancelled along with public tours of the Palace of Westminster.Police escort members of the Household Cavalry along the Mall in central London this morning\n\nThere was also a heightened Police Scotland presence at Edinburgh Airport this morning (pictured) following the terrorist attack at Manchester Arena\n\nArmed police were today seen at Glasgow Central Station following the attack on Manchester Arena. Police Scotland and the Scottish Government have confirmed that following several meetings security would be stepped up at transport hubs\n\nHOW SECURITY SERVICES HANDLE RETURNING FIGHTERS When foreign fighters are detected returning to Britain, security services assess whether they have genuinely repudiated ISIS or remain a hardline fanatic. Where there is clear evidence against the individual in question, they can be prosecuted in the UK. Foreign nationals can be prevented from coming back into the country, and duel nationals can be stripped of British citizenship. For UK citizens, there are temporary exclusion orders, which make it unlawful for the subject to return unless they agree to conditions. Terrorism Prevention and Investigation Measures (Tpims) can be imposed, involving restrictions including relocation and electronic monitoring. In addition to those returning from jihad, MI5 and police must also deal with the issue of people who have been blocked from going to conflict zones. Around 150 attempted journeys to Iraq and Syria were thwarted in 2015.\n\nBorn in Manchester in 1994, the third of four children, Salman's parents were Libyan refugees who came to the UK to escape the Gaddafi regime and his father is a suspected fighter who left the UK in 2011 to try to overthrow the Libyan leader.\n\nRamadan Abedi, an airport security officer who is thought to have worked at Manchester Airport, emigrated to London with his wife Samia Tabbal, 50, before moving to the Fallowfield area of south Manchester where they settled in a housing association-owned home about two miles from the scene of Monday night's terror attack.\n\nFriends and neighbours said Abedi appeared to be a normal football-mad teenager who was a massive Manchester United fan and spent hours playing computer games on the PS4.\n\nBut everything changed in 2011 when his father abruptly left his job and home in the anonymous suburb to fight in Libya, leaving his family to fend for themselves, according to a local imam.\n\nAbedi and his brothers appear to have followed in his footsteps by sharing stories of British jihadis fighting in Syria on social networks and even praying in the street.\n\nWithin hours of the attack carried out by Abedi, police arrested his brother Ismail, 23, outside a Morrison's in Chorlton, Manchester and they are continuing to quiz him on suspicion of involvement in the bombing.\n\nThe IT manager, who is married to a maths teacher, worked for Park Cake Bakeries in Oldham until January. It is believed that Ismail, who worked as a teaching assistant giving Arabic classes and IT support at Didsbury mosque Quran school, was once reported to a counter- terrorism unit after concerns were raised by members of the Muslim community.\n\nAbedi and his family were well known at their Didsbury Mosque just a few minutes' drive away from their modest £150,000 home.\n\nLast night a source suggested anti-terror officers also tried to engage with Abedi, but he refused to co-operate. 'Salman Abedi is a troublemaker, that is the understanding we have from the community,' he said. 'He is a loose cannon, someone who is troubled.'\n\nOne neighbour claimed they heard Abedi chanting Islamic prayers at the home just weeks before the concert hall atrocity.\n\nAbedi is thought to have attended multiple schools in Manchester Claremont Primary School including Burnage Academy, William Hulme and Stretford Grammar School.\n\nLeon Hall, who went to school with Abedi, told MailOnline he saw the killer last year and said he had grown a beard. He also said the jihadist was a keen Manchester United fan.\n\nOlivia Campbell's mother Charlotte confirmed early this morning that her daughter had died in the attack at the Manchester Arena on Monday night\n\nCharlotte Campbell appeared on TV yesterday appealing for information, but tragically confirmed early this morning that Olivia had died in the suicide attack in Manchester\n\nYesterday Sasha Howe posted a picture of her mother Alison Howe (right) and friend Lisa Lees (right), who were caught in the fatal blast outside the arena on Monday\n\nMegan Hurley died in last night's attack after watching singer Ariana Grande at the Manchester Arena, while her brother Bradley was injured\n\nMr Hall said: 'I saw him last year and he had a beard thing going on. We didn't speak but just nodded to each other. I don't remember seeing him with beard before.\n\n'He always had a bit of an attitude problem. I can't say I really liked the man.'\n\nHe added: 'I saw him last year and he had a beard thing going on. We didn't speak but just nodded to each other. I don't remember seeing him with beard before.'\n\nMr Hall said they grew up playing together on the street around their home.\n\n'He and I had a tussle many years ago when we were kids. It was over nothing, but he always had a bit of an attitude problem. I can't say I really liked the man.'\n\nHe went on to study at Salford University. A spokesman said: 'He was completely off the radar. He turned up for lectures for two years and then just stopped coming.\n\n'He was living at home, so he was very much not living the student experience.\n\n'He was not known to the university Islamic society.'\n\nThe source said Abedi began his business and management course in 2014 and attended lectures for two years but then stopped going.\n\nHe would have graduated this summer.\n\nLast night one friend of Abedi's said it was 'crazy' to consider what he had done.\n\nFew suspected that Abedi, a slightly withdrawn, devout young man, always respectful to his elders, would become a mass murderer.\n\nOne friend said: 'His parents are in Libya at the moment, they seem to go backwards and forwards a lot. I'm shocked.\n\n'It's crazy to think he could do this, he didn't show any outward signs of being radicalised.\n\n'I had noticed him being a bit more religious perhaps of late, going to the mosque more to pray and walking his little brother to school, being a bit more responsible.\n\n'But nothing to suggest he could do something so terrible.'\n\nThis graphic shows where the explosion took place, in the foyer area, leading towards Victoria railway station\n\nThis photo shows the aftermath of the suicide bomb which ripped through the foyer of the venue killing parents and children\n\nA man is pictured wrapped in foil and bleeding from a head wound after being caught up in the explosion at the Manchester gig\n\nA policewoman comforted a young girl following the terrorist attack at Manchester Arena on Monday night\n\nA 16-year-old cousin of Abedi's who lives near the family house said: 'He went to Libya two months ago. We go every summer.\n\n'I don't really believe it [that he carried out the attack]. I know him and I know what type of person he is. He's a nice guy, we play [war videogame] Battlefield on the PS4.'\n\nLast night neighbours described their shock as police carried out a controlled explosion at Salman's home in the Fallowfield area of south Manchester following a dramatic raid by dozens of officers on the red-brick semi.\n\nNeville Edwards, who lives near the house where the controlled explosion was carried out, said his mother's house in the next street was shaken by the blast.\n\n'She felt the ground beneath her shake. She was absolutely terrified.'\n\nDebbie Smith, 53, a chef who lives opposite the Abedi house, said: 'I was here when the police blew the door, it was loud.\n\n'I had just turned a television programme on, it was about 12pm. It sounded like they were blowing my own door in.\n\nTwin pupils, aspiring medical students Zahra (right) and Salma (left) Halane, left their homes in Manchester and moved to ISIS-controlled Syria\n\nAbedi is believed to have been friends with Raphael Hostey (pictured), also known as Abu Qaqa al-Britani, who served as an ISIS recruiter until he was killed in 2016 in Syria by a drone strike\n\n'It went boom! It was frightening after what happened last night, it frightened the life out of my dog.\n\n'The Abedi family have lived here a long time. At one point when Gaddafi got killed they put a massive flag on the roof of their house, the police had to come to tell them to take it down. I think they were glad he was dead.\n\n'We never had any problems with the family. They seemed quite Western, they wore Western clothes.\n\n'The men sometimes wore those long shirts on holidays, the women didn't wear veils, just headscarves. It's frightening to think that we have been living opposite a suicide bomber.'\n\nForensics officer were seen emerging from the killer's property carrying a booklet called Know Your Chemicals.\n\nNeighbour Lina Ahmed, 21, said Abedi had been seen in the street chanting.\n\n'They are a Libyan family and he has been acting strangely. A couple of months ago he [Abedi] was chanting the first kalma [Islamic prayer] really loudly in the street. He was chanting in Arabic.\n\n'He was saying 'There is only one God and the prophet Mohammed is his messenger'.'\n\nAbedi's younger brother Hashim, now 20, has posted comments on ISIS- supporting sites.\n\nHe showed an interest in Reyaad Khan, the Welsh jihadi killed in a drone strike, and commented on a newspaper article when Khan's mother appealed for her son to come home in 2014 before he was killed.\n\nA timeline of how the terror unfolded in Manchester Manchester Arena braced for the performance of Ariana Grande 6pm: Doors open at Manchester Arena in the north of the city centre. US pop singer Ariana Grande is on the bill for a sell-out concert. Fans, many of them teenage girls, excitedly share selfies as they wait for the show to begin. The 21,000-capacity venue, which is the biggest indoor arena in the UK and the second larges in Europe, was sold out. 7.30pm: The show gets underway with a support act BIA, an American rapper, taking the stage. Fans wait patiently for the main event - American superstar Ariana Grande. 9pm: Ariana Grande arrives on stage to the delight of the thousands of fans who have travelled the globe to watch her perform her hits which include Problem, Bang Bang and Break Free. 10.30pm: The star leaves the show and thousands of gleeful fans begin to file out of the arena's four exits. With the huge venue only half-empty, the horrifying sound of the booming bomb reverberates around the arena. Witnesses describe being knocked from their feet by an explosion and seeing dozens of injured, possibly dead, people including children lying on the floor. Others describe panic as concert-goers run for exits. 10.33pm: Greater Manchester Police (GMP) are called to reports of an explosion at Manchester Arena. Dozens of emergency services vehicles stream into the area and the emergency is confirmed two minutes later. 10.46pm: The North West Ambulance Service are called to the scene. They send 60 ambulances to Manchester Arena where victims have been maimed with shrapnel including nails and metal nuts from a bomb. This photo shows the aftermath of the suicide bomb which ripped through the foyer of the venue killing parents and children The bomber is believed to have entered a foyer area of the venue through doors opened to allow young music fans to leave 10.55pm: Police urge people to stay away from the area as responders deal with a 'serious incident'. A huge police cordon is set up surrounding the building and roads are closed to the public as fans flee the massacre. 11.46pm: Police confirm there have been a number fatalities, but cannot confirm the figure. Tuesday 1.10am: Nineteen people are confirmed dead and around 50 others injured following the suspected explosion police say is being treated as a terrorist incident. 1.35am: A controlled explosion is carried out on a suspicious item in the Cathedral Gardens area near Manchester Arena. It is later confirmed to be abandoned clothing. Bloodied concertgoers were pictured being helped by armed police outside the arena after explosions rang out at the gig 2.15am: Prime Minister Theresa May says her thoughts are with the victims and families of those affected in 'what is being treated by the police as an appalling terrorist attack'. 3.51am: Shortly before 4am Ariana Grande tweets that she is 'broken', adding: 'From the bottom of my heart, I am so so sorry.' 7am: GMP Chief Constable Ian Hopkins gives a statement. He says the death toll has risen to 22, including children, with 59 injured. He confirms police are treating the attack as a terrorist incident and believe it was carried out by a suicide bomber detonating an improvised explosive device. 9.02am: US President Donald Trump expresses his 'deepest condolences' and calls those responsible 'evil losers'. 9.30am: The first victim of the atrocity is named as Georgina Callander. Miss Callander, 18, had posted a picture of herself with Ariana Grande at the same venue two years ago, captioning it: 'My meet and greet photos came through, she was so cute and lovely, I hugged her so tight and she said she loved my bow. I can't get over this, I never will.' 10.30am: GMP says it has arrested a 23-year-old man in South Manchester in connection with the incident. Footage shows officers leading the handcuffed 23-year-old to a police van outside a Morrisons supermarket in Chorlton-Cum-Hardy, south Manchester at about 10.30am this morning. Witnesses said the man was ordered to 'get on the ground' and that he was seen smiling at one point as a team of officers, who had arrived in a black Mercedes, made the arrest. Armed officers arrested a man in south Manchester today with police saying the action was linked to the attack 11am: After chairing a Cobra meeting, Mrs May says the attacker has been identified by security services, but does not release details. She says the 'callous' attack was 'among the worst terrorism we have experienced in the United Kingdom'. 11.30am: The ambulance service confirm the number of people injured has reached at least 119. Of those hurt, 59 were taken to eight different hospitals in the Manchester area while around 60 were treated at the scene as walking wounded. The trust's chief executive Derek Cartwright admitted nothing could prepare his staff for a moment like this. 12.12pm: The Queen releases a statement expressing her 'deepest sympathy' to all those affected by the explosion, adding that the whole nation had been shocked by the 'death and injury'. 12.41pm: Islamic State claims responsibility for the atrocity. The extremists were quick to call the killer one of their soldiers, as has become the trend in the wake of many recent attacks in Europe. According to the SITE Intel Group, which monitors jihadist groups, the IS statement described the explosion as having taken place at a 'shameless concert arena'. Eight-year-old Saffie Rose Roussos (left), 18-year-old Georgina Callander (right) and 26-year-old John Atkinson have been named as three of the 22 victims of the suicide bombing. It is feared many children are among those killed, as well as parents who had accompanied their youngsters to the concert or were picking them up 1.37pm: Saffie Roussos, 8, is confirmed as the youngest named victim of the terror attack. She has been described as 'simply beautiful'. Chris Upton, the headteacher of her school, Tarleton Community Primary, said: 'The thought that anyone could go out to a concert and not come home is heartbreaking.' Minutes later, the third victim was named - 26-year-old John Atkinson from Radcliffe who was leaving the concert. Friends and family have paid their respects online, describing him as an 'amazing young man'. 2.02pm: GMP say they have executed warrants at addresses in Whalley Range, and one in Fallowfield where they carried out a controlled explosion. 4.30pm: Attacker named as Salman Abedi. Abedi, a 23-year-old British man of Libyan origin, detonated a deadly explosive that ripped through crowds leaving an Ariana Grande concert at 10.30pm. Police are trying to determine whether Abedi acted alone or was part of a wider terror cell.\n\nHisham wrote: 'Inshallah we go together, man.'\n\nAbedi's sister Jomana, 18, attended the school in Whalley Range that hit the headlines in 2015 when twin pupils, aspiring medical students Zahra and Salma Halane, left their homes and moved to ISIS-controlled Syria after being recruited by Hostey.\n\nLast night counter-terror police, assisted by MI5, were urgently piecing together the bomber's background to see whether he had any help in planning the outrage.\n\nPolice are understood to have recovered CCTV video of the attacker walking into Manchester Arena where he detonated a bomb.\n\nIt shows the explosion was deliberate and caused by a device that may have been contained in a bag, a source said.\n\nThe device is described as homemade and crude, but stable enough to be transported and explode with devastating effect. It is believed to have been constructed in Britain.\n\nThe attacker, who struck on the fourth anniversary of the killing of Fusilier Lee Rigby in Woolwich, south-east London, was carrying an identity document on him, sources said.", "images": ["https://i.dailymail.co.uk/1s/2020/04/17/11/27312524-0-image-a-19_1587118046208.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BC803F00000578-4536624-image-a-6_1495626079311.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40AEC39600000578-4536624-A_man_is_pictured_wrapped_in_foil_and_bleeding_from_a_head_wound-a-24_1495665573944.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/18/27283520-0-image-a-13_1587059349556.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/17/40BF874200000578-0-image-m-323_1495643217274.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B2BBF100000578-4536624-A_policewoman_comforted_a_young_girl_following_the_terrorist_att-a-25_1495665573945.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B2C41200000578-4536624-image-a-31_1495665574580.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/22/40C2518000000578-4536624-image-a-27_1495660028060.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/21/40C07FA800000578-4538814-The_22_year_old_suicide_bomber_appeared_to_have_carried_a_powerf-a-45_1495656492365.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/15/27321548-0-image-a-37_1587134123891.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BBFBB600000578-4536624-image-a-127_1495621718578.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC580E00000578-4536624-Officers_were_seen_entering_and_leaving_the_building_this_mornin-a-5_1495665571483.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B4A83A00000578-4536624-This_image_believed_to_be_of_victim_John_Atkinson_pictured_left_-a-89_1495619081276.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40AF095D00000578-4536624-This_graphic_shows_where_the_explosion_took_place_in_the_foyer_a-a-21_1495665573918.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BD028700000578-4536624-image-a-181_1495624376107.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/08/0CEC7273000005DC-0-image-m-3_1495609625939.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BC345800000578-4536624-image-m-110_1495620113352.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40AE5D7200000578-4536624-Manchester_Arena_braced_for_the_performance_of_Ariana_Grande-a-27_1495665574380.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B0BC4D00000578-4536624-Olivia_Campbell_s_distraught_mother_confirmed_that_the_15_year_o-a-95_1495619081482.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/17/40BFC87A00000578-4538296-Undercover_armed_police_are_said_to_have_tackled_a_man_to_the_fl-a-2_1495644813164.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B30CD300000578-4536624-It_was_confirmed_this_morning_that_Polish_couple_Marcin_and_Ange-a-96_1495619081583.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/22/27291142-0-image-a-6_1587071794438.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B0CF2800000578-4536624-Another_victim_Martyn_Hett_from_Stockport_was_due_to_fly_to_Amer-a-3_1495665571145.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B2D28700000578-4536624-Armed_officers_arrested_a_man_in_south_Manchester_today_with_pol-a-33_1495665574871.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/10/27348844-0-image-a-6_1587203459353.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316454-0-image-a-18_1587125714890.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/16/40BEE9B500000578-4536624-image-m-20_1495641017357.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B18E7100000578-4536624-image-a-23_1495665573922.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BD067000000578-0-image-a-74_1495626925553.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2017/05/24/21/40C07FC400000578-4538814-A_small_handheld_a_small_detonator_was_used_to_explode_the_bomb_-a-44_1495656492365.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/2128CF3F00000578-4536624-Twin_pupils_aspiring_medical_students_Zahra_pictured_and_Salma_H-a-28_1495665574382.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/19/40C0D3CF00000578-4536624-image-m-21_1495651459775.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/19/40C0E25C00000578-0-image-a-24_1495651519613.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/16/40BF1E1600000578-4536624-image-a-6_1495638695376.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B1A0D900000578-4536624-The_first_victim_of_the_Manchester_terror_attack_has_been_named_-a-90_1495619081296.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC8BB400000578-4536624-The_Changing_of_the_Guard_at_Buckingham_Palace_was_cancelled_alo-a-14_1495665572795.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B1806E00000578-4536624-image-a-92_1495619081325.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BCE3F100000578-4536624-A_policeman_holds_a_knife_as_colleagues_detain_a_man_opposite_Bu-a-13_1495665572533.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B4BD4200000578-4536624-John_Atkinson_26_has_been_named_as_three_of_the_22_victims_of_th-a-36_1495665575040.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BE619700000578-4536624-Jane_Tweddle_Taylor_pictured_a_school_receptionist_was_enjoying_-a-1_1495665571143.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC326200000578-4536624-Police_were_also_guarding_a_block_of_flats_in_South_Manchester_t-a-8_1495665571948.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BD194C00000578-4536624-image-a-3_1495626019682.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/16/40BF052900000578-4536624-image-a-9_1495638849737.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BCCB5A00000578-4536624-image-a-174_1495624016369.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BCAE3F00000578-4536624-Security_was_on_high_alert_around_Buckingham_Palace_today_and_po-a-11_1495665572243.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B18C4300000578-4536624-image-a-91_1495619081312.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B1801200000578-4536624-Another_victim_of_the_terror_attack_has_been_named_locally_as_18-a-34_1495665574872.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BB8EF100000578-4536624-image-a-123_1495621703042.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B0B89800000578-4536624-image-a-32_1495665574621.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B24CBE00000578-4536624-Charlotte_Campbell_appeared_on_TV_yesterday_appealing_for_inform-a-18_1495665573405.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/09/27348120-0-image-a-6_1587200255933.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BC8EFE00000578-4536624-image-a-135_1495621954428.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BCC68900000578-4536624-image-a-178_1495624156227.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BCA9FE00000578-4536624-Pictures_show_a_man_surrounded_by_officers_and_handcuffed_as_he_-a-12_1495665572527.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B259B100000578-4536624-Yesterday_Sasha_Howe_posted_a_picture_of_her_mother_Alison_Howe_-a-19_1495665573480.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC17DC00000578-4536624-A_huge_number_of_police_including_armed_officers_carried_out_a_r-a-10_1495665572087.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BBFAD600000578-4536624-image-a-120_1495621606704.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/18/40C057AA00000578-4536624-image-a-15_1495647419209.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/15/40BED0E100000578-4536624-image-a-2_1495635888285.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27331384-0-image-a-22_1587150056520.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC2B7200000578-4536624-Police_were_standing_outside_Abedi_s_house_in_Fallowfield_this_m-a-6_1495665571502.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B3F53F00000578-4536624-Nell_Jones-a-2_1495665571144.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BCB17200000578-4536624-Hours_before_she_was_due_to_attend_the_concert_Michelle_Kiss_pos-a-7_1495665571851.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BCBC4100000578-4536624-image-a-155_1495623110192.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/22/40C07FC800000578-4536624-Investigators_found_a_destroyed_Yuasa_12_volt_2_1_amp_lead_acid_-a-28_1495660147629.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/1F81B79700000578-4536624-Twin_pupils_aspiring_medical_students_Zahra_and_Salma_pictured_H-a-26_1495665573973.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BBF93600000578-4536624-image-a-29_1495665574551.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/13/40BDA6CB00000578-4536624-image-m-15_1495629142533.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/14/40BDBC8000000578-4536624-image-a-16_1495631188040.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/18/40C0216F00000578-4536624-Hashem_Abedi_20_the_younger_brother_of_Manchester_suicide_bomber-m-17_1495647460828.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BCAF4E00000578-4536624-Armed_police_were_today_seen_at_Glasgow_Central_Station_followin-a-16_1495665573135.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/21/40C07FB000000578-4538814-Analysis_of_where_people_fell_shows_that_most_of_the_fatalities_-a-42_1495656492294.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC826D00000578-4536624-Family_and_friends_revealed_that_he_had_spent_the_last_few_days_-a-4_1495665571483.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/1s/2020/04/18/14/27352224-0-image-a-6_1587215607906.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B2BDFF00000578-4536624-Olivia_Campbell_s_mother_Charlotte_confirmed_early_this_morning_-a-17_1495665573144.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BBF93200000578-4536624-image-a-153_1495622942642.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B19ECC00000578-4536624-Saffie_Rose_Roussos_8_has_been_named_as_the_second_victim_of_the-a-94_1495619081467.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B3F6E000000578-4536624-The_bomber_is_believed_to_have_entered_a_foyer_area_of_the_venue-a-30_1495665574580.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC1E3500000578-4536624-There_was_also_a_heightened_Police_Scotland_presence_at_Edinburg-a-15_1495665573038.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BCC20300000578-4536624-image-a-164_1495623373179.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B18E7100000578-4536624-image-a-22_1495665573921.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/10/40B2580E00000578-4536624-Mothers_Lisa_Lees_left_and_Alison_Howe_right_were_killed_in_the_-a-93_1495619081363.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/11/40BC8F2500000578-4536624-image-a-132_1495621945256.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27298132-0-image-a-10_1587083448170.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/12/40BCD4BD00000578-4536624-image-a-177_1495624035390.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40BC6AD800000578-4536624-Police_were_still_on_the_scene_at_Salman_Abedi_s_home_in_Fallowf-a-9_1495665571964.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B19ECC00000578-4536624-Eight_year_old_Saffie_Rose_Roussos_from_Preston_was_killed_when_-a-35_1495665574873.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27332258-0-image-a-25_1587151978215.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/23/40B839DE00000578-4536624-Megan_Hurley_died_in_last_night_s_attack_after_watching_singer_A-a-20_1495665573590.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/07/video-27306022-770_154x115.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/24/18/40C0572E00000578-4536624-image-a-12_1495647412960.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/05/24/19/40C0E25C00000578-0-image-a-24_1495651519613.jpg", "keywords": [], "authors": ["Thomas Burrows", "Julian Robinson", "Jake Wallis Simons For Mailonline"], "canonical_link": "https://www.dailymail.co.uk/news/article-4536624/Salman-Abedi-known-security-services-point.html", "title": "Manchester bomber is linked to Brussels 'Man in the Hat'", "meta_data": {"keywords": "dailymail,news,Breaking News,ISIS,Manchester,Brussels Airport Explosions", "news_keywords": "dailymail,news,Breaking News,ISIS,Manchester,Brussels Airport Explosions", "original-source": "https://www.dailymail.co.uk/news/article-4536624/Salman-Abedi-known-security-services-point.html", "description": "Exclusive pictures show Salman Abedi as an innocent schoolboy, about seven years before he murdered 22 people, including children as young as eight, at Manchester Arena.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Manchester bomber sounded 'normal' 5 days ago, says his father", "description": "Exclusive pictures show Salman Abedi as an innocent schoolboy, about seven years before he murdered 22 people, including children as young as eight, at Manchester Arena.", "url": "https://www.dailymail.co.uk/news/article-4536624/Salman-Abedi-known-security-services-point.html", "image": "https://i.dailymail.co.uk/i/pix/2017/05/24/19/40C0E25C00000578-0-image-a-24_1495651519613.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4536624, "author": "Thomas Burrows", "divclasspage": "articlePage", "mol": {"headline": "Was bomber's family in global terror network? Killer returned to UK from Libya days before attack 'is linked to Man in the Hat Brussels bomber', his father 'was part of Al-Qaeda-linked group' and brother 'knew of atrocity and was planning own massacre'"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-05-24T08:12:54+0100", "modified_time": "2017-05-25T03:13:48+0100", "section": "News", "tag": "Salman Abedi known security services point", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Manchester bomber sounded 'normal' 5 days ago, says his father", "type": "article", "description": "Exclusive pictures show Salman Abedi as an innocent schoolboy, about seven years before he murdered 22 people, including children as young as eight, at Manchester Arena.", "url": "http://www.dailymail.co.uk/~/article-4536624/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/05/24/19/40C0E25C00000578-0-image-a-24_1495651519613.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2017/05/24/2947915855144701142/1024x576_MP4_2947915855144701142.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4536624/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4536624/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1495609974.0, "source": "https://www.dailymail.co.uk", "summary": ""}