{"url": "http://time.com/5161034/florida-school-shooting-survivor/", "text": "David Hogg, a senior at Marjory Stoneman Douglas High School, knows what gunshots sound like: His father worked in law enforcement, and taught him about weapons and how to handle them. So when Hogg heard a “pop” while sitting in an AP environmental science class around 2:30 p.m. Wednesday, he told his teacher it sounded strangely like a gunshot. But there had been a fire drill that very morning and talk of a “Code Red” exercise to prepare for an active shooter. This must just be a surprise drill, he reasoned.\n\nAnd then the fire alarm sounded. Dutifully acting on it, Hogg and other students tried to exit the building. A janitor—Hogg doesn’t know his name but calls him an angel—knew where the shots were coming from and sent the students back. Then a culinary arts teacher, Ashley Kurth, pulled Hogg and others inside, locked the door, and made them hide in a closet. Checking Twitter and Instagram, Hogg—who’s an editor at the school’s TV station—found the news that the shooting was real and ongoing.\n\nThe shots continued for what felt like an eternity. Hogg considered the possibility that he would not live to see the end of the day.\n\n“While I was in there, I thought, ‘What impact have I had? What will my story be if I die here?’” Hogg told TIME in the hours following the ordeal. “And the only thing I could think of was, pull out my camera and try telling others. As a student journalist, as an aspiring journalist, that’s all I could think: Get other people’s stories on tape. If we all die, the camera survives, and that’s how we get the message out there, about how we want change to be brought about.”\n\nIn the wake of Wednesday’s mass shooting, in which at least 17 were killed and more than a dozen others wounded, that cry for change is echoing across this normally quiet, almost bucolic Florida community of 30,000 on the edge of the Everglades, which draws residents seeking sprawling homes and room to run horses. It’s being heard across Broward County, whose sheriff, Scott Israel, is prodding Florida officials to provide more funding for mental health, as well as laws that would prevent a person with psychological problems from being able to legally acquire a gun. And it’s becoming a rallying cry for people here and across the U.S. who are wondering what, if anything, changes from one mass shooting to the next.\n\n“When do we say, that’s not acceptable, something has to change?” asked Hogg, 17, his voice breaking.\n\nHogg’s sister Lauren, a freshman at the high school, is fearing the worst: one of her friends had still not been located late Thursday. Nikolas Cruz, the suspect who has been charged with 17 counts of murder, had been expelled from the school a year ago and appears to have targeted a building full of ninth-graders.\n\nRELATED VIDEO: Florida Shooting Survivor Calls for Action\n\nWill Gilroy is one of the freshmen who escaped the gunman’s wrath. He is still waiting for word about classmates that haven’t been located. Like Hogg, Gilroy thought the shooting wasn’t real at first. But then he heard the sirens. He listened to his teacher’s orders and crowded into a closet with about 20 others. He was in there, he says, for about an hour.\n\n“It was hot in there. We were packed in tight,” he told TIME. “Some students were crying. The teacher had paper plates and we used them to fan ourselves.” Inside the closet Gilroy began texting with his mother, Kristi Gilroy, who teaches second and third grade in at Country Hills Elementary just down the road. She too was on lockdown, with kids who stayed for after-school ccare. She was relieved to know her only son was alive. But the shooter was still at large. Cruz was eventually caught just down the road from their house, trying to escape with the rest of the crowd.\n\n“My husband is ex-military, so it’s not like we’re anti-gun. But an AR-15?” Kristi Gilroy said. “You tell me, how big of a gun does a person need?” Douglas is closed for the rest of the week as teens and teachers struggle to make sense of the carnage. But Kristi Gilroy faces the difficult job of going back to school Thursday, waiting for news of the dead and injured, which might, she feared, include children she’d taught when they were younger.\n\nThe usual questions arose Thursday about whether it was too soon to talk about gun control. Some local officials seemed ready to toss out the oft-heard script, the prayers for families and praise for first responders. “Now, now is the time for this country to have a conversation about sensible gun control laws in this country,” Broward County School Superintendent Robert W. Runcie told reporters. “Our students are asking for that.”\n\nPresident Trump spoke Thursday morning, taking on the grim task of comforter-in-chief, but offering no specific proposals.\n\n“To every parent, teacher, and child who is hurting so badly, we are here for you, whatever you need, whatever we can do, to ease your pain,” Trump said. “We are all joined together as one American family, and your suffering is our burden also.”\n\nAttorney General Pam Bondi, speaking to reporters on Thursday, said that she’d been sitting with parents until 3:30 a.m. “Having to tell parents that a child, 14 years old, is dead, is the hardest thing you have to do in your career,” she said, her eyes full of tears.\n\nTo some, however, words of comfort won’t be enough. “When do we actually stand up? I think it’s the time that we all stand up,” Hogg demanded. “If you don’t call your Congressman and do it again and again and not give up, it’s going to be your child that’s next. And that’s horrifying.”\n\nMeanwhile, Parkland waits. Waits for the names of the innocent who were gunned down before they could graduate, or in some cases, finish the ninth grade. Waits for news of funeral arrangements for a beloved football coach and security guard. Waits to hear if the children still in the hospital pull will through. Waits for someone to convince their teenagers that it’s okay to go back to school, that they’re safe, and that nothing like this will happen again.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/wisconsin-doctor-killed.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2018/02/david-hogg-florida-school-shooting.jpg?quality=85&crop=0px%2C0px%2C1920px%2C1005px&resize=1200%2C628&strip", "https://api.time.com/wp-content/uploads/2020/04/crime-drop-coronavirus.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/04/CoronavirusFAQOpener.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/02/david-hogg-florida-school-shooting.jpg?quality=85&crop=0px%2C0px%2C1920px%2C1005px&resize=1200%2C628&strip", "keywords": [], "authors": ["Ilene Prusher Parkland"], "canonical_link": "https://time.com/5161034/florida-school-shooting-survivor/", "title": "Student Hasn't Stopped Filming Since Florida School Shooting", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "florida shooting, parkland shooting, shooting, parkland school, parkland high, parkland florida map, marjory stoneman douglas, marjory stoneman douglas shooting, active shooter florida school, Nikolas Cruz, nicolas cruz", "news_keywords": "florida shooting, parkland shooting, shooting, parkland school, parkland high, parkland florida map, marjory stoneman douglas, marjory stoneman douglas shooting, active shooter florida school, Nikolas Cruz, nicolas cruz", "description": "David Hogg, a student at Marjory Stoneman Douglas High School, is hoping his videos from the Florida school student sparks change.", "og": {"title": "A Student Started Filming During School Shooting. He Hasn't Stopped", "type": "article", "site_name": "Time", "url": "https://time.com/5161034/florida-school-shooting-survivor/", "description": "\"What impact have I had? What will my story be if I die here?\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/02/david-hogg-florida-school-shooting.jpg?quality=85&crop=0px%2C0px%2C1920px%2C1005px&resize=1200%2C628&strip", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5161034/florida-school-shooting-survivor/", "description": "David Hogg, a student at Marjory Stoneman Douglas High School, is hoping his videos from the Florida school student sparks change.", "media": "https://api.time.com/wp-content/uploads/2018/02/david-hogg-florida-school-shooting.jpg?quality=85&crop=0px%2C0px%2C1920px%2C1005px&resize=1200%2C628&strip"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5161034/florida-school-shooting-survivor/", "title": "A Student Started Filming During School Shooting. He Hasn't Stopped", "description": "\"What impact have I had? What will my story be if I die here?\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/02/david-hogg-florida-school-shooting.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}