{"url": "www.stuff.co.nz/entertainment/celebrities/84498433/how-will-brad-pitt-and-angelina-jolie-split-up-their-empire", "text": "There's one thing Hollywood couple Angelina Jolie and Brad Pitt liked to collect during their now-defunct decade long relationship. And no, it wasn't children.\n\nIt was houses. They currently own one for each child (six), with a spare for guests or their shoes or whatever you need a seventh home for.\n\nThe couple brought significant assets to the union and have only added more, including a charity which was responsible for helping rebuild in New Orleans after Hurricane Katrina, giving them a combined net worth of about US$400 million (NZ$547m).\n\nStuart C Wilson/Getty Images Angelina Jolie and Brad Pitt in happier times.\n\nSo now that their love is kaput, who gets which palatial abode? Who'll take over the foundation? And more importantly, who gets their ridiculous English Bulldog and renowned Johnny Depp leg-humper, Jacques?\n\n\n\nREAD MORE:\n\n* Angelina Jolie files for divorce from Brad Pitt\n\n* Brangelina split: The end of a Hollywood dream?\n\n* Brangelina's children: Who are the Jolie-Pitt brood?\n\n* Brangelina: Key moments in the Hollywood romance\n\n* Jennifer Aniston memes flood in after Brangelina split\n\n* Jon Voight comments on estranged daughter's divorce\n\n* How Angelina Jolie and Brad Pitt raise their six children\n\n* Angelina Jolie's divorce custody terms an 'insult': lawyer\n\n* Marion Cotillard 'devastated' by claims she's behind split\n\n\n\nTHE HOUSES\n\nSPLASH NEWS An aerial view of the Craftsman style home the Jolie-Pitts called home. Brad lived there with Jennifer Aniston during their marriage - but will he give it up for Angelina Jolie and the kids?\n\nThe Jolie-Pitts have seven houses in various spots around the world, but the family home is a sprawling Craftsman style home in Los Feliz, Los Angeles, that Brad Pitt had previously lived in with jilted ex-wife, Jennifer Aniston.\n\nWhile his prior ownership of the home might suggest Pitt will keep the home in this divorce too, it's been extensively remodelled for the kids and now includes a huge swimming pool, park land, and an area for dirtbike-riding – something his son Maddox enjoys.\n\nMaybe Angie will want to keep things as normal as possible for her brood in the Los Feliz house, or perhaps she'll want to ship them out to France – her ancestral and spiritual home – where the couple owns the frankly enormous Chateau Miraval.\n\nPHILIPPE LAURENSON/REUTERS An aerial view of the 17th-century Chateau Miraval, the US$60m estate which is owned by actors Brad Pitt and Angelina Jolie.\n\nCosting about US$60m and boasting a 30-acre vineyard (famous for a rose called \"Pink Floyd\") and 35 bedrooms (just how many kids did these guys want?), Pitt and Jolie were married in the chateau's chapel in August, 2014.\n\nSo, maybe it won't be high on Jolie's list of places to lie low until the news cycle has rolled over them. Perhaps the beach then if it's privacy the divorcees are after?\n\nThat's doable, since the pair have what passes for a bach in Hollywood up the coast in Santa Barbara. It comes with 11 acres of land around it and a private beach in front of it, for max seclusion.\n\nPHILIPPE LAURENSON/REUTERS An aerial view of the 17th-century Chateau Miraval.\n\nPitt bought it in 2000 for US$4m, in recent years the family has used it mainly as a holiday home. But maybe he'll head up there to lick his wounds?\n\nPitt's also the reluctant owner of a villa in New Orleans that he's been trying to offload since 2015.\n\nThe pair bought the five-bed-five-bath home to live in while Pitt was in Nola filming The Curious Case of Benjamin Button. It's on the market now for the bargain basement price of US$5.5m.\n\nRay Tamarra Brad Pitt greets a friend from his New Orleans balcony on May 17, 2014 in New Orleans.\n\nThen there's also Jolie's Laurel Canyon home, and an apartment in New York's Waldorf Astoria building.\n\n\n\nTHE FOUNDATION\n\nThe pair started the Jolie-Pitt Foundation together in 2006. However it seems most likely to be Jolie who'll take over the running of the charity.\n\nThe Foundation has donated to various causes including the Hurricane Katrina and Joplin tornado rebuilds; children's health centres in Ethiopia and Cambodia; the Na'an ku se Foundation in Namibia; GlobaL Action for Children; the HALO Trust and Doctors Without Borders.\n\nBut it's Jolie who puts her money (and her time) where her mouth is most often as a UN Goodwill ambassador, Jean Hersholt Humanitarian Award winner and vocal crusader for children and women.\n\n\n\nTHE FILM COMPANY\n\nPlan B Entertainment was the brainchild of Brad Pitt and Jennifer Aniston, that Brad took custody of in the divorce.\n\nTo date, it's been responsible for a huge range of films, from gritty horror World War Z to Oscar-winning marvels Selma and 12 Years a Slave.\n\nPitt is the sole owner of the company, but could Jolie angle for a piece of that cinematic pie in the settlement?\n\n\n\nTHE DOG\n\nJacques must be getting on in years. While he was often papped out and about with the Jolie Pitt kids, he's not been spotted out a lot lately.\n\nBut if the baggy-faced mutt is still kicking round, this picture of Jacques with Brad from 2012 should clear up who the old growler belongs to.", "images": ["https://resources.stuff.co.nz/content/dam/images/1/e/b/6/b/d/image.related.StuffLandscapeSixteenByNine.1420x800.1eb3ep.png/1474431198668.jpg", "https://secure-nz.imrworldwide.com/cgi-bin/m?ci=nz-stuff&cg=0&cc=1&ts=noscript"], "top_img": "https://resources.stuff.co.nz/content/dam/images/1/e/b/6/b/d/image.related.StuffLandscapeSixteenByNine.1420x800.1eb3ep.png/1474431198668.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.stuff.co.nz/entertainment/celebrities/84498433/how-will-brad-pitt-and-angelina-jolie-split-up-their-empire", "title": "How will Brad Pitt and Angelina Jolie split up their empire?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "format-detection": "telephone=no", "fb": {"app_id": 207633159308175, "pages": 21253884267}, "verify-v1": "RazNiYjuvNuEsMeFXxfR9l9cDZIKxcq2VjQZA25CHgM=", "msapplication-config": "/sics-assets/images/favicons/browserconfig.xml", "theme-color": "#ffffff", "description": "There are seven houses, a charity foundation and a production company in the mix of assets. But who gets to keep the dog?", "source": "Stuff", "og": {"description": "There are seven houses, a charity foundation and a production company in the mix of assets. But who gets to keep the dog?", "title": "How will Brad Pitt and Angelina Jolie split up their empire?", "url": "https://www.stuff.co.nz/entertainment/celebrities/84498433/how-will-brad-pitt-and-angelina-jolie-split-up-their-empire", "type": "article", "image": "https://resources.stuff.co.nz/content/dam/images/1/e/b/6/b/d/image.related.StuffLandscapeSixteenByNine.1420x800.1eb3ep.png/1474431198668.jpg", "site_name": "Stuff"}}, "movies": [], "publish_date": null, "source": "http://www.stuff.co.nz", "summary": ""}