{"url": "www.yourtango.com/2018315542/are-demi-moore-and-ed-helms-dating-new-details-on-their-rumored-secret-relationship", "text": "It's a nice change from her usual cougar ways.\n\nWe know him as part of the hilarious trio from the Hangover movies, and Andy on The Office. And we know her as the beauty from Ghost, Striptease, and the cougar who married a man 15 years younger! We’re talking, of course, about Ed Helms and Demi Moore.\n\nBut are the two an item? Are Demi Moore and Ed Helms dating? According to some sources, yes! Which is good, because he’s more age-appropriate for her (finally).\n\nA post shared by Mr. Marc Kelly (@mrmarckelly) on Jun 13, 2018 at 1:55pm PDT\n\nThe two met while filming the movie Corporate Animals, which is scheduled to premiere in 2019. Though Helms, 44, has never been married, Moore, 55, has been married three times. Her first marriage was to rock musician Freddy Moore (who was 12 years older), her second was to actor and hottie Bruce Willis, and her third was to Ashton Kutcher.\n\nShe and Kutcher divorced in 2013, and she hasn’t been linked to anyone her age since then. After her divorce, it was rumored she was dating an art dealer named Vito Schnabel, and then a musician named Sean Friday. And (surprise!) both were 24 years younger than her.\n\nIt was also reported she had an affair with restaurateur Harry Morton (19 years younger than her), after he dated her daughter Rumer! Even crazier, she and Rumer apparently fought over the attention of Rumer’s Dancing with the Stars partner, Val Chmerkovskiy, who is 32.\n\nFor a long time, it seems that Moore hasn’t been able to escape the allure of younger men and it's caused friction in her relationship with her firstborn daughter, Rumer. A friend was quoted as saying, “It gets complicated between them. Demi is still a gorgeous woman and goes for younger guys who are right in her daughter’s age group.”\n\nA post shared by Ed Helms (@edhelms) on May 27, 2018 at 12:59pm PDT\n\nBut could it be that she’s finally found love again? According to one insider, “Ed is handsome and hilarious. But most importantly, he’s somebody Demi can actually relate to. Demi is starting to understand dating younger guys isn’t something that has a good long-term prognosis. Ed may be 11 years younger than Demi, but he’s a lot more mature than the other guys she’s been failing with.”\n\nIt’s good to hear she’s finally getting along with a man who is mature and closer to her in age. It’s no wonder she has many offers from men, given her incredible beauty and talent, but it seems like she’s more interested in something serious that will last.\n\n“Demi still gets a lot of interest from a lot of guys,” a family friend said. “But she doesn’t believe she’s got to prove anything by hooking up with guys so much younger than her any longer. She and Ed have a lot in common, and they can communicate more easily than talking with a guy who could more easily be her kid than her partner. Demi’s hoping that her time with Ed can be lasting, and that she can have more fun with a grown-up.”\n\nHallelujah! If the rumors are true, we hope their newfound romance brings them both happiness, and actually lasts this time.\n\nA post shared by Jess/Mol/Etc Fanpage (@badasswarriors) on Jul 17, 2018 at 3:15am PDT\n\nSamantha Maffucci is an associate editor for YourTango. In her free time, you can find her obsessing about cats, wine, and all things Vanderpump Rules.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/unnamed_26.png?itok=fCrk1j_b", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/unnamed_26.png?itok=VNTceU1m"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/unnamed_26.png?itok=VNTceU1m", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018315542/are-demi-moore-and-ed-helms-dating-new-details-on-their-rumored-secret-relationship", "title": "Are Demi Moore And Ed Helms Dating? New Details On Their Rumored Secret Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Single, Taken, Demi Moore, ed helms, Bruce Willis, ashton Kutcher, Rumer willis, Relationships, corporate animals, Love", "article": {"author": "https://www.yourtango.com/users/samantha-maffucci", "published_time": "2018-07-25T17:34:36", "modified_time": "2018-07-25T17:34:36"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018315542/are-demi-moore-and-ed-helms-dating-new-details-on-their-rumored-secret-relationship", "title": "Are Demi Moore And Ed Helms Dating? New Details On Their Rumored Secret Relationship", "description": "It's a nice change from her usual cougar ways.", "updated_time": "2018-07-25T17:34:36", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/unnamed_26.png?itok=VNTceU1m", "width": 620, "height": 309}}, "description": "Are Demi Moore and Ed Helms dating? After meeting on the set of the upcoming movie Corporate Animals, friends and sources are expressing content that the actress is finally with someone age appropriate.", "abstract": "We know him as part of the hilarious trio from the Hangover movies, and Andy on The Office. And we know her as the beauty from Ghost, Striptease,", "robots": "follow, index, noodp, noydir", "news_keywords": "are demi moore and ed helms dating, demi moore and ed helms, demi moore dating ed helms, demi moore, ed helms, demi moore boyfriend, who is demi moore dating, demi moore ed helms, demi moore guy from office, ed helms girlfriend", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018315542/are-demi-moore-and-ed-helms-dating-new-details-on-their-rumored-secret-relationship", "title": "Are Demi Moore And Ed Helms Dating? New Details On Their Rumored Secret Relationship", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/unnamed_26.png?itok=VNTceU1m", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/I47-AfkLGg4"], "publish_date": 1532511276.0, "source": "http://www.yourtango.com", "summary": ""}