{"url": "www.newidea.com.au/camilla-duchess-of-cornwall-secret-plot-against-meghan-markle-exposed", "text": "But now in a dramatic turn of events, New Idea can exclusively reveal that there is one royal insider who is delighted by the scathing comment.\n\nAccording to palace insiders, Germaine’s close pal the Duchess of Cornwall has been plotting against the pair.\n\n‘The truth is that Camilla and Germaine have become very close allies in recent months – and dangerous ones, too,’ says a palace source. ‘They’ve always been acquaintances, but recently they’ve become close friends and Camilla has certainly used Germaine as a sounding board for all her grievances about the royal family – and in particular Harry and Meghan’s wedding.’\n\nIt’s widely known that the Duchess of Cornwall is no fan of the American actress and is said to believe Meghan is just there to enhance her public profile.\n\n‘Camilla has made no secret in tight royal circles of her displeasure about the relationship, believing that Meghan isn’t good enough for the palace – and that she’s just in it for fame, and little else,’ confirms the source.\n\n‘She and Germaine have spoken at some length about their disapproval of the relationship and their feelings that the marriage simply won’t last.’\n\nIt appears that Camilla’s now revelling in the scandal and disunity ahead of the muchawaited royal wedding.\n\n‘Camilla loves the idea of the cat being set amongst the pigeons so close to the wedding date and creating a bit of controversy. She’s always been the source of so much scandal and negativity in the royal family – and she is happy to see Meghan cop a bit of it now.\n\n‘Germaine’s big interview was perfect timing, and Camilla couldn’t be happier with all the drama and headlines it’s caused so close to the royal wedding.’\n\nThe 70-year-old duchess was recently sent home early from Australia by her husband Prince Charles, and this latest muckraking move is said to be Camilla’s way of a counterblow.\n\n‘Camilla was also very miffed that she was sent home by Charles so swiftly, and so Germaine speaking out against Meghan gave her a good deal of comfort,’ says the source.\n\n‘She felt humiliated when Charles sent her packing on their Australian tour and wanted to inflict her own dose of payback on the royals.\n\n‘Maybe Charles – and indeed anyone else – will think again before crossing her.’\n\nThis is not the first time Camilla’s cattiness has been exposed.\n\nLast year insiders told New Idea that Meghan and Harry were forced to postpone their engagement announcement due to Camilla’s troublemaking.\n\nAccording to the insider, Camilla insisted at least 14 key palace staff were made to resign, which threw all the wedding preparations into disarray.\n\nThe scandal led Harry to tell Camilla to back off in a heated exchange between him and his stepmother.\n\n‘Harry is simply not going to put up with Camilla treating his bride or his relationship with anything other than respect,’ says the palace insider.\n\n‘All Harry wants to do is get on with married life with Meghan, but all these obstacles keep on popping up and he feels Camilla is to blame.’\n\n‘The place is in turmoil and the mood is getting steadily worse,’ a source told The Sun.Palace sources told New Idea that all fingers of blame are being pointed at Camilla, who ‘uses the staff 24/7’ and doesn’t care about throwing Wills, Kate and, of course, Harry and Meghan’s plans to the side.\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/media/26159/duchess-of-cornwall-pre.jpg", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/26159/duchess-of-cornwall-pre.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/camilla-duchess-of-cornwall-secret-plot-against-meghan-markle-exposed", "title": "Camilla’s evil plot exposed", "meta_data": {"language": "en-us", "description": "Outspoken Australian feminist Germaine Greer recently declared in an explosive interview that Prince Harry and Meghan Markle are doomed for failure and won’t stay married.", "news_keywords": "Meghan Markle, Camilla, Camilla Parker Bowles, Camilla secret plot, Prince Charles, Prince Harry, Meghan Markle secret plot, germaine greer, Germaine Greer Camilla Parker Bowles, royal wedding, the royal wedding, royal wedding news, latest royal wedding news", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/camilla-duchess-of-cornwall-secret-plot-against-meghan-markle-exposed", "title": "Camilla’s evil plot exposed", "description": "Outspoken Australian feminist Germaine Greer recently declared in an explosive interview that Prince Harry and Meghan Markle are doomed for failure and won’t stay married.", "image": {"identifier": "http://www.newidea.com.au/media/26159/duchess-of-cornwall-pre.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Camilla duchess of Cornwall secret plot against Meghan Markle exposed", "description": "Outspoken Australian feminist Germaine Greer recently declared in an explosive interview that Prince Harry and Meghan Markle are doomed for failure and won’t stay married.", "image": "http://www.newidea.com.au/media/26159/duchess-of-cornwall-pre.jpg", "url": "https://www.newidea.com.au/camilla-duchess-of-cornwall-secret-plot-against-meghan-markle-exposed"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1524437757.044, "source": "http://www.newidea.com.au", "summary": ""}