{"url": "https://theundefeated.com/features/can-drake-stop-trying-to-control-womens-sexuality-more-life/", "text": "With the impending release of his fifth studio album — the first since the four-time platinum, Grammy-nominated 2016 Views — Drake has many questions surrounding him. Can he again move a million units in a week? Can he prove all the doubters wrong after two years of ghostwriting allegations? Can he top “Hotline Bling” or “One Dance”? Can More Life overtake Take Care as Drake’s undoubted classic album?\n\nBut also, can he, like so many artists in 2016 — Beyoncé (Lemonade), Solange (A Seat at the Table), Rihanna (Anti), Kanye West (The Life of Pablo), Young Thug (Jeffery) — take risks on his new album, exposing a deeper version of himself? Drake and his legion of fans — and his seemingly equal number of detractors — are waiting with bated breath for March 18 to see what the 6 God has been cooking up. But before we can call the new project “classic” or “trash,” before we spend the next few weeks debating the best and worst tracks, here’s the most important question that Drake has to answer: Can he stop attempting to control women?\n\nOver the past eight years, Drake’s built up a reputation as being the compassionate and less threatening (read: soft) rapper who appears on The Ellen DeGeneres Show, cuddles up with professional athletes, and gets tattoos of Aaliyah. He’s played the role of Nice Guy by constantly smiling, and apparently wearing his heart on his sleeve. This appeals to the sensitivities of the women in his fan base. But, as is often the case with these so-called nice guys, Drake plays the charmer — he’ll call you beautiful, open doors for you and send you smiley-face emojis — but the minute he has sex with you, or you move on to someone else, he turns into Michael Ealy in The Perfect Guy.\n\nDrake’s corniness, outward kindness and lack of sexual aggression has been misinterpreted as an overarching respect for women. He’s even been referred to as a feminist. But Drake is as much a feminist as Rachel Dolezal is a black woman. His entire catalog is steeped in respectability politics, accepting women so far as their body count goes.\n\nThose songs pale in comparison to “Shot For Me,” “Marvin’s Room” and “Practice.” They are Drake at his worst.\n\nWhile he’s constantly praised Nicki Minaj over the years, Drake belittled the Grammy-nominated artist during his beef with her former boyfriend, Meek Mill — Is that a world tour or your girl’s tour? — implying that it’s emasculating for a man to receive second billing to his significant other.\n\nAs with stars of rock and country music, almost every successful rapper today, from Jay Z to Future to Chance the Rapper, has at some point performed lyrics that objectify or exploit women. J.Cole’s music has taken on more social justice elements over the years (Drake has spoken out for black causes as well). But Cole, in a 2013 song, called women “b—–s” —I got smart, I got rich, and I got b—–s still/And they all look like my eyebrows: thick as hell — and patriarchally dismisses female sexuality on 2014’s “No Role Modelz”:\n\nMy only regret was too young for Lisa Bonet, my only regret was too young for Nia Long/Now all I’m left with is hoes from reality shows, hand her a script the b—h probably couldn’t read along\n\nEven so-called progressive rappers fall into this trap, namely the androgynous Young Thug and the genderfluid Young M.A.\n\nSometime between Drake’s early rise and his third mixtape being converted into 2009’s So Far Gone, the rapper known for singing about his romantic feelings and the pressure of newfound fame — with a flow that made every 16 bars sound like the hottest verse ever — became his own worst enemy. Drake, known for hits like 2009’s “Best I Ever Had” and 2010’s “Find Your Love,” became synonymous with quote-heavy memes on social media, and fake Twitter accounts such as @drakkardnoir pumped out fake deep quote after fake deep quote.\n\nBut the rapper’s verses about loving and being proud of college-educated, independent women — Sound so smart like you graduated college/Like you went to Yale but you probably went to Howard — paved the way for hypermasculine diatribes against the sexual agency of seemingly any woman he’s ever encountered. Through an examination of Drake’s four studio albums, plus mixtapes, collaborative projects and guest features, it is clear that the man who made music for folks who couldn’t get over their exes was himself struggling with the basic concept of “moving on.”\n\nWhile So Far Gone doesn’t count as a studio album — it was his final mixtape before signing with Universal Republic — it gave listeners a sneak peek into the troublesome lyrics Drake would release in subsequent years. On the soothing track “Houstatlantavegas,” he raps about “saving” an exotic dancer from a strip club:\n\nYou go get f—– up and we just show up at your rescue/Carry you inside, get you some water and undress you.\n\nI give you my all and the next morning you’ll forget who or why, or how, or when/Tonight is prolly ’bout to happen all over again.\n\nThank Me Later, Drake’s 2010 debut studio album, features the rapper slut-shaming women for having previous sexual partners. From “Karaoke” (I hope that you don’t get known for nothing crazy/Cause no man ever wants to hear those stories ’bout his lady) to “Miss Me” (Work somethin’, twerk something, basis/She just tryna make it so she’s right here getting naked. I don’t judge her, I don’t judge her/But I could never love her) to “Thank Me Now” (Alohas to women with no ties to men/That I know well, that way there are no lies), Drake positions women with previous sexual experience as undesirable. On the Rihanna-assisted “Take Care,” he seems to open up to the idea of women having sexual agency, relenting I’ve asked about you and they told me things/But my mind didn’t change and I still feel the same.\n\nThank Me Later was also at times a celebration of independent women – appreciating women’s “book smarts and street smarts” on “Shut it Down” and “Fancy” — but set the foundation for 2011’s Take Care, which was, at that point, the peak of Drake’s overt misogyny and objectification of women. On Take Care, which won Drake a Grammy for best rap album — he continues his focus on sex workers with “Lord Knows”:\n\nTo all these women that think like men with the same intentions\n\nTalking strippers and models that try to gain attention.\n\nEven a couple porn stars that I’m ashamed to mention.\n\n“Under Ground Kings” (Sometimes I need that romance, sometimes I need that pole dance/Sometimes I need that stripper that’s gon’ tell me that she don’t dance) even creates a binary of acceptable and unacceptable behavior. While Drake has an infatuation with exotic dancers, he also makes it clear that admiration only goes as far as sex. “Trust Issues,” which Drake said he made for “fun” and thus didn’t include on the album, has Drake playing into the thoroughly debunked myth that women can’t want sex as much as men, rapping And it’s probably why I’m scared to put the time in/Women want to f— like they’re me and I’m them.\n\nThose songs, though, pale in comparison to “Shot For Me,” “Marvin’s Room” and “Practice.” They are Drake at his worst, going beyond the behaviors of the paternalistic and disapproving ex. He goes from telling a woman she’s drinking away the pain she feels due to leaving him on “Shot For Me” — Yeah, I’m the reason why you always getting faded — to cursing out another for finding happiness with a new lover on “Marvin’s Room” (F— that n—-a that you love so bad).\n\nDespite admitting that he’s a flawed individual in the latter song, in the former he tells the woman that he “made” her and calls her a “b—-.” This then leads to Drake’s most confusing and disturbing song to date, “Practice.” While acknowledging that women can have sex — the song is about a woman having multiple partners — Drake then spins it to his advantage: All those other men were practice, they were practice/Yeah, for me, for me, for me, for me. He senses “pain and regret” in the woman from her past, and then reluctantly accepts the fact that she has casual sex. He tops the song off with an uncomfortable, familial request: You can even call me daddy, give you someone to look up to.\n\nBut, Drake can still change. His lyrics paint the picture of a man who is constantly questioning himself.\n\nIt’s 2016’s “Hotline Bling” that ignited the re-examination of Drake’s entire catalog. The song is the rapper’s second-best-selling single of all time (behind fellow Views track “One Dance”), and won him two Grammys at last month’s award show. Not to mention, the visuals for the song will go down in music history as one of the most memorable music videos of all time.\n\nBut while the chorus is equal parts infectious and mesmerizing, Drake sneaks in two verses and a bridge full of “reductive stereotypes” and body-policing lyrics about an old fling. Whether about said woman “wearing less and goin’ out more” or “going places where you don’t belong,” Drake makes it apparent that he’s offended that she has the audacity to move on with her life. By the end of the song, Drake’s become so desperate that he’s even concerned that the woman is “bendin’ over backwards for someone else.” Textbook narcissism.\n\nHis guest appearances have been a mixed bag as well. On rapper The Game’s 2011 track “Good Girls Go Bad,” Drake raps Who’s still getting tested?/Where’s all the women that still remember who they slept with? and a year later added to 2 Chainz’s “No Lie”:\n\nShe could have a Grammy, I still treat her a– like a nominee\n\nJust need to know what that p—- like\n\nSo one time is fine with me.\n\nOver the past couple of years, Drake has put out two mixtapes, a solo effort If You’re Reading This It’s Too Late, and What A Time To Be Alive with Future. His male chauvinism can be found on tracks “Legend,” “Energy” and “Madonna” and repeatedly calls a woman “ungrateful” for living her life without him on “Diamonds Dancing.” As writer Tahirah Hairston pointed out, Drake has also had questionable lyrics on “Wu-Tang Forever,” “Own It,” “Furthest Thing,” “I’m The Plug” and even notable feminist Beyoncé’s “Mine.”\n\nBack in October, Drake released three tracks from his upcoming More Life album — “Fake Love,” “Sneakin’,” and “Two Birds, One Stone.” Looking solely at those tracks, it appears Drake has let up a little on his control, instead rapping about success, fake friends and his long list of haters. Even his appearance on labelmate Nicki Minaj’s diss to Remy Ma, “No Frauds,” he steers clear of trying to preserve women’s sanctity.\n\nFor nearly a decade now, Drake has wrapped up his alarming lyrics inside catchy, Instagram-caption-worthy choruses and tunes. The “light-skinned Keith Sweat” gets away with this because he carefully crafted a “nice guy” persona that deflects the criticism that, say, a 21 Savage, Kodak Black or the Migos would receive.\n\nFor many men, Drake’s attitudes reflect their own attitudes and desires, which in turn reflect a patriarchal society that views women as sexual objects meant to be gazed at. For women, they’ve had to deal with sexism in the arts since the beginning of time, so choosing to not enjoy an artist because of his views on sexuality would mean giving up on music all together. And at the end of the day, Drake is just that good at his job, unquestionably the most influential and popular musician in the business right now.\n\nBut Drake can still change. His lyrics paint the picture of a man who is constantly questioning himself, consistently trying to become a better person, whatever that entails. From So Far Gone to More Life — age 22 to 30 — he’s learned all the lessons life can teach, from whom to trust to what forms of happiness money and fame can buy. But it seems he’s yet to learn that women aren’t sexual objects. They’re human beings. If the only women of the world were all exactly like the women he seems to respect — his mother or Rihanna or Aaliyah or Serena Williams — we’d call him Aubrey the Riveter. But, they aren’t the only women who deserve his respect.\n\nHe knows that. But it begs the question: Does he care?", "images": ["https://theundefeated.com/wp-content/uploads/2016/05/johnson.png?w=90", "https://theundefeated.com/wp-content/uploads/2017/03/gettyimages-652599480.jpg?w=700", "https://theundefeated.com/wp-content/uploads/2020/04/r689927_2_1296x729_16-9.jpg?w=600&quality=70", "https://theundefeated.com/wp-content/uploads/2020/04/GettyImages-1193185303-e1587039054106.jpg?w=600&quality=70", "https://theundefeated.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://theundefeated.com/wp-content/uploads/2020/03/BLACKAF_107_Unit_00417R-e1586993601934.jpg?w=600&quality=70"], "top_img": "https://theundefeated.com/wp-content/uploads/2017/03/gettyimages-652599480.jpg?w=700", "keywords": [], "authors": ["Martenzie Johnson"], "canonical_link": "https://theundefeated.com/features/can-drake-stop-trying-to-control-womens-sexuality-more-life/", "title": "Can Drake stop trying to control women’s sexuality?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.4", "og": {"type": "article", "title": "Can Drake stop trying to control women’s sexuality?", "url": "https://theundefeated.com/features/can-drake-stop-trying-to-control-womens-sexuality-more-life/", "description": "With the impending release of his fifth studio album — the first since the four-time platinum, Grammy-nominated 2016 Views — Drake has many questions surroundin…", "site_name": "The Undefeated", "image": {"identifier": "https://theundefeated.com/wp-content/uploads/2017/03/gettyimages-652599480.jpg?w=700", "width": 700, "height": 394}, "locale": "en_US"}, "article": {"published_time": "2017-03-18T21:06:30+00:00", "modified_time": "2017-03-18T21:06:30+00:00", "author": "https://facebook.com/MartenzieJohnsonESPN", "publisher": "https://www.facebook.com/theundefeatedsite"}, "fb": {"app_id": 834240743288407, "pages": 1583598865225460}, "twitter": {"site": {"identifier": "TheUndefeated", "id": 3033098871}, "widgets": {"csp": "on"}, "maxage": 300, "card": "summary_large_image", "creator": {"identifier": "martenzie", "id": 194204409}, "image": {"src": "https://theundefeated.com/wp-content/uploads/2017/03/gettyimages-652599480.jpg?w=700"}, "label1": "Written by", "data1": "Martenzie Johnson", "label2": "Filed under", "data2": "Music, Commentary, Rap, Drake, More Life"}, "DC.date.issued": 61814, "description": "With the impending release of his fifth studio album — the first since the four-time platinum, Grammy-nominated 2016 Views — Drake has many questions surroundin…"}, "movies": [], "publish_date": 1489871190.0, "source": "https://theundefeated.com", "summary": ""}