{"url": "www.empireonline.com/movies/features/matrix-empire-1999-keanu-reeves-interview/", "text": "By Adam Smith | Posted 15 Mar 2017\n\nWith news today that another Matrix film could be headed for our screens, we thought it time to cast our minds back to the moment The Matrix began. Eighteen years ago this month, Keanu Reeves, Carrie-Anne Moss and Laurence Fishburne made history, slipping on the shades of Neo, Trinity and Morpheus in a film that very few saw coming. With audiences focused on the imminent return of Star Wars, the (then) Wachowski brothers dropped a bombshell clad in black leather, the vibrations of which are still being felt nearly two decades later.\n\nBack in the carefree Spring of 1999, Empire sent packed a fresh-faced journalist off to LA, where he sat down with the star of Speed to chat about his little sci-fi project, public perception and rumours that he had secretly married David Geffen.\n\nThe following article first ran in the July 1999 issue of Empire.\n\nKeanu Reeves is, \"the world\" would have you believe, dumb. Enquire as to the precise extent of his dumbness and \"the world\" will no doubt come back to you with references to pairings of diminutive lumber and the viscosity of porcine excrement. Cracks may also be made about his exotic name translating as \"Cool Wind Whistling Between The Ears\" and speculation will be had as to synaptic tumbleweed rolling lazily between his dendrites. Still in any doubt? Let's survey the evidence.\n\nReeves made his movie debut in 1986 in River's Edge, a bleak and pessimistic tale of disenfranchised teens which rapidly gained cult status, before redefining youth culture with Alex Winter in two Bill And Ted movies (the pervasive influence of which would have California surfspeak dominating the teen argot from Kidderminster to Karachi - dude). For his next trick, he took on the Bard in Kenneth Branagh's Much Ado About Nothing - and apparently was one of the reasons the movie got made, nervous studio execs noting that Branagh's interpretation had a naked Keanu five pages in and reasoned that this might offset your average 13-year-old girl's allergy to iambic pentameter. He then played Hamlet on stage in Canada, much to \"the world's\" barely stifled guffaws and, once he'd got over first night nerves (\"I wasn't acting, I was surviving,\" he remarked of the debut), the critics who bothered to stay around actually praised his performance.\n\nThen he turned up in a little sleeper called Speed. Oh, and when director Jan De Bont asked Keanu if he'd like to reteam with Sandra Bullock for a sequel to one of the most successful action movies of all time, Reeves took a quick look at the script and politely declined - opting instead to tour Europe with his universally agreed to be average \"folk thrash\" band Dogstar, leaving Jason Patric to board the big boat movie. This summer, he's continuing the successful trend with The Wachowski Brothers' The Matrix, a mid-budget sci-fi spectacular which rocketed to number one in the American box office, swiftly redefined the way the future looks and raised Reeves' asking price per movie to $15 million. If this is dumb then Empire will be first in line for a pre-frontal lobotomy.\n\nKeanu Reeves is slumped on a sofa in a slightly poky suite in Los Angeles' Four Seasons hotel looking mildly knackered. He's just off the blower to some far-flung publication as part of the press round for The Matrix. He is, Empire can attest, as irritatingly good-looking in real life as he is on the screen. Today he's dressed head to foot in black with a slightly \"distressed\" V-necked t-shirt completing the ensemble. After an odd little dance after which Empire winds up slumped on the sofa and Reeves in the chair opposite, and after the tape recorder has been positioned exactly to his liking, we enquires as to whether he had any idea while he was shooting that this was going to be a big hit.\n\n\"Erm. (Pause) No. (Pause) I didn't.\"\n\nOh. Can you ever tell?\n\n\"No one knows. (Pause) No one can tell. (Pause) Anything.\"\n\nCan you tell when you're making a stinker?\n\n\"No. (Pause) But you can feel that you are. But it doesn't mean that it will be. (Pause) Those feelings are ... (Pause) Stronger.\"\n\nThe problem with Keanu Reeves, perversely, is not that he's dumb but that he's very bright. What he lacks, as with the many stars who have dropped out of high school, is the means to express himself. The result is either aeons of pausing while he searches for the right expression or the now trademark Keanu-speak, when he just whips away the verbiage filters and ejects whatever happens to be in his head at the time and hopes that some of it is relevant. There will be a fair measure of this today.\n\nIn The Matrix, Keanu plays Thomas \"Neo\" Anderson, a computer hacker who comes to realise that the world is fake - a computer program designed to fool human beings who are, in fact, being farmed as living Duracells by the artificially intelligent machines that took over the planet years ago. Having been extracted from The Matrix by a band of renegades led by Laurence Fishburne, Anderson proceeds to learn to beat the program at its own game, developing superhuman powers when within The Matrix - quite literally the ability to leap tall buildings at a single bound - while being pursued by Matrix-generated bad guys. The result is something like a philosophical debate on the nature of reality with kung fu and guns. Lots of guns. But it wasn't the blistering action that attracted Reeves.\n\n\"It was the script,\" he remembers, \"the writing first of all. The way that the characters speak and what they say. I loved the dialogue and the ideas in the piece. I was really struck by the storytelling. They [screenwriters-directors Larry and Andy Wachowski] found a way in a kind of linear journey to tell a non-linear story. It wasn't what I call a 'climbing a mountain' thing, you know?\" He gestures towards an imaginary Himalaya just beyond the coffee table and adopts a pompous voice. \"There's the mountain and we're going to climb the mountain. And then we have the trials of climbing the mountain.\"\n\nI said, 'I'm tired and I just want to do Chekhov.' And they said, 'You can do Chekhov when you're older.'\n\nIntellectual crampons aside, there is still a fair amount of action. You know. Guns. Huge explosions. Helicopters hurtling into glass- sided buildings and erupting into walls of flame. That sort of malarkey . . . \"The film is, I think, character- and story-oriented,\" he disagrees. \"That's why they wanted the actors to do the fight sequences. So they could pull the camera back and you could always have a sense of place. And in terms of the story, something is being acted out. So I never really looked at it as an action movie apart from some of the gun stuff in the government lobby (An astounding sequence in which Neo marches through a lobby blowing people away while dressed in a trenchcoat... maybe we'd better not go there). But that's exciting too,\" he concedes. \"I love the tension; after five hours of setting a shot up and then getting one go at it. I kinda like that. It's terrifying but it's also exciting.\"\n\nIt was The Wachowskis' determination that they would be able to \"pull the camera back\" during action scenes that led to the key cast spending a full four months training in kung fu and wire-fighting - a Hong Kong cinema technique in which, during fight sequences, the actors are suspended from wires and flung about the place in a manner that mere muscle power or the Hollywood stunt standbys of trampolines and air-rams, simply can't provide. It was a period in which any of the actors could have fitted in another movie. Instead they spent every day at a specially designed training centre being hoisted around like so many living marionettes. \"The training was one of the things I had to consider,\" he says of his decision to do the film. \"I said, 'I'm tired and I just want to do Chekhov.' And they said, 'You can do Chekhov when you're older.'\"\n\nUncle Vanya therefore put on ice for the time being, Reeves headed out to Australia for a shoot where the cast, rumour has it, spent as much time in casualty as in front of the camera. \"Yeah, people got hurt,\" he nods when asked about the production's expenditure on Band-Aid and Nurofen. \"It was, 'He's pulled this, he's pulled that... smashed this, smashed that.' But we didn't break any noses. For some reason, we were all really good at not hitting each other. Or at least we saved it for the shoot. I know Laurence and Hugo had to punch their fists together. Agent Smith is fighting Morpheus in the bathroom and they punch. It's 'How did they?' They just had to do it.\"\n\nReeves would also find himself enjoying the wire-fighting. \"It's great,\" he enthuses. \"That fall where I jump from the building, that was like a 35-foot wire-jump. They just had some guys and a machine dropping me upside down. I got good enough to do the front flip and the back flip and the run up the wall. And I got to do one of the spins, so I really enjoyed it.\n\n\"But I don't know,\" he ponders, \"in an odd way that was the easy part. It's finding the interior of the character that's the challenge.\"\n\nIt raises an interesting hardy perennial of a question. Namely, can Keanu actually act? Opinion is, as they say, divided on the matter. Many audiences, even those composed of die-hard fans, would be forced to admit that Reeves delivers the same irresistibly charming goof-off persona whether he's essaying Don John or Jack Traven. Much like Marilyn Monroe, Cary Grant and Jimmy Stewart, Reeves is film star rather than character actor. And there's nothing wrong with that. After all, character actors are ten a penny whereas your authentic movie star is a much rarer and more precious breed. Directors and fellow thesps, though, tell a different story. After Much Ado About Nothing, Kenneth Branagh said of him: \"He's a brave, resilient actor who takes the knocks and plaudits with equal grace. As a result, he just gets better and better.\" (Mind you Kenneth Branagh also said, \"I'd pay money to see Keanu Reeves in leather trousers and I think a lot of other people would as well\" - which may give a clearer insight into the casting motivation to say nothing of the wardrobe decisions.) Other actors who have worked with him attest to his dedication and talent almost to a thesp. The result is that Reeves' career has taken a hiply eclectic route with low-budget \"independent\" (though he hates the phrase) movies, presumably to prove his acting chops, alternating with the big-budget summer popcorn fare. So, is there a plan at work here?\n\nI'd pay money to see Keanu Reeves in leather trousers and I think a lot of other people would as well.\n\n\"There are no plans,\" he protests, seemingly genuinely appalled by the idea. \"I find plans ... You can have a wish or a desire or a want or a hope. It's a desire in me to play in different genres and different scales of movies.\"\n\nBut isn't it the case that the more success you have, the more you become perceived as a \"film star\" so the less easy it is to take parts in smaller films?\n\n\"Erm. (Very long pause) I guess people make that delineation,\" he admits, uncomfortably. \"You certainly can get that expectation from people. I love working in Hollywood. Especially if it's a film I respond to. I loved acting in Devil's Advocate, but also a film like The Last Time I Committed Suicide (A black-and-white indie about the Beats in which Reeves delivers a creditable though unmistakably Keanu performance as Beat hero Neal Cassidy's permanently pissed best mate). So I want to be able to work in both of those.\"\n\nBut haven't the popcorn flicks of late been less than intellectually challenging. Dumb even?\n\n\"Yeah,\" he agrees. \"There's starting to be a sameness about them, I feel. But I'm sure that that's always the case. The more I read about old Hollywood, the more I'm like, 'That's happening now!'\n\n\"You know, I've had friends who work in independents who say, 'Well, we've got this great script but they want us to get an actor first.' (Bellows) HELLO ... You know that's happening all the time now. But anyway . . . \"\n\nHe peters out.\n\n\"Did I answer your question?\". Goofy grin. \"I'm sorry, I started daydreaming. You know when you start to think of something and then you think of all these other things But, er ... what was your question?\"\n\nif Keanu is slightly wary of being labelled \"film star\", the world's tabloid press -has had no problem at all with the concept and Reeves has been the ungrateful recipient of some of their wilder speculation. Empire approaches the next question with caution: is dealing with the media getting easier?\n\n(Pause)\n\nSpecifically, how did you react to the press saying that you're dumb?\n\n\"Oh, right ... Right.\" (Pause)\n\nEmpire decides to up the ante slightly. And that you're gay and you got married to David Geffen?\n\n\"Oh. What do I say to that? (Pause) Erm ...\"\n\nReeves settles into deep thought.\n\n\"What do I say to that?\" he mutters again to himself. \"I don't know how to answer this. Well, yeah, I guess I deal with whatever's coming at me. In terms of Geffen... Well, rumour itself is odd. So is gossip. So for me it's as if it exists in another universe that doesn't have much to do with me. And when you have to visit that universe, that's what you deal with. As opposed to the work I'm doing, it's: am I gay, or am I dumb?\"\n\nIt must get boring.\n\n\"It's not boring,\" he laughs. \"I don't know. It's just one is really personal ... Well, they're both personal questions which don't have anything to do with why you're there and so ... I guess it's bad taste.\"\n\nTo more tasteful matters, then. What, pray, is occupying Reeves' spare time these days? Even this area of questioning generates the now familiar periods of dead air.\n\n\"(Pause) Hanging out with friends, spending time with my family, looking for work, taking a lot of meetings,\" he says before remembering something else and brightening. \"I'm in a band,\" he announces. \"We're making a record.\"\n\nRumour itself is odd. So is gossip. So for me it's as if it exists in another universe that doesn't have much to do with me.\n\nThis will be the infamous Dogstar combo in which Keanu plays bass and has, in the past, attracted mixed reviews - Reeves himself having declared that he is pretty much inept on the bass in one interview (\"I have no rhythm\") - and has an unusually eclectic fanbase composed mainly of non-discriminating \"folk thrash\" fans and Keany-boppers desperate to get a brief eyeful of their shaggy- haired object of lust. Does it bother him that he's the main draw at Dogstar gigs?\n\n\"I don't know,\" he muses. \"You know what I hope? I hope that if they come to see me because they saw me in a film and liked the work so they want to come to the freakshow, that they like the music, you know. That's not so bad.\"\n\nIt's a treat that awaits thousands of Brits this year as the band will be playing Glastonbury for the first time. Any worries?\n\n\"I love playing festivals,\" he enthuses. \"Just please don't throw any hard objects.\" Empire informs him that mud is more likely to be the problem. \"That's fine,\" he grins. \"Mud's fine. I don't mind mud. I'm used,to that.\"\n\nWhy Keanu should be particularly used to mud must remain a mystery for there's no time to find out. One final question: does he have any regrets, any movie that if he had a delete button he'd wipe from the record?\n\nKeanu pauses. \"No,\" he smiles. \"I'd keep them all. Even the Paula Abdul video.\"\n\n(Pause)\n\nCool For Cats: An Interview With Laurence Fishburne\n\nLaurence Fishburne: he's the man that explains The Matrix. Given that he is just two hours from curtain- up on The Lion In Winter, in which Fishburne is currently wowing Broadway as the King Of England and given, too, that Fishburne is in the company of Albion's finest movie magazine, the imposing actor feels dutifully obliged to state the debt he owes to the greats of British thespianism.\n\n\"Peter O'Toole, Richard Burton, Michael Caine, Sean Connery, lan Holm,\" he lists. All of these cats, they're just ... \" He thinks for second. \"Bad motherfuckers, man.\"\n\nThough there is a keen sense of humour lurking beneath the brooding exterior, it is fair to say that nobody does mean and moody better than Fishburne. And, since declaring several years ago that he was to cease being hailed by the flippant moniker \"Larry\", Laurence Fishburne (\"Fish\" to his mates) has employed his talents to such effect in films like The Cotton Club, King Of New York, Deep Cover, Boyz N The Hood,\n\nOthello - and, not least, The Matrix, which has provided him, perhaps surprisingly, with his biggest commercial hit to date.\n\n\"I mean, we all knew we were making something really extraordinary, but that doesn't necessarily mean that anyone's going to get it,\" he says, reflecting on his role as Morpheus, a sort of lord of dreams, whose function - aside from coolly lurking in the dark wearing sunglasses - seems to be to explain what the hell is going on.\n\n\"The wonderful thing about the film is that it does several things at one time,\" he ventures. \"It introduces you to this really amazing concept about alternate realities. It deals with a great many spiritual teachings which have run through human consciousness for centuries. And then it gives you this great sort of ride, this great visual feast, that you can get lost in if you want to.\"\n\nShooting The Matrix was not all laughs, mind. And despite Fishburne's admiration for the Wachowski brothers (\"remarkable cats\") and co-star Reeves (\"one of the most intelligent cats I've ever met\"), he admits that the much-vaunted seven months of intense physical training, plus the shoot in Australia, were rather taxing. Sadly, his long-time ambition of mounting a Jimi Hendrix biopic (having secured the rights to the book 'Scuse Me While I Kiss The Sky) would seem to be fading now that, at 37, he is ten years older than the axe-man was when he bought the farm (\"Clock's ticking,\" he says). What would seem a safer bet is that at least one more Matrix film will be in the works.\n\n\"There's supposed to be a prequel and a sequel,\" he explains. \"I would love to be on board, but I'm not assuming anything. I can just tell you I would love nothing more.\"\n\nThere is really only one issue left. After two hours of rollicking action and hyper kung fu fisticuffs, did Fishburne's sunglasses, a tiny pair of specs clipped tentatively to the bridge of his nose, really never fall off?\n\n\"Never, hahahahaha,\" he cackles, shaking his head violently to the side. \"Only when I went like that..\"", "images": ["http://cdn.onebauer.media/one/media/5e84/ba3c/8554/e119/ab6c/fce1/do-the-right-thing.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://www.empireonline.com/assets-legacy/img/icons/pinterest.svg", "https://cdn.onebauer.media/one/empire-images/features/58c92f0584ec606a4c722f42/matrixbullet.jpg?quality=50&width=960&height=540&ratio=16-9&resizeStyle=aspectfill&format=jpg", "http://cdn.onebauer.media/one/media/5e84/aecb/58f7/6cae/21cc/3f32/patty-jenkins-ww.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://www.empireonline.com/assets-legacy/img/icons/twitter.svg", "http://www.empireonline.com/assets-legacy/img/icons/facebook.svg", "http://www.empireonline.com/assets-legacy/img/pilottv.jpg", "http://cdn.onebauer.media/one/media/5e84/b3a2/a2a6/080f/0ee6/2e5c/david-fincher.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://cdn.onebauer.media/one/media/5e84/c30b/bc80/cc31/3ee2/0a97/get-out-sunken-place-1.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://www.empireonline.com/assets-legacy/img/logo.svg", "http://cdn.onebauer.media/one/media/5e85/cb69/bc80/ccd1/17e2/0f94/quentin-tarantino-ouatih.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://www.empireonline.com/assets-legacy/img/icons/video.svg", "http://cdn.onebauer.media/one/media/5e70/aacb/232f/f0f3/474c/13e3/mandalorian2.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://cdn.onebauer.media/one/media/5e8d/990b/b982/8dfc/0a59/2ec1/frozen-2-show-yourself.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://cdn.onebauer.media/one/media/5e84/bdb4/abbc/8c13/af70/82f0/mcquarrie-rogue-nation.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://cdn.onebauer.media/one/media/5e8c/691f/a02d/8b4d/5940/14eb/extraction-trailer.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg", "http://cdn.onebauer.media/one/media/5e85/f847/58f7/6c13/9ecc/46bc/danny-boyle-127-hours.jpg?quality=50&width=120&ratio=1-1&devicePixelRatio=2&resizeStyle=aspectfill&format=jpg"], "top_img": "https://cdn.onebauer.media/one/empire-images/features/58c92f0584ec606a4c722f42/matrixbullet.jpg?quality=50&width=960&height=540&ratio=16-9&resizeStyle=aspectfill&format=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.empireonline.com/movies/features/matrix-", "title": "The Matrix - Empire's 1999 Keanu Reeves Interview", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Read Empires original 1999 article on a little-known sci-fi movie called The Matrix.", "article": {"published_time": "2017-03-15T12:14:00.000Z"}, "og": {"site_name": "Empire", "type": "website", "url": "https://www.empireonline.com/movies/features/matrix-empire-1999-keanu-reeves-interview/", "description": "Read Empires original 1999 article on a little-known sci-fi movie called The Matrix.", "title": "The Matrix - Empire's 1999 Keanu Reeves Interview", "locale": "en_GB", "image": {"identifier": "https://cdn.onebauer.media/one/empire-images/features/58c92f0584ec606a4c722f42/matrixbullet.jpg?quality=50&width=960&height=540&ratio=16-9&resizeStyle=aspectfill&format=jpg", "width": 960, "height": 540, "type": "image/jpeg"}}, "twitter": {"title": "The Matrix - Empire's 1999 Keanu Reeves Interview", "description": "Read Empires original 1999 article on a little-known sci-fi movie called The Matrix.", "card": "summary_card_large", "image": {"identifier": "https://cdn.onebauer.media/one/empire-images/features/58c92f0584ec606a4c722f42/matrixbullet.jpg?quality=50&width=960&height=540&ratio=16-9&resizeStyle=aspectfill&format=jpg", "alt": "The Matrix"}}}, "movies": [], "publish_date": null, "source": "http://www.empireonline.com", "summary": ""}