{"url": "https://www.etonline.com/john-cena-tells-nikki-bella-hes-willing-to-have-kids-and-still-wants-to-get-married-104193", "text": "John Cena is having a change of heart!\n\nIn a sneak peek of Sunday's episode of Total Bellas, the 41-year-old star meets with his ex-fiance, Nikki Bella, to discuss what led to their breakup. In earlier episodes of the E! reality series, it was made known that one of the main reasons the two were calling it quits was because John was not open to starting a family.\n\n\"I don't think date nights could ever get old, but I think so many years down the road, to keep things exciting, I think kids help that in a relationship,\" Nikki, 34, tells John. \"I see the point of kids after you've been with someone for so long.\"\n\nJohn's main fear, it turns out, is that if he does agree to kids, Nikki will \"get bored\" of him regardless.\n\n\"In a hypothetical universe, say I was like, ‘OK, we're going to have kids,' and we do and you find out that wasn't the real problem. And then years from now you look at me and resent [me],\" John explains. \"So, I'm talking to you tonight and I'm trying to ask all of these difficult questions because I don't know if you're just upset that you're not going to be a mom or if you've fallen out of love with me. Because it kind of feels like both. There's no way that I can interpret your actions over the last three months as anything different.\"\n\nNikki assures John that she \"just want[s] to be a mom.\"\n\n\"To constantly wake up and just look at this beautiful thing that I made and to teach him new things,\" she says dreamily.\n\n\"It's going to be a him? You said him,\" John points out.\n\nThe reality star tells her former flame, \"I feel like there's so much more I want to do with you and experience with you. It's just wanting to be a mom and knowing you will not be a dad.\"\n\nNikki adds, \"So, it's me who has stuck around thinking I could be OK with it and I've just come to the realization that I'm not OK with it.\"\n\nWith that declaration, John makes a jaw-dropping statement of his own.\n\n\"So, it literally is just about being a mom?\" the Blockers star asks. \"OK, because I can't have you out of my life, ever, and I want to marry you. Relationship and marriage especially is about sacrifice, and I will make that sacrifice for you. I will give you a child.\"\n\nJohn's apparent new view regarding children comes nearly two months after the pair split in April. Since then, the pro wrestler has expressed his willingness to have children.\n\n\"I'm willing to go back on all of these things I said, and a lot of things I was holding on to just out of stubbornness -- 'I won't have kids' -- and it took a really strong look in the mirror for me to be like, 'Why?'\" he said on Todayback in May. \"This person is my number one, and it's something that's very valuable to her, and of course we can do this ... all of that switched because I love her. She's my number one and I just want to make her happy ... and right now, she's happy.\"\n\nMeanwhile, Nikki said the time would heal all wounds for the couple.\n\n\"It's going to take time. So, honestly, only time can tell,\" she told ET following her ex's Today show appearance. \"John and I, we absolutely love each other and we care about each other a lot. We are best friends and, right now, we're both giving each other time separately and maybe there's hope that we reunite in the future.\"\n\nLast month, a rep for Nikki revealed to ET that the WWE stars are \"working on their relationship.\"\n\n\"Nikki Bella and John Cena are working on their relationship and taking it day by day,\" the rep said. \"They appreciate all of their fans and their continued support.\"\n\nHere's more on their possible reconciliation:\n\nNikki Bella and John Cena 'Working on Their Relationship' Post Split This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nNikki Bella Baffled Over Mixed Messages From Ex John Cena\n\nNikki Bella and John Cena 'Just Needed Time' Says Sister Brie (Exclusive)\n\nJohn Cena Sent Nikki Bella Flowers and a Love Letter After They Called Off Engagement\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/john_cena_nikki_bella_gettyimages-683449026_1280.jpg?h=c673cd1c&itok=qCXI9XN1", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-11/eto_news_daily_pete_ariana_110118.jpg?h=c673cd1c&itok=-NOJ0JS3"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/john_cena_nikki_bella_gettyimages-683449026_1280.jpg?h=c673cd1c&itok=qCXI9XN1", "keywords": [], "authors": ["Paige Gawley"], "canonical_link": "https://www.etonline.com/john-cena-tells-nikki-bella-hes-willing-to-have-kids-and-still-wants-to-get-married-104193", "title": "John Cena Tells Nikki Bella He's Willing To Have Kids and Still Wants to Get Married", "meta_data": {"article": {"opinion": "false"}, "title": "John Cena Tells Nikki Bella He's Willing To Have Kids and Still Wants to Get Married | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/john-cena-tells-nikki-bella-hes-willing-to-have-kids-and-still-wants-to-get-married-104193", "title": "John Cena Tells Nikki Bella He's Willing To Have Kids and Still Wants to Get Married", "description": "\"I can't have you out of my life.\"", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/john_cena_nikki_bella_gettyimages-683449026_1280.jpg?h=c673cd1c&itok=qCXI9XN1", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "\"I can't have you out of my life.\"", "title": "John Cena Tells Nikki Bella He's Willing To Have Kids and Still Wants to Get Married", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Paige Gawley‍", "url": "https://www.etonline.com/john-cena-tells-nikki-bella-hes-willing-to-have-kids-and-still-wants-to-get-married-104193", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/john_cena_nikki_bella_gettyimages-683449026_1280.jpg?h=c673cd1c&itok=qCXI9XN1"}, "description": "\"I can't have you out of my life.\"", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, John Cena, Nikki Bella, Total Bellas", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}