{"url": "www.bustle.com/p/why-isnt-gwen-stefani-coaching-the-voice-season-13-she-could-come-back-before-you-know-it-2443445", "text": "The Voice features a rotating group of celebrity coaches mentoring up-and-coming talent. Gwen Stefani has played a big part in the show, coaching three seasons: Season 7, Season 9, and most recently Season 12. Her presence on The Voice extends beyond just coaching though. She's performed solo, mentored, and even did a duet with her boyfriend and fellow coach Blake Shelton. So, suffice to say, fans were surprised to hear she wouldn't be returning for Season 13, despite her popularity on the program. So, why isn't Gwen Stefani coaching The Voice Season 13? (Bustle reached out to NBC and Stefani's rep for comment, but has not yet received a response.)\n\nThis isn't Stefani's first time stepping away from her red spinning chair; she took a hiatus after Season 9, only to return for Season 12. At the time she took the break, Stefani told Extra she wanted to focus on her career. The Season 9-12 timeout had a clear purpose to it, she wanted to focus on making music and performing. Stefani's reasons for leaving this time are a little less defined, although the multi-night live show is a big commitment for already busy stars.\n\nMinus Stefani, the coaches for Season 13 are Shelton, Adam Levine, Miley Cyrus, and Jennifer Hudson. And, for now, Stefani is keeping busy with music and performances. Stefani is releasing a Christmas duet with Shelton Oct. 6 and is promoting the jingle on her Instagram.\n\nStefani's love for Shelton is as strong as ever, even without The Voice, and she's been promoting his upcoming album on her social media. In February of 2017, Stefani went on Late Night With Seth Meyers and talked about their musical and romantic unity saying, \"It's so unbelievable ... I love Blake, he's just the most incredible guy. Like, everybody loves Blake ... he's just a sparkly, happy, amazing person.\"\n\nAccording to Stefani's social media, she's also continued to perform her music around the world. She posted the below Instagram on Sept. 15, preforming her classic hit \"Hollaback Girl\" in Korea. She's a seasoned performer and any time not spent coaching on The Voice will likely be spent doing concerts at home and abroad. While The Voice platform is large, the coaches are all successful outside the show as well.\n\nAnd, maybe Stefani will return for a future season. It's not like she'll stop being involved with The Voice since Shelton remains a coach. Hopefully the opportunity to coach new talent, the fun she seems to have on the program, and the fans will draw her back in at a future time — it's happened before when she left after Season 9 but came back for 12. And, ET reported in May of 2017 that Stefani would love to return to The Voice, but that her future on the show was uncertain. \"I don't have any plans to come back,\" she told the outlet. \"I love being here; I'd love to come back. We'll see what happens next.\"\n\nThe new season of The Voice airs Mondays and Tuesdays at 8 p.m. ET on NBC. New coaches Cyrus and Hudson should inject a new energy into the program, which will be anchored by longtime coaches Shelton and Levine. And, Hudson not only was a contestant on American Idol, she also was a Voice coach on the UK version of The Voice UK Season 6. So, she has plenty of experience to take Stefani's spot.\n\nThe Voice has remained a strong competition show because of its ability to mix things up. Hopefully, the shake-ups continue in the future and put Stefani back in a chair — because going too long without her would be bananas, b-a-n-a-n-a-s.", "images": ["https://imgix.bustle.com/uploads/image/2017/9/25/4f5d74dc-e37b-4fea-aedc-79c58ac6c64f-gwen2.JPG?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2017/9/25/4f5d74dc-e37b-4fea-aedc-79c58ac6c64f-gwen2.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/13/211d1a60-8ab6-49e6-8ab5-23b3b82d090e-154810_5974.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/14/28142bb5-bae4-4920-8565-7f63b38f8e79-154811_9603.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/89f57d06-71ec-4e6e-b575-9f78e16c7332-getty-1209533990.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/e8a28938-0e7b-47b1-9bb9-5ed4c3574904-154709_8569.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/9/25/4f5d74dc-e37b-4fea-aedc-79c58ac6c64f-gwen2.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/why-isnt-gwen-stefani-coaching-the-voice-season-13-she-could-come-back-before-you-know-it-2443445", "title": "Why Isn't Gwen Stefani Coaching 'The Voice' Season 13? She Could Come Back Before You Know It", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/why-isnt-gwen-stefani-coaching-the-voice-season-13-she-could-come-back-before-you-know-it-2443445", "type": "article", "title": "Here's What Gwen Stefani Is Doing Instead Of 'The Voice'", "description": "The Voice features a rotating group of celebrity coaches mentoring up-and-coming talent. Gwen Stefani has played a big part in the show, coaching three seasons: Season 7, Season 9, and most recently Season 12. Her presence on The Voice extends…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/9/25/4f5d74dc-e37b-4fea-aedc-79c58ac6c64f-gwen2.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The Voice features a rotating group of celebrity coaches mentoring up-and-coming talent. Gwen Stefani has played a big part in the show, coaching three seasons: Season 7, Season 9, and most recently Season 12. Her presence on The Voice extends…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}