{"url": "https://es.xfinity.com/sdmy/articles/entertainment-eonline/20180107/Check-Out-the-BTS-Mo-8b32", "text": "Where would we be on awards nights without social media?\n\nHollywood is kicking off the New Year with one of the most highly anticipated award shows of the season: the 2018 Golden Globes.\n\nThanks to the gift that is social media, we can go from the dressing room to the red carpet with our favorite celebs. If it wasn't for a little thing called Instagram, we wouldn't be able to catch Kelly Clarkson's last minute award show beauty routine or Milo Ventimiglia's limo ride to the big show.\n\nOr how about Reese Witherspoon's message of solidarity to fans promoting the #TimesUp movement alongside the likes of Tracee Ellis Ross, Amy Poehler, Susan Sarandon and more? Whether it's a personal message to their fans or just a silly moment before the event, it's always fun to feel like you're right there with the stars before one of the biggest nights of their careers.\n\nE! has rounded up all of the BTS moments from the biggest celebs accounts. Check out the pics below!\n\nGolden Globes 2018: Instagrams & Twitpics\n\nJoin the Movement: Click here to donate to the Time's Up Legal Defense Fund", "images": ["https://my.xfinity.com/assets/favicon-b9f6715ac1f07d6b864c07fa227693b6.ico", "https://sdx.xfinity.com/articles/images/58bd32b0697b040bf0a257ab-9af338e35d8c2221c10b9e50817891ee748dc2ff.jpg"], "top_img": "https://my.xfinity.com/assets/favicon-b9f6715ac1f07d6b864c07fa227693b6.ico", "keywords": [], "authors": ["Mona Khalifeh", "Eonline", "Pm Et Sun Jan"], "canonical_link": "https://es.xfinity.com/sdmy/articles/entertainment-eonline/20180107/Check-Out-the-BTS-Mo-8b32", "title": "Check Out the BTS Moments From Reese Witherspoon, Joe Jonas & More at the 2018 Golden Globes: See Their Instagrams & Twitpics", "meta_data": {"google-site-verification": "jbytp59dW82AQqr9wK5V9-uZhr0wXrCJ7n9U3mUilQg", "description": "Where would we be on awards nights without social media?Hollywood is kicking off the New Year with one of the most highly anticipated award shows of the season: the", "viewport": "width=device-width,initial-scale=1", "csrf-param": "authenticity_token", "csrf-token": "hhhBHJckpBRBVhSYHgV97qxgzNXGbR5nLAoXb/GXcAdvgpPKQ/IVUJg3hFiWYfcywm1FzO2HBdjAtUZWTPq9/A=="}, "movies": [], "publish_date": 1515254400.0, "source": "https://es.xfinity.com", "summary": ""}