{"url": "http://www.theashleysrealityroundup.com/2018/01/16/memorabilia-from-the-challenge-to-be-auctioned-off-in-honor-of-diem-brown/", "text": "Fans of The Challenge are getting the opportunity to raid their favorite Challengers’ closets—all in the name of sweet charity!\n\nOn January 16, The Challenge Charity Auction will kick off on eBay, giving fans of the show a chance to bid on memorabilia from the show’s long history. The proceeds from the charity auction will benefit the charity Bright Pink, the only national non-profit focused on the prevention and early detection of breast and ovarian cancer in young women. As ‘Challenge’ fans know, Diem passed away from ovarian cancer in 2014.\n\nBefore her death, Diem was extremely dedicated to helping women learn the importance of early cancer detection. Diem made her ‘Challenge’ debut in 2006 on “Fresh Meat, and went on to compete in “The Duel,” “The Gauntlet,” “The Duel II,” “The Ruins,” “Battle of the Exes,” “Rivals II” and “Battle of the Exes II.” She passed away two months after filming ended for “Battle of the Exes II,” having received her third cancer diagnosis since her 2006 debut.\n\nAccording to a press release for the charity auction, items being offered include signed game jerseys from the “Champs vs. Stars” and “Dirty 30” seasons. Challengers who donated to the auction include Johnny Bananas, Emily Schromm, Wes Bergmann, Terrell Owens, Justina Valentine, Tori Deal, and Diem’s ex-boyfriend CT Tamburello (to name just a few!)\n\nThe charity auction will also include Diem’s own jersey from 2008’s “The Gauntlet III.” (At press time Diem’s shirt had the highest bid at over $250!)\n\nThis is the second year in a row that a Challenge Charity Auction has been held. While promoting 2017’s auction, Johnny Bananas revealed why he continues to donate to the auctions.\n\n“Every so often this banana takes a break from stirring the pot to use his powers for good,” he wrote on his website. “As you know, a while back we lost a true angel among us when Diem passed away. There’s not a day that I don’t think of her and what a loss that was. Grief is a tricky emotion and you never know when it’s going to rear its ugly head and drag you down. But instead of my grief becoming a void, I choose to use it as a ladder and pull myself up. The best way for me to lift my spirits is through work with charitable causes, and I can’t think of a more worthwhile cause than early detection of breast and ovarian cancer.”\n\nIn addition to signed shirts, The Challenge Charity Auction also includes a golden hand trophy given out during “The Challenge: Invasion of the Champions” Reunion special. Other fun items include several wooden signs that have been autographed by multiple ‘Challenge’ stars, and a banner from the “Dirty XXX” season that’s been autographed by the season’s whole cast\n\nTo check out The Challenge Charity Auction, click here!\n\n(Photo: MTV)", "images": ["https://secure.gravatar.com/avatar/e615c2d6ca13b6946da652a4e0bdaa9a?s=56&d=monsterid&r=r", "https://s17077.pcdn.co/wp-content/themes/thevoux-wp-2/assets/img/logo.png", "https://secure.gravatar.com/avatar/2101450818b32f42c021b993e4eaabab?s=164&d=monsterid&r=r", "https://s17077.pcdn.co/wp-content/uploads/2018/01/challenge-charity-auction.jpg", "https://s17077.pcdn.co/wp-content/uploads/2018/01/diem-brown.jpg", "https://secure.gravatar.com/avatar/7ea9c4beaa607bce34ec8eaea560eef4?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/c44b1de47fa0ce712bc92cad1f78227b?s=56&d=monsterid&r=r"], "top_img": "https://s17077.pcdn.co/wp-content/uploads/2018/01/diem-brown.jpg", "keywords": [], "authors": ["The Ashley"], "canonical_link": "https://www.theashleysrealityroundup.com/2018/01/16/memorabilia-from-the-challenge-to-be-auctioned-off-in-honor-of-diem-brown/", "title": "Memorabilia From ‘The Challenge’ to be Auctioned Off In Honor of Diem Brown", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-mobile-web-app-capable": "yes", "apple-touch-fullscreen": "yes", "HandheldFriendly": "True", "msapplication-TileImage": "https://s17077.pcdn.co/wp-content/uploads/2016/03/cropped-NEW-LOGO-April-2017-270x270.jpg", "og": {"type": "article", "title": "Memorabilia From ‘The Challenge’ to be Auctioned Off In Honor of Diem Brown", "url": "https://www.theashleysrealityroundup.com/2018/01/16/memorabilia-from-the-challenge-to-be-auctioned-off-in-honor-of-diem-brown/", "description": "On January 16, The Challenge Charity Auction will kick off on eBay, giving fans of the show a chance to bid on memorabilia from the show’s long history.  All proceeds from the auction will be donat…", "site_name": "The Ashley's Reality Roundup", "image": {"identifier": "https://s17077.pcdn.co/wp-content/uploads/2018/01/diem-brown.jpg", "width": 575, "height": 323}, "locale": "en_US"}, "article": {"published_time": "2018-01-16T16:05:53+00:00", "modified_time": "2018-01-17T02:49:56+00:00"}, "twitter": {"text": {"title": "Memorabilia From ‘The Challenge’ to be Auctioned Off In Honor of Diem Brown"}, "image": "https://s17077.pcdn.co/wp-content/uploads/2018/01/diem-brown.jpg?w=640", "card": "summary_large_image"}}, "movies": [], "publish_date": 1516032000.0, "source": "http://www.theashleysrealityroundup.com", "summary": ""}