{"url": "https://en.wikipedia.org/wiki/Lindsey_Vonn", "text": "American alpine skier\n\nLindsey Caroline Vonn (née Kildow ; born October 18, 1984)[1] is an American former World Cup alpine ski racer on the US Ski Team. She won four World Cup overall championships—one of only two female skiers to do so, along with Annemarie Moser-Pröll—with three consecutive titles in 2008, 2009, and 2010,[2] plus another in 2012.[3] Vonn won the gold medal in downhill at the 2010 Winter Olympics, the first one for an American woman.[4] She also won a record eight World Cup season titles in the downhill discipline (2008–2013, 2015, 2016), five titles in super-G (2009–2012, 2015), and three consecutive titles in the combined (2010–2012). In 2016, she won her 20th World Cup crystal globe title, the overall record for men or women, surpassing Ingemar Stenmark of Sweden, who won 19 globes from 1975 to 1984. She has the second highest super ranking of all skiers, men or women.\n\nVonn is one of six women[5] to have won World Cup races in all five disciplines of alpine skiing—downhill, super-G, giant slalom, slalom and super combined—and won 82 World Cup races in her career through February 3, 2018. Her total of 82 World Cup victories is a women's record, surpassing Annemarie Moser-Pröll of Austria who had held the record since the 1970s. Only Ingemar Stenmark of Sweden with 86 World Cup victories has more. With her Olympic gold and bronze medals, two World Championship gold medals in 2009 (plus three silver medals in 2007 and 2011), and four overall World Cup titles, Vonn is the most successful American ski racer and considered one of the greatest of all skiers.[6]\n\nIn 2010, Vonn received the Laureus Sportswoman of the Year award [7] and was the United States Olympic Committee's sportswoman of the year.[8]\n\nInjuries caused Vonn to miss parts of several seasons, including almost all of the 2014 season and most of the 2013 season. While recovering from injury, she worked as a correspondent for NBC News covering the 2014 Winter Olympics in Sochi, Russia. However in 2019, she announced her retirement, citing her injuries.\n\nIn August 2019, Vonn got engaged to New Jersey Devils defenseman P.K. Subban and in December 2019 she proposed to Subban.[9]\n\nEarly life and education [ edit ]\n\nBorn Lindsey Caroline Kildow in Saint Paul, Minnesota, she is the daughter of Linda Anne (née Krohn) and Alan Lee Kildow.[10] She grew up in the Twin Cities metropolitan area in Burnsville, Minnesota. She is of Norwegian ancestry.[11] Vonn was on skis at age two before moving into Erich Sailer's renowned development program at Burnsville's Buck Hill, which also produced slalom racer Kristina Koznick. Her father, who had won a national junior title before a knee injury at 18, \"pushed\" her very hard, according to Sailer.[12]\n\nWhen Vonn was 9 years old, she met Olympic gold medalist ski racer Picabo Street, whom she considers her hero and role model.[13] Their meeting made such an impression on Street that she remembered the meeting and later served as Vonn's mentor in skiing. Vonn commuted to Colorado to train for several years before her family moved to Vail, Colorado in the late 1990s.[14][15]\n\nVonn attended University of Missouri High School, an online program through the university's Center for Distance and Independent Study.[16][17] She speaks German fluently.[18]\n\nSkiing career [ edit ]\n\nEarly years [ edit ]\n\nLindsey Kildow was taught to ski by her grandfather, Don Kildow, in Milton, Wisconsin.[19] She began skiing as a child in Burnsville, Minnesota, at Buck Hill Ski and Snowboard, and through family vacations that included 16-hour drives from Minnesota to Vail. \"I would be in the back under a sleeping bag, and she'd be driving and singing along to some Eric Clapton tape,\" she said in an interview.[citation needed] By the time Lindsey was 7, she had skied in Minnesota, Colorado, and Oregon year-round. When skiing in Colorado, she had lessons at Ski Club Vail (SCV), an alpine racing program (subsequently expanded and renamed Ski & Snowboard Club Vail) that taught, and still teaches skiers from ages 6 and up.[20][failed verification] During her first year at SCV, Lindsey skied under \"Gravity Corps\" Ski Coach Colby S. Scudder, her only female coach, in Ski Club Vail's Gravity Corps \"pre-age-class\" program. The program was directed by Tom Krebs[21][failed verification] who told the Gravity Corps coaches to not train the skiers inside gates, but instead to develop their all-mountain skiing skills and to develop their comfort in the fall line (the most direct route down a ski slope), while ensuring the kids were exposed to as much terrain as possible \"versatility and exposure to diverse challenging terrain\" was the directive.[22][failed verification] At that time, the Gravity Corps pre-age-class skiing program consisted of multiple groups of 8–10 skiers; it was the only SCV venue open at the club to younger skiers who were not yet old enough to participate in official \"age-class\" United States Ski and Snowboard Association (USSA) or International Ski Federation (FIS) sanctioned events.\n\nLindsey and other members of her gravity Corps group, placed first, second and third, in Gravity Corps unofficial races in which all gravity corps skiers participated in one collective unofficial gathering. The race was set and run by Krebs, and directed as the only time gravity corps skiers should \"be in a race course\".[22][failed verification] At the end of that first Vail season, Lindsey's mother asked if the coach thought Lindsey was a slow skier; the answer was an emphatic \"NO,\" Lindsey was most definitely NOT a slow skier. It was mentioned that if anyone ever said that Lindsey was slow, it was likely because that person was not recognizing that Lindsey was in a perpetual growth spurt and, that the person saying that Lindsey was slow was not considering that changes in Lindsey's height affected her center of gravity, etc., and skiing confidence, and thus that person who described Lindsey as skiing slowly was not acknowledging the differences between a growing young male skier vs. a young female skier (who by the age of 11, stood at a much taller height than her peers) - which, in the SCV Gravity Corps Coach's opinion resulted in the devastatingly inaccurate \"slow\" comment. The words used by Colby S.Scudder were more colorful, and much less diplomatic. Based on Lindsey's newly confirmed speed, Lindsey and her mother asked about enrolling Lindsey into the older \"Age-Class\" program, which they said, had previously denied their enrollment request.[citation needed]\n\nThe coach supported the idea of skiing with \"age-class\" skiers. The next season, with the final approval of Director Chip Woods, Lindsey was enrolled into the \"age class program,\" under SCV Alpine \"technical skiing Coaches Reid Phillips, Chip Woods, Todd A. Rash and Gus Pernetz,etc., who collectively perfected Lindsey's early technical skills and began her SCV \"in gate\" training.[23][failed verification]\n\nIn the late 1990s, Lindsey and her siblings and mother stopped commuting from Minnesota to Colorado and instead moved to Colorado to ski exclusively at Ski Club Vail. During her first SCV year in Vail, Lindsey and one of her sisters skied together in the same \"gravity corps\" SCV group. It was during that first season Lindsey and her family were contemplating if the entire family should move from Minnesota to Colorado. \"Vail was wonderful to me,\" Lindsey said, \"but I missed all the traditional things of childhood – sleepovers, school dances, making friends in a conventional way. Halfway through the second season, Lindsey's siblings also moved to Vail. \"Now all my brothers and sisters had left their friends for me. That was stressful on them. I felt so guilty.\"[citation needed]\n\nHowever, the move paid off because in 1999 Lindsey Kildow and Will McDonald became the first American athletes to win the \"Cadets\" slalom events in Italy's Trofeo Topolino di Sci Alpino.[24] In 1986, Lindsey's hero, Picabo Street, participated, but did not medal, in the same Topolino event.[24][25][26][failed verification] In 1995 at age 10, Kildow met Street in person at a promotional event. A few years later, \"Street was stunned watching a 15-year-old Lindsey ski for the first time in 1999. She marveled at Lindsey's knack for following the fall line. 'The faster she went, the bigger the smile she got on her face,' Street said. 'You can't teach somebody to love the fall line like that little girl loved the fall line.'\" [27]\n\nAfter climbing through the ranks of the U.S. Ski Team, she made her World Cup debut at age 16 on November 18, 2000, in Park City, Utah.\n\nIn her Olympic debut at the 2002 Winter Olympics at age 17, Kildow raced in both slalom and combined in Salt Lake City, with her best result coming with sixth in combined. On March 4, 2003, she earned a silver medal in downhill in the Junior World Championship at Puy Saint-Vincent, France.\n\nKildow credits a change in her attitude toward training to a bike ride with fellow ski racer Julia Mancuso and Mancuso's father Ciro when Kildow visited them at their home in Lake Tahoe, California. With little biking experience, she quickly found herself miles behind Julia and Ciro. Alone and embarrassed, she realized she needed drastic revision of her training regimen and her attitude toward training if she was going to be successful.[28]\n\nOn March 24, 2004, Kildow was the downhill silver medalist at the U.S. Alpine Championships at Mt. Alyeska Resort, Girdwood, Alaska. Earlier that year 2004, Kildow climbed onto the World Cup podium for the first time with a third-place finish in downhill in January 2004 at Cortina d'Ampezzo, Italy. Her maiden victory in that specialty came at Lake Louise, Alberta, in December 2004. She captured five more World Cup podiums over the next two months.\n\nIn 2005, she competed in four races at her first World Championships held in Bormio, Italy, pulling in fourth-place finishes in both the downhill and the combined. She was ninth in super-G, but failed to finish the giant slalom. She cited the unexpected appearance of her father, with whom she has a strained relationship, for rattling her before the event.[12]\n\nLindsey Kildow during a slalom race in Aspen in November 2006\n\nAt her second Winter Olympics in 2006, Kildow clocked the second-best time in the first practice run yet crashed in the second training run for the downhill race on February 13, 2006, in San Sicario, Italy; she was evacuated by helicopter to Turin and was hospitalized overnight. Despite a bruised hip and strong pains, she returned on the slope 2 days later to compete and finished eighth. The gritty performance earned her the U.S. Olympic Spirit Award, as voted by American fans, fellow Team USA athletes, former U.S. Olympians, and members of the media for best representing the Olympic Spirit.\n\nKildow earned her first \"big race\" medals with silver in both downhill and super-G at the 2007 World Championships in Åre, Sweden. A training crash before the slalom caused her a low-level ACL sprain to her right knee, ending her season 4 weeks early. Nevertheless, she finished third for the season in the women's 2007 World Cup disciplines of downhill and super-G.\n\n2008–2010: Winning the overall World Cup for three consecutive years [ edit ]\n\nIn 2008, Lindsey Vonn won the overall World Cup title. She became the second American woman to do so, following Tamara McKinney in 1983. American Bode Miller won the men's title to complete the first U.S. sweep of the men's and women's overall titles in 25 years (McKinney and Phil Mahre in 1983). She also won the World Cup season title in the downhill and the U.S. Alpine Championships combined title (downhill & slalom), marking her best ski season to date. Vonn set a new American record for the most World Cup downhill victories with ten, winning at Crans-Montana, Switzerland, on March 8.\n\nVonn in March 2008\n\nIn 2009, Vonn repeated as overall World Cup champion, repeated as downhill champion and also won the season championship in super-G by winning the final race of the season. During the season, she broke Tamara McKinney's American record of 18 World Cup victories when she won the super-G at Tarvisio in February. Her nine World Cup wins also set an American single-season record, surpassing Phil Mahre's total of eight in 1982. At the 2009 World Championships in Val-d'Isère, France, Vonn won her first world championship and became the first American woman to win the world super-G title.[29] In the super combined event, she won the downhill portion and had appeared to have finished second in the event with a strong slalom performance, but was disqualified for splitting a gate.[30] Three days later she won the gold in the downhill. During early 2009, she appeared in Alka-Seltzer television commercials in the United States as support for the United States Ski Team. During the summer of 2009, Vonn switched her equipment sponsor and supplier to Head skis, after previously racing her entire career on Rossignol skis.[31] In October 2009, Vonn was awarded the Skieur d'Or Award[32] by members of the International Association of Ski Journalists for her performances during the previous season.\n\nIn December 2009, Vonn sustained a bruised arm after a crash during the opening run of the World Cup giant slalom. She continued racing as there was no fracture that would prevent her return and run at the Olympic Games in Vancouver.[33] Despite skiing with her arm in a brace due to the injury, Vonn won three straight races (two downhills and a super-G) in Haus im Ennstal, Austria, from January 8–10, 2010. The wins raised her to second among American skiers on the all-time career list for World Cup wins with 28, passing Phil Mahre and trailing only Bode Miller. On January 14, 2010, Lindsey Vonn was named Colorado Athlete of the Year for 2009.[34] With her victory in a super-G just prior to the 2010 Winter Olympics, she clinched her second straight super-G discipline title with two races still to go.[35] Vonn ended up also winning the overall title, as well as the discipline titles in downhill, super-G and combined, and by winning the last super-G of the season, she boosted her overall World Cup victory total to 33, surpassing Bode Miller for the most World Cup victories by an American.[36] The third consecutive overall World Cup title also equals Phil Mahre's American record and makes Vonn the third woman to achieve it, behind Petra Kronberger with 3 straight and Annemarie Moser-Pröll with 5 straight.[36] Vonn was also named by the Associated Press as 2010 Female Athlete of the Year.[37]\n\n2010 Winter Olympics [ edit ]\n\nVonn at the 2010 Arthur Ashe Kids Day in Queens , New York, August 2010\n\nAt the Vancouver Winter Olympics in 2010, Vonn planned to compete in all five women's alpine events.[38] On February 10, she revealed she had severely bruised her shin in training the previous week. Vonn said the pain from her injury was \"excruciating\" and she would have a difficult time competing at the Winter Olympics.[39] Due to unseasonably warm weather and resultant poor snow conditions, many of the Alpine skiing events were moved back, giving Vonn additional time to heal.[40] On February 17, in her first event, Vonn won the gold medal in the downhill at Whistler Blackcomb, beating longtime U.S. rival Julia Mancuso by 0.56 seconds and becoming the first American woman to win Olympic gold in downhill.[41][42]\n\nFrom left to right: Tina Maze of Slovenia (silver), Andrea Fischbacher of Austria (gold), and Lindsey Vonn of the U.S. (bronze) with the medals they earned in the super-G\n\nIn her second event, the super combined, Vonn finished first in the downhill portion of the race. In the slalom portion, however, she crashed when she failed to get her ski around a right-hand gate. Vonn said her shin wasn't the problem. Gold and silver were won by Maria Riesch and Julia Mancuso respectively.[43]\n\nIn her third event, the super-G, Vonn finished third behind Andrea Fischbacher and Tina Maze, 0.74 seconds behind Fischbacher's winning time.[44] Afterwards, Vonn said she didn't ski the last part of the course as aggressively as she could have and lost the race as a result.[45] In her fourth event, the giant slalom, fog affected visibility. Vonn crashed in her first run, resulting in a broken fourth finger and Vonn's disqualification from the event.[46][47] In her fifth event, the slalom, Vonn lost control and straddled a gate, disqualifying her from the event.\n\n2011: Losing the overall World Cup to Maria Riesch by 3 points [ edit ]\n\nVonn at the Boston Red Sox vs. Baltimore Orioles game, April 2011\n\nAfter 3 consecutive overall World Cups, Vonn faced more serious competition from Maria Riesch of Germany in 2011. Riesch had a strong start to the season by winning 2 downhills in Lake Louise, where Vonn had won 7 races. Vonn placed on the podium in every speed race but failed to finish in several slaloms. Riesch had 5 podiums in the first 6 slaloms and was significantly ahead in the overall ranking by the end of January.\n\nAt the 2011 World Championships in Garmisch-Partenkirchen, Germany, Vonn suffered from a concussion she acquired during training a week earlier. She started in 2 events and achieved a seventh place in super-G and a silver medal in downhill.\n\nBack to World Cup and healthy again, Vonn finished ahead of Riesch in several races (including a giant slalom she finished third, best career result in GS until then), she took overall lead for first time that season after downhill event of the World Cup finals in Lenzerheide. The super-G was cancelled due to poor weather conditions, and after the slalom Riesch regained the overall lead by 3 points. The giant slalom was also cancelled due to weather and Riesch was the 2011 overall champion.\n\n2012: Joining the all-event winner's club [ edit ]\n\nVonn won her fourth Overall World Cup Title in 2012. The season opened in October in Sölden, Austria, where Vonn had won her first giant slalom. This made Vonn the 6th woman to have won all events at least once.\n\nOn December 2–4, 2011, she won all three races in Lake Louise (two downhills, one super-G) for her second career 'hat trick', and with her eleventh win at Lake Louise she surpassed Renate Götschl's record for most career wins at a single resort (ten in Cortina d'Ampezzo). On December 7, 2011, Vonn notched her first World Cup victory on U.S. snow, at Beaver Creek, Colorado. Due to a lack of snow in France, its super-G was rescheduled in advance for a Wednesday on the Birds of Prey course. Her limited success on U.S. snow is primarily due to a lack of speed events; only three have been run in the U.S. during her career. It was the first home win by an American woman in 17 years, since Hilary Lindh of Alaska won the downhill in nearby Vail in December 1994.\n\nWith further victories in January 2012, she overtook Renate Götschl to become the third most successful female World Cup racer in terms of victories.\n\nOn February 4, 2012, Vonn achieved her fiftieth World Cup victory on the Kandahar downhill course at Garmisch, Germany. The win also gave her 25 career downhill victories, surpassing Götschl for second most career DH wins. With a podium finish in Russia on February 18, 2012, Vonn clinched the season title in downhill, her fifth consecutive in that discipline.\n\nVonn's expressed disappointment that she missed the FIS Alpine Record for 2,000 points in a season by 20 points. In her final race of the season at Schladming, Austria, she was not able to improve on her first giant slalom run after losing her pole at the starting gate. Her 24th finish at Schladming led to her loss of a potential 20-plus points for her season record. \"It was possible to get those 20 points, I was in a good position ... If you work so hard to reach your goal but you lose your pole in the very last run, that's hard to take. It will give me even more motivation for next season\", commented Vonn after the race.[48]\n\n2013 [ edit ]\n\nVonn got off to a slow start in the 2013 season, slowed by illness with marginal results in giant slalom and skipping a pair of slalom races in November 2012. She came back quickly once the speed events started, again sweeping all three races in Lake Louise from November 30 to December 2 (two downhills, one super-G) for her third career 'hat trick', and increasing her record for most career wins at a single resort to 14. The three wins increased her career total to 56, moving her past Vreni Schneider into second place all-time among women behind Annemarie Moser-Pröll with 62.\n\nAfter some disappointing results, Vonn announced her decision on December 17 to take a break from the World Cup circuit to fully recover from her earlier illness.[49] She returned and finished in 6th place on January 6 in her first downhill race since her break. Two weeks later she won the downhill in Cortina d'Ampezzo and week later won the giant slalom in Maribor, Slovenia.[50]\n\nWorld Championships [ edit ]\n\nAt the first marathon of the 2013 World Championships in Schladming, Austria, Vonn crashed in the super-G and was airlifted to a nearby hospital. She tore her anterior cruciate ligament and medial collateral ligament in her right knee, with a tibial plateau fracture.[51] Vonn said she would be ready for the 2014 Winter Olympics despite her injury.[52]\n\nWorld Cup Finals [ edit ]\n\nBefore her season-ending crash on February 5 in Schladming, Vonn led in the World Cup downhill standings with 340 points. Several were within reach of taking the title during her absence from the tour. Overall champion Tina Maze, who trailed Vonn by more than a hundred points, took a 4th-place finish in Méribel and a win in Garmisch to close the gap to a single point with one race remaining at the World Cup finals in Lenzerheide. Weather conditions were in Vonn's favor, as officials canceled the race after numerous delays due to a thick fog on the lower section. As a result, she won her sixth downhill season title despite not competing in a downhill since mid-January.\n\n2014 [ edit ]\n\nVonn traveled to Austria for the first race of the 2014 Alpine Skiing World Cup, but ultimately decided not to compete during the first weekend.[53] She announced plans to return to competition in late November.[53] On November 20, 2013, Vonn re-injured her right knee straining it and partially tearing her right ACL after a crash during training.[54] She returned to competition on December 6, finishing 40th the first of two downhill races in Lake Louise, Canada,[55] then 11th in the second downhill on December 7, followed by a 5th place in the super-G on December 8. In December, she said of her preparation for the 2014 Winter Olympics that \"I'm going to play it safe and race minimal races, so I can get the confidence and the timing and the feeling of racing again. I'm really going to be safe and smart as I can.\"[56]\n\nOn January 7, 2014, Vonn announced that she would not compete in the Sochi 2014 Winter Games because she had re-injured her right knee on December 21, 2013, while skiing in France. \"I am devastated to announce that I will not be able to compete in Sochi. I did everything I possibly could to somehow get strong enough to overcome having no ACL but the reality has sunk in that my knee is just too unstable to compete at this level. I'm having surgery soon so that I can be ready for the World Championships at home in Vail next February. On a positive note, this means there will be an additional spot so that one of my teammates can go for gold. Thank you all so much for all of the love and support. I will be cheering for all of the Olympians and especially team USA!\" [57] ESPN posted a reference to her announcement, a few hours after Lindsey wrote the aforementioned on her Facebook page.[58]\n\n2015: Comeback [ edit ]\n\nVonn made her comeback to the top of the podium on December 6, 2014 at the Women's World Cup downhill race at Lake Louise, Alberta, winning the event in only her second race back.[59] In January 2015, she tied and then overtook Austrian Annemarie Moser-Proell for the most World Cup wins ever.\n\nAt the 2015 World Championships in Vail / Beaver Creek, Colorado, Vonn won a bronze medal in the first of ladies' events, the super-G.[60] She placed 5th in the downhill race and 14th in the giant slalom race.\n\nOn March 18, 2015, Vonn won the last World Cup downhill race at Meribel, France and claimed the World Cup downhill title for the seventh time. Vonn tied with Moser-Proell for the women's record of seven globes in one discipline.[61] The next day, Vonn notched her eight victory of the season by winning the last super-G race. With this win, Vonn took the super-G season title for a fifth time, tying a record shared by German Katja Seizinger, Austrian Hermann Maier and Norwegian Aksel Lund Svindal. She joined Ingemar Stenmark from Sweden as the only skiers to reach 19 season titles across all disciplines and the overall. Vonn also made a World Cup podium for the 113th time, tying Moser-Proell's women's record.[62][63]\n\n2016 [ edit ]\n\nVonn started the season by winning the three races contested by women in Lake Louise (2 Downhill, 1 Super G) for her third career victory. This brought her to 70 career World Cup wins, increasing her lead over the previous women's world record holder for most World Cup podiums by a woman (Austrian Annemarie Moser-Proell, 62 career victories) and with her 25th Super G win, she passed Austrian Hermann Maier for most Super G wins for either gender.[64] In January, Vonn tied the record of Annemarie Moser-Pröll for all-time downhill victories at 36 with a win at Altenmarkt-Zauchensee, Austria. Because poor snow conditions resulted in a shorter course, the race was uniquely held over two combined runs, similar to slalom and giant slalom races. Two weeks later in Cortina d'Ampezzo, Italy, Vonn broke Moser-Pröll's record with her 37th downhill victory.\n\n2017 [ edit ]\n\nOn November 11, 2016, Vonn announced on her Facebook page that she had severely fractured the humerus bone of her right arm in a training crash. She had undergone surgery to repair the bone.[65] Vonn returned to the World Cup on January 15, 2017, in the downhill race at Altenmarkt; she finished 13th. On January 20, in her second race back from injury, she won the downhill event in Garmisch-Partenkirchen, Germany, capturing her 77th win.[66]\n\nOn December 8, 2017, Vonn stated in an interview she will not be representing the President in the 2018 Winter Olympics and will not attend the White House reception if she wins a gold medal. Vonn made it clear in her statement that she feels that all Olympians represent the United States people, and not the leaders. She was quoted in the CNN article saying, \"Well I hope to represent the people of the United States, not the President.\" [67]\n\n2018 [ edit ]\n\nAt the 2018 Winter Olympics, Vonn tied for 6th in Women's Super-G.[68] She won the bronze medal in women's downhill.[69] Vonn dedicated her Olympic races to her grandfather, a Korean War veteran who died the previous November, competing with his initials on her helmet.[70] In a tearful interview following the woman's downhill race, Vonn stated: \"Our family never gives up and I never gave up. I kept working hard and I'm really proud of this medal and I know he [her grandfather] is too.\"[71][72] She later scattered some of her grandfather's ashes near the men's downhill racing course, stating: \"I know that it would mean a lot to him to be back here, a part of him is in South Korea always.\" [73]\n\n2019 [ edit ]\n\nIn October 2018, ahead of the start of the 2018–19 FIS Alpine Ski World Cup, Vonn announced that she would retire from competition at the end of the season. Having previously suggested that she would continue until she had broken Stenmark's record for World Cup race victories, she confirmed that she would retire in 2019 regardless of whether she managed to surpass Stenmark's tally, explaining that \"physically, I've gotten to the point where it doesn't make sense... I really would like to be active when I'm older, so I have to look to the future and not just be so focused on what's in front of me\". She also said that she aimed to compete in all downhills and super-Gs in the World Cup season, planning to make her debut at Lake Louise at the end of November.[74] However the following month she injured her knee whilst training at Copper Mountain, forcing her to pull out of the Lake Louise races.[75] Subsequently she announced that she would delay her retirement so she could compete at Lake Louise the following season.[76] Vonn finally made her season debut at Cortina d'Ampezzo in January, finishing 15th and 9th in the two downhills there[77] before failing to finish the super-G: after the latter race she told reporters that she was considering retiring immediately, stating that she would \"give it a couple of days and make some decisions\".[78] On February 1, 2019, Vonn announced that she would retire after the 2019 World Championships taking place in Sweden.[79] On February 10, 2019 after she won a bronze medal in women's downhill, she finally retired from the race circuit, with her wish to get flowers from Ingemar Stenmark as a goodbye being fulfilled.[80] With the clinching of the bronze she became the oldest woman to win a medal at a world championship (at age 34) and the first female racer to receive six world championship medals.[81]\n\nPersonal life [ edit ]\n\nVonn in March 2010 with 8 crystal globes, including 3 large ones for FIS World Cup overall titles and 5 smaller ones for various discipline titles\n\nLindsey Kildow married fellow 2002 Olympian and former U.S. Ski Team athlete Thomas Vonn on September 29, 2007, at the Silver Lake Lodge in Deer Valley, Utah.[82] In November 2011, the couple announced they would divorce after four years of marriage.[83] The divorce was finalized on January 9, 2013.[84]\n\nKildow, now still going by Vonn, met golfer Tiger Woods at a charity event in 2012. They started dating in March 2013 before splitting in May 2015.[85][86][87] In late 2016, she began dating NFL assistant coach Kenan Smith before splitting in November 2017.[88] In June 2018, she began dating P.K. Subban, a defenseman in the NHL.[89] On August 23, 2019 Vonn and Subban announced their engagement.[90] In December 2019 Vonn announced she proposed to Subban.[9]\n\nVonn appeared in the 2010 Sports Illustrated Swimsuit Edition which featured Olympians from the 2010 Winter Games.[91] She came in 59th on Maxim's Hot 100 list that year.[92] She appeared in the Sports Illustrated Swimsuit Edition again in 2016 wearing only bodypaint, and posed for the magazine once more in 2019.[93][94]\n\nIn 2005, as the winner of the downhill at Val d'Isère Vonn was offered a pregnant Tarine cow, a locally popular dairy breed. After the prize ceremony it was expected that she would sell it back to the organizers for $5,000. Vonn knew a farmer in Austria who would be willing to take care of the cow and decided to keep it, to the annoyance of organizers. She later acquired a goat the same way, which she gave away. As of 2014 she owned a small herd of cows on the farm.[95]\n\nDocumentary [ edit ]\n\nIn 2019, HBO released a documentary about Vonn entitled Lindsey Vonn: The Final Season.[96] The documentary covers her final World Championship season and her rise to fame from child prodigy to three-time Olympic medalist (one gold).\n\nBibliography [ edit ]\n\n2016: Strong Is the New Beautiful , (with Sarah Toland) Dey Street Books, ISBN 978-0-0624-0058-1 [97] [98]\n\n, (with Sarah Toland) Dey Street Books, ISBN 978-0-0624-0058-1 2019: Rise: My Story, Dey Street Books, ISBN 978-0062889447\n\nWorld Cup results [ edit ]\n\nSeason titles [ edit ]\n\n20 titles (4 overall, 8 downhill, 5 super-G, 3 combined)\n\nSeason Discipline 2008 Overall Downhill 2009 Overall Downhill Super-G 2010 Overall Downhill Super-G Combined 2011 Downhill Super-G Combined 2012 Overall Downhill Super-G Combined 2013 Downhill 2015 Downhill Super-G 2016 Downhill\n\nSeason standings [ edit ]\n\nSeason Age Overall Slalom Giant\n\nSlalom Super G Downhill Combined 2002 17 93 — — 35 41 — 2003 18 118 — — — 47 — 2004 19 30 38 45 26 14 — 2005 20 6 28 35 5 5 2006 21 5 9 49 4 2007 22 6 37 — 7 2008 23 32 13 6 2009 24 8 2010 25 14 28 2011 26 19 12 2012 27 20 2013 28 8 — 20 4 — 2014 29 68 — — 25 36 — 2015 30 — 29 — 2016 31 43 18 5 2017 32 19 — — 12 4 — 2018 33 10 — — 9 10 2019 34 72 — — — 31 —\n\nRace victories [ edit ]\n\n82 wins – (43 DH, 28 SG, 4 GS, 2 SL, 5 SC)\n\n137 podiums, 213 top tens\n\nWorld Championship results [ edit ]\n\nYear Age Slalom Giant\n\nSlalom Super G Downhill Combined 2005 20 — DNF1 9 4 4 2007 22 DNS1 — 2 2 DSQ2 2009 24 DNF2 — 1 1 DSQ2 2011 26 — — 7 2 DNS2 2013 28 — — DNF — — 2015 30 — 14 3 5 DNF2 2017 32 — — DNF 3 5 2019 34 — — DNF 3 DNS2\n\nOlympic results [ edit ]\n\nReferences [ edit ]\n\nQuotations related to Lindsey Vonn at Wikiquote Media related to Lindsey Vonn at Wikimedia Commons", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/15px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/22px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/23px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/Flag_of_Canada.svg/22px-Flag_of_Canada.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Flag_of_Liechtenstein.svg/15px-Flag_of_Liechtenstein.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Bronze_medal_icon.svg/16px-Bronze_medal_icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/30px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/20px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/German_Olympic_flag_%281959-1968%29.svg/22px-German_Olympic_flag_%281959-1968%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/15px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/23px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/22px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/22px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Princess_of_Asturias_Foundation_Emblem.svg/50px-Princess_of_Asturias_Foundation_Emblem.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Silver_medal_icon.svg/16px-Silver_medal_icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/15px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/15px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/15px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Gold_medal_icon.svg/16px-Gold_medal_icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/22px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/30px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/15px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Flag_of_Slovenia.svg/15px-Flag_of_Slovenia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/15px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/16px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Germany_%281935%E2%80%931945%29.svg/23px-Flag_of_Germany_%281935%E2%80%931945%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Vonn-lindsey_08-03-08_-_008.jpg/220px-Vonn-lindsey_08-03-08_-_008.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Lindsey_Vonn_with_8_Crystal_Globes.jpg/220px-Lindsey_Vonn_with_8_Crystal_Globes.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Flag_of_Slovenia.svg/23px-Flag_of_Slovenia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Flag_of_Canada_%281957%E2%80%931965%29.svg/23px-Flag_of_Canada_%281957%E2%80%931965%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg/1200px-2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sports_icon.png/30px-Sports_icon.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/29px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Flag_of_Slovenia.svg/22px-Flag_of_Slovenia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/15px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Flag_of_Bulgaria.svg/23px-Flag_of_Bulgaria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Lindsey_Vonn_CU.jpg/220px-Lindsey_Vonn_CU.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Women%27s_Super_G_podium_at_Whistler_Creekside_closeup.jpg/220px-Women%27s_Super_G_podium_at_Whistler_Creekside_closeup.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Lindsey_Vonn_2011.jpg/220px-Lindsey_Vonn_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg/220px-2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/22px-Flag_of_Germany.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Lindsey_Kildow_Aspen.jpg/220px-Lindsey_Kildow_Aspen.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/15px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/25px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg/1200px-2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lindsey_Vonn", "title": "Lindsey Vonn", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg/1200px-2017_Audi_FIS_Ski_Weltcup_Garmisch-Partenkirchen_Damen_-_Lindsey_Vonn_-_by_2eight_-_8SC8048.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}