{"url": "www.inquisitr.com/4352553/blac-chyna-hires-lisa-bloom-as-attorney-for-restraining-order-case-against-rob-kardashian/", "text": "Blac Chyna isn’t playing around with Rob Kardashian. The former King Of Diamonds stripper has hired celebrity attorney Lisa Bloom to file a restraining order against Kardashian.\n\nThe news came via a tweet from Bloom on Friday.\n\n“I represent Blac Chyna. I just gave Rob Kardashian notice that we’ll be in court Monday seeking restraining orders against him. More to come,” she tweeted.\n\nThe day before Bloom gave her opinion on the Blac Chyna-Rob Kardashian situation via the social media platform.\n\n“My take: what Rob Kardashian did to Blac Chyna could be ‘revenge porn,’ and illegal,” she wrote. “Women, stand up for our rights!”\n\nAs the Inquisitr previously reported, on Wednesday, Rob Kardashian went on a rampage against the mother of his child on Instagram and Twitter. His social media posts blasted Chyna for allegedly cheating on him in his bed. He also shared nude pictures of her and revealed that he had paid for her weight loss surgery after her pregnancy. Rob’s Instagram account was eventually suspended because of his posts, but then he continued his tirade on Twitter.\n\nIn response, Chyna posted a now deleted Snapchat where she accused Rob of abusing her physically.\n\nAs Gossip Cop reported, one of Chyna’s other attorneys, Walter Mosley, made a statement on her behalf soon after Kardashian’s tantrum cooled down.\n\nI represent Blac Chyna. I just gave Rob Kardashian notice that we'll be in court Monday seeking restraining orders against him. More to come — Lisa Bloom (@LisaBloom) July 7, 2017\n\nMy take: what Rob Kardashian did to Blac Chyna could be ‘revenge porn,’ and illegal. Women, stand up for our rights! https://t.co/Lyie5GzpcY — Lisa Bloom (@LisaBloom) July 6, 2017\n\n“I am exploring all legal remedies and protections available to my client at this time in attempts to best advise her on how she may want to proceed,” he wrote.\n\nBlac Chyna’s hiring of Lisa Bloom could be an indication that she intends to pursue “revenge porn” charges against Rob Kardashian in the future. According to Gossip Cop, Lisa Bloom has experience with this type of case. She has previously represented actress Mischa Barton who filed a restraining order against an ex who threatened to release a sex-tape of her.\n\nNo matter what you think of @BLACCHYNA, no one should post her nudes without her consent - https://t.co/3LezSQWC5U pic.twitter.com/3n62ZZr8ur — AFROPUNK (@afropunk) July 7, 2017\n\nRob Kardashian repossessed the cars he gave Blac Chyna ???? https://t.co/HhzHqEpmmE pic.twitter.com/Mbu1OWMxYj — Global Grind (@GlobalGrind) July 7, 2017\n\nIf Blac Chyna continues to pursue the matter, it could lead to very serious consequences for Rob Kardashian. As attorney Carrrie Goldberg told People Magazine, California has “very, very strong non-consensual pornography laws.”\n\n“This is sort of the classic, quintessential revenge porn,” said Goldberg, who is not an attorney for Chyna or Kardashian. “Rob has made the work of a prosecutor or a victim’s attorney quite easy so far as to even post about the very motive behind his outrageous act of posting these private and nude photos of his ex.”\n\nRob Kardashian's leaked Blac Chyna pictures could land him in jail—AND cost him millions https://t.co/YZiX3VvTPn pic.twitter.com/h5vUxYNKMH — Complex (@Complex) July 7, 2017\n\nRob Kardashian could be sentenced to up to six months in jail and a fine, Goldberg said. She also noted that Kardashian could face a civil lawsuit from Chyna as well.\n\nDo you think that Rob Kardashian will be punished for releasing Blac Chyna’s nude photos? How do you think this story will end? Let us know in the comments below.\n\nRELATED POSTS ON THE INQUISITR\n\nRob Kardashian Blasts Blac Chyna For Cheating And Claims T.I. And Tiny Paid Her For Sex, Blac Chyna Responds\n\nKardashian Family Worried About Baby Dream Since Rob Posted Chyna’s Nude Photos\n\nRob Kardashian Paid $100K For Blac Chyna’s Post-Baby Surgery— Nude Photos Considered Revenge Porn?\n\nWill The Kardashian’s Brother Face Charges For Leaking Nude Photos Of His Ex? Rob Threatens To Take Away Dream\n\n[Featured Image by Frazer Harrison/Getty Images]", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/07/Blac-Chyna-1.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4352553/blac-chyna-hires-lisa-bloom-as-attorney-for-restraining-order-case-against-rob-kardashian/", "title": "Blac Chyna Hires Lisa Bloom As Attorney For Restraining Order Case Against Rob Kardashian", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}