{"url": "https://www.self.com/story/exclusive-interview-with-make-1", "text": "Celeb Make Up Artist and Pond's spokesperson, Kayleen McAdams, gave us the scoop on everything from being a successful MUA to the stars, to her beauty essentials!\n\nQ: Where did you get your start as a make up artist?\n\nKayleen: I'm from Canada so I started working in Toronto. It was a lot of commerical work, working on music videos, that sort of thing. I interned at Flare Magazine where I learned a lot from all sides of the industry. Then I moved to LA and started assisting on projects. I feel like there is no better way to learn that to actually be assisting on a set.\n\nQ: You've worked on a lot of celebrities, how do you decide on a look for clients you are working on?\n\nKayleen: Sometimes people will have an idea of what they want, but mostly it's collaborative. I take into account the outfit, and I really like to talk to the hairdresser and see how they envision it. You want hair and everything to be cohesive so you take all that into account. Generally people have ideas and things that inspire them, too.\n\nQ: What's your favorite look to create for your sister, Rachel [McAdams]?\n\nKayleen: She's very creative and likes a lot of different things. I know a lot of people that I work with that have a very specific look, but Rachel always like it to be different which makes it so great. She likes a lot of colors and styles; a heavy lash and nothing on the lips, or a fun lip and simple eye.\n\nQ: What are some of your favorite products to use, such as a primer, sunscreen, lipgloss?\n\nKayleen: Primer - I really like Dior Skinflash for a primer, and Armani Foundation. For a lighter look, I like Jouer Luminizing Moisture Tint.\n\nSunscreen - For sunscreen I like Peter Thomas Roth, which is especially good for shoots. You can add it on top and it's easy to put on.\n\nMascara -Clinique Lash Power Mascara. It has the teeny tiniest little brush and I really like it for getting at the roots of the lashes. Then I can put heavier mascara at the ends. It deposits a lot of color close to the root of the lashes.\n\nLipgloss - I love Lancome. They make one called Simmer in their Juicy Tubes. It's kind of a great everyday color, peachy with a little bit of gold. I also really loves Nars Lip Gloss in Sandpiper.\n\nCleanser- I'm a big wipe person when it comes removing makeup. I really like Pond's Morning Refresh Wet Cleansing Towelettes. You can use them to take your makeup off at night and prep your face in the morning and they really get in their and get a lot of stuff off.\n\nQ: Do you have a favorite look for the summer?\n\nKayleen: I really love a good raspberry lip. I'll kind of do a sheer version. I think it really warms up the skin and because it's so hot, it's an easy way to bring out color without feeling heavy. Another look I like is colored eyeliner. I think a whole shadow can be really heavy. It's easy and quick to use a bright blue or purple and line your eyes and add a few coats of mascara. It's fun and you can wear it during the day.\n\nQ: How about getting a healthy glow without tanning?\n\nKayleen: I'm an embrace your paleness kind of person, but sometimes I'll put on a little powder bronzer. What I think is key is less what you use and more how you use it. You want to make sure you take care of your skin, makeup off at night, exfoliate and moisturize so you have a healthy canvas. When you put bronzer on you don't want to look like you're wearing it. I'll put it along the cheekbones, forehead and hairline, not all over the face. And if you use a little highlighter over the bronzer, even though its the opposite in color, it brings it out so you look glowy and sun-kissed.\n\nRelated: The SPF diet can protect your skin from sun damage\n\nQ: Any final advice for aspiring MUA's?\n\nKayleen: Get into contact with agencies or other make up artists that you like. Start working at a counter of a line that you're really into and just get in their to get your hands dirty. I think generally other artists want to teach and are collaborative, not competitive. It's a great way to learn techniques and on-set etiquette. That's very good to learn.\n\nRelated: Are you happy at your job? Discover your dreams!", "images": ["https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/57d8ef2cd3276fe232948dfd/2:1/w_1280,c_limit/shine-like-the-star-02-bess118.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg"], "top_img": "https://media.self.com/photos/57d8ef2cd3276fe232948dfd/2:1/w_1280,c_limit/shine-like-the-star-02-bess118.jpg", "keywords": [], "authors": ["Beauty News", "Beauty New"], "canonical_link": "https://www.self.com/story/exclusive-interview-with-make-1", "title": "Get Rachel McAdams' Gorgeous Glow (5 Minutes With Her Makeup Artist!)", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Beauty News", "copyright": "Copyright (c) Condé Nast 2020", "description": "Celeb Make Up Artist and Pond's spokesperson, Kayleen McAdams, gave us the scoop on everything from being a successful MUA to the stars, to her beauty essentials!...", "id": "57d8ef2c46d0cb351c8c7784", "keywords": "entertainment,celeb style,kayleen mcadams,makeup,rachel mcadams", "news_keywords": "entertainment,celeb style,kayleen mcadams,makeup,rachel mcadams", "robots": "index, follow", "content-type": "article", "parsely-post-id": "57d8ef2c46d0cb351c8c7784", "parsely-metadata": "{\"description\":\"Celeb Make Up Artist and Pond's spokesperson, Kayleen McAdams, gave us the scoop on everything from being a successful MUA to the stars, to her beauty essentials!...\",\"image-16-9\":\"https://media.self.com/photos/57d8ef2cd3276fe232948dfd/16:9/w_1000,c_limit/shine-like-the-star-02-bess118.jpg\",\"image-1-1\":\"https://media.self.com/photos/57d8ef2cd3276fe232948dfd/1:1/w_1000,c_limit/shine-like-the-star-02-bess118.jpg\"}", "og": {"description": "Celeb Make Up Artist and Pond's spokesperson, Kayleen McAdams, gave us the scoop on everything from being a successful MUA to the stars, to her beauty essentials!...", "image": "https://media.self.com/photos/57d8ef2cd3276fe232948dfd/2:1/w_1280,c_limit/shine-like-the-star-02-bess118.jpg", "site_name": "SELF", "title": "Get Rachel McAdams' Gorgeous Glow (5 Minutes With Her Makeup Artist!)", "type": "article", "url": "https://www.self.com/story/exclusive-interview-with-make-1"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Celeb Make Up Artist and Pond's spokesperson, Kayleen McAdams, gave us the scoop on everything from being a successful MUA to the stars, to her beauty essentials!...", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/57d8ef2cd3276fe232948dfd/2:1/w_1280,c_limit/shine-like-the-star-02-bess118.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "Get Rachel McAdams' Gorgeous Glow (5 Minutes With Her Makeup Artist!)"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}