{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/22/gayle-king-winced-at-stephen-colberts-charlie-rose-jokes-but-sat-for-an-interview-anyway/", "text": "Clearly, the “Late Show” conversation had to take a much different turn — as a result, King admitted she wanted to bail.\n\n“Stephen, I came this close to canceling,” King said at the top of the interview on Tuesday night.\n\n“I’m not surprised,” Colbert assured her, and recapped what transpired over the last 24 hours: After Rose was accused by eight different women of sexual harassment in a Post story that published Monday, CBS fired him and PBS dropped his “Charlie Rose” talk show. Colbert noted that King and her other “CBS This Morning” co-anchor, Norah O’Donnell, had to cover the story on-air Tuesday morning.\n\nAD\n\nAD\n\n“It couldn’t have been easy,” Colbert said.\n\nKing agreed. “It’s still very hurtful. Charlie and I, we’ve worked together, been friends. But when you think about the anguish of those women, despite the friendship, you still have to report the news,” she said. “That’s why I wanted to cancel, because I didn’t want to be sitting here talking about this. But when you think about the job we do at CBS, and how hard the people work … we are a top-notch broadcast operation. And that’s why I thought it was important to be here.”\n\nStill, King wasn’t a fan of Colbert’s Rose jokes in his monologue. Earlier, Colbert had read an excerpt from the Post story that alleged Rose once invited a woman to his house and suggested they watch a DVD of his show. “What woman alive doesn’t get aroused by an hour-long interview with Thomas Friedman?” Colbert cracked. Colbert also played a fake theme song for Charlie Rose’s show: “Here comes Charlie, oh no!/He’s gettin’ naked, open robe, he’s a creep!”\n\nAD\n\nAD\n\n“I was wincing at your monologue, though, Stephen,” King told him.\n\n“Well, you did your job this morning, I did my job tonight,” Colbert said.\n\n“I thought about that, too,” King said, adding that she laughed when Colbert made fun of others in his monologue. “Then it was Charlie and I thought ‘Oh, he’s a friend — I don’t like that.’ That’s difficult. And then I think about what these women were going through. I don’t like that either.”\n\nThe two discussed how the shocking day had unfolded, which included raw and emotional on-air statements from King and O’Donnell. King, who said she’s feeling a mix of anger, sadness, compassion and concern, revealed there was a company meeting Tuesday afternoon where everyone gathered in the conference room to process the day’s events.\n\nAD\n\n“We’re all sort of reeling about what has happened. It’s a stunning thing what happened in 24 hours. Monday, your world is one way, and in 24 hours, Charlie has been suspended and then he has been fired. Charlie Rose, who was an icon in this country,” King said. “I’m still wrapping my brain around that.”\n\nAD\n\nOf course, King said, she’s also thinking about the women who told their stories. “I applaud them for speaking up. If anything changes in this, what I do hope is that people will speak up and that companies are sending a message that, ‘We have zero tolerance for this kind of behavior.’ And that is a very important thing,” she said.\n\nBefore they eventually segued into much lighter topics — such as Oprah’s favorite things — Colbert asked whether King thinks the Harvey Weinstein revelations have sparked a permanent change in people’s willingness to talk about sexual harassment.\n\nAD\n\n“Women are no longer afraid to speak up. But the best part about it is they are now being believed. They are now being believed. That’s big,” King said. “But it has to be more than just a bunch of women talking about this issue. We really do need men to join this conversation. Nothing is going to change until men join the conversation, too, and more women are in places of power. That, also, is something that I think will change.”", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/resizer/ntw_ZD28ERPVNq2pb6eIuiMa6o8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/B76ZNHLZDU72VMFAG2RGWGJ65E.jpg"], "top_img": "https://www.washingtonpost.com/resizer/ntw_ZD28ERPVNq2pb6eIuiMa6o8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/B76ZNHLZDU72VMFAG2RGWGJ65E.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/22/gayle-king-winced-at-stephen-colberts-charlie-rose-jokes-but-sat-for-an-interview-anyway/", "title": "Gayle King ‘winced’ at Stephen Colbert’s Charlie Rose jokes but sat for an interview anyway", "meta_data": {"description": "\"Stephen, I came this close to canceling,” King said, given that she had the appearance booked hours after her “CBS This Morning” co-anchor was fired.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/22/gayle-king-winced-at-stephen-colberts-charlie-rose-jokes-but-sat-for-an-interview-anyway/", "image": "https://www.washingtonpost.com/resizer/ntw_ZD28ERPVNq2pb6eIuiMa6o8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/B76ZNHLZDU72VMFAG2RGWGJ65E.jpg", "title": "Gayle King ‘winced’ at Stephen Colbert’s Charlie Rose jokes but sat for an interview anyway", "description": "\"Stephen, I came this close to canceling,” King said, given that she had the appearance booked hours after her “CBS This Morning” co-anchor was fired."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Gayle King ‘winced’ at Stephen Colbert’s Charlie Rose jokes but sat for an interview anyway", "description": "\"Stephen, I came this close to canceling,” King said, given that she had the appearance booked hours after her “CBS This Morning” co-anchor was fired."}, "last_updated_date": "2018-02-26T00:26:40.087Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": ["https://www.youtube.com/embed/QTi4LZLJZEM?feature=oembed", "https://www.youtube.com/embed/B1XCBp5Qlec?feature=oembed"], "publish_date": 1511280000.0, "source": "https://www.washingtonpost.com", "summary": ""}