{"url": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "text": "Starting tomorrow, Aug. 1, the iconic Lollapalooza festival, launched as a touring show in 1991, returns for its 14th year at Grant Park in Chicago. The four-day event has plenty of big-name and rising acts on the bill to have you dancing until Sunday night, including GRAMMY winners Childish Gambino, Ariana Grande, Kacey Musgraves, Flume, H.E.R. and Lil Wayne. GRAMMY nominees Janelle Monáe, Death Cab For Cutie, Tame Impala, 21 Savage and J Balvin—who will make history during his headline set—will also bring fire to the fest, along with Rosalía, the Strokes, RÜFÜS DU SOL, Meek Mill, Maggie Rogers, King Princess and many more.\n\nTag 1 person not going to #Lolla so they'll know where you are TOMORROW!!! pic.twitter.com/bp5FC2XOya — Lollapalooza (@lollapalooza) July 31, 2019\n\nBetween the massive fest's eight stages and stacked lineup, there's plenty of music to get lost in and excited about. But the fun doesn't stop there: The mile-long outdoor venue will be packed with fun, and an insane offering of official Aftershows will bring many of your favorite artists to intimate venues around the city. Read on to find out six big reasons to get excited for Lolla 2019.\n\nJ Balvin's Historic (& Colorful) Headline Set\n\nLatin GRAMMY winner Balvin has made waves with his joyful, global-airwaves ready take on reggaeton. Earlier this year, he brought pure joy to Coachella's main stage, with backup dancers dressed as clouds and cookies and surprise cameos from fellow Spanish-language heavy-hitters Rosalía and Bad Bunny.\n\nWhen he takes the stage this Saturday night at Lolla, he will make history as the fest's first Latino headliner. Especially given that one of his major drives as an artist is to break barriers for fellow Spanish-speaking artists and allow Latinos to shine front and center in the global spotlight, this will be a moment not to be missed.\n\n\"I want to change the perception about Latinos worldwide. I think people don't know yet how cool we are,\" Balvin told The New York Times in 2016. \"When you see a movie, they always put the Latino on the bad side or in a tacky way. It's not like that. Latinos are shining like a diamond.\" Shine on, Mr. Balvin. You can catch his glow at 8:45 p.m. Saturday night.\n\nRosalía's Fresh Take On Flamenco\n\nLatin GRAMMY winner Rosalía, hailing from Barcelona, has also been creating a buzz with her unique brand of música en Español, which is directly influenced from her years studying her country's traditional music and dance, Flamenco. With her captivating voice and empowering lyrics, she blends flamenco claps—palmas—and exclamations—gritas—with infectious electronic beats that she co-produces with El Guincho for music that gets you moving (and maybe even crying).\n\nRosalía also performed at Coachella this year, as a special guest of Balvin's and for her own much-buzzed about Friday performance, as well as at Lolla's Argentina and Chile fests. With killer outfits and choreography backed by her squad of fellow badass women, her live performance will suck you into her artistic vortex. You can watch her magic Sunday night at 6:00 p.m.\n\ni didn’t say- pic.twitter.com/aZQ5k4QnpB — K A C E Y M U S G R A V E S (@KaceyMusgraves) April 13, 2019\n\nKacey Musgraves' Golden Hour\n\nEarlier this year at the 61st GRAMMY Awards, country-pop queen Kacey Musgraves earned both Album Of The Year and Best Country Album for her dreamy fourth studio album Golden Hour, along with two other wins for its singles. She has fully stepped into her new role as the vibey sunset queen, performing at several big festivals during the coveted sunset slot.\n\nStarting with a beloved Coachella golden hour set, she brought her powerful voice, coy lyrics and Southern charm (hello, yee-haw jokes!) to other fests this summer, including Governor's Ball and Bonnaroo, during the set time made for this golden lady.\n\n\"All that I know, is you caught me at the right time / Keep me in your glow, 'cause I'm having such a good time with you,\" Musgraves sings on the LP's title track. You can enjoy the glow with her on Sunday at Lolla at her 6:30 p.m. performance.\n\nDJ Diesel, A.k.a. Shaq, Is Ready To Get You Dancing\n\nIt may have been a few years since retired NBA MVP Shaquille O'Neal wowed the world with his skills on the court, but when he's not on the sidelines as a sports analyst/commentator, he's busy with his other passion: music. In 1993, he tried out his rap skills and released his first (platinum!) album, Shaq Diesel. He has been making the rounds as a DJ since his first major gig at TomorrowWorld 2015, although, as he recently told Beats1, he has been DJing since 1986.\n\nRecently, he's been on a roll with DJ career—he goes by DJ Diesel now—performing his favorite bass, dubstep and hip-hop selections at more big EDM fests like Tomorrowland in Belgium and nightclubs across the globe for his Summer League 2019 tour.\n\nYou may even get to dance with him at the crowd like the stoked Tomorrowlanders that got to rave with him, as witnessed in the amazing video (below) Shaq shared on his Instagram.\n\nOver 55 Aftershows To Keep You Groovin' All Week\n\nWhether or not they're planning on attending the festival each day, many Chicago residents will no doubt find their way into one of the many official Lolla Aftershows held around the city. According to Lolla, this year there are over 55 shows and 110 artists offered, offering a chance to see many of the acts in a more intimate setting. Indie-rock standbys Death Cab For Cutie will be performing a sold-out show at the Metro on Thursday night, while Hozier will take it over on Wednesday. Gary Clark Jr. and Fantastic Negrito will bring the vibes to the Metro on Friday, followed by Musgraves on Saturday and Louis the Child closing it out with their lively Playground party on Sunday.\n\nAnd that's just one out of 23 Aftershow venues! FISHER and RÜFÜS DU SOL will have the clubs going up on a Thursday, at Soundbar and Spybar respectively, with RUFUS also offering a live show at the Vic Theater on Wednesday night, before the bring the vibes to their Thursday evening performance at the fest. The 10th Annual Lollapalooza Sideshow, co-hosted by Chicago's Queer Pride org and C3, who runs Lolla, will bring circus-style entertainment and great music, from King Princess and several DJs to the East Room.\n\nThe Pop-up LollaShop across the street from Grant Park at Jackson and Michigan is open NOW! Shop early and often before, during, and after Lollapalooza. https://t.co/TxVwCz1j1I pic.twitter.com/ABCSQoyho6 — Lollapalooza (@lollapalooza) July 30, 2019\n\nA Mile Of Fun Around The Park\n\nFrom Chow Town, where you can enjoy a taste of the best local noms Chicago has to offer, to Lolla Cares, which can help you get involved with impactful nonprofit organizations, including the Obama Foundation, HeadCount and MusiCares, there is plenty to do in between your favorite artists' sets.\n\nAnd when you're not eating everything in sight, you can live your best life on the roller-skating rink or going shopping at booths from local vendor and the extensive merch offerings, as well as find the brands giving out swag and experiences, like American Eagle's free fanny packs.\n\nStay tuned to GRAMMY.com for exclusive interviews and content during Lolla 2019. You can view the full schedule and save your favorites on Lolla's website, where you can also find the Aftershow list and other helpful info like the app and a map. Have fun, stay hydrated and we'll catch you out there, or from your couch as you peep the fest's livestream.\n\nBackstage At Newport Folk Festival's 60th Anniversary", "images": ["https://www.grammy.com/sites/com/files/styles/news_detail_header/public/blk.png?itok=Tya2JFon", "https://www.grammy.com/sites/com/themes/custom/com/logo.png", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-1062036782.jpg?itok=iLHFZohI", "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-1062036782.jpg?itok=5ITSR9--", "https://www.grammy.com/sites/com/themes/custom/com/images/grammy-dark.png", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm-hero_malucamala_nologo.jpg?itok=zJr2szme", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm-hero_ibeyi_nologo.jpg?itok=ImIV0gnd", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm-hero_karolg_nologo.jpg?itok=n-c4tduK", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/rosalia_autecuture.jpg?itok=d7y6E56r", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm_hero_celiacruz_nologo.jpg?itok=e56vmJKo", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm_hero_esperanzaspalding_nologo.jpg?itok=HJTF3bNc", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-1187737044.jpg?itok=a8_8at60", "https://pixel.quantserve.com/pixel/p-6E7VtLJEcC5ky.gif", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm-hero_princessnokia_nologo.jpg?itok=a1LfodGR", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm_hero_amaralenegra_nologo_0.jpg?itok=ybkpKdDq", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/rosalia_j_balvin_coachella2019_gettyimages-1136955699.jpg?itok=FmKJPpg7", "https://www.grammy.com/sites/com/files/styles/image_square_teaser/public/hhm_hero_badbunny_nologo.jpg?itok=EtGOwHkN"], "top_img": "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-1062036782.jpg?itok=5ITSR9--", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "title": "2018 Latin GRAMMY Awards Complete Winners List", "meta_data": {"MobileOptimized": "width", "HandheldFriendly": "true", "fb": {"pages": "36736245747,268472583187472,196044303765874,64142649602"}, "drupal_parsely_version": "0.1", "description": "Find out who won at the 19th Latin GRAMMY Awards in Las Vegas.", "keywords": "2018 Latin GRAMMY Awards Complete Winners List, GRAMMYs, GRAMMYs news, grammy.com", "viewport": "width=device-width", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "GRAMMY.com", "type": "article", "url": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "title": "2018 Latin GRAMMY Awards Complete Winners List", "description": "Find out who won at the 19th Latin GRAMMY Awards in Las Vegas.", "updated_time": "2019-09-10T03:48:37-07:00", "image": {"identifier": "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-1062036782.jpg?itok=5ITSR9--", "type": "image/jpeg", "width": 1200, "height": 630}}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@RecordingAcad", "id": 17243213}, "url": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "description": "Find out who won at the 19th Latin GRAMMY Awards in Las Vegas.", "title": "2018 Latin GRAMMY Awards Complete Winners List", "image": {"src": "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-1062036782.jpg?itok=5ITSR9--", "width": 1200, "height": 630}}, "article": {"published_time": "2018-09-20T8:28:39", "modified_time": "2019-09-10T03:48:37-07:00"}}, "movies": ["https://www.youtube.com/embed/3P5DNAe4rFc"], "publish_date": 1537403319.0, "source": "https://www.grammy.com", "summary": ""}