{"url": "https://www.usatoday.com/story/life/people/2018/07/24/celebrities-tweet-support-demi-lovato-after-possible-overdose/829894002/", "text": "Matthew Wilson\n\nUSA TODAY\n\nWith the news that Demi Lovato has been hospitalized after a possible drug overdose, friends and celebrities took to Twitter to offer support and prayers for the singer.\n\nJustin Timberlake tweeted that he was praying for the singer and reminded her, \"You are loved.\"\n\nSimilarly, Bruno Mars offered his \"love and prayers.\"\n\n\"Like all of you I am reeling at the news about Demi,\" Nick Jonas shared on the social media site. \"All of us love her and need to pray for her to get well. She is a fighter.\"\n\nActress/singer Zendaya sent \"absolutely all my love to @ddlovato and her family at this time.\"\n\nRyan Seacrest described Lovato as \"a light and inspiration to many,\" adding \"we are all wishing her a full recovery.\"\n\nIn a tweet directly to Lovato, singer Dua Lipa said: \"Dear @ddlovato you are a force to be reckoned with and stronger than you think. We’re all here for you.\"\n\nFormer professional basketball player Dennis Rodman shared of photo with Lovato and encouraged her to \"Stay strong!\"\n\nLady Gaga said she was thankful Lovato is OK.\n\n\"We should all wrap our arms of love around Demi Lovato. I am so happy you’re alive. Thank God. If I know my monsters as well as I believe I do, we all wish you self-compassion and inner peace. And may you receive the love so many have for you. #ImConfidentInDemi Demi, I love you,\" she wrote.\n\nLovato's former \"Camp Rock\" co-star (and ex) Joe Jonas said he had the singer in his thoughts.\n\n\"Like all of you I am thinking of @DDLovato right now,\" he tweeted. \"She needs our prayers and support. We all know how strong you are Demi.\"\n\nKehlani, who opened for Lovato on tour earlier this year, wrote that she was \"sending huge recovery love to Demi. this is a very personal moment and respected delicately. all we can do is send our best wishes and love. addiction isn’t simple nor easy. you’re very loved, @ddlovato you’ll beat this as you did before.\"\n\nGossip blogger Perez Hilton admitted he'd had a \"falling out\" with Lovato but said \"this hurts.\" In a video, he added, \"I want nothing bad to happen to her. I don't even know what to say. I'm in a state of shock. Her family is a family of addicts. Her mother has been vocal about her addiction issues. Her father died of his addiction issues.\"\n\nLili Reinhart, who stars on CW's \"Riverdale,\" said Lovato has always been her idol. She said she was \"praying for @ddlovato and her health. When I was 14, she was an idol to me in how she spoke so openly about mental health. And now she continues to inspire thousands of young men and women with her body positivity messages. Addiction and mental illness doesn’t discriminate.\"\n\nCountry star Brad Paisley, who collaborated with Lovato on a song from his newest album, tweeted his support: \"My friend @ddlovato is one of the kindest, most talented people I’ve ever met. Praying for her right now, addiction is a terrifying disease. There is no one more honest or brave than this woman.\"\n\nTV host Ellen DeGeneres tweeted: \"I love @DDLovato so much. It breaks my heart that she is going through this. She is a light in this world, and I am sending my love to her and her family.\"\n\nSinger Kesha also tweeted: \"Love u @ddlovato thinking of you + your family + fans + friends praying for you and thinking of you\"\n\nSinger Ariana Grande tweeted: \"i love u.\"\n\nActress and singer Victoria Justice tweeted: \"Praying for Demi Lovato Very sad to hear this news...\"\n\nSupermodel and TV personality Tyra Banks tweeted: \"Addiction is not a choice. My heavy heart sends healing love to @ddlovato, and I pray she recovers fully and with great health.\"\n\n\"American Idol\" alum Adam Lambert tweeted: \"Hang in there @ddlovato - sending good energy and love.\"\n\nSinger Bebe Rexha tweeted: \"I’m praying for you with everything in me @ddlovato. You are so loved.\"\n\nTV host Wendy Williams tweeted: \"So sorry to hear about Demi Lovato being hospitalized. Sending love and healing prayers to her.\"\n\nLovato's \"Camp Rock\" cast mate Alyson Stoner tweeted: \"only love and support, save the rest. @ddlovato\"\n\nActress and model Ruby Rose tweeted: \"My whole heart and my whole soul is with @ddlovato today. I adore you and so does the entire world. You will fight this and you will come out of it even stronger. Addiction is powerful beyond measure, but you can defeat it. I love you.\"\n\nRapper Missy Elliot tweeted:\"Sending Prayers for Demi Lovato you just never know what people are going through so please have compassion & no jokes but let’s be encouraging so she will get the help she needs\"\n\nOlympic Figure Skater Adam Rippon tweeted: \"Thinking of and sending love to @ddlovato. Addiction is very real.\"\n\nSinger Marren Morris tweeted: \"I don’t even know what to say except I’m thinking of you @ddlovato.\"\n\nActress Kat Dennings tweeted: \"Sending lots of good thoughts and love to @ddlovato\"", "images": ["https://www.gannett-cdn.com/-mm-/d4dfc4047927ceb2030f1cbd51f4e2cbfd0512b4/c=0-53-2889-1685/local/-/media/2018/07/24/USATODAY/USATODAY/636680455949218166-AP-People-Demi-Lovato.JPG?width=660&height=373&fit=crop&format=pjpg&auto=webp", "http://www.gannett-cdn.com/-mm-/274a566c1389576a669ef2447473c574c2df4d86/c=0-53-2889-1685&r=1280x720/local/-/media/2018/07/24/USATODAY/USATODAY/636680455949218166-AP-People-Demi-Lovato.JPG?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/07/24/USAT/cc49758f-4e69-48fd-9b17-810780290868-GTY_545685008.jpg?crop=2529,1423,x0,y0&width=2529&height=1423&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/07/24/USAT/cc49758f-4e69-48fd-9b17-810780290868-GTY_545685008.jpg?crop=2529,1423,x0,y0&width=2529&height=1423&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/07/24/celebrities-tweet-support-demi-lovato-after-possible-overdose/829894002/", "title": "Joe Jonas, more celebs tweet support for Demi Lovato following possible drug overdose", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Joe Jonas, more celebs tweet support for Demi Lovato following possible drug overdose", "description": "Following a possible drug overdose, Lady Gaga, Bruno Mars, Justin Timberlake and others tweet their support for Demi Lovato.", "url": "https://www.usatoday.com/story/life/people/2018/07/24/celebrities-tweet-support-demi-lovato-after-possible-overdose/829894002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/07/24/USAT/cc49758f-4e69-48fd-9b17-810780290868-GTY_545685008.jpg?crop=2529,1423,x0,y0&width=2529&height=1423&format=pjpg&auto=webp", "width": 2529, "height": 1423}, "type": "article"}, "article": {"author": "Matthew Wilson", "content_tier": "free", "opinion": "false"}, "description": "Following a possible drug overdose, Lady Gaga, Bruno Mars, Justin Timberlake and others tweet their support for Demi Lovato.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/07/24/USAT/cc49758f-4e69-48fd-9b17-810780290868-GTY_545685008.jpg?crop=2529,1423,x0,y0&width=1600&height=800&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Joe Jonas, more celebs tweet support for Demi Lovato following possible drug overdose", "description": "Following a possible drug overdose, Lady Gaga, Bruno Mars, Justin Timberlake and others tweet their support for Demi Lovato."}}, "movies": [], "publish_date": 1532361600.0, "source": "https://www.usatoday.com", "summary": ""}