{"url": "https://www.cheatsheet.com/gear-style/kourtney-kardashian-beauty-secrets-manuka-honey-coconut-oil.html/", "text": "Kim Kardashian West and Kylie Jenner might own beauty lines, but Kourtney Kardashian is the real beauty guru in the Kardashian-Jenner family. If you watch Keeping Up With The Kardashians or read Kourtney’s blog, you might have noticed just how passionate the reality star is about natural beauty.\n\nAhead, we take a look at some of Kourtney Kardashian’s beauty secrets for natural skin care, including what natural deodorant she uses and how she keeps her skin hydrated with manuka honey.\n\nKourtney Kardashian uses natural ingredients in her skin care regimen. | Chris Delmas/AFP/Getty Images Kourtney Kardashian uses natural ingredients in her skin care regimen. | Chris Delmas/AFP/Getty Images\n\nCoconut oil\n\nSuperfood ingredients such as coconut oil have made their mark on natural skin care and beauty products. And, like many natural beauty devotees, Kourtney is no stranger to its beauty benefits. On top of using the natural oil in her hair, the reality star likes to moisturize her body with it, too. According to her app, Kourtney applies coconut oil to her body skin “right out of the shower” and let it sit for 10 minutes.\n\nIn addition, the reality star uses coconut oil in some homemade beauty recipes, too. One of Kourtney’s go-to’s? A DIY lip scrub made with coconut oil, manuka honey, and sugar. The natural concoction gently sloughs off dry skin and nourishes for a silky soft, smooth, lipstick-ready pout.\n\nManuka honey\n\nAnother all-natural ingredient Kourtney Kardashian swears by for skin care? Manuka honey. The reality star is a big fan of Manuka Doctor skin care products and also swears by the all-natural superfood honey for home skin treatments.\n\nThanks to its natural humectants and anti-aging properties, manuka honey can be used in beauty for many things. For soft, hydrated skin, more youthful-looking skin, apply manuka honey to the complexion as a face mask and let it sit for about 10 minutes before rinsing. You can also add it to homemade beauty product or as a spot treatment on pimples. In addition to being anti-aging and hydrating, manuka honey also boasts anti-bacterial properties that can help combat breakouts and keep the complexion clear.\n\ngood morning A post shared by Kourtney Kardashian (@kourtneykardash) on Oct 7, 2017 at 10:57am PDT\n\nNatural deodorant\n\nLike other celebrities and wellness aficionados, Kourtney no longer uses chemical-ridden deodorants and switched to a natural deodorant. “Changing over to an all-natural deodorant seemed like an important thing to do when I heard that when people are diagnosed with breast cancer, they are told to immediately discontinue using conventional antiperspirants and deodorants,” the reality star shared in a blog post. “Although research connecting the parabens and aluminum from these products directly with breast cancer is inconclusive, I like to play it safe,” she concluded.\n\nSo, what natural deodorant does Kourtney swear by? Schmidt’s Natural Ylang Ylang + Calendula deodorant. At $8.99 a pop, the natural deodorant is more affordable than other other natural brands. In addition, it features an award-winning formula made with essential oils and free of aluminum, parabens, propylene glycol, and phthalates.\n\nNatural sunscreen\n\nDeodorant isn’t the only natural skin product Kourtney likes to use. As a California native, the reality star knows how crucial it is to protect her skin from the sun. That said, like many of her products, she prefers a more natural formula. Her favorite natural sunscreen? Drunk Elephant Umbra Sheer Physical Daily Defense Broad Spectrum Sunscreen SPF 30.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/07/GettyImages-667872056-640x461.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/07/GettyImages-667872056-640x461.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GettyImages-667872056-640x461.jpg", "keywords": [], "authors": ["Jessie Quinn"], "canonical_link": "https://www.cheatsheet.com/gear-style/kourtney-kardashian-beauty-secrets-manuka-honey-coconut-oil.html/", "title": "Beauty Secrets Kourtney Kardashian Swears By For Natural Skin Care", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/gear-style/kourtney-kardashian-beauty-secrets-manuka-honey-coconut-oil.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Kim Kardashian West and Kylie Jenner might own beauty lines, but Kourtney Kardashian is the real beauty guru in the Kardashian-Jenner family. If you watch", "og": {"locale": "en_US", "type": "article", "title": "Beauty Secrets Kourtney Kardashian Swears By For Natural Skin Care", "description": "Kim Kardashian West and Kylie Jenner might own beauty lines, but Kourtney Kardashian is the real beauty guru in the Kardashian-Jenner family. If you watch", "url": "https://www.cheatsheet.com/gear-style/kourtney-kardashian-beauty-secrets-manuka-honey-coconut-oil.html/", "site_name": "Showbiz Cheat Sheet", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GettyImages-667872056-640x461.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GettyImages-667872056-640x461.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "The Kardashians", "section": "Gear & Style", "published_time": "2018-07-05T19:52:52-04:00"}, "twitter": {"card": "summary_large_image", "description": "Kim Kardashian West and Kylie Jenner might own beauty lines, but Kourtney Kardashian is the real beauty guru in the Kardashian-Jenner family. If you watch", "title": "Beauty Secrets Kourtney Kardashian Swears By For Natural Skin Care", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GettyImages-667872056-640x461.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1530834772.0, "source": "https://www.cheatsheet.com", "summary": ""}