{"url": "https://web.archive.org/web/20161115184617/http://rare.us/story/rand-paul-will-donald-trump-betray-voters-by-hiring-john-bolton/", "text": "By Sen. Rand Paul (R-Ky.)\n\nRumors are that Donald Trump might pick John Bolton for Secretary of State. Heaven forbid.\n\nOne of the things I occasionally liked about the President-elect was his opposition to the Iraq war and regime change. He not only grasped the mistake of that war early, but also seemed to fully understand how it disrupted the balance of power in the Middle East and even emboldened Iran.\n\nWe liberated Iraq, but today their best friend is Iran, their second greatest ally is Russia, and their third strongest alliance is with Syria. Trump really seems to get the lesson. Hillary Clinton never did.\n\n\n\n\n\nRELATED: Rand Paul: The president cannot use out-of-date authorities to send our troops to war\n\nMost importantly right now, John Bolton never learned and never will.\n\nBolton is a longtime member of the failed Washington elite that Trump vowed to oppose, hell-bent on repeating virtually every foreign policy mistake the U.S. has made in the last 15 years — particularly those Trump promised to avoid as president.\n\nJohn Bolton more often stood with Hillary Clinton and against what Donald Trump has advised.\n\nNone of this is secret. It’s all out there. Perhaps the incoming administration should take a closer look.\n\nBolton was one of the loudest advocates of overthrowing Saddam Hussein and still stupefyingly insists it was the right call 13 years later. “I still think the decision to overthrow Saddam was correct,” Bolton said just last year.\n\nTrump, rightly, believes that decision was a colossal mistake that destabilized the region. “Iraq used to be no terrorists,” Trump said in 2015. “(N)ow it’s the Harvard of terrorism.”\n\n“If you look at Iraq from years ago, I’m not saying he was a nice guy, he was a horrible guy,” Trump said of Saddam Hussein, “but it was a lot better than it is right now.”\n\nTrump has said U.S. intervention in Iraq in 2003 “helped to throw the region into chaos and gave ISIS the space it needs to grow and prosper.” In contrast, Bolton has said explicitly that he wants to repeat Iraq-style regime change in Syrian and Iran.\n\nYou can’t learn from mistakes if you don’t see mistakes.\n\nTrump has blamed George W. Bush, Barack Obama and Hillary Clinton for helping to create ISIS — but should add John Bolton to that list, who essentially agreed with all three on our regime change debacles.\n\nIn 2011, Bolton bashed Obama “for his refusal to directly target Gaddafi” and declared, “there is a strategic interest in toppling Gaddafi… But Obama missed it.” In fact, Obama actually took Bolton’s advice and bombed the Libyan dictator into the next world. Secretary of State Clinton bragged, “We came, we saw, he died.”\n\nWhen Trump was asked last year if Libya and the region would be more stable today with Gaddafi in power, he replied “100 percent.” Mr. Trump is 100 percent right.\n\nNo man is more out of touch with the situation in the Middle East or more dangerous to our national security than Bolton.\n\nAll nuance is lost on the man. The fact that Russia has had a base in Syria for 50 years doesn’t deter Bolton from calling for all out, no holds barred war in Syria. Bolton criticized the current administration for offering only a tepid war. For Bolton, only a hot-blooded war to create democracy across the globe is demanded.\n\nWoodrow Wilson would be proud, but the parents of our soldiers should be mortified. War should be the last resort, never the first. War should be understood to be a hell no one wishes for. Dwight Eisenhower understood this when he wrote, “I hate war like only a soldier can, the stupidity, the banality, the futility.”\n\nBolton would not understand this because, like many of his generation, he used every privilege to avoid serving himself. Bolton said, with the threat of the Vietnam draft over his head, that “he had no desire to die in a Southeast Asian rice paddy.” But he’s seems to be okay with your son or daughter dying wherever his neoconservative impulse leads us: “Even before the Iraq War, John Bolton was a leading brain behind the neoconservatives’ war-and-conquest agenda,” notes The American Conservative’s Jon Utley.\n\nAt a time when Americans thirst for change and new thinking, Bolton is an old hand at failed foreign policy.\n\nThe man is a menace.\n\nRELATED: Rand Paul says Republicans’ top priority will be to repeal Obamacare\n\nOur Constitution and our founding fathers were explicit war was not to be fought without the permission of Congress. No matter which party occupies the White House, I will not shrink from my constitutional duty to oppose any advocate for war.\n\nThe true statesmen realizes, with reluctance, that war is sometimes necessary but as a country, we should resist any would-be leader who wants to bomb now and think later.\n\nPresident-elect Donald Trump campaigned on changing our disastrous foreign policy. To appoint John Bolton would be a major first step toward breaking that promise.\n\nRand Paul is the junior senator from Kentucky.", "images": ["https://web.archive.org/web/20161115184617im_/https://s0.wp.com/wp-content/themes/vip/cox-rare-platform/page-templates/ideal/img/svg-menu/menu-user.svg", "https://web.archive.org/web/20161115184617im_/https://s0.wp.com/wp-content/themes/vip/cox-rare-platform/page-templates/ideal/img/svg-menu/menu-discuss.svg", "https://web.archive.org/web/20161115184617im_/https://s0.wp.com/wp-content/themes/vip/cox-rare-platform/page-templates/ideal/img/svg-menu/menu-discuss-stars.svg", "https://web.archive.org/web/20161115184617im_/http://b.scorecardresearch.com/p?c1=2&c2=6035944&cv=2.0&cj=1", "https://web.archive.org/web/20161115184617im_/https://s0.wp.com/wp-content/themes/vip/cox-rare-platform/page-templates/ideal/img/svg-menu/menu-forum.svg", "https://web.archive.org/web/20161115184617im_/https://coxrare.files.wordpress.com/2016/11/ap_395003486389.jpg?w=115", "https://web.archive.org/web/20161115184617im_/https://s0.wp.com/wp-content/themes/vip/cox-rare-platform/page-templates/ideal/img/svg-menu/menu-page.svg", "https://web.archive.org/web/20161115184617im_/http://pixel.quantserve.com/pixel/p-38KriKc8Foyx-.gif", "https://web.archive.org/web/20161115184617im_/http://t.co/i/adsct?txn_id=nunws&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://web.archive.org/web/20161115184617im_/https://ct.pinterest.com/?tid=4zyabz5KGmz&value=0.00&quantity=1", "https://web.archive.org/web/20161115184617im_/https://www.facebook.com/tr?id=281660582191764&ev=PageView&noscript=1", "https://web.archive.org/web/20161115184617im_/http://pixel.wp.com/b.gif?v=noscript", "https://web.archive.org/web/20161115184617im_/https://analytics.twitter.com/i/adsct?txn_id=nunws&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://web.archive.org/web/20161115184617im_/https://coxrare.files.wordpress.com/2016/11/ap_120113029694.jpg?w=1200&h=627&crop=1"], "top_img": "https://web.archive.org/web/20161115184617im_/https://coxrare.files.wordpress.com/2016/11/ap_120113029694.jpg?w=1200&h=627&crop=1", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20161115184617/http://rare.us/story/rand-paul-will-donald-trump-betray-voters-by-hiring-john-bolton/", "title": "Rand Paul: Will Donald Trump betray voters by hiring John Bolton?", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "description": "Mr. President-elect, don’t pick your antithesis for Secretary of State.", "keywords": "all news, rare politics, the populist, iraq war, john bolton, neoconservative, our picks, politics, pov", "google-site-verification": "qjEeGPh_pUnPOI1ZKNpmhrg9K6JyV91gtuRnUHMU_q8", "fb": {"admins": 635093689, "app_id": 633178450066705}, "p": {"domain_verify": "c0809c6c9b1d4d37973dce032db72e5b"}, "generator": "WordPress.com", "og": {"type": "article", "title": "Rand Paul: Will Donald Trump betray voters by hiring John Bolton?", "url": "https://web.archive.org/web/20161115184617/http://rare.us/story/rand-paul-will-donald-trump-betray-voters-by-hiring-john-bolton/", "description": "Mr. President-elect, don’t pick your antithesis for Secretary of State.", "site_name": "Rare", "image": {"identifier": "https://web.archive.org/web/20161115184617im_/https://coxrare.files.wordpress.com/2016/11/ap_120113029694.jpg?w=1200&h=627&crop=1", "width": 1200, "height": 627}, "locale": "en_US"}, "article": {"published_time": "2016-11-15T13:49:28+00:00", "modified_time": "2016-11-15T15:10:01+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"site": "@rare", "image": {"src": "https://coxrare.files.wordpress.com/2016/11/ap_120113029694.jpg?w=640"}, "card": "summary_large_image", "creator": "@rare"}, "rare": {"category_slug": "rare-politics", "category_name": "Rare Politics"}, "application-name": "Rare", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "America's News Feed", "msapplication-task": "name=Subscribe;action-uri=http://rare.us/feed/;icon-uri=http://0.gravatar.com/blavatar/a2370cbbdae7d7f76d833a9ccc9cf5c5?s=16"}, "movies": [], "publish_date": 1479217768.0, "source": "https://web.archive.org", "summary": ""}