{"url": "www.theringer.com/2017/4/4/16040776/jennifer-lopez-alex-rodriguez-celebrity-couple-3544f34136a4", "text": "April 3, 2017, was in many ways an unremarkable early-spring day. Baseball season began in earnest. Charo was eliminated on Dancing With the Stars.\n\nBut everything changed when Alex Rodriguez and Jennifer Lopez hit the streets of New York to film a scene for their shot-by-shot remake of American Hustle. She was Amy Adams. He was Christian Bale, Bradley Cooper, Robert De Niro, and Jeremy Renner all at the same time:\n\nI’ll return to this photo in a moment. But first, context. After one short month of public dating, J-Rod (or A.Lo, or Lo-Riguez, or Rod-Pez, whatever you want to call it) are carrying themselves as if theirs is the most important celebrity romance in the world. And it may be. They are all the way out here, baring midriff, carrying notebooks, pointing like goddamn maniacs.\n\nHow did we get here? Let’s do what any good gossip cop would do: establish a timeline and subject paparazzi photos to extreme scrutiny. If Alex Rodriguez had Jennifer Lopez’s love, and she gave him all her trust, would he comfort her? We’re about to find out.\n\nLove is thorny, friends. Sometimes it shows up when you’re least expecting it, like less than a month after you’ve announced your breakup with Silicon Valley CEO Anne Wojcicki. Sometimes it comes at an inopportune time, like a month before Drake raps about drunk-texting you. That was the state of affairs earlier this year. Us Weekly reported that Lopez’s relationship with Drake had ended after two totally not fake months in early February. Rodriguez announced his months-earlier split with Wojcicki on February 25. And then this from Page Six, delivered on March 8, 2017, as if one of Cupid’s arrows: “Call them J-Rod! Or is it A.Lo?” Famous baseball player Alex Rodriguez and famous singer and actress Jennifer Lopez had apparently been dating “for a few months,” and we’d been none the wiser. But the proof was incontrovertible: Page Six also reported that Lopez liked one of A-Rod’s Instagram posts, and that Rodriguez had been “blown away” by Lopez’s one-woman revue in Las Vegas, which he saw “with his friends.”\n\nBy March 11 — three brief days after this couple forced New York’s most august gossip institution to ponder portmanteau — things had gotten serious. I know this because they were photographed together on a boat, and you don’t take a casual fling on a boat. Especially not to the Bahamas.\n\nThat was Saturday. The following morning, Lopez was flush with the kind of romantic feeling you get only from having spent the weekend at Baker’s Bay Golf & Ocean Club, which provides an “unforgettable Bahamian experience.” So she decided to let the world know via Instagram, the intimate social media network where she has 62.1 million followers. In Lopez’s grainy selfie — added to her Instagram story — she’s front and center, wearing a contented expression I can describe only as radically postcoital. Behind her right ear, Rodriguez’s face is visible but obscured. He’s playing with her hair, or maybe nibbling on her ear. He looks like a clown. It’s incredibly sweet. Lopez quickly deleted the post, but not before broadcasting it to some portion of her follower base the size of the United Kingdom, give or take a few million people. The game was on.\n\nLater that week, the couple was photographed (separately) on their way to dinner (together) in Miami. They wore coordinated Very Miami outfits:\n\nIf it was not clear before this dinner that J-Rod (I like this name better than A.Lo) was well on its way to being the most endearing and also terrifyingly powerful celebrity couple on this green earth, it was certainly clear the next day, when the pair decamped to noted hotspot George M. Steinbrenner Field in noted love nest Tampa, Florida, to “quietly” drop in on New York Yankees spring training. (Rodriguez, despite his rocky tenure with the team, is now a “special instructor” in pinstripes.) In this photograph, presumably taken by drone- or falcon-mounted camera, Alex Rodriguez is wearing Timberlands, while Jennifer “Jenny from the Block” Lopez sports a Yankees cap.\n\nThese two are feeling themselves, and also preening for each other. Why would you wear wheat Timbs — the official shoe of the Bronx, per Desus and Mero — in 77-degree weather, if not to prove to the queen of the borough that you can keep up?\n\nWe didn’t hear from J-Rod for a week or so after that, beyond this instance of Rodriguez laughing inappropriately intensely at dinner with Lopez. To this point, we’d seen the two only from a maximally voyeuristic distance: hazy pap shots, short-lived Instagram photos, separate images of them on the way to dinner together.\n\nAnd then they went to Marea, the Central Park South Italian joint popular among hedge-funders. It was the most majestic coming out for a celebrity couple since Jenny Slate and Chris Evans hit the premiere of The Secret Life of Pets. They spent nearly three hours sampling the finest seafood and pasta (perhaps even both at the same time: I’m told the fusilli with octopus and bone marrow at Marea is excellent). But don’t get excited yet. As notable and exciting as a night of upscale Italian sounds, it’s nothing compared with what happened next: THE VERY NEXT DAY, THEY WENT TO MAREA. AGAIN. FOR LUNCH.\n\nA reasonable assumption: Jennifer Lopez and Alex Rodriguez love Marea, which in 2009 The New York Times called “as welcoming as a luxe clubhouse,” and wherein 2017 the “business lunch primo and secondo” can be had for $52. Do you think they had the fusilli with octopus and bone marrow twice in 24 hours? I think they did, because how could you not. And though I’m concerned about J-Rod’s commitment to a healthy diet, I am extremely not concerned about how unbelievably in sync these two are:\n\nThey’re on fire, guys. Extremely well-tailored, beige fire. Let’s go to the tape:\n\nLopez is wearing some sort of 22nd-century camel coat, carrying what I imagine is a very expensive purse, and wearing some serious hoop earrings. But the best thing she’s wearing is her look: She is fixing her man with a full-on Love Smirk. She is extremely proud to be on the arm of the most successfully rehabilitated steroid offender in baseball history, exiting a restaurant where the waitstaff knows better than to seat titans of finance and assholery Bill Ackman and Carl Icahn next to each other. Rodriguez, meanwhile, is crushing the khaki suit, a look even the only cool American president ever struggled to pull off. He owns a fancy umbrella, the kind with a wooden handle, and he’s holding it with both hands. (The umbrella suggests it’s raining, which means there’s no excuse for his seemingly suede shoes.) He’s studiously looking away from the paparazzi, which, good, play it cool, Al.\n\nAmateur forensic gossip pathologists will note that Rodriguez is not really covering Lopez at all with his umbrella. I’m willing to concede the charge. But I’ll also point out that Rodriguez is a world-historical narcissist, a tremendous weirdo whose face my colleague Katie Baker recently described as that of “a man who has always longed to be a real boy.” He spent an entire career as the galactically talented oddball in every locker room he called home, tanked his reputation by lying about his steroid use over and over, and only recently emerged as a well-loved studio analyst better at breaking down swing planes than making polite conversation. Of course he’s not sacrificing his outfit for his lady. Alex Rodriguez doesn’t know how to do that.\n\nAnd here’s the important thing: Jennifer Lopez does not care one bit that her boyfriend is being an umbrella jerk. Perhaps, like the lonely band of pariah-loving baseball fans that have always rooted for him, she has determined that A-Rod is secretly charming. And perhaps she’s ascertained that A-Rod is magnetic precisely because he’s so self-involved. She has unlocked the A-Rod code. She knows that this man — who took this photo and owns a painting of himself as a centaur — just can’t get out of his own way. All of which is to say: Find yourself a partner who looks at you the way Jennifer Lopez looks at Alex Rodriguez when he fails to cover her with an umbrella as they exit an Italian restaurant that will wreck your expense account.\n\nWhere do you go once you’ve summited celebrity-couple Mount Olympus? You take a page from the Taylor Swift playbook and meet mom, of course. Shortly after their lunch, Lopez’s mother, Guadalupe Rodriguez, joined them for a stroll around New York. Guadalupe was skeptical at first:\n\nBut she came around by the end of the day:\n\nWhich brings us to Monday, April 3, the day Lopez and Rodriguez stepped out looking like high-test extras from a Scorsese movie. TMZ reported that Rodriguez asked Lopez to join him at a business meeting, citing her “business acumen.” Don’t be distracted by what A-Rod is doing from a business standpoint, which is apparently building something called ARodCorp atop a portfolio of real estate development, auto dealerships, high-end fitness centers, and logoed polos. The only thing that matters here is that “citing business acumen” is the most romantic thing I’ve ever heard. April 3 is now a national holiday.\n\nBut we can go deeper.\n\nThis Daily Mail video of their exit reveals a large, multicolored 8 1/2 painted on one of the building’s ground-floor windows. That numeral is the logo for Brasserie 8 1/2, a restaurant located in the Solow Building on West 57th Street. The private equity firm Sportswear Holdings Ltd. has a penthouse office in the Solow Building. Sportswear Holdings specializes in the leveraged buyout of fashion companies like Tommy Hilfiger and Michael Kors. Lopez sells her Jennifer Lopez Collection at Kohl’s; she is extremely well positioned to give advice about a fashion venture. Rodriguez owns urns produced by the fashion designer Rick Owens and recently brainstormed #ARodCorp hats and polos. Perhaps Rodriguez and Lopez were discussing an apparel venture with a company that specializes in such matters. Or perhaps I’m off the mark, and they were meeting with generic rich people about generic rich-people things.\n\nEither way, I will bet my life on the occurrence of the following chain of events: that after leaving this meeting at 9 West 57th St. looking like the Maddest Man and Sexiest Carmen San Diego, Alex Rodriguez and Jennifer Lopez trekked half a mile to 240 Central Park South. There, the maître d’ greeted them by name and led them to their favorite table at their favorite restaurant in the world for at least the third time in the span of a week. The greatest celebrity couple in the world then sat down for lunch at Marea. “What are your specials today, Gerald?” A-Rod probably asked a waiter named Jacob. “I’m getting a little tired of the octopus.”", "images": ["https://cdn.vox-cdn.com/thumbor/JIQEaIWB2usttFOn3onO1it8ri0=/0x0:1089x1600/1200x0/filters:focal(0x0:1089x1600):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8926747/0_ire_bp1wkempF6wf..0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667015/1134169070.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667011/1196443171.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/EI1M0dji7xskzebMy8hSZjDQkd4=/0x179:2500x1488/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10370135/1_EmtBiRkLvRJbscKslihF5A.0.0.jpeg", "https://cdn.vox-cdn.com/thumbor/ltD8nMCLjY6wXPJSJ64oRIRqdK0=/0x0:700x40/1200x0/filters:focal(0x0:700x40):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8926745/1_6rlxJpq4ARgwoDBfxjawag.0.jpeg", "https://cdn.vox-cdn.com/thumbor/mUSZvragQgvwARxgWw3q7ql4Lj4=/0x0:2500x1667/1200x800/filters:focal(1050x633:1450x1033)/cdn.vox-cdn.com/uploads/chorus_image/image/64061703/1_EmtBiRkLvRJbscKslihF5A.0.0.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66666995/hill_chess_championship_online_getty_ringer_v2.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "https://cdn.vox-cdn.com/thumbor/YSKmjpCB6g6aI3kB9ItUC7ooXMM=/0x0:1385x1600/1200x0/filters:focal(0x0:1385x1600):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8926743/0_ODK8JZcjU3r4OYOh..0.jpeg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs"], "top_img": "https://cdn.vox-cdn.com/thumbor/EI1M0dji7xskzebMy8hSZjDQkd4=/0x179:2500x1488/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10370135/1_EmtBiRkLvRJbscKslihF5A.0.0.jpeg", "keywords": [], "authors": ["Sam Schube", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "The Ringer Staff", "Mallory Rubin", "David Hill", "Apr"], "canonical_link": "https://www.theringer.com/2017/4/4/16040776/jennifer-lopez-alex-rodriguez-celebrity-couple-3544f34136a4", "title": "An Exhaustive Photo Breakdown of the Jennifer Lopez–Alex Rodriguez Courtship", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2017-04-04T12:59:51-04:00", "modified_time": "2017-04-04T12:59:51-04:00"}, "author": "Sam Schube", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Whether you call them J-Rod or A.Lo, it’s become impossible to ignore how aggressively out here this new celebrity couple is. Let’s dive in.", "og": {"description": "Whether you call them J-Rod or A.Lo, it’s become impossible to ignore how aggressively out here this new celebrity couple is. Let’s dive in.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/EI1M0dji7xskzebMy8hSZjDQkd4=/0x179:2500x1488/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10370135/1_EmtBiRkLvRJbscKslihF5A.0.0.jpeg", "alt": "(Getty Images/Ringer illustration)", "height": 630, "width": 1200}, "site_name": "The Ringer", "title": "An Exhaustive Photo Breakdown of the Jennifer Lopez–Alex Rodriguez Courtship", "type": "article", "url": "https://www.theringer.com/2017/4/4/16040776/jennifer-lopez-alex-rodriguez-celebrity-couple-3544f34136a4"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/2017/4/4/16040776/jennifer-lopez-alex-rodriguez-celebrity-couple-3544f34136a4", "title": "An Exhaustive Photo Breakdown of the Jennifer Lopez–Alex Rodriguez Courtship", "description": "Whether you call them J-Rod or A.Lo, it’s become impossible to ignore how aggressively out here this new celebrity couple is. Let’s dive in.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/W7rObaxLyGwMX9SS9eYKbVZIMhs=/0x208:2500x1458/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/10370135/1_EmtBiRkLvRJbscKslihF5A.0.0.jpeg", "alt": "(Getty Images/Ringer illustration)"}, "site": "ringer"}, "sailthru.title": "An Exhaustive Photo Breakdown of the Jennifer Lopez–Alex Rodriguez Courtship", "sailthru.tags": "general,the-ringer,front-page", "sailthru.description": "Whether you call them J-Rod or A.Lo, it’s become impossible to ignore how aggressively out here this new celebrity couple is. Let’s dive in.", "sailthru.date": "2017-04-04T12:59:51-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/5q2sgJKDuAT1skEkOjDvQcEVkzc=/0x130:2500x1536/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55904347/1_EmtBiRkLvRJbscKslihF5A.0.jpeg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/R1Aw56hfWZJcmpy4g4U6qbOmz44=/417x0:2084x1667/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/55904347/1_EmtBiRkLvRJbscKslihF5A.0.jpeg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1491235200.0, "source": "http://www.theringer.com", "summary": ""}