{"url": "https://theblast.com/audrina-patridge-visitation-threat-corey-bohan-custody/", "text": "Audrina Patridge just went to court claiming the escalating aggression and resentment of her estranged husband has reached an all-time high to the point of actual threats and she wants him kept away from not just herself, but from her daughter as well.\n\nAccording to documents obtained by The Blast, the former star of \"The Hills\" was in an Orange County courthouse Wednesday filing an emergency request. She is seeking an order that Corey Bohan's visitation with their one-year-old daughter, Kirra, be stripped and that a restraining order be issued against him.\n\nPatridge claims during a court-ordered hand-off with their daughter on March 5, Corey threatened her by saying, \"You better start f**king playing nice, I'm f**king warning you.\" She says she recorded that incident, but claims on other occasions Bohan has aggressively followed her out of the parking lot and \"one time swerved his vehicle dangerously close to my sister.\"\n\n\n\nMEGA\n\nPatridge also claims her ex is \"stalking\" her on social media by picking apart her public posts and trying to attack her character. One example she references is after a post about attending church, Bohan allegedly posted on his own social media, \"ONE THING I CANNOT STAND IS THOSE PEOPLE WHO ARE PURE EVIL PUSHING THE 'I LOVE CHURCH' BEHAVIOR.\"\n\nShe says Bohan's obvious response to her posting supports her theory that he is keeping tabs on her, as well as publicly disparaging her.\n\nPatridge claims Bohan is being \"angry, rude and emotionally abusive\" towards Kirra, and tells her that \"Mommy doesn't pick you up anymore because she's an L.A. party girl.\" She says sometimes her mom picks Kirra up if she's away on business, and claims Bohan tries to punish her for working.\n\nThe reality star says she believes her ex has participated in anger management and parenting classes since their split, but claims he hasn't participated in any individual therapy and therefore believes has not fully addressed his issues.\n\nBecause of the volatility between the two, Patridge says, \"I am more afraid of him now than ever, and fear for the safety of our daughter Kirra when she is in his care.\"\n\nShe backs up her statement with an example of recklessness, referring to a Snapchat video Bohan posted that appears to show him driving with their daughter in the car while he is filming on his phone. She also says that the video shows the child's \"car seat is facing the wrong way.\"\n\nAs we've reported, Patridge filed for divorce from Bohan back in September. At the time, she had also filed for a temporary restraining order after accusing him of pushing her while she was holding their child.\n\nBohan also got into a heated argument with his estranged wife's father, and it got so bad that the two men almost came to blows. He was later ordered to vacate the house he shared with Patridge, and she got full custody of Kirra, with Bohan getting visitation.\n\nPatridge's claims and requests will be addressed in court on their next scheduled hearing.", "images": ["https://theblast.com/static/theblast/logo.svg", "https://img.srgcdn.com/e//WEZQNU1jRlc3Nnp0cUxRaE9SQncuanBn.jpg", "https://theblast.com/wp-content/uploads/2017/10/Audrina.jpg"], "top_img": "https://img.srgcdn.com/e//WEZQNU1jRlc3Nnp0cUxRaE9SQncuanBn.jpg", "keywords": [], "authors": ["Theblast Staff", "Jeff Mazzeo", "Whitney Vasquez", "Ryan Naumann"], "canonical_link": "https://theblast.com/c/audrina-patridge-visitation-threat-corey-bohan-custody", "title": "Audrina Patridge Says Her Ex Threatened Her and Is 'Stalking' Her, Wants Custody Stripped", "meta_data": {"mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "default", "viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "theme-color": "#f60", "og": {"locale": "en_US", "type": "article", "title": "Audrina Patridge Wants to Strip Estranged Husband's Visitation", "url": "https://theblast.com/c/audrina-patridge-visitation-threat-corey-bohan-custody", "site_name": "The Blast", "description": "Audrina Patridge just went to court claiming the escalating aggression and resentment of her estranged husband has reached an all time high.", "image": {"identifier": "https://img.srgcdn.com/e//WEZQNU1jRlc3Nnp0cUxRaE9SQncuanBn.jpg", "width": 1200, "height": 630}, "updated_time": "2018-03-07T20:33:15.000+00:00"}, "article": {"modified_time": "2019-06-10T22:49:51.000+00:00", "published_time": "2018-03-07T20:33:15.000+00:00", "section": "The Law", "tag": "Corey Bohan", "publisher": "https://facebook.com/theblastnews"}, "twitter": {"site": "@TheBlastNews", "card": "summary_large_image", "title": "Audrina Patridge Wants to Strip Estranged Husband's Visitation", "description": "Audrina Patridge just went to court claiming the escalating aggression and resentment of her estranged husband has reached an all time high.", "image": "https://img.srgcdn.com/e//WEZQNU1jRlc3Nnp0cUxRaE9SQncuanBn.jpg"}, "description": "Audrina Patridge just went to court claiming the escalating aggression and resentment of her estranged husband has reached an all time high.", "msapplication-TileImage": "/static/theblast/icon-270.jpg", "p": {"domain_verify": "4ade90087d8ddeecef93bced91147809"}}, "movies": [], "publish_date": 1520454795.0, "source": "https://theblast.com", "summary": ""}