{"url": "https://www.glamourmagazine.co.uk/article/rihanna-tutorial-tuesday-chillowt", "text": "Everyone is pretty obsessed with Fenty beauty makeup - but now we can see how the creator, Rihanna, uses it as she's launched her first-ever Tutorial Tuesday on YouTube, which is going to be a weekly occurrence. Yaaaas\n\nIn her makeup tutorial, rather than have someone else do her makeup, the down-to-earth singer shows how to create the #CHILLOWT edition beauty look by doing her own makeup on camera - and we are living for it.\n\nAdvertisement\n\nUsing the new Fenty Beauty Chill Owt Holiday Collection, including Killawatt Foil Freestyle Highlighter Palette, RiRi shows how to create a look that's \"icy, celebratory and ready for the holidays with not too much drama, but it’s still drama.\"\n\nIn order to see this embed, you must give consent to Social Media cookies. Open my cookie preferences.\n\nRead next Fenty Skincare is happening! This is everything we know so far... Fenty Beauty Fenty Skincare is happening! This is everything we know so far... The countdown is on.\n\nThe video, which was posted on the Fenty Beauty by Rihanna's YouTube channel, starts with RiRi messing about in front of the camera before saying: \"Well hello...\"\n\nShe also promises that she will make copying the look \"as easy and as simple as possible.\"\n\nAdvertisement\n\nRihanna seems completely comfortable as she chats animatedly, narrating each step as she applies the makeup - and it's clear she really knows her Fenty Beauty products.\n\nHolding the Killawatt Foil Freestyle Highlighter Palette, she says: \"As you can see, I've already dug into a couple of them because I just wanna touch them.\"\n\nShowing off her on-trend lilac eye, the singer says: “Not too much drama, but it’s still drama. And you know us girls, we love drama.\"\n\nRead next 5 Women Test: Fenty's first-ever mascara... and here's what we thought Reviews 5 Women Test: Fenty's first-ever mascara... and here's what we thought Will the beauty brand's first foray into mascara pass the GLAMOUR test?\n\nAdvertisement\n\nStarting with Stone Cold, which she \"likes how it looks on your lid\", she applies it to her eyes.\n\nShe then highlights the inner corners of her eyes using Chillz to make them \"light up\".\n\nAdmitting Sub Zero, which has a blue and purple combination, looks \"pretty scary\", she applies it to the outside corners of her eyes but assures fans \"I can use it on my eyes, on my cheeks.\"\n\nRead next Fenty Beauty is launching its first ever mascara and it’s going to be HUGE Fenty Beauty Fenty Beauty is launching its first ever mascara and it’s going to be HUGE It’s the one we’ve all been waiting for…\n\nThe artist uses the palette colours to highlight her eyes, cheeks, ears, and collarbones.\n\nUsing Scandal'Ice on the highlight of the cheekbones, Rihanna says: \"It's really surprising as you never know what colour it's going to look like until you put it on.\"\n\nShe also shows off the lip trios, Snow Daze and Snow Nights, saying: \"I love the packaging. It's really cool, they are like a cigarette box. It's really cool. You open it and there's three lipsticks and a little mirror right there.\"\n\nThe look is glittery and purple, making it perfect for Christmas.\n\n“I call it a holiday look,” Rihanna explains. “It can go into a Christmas look, a winter look, because it’s just icy, it’s sparkly, it's beautiful, it's frozen. It’s celebratory.”\n\nRead next 5 women test: Fenty Beauty Stunna Lip Paint Reviews 5 women test: Fenty Beauty Stunna Lip Paint Liquid lipsticks from Riri herself.\n\nShe finishes by saying: \"I can't wait to see you do your version of the holiday look. Follow me at @Fentybeauty because I have even more secrets, beauty tips, looks and a lot more that you will not see anywhere else.\"\n\nFenty Beauty has released its festive collection and that's our Christmas list sorted Fenty Beauty Fenty Beauty has released its festive collection and that's our Christmas list sorted\n\nIn the description of the video, the channel announced that the tutorials would be happening every Tuesday.\n\n“Ready for Rihanna’s first-ever makeup tutorial?! Get ready for Tutorial Tuesdays with Rihanna where she shares a new makeup tutorial every week. This week, Rihanna shows you how to create a look using her newly launched Fenty Beauty #CHILLOWT holiday collection!”\n\nAdvertisement\n\nThe channel also added a new playlist titled “Tutorial Tuesday With Rihanna.\"\n\nThe countdown is on to see what she does next week...", "images": ["https://gl-images.condecdn.net/image/payr91EAgGk/crop/200/square/f/badgalriri.jpg", "https://gl-images.condecdn.net/image/g9m9RLEQanJ/crop/200/square/f/fenty_beauty_glamour_11oct18_d.jpg", "https://gl-images.condecdn.net/image/MaB7byy5pRL/crop/200/square/f/191120_glamour_sh01_132b_sf_sq.jpg", "https://gl-images.condecdn.net/image/RAYbMn70VpM/crop/200/square/f/gettyimages-1213712203_sf_sq.jpg", "https://gl-images.condecdn.net/image/K4Bvxw7Gm0m/crop/200/square/f/709405_uninvited_1_2_sf.jpg", "https://gl-images.condecdn.net/image/OBJ6JO5959v/crop/200/square/f/screen.jpg", "https://gl-images.condecdn.net/image/3NZX0LmdWgk/crop/200/square/f/5women_sf_sf.jpg", "https://gl-images.condecdn.net/image/Zl2bwVBXyn4/crop/1440/0.5235602094240838/f/fentybeauty_glamour_17oct18_insta_sq.jpg", "https://gl-images.condecdn.net/image/OM4KoGwqz4a/crop/200/square/f/fb3006_silo_stunna_lip_close_unbutton_300_l_sf.jpg", "https://gl-images.condecdn.net/image/8GJr61DRZBO/crop/200/square/f/screen.jpg", "https://gl-images.condecdn.net/image/OLanorqlDNJ/crop/200/square/f/screen.jpg", "https://www.glamourmagazine.co.uk/static/img/tiny.gif"], "top_img": "https://gl-images.condecdn.net/image/Zl2bwVBXyn4/crop/1440/0.5235602094240838/f/fentybeauty_glamour_17oct18_insta_sq.jpg", "keywords": [], "authors": ["Kelly Allen", "Wednesday October", "Sophie Thompson", "Lottie Winter"], "canonical_link": "https://www.glamourmagazine.co.uk/article/rihanna-tutorial-tuesday-chillowt", "title": "Rihanna shares her first-ever Tutorial Tuesday and shares some incredible insider beauty hacks", "meta_data": {"description": "Rihanna posted her first weekly Tuesday Tutorial on YouTube doing her own makeup from her Fenty Beauty range to create a holiday look with the Killawatt palette.", "GENERATOR": "Macromedia Dreamweaver", "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Glamour UK", "apple-mobile-web-app-status-bar-style": "translucent black", "application-name": "Glamour UK", "og": {"site_name": "Glamour UK", "locale": "en_GB", "title": "Rihanna shares her first-ever Tutorial Tuesday and shares some incredible insider beauty hacks", "url": "https://www.glamourmagazine.co.uk/article/rihanna-tutorial-tuesday-chillowt", "type": "article", "article": {"publisher": 103165711773}, "description": "Is there anything RiRi can't do?", "image": "https://gl-images.condecdn.net/image/Zl2bwVBXyn4/crop/1440/0.5235602094240838/f/fentybeauty_glamour_17oct18_insta_sq.jpg"}, "fb": {"app_id": 589577624418454, "pages": 103165711773}, "twitter": {"site": "@GlamourMagUK", "account_id": 34258758, "title": "Rihanna shares her first-ever Tutorial Tuesday and shares some incredible insider beauty hacks", "card": "summary_large_image", "description": "Is there anything RiRi can't do?", "image": "https://gl-images.condecdn.net/image/Zl2bwVBXyn4/crop/810/landscape/f/fentybeauty_glamour_17oct18_insta_sq.jpg"}, "theme-color": "#000", "article": {"section": "Fenty Beauty", "tag": "Fenty Beauty,Celebrity Beauty,Rihanna,Makeup,Beauty"}, "author": "Kelly Allen", "snippet": {"image": "https://gl-images.condecdn.net/image/Zl2bwVBXyn4/crop/405/0.75/f/fentybeauty_glamour_17oct18_insta_sq.jpg"}}, "movies": ["https://www.youtube.com/embed/https://www.youtube.com/watch?list=PLHspDMKDvMYB_qsQVjxgcFD06eF2K4NFP&time_continue=414&v=6GH7DUfwh08"], "publish_date": null, "source": "https://www.glamourmagazine.co.uk", "summary": ""}