{"url": "en.wikipedia.org/wiki/List_of_The_Simpsons_guest_stars_(seasons_1%E2%80%9320)", "text": "Guest star list for an animated series\n\nActor Phil Hartman , who died in 1998, was the most recurring male guest actor on the show, appearing 52 times.\n\nIn addition to the show's regular cast of voice actors, celebrity guest stars have been a staple of The Simpsons, an American animated television sitcom created by Matt Groening for the Fox Broadcasting Company, since its first season. The Simpsons focuses on the eponymous family, which consists of Homer, Marge, Bart, Lisa and Maggie. The family was initially conceived by Groening for a series of animated shorts, which originally aired as a part of The Tracey Ullman Show between 1987 and 1989. The shorts were developed into a half-hour prime time series which began in December 1989.[1] The series' 31st season began in September 2019 and 679 episodes of The Simpsons have aired. A feature film adaptation of the series called The Simpsons Movie, was released in 2007.\n\nGuest voices have come from a wide range of professions, including actors, athletes, authors, musicians, artists, politicians and scientists. In the show's early years most guest stars voiced original characters, but as the show has continued the number of those appearing as themselves has increased.\n\nThe first credited guest star was Marcia Wallace who appeared in \"Bart the Genius\" in her first stint as Bart's teacher Edna Krabappel. Singer Tony Bennett was the first guest star to appear as himself, appearing briefly in the season two episode \"Dancin' Homer\". Several guest stars have featured as recurring characters on the show, including Phil Hartman, Joe Mantegna and Kelsey Grammer. After Wallace, Hartman made the most appearances, guest starring 52 times. Mantegna has appeared over thirty times, Grammer, Maurice LaMarche, Jon Lovitz and Frank Welker have appeared twenty times or more; Glenn Close and Jackie Mason have appeared over ten times, while Albert Brooks, Michael Dees, Dana Gould, Terry W. Greene, Valerie Harper, Jan Hooks, Jane Kaczmarek, Stacy Keach, Kipp Lennon, Dawnn Lewis, J. K. Simmons, Sally Stevens, George Takei and Michael York have made over five appearances.\n\nThree guest stars, Ricky Gervais, Seth Rogen and Pete Holmes, earned writing credits for the episodes in which they appeared. Grammer, Mason and three-time guest star Anne Hathaway all won the Primetime Emmy Award for Outstanding Voice-Over Performance for guest voice roles on the show. The show was awarded the Guinness World Record for \"Most Guest Stars Featured in a TV Series\" in 2010. As of March 22, 2020, there have been 856 guest stars on the show , with this figure rising to 861 if The Simpsons Movie is included.\n\nHistory [ edit ]\n\nGuest stars have appeared on The Simpsons since its first season, in addition to the show's main cast of Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith, Hank Azaria and Harry Shearer and supporting cast of Tress MacNeille, Pamela Hayden, Maggie Roswell, Chris Edgerly, Grey Griffin and former supporting cast members Russi Taylor, Marcia Mitzman Gaven, Karl Wiedergott, Doris Grau, Jo Ann Harris, Susan Blu and Christopher Collins.[2] Kevin Michael Richardson started as a recurring guest star in the twenty first season, but joined the supporting cast in the twenty eighth, starting with the episode \"The Last Traction Hero\".\n\n\n\nGuest voices have come from a wide range of professions, including actors, athletes, authors, musicians, artists, politicians and scientists. In the earlier seasons, most of the guest stars voiced characters, but eventually more started appearing as themselves. The first male guest star was actor Sam McMurray, who voiced a worker at the Springfield Nuclear Power Plant in \"Homer's Odyssey\", the show's third episode, and Marcia Wallace was the first female guest star on the show starting from Bart the Genius as Edna Krabappel and Ms. Melon. Singer Tony Bennett was the first guest star to appear as himself, appearing in the season two episode \"Dancin' Homer\" while Aerosmith were the first band with their cameo in the third season's \"Flaming Moe's\"\n\nSeveral guest stars have made multiple appearances on the show, often as recurring characters. Actress Marcia Wallace guest starred 176 times, making her the most recurring female guest star on the show, until her death in 2013. Edna Krabappel was then retired from the show, but sometimes appears as a ghost, and actor Phil Hartman guest-starred in 52 episodes, more than any other male actor, although his initial role in the second season episode \"Bart Gets Hit By a Car\" in 1991 was intended to be a one-off.[4] He voiced the recurring characters Troy McClure and Lionel Hutz as well as numerous other one-time characters, until his death in 1998. McClure and Hutz were subsequently retired from the show.[5] Actor Kelsey Grammer first appeared as Sideshow Bob in the first-season episode \"Krusty Gets Busted\" while actor Joe Mantegna made his first appearance as Fat Tony in the third season episode \"Bart the Murderer\". The two have appeared in 21 and 28 episodes respectively; Mantegna also appeared in the film. Both roles were originally written for other actors: Bob was originally to be voiced by James Earl Jones,[6] who later guest starred three times on the show, while Fat Tony was written for Sheldon Leonard.[4] Other repeat guest stars include Albert Brooks, Glenn Close, Jan Hooks, Maurice LaMarche, Jon Lovitz, Jane Kaczmarek, Jackie Mason, Charles Napier and Frank Welker.\n\nAccording to Groening, guest star choices \"come from the writers saying, 'Wouldn't it be cool to have [such a person on the show]?'\",[7] while showrunner Al Jean has stated the reasoning is \"we want to meet our heroes.\"[8] Bill Oakley and Josh Weinstein, showrunners of the seventh and eight seasons, favored guest stars with what they felt were unique and interesting voices such as actors R. Lee Ermey, Donald Sutherland, Kirk Douglas and Lawrence Tierney.[9] In 2014, Jean stated that fewer people would be appearing as themselves, as the staff did not want it to become a \"crazy roster\".[10]\n\nMany guest stars come into the show's recording studio to record their parts,[7] although some are recorded over the telephone.[11] Three guest stars have been credited with writing the episode in which they guest starred. Comedian Ricky Gervais wrote the episode \"Homer Simpson, This Is Your Wife\",[12] while actor Seth Rogen co-wrote the episode \"Homer the Whopper\" with Evan Goldberg, and comedian Pete Holmes wrote the two-part \"Warrin' Priests\" episodes.[13] Two guest stars were credited with pseudonyms. Actor Dustin Hoffman was credited as \"Sam Etic\" for the episode \"Lisa's Substitute\" while musician Michael Jackson was credited as \"John Jay Smith\" for the episode \"Stark Raving Dad\". After the latter episode, the producers decided that if a celebrity wished to guest star on the show, they had to be willing to be credited under their real name.[14]\n\nNumerous people have rejected the chance to appear on the show. Actor William Shatner has been described as the first person to reject the show.[15] The producers have consistently failed to persuade any former President of the United States to appear.[8] Musicians Bruce Springsteen and Bob Dylan have also rejected multiple invitations to guest star on the series.[16][17] Other people to turn the show down include actors Michael Caine,[18] Tom Cruise,[19] Clint Eastwood and Anthony Hopkins[20] and director Quentin Tarantino.[21] Musician Prince turned down a role in a sequel to \"Stark Raving Dad\", which meant the script was never produced.[22]\n\nOthers have accepted the offer, but have been unable to record a role. Musician Frank Zappa and actor Anthony Perkins both became too ill to record their parts,[20][23] while Jim Carrey had to drop out due to time constraints,[24] and Faye Dunaway cancelled.[25] Christopher Walken originally agreed appear as himself in \"Insane Clown Poppy\". However, he then decided to demand a lot more money than the producers were willing to pay. Instead, Jay Mohr provided the voice of Walken. In the end credits, Jay Mohr is actually credited with the voice of Christopher Walken, the credit says \"Jay Mohr as Christopher Walken\". This is the first time this has ever been done.\n\nRobby Krieger of The Doors recorded a cameo for the episode \"The Great Money Caper\", but his part was cut because the writers felt his appearance seemed too forced. The scene was later included on the season's DVD release.[26] Similarly, actress Catherine O'Hara recorded the voice of Colette the waitress in \"Flaming Moe's\", but was redubbed with Jo Ann Harris who the producers felt was a better fit.[27] Ron Howard, in what would have been his third appearance on The Simpsons, was advertised as guest starring on \"Children of a Lesser Clod\".[28] However, he did not appear for any recording sessions. Similarly, Werner Herzog was advertized as guest starring in \"Thanksgiving of Horror\", in what would have been his third appearance as Walter Hotenhoffer,[29] but didn't appear in the final episode.\n\nMason, Grammer and Anne Hathaway have each won the Primetime Emmy Award for Outstanding Voice-Over Performance for their guest voice roles on the show.[30] The show was awarded the Guinness World Record for \"Most Guest Stars Featured in a TV Series\" on May 23, 2010, with Guinness estimating that the show has featured \"at least 555 as of series 21\".[31] As of March 22, 2020, there have been 856 guest stars on the show, totaling 1470 guest spots. These figures rise to 861 and 1479 respectively if The Simpsons Movie is counted as well.\n\nGuest stars [ edit ]\n\nThe color of the season number in the first column corresponds to the color of that season's DVD boxset or digital purchase image for the seasons which have not been released in physical format.\n\nIn the No. column: The first number refers to the order it aired during the entire series. The second number refers to the episode number within its season: i.e. 1506 would be the sixth episode of the fifteenth season.\n\nThe production code refers to the code assigned to the episode by the production team. The first two characters refer to the season the episode was made for. The first season is 7Gxx, the second is 7Fxx, the third is 8Fxx and the fourth is 9Fxx. After that, the fifth season started with 1F and continued in order until season nine (which was 5F). Starting with season ten, the production codes started with AABF, with the first letter changing for each season (i.e. BABF, CABF, etc.). The number at the end of the code is the order in which that episode was produced during that production run.\n\nGuests with \"(archival)\" after their names refer to cases where roles were not recorded specifically for the episode, but instead archival audio and/or footage from independent sources was used in the episode. In most cases these appearances have been uncredited and are usually not considered as proper guest stars given the circumstances.\n\nActor Albert Brooks made the first two of his seven appearances in season one.\n\nSinger Tony Bennett was the first person to voice himself on the show.\n\nTheoretical physicist Stephen Hawking has made four appearances on the show as himself.\n\nRonaldo is the only soccer player to appear on the show.\n\nActress Kristen Wiig has played two different characters on the show.\n\nNotes [ edit ]\n\nCitations [ edit ]\n\nReferences [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Rupert_Murdoch_-_WEF_Davos_2007.jpg/170px-Rupert_Murdoch_-_WEF_Davos_2007.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Pete_Sampras_%282008%29_1%2C_cropped.jpg/170px-Pete_Sampras_%282008%29_1%2C_cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Ricky_Gervais_2010.jpg/170px-Ricky_Gervais_2010.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Phil_as_Chick-1-1.jpg/1200px-Phil_as_Chick-1-1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Albert_Brooks_at_%27Drive%27_premiere_TIFF_9.10.11.jpg/170px-Albert_Brooks_at_%27Drive%27_premiere_TIFF_9.10.11.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/JonLovitz08.jpg/170px-JonLovitz08.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Stephen_Hawking_050506.jpg/170px-Stephen_Hawking_050506.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/16px-Portal-puzzle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Lenny_Kravitz_by_Gage_Skidmore.jpg/170px-Lenny_Kravitz_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Glenn_Close_-_Guardians_of_the_Galaxy_premiere_-_July_2014_%28cropped%29.jpg/170px-Glenn_Close_-_Guardians_of_the_Galaxy_premiere_-_July_2014_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Matt_Groening_by_Gage_Skidmore_2.jpg/170px-Matt_Groening_by_Gage_Skidmore_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Liam_Neeson_Deauville_2012_2.jpg/170px-Liam_Neeson_Deauville_2012_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/AlYankovicByKristineSlipson.jpg/170px-AlYankovicByKristineSlipson.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Buzz_Aldrin.jpg/170px-Buzz_Aldrin.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Michael_Jackson_1984.jpg/170px-Michael_Jackson_1984.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Phil_as_Chick-1-1.jpg/200px-Phil_as_Chick-1-1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Kristin_Wiig_2013_crop.JPG/170px-Kristin_Wiig_2013_crop.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/U2_on_Joshua_Tree_Tour_2017_Brussels_8-1-17.jpg/170px-U2_on_Joshua_Tree_Tour_2017_Brussels_8-1-17.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/170px-Reese_Witherspoon_at_TIFF_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Kiefer_Sutherland_2_SDCC_2014.jpg/170px-Kiefer_Sutherland_2_SDCC_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/WORLD_ECONOMIC_FORUM_ANNUAL_MEETING_2009_-_Tony_Blair.jpg/170px-WORLD_ECONOMIC_FORUM_ANNUAL_MEETING_2009_-_Tony_Blair.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Lucy_Lawless_by_Gage_Skidmore.jpg/170px-Lucy_Lawless_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Tom_Hanks_2014.jpg/170px-Tom_Hanks_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/JoeMantegnaMay08.jpg/170px-JoeMantegnaMay08.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Patrick_Stewart_Photo_Call_Logan_Berlinale_2017_%28cropped%29.jpg/170px-Patrick_Stewart_Photo_Call_Logan_Berlinale_2017_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Leonard_Nimoy_by_Gage_Skidmore.jpg/170px-Leonard_Nimoy_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/31/TonyBennett210-1000.jpg/170px-TonyBennett210-1000.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Anne_Hathaway_at_MIFF.jpg/170px-Anne_Hathaway_at_MIFF.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Paul_McCartney_with_Linda_McCartney_-_Wings_-_1976.jpg/170px-Paul_McCartney_with_Linda_McCartney_-_Wings_-_1976.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Ronaldo-14-05-2013.jpg/170px-Ronaldo-14-05-2013.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Kelsey_Grammer_May_2010_%28cropped%29.jpg/170px-Kelsey_Grammer_May_2010_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Sonny_Rollins_2011.jpg/170px-Sonny_Rollins_2011.jpg", "http://upload.wikimedia.org/wikipedia/en/timeline/1e95d479478b2888830f24260d80530a.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Katy_Perry_-_Part_Of_Me_Australian_Premiere_-_June_2012_%282%29.jpg/170px-Katy_Perry_-_Part_Of_Me_Australian_Premiere_-_June_2012_%282%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Phil_as_Chick-1-1.jpg/1200px-Phil_as_Chick-1-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_The_Simpsons_guest_stars_(seasons_1%E2%80%9320)", "title": "List of The Simpsons guest stars (seasons 1–20)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Phil_as_Chick-1-1.jpg/1200px-Phil_as_Chick-1-1.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}