{"url": "www.vulture.com/2018/03/what-we-know-about-the-weeknd-and-selena-from-his-new-ep.html", "text": "Whoa. Photo: Karwai Tang/WireImage\n\nThe Weeknd is dark and moody again! On Thursday night, he released a surprise six-song EP, My Dear Melancholy, overflowing with all the Very Serious melodrama we haven’t heard since his mixtape days. Abel has had his heart shattered and he now requests your shoulder to cry on. Sad boy! But there’s just one question: Who hurt him? Oh, who are we kidding, you know it’s Selena Gomez. It can only be Selena Gomez. Here’s everything we learned about their relationship from his new EP — like, uh, that time he nearly gave her his kidney. Drama!\n\n“Call Out My Name”\n\nNo other song on the Weeknd’s new project is more explicit about his regrets over Selena Gomez (he doesn’t actually say her name) than the ironically titled “Call Out My Name.” He ominously begins, “We found each other / I helped you out of a broken place / You gave me comfort / But falling for you was my mistake.” Selena famously was with Justin Bieber before the Weeknd — a broken place, indeed. But that’s not the line that should raise eyebrows about whom this song is intended for. It gets worse: “I put you on top / I claimed you so proud and openly / And when times were rough / I made sure I held you close to me.” You’ll recall that the Weekend and Selena Gomez made their official public debut as a couple at the Met Gala (see photo above), after also snuggling up at Coachella on Instagram. As for those “rough times” he’s alluding to, he lays it all bare later in the song:\n\n“I said I didn’t feel nothing, baby, but I lied / I almost cut a piece of myself for your life / Guess I was just another pit stop / ‘Til you made up your mind / You just wasted my time / You’re on top”\n\nOof. There are moments on this song when you could think its about his previous ex-girlfriend, Bella Hadid, but not after reading that. Gomez had to undergo a kidney transplant last summer (when the two were still together) as a result of complications from lupus, which could’ve proved fatal had her best friend, Francia Raisa, not donated her kidney. It now appears that Raisa was not Selena’s only donor candidate — it could’ve been the Weeknd!* It also appears he is shading her lightning-fast rebound back to Bieber, hard. Yikes!\n\nUpdate, April 2: A source now tells Entertainment Tonight that the Weeknd is exaggerating, and was never asked to be a donor. “It’s just a lyric and he knew it would strum up attention and that people would interpret it exactly as they have, but he was never actually going to donate his kidney to Selena,” the source says. “Sure, he was her boyfriend at the time, so it perhaps crossed his mind to get tested to see if he was a match — which is incredibly rare — but it never got anywhere close to actually happening. Selena would never, ever have asked him. She wouldn’t have even wanted him to even entertain the idea! It was difficult enough for her to allow a lifelong friend to do it, but a new boyfriend? No way.”\n\nThe source also discredits the EP as nothing more than the tales of a scorned lover: “To be honest, they were never as intense as he’s making it seem. The Weeknd was always much more concerned with his career than his relationship. Selena leaned on friends and family during the surgery more than anyone.”\n\n“Try Me”\n\nMuch of this song is about the Weeknd getting in the middle of a relationship already in progress, which could be interpreted two ways: Either he (1) moved in on Selena when she was still with Biebs (unlikely), or (2) he got into a relationship with her pretty much aware her heart wasn’t all in it (aw). But how do we know he’s even talking about Selena here, anyway? We don’t! But this second reference to her transplant is telling: “The way I kissed your scars / The way I fixed your heart / Don’t you mess with me, babe.” (Gomez has been candid about the literal, physical scars left from the surgery.)\n\n“Wasted Times”\n\nThis song appears to mostly be about how much he misses Bella Hadid, a hole in his heart apparently slashed open even larger by Gomez. Ahem: “Wasted times I spent with someone else / She wasn’t even half of you.” This track also has a lot of big talk about his penis, but we’ll spare you the details.\n\n“I Was Never There”\n\nNo one really knows why the Weeknd and Selena called it off (*cough* Bieber *cough*), but if we were to take this song at face value, the breakup wasn’t pretty. He begins the song talking about suicidal thoughts and then comes right up to the edge of his breaking point, blaming her: “When no one knows what love is / And I know it ain’t you for sure / You’d rather something toxic / So, I poison myself again, again / ‘Til I feel nothing.” Again, “toxic” and Bieber are practically synonymous for Abel.\n\n“Hurt You”\n\nHow quickly sorrow can manifest as pettiness. “Hurt You” is, essentially, a humblebrag about how the Weeknd has no interest in ever getting back together with Selena (“and now I know relationships my enemy”). He could however emotionally remove himself enough to still smash (“Girl, I’ll come to put myself between your lips, not between your heart”). Is it mature? Not quite. Will it win you the breakup? Can’t hurt! But there’s a tragic reason that this song is almost certainly about Selena, based off this revealing line:\n\n“All the nights we slept alone, dryin’ your eyes (’cause of me, baby) / And all the nights you thought about takin’ your life (’cause of me, baby) / If it’s love you want again, don’t waste your time (don’t you waste).”\n\nGomez has been open about seeking treatment for mental illness.\n\n“Privilege”\n\nYou can’t devote a 21-minute EP to an ex without eventually arriving at the breakup ballad. He begins, “Enjoy your privileged life / ‘Cause I’m not gonna hold you through the night / We said our last goodbyes / So, let’s just try to end it with a smile.” Progress! Which, of course, doesn’t last, as we inevitably get the Weeknd saying he doesn’t want to hear a thing about Selena suffering now that she’s moved on and that you can find him coping with the breakup with pills and alcohol from now on (“I’ll be back to my old ways”). While he’s at it, he’d also like to set the record straight about their relationship: “They said our love is just a game, I don’t care what they say.” In other words, it wasn’t just a publicity stunt, love is real, but it’s also a big fat lie.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/03/30/30-selena-gomez-weeknd.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/03/30/30-selena-gomez-weeknd.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/03/30/30-selena-gomez-weeknd.w1200.h630.jpg", "keywords": [], "authors": ["Dee Lockett"], "canonical_link": "https://www.vulture.com/2018/03/what-we-know-about-the-weeknd-and-selena-from-his-new-ep.html", "title": "What We Know About The Weeknd and Selena from His New EP", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Everything We Know About the Weeknd and Selena Gomez From His New Album", "url": "https://www.vulture.com/2018/03/what-we-know-about-the-weeknd-and-selena-from-his-new-ep.html", "description": "He almost gave her a kidney!", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/03/30/30-selena-gomez-weeknd.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "What We Know About the Weeknd and Selena From His New EP", "description": "He almost gave her a kidney!", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/03/30/30-selena-gomez-weeknd.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-03-30T11:03:48.596-04:00", "tag": "breaking up is hard to do, selena gomez, the weeknd, kidney transplant, music, way too close reads", "publisher": "https://www.facebook.com/Vulture"}, "description": "The Weeknd says he almost gave Selena Gomez his kidney, and everything else we learned from his new EP.", "sailthru.tags": "breaking up is hard to do, selena gomez, the weeknd, kidney transplant, music, way too close reads", "author": "Dee Lockett", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1522422228.596, "source": "http://www.vulture.com", "summary": ""}