{"url": "www.dailymail.co.uk/news/article-4928382/Hugh-Hefner-s-wife-Crystal-Harris-inherit-nothing.html", "text": "Advertisement\n\nHugh Hefner's wife Crystal Harris will inherit nothing after signing an ironclad prenup before their wedding and was never added to his will, it has been reported\n\nHugh Hefner's wife Crystal Harris will inherit nothing due to an ironclad prenup that means she was never added to his will, it has been reported.\n\nThe couple, who shared a 60 year age gap, tied the knot on New Year's Eve in 2012 at the Playboy Mansion in Los Angeles.\n\nBefore the nuptials, Harris was said to have signed an 'ironclad' prenuptial agreement.\n\nA source told US Weekly that while the blonde beauty will be taken care of, she won't receive a penny of his fortune.\n\nInstead, his estimated $43million estate, will be divided between his four children, the University of Southern California and a list of charities.\n\nThat number doesn't take into account the Playboy Mansion which was sold in 2016 for $100million.\n\nThe $43million figure was first revealed back in 2009 when Hefner divorced his second wife Kimberly Conrad.\n\nAt his peak, the Playboy magnate was worth upwards of $200million, but as the magazine's popularity tanked, Hefner lost millions.\n\nBy the time of his death the 91-year-old held 35 percent of the Playboy brand and still completely owned the magazine.\n\nHe had $36million worth of stocks and bonds and $6million in a joint account with an unnamed person.\n\nHis monthly earnings from the magazine only totaled $100,000, with the rest coming from his pension.\n\nHefner's body was driven away from his Playboy mansion early Thursday morning to begin the journey to his final resting place next to Marilyn Monroe.\n\nThe Playboy founder died of natural causes at the age of 91 on Wednesday night. Around 6.30am on Thursday, two hearses were seen leaving his Holmby Hills mansion.\n\nPolice lined the side of his driveway as the hearses left the residence to take the icon's body to an unknown location. He will eventually be buried in a Los Angeles cemetery next to Monroe - Playboy's first-ever cover star - in a plot that Hefner bought in 1992 for $75,000.\n\nHefner's second wife, Kimberly Conrad, was also spotted leaving the mansion Thursday morning with their 27-year-old son, Marston. Conrad's mother is also pictured in the back seat of the car.\n\nThe couple, who shared a 60 year age gap, tied the knot on New Year's Eve in 2012 at the Playboy Mansion in Los Angeles\n\nPlaymate Crystal Harris graces the cover of the July 2011 Playboy magazine as 'Mrs. Crystal Hefner'\n\nConrad (pictured driving) and Hefner were together for nine years and had two children - 27-year-old Marston (pictured in the front passenger seat) and Cooper. Pictured in the back seat is believed to be Conrad's mother\n\nPolice lined the side of his driveway as the hearses left the residence to take the icon's body to an unknown location. He will eventually be buried in a Los Angeles cemetery next to Monroe - Playboy's first-ever cover star - in a plot that Hefner bought in 1992 for $75,000\n\nOfficials outside the mansion signal are seen signaling for the hearses to continue moving forward as they leave the residence\n\nBefore they eventually tied the knot, Hefner and Harris had one notorious failure to launch.\n\nHarris infamously ran from the altar in June 2011, reportedly because she got cold feet.\n\nThe wedding was called off just five days before hand with over 300 guests set to attend.\n\n'Last time it turned into a big ordeal and then it all fell apart,' she said.\n\nShe also publicly shamed Hefner, saying that the she had only been intimate with him once - and very briefly.\n\nShe admitted sex with the octogenarian lasted 'like two seconds', adding: 'Then I was just over it. I was like, 'Ahhh.' I was over it.\n\nThe pair reconciled and Hugh recently said that he wanted to stay with Crystal until he dies.\n\nHugh also insisted that he didn't care about the 60 year difference between them.\n\n'The dramatic age difference between difference & Crystal & me really doesn't matter,' he tweeted. 'Whatever time I have left, we want to spend together.'\n\nWhat made this time around different was the fact that Crystal felt more confident about their relationship and was 'excited' to tie the knot on New Year's Eve.\n\nThe Playmate of the month infamously ran from the altar in June 2011, reportedly because she got cold feet\n\n'This time around is amazing... I'm very happy and Hef's very happy and we're excited,' she said ahead of the nuptials.\n\nShe had already changed her name on the social networking site to Crystal Hefner.\n\nCrystal is the tycoon's third wife. He married Mildred Williams in 1949 before divorcing 10 years later.\n\nIn 1989 he married Playmate Kimberly Conrad and they separated in 1998.\n\nHefner has four children: Christie, David, Marston and Cooper.\n\nBefore the nuptials, Harris was said to have signed an 'ironclad' prenuptial agreement\n\nA source told US Weekly that while the blonde beauty will be taken care of, she has not been added to his will\n\nDuring an appearance on the Huffington Post Live in 2013, the model, 26, was asked why she decided to marry the 86-year-old, to which she replied for 'more security'.\n\n'Well for me it meant more security, knowing that I am the one for him,' she explained.\n\n'Like we were talking about, there are always girls in and out and always the feeling of maybe being replaced... And he made sure I didn't feel that way anymore and that was what the wedding was all about.'\n\nCrystal says she fell for Hefner because she finds him fascinating.\n\n'When I first met him, I had never even met a celebrity in my life before. I was like \"Oh my gosh Hef\" and then we started talking,' she explained.\n\n'And I love learning about all the history... Just being more involved in his life and learning about Playboy and all the things he has done to change the world.'\n\nHefner was born on April 9, 1926 ,in Chicago, Illinois, and went on to become a millionaire after founding the influential men's magazine in 1953.\n\nOn Wednesday night the official Playboy Twitter account announced: 'American Icon and Playboy Founder, Hugh M. Hefner passed away today. He was 91. #RIPHef.'\n\nHefner's death was confirmed in a statement from Playboy Enterprises that said he 'passed away today [Wednesday] from natural causes at his home, The Playboy Mansion, surrounded by loved ones'.\n\nHis son, Cooper Hefner, who is also the chief creative officer of Playboy Enterprises, said: 'My father lived an exceptional and impactful life as a media and cultural pioneer and a leading voice behind some of the most significant social and cultural movements of our time in advocating free speech, civil rights and sexual freedom.\n\nLIFE ACCORDING TO HUGH HEFNER 'It's good to be selfish. But not so self-centered that you never listen to other people.' 'If you let society and your peers define who you are, you're the less for it.' 'Life is too short to be living somebody else's dream.' 'Loneliness doesn't have much to do with where you are.' 'If you don't have a sense of humor about life and yourself, then you are old.'\n\n'He defined a lifestyle and ethos that lie at the heart of the Playboy brand, one of the most recognizable and enduring in history.\n\n'He will be greatly missed by many, including his wife Crystal, my sister Christie and my brothers David and Marston, and all of us at Playboy Enterprises.'\n\nOn Wednesday night, as news of Hefner's death began to circulate, mourners began to gather at the gates of his Playboy Mansion to pay their last respects.\n\nIn the final years of his life, Hefner - who had begun to suffer back problems - began to fade from view, not wanting to be seen using a walker to move around, or be seen fiddling with his hearing aid.\n\n'It's tough to watch him struggle, but I'm just happy it's physical and not mental,' Cooper told The Hollywood Reporter in August.\n\nThe only photos of Hefner known to have been taken anywhere in 2017 were three photos shared by him and his younger brother Marston on social media in July and August. They showed the family playing backgammon together, and dining out.\n\n'He will kill me if I print or if you say anything about him retiring,' Cooper had previously said, 'But I think he is really enjoying his life as a 90-year-old at the mansion.'\n\nDespite the two being practically synonymous with each other, Hefner sold the Playboy Mansion for $100 million in 2016, but one of the stipulations was that he could continue living there.\n\nTwinkies tycoon Daren Metropoulos, who bought the famous party house, said after his death: 'Hugh Hefner was a visionary in business, a giant in media and an iconic figure of pop culture whose legacy will leave a lasting impact. I was fortunate to know him as a neighbor and friend and I extend my deepest sympathies to his family.'\n\nSurrounded by bunnies: Pictured from left Holly Madison, Kendra Wilkinson, Hugh Hefner and Bridget Marquardt - with whom he appeared in reality TV show The Girls Next Door\n\nFirst wives: Hefner is seen left with first wife Mildred Williams. They were married from 1949–1959 and had two children. He's seen right with second wife, Kimberley Conrad - a former Playmate - with whom he also had two children\n\nLadies' man: Hugh Hefner is seen with Kimberly Conrad who he was married to from 1989–2010 and their child Marston Hefner. He married Conrad the same year she became Playmate of the Year. Their son, Cooper, now runs Playboy\n\nCooper now runs the business; his brother Marston, once the heir apparent, has had a low profile since a 2012 alleged domestic violence incident.\n\nAs news of Hefner's death spread online, celebrities gathered to pay tribute.\n\n'RIP to the legendary Hugh Hefner! I’m so honored to have been a part of the Playboy team! You will be greatly missed! Love you Hef! Xoxo,' Kim Kardashian West tweeted.\n\nShe then added: Paris [Hilton] & I are reminiscing about the Playboy parties at the mansion & how much we love Hef. She’s texts me the perfect Hef emojis,' followed by eight Playboy Bunny emojis and an old man emoji.\n\nHilton herself posted a photo of herself in the famous Playboy Bunny outfit, along with Hefner, on Instagram.\n\nLarry King - Hefner's junior at 81 - tweeted: 'Hugh Hefner was a GIANT in publishing, journalism, free speech & civil rights. He was a true original, and he was my friend. Rest well Hef.'\n\nAnd Heidi Montag, who posed for Playboy in 2009, wrote: 'RIP @hughhefner thank you for making me part of the Playboy family. Sending lots of love and prayers to @crystalhefner.'\n\nIn his element: Hefner is surrounded by playmates at the Playboy Mansion in August 2003\n\nAnna Berglund, Hugh Hefner and Crystal Harris arrive at the Kandyland V Benefit At The Playboy Mansion on June 26, 2010 in Los Angeles\n\nHugh Hefner and Holly Madison attend the 2007 Playmate of the Year party at the Playboy Mansion on May 3, 2007 in Los Angeles\n\nOne person who had not commented on Hefner's passing as of 1:30am EST Thursday was President Donald Trump, who appeared on the magazine's cover in 1990 - much to Hefner's chargrin.\n\n'We don't respect the guy,' Cooper Hefner told the Hollywood Reporter in August. 'There's a personal embarrassment because Trump is somebody who has been on our cover.'\n\nTrump was rather prouder of the March cover - which shows him in a tux alongside Playmate Brandi Brandt - having it on display in his New York office.\n\nThat caused a small ruckus in June 2016 when the Reverend Jerry Falwell tweeted a picture of himself and his wife with Trump in front of a wall featuring the cover.\n\nHefner was born Hugh Marston Hefner in 1926 and grew up in a strict Methodist family.\n\nDespite his family's conservatism, his mother gave him a $1,000 loan to publish Playboy - 'Not because she believed in the venture,' he would later say, 'but because she believed in her son.'\n\nHefner (both pictured in 2003 with Henfer's then-Playmate and primary partner Holly Madison, and now-First Lady Melania Kraus) had little respect for Donald Trump - despite featuring him on a cover\n\nTrump appeared on this, the March 1990 cover of the magazine, along with then-Playmate Brandi Brandt. He keeps a copy of this cover on the wall of his New York office\n\nThe magazine hit with a splash, selling 50,000 copies of its first issue - which featured Marilyn Monroe on the cover - and went on to have seven million subscribers by its second year.\n\nAs its star rose, so too did Hefner - and he went on to amass a huge personal wealth that peaked at $200 million.\n\nIn 1971, Hefner spent $1.1 million (the equivalent of $6 million today) to buy up what would become known as the Playboy Mansion, a 21,987-square-foot LA building.\n\nWith a waterfall, swimming pool, secluded grotto and even a wine cellar hidden behind a Prohibition-era secret door, the mansion became the place for Hollywood celebrities to be seen at Hefner's famous Playboy parties.\n\nHe also became a vocal proponent of equal rights for gay people and black Americans; among those interviewed for Playboy was Malcolm X.\n\nBut as time wore on Playboy began to face stiffer competition, first from softcore pornography magazines such as Penthouse in 1969, then later from harder fare such as Larry Flynt's Hustler, which debuted in 1974.\n\nAs Playboy left the 1970s and the competition grew, its sales began to decline.\n\nIt also suffered with the rise of the internet, which made access to nude images - both glamorous and grim - easy for everyone.\n\nIn June 2009 the magazine cut its number of publications per year to just 11, while Hefner sold his English Manor house, located next to the Playboy Mansion, the same year for $18 million - $10 million under the asking price.\n\nThe Playboy Mansion had also begun to reflect Hefner's downturn in fortune.\n\nHefner, seen here with some of his famous Playboy Bunnies in an archive photo, died surrounded by his friends and family, a statement said\n\nIn 2006, Hefner's ex-girlfriend, Izabella St James, then 31, released a book titled Bunny Tales: Behind Closed Doors at the Playboy Mansion, in which she lamented the state of the one-palatial home.\n\nSt James, who entered the home in 2002 as one of Hefner's seven 'girlfriends,' described 'mismatched, random pieces of furniture... as if someone had gone to a charity shop and bought the basics for each room.'\n\nShe claimed things got worse when Holly Madison became Hefner's 'Girlfriend No. 1' - meaning that she could move into his room, along with her dogs.\n\n'They weren't house-trained and would just do their business on the bedroom carpet,' she wrote.\n\n'Late at night, or in the early hours of the morning - if any of us visited Hef's bedroom - we'd almost always end up standing in dog mess.\n\n'Everything in the Mansion felt old and stale, and Archie the house dog would regularly relieve himself on the hallway curtains, adding a powerful whiff of urine to the general scent of decay.'\n\nThe mansion was sold last year for $100 million - half its asking price - to businessman Daren Metropoulos, who had previously bought Hefner's neighboring English Manor in 2009. He plans to to turn them into a single property.\n\nCooper Hefner made the decision in 2015 to drop frontal nudity from Playboy in order to pitch it more as a Vanity Fair-style luxury lifestyle magazine.\n\nThe first nudity-free issue was released in March 2016; Hefner reportedly fought the removal of cartoons from the magazine more than the nudity.\n\nHowever, in February 2017 the decision was reversed, and the nudity - along with the jokes sections among other elements dropped in the redesign - was restored.\n\n'Thanks for being a revolutionary': Jenny McCarthy remembers Hugh Hefner as stars including Paris Hilton and Kim Kardashian pay tribute to Playboy founder dead at 91 Jenny McCarthy owes her career to Playboy. And on Wednesday as news broke of the death of Hugh Hefner, the actress and TV personality paid tribute to the media mogul as she tweeted a picture of one of her Playboy covers. 'RIP #Hef Thank you for being a revolutionary and changing so many people's lives, especially mine,' McCarthy, 44, wrote. 'I hope I made you proud.' She first posed for Playboy in 1993 and as subsequently named Playmate Of The Year after which she moved to Los Angeles and launched her career. Sad: Jenny McCarthy posed for Playboy in 1993 and it launched her Hollywood career. She paid tribute to Hugh Hefner on Twitter on Wednesday following news of his death Thank you for being a revolutionary and changing so many people's lives, especially mine,' McCarthy, 44, wrote. 'I hope I made you proud.' She's pictured with Hef in 2003 Hefner's son Cooper announced his father's death via Twitter Wednesday night. He said his famous dad had passed away of natural causes at the Playboy Mansion in the Holmby Hills neighborhood of West Los Angeles. He is survived by his wife, Crystal, and four adult children: Christie, who served as CEO of Playboy Enterprise for more than 20 years, David, Marston, and Cooper, who currently serves as Chief Creative Officer at the company. A string of Hollywood celebrities, some of whom posed for Playboy during their careers, took to social media to mourn Hefner's passing. Nancy Sinatra wrote: 'One of the nicest men I've ever know. Godspeed, Hugh Hefner.' Friends: Nancy Sinatra shared a snap of herself hugging Hefner and called him 'one of the nicest men I've ever known' The daughter of legendary crooner Frank Sinatra was friends with Playboy founder. They're pictured at the Playboy mansion in 1995 Hotel heiress Paris Hilton shared this snap of herself in a pink Bunny suit cuddling up to the media mogul in the back of a limousine as she paid tribute to the 91-year-old Paris Hilton shared a pic of herself in a pink Bunny outfit cuddling up to Hef in the back of a car. The hotel heiress described him as a 'legend, innovator and one of a kind.' 'We had so many fun and incredible memories together. I will miss him dearly, she wrote. Donna D'Errico, who like her Baywatch co-star Pamela Anderson got her big break thanks to Hefner, also had kind words and gratitude for the late icon. 'Hugh Hefner put me in Playboy & ignited my career. I am forever indebted, Hef. You will forever live on as an icon of epic proportions,' she tweeted. Donna D'Errico also said she owed her career to the Playboy founder and said she would be forever in his debt D'Errico, pictured last month in New York, got her big break posing for PLayboy as did her Baywatch co-star Pamela Anderson Another Baywatch babe and Playboy favorite Carmen Electra recalled 'the magical world' Hefner created and said she would 'always be grateful' for his kindness to her Kim Kardashian got in on the action by saying she was honored to have been part of the Playboy world The reality star was on the cover of the magazine in 2007 The Hills alum Heidi Montag sent love and prayers to Hefner's widow Crystal The Go-Go's singer Belinda Carlisle posed topless for a cover in 2001 Carlisle tweeted that she was 'lucky to have met' Hefner and to have worked with him The Go-Go's singer Belinda Carlisle posed topless for the cover of Playboy in 2001 and also paid tribute. 'Such a sweet kind man - so lucky to have met him and work with him,' the star tweeted after expressing her sadness at hearing of Hefner's passing. Actor Rob Lowe reminisced about having several 'great conversations' with Hefner and called him 'an interesting man.' 'True legend. What an end of an era!' he said on Twitter. Actor Rob Lowe reminisced about having several 'great conversations' with Hefner KISS rocker Gene Simmons called Hefner 'a great man, entrepreneur and innovator' Simmons's wife Shannon Tweed was a Playboy model. She said on social media: 'RIP my friend. You changed the world' KISS rocker Gene Simmons called the Playboy founder 'a great man, entrepreneur and innovator'. His wife Shannon Tweed, who posed for Playboy,posted a photo of Hefner to her Instagram with the message: 'RIP my friend. You changed the world.' Kendra Wilkinson, who was one of the seven Girls Next Door who lived with Hefner and appeared on the reality show with him, said simply: 'Hef changed my life.' 'I couldn't be more thankful for our friendship and our time together,' she said in a statement. 'I will miss him so much but he will be in my heart forever.' Wilkinson's reality show co-star Marquardt tweeted a pic of herself and Hefner and said: 'So sad but forever grateful for all the wonderful memories and amazing experiences.' 'Hef changed my life,' said Kendra Wilkinson, far right, with her Girls Next Door co-stars Holly Madison and Bridget Marquardt with Hefner with whom they lived Marquardt tweeted a pic of her and Hefner and said: 'So sad but forever grateful for all the wonderful memories and amazing experiences' Larry King joined in the chorus of praise reminding people that Hefner was not just a magazine publisher but also an outspoken advocate of free speech and civil rights. 'He was a true original, and he was my friend,' King said. Star Wars star Mark Hamill said Hefner defied the stereotype one would have expected for someone who founded an Empire on naked women and called him 'a thoughtful friend' Rev Jesse Jackson called Hugh a 'strong supporter of the civil rights movement' before adding 'we shall never forget him. May he Rest In Peace' Norman Lear‏ tweeted: 'We’ve lost a true explorer, a man who had a keen sense of the future. We learned a lot from you Mr. Hefner. #HughHefner' The Weeknd simply offered: 'RIP HUGH HEFNER' while actress Kat Dennings admitted: 'I met Hugh Hefner at the Playboy mansion. He was very nice to my mom. Don't ask. #RIPHef' Michael Castillo lauded his impact on 'journalism, music and magazines' Ryan Seacrest remembered how Hef lived his life to the fullest Actress Busy Phillips recalled the time she went to meet Hef and he was 'nice' Rapper Juicy J also joined the celebrities to pay his respect Rapper and record producer expressed his sadness of the news on Twitter Patton Oswalt: 'As per his wishes, Hugh Hefner’s body will be left in a fort in the woods for other kids to find & pass around' Rapper Juicy J: 'RIP Hugh Hefner I went to so many of his parties at the Playboy mansion it was legendary you will never be forgotten' Charlie Puth: 'Wow...just read the news. Rest In Peace Hugh Hefner. Your legacy and soul shall live on!' Ryan Seacrest: 'Rest in peace #HughHefner - he will forever be remembered as the Hollywood legend who lived life to the fullest' Reverend Jesse Jackson shared a photo of a smiling Hef Norman Lear tweeted that we had 'lost a true explorer' and that we had learned a lot from him Actress Kat Dennings recalled the moment she met Hef with her mum Charlie Puth showed his devastation on his social media platform Tomi stated that Hef 'broke the mold' Sea O'Donnell referenced Hef as an 'icon' Loni Love also labelled Hef as 'fearless' as she continued the celebrity tributes Busy Phillips: 'A girl I went to HS with was one of Hugh Hefner's girlfriends for a while(when he had 8 I think)I went to hang with her once. He was nice' Tomi Lahren: 'RIP Hef. You broke the mold. #HughHefner' Loni Love: #HughHefner did more to help civil rights them most of us know... Thxs for being fearless .. #rip' Sean O'Donnell: 'Rest In Peace to an absolute icon of a man Hugh Hefner' Michael Castillo lauded his impact on 'journalism, music and magazines' Ryan Seacrest remembered how Hef lived his life to the fullest Actress Busy Phillips recalled the time she went to meet Hef and he was 'nice' Rapper Juicy J also joined the celebrities to pay his respect Rapper and record producer expressed his sadness of the news on Twitter Larry King joined in the chorus of praise reminding people that Hefner was not just a magazine publisher but also an outspoken advocate of free speech and civil rights Reverend Jesse Jackson shared a photo of a smiling Hef King added: 'He was a true original, and he was my friend' Norman Lear tweeted that we had 'lost a true explorer' and that we had learned a lot from him Actress Kat Dennings recalled the moment she met Hef with her mum Charlie Puth showed his devastation on his social media platform Tomi stated that Hef 'broke the mold' Loni Love also labelled Hef as 'fearless' as she continued the celebrity tributes Sean O'Donnell referenced Hef as an 'icon' Comedian Richard Lewis recalled how Hefner had supported controversial stand up comic Lenny Bruce and defended his right to free speech In announcing his father's death, Cooper Hefner said: 'My father lived an exceptional and impactful life as a media and cultural pioneer and a leading voice behind some of the most significant social and cultural movements of our time in advocating free speech, civil rights and sexual freedom.' Hefner is pictured at the Playboy Mansion in 2006 Star Wars star Mark Hamill said Hefner defied the stereotype one would have expected for someone who founded an Empire on naked women and called him 'a thoughtful friend' Polish model and reality star Joanna Krupa posted a throwback snap of herself with the Playboy founder and said posing for his magazine had 'opened some amazing doors' for her Courtney Stodden said Hefner had always been 'sweet' to her on movie nights at the Mansion LaToya Jackson, who also posed for Playboy, sent her condolences to Hefner's family\n\n'Life is too short to be living someone else's dream': The extraordinary and debauched life of Hugh Hefner, the original Playboy who turned a love of movies, sex and women into a global empire\n\nHugh Hefner, pictured in 2006, died on Wednesday at the age of 91\n\nHe was eulogized by his only son as a media and cultural pioneer as his death at the age of 91 was announced late on Wednesday.\n\nIt was an apt description for Hugh Hefner, the pipe-smoking, hedonist Playboy creator who revved up sexual revolution in the 1950s and built an empire out of the tried and tested notion that sex sells.\n\nAs much as anyone, Hefner helped slip sex out of the confines of plain brown wrappers and into mainstream conversation.\n\nIn 1953, a time when states could legally ban contraceptives, when the word 'pregnant' was not allowed on 'I Love Lucy,' Hefner published the first issue of Playboy, featuring naked photos of Marilyn Monroe (taken years earlier) and an editorial promise of 'humor, sophistication and spice.' The Great Depression and World War II were over and America was ready to get undressed.\n\nIt was a wayward path for a middle class boy from Chicago whose religious parents banned all talk of sex in their home.\n\nHefner was born in Chicago on April 9, 1926, to devout Methodist parents who he said never showed 'love in a physical or emotional way.'\n\n'At a very early age, I began questioning a lot of that religious foolishness about man’s spirit and body being in conflict, with God primarily with the spirit of man and the Devil dwelling in the flesh,' Hefner said in a Playboy interview in 1974.\n\n'Part of the reason that I am who I am is my Puritan roots run deep,' he told the AP in 2011.\n\n'My folks are Puritan. My folks are prohibitionists. There was no drinking in my home. No discussion of sex. And I think I saw the hurtful and hypocritical side of that from very early on.'\n\nHefner loved movies throughout his life, calling them 'my other family.'\n\nHe screened classic films and new releases at the mansion every week. Every year on his April 9 birthday, he’d run his favorite film, Casablanca and invite guests to dress in the fashions of the 1940s.\n\nHe was a playboy before Playboy, even during his first marriage, when he enjoyed stag films, strip poker and group sex. His bunny obsession began with the figures that decorated a childhood blanket. Years later, a real-life subspecies of rabbit on the endangered species list, in the Florida Keys, would be named for him: Sylvilagus palustris hefneri.\n\nHefner grew up in Chicago, Illinois, in a prohibitionist household with two Methodist parents who he said never showed affection towards one another. He is pictured as a young boy some time in the late 1920s, early 1930s\n\nWhen Hefner was nine, he began publishing a neighborhood newspaper, which he sold for a penny a copy. He spent much of his time writing and drawing cartoons, and in middle school began reading Esquire, a magazine of sex and substance Hefner wanted Playboy to emulate.\n\nHe and Playboy co-founder Eldon Sellers launched their magazine from Hefner’s kitchen in Chicago, although the first issue was undated because Hefner doubted there would be a second. The magazine was supposed to be called Stag Party, until an outdoor magazine named Stag threatened legal action.\n\nHefner recalled that he first reinvented himself in high school in Chicago at 16, when he was rejected by a girl he had a crush on.\n\nHe began referring to himself as Hef instead of Hugh, learned the jitterbug and began drawing a comic book, 'a kind of autobiography that put myself center stage in a life I created for myself,' he said in a 2006 interview with the AP.\n\nThose comics evolved into a detailed scrapbook that Hefner would keep throughout his life. It spanned more than 2,500 volumes in 2011 — a Guinness World Record for a personal scrapbook collection.\n\n'It was probably just a way of creating a world of my own to share with my friends,” Hefner said, seated amid the archives of his life during a 2011 interview. 'And in retrospect, in thinking about it, it’s not a whole lot diff\n\nIn 1953, Hefner published the first issue of Playboy with Marilyn Monroe featured on its cover (left). By the 1960s, Playboy nightclubs had erupted in Chicago and Hefner was well and truly on his path to revolutionizing the way the country dealt with sex. He is pictured (right) in the same year\n\nAs Playboy's popularity grew, so did Hefner's and his reputation as a ladies man found its beginnings\n\nHefner divorced his first wife, Mildred Williams, in 1959 after ten years of marriage. They are seen (left) on their 1949 wedding day. By the 1960s, Hefner was on his way to revolutionizing the way the country dealt with sex. He had opened the first of his Playboy nightclubs and was publishing the magazine regularly. Above, he is pictured with 'bunny girl' hostess Bonnie J. Halpin at the Playboy club in Chicago in 1961\n\nHefner is pictured with Playmates in 1960 (left) and again in 1966 (right). The women became known as 'bunny girls'\n\nHe did it again in 1960, when he began hosting the TV show, bought a fancy car, started smoking a pipe and bought the first Playboy mansion.\n\nNot long after it was launched, Playboy soon became forbidden fruit for teenagers and a bible for men with time and money, primed for the magazine’s prescribed evenings of dimmed lights, hard drinks, soft jazz, deep thoughts and deeper desires. Within a year, circulation neared 200,000. Within five years, it had topped 1 million.\n\nBy the 1970s, the magazine had more than 7 million readers and had inspired such raunchier imitations as Penthouse and Hustler. Competition and the internet reduced circulation to less than 3 million by the 21st century, and the number of issues published annually was cut from 12 to 11. In 2015, Playboy ceased publishing images of naked women, citing the proliferation of nudity on the internet.\n\nBut Hefner and Playboy remained brand names worldwide.\n\nAsked by The New York Times in 1992 of what he was proudest, Hefner responded: “That I changed attitudes toward sex. That nice people can live together now. That I decontaminated the notion of premarital sex. That gives me great satisfaction.”\n\nHefner bought the infamous Beverly Hills Playboy Mansion in the 1970s and began throwing his notorious raucous parties. He is pictured outside it in 1975\n\nHefner's lifestyle expanded in extravagance along with the company. He is pictured on the Playboy jet in the 70s\n\nBy the 1970s, Playboy had more than 7million readers and had inspired rivals including Penthouse and Hustler. Hefner is seen above in 1977\n\nHefner's profile as a global celebrity grew and he was seen more and more with one of his beautiful cover girls on his arm. Above, he is pictured with Shannon Tweed in 1981. By the 70s, Hefner had already married and divorced his first wife and they had two children\n\nHefner ran Playboy from his elaborate mansions, first in Chicago and then in Los Angeles, and became the flamboyant symbol of the lifestyle he espoused.\n\nFor decades he was the pipe-smoking, silk-pajama-wearing center of a constant party with celebrities and Playboy models. By his own account, Hefner had sex with more than a thousand women, including many pictured in his magazine. One of rock n’ roll’s most decadent tours, the Rolling Stones shows of 1972, featured a stop at the Hefner mansion.\n\nThroughout the 1960s, Hefner left Chicago only a few times. In the early 1970s, he bought the second mansion in Los Angeles, flying between his homes on a private DC-9 dubbed “The Big Bunny,” which boasted a giant Playboy bunny emblazoned on the tail.\n\nHe continued to grow his empire throughout the 90s (Pictured in 1994) and watched as it welcomed generation after generation of women\n\nHefner was host of a television show, “Playboy After Dark,” and in 1960 opened a string of clubs around the world where waitresses wore revealing costumes with bunny ears and fluffy white bunny tails.\n\nIn the 21st century, he was back on television in a cable reality show — “The Girls Next Door” — with three live-in girlfriends in the Los Angeles Playboy mansion. Network television briefly embraced Hefner’s empire in 2011 with the NBC drama “The Playboy Club,” which failed to lure viewers and was canceled after three episodes.\n\nCensorship was inevitable, starting in the 1950s, when Hefner successfully sued to prevent the U.S. Postal Service from denying him second-class mailing status. Playboy has been banned in China, India, Saudi Arabia and Ireland, and 7-Eleven stores for years did not sell the magazine. Stores that did offer Playboy made sure to stock it on a higher shelf.\n\nWomen were warned from the first issue: “If you’re somebody’s sister, wife, or mother-in-law,” the magazine declared, “and picked us up by mistake, please pass us along to the man in your life and get back to Ladies Home Companion.”\n\nPlayboy proved a scourge, and a temptation.\n\nDrew Barrymore, Farrah Fawcett and Linda Evans are among those who have posed for the magazine. Several bunnies became celebrities, too, including singer Deborah Harry and model Lauren Hutton, both of whom had fond memories of their time with Playboy.\n\nOther bunnies had traumatic experiences, with several alleging they had been raped by Hefner’s close friend Bill Cosby, who faced dozens of such allegations. Hefner issued a statement in late 2014 he “would never tolerate this behavior.” But two years later, former bunny Chloe Goins sued Cosby and Hefner for sexual battery, gender violence and other charges over an alleged 2008 rape.\n\nOne bunny turned out to be a journalist: Feminist Gloria Steinem got hired in the early 1960s and turned her brief employment into an article for Show magazine that described the clubs as pleasure havens for men only.\n\nThe bunnies, Steinem wrote, tended to be poorly educated, overworked and underpaid. Steinem regarded the magazine and clubs not as erotic, but 'pornographic.'\n\n'I think Hefner himself wants to go down in history as a person of sophistication and glamour. But the last person I would want to go down in history as is Hugh Hefner,' Steinem later said.\n\n'Women are the major beneficiaries of getting rid of the hypocritical old notions about sex,'Hefner responded.\n\n'Now some people are acting as if the sexual revolution was a male plot to get laid. One of the unintended by-products of the women’s movement is the association of the erotic impulse with wanting to hurt somebody.'\n\nHefner added that he was a strong advocate of First Amendment, civil rights and reproductive rights and that the magazine contained far more than centerfolds.\n\nPlayboy serialized Ray Bradbury’s 'Fahrenheit 451' and later published fiction by John Updike, Doris Lessing and Vladimir Nabokov. Playboy also specialized in long and candid interviews, from Fidel Castro and Frank Sinatra to Marlon Brando and then-presidential candidate Jimmy Carter, who confided that he had 'committed adultery' in his heart. John Lennon spoke to Playboy in 1980, not long before he was murdered.\n\nWith the dawn of the millennium came a new wave of women for Hefner. By then in his late 70s, he adopted a more grandfatherly demeanor in silk smoking jackets and carried a pipe with him everywhere. He is pictured with actress Jenny McCarthy in 2001\n\nHefner's live-in Playmates Holly Madison, Bridget Marquart and Kendra Wilkinson and their relationship with him became the focal point of a show called The Girls of the Playboy Mansion in the early 2000s\n\nNo signs of slowing down: At his 82nd birthday in 2008 (left), Hefner was presented a cake by a nude Pamela Anderson. He is seen right smooching playmate at a recent party\n\nThe line that people read Playboy for the prose, not the pictures, was only partly a joke.\n\nPlayboy’s clubs also influenced the culture, giving early breaks to such entertainers as George Carlin, Rich Little, Mark Russell, Dick Gregory and Redd Foxx. The last of the clubs closed in 1988, when Hefner deemed them 'passe' and 'too tame for the times.'\n\nBy then Hefner had built a $200 million company by expanding Playboy to include international editions of the magazine, casinos, a cable network and a film production company.\n\nBefore he married Crystal Harris when she was 24 in 2012 (above together in 2014), Hefner said he never found his soulmate\n\nIn 2006, he got back into the club business with his Playboy Club at the Palms Casino in Las Vegas. A new enterprise in London followed, along with fresh response from women’s groups, who protested the opening with cries of 'Eff off Hef!’'\n\nHefner liked to say he was untroubled by criticism, but in 1985 he suffered a mild stroke that he blamed on the book 'The Killing of the Unicorn: Dorothy Stratten 1960-1980,' by filmmaker Peter Bogdanovich.\n\nStratten was a Playmate killed by her husband, Paul Snider, who then killed himself. Bogdanovich, Stratton’s boyfriend at the time, wrote that Hefner helped bring about her murder and was unable to deal with 'what he and his magazine do to women.'\n\nAfter the stroke, Hefner handed control of his empire to his feminist daughter, Christie, although he owned 70 percent of Playboy stock and continued to choose every month’s Playmate and cover shot. Christie Hefner continued as CEO until 2009.\n\nHe also stopped using recreational drugs and tried less to always be the life of the party.\n\nHe tearfully noted in a 1992 New York Times interview: 'I’ve spent so much of my life looking for love in all the wrong places.'\n\nNot surprisingly, Hefner’s marriage life was also a bit of a show. In 1949, he married Mildred Williams, with whom he had two children.\n\nThey divorced in 1958. In July 1989, Hefner married Kimberley Conrad, the 1989 Playmate of the Year, who was then 27. The couple also had two children.\n\nOn the eve of his marriage, Hefner was asked if he would have a bachelor party. 'I’ve had a bachelor party for 30 years,' he said. 'Why do I need one now?'\n\nThey separated in 1998 but she continued living next door to the Playboy mansion with their two sons.\n\nThe couple divorced in 2010 and he proposed in 2011 to 24-year-old Crystal Harris, a former Playmate. Harris called off the wedding days before the ceremony, but changed her mind and they married at the end of 2012.\n\nHefner leaves behind four children. Two of them are Cooper Hefner, 26, one of his sons from his second marriage (left with him in 2014) and Christie Hefner, his daughter from his first marriage who is now 64. They are seen (right) in 2003\n\nHefner's public appearances diminished in recent years. He is pictured in May 2016 looking noticeably more frail than in earlier photographs with Playmate of the Year Eugena Washington\n\n'Maybe I should be single,' he said a few months later. 'But I do know that I need an ongoing romantic relationship.\n\nIn other words, I am essentially a very romantic person, and all I really was looking for, quite frankly, with the notion of marriage was continuity and something to let the girl know that I really cared.'\n\nHe acknowledged, at age 85, that 'I never really found my soulmate.'\n\nIn 1974, in a succinct summary of his legacy, he said: 'Well, if we hadn’t had the Wright brothers, there would still be airplanes.\n\n'If there hadn’t been an Edison, there would still be electric lights. And if there hadn’t been a Hefner, we’d still have sex.\n\n'But maybe we wouldn’t be enjoying it as much. So the world would be a little poorer. Come to think of it, so would some of my relatives.'\n\nThis is believed to be the last picture of Hefner which is in circulation. It was taken on June 16 this year, Fathers' Day and shared online by his son Cooper. He is pictured with Cooper, 26, and Marston, 27, playing back gammon\n\n'Hefner did not lead the sexual revolution - he was a pornographer who locked women up': Feminists lead backlash against Playboy mogul claiming that he treated women like 'consumables'\n\nFeminists have led the backlash against Playboy mogul Hugh Hefner claiming he treated women like 'consumables.'\n\nCritics have called the magazine publisher, who has died aged 91 at his infamous $100million Beverly Hills mansion, a 'sleazeball who made millions from the objectification of women.'\n\nAward-winning film and TV writer Alex von Tunzelmann wrote on Twitter: 'Surely the sexual revolution had far more to do with readily available reliable contraception than porn? And Hefner didn't invent porn.\n\nFeminists have led the backlash against Playboy mogul Hugh Hefner claiming he treated women like 'consumables'\n\n'Women, in this scenario, are merely consumables: life-support systems for the boobs it is so immensely liberating to look at pictures of.'\n\nThe writer, who produced the screenplay for the 2017 film Churchill, added: 'Hefner in fact worked with a precisely anti-sexual revolutionary mindset. He reinforced the subjugation of women at every turn.\n\n'To the point of literally locking them up. Huge metal gates at the Playboy Mansion, 9pm curfew, strict rules.\n\n'There was nothing revolutionary & certainly nothing feminist about him: he was just into a different style of patriarchy from 1950s puritans.\n\n'He published a lot of pictures of boobs, and in doing so made a lot of money and got away with some really grotesque behaviour. That's all.'\n\nFeminist writer and Harvard scholar Laurie Penny said: 'Unsure how to feel about Hugh Hefner? Make a donation in his name to the Rape, Abuse and Incest National Network.'\n\nTV writer Alex von Tunzelmann wrote on Twitter: 'Surely the sexual revolution had far more to do with readily available reliable contraception than porn? And Hefner didn't invent porn'\n\nSports writer Lunga Biyela‏ added: ' Hugh Hefner was not great. Hugh Hefner was a sleazeball who made millions from the objectification of women. How can anyone celebrate him?\n\nActress Ryan Simpkins wrote: 'Maybe I'm just ignorant... but was Hugh Hefner not a major misogynist? Ive only heard stories of him mistreating women...'\n\nIn 1963 leading feminist Gloria Steinem went undercover as a bunny waitress in one of Hefner's clubs and wrote an expose about her experience that was published in Show magazine.\n\nIn ‘A Bunny's Tale’ Steinem describes how employees were banned from having relationships and had to undergo examinations for sexual diseases before they could work, which caused public outcry.\n\nWriter Laurie Penny said: 'Unsure how to feel about Hugh Hefner? Make a donation in his name to the Rape, Abuse and Incest National Network'\n\nAnd in a 2011 documentary about his life, Hugh Hefner: Playboy, Activist and Rebel, Hef controversially said: ‘Women are sex objects. If women weren’t sex objects, there wouldn’t be another generation.’\n\nFormer Playboy bunny Holly Madison lifted the lid on what really goes on in the Playboy mansion and the depression she suffered while being married to Hugh Hefner in her book, 'Down the Rabbit Hole: Curious Adventures and Cautionary Tales from a Former Playboy Bunny'.\n\nShe detailed how, as a 22-year-old college dropout and struggling Hooters waitress, she first met Hefner in 2000 and, after a night out clubbing with his 'girlfriends', realized that she was expected to sleep with him.\n\nThe posse were out at a club in LA and Madison's first encounter with Hefner - now 89 - was him offering her a Quaalude from a tissue in his pocket.\n\n'Usually I don't approve of drugs, but you know, in the '70s they used to call these pills ''thigh openers'',' Hefner told her.\n\n'I knew when I accepted the invitation to go out with them that I was getting into something racy,' Madison writes in the book.\n\nIn the limo on the way home, Madison was told by one of Hefner's seven girlfriends that after clubbing, the party continues in the bedroom\n\nMadison said Hefner's room was dark and cluttered with furniture and video tapes.\n\n'Ceiling-high piles of videotapes, stuffed animals, art and gifts littered the room. It was like an episode of Hoarders,' Madison wrote.\n\nThe only light was coming from two massive televisions that were playing porn.\n\nIn 1963 leading feminist Gloria Steinem went undercover as a bunny waitress (pictured) in one of Hefner's clubs and wrote an expose about her experience that was published in Show magazine\n\nFormer Playboy bunny Holly Madison lifted the lid on what really goes on in the Playboy mansion and the depression she suffered while being married to Hugh Hefner in her book\n\nShe detailed how, as a 22-year-old college dropout and struggling Hooters waitress, she first met Hefner in 2000 and, after a night out clubbing with his 'girlfriends', realized that she was expected to sleep with him\n\n'The girlfriends, in various stages of undress, were sitting in a semicircle at the edge of the bed — some kneeling, some standing, some lying down,' she writes.\n\n'I sat myself on the edge of the bed — unsure of what to do next\n\nOne of the girl's whispered: 'Fake the f---.'\n\nThe aging house was in various stages of disrepair, and the carpet was permanently stained with urine from Hefner's dogs.\n\nThe bedrooms had old, cheap beds and dressers.\n\nThe girlfriends - who had a strict 9pm curfew on nights they didn't go clubbing with Hefner - secretly kept boyfriends on the side, and would tape up the air vents in their room so they could smoke meth without anyone knowing.\n\nEvery bathroom had a tray with Vaseline, Johnson's Baby Oil and Kleenex.\n\nHefner had an open account at the José Eber Salon in Beverly Hills, where the girls could go to get their hair done and have beauty treatments whenever they liked.\n\nHe would also pay for any plastic surgery they wanted, and gave them a $1,000-a-week clothing allowance.\n\n'Frankly speaking, I've always been pretty uncomfortable with Hef's fascination with extremely young women,' Madison writes in the book.\n\n'He was obsessed with women looking as young as humanly possible. Everything — absolutely everything — about that skeeved me out.'\n\nPart of the rules of the house was that the girls could not work, and Madison soon became incredible bored, which started a spiral of depression.\n\nOne day, in an effort to do something with her time, she decided to clean up Hefner's filthy room.\n\nThe girlfriends - who had a strict 9pm curfew on nights they didn't go clubbing with Hefner - secretly kept boyfriends on the side, and would tape up the air vents in their room so they could smoke meth without anyone knowing\n\nAs time went on, Madison became more depressed. 'There were days I woke up and just felt like falling to the floor because I felt so depressed,' she wrote\n\nHowever in her organizing she came across a video that was labeled 'Girl and Dog'.\n\n'My stomach turned,' Madison said. 'I was like, 'What the hell is this?'''\n\nAs time went on, Madison became more depressed. 'There were days I woke up and just felt like falling to the floor because I felt so depressed,' she wrote.\n\nHefner would not let her see a psychiatrist, fearing the doctor would just tell Madison to leave the mansion.\n\nShe ended up seeing one behind his back, and realized that Hefner chose girls that were vulnerable. 'We were all young,' Madison says. 'He wasn't interested in women over 28. None of us were from a big city or affluent backgrounds. None of us had ever seen the darker side of the entertainment industry.'\n\nMadison also said that Hefner became emotionally abusive toward her. Eventually she left the mansion, starting a relationship with magician Chris Angel.\n\nDuring her depression, Madison thought about ending her own life,according to Us Weekly.\n\n'Life inside the notorious Mansion wasn't a dream at all and quickly became her nightmare,' the release continued.\n\n'After losing her identity, her sense of self-worth and her hope for the future, Holly found herself sitting alone in a bathtub contemplating suicide.'\n\nThe book also reveals the 'oppressive routine of strict rules, manipulation, and [her] battles with ambitious, backstabbing bunnies.'", "images": ["https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE523800000578-4927948-image-a-12_1506586021295.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D0E1D000000578-4928382-image-a-76_1506627417579.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE6D8E00000578-4928382-Anna_Berglund_Hugh_Hefner_and_Crystal_Harris_arrive_at_the_Kandy-a-36_1506624481829.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44CE421500000578-4928382-The_couple_who_shared_a_60_year_age_gap_tied_the_knot_on_New_Yea-a-30_1506620655413.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE95B700000578-4928382-Hefner_both_pictured_in_2003_with_Henfer_s_then_Playmate_and_pri-a-61_1506627127833.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CEE0D600000578-4927948-Marquardt_tweeted_a_pic_of_her_and_Hefner_and_said_So_sad_but_fo-a-87_1506582986421.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27312524-0-image-a-19_1587118046208.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE36FC00000578-4928382-Cooper_Hefner_and_Hugh_Hefner_in_2014-a-56_1506625428491.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE574500000578-4927948-Carlisle_tweeted_that_she_was_lucky_to_have_met_Hefner_and_to_ha-a-89_1506582986450.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF797B00000578-4927948-Reverend_Jesse_Jackson_shared_a_photo_of_a_smiling_Hef-a-41_1506588906184.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D248E100000578-4928382-She_detailed_how_as_a_22_year_old_college_dropout_and_struggling-a-98_1506627508815.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE226600000578-4928382-Before_he_married_Crystal_Harris_when_she_was_24_in_2012_above_t-a-52_1506625408905.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE573D00000578-4927948-Michael_Castillo_lauded_his_impact_on_journalism_music_and_magaz-a-36_1506588895520.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/06/44CE373C00000578-4928018-By_the_1960s_Hefner_was_on_his_way_to_revolutionizing_the_way_th-a-231_1506576490107.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/10/27262138-0-image-m-9_1587028193507.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF798800000578-4927948-image-m-31_1506587086278.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE804400000578-4928382-Feminists_have_led_the_backlash_against_Playboy_mogul_Hugh_Hefne-a-65_1506627367610.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE804400000578-4927948-Thank_you_for_being_a_revolutionary_and_changing_so_many_people_-a-109_1506583042652.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/11/27265126-0-image-m-13_1587033403972.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/17/27278632-0-image-a-43_1587052897951.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/06/44CE2A9600000578-4928018-Hefner_with_what_were_referred_to_as_his_bunny_girls_in_1966-a-258_1506577685568.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE98A300000578-4928382-Trump_appeared_on_this_the_March_1990_cover_of_the_magazine_alon-a-62_1506627131568.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE693900000578-4927948-Comedian_Richard_Lewis_recalled_how_Hefner_had_supported_controv-a-106_1506582987750.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE725E00000578-4927948-D_Errico_pictured_last_month_in_New_York_got_her_big_break_posin-a-57_1506582985641.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/09/27309852-0-image-a-13_1587113311145.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CF3D7C00000578-4928382-The_girlfriends_who_had_a_strict_9pm_curfew_on_nights_they_didn_-m-105_1506627565442.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE803000000578-4927948-Simmons_s_wife_Shannon_Tweed_was_a_Playboy_model_She_said_on_soc-a-80_1506582986416.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D248F400000578-4928382-As_time_went_on_Madison_became_more_depressed_There_were_days_I_-a-102_1506627532982.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE709B00000578-4927948-image-a-9_1506585994200.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44D2316800000578-4928382-A_source_told_US_Weekly_that_while_the_blonde_beauty_will_be_tak-a-34_1506620655504.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27297820-0-image-m-1_1587082317595.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE689C00000578-4928382-Second_wife_Hef_is_seen_above_with_his_second_wife_Kimberley_Con-a-41_1506624590829.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CEAC0200000578-4928382-This_is_believed_to_be_the_last_picture_of_Hefner_which_is_in_ci-a-57_1506625439014.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE525200000578-4927948-Sad_Jenny_McCarthy_posed_for_Playboy_in_1993_and_it_launched_her-a-110_1506583042699.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE32F600000578-4927948-In_announcing_his_father_s_death_Cooper_Hefner_said_My_father_li-a-91_1506582986598.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE573D00000578-4927948-image-a-1_1506585983738.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE8F6300000578-4928382-First_wife_Hefner_with_first_wife_Mildred_Williams_They_were_mar-a-42_1506624590860.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CED31E00000578-4927948-LaToya_Jackson_who_also_posed_for_Playboy_sent_her_condolences_t-a-99_1506582986952.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE523400000578-4927948-image-a-3_1506585985953.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316298-0-image-a-1_1587125304518.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE574900000578-4928382-Friends_Nancy_Sinatra_shared_a_snap_of_herself_hugging_Hefner_an-a-59_1506625464539.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D2316300000578-4928382-image-a-85_1506627455565.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE773300000578-4927948-The_reality_star_was_on_the_cover_of_the_magazine_in_2007-a-58_1506582985641.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/07/44CEB36C00000578-0-image-a-109_1506578725383.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF79B400000578-4927948-Loni_Love_also_labelled_Hef_as_fearless_as_she_continued_the_cel-a-46_1506588925316.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF797F00000578-4927948-Norman_Lear_tweeted_that_we_had_lost_a_true_explorer_and_that_we-a-42_1506588911374.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF79B900000578-4927948-image-m-34_1506587130989.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44D397D900000578-4930442-image-a-33_1506620864480.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE50C000000578-4928382-Surrounded_by_bunnies_Pictured_from_left_Holly_Madison_Kendra_Wi-a-40_1506624588044.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE70A200000578-4927948-Larry_King_joined_in_the_chorus_of_praise_reminding_people_that_-a-84_1506582986417.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF797F00000578-4927948-image-m-30_1506587071094.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D0E1C000000578-4928382-image-a-74_1506627412986.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/1s/2020/04/15/18/27234622-0-image-m-45_1586972930213.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/05/44CE34A800000578-4928018-image-a-151_1506573000201.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE574D00000578-4927948-Courtney_Stodden_said_Hefner_had_always_been_sweet_to_her_on_mov-a-101_1506582987097.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44D0D41C00000578-4928382-Playmate_Crystal_Harris_graces_the_cover_of_the_July_2011_Playbo-a-33_1506620655499.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE866A00000578-4928382-Ladies_man_Hugh_Hefner_is_seen_with_Kimberly_Conrad_who_he_was_m-a-39_1506624584304.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE692100000578-4927948-KISS_rocker_Gene_Simmons_called_Hefner_a_great_man_entrepreneur_-a-82_1506582986417.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE523800000578-4927948-Rapper_Juicy_J_also_joined_the_celebrities_to_pay_his_respect-a-39_1506588902621.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/06/44CE786600000578-0-image-m-37_1506576227584.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE683400000578-4928382-No_signs_of_slowing_down_At_his_82nd_birthday_in_2008_left_Hefne-a-50_1506625391747.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/14/27271348-0-image-a-37_1587043733883.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE219200000578-4927948-As_Playboy_s_popularity_grew_so_did_Hefner_s_and_his_reputation_-a-45_1506582885271.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE8F6300000578-4927948-Hugh_Hefner_with_his_first_wife_Mildred_Williams_on_their_weddin-a-46_1506582909824.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE574100000578-4927948-Star_Wars_star_Mark_Hamill_said_Hefner_defied_the_stereotype_one-a-96_1506582986700.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE704700000578-4928382-Hefner_s_live_in_Playmates_Holly_Madison_Bridget_Marquart_and_Ke-a-49_1506625389205.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D0E1C700000578-4928382-TV_writer_Alex_von_Tunzelmann_wrote_on_Twitter_Surely_the_sexual-a-80_1506627430430.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE32D900000578-4927948-Hefner_and_the_bunny_girls_in_1960-a-47_1506582916865.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE709B00000578-4927948-Rapper_and_record_producer_expressed_his_sadness_of_the_news_on_-a-40_1506588904280.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE695100000578-4928382-Hefner_s_lifestyle_expanded_in_extravagance_along_with_the_compa-a-43_1506625300211.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF799500000578-4927948-image-m-32_1506587101819.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE709200000578-4927948-Kim_Kardashian_got_in_on_the_action_by_saying_she_was_honored_to-a-55_1506582985640.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE25A600000578-4928382-Hefner_s_public_appearances_diminished_in_recent_years_He_is_pic-a-55_1506625427209.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE592600000578-4927948-Polish_model_and_reality_star_Joanna_Krupa_posted_a_throwback_sn-a-93_1506582986665.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE807400000578-4928382-Hefner_s_profile_as_a_global_celebrity_grew_and_he_was_seen_more-a-45_1506625306659.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE6C3200000578-4928382-Hotel_heiress_Paris_Hilton_shared_this_snap_of_herself_in_a_pink-a-60_1506625464539.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF798800000578-4927948-Actress_Kat_Dennings_recalled_the_moment_she_met_Hef_with_her_mu-a-43_1506588914504.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE2FA900000578-4927948-Hefner_bought_the_infamous_Beverly_Hills_Playboy_Mansion_in_the_-a-125_1506583500044.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE808100000578-4928382-The_daughter_of_legendary_crooner_Frank_Sinatra_was_friends_with-a-58_1506625464372.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE691D00000578-4927948-The_Hills_alum_Heidi_Montag_sent_love_and_prayers_to_Hefner_s_wi-a-69_1506582985990.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44CE422500000578-4928382-Hugh_Hefner_s_wife_Crystal_Harris_will_inherit_nothing_after_sig-a-35_1506620655604.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/05/44CE36D500000578-4928018-image-a-173_1506573669592.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/09/28/17/44D344C100000578-4930442-image-a-12_1506617974528.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE51BC00000578-4928382-Hugh_Hefner_with_Christie_Hefner_his_daughter_from_his_first_mar-a-53_1506625425183.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/07/44CEB94200000578-0-image-a-46_1506578875425.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/10/44CF79B400000578-4927948-Loni_Love_also_labelled_Hef_as_fearless_as_she_continued_the_cel-a-4_1506589701380.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE74F600000578-4928382-Hugh_Hefner_and_Holly_Madison_attend_the_2007_Playmate_of_the_Ye-a-37_1506624484879.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE597E00000578-4927948-_Hef_changed_my_life_said_Kendra_Wilkinson_far_right_with_her_Gi-a-76_1506582986409.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE6D0E00000578-4928382-He_continued_to_grow_his_empire_throughout_the_90s_Pictured_in_1-a-47_1506625367246.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/10/44CF79B900000578-4927948-Sean_O_Donnell_referenced_Hef_as_an_icon_-a-5_1506589701435.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/05/44CE218A00000578-4927948-Hefner_seen_here_with_some_of_his_famous_Playboy_Bunnies_in_an_a-a-94_1506573528566.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/13/27269924-0-image-a-34_1587041887123.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF79B000000578-4927948-Tomi_stated_that_Hef_broke_the_mold_-a-45_1506588921923.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE692D00000578-4927948-Donna_D_Errico_also_said_she_owed_her_career_to_the_Playboy_foun-a-62_1506582985824.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44CE6CA600000578-4928382-Before_the_nuptials_Harris_was_said_to_have_signed_an_ironclad_p-a-32_1506620655492.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE940300000578-4928382-No_signs_of_slowing_down_At_his_82nd_birthday_in_2008_left_Hefne-a-51_1506625391776.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CEDEFC00000578-4927948-King_added_He_was_a_true_original_and_he_was_my_friend_-a-104_1506582987287.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE524C00000578-4927948-Actress_Busy_Phillips_recalled_the_time_she_went_to_meet_Hef_and-a-38_1506588899874.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF797B00000578-4927948-image-m-29_1506587022999.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE524C00000578-4927948-image-a-6_1506585987669.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CE523400000578-4927948-Ryan_Seacrest_remembered_how_Hef_lived_his_life_to_the_fullest-a-37_1506588897760.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/05/44CE5E8A00000578-0-image-m-84_1506573470497.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE99DF00000578-4927948-Another_Baywatch_babe_and_Playboy_favorite_Carmen_Electra_recall-a-65_1506582985829.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/05/44CE32AD00000578-4928018-In_1953_Hefner_published_the_first_issue_of_Playboy_with_Marilyn-a-172_1506573669437.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE806800000578-4928382-With_the_dawn_of_the_millennium_came_a_new_wave_of_women_for_Hef-a-48_1506625387188.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/05/44CE316A00000578-4928018-image-m-154_1506573030013.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/19/44CE494B00000578-4928382-In_his_element_Hefner_is_surrounded_by_playmates_at_the_Playboy_-a-38_1506624489802.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44D2F37600000578-4930442-image-a-39_1506621352136.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF79B000000578-4927948-image-m-33_1506587117270.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE349800000578-4928382-By_the_1970s_Playboy_had_more_than_7million_readers_and_had_insp-a-44_1506625304309.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44CE597600000578-4928382-Former_Playboy_bunny_Holly_Madison_lifted_the_lid_on_what_really-a-94_1506627502151.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D0E1C700000578-4928382-image-a-83_1506627436315.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D2763700000578-4928382-In_1963_leading_feminist_Gloria_Steinem_went_undercover_as_a_bun-a-92_1506627499066.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE692500000578-4927948-Actor_Rob_Lowe_reminisced_about_having_several_great_conversatio-a-123_1506583498303.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27298132-0-image-a-10_1587083448170.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/09/44CF799500000578-4927948-Charlie_Puth_showed_his_devastation_on_his_social_media_platform-a-44_1506588917134.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/15/44D2433700000578-0-image-a-2_1506608707364.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/18/44D17DCB00000578-4928382-The_Playmate_of_the_month_infamously_ran_from_the_altar_in_June_-a-31_1506620655490.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/08/44CE802800000578-4927948-The_Go_Go_s_singer_Belinda_Carlisle_posed_topless_for_a_cover_in-a-67_1506582985987.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/28/20/44D201DA00000578-4928382-Writer_Laurie_Penny_said_Unsure_how_to_feel_about_Hugh_Hefner_Ma-a-87_1506627459383.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/09/28/15/44D2433700000578-0-image-a-2_1506608707364.jpg", "keywords": [], "authors": ["Harvey Day", "Jade Watkins For Mailonline"], "canonical_link": "https://www.dailymail.co.uk/news/article-4928382/Hugh-Hefner-s-wife-Crystal-Harris-inherit-nothing.html", "title": "Hugh Hefner's wife Crystal Harris 'will inherit nothing'", "meta_data": {"keywords": "dailymail,news", "news_keywords": "dailymail,news", "original-source": "https://www.dailymail.co.uk/news/article-4928382/Hugh-Hefner-s-wife-Crystal-Harris-inherit-nothing.html", "description": "The couple, who shared a 60 year age gap, tied the knot on New Year's Eve in 2012 at the Playboy Mansion in Los Angeles.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Hugh Hefner's wife Crystal Harris, 31, 'will inherit nothing'", "description": "The couple, who shared a 60 year age gap, tied the knot on New Year's Eve in 2012 at the Playboy Mansion in Los Angeles.", "url": "https://www.dailymail.co.uk/news/article-4928382/Hugh-Hefner-s-wife-Crystal-Harris-inherit-nothing.html", "image": "https://i.dailymail.co.uk/i/pix/2017/09/28/15/44D2433700000578-0-image-a-2_1506608707364.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4928382, "author": "Harvey Day", "divclasspage": "articlePage", "mol": {"headline": "Hugh Hefner's wife Crystal Harris, 31, 'will inherit nothing after signing an ironclad prenup before their wedding and was never added to his will'"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-09-28T08:47:44+0100", "modified_time": "2017-09-28T20:41:47+0100", "section": "News", "tag": "Hugh Hefner s wife Crystal Harris inherit nothing", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Hugh Hefner's wife Crystal Harris, 31, 'will inherit nothing'", "type": "article", "description": "The couple, who shared a 60 year age gap, tied the knot on New Year's Eve in 2012 at the Playboy Mansion in Los Angeles.", "url": "http://www.dailymail.co.uk/~/article-4928382/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/09/28/15/44D2433700000578-0-image-a-2_1506608707364.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2015/11/27/7620467175272921688/1024x576_7620467175272921688.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4928382/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4928382/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1506584864.0, "source": "http://www.dailymail.co.uk", "summary": ""}