{"url": "www.thehollywoodgossip.com/2017/03/kim-kardashian-nude-cookbook-on-the-way/", "text": "Not everyone is a fan of Kim Kardashian and/or the books she pretends to write.\n\nJust the other day, some 74-year old got arrested after vandalizing six copies of Kim's selfie-based memoir.\n\nBut we have a pretty strong feeling the only damage anyone will do to the tome discussed will be to spray one's sticky seed all over its page.\n\nIf you know what we mean.\n\nAccording to one of the funniest Radar Online stories we've read in awhile, Kardashian is considering the release of a nude cookbook.\n\nYes, a nude cookbook. As in, a cookbook that features family recipes AND photos of Kim Kardashian nude.\n\nWe challenge anyone out there to come up with a better idea that a book that will enable readers to feed both their actual appetite and their sexual appetite at the same time.\n\nA video report on Radar claims that \"Kim Kardashian has found a new way to line her pockets, even when she doesn’t have any,\" adding by way of explanation:\n\n\"The reality tart is pitching publishers on the idea of a cookbook in which she poses nude next to her favorite recipes.\"\n\nThis may seem like a far-fetched concept, but ask yourself two things:\n\nWould you buy it? Has Kim ever shown any shyness when it comes to taking off her clothing?\n\nYou don't need to tell us the answer to question number-one. We understand if you're a bit embarrassed to admit it.\n\nBut the answer to question number-two is revealed below:\n\nBefore you dismiss this idea as pure nonsense, allow us to direct your attention to David Thorpe's \"Rude Food.\"\n\nIn that cookbook, the late photographer conjures images with subtle juxtapositions of attractive and tastefully nude models, along with an astonishing variety of foodstuffs.\n\nVia Amazon, this allowed him \"to create the ultimate in humerous and safe innuendo.\"\n\nAn anonymous insider tells Radar that Kardashian is convinced “her concept will succeed because she thinks she’s in the best shape of her life after having two children.\"\n\nShe does look pretty good at the moment, don't you think?\n\nLast week, The National Enquirer also alleged that Kim was considering a naked cookbook, writing that the wife of Kanye West wanted to show the world her \"generous cupcakes.\"\n\nBy this, we assume the publication meant her \"very large breasts.\"\n\nFor someone who has been out of the spotlight for months, ever since that scary armed robbery in Paris in early October, this would certainly be a way for Kardashian to get the world talking about her once again.\n\nShe could make the talk show rounds.\n\nShe could gain new social media followers.\n\nShe could recapture all the attention lost to sister Kylie Jenner.\n\nWe really don't see any drawbacks.\n\nMoreover, come on... would this really be the most ridiculous idea for a book from a member of the Kardashian-Jenner family?\n\nConsidering the following releases, all of which are 100% real, it may actually be the best.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--MutO_MRt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1463506349/slideshows/kim-kardashian-nude-selfies-a-birthday-suit-breakdown.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--MutO_MRt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1463506349/slideshows/kim-kardashian-nude-selfies-a-birthday-suit-breakdown.jpg", "keywords": [], "authors": ["Hilton Hater"], "canonical_link": "https://www.thehollywoodgossip.com/2017/03/kim-kardashian-nude-cookbook-on-the-way/", "title": "Kim Kardashian: Nude Cookbook on the Way?!?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/03/kim-kardashian-nude-cookbook-on-the-way/", "title": "Kim Kardashian: Nude Cookbook on the Way?!?", "description": "Kim Kardashian may soon be getting naked again. But not for Playboy or any magazine. For a brand new cookbook!", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XVdNNYFP--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1406038117/kris-jenner-cookbook.jpg", "type": "image/jpeg", "width": 600, "height": 800}}, "article": {"published_time": "2017-03-10T07:07:31-05:00", "modified_time": "2017-03-10T07:07:31-05:00", "tag": "Books", "author": "Hilton Hater"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Kim Kardashian: Nude Cookbook on the Way?!?", "description": "Kim Kardashian may soon be getting naked again. But not for Playboy or any magazine. For a brand new cookbook!", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--MutO_MRt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1463506349/slideshows/kim-kardashian-nude-selfies-a-birthday-suit-breakdown.jpg"}}, "description": "Kim Kardashian may soon be getting naked again. But not for Playboy or any magazine. For a brand new cookbook!"}, "movies": [], "publish_date": 1489147651.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}