{"url": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-revealed-way-too-much-after-a-messy-breakup.html/", "text": "Celebrities may live parts of their lives in the spotlight, but many of them still choose to keep certain things private. And when it comes to breakups, there are some celebs who choose to keep a low profile and grieve away from the limelight. There are others, however, who go through breakups so public that it borders on insane.\n\nHere’s a look at 15 messy celebrity splits that were pushed into the spotlight. (The breakup on page 12 was particularly bad.)\n\n1. Reese Witherspoon and Ryan Phillippe\n\nReese Witherspoon and Ryan Phillippe | Evan Agostini/Getty Images Reese Witherspoon and Ryan Phillippe | Evan Agostini/Getty Images\n\nThey were once one of Hollywood’s cutest young couples. But their split in the early 2000s was nasty — especially when it was publicly aired out that Phillippe had been unfaithful. In 2014, Witherspoon vented about it to Us Weekly, blaming the divorce for her career blunders. Yikes!\n\nNext: One of the most talked about breakups in modern Hollywood …\n\n2. Brad Pitt and Jennifer Aniston\n\nThese exes still make tabloid headlines. | Boris Horvat/AFP/Getty Images These exes still make tabloid headlines. | Boris Horvat/AFP/Getty Images\n\nWith how the tabloids cover it, you would think that these two celebrities are still going through a breakup! Once it was speculated that Pitt had cheated Aniston with Angelina Jolie — more on them on page 15 — the tabloids had a field day that has yet to end. There have also been multiple “tell-alls” from the Friends actress regarding the divorce.\n\nNext: This divorce was as nasty as they get …\n\n3. Burt Reynolds and Loni Anderson\n\nBurt Reynolds and Loni Anderson in happier times. | YouTube Burt Reynolds and Loni Anderson in happier times. | YouTube\n\nNot only was their divorce incredibly public, but it spanned over a couple decades. Anderson alleged that Reynolds beat her, while the Smokey and the Bandit actor criticized his ex-wife’s penchant for spending money. (Reynolds ended up paying Anderson an exorbitant amount of money after their divorce, too.)\n\nNext: How many songs did this split inspire?\n\n4. Taylor Swift and Calvin Harris\n\nTaylor Swift and Calvin Harris. | Harris Stephen Lovekin/Getty Images Taylor Swift and Calvin Harris. | Harris Stephen Lovekin/Getty Images\n\nThe singer’s relationships are typically made very public thanks to her social media persona and her penchant for writing about exes in her songs. But Swift went full force after her breakup with the DJ, to the point that he publicly snapped and went off on her a month after their split.\n\nNext: This split may have inspired a song or two as well …\n\n5. Sonny and Cher\n\nSonny & Cher went through a bitter divorce. | Douglas Miller/Keystone/Getty Images Sonny & Cher went through a bitter divorce. | Douglas Miller/Keystone/Getty Images\n\nThe prolific musical couple just couldn’t keep their high profile split out of the spotlight. In fact, their relationship troubles were visible on their TV show. When they eventually divorced in 1974, Cher accused Bono of withholding her money while Bono publicly fought his ex-wife for custody of their daughter, Chastity.\n\nNext: A messy breakup of ‘titanic’ proportions …\n\n6. James Cameron and Linda Hamilton\n\nJames Cameron and Linda Hamilton had a rocky marriage. | Vince Bucci/AFP/Getty Images James Cameron and Linda Hamilton had a rocky marriage. | Vince Bucci/AFP/Getty Images\n\nHere’s a Hollywood marriage that really took an ugly turn. Shortly after the two wed the director began receiving accolades for Titanic, and Hamilton has publicly blamed the success of the film on the downfall of their marriage. “He was terribly insecure that I was going to ruin it for him somehow,” she told The Telegraph in 2010, adding that accompanying him to awards shows was dreadful.\n\nNext: Things dissolved quickly for one half of this former couple …\n\n7. Ben Affleck and Jennifer Garner\n\nBen Affleck and Jennifer Garner went through a brutal split. | Pascal Le Segretain/Getty Images Ben Affleck and Jennifer Garner went through a brutal split. | Pascal Le Segretain/Getty Images\n\nBen Affleck has been the focal point of more than one bad breakup. But his most recent split from Jennifer Garner was the most ugly. Speculation the actor had an affair with the nanny was followed by multiple stints in rehab and sexual harassment claims. Garner, at least for the most part, has tried to keep the details of her dissolved relationship out of the spotlight.\n\nNext: This nasty split left both parties cursing each other in the media …\n\n8. Johnny Depp and Amber Heard\n\nAmber Heard and Johnny Depp | Michael Kovac/Getty Images for Art of Elysium Amber Heard and Johnny Depp | Michael Kovac/Getty Images for Art of Elysium\n\nThings turned ugly quick when the Pirates of the Caribbean actor’s relationship ended. Heard filed for divorce amid allegations that Depp was physically abusive towards her, and she went so far as to request a restraining order. But that didn’t stop the two from contradicting each other’s stories to the public.\n\nNext: This former model had no problem talking smack about her ex …\n\n9. Heidi Klum and Seal\n\nHeidi Klum blames Seal for their marriage falling apart. | Larry Busacca/Getty Images for EJAF Heidi Klum blames Seal for their marriage falling apart. | Larry Busacca/Getty Images for EJAF\n\nThe supermodel and singer made an adorable couple — and hosted some killer Halloween parties too. But when they split, Klum quickly began airing out their dirty laundry. She blamed Seal’s bad temper and constant time away from home as just a couple of the reasons their 10-year marriage came to an end.\n\nNext: Even worse than jumping up and down on Oprah’s couch …\n\n10. Tom Cruise and Katie Holmes\n\nTom Cruise and Katie Holmes were in the tabloids for months. | Toby Canham/Getty Images Tom Cruise and Katie Holmes were in the tabloids for months. | Toby Canham/Getty Images\n\nActually, everything about Tom Cruise and Katie Holmes’ relationship was a little too public for everyone’s taste. So maybe it was no surprise when their split and subsequent custody battle was splashed across the front pages of tabloids everywhere.\n\nNext: This divorce caused a big bang in the tabloids …\n\n11. Kaley Cuoco and Ryan Sweeting\n\nShe blamed him for ruining the marriage. | Alberto E. Rodriguez/Getty Images She blamed him for ruining the marriage. | Alberto E. Rodriguez/Getty Images\n\nTheir marriage was brief, but the divorce and aftermath was a long, dragged out public bloodbath. In 2018, the Big Bang Theory star went on record to expose Sweeting as the reason the marriage failed. She told Cosmopolitan that Sweeting changed as a person during their relationship, and that she almost ruined the word “marriage” for her.\n\nNext: There were many expletive-laden conversations in this breakup …\n\n12. Mel Gibson and Oksana Grigorieva\n\nLeft: Mel Gibson. | Pascal Le Segretain/Getty Images, Right: Oksana Grigorieva | Kevork Djansezian/Getty Images Left: Mel Gibson. | Pascal Le Segretain/Getty Images, Right: Oksana Grigorieva | Kevork Djansezian/Getty Images\n\nThe Lethal Weapon actor had already been through an ugly money pit of a divorce with his first wife, Robyn. But that was nothing compared to the public firestorm that was his split from Oksana Grigorieva. In the midst of their turbulent breakup, audio emerged of Gibson being verbally abusive to his then-wife. He added insult to injury by continuing to trash her in the tabloids.\n\nNext: This breakup was messy right from the start …\n\n13. Kim Kardashian and Kris Humphries\n\nKim Kardashian and Kris Humphries | Pascal Le Segretain/Getty Images Kim Kardashian and Kris Humphries | Pascal Le Segretain/Getty Images\n\nWhen you’re a reality show star, that probably means your relationships are going to get a lot of extra attention. Such was the case when Kardashian split from the basketball player, and she claimed she knew their marriage was over while on their honeymoon. Humphries publicly retorted and alleged that Kardashian had been cheating on him.\n\nNext: Photographic evidence led to this couple’s demise …\n\n14. Kristen Stewart and Robert Pattinson\n\nThe couple went through a messy breakup. | Juan Naharro Gimenez/Getty Images The couple went through a messy breakup. | Juan Naharro Gimenez/Getty Images\n\nTwilight fans were heartbroken when these two went through a public meltdown. Stewart was caught red-handed cheating on Pattinson, with photos of her with another man becoming public. To make matters worse, Pattinson considered taking her back for a brief spell.\n\nNext: Last but not least …\n\n15. Brad Pitt and Angelina Jolie\n\nAngelina Jolie and Brad Pitt in 2015. | Kevin Winter/Getty Images Angelina Jolie and Brad Pitt in 2015. | Kevin Winter/Getty Images\n\nFans around were shocked when this prolific Hollywood couple called it quits. But what was even more shocking was how public their split became. While Jolie later said that her cancer diagnosis had put an irreversible strain on the marriage, it was initially reported that Pitt was an unfit father to the couple’s six children.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/02/Mel-Gibson-Oksana.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/GettyImages-461104740.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/bradandangelina-e1505323235903.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Robert-Pattinson-and-Kristen-Stewart.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/BenAffleckJenniferGarnerVanityFair-1.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/Burt-Reynolds-and-Loni-Anderson.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Jennifer-Aniston-and-Brad-Pitt.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Isbella-Cruise-Tom-Cruise-and-Katie-Holmes.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/witherspoonphillippe.png", "https://www.cheatsheet.com/wp-content/uploads/2018/04/GettyImages-3295411.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2016/03/Kim-Kardashian-and-Kris-Humphries-1024x682.jpg?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2016/08/Taylor-Swift-hugs-Calvin-Harris.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/05/Amber-Heard-and-Johnny-Depp.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/04/GettyImages-153186405.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/witherspoonphillippe.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/GettyImages-109491252.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/11/witherspoonphillippe.png", "keywords": [], "authors": ["Chelena Goldman"], "canonical_link": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-revealed-way-too-much-after-a-messy-breakup.html/", "title": "Celebrity Couples Who Revealed Way Too Much After a Messy Breakup", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-revealed-way-too-much-after-a-messy-breakup.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Here's a look at celebrities who couldn't keep their messy breakups under raps.", "og": {"locale": "en_US", "type": "article", "title": "Celebrity Couples Who Revealed Way Too Much After a Messy Breakup", "description": "Here's a look at celebrities who couldn't keep their messy breakups under raps.", "url": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-revealed-way-too-much-after-a-messy-breakup.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-08-09T12:28:52-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/11/witherspoonphillippe.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/11/witherspoonphillippe.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "celebrity relationships", "section": "Health & Fitness", "published_time": "2018-05-09T22:59:00-04:00", "modified_time": "2018-08-09T12:28:52-04:00"}, "twitter": {"card": "summary_large_image", "description": "Here's a look at celebrities who couldn't keep their messy breakups under raps.", "title": "Celebrity Couples Who Revealed Way Too Much After a Messy Breakup", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/11/witherspoonphillippe.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1525921140.0, "source": "https://www.cheatsheet.com", "summary": ""}