{"url": "en.wikipedia.org/wiki/Courteney_Cox", "text": "American actress\n\nCourteney Bass Cox (born June 15, 1964)[2][3] is an American actress, producer, and director. She is known for playing Monica Geller on the NBC sitcom Friends, Gale Weathers in the horror series Scream, and Jules Cobb in the ABC/TBS sitcom Cougar Town, for which she earned her first Golden Globe nomination. Cox also starred in the FX series Dirt. She owns a production company, called Coquette Productions, which was created by Cox and her then-husband David Arquette. Cox also worked as a director on her sitcom Cougar Town and the television film TalhotBlond.\n\nEarly life [ edit ]\n\nCox was born and raised in Birmingham, Alabama.[2][4] She is a daughter of businessman Richard Lewis Cox and Courteney Copeland (née Bass).[5][6] Cox has two older sisters, Virginia and Dorothy, and an older brother, Richard Jr. Her parents divorced in 1974 and her mother then married businessman Hunter Copeland (uncle to music promoter and business manager Ian Copeland and The Police drummer Stewart Copeland).[7] After graduating from Mountain Brook High School, Cox left for Mount Vernon College in Washington, D.C. (now part of George Washington University), but did not complete her architecture course, opting instead to pursue a career in modeling and acting.[8] She has English ancestry.[9][10][11]\n\nCareer [ edit ]\n\nEarly career [ edit ]\n\nCox appeared in the 1984 music video for Bruce Springsteen's \"Dancing in the Dark\" as the young woman pulled onstage at the St. Paul Civic Center to dance with Springsteen. Her early television work includes a starring role in the short-lived television series Misfits of Science (1985), and later in a recurring role as Lauren Miller, the girlfriend of Alex P. Keaton (Michael J. Fox) in the TV series Family Ties (1987–89). Her early film roles include Masters of the Universe (1987), Cocoon: The Return (1988), and I'll Be Home for Christmas (1988). She played Jewel Jagger, the tough-as-nails assistant of Larry Burrows (James Belushi), in Mr. Destiny (1990). In 1993, she co-starred in the short-lived CBS sitcom The Trouble with Larry with Bronson Pinchot and Perry King. The following year, shortly before the debut of the sitcom Friends, Cox appeared with Jim Carrey in Ace Ventura: Pet Detective and as Jerry Seinfeld's girlfriend, Meryl, in the Seinfeld episode \"The Wife\". In 1995, she was cast in Toad the Wet Sprocket's music video \"Good Intentions\". The song is also on the Friends soundtrack.\n\nFriends [ edit ]\n\nCox in September 1995\n\nLater in 1994, Cox was asked to audition for the part of Rachel Green on a new sitcom, Friends; she was cast as Monica Geller instead.[12]\n\nAt first the most famous cast member of the new show, Cox joined Jennifer Aniston (Rachel Green), Lisa Kudrow (Phoebe Buffay), Matt LeBlanc (Joey Tribbiani), Matthew Perry (Chandler Bing) and David Schwimmer (Ross Geller) for what became her most famous role, lasting for 10 seasons until 2004. According to the Guinness Book of World Records (2005), Cox (along with her female co-stars) became the highest-paid TV actress of all time, with her US$1 million-per-episode fee for the final two seasons of Friends.\n\nBetween seasons five and six, Cox married David Arquette and consequently changed her name to Courteney Cox Arquette. A joke reference to this is made in the opening credits of the episode \"The One After Vegas\", where the rest of the cast has \"Arquette\" added to their names. The dedication \"For Courteney and David, who did get married\" – a reference to Monica and Chandler's decision not to marry in the episode – appears during the fade out to the tag scene.[13]\n\nFilm career [ edit ]\n\nCox also appeared in the high-profile Hollywood films Scream (1996), Scream 2 (1997), and Scream 3 (2000) as reporter Gale Weathers. She met her husband, David Arquette, who played her on-screen love interest, Dwight \"Dewey\" Riley, while filming the first Scream film. Both Cox and Arquette reprised their respective roles from the Scream trilogy in 2011's Scream 4. The film was released in theaters April 15, 2011.[14]\n\nHer other films include Ace Ventura: Pet Detective with Jim Carrey (1994), The Runner (1999), 3000 Miles to Graceland (2001), and The Shrink Is In (2001). In late 2003, Cox and Arquette produced one season of the reality television series Mix It Up. The lifestyle show, which aired on the We cable channel, struggled with low ratings and was not renewed for a second season.\n\nLater work [ edit ]\n\nCox at Paleyfest in 2010\n\nAfter the conclusion of Friends, Cox was producer Marc Cherry's first choice to be offered a starring role as Susan Mayer on Desperate Housewives, but Cox was unavailable due to her pregnancy and the role later went to Teri Hatcher.[15] A few years later, Cox signed a deal with ABC Studios (formerly Touchstone Television) to star in her own series.\n\nAfter Friends, Cox starred in the independent film November (2005) which had a limited theatrical release; costarred with Tim Allen in the critically derided Zoom (2006), and cameoed in the big-budget remake of The Longest Yard (2005) as Lena, the girlfriend of Paul Crewe (Adam Sandler). She voiced Daisy in the animated film Barnyard (2006). A Friends reunion film was rumored to be in production following the success of Sex and the City (2008),[16] but this has been denied by Warner Bros. and others.\n\nCox starred as Lucy Spiller, a cynical tabloid editor, in Dirt (2007), a television drama for FX. Cox and her husband David Arquette were the executive producers of the series.[17] According to Cox, the series was canceled after the second season in 2008.[18] In July 2008, Entertainment Weekly announced that Cox had signed on to star in a three-episode arc for the television series Scrubs.[19]\n\nIn 2009, Cox began her roles as the star of the single-camera comedy series on ABC called Cougar Town, playing a newly single 40-year-old mother on the hunt for new experiences.[20][21][22] It is notably Cox's most successful work since Friends. The show's third season was to premiere in November 2011, but was moved to February 14, 2012. In the third season, Cox directed two of the show's 15 episodes of that season. The show's fourth season premiered on January 8, 2013. She also starred in a three-episode arc on former Friends co-star Lisa Kudrow's online web series Web Therapy (2009).\n\nIn June 2012, Cox directed and made a cameo appearance in a Lifetime television movie called TalhotBlond, which premiered on the network on June 23, 2012.[23]\n\nPersonal life [ edit ]\n\nCox's previous boyfriends include rock promoter Ian Copeland,[24] actor Michael Keaton, and singer Adam Duritz of Counting Crows.\n\nCox married actor David Arquette on June 12, 1999, at Grace Cathedral in San Francisco.[25][26] The couple had a daughter together named Coco, born in June 2004.[27][28] Cox revealed that she suffered from postpartum depression six months after the birth of her child.[29] Jennifer Aniston is the godmother.[30] On October 11, 2010, it was announced that Cox and Arquette had separated, although they still maintain a close friendship and ongoing business relationship in Coquette Productions.[31][32][33] In June 2012, Arquette filed for divorce after nearly two years of separation from Cox.[34] The divorce became final in May 2013.[35]\n\nCox began dating Snow Patrol band member Johnny McDaid in late 2013.[36] The couple announced their engagement on Twitter on June 26, 2014.[37] Soon afterward they called off the engagement, but they have remained a couple.\n\nOn the Season 9 premiere episode of the American genealogy documentary show Who Do You Think You Are?, whilst visiting Berkeley Castle, Gloucestershire, UK, it was discovered that Cox is an 18 and 19-generation descendant of two key players involved in the deposing and likely murder of King Edward II of England in 1327, and also a 27-generation descendant of William the Conqueror.[38] Cox is a practitioner of Budokan karate.[39][40]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nOther work [ edit ]\n\nAwards and nominations [ edit ]\n\nHonors [ edit ]\n\nAccolades [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/30px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/29px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/25px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Courteney_Cox_%2710_PaleyFest.jpg/167px-Courteney_Cox_%2710_PaleyFest.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/30px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/30px-Flag_of_the_United_States.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/30px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Courteney_Cox_1995.jpg/197px-Courteney_Cox_1995.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Courteney_Cox", "title": "Courteney Cox", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}