{"url": "http://nymag.com/intelligencer/2016/08/meet-gavin-the-five-year-old-meme-star.html", "text": "Wednesday afternoon, Olympic gold medalist and gymnastics phenom Simone Biles tweeted this:\n\nthere is a gavin meme for everything — Simone Biles (@Simone_Biles) August 10, 2016\n\nAh, yes, Gavin. The guy we all know and love. Gavin!\n\nStill confused? Biles’s teammate Laurie Hernandez replied with a reaction meme featuring Gavin.\n\nwhen you win a gold medal at the Olympics: pic.twitter.com/tyhs9gD0ya — Laurie Hernandez (@LaurieHernandez) August 10, 2016\n\nThere he is! Gavin.\n\nAt a time when the eyes of the world are upon Biles and Hernandez performing miraculous athletic feats, the eyes of Biles and Hernandez are on some kid named Gavin.\n\nWell, “some kid” is underselling it: Gavin is the 5-year-old nephew of Vine star Nick Mastodon, a 30-year-old from Minnesota who was one of Vine’s earliest stars thanks to his videos combining Disney movies with Top 40 hits. In November of 2013, he made the viral “Suck a Dick” vine (22 million loops and counting) with his friend Dustin Hatzenbuhler.\n\n“Not the most family-friendly thing we’ve ever made,” Mastodon admitted when I spoke to him on the phone, “but most people seem to enjoy it. And throughout that time in 2013, I started putting my nephew Gavin, who was 2 at the time — he would appear in my videos. And people thought he was cute, but they didn’t really take notice of him a whole lot.”\n\nIn the spring of 2014, Mastodon posted an innocuous video of Gavin with a crested gecko on his forehead. He wasn’t expecting much of a response, but it blew up.\n\n“People started to comment about his reaction and how great it was,” he recalls. “And I was like, Let’s find other ways to capture him in funny situations and see if he can make that face some more. He just made a whole lot of different faces; it’s just something he seems to be good at without even trying.”\n\nGavin kept appearing on Nick’s Vine account over the next two years, and then, all of a sudden, Gavin started blowing up. “It wasn’t up until, like, this past June that he really blew up, and I think it was because more and more big meme accounts were posting pictures of him.” Meme accounts like @chanelpuke and @tinatbh and the like, which trade and copy memes from each other like playing cards. (Know Your Meme credits the account @wedecideit with blowing up Gavin’s spot.) Once they had drawn attention to Gavin, he was everywhere.\n\nWith dozens of Vines to choose from, it was easy to find a Gavin reaction face for any situation. I went from not knowing who Gavin was to seeing 20 different pictures of him in the span of a few days. On Instagram, his mom, Katie, has roughly ten times more followers than she did two months ago.\n\nIn addition to the Team USA shout-out, Gavin has drawn the attention of stars like Katy Perry and Skai Jackson. Shawn Mendes invited Gavin to his show when he was in town.\n\nThe attention of celebrities in tweets like Biles’s are a good indication of just how megaviral Gavin is. “Those types of things are just fun,” Mastodon says, “because they were just talking about him and just addressing him, referring to him on a first-name basis. And I think that that’s really powerful, to show how popular he is or how recognizable his name is.”\n\n“I think the word phenomenon is a good word for it,” he said. “There was definitely a buildup to it, but the fact that all of a sudden so many people are using his pictures and his videos, and there’s Twitter feeds or streams of our old Vines and some of the newer stuff, and just the rate at which this stuff is getting shared is pretty incredible.”\n\nWhen you send a risky text and 5 mins later you open up messages and see the three little dots pic.twitter.com/5tgXnVDlIu — Gavin Reactions (@GavinReacts) August 1, 2016\n\nExactly how aware Gavin is of his internet fame is up for debate. Fans ask to take pictures with him, and he knows that they know him from Vine, but the sheer scale is lost on him. “The only thing I worry about, really, is that he would ever resent any of us for making these videos and posting these pictures,” Mastodon admitted. Some of the money Mastodon makes from doing sponsored Vines goes toward Gavin’s college fund. “I think that it will definitely come down to how we explain what’s happening or how it happens. I’m hoping that he thinks it’s cool. I’m hoping that it’s not something that he gets teased about. I think his parents feel the same way.”\n\nFor the foreseeable future, though, Gavin will continue to grace our screens with his presence. All hail #KingGavin.", "images": ["https://pixel.nymag.com/imgs/daily/selectall/2016/08/11/11-gavin.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/selectall/2016/08/11/11-gavin.w700.h700.jpg", "https://pixel.nymag.com/imgs/daily/selectall/2016/08/11/kp_gavin.w710.h473.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/selectall/2016/08/11/11-gavin.w1200.h630.jpg", "keywords": [], "authors": ["Brian Feldman"], "canonical_link": "https://nymag.com/intelligencer/2016/08/meet-gavin-the-five-year-old-meme-star.html", "title": "Who Is Gavin? And Why Has He Taken Over Twitter?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Who Is Gavin? And Why Has He Taken Over Twitter?", "url": "https://nymag.com/intelligencer/2016/08/meet-gavin-the-five-year-old-meme-star.html", "description": "The origins of the endlessly meme-able 5-year-old.", "image": "https://pixel.nymag.com/imgs/daily/selectall/2016/08/11/11-gavin.w1200.h630.jpg", "site_name": "Intelligencer", "type": "article"}, "twitter": {"title": "Who Is Gavin? And Why Has He Taken Over Twitter?", "description": "The origins of the endlessly meme-able 5-year-old.", "image": "https://pixel.nymag.com/imgs/daily/selectall/2016/08/11/11-gavin.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@bafeldman", "site": "@intelligencer"}, "article": {"published_time": "2016-08-12T09:26:22-04:00", "tag": "Gavin, select all", "publisher": "https://www.facebook.com/NewYorkMag", "opinion": "true"}, "description": "The origins of the endlessly meme-able 5-year-old.", "sailthru.tags": "Gavin, select all", "author": "Brian Feldman", "fb": {"app_id": 120608177953522}, "type": "Article", "vertical": "Intelligencer", "apple-mobile-web-app-title": "Intelligencer", "application-name": "Intelligencer", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/intelligencer/icon.144x144.png"}, "movies": [], "publish_date": 1471008382.0, "source": "http://nymag.com", "summary": ""}