{"url": "https://www.hollywoodreporter.com/news/alec-baldwin-admits-hes-bullied-women-calls-a-change-hollywood-1054420", "text": "The Paley Center for Media paid tribute to the actor Thursday at the Paley Honors.\n\nOn Thursday, The Paley Center for Media honored Alec Baldwin for his distinguished career and supportive efforts for the organization’s educational initiatives. The event included a discussion with The Tonight Show Starring Jimmy Fallon announcer and Saturday Night Live writer-producer Steve Higgins.\n\nBaldwin made a point to discuss the current sexual misconduct allegations circulating in Hollywood. The actor admitted that he has been guilty of treating women poorly in the past. “I certainly have treated women in a very sexist way. I’ve bullied women. I’ve overlooked women. I’ve underestimated women. Not as a rule,” he said. “From time to time, I’ve done what a lot of men do, which is … when you don’t treat women the same way you treat men. You don’t. I’m from a generation where you really don’t and I’d like that to change. I really would like that to change.”\n\nThe Emmy Award-winning actor said that the way individuals function in the workplace needs to change, not just in Hollywood but everywhere. “I think it’s important for us to try to make the workplace and beyond not only comfortable and right and fair and appropriate but as productive, as well. I think a lot of what we’re dealing with within this issue is hurting our business. It’s making it less productive,\" Baldwin asserted.\n\n“I knew of certain things, that there were rumors of things happening to people, but I didn’t necessarily know the scope, when you hear the hundreds and hundreds of women who are complaining about this,” the actor admitted while accepting the honor. “It’s been a very eye-opening experience for me personally. We’ve got to be vigilant in a new way to make sure that everybody is comfortable and that we get the job done together that we’re there to do.”\n\nDuring the conversation, Baldwin and Higgins discussed some of the actor’s career highlights, including his famous impression of Donald Trump on NBC's Saturday Night Live. When Higgins asked if Baldwin jumped at the opportunity to play the public figure turned president, he joked, “I was so there. I was like, ‘Oh, God, I hope that Lorne [Michaels] calls me.'” Baldwin admitted that he initially had no clue how in-demand the character would become. “I lived in a world where it was presumed he wasn’t gonna win,” he said. Because of this, Baldwin thought he was only committed to play the character for three episodes on the late-night sketch show.\n\nBaldwin mentioned that he had only known Trump in passing prior to his portrayal. “He was always kind of a drive-by presence in Manhattan,” he said. While the two had attended the same events, Baldwin explained that Trump would often show up for the red-carpet photo opportunities and then leave before the socializing began. “It would have been nice to sit through dinner, just out of curiosity, with Trump and say, ‘Tell me what it was like growing up there in Jackson Heights, or wherever you’re from,’” Baldwin said. “You never got to talk to him. You never met him. He was a cypher.”\n\nBaldwin said his lack of personal interactions with Trump didn’t leave him with much material to draw from when creating the character. “So when you come in to do the show, you just have him in the media. Although he’s pretty vivid in the media. He seems like himself,” the actor said on his inspiration for the impersonation. “I just wanted to make him as miserable as possible. He wins the election and he’s like, ‘God damn you people,’” Baldwin said in his best Trump impression.\n\nAnother character Baldwin reflected on was that of Jack Donaghy of NBC’s critically acclaimed sitcom 30 Rock. “I got very lucky,” he said. The show never garnered impressive ratings, but managed to be a critical success. Baldwin won seven SAG Awards and two Emmy Awards for the role. “We were very lucky that the show was a critical darling,\" he said.\n\n“We started in 2006. The [financial] crash came in 2008. It was very disruptive of the broadcast TV business and their ad rates and so forth,” recalled Baldwin. His theory regarding 30 Rock’s success was that is remained on the air as long as it did because most of its audience was in the entertainment industry. “People in the business watch the show. It’s not like other shows, which are huge hits but they might not be darlings in the industry.”\n\nBaldwin also added that while he has acted in both dramas and comedies, he tends to choose his projects based on the material instead of the genre. “I love doing dramas if the material is worthwhile, but then I did the TV show with [30 Rock creator and star] Tina [Fey],” he said. “The writing is essential, and the writing was so good.”", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2017/11/hilaria_baldwin_alec_baldwin.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/11/hilaria_baldwin_alec_baldwin.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/11/hilaria_baldwin_alec_baldwin.jpg", "keywords": [], "authors": ["Katherine Schaffstall", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/alec-baldwin-admits-hes-bullied-women-calls-a-change-hollywood-1054420", "title": "Alec Baldwin Admits He's \"Bullied Women,\" Calls for a Change in Hollywood", "meta_data": {"viewport": "width=device-width", "description": "The Paley Center for Media paid tribute to the actor Thursday at the Paley Honors.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/alec-baldwin-admits-hes-bullied-women-calls-a-change-hollywood-1054420", "domain": "https://www.hollywoodreporter.com/", "title": "Alec Baldwin Admits He's \"Bullied Women,\" Calls for a Change in Hollywood", "description": "The Paley Center for Media paid tribute to the actor Thursday at the Paley Honors.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/11/hilaria_baldwin_alec_baldwin.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Alec Baldwin Admits He's \"Bullied Women,\" Calls for a Change in Hollywood", "description": "The Paley Center for Media paid tribute to the actor Thursday at the Paley Honors.", "url": "https://www.hollywoodreporter.com/news/alec-baldwin-admits-hes-bullied-women-calls-a-change-hollywood-1054420", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/11/hilaria_baldwin_alec_baldwin.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Alec Baldwin Admits He's \"Bullied Women,\" Calls for a Change in Hollywood", "sailthru.description": "The Paley Center for Media paid tribute to the actor Thursday at the Paley Honors.", "sailthru.author": "Katherine Schaffstall", "sailthru.vertical": "Television", "sailthru.date": "2017-11-02 14:12:45", "sailthru.tags": "Television,Culture,Alec Baldwin,About Town,autoplay,Events"}, "movies": [], "publish_date": 1509603165.0, "source": "https://www.hollywoodreporter.com", "summary": ""}