{"url": "https://www.harpersbazaar.com/celebrity/latest/a15903105/kate-middleton-prince-william-baby-due-date/", "text": "In September, the Duke and Duchess of Cambridge announced they're expecting another royal baby—their third child, after Prince George, 4, and Princess Charlotte, 2. Although Kate Middleton initially suffered from acute morning sickness (hyperemesis gravidarum) during this pregnancy, which prevented her from fulfilling her royal duties, she soon returned to the public sphere.\n\nNow, the royal baby, a little prince, is finally here and he's just celebrated his christening. Here's everything we know about Prince William and Kate Middleton's newest addition.\n\nHis name is Louis Arthur Charles.\n\nThe Duke and Duchess revealed the Louis' name nearly four days after he was born. Though a flood of royal fans placed bets on the names Arthur and Albert, the couple ultimately went with Louis as the first name.\n\nLouis means \"famous in battle\" or \"famous warrior\" and also appears in Prince George and Prince William's full names: George Alexander Louis and William Arthur Philip Louis. The moniker is pronounced \"loo-wee,\" the French way, like Louis Vuitton.\n\nHe was born on Monday, April 23.\n\nKate Middleton gave birth on her expected due date. Early in the morning, she was reported to be in labor in the hospital. Hours later, Kensington Palace announced that the Duke and Duchess of Cambridge welcomed a son at 11:01 a.m. London time (6:01 a.m. ET). Prince William was present for the birth.\n\nSources tell BAZAAR.com that Middleton made a hush-hush arrival at around 5:20 a.m. She gave birth less than six hours later.\n\nHer Royal Highness The Duchess of Cambridge was safely delivered of a son at 1101hrs.\n\n\n\nThe baby weighs 8lbs 7oz.\n\n\n\nThe Duke of Cambridge was present for the birth.\n\n\n\nHer Royal Highness and her child are both doing well. — Kensington Palace (@KensingtonRoyal) April 23, 2018\n\nLouis' birthday is a little more than a week before Princess Charlotte's (May 2), and a few months ahead of Prince George's (July 22). It's also just two days after his great-grandmother Queen Elizabeth II's, April 21.\n\nHe weighed 8 pounds, 7 ounces, breaking a royal record.\n\nLouis turned out to be the heaviest of William and Kate's children at birth. Prince George was 8 pounds, 6 ounces when he was born, and Princess Charlotte was only 8 pounds, 3 ounces, Marie Claire points out.\n\nHe's also heavier that Prince William (7 pounds, 5 ounces), Prince Harry (6 pounds, 14 ounces), and grandfather Prince Charles (7 pounds, 6 ounces) were when they were born, according to Hello!.\n\nHe's fifth in line for the throne.\n\nThe Duke and Duchess' third child will follow these family members in the British line of succession: Queen Elizabeth, Prince Charles (Louis' grandfather), Prince William, Prince George and Princess Charlotte. The baby will bump Prince Harry down to sixth place in line for the crown, The Telegraph reports.\n\nThis is also a historic event for Princess Charlotte, who becomes the first female member of the royal family to not get bumped down in the line of succession by a younger male heir.\n\nMiddleton gave birth at St. Mary's Hospital in London.\n\nLike his older siblings, Prince Louis was born at the Lindo Wing of St. Mary's Hospital in Paddington, London. The Duke and Duchess presented their youngest to the public just outside the hospital steps, as they did with their first two children. (George and Amal Clooney's twins, Ella and Alexander, were also born here.)\n\nThe photo call was only seven hours after Middleton gave birth.\n\nGetty Images\n\nThe Duke and Duchess welcome Prince George in 2013. Getty Images\n\nThe Duke and Duchess welcome Princess Charlotte in 2015. Getty Images\n\nLouis lives with his family at Kensington Palace.\n\nAfter stopping for a photo opp when he was born, the Duke and Duchess of Cambridge returned home with their newborn. Kate is currently on maternity leave to recover and take care of her youngest.\n\nHer Royal Highness The Duchess of Cambridge will be leaving St. Mary’s Hospital this evening. The Duke and Duchess of Cambridge and their son will travel home to Kensington Palace. — Kensington Palace (@KensingtonRoyal) April 23, 2018\n\nHe's \"behaving himself.\"\n\nTwo days after bringing the new prince home, proud dad Prince William said the newborn was doing \"very well\" and that the whole family was \"in good form, luckily.\"\n\nThe Duke of Cambridge also gave an adorable update on baby: “Sleeping’s going reasonably well so far. So he’s behaving himself, which is good.”\n\nPrince William says: “Sleeping’s going reasonably well so far. So he’s\n\nbehaving himself, which is good.” — Richard Palmer (@RoyalReporter) April 25, 2018\n\nHis birth was announced on an easel outside Buckingham Palace.\n\nAfter Louis was born, an official letter noting his birth date and time, sex, and weight, was posted on an easel outside Buckingham Palace, following royal tradition.\n\n\"He Royal Highness the Duchess of Cambridge was safely delivered of a son at 11:01 a.m. today. Her Royal Highness and her child are both doing well,\" the notice reads.\n\nGetty Images\n\nThe announcement was also emailed to media outlets and shared on social media for the world to see.\n\nLouis is the Queen's sixth great-grandchild.\n\nIn addition to Louis, Queen Elizabeth II's great-grandchildren currently include Savannah Phillips, 7, Isla Phillips, 5, Mia Grace Tindall, 4, Prince George, 4, Princess Charlotte, 2, and Lena Tindall, who was just born on June 18.\n\nHis royal title will be a mouthful.\n\nAccording to their birth certificates, George's full name is \"His Royal Highness Prince George Alexander Louis of Cambridge\" and Charlotte's is \"Her Royal Highness Princess Charlotte Elizabeth Diana of Cambridge.\"\n\nFollowing tradition, Prince Louis' official title follows the same format: His Royal Highness Prince Louis Arther Charles of Cambridge.\n\nHe won't have a surname.\n\n\"The royal baby will not have a last name,\" royal historian and writer of Royal Musings blog Marlene Koenig told Town & Country. \"The name on the birth certificate will say HRH Prince or Princess, and all three names of Cambridge.\" The same happened with Prince George and Princess Charlotte, who did not have last names on their official birth certificates.\n\nLouis already has his own official portraits.\n\nThey were taken by his mom, the Duchess of Cambridge, and released a week after he was born. One of the photos includes his big sis Princess Charlotte, who celebrated her birthday days before the pictures were shared.\n\nHe has six godparents.\n\nKensington Palace announced the godparents William and Kate chose for Louis ahead of his christening on July 9. Although the group does not include Prince Harry and Meghan Markle, the individuals are all close friends of the Cambridges:\n\nMr. Nicholas van Cutsem\n\nMr. Guy Pelly\n\nMr. Harry Aubrey-Fletcher\n\nThe Lady Laura Meade\n\nMrs. Robert Carter\n\nMiss Lucy Middleton\n\nThese are all the photos you missed from the prince's birth.\n\nAnd these are all of the photos from his christening.\n\nSecurity was tight for the baby's arrival.\n\nMiddleton's maternity suite at the Lindo wing, which reportedly costs more than $9,650 per day, had been on \"lock-down\" since mid-March, a source told Us Weekly. Security checks the room regularly, which is sealed with tamper-proof tape, and the crawl space above it as well. \"It’s a high-security operation,\" the insider added.\n\nWhen the Duchess goes into labor, she and Prince William are expected to drive directly to the maternity ward, which is less than two miles away from Kensington Palace. The hospital will only get a five minute notice of the royal couple's arrival, the source noted, to avoid the info getting leaked that they've left home. The insider also told Us that there's a designated \"baby team\" set at Kensington Palace to prep the official birth announcement.\n\n\"Everything is planned to the tiniest detail,\" the royal source said, but if anything goes wrong (which we hope it won't), there's also \"a backup plan for everything.\"\n\nThe hospital got ready for the the delivery about a month ago.\n\nThe Duke and Duchess usually pose at the gates outside the Lindo Wing after the baby is born for thier first photo op with the child. (They did the same with Prince George and Princess Charlotte.) At the end of March, the gates were spotted mid-renovations, hinting that preparations for the royal family’s arrival was underway.\n\nThe railings outside The Lindo Wing at St Marys Hospital Paddington are being painted. I suppose it’s never too early to get used to the smell of fresh paint pic.twitter.com/G4kmKTds1o — Arthur Edwards (@ArthurJEdwards) March 27, 2018\n\nMore recently, authorities were seen erecting barriers outside of the entrance. New restrictions have also been put on street parking by the wing from April 9-30.\n\nGetty Images\n\nGetty Images\n\nRoyal photographer Tim Rooke also told Town & Country that the media could start staking out by the Lindo wing as early as April 9, which could explain the barriers. Traditionally, the media positions are organized two weeks before the baby’s birth, according to Rooke. However, photographers and journalists can’t stake out in front of the doors until it’s been announced that the Duchess of Cambridge has been admitted to the hospital.\n\nWant more royals? Now you can watch all of the best episodes from Bazaar's Royal Watch—right here on Prime Video.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=1.00xw:0.752xh;0,0.132xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-william-royal-baby-name-slip-1524682650.jpg?crop=1.00xw:0.752xh;0,0.0649xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=1.00xw:0.752xh;0,0.132xh&resize=1200:*", "keywords": [], "authors": ["Erica Gonzales"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a15903105/kate-middleton-prince-william-baby-due-date/", "title": "Kate Middleton and Prince William Royal Baby Facts", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Prince Louis Was Just Christened—​Here's Everything To Know About the Royal Baby", "description": "From his full royal title, to his official portraits, and everything in between.", "url": "https://www.harpersbazaar.com/celebrity/latest/a15903105/kate-middleton-prince-william-baby-due-date/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=1.00xw:0.752xh;0,0.132xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2019-10-21 03:54:11", "published_time": "2018-07-09 05:30:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=1.00xw:0.752xh;0,0.132xh&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Prince Louis News - Kate Middleton and Prince William Royal Baby Facts", "description": "Now, the royal baby, Prince Louis, is finally here. Here's everything we know about Prince William and Kate Middleton's newest addition so far.", "keywords": "prince louis, prince louis news, kate middleton kids, prince william kids, royal kids, royal baby, royal baby 3, royal baby news, royal kids news", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=0.668xw:1.00xh;0.0497xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,prince william kate middleton kids,prince william kids,kate middleton due date,kate middleton pregnant,prince george,prince william,princess charlotte,kate middleton", "sailthru.date": "2018-07-09T17:30:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=1.00xw:0.752xh;0,0.132xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-louis-gettyimages-994597726-1531156436.jpg?crop=0.668xw:1.00xh;0.0497xw,0", "sailthru.socialtitle": "Prince Louis Was Just Christened—​Here's Everything To Know About the Royal Baby", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1531085400.0, "source": "https://www.harpersbazaar.com", "summary": ""}