{"url": "https://www.cheatsheet.com/entertainment/sammi-sweetheart-giancola-reveals-why-she-wont-return-for-jersey-shore-family-vacation.html/", "text": "Jersey Shore took the television world by storm by introducing catchphrases and slang to pop culture. But there was a backlash and it was one of the most hated shows. Now the show is back with Jersey Shore: Family Vacation, so fans can catch up on the stars as they go on vacation.\n\nThere is one person missing that is sorely missed. That’s Sammi “Sweetheart” Giancola, who had a volatile off-and-on relationship with Ronnie Ortiz-Magro. There are rumors as to why she turned down the opportunity but she has finally given a statement.\n\nSo why won’t she be on the show (page 6) and what has the other cast members said about it? Here are seven things to know.\n\n1. Jenni ‘JWOWW’ Farley and Nicole ‘Snooki’ Polizzi said they wanted Giancola to do the show\n\nPolizzi and Farley wanted their old friend to come back on the show with them. | Rich Polk/Getty Images for MTV Polizzi and Farley wanted their old friend to come back on the show with them. | Rich Polk/Getty Images for MTV\n\nEarly on, there seemed to at least be some hope that Giancola would change her mind and appear on the show. Jenni “JWoww” Farley and Nicole “Snooki” Polizzi talked about hoping this would happen.\n\n“In my head, in my dreams of dreams, I really hope that [Sammi] pops in,” Farley once told Us Weekly. “Yeah, it’s gonna be different. I wish she would be on it but I understand why she’s not going to be on it.”\n\nPolizzi said on her podcast that multiple people tried to get Giancola to change her mind. “We’re all begging her to come back on the show. It’s really up to her. Everyone pray that Sammi comes back because I feel like she might change her mind.”\n\nSo why isn’t she doing it? Well, Ronnie Ortiz-Magro has been suspected of being part of the reason, given they used to date on the show.\n\nNext: This is what Ortiz-Magro said about the claim he’s the reason she didn’t come back.\n\n\n\n2. Ronnie Ortiz-Magro denies being the reason Giancola didn’t come back\n\nOrtiz-Magro only has nice things to say about his ex. | Rich Polk/Getty Images for MTV Ortiz-Magro only has nice things to say about his ex. | Rich Polk/Getty Images for MTV\n\nMany fans wondered if Giancola was avoiding the show because of Ortiz-Magro. The two had a volatile romantic relationship on the original show, so it would have been understandably awkward. But he denies this.\n\n“We started this all together and I would have loved to have finished it together because now everyone thinks it’s because of me she didn’t come back, but it’s because she has a boyfriend,” Ortiz-Magro told Us Weekly.\n\nNext: This source goes against what Ortiz-Margo said.\n\n\n\n3. A source previously said she didn’t want to do it because of Ortiz-Magro\n\nTheir dramatic relationship may have been a factor. | Chris Roque/Getty Images for Intouch Weekly Their dramatic relationship may have been a factor. | Chris Roque/Getty Images for Intouch Weekly\n\nAlthough he denies this, a source did say he was a factor in the decision, especially since she now has a new boyfriend.\n\n“She is super happy with [her new boyfriend] and she didn’t want to do the show mainly because of Ronnie,” a source told Us Weekly. “She didn’t want the drama, the reliving of the relationship … It would of been a big problem for her new relationship if there were any drama with Ronnie, and her new guy is more important to her than the show.”\n\nNext: Ortiz-Margo did have this to say about Giancola.\n\n\n\n4. Ortiz-Margo said no matter what, Giancola will be a part of his life\n\nThey have a lot of history together. | MTV They have a lot of history together. | MTV\n\nAlthough Giancola has decided to move on Ortiz-Margo recognizes that she will always be a part of his reality TV career.\n\n“No matter what, she’s always going to be … [as] you’ll see in this season I say, ‘Sam will always be a part of my life, but she doesn’t have to be a part of my life.’ No matter what, this will always be on the television show, [in] interviews, Sam will always be brought up,” he said.\n\nHe also added, “So she’ll be a part of my life, but she doesn’t have to be standing next to me to be a part of my life.”\n\nNext: Farley said this is why Giancola didn’t do it.\n\n\n\n5. Farley hinted Giancola wouldn’t come because of her boyfriend\n\nGiancola and her boyfriend, Christian Biscardi, appear happy together. | Giancola and her boyfriend, Christian Biscardi, appear happy together. | Sammi Sweetheart via Instagram\n\nThe other cast members also had to answer questions as to why Giancola isn’t on the show. Farley told E! News:\n\nShe didn’t want to be a part of it because she’s moved on with her life. For all of us, we never thought that this was coming back. We truly wanted it to come back, but we never thought that, so when the opportunity came, she’s just in a different place now. And she had real-life drama in this house, so I think she just didn’t want it brought up again.\n\nNext: This is Giancola’s statement on her decision.\n\n\n\n6. Giancola said she didn’t return because she’s in a different place\n\nGiancola’s statement to her fans. | Giancola’s statement to her fans. | Sammi Sweetheart via Instagram\n\nThe reality star was suspiciously absent in all of the promos for the reunion reality show. But fans were still hoping she would somehow be a part of it. It doesn’t look like it’ll happen since she posted the above statement on Instagram.\n\nShe said, “I have chosen not to join the show this season because I am at a completely different place in my life right now focusing on my businesses and relationship.”\n\nNext: This is an important part of her statement.\n\n\n\n7. She said doing the show is ‘potentially toxic’\n\nGiancola wants to avoid the past turmoil. | Robin Marchant/Getty Images for LASIO Inc. Giancola wants to avoid the past turmoil. | Robin Marchant/Getty Images for LASIO Inc.\n\nIn the statement, Giancola made sure to say she loved her former roommates. But she was also honest saying, “I am currently extremely happy in every aspect of my life and want to avoid potentially toxic situations.”\n\nFollow Nicole Weaver on Twitter @nikkibernice.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/03/jersey-shore.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/sammi-sweetheart-statement.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party-1.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/sammi-sweetheart-boyfriend.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Intouch-Weeklys-ICONS-IDOLS-Party-Inside.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Lasio-Studios-Red-Carpet-Grand-Opening.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party.jpg", "keywords": [], "authors": ["Nicole Weaver"], "canonical_link": "https://www.cheatsheet.com/entertainment/sammi-sweetheart-giancola-reveals-why-she-wont-return-for-jersey-shore-family-vacation.html/", "title": "Sammi Sweetheart Giancola Reveals Why She Didn’t Return for ‘Jersey Shore: Family Vacation’", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/sammi-sweetheart-giancola-reveals-why-she-wont-return-for-jersey-shore-family-vacation.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "This 'Jersey Shore' cast member has revealed why she definitely won't be back for the TV revival.", "og": {"locale": "en_US", "type": "article", "title": "Sammi Sweetheart Giancola Reveals Why She Didn't Return for 'Jersey Shore: Family Vacation'", "description": "This 'Jersey Shore' cast member has revealed why she definitely won't be back for the TV revival.", "url": "https://www.cheatsheet.com/entertainment/sammi-sweetheart-giancola-reveals-why-she-wont-return-for-jersey-shore-family-vacation.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-01T21:30:28-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "reality TV", "section": "Entertainment", "published_time": "2018-06-01T21:28:00-04:00", "modified_time": "2018-06-01T21:30:28-04:00"}, "twitter": {"card": "summary_large_image", "description": "This 'Jersey Shore' cast member has revealed why she definitely won't be back for the TV revival.", "title": "Sammi Sweetheart Giancola Reveals Why She Didn't Return for 'Jersey Shore: Family Vacation'", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Jersey-Shore-Family-Vacation-Premiere-Party.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1527902880.0, "source": "https://www.cheatsheet.com", "summary": ""}