{"url": "https://www.thesun.co.uk/fabulous/5472000/married-at-first-sight-sean-jo-disappointed/", "text": "A MAN marrying a stranger on a reality TV show was so disappointed by his new wife's appearance that he muttered \"oh s**t\" the moment she appeared at the top of the aisle.\n\nAussie Sean D, 38, was saying I Do to a total stranger on Married At First Sight, a programme that sees total strangers meeting at the altar after being paired up for life by a team of scientists and psychologists.\n\n6 Sean D muttered \"oh s**t\" when he first locked eyes on his new bride Credit: Channel 9\n\nBut while single mum Jo, 39, was thrilled with her new hubby - later exclaiming \"Jackpot! I've won the lotto!\" - he had a face like thunder for the entire ceremony and the reception.\n\nThings even took a further dive when after kissing his new missus, he wiped her lipstick off his mouth and said \"gross\".\n\nSpeaking to The Fix, Sean shared the criteria he had given producers for his dream partner.\n\nHe said: \"Someone who’s funny. Someone’s who loyal. Someone who wants to have good fun. Having someone to go and have fun with and do different things and learn different things. And someone who's trustworthy.\"\n\n6 He was unable to hide his disappointment, although he was matched with someone who was 100% his type on paper Credit: Channel 9\n\n6 Jo was delighted to see her hunky new husband and said she felt like she had won the lottery Credit: Channel 9\n\nBut despite Jo ticking all the boxes, he simply didn't fancy her.\n\nSadly for Jo, she really did think she had struck gold with her mystery man.\n\nAt the wedding she said: \"He's got kind eyes. He seems genuine. I fancy him.\n\n\"This could work. My expectations have been met and then some. To infinity and beyond... Sean D and Jo sitting in a tree.\n\n6 Jo couldn't stop talking about how good looking her new man was Credit: Channel 9\n\n\"My expectations have been met, and then some. To infinity and beyond. Winning! Jackpot! I've won the lotto!\n\n\"The experts have been spot on! He is for me. He couldn't be any more perfect.\"\n\nBut Sean felt very differently, which made for awkward viewing for people at home.\n\nHe said, \"Um, she's probably not what I imagined, no.\n\n6 Later Sean looked despondently at the table as Jo stared at him adoringly Credit: Channel 9\n\n\"There's not like a massive spark straight away, but I'm sure she's feeling the same way.\"\n\nPeople tuned in at home were on the edge of their seats as the mismatched pair continued to totally misread one another's body language and reactions to each other.\n\nAll I really wanna watch is Jo & that sad sack Sean #MAFS — DeluxeStormBorn™ (@deluxe_tm) January 31, 2018\n\nHowever, Sean has since explained his frosty reaction to likeable Jo - it's all because of his exercise addict ex-girlfriend who he's still a bit hung up on.\n\nHe said that after she got addicted to exercise, their 10 year relationship ended and he was stuck caring for their plethora of pets including llamas and cats - and he is still traumatised and tired.\n\nSean said: \"We had a five-acre property together, and she ran out of time for me and the animals.\n\n6 Sean later described kissing his wife as \"gross\" Credit: Channel 9\n\n\"It was really hard because I had to take responsibility of the farm. I got all the animals. When we broke up, we had nine dogs, two alpacas, and two horses.\n\n\"It was difficult breaking up, it wasn't like either of us did anything wrong - there was no cheating or anything like that.\n\n\"She became a fitness freak but was just crazy. We slowly drifted apart and that was it, we were done.\"\n\nMost read in Fabulous KILLER DAD How 'Zodiac Killer' was snared decades after crimes by daughter's Google search Exclusive LESSONS IN LOVE I took on the porn industry by making female-friendly erotic movies TAKE A SWIPE Model shames sleazy blokes by exposing their pervy DMs NEVER FORGET Kiss left on window by girl who died suddenly preserved by forensic expert THESE LOOK GRATE McDonald’s fan shows how to make delicious cheese melt dippers at home LOCKDOWN LOVE From loo trouble to too much sex, how isolating with a new love can go wrong MYSTIC MEG April 19: Romance is a wild rollercoaster, from bliss to bickering & back again BUCKET LIST Mum shares easy ‘KFC’ chicken recipe and people can’t believe how good it looks TILE SAY! Mum praises 99p cleaner which completely transformed her dingy patio VIRUS FEARS Lydia Bright is a 'panicky' new mum who's on constant 'high alert' due to virus\n\nYou don't need to go Down Under to find a rocky marriage... this woman was divorced thirteen days after her wedding when she found out her husband was a paedophile.\n\nThis woman's sugar daddy turned out to be a serial con man.\n\nAnd we revealed how Posh Spice is livid about hubby David jetting off to Miami on business.", "images": ["https://www.thesun.co.uk/wp-content/uploads/2018/01/af-composite-wedding.jpg?strip=all&quality=100&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.8 1\"%3E%3C/svg%3E", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.9 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/01/af-composite-wedding.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Emma Gritt"], "canonical_link": "https://www.thesun.co.uk/fabulous/5472000/married-at-first-sight-sean-jo-disappointed/", "title": "Watch the moment a disappointed groom mutters ‘oh s**t’ as he sees his bride for the first time on Married At First Sight", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Man can't hide his horror as he sees his new wife on Married At First Sight", "url": "https://www.thesun.co.uk/fabulous/5472000/married-at-first-sight-sean-jo-disappointed/", "description": "A MAN marrying a stranger on a reality TV show was so disappointed by his new wife’s appearance that he muttered “oh s**t” the moment she appeared at the top of the aisle. Aussie …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/01/af-composite-wedding.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Sean later described kissing his wife as \"gross\""}, "locale": "en_GB"}, "article": {"published_time": "2018-01-31T22:27:49+00:00", "modified_time": "2018-02-01T15:11:26+00:00", "publisher": 161385360554578, "author": "https://www.facebook.com/Fabulous/"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "description": "AUSTRALIAN viewers were left cringing as Sean D muttered 'oh s**t' the moment he first laid eyes on his new wife... who he had been set-up with by a team of scientists and strangers.", "twitter": {"text": {"title": "Watch the moment a disappointed groom mutters ‘oh s**t’ as he sees his bride for the first time on Married At First Sight"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "BRIDE AND GLOOM", "headline": "Moment groom mutters 'oh s**t' as he sees bride for FIRST time on TV show", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/01/bride.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/01/bride.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 5472000, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1517437669.0, "source": "https://www.thesun.co.uk", "summary": ""}