{"url": "http://cbo.gov/publication/43471", "text": "CBO and the staff of the Joint Committee on Taxation (JCT) have estimated the direct spending and revenue effects of H.R. 6079, the Repeal of Obamacare Act, as passed by the House of Representatives on July 11, 2012. H.R. 6079 would repeal the Affordable Care Act (ACA), with the exception of one subsection that has no budgetary effect. This estimate reflects the spending and revenue projections in CBO’s March 2012 baseline as adjusted to take into account the effects of the recent Supreme Court decision regarding the ACA.\n\nFor various reasons discussed in the report, the estimated budgetary effects of repealing the ACA by enacting H.R. 6079 are close to, but not equivalent to, an estimate of the budgetary effects of the ACA with the signs reversed.\n\nWhat Is the Impact of Repealing the ACA on the Federal Budget?\n\nAssuming that H.R. 6079 is enacted near the beginning of fiscal year 2013, CBO and JCT estimate that, on balance, the direct spending and revenue effects of enacting that legislation would cause a net increase in federal budget deficits of $109 billion over the 2013–2022 period. Specifically, we estimate that H.R. 6079 would reduce direct spending by $890 billion and reduce revenues by $1 trillion between 2013 and 2022, thus adding $109 billion to federal budget deficits over that period.\n\nWhat Major Components Result in the Net Increase in Deficits?\n\nDeficits would be increased under H.R. 6079 because the net savings from eliminating the insurance coverage provisions would be more than offset by the combination of other spending increases and revenue reductions:\n\nThe ACA contains a set of provisions designed to expand health insurance coverage, which, on net, are projected to cost the government money. The costs of those coverage expansions—which include the cost of the subsidies to be provided through the exchanges, increased outlays for Medicaid and the Children’s Health Insurance Program (CHIP), and tax credits for certain small employers—will be partially offset by penalty payments from employers and uninsured individuals, revenues from the excise tax on high-premium insurance plans, and net savings from other coverage-related effects. By repealing those coverage provisions of the ACA, over the 2013–2022 period, H.R. 6079 would yield gross savings of an estimated $1,677 billion and net savings (after accounting for the offsets just mentioned) of $1,171 billion.\n\nThe ACA also includes a number of other provisions related to health care that are estimated to reduce net federal outlays (primarily for Medicare). By repealing those provisions, H.R. 6079 would increase other direct spending in the next decade by an estimated $711 billion.\n\nThe ACA includes a number of provisions that are estimated to increase federal revenues (apart from the effect of provisions related to insurance coverage), mostly by increasing the Hospital Insurance (HI) payroll tax and extending it to net investment income for high- income taxpayers, and imposing fees or excise taxes on certain manufacturers and insurers. Repealing those provisions would reduce revenues by an estimated $569 billion over the 2013–2022 period.\n\nWhat Would be the Effect of Repealing the ACA on Discretionary Spending?\n\nIn addition to those effects on direct spending and revenues, by CBO’s estimates, repeal of the ACA would reduce the need for appropriations to the Internal Revenue Service by between $5 billion and $10 billion over 10 years. Repealing the ACA would also reduce the need for appropriations to the Department of Health and Human Services by between $5 billion and $10 billion over 10 years, CBO estimates. Such savings might be reflected in reductions in total discretionary spending, or they might free up room for additional spending for other purposes under the caps on discretionary appropriations that were established by the Budget Control Act of 2011. H.R. 6079 would also repeal a number of authorizations for appropriations, which, if left in place, might or might not result in additional appropriations.\n\nWhy Are These Estimates Uncertain?\n\nProjections of the budgetary impact of H.R. 6079 are quite uncertain because they are based, in large part, on projections of the effects of the ACA, which are themselves highly uncertain. Assessing the effects of making broad changes in the nation’s health care and health insurance systems requires estimates of a broad array of technical, behavioral, and economic factors. Separating the incremental effects of the provisions in the ACA that affect spending for ongoing programs and revenue streams becomes more uncertain as the time since enactment grows. The recent Supreme Court decision that essentially made the expansion of the Medicaid program a state option has also increased the uncertainty of the estimates. However, CBO and JCT, in consultation with outside experts, have devoted a great deal of care and effort to the analysis of health care legislation in the past few years, and the agencies have strived to develop estimates that are in the middle of the distribution of possible outcomes.", "images": ["http://cbo.gov/themes/custom/cbo/images/social-icons/twitter-icon.png", "http://cbo.gov/themes/custom/cbo/images/search-icon.png", "http://cbo.gov/themes/custom/cbo/images/social-icons/slideshare-icon.png", "http://cbo.gov/themes/custom/cbo/apple-touch-icon.png", "http://cbo.gov/themes/custom/cbo/images/cbo_logo_white_desktop.png", "http://cbo.gov/themes/custom/cbo/images/social-icons/youtube-icon.png", "http://cbo.gov/themes/custom/cbo/images/social-icons/rss-icon.png"], "top_img": "http://cbo.gov/themes/custom/cbo/apple-touch-icon.png", "keywords": [], "authors": [], "canonical_link": "https://www.cbo.gov/publication/43471", "title": "Letter to the Honorable John Boehner providing an estimate for H.R. 6079, the Repeal of Obamacare Act", "meta_data": {"title": "Letter to the Honorable John Boehner providing an estimate for H.R. 6079, the Repeal of Obamacare Act | Congressional Budget Office", "description": "CBO and the staff of the Joint Committee on Taxation have estimated the direct spending and revenue effects of H.R. 6079, the Repeal of Obamacare Act, as passed by the House of Representatives on July 11, 2012.", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://cbo.gov", "summary": ""}