{"url": "www.rollingstone.com/music/music-news/taylor-swift-to-withhold-reputation-from-streaming-services-197389/", "text": "UPDATE: Taylor Swift unveiled the full track list for her new album Reputation on Instagram. The record will notably feature a collaboration with Ed Sheeran and Future titled, “End Game.” The album will also include previously released songs, “Look What You Made Me Do,” “Gorgeous,” “Call It What You Want” and “…Ready For It?” Swift served as executive producer on Reputation, while Jack Antonoff, Max Martin and Shellback also contributed production.\n\n***\n\nTaylor Swift‘s new album Reputation will not be available on streaming services upon its release November 10th, Bloomberg reports.\n\nThe record is expected to be withheld through its first week of sales, though Swift is reportedly still negotiating the specifics with various platforms. Despite its absence from streaming services, Reputation will still be available via digital retailers like iTunes.\n\nA representative for Swift did not immediately return Rolling Stone‘s request for comment.\n\nSwift has been one of the most vocal critics of streaming services, even temporarily pulling her music from all of them in 2014. Around the same time, Swift called streaming “a grand experiment” and said she was apprehensive about how fairly it compensated artists, producers and songwriters. In a Wall Street Journal op-ed, Swift wrote, “Music is art, and art is important and rare. Important, rare things are valuable. Valuable things should be paid for.”\n\nIn 2015, Swift began to soften her stance, first making 1989 available on Apple Music after Apple changed its policies on paying artists and musician’s royalties. However, it was only this past June that Swift re-released her entire back catalog on all streaming services, including Spotify.\n\nWhile streaming continues to grow as the dominate form of music consumption, some high-profile artists have continued to shun the platforms – at least temporarily – to chase physical and digital sales. Most notably, Adele’s 2015 album 25 was unavailable on streaming platforms for months, yet still sold a record-breaking 3.38 million copies in its first week. Swift’s decision to withhold 1989 from streaming services didn’t hurt its sales either, as it finished in the top three in global sales for 2014 and 2015.\n\nReputation Track List\n\n1. “…Ready For It?”\n\n2. “End Game” (ft. Ed Sheeran and Future)\n\n3. “I Did Something Bad”\n\n4. “Don’t Blame Me”\n\n5. “Delicate”\n\n6. “Look What You Made Me Do”\n\n7. “So It Goes…”\n\n8. “Gorgeous”\n\n9. “Getaway Car”\n\n10. “King of My Heart”\n\n11. “Dancing With Our Hands Tied”\n\n12. “Dress”\n\n13. “This Is Why We Can’t Have Nice Things”\n\n14. “Call It What You Want”\n\n15. “New Year’s Day”", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Ftaylor-swift-to-withhold-reputation-from-streaming-services-197389%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=197389", "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-487502918-61b3ec20-ca8e-4907-a6b4-1334df8b9b25.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-487502918-61b3ec20-ca8e-4907-a6b4-1334df8b9b25.jpg", "keywords": [], "authors": ["Jon Blistein", "Jon Blistein'S Most Recent Stories", "Johnny Marr Teaches Viewers How To Play The Smiths", "The Headmaster Ritual", "Adeline Ruminates On A Lost Love With New Song", "Twilight", "Michael Mcdonald Offers Self-Isolation Balm With", "On My Own", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-news/taylor-swift-to-withhold-reputation-from-streaming-services-197389/", "title": "Taylor Swift to Withhold ‘Reputation’ From Streaming Services", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Taylor Swift will reportedly keep her new album 'Reputation' off streaming services for at least one week.", "news_keywords": "music streaming, Taylor Swift", "og": {"type": "article", "title": "Taylor Swift to Withhold 'Reputation' From Streaming Services", "url": "https://www.rollingstone.com/music/music-news/taylor-swift-to-withhold-reputation-from-streaming-services-197389/", "description": "Pop star also shares track list for highly-anticipated new album", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-487502918-61b3ec20-ca8e-4907-a6b4-1334df8b9b25.jpg", "width": 1024, "height": 1162, "alt": "Taylor Swift"}, "locale": "en_US"}, "article": {"published_time": "2017-11-08T01:02:00+00:00", "modified_time": "2018-06-25T12:53:23+00:00"}, "twitter": {"text": {"title": "Taylor Swift to Withhold 'Reputation' From Streaming Services"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-487502918-61b3ec20-ca8e-4907-a6b4-1334df8b9b25.jpg?w=902", "alt": "Taylor Swift"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Taylor Swift to Withhold ‘Reputation’ From Streaming Services", "description": "Taylor Swift will reportedly keep her new album 'Reputation' off streaming services for at least one week."}, "generator": "WordPress 5.4", "author": "Jon Blistein", "content_type": "Article", "post_id": 197389, "title": "Taylor Swift to Withhold 'Reputation' From Streaming Services", "published_at": "2017-11-08 01:02:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-487502918-61b3ec20-ca8e-4907-a6b4-1334df8b9b25.jpg?w=1024", "comment_count": 0, "tags": "Taylor Swift", "topics": "Music News", "body": "UPDATE: Taylor Swift unveiled the full track list for her new album Reputation on Instagram. The record will notably feature a collaboration with Ed Sheeran and Future titled, \"End Game.\" The album will also include previously released songs, \"Look What You Made Me Do,\" \"Gorgeous,\" \"Call It What You Want\" and \"…Ready For It?\" Swift served as executive producer on Reputation, while Jack Antonoff, Max Martin and Shellback also contributed production.***Taylor Swift's new album Reputation will not be available on streaming services upon its release November 10th, Bloomberg reports.The record is expected to be withheld through its first week of sales, though Swift is reportedly still negotiating the specifics with various platforms. Despite its absence from streaming services, Reputation will still be available via digital retailers like iTunes. A representative for Swift did not immediately return Rolling Stone's request for comment. Swift has been one of the most vocal critics of streaming services, even temporarily pulling her music from all of them in 2014. Around the same time, Swift called streaming \"a grand experiment\" and said she was apprehensive about how fairly it compensated artists, producers and songwriters. In a Wall Street Journal op-ed, Swift wrote, \"Music is art, and art is important and rare. Important, rare things are valuable. Valuable things should be paid for.\"In 2015, Swift began to soften her stance, first making 1989 available on Apple Music after Apple changed its policies on paying artists and musician's royalties. However, it was only this past June that Swift re-released her entire back catalog on all streaming services, including Spotify.While streaming continues to grow as the dominate form of music consumption, some high-profile artists have continued to shun the platforms – at least temporarily – to chase physical and digital sales. Most notably, Adele's 2015 album 25 was unavailable on streaming platforms for months, yet still sold a record-breaking 3.38 million copies in its first week. Swift's decision to withhold 1989 from streaming services didn't hurt its sales either, as it finished in the top three in global sales for 2014 and 2015.Reputation Track List1. \"…Ready For It?\"2. \"End Game\" (ft. Ed Sheeran and Future)3. \"I Did Something Bad\"4. \"Don’t Blame Me\"5. \"Delicate\"6. \"Look What You Made Me Do\"7. \"So It Goes…\"8. \"Gorgeous\"9. \"Getaway Car\"10. \"King of My Heart\"11. \"Dancing With Our Hands Tied\"12. \"Dress\"13. \"This Is Why We Can't Have Nice Things\"14. \"Call It What You Want\"15. \"New Year's Day\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1510102920.0, "source": "http://www.rollingstone.com", "summary": ""}