{"url": "https://people.com/archive/kim-kardashian-gets-in-the-best-shape-of-her-life-vol-72-no-12/", "text": "Image zoom\n\nStepping into the crystal clear waters of the Bahamas for this recent shoot, Kim Kardashian actually panicked for a moment. “Suddenly I thought, ‘Everyone is staring at me in this bikini,'” she recalls. Of course, it’s hard not to look at the sight of Kim—and her famously curvaceous figure—in little more than a few strips of Lycra. But being the reality star she is, she soon shrugged it off. “I realized I felt good. I wasn’t as insecure as I’ve always been,” she says. “I’m comfortable in my own skin.”\n\nBelieve it or not, arriving at this bikini photo op has taken a long time for Kardashian, 28. The second of four children, she recalls bypassing her older sister Kourtney on the puberty fast lane, developing “huge boobs and a butt” by age 11. In 2006 she found fame as Paris Hilton‘s BFF and Nick Lachey‘s blink-and-you-missed-it love interest. But the spotlight brought a harsh glare: She quickly earned the nickname The Tush from bloggers who scrutinized her weight. “I wasn’t heavy, but I was being criticized left and right,” she says now. “It really brought me down.”\n\nGet push notifications with news, features and more.\n\nAs Kim’s stardom grew, thanks in part to the hit E! reality series Keeping Up with the Kardashians, her confidence sagged. Despite a shape most women would kill for—with 128 lbs. on her 5’3″ frame, she was a size 6, she says—Kim wouldn’t walk on the beach without a cover-up. “I’m most self-conscious about my thighs,” she says. “Everyone talks about this great butt I had, but I was so unhappy about it.”\n\nEach year she’d vow, “I will have my perfect body by summer,” but gave up by Memorial Day. Then she opted to be more realistic. “I wanted to be comfortable, fit and toned,” she says. “I don’t want to wear Spanx all the time.”\n\nSo, after “countless” failed attempts at her dream body, Kardashian began daily hour-long workouts in late 2008 and now enlists celebrity trainer Gunnar Peterson (see sidebar). “I’d always work out a day or two but lose motivation,” she says. “I finally realized you have to be consistent. I needed a workout buddy or a trainer to meet.”\n\nShe also began using QuickTrim, a dietary supplement and cleanser that she and younger sister Khloé just launched with GNC. “I needed something to kick loose those last 5 or 10 lbs.,” she says. Recently she reached a trim 113 lbs. and now is a size 2. “It didn’t happen overnight,” she says, “but it’s finally all clicked.”\n\nKim also tackled her lifelong love affair with junk food. Instead of eating burgers and fries, she sticks to salads and grilled chicken and limits sweets. “I can’t lose focus,” she says. “I’ve worked so hard to get here.”\n\nStill, she says she’s a work in progress. “I love my curves, but let’s be honest: Cellulite isn’t cute. Would I rather not have any? Of course! But I’m proud of my body,” she says. “If there is something you’re not happy about, you can’t just sit there. You have to put all your effort into fixing it.”\n\nSuch a proactive approach has gotten Kardashian through her public love life. Her marriage of more than three years to music producer Damon Thomas ended in 2003; a few years later a private sex tape she made with R&B singer Ray J, her then-boyfriend, leaked onto the Internet. “No one should be judged by one mistake,” she says. “It’s how you handle yourself after the mistake. You have to learn from things.” And in July she ended her two-year relationship with NFL running back Reggie Bush, 24. “That was really hard,” Kim says. “We both have a lot of love and respect for each other,” hinting that the door might still be open down the line for a reconciliation (in fact, the two were spotted spending time together last month in New Orleans, though they remain split for now). “Sometimes people need a break to put things in perspective. Everything was amicable; it just wasn’t working right now. But you never know what will happen.”\n\nThough boyfriendless at the moment, Kardashian doesn’t long for company. Her close-knit clan—sisters Kourtney, 30 (who recently announced that she is having a baby with boyfriend Scott Disick, 26, around Christmas [”I’m so excited to be an auntie,” says Kim. “I will spoil this baby so much”]), and Khloé, 25, brother Robert, 22, mom Kris Jenner, 53, stepfather Bruce Jenner, 59, and half sisters Kylie, 12, and Kendall, 13—is never far away and always in touch. “As many things as I’ve been through, my family has made my life what it is,” says Kim, who also credits her father, Robert Kardashian (the famed O.J. Simpson attorney who died of cancer in 2003) with teaching her to believe in herself. “His decision to stick up for his friends when everyone told him not to taught me to do what you believe in,” she says.\n\nHaving been raised with such a strong sense of family, she definitely wants one of her own someday. “I want to be married and have four kids. But right now life is moving very fast.” So fast, she barely has time to soak up the sun in the bikini body she worked so hard to flaunt. “I finally feel like I’m in the best shape of my life,” she says. “This is who I am. And I’m loving it!”\n\nFOR THE LATEST ON KIM, GO TO PEOPLE.COM/KIM_KARDASHIAN", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2009%2F09%2F20090921_98-99.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2065'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2009%2F09%2F20090921_98-99.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2009%2F09%2F20090921_98-99.jpg", "keywords": [], "authors": ["Jennifer Garcia"], "canonical_link": "https://people.com/archive/kim-kardashian-gets-in-the-best-shape-of-her-life-vol-72-no-12/", "title": "Kim Kardashian Gets in the Best Shape of Her Life", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Kim Kardashian,Nick Lachey,Paris Hilton", "news_keywords": "Kim Kardashian,Nick Lachey,Paris Hilton", "description": "After years of insecurities, Kim Kardashian proclaims, \"I'm proud of my curves,\" and reveals how she got that body!", "og": {"title": "Kim Kardashian Gets in the Best Shape of Her Life", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/archive/kim-kardashian-gets-in-the-best-shape-of-her-life-vol-72-no-12/", "description": "Stepping into the crystal clear waters of the Bahamas for this recent shoot, Kim Kardashian actually panicked for a moment. “Suddenly I thought, ‘Everyone is&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2009%2F09%2F20090921_98-99.jpg", "width": 300, "height": 157}}, "pinterest": {"url": "https://people.com/archive/kim-kardashian-gets-in-the-best-shape-of-her-life-vol-72-no-12/", "description": "After years of insecurities, Kim Kardashian proclaims, \"I'm proud of my curves,\" and reveals how she got that body!", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2009%2F09%2F20090921_98-99.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/archive/kim-kardashian-gets-in-the-best-shape-of-her-life-vol-72-no-12/", "title": "Kim Kardashian Gets in the Best Shape of Her Life", "description": "After years of insecurities, Kim Kardashian proclaims, \"I'm proud of my curves,\" and reveals how she got that body!", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2009%2F09%2F20090921_98-99.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}