{"url": "www.inquisitr.com/4521074/are-ryan-seacrest-and-girlfriend-shayna-taylor-on-the-verge-of-a-split-or-an-engagement/", "text": "Ryan Seacrest often references his girlfriend, Shayna Taylor, on Live! with Kelly and Ryan, but is the couple on the verge of a split?\n\nAs Ryan Seacrest, 42, continues to joke about his future life as a married man on his morning show with Kelly Ripa, an insider claims that things between the television host and Shayna Taylor, 26, may have taken a turn for the worse just months after they relocated to New York City from Los Angeles.\n\nOn September 27, Radar Online shared a report with readers, claiming that Ryan Seacrest’s wild life in the Big Apple may be causing a divide in his relationship.\n\nWhile Ryan Seacrest and Shayna Taylor were seen frequently on the streets of New York City after their move from the west coast, Radar Online claims that Taylor isn’t currently living with her boyfriend full-time. Instead, the outlet suggested that Taylor was spending the majority of the time in Los Angeles, where she was recently seen enjoying time with her girlfriends.\n\nAccording to an insider, Ryan Seacrest sprung the move to New York City on Shayna Taylor and while she may have been on board with the relocation at first, she opted to keep her home in Los Angeles as he adjusts to life on the east coast.\n\nA post shared by Shayna Terese Taylor (@shaynateresetaylor) on Aug 27, 2017 at 12:05pm PDT\n\nRadar Online‘s source continued on, claiming that Shayna Taylor is insisting on spending the majority of her time in Los Angeles while Ryan Seacrest has been making frequent visits to the area.\n\nAlthough the report suggested that Ryan Seacrest and Shayna Taylor may be on the brink of a split, other reports have suggested that they could soon get engaged. That said, Seacrest recently joked on Life! with Ryan and Kelly that he wouldn’t be sporting a wedding band for another 15 years.\n\nRyan Seacrest and Shayna Taylor reconciled their relationship earlier this year ahead of Seacrest’s move to New York City after initially dating several years ago. However, when it comes to their future plans and an engagement, Seacrest hasn’t been clear with his intentions. Instead, he seems to be playing his relationship by ear as he juggles his busy career.\n\n[Featured Image by John Sciulli/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/09/ryan-seacrest-girlfriend-split-rumors.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/4521074/are-ryan-seacrest-and-girlfriend-shayna-taylor-on-the-verge-of-a-split-or-an-engagement/", "title": "Are Ryan Seacrest And Girlfriend Shayna Taylor On The Verge Of A Split, Or An Engagement?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}