{"url": "https://en.wikipedia.org/wiki/Farrah_Abraham", "text": "Farrah Abraham (born May 31, 1991) is an American reality television personality, singer, and writer. Born in Omaha, Nebraska, and raised in Council Bluffs, Iowa, she received public attention after being cast in the reality television series 16 and Pregnant in 2009, which documented the pregnancies and first months of motherhood for several young women. Later that year, she was cast in the spin-off series Teen Mom, and appeared in each of its four seasons until its conclusion in 2012. That August, she released her debut studio album and first memoir, both of which were titled My Teenage Dream Ended. The book made it onto The New York Times bestseller list.[1]\n\nEarly life\n\nFarrah Abraham was born on May 31, 1991, in Omaha, Nebraska and raised in Council Bluffs, Iowa.[2][3] Her father, Michael Abraham, is of Syrian and Italian descent. Her mother, Debra Danielsen, is of Danish and Sicilian ancestry.[4][5][6] Her parents separated and divorced; through her mother's marriage in 2017, Abraham has a stepfather.[7]\n\nCareer\n\n16 and Pregnant and Teen Mom\n\nIn 2008, Abraham, then 17, was selected to appear on the MTV show, 16 and Pregnant, a reality series that aimed to document the lives of pregnant teenagers across the United States.[8][9] News of her pregnancy caused issues between her and her mother, Debra Danielsen, with Danielsen calling her daughter a whore and preventing her from obtaining an abortion; being pregnant, Abraham was forced to discontinue her cheerleading.[10][8] Furthermore, during filming, Derek Underwood, the father of her child, died in a car accident.[11] Abraham gave birth to the couple's child, a daughter named Sophia Laurent Abraham, on February 23, 2009.[12][13] Abraham's episode of 16 and Pregnant aired in 2009.\n\nLater that year she was cast in the spin-off series Teen Mom; it followed Abraham, in addition to Maci Bookout, Catelynn Lowell and Amber Portwood, who also appeared on episodes of 16 and Pregnant, during their first years of motherhood.[14] The series premiere was broadcast on December 8, 2009.[15] In 2011 she began attending the Art Institute of Fort Lauderdale in Florida, where she got an associate degree in culinary arts and management. She later launched the \"Mom & Me\" pasta sauce line.[16]\n\nOn August 1, 2012, Abraham ventured into the music industry with the release of her debut studio album My Teenage Dream Ended.[17] It received overwhelmingly negative reviews from contemporary music critics.[18] Abraham released a memoir by the same title on August 14.[19] After airing four seasons, the series finale of Teen Mom aired on August 29, 2012.[20]\n\nIn January 2014, Abraham was cast for the fourth season of Couples Therapy. However, Brian Dawe claimed that he was hired by Abraham to appear as her on-screen boyfriend and ultimately did not appear on the program alongside her.[21] Abraham consequently became the only cast member in series history to continue therapy without a partner, and was refocused on repairing her relationship with her mother.[22]\n\nWith her previous allegations of rape placing a strain on her partnership with Vivid Entertainment, a press release announcing her second sex tape Farrah 2: Backdoor and More in February stated \"it's no 'fake' 'leak'—it's the real, raw, ridiculous deal, and it suits Farrah's underhanded personality herself.\"[23] Farrah reportedly earned 1 million dollars after selling her sex tape with James Deen.[24] Later that month, Abraham appeared in the TV special Being Farrah, which acted as a continuation of Teen Mom; Bookout, Lowell, and Portwood were respectively featured in the specials Being Maci, Being Catelynn, and Being Amber.[25] Their successes prompted MTV to consider reviving the series without Abraham, who the other women were concerned was an inappropriate influence on their children.[26]\n\nIn March, Abraham returned to the music industry with the release of the song \"Blowin'\" and the simultaneous premiere of its accompanying music video. She stated that she treats music as a \"hobby, not my career move.\"[27] In August of that year she signed a contract with Palazio's Gentleman's Club in Austin, Texas, for $544,000 to have a residency there until New Year's Eve.[28]\n\nBig Brother\n\nIn 2015, Abraham appeared on the sixteenth season of the British television series Celebrity Big Brother, representing the United States. On September 18, she became the fifth housemate to be evicted. She was not in the top four highest-voted housemates, and her fellow housemate, Austin Armacost, chose to evict her. She had spent 23 days in the house.[29]\n\nOn 22 September 2015, she appeared as a panelist on the Celebrity Big Brother's Bit on the Side after-show and got into a heated argument with fellow panelist, Aisleyne Horgan-Wallace. The show was taken off air 10 minutes early after a \"clash\" between panelists. Abraham and Janice Dickinson were given police cautions.[30]\n\nFilmography\n\nDiscography\n\nAlbum\n\nSingle\n\nPublished works\n\nMy Teenage Dream Ended (2012)\n\n(2012) Passy Perfume (2012)\n\n(2012) Celebrity Sex Tape: In The Making (2014)\n\n(2014) Celebrity Sex Tape: The Secret's Out (2014)\n\n(2014) Celebrity Sex Tape: Love Through Limelight (2015)", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Farrah_Abraham.jpg/220px-Farrah_Abraham.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/0/0e/Farrah_Abraham.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Farrah_Abraham.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Farrah_Abraham", "title": "Farrah Abraham", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Farrah_Abraham.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}